[
 [
  [
   89267, 
   null, 
   "jim's trucking", 
   "...the content of GWB's SOTU address tonight?\n \n If that too hard a question, how about...what color outfit will Cynthia McKinney be wearing as she perches at an aisle seat?", 
   {
    "post_info": {
     "post_title": "Anyone care to predict..."
    }
   }, 
   null, 
   null, 
   1107379920.0
  ], 
  [
   89278, 
   null, 
   "jyoshu", 
   "...the content of GWB's SOTU address tonight?\n \n If that too hard a question, how about...what color outfit will Cynthia McKinney be wearing as she perches at an aisle seat?\n\n \n Heavy emphasis on SS, some on foreign policy. The foreign policy will trumpet the elections as a victory (and it is).", 
   {}, 
   89267, 
   null, 
   1107382800.0
  ], 
  [
   89308, 
   null, 
   "Anastasia", 
   "vague references to a timetable for withdrawal from Iraq?", 
   {}, 
   89278, 
   null, 
   1107387300.0
  ], 
  [
   89323, 
   null, 
   "Dono", 
   "I can only guess what he will say, but I'm sure his speech writers have worked diligently. Hopefully, since oratory is not his strong suit, he will get it out without a major flub (I read today that he has been practicing). Since both houses are controlled by Republicans, there will be standing ovations after every forth or fifth sentence, while most of the Democrats will pat their hands politely. After the speech, Republican pundits will declare it masterful and a Democratic spoke person(s) will complain of questions unanswered.... business as usual. If we could only burn rhetoric, Washington could supply all our energy needs.\n Dono", 
   {}, 
   89308, 
   null, 
   1107389940.0
  ], 
  [
   89340, 
   null, 
   "jyoshu", 
   "Bush may not be an oratorian, but he has had some powerful moments speech-wise. I still think that the 1st State of the Union speech after 9/11 was one of the most powerful and well-delivered speeches I've ever heard.", 
   {}, 
   89323, 
   null, 
   1107392220.0
  ], 
  [
   89354, 
   null, 
   "jskufan", 
   "He'll talk more about freedom and democracy as it pertains to other countries. When he discusses Social Security reform, tort reform, and tax reform, he'll be evasive since he has no workable plan on accomplishing any of those election promises. He'll talk about the wonderful job we've done in Iraq but won't offer any concrete plan for withdrawal. Lastly, he'll bask in the endless cheering and mindless applause of his Republican audience. In other words, I doubt anyone will be any better informed tomorrow morning.", 
   {}, 
   89340, 
   null, 
   1107394620.0
  ], 
  [
   89386, 
   null, 
   "Dzeron", 
   "He'll ramble about how he wants to take freedom from America and give it away to other countries. That's my prediction.", 
   {}, 
   89354, 
   null, 
   1107402660.0
  ], 
  [
   89388, 
   null, 
   "Dono", 
   "Bush may not be an oratorian, but he has had some powerful moments speech-wise. I still think that the 1st State of the Union speech after 9/11 was one of the most powerful and well-delivered speeches I've ever heard.\n\n I recall 2001, when he said the country could afford a $1.6 trillion tax cut over 10 years and still improve schools, health care, the environment and national defense. He also said the country could repay a large portion of the national debt and emphasized a projected budget surplus of $5.6 trillion over the coming decade. He will never find work as a fortune teller.\n In the speech you mention, the President said, \"Whatever it takes to defend our country, we will pay\". We all still agree with the statement, but to many of us, that does not include invasions and nation building with the resultant needless loss of life and treasure.\n Dono", 
   {}, 
   89340, 
   null, 
   1107402900.0
  ], 
  [
   89390, 
   null, 
   "georged", 
   "SOTU speeches, make that most all political speeches, are intended to appease the masses regardless of political affiliation. That's accomplished by lots of self-pats on the back, reassurance that all policy is to benefit the citizenry and the world and better times are in the future. It's sad the public has nothing better to do than listen to politicians, but we're obviously not known as an intellectual nation. At least Lyndon and some of the older, better thieves were somewhat entertaining. This one has, among other faults, speech problems. That's real encouraging in a national leader. It's sad the public has nothing better to do than listen to politicians in trouble, but we're obviously not known as the intellectual nation. Since their favorite programs are preempted, they'll do their duty and listen to it instead of taking five minutes to digest it about two hours after it happens, or the next morning. When their emotion of being addressed by their leader won't be overcoming rational thought. Some can do both at the same time, but there are inadequate numbers of true, practicing Republicans to make that a definitive factor.\n \n That aside, I agree with jskufan's comments.", 
   {}, 
   89354, 
   null, 
   1107403260.0
  ], 
  [
   89394, 
   null, 
   "daewoo", 
   "He'll talk more about freedom and democracy as it pertains to other countries. When he discusses Social Security reform, tort reform, and tax reform, he'll be evasive since he has no workable plan on accomplishing any of those election promises. He'll talk about the wonderful job we've done in Iraq but won't offer any concrete plan for withdrawal. Lastly, he'll bask in the endless cheering and mindless applause of his Republican audience. In other words, I doubt anyone will be any better informed tomorrow morning.\n\n \n \n YOU WIN. My god, its like you had a pre-release copy of his speech.\n \n You did miss the part where they flew an Iraqi in to sit next to laura, and brought in a dead soldier parents. \n \n If you had just added \"Several minutes of shameless, staged propoganda\", you would have been batting 1000!", 
   {}, 
   89354, 
   null, 
   1107407700.0
  ], 
  [
   89397, 
   null, 
   "Dono", 
   "Well, I have watched another SOTU speech. This one I would divide into three parts. The first third, up to immigration, was bipartisan and phrased in such a way that few would disagree with. The middle was immigration and Social Security with a short tutorial which brought out a few boos and left much unsaid. The last portion was an Iraq pep rally. And the state of the Union is ?\n Dono", 
   {}, 
   89394, 
   null, 
   1107412620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Anyone care to predict...", 
  "url": "http://www.4forums.com/political/politics-debates/4214-anyone-care-predict.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4214, 
  "discussion_files": [
   [
    "19962.html", 
    "http://www.4forums.com/political/politics-debates/4214-anyone-care-predict-print.html"
   ]
  ], 
  "identifier": 4214
 }
]