[
 [
  [
   89484, 
   null, 
   "greg 79 f150", 
   "Its that time of year again. We just recieved notice the CPA that has done our taxes the last 8 years , has moved out of state. Our tax plan should be easy, one head of househould, one income, just the usual interest deductions. Would the \"do it yourself tax\" software like Quicken Turbo Tax, be a safe way to go ? Our CPA charged us $285.00 last year for doing our taxes, can we not do this on our own , using tax software, without ending up in prison for tax screwups ?? Are the odds better for getting hit with a audit, because a person uses tax software ?", 
   {
    "post_info": {
     "post_title": "D.I.Y  tax software"
    }
   }, 
   null, 
   null, 
   1107455820.0
  ], 
  [
   89492, 
   null, 
   "daewoo", 
   "If that is all you have, it should not be a problem. Returns using tax preperation software are less likely to be hit by an autdit for the simple fact that the software does the calculations for you and it is difficult to get too....shall we say.....creative with it.\n \n The IRS has a list of online tax programs at:\n \n http://www.irs.gov/app/freeFile/jsp/index.jsp?\n \n They are free if you make under a certain amount (some it is 24,000.00, some it is 100,000.00). I think that most of them run about $30 if you do not qualify for the free deal.", 
   {}, 
   89484, 
   null, 
   1107456720.0
  ], 
  [
   89512, 
   null, 
   "Waxy", 
   "Its that time of year again. We just recieved notice the CPA that has done our taxes the last 8 years , has moved out of state. Our tax plan should be easy, one head of househould, one income, just the usual interest deductions. Would the \"do it yourself tax\" software like Quicken Turbo Tax, be a safe way to go ? Our CPA charged us $285.00 last year for doing our taxes, can we not do this on our own , using tax software, without ending up in prison for tax screwups ?? Are the odds better for getting hit with a audit, because a person uses tax software ?\n\n \n I used one last year, I think it was Quicken actually.\n \n They work really well if your tax situation is simple. I think you'd probably have really good success with them. \n \n I think you're less likely to be audited using one of the software programs because they are simple, accurate, and like Daewoo said, don't have a lot of \"wiggle room\".\n \n Their downfall comes when your tax situation gets complicated - multiple incomes, investments, stock options, etc...\n \n My only other concern is that I'm maximizing my return, I don't always trust that the software programs are getting me every last dollar, though I think they are pretty thorough.\n \n If you have a really good accountant, they can pretty much pay for their services by maximizing your return - again - given that there your taxes are sufficiently complex. I'll be in the market for an accountant this year, as my tax situation has become too complex for me to tackle on my own. They're hard to find.\n \n Anyhoo,\n \n Short answer - if I was you I'd go for it. Worst case scenario you spent $20 on the software and then decide not to use it.\n \n Waxy", 
   {}, 
   89484, 
   null, 
   1107460140.0
  ], 
  [
   89523, 
   null, 
   "georged", 
   "Its that time of year again. We just recieved notice the CPA that has done our taxes the last 8 years , has moved out of state. Our tax plan should be easy, one head of househould, one income, just the usual interest deductions. Would the \"do it yourself tax\" software like Quicken Turbo Tax, be a safe way to go ? Our CPA charged us $285.00 last year for doing our taxes, can we not do this on our own , using tax software, without ending up in prison for tax screwups ?? Are the odds better for getting hit with a audit, because a person uses tax software ?\n\n \n All you need is the abilities to read and use a keyboard. You'll grow to love it. Absolutely no tax, bookkeeping or financial knowledge required.", 
   {}, 
   89484, 
   null, 
   1107462180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  D.I.Y  tax software", 
  "url": "http://www.4forums.com/political/tax-debates/4224-d-i-y-tax-software.html", 
  "breadcrumbs": [
   "Tax"
  ], 
  "id_number": 4224, 
  "discussion_files": [
   [
    "11916.html", 
    "http://www.4forums.com/political/tax-debates/4224-d-i-y-tax-software-print.html"
   ]
  ], 
  "identifier": 4224
 }
]