[
 [
  [
   89654, 
   null, 
   "zachvac", 
   "Many creationists use the excuse that the probability of evolution is so small. Everything had to be perfect. But I say things could have been different, just we would have been different. Think of it this way:\n \n I am a very complex person. I am a unique person, does everyone agree with that?\n \n No one will be identical to me in the next billion years, and there has never been another person like me. Again I'm assuming everyone agrees with me there.\n \n Now think of the probability of me being born. Even if you know the mother and father, what do you think the probability of me typing these exact words are? Since at birth the probability of me picking the screen name zachvac, finding this site, and posting this exact message, was about 0. Can we now conclude that I'm not typing this and I don't exist? Of course not.\n \n In terms of evolution we don't know how many other planets there are out there, and there would have been many possibilities of the stuff going together in a way to support life on at least one planet. We could also say there are thousands of different species, so the probability of one of us being born a human is over 1:1000. Then take into account how many years there have been. The probability of us being alive in the year 2005 and being humans puts us at least to 1:1000000. Then we have to be rich enough to buy a computer and resourceful enough to find this site. So I can logically conclude that no living being finds this site because the evidence is too low.\n \n Obviously you will refute this argument by saying we have observed the fact that we are humans and typing right here. That would be the first part of science. In order for something to become a theory someone has to make an observation. They then put it through the scientific method and if one person can produce evidence to the contrary the theory is thrown out or revised. Yes it's improbable, but evolution has been tested and verified just as much as me being here today typing.", 
   {
    "post_info": {
     "post_title": "The probability argument"
    }
   }, 
   null, 
   null, 
   1107490920.0
  ], 
  [
   89656, 
   null, 
   "trebor", 
   "Many creationists use the excuse that the probability of evolution is so small. Everything had to be perfect. But I say things could have been different, just we would have been different. Think of it this way:\n \n I am a very complex person. I am a unique person, does everyone agree with that?\n \n No one will be identical to me in the next billion years, and there has never been another person like me. Again I'm assuming everyone agrees with me there.\n \n Now think of the probability of me being born. Even if you know the mother and father, what do you think the probability of me typing these exact words are? Since at birth the probability of me picking the screen name zachvac, finding this site, and posting this exact message, was about 0. Can we now conclude that I'm not typing this and I don't exist? Of course not.\n \n In terms of evolution we don't know how many other planets there are out there, and there would have been many possibilities of the stuff going together in a way to support life on at least one planet. We could also say there are thousands of different species, so the probability of one of us being born a human is over 1:1000. Then take into account how many years there have been. The probability of us being alive in the year 2005 and being humans puts us at least to 1:1000000. Then we have to be rich enough to buy a computer and resourceful enough to find this site. So I can logically conclude that no living being finds this site because the evidence is too low.\n \n Obviously you will refute this argument by saying we have observed the fact that we are humans and typing right here. That would be the first part of science. In order for something to become a theory someone has to make an observation. They then put it through the scientific method and if one person can produce evidence to the contrary the theory is thrown out or revised. Yes it's improbable, but evolution has been tested and verified just as much as me being here today typing.\n\n \n \n There are several major flaws in the probablity arguement. One major flaw is that it assumes everything happened all at once, and take it from there. Life\n developed on little bit at a time. Another assumption is that it developed entirely at random. This is untrue, since natural selection is at work, which\n 'filters' the results.", 
   {}, 
   89654, 
   null, 
   1107491760.0
  ], 
  [
   89860, 
   null, 
   "pnac=ww3", 
   "There are several major flaws in the probablity arguement. One major flaw is that it assumes everything happened all at once, and take it from there. Life\n developed on little bit at a time. Another assumption is that it developed entirely at random. This is untrue, since natural selection is at work, which\n 'filters' the results.\n\n \n Not only that, but the probability arguers totally neglect all the very non-random laws of physics and chemistry. Yet another \"filter\", if you will.", 
   {}, 
   89656, 
   null, 
   1107572820.0
  ], 
  [
   89876, 
   null, 
   "Choscura", 
   "you neglected to adress the probability of our caring or believing you on any point past the probability of you typing those words. but you have a good point, and one that i've made before- no matter how low the odds are that our planet could exist anywhere as we know it, the odds were still good enough to happen many times over in out univers- if not directly in our galaxy. its fun to see the look on some dumb creationists face when he considers that maybe- just maybe- the odds that we're on a planet the correct distance from the sun (for our existance) is only true because we've evolved to live on a planet that distance from the sun? maybe if we were a little bit closer- say, a million miles- we'd be frog people, because the water wouldn't be able to freeze and there would be more of it, causing us to be amphibuous? or if it were further away, how we'd all be yetis or some similar warm blooded low-tempature animal? do they ever stop to THINK of that? no! why not? because jesus told them otherwise. bah!", 
   {}, 
   89860, 
   null, 
   1107577800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The probability argument", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4227-probability-argument.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 4227, 
  "discussion_files": [
   [
    "12168.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4227-probability-argument-print.html"
   ]
  ], 
  "identifier": 4227
 }
]