[
 [
  [
   89986, 
   null, 
   "HeavenBound", 
   "#1 - How are we now able to observe evolution, when the evolution of the world supposely took billions of years?\n \n #2 - Can anyone prove to me without a doubt abiogenesis is the way life began, even though no one was there to observe it?\n \n #3 - Can anyone explain to me why no other apes, monkeys or chimps have evolved into a new (i.e. human) species?\n \n #4 - How do we know without a doubt the world is billions of years old?\n \n Please NO Crackpots serious responders ONLY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", 
   {
    "post_info": {
     "post_title": "Evo What???????"
    }
   }, 
   null, 
   null, 
   1107674580.0
  ], 
  [
   89988, 
   null, 
   "Tigerlilly", 
   "#1 - How are we now able to observe evolution, when the evolution of the world supposely took billions of years?\n\n \n Not all evolution takes place over billions of years. There has been speciation that we have actually seen occuring within a few years at a time. \"bacteria, birds etcs.\"\n \n Natural selection occures frequently. You can \"observe\" evolution through the fossile record, DNA, morphology etcs.\n \n Evolution has made predictions, these predictions have come true, ergo, it's good.\n \n \n \n\n #2 - Can anyone prove to me without a doubt evolution is the way life began, even though no one was there to observe it?\n\n \n Can you prove to me without  any  doubt that I am talking to you. I could really be your imagination talking to you, answering your own question in some weird, perverse way. I am merely an illusion, your sub-conscious.\n \n Point being: asking for 100% proof or you don't buy it is sophistry--very close to solipsism, in fact, and was discredited as a theory of epistemology many thousands of years ago.\n \n \n\n #3 - Can anyone explain to me why no other apes, monkeys or chimps have evolved into a higher species?\n\n \n 1. From what I have learned, different locations breed different surroundings. Human ancestors were migratory pack animals. Where they went, they encountered new types of pressures, causing them to change over time.\n 2. Different selective pressures. Different areas can lead to different pressures. Some mutations also occured etc. Things like that.\n \n Evolution doesn't HAVE to occure non-stop if there is equilibrium. Not everyting is always changing, as far as I learned. Barring mutations that cause significant changes over a lot of time, Apes, Chimps, Monkies wouldn't really change all that much. There's no real pressure to do so. They are already well-adapted to their surroundings.\n \n Actually however, there really isn't that much difference between some of the great apes and Humans. Take the Bonobo Chimps, for example. They have 98% the same DNA as Humans. They are the closest to HOmo Sapien.\n \n 3. Niches. Related to above. Crocs, for example, don't evolve that much because they are a very successful animal design and they found a place in which they can thrive for generations with little to no changes. Other animals can do the same.\n \n 4. As well, humans didn't come directly from Apes. We all evolved from a common ancestor who did all of the above.\n \n http://www.talkorigins.org/faqs/homs/species.html\n \n Here is a time line of hominid species\n \n \n http://www.talkorigins.org/faqs/faq-speciation.html\n http://www.talkorigins.org/faqs/speciation.html\n \n Evolution doesn't lead to a higher species, as well. There is no hierarchy in nature. Each species is equally as well \"evolved\" depending on it's environment etc.\n \n A Human is no more evolved than a Chimp or better than a Chimp. Evolution doesn't lead to progression, but merely change. It's not getting better toward some high standard. Humans just like to think so.", 
   {}, 
   89986, 
   null, 
   1107678900.0
  ], 
  [
   90001, 
   null, 
   "trebor", 
   "#1 - How are we now able to observe evolution, when the evolution of the world supposely took billions of years?\n \n\n \n A) we can use experiments to show evoution. We have observed it. For example, there is the lactose test, where some bacterial had the gene\n to digest lactose removed. After letting it grow into the billions, and\n then fed ONLY lactose, it can be shown that some individuals had a gene\n that could digest lactose, and survive. There is also anti-bodic resistant\n bacteria that evolved due to the use of antibodics .. evolution at work.\n \n \n\n #2 - Can anyone prove to me without a doubt evolution is the way life began, even though no one was there to observe it?\n \n\n You are confusing EVOLUTION with abiogenesis. From the way you phrased\n your question, I rather suspect you wouldn't want to look at any evidence\n anyway. Aside from that, it is not certain exactly how abiogenesis happened,\n but great headways are being made on how it very well could have happened.\n \n \n\n #3 - Can anyone explain to me why no other apes, monkeys or chimps have \n evolved into a higher species?\n \n\n \n What is a 'higher' species. If you mean a more intelligent primate?? The concept there is a hierarchy of 'higher' and 'lower' species is incorrect. The\n only difference between man and the other primates is that man has a hyperdeveloped brain. There are two sugars that are naturally produced by body by most mammals. When investingating the presnece of these chemicals, one of them is present in much lower concentrations in the brains\n of all mammals. However, humans have a mutation that interrupted the \n production of this chemical. A piece of random junk got inserted into the middle of the gene that produces this chemical,and disabled it. Sometimes,\n evolution is not so much about what is added, but what is removed.", 
   {}, 
   89986, 
   null, 
   1107706500.0
  ], 
  [
   90034, 
   null, 
   "zachvac", 
   "#1 - How are we now able to observe evolution, when the evolution of the world supposely took billions of years?\n \n #2 - Can anyone prove to me without a doubt abiogenesis is the way life began, even though no one was there to observe it?\n \n #3 - Can anyone explain to me why no other apes, monkeys or chimps have evolved into a new (i.e. human) species?\n \n #4 - How do we know without a doubt the world is billions of years old?\n \n Please NO Crackpots serious responders ONLY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n You ask many questions with the phrase \"without a doubt\". Science doesn't deal with that. What it does deal with is a lot of evidence and no refuting evidence amounting to knowing beyond a reasonable doubt.\n \n And you talk about in #2 how the way life began. Evolution doesn't even try to answer that. Despite the fact that we can trace life back to one-celled organism, no one knows how they were created, therefor you can be a creationist and an evolutionist. \n \n Anyway #4 can be answered with carbon dating and other forms of dating that can date fossils back that far. Obviously we don't know without a doubt. We could have just been beemed here by aliens and they could have implanted a brain and memory in us.\n \n #1 evolution is happening now. There was a recent study that concluded that todays newer generations have stronger thumbs because of video games with need of stronger thumbs. Obviously it isn't on the scale of needing it to live, but since it's use it or lose it, people use their stronger thumbs and pass the DNA to their children. This is evolution.\n \n #3 has been answered in previous posts quite nicely, basically we didn't come directly from apes.\n \n Not in the order you asked the questions, but I addressed all of them :)", 
   {}, 
   89986, 
   null, 
   1107725160.0
  ], 
  [
   90085, 
   null, 
   "pandion", 
   "#1 - How are we now able to observe evolution, when the evolution of the world supposely took billions of years?\n\n How are we now able to observe the orbit of Pluto, when the orbit of Pluto supposely takes 249 years? It was only discovered in 1930. According to your logic, any claims that Pluto orbits the sun is pure speculation and will be until 2179.\n \n By the way, we observe evolution all the time. You see, the threory of evolution has to do with how living organisms change through time, not with how the world came about. We have observed the bacteria evolve to become resistant to antibiotics all the time. It is becoming a real problem in that there are some bacteria that are immune to almost every antibiotic we have.\n \n#2 - Can anyone prove to me without a doubt abiogenesis is the way life began, even though no one was there to observe it?\n\n Not even the scientists claim to know how it happened. Abiogenesis is the science that studies the possibilities. It is far more reasonable to conclude that life arose naturally than that it was a miracle by some magical being who did something somewhere some time in the past.\n \n#3 - Can anyone explain to me why no other apes, monkeys or chimps have evolved into a new (i.e. human) species?\n\n They don't live in an environment where such events are likely. At one time there were several species of hominini living at the same time. Evolution is more bushlike that ladder like. It just so happens that we are the only species that remains.\n \n#4 - How do we know without a doubt the world is billions of years old?\n\n All of the evidence from a variety of sources indicates that it is so. Cosmology, astrophysics, nuclear physics, geology and so on all indicate that the earth is old. In fact, the earth looks quite old with some mountains that have been greatly eroded.\n \nPlease NO Crackpots serious responders ONLY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n Wouldn't it have been better to educate yourself in the science you seem to oppose before you asked the questions?", 
   {}, 
   90034, 
   null, 
   1107800400.0
  ], 
  [
   90086, 
   null, 
   "sinjin", 
   "#1 - How are we now able to observe evolution, when the evolution of the world supposely took billions of years?\n \n #2 - Can anyone prove to me without a doubt abiogenesis is the way life began, even though no one was there to observe it?\n \n #3 - Can anyone explain to me why no other apes, monkeys or chimps have evolved into a new (i.e. human) species?\n \n #4 - How do we know without a doubt the world is billions of years old?\n \n Please NO Crackpots serious responders ONLY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n \n #1 - Evolution continues today. Some organisms evolve relatively quickly. It has and is being observed. Do some research.\n \n #2 - Science uses hypothesis to explain observed phenomena. It must have happened by itself if there is no Creator. There are several theories about the specifics. I happen to think lightning was involved. \n \n #3 - It is thought humans evolved \"away\" from the other apes due to environmental pressures. When the isthmus of Panama was formed it disrupted ocean currents causing a drying of the region in Africa where we are thought to originate. That change in climate forced our ancestors from the trees which somehow contributed to our \"rapid\" and unprecedented brain development.\n \n #4 - Geology and radioactive isotopes.", 
   {}, 
   89986, 
   null, 
   1107800460.0
  ], 
  [
   90141, 
   null, 
   "HeavenBound", 
   "[/QUOTE]Wouldn't it have been better to educate yourself in the science you seem to oppose before you asked the questions?[/QUOTE]\n \n It really piques me when someone attempts to assume what my opinion is without asking me. You know nothing about me or my views. People ask questions to learn and have been doing so for years. The only stupid question is the unasked one. If you have a problem answering the questions then don't.", 
   {
    "post_info": {
     "post_title": "Pandion"
    }
   }, 
   90085, 
   null, 
   1107813840.0
  ], 
  [
   90142, 
   null, 
   "Waxy", 
   "\n It really piques me when someone attempts to assume what my opinion is without asking me. You know nothing about me or my views. People ask questions to learn and have been doing so for years. The only stupid question is the unasked one. If you have a problem answering the questions then don't.\n\n \n It's all in how you word the questions.\n \n You worded the questions with an obvious bias, they did not come across as an honest attempt to learn, but rather as a challenge.\n \n Word them properly, and I guarantee you that the people here will be most helpful.\n \n Waxy\n \n P.S. Your username has a large affect on how you are initially perceived.", 
   {}, 
   90141, 
   null, 
   1107814860.0
  ], 
  [
   90163, 
   null, 
   "pandion", 
   "It really piques me when someone attempts to assume what my opinion is without asking me. You know nothing about me or my views.\n\n That's not true. You asked standard creationist questions with a standard creationist attitude. Your views are pretty clear from the smartass way you asked and your final comment.\n \nPeople ask questions to learn and have been doing so for years.\n\n But that's not what you were doing. You could have been polite and not made it so evident that you are a scientifically illiterate creationist.\n \nThe only stupid question is the unasked one.\n\n And many of the questions that creationists ask.\n \nIf you have a problem answering the questions then don't.\n\n If you have a problem with the answers, then don't bother to ask.", 
   {}, 
   90142, 
   null, 
   1107822960.0
  ], 
  [
   90168, 
   null, 
   "thebootfitter", 
   "Wouldn't it have been better to educate yourself in the science you seem to oppose before you asked the questions?\n\n \n It really piques me when someone attempts to assume what my opinion is without asking me. You know nothing about me or my views. People ask questions to learn and have been doing so for years. The only stupid question is the unasked one. If you have a problem answering the questions then don't.\n\n HeavenBound -- I would like to point out that Pandion clarified that you seem to oppose science. Because of the nature of your questions and how they are phrased, I think it is a reasonable assumption to make. However, I will come right out and ask you:\n \n HeavenBound -- What is your opinion with regard to the evolution / creationism debate?\n \n Peace,\n The Bootfitter", 
   {}, 
   90141, 
   null, 
   1107824820.0
  ], 
  [
   90191, 
   null, 
   "HeavenBound", 
   "That's not true. You asked standard creationist questions with a standard creationist attitude. Your views are pretty clear from the smartass way you asked and your final comment.\n \n I didn't realize creationist are the only ones allowed to ask questions about evolution. You haven't a clue what my attitude is. You would realize the questions are only questions if you weren't on the defensive so much. The reason I state NO Crackpots serious responders only is simply because I don't want any Crackpots to respond. I only want people who take my questions seriously to respond. If you had read that without an attitude you would have seen that. \n \n But that's not what you were doing. You could have been polite and not made it so evident that you are a scientifically illiterate creationist.\n \n I wasn't rude in the first place. They are only questions plain and simple, if you felt any attitude it was your own. Have I called anyone names or attacked any of the other poster's? I don't think so.\n \n And many of the questions that creationists ask.\n \n Answer above\n \n If you have a problem with the answers, then don't bother to ask.\n\n \n Serious answers was what I was looking for in the first place!!!! :)", 
   {}, 
   90163, 
   null, 
   1107839460.0
  ], 
  [
   90197, 
   null, 
   "HeavenBound", 
   "\n \n However, I will come right out and ask you:\n \n HeavenBound -- What is your opinion with regard to the evolution / creationism debate?\n\n \n I believe in both creationism and evolution. I realize the evolution process is still going on today. I don't feel the need to debate the issue as it would probably be a moot point for all involved. All I wanted was some honest answers to my questions. emoticon_xangel", 
   {}, 
   90168, 
   null, 
   1107840420.0
  ], 
  [
   90244, 
   null, 
   "unkerpaulie", 
   "I believe in both creationism and evolution. I realize the evolution process is still going on today. I don't feel the need to debate the issue as it would probably be a moot point for all involved. All I wanted was some honest answers to my questions. emoticon_xangel\n\n i dont know if you've realized this, but evolution and creationism cannot be both true (unless you are referring to only micro-evolution, which has been observed in nature). the theory of evolution directly opposes genesis' explanation for how the diversiy of living things on earth came to be. if ToE is true, it automatically nullifies creationism", 
   {}, 
   90197, 
   null, 
   1107885780.0
  ], 
  [
   90251, 
   null, 
   "Waxy", 
   "i dont know if you've realized this, but evolution and creationism cannot be both true (unless you are referring to only micro-evolution, which has been observed in nature). the theory of evolution directly opposes genesis' explanation for how the diversiy of living things on earth came to be. if ToE is true, it automatically nullifies creationism\n\n \n I realize you feel strongly about this unkerpaulie, but IMHO, that's merely your opinion, and not a statement of fact in any way.\n \n If any other readers are interested, there's a thread on the topic in the Religion forum.\n \n Waxy", 
   {}, 
   90244, 
   null, 
   1107886860.0
  ], 
  [
   90260, 
   null, 
   "unkerpaulie", 
   "I realize you feel strongly about this unkerpaulie, but IMHO, that's merely your opinion, and not a statement of fact in any way.\n \n If any other readers are interested, there's a thread on the topic in the Religion forum.\n \n Waxy\n\n i wont spin this thread of its axis, so i made a new one", 
   {}, 
   90251, 
   null, 
   1107888120.0
  ], 
  [
   91268, 
   null, 
   "evident", 
   "#1 - How are we now able to observe evolution, when the evolution of the world supposely took billions of years?\n \n #2 - Can anyone prove to me without a doubt abiogenesis is the way life began, even though no one was there to observe it?\n \n #3 - Can anyone explain to me why no other apes, monkeys or chimps have evolved into a new (i.e. human) species?\n \n #4 - How do we know without a doubt the world is billions of years old?\n \n \n\n \n \n The points individually have already been answered but actually you will find out that there is no complete proof for anything. No one can really tell you a definite answer to these questions.\n \n No one can be completely sure what happened, but at least Evolution gives more information and \"proof\" that makes sense.\n \n How could you prove me that your opinions are right? Can you prove me that the Bible is correct and definitely the infallible word of God? You probably can't, because no one can.\n \n \n Everything is just a theory, Evolution just as Creation...\n \n So please do not ask questions where you know that people most likely can't give you a definite answer (because no one knows it) just to finally say that if Evolutionists can't prove it completely it most likely isn't true... We all know that ourselves...\n \n There are no real answers to any of your questions... (yet)...", 
   {}, 
   89986, 
   null, 
   1108360260.0
  ], 
  [
   91395, 
   null, 
   "HeavenBound", 
   "So please do not ask questions where you know that people most likely can't give you a definite answer (because no one knows it) just to finally say that if Evolutionists can't prove it completely it most likely isn't true... We all know that ourselves...\n \n There are no real answers to any of your questions... (yet)...\n\n \n That was the whole point of asking the questions, to prove evolution isn't an absolute truth. emoticon_smile", 
   {}, 
   91268, 
   null, 
   1108423380.0
  ], 
  [
   91397, 
   null, 
   "Waxy", 
   "That was the whole point of asking the questions, to prove evolution isn't an absolute truth. emoticon_smile\n\n \n emoticon_frazzled \n \n Who are you trying to convince, yourself?\n \n Any scientist is well aware of that fact, and if you run into one that states that anything to do with a scientific theory is an ABSOLUTE fact, be VERY wary of what he's selling. \n \n I'd say your \"victory\" is a pretty hollow one.\n \n Waxy", 
   {}, 
   91395, 
   null, 
   1108423620.0
  ], 
  [
   91400, 
   null, 
   "Demon38", 
   "That was the whole point of asking the questions, to prove evolution isn't an absolute truth\n \n \n Let's see, what else in science isn't the absolute truth.....\n Well, it's still the heliocentric theory, so the earth orbitting the sun isn't the absolute truth. It's still the germ theory so germs and viruses causing disease isn't the absolute truth. It's still the atomic theory so atoms aren't the absolute truth and since chemistry stems from the atomic theory (chemicals and elements are, according to the theory, made up of atoms) chemistry isn't the absolute truth. gravity can't be the absolute truth because it's still the theory of gravity. And electricity sure can't be the absolute truth because it's part of the electromagnetic theory. It should also be noted that the theory of evolution is one of the most well supported theories in science, even though it isn't the absolute truth.", 
   {}, 
   91397, 
   null, 
   1108424460.0
  ], 
  [
   91401, 
   null, 
   "sinjin", 
   "That was the whole point of asking the questions, to prove evolution isn't an absolute truth. emoticon_smile\n\n \n The absolute truth is that for many of us evolution explains the diversity of life we see all around us better than \"poof\" ever did.", 
   {}, 
   91395, 
   null, 
   1108424460.0
  ], 
  [
   91404, 
   null, 
   "HeavenBound", 
   "The absolute truth is that for many of us evolution explains the diversity of life we see all around us better than \"poof\" ever did.\n\n \n More power too ya but, that's just your opinion. emoticon_xangel", 
   {}, 
   91401, 
   null, 
   1108425180.0
  ], 
  [
   91414, 
   null, 
   "sinjin", 
   "More power too ya but, that's just your opinion. emoticon_xangel\n\n \n Not just mine. I'm in good company. Let's remember that most of the \"theories\" you reject were formulated by people steeped in the same Judeo-Christian traditions as you and I. Why did they need the explanations science offered? What if anything was lacking in their faith? Did their work in science diminish their faith? Is life any less \"miraculous\" when viewed through science?", 
   {}, 
   91404, 
   null, 
   1108427460.0
  ], 
  [
   91440, 
   null, 
   "HeavenBound", 
   "Not just mine. I'm in good company. Let's remember that most of the \"theories\" you reject were formulated by people steeped in the same Judeo-Christian traditions as you and I. Why did they need the explanations science offered? What if anything was lacking in their faith? Did their work in science diminish their faith? Is life any less \"miraculous\" when viewed through science?\n\n \n Science CANT prove that God exists and created the world but science CANT prove that God doesn't exist either.", 
   {}, 
   91414, 
   null, 
   1108435140.0
  ], 
  [
   91458, 
   null, 
   "Dzeron", 
   "Science CANT prove that God exists and created the world but science CANT prove that God doesn't exist either.\n\n \n I agree. And yet I disagree. Science focuses on the observable world, and God is defined to exist outside of the observable world. But some Gods (like the Christian God) have contradicting properties (such as \"all just\" and \"all merciful\" or \"free-willing\" and \"omniscient\") and therefore, by logic, cannot exist.", 
   {}, 
   91440, 
   null, 
   1108440540.0
  ], 
  [
   91460, 
   null, 
   "Socialist", 
   " Science CANT prove that God exists and created the world but science CANT prove that God doesn't exist either.\n[\n \n This is fairly silly. Logically, you don't have to prove that somethign DOESNT exist in any argument. It's always up to the individual saying something exists to prove it exists. If he cannot, the quits until he does This is a version of the burden of proof fallacy, which creationists mostly seem to ignore.", 
   {}, 
   91458, 
   null, 
   1108440840.0
  ], 
  [
   91982, 
   null, 
   "Duo_Maxwell", 
   "#1 - How are we now able to observe evolution, when the evolution of the world supposely took billions of years?\n\n \n We can. Geological fossils of severial species, along with observations of specific species in isolated areas. \n \n \n\n #2 - Can anyone prove to me without a doubt abiogenesis is the way life began, even though no one was there to observe it?\n\n \n First, abiogensis isn't part of evolution, two, if we used your logic, if no one was there to observe it, nothing can be proved. Does a tree that falls in the woods make a sound if no one is there to observe it? If a man says something stupid and a woman isn't there to call him on it, did he say something stupid? The logic is faulty. Just because we weren't there to observe it, does not mean it did not happen. let's apply the logic to your argument. Since no human was there to observe Genesis, it therefore did not happen? How do you like your own logic being used aganist you? \n \n \n\n #3 - Can anyone explain to me why no other apes, monkeys or chimps have evolved into a new (i.e. human) species?\n\n \n Because Apes, monkeys and chimps are on different paths. You wouldn't expect a shark to evolve into a barracuda-like animal. things evolve to fill niches, we currently fill a niche, there is nothing pushing apes, chimps or other primates to fill a niche that is occupied. \n \n \n\n #4 - How do we know without a doubt the world is billions of years old?\n\n \n How do we know anything for sure? We can't be certain of the Earth's age in billions of years, but we can use carbon dating to figure out it's older then 55,000 years, which refutes creationism.", 
   {}, 
   89986, 
   null, 
   1108678860.0
  ], 
  [
   92021, 
   null, 
   "HeavenBound", 
   "We can. Geological fossils of severial species, along with observations of specific species in isolated areas.\n\n \n What specific species and what did they evolve to. \n \n \n \nFirst, abiogensis isn't part of evolution, two, if we used your logic, if no one was there to observe it, nothing can be proved. Does a tree that falls in the woods make a sound if no one is there to observe it? If a man says something stupid and a woman isn't there to call him on it, did he say something stupid? The logic is faulty. Just because we weren't there to observe it, does not mean it did not happen. let's apply the logic to your argument. Since no human was there to observe Genesis, it therefore did not happen? How do you like your own logic being used aganist you?\n\n \n I never said abiogensis was part of evolution. No human may have been there, but God sure was. \n \n \nBecause Apes, monkeys and chimps are on different paths. You wouldn't expect a shark to evolve into a barracuda-like animal. things evolve to fill niches, we currently fill a niche, there is nothing pushing apes, chimps or other primates to fill a niche that is occupied.\n\n \n Didn't we supposedly evolve from apes? Why would it be so impossible to conceive the idea they could have evolved into a different species of human.\n \n \nHow do we know anything for sure? We can't be certain of the Earth's age in billions of years, but we can use carbon dating to figure out it's older then 55,000 years, which refutes creationism.\n\n \n My point exactly. Carbon dating is by no means accurate, there it does not refute creationism. emoticon_xangel", 
   {}, 
   91982, 
   null, 
   1108685700.0
  ], 
  [
   92023, 
   null, 
   "Duo_Maxwell", 
   "What specific species and what did they evolve to.\n\n \n Basically the entire evolution of the horse, not to mention new species of fruit flies. \n \n \n\n I never said abiogensis was part of evolution. No human may have been there, but God sure was.\n\n \n You clearly grouped abiogensis with evolution. That's not up for debate. God could have been there for every new evolution. Invoking that doesn't mean ****. If anyone is there to observe it or not means nothing. \n \n \n\n Didn't we supposedly evolve from apes? Why would it be so impossible to conceive the idea they could have evolved into a different species of human.\n\n \n Thank you for basically admitting that Pandion's argument is correct. We did not evolve from apes. Apes didn't even exist. We evolved from primitive primates, along with apes, chimps, orugantans, etc. How would they evolve into a new species of human? That would require them to be on a very similar evolutionary path as us, and obviously, they are not. Just like a shark cannot evolve into barracuda, they cannot evolve into a human. \n \n \n\n My point exactly. Carbon dating is by no means accurate, there it does not refute creationism. emoticon_xangel\n\n \n How does it not refute creationism? Creationism states that the world is 7,000 years old. Carbon dating is only accurate up to a point, and that point is WELL beyond creationism's statements.", 
   {}, 
   92021, 
   null, 
   1108686180.0
  ], 
  [
   92038, 
   null, 
   "HeavenBound", 
   "Basically the entire evolution of the horse, not to mention new species of fruit flies.\n \n \n What's been observed besides an insect? How do they know for sure there weren't different species of horses.\n \n \nGod could have been there for every new evolution. Invoking that doesn't mean ****. If anyone is there to observe it or not means nothing.\n \n \n So, your saying an eyewitness would mean nothing. Yeah right.\n \n \nThank you for basically admitting that Pandion's argument is correct. We did not evolve from apes. Apes didn't even exist. We evolved from primitive primates, along with apes, chimps, orugantans, etc. How would they evolve into a new species of human? That would require them to be on a very similar evolutionary path as us, and obviously, they are not. Just like a shark cannot evolve into barracuda, they cannot evolve into a human.\n \n \n So, what all of sudden made these primates change into a weaker species no doubt?\n \n \n \nHow does it not refute creationism? Creationism states that the world is 7,000 years old. Carbon dating is only accurate up to a point, and that point is WELL beyond creationism's statements.\n\n \n How do you know carbon dating is so accurate? Would you bet your life on it?", 
   {}, 
   92023, 
   null, 
   1108688400.0
  ], 
  [
   92041, 
   null, 
   "Duo_Maxwell", 
   "What's been observed besides an insect? How do they know for sure there weren't different species of horses.\n\n \n Because specific species of horses only exist at certain periods in the geological record. Every so often, a new species that looks very, very similar, but with some distinct characteristics appears where the previous one use to in the geological record. Also, off the one of the coasts of either Ireland or England, there are sheer cliffs. In these cliffs you are able to see evolutionary development of shellfish for basically a billion years as you go from the top to the bottom. \n \n \n\n So, your saying an eyewitness would mean nothing. Yeah right.\n\n \n Your logic is that if no one was there to witness it, it therefore did not happen. Under that logic, creation did not happen because no one was there to witness it, God does not count because we can't even prove it exists, much less hold it accountable for being there to witness it. The entire argument based around the witness via your argument is worthless. \n \n \n \n So, what all of sudden made these primates change into a weaker species no doubt?\n\n \n Once again, you prove Pandion's asseration correct. Weaker species? Who said anything about that? Some species evolved to meet new niches, acquire more food, safer habitats. Hardly weaker. As for suddenly, you basically admit you are ignorant about evolution and sciences, which was Pandion's basic asseration. They did not change suddenly, but over time. \n \n \n\n How do you know carbon dating is so accurate? Would you bet your life on it?\n\n \n http://www.talkorigins.org/indexcc/CD/CD011.html\n \n Radiocarbon dating has been repeatedly tested, demonstrating its accuracy. It is calibrated by tree-ring data, which gives a nearly exact calendar for more than 11,000 years back. It has also been tested on items for which the age is known through historical records, such as parts of the Dead Sea scrolls and some wood from an Egyptian tomb (MNSU n.d.; Watson 2001). Multiple samples from a single object have been dated independently, yielding consistent results. Radiocarbon dating is also concordant with other dating techniques (e.g., Bard et al. 1990).", 
   {}, 
   92038, 
   null, 
   1108688940.0
  ], 
  [
   92074, 
   null, 
   "HeavenBound", 
   "Because specific species of horses only exist at certain periods in the geological record. Every so often, a new species that looks very, very similar, but with some distinct characteristics appears where the previous one use to in the geological record. Also, off the one of the coasts of either Ireland or England, there are sheer cliffs. In these cliffs you are able to see evolutionary development of shellfish for basically a billion years as you go from the top to the bottom.\n \n \n If this is true for horses, why not humans? How do you know these cliffs are billions of years old?\n \n \nYour logic is that if no one was there to witness it, it therefore did not happen. Under that logic, creation did not happen because no one was there to witness it, God does not count because we can't even prove it exists, much less hold it accountable for being there to witness it. The entire argument based around the witness via your argument is worthless.\n \n \n No, my logic is if no one witnessed the beginning of life then how does anyone know what is true. You can't disprove God didn't create the world and I can't disprove some one cell organism didn't either.\n \n \nOnce again, you prove Pandion's asseration correct. Weaker species? Who said anything about that? Some species evolved to meet new niches, acquire more food, safer habitats. Hardly weaker. As for suddenly, you basically admit you are ignorant about evolution and sciences, which was Pandion's basic asseration. They did not change suddenly, but over time.\n\n \n You obviously read more into what I wrote than I would have imagined. I never asserted the primates changed suddenly. No, I do not have a degree in Science. I wasn't aware I needed one, though you might try improving on your spelling.\n \n \nRadiocarbon dating has been repeatedly tested, demonstrating its accuracy. It is calibrated by tree-ring data, which gives a nearly exact calendar for more than 11,000 years back. It has also been tested on items for which the age is known through historical records, such as parts of the Dead Sea scrolls and some wood from an Egyptian tomb (MNSU n.d.; Watson 2001). Multiple samples from a single object have been dated independently, yielding consistent results. Radiocarbon dating is also concordant with other dating techniques (e.g., Bard et al. 1990).\n\n \n It's also been shown to give inaccurate dates. You didn't answer the question, would you bet your life on it. emoticon_xangel", 
   {}, 
   92041, 
   null, 
   1108699380.0
  ], 
  [
   92081, 
   null, 
   "Duo_Maxwell", 
   "If this is true for horses, why not humans? How do you know these cliffs are billions of years old?\n\n \n We don't have the complete geological timeline for humans. There are only a few species that we do have unbroken fossil timelines for, and humans aren't one of them. As for the cliffs, basic sediment deposits can be easily caculated along with compression rates. \n \n \n\n No, my logic is if no one witnessed the beginning of life then how does anyone know what is true. You can't disprove God didn't create the world and I can't disprove some one cell organism didn't either.\n\n \n So what was the point in bringing the issue up? \n \n \n\n You obviously read more into what I wrote than I would have imagined. I never asserted the primates changed suddenly. No, I do not have a degree in Science. I wasn't aware I needed one, though you might try improving on your spelling.\n\n \n I quote you here So, what all of sudden made these primates change into a weaker species no doubt?\n \n I can see that your argument is petering out, spelling attacks are usually a sign of that. \n \n \n\n It's also been shown to give inaccurate dates. You didn't answer the question, would you bet your life on it. emoticon_xangel\n\n \n You ignored the quote. \n \n Radiocarbon dating has been repeatedly tested, demonstrating its accuracy. It is calibrated by tree-ring data, which gives a nearly exact calendar for more than 11,000 years back. It has also been tested on items for which the age is known through historical records, such as parts of the Dead Sea scrolls and some wood from an Egyptian tomb (MNSU n.d.; Watson 2001). Multiple samples from a single object have been dated independently, yielding consistent results. Radiocarbon dating is also concordant with other dating techniques (e.g., Bard et al. 1990).", 
   {}, 
   92074, 
   null, 
   1108703640.0
  ], 
  [
   92090, 
   null, 
   "HeavenBound", 
   "So what was the point in bringing the issue up?\n\n \n If you don't know by now, you never will!!!\n \n \n \nI quote you here So, what all of sudden made these primates change into a weaker species no doubt?\n\n \n I'm not saying the primates changed all of a sudden, but what all of a sudden made them want to change. \n \n \nI can see that your argument is petering out, spelling attacks are usually a sign of that.\n\n \n My argument has hardly petered out. What's the matter can't take a little correction yourself, so you have to throw out blame wherever you can.\n \n \n \n \nYou ignored the quote. \n \n Radiocarbon dating has been repeatedly tested, demonstrating its accuracy. It is calibrated by tree-ring data, which gives a nearly exact calendar for more than 11,000 years back. It has also been tested on items for which the age is known through historical records, such as parts of the Dead Sea scrolls and some wood from an Egyptian tomb (MNSU n.d.; Watson 2001). Multiple samples from a single object have been dated independently, yielding consistent results. Radiocarbon dating is also concordant with other dating techniques (e.g., Bard et al. 1990).\n\n \n I didn't ignore the quote, I just don't believe it. There have been many inaccurate test. Now answer the question, WOULD YOU BET YOUR LIFE ON IT?  emoticon_cool", 
   {}, 
   92081, 
   null, 
   1108713360.0
  ], 
  [
   92096, 
   null, 
   "Scottdude2000", 
   "I would first like to start by saying that God is the center of my life. I scese to function as a human being without him. I have no reason to wake up in the morning but to se what he holds today for me and to make an IMPACT for christ.\n \n I would also like to say I definatly think that God created the universe and all life that exists through the proven mathmatic, scientific, and biological processes that we are aware of - and some that we aren't.\n \n 1. we are able to see and understand that the animal kingdom thrives through the darwinistic \"survival of the fittest\" structure. genetic mutation has been proven. Cancer is a genetic mutation. i'm 19 and my generation is taller than my father's generation DESPITE all the horrible chemicals we call food now a days...lol... the human speciese is getting taller and taller because in the end tall men are more likely to have sex than short men. corn nowadays is so much different than what it was because farmers have continually picked the seeds of the top 1% to use for replanting. evolution exists, the real question is whether or not evolution explains the origin of life.\n \n 2. lol \" Can anyone prove to me without a doubt abiogenesis is the way life began, even though no one was there to observe it?\"\n \n umm... can anyone tell me that the genesis account is they way life began since no human was there to observe it?\n \n I have no doubt that the universe is so perfectly designed mathmaticly - by God- that if any property were different it would scese to exist. there are many parts in evolution that can't be reverse engineered. and for the atheist scientist thats where they would stop and look for another answer... but for me all i can say is God must have done that. to say that we aren't inteligently designed is just as ludicris as saying one could fill a box full of scrabble peaces and expect an edgar allen poe novel to come out. just as ludicris as saying that God created all of these geniously designed evolutionary techniques to never be used why would he create such a powerfull thing as evolution and not use it?! dosn't that seem rediculous to anyone else but me?!\n \n 3. actually if you take any college level world civ class like i just did you would know that other apes DID evolve. we have records of a species of ape that had a larger brain that OURS!!! All other homo's so to speak either got killed competing with us for hunt or bread with us to make us the speciese we are today.\n \n 4. we know without a doubt because of continental movements, samples of rocks from the solar system,. we know because of sedimentary layers that when dated based on their layer position they were deposited billions of years ago. we can also tell that the light from stars hitting the earth are billions of lightyears away. of the earth is 8000 years old how do we explain the light that is hitting us from farther than 8000 lightyears? if the earth is 8000 years old how do we explain the rock layers all over the world that take millions of years to bend and fol. and hello dinosaurs? what did they pop up for a day and then disappear? no.\n \n 5. I love God with all my heart mind and soul. i lose absolutly no sleep over any of this. In my opinion evolution is simply the medium God used to do his buisness. All a christian must believe is that we were created in the likeness of God. it doesn't matter how we were created. so can we stop giving people a hard time about evolution?\n \n -Scott", 
   {
    "post_info": {
     "post_title": "the doubtless/shadowless area you asked for"
    }
   }, 
   89986, 
   null, 
   1108723080.0
  ], 
  [
   92116, 
   null, 
   "Socialist", 
   " I'm not saying the primates changed all of a sudden, but what all of a sudden made them want to change. \n\n \n \n You actually think Evolution works by what creatuers  want ? You think they just got up one day and said, \"ya know Bob, I wanna evolve.\" !!Oops, there goes my tail!!\n \n One want an organism can change is due to being in a different environment, isolated from the previous group. Mutations can occur, and if they aren't killer, they are passed on. Changes in genetic material through mutation add to the gene pool and are passed on through mating.\n \n If you are an isolated group of animals, and you have enough mutations and mating, you will change over time. The environment, through one process, can choose who succeeds and who doesn't. It's natural selection. There are other mechanisms, of course, so that's not the only one.\n \n We already know that Human brain development could possible have occured due to a new diet, in a new area. Meat allowed for a larget brain, which in turn allowed for better skills, compared to other animals. Humans used tools as well, which was aided by using hands. Eventually, these animals descended from the trees and ceased to be arboreal creatures, because they needed to use their hands for tools. You can't do that that well if you are swining in a tree.", 
   {}, 
   92096, 
   null, 
   1108744860.0
  ], 
  [
   92124, 
   null, 
   "trebor", 
   "\n I didn't ignore the quote, I just don't believe it. There have been many inaccurate test. Now answer the question, WOULD YOU BET YOUR LIFE ON IT?  emoticon_cool\n\n \n Yes. I would. How do you like those apples<?", 
   {}, 
   92090, 
   null, 
   1108746000.0
  ], 
  [
   92130, 
   null, 
   "HeavenBound", 
   "Yes. I would. How do you like those apples<?\n\n \n It's your life do what you want with it. If you want to bet your life on a test that's been proven to be inaccurate so be it. The question however was not directed at you. emoticon_xbye", 
   {}, 
   92124, 
   null, 
   1108747080.0
  ], 
  [
   92141, 
   null, 
   "pandion", 
   "If you want to bet your life on a test that's been proven to be inaccurate so be it.\n\n Please offer that proof in support of your assertion. If you fail to do so we can be assured that you actually have no knowledge of any such proof. Please, please tell us about these \"many\" inaccurate tests of which you claim knowledge. I mentioned a few creationist claims of such tests in the thread on \"Dating of fossils...\"\n \n My bet is that you don't know enough about the topic to understand how radiometric dating works or why your examples may or may not be incorrect. In other words, I think you may have been duped.", 
   {}, 
   92130, 
   null, 
   1108752720.0
  ], 
  [
   92161, 
   null, 
   "Scottdude2000", 
   "\"You actually think Evolution works by what creatuers want ? You think they just got up one day and said, \"ya know Bob, I wanna evolve.\" !!Oops, there goes my tail!!\"\n \n well crudely summed up yes. basicly the human species has gone from an average of four feet tall in the 16th century to 6 feet tall in modern times. \n \n what happens is basicly people are very selective in what they want. Most women pick the creem of the crop. The tallest/strongest men are statisticly going to mate more than the short stack. is the human species saying... lets get taller? no. but the human species is picking out height for example or anyother trait you would care to think of and breed along those lines. we are getting taller. how do you explain this phenominon by any other driving force BUT evolution?", 
   {
    "post_info": {
     "post_title": "yes it does"
    }
   }, 
   92141, 
   null, 
   1108760340.0
  ], 
  [
   92164, 
   null, 
   "thebootfitter", 
   "basicly the human species has gone from an average of four feet tall in the 16th century to 6 feet tall in modern times.\n\n Do you have any documentation for these assertions? Methinks not.\n \n The average height of adult males is not even six feet currently. See this link for a chart. This link actually discusses the height of human ancestors. According to the authors, you have to go back through several million years of human ancestors before you see average heights of four feet.\n \n Peace,\n The Bootfitter", 
   {}, 
   92161, 
   null, 
   1108761420.0
  ], 
  [
   92167, 
   null, 
   "Scottdude2000", 
   "Do you have any documentation for these assertions? Methinks not.\n \n The average height of adult males is not even six feet currently.\n\n \n I didn't say adult males. I said males of my generation. BIG DIFFERENCE. but i'm sorry i assumed everyone here knew i was 19. I am not refering to 40 year old men i am refering to generation Y youths. I'm 6 foot 3 and i am the shortest guy in my dormitory.\n \n and yes your both right and wrong. yes the lucy skeleton is about four feet tall and then they radicly grew to about 5 feet. but then average height went down due to the pre industrial revolution due to poor nutrition and then height went back up to about 5 feet post industrial revolution.\n \n ever since then hieght has been on the rise", 
   {}, 
   92164, 
   null, 
   1108763100.0
  ], 
  [
   92169, 
   null, 
   "sinjin", 
   "...the human species has gone from an average of four feet tall in the 16th century to 6 feet tall in modern times. \n \n\n http://www.shakespeare.org.uk/main/1/11?cat=6&A=65", 
   {}, 
   92161, 
   null, 
   1108763400.0
  ], 
  [
   92170, 
   null, 
   "trebor", 
   "\"You actually think Evolution works by what creatuers want ? You think they just got up one day and said, \"ya know Bob, I wanna evolve.\" !!Oops, there goes my tail!!\"\n \n well crudely summed up yes. basicly the human species has gone from an average of four feet tall in the 16th century to 6 feet tall in modern times. \n \n what happens is basicly people are very selective in what they want. Most women pick the creem of the crop. The tallest/strongest men are statisticly going to mate more than the short stack. is the human species saying... lets get taller? no. but the human species is picking out height for example or anyother trait you would care to think of and breed along those lines. we are getting taller. how do you explain this phenominon by any other driving force BUT evolution?\n\n \n To a large extent, the increase in size is due to better nutriction. The averge height of the Japanse has increased by 3 or 4 inches since ww2!!\n \n Although modern man evolved, and is continuing to evolve today, the example of height is a bad example.", 
   {}, 
   92161, 
   null, 
   1108763700.0
  ], 
  [
   92174, 
   null, 
   "thebootfitter", 
   " I didn't say adult males. I said males of my generation. \n\n I don't mean to nitpick... but you did not specify \"males of [your] generation.\" You said: \"...basicly the human species has gone from an average of four feet tall in the 16th century to 6 feet tall in modern times.\"\n \n \n I am not refering to 40 year old men i am refering to generation Y youths. \n\n I doubt there is much of a difference between the average height of 19-year-olds and 40-year-olds. If you are aware of any references to support the assertion that there are, please share them.\n \n \nand yes your both right and wrong.\n\n Frankly... I'm not terribly concerned with being 'right' or 'wrong.' I am simply making a point that assertions without any known documentation make for an unconvincing argument, in my opinion.\n \n \nyes the lucy skeleton is about four feet tall and then they radicly grew to about 5 feet. but then average height went down due to the pre industrial revolution due to poor nutrition and then height went back up to about 5 feet post industrial revolution.\n \n ever since then hieght has been on the rise \n\n You are making more assertions here, yet you have failed to produce any references to support your assertions. Based on the few weblinks that have been posted in this thread that contradict your assertions, it appears reasonable to assume your assertions are false.\n \n Peace,\n The Bootfitter", 
   {}, 
   92167, 
   null, 
   1108764420.0
  ], 
  [
   92178, 
   null, 
   "Duo_Maxwell", 
   "If you don't know by now, you never will!!!\n\n \n Evidence A: No substance in Heavenbound argument.\n \n \n\n I'm not saying the primates changed all of a sudden, but what all of a sudden made them want to change.\n\n \n Evidence B: No substance in Heavenbound argument. You are basically saying the same thing. That there was a sudden change. That does not occur. \n \n \n\n My argument has hardly petered out. What's the matter can't take a little correction yourself, so you have to throw out blame wherever you can.\n\n \n Evidence C: No substance in Heavenbound argument. What are you correcting? \n \n \n\n I didn't ignore the quote, I just don't believe it. There have been many inaccurate test. Now answer the question, WOULD YOU BET YOUR LIFE ON IT?  emoticon_cool\n\n \n Do you have any scientific knowledge or are you just going to argue in a child-like fashion and refuse to refute anything you don't like but resort to comments like the one above?\n \n You do realize that you are only reinforcing the stereotype that creationists have no knowledge of science and when the arguemnt comes down to facts, they have nothing right?", 
   {}, 
   92090, 
   null, 
   1108764840.0
  ], 
  [
   92185, 
   null, 
   "pandion", 
   "Well, it seems that HeavenBound was around long enough to give me a few words of denial in respose to my rather long discussion of radiometric dating in the other thread. It also seems that HeavenBound didn't feel it necessary to respond in this thread to my request for the proof that she claimed existed. Neither did she list those \"many\" examples of inaccurate tests.\n \n She did, as always, repeat the irrelevant nonsense about betting ones life on scientific observations. I did recently bet my life recently. I underwent a major surgery (about 6 hours). In effect, I bet my life on the knowledge and skill of my surgeons. But as much as possible I quit betting my life except when absolutely necessary when I left the Army way back in the 60s. One of my son's very close friends is making that life bet on the efficiency of training, effectiveness of equipment, courage of comrads, and a bit of luck as a Captain in the Army Corps of Engineers in Iraq. This bet follows a similar bet as a 2nd Lt in Afghanistan.\n \n It seems to me that such challenges only demonstrate how little value some people can place on human life. I value it much to much to take is so lightly.", 
   {}, 
   92178, 
   null, 
   1108768560.0
  ], 
  [
   92187, 
   null, 
   "pandion", 
   "Scottdude\n \n It is my understanding that the average height is actually decreasing in the last decade or so. Cant remember where I read that but it reached the maximum during my generation. It is also true that the changes in height are probably not attributable to evolution. The question was looked into in the past and no evidence was found that it was true. As was stated, it is probably due to nutrition. So like someone said, can you support your assertions?\n \n By the way, at 6'3\" you would be slightly below average among myself, my brothers, my sons and my nephews.", 
   {}, 
   92185, 
   null, 
   1108768920.0
  ], 
  [
   92192, 
   null, 
   "sinjin", 
   "A preference for taller women may play a part in specific instances. I am considerably smaller than my grandfather was and both he and my father married women of small stature. Works both ways.", 
   {}, 
   92187, 
   null, 
   1108773420.0
  ], 
  [
   92201, 
   null, 
   "HeavenBound", 
   "It also seems that HeavenBound didn't feel it necessary to respond in this thread to my request for the proof that she claimed existed. Neither did she list those \"many\" examples of inaccurate tests.\n\n \n What just because I don't respond fast enough for your liking, I will respond when I am ready\n \n \nIt seems to me that such challenges only demonstrate how little value some people can place on human life. I value it much to much to take is so lightly.\n\n \n My mother just died a week ago so don't you dare tell me I don't value life.\n I loved my mother and would have traded places with her in a heartbeat. So you have absolutely no right to tell me I don't value life. I have my own war stories about being in the Gulf and always awakening to scud alerts. My gas mask was my best friend and I wore it everywhere. It would be the only thing to keep me from death if I could get it on properly in under 9 sec., anymore and it's over.\n emoticon_frazzled", 
   {}, 
   92185, 
   null, 
   1108775580.0
  ], 
  [
   92211, 
   null, 
   "HeavenBound", 
   "Evidence A: No substance in Heavenbound argument.\n\n \n Just because your not dumb enough to figure it out doesn't mean there's no substance. \n \n \nEvidence B: No substance in Heavenbound argument. You are basically saying the same thing. That there was a sudden change. That does not occur.\n \n \n Open your eyes and take the blinders off dude.\n \n \n \nEvidence C: No substance in Heavenbound argument. What are you correcting?\n \n \n I was just pointing out you don't like it when other people point out your mistakes.\n \n \n Why must we always look inside the box for answers? Everything in life cannot be solved scientifically.", 
   {}, 
   92178, 
   null, 
   1108777560.0
  ], 
  [
   92214, 
   null, 
   "pandion", 
   "My mother just died a week ago so don't you dare tell me I don't value life.\n\n What does that have to do with the discussion and how does that demonstrate that you value life. You are so casual about \"betting your life\" that you obviously don't value it much.\n \n So far no evidence, no list of tests, no proof. Just whining and attempts to distract from the issue.", 
   {}, 
   92211, 
   null, 
   1108780860.0
  ], 
  [
   92217, 
   null, 
   "HeavenBound", 
   "What does that have to do with the discussion and how does that demonstrate that you value life. You are so casual about \"betting your life\" that you obviously don't value it much.\n \n So far no evidence, no list of tests, no proof. Just whining and attempts to distract from the issue.\n\n \n Your an ignorant oaf!!!! You think so highly of yourself it's sickening. I never bet my life on anything, if you'd read instead of being smug you'd know that. I showed how I value life by wanting give my own for my mother. You'll get your evidence when I'm good and ready.emoticon_wow", 
   {}, 
   92214, 
   null, 
   1108784400.0
  ], 
  [
   92224, 
   null, 
   "zachvac", 
   "Just because your not dumb enough to figure it out doesn't mean there's no substance. \n \n\n hehe, so he's too smart to figure out what your statement means? I don't think that's quite what you meant :)\n \n \n\n Why must we always look inside the box for answers? Everything in life cannot be solved scientifically.\n\n \n Everything can't be solved scientifically, so just don't try to solve anything scientifically. Sound good? Why are we trying to scientifically improve the study of the body and save more lives through surgery? Don't we know science doesn't solve everything? (Actually, my aunt believes so strongly in God she won't take medicine because she says if God wanted her to get better, he'd do it. It was when she started hiding medicine from people in the hospital that she got kicked out, but anyway...)\n \n The reason pretty much everything can be solved scientifically is that science is a way of thinking. It isn't a body of facts. Science can be anything. Religion can be approached scientific. If there were sufficient proof, religion could be science. If you admit that religion is outside the realm of logic, then you're right it's outside of science.", 
   {}, 
   92211, 
   null, 
   1108788480.0
  ], 
  [
   92225, 
   null, 
   "zachvac", 
   "Your an ignorant oaf!!!! You think so highly of yourself it's sickening. I never bet my life on anything, if you'd read instead of being smug you'd know that. I showed how I value life by wanting give my own for my mother. You'll get your evidence when I'm good and ready.emoticon_wow\n\n \n The point was you wouldn't accept his statement unless he'd bet his life on it. You seemed to think that if he was sure, he'd bet his life on it. No one knows you personally and can judge how much you value life, but from what you've written, you don't seem like you care much about life when you demand someone bet it just to make sure he agrees with a known fact.", 
   {}, 
   92217, 
   null, 
   1108788660.0
  ], 
  [
   92226, 
   null, 
   "HeavenBound", 
   "The point was you wouldn't accept his statement unless he'd bet his life on it. You seemed to think that if he was sure, he'd bet his life on it. No one knows you personally and can judge how much you value life, but from what you've written, you don't seem like you care much about life when you demand someone bet it just to make sure he agrees with a known fact.\n\n \n Oh no, I didn't ask pandion to \"bet his life\" on anything. He was just jumping in to get his two sense in. I was only trying to make a point. I just don't like people trying shove their beliefs down my throat because, that's what they think is right and infallible. I am allowed my own thoughts. emoticon_xangel", 
   {}, 
   92225, 
   null, 
   1108789500.0
  ], 
  [
   92227, 
   null, 
   "HeavenBound", 
   "Everything can't be solved scientifically, so just don't try to solve anything scientifically. Sound good? Why are we trying to scientifically improve the study of the body and save more lives through surgery? Don't we know science doesn't solve everything? (Actually, my aunt believes so strongly in God she won't take medicine because she says if God wanted her to get better, he'd do it. It was when she started hiding medicine from people in the hospital that she got kicked out, but anyway...)\n \n The reason pretty much everything can be solved scientifically is that science is a way of thinking. It isn't a body of facts. Science can be anything. Religion can be approached scientific. If there were sufficient proof, religion could be science. If you admit that religion is outside the realm of logic, then you're right it's outside of science.\n\n \n Does everything have to make sense all the time. Can't some solutions be illogical, but work. Personnally I wouldn't want religion to be scientific. That would be a very volatile. emoticon_xangel", 
   {}, 
   92224, 
   null, 
   1108790160.0
  ], 
  [
   92228, 
   null, 
   "zachvac", 
   "Does everything have to make sense all the time. Can't some solutions be illogical, but work. Personnally I wouldn't want religion to be scientific. That would be a very volatile. emoticon_xangel\n\n \n For me to believe something it has to make sense. On the topic of religion I admit that there is no way of knowing how we were created. But of course everything doesn't make sense all the time. Of course if a bug had created the world that wouldn't make sense but would still work.", 
   {}, 
   92227, 
   null, 
   1108791300.0
  ], 
  [
   92233, 
   null, 
   "trebor", 
   "Your an ignorant oaf!!!! You think so highly of yourself it's sickening. I never bet my life on anything, if you'd read instead of being smug you'd know that. I showed how I value life by wanting give my own for my mother. You'll get your evidence when I'm good and ready.emoticon_wow\n\n \n I won't hold my breath. And, by the way, as long as you are doing the insults and ad homeinin attacks, it's 'YOU'RE AN IGNORANT OAF' not YOUR AN IGNORANT OAF'.", 
   {}, 
   92217, 
   null, 
   1108796040.0
  ], 
  [
   92235, 
   null, 
   "pandion", 
   "Your an ignorant oaf!!!!\n\n So now you are reduced to insult! How nice. It seems that you realize how foolish you have made yourself appear and wish to distract by insulting me. Nice try.\n \nYou think so highly of yourself it's sickening.\n\n Projection. Actually, at my age, I'm pretty much aware of my abilities and limitations. But your insults because you don't respect yourself are quite nice.\n \nI never bet my life on anything, if you'd read instead of being smug you'd know that.\n\n I knew that, not because you said so. It was because of the little value you place on human life. The majority of the men (and some women) of my age all served in the military. Most did time in VN. My older brother had his chopper shot down over the Viet Nam highlands. He crashed inside a U.S. outpost. As a result he has had 2 surgeries, one on the ruptured disks in his back, the other on the ruptured disk in his neck. My younger brother took a .50 cal hit his first day on the job. Later he had a 3/4 ton truck that was towed to the junk yard, and he went into the trench with the South Koreans and went hand to hand in the only daytime frontal assault on an established position by the NVC. One of my close friends and drinking buddies was with the 1st Bn, 7th Cav Reg, 1st Cav Div (Airmobile) at Ia Drang. You can read about his experiences in a book entitled We Were Soldiers Once...And Young. He told me that story in the summer of 1966. If you don't read much (and I suspect that this may be true), you can rent the movie We Were Soldiers starring Mel Gibson. My friend had 3 Purple Hearts. Some of my classmates, friends, comrads in arms, and students returned in MedEvac aircraft, some missing body parts. Some returned in body bags. Who are you to talk about betting life for trivial reasons? I had my fill of that many years ago. By the way, my younger son is now an Army NCO. A close friend of his from high school is a Captain in the Army Corps of Engineers (West Point graduate) serving in Iraq - first assignment was in one of the first units into Afghanistan. So again I ask, what kind of ignorant pride would motivate you to talk about betting one's life?\n \nI showed how I value life by wanting give my own for my mother.\n\n Words, only words. You haven't ever actually been in a situation where it was necessary to \"bet you life.\" And of course, you knew at the time you made your offer to die in place of your mother that it wasn't possible. Gosh how noble! But in spite of what you think, you were making a very safe bet. Your claim about the value you place on life just doesn't hold water. Those who value life don't even claim to make bets for frivolous reasons.\n \nYou'll get your evidence when I'm good and ready.\n\n Ah! You mean you don't have any. Thanks. I won't stay up nights waiting since it won't be coming.", 
   {}, 
   92228, 
   null, 
   1108797720.0
  ], 
  [
   92237, 
   null, 
   "HeavenBound", 
   "So now you are reduced to insult! How nice. It seems that you realize how foolish you have made yourself appear and wish to distract by insulting me. Nice try.\n\n \n I wasn't trying to distract you. \n \n \nProjection. Actually, at my age, I'm pretty much aware of my abilities and limitations. But your insults because you don't respect yourself are quite nice.\n\n \n So maybe I shouldn't have included \"oaf.\" I still respect myself very much so. Thank you kindly.\n \n \nI knew that, not because you said so. It was because of the little value you place on human life. The majority of the men (and some women) of my age all served in the military. Most did time in VN. My older brother had his chopper shot down over the Viet Nam highlands. He crashed inside a U.S. outpost. As a result he has had 2 surgeries, one on the ruptured disks in his back, the other on the ruptured disk in his neck. My younger brother took a .50 cal hit his first day on the job. Later he had a 3/4 ton truck that was towed to the junk yard, and he went into the trench with the South Koreans and went hand to hand in the only daytime frontal assault on an established position by the NVC. One of my close friends and drinking buddies was with the 1st Bn, 7th Cav Reg, 1st Cav Div (Airmobile) at Ia Drang. You can read about his experiences in a book entitled We Were Soldiers Once...And Young. He told me that story in the summer of 1966. If you don't read much (and I suspect that this may be true), you can rent the movie We Were Soldiers starring Mel Gibson. My friend had 3 Purple Hearts. Some of my classmates, friends, comrads in arms, and students returned in MedEvac aircraft, some missing body parts. Some returned in body bags. Who are you to talk about betting life for trivial reasons? I had my fill of that many years ago. By the way, my younger son is now an Army NCO. A close friend of his from high school is a Captain in the Army Corps of Engineers (West Point graduate) serving in Iraq - first assignment was in one of the first units into Afghanistan. So again I ask, what kind of ignorant pride would motivate you to talk about betting one's life?\n\n \n It has nothing whatsoever to do with pride. I would glady give my life for my beliefs. I meant it only to make a point, but you want to make a whole issue out of it.\n \n \nWords, only words. You haven't ever actually been in a situation where it was necessary to \"bet you life.\" And of course, you knew at the time you made your offer to die in place of your mother that it wasn't possible. Gosh how noble! But in spite of what you think, you were making a very safe bet. Your claim about the value you place on life just doesn't hold water. Those who value life don't even claim to make bets for frivolous reasons.\n\n \n I've been in the Gulf war and almost lost my life, so don't tell me I don't know what it's like. I was discharged at 100% disability from the military.\n I've been in other situations I don't care to list here or feel necessary to list here. \n \n \nAh! You mean you don't have any. Thanks. I won't stay up nights waiting since it won't be coming.\n\n \n There you go assuming again. emoticon_wow", 
   {}, 
   92235, 
   null, 
   1108801560.0
  ], 
  [
   92243, 
   null, 
   "pandion", 
   "There you go assuming again.\n\n The why can't you present it? Why is it that the typical creationist answer is, \"I'll tell you later?\" I assume that you have no proof, nor examples, nor lists because you have been unable to present them. You made assertions and when asked to support them you aren't able to do so. What we get is whining that you can't now but you will some time in the future. Either you have your proof and lists and evidence or you don't. It is quite clear that you are searching for support for your assertions. You never did have \"proof.\"\n \n Thanks for playing. We have no consolation prize.", 
   {}, 
   92237, 
   null, 
   1108808100.0
  ], 
  [
   92254, 
   null, 
   "trebor", 
   "\n I've been in the Gulf war and almost lost my life, so don't tell me I don't know what it's like. I was discharged at 100% disability from the military.\n I've been in other situations I don't care to list here or feel necessary to list here. \n\n \n Your personal life is irrelavent to the matter at hand.\n \n You either have evidence, or you don't. I predict then if you present it, it will be a rerun of the typical creationist junk that has been seen, and discredited numerous amounts of time.", 
   {}, 
   92237, 
   null, 
   1108831620.0
  ], 
  [
   92273, 
   null, 
   "HeavenBound", 
   "Your personal life is irrelavent to the matter at hand.\n \n You either have evidence, or you don't. I predict then if you present it, it will be a rerun of the typical creationist junk that has been seen, and discredited numerous amounts of time.\n\n \n You should read all the post before you make an statement. Pandion is the one who brought personal lives into the conversation, which was between me and him by the way. :)", 
   {}, 
   92254, 
   null, 
   1108837860.0
  ], 
  [
   92282, 
   null, 
   "Socialist", 
   " \n what happens is basicly people are very selective in what they want. Most women pick the creem of the crop. The tallest/strongest men are statisticly going to mate more than the short stack. is the human species saying... lets get taller? no. but the human species is picking out height for example or anyother trait you would care to think of and breed along those lines. we are getting taller. how do you explain this phenominon by any other driving force BUT evolution?\n\n \n Evolution.\n \n I don't get what you are asking. I support evolution.\n \n \n What I am saying is that people don't go out and pick what they want actively. It's passive through mating, and even then, they can't 100% get the genes they want and the random mutations that might be passed.\n \n \n Humans didn't lose their tails because they thought of doing so. It was a mutation that got passed on through mating and selection. This is the way they all work. If something isn't harmful or if it's neutral, it gets passed on through mating. A mate doesn't pick individual traits all the time; some come as part of the package, but they aren't what is saught. \n \n For instance, they might pick the big, strong or the smart ones. The best able to take care of the \"family.\" This individual might have other desirable, but unpicked traits.", 
   {}, 
   92178, 
   null, 
   1108840440.0
  ], 
  [
   92285, 
   null, 
   "zachvac", 
   "You should read all the post before you make an statement. Pandion is the one who brought personal lives into the conversation, which was between me and him by the way. :)\n\n \n Actually you started it by first asking him to bet his life, then when he did, telling him he didn't value life. And if you post it on a public forum you can expect others to respond to your comments directed at other people.", 
   {}, 
   92273, 
   null, 
   1108841040.0
  ], 
  [
   92309, 
   null, 
   "HeavenBound", 
   "Actually you started it by first asking him to bet his life, then when he did, telling him he didn't value life. And if you post it on a public forum you can expect others to respond to your comments directed at other people.\n\n \n I never told him he didn't value his life, I told him it was his choice. The question wasn't even directed at him. Everybody keeps trying to jump on the bandwagon when it has nothing  to do with them. emoticon_frazzled", 
   {}, 
   92285, 
   null, 
   1108848000.0
  ], 
  [
   92315, 
   null, 
   "trebor", 
   "You should read all the post before you make an statement. Pandion is the one who brought personal lives into the conversation, which was between me and him by the way. :)\n\n \n Actually, you did. You kept on claiming 'Would you bet your life on it'. I would say that is 1) the avoidence technique known as distraction, and 2) bringing personality into it.\n \n That is how I read it, of course.\n \n How.. about that evidence.. feel free to show it when you actually have some.", 
   {}, 
   92273, 
   null, 
   1108853220.0
  ], 
  [
   92316, 
   null, 
   "HeavenBound", 
   "Actually, you did. You kept on claiming 'Would you bet your life on it'. I would say that is 1) the avoidence technique known as distraction, and 2) bringing personality into it.\n \n That is how I read it, of course.\n \n How.. about that evidence.. feel free to show it when you actually have some.\n\n \n Did you not read the post above this one. Did I direct the question at you. No, I did not. I wasn't trying to distract anyone dude, get a grip. I asked the question for my own darn reason, not for you to know. The question was only for Duo_Maxwell. emoticon_frazzled", 
   {}, 
   92315, 
   null, 
   1108855200.0
  ], 
  [
   92318, 
   null, 
   "Duo_Maxwell", 
   "Just because your not dumb enough to figure it out doesn't mean there's no substance.\n\n \n Please tell me what substance there is in your argument when the point you brought up is irrevelant. \n \n \n\n Open your eyes and take the blinders off dude.\n\n \n Stop resorting to the fallacy of evocation. \n \n \n\n I was just pointing out you don't like it when other people point out your mistakes.\n\n \n Actually spelling attacks are virtually almost signs that a debater cannot do anything except attack his opponent's spelling. Debate posts are suppose to prove that the argument is wrong by refuting the points, not by implying that the spelling is wrong. Spelling attacks are basically backdoor ad-homenin. Do you really think I wouldn't have caught that? \n \n \n\n Why must we always look inside the box for answers? Everything in life cannot be solved scientifically.\n\n \n Why not? Notice you haven't been able to prove that carbon dating is wrong yet continue to reinforce the stereotype that creationists are basically XXXXXX when it comes to debating evolution aganist creation", 
   {}, 
   92211, 
   null, 
   1108860540.0
  ], 
  [
   92324, 
   null, 
   "Socialist", 
   "Looking outside of the box is a euphemism for \"making up pure nonsense.\"", 
   {}, 
   92318, 
   null, 
   1108863840.0
  ], 
  [
   92327, 
   null, 
   "zachvac", 
   "Please tell me what substance there is in your argument when the point you brought up is irrevelant. \n \n\n That's the point. He said you weren't dumb enough to figure it out. You are too smart to figure out the irrelevant post.", 
   {}, 
   92318, 
   null, 
   1108864500.0
  ], 
  [
   92362, 
   null, 
   "HeavenBound", 
   "Please tell me what substance there is in your argument when the point you brought up is irrevelant.\n\n \n If your to blind to see, me telling you won't help. \n \n \n \n \nStop resorting to the fallacy of evocation.\n\n \n Whatever, if you can not understand what is written. \n \n \n \n \nActually spelling attacks are virtually almost signs that a debater cannot do anything except attack his opponent's spelling. Debate posts are suppose to prove that the argument is wrong by refuting the points, not by implying that the spelling is wrong. Spelling attacks are basically backdoor ad-homenin. Do you really think I wouldn't have caught that?\n\n \n I only brought your spelling up because you were in the midst of calling me ignorant and lazy I think and I thought it rather funny. \n \n \n \n \nWhy not? Notice you haven't been able to prove that carbon dating is wrong yet continue to reinforce the stereotype that creationists are basically XXXXXX when it comes to debating evolution aganist creation\n\n \n Read my post on the other thread your so fond of. When you call a group of people XXXXXX you really should take a look in the mirror. emoticon_xangel", 
   {}, 
   92318, 
   null, 
   1108874220.0
  ], 
  [
   92364, 
   null, 
   "HeavenBound", 
   "Looking outside of the box is a euphemism for \"making up pure nonsense.\"\n\n \n Everything can't be explained by science, so anything that can't is nonsense. I got cha. :)", 
   {}, 
   92324, 
   null, 
   1108874340.0
  ], 
  [
   92365, 
   null, 
   "HeavenBound", 
   "That's the point. He said you weren't dumb enough to figure it out. You are too smart to figure out the irrelevant post.\n\n \n Zacvac,\n I'm disappointed in you. I did mean to say dumb and the post wasn't irrelevant. By the way I am not a he. emoticon_xangel", 
   {}, 
   92327, 
   null, 
   1108874940.0
  ], 
  [
   92377, 
   null, 
   "zachvac", 
   "Zacvac,\n I'm disappointed in you. I did mean to say dumb and the post wasn't irrelevant. By the way I am not a he. emoticon_xangel\n\n \n Sorry for calling you a he. But your original post was that he wasn't dumb enough to figure that out. Since wasn't is a contraction that is the same as:\n \n \"he was not dumb enough to figure it out\". You are saying he has to be dumber to figure it out. That's the same as:\n \n \"He is too smart to figure it out\". I sort of assumed that's not what you meant.", 
   {}, 
   92365, 
   null, 
   1108879200.0
  ], 
  [
   92378, 
   null, 
   "zachvac", 
   "Zacvac,\n I'm disappointed in you. I did mean to say dumb and the post wasn't irrelevant. By the way I am not a he. emoticon_xangel\n\n \n And I didn't mean to say it was irrelevant, that was just in the phrase I quoted so I used those words.", 
   {}, 
   92365, 
   null, 
   1108879260.0
  ], 
  [
   92379, 
   null, 
   "zachvac", 
   "This has come from a somewhat intelligent debate to an argument over whether or not someone was rude, namecalling, spelling attacks, and other things of that nature. I had to go back a couple pages to find out what we were even debating.", 
   {}, 
   92378, 
   null, 
   1108879380.0
  ], 
  [
   92391, 
   null, 
   "HeavenBound", 
   "This has come from a somewhat intelligent debate to an argument over whether or not someone was rude, namecalling, spelling attacks, and other things of that nature. I had to go back a couple pages to find out what we were even debating.\n\n \n I did not want to argue over anything in the first place, but when someone insults me first I am not going to lie down and die. There seems to be a double standard on this forum. Some Evo's can insult people, but when treated with the same in kind they even crack down harder. All because I don't agree with them, as though I have no rights and I just have too agree with them. Look all I want is to make peace. :)", 
   {}, 
   92379, 
   null, 
   1108882020.0
  ], 
  [
   92393, 
   null, 
   "Socialist", 
   " Everything can't be explained by science, so anything that can't is nonsense. I got cha. \n\n \n STuff that cannot be explained by science is inconsequential and should be neutral untill it can be. There is no reason to believe in something that cannot pass the best method of gaining knowledge in  human history.\n \n \n Metaphysical things? Ghosts? Goblins? Monsters? 14 headed giants who are invisible and live in their father's garages? Just whip out the razor and start shaving away! If it cannot be naturally explained by science, it's not worth anything. \n \n Take this example:\n \n Crop circcles became a major unknown phenomenon during the last decade, and they still do today. There is no conclusive evidence to what causes them all.\n \n Put this into mathematical equation form.\n \n THEORY 1\n \n A1 = Crop circles appear mysteriously\n B1 = Aliens are said by UFOlogists to be the culprit\n \n A1=B1 In this theory, aliens are the \"cause\" of the crop circles that are mysteriously found in corn fields. \n \n THEORY 2\n \n A2= Caused crop circles. \n B2= Hoax, prank, coincidence, accident\n \n Let's compare the scientific approach below\n \n 1 A=B Crop circles created by aliens; cannot be falisified, has never been verified. Most likely isn't real. \n \n 2 A2=B2(H+P+A) Crop circles have been shown that they are possibly created, quite easily, by students, weirdos, scam artists. THey can also be explained away through many other means.\n \n 1 is simpler than 2, but 2 provides scientific, superior reasoning and explanatory power for the phenomenon. Occam's razor dicatates that you should choose theory two. It's the simplest one available that fits the available data and has explanatory power, all things being equal. The first is thinking \"outside of the box.\" while the other is thinking \"inside of the logic box.\"\n \n If science and the scientific method cannot explain it...give up on that idea untill it can. If it can't, the idea isn't worth entertaining.", 
   {}, 
   92377, 
   null, 
   1108882740.0
  ], 
  [
   92396, 
   null, 
   "thebootfitter", 
   "Some Evo's can insult people, but when treated with the same in kind they even crack down harder.\n\n What's an \"Evo\"?", 
   {}, 
   92391, 
   null, 
   1108883520.0
  ], 
  [
   92404, 
   null, 
   "HeavenBound", 
   "If science and the scientific method cannot explain it...give up on that idea untill it can. If it can't, the idea isn't worth entertaining.\n\n \n So, what your saying is since science can't admit it has limits, we should sit idly by and pass up opportunities to explore new idea's and possibilities. :)", 
   {}, 
   92393, 
   null, 
   1108885800.0
  ], 
  [
   92405, 
   null, 
   "HeavenBound", 
   "What's an \"Evo\"?\n\n \n An abbrevation for evolutionist. :)", 
   {}, 
   92396, 
   null, 
   1108885980.0
  ], 
  [
   92409, 
   null, 
   "Socialist", 
   " \n So, what your saying is since science can't admit it has limits, we should sit idly by and pass up opportunities to explore new idea's and possibilities.\n\n \n No. You obviously didn't understand anything I said above, nor did you get the example. Science is the best system. It's illogical to think \"outside\" of the box. It's the same **** people say when they don't want to deal with reality. In philosophy, if you don't believe in the \"brain in the vat scienario\", you are't thinking \"out of the box.\" It's a cop-out.\n \n There is no way to explore knowledge reliably without the scientific method. The rest is ridiculously subjective and nonsensical.\n \n \n 'Oh, but God is above logic.\"", 
   {}, 
   92405, 
   null, 
   1108888620.0
  ], 
  [
   92415, 
   null, 
   "HeavenBound", 
   "No. You obviously didn't understand anything I said above, nor did you get the example. Science is the best system. It's illogical to think \"outside\" of the box. It's the same **** people say when they don't want to deal with reality. In philosophy, if you don't believe in the \"brain in the vat scienario\", you are't thinking \"out of the box.\" It's a cop-out.\n \n There is no way to explore knowledge reliably without the scientific method. The rest is ridiculously subjective and nonsensical.\n \n \n 'Oh, but God is above logic.\"\n\n \n Who says science is always the correct method? I think it rather closed-minded. I would like to know who gets to make this horrendous decision for everyone? What's the matter science can't take any competion. From the way you describe things it sounds worse than religion.", 
   {}, 
   92409, 
   null, 
   1108890600.0
  ], 
  [
   92425, 
   null, 
   "Socialist", 
   "There is nothing wrong with religion, as long as it doesn't try to make itself out to be an instution of learning. It's a faith. Faith implies irrationality. \n \n Faith/Religions are inherently irrational, Irrational believes are not what you want to base decisions on.\n \n Now. I am not saying you are stupid, but the problem is intrinsic to your belief. It's not an accurate way of gaining knowledge.\n \n No one person made up the \"rules.\" This has been an epistemological developement for centuries. It has been tested time and time again, and it works. It's practical and it gives tangible results.\n \n Religion is based on metaphysical, which means \"beyond the physical.\" This even sounds silly.\n \n Would you believe me If I ran around in robes with long hair screaming that I am the son of God? If you don't, there's no reason to believe that Jesus was either, cause we would be both nothing more than a buch of lunatics escaped from an asylum. That's the best explanation for Jesus---a well-intentioned lunatic.\n \n If you look at it rationally, who the hell would run around saying he's the son of God? That's why we have modern institutions.\n \n \n \n Science can take competition, but it's competition is clearly inferior from an Objective Standpoint. Your religion is the same as my believe that the earth was created by Murray the Giant Space turtle. I have faith he exists, therefore whatever he says to me must be the truth, and science is wrong.\n \n Anyone who doesn't believe in Murray isn't thinking out of the box", 
   {}, 
   92415, 
   null, 
   1108898880.0
  ], 
  [
   92426, 
   null, 
   "Demon38", 
   "Who says science is always the correct method? I think it rather closed-minded. I would like to know who gets to make this horrendous decision for everyone? What's the matter science can't take any competion. \n \n Let's look at science's track record.....If we used religion as a guide, we'd still believe lightning was caused by Zeus, disease was caused by demons, the best way to grow a good crop was to sacrifice a sheep, and on and on!\n Science has raised the quality of our lives immeasurably! It is the most objective way of examining nature and has repeatedly shown how effective it is in the quest for knowledge! So as far as scienc being afraid of competition from religion, they are 2 different things. Science only competes with religion when religion makes testable scientific claims, like the world is only 6000 years old or there was a global flood. In this arena, science has soundly defeated religion, the world is roughly 4.5 billion years old and there couldn't possibly have been a world wide flood. And life on earth has evolved and continues to evolve. When ever the christian church has tried to dogmatically assert anything as being scientifically true, it has invariably been wrong! \n If you think that the scientific method is a \"horrendous\" way to explain the natural world, then only a hypocrit would continue to make use of the products of this method, I take it you don't live naked in a cave.......\n And, more specifically, the products of evolutinary theory are of major importance in agriculture, animal husbandry and modern medicine.\n \n From the way you describe things it sounds worse than religion. \n \n Looking back at the history of religion, the pogroms, the human sacrifices, the crusades, it's obvious that nothing is worse than religion......", 
   {}, 
   92415, 
   null, 
   1108899840.0
  ], 
  [
   92470, 
   null, 
   "trebor", 
   "Did you not read the post above this one. Did I direct the question at you. No, I did not. I wasn't trying to distract anyone dude, get a grip. I asked the question for my own darn reason, not for you to know. The question was only for Duo_Maxwell. emoticon_frazzled\n\n \n \n You posted it in a public forum. You do know the concept of a public forum don't you?? You know.. where multiple people can see what you write and make comments on it??", 
   {}, 
   92316, 
   null, 
   1108922280.0
  ], 
  [
   92492, 
   null, 
   "HeavenBound", 
   "There is nothing wrong with religion, as long as it doesn't try to make itself out to be an instution of learning. It's a faith. Faith implies irrationality. \n \n Faith/Religions are inherently irrational, Irrational believes are not what you want to base decisions on.\n \n Now. I am not saying you are stupid, but the problem is intrinsic to your belief. It's not an accurate way of gaining knowledge.\n \n No one person made up the \"rules.\" This has been an epistemological developement for centuries. It has been tested time and time again, and it works. It's practical and it gives tangible results.\n \n Religion is based on metaphysical, which means \"beyond the physical.\" This even sounds silly.\n \n Would you believe me If I ran around in robes with long hair screaming that I am the son of God? If you don't, there's no reason to believe that Jesus was either, cause we would be both nothing more than a buch of lunatics escaped from an asylum. That's the best explanation for Jesus---a well-intentioned lunatic.\n \n If you look at it rationally, who the hell would run around saying he's the son of God? That's why we have modern institutions.\n \n \n \n Science can take competition, but it's competition is clearly inferior from an Objective Standpoint. Your religion is the same as my believe that the earth was created by Murray the Giant Space turtle. I have faith he exists, therefore whatever he says to me must be the truth, and science is wrong.\n \n Anyone who doesn't believe in Murray isn't thinking out of the box\n\n \n Dude, your arguments are flimsy at best. Who said I get all of my knowledge from christianity, but there is knowledge there. Oh course I wouldn't believe you were the messiah, you have the wrong attitude and I doubt you could perform any miracles. Jesus would go around saying he is the Son of God. There is so much more to it than you than you wrote.\n :)", 
   {}, 
   92425, 
   null, 
   1108929000.0
  ], 
  [
   92494, 
   null, 
   "HeavenBound", 
   "Who says science is always the correct method? I think it rather closed-minded. I would like to know who gets to make this horrendous decision for everyone? What's the matter science can't take any competion. \n \n Let's look at science's track record.....If we used religion as a guide, we'd still believe lightning was caused by Zeus, disease was caused by demons, the best way to grow a good crop was to sacrifice a sheep, and on and on!\n Science has raised the quality of our lives immeasurably! It is the most objective way of examining nature and has repeatedly shown how effective it is in the quest for knowledge! So as far as scienc being afraid of competition from religion, they are 2 different things. Science only competes with religion when religion makes testable scientific claims, like the world is only 6000 years old or there was a global flood. In this arena, science has soundly defeated religion, the world is roughly 4.5 billion years old and there couldn't possibly have been a world wide flood. And life on earth has evolved and continues to evolve. When ever the christian church has tried to dogmatically assert anything as being scientifically true, it has invariably been wrong! \n If you think that the scientific method is a \"horrendous\" way to explain the natural world, then only a hypocrit would continue to make use of the products of this method, I take it you don't live naked in a cave.......\n And, more specifically, the products of evolutinary theory are of major importance in agriculture, animal husbandry and modern medicine.\n\n \n There's no 100% way of knowing how old the earth is. I only think it is horrendous if it is only way allowed to explain things. I didn't relize science was responsible for the construction of my house.\n \n \nFrom the way you describe things it sounds worse than religion. \n \n Looking back at the history of religion, the pogroms, the human sacrifices, the crusades, it's obvious that nothing is worse than religion......\n\n \n People having all their views and opinions controlled by science is.", 
   {}, 
   92426, 
   null, 
   1108929360.0
  ], 
  [
   92495, 
   null, 
   "CCR1994", 
   "Dude, your arguments are flimsy at best. Who said I get all of my knowledge from christianity, but there is knowledge there. Oh course I wouldn't believe you were the messiah, you have the wrong attitude and I doubt you could perform any miracles. Jesus would go around saying he is the Son of God. There is so much more to it than you than you wrote.\n :)\n\n \n If scientific evidence casting doubt on the validity of Darwinism did in fact exist, it is doubtful that it would be accepted or even acknowledged.", 
   {}, 
   92492, 
   null, 
   1108929420.0
  ], 
  [
   92496, 
   null, 
   "HeavenBound", 
   "You posted it in a public forum. You do know the concept of a public forum don't you?? You know.. where multiple people can see what you write and make comments on it??\n\n \n It may be a public forum, but there are times when you shouldn't intrude on a discussion. It's just common sense courtesy. :)", 
   {}, 
   92470, 
   null, 
   1108929600.0
  ], 
  [
   92501, 
   null, 
   "Socialist", 
   " \n Dude, your arguments are flimsy at best. Who said I get all of my knowledge from christianity, but there is knowledge there. Oh course I wouldn't believe you were the messiah, you have the wrong attitude and I doubt you could perform any miracles. Jesus would go around saying he is the Son of God. There is so much more to it than you than you wrote.\n\n \n \n 1 BWWHHAHAHAHHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHA\n \n Comedy Gold. Your funny. Keep on believing a lunatic who thought he was the son of God. emoticon_rolleyes\n \n 2. Jesus didn't perform any mircales either. A book written after the fact says he did. A book that is, in many cases, wrong and contradictory.", 
   {}, 
   92496, 
   null, 
   1108931100.0
  ], 
  [
   92503, 
   null, 
   "thebootfitter", 
   "An abbrevation for evolutionist.\n\n And to what do you refer when you say \"evolutionist\"?", 
   {}, 
   92405, 
   null, 
   1108931400.0
  ], 
  [
   92507, 
   null, 
   "HeavenBound", 
   "And to what do you refer when you say \"evolutionist\"?\n\n \n I call them Evo's.", 
   {}, 
   92503, 
   null, 
   1108932000.0
  ], 
  [
   92508, 
   null, 
   "HeavenBound", 
   "1 BWWHHAHAHAHHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHA\n \n Comedy Gold. Your funny. Keep on believing a lunatic who thought he was the son of God. emoticon_rolleyes\n \n 2. Jesus didn't perform any mircales either. A book written after the fact says he did. A book that is, in many cases, wrong and contradictory.\n\n \n Your making the assertion, so prove it. You should however take it to the Religion Forum emoticon_xangel", 
   {}, 
   92501, 
   null, 
   1108932120.0
  ], 
  [
   92510, 
   null, 
   "Socialist", 
   " Your making the assertion, so prove it. You should however take it to the Religion Forum\n\n \n I did prove it. I explained easily why science is better than imaginary metaphysics. You don't understand Occam's Razor. I cannot help you there.\n \n There is no proof for miracles, they cannot be duplicated, they cannot be falsified. There is no method of validating them.\n \n The only cases of evidence are anecdotal, and anecdotal evidence is spurious and not admissible.\n \n \n I have already proven how it's contradictory in many cases already.\n \n The Idea of Creation and God are easily shaved away by the Razor, because they are complex explanations that are unnecessary to explain any given phenomenon.", 
   {}, 
   92508, 
   null, 
   1108932480.0
  ], 
  [
   92536, 
   null, 
   "zachvac", 
   "Your making the assertion, so prove it. You should however take it to the Religion Forum emoticon_xangel\n\n \n Regardless of where it belongs, Christians made the assertion that Jesus performed miracles and didn't have any proof. So there is a demand for evidence there but you demand evidence for his questioning the evidence of Christians?", 
   {}, 
   92508, 
   null, 
   1108939320.0
  ], 
  [
   92543, 
   null, 
   "HeavenBound", 
   "I did prove it. I explained easily why science is better than imaginary metaphysics. You don't understand Occam's Razor. I cannot help you there.\n \n There is no proof for miracles, they cannot be duplicated, they cannot be falsified. There is no method of validating them.\n \n The only cases of evidence are anecdotal, and anecdotal evidence is spurious and not admissible.\n \n \n I have already proven how it's contradictory in many cases already.\n \n The Idea of Creation and God are easily shaved away by the Razor, because they are complex explanations that are unnecessary to explain any given phenomenon.\n\n \n Just because there is no factual proof Jesus performed miracles doesn't mean they didn't occur. There are no proven absolute truths for christianity or evolution. emoticon_xangel", 
   {}, 
   92510, 
   null, 
   1108940040.0
  ], 
  [
   92548, 
   null, 
   "HeavenBound", 
   "Regardless of where it belongs, Christians made the assertion that Jesus performed miracles and didn't have any proof. So there is a demand for evidence there but you demand evidence for his questioning the evidence of Christians?\n\n \n I am not going to clog this forum with questions regarding christianity. Put it in the proper forum. Thank you.", 
   {}, 
   92536, 
   null, 
   1108940460.0
  ], 
  [
   92570, 
   null, 
   "Socialist", 
   " Just because there is no factual proof Jesus performed miracles doesn't mean they didn't occur. There are no proven absolute truths for christianity or evolution.\n\n \n Just because there is no evidence that I am God, doesn't meant that I am not God. However, to believe I am God with no factual evidence is absurd, as is Christianity and all religions, actually.\n \n I never said they didn't occure. I said it's stupid to believe in them because there is no evidence. If you honestly cannot differentiate between a rational belief based on  fact  and an irrational concept that only exists either in your head or without facts to back it up, then you admitt you are incapable of separating a good theory from a bad theory.\n \n Are you praising the fact that you should believe in something with no proof, just because you cannot prove it didn't happen?", 
   {}, 
   92548, 
   null, 
   1108945800.0
  ], 
  [
   92583, 
   null, 
   "sinjin", 
   "Are you praising the fact that you should believe in something with no proof, just because you cannot prove it didn't happen?\n \n Now you're getting the hang of it. And the more fervently or even hysterically the better. It's a contest between believers after all. Good for morale too.", 
   {}, 
   92570, 
   null, 
   1108949340.0
  ], 
  [
   92595, 
   null, 
   "HeavenBound", 
   "Just because there is no evidence that I am God, doesn't meant that I am not God. However, to believe I am God with no factual evidence is absurd, as is Christianity and all religions, actually.\n \n I never said they didn't occure. I said it's stupid to believe in them because there is no evidence. If you honestly cannot differentiate between a rational belief based on  fact  and an irrational concept that only exists either in your head or without facts to back it up, then you admitt you are incapable of separating a good theory from a bad theory.\n \n Are you praising the fact that you should believe in something with no proof, just because you cannot prove it didn't happen?\n\n \n I have all the proof I need, just because it doesn't meet your standard doesn't matter. Sounds like a personal problem to me. emoticon_xangel", 
   {}, 
   92570, 
   null, 
   1108957140.0
  ], 
  [
   92602, 
   null, 
   "Demon38", 
   "There's no 100% way of knowing how old the \n earth is. \n \n There's no 100% way of knowing anything in science! We don't know absolutely, 100% that the earth orbits the sun,\n we don't know absolutely 100% how electricity works, we don't know absolutely, 100% how atoms work. But when a theory is supported by all the evidence, when it is testable, when it makes successful predictions, we can be almost sure the theory is right! We can then use a theory for practical applications. Even though we aren't 100% sure what electricity is we can harness it and use it, even though we don't know 100% how atoms work, we can use them to build power plants, we can use them to treat diseases, even though we don't know 100% that the earth is 4.5 billion years old, based on that theory we can locate oil fields, it supports the theory of evolution. If you have any evidence that the earth is young, let's hear it and show how it's a better explaination than what modern geology shows us!\n \n I only think it is horrendous if it is only way allowed to explain things. \n \n but it's not the only way! You're free to repeat the experiments that support a theory, come up with new experiments and tests to support your theory, you're completely free to falsify any theory science makes. The only catch is you have present valid evidence, you have to allow others to repeat your experiments. You have to examine your own results objectively, with no preconceived ideas about the results. Science goes where the data leads! If you explain things any other way, then it's not a scientific explaination, simple as that. Oh sure, you can believe anything you want, but don't expect others to accept your crazy beliefs just because you say so!\n \n I didn't relize science was responsible for the construction of my house \n \n Any metal in your house? That comes from the science of metalurgy and chemistry. Any paint or glass, again, that comes from chemistry. Anything use electricity in your hous? Once again, that is a result of the electromagnetic theory! Got a TV, a radio, a CD player, a computer, any electric lights, air conditioner, is your house heated, all applications that are based on scientific principles. So yes, science is responsible for your house!\n \n People having all their views and opinions controlled by science is \n \n Science controls nothing, it merely is the best, most objective and most successful way of examining the natural world.", 
   {}, 
   92595, 
   null, 
   1108962900.0
  ], 
  [
   92604, 
   null, 
   "Demon38", 
   "There are no proven absolute truths for christianity or evolution. \n \n So according to this statement, you're willing to admit that Christianity MIGHT be wrong. And while there are no proven, absolute truths in any area of science, evolution is supported by a vast amount of evidence from multiple scientific disciplines and there is absolutely no evidence disproving it. Christianity, on the other hand, is supported\n only by unsubstantiated myths and legends, many of which could NOT have possibly happened given what we understand about nature. Looking at the 2 objectively, which is more likely?", 
   {}, 
   92602, 
   null, 
   1108963200.0
  ], 
  [
   92606, 
   null, 
   "zachvac", 
   "There are no proven absolute truths for christianity or evolution. \n \n So according to this statement, you're willing to admit that Christianity MIGHT be wrong. And while there are no proven, absolute truths in any area of science, evolution is supported by a vast amount of evidence from multiple scientific disciplines and there is absolutely no evidence disproving it. Christianity, on the other hand, is supported\n only by unsubstantiated myths and legends, many of which could NOT have possibly happened given what we understand about nature. Looking at the 2 objectively, which is more likely?\n\n \n Of course they manipulate the bible as they see fit so it says what they want it to. It's looking for a reason to convince people of their statement. The way science and logic work, you have to come up with the reason (observations, experimentation) to conclude something from that.", 
   {}, 
   92604, 
   null, 
   1108963800.0
  ], 
  [
   92614, 
   null, 
   "HeavenBound", 
   "There's no 100% way of knowing how old the \n earth is. \n \n There's no 100% way of knowing anything in science! We don't know absolutely, 100% that the earth orbits the sun,\n we don't know absolutely 100% how electricity works, we don't know absolutely, 100% how atoms work. But when a theory is supported by all the evidence, when it is testable, when it makes successful predictions, we can be almost sure the theory is right! We can then use a theory for practical applications. Even though we aren't 100% sure what electricity is we can harness it and use it, even though we don't know 100% how atoms work, we can use them to build power plants, we can use them to treat diseases, even though we don't know 100% that the earth is 4.5 billion years old, based on that theory we can locate oil fields, it supports the theory of evolution. If you have any evidence that the earth is young, let's hear it and show how it's a better explaination than what modern geology shows us!\n\n \n I don't have anything you'd consider evidence, but how do you know there won't be evidence in the future. Everything starts with an idea and you're trying to kill the idea by not even considering the possibility. You just blow it by the wayside. \n \n \nI only think it is horrendous if it is only way allowed to explain things. \n \n but it's not the only way! You're free to repeat the experiments that support a theory, come up with new experiments and tests to support your theory, you're completely free to falsify any theory science makes. The only catch is you have present valid evidence, you have to allow others to repeat your experiments. You have to examine your own results objectively, with no preconceived ideas about the results. Science goes where the data leads! If you explain things any other way, then it's not a scientific explaination, simple as that. Oh sure, you can believe anything you want, but don't expect others to accept your crazy beliefs just because you say so!\n\n \n But it's all on your terms only!!!\n \n \nI didn't relize science was responsible for the construction of my house \n \n Any metal in your house? That comes from the science of metalurgy and chemistry. Any paint or glass, again, that comes from chemistry. Anything use electricity in your hous? Once again, that is a result of the electromagnetic theory! Got a TV, a radio, a CD player, a computer, any electric lights, air conditioner, is your house heated, all applications that are based on scientific principles. So yes, science is responsible for your house!\n\n \n I live in handbuilt shack with no electricty, glass or anything else. hah! :) People survived long before there was science.\n \n \nPeople having all their views and opinions controlled by science is \n Science controls nothing, it merely is the best, most objective and most successful way of examining the natural world.\n\n \n It's not 100% though, you said it yourself. Your not even open to new possibilities.", 
   {}, 
   92602, 
   null, 
   1108965420.0
  ], 
  [
   92617, 
   null, 
   "HeavenBound", 
   "There are no proven absolute truths for christianity or evolution. \n \n So according to this statement, you're willing to admit that Christianity MIGHT be wrong. And while there are no proven, absolute truths in any area of science, evolution is supported by a vast amount of evidence from multiple scientific disciplines and there is absolutely no evidence disproving it. Christianity, on the other hand, is supported\n only by unsubstantiated myths and legends, many of which could NOT have possibly happened given what we understand about nature. Looking at the 2 objectively, which is more likely?\n\n \n See, you still don't except anything that doesn't fit in your little world. You cannot disprove christianity either. You just don't get it. emoticon_xangel", 
   {}, 
   92604, 
   null, 
   1108965780.0
  ], 
  [
   92619, 
   null, 
   "HeavenBound", 
   "Of course they manipulate the bible as they see fit so it says what they want it to. It's looking for a reason to convince people of their statement. The way science and logic work, you have to come up with the reason (observations, experimentation) to conclude something from that.\n\n \n \n I don't know where you're coming from Zachvac, but it seems to me your somewhere out there in left field. Please, stop picking up other people's leftover's. Take religion to the right forum. emoticon_xangel", 
   {}, 
   92606, 
   null, 
   1108965960.0
  ], 
  [
   92621, 
   null, 
   "Socialist", 
   " I live in handbuilt shack with no electricty, glass or anything else. hah! People survived long before there was science.\n \n\n \n LoL. Science has existed alongside math in some form for the thousands of years. Science was borne of Philosophy. It is a philosophy. It has evolved over time as well. \n \n Egyptians used Engineering, which is applied science. The Greeks did as well. Both used astronomy, geometry. Science didn't magically appear out of nowhere.\n \n The SM, however, dates at least from the 17th century.\n \n \n And you keep mentioning that no one can disprove creationism. Actually, many of their arguments  are disproved quite regularly. ANd you don't have to disprove God. THe Razor shaves him away.", 
   {}, 
   92619, 
   null, 
   1108966560.0
  ], 
  [
   92685, 
   null, 
   "trebor", 
   "See, you still don't except anything that doesn't fit in your little world. You cannot disprove christianity either. You just don't get it. emoticon_xangel\n\n \n And you can disprove hindusism, or Janism, or Taosism, or Confusism, or Buddhism, or atheism.\n \n On the other hand, Christianity make some very strong claims.. such as the phsycial resurrection of someone 3 days dead, dead people walking around a city, thousands of people being fed with 5 fish, and make claims about the \n existance of demons.. \n \n Frankly, those are rather silly superstitions that in my eyes discredit the possiblity of Christiantiy being accurate.\n \n Not to meantion the belief in hell and salvation.. sheese, where do people ocme up with these crasy ideas.\n \n And, of course, the concept that some religious people have of a 6 day creation a bit over 6000 years ago has been falsified.", 
   {}, 
   92617, 
   null, 
   1108995360.0
  ], 
  [
   92688, 
   null, 
   "Demon38", 
   "I don't have anything you'd consider evidence, but how do you know there won't be evidence in the future. Everything starts with an idea and you're trying to kill the idea by not even considering the possibility. You just blow it by the wayside.  \n \n When there is evidence, I'll consider it! I'm not killing any idea, there is just no support for it! Do you accept what other religions say? Do you believe in Allah, Zeus, Odin, Gaea? Why not? Creationism is an idea that was considered the TRUTH but it has been disproven. Why should I consider an idea that has been proven false???\n As to the existance of God, it is neutral to science, so science doesn't say God exists and it doesn't say God doesn't. But everything we have studied so far in the natural world has NOT required a supernatural explaination,\n when science discovers something that can't possibly be explained by natural forces, I will consider a supernatural entity as a possiblity.\n \n But it's all on your terms only!!! \n \n But the \"terms\" of science are totally objective! Scientists look at the data, test the data repeatedly and what ever the best explaination is for the data, that's what scientists go with! What your doing is saying your conclusion is best, no matter what the data is! You ignore the evidence in favor of your untrue myths and yes, creationism was proven wrong over 200 years ago! You're certainly free to test the evidence yourself, look for new evidence yourself\n but if your going to be totally fair, you have draw your conclusions solely from that evidence! You can't have a conclusion BEFORE you find evidence or start your testing.\n \n I live in handbuilt shack with no electricty, glass or anything else. hah! People survived long before there was science. \n \n You didn't use a hammer and nails on that shack did you? emoticon_rolleyes \n But seriously, before the modern scientific method, people still tried to understand nature. Curiosity has always been a driving force in humans. The scientific method is an extenstion of that thirst for knowledge and it is the best way we've found so far to understand how the natural world works.\n \n It's not 100% though, you said it yourself. Your not even open to new possibilities. \n \n That's right, nothing is 100% true in science. If new data comes along, theories can and do change to accomodate that new data, or they are completely disproven. This is sciences greatest strength, no theory is beyond the evidence, nothing is immune to being changed or falsified.\n \n Look, I think we're getting confused here, let me try to clarify my position and see where that takes us. Like I said before God is unfalsifiable, is there a superme being who started everything, who set up the laws of nature and works through them? I don't know, and since there is no way science can test for this, science can't prove or disprove His existance, God is neutral to science. Many astronomers who accept the Big Bang are Christians, many biologists who accept evolution are Christians, many geologists who accept an old earth are Christians. That's their (and your) right. I don't say science disproves God.\n But since I don't see any evidence FOR God, I'm skeptical, maybe He's there and maybe He's not. I certainly don't look down on those who have greater faith than me.\n But what we can use science for is to disprove some of the myths some Christians have based on a strictly literal reading of the Bible. The earth and the universe is only 6000 years old? Well, all the evidence, like radiometric dating, sedimentation rates, physics, says it's old, roughly 4.5 billion years old. With this model of an old earth, we can make successful predictions, like where certain fossils will be found, where oil fields will be found, where coal deposits will be found, and so far, these predictions have been correct. A reasonable person would have to conclude that yes, the earth is old, not that there is no God. The same with the theory of evolution, a reasonable person looking at the overwhelming evidence objectively would have to conclude that that's how life developed. Now COULD an all powerful, magical entity have supernaturally created everything the way it is by going beyond the natural laws? Yeah, if such a being exists and if this being is omnipotent, then i guess it is a possiblity. Those are 2 big \"if's\" and we have no evidence for either, but this would be outside of the scientific method because science can only examine the natural world. And if God really did work like that, it seems very deceptive, to have a universe that has every appearence of being billions of years old, a planet with every appearence of being over 4 billion years old and life giving every appearence of evolving. Also, if God supernaturally set it up to appeaar that way, shouldn't we examine it that way and draw those conclusions from the evidence God gave us? \n On the flip side, science looks for the most parsimonious explainations, explainations that require the least assumptions. If certain radioactive isotopes have half lives of billions of years, why shouldn't we conclude the earth is old? If mountains take 100s of thousands to millions of years to form, why shouldn't we conclude the earth is old?\n If we see fossil evidence that life has been evolving since it began, why shouldn't we conclude the theory of evolution is true? If we see the mechanisms in all life that cause evolution, why shouldn't we conclude it's true? If we see the evidence with our own eyes, test it endlessly, do things with these theories that could only be done if they were true, why shouldn't we accept them? To assume that God had to magically do all these things, in direct contradiction to all the evidence, is an unnecessay assumption. Why invoke an unprovable, untestable explaination when the evidence can be explained by natural, provable, testable, useful explainations? \n So science doesn't try to disprove God, only the impossible myths some Christians attribute to him due to misinterpreting the stories in the Bible, stories written by primitive people over 3000 years ago, that weren't designed to give scientific explainations in the first place.", 
   {}, 
   92621, 
   null, 
   1108997520.0
  ], 
  [
   92813, 
   null, 
   "Duo_Maxwell", 
   "If your to blind to see, me telling you won't help.\n\n \n You haven't even brought up anything that would support such a argument. \n \n \n\n Whatever, if you can not understand what is written.\n\n \n Do you understand the fallacy of using a word to mean something here and then using the same word to mean something different there? \n \n \n\n I only brought your spelling up because you were in the midst of calling me ignorant and lazy I think and I thought it rather funny.\n\n \n You do realize your inabilty to refute the scientific points brough aganist your argument only reinforces that you don;t understand or are too lazy to research to understand them right? You do notice that when faced with hard facts, your arguments slim down to one liners that have no subatnce? \n \n \n\n Read my post on the other thread your so fond of. When you call a group of people XXXXXX you really should take a look in the mirror. emoticon_xangel\n\n \n I'll take back the comment when you present a argument with 5% scientific substance. Not bloodly likely. lol", 
   {}, 
   92362, 
   null, 
   1109028720.0
  ], 
  [
   92833, 
   null, 
   "zachvac", 
   "I am not going to clog this forum with questions regarding christianity. Put it in the proper forum. Thank you.\n\n \n But you still haven't answered my question in the religion forum where you say it belongs.", 
   {}, 
   92548, 
   null, 
   1109031600.0
  ], 
  [
   92839, 
   null, 
   "zachvac", 
   "I don't know where you're coming from Zachvac, but it seems to me your somewhere out there in left field. Please, stop picking up other people's leftover's. Take religion to the right forum. emoticon_xangel\n\n \n You just don't understand what I'm saying. This has everything to do with creation vs. evolution. The way science (and evolution) works is that you start with observations and test to see if you can form a conclusion. The way religion works is you choose a conclusion and then try to gather evidence supporting that. That's not in left field and not leftovers. The problem is like you said, \n \n \" I don't have anything you'd consider evidence, but how do you know there won't be evidence in the future. Everything starts with an idea and you're trying to kill the idea by not even considering the possibility. You just blow it by the wayside. \"\n \n You make a conclusion and then look for evidence. This isn't a very effective method. This makes you come up with many false pieces of \"evidence\". You start with the fact that god existed and then search for evidence of it. \"The world is perfect\" people say, but there's not a direct cause and effect. In science there must be. The original observation must be proven to be the effect of the theory with all other variables eliminated. Hopefully you get what I'm saying now.", 
   {}, 
   92619, 
   null, 
   1109032020.0
  ], 
  [
   92843, 
   null, 
   "zachvac", 
   "\n \n \n \n I live in handbuilt shack with no electricty, glass or anything else. hah! :) People survived long before there was science.\n \n\n \n \n But you are wrong. Science is a method of thinking. Take hunters for example. They look and make an observation: \"It seems that whenever the food of an animal is somewhere, the animal goes there and we can hunt it\". It is verified. Then they test their hypothesis, they hunt where the food of the creature they are trying to hunt is. They constantly verify it and accept it as a theory, \"If we want to find creature X all we have to do is find where X's food is and we will find X.", 
   {}, 
   92614, 
   null, 
   1109032200.0
  ], 
  [
   92920, 
   null, 
   "HeavenBound", 
   "You haven't even brought up anything that would support such a argument.\n\n \n Your a wall.\n \n \nDo you understand the fallacy of using a word to mean something here and then using the same word to mean something different there?\n\n \n And where did I do this?\n \n \nYou do realize your inabilty to refute the scientific points brough aganist your argument only reinforces that you don;t understand or are too lazy to research to understand them right? You do notice that when faced with hard facts, your arguments slim down to one liners that have no subatnce?\n\n \n Ok, Perfesser, even if I did do more research my stance would not change. \n \n \n \n \nI'll take back the comment when you present a argument with 5% scientific substance. Not bloodly likely. lol\n\n \n I never asked you to. Like the old saying goes it takes a XXXXX to know a XXXXX. :)", 
   {}, 
   92813, 
   null, 
   1109047680.0
  ], 
  [
   92924, 
   null, 
   "HeavenBound", 
   "You just don't understand what I'm saying. This has everything to do with creation vs. evolution. The way science (and evolution) works is that you start with observations and test to see if you can form a conclusion. The way religion works is you choose a conclusion and then try to gather evidence supporting that. That's not in left field and not leftovers. The problem is like you said, \n \n \" I don't have anything you'd consider evidence, but how do you know there won't be evidence in the future. Everything starts with an idea and you're trying to kill the idea by not even considering the possibility. You just blow it by the wayside. \"\n \n You make a conclusion and then look for evidence. This isn't a very effective method. This makes you come up with many false pieces of \"evidence\". You start with the fact that god existed and then search for evidence of it. \"The world is perfect\" people say, but there's not a direct cause and effect. In science there must be. The original observation must be proven to be the effect of the theory with all other variables eliminated. Hopefully you get what I'm saying now.\n\n \n Zachvac different idea's require different method's and honestly I don't think christianity has anything to prove. I have given evolution a fair shot, I believe God made all life on earth to evolve. :)", 
   {}, 
   92839, 
   null, 
   1109048280.0
  ], 
  [
   92927, 
   null, 
   "Socialist", 
   " \n Zachvac different idea's require different method's and honestly I don't think christianity has anything to prove. I have given evolution a fair shot, I believe God made all life on earth to evolve.\n\n \n \n Have you even heard of or can you understand Occam's Razor? If you did, you wouldn't be saying such a silly thing.\n \n \n I never asked you to. Like the old saying goes it takes a XXXXX to know a XXXXX. \n\n \n That statement has no logical meaning. You don't have to be a XXXXX to know a XXXXX any more than you have to be a serial killer to know a serial killer.", 
   {}, 
   92924, 
   null, 
   1109048940.0
  ], 
  [
   92930, 
   null, 
   "HeavenBound", 
   "Have you even heard of or can you understand Occam's Razor? If you did, you wouldn't be saying such a silly thing.\n\n \n Yadayadayada\n \n \nThat statement has no logical meaning. You don't have to be a XXXXX to know a XXXXX any more than you have to be a serial killer to know a serial killer.\n\n \n You know they have used serial killers to track down other serial killers you. Obiviously, that saying was before your time. :)", 
   {}, 
   92927, 
   null, 
   1109049240.0
  ], 
  [
   92943, 
   null, 
   "Socialist", 
   " \n Yadayadayada\n\n \n You really are an idiot. YOu don't even try to understand what it is do you? You are the most moronic fool I have yet met.\n \n \n \n You know they have used serial killers to track down other serial killers you. Obiviously, that saying was before your time.\n\n \n You don't have to be one to know one. I know what a serial killer is. I don't need to be one.\n \n I don't need to be a christian to know a christian\n I don't need to be a millionair to know a millionair\n \n Your **** was just mere rhetoric, nothing more.", 
   {}, 
   92930, 
   null, 
   1109051820.0
  ], 
  [
   92954, 
   null, 
   "HeavenBound", 
   "You really are an idiot. YOu don't even try to understand what it is do you? You are the most moronic fool I have yet met.\n\n \n Sticks and stones, Sticks and Stones. All because I don't agree with what you say or give an answer that is acceptable to you.\n \n \nI don't have to be one to know one. I know what a serial killer is. I don't need to be one.\n \n I don't need to be a christian to know a christian\n I don't need to be a millionair to know a millionair\n \n Your **** was just mere rhetoric, nothing more.\n\n \n What are we getting so worked up about, you have a bad day. :)", 
   {}, 
   92943, 
   null, 
   1109055060.0
  ], 
  [
   92955, 
   null, 
   "Socialist", 
   "You are being ignored now.", 
   {}, 
   92954, 
   null, 
   1109055480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evo What???????", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4240-evo-what.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 4240, 
  "discussion_files": [
   [
    "27397.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4240-evo-what-print.html"
   ], 
   [
    "27398.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4240-evo-what-9-print.html"
   ], 
   [
    "27399.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4240-evo-what-7-print.html"
   ], 
   [
    "27400.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4240-evo-what-5-print.html"
   ], 
   [
    "27401.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4240-evo-what-4-print.html"
   ], 
   [
    "27402.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4240-evo-what-6-print.html"
   ], 
   [
    "27403.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4240-evo-what-8-print.html"
   ], 
   [
    "27404.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4240-evo-what-3-print.html"
   ], 
   [
    "27405.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4240-evo-what-2-print.html"
   ]
  ], 
  "identifier": 4240
 }
]