[
 [
  [
   90210, 
   null, 
   "silver", 
   "Hi I am unable to sleep I have been threw a rough day today my uncle is a pastor and my aunt is my mother's sister I have been in church all my life and now I want my son to have the fun I did as a child I feel he is being robbed becuase of a situation in church \n \n There is a couple a former hooker and her husband a drug dealer who are in charge of the children's ministry and it does not bother anyone about thier background which is recent they are allowed to teach and I am not because I am not married I feel hurt and I feel like this is so unbelievable I do not know what to do", 
   {
    "post_info": {
     "post_title": "Children church"
    }
   }, 
   null, 
   null, 
   1107851040.0
  ], 
  [
   90214, 
   null, 
   "HeavenBound", 
   "You can't use a person's previous sin as a guide to what you will allow them to do in a church, because sin is sin no matter how you look at it and we are all guilty. The issue here is why a single parent is not allowed to teach. Did they say why a single parent is not qualified to teach. It's my feeling anyone who's a parent should be allowed to teach. A single parent is not amoral if they follow Christ. I would highly question the ethics of the church you attend.", 
   {}, 
   90210, 
   null, 
   1107857040.0
  ], 
  [
   90478, 
   null, 
   "jim's trucking", 
   "Seems this has more to do with religion than parenting.\n \n If you really want to be a sunday school teacher, find another church...one without a disdain for single parents.", 
   {}, 
   90214, 
   null, 
   1107969120.0
  ], 
  [
   90525, 
   null, 
   "jkca1", 
   "Hi I am unable to sleep I have been threw a rough day today my uncle is a pastor and my aunt is my mother's sister I have been in church all my life and now I want my son to have the fun I did as a child I feel he is being robbed becuase of a situation in church \n \n There is a couple a former hooker and her husband a drug dealer who are in charge of the children's ministry and it does not bother anyone about thier background which is recent they are allowed to teach and I am not because I am not married I feel hurt and I feel like this is so unbelievable I do not know what to do\n\n \n To quote Monty Python \"Run Away\". If it feels wrong don't stay, don't apoligize, just leave and search until you find somthing that will make you and your kids happy.", 
   {
    "post_info": {
     "post_title": "Follow your gut"
    }
   }, 
   90210, 
   null, 
   1107980100.0
  ], 
  [
   90534, 
   null, 
   "Big Orn", 
   "Or just go to Luckenbach, Texas with Waylon and Willie and the boys...well, maybe not Waylon.\n \n Get out of religion and get back to your former love, which should be God...if I read your post right. Politics and religion are twins - these days.", 
   {}, 
   90525, 
   null, 
   1107982260.0
  ], 
  [
   120429, 
   null, 
   "Adept", 
   "Children have no place in the church. Period.", 
   {}, 
   90210, 
   null, 
   1115788380.0
  ], 
  [
   120483, 
   null, 
   "GOPPhil", 
   "A. In the Christian faith, when somebody is truly saved, their sins - before both God and man - are wiped away. For instance, Paul killed Christians before he was saved, and he later became God's #1 missionary. So, if the hooker/druggie couple are now true Christians, there's no problem with them running Sunday school.\n \n B. Based on that, you should be allowed to teach too. However, it also says in the Bible that teachers in church must have a perfect, upstanding marriage history. You and God may be tight with everything, but since you're a single mom now and not just in the past, that teacher rule does apply. So, if your church uses it against you, it would be Biblical. Unfair, but still from the Word of God. If you want to look for another church, go for it, but also remember that if you stay, God will use you in His own special way and you'll end up doing much more than a Sunday School teacher.", 
   {}, 
   120429, 
   null, 
   1115799240.0
  ], 
  [
   123507, 
   null, 
   "jim's trucking", 
   "Children have no place in the church. Period.\nQuite the contrary, the church is for children, and nobody else!\n \n What is each of us but a child of God?", 
   {}, 
   120429, 
   null, 
   1116260400.0
  ], 
  [
   123511, 
   null, 
   "Truthsayer", 
   "Oh great. Now the parents get to go upstairs to attend service while the kiddies downstairs being are supervised but a hooker and a drug dealer. emoticon_rolleyes Isn't THAT special?\n \n They say that a church is not a sanctuary for Saints but rather a hospital for sinners. Perhaps you would be better off taking your children to a hospital emergency room each Sunday and exposing them to the sickness that passes through there instead. \n \n At my church of recent past, they created a \"prison ministry.\" Some members of the congregation, (specifically, lonely, single, middle aged women,) visited and \"witnessed\" to prisoners at the local county jail. In a matter of months, some of these women found themselves in personal relationships with these men. In time, these men started to appear in the congregation as they were paroled. Eventually some of these women married these guys. One particular man, I would observe \"massaging\" his step-daughters shoulder as the family would sit in service each Sunday. Maybe it was just my intrepretation, but I could swear this loser was \"getting off\" to rubbing that child's back. At the very least, it appeared unnatural. Many others noticed this as well. To make a long story short, many of these \"reborn\" convicts are back in prison today and most of these women are single again.\n \n If it looks like a duck, and quacks like a duck, it's a duck. Simply repeating a few lines from Romans 10:9 does not change the spots on a leapord.", 
   {}, 
   123507, 
   null, 
   1116261660.0
  ], 
  [
   123517, 
   null, 
   "jim's trucking", 
   "Speaking of leopard spots, did you kow that a tiger actually has striped SKIN!", 
   {}, 
   123511, 
   null, 
   1116262140.0
  ], 
  [
   125613, 
   null, 
   "Wez", 
   "The logical solution would seem to not take your children to church then...\n \n Why do they need to go to Church anyway? Surely it should be their choice, rather than you imprinting and your beliefs on them while they are young and incredibly susceptible to persuasion (bar when bed-time starts of course!;)).\n \n -Wez", 
   {}, 
   123517, 
   null, 
   1116616620.0
  ], 
  [
   128176, 
   null, 
   "jyoshu", 
   "The logical solution would seem to not take your children to church then...\n \n Why do they need to go to Church anyway? Surely it should be their choice, rather than you imprinting and your beliefs on them while they are young and incredibly susceptible to persuasion (bar when bed-time starts of course!;)).\n\n \n Oh sure, I can hear it now--\"sure son, it's ok to steal and lie, as long as it's your choice.\" If parents want to take their kids to church, that's their business. They should simply be careful about what church to go to and what their kids are hearing. It's not that hard to do.", 
   {}, 
   125613, 
   null, 
   1116992760.0
  ], 
  [
   129530, 
   null, 
   "Adept", 
   "If parents want to take their kids to church, that's their business. They should simply be careful about what church to go to and what their kids are hearing. It's not that hard to do.\n\n \n Oh sure I can hear it now... \"If parents want to sexually abuse their children, thats their business\".\n \n emoticon_rolleyes\n \n In all seriousness, a choice of religion, IMHO, should be made as a fully aware adult, at the age of at least 18. Chilldren may be made aware of different religions from an early age, but should not be indoctrinated into any of them until they are old enough to make up their own minds.", 
   {}, 
   128176, 
   null, 
   1117254600.0
  ], 
  [
   131853, 
   null, 
   "jyoshu", 
   "In all seriousness, a choice of religion, IMHO, should be made as a fully aware adult, at the age of at least 18. Chilldren may be made aware of different religions from an early age, but should not be indoctrinated into any of them until they are old enough to make up their own minds.\n\n \n What you don't seem to understand is that when it comes to children in church, what you call \"indoctrination\" is mostly just do-good-unto others moral teaching. It's not like little kids are typically being taught seminary-level material . . .\n \n Have you ever heard a 'children's church' sermon? It's typically about helping others, or not lying, or learning to share. What the heck is wrong with that??? And a lot of children's programs in church are a.) educational (such as music and singing which helps train them musically) and b.) helpful to others in the community such as when they take food to shelters or go visit the elderly in nursing homes. \n \n You can't expect parents not to involve their kids in church. There are too many benefits.", 
   {}, 
   129530, 
   null, 
   1117736160.0
  ], 
  [
   131863, 
   null, 
   "Big Orn", 
   "What you don't seem to understand is that when it comes to children in church, what you call \"indoctrination\" is mostly just do-good-unto others moral teaching. It's not like little kids are typically being taught seminary-level material . . .\n \n Have you ever heard a 'children's church' sermon? It's typically about helping others, or not lying, or learning to share. What the heck is wrong with that??? And a lot of children's programs in church are a.) educational (such as music and singing which helps train them musically) and b.) helpful to others in the community such as when they take food to shelters or go visit the elderly in nursing homes. \n \n You can't expect parents not to involve their kids in church. There are too many benefits.\n\n ...and most school teachers will tell you that they deeply appreciate the fact the you have taken your children to church prior to sending them to school and that it's a great benefit to keep them going.", 
   {}, 
   131853, 
   null, 
   1117736580.0
  ], 
  [
   132162, 
   null, 
   "Adept", 
   "You can't expect parents not to involve their kids in church. There are too many benefits.\n\n \n Yes, but they are the same benefits that responsible parents will give thei children any way. Heck, even watching Playschool (do they have this show in the states?) gives the same benefits to a certain extent.\n \n Taking children to attend church indicates to them that going to church, and believeing in god, is simply what you do. Like dressing yourself in the morning, going to school, and so on. The thought of not doing it is impossible.\n \n The church and the bible is a hard lot to swallow. It sets children up for (depending on their church and level of commitment) all sorts of issues later in life. Choosing a religion is a major life event, which can and should dictate how you live your life. It is such a major event, that I believe it should be done only when a person is mature enough to make an educated and informed, rational decision about it.", 
   {}, 
   131853, 
   null, 
   1117769100.0
  ], 
  [
   132167, 
   null, 
   "Adept", 
   "...and most school teachers will tell you that they deeply appreciate the fact the you have taken your children to church prior to sending them to school and that it's a great benefit to keep them going.\n\n \n 1 - Anecdotal evidence isn't really a strong base to argue from. I can just say \"most school teachers detest the fact...\" and we effectively counter each others arguments.\n \n 2 - No doubt they say that because it increases the amount of social interaction the child gets. Playing team sports, being involved in the scouts, doing martial arts and so on will generate similar benefits without making the child biased to a certain religion.", 
   {}, 
   131863, 
   null, 
   1117769340.0
  ], 
  [
   132332, 
   null, 
   "jyoshu", 
   "Yes, but they are the same benefits that responsible parents will give thei children any way. Heck, even watching Playschool (do they have this show in the states?) gives the same benefits to a certain extent.\n\n \n Often that hasn't been my experience with unchurched people. A lot of people view church as a more thorough avenue of moral teaching. Watching Playschool may help kids to learn to share, but it might not instill the principle of such things as obedience to parents or the golden rule. Kids are certain to get a stronger moral teaching at church than they are watching a tv show, assuming the church is good one. That's not to say that unchurched parents can't give their children good moral teaching. But IMO taking kids to church is not unlike the Hillaryism \"it takes a village;\" and church is a great place to do that as it's focus for kids is often pure moral teaching on how kids should relate to others.\n \n \nTaking children to attend church indicates to them that going to church, and believeing in god, is simply what you do. Like dressing yourself in the morning, going to school, and so on. The thought of not doing it is impossible.\n\n \n One can certainly take children to church and at the same time instill the understanding in them that a person can choose whatever religion he or she wants. And there are many things about which you could make the claim you have made. What if a parent wants to take their kids to the movie theater every weekend? Why would you not say the same about that? They can certainly get 'values' from the movies they watch as well. I think you are making a mountain out of a molehill.\n \n \nThe church and the bible is a hard lot to swallow. It sets children up for (depending on their church and level of commitment) all sorts of issues later in life. Choosing a religion is a major life event, which can and should dictate how you live your life. It is such a major event, that I believe it should be done only when a person is mature enough to make an educated and informed, rational decision about it.\n\n \n With all due respect, it sounds like your bias against kids in church is coming from some degree of personal experiences you've had at some point, or perhaps you've fallen into accepting the old stereotype of 'fundie churches', when in fact that is often just a stereotype. Please understand that not everyone has the same experience you may have. Again, you say the Bible is hard to swallow, but I don't see why such things as the golden rule and such values as not coveting, or the idea of 'going the extra mile' with someone is so hard to swallow.", 
   {}, 
   132162, 
   null, 
   1117811700.0
  ], 
  [
   132344, 
   null, 
   "Wez", 
   "In terms of morality, I don't see what the Christian Church has over the scout movement. It has the same basic set of morals, just the scout movement is less religious, more fun and helps people more! Yes you can go to both, but if you want your children to have a good set of morals instilled upon them at a young age, then surely the scout movement is a better option?\n \n -Wez", 
   {}, 
   132332, 
   null, 
   1117813440.0
  ], 
  [
   133597, 
   null, 
   "Big Orn", 
   "1 - Anecdotal evidence isn't really a strong base to argue from. I can just say \"most school teachers detest the fact...\" and we effectively counter each others arguments.\n \n 2 - No doubt they say that because it increases the amount of social interaction the child gets. Playing team sports, being involved in the scouts, doing martial arts and so on will generate similar benefits without making the child biased to a certain religion.\n\n I'm inclined to believe that it is the spiritual conditioning in children that makes the difference. But, as with all things human, once they discover \"attention\" and crave it, God takes a back seat.\n \n This is what's referred to here in the country as \"smelling themselves\".\n \n BTW - most churches here (and elsewhere, I believe) have no hidden agenda or sequence of operations, where their basic function is to \"cram God down the throats\" of the youngsters.", 
   {}, 
   132167, 
   null, 
   1118071140.0
  ], 
  [
   134674, 
   null, 
   "gnojek", 
   "Often that hasn't been my experience with unchurched people.\n\n I'd like to know how you can tell the \"churched\" from the \"unchurched.\"\n \n \nA lot of people view church as a more thorough avenue of moral teaching. \n\n But \"a lot of people\" would be wrong.\n It's much more than that.\n \n You don't just learn morals, like \"don't steal.\"\n You learn \"morals\" like \"don't steal, but if you do, Jesus died for your sins and he loves you and forgives you but only if you believe.\"\n \n \nThat's not to say that unchurched parents can't give their children good moral teaching. But IMO taking kids to church is not unlike the Hillaryism \"it takes a village;\" and church is a great place to do that as it's focus for kids is often pure moral teaching on how kids should relate to others.\n\n A lot of \"churched\" people do not see church as a social hang out event.\n When my mother got \"saved\" when we were kids, she would bring us to the big evangelist church where we would sit with 3000 others for 2 hours, then leave when the sermon was over. It wasn't some neighborhood church where everyone knows everyone. Not all churches are extended cliques. \n \n \n \nOne can certainly take children to church and at the same time instill the understanding in them that a person can choose whatever religion he or she wants.\n\n So, they take the kid to church, tell them to kneel, sit, stand, pray, take communion, but not until they've reached that point in catechism. Then after all that, they are told, you really didn't have to do all that or believe all this stuff, because you can chose any religion you want. By the way, we're coming next Sunday too, and every sunday after that, until you're 18.\n \n Would you go to a Hindu temple without believing in it?\n Just for the education?\n Would you take your kids there every sunday and tell them they can chose whatever religion suits them?\n How about throwing a rug toward Mecca and praying to Allah 5 times a day?\n Would you make your kids do that, then tell them they have a choice?\n I really doubt it.\n \n \n Children belong in church as much as they belong in a porn shop.", 
   {}, 
   132332, 
   null, 
   1118260680.0
  ], 
  [
   134700, 
   null, 
   "Beowulf Lee", 
   "Unfortunatly, that would be defeating the purpose of life (biologically). There's this theory, I think, that humans are moving away from the normal self replicating system of sexual reproduction to pass their genes. Instead, the passing down of their ideas is more important. If parents were to allow their kids to choose without any kind of bias, then most kids will certainly be lazy and choose not to go to church.", 
   {}, 
   134674, 
   null, 
   1118262840.0
  ], 
  [
   134705, 
   null, 
   "gnojek", 
   "No church. Sounds good.\n \n But some kids might just chose to go to church, you never know.", 
   {}, 
   134700, 
   null, 
   1118263020.0
  ], 
  [
   134979, 
   null, 
   "Adept", 
   "If parents were to allow their kids to choose without any kind of bias, then most kids will certainly be lazy and choose not to go to church.\n\n \n But surely they should be able to make that choice for themselves, free of bias?\n \n If a kid is told, at least once a week since he was a todler that unless he believes in Christ and accepts him as his saviour, then he will burn in eternal hell, then telling that same kid at age 18 that he can now choose any religion he wants is laughable. At best, you are going to get a severly confused young man.\n \n Church certainly gives great benefits, like decent morals and so on. But these benefits are not monopolised by the church. You can get the same benefits from the scout movement, through good interactive parenting, through selective schooling, etc.\n \n Children in the church are told that there is only one God, and you must believe in him and follow his commandments in the bible or forever burn in hell. Okay, probably not that specifically, but that's the gist of it. That greatly influences a persons ability to impartially select a spiritual path later in life.\n \n It's like raising your kid to be a Plumber. Training him from childhood. Telling him that there are other career paths available, but if he follows them he will burn in hell forever. When that kid comes of age and is looking for an apprenticeship, he will choose Plumbing, because that is what he has always been told he should do. The same applies for religion.\n \n People should be able to choose freely, and a major part of that is having an impartial childhood free from influence either way.", 
   {}, 
   134700, 
   null, 
   1118328960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Children church", 
  "url": "http://www.4forums.com/political/parenting/4252-children-church.html", 
  "breadcrumbs": [
   "Parenting"
  ], 
  "id_number": 4252, 
  "discussion_files": [
   [
    "23596.html", 
    "http://www.4forums.com/political/parenting/4252-children-church-print.html"
   ], 
   [
    "23597.html", 
    "http://www.4forums.com/political/parenting/4252-children-church-2-print.html"
   ]
  ], 
  "identifier": 4252
 }
]