[
 [
  [
   90825, 
   null, 
   "dutch", 
   "Morgan Spurlock, director and star of \"Super Size Me: A film of epic proportions,\" is releasing an edited version of the film for classrooms. The school version of the Academy-Award nominated film is scheduled to be released after the Feb. 27 Oscars. personally I think that the film will be great to help solve Americas Obesity issues and if not convince children to not eat Mcdonalds for a month", 
   {
    "post_info": {
     "post_title": "Did somebody say Mcdonalds"
    }
   }, 
   null, 
   null, 
   1108092720.0
  ], 
  [
   90921, 
   null, 
   "sinjin", 
   "Morgan Spurlock, director and star of \"Super Size Me: A film of epic proportions,\" is releasing an edited version of the film for classrooms. The school version of the Academy-Award nominated film is scheduled to be released after the Feb. 27 Oscars. personally I think that the film will be great to help solve Americas Obesity issues and if not convince children to not eat Mcdonalds for a month\n\n \n I enjoyed the film as well. The problem as I see it is that children don't control their food choices in many cases. They eat what is at hand. Parents and schools need to limit children's choices to better foodstuffs.", 
   {}, 
   90825, 
   null, 
   1108145460.0
  ], 
  [
   90935, 
   null, 
   "jkca1", 
   "Morgan Spurlock, director and star of \"Super Size Me: A film of epic proportions,\" is releasing an edited version of the film for classrooms. The school version of the Academy-Award nominated film is scheduled to be released after the Feb. 27 Oscars. personally I think that the film will be great to help solve Americas Obesity issues and if not convince children to not eat Mcdonalds for a month\n\n \n Parents want convenience and to pacify their children with a \"Happy Meal\". Most kids don't ask for lettuce, they ask for burgers. Wonder why McDonalds doesn't add a Soy burger to their menu? They have salads and adding soy products would be another way to show they \"care\" about health. The answer might be they have done consumer research and found the costs to create/market a new soy product outweight the profits.", 
   {
    "post_info": {
     "post_title": "The film will make no difference in eating habits"
    }
   }, 
   90825, 
   null, 
   1108150080.0
  ], 
  [
   91042, 
   null, 
   "dutch", 
   "Exactly, I think we should get rid of \"happy meals\" and put in healthy food like wendys did. And then in schools have an alternative, cheaper lunch.", 
   {}, 
   90935, 
   null, 
   1108176300.0
  ], 
  [
   91057, 
   null, 
   "zachvac", 
   "This is the fault of the parent mainly. They need to teach their children that eating healthy is a priority. On most nights (once in a while we go to get fast food or to a restaurant), we have a fruit with breakfast and a fruit and vegetable at lunch and dinner. The other thing is people need to be active. Too many people (kids and adults) sit in front of the TV too long. Get outside and do something. Ride a bike, run, walk, play a sport, play a pick-up neighborhood game, anything to get you moving. It isn't that hard and it's fun. But too many children are choosing TV for hours instead and not only do adults allow them to but the adults are also watching TV way too much and that's why we are obese. Then there's this obsession with fad diets which promise great results with no work. Here's some news for people: If you want to lose weight, you have to work at it. There may be many other ways but this is a very good method that has been proven and tested time and time again. It's a big secret, so I'm going to tell you now and you'll know. You may not believe it will work, but if you try it you will succeed. Now for the weight loss program:\n \n Eat a variety of foods, eat less fat, and exercise more.\n \n I know, people are probably laughing at this wondering how it will ever work, but even though it's an ancient out-dated method, it works. :)", 
   {}, 
   91042, 
   null, 
   1108188000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Did somebody say Mcdonalds", 
  "url": "http://www.4forums.com/political/current-events-debates/4276-did-somebody-say-mcdonalds.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 4276, 
  "discussion_files": [
   [
    "21600.html", 
    "http://www.4forums.com/political/current-events-debates/4276-did-somebody-say-mcdonalds-print.html"
   ]
  ], 
  "identifier": 4276
 }
]