[
 [
  [
   91058, 
   null, 
   "zachvac", 
   "I think what we should do in the court system is just ask the accused person if they are guilty or innocent. Then we either sentence them accordingly or let them go. First off this saves a ton of money on a trial and tons of money on the food, shelter, etc. for the prisoners. And if the criminal is a murderer it even helps lower the population. Think: more money, less people, more money per person on average. Sound good to everyone else?", 
   {
    "post_info": {
     "post_title": "new Court System"
    }
   }, 
   null, 
   null, 
   1108188240.0
  ], 
  [
   91343, 
   null, 
   "Socialist", 
   "You aren't serious are you? You really expect a government to ask a criminal whether or not he is guilty or innocent? T his isn't going to work a bit.\n \n \n \n\n I think what we should do in the court system is just ask the accused person if they are guilty or innocent. Then we either sentence them accordingly or let them go. First off this saves a ton of money on a trial and tons of money on the food, shelter, etc. for the prisoners. And if the criminal is a murderer it even helps lower the population. Think: more money, less people, more money per person on average. Sound good to everyone else?\n\n \n Though experiment. I am a murderor. You ask me if I killed someone. I say \"nope.\" Case closed. Bye bye!\n \n The reason why prisons are Good is that they server social utility by separating criminals from mainstream society. They also provide work for a great many officers. Yes, they are costly, but they are necessary.\n \n Overpopulation isn't really a problem for a major industrialized nation such as the united states. Most industiralized nations actually have a problem counter to that: decreasing population or inability to maintain population equilibrium.\n \n Killing them, as it stands now, does not serve utility either. It's also too costly. They need a way to moderate the appeals process in light of cost/fairness.\n \n The life of the individual is inhernetly of neutral value. All that matters is how much keeping/killing him serves social utility.", 
   {}, 
   91058, 
   null, 
   1108408680.0
  ], 
  [
   91441, 
   null, 
   "zachvac", 
   "Yes, I was kidding. Did you really think I believed in a system that would ask if they were guilty. I was joking in terms of overpopulation as well. Of course there are other ways to restrict population and I was just presenting a (I hope funny) reform to the government. I wasn't advocating it at all.", 
   {}, 
   91343, 
   null, 
   1108435320.0
  ], 
  [
   91456, 
   null, 
   "Socialist", 
   "Yes, I was kidding. Did you really think I believed in a system that would ask if they were guilty. I was joking in terms of overpopulation as well. Of course there are other ways to restrict population and I was just presenting a (I hope funny) reform to the government. I wasn't advocating it at all.\n\n \n \n Yes. I did think you were serious, because a lot of people are serious about crazy things. How is it a reform if it's totally silly? That's like asking Bush not to be an idiot, therefor fixing the presidency.", 
   {}, 
   91441, 
   null, 
   1108440120.0
  ], 
  [
   91608, 
   null, 
   "zachvac", 
   "Yes. I did think you were serious, because a lot of people are serious about crazy things. How is it a reform if it's totally silly? That's like asking Bush not to be an idiot, therefor fixing the presidency.\n\n \n And that would be just as far-fetched as asking a criminal if he is guilty or not. Either way, it's totally rediculous. Letting murderers kill to control population? Really, who would believe in that?", 
   {}, 
   91456, 
   null, 
   1108512480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  new Court System", 
  "url": "http://www.4forums.com/political/crime-debates/4288-new-court-system.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 4288, 
  "discussion_files": [
   [
    "18008.html", 
    "http://www.4forums.com/political/crime-debates/4288-new-court-system-print.html"
   ]
  ], 
  "identifier": 4288
 }
]