[
 [
  [
   91495, 
   null, 
   "JustineCredible", 
   "The ultra-conservative throws daughter out of the family's Chicago apartment\n \n ANNAPOLIS, MD - Maya Marcel-Keyes, the daughter of former Republican Party senate candidate Alan Keyes, spoke publicly for the first time about her sexuality Monday acknowledging that she is a lesbian.\n \n During the Republican National Convention, the ultra-conservative Alan Keyes condemned gays and lesbians characterizing them as \"self hedonist\" in an interview with Sirius OutQ's Michelangelo Signorile. \n \n Asked later if Vice President Dick Cheney's lesbian daughter, Mary, is a selfish hedonist, Keyes answered that she is. Those harsh comments drew ire from many in the Republican Party including Cheney and Senator John McCain. \n \n \"If my own daughter were a homosexual, or a lesbian, I would love my daughter, but I would tell my daughter that she was in sin,\" Keyes said in August during the campaign. At the time, he also told reporters, \"I would urge her to pray to God for help to deal with that sin.\"\n \n Maya Keyes worked last summer on her father's unsuccessful campaign against Barack Obama in Illinois's U.S. Senate race. Although Keyes lost in a landslide to Obama, he vowed to remain in Illinois politics. He also had failed presidential bids in 1996 and 2000.\n \n Months after the election, the 19-year-old Maya came out Monday during an Equality Maryland rally in Annapolis, Md.\n \n Maya told the Washington Post Monday her parents, Keyes and his wife, Jocelyn, threw her out of the family's Chicago apartment, will not pay her college tuition and stopped speaking to her.\n\n \n What un-Christian like behavior! \n \n \n \n According to the Washington Post, despite the fact that Maya has been kicked out of her home, a San Francisco-based charity, the Point Foundation, has stepped in to provide the money needed for Maya to begin her studies at Brown University this fall.", 
   {
    "post_info": {
     "post_title": "And this man calls himself a Christian..."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1108474380.0
  ], 
  [
   91505, 
   null, 
   "joebrummer", 
   "at least when she gets here, she is coming to a gay friendly city! With a gay mayor and olts of new supportive friends to meet.", 
   {}, 
   91495, 
   null, 
   1108482060.0
  ], 
  [
   91508, 
   null, 
   "jyoshu", 
   "And given that she's a high-profile supposedly rejected person who's the child of a well-known Republican (and therefore a valuable poster-child to their movement to demonize their political opposition), I'm sure they'll roll the red carpet out for her.\n \n By the way, Alan Keyes is well-known for going way over the top with his rhetoric, but he doesn't represent anyone in particular but himself. Many Republicans have distanced themselves from him and have disagreed with his antics.", 
   {}, 
   91505, 
   null, 
   1108482780.0
  ], 
  [
   91511, 
   null, 
   "joebrummer", 
   "And given that she's a high-profile supposedly rejected person who's the child of a well-known Republican (and therefore a valuable poster-child to their movement to demonize their political opposition), I'm sure they'll roll the red carpet out for her.\n \n By the way, Alan Keyes is well-known for going way over the top with his rhetoric, but he doesn't represent anyone in particular but himself. Many Republicans have distanced themselves from him and have disagreed with his antics.\n\n Brown could care less, so many famous people have their children at Brown. Brown doesn't care.", 
   {}, 
   91508, 
   null, 
   1108484280.0
  ], 
  [
   91572, 
   null, 
   "JustineCredible", 
   "And given that she's a high-profile supposedly rejected person who's the child of a well-known Republican (and therefore a valuable poster-child to their movement to demonize their political opposition), I'm sure they'll roll the red carpet out for her.\n \n By the way, Alan Keyes is well-known for going way over the top with his rhetoric, but he doesn't represent anyone in particular but himself. Many Republicans have distanced themselves from him and have disagreed with his antics.\n\n \n Yeah, as has all of the Illinois Republican party. What a mistake he was! \n I live here in Illinois, I have heard Alan Keyes' rhetoric and extremist views. \n \n I say More Power to Her! \n She's taking this public, she's not going quietly or stepping out of public light like Mary Cheney. She's voicing her opinions and backing down! \n Her father's ultra-extremist views only make him look like a monster in comparisson.", 
   {}, 
   91508, 
   null, 
   1108497420.0
  ], 
  [
   91576, 
   null, 
   "wsm2506", 
   "And given that she's a high-profile supposedly rejected person who's the child of a well-known Republican (and therefore a valuable poster-child  to their movement to demonize their political opposition), I'm sure they'll roll the red carpet out for her.\n \n By the way, Alan Keyes is well-known for going way over the top with his rhetoric, but he doesn't represent anyone in particular but himself. Many Republicans have distanced themselves from him and have disagreed with his antics.\n\n \n And what is wrong with that? She, because of her notariety, represents a vast number of similar situations less notable. I know it from personal experience; the rejection by my fundalmentalist Baptist minister father and the rest of my family, save one. You, on the otherhand, would prefer to languish in your ignorance and pretend that such things. and worse, never occur at all. Believe me, it is much more common than you care to believe.\n \n Do not Pat Robertson, Jerry Falwell, and James Dobson set themselves up as poster children for their supposed morality?", 
   {}, 
   91508, 
   null, 
   1108497780.0
  ], 
  [
   91582, 
   null, 
   "JustineCredible", 
   "And what is wrong with that? She, because of her notariety, represents a vast number of similar situations less notable. I know it from personal experience; the rejection by my fundalmentalist Baptist minister father and the rest of my family, save one. You, on the otherhand, would prefer to languish in your ignorance and pretend that such things. and worse, never occur at all. Believe me, it is much more common than you care to believe.\n \n Do not Pat Robertson, Jerry Falwell, and James Dobson set themselves up as poster children for their supposed morality?\n\n \n \n And see this is what I'm talking about. Maya has done some voluteer work for HRC and other groups in the Maryland area, one of them is looking out for other \"throw-away\" kids who are homeless because their parents kicked them out for being gay. And here she is, never imagining her father would DARE do that to her...and look what he does anyway. \n He's only helping her cause by doing what he did. \n He not only kicked her out of the apartment, but cut off her school funding...granted a SanFrancisco charity picked up the tab for school and someone found her a place to stay. \n \n I'm glad she went public with this. I sheds a light on the hundreds of other \"throw-away\" kids out there. I used to volunteer/councel for a group in Chicago...we delt with a lot of kids who were simply tossed out like so much garbage, all because their parents couldn't deal with their child being gay.", 
   {}, 
   91576, 
   null, 
   1108499040.0
  ], 
  [
   91597, 
   null, 
   "jkca1", 
   "Being a Christian has many meanings so judge not lest ye not be judged... If Keyes turned the other cheek would that make you all happy? His daughter is over 18 and mommy and daddy cut her off because they disaprove of her lifestyle. What's wrong with that? She's an adult and like many others will now have to find her way through life without her parents money. Oh the sorrow. Let's all take up a collection so she can get through this crisis. emoticon_cry", 
   {
    "post_info": {
     "post_title": "Where is the problem here?"
    }
   }, 
   91582, 
   null, 
   1108507140.0
  ], 
  [
   91605, 
   null, 
   "MrWriteLA", 
   "Being a Christian has many meanings so judge not lest ye not be judged... If Keyes turned the other cheek would that make you all happy? His daughter is over 18 and mommy and daddy cut her off because they disaprove of her lifestyle. What's wrong with that? She's an adult and like many others will now have to find her way through life without her parents money. Oh the sorrow. Let's all take up a collection so she can get through this crisis. emoticon_cry\n Yeah, right. That's all that matters when it comes to parents. Money. \n Sheesh...", 
   {}, 
   91597, 
   null, 
   1108510980.0
  ], 
  [
   91611, 
   null, 
   "jyoshu", 
   "And what is wrong with that? She, because of her notariety, represents a vast number of similar situations less notable. I know it from personal experience; the rejection by my fundalmentalist Baptist minister father and the rest of my family, save one. You, on the otherhand, would prefer to languish in your ignorance and pretend that such things. and worse, never occur at all. Believe me, it is much more common than you care to believe.\n\n \n Of course they occur, don't be silly. But let's be realistic; we don't really know much at all what dynamics have gone on in the Keyes family, do we? The matter may go much deeper, to matters not even related to homosexuality.\n \n It's fascinating that, for people who are so concerned about their right to privacy, you all won't hesitate to jump all over cases where there are obvious family problems that should be resolved privately.", 
   {}, 
   91576, 
   null, 
   1108515060.0
  ], 
  [
   91612, 
   null, 
   "jyoshu", 
   "And let me also point out that a much more noble cause than trying encourage and cheer a daughter or son to break away from parents at the first sign of parental disapproval just might be to make the focus on reconciliation and healing of a family. emoticon_rolleyes", 
   {}, 
   91611, 
   null, 
   1108515240.0
  ], 
  [
   91641, 
   null, 
   "Socialist", 
   "I think it's funny and ironically just how Keyens get's his cumuppence in the most deliciously personal way. Too bad for her, though.", 
   {}, 
   91612, 
   null, 
   1108531620.0
  ], 
  [
   91652, 
   null, 
   "JustineCredible", 
   "Being a Christian has many meanings so judge not lest ye not be judged... If Keyes turned the other cheek would that make you all happy? His daughter is over 18 and mommy and daddy cut her off because they disaprove of her lifestyle. What's wrong with that? She's an adult and like many others will now have to find her way through life without her parents money. Oh the sorrow. Let's all take up a collection so she can get through this crisis. emoticon_cry\n\n \n \"judge not least ye be judged\" Really? Well, guess that gives his daughter and every other gay and lesbian the right to judge him! He has passed judgement upon every one of us, over and over again. \n \n He was not struck in the face by anyone. His daughter did what she was taught to do, BE HONEST! \n Even though she is nineteen years old, has no income of her own, was a full-time student and an employee of her father's. (of which he offered her NO compensation.)\n As a Christian minister, he has been charged with a crisis of which he had to face and overcome. He failed that challenge. He turned his own flesh and blood out to the street. He cut her off from school funding, and offered her no severence after firing her from his employment. \n \n I don't know about you or what kind of heartless family you came from, but in my family there was an understanding. If we were in school full-time, we would be allowed room and board in our parents' home. If we were not in school we would be expected to gain employment and to pay a minimal fee for rent. \n Reverand Keyes didn't even extend that common courtesy to his own daughter....and he calls himself a Christian! \n Among other charges as a christian, charity is one....HE SHOWED NONE TO HIS OWN FLESH AND BLOOD!", 
   {}, 
   91597, 
   null, 
   1108545240.0
  ], 
  [
   91653, 
   null, 
   "JustineCredible", 
   "And let me also point out that a much more noble cause than trying encourage and cheer a daughter or son to break away from parents at the first sign of parental disapproval just might be to make the focus on reconciliation and healing of a family. emoticon_rolleyes\n\n \n \n Roll your eyes in the mirror darlin...Reverand Keyes KICKED HIS OWN DAUGHTER OUT OF HER HOME!!!! \n \n She didn't strike out on her own, her father kicked her out! \n \n Yes, there needs to be some healing in that family...but from the accounts I have read (and one of them from her own mouth to my ear!) is that he was more affraid of her bringing in other \"homo-strays\" and poisoning his home! \n \n She had been doing charity work in Maryland and had just gone back there from Illinois to visit one of the kids she had been working with, in the hospital after he had been brutally beaten. Her father blew up because this child was openly gay. He was homeless because his parents had tossed him out and he was living in the streets.\n Just two days later he was discharged from the hospital and turned back out into the street. The very next morning he was found dead.\n The argument happened between Maya and her father over this poor child's passing. He called him un-repeatable names, he said she was no better if she refused to change her ways and live as he wanted her to. She refused and he said she could then join her \"friends\" if that's how she wanted to live her life!", 
   {}, 
   91612, 
   null, 
   1108545720.0
  ], 
  [
   91692, 
   null, 
   "jyoshu", 
   "Yes, there needs to be some healing in that family...but from the accounts I have read (and one of them from her own mouth to my ear!) \n\n \n Hmm . . . quite the connected activist aren't you?\n \n You're meddling in the affairs of a family that is none of your business. It's one thing to lend an ear, it's another thing to make their family conflicts more public than they need to be (and the motivation probably has a lot to do with the chance to vilify a high-profile Republican).", 
   {}, 
   91653, 
   null, 
   1108578840.0
  ], 
  [
   91700, 
   null, 
   "JustineCredible", 
   "Hmm . . . quite the connected activist aren't you?\n \n You're meddling in the affairs of a family that is none of your business. It's one thing to lend an ear, it's another thing to make their family conflicts more public than they need to be (and the motivation probably has a lot to do with the chance to vilify a high-profile Republican).\n\n \n \n Hmmm...quite a double standard here isn't there. First you get all pissy that supposedly we don't know anything about the Keyes family or Maya. But when confronted with facts, you question my motivation? \n \n Well of course I was going to highlight the hypocritical actions of such an outspoken opponent to Gay Marriage and Gay Rights in general. What example should I be using? Joe Schmoe the recluse at the end of the street? Yeah, like that would exemplify my activism.........NOT! \n \n Get real. \n Face the facts, Reverand Keyes is a two-faced hypocrit who cares more for how his buddies on the Religion-Right think of him than of the wellfare of his own FLESH AND BLOOD! \n He thinks more of his made up responcibility to the public rather than his VERY REAL responcibility to his own DAUGHTER! \n \n He chose to turn a blind eye to the GOOD work she had been doing and insted escentially slapped her in the face and told her she was no better than those whom she administered charity. \n What kind of a father does that? \n What kind of a parent turns their own child out to the street? \n What kind of a parent calls his child filthy names? \n \n \n Reverand Keyes is NO CHRISTIAN! \n \n He hides behind his title expecting to use it as a sheild from those who rightfully call his hatefilled actions for what they are! He exploits the idea of Christianity by using it to continue his evil acts upon others...even his own family! \n \n I don't need to vilify him...he does it well enough on his own! \n I just pointed out the obvious.", 
   {}, 
   91692, 
   null, 
   1108580820.0
  ], 
  [
   91710, 
   null, 
   "jkca1", 
   "\n I don't know about you or what kind of heartless family you came from, but in my family there was an understanding. \n\n \n Wonderful to see you are back Mrs. Cleaver. How is Ward and the boys?", 
   {}, 
   91652, 
   null, 
   1108581780.0
  ], 
  [
   91735, 
   null, 
   "BobNelson2", 
   "You're meddling in the affairs of a family that is none of your business. It's one thing to lend an ear, it's another thing to make their family conflicts more public than they need to be (and the motivation probably has a lot to do with the chance to vilify a high-profile Republican).\n\n \n Considering that Mr. Keyes' chief claim to fame is his desire to stick his judgemental nose and that of the government into any family with a gay person in it, our \"meddling in the affairs of his family\" by merely commenting on them seems quite mild.\n \n That he is a \"high-profile Republican\" says more about the party than it does about our motivation to vilify him.", 
   {}, 
   91692, 
   null, 
   1108588260.0
  ], 
  [
   91762, 
   null, 
   "JustineCredible", 
   "Wonderful to see you are back Mrs. Cleaver. How is Ward and the boys?\n\n \n \n You know, that's really sad. That if you think my family was anything close to the fantasy created television sit-com of the 1950's, then I must guess your mother must have been Erzsebet Bathory? \n \n emoticon_ic\n \n \n That might explain a lot.", 
   {}, 
   91710, 
   null, 
   1108595160.0
  ], 
  [
   91824, 
   null, 
   "JPSartre12", 
   "\"judge not least ye be judged\" Really? Well, guess that gives his daughter and every other gay and lesbian the right to judge him! He has passed judgement upon every one of us, over and over again. \n \n He was not struck in the face by anyone. His daughter did what she was taught to do, BE HONEST! \n Even though she is nineteen years old, has no income of her own, was a full-time student and an employee of her father's. (of which he offered her NO compensation.)\n As a Christian minister, he has been charged with a crisis of which he had to face and overcome. He failed that challenge. He turned his own flesh and blood out to the street. He cut her off from school funding, and offered her no severence after firing her from his employment. \n \n I don't know about you or what kind of heartless family you came from, but in my family there was an understanding. If we were in school full-time, we would be allowed room and board in our parents' home. If we were not in school we would be expected to gain employment and to pay a minimal fee for rent. \n Reverand Keyes didn't even extend that common courtesy to his own daughter....and he calls himself a Christian! \n Among other charges as a christian, charity is one....HE SHOWED NONE TO HIS OWN FLESH AND BLOOD!\n\n \n I've got to admit that I have mixed feelings about this story. On one hand, it seems a little harsh of Keyes to throw his daughter out because she's gay. On the other hand, the daughter probably would have been allowed to stay had she not publically announced her gayness. As the daughter of a minister, she, of all people would know that such an act would not sit well with her Christian father and would be seen as a challenge to his authority. \n This very well may have been a deliberate, calculated act on her part to discredit her father or challenge his authority over his own house. \n Bottom line: She's an adult that chose to go against her father's house rules. If she was my adult daughter and challenged my house rules, she might find herself on her own as well. While I wouldn't toss her out just for being gay, if she challenged my authority and refused to live under my house rules, then it'd be time for her to leave my house. Period.", 
   {}, 
   91652, 
   null, 
   1108612080.0
  ], 
  [
   91834, 
   null, 
   "JakeCJB", 
   "I've got to admit that I have mixed feelings about this story. On one hand, it seems a little harsh of Keyes to throw his daughter out because she's gay. On the other hand, the daughter probably would have been allowed to stay had she not publically announced her gayness. As the daughter of a minister, she, of all people would know that such an act would not sit well with her Christian father and would be seen as a challenge to his authority. \n This very well may have been a deliberate, calculated act on her part to discredit her father or challenge his authority over his own house. \n Bottom line: She's an adult that chose to go against her father's house rules. If she was my adult daughter and challenged my house rules, she might find herself on her own as well. While I wouldn't toss her out just for being gay, if she challenged my authority and refused to live under my house rules, then it'd be time for her to leave my house. Period.\n\n \n So if it were you, you wouldn't throw her out for being gay. You would throw her out for not following your rules. Your rule is that she not say anything about being gay. The only reason she wouldn't say anything about who she is, is because she is ashamed of being gay. Being gay is nothing to hide or to be ashamed of. So, the rule is that she must conform to the personal prejudices of others. Also, the rule is that she cannot express her own personal views which harm no one.", 
   {}, 
   91824, 
   null, 
   1108615860.0
  ], 
  [
   91835, 
   null, 
   "jyoshu", 
   "Considering that Mr. Keyes' chief claim to fame is his desire to stick his judgemental nose and that of the government into any family with a gay person in it, our \"meddling in the affairs of his family\" by merely commenting on them seems quite mild.\n\n \n Justine said she's been in contact with his daughter. That's a bit more that commenting. I just think it's interesting that an organization that helps gay people pay for college would help her do so, when she perhaps more than others could find a means to pay for it (even without her father's direct help--she could probably get speaking engagements on her own!).\n \n \nThat he is a \"high-profile Republican\" says more about the party than it does about our motivation to vilify him.\n\n \n Since most Republicans are troubled by him, it says they are not really too keen on his antics. But that doesn't mean he is isn't entitled to privacy in his family life.", 
   {}, 
   91735, 
   null, 
   1108617180.0
  ], 
  [
   91843, 
   null, 
   "BobNelson2", 
   "Since most Republicans are troubled by him, it says they are not really too keen on his antics.\n \n \n They are not too keen on his words. His sentiments, they embrace.\n \n \nBut that doesn't mean he is isn't entitled to privacy in his family life.\n\n \n No one is invading his privacy. His family itself, he and his daughter, made this a public discussion.", 
   {}, 
   91835, 
   null, 
   1108621080.0
  ], 
  [
   91848, 
   null, 
   "JustineCredible", 
   "I've got to admit that I have mixed feelings about this story. On one hand, it seems a little harsh of Keyes to throw his daughter out because she's gay. On the other hand, the daughter probably would have been allowed to stay had she not publically announced her gayness. As the daughter of a minister, she, of all people would know that such an act would not sit well with her Christian father and would be seen as a challenge to his authority. \n This very well may have been a deliberate, calculated act on her part to discredit her father or challenge his authority over his own house. \n Bottom line: She's an adult that chose to go against her father's house rules. If she was my adult daughter and challenged my house rules, she might find herself on her own as well. While I wouldn't toss her out just for being gay, if she challenged my authority and refused to live under my house rules, then it'd be time for her to leave my house. Period.\n\n \n See that's where you have your timeline mixed up. She went public AFTER she was dismissed from her home. \n Keep your backwards therory, it's flat out wrong.", 
   {}, 
   91824, 
   null, 
   1108624680.0
  ], 
  [
   91850, 
   null, 
   "JustineCredible", 
   "Justine said she's been in contact with his daughter. That's a bit more that commenting.\n\n \n \n FWI, just so you don't get things mixed up again. I've been on speaking terms with Maya for several years. Actually since she was sixteen. I do not need to go into detail as to how or why. I have nothing to prove to you or anyone else. \n \n \n I just think it's interesting that an organization that helps gay people pay for college would help her do so, when she perhaps more than others could find a means to pay for it (even without her father's direct help--she could probably get speaking engagements on her own!).\n\n \n She was offered the monitary aid before her public announcement. \n Again, your assumptions have put your foot in it as usual. \n \n \n \nSince most Republicans are troubled by him, it says they are not really too keen on his antics. But that doesn't mean he is isn't entitled to privacy in his family life.\n\n \n Oh, so in other words she should have just gone quitely, allowed this very public man, with his extremist ideas, to unjustly toss his own daughter out to the street without so much as a \"thanks, but no thanks.\" \n In other words, you would have prefered she become yet another Mary Cheney.", 
   {}, 
   91835, 
   null, 
   1108625580.0
  ], 
  [
   91881, 
   null, 
   "JPSartre12", 
   "So if it were you, you wouldn't throw her out for being gay. You would throw her out for not following your rules. Your rule is that she not say anything about being gay. The only reason she wouldn't say anything about who she is, is because she is ashamed of being gay. Being gay is nothing to hide or to be ashamed of. So, the rule is that she must conform to the personal prejudices of others. Also, the rule is that she cannot express her own personal views which harm no one.\n\n \n Sorry to burst your bubble, but I don't have any rules about sexual orientation in my house, so it wouldn't be an issue worthy of being tossed.....in my house. Now, if I was a minister and had a rebelious daughter who tested our family's moral underpinnings on a regular basis, I'd consider it.\n Knowing that her father is a highly visible person in the community, I don't see any value to her or her family in coming out. \n In your idealistic world, you would want her to announce it to the world, but doing so, in the real world, often times has negative consequences. Just look at the military, for example. Don't ask; don't tell is the policy for a reason that transcends \"idealism\".", 
   {}, 
   91834, 
   null, 
   1108654860.0
  ], 
  [
   91882, 
   null, 
   "JPSartre12", 
   "See that's where you have your timeline mixed up. She went public AFTER she was dismissed from her home. \n Keep your backwards therory, it's flat out wrong.\n\n \n So, she chose to attempt to destroy her father after he told her that she had to leave the house. The net effect is the same, only the motive for doing so has changed. In your scenario it's revenge, not rebellion. \n I'm curious. I have a daughter that's a senior in high school. If she goes on TV and says she's gay and I booted her out because of it will gays pay for her college tuition, too? She might be willing to go that route instead of taking out school loans, working part-time, etc., I suspect not unless I was a famous Conservative. emoticon_rolleyes", 
   {}, 
   91848, 
   null, 
   1108655340.0
  ], 
  [
   91885, 
   null, 
   "jyoshu", 
   "Oh, so in other words she should have just gone quitely, allowed this very public man, with his extremist ideas, to unjustly toss his own daughter out to the street without so much as a \"thanks, but no thanks.\" \n\n \n Again, I'm sure there are deep issues afoot here that go much deeper than what we know of on the surface. And in Mary Cheney's case, that's the ideal--their famly is strong and they've stuck together, yet Mary is out in her sexuality. They've stayed together and strong as a family against the wishes of many like yourself who would love to see their family broken up over it, I'm sure.", 
   {}, 
   91850, 
   null, 
   1108656120.0
  ], 
  [
   91889, 
   null, 
   "joebrummer", 
   "Again, I'm sure there are deep issues afoot here that go much deeper than what we know of on the surface. And in Mary Cheney's case, that's the ideal--their famly is strong and they've stuck together, yet Mary is out in her sexuality. They've stayed together and strong as a family against the wishes of many like yourself who would love to see their family broken up over it, I'm sure.\n\n Why would anyone be happy about a family being broken up, and what a rude, thing to say. You amaze me with your assumptions which you seem to have many of...", 
   {}, 
   91885, 
   null, 
   1108657200.0
  ], 
  [
   91939, 
   null, 
   "jkca1", 
   "Why would anyone be happy about a family being broken up, and what a rude, thing to say. You amaze me with your assumptions which you seem to have many of...\n\n \n Speaking of assumptions. How can anyone not in the immediate family even pretend to understand what the internal dynamics are? For most people it's simply a \"she's gay\" she's gone story. But none of us know the \"real\" facts because we are not privy to the 19 years leading up to this decision. And until the parents and daughter are willing to sit down on Oprah or Dr. Phil and let all of America in on their family problem(s) ad nauseam, we might all be better served improving our own imperfect lives. I for one am far from perfect...how about you? emoticon_xangel", 
   {
    "post_info": {
     "post_title": "Give it a rest"
    }
   }, 
   91889, 
   null, 
   1108666980.0
  ], 
  [
   91946, 
   null, 
   "JakeCJB", 
   "Sorry to burst your bubble, but I don't have any rules about sexual orientation in my house, so it wouldn't be an issue worthy of being tossed.....in my house. Now, if I was a minister and had a rebelious daughter who tested our family's moral underpinnings on a regular basis, I'd consider it.\n\n \n Why do ministers get a free pass? What's so special about being a minister, but being gay is given no consideration?\n \n \nKnowing that her father is a highly visible person in the community, I don't see any value to her or her family in coming out.\n\n \n What? Just because your father can be said to be \"visible\", there is no value in coming out? There is always value in coming out, as gay people who have done so know. Why is all your sensitivity toward her father and not to her? I guess because you are more sensitive to ministers than you are to gay people. I don't know what other conclusion to draw. What if she had an anti-religious father, a leader in the atheist community, and she came out as a Christian? Would you tell her she must stay in the closet then? \n \n \nIn your idealistic world, you would want her to announce it to the world, but doing so, in the real world, often times has negative consequences. Just look at the military, for example. Don't ask; don't tell is the policy for a reason that transcends \"idealism\".\n\n \n As a proud gay man, I know all about dealing with the real world. I know that submitting to prejudice and oppression has worse negative consequences, to one's self, and to society. Your idealism is that Christians and others can oppress gay people whenever they want, and gay people are not to object to that. I find your attitude cynical and patronizing. You don't know what you are talking about.", 
   {}, 
   91881, 
   null, 
   1108668780.0
  ], 
  [
   91948, 
   null, 
   "JPSartre12", 
   "Speaking of assumptions. How can anyone not in the immediate family even pretend to understand what the internal dynamics are? For most people it's simply a \"she's gay\" she's gone story. But none of us know the \"real\" facts because we are not privy to the 19 years leading up to this decision. And until the parents and daughter are willing to sit down on Oprah or Dr. Phil and let all of America in on their family problem(s) ad nauseam, we might all be better served improving our own imperfect lives. I for one am far from perfect...how about you? emoticon_xangel\n\n \n I agree with you 110%. That's why I was interjecting other ways of looking at the situation. I highly doubt it was \"Dad, I'm gay\" followed by Keyes replying \"Get out\". That might make an easy sound byte on the 6:00 news, but it hardly ever reflects reality.\n \n And while we're on the subject of Alan Keyes. I've heard JustineCredible refer to him as being an ultra-extremist. I wonder how many people know just what Alan Keyes position on the issues really is. Here's a sampling:\n \n Keyes on Education\n 1. Break up the government monopoly on public education\n 2. Government corrupts higher education\n 3. College tuition rises due to taxpayer subsidies\n 4. Pro-voucher; gov't out of K-12 education\n 5. Money should follow parents' education choices\n \n On Energy\n 1. Explore & exploit ANWR, while respecting ecology\n 2. Against Kyoto Treaty; for market-based solutions\n 3. CAFE standards kill - abolish them\n \n On Foreign Policy\n 1. If the UN undermines US sovereignty, we should quit\n 2. Renounce interference with affairs of other nations\n 3. Routine military intervention is wrong\n \n On Free Trade\n 1. Entering WTO gave away part of our sovereignty\n 2. Banks and American clout should help farmers\n 3. WTO is not representative; hence unconstitutional\n \n On Government Reform\n 1. We have surrendered our personal sovereignty to government\n 2. Unlimited contributions, but only by people, & publicized\n 3. Campaigns: No union $, no corporate $, no foreign $.\n \n Granted, many of Alan Keyes other positions are strongly influenced by his religion, like his stance on gay marriage, but he's a hard-core Conservative on most issues and that makes him OK in my book. I may not vote for him because he does tie his religious beliefs together with many of his social, economic and political beliefs, but I agree with him much more than I do with Ted Kennedy or John Kerry. :)", 
   {
    "unicode_changes_made": true
   }, 
   91939, 
   null, 
   1108669440.0
  ], 
  [
   91952, 
   null, 
   "jkca1", 
   "I agree with you 110%. That's why I was interjecting other ways of looking at the situation. I highly doubt it was \"Dad, I'm gay\" followed by Keyes replying \"Get out\". That might make an easy sound byte on the 6:00 news, but it hardly ever reflects reality.\n \n\n \n Your other points about not understanding what the man stands for are true too. Until you elucidated them I only had vague knowledge of his positions. Nice job.", 
   {}, 
   91948, 
   null, 
   1108670520.0
  ], 
  [
   91953, 
   null, 
   "JPSartre12", 
   "Why do ministers get a free pass? What's so special about being a minister, but being gay is given no consideration?\n\n What's so special is that the Bible teaches against homosexuality, despite all of the spindoctoring to the contrary. Because of that, I would expect a minister to look at homosexuality in his own family a little harsher than a non-religious person. Ah, that probably didn't come out right, but what the heck.\n \n\n What? Just because your father can be said to be \"visible\", there is no value in coming out? There is always value in coming out, as gay people who have done so know. Why is all your sensitivity toward her father and not to her? I guess because you are more sensitive to ministers than you are to gay people. I don't know what other conclusion to draw. What if she had an anti-religious father, a leader in the atheist community, and she came out as a Christian? Would you tell her she must stay in the closet then? \n\n It's not my call to decide if there's value in her coming out or not. Obviously it has had a negative impact on her familial relationship, that's for certain.\n \n\n As a proud gay man, I know all about dealing with the real world. I know that submitting to prejudice and oppression has worse negative consequences, to one's self, and to society. \n\n Really? I'll tell you what. Come visit me here in the Motor City and I'll drop you off downtown where you can profess your sexuality in the middle of the street at the top of your lungs. Just come equipped with a full clip in your gun because not everyone is an idealist. Sadly, there are plenty of folks out there who would prey upon you just for the fact that you're gay. We don't yet live in an \"enlightened\" society. Sometimes discretion is the better part of valor.\n \n\n Your idealism is that Christians and others can oppress gay people whenever they want, and gay people are not to object to that. I find your attitude cynical and patronizing. You don't know what you are talking about.\n\n My personal \"idealism\" is that it shouldn't matter if someone is gay or not, but I live in the real world where it matters a lot. I'm just foolish enough that if I saw someone being beaten up, I'd instinctively try to help them, gay or not. I don't believe in oppression and by the same token, I don't believe in deliberately putting oneself in harm's way to prove a point.", 
   {}, 
   91946, 
   null, 
   1108670640.0
  ], 
  [
   91954, 
   null, 
   "BobNelson2", 
   "I don't see any value to her or her family in coming out. \n\n \n Self respect. Not living a lie. (I thought you folks were big on honesty???)\n \n \nJust look at the military, for example. Don't ask; don't tell is the policy for a reason that transcends \"idealism\".\n\n \n Coddling the prejudiced transcends idealism? Who knew!!?", 
   {}, 
   91881, 
   null, 
   1108670700.0
  ], 
  [
   91955, 
   null, 
   "JPSartre12", 
   "Your other points about not understanding what the man stands for are true too. Until you elucidated them I only had vague knowledge of his positions. Nice job.\n\n \n If you've ever heard an interview with Alan Keyes, you'd see a Conservative Christian man of principle, a rare breed amongst men and a rarer breed amongst politicians. That's why he's \"unelectable\". He owes his allegiance to no one but God.", 
   {}, 
   91952, 
   null, 
   1108670940.0
  ], 
  [
   91956, 
   null, 
   "JPSartre12", 
   "Self respect. Not living a lie. (I thought you folks were big on honesty???)\n\n I don't know many heterosexuals that profess their sexuality either. How many promiscuous straights, for example, do you see professing \"I'm a slut!\" to everyone they meet? \n \n\n Coddling the prejudiced transcends idealism? Who knew!!?\n\n The offer stands for you, too. If you'd like to profess your sexuality on Cass Ave in Detroit sometime, let me know. You'd probably make a good punching bag for the \"coddled\" masses. emoticon_rolleyes", 
   {}, 
   91954, 
   null, 
   1108671240.0
  ], 
  [
   91957, 
   null, 
   "joebrummer", 
   "Really? I'll tell you what. Come visit me here in the Motor City and I'll drop you off downtown where you can profess your sexuality in the middle of the street at the top of your lungs. Just come equipped with a full clip in your gun because not everyone is an idealist. Sadly, there are plenty of folks out there who would prey upon you just for the fact that you're gay. We don't yet live in an \"enlightened\" society. Sometimes discretion is the better part of valor\n\n \n Yeah, no need for hate crime laws here is there.", 
   {}, 
   91956, 
   null, 
   1108671660.0
  ], 
  [
   91959, 
   null, 
   "BobNelson2", 
   "If you've ever heard an interview with Alan Keyes, you'd see a Conservative Christian man of principle, a rare breed amongst men and a rarer breed amongst politicians. That's why he's \"unelectable\". He owes his allegiance to no one but God.\n\n \n I suppose, then, that in good conscience, he would be unable to swear an oath to uphold the Constitution. Good thing for him, he won't ever find himself in a position to choose.", 
   {}, 
   91955, 
   null, 
   1108671960.0
  ], 
  [
   91963, 
   null, 
   "BobNelson2", 
   "I don't know many heterosexuals that profess their sexuality either. How many promiscuous straights, for example, do you see professing \"I'm a slut!\" to everyone they meet? \n\n \n My, but you live a sheltered life. \n \n \nThe offer stands for you, too. If you'd like to profess your sexuality on Cass Ave in Detroit sometime, let me know. You'd probably make a good punching bag for the \"coddled\" masses. emoticon_rolleyes\n\n \n Do you enjoy threatening people with physical injury? Does it warm the cockles of your heart to know that gay people are so despised by some that our lives are at risk?\n \n Maybe you should sit down with jyoshu and describe the situation on Cass Ave. He doesn't seem to believe such places and attitudes exist.", 
   {}, 
   91956, 
   null, 
   1108672440.0
  ], 
  [
   91965, 
   null, 
   "jyoshu", 
   "Do you enjoy threatening people with physical injury? Does it warm the cockles of your heart to know that gay people are so despised by some that our lives are at risk?\n \n Maybe you should sit down with jyoshu and describe the situation on Cass Ave. He doesn't seem to believe such places and attitudes exist.\n\n \n Don't you think you're being just a bit of a drama queen here? I seriously doubt JP finds it warming to know that some gay people are at risk.\n \n And I'm not sure why you are being intentionally dishonest about me either--I never said places like that don't exist, but I do think that they getting rare.", 
   {}, 
   91963, 
   null, 
   1108673640.0
  ], 
  [
   91967, 
   null, 
   "BobNelson2", 
   "I seriously doubt JP finds it warming to know that some gay people are at risk.\n\n \n Warming? Perhaps not. Let him tell us why he brought it up, no?\n \n \nAnd I'm not sure why you are being intentionally dishonest about me either--I never said places like that don't exist, but I do think that they getting rare.\n\n \n Ooops. You're right. You didn't say they don't exist.", 
   {}, 
   91965, 
   null, 
   1108675560.0
  ], 
  [
   91971, 
   null, 
   "JustineCredible", 
   "So, she chose to attempt to destroy her father after he told her that she had to leave the house. The net effect is the same, only the motive for doing so has changed. In your scenario it's revenge, not rebellion. \n I'm curious. I have a daughter that's a senior in high school. If she goes on TV and says she's gay and I booted her out because of it will gays pay for her college tuition, too? She might be willing to go that route instead of taking out school loans, working part-time, etc., I suspect not unless I was a famous Conservative. emoticon_rolleyes\n\n \n \n If you hadn't noticed, it's a bit hard to get any kind of job, part-time or otherwise, if you don't have a home address! \n \n Try it sometime...see how if feels.", 
   {}, 
   91882, 
   null, 
   1108676520.0
  ], 
  [
   91974, 
   null, 
   "JustineCredible", 
   "Again, I'm sure there are deep issues afoot here that go much deeper than what we know of on the surface. And in Mary Cheney's case, that's the ideal--their famly is strong and they've stuck together, yet Mary is out in her sexuality. They've stayed together and strong as a family against the wishes of many like yourself who would love to see their family broken up over it, I'm sure.\n\n \n \n Give it a rest. Mary Cheney was the diversity manager for Coors before Pappa ran for VP. Only once Daddy went Extreme public did Mary leave her six figure income job to be the quite NOTHING she is today. \n \n She went from fighting for equality to being a patsy. \n \n No, I have no desire to see the Cheney family or any other for that matter broken up over a loved one who is gay. What I WOULD like to see are families STANDING BY THEIR Gay/Lesbian family members insted of expecting the gay family member to change for them! \n Dropping everything you have worked for just so your family can save political face is just as bad as trying to live a lie. Either way you're not working for what's right. You're not pushing for societal change. It's accepting being second class, second best? It's compromising your self-worth for what? \n \n No, I don't buy it. \n I say, as I have before, Good for Maya !! More Power to her!! \n Maybe BECAUSE her father has such a public image it will draw the needed attention to the plight of gay/lesbian teens throughout this country who are also being tossed out like garbage! \n Maybe her utilizing her father's recognition will actually get something DONE!", 
   {}, 
   91885, 
   null, 
   1108677180.0
  ], 
  [
   91981, 
   null, 
   "JPSartre12", 
   "Yeah, no need for hate crime laws here is there.\n\n \n No there isn't. An act of violence against ANYBODY should be treated the same. What makes victims of so-called \"hate crimes\" more special than everyone else?", 
   {}, 
   91957, 
   null, 
   1108678800.0
  ], 
  [
   91989, 
   null, 
   "JPSartre12", 
   "Warming? Perhaps not. Let him tell us why he brought it up, no?\n\n \n I brought it up because JakeCJB proclaimed idealistically \"There is always value in coming out, as gay people who have done so know.\" and I was demonstrating that his idealism can often be misplaced in the real world where mellon crackers reside.\n As for me liking the idea of gays being bashed, you should have finished reading my post and I quote \"Sadly, there are plenty of folks out there who would prey upon you just for the fact that you're gay. We don't yet live in an \"enlightened\" society. Sometimes discretion is the better part of valor.\n \n My personal \"idealism\" is that it shouldn't matter if someone is gay or not, but I live in the real world where it matters a lot. I'm just foolish enough that if I saw someone being beaten up, I'd instinctively try to help them, gay or not. I don't believe in oppression and by the same token, I don't believe in deliberately putting oneself in harm's way to prove a point.\"\n \n I believe that removes any ambiguity that you have tried to interject into my words. emoticon_rolleyes", 
   {}, 
   91967, 
   null, 
   1108679460.0
  ], 
  [
   91992, 
   null, 
   "JPSartre12", 
   "If you hadn't noticed, it's a bit hard to get any kind of job, part-time or otherwise, if you don't have a home address! \n \n Try it sometime...see how if feels.\n\n \n I'm too old to become a street urchin now. :p", 
   {}, 
   91971, 
   null, 
   1108680180.0
  ], 
  [
   91998, 
   null, 
   "BobNelson2", 
   "I believe that removes any ambiguity that you have tried to interject into my words. emoticon_rolleyes\n\n \n It doesn't shed any light whatsoever on why you offered ME the opportunity to become -- how did you put it? -- a punching bag? I mentioned one of the stated purposes for Don't Ask, Don't Tell. How is that asking to be beaten up?\n \n Do you plan to bring up the threat of physical violence whenever a gay person mentions the importance of coming out?", 
   {}, 
   91989, 
   null, 
   1108681740.0
  ], 
  [
   92000, 
   null, 
   "BobNelson2", 
   "She [Mary Cheney] went from fighting for equality to being a patsy. \n\n \n Actually, she did little for equality and a lot for making a boycotted, watered-down beer acceptable in gay bars again. Then she went on to trying to sell the GOP to gay people. \n \n A miserable career in deception, if you ask me.", 
   {}, 
   91974, 
   null, 
   1108681920.0
  ], 
  [
   92001, 
   null, 
   "JakeCJB", 
   "What's so special is that the Bible teaches against homosexuality, despite all of the spindoctoring to the contrary.\n\n \n If it does, that does not mean that must be imposed on someone else, and that the rights of someone with one particular religious view, or any other view, trump the rights of others. \n \n \nObviously it has had a negative impact on her familial relationship, that's for certain.\n\n \n When parents push their kids into the closet, it has a negative affect, because they never get to know their clildren.\n \n \nReally? I'll tell you what. Come visit me here in the Motor City and I'll drop you off downtown where you can profess your sexuality in the middle of the street at the top of your lungs. Just come equipped with a full clip in your gun because not everyone is an idealist. Sadly, there are plenty of folks out there who would prey upon you just for the fact that you're gay. We don't yet live in an \"enlightened\" society. Sometimes discretion is the better part of valor.\n\n \n I'm sorry your neighbourhood is such a dangerous and violent place. I am not talking about standing there alone and screaming at the top of my lungs. What reason would I have to do that? However, nothing will change if everyone stays in the closet and submits to oppression to fear and to threats. Keep in mind that there are real fears based on a direct threat, and those that we fantasize as could happen. Obviously if the situation is this bad where you live, they need hate crimes legislation. That is the solution. Of course some groups of people will avoid certain neighbourhoods that they know to be hostile to their particular group. The problem is not with the victims of hate crimes, in any case. This is not the kind of situation the daughter of the minister was facing.", 
   {}, 
   91953, 
   null, 
   1108681920.0
  ], 
  [
   92004, 
   null, 
   "wsm2506", 
   "I agree with you 110%. That's why I was interjecting other ways of looking at the situation. I highly doubt it was \"Dad, I'm gay\" followed by Keyes replying \"Get out\". That might make an easy sound byte on the 6:00 news, but it hardly ever reflects reality.\n \n And while we're on the subject of Alan Keyes. I've heard JustineCredible refer to him as being an ultra-extremist. I wonder how many people know just what Alan Keyes position on the issues really is. Here's a sampling:\n \n Keyes on Education\n 1. Break up the government monopoly on public education\n\n \n You mean religious schools don't exist? Feel free to send your child there if you wish.\n \n \n2. Government corrupts higher education\n\n \n How? By teaching facts instead of mythology? By teaching tolerance? \n \n \n3. College tuition rises due to taxpayer subsidies\n\n \n Duh?? I don't get that one at ALL? Cause and effect?\n \n \n4. Pro-voucher; gov't out of K-12 education\n\n \n Read: \"Support religious based education.\" Not with MY tax dollars!! No thank you.\n \n \n5. Money should follow parents' education choices\n\n \n If they are willing to pay for it themselves, fine!\n \n \nOn Energy\n 1. Explore & exploit ANWR, while respecting ecology\n 2. Against Kyoto Treaty; for market-based solutions\n 3. CAFE standards kill - abolish them\n\n \n What \"market-based solutions\"?\n \n \nOn Foreign Policy\n 1. If the UN undermines US sovereignty, we should quit\n 2. Renounce interference with affairs of other nations\n 3. Routine military intervention is wrong\n\n \n Isolationism. With the speed of communications and travel today, that is going to be a tough one.\n \n \nOn Free Trade\n 1. Entering WTO gave away part of our sovereignty\n 2. Banks and American clout should help farmers\n 3. WTO is not representative; hence unconstitutional\n\n \n I believe in the law of supply and demand. In many areas, the US simply cannot compete cost/price wise. So, the goods will come from other sources with or without the WTO. Again, isolationism and protectionism. Maybe we need an ammendment to the constitution to protect the \"sacred institution\" of American business too?\n \n \nOn Government Reform\n 1. We have surrendered our personal sovereignty to government\n\n \n Some of us have never had it to begin with.\n \n \n2. Unlimited contributions, but only by people, & publicized\n 3. Campaigns: No union $, no corporate $, no foreign $.\n\n \n So the richest man wins. Its all about money.\n \n Anyway, this doesn't belong here. There is another forum for politics. I probably should not have responded here.", 
   {
    "unicode_changes_made": true
   }, 
   91948, 
   null, 
   1108682400.0
  ], 
  [
   92020, 
   null, 
   "Jaxian", 
   "Really? I'll tell you what. Come visit me here in the Motor City and I'll drop you off downtown where you can profess your sexuality in the middle of the street at the top of your lungs. Just come equipped with a full clip in your gun because not everyone is an idealist. Sadly, there are plenty of folks out there who would prey upon you just for the fact that you're gay. We don't yet live in an \"enlightened\" society. Sometimes discretion is the better part of valor.\n\n \n Hey now, I just noticed this! Let's not start trashing Detroit now; I happen to know for a fact that you don't need a loaded gun to shout out your sexuality in the middle of the Detroit streets, nor to wear gay pride shirts to Detroit bars or around the city, nor to hold hands with your boyfriend while you walk down the street. Though Detroit has high crime rates, I don't think the average Detroiter is very likely to commit a hate crime. So let's not portray Detroit as such a horrible, violent place; it really isn't that bad...", 
   {}, 
   91953, 
   null, 
   1108685580.0
  ], 
  [
   92046, 
   null, 
   "JPSartre12", 
   "It doesn't shed any light whatsoever on why you offered ME the opportunity to become -- how did you put it? -- a punching bag? I mentioned one of the stated purposes for Don't Ask, Don't Tell. How is that asking to be beaten up?\n \n Do you plan to bring up the threat of physical violence whenever a gay person mentions the importance of coming out?\n\n \n You wrote \" Coddling the prejudiced transcends idealism? Who knew!!?\"\n \n To which I replied.\n \n\n The offer stands for you, too. If you'd like to profess your sexuality on Cass Ave in Detroit sometime, let me know. You'd probably make a good punching bag for the \"coddled\" masses. \n\n \n What you call \"coddling the prejudiced\" is sometimes exercising good common sense. That was my point. Jake claimed that it was always good to \"come out\" and I was showing him an instance when his idealistic viewpoint could get him hurt, when discretion is the better part of valor. But, if the comment was lost on you, so be it.", 
   {}, 
   91998, 
   null, 
   1108690560.0
  ], 
  [
   92047, 
   null, 
   "JPSartre12", 
   "Hey now, I just noticed this! Let's not start trashing Detroit now; I happen to know for a fact that you don't need a loaded gun to shout out your sexuality in the middle of the Detroit streets, nor to wear gay pride shirts to Detroit bars or around the city, nor to hold hands with your boyfriend while you walk down the street. Though Detroit has high crime rates, I don't think the average Detroiter is very likely to commit a hate crime. So let's not portray Detroit as such a horrible, violent place; it really isn't that bad...\n\n \n I could have said any city; I just happen to live by Detroit at the moment. There are lots of areas of Detroit that I'd visit...in the daylight. :)", 
   {}, 
   92020, 
   null, 
   1108690680.0
  ], 
  [
   92053, 
   null, 
   "melsucceeds", 
   "Alan Keyes debated Alan Dershowitz in 2000. You can order the tape from CSPAN. Keyes hates when someone out debates him and he thinks he's perfect. I'm not perfect and it's great when someone educate me on issues out of my expertise. However, not all people think as I do. Anyway, Christian is just a name for many people. Anyone can call themselves one.", 
   {
    "post_info": {
     "post_title": "Hypocrisy"
    }
   }, 
   92047, 
   null, 
   1108693080.0
  ], 
  [
   92062, 
   null, 
   "JakeCJB", 
   "What you call \"coddling the prejudiced\" is sometimes exercising good common sense. That was my point. Jake claimed that it was always good to \"come out\" and I was showing him an instance when his idealistic viewpoint could get him hurt, when discretion is the better part of valor. But, if the comment was lost on you, so be it.\n\n \n Women, gay people, racial minorities, ethnic minorities, religious minorities, and other groups face the possibility of being harmed all the time. If we are talking about a specific instance where there is a direct threat, like someone making homophobic comments who appears menacing and dangerous, then it may not be a good idea to say you are gay. One may not wish to say anything to such a person. Although, the thing is, such people may be a danger to you anyway, if they perceive you are gay, even if you are not. That kind of thing has happened.", 
   {}, 
   92046, 
   null, 
   1108694400.0
  ], 
  [
   92068, 
   null, 
   "joebrummer", 
   "It is funny to me. I have said this a thousand times. This time I direct it right at JP. I respect your posts and think you approach the subject with great thought. You say that hate crime laws don't serve a purpose now, but when you are the victim of a hate crime your story will change. At any given moment in time, someone could percieve, for whatever reason that you are gay. They may call you names, damage your car, or beat you up, in the most extreme cases they may kill you. You are not gay, but they percieve you as gay because you wore that GAP shirt again. \n \n Bashers are not realistic people. They do not see the world in a reasonable way.. You don't need to be gay and you could be the next Matthew. Why do I feel that then...and only then....would you suddenly favor hate crime laws.\n \n \n I have been a victim twice....not once but twice. Both times I was randomly attacked. didn't matter if I was or was not gay. I was attacked either way because someone thought I was gay. Without hate crime laws they would have just gotten an assult charge and walked away serving a few months. Dangerous crimals who will strike again....a few months...?\n \n With a hate crime law they serve years not months ......years for the crime... Keept the crimials off the streets.", 
   {}, 
   92062, 
   null, 
   1108696080.0
  ], 
  [
   92079, 
   null, 
   "melsucceeds", 
   "In junior high, I remember my friend was attack because people was determined that he was gay. He was only thirteen or fourteen years old. Now, I'm gay, but a lot of folks can't tell. It's obvious that heterosexuals and homosexuals can tell by just looking at some gays. However, I was bullied by this boy in 12th grade; someone whom I believe was a closeted homosexual who pretended to be heterosexual. Anyway, hate is alive and well.", 
   {
    "post_info": {
     "post_title": "Hate"
    }
   }, 
   92068, 
   null, 
   1108701420.0
  ], 
  [
   92097, 
   null, 
   "JustineCredible", 
   "I'm too old to become a street urchin now. :p\n\n \n \n You're never too old to be a homeless bum. emoticon_rolleyes", 
   {}, 
   91992, 
   null, 
   1108724820.0
  ], 
  [
   92111, 
   null, 
   "jyoshu", 
   "Anyway, this doesn't belong here. There is another forum for politics. I probably should not have responded here.\n\n \n I think JP's point is that these issues show that the phrase \"ultra-extremist\" doesn't really apply to Keyes. We usually use such terminology to refer to someone who might be a killer, or white supremacist. I don't agree with all of his views on homosexuality, and I certainly wouldn't kick my kid out of the house if he said he was gay. But I agree with JP (and I said this myself) that there are most certainly deeper issues afloat here. And I'll repeat my view that it's their family issues and their business, not really any of ours. And Keyes is entitled to his views.\n \n Here's something else we tend to forget when talking about these issues . . .\n \n Parents often know a lot more about their kids that we think they do. They also often have a lifetime of experience and wisdom. They aren't perfect, but I think it's a good idea to encourage kids to listen to their parents when they are still at home. It bothers me that so many here have automatically assumed that Maya is the innocent one and her dad is in the wrong, because we don't know the specifics. Like I said, there are most certainly deeper issues afloat here. Many families have problems and chances are both sides have not been above the fray on this. To automatically assume that the gay kid is in the right and the parent is in the wrong in every case is not the right way to approach these matters.\n \n And we generally don't interfere or even gossip about family problems of others' that aren't gay-related, so I can't help but be surprised that you guys are so into THIS family's problems. That's why it seems suspicious that you all are using this to go after Alan Keyes over his political views.", 
   {}, 
   92004, 
   null, 
   1108742040.0
  ], 
  [
   92114, 
   null, 
   "wsm2506", 
   "I think JP's point is that these issues show that the phrase \"ultra-extremist\" doesn't really apply to Keyes. We usually use such terminology to refer to someone who might be a killer, or white supremacist. I don't agree with all of his views on homosexuality, and I certainly wouldn't kick my kid out of the house if he said he was gay. But I agree with JP (and I said this myself) that there are most certainly deeper issues afloat here. And I'll repeat my view that it's their family issues and their business, not really any of ours. And Keyes is entitled to his views.\n \n Here's something else we tend to forget when talking about these issues . . .\n \n Parents often know a lot more about their kids that we think they do. They also often have a lifetime of experience and wisdom. They aren't perfect, but I think it's a good idea to encourage kids to listen to their parents when they are still at home. It bothers me that so many here have automatically assumed that Maya is the innocent one and her dad is in the wrong, because we don't know the specifics. Like I said, there are most certainly deeper issues afloat here. Many families have problems and chances are both sides have not been above the fray on this. To automatically assume that the gay kid is in the right and the parent is in the wrong in every case is not the right way to approach these matters.\n \n And we generally don't interfere or even gossip about family problems of others' that aren't gay-related, so I can't help but be surprised that you guys are so into THIS family's problems. That's why it seems suspicious that you all are using this to go after Alan Keyes over his political views.\n\n \n When one (Keyes or any other) uses his public position and office to promote his beliefs and views, then he must also accept that it is no longer a \"private\" matter. Yes, he is entitled to his beliefs and views. But any attempt to make such beliefs public policy or law, opens himself up to public scrutiny and ridicule. If those are his \"private\" beliefs, then he should keep them private.\n \n He hasn't.\n \n Was there not public discussion regarding Clinton's brother activities or his family (during his Monica debacle)? I seem to remember something about one of Jimmy Carter's relatives also. And the Regan family. These are \"public\" people by their own choice. They chose to surrendered their right to privacy in those matters when they speak publicly about them.", 
   {}, 
   92111, 
   null, 
   1108743720.0
  ], 
  [
   92188, 
   null, 
   "JPSartre12", 
   "When one (Keyes or any other) uses his public position and office to promote his beliefs and views, then he must also accept that it is no longer a \"private\" matter. Yes, he is entitled to his beliefs and views. But any attempt to make such beliefs public policy or law, opens himself up to public scrutiny and ridicule. If those are his \"private\" beliefs, then he should keep them private.\n He hasn't.\n Was there not public discussion regarding Clinton's brother activities or his family (during his Monica debacle)? I seem to remember something about one of Jimmy Carter's relatives also. And the Regan family. These are \"public\" people by their own choice. They chose to surrendered their right to privacy in those matters when they speak publicly about them.\n\n \n I've got to agree with you that his private life, once he became a candidate, became fair game for the press. He did, afterall, run for president before running this time in IL. What I objected to wasn't the reporting of the story as much as the interpretation of the circumstances surrounding the story that JustineCredible assumed occurred.", 
   {}, 
   92114, 
   null, 
   1108769280.0
  ], 
  [
   92189, 
   null, 
   "jyoshu", 
   "Isn't it ironic that suddenly those who once cried foul when a prominent public figure's private life was made in to a spectacle (think, 'oval office') now sem to consider it fair game when the subject of their attention is a conservative and the issue has something to do with homosexuality.", 
   {}, 
   92188, 
   null, 
   1108770240.0
  ], 
  [
   92203, 
   null, 
   "BobNelson2", 
   "Isn't it ironic that suddenly those who once cried foul when a prominent public figure's private life was made in to a spectacle (think, 'oval office') now sem to consider it fair game when the subject of their attention is a conservative and the issue has something to do with homosexuality.\n\n \n Wow! All the way to post #63 without mentioning Clinton. \n \n That's a record of sorts, isn't it?", 
   {
    "post_info": {
     "post_title": "Snap that rubberband!"
    }
   }, 
   92189, 
   null, 
   1108775940.0
  ], 
  [
   92241, 
   null, 
   "JustineCredible", 
   "I've got to agree with you that his private life, once he became a candidate, became fair game for the press. He did, afterall, run for president before running this time in IL. What I objected to wasn't the reporting of the story as much as the interpretation of the circumstances surrounding the story that JustineCredible assumed occurred.\n\n \n \n Assumed? Are you now calling me a liar? \n Are you accusing me of not having a friendly relationship with Maya? \n \n If so, then say so! \n I dare you! ", 
   {}, 
   92188, 
   null, 
   1108805820.0
  ], 
  [
   92244, 
   null, 
   "jitobear", 
   "Isn't it ironic that suddenly those who once cried foul when a prominent public figure's private life was made in to a spectacle (think, 'oval office') now sem to consider it fair game when the subject of their attention is a conservative and the issue has something to do with homosexuality.\n\n \n Two major differences - 1) my understanding is taht the Keyes family went public - or at least the daughter - I am pretty sure Clinton never invited anyone to delve into his sex life. 2) I don't think, nor do I think anyone has suggested that Keyes should be investigated or lose his job for the decisions he has made in his private life. However he is an a-hole.", 
   {}, 
   92189, 
   null, 
   1108814160.0
  ], 
  [
   92256, 
   null, 
   "jyoshu", 
   "Wow! All the way to post #63 without mentioning Clinton. \n \n That's a record of sorts, isn't it?\n\n \n That's got to be the most ad nauseum-used response to anyone bringing Clinton--it's gotten to where you guys can't stand for him to even be mentioned. Get over it!", 
   {}, 
   92203, 
   null, 
   1108832400.0
  ], 
  [
   92353, 
   null, 
   "JPSartre12", 
   "Assumed? Are you now calling me a liar? \n Are you accusing me of not having a friendly relationship with Maya? \n \n If so, then say so! \n I dare you! \n\n \n I'm saying that you heard exactly 1/2 of the story..unless you're going to tell me that you spoke to Alan and his wife as well, that is. emoticon_rolleyes\n \n And if you know her that well, ask her to post here so we can ask her some questions because I'm not buying her story.", 
   {}, 
   92241, 
   null, 
   1108870620.0
  ], 
  [
   92387, 
   null, 
   "zachvac", 
   "I'm saying that you heard exactly 1/2 of the story..unless you're going to tell me that you spoke to Alan and his wife as well, that is. emoticon_rolleyes\n \n And if you know her that well, ask her to post here so we can ask her some questions because I'm not buying her story.\n\n \n That would be great. \"You just got kicked out of the house for being gay, the media is covering you, could you come on to this web site some people don't believe your story\". Just what you would want to hear at a time like that.", 
   {}, 
   92353, 
   null, 
   1108881240.0
  ], 
  [
   92398, 
   null, 
   "JPSartre12", 
   "That would be great. \"You just got kicked out of the house for being gay, the media is covering you, could you come on to this web site some people don't believe your story\". Just what you would want to hear at a time like that.\n\n \n JustineCredible thinks that she knows the whole story by hearing one side. I just gave her the opportunity to delve into the untold 1/2 of the story. I don't expect that she'll take me up on the offer, though.", 
   {}, 
   92387, 
   null, 
   1108884120.0
  ], 
  [
   92488, 
   null, 
   "CCR1994", 
   "JustineCredible thinks that she knows the whole story by hearing one side. I just gave her the opportunity to delve into the untold 1/2 of the story. I don't expect that she'll take me up on the offer, though.\n\n \n A certain mentality has gripped our media in recent decades. The private affairs of celebs in all catagories is now open to exposure, even when certain stories cannot be independently verified. I Call it the \"tabloidization\" of the press.", 
   {}, 
   92398, 
   null, 
   1108927200.0
  ], 
  [
   92835, 
   null, 
   "JustineCredible", 
   "JustineCredible thinks that she knows the whole story by hearing one side. I just gave her the opportunity to delve into the untold 1/2 of the story. I don't expect that she'll take me up on the offer, though.\n\n \n \n No, you told me to tell Maya to post for herself here. \n \n I'm telling you, she does not have the time. She is very busy dealing with the funeral of a close friend and his family along with everything else she's doing. No, I haven't told her about your challenge here, nor do I even think it's worth while doing so. She's also been dealing with a barrage of email from supporters as well as others who just want to tear her down. I'm very suprised she's actually holding up as well as she is. But she's very task oriented and just doesn't have the time to fall apart. \n I will not add to her stress level by forwarding your remarks. She simply doesn't need it.", 
   {}, 
   92398, 
   null, 
   1109031780.0
  ], 
  [
   92846, 
   null, 
   "joebrummer", 
   "No, you told me to tell Maya to post for herself here. \n \n I'm telling you, she does not have the time. She is very busy dealing with the funeral of a close friend and his family along with everything else she's doing. No, I haven't told her about your challenge here, nor do I even think it's worth while doing so. She's also been dealing with a barrage of email from supporters as well as others who just want to tear her down. I'm very suprised she's actually holding up as well as she is. But she's very task oriented and just doesn't have the time to fall apart. \n I will not add to her stress level by forwarding your remarks. She simply doesn't need it.\n\n \n \n Justine,\n Give her the whisper in her ear that the \"family\" supports her........if ya know what I mean!!!! She is in my thoughts.....", 
   {}, 
   92835, 
   null, 
   1109032620.0
  ], 
  [
   92888, 
   null, 
   "JPSartre12", 
   "No, you told me to tell Maya to post for herself here. \n \n I'm telling you, she does not have the time. She is very busy dealing with the funeral of a close friend and his family along with everything else she's doing. No, I haven't told her about your challenge here, nor do I even think it's worth while doing so. She's also been dealing with a barrage of email from supporters as well as others who just want to tear her down. I'm very suprised she's actually holding up as well as she is. But she's very task oriented and just doesn't have the time to fall apart. \n I will not add to her stress level by forwarding your remarks. She simply doesn't need it.\n\n \n No problem. Sounds like she does have more important things to deal with. Send her our condolences.", 
   {}, 
   92835, 
   null, 
   1109041200.0
  ], 
  [
   92953, 
   null, 
   "JustineCredible", 
   "Justine,\n Give her the whisper in her ear that the \"family\" supports her........if ya know what I mean!!!! She is in my thoughts.....\n\n \n \n Yes dear, don't worry, she knows...she has gotten as many, if not more supportive emails than not. She says it's those that brighten her days and help her to remain focused. \n \n and yes...I get your meaning....\"we're everywhere\"", 
   {}, 
   92846, 
   null, 
   1109055000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  And this man calls himself a Christian...", 
  "url": "http://www.4forums.com/political/gay-rights-debates/4309-man-calls-himself-christian.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 4309, 
  "discussion_files": [
   [
    "19654.html", 
    "http://www.4forums.com/political/gay-rights-debates/4309-man-calls-himself-christian-print.html"
   ], 
   [
    "19655.html", 
    "http://www.4forums.com/political/gay-rights-debates/4309-man-calls-himself-christian-5-print.html"
   ], 
   [
    "19656.html", 
    "http://www.4forums.com/political/gay-rights-debates/4309-man-calls-himself-christian-4-print.html"
   ], 
   [
    "19657.html", 
    "http://www.4forums.com/political/gay-rights-debates/4309-man-calls-himself-christian-3-print.html"
   ], 
   [
    "19658.html", 
    "http://www.4forums.com/political/gay-rights-debates/4309-man-calls-himself-christian-2-print.html"
   ]
  ], 
  "identifier": 4309
 }
]