[
 [
  [
   91645, 
   null, 
   "jyoshu", 
   "It is a statistical fact that homeschooled students on average, do better academically than publically schooled students.\n \n The stats as reported by the U.S. Dept. of Education:\n \n - Home school - average reading score (white) - 87 percentile; Public school - average reading score (white) - 61 percentile\n \n - Home school - average reading score (minority) - 87 percentile; Public school - average reading score (minority) -49 percent\n \n - Home school - average math score (white) - 82 percentile; Public school - average math score (white) - 60 percentile\n \n - Home school - average math score (minority) - 77 percentile; Public school - average math score (minority) - 50 percentile \n \n So the question is, why is this?\n \n I think there are 2 main reasons . . .\n \n 1.) Homeschooled students get much more attention and personal help. This is the same effect a public school student gets when he/she receives private tutoring. They more easily develop academic confidence and skills. And no amount of after-school parental support can equal parents taking a daily hands-on role in their child's education as they learn.\n \n 2.) Homeschooled students are able to work without the distractions and problems that come with a school system. Putting hundreds and sometimes thousands of kids together in one building for 7 hours a day 180 days of the year brings on all sorts of challenges and distractions. Also, the schedule is much more regimental compared to a homeschooled environment. Some might argue that is a good thing, but the stats speak for themselves. A home with parental support without hundreds of other kids around is more conducive to learning.", 
   {
    "post_info": {
     "post_title": "Why do homeschoolers do better academically?"
    }
   }, 
   null, 
   null, 
   1108534560.0
  ], 
  [
   91662, 
   null, 
   "greg 79 f150", 
   "I agree. I would also think the intellectual/academic status of the parent, along with the subject matter, and the parents ability to mentor, will also play a huge part on the end result of homeschooling. Some graduates may not score so high,", 
   {}, 
   91645, 
   null, 
   1108562280.0
  ], 
  [
   91665, 
   null, 
   "joebrummer", 
   "What about socially, do you have statistics for that? Are they really smart social misfits? Do they have social skills? Do they learn about interpersonal communication skills? How could they?", 
   {}, 
   91662, 
   null, 
   1108569180.0
  ], 
  [
   91676, 
   null, 
   "Waxy", 
   "What about socially, do you have statistics for that? Are they really smart social misfits? Do they have social skills? Do they learn about interpersonal communication skills? How could they?\n\n \n EXACTLY.\n \n Waxy\n \n On edit: Not only that, but when it comes time to face the real world, social skills trump book smarts 95% of the time.\n \n Like my uncle always told me when I was in school - \"A degree is just a ticket to the dance, who you take home depends on how well you dance once you're in the door.\"", 
   {}, 
   91665, 
   null, 
   1108574760.0
  ], 
  [
   91684, 
   null, 
   "Anastasia", 
   "Sinjin and I were just talking about this last night. We have these neighbors that have a 4 year old girl and let me tell you.. that little girl rules the roost! She is a brat with no manners, her parents I believe will be home schooling her.\n They plan on shielding her from the world, when she was born they got rid of their TV and any magazine subscriptions because they didn't want to expose her to the \"world\" as it were.\n My 2 year old has more of grip on life than this little girl does. I am with Waxy on this, Social skills are far too important in life.\n If you make wise choices where your children are schooled there should be no problems. My oldest son is in the public school system and has made it this far. \n When you say Hi to this little girl, she just stares at you like your an alien, she has been known to say snotty things to people that are being nice to her. I feel it's a lot to do with her parents (they are crazy IMHO) and the fact that she has no interaction with her peers. very sad\n I am willing to bet that they are priming her for her upcoming difficult teenage years, I am quite sure she will be rebellious.", 
   {}, 
   91676, 
   null, 
   1108577100.0
  ], 
  [
   91693, 
   null, 
   "whistler", 
   "I think there are 2 main reasons . . .\n \n 1.) Homeschooled students get much more attention and personal help. This is the same effect a public school student gets when he/she receives private tutoring. They more easily develop academic confidence and skills. And no amount of after-school parental support can equal parents taking a daily hands-on role in their child's education as they learn.\n \n 2.) Homeschooled students are able to work without the distractions and problems that come with a school system. Putting hundreds and sometimes thousands of kids together in one building for 7 hours a day 180 days of the year brings on all sorts of challenges and distractions. Also, the schedule is much more regimental compared to a homeschooled environment. Some might argue that is a good thing, but the stats speak for themselves. A home with parental support without hundreds of other kids around is more conducive to learning.\n\n \n You completely left out a third factor of self-selection. Simply put:\n a) smart parents are likely to recognize they can provide more individualized attention than an overworked teacher and are therefore more likely to home school than your average parent\n b) smart parents are more likely to succeed (i.e. many parents may try to home school but only the best, brightest and most determined stick with it long enough)\n c) parents with the financial resources to make homeschooling successful (i.e. one parent has the luxury of staying home while the other works) are more likely to be of higher intelligence\n d) smart parents are more likely to have smart children\n \n Until you can control for these influences your ability to generalize the statistics is very limited. \n \n \n Whistler", 
   {}, 
   91645, 
   null, 
   1108579260.0
  ], 
  [
   91698, 
   null, 
   "Anastasia", 
   "You completely left out a third factor of self-selection. Simply put:\n a) smart parents are likely to recognize they can provide more individualized attention than an overworked teacher and are therefore more likely to home school than your average parent\n b) smart parents are more likely to succeed (i.e. many parents may try to home school but only the best, brightest and most determined stick with it long enough)\n c) parents with the financial resources to make homeschooling successful (i.e. one parent has the luxury of staying home while the other works) are more likely to be of higher intelligence\n d) smart parents are more likely to have smart children\n \n Until you can control for these influences your ability to generalize the statistics is very limited. \n \n \n Whistler\n\n That is exactly what sinjin said last night!", 
   {}, 
   91693, 
   null, 
   1108580400.0
  ], 
  [
   91704, 
   null, 
   "Socialist", 
   "Some probably do better becaues they get 1 on 1 teaching, more time to study, and they don't have to take any of the standardized tests that Public School students do.\n \n My professor runs a Public School, since he's the administrator of burlington, and he says that after 9th grade, people just \"surface\" and join public school, and he never even know they existed. They don't have to go through the same tests and procedures as do others.\n \n They have more freedom, less distractions\n \n \n I know many homeschool people that fool around all the time. THey work like 2 hours a day and then play videogames all day.\n \n \n I read that the numbrt 1 reason why parents choose home schooling is  not  for superior education, but for superior moral education and relgious teaching.\n \n \n Like someone said above, they also cherry-pick students, so there are fewer people total, and the ones that do stay home, many times, are already smart, so it doesn't bring down the average.", 
   {}, 
   91698, 
   null, 
   1108581420.0
  ], 
  [
   91705, 
   null, 
   "Waxy", 
   "You completely left out a third factor of self-selection. Simply put:\n a) smart parents are likely to recognize they can provide more individualized attention than an overworked teacher and are therefore more likely to home school than your average parent\n b) smart parents are more likely to succeed (i.e. many parents may try to home school but only the best, brightest and most determined stick with it long enough)\n c) parents with the financial resources to make homeschooling successful (i.e. one parent has the luxury of staying home while the other works) are more likely to be of higher intelligence\n d) smart parents are more likely to have smart children\n \n Until you can control for these influences your ability to generalize the statistics is very limited. \n \n \n Whistler\n\n \n IMHO, this point is the #1 reason for the stats being what they are.\n \n Waxy", 
   {}, 
   91693, 
   null, 
   1108581480.0
  ], 
  [
   91731, 
   null, 
   "TheDingo8MyBaby", 
   "You never who you're gonna meet in life and how they could change you life. Closing your child off is a great way of restricting their ideas and creativity and essentially the course of their life.\n \n From an eductational point of view, no matter how many books your read, if you don't hear the other side of the anything you are only learning half the material. (i.e. Creation or evolution) Sometimes it is not important what you learn but what how you think. In order to stir up the thought process, you need conflicting ideas. Where do you get those? from other people who differ from you. Homeschool can't teach that.\n \n Homeschool hinders the way you think and the way you communicate to others and that's what makes the difference in life. A lot of people have a B.S. degree. Why one engineer is in a cubical and the other is designing a racecar has nothing to do with a higher educational degree.", 
   {}, 
   91705, 
   null, 
   1108586160.0
  ], 
  [
   91773, 
   null, 
   "daewoo", 
   "I have spoken fairly extensively with my brother in law (a science teacher) about the whole home schooling thing. His plan with his children is to keep them in public school until high school, then pull them out and home school them. The stats regarding homeschooling are, as stated in the original post, are fairly heavily weighted in favor of home schooling.\n \n I have questions regarding socialization issues in this. On the other hand, I have some question regarding how much of the social situation in current public schools I would really want my kids exposed to. \n \n For this queastion, I turned to my sister, a psychologist, and apparently a good one (though my opinion of psychology as a field is pretty low as a whole). She claims that although there is a lot of debate regarding the issue, she has yet to see any real evidence that homeschooling retards social development. Apparently most people who home school their children generally also enroll them in youth programs, church programs, etc... so the children learn to interact on a social level. Her opinion is that they probably end up better adjusted from a social standpoint in the long run, since the social structure at you raverage high school is so far removed from reality that whether you expose your children to it or not is frankly irrelevent as far as their long term social development goes. \n \n Personally, I will be sendign my children to a private school (I don't really see an option in this, since the record of public schools is so terrible from an educational standpoint). The downside is that this is that it required that I join a church, since the only private schools in my area are catholic schools, and there is a 4 YEAR list to get in. You get kind of prefered status if you are a member of the catholic church (you can get your kids in quicker).\n \n I think that people that have the time, resources, and intelligence to homschool their children should probably do it. The benifits from an academic standpoint are great, and I believe that the benifits form a social standpoitn are also better. \n \n I personally only know one family that homeschools, they have two daughters, one is 14 and one is 16. While I will be the first to admit that those girls do not act like \"normal\" high school kids, since most \"normal\" high school kids act like XXXXXX, I fail to see the problem. Theya re both enrolled in various youth activities and volunteer activities, so they get plenty of socialization, but they lack the belligerent, know it all attitude that most high school kids seem to have (whether they know it or not). They have TABLE MANNERS. They are actually pleasant to be around, as opposed to most high school kids that I know, who are little monsters.", 
   {}, 
   91731, 
   null, 
   1108596480.0
  ], 
  [
   91775, 
   null, 
   "zachvac", 
   "I would like to know why you would call someone who is home-schooled sheltered. Sure many home-school parents may shelter their kids, but we have a home-schooled kid in our neighborhood and he plays with us when we get out of school and has just as much social skills as the rest of us. Anyway I think there's another factor.\n \n Public schools spend so much time learning for the tests. They learn so that they can pass one particular test. Because of NCLB we do MSA (Maryland School Assessments, the test for NCLB) practice so we will do better. Things like bubbling, guessing, and other non-acedemic stuff. Homeschool kids are able to just learn the topic without worrying about tests. I seriously think that I could teach all my first-semester classes in 5-6 weeks (the semester is 18 weeks). And this would be me teaching. We spend so much time taking and preparing for tests that if we were to concentrate on just learning the topic it would go much quicker. This is also why I would guess private schools do better than public schools, but that could also be because of more money.\n \n Anyway, I'd like to know why you think home-schooled kids would have less social skills than public school kids. I agree they are important, but school isn't the only place to meet and interact with people. Actually I know that home-school kids can also take a lot more \"field trips\" places and get hands-on learning experience and interact with other people. Imagine instead of a textbook going to a meuseum to learn many topics in history. You would also get a lot more social skills in public than just sitting at desks all day. Yes I agree social skills are important, but I disagree that home-school kids get less social skills overall.", 
   {}, 
   91731, 
   null, 
   1108596900.0
  ], 
  [
   91833, 
   null, 
   "jyoshu", 
   "I read that the numbrt 1 reason why parents choose home schooling is  not  for superior education, but for superior moral education and relgious teaching.\n\n \n This is probably true. However, I don't think that's a bad thing. What parent doesn't want to be the main moral voice in their child's world? That's the way it should be.\n \n The comments from everyone else seem to mostly be concerned with socialization. I agree this can be an issue--I think this problem can be dealt with by the parents involving the children in venues that provide socialization.\n \n For that matter, the parents that do homoschool for religious reasons probably often have their kids involved in church, which definitely usually provides a venue for socialization.", 
   {}, 
   91704, 
   null, 
   1108615860.0
  ], 
  [
   91841, 
   null, 
   "joebrummer", 
   "This is probably true. However, I don't think that's a bad thing. What parent doesn't want to be the main moral voice in their child's world? That's the way it should be.\n \n The comments from everyone else seem to mostly be concerned with socialization. I agree this can be an issue--I think this problem can be dealt with by the parents involving the children in venues that provide socialization.\n \n For that matter, the parents that do homoschool for religious reasons probably often have their kids involved in church, which definitely usually provides a venue for socialization.\n\n \n \n Socialization maybe, reality, no. Studies show that faith based activities tend to twist and curb reality.", 
   {}, 
   91833, 
   null, 
   1108620360.0
  ], 
  [
   91846, 
   null, 
   "daewoo", 
   "Socialization maybe, reality, no. Studies show that faith based activities tend to twist and curb reality.\n\n \n I would have to disagree with this one. I take place in several church sponsered activities, despite the fact that my belief in god is sketchy at best. Most church related activities have nothing to do with religion, and with the excpetion of a possible prayer at the beginning or end, religon is rarely discussed.", 
   {}, 
   91841, 
   null, 
   1108623840.0
  ], 
  [
   91880, 
   null, 
   "jyoshu", 
   "Socialization maybe, reality, no. Studies show that faith based activities tend to twist and curb reality.\n\n \n Since you've been trying to go out of your way to falsely chide me for not giving stats with assertions on other fora, I'll ask for them here from you. Anything to back that up?", 
   {}, 
   91841, 
   null, 
   1108654740.0
  ], 
  [
   91893, 
   null, 
   "daewoo", 
   "Since you've been trying to go out of your way to falsely chide me for not giving stats with assertions on other fora, I'll ask for them here from you. Anything to back that up?\n\n \n \n Actually, I would like to see that one to. Not that I doubt you, joe, I just wonder how one measures the amount of twist that an indvidual applies to reality.", 
   {}, 
   91880, 
   null, 
   1108658280.0
  ], 
  [
   92339, 
   null, 
   "zachvac", 
   "This is more opinion than fact. A study can't determine what is warped.", 
   {}, 
   91893, 
   null, 
   1108866840.0
  ], 
  [
   92341, 
   null, 
   "zachvac", 
   "I would have to disagree with this one. I take place in several church sponsered activities, despite the fact that my belief in god is sketchy at best. Most church related activities have nothing to do with religion, and with the excpetion of a possible prayer at the beginning or end, religon is rarely discussed.\n\n \n But this is different from a religious school. Most religious schools require you to take at least one religion class. The point of these schools is to educate you about the religion and tell you how to live your life.", 
   {}, 
   91846, 
   null, 
   1108866900.0
  ], 
  [
   92367, 
   null, 
   "daewoo", 
   "But this is different from a religious school. Most religious schools require you to take at least one religion class. The point of these schools is to educate you about the religion and tell you how to live your life.\n\n \n Have you been to one? Our local catholic schools only require that you take a single religously oriented class and that you attend church twice a week, though they waive the churc requirement witha notef rom your parents. They will even waive the religous class requirement if asked.\n \n If you go to a public univerrsity, you are likely to be requred tot ake a comparative religon class, or a sociaology class which includes religous beliefs.", 
   {}, 
   92341, 
   null, 
   1108876560.0
  ], 
  [
   92382, 
   null, 
   "zachvac", 
   "Have you been to one? Our local catholic schools only require that you take a single religously oriented class and that you attend church twice a week, though they waive the churc requirement witha notef rom your parents. They will even waive the religous class requirement if asked.\n \n If you go to a public univerrsity, you are likely to be requred tot ake a comparative religon class, or a sociaology class which includes religous beliefs.\n\n \n I haven't been to one but I know some kids who went to a Jewish middle school. They said they had 2 religious classes and 5 regular classes. That's pretty much all I know because I didn't ask about it in detail.", 
   {}, 
   92367, 
   null, 
   1108880400.0
  ], 
  [
   92394, 
   null, 
   "Socialist", 
   "Usually you get to choose whether or not you want the comparative religion. I took anthropology and economics instead, and sociology and anthropology, although they do have a section on religion, anre't really going in depth about them or a particular ideology. It's naturally a part of human culture to talk about religion in some form.\n \n You talk about religion in history and political science as well.", 
   {}, 
   92382, 
   null, 
   1108882920.0
  ], 
  [
   92448, 
   null, 
   "zachvac", 
   "What's the point in going to a religious school if you don't take a religion class?", 
   {}, 
   92394, 
   null, 
   1108918320.0
  ], 
  [
   92489, 
   null, 
   "daewoo", 
   "What's the point in going to a religious school if you don't take a religion class?\n\n \n \n Private school students generally score higher in all categories on standardised tests.", 
   {}, 
   92448, 
   null, 
   1108927740.0
  ], 
  [
   92499, 
   null, 
   "JPSartre12", 
   "You completely left out a third factor of self-selection. Simply put:\n a) smart parents are likely to recognize they can provide more individualized attention than an overworked teacher and are therefore more likely to home school than your average parent\n b) smart parents are more likely to succeed (i.e. many parents may try to home school but only the best, brightest and most determined stick with it long enough)\n c) parents with the financial resources to make homeschooling successful (i.e. one parent has the luxury of staying home while the other works) are more likely to be of higher intelligence\n d) smart parents are more likely to have smart children\n \n Until you can control for these influences your ability to generalize the statistics is very limited. \n \n \n Whistler\n\n \n I'm guessing here, but did you, by chance, read The Bell Curve? Too many liberals, from the shallow end of the gene pool, jumped all over the book because it basically said that intelligence was largely hereditary. \n \n Knowing a few homeschoolers, I wouldn't say that they were more financially able to homeschool. They chose a simpler lifestyle and sacrificed a lot of materialism to homeschool. I take my hat off to them for choosing their kids over the big house, new cars, etc., Not many parents today are that altruistic. The \"me\" generation prefers to have double incomes, new cars, kids in daycare and mediocre education for their kids. \n IMO, parents are the biggest factor in a child's intelligence, education and future success. From the reasearch that I've done on homeschooling, they typically perform 2 grade levels higher than public schooled kids regardless  of their parents' educational achievements. That's impressive!", 
   {}, 
   91693, 
   null, 
   1108930740.0
  ], 
  [
   92505, 
   null, 
   "Socialist", 
   "Intellectual ability is both genetic and nurtured to an extent. That is one of the characteristics/traits mates look for when they seek to reproduce in the wild when it comes to social, intelligent creatures.\n \n It's one of the major factors of natural selection. Some go for strength, but when intelligence shows a superior advantage, mates seek out the smart ones.\n \n You can only teach someone to the extent of his abilities, but sucess and some growth can be affected by the environment. It'sa divided issue.\n \n However, http://www.indiana.edu/~intell/ holds that it's most likely a mixture of both. The environment is important as well, as would make some common sense.", 
   {}, 
   92499, 
   null, 
   1108931760.0
  ], 
  [
   92540, 
   null, 
   "zachvac", 
   "Private school students generally score higher in all categories on standardised tests.\n\n \n But why don't they go to a non-religious private school?", 
   {}, 
   92489, 
   null, 
   1108939680.0
  ], 
  [
   92541, 
   null, 
   "zachvac", 
   "and why would the school let people in who didn't want to take a religion class. What's the point of a religion-based school if it isn't going to teach all the kids about religion?", 
   {}, 
   92540, 
   null, 
   1108939740.0
  ], 
  [
   92567, 
   null, 
   "Socialist", 
   "Most do teach some form of religion and the curriculum has a high chance of being biased, since it's not a secular school.", 
   {}, 
   92541, 
   null, 
   1108945260.0
  ], 
  [
   92569, 
   null, 
   "daewoo", 
   "But why don't they go to a non-religious private school?\n\n \n \n Because the vast majority of private schools ARE religous. In Kansas, there are over 1000 private schools. Only 3 of them are not run by a religous org. \n \n \nand why would the school let people in who didn't want to take a religion class. What's the point of a religion-based school if it isn't going to teach all the kids about religion?\n\n \n I cannot answer for all, but I can answer for catholic schools because I have read their position on it. I would imagine that most others use a similar rational. The catholic church opens the doors of their schools to non catholics as a community service.", 
   {}, 
   92540, 
   null, 
   1108945680.0
  ], 
  [
   92571, 
   null, 
   "jyoshu", 
   "Depends on the school. Some are probably more religious-oriented than others. Just because a school has an affiliation with a church or denomination doesn't mean they will automatically require religious studies.", 
   {}, 
   92567, 
   null, 
   1108945860.0
  ], 
  [
   92575, 
   null, 
   "Socialist", 
   "Not all, no. I don't trust them though. I only trust secular private schools.", 
   {}, 
   92571, 
   null, 
   1108946160.0
  ], 
  [
   92588, 
   null, 
   "JPSartre12", 
   "Not all, no. I don't trust them though. I only trust secular private schools.\n\n \n Well, I guess that somebody that goes by the moniker \"Socialist\" would hold that opinion. \"The government knows best\" isn't my motto though. Mine would ne more like \"I love my country, but I fear my government\".", 
   {}, 
   92575, 
   null, 
   1108951140.0
  ], 
  [
   92589, 
   null, 
   "daewoo", 
   "Well, I guess that somebody that goes by the moniker \"Socialist\" would hold that opinion. \"The government knows best\" isn't my motto though. Mine would ne more like \"I love my country, but I fear my government\".\n\n \n Mine is along the lines of \"my government is my servant, not my master\"\n \n @ socialist\n \n I am a little confused regarding what there is to fear. Are you afraid that if you send your kids to such a school they might be exposed to religous content? Has it occured to you that since over 90% of americans claim som belief in god, and the majority of those practice, or claim belief in, some form of christianity, that is is probably good for your children to be exposed to some religous teachings, especially christian teachings? Even if they are not believers, an in depth knowledge of things like religon, which deeply effect other peoples thought processes, can only be benificial. \n \n I know that a knowledge of japanese religous teaching helped me greatly in dealing with japanese businessmen. The japanese story of creation holds that the japanese were created divinely, but they explain all the other cultures of the world int eh story. At roughly the same time that people (people being only japanese) were created, talking monkeys started to show up in the rest of the world. To the japanese, tehya re the only tru human beings, the rest of us are just talking monkeys. If you keep this in mind when dealing with them, suddenly some of their actions, which often seem illogical, start to make perfect sense. Knowledge of their belief system helps make them predictable to a level that could not be attained if you were entirely ignorant of these beliefs.", 
   {}, 
   92588, 
   null, 
   1108952160.0
  ], 
  [
   92592, 
   null, 
   "Socialist", 
   " \n Well, I guess that somebody that goes by the moniker \"Socialist\" would hold that opinion. \"The government knows best\" isn't my motto though. Mine would ne more like \"I love my country, but I fear my government\".\n\n \n ANd somehow secular = government knows best? I didn't say government. I said Secular. What? You can't have a secular private school?\n \n \n \n I am a little confused regarding what there is to fear. Are you afraid that if you send your kids to such a school they might be exposed to religous content? Has it occured to you that since over 90% of americans claim som belief in god, and the majority of those practice, or claim belief in, some form of christianity, that is is probably good for your children to be exposed to some religous teachings, especially christian teachings? Even if they are not believers, an in depth knowledge of things like religon, which deeply effect other peoples thought processes, can only be benificial.\n\n \n That's exactly of what I am afraid. I want my children to grow up in a scientific, secular world and have little or no contact with the metaphysical or it's ideology. \n \n I don't want children being around people who are like that; their beliefs are bad influences. I wouldn't want it in my public schools, so I probably wouldn't want to have it in a private school. They are alreadying trying to corrupt the public system with the metaphysical garbage, but the only thing that largely prevents it is government oversight---the smacking down of the fundies.", 
   {}, 
   92589, 
   null, 
   1108954260.0
  ], 
  [
   92609, 
   null, 
   "zachvac", 
   "ANd somehow secular = government knows best? I didn't say government. I said Secular. What? You can't have a secular private school?\n \n\n Yep, I went to one.\n \n \n \n\n That's exactly of what I am afraid. I want my children to grow up in a scientific, secular world and have little or no contact with the metaphysical or it's ideology. \n \n\n But they will have to face it when they grow up.\n \n\n I don't want children being around people who are like that; their beliefs are bad influences. I wouldn't want it in my public schools, so I probably wouldn't want to have it in a private school. They are alreadying trying to corrupt the public system with the metaphysical garbage, but the only thing that largely prevents it is government oversight---the smacking down of the fundies.\n\n I can agree with that, but as long as you can explain to them about religion, it's good to interact with people who are like the rest of the world. That was the one thing I liked about my middle school, it was secular, but we could discuss religion and different people could give their opinions. We had a project where we had to interview someone about a religion. We could learn about religion but it wasn't shoved down our throats.", 
   {}, 
   92592, 
   null, 
   1108964280.0
  ], 
  [
   92610, 
   null, 
   "zachvac", 
   "Well, I guess that somebody that goes by the moniker \"Socialist\" would hold that opinion. \"The government knows best\" isn't my motto though. Mine would ne more like \"I love my country, but I fear my government\".\n\n \n Private schools are ones not controlled by the government. So how does a religious private school have anything to do with the government knowing best?", 
   {}, 
   92588, 
   null, 
   1108964400.0
  ], 
  [
   92627, 
   null, 
   "Socialist", 
   "\n Private schools are ones not controlled by the government. So how does a religious private school have anything to do with the government knowing best?\n Reply With Quote\n\n \n It doesn't. It was merely a knee-jerk reaction to someone with the name Socialist.", 
   {}, 
   92610, 
   null, 
   1108966920.0
  ], 
  [
   92629, 
   null, 
   "zachvac", 
   "It doesn't. It was merely a knee-jerk reaction to someone with the name Socialist.\n\n And you know this how?", 
   {}, 
   92627, 
   null, 
   1108967100.0
  ], 
  [
   92635, 
   null, 
   "Socialist", 
   " Well, I guess that somebody that goes by the moniker \"Socialist\" would hold that opinion. \"The government knows best\"\n\n \n He said that to me when I didn't even say anything about the Primacy of the State. I merely mentioned that I like Secular Private Schools more than Religious ones.\n \n Instead of actually paying attention to what I said, he attacked my political ideology--and I am not even a socialist lol.", 
   {}, 
   92629, 
   null, 
   1108967760.0
  ], 
  [
   92637, 
   null, 
   "zachvac", 
   "He said that to me when I didn't even say anything about the Primacy of the State. I merely mentioned that I like Secular Private Schools more than Religious ones.\n \n Instead of actually paying attention to what I said, he attacked my political ideology--and I am not even a socialist lol.\n\n \n You just chose the name so you'd get that kind of response?:) Socialism actually isn't such a bad philosophy if everyone were perfectly non-corrupt and cared for the good of humanity. Too bad we aren't all like that.", 
   {}, 
   92635, 
   null, 
   1108967940.0
  ], 
  [
   92643, 
   null, 
   "Socialist", 
   " You just chose the name so you'd get that kind of response? Socialism actually isn't such a bad philosophy if everyone were perfectly non-corrupt and cared for the good of humanity. Too bad we aren't all like that.\n\n \n Well, I do like  some  socialist ideas, and I am for some weatlh redistribution, and I favour minimum wages, welfare, universal healthcare, but I don't want a command economy, and that is important to some varients of socialism.\n \n I am generally for bigger government, active government to solve social problems.\n \n I am highly tolerant of social concerns and I don't want the State to tell me what to do most of the time, unless it can show there is objective harm that can be pragmatically avoided through legislation. (For example, if there were some magic way to make Prohibition successful, I would do vote for it).\n \n Other than that, I am pro-State, but one has to realize that the state isn't a monolithic entity. There is no \"State.\" There are only people in the State.\n \n I am not really a true socialist, or at least not what most people call socialists. I don't really fit into the fanatical marxist or lennin-esque socialism or the extreme.\n \n \n \n \n \n I tend to agree with Libertarians on many issues concerning social concerns, but I am mixed on their economic outlook. \n \n I strongly dislike conservatives and Communitarians are weird.", 
   {}, 
   92637, 
   null, 
   1108968600.0
  ], 
  [
   92646, 
   null, 
   "zachvac", 
   "Well, I do like  some  socialist ideas, and I am for some weatlh redistribution, and I favour minimum wages, welfare, universal healthcare, but I don't want a command economy, and that is important to some varients of socialism.\n \n I am generally for bigger government, active government to solve social problems.\n \n I am highly tolerant of social concerns and I don't want the State to tell me what to do most of the time, unless it can show there is objective harm that can be pragmatically avoided through legislation. (For example, if there were some magic way to make Prohibition successful, I would do vote for it).\n \n Other than that, I am pro-State, but one has to realize that the state isn't a monolithic entity. There is no \"State.\" There are only people in the State.\n \n I am not really a true socialist, or at least not what most people call socialists. I don't really fit into the fanatical marxist or lennin-esque socialism or the extreme.\n \n \n \n \n \n I tend to agree with Libertarians on many issues concerning social concerns, but I am mixed on their economic outlook. \n \n I strongly dislike conservatives and Communitarians are weird.\n\n \n What's a Communitarian?", 
   {}, 
   92643, 
   null, 
   1108968720.0
  ], 
  [
   92649, 
   null, 
   "Socialist", 
   "well, according to the PEw Research Centre, they are people who support the community over the individual and want social order.", 
   {}, 
   92646, 
   null, 
   1108969140.0
  ], 
  [
   92651, 
   null, 
   "daewoo", 
   "That's exactly of what I am afraid. I want my children to grow up in a scientific, secular world and have little or no contact with the metaphysical or it's ideology. \n \n I don't want children being around people who are like that; their beliefs are bad influences. I wouldn't want it in my public schools, so I probably wouldn't want to have it in a private school. They are alreadying trying to corrupt the public system with the metaphysical garbage, but the only thing that largely prevents it is government oversight---the smacking down of the fundies.\n\n \n So instead of preparing your children for the real world, you prefer to prepare them for a world that only exists in your mind? \n \n If you want to doom yourself to failure by refusing to accept that things are not as you would like them to be, preferring to live in some fantasy land, you are free to do so.\n \n Please don't condem your children to this fate.\n \n Exactly what is it that scares you so baldy about religon? Is it that you might be worng, and destined for hell, or do you fear morality, preferring to live without the burden of such distinctions, or are you, like so many racists and bigots, simply seized by an irrational hate/fear of a specific groups or belief system?", 
   {}, 
   92592, 
   null, 
   1108969320.0
  ], 
  [
   92712, 
   null, 
   "zachvac", 
   "Yes I think you should let kids make their own decisions in terms of religion. I hate it when kids are taught without a doubt that the bible is the book of laws of life. So instead of actually believing in it it's the old: \"it's true because my mommy said so\". Because if you don't introduce them to religion, they will find out sooner or later. They still have to live in the world.", 
   {}, 
   92651, 
   null, 
   1109006940.0
  ], 
  [
   92749, 
   null, 
   "JPSartre12", 
   "ANd somehow secular = government knows best? I didn't say government. I said Secular. What? You can't have a secular private school?\n\n \n Since 99.999% of all secular schools receive funding from Uncle Sam, It's a safe assumption to say secular = governmental controlled. Ever hear of the Department of Education? There's one for each state and there's a national one. THEY set the curriculum for ALL public schools and ANY private schools receiving any governmental funds. And, in all liklihood, your private secular school also receives some funding from the state or Fed, so it's curriculum is also tied to the government. Last time I checked, THEY were part of the government, hence secular = govermnent.\n For example, did you know that there are only 2 Colleges in the US that don't receive any governmental funding? One of them is here in my state of Michigan. It's called Hillsdale College, It's very conservative and very religious.\n \n \n\n That's exactly of what I am afraid. I want my children to grow up in a scientific, secular world and have little or no contact with the metaphysical or it's ideology. \n \n I don't want children being around people who are like that; their beliefs are bad influences. I wouldn't want it in my public schools, so I probably wouldn't want to have it in a private school. They are alreadying trying to corrupt the public system with the metaphysical garbage, but the only thing that largely prevents it is government oversight---the smacking down of the fundies.\n\n \n So, you ARE in favor of governmental control, of education? I'm so confused. :xbanghead emoticon_confused", 
   {}, 
   92592, 
   null, 
   1109015820.0
  ], 
  [
   92764, 
   null, 
   "JPSartre12", 
   "Private schools are ones not controlled by the government. So how does a religious private school have anything to do with the government knowing best?\n\n \n If a school receives ANY state or federal funds for ANY purpose, it has to follow the state or Federal curriculum guidelines. Trust me, I've been down that road before with OBE. emoticon_mad", 
   {}, 
   92610, 
   null, 
   1109019180.0
  ], 
  [
   92767, 
   null, 
   "JPSartre12", 
   "Originally Posted by Socialist\n He said that to me when I didn't even say anything about the Primacy of the State. I merely mentioned that I like Secular Private Schools more than Religious ones.\n \n Instead of actually paying attention to what I said, he attacked my political ideology--and I am not even a socialist  lol.\n \n \n \nWell, I do like  some  socialist ideas, and I am for some weatlh redistribution, and I favour minimum wages, welfare, universal healthcare, but I don't want a command economy, and that is important to some varients of socialism.\n \n I am generally for bigger government, active government to solve social problems.\n \n I am highly tolerant of social concerns and I don't want the State to tell me what to do most of the time, unless it can show there is objective harm that can be pragmatically avoided through legislation. (For example, if there were some magic way to make Prohibition successful, I would do vote for it).\n \n Other than that, I am pro-State, but one has to realize that the state isn't a monolithic entity. There is no \"State.\" There are only people in the State.\n \n I am not really a true socialist, or at least not what most people call socialists. I don't really fit into the fanatical marxist or lennin-esque socialism or the extreme.\n \n I tend to agree with Libertarians on many issues concerning social concerns, but I am mixed on their economic outlook. \n \n I strongly dislike conservatives and Communitarians are weird.\n\n \n The problem is that I DID pay attention to what you said. You stated that you weren't a Socialist then proceeded to demonstrate that you were. You may not be a 100% Certified follower of Lenin, but you certainly are a Socialist. \n Here's a tip for you nOOb, next time you take shots at veterans, make sure that your guns loaded and NOT pointed back at yourself. emoticon_rolleyes", 
   {}, 
   92643, 
   null, 
   1109019660.0
  ], 
  [
   92769, 
   null, 
   "Socialist", 
   " Since 99.999% of all secular schools receive funding from Uncle Sam, It's a safe assumption to say secular = governmental controlled.\n\n \n Prove the source that says 99.99999% does. Then I will believe you. Regardless, it's not safe to assume that Secular = Government, since one doesn't imply the other. This is really basic logic you aren't understanding.\n \n Even schools that do recieve federal funding in the form of Categorical aid grants have a lot of operational leeway and are largely uncontrolled. That's why they are private. \n \n The freedom increases with Block Grants. That is why private schools like them.\n \n However, many Private Secondary and Colleges are accredited by the\n \n Council for Higher Education Accreditation, which is an independant organization, not run by the Department of Education.\n \n \n \n \n \n \n\n Ever hear of the Department of Education?\n\n \n \n THere's that Flint Michigan Education of yours again at work. I said I would support a secular one more than I would support a religious private school, regardless if it were funded by the government or not.\n \n Yes, I have heard of the Department of Education. Have you heard of totally Private School run by the Board of Education of a Local Region or State? No. There are private, non religious schools, and I trust SECULAR education, not religious education. There is no secular = government. A doesn't follow from B, especially since I wasn't talking about ones controlled by government.\n \n \n \n \n\n There's one for each state and there's a national one. \n\n \n  Keep beating that STrawman there.\n \n No really? I didn't know that *shock* This might actually be relevant if you read my post talking about supporting a private secular over a private religious, and there are many private secular instituations not controlled by the government. They are largely free and accredited by the organization shown above.\n \n Even the ones accredited by the DoE don't control the curriculum, they rather set an  agreed to minimum that is coordinated with other accredation agencies. \n \n \n\n THEY set the curriculum for ALL public schools and ANY private schools receiving any governmental funds.\n\n \n Blah blah blah, same repetitive strawman of my post, mixed with a complete inability to recognize his own Bifurcation of the issue. THere are private schools that aren't controlled by the government and non-religious. There exist more than 2 types of schools. Gub'ment! and \"Religious private\"\n \n You are just pulling **** out of your anal cavity. \n \n \n\n And, in all liklihood, your private secular school also receives some funding from the state or Fed, so it's curriculum is also tied to the government. Last time I checked, THEY were part of the government, hence secular = govermnent.\n\n \n I\n You check wrong. Secular isn't = to government. It's Non-sequitor as a conclusion. They can be both totally private and recieve some federal aid. Saying Secular = Government is a universal quanitifer that can be disproven by finding 1 that isn't controlled by the big bad gub'ment. \n \n \n\n For example, did you know that there are only 2 Colleges in the US that don't receive any governmental funding? One of them is here in my state of Michigan. It's called Hillsdale College, It's very conservative and very religious.\n\n \n Too bad I am not talking about College. THere are Private schools for secondary education that aren't religious. Many are, but not all.\n \n Interesting, since i just got several brochures for more religious colleges. They must recieve funding from the government. In that case, since they are colleges, and only 2 colleges don't get any funding, the government must fund religious colleges, therefore it must direct them, even though they are private religious ones.\n \n This means that even non-secular schools are secular, therefore run by the government, according to your twisted logic. In your world, relgious secular, and secular = government!\n \n \n emoticon_rolleyes\n \n \n \n The problem is that I DID pay attention to what you said. You stated that you weren't a Socialist then proceeded to demonstrate that you were. You may not be a 100% Certified follower of Lenin, but you certainly are a Socialist.\n Here's a tip for you nOOb, next time you take shots at veterans, make sure that your guns loaded and NOT pointed back at yourself.\n\n \n You are an idiot, so I will only pwn your idiot rhetoric again, and then I will accept your concession.\n \n This is from the Departement of Education as well as multiple sources from Pirvate Instituations on private insitutions. \n \n \n Private schools generally seek periodic review, or accreditation, by an independent agency to maintain their reputation and to qualify for certain forms of governmental assistance.\n \n Regardless of their organizational structure, private schools are largely free to manage their own affairs. They can choose their students, their faculty, and their curriculum, and make their own internal rules.\n \n According to nearly all souces, the vast majority of nonsectarian schools are just like the religious schools. THey choose their own government, their own curriculum, their own rules and regulations, but they are subject largely to \n \n 1. Health regulations\n 2. Disabilities\n 3. Anti-discrimination laws\n 4. Some (SOME) subjects at least must be taught, but it doesn't say how, what.\n \n \n Private Education in the United States, programs of instruction in the United States that are created, controlled, operated, and principally financed by private individuals and groups rather than by governments. About 11 percent of American elementary and secondary school (high school) students attend private schools, and 24 percent of all elementary and secondary schools in the United States are private. Private education is also offered at many American preschools as well as at many colleges, universities, and technical institutes.\n \n Many private schools do NOT have to follow national standards, since Monmouth University, a private university, does not accept a lot of community credit colleges, while state colleges and other community colleges are required to accept all 64 credits.\n \n They are not required to accept 64 credits, because they use a  different curriculum, as is described by their transfer coordinator. They teach a different curriculum not controlled. Their history classes do not match up, their english classes don't match up, and they teach a higher grade math, even if it's the same class. MTH 113 is one example.\n \n \n \n  Unlike public schools-which are controlled by state and local governments-private schools in the United States are relatively free from governmental regulation. Consequently, private schools vary considerably in their philosophy, mission, and educational method. Nevertheless, private schools typically share certain characteristics that distinguish them from public schools. These include (1) a decentralized system of governance, (2) high academic expectations, (3) small enrollment and class size, and (4) shared values.\n \n your Concession is accepted, dotard.\n \n You're an idiot who likes to think he's smart because he can talk down to people who usually cower in fear because they are intimdated by your pseduo-intellectual ability. Before you call someone a noob, take a class in basic socio-economics and logic fool, so you won't spout so many logical errors. You don't even know what socialism is fool, for if you did, you would notice that everything I mentioned is part of market capitalism in the United States--a nation that is economically ranked 6th freest in the entire world. Liberals don't = socialists, as you would learn in a basic 101 class. Socialist is completely on the opposite end of the two-dimensional Idealog test as well as the results from the Pew Research Centre's Typology of American Voters. I am not a socialist, but you are still an idiot.\n \n Why am I not a socialist? Let's see: Below\n \n 1. Since I am not for a Command Economy\n 2. I am not for Fully equalizing wealth\n 3. I am pro business and private enterprise (most of the time)\n 4. I am not fanatically pro-union.\n 5. I don't believe in the primacy of the working class\n 6. I don't believe the state should control what people do outside of basic commonsense moral law. (ya know, don't shoot or steal)\n 7. Pro-State doesn't mean PRO-SUPERGOVERMENT Lol1111 fool. I means I am pro-government. I am not dissatisfied with the general type of government we have and I wouldn't be against government help and intervention in some areas. That's not socialist, that's a mixed economy.\n 8. I am for maximising social freedoms.\n \n \n You are committing the fallacy of the false Dilemma. Someone is either socialist or not a socialist, which is wrong. According to your logic, you might not be 100% socialist, but you still are one! WOO HOOO fuzzy logic is fun! According to your logic, anyone but the most ardent Libertarians are socialists! Idiot.\n \n Take a logic 101 class, fool.\n \n \n I didn't demonstrate anything. I stated what the United States government is, and according to Economics Scholars, it's a mixed economy that's highly capitalistic, in fact, it's the 6th freest nation in the world, so button your lips, dotard.\n \n Therefore, since I exhibit nothing that's a socialist government, rather what the US market capitalism is now, according to  most scholars, I am not a Socialist. YOu should learn basic reading comprehension, but way back there in Flint Michigan, they must not be able to afford books--Veteran XXXXX.", 
   {
    "unicode_changes_made": true
   }, 
   92764, 
   null, 
   1109020020.0
  ], 
  [
   93443, 
   null, 
   "zachvac", 
   "If a school receives ANY state or federal funds for ANY purpose, it has to follow the state or Federal curriculum guidelines. Trust me, I've been down that road before with OBE. emoticon_mad\n\n \n I know that. I went to a school that didn't recieve a dime from the state. It was a non-profit organization that got all its money from tuition and we most definately didn't follow state or federal curriculum guidelines.", 
   {}, 
   92764, 
   null, 
   1109209980.0
  ], 
  [
   93488, 
   null, 
   "Socialist", 
   "The above self-proclaimed genius (which he isn't) doesn't understand that there are schools that are secular that aren't controlled by the government. Only fools make universal quantifier statements, which defy reality. There are other accredation agencies.", 
   {}, 
   93443, 
   null, 
   1109221380.0
  ], 
  [
   93491, 
   null, 
   "zachvac", 
   "Since 99.999% of all secular schools receive funding from Uncle Sam, It's a safe assumption to say secular = governmental controlled. \n\n \n So since 99% (or close to that) of people like chocolate, is it safe to say that person = likes chocolate, or all people like chocolate? There are people who don't like chocolate and there are secular private schools.", 
   {}, 
   92749, 
   null, 
   1109221620.0
  ], 
  [
   93518, 
   null, 
   "Socialist", 
   "Let us not forget that His 99% figure is most likely a load of horse dung in the first place. In fact, he's so full of **** that I am surprised the pressure build-up hasn't blown the top of his bloody head off.\n ", 
   {
    "unicode_changes_made": true
   }, 
   93491, 
   null, 
   1109235780.0
  ], 
  [
   93531, 
   null, 
   "daewoo", 
   "According to http://nces.ed.gov/programs/quarterly/vol_1/1_4/3-esq14-j.asp\n \n \nIn the fall of 1997, there were 27,402 private elementary and secondary schools in the United States, a total not statistically different from the 27,686 schools counted in the fall of 1995 (Broughman and Colaciello 1998).\n\n \n According to that page, only 22% of private schools are nonsectarian. For the purposes of this exercise, we will assume that all those nonsectarian schools are secular (though tis is very unlikely to be the case).\n \n According to http://www.edreform.com/index.cfm?fuseAction=section&pSectionID=15&cSectionID=97\n \n \nTOTAL NUMBER OF PUBLIC SCHOOLS: 94,112\n Elementary: 65,228 \n Secondary: 22,180 \n Combined: 5,288 \n Other: 1,416\n\n \n So, lets assume that there are 6028 secular private schools in the country. Also, for the sake of this exercise, we will assume that these secular private schools do not recieve any public funding.\n \n This would lead us to believe that secular = government controlled 93.5949% of the time, if we assume that all nonsectarian scoools are secular (which they are not) and that none recieve any government funding. \n \n If you break it down by number of students, according to the first link, there are only 796,972 students in private nonsectarian schools. \n \n According to the second link, total enrollment in public schools is 47,917,774.\n \n Again, assuming that public scools are all secular in nature, as are all nonsectarin schools, it would appear when comparing the numebr of students, that secular = government 98.33679% of the time.\n \n Are you happy now, you whiney baby? \n \n I cannot believe that certian people here wasted an ENTIRE page berating another poster for making a statement that was obviously a general and personally held observation as opposed ot being presented as factual mathematics. Are our schools really turning out people so STUPID that they are completely unable to view anything with any objectivity at all? \n \n Obviously without directing this at anybody in particular, has anybody else here noticed that we seem to be attracting long winded, immature, concieted, but incredibly foolish college students around here lately? I though that as people experienced increased numbers of orbital journeys around the sun, they were supposed to increase in maturity, wisdom, etc...\n \n Why is it that so many high school kids here seem to be respectful, capable of making a coherent argument, intelligent, and just generally fairly pleasant (of sometimes a little naive) to interact with.\n \n The last couple of college kids who have shown up here, though, have been loud mouthed, rude, ignorant, conceited fools. \n \n Again, I am not directing this at anybody in particular, nor am I suggesting that anybody in this thread should be sorted into either of the groups above (especially not JP, who we all know is an old guy). I just can't help but wonder if perhaps certain posters here are simply reincarnations of other posters here who were made to look foolish and have quite posting. \n \n It seems like some confrontations in some of these threads could be avoided if people would apply some common sense to the situation, such as recognisign that when people asy things like \"99.999999%\", they generally do so in order to indicate that they are generalising for the purpose of conversation. \n \n Just a note meant to be helpful, when a person says things like:\n \n \nLet us not forget that His 99% figure is most likely a load of horse dung in the first place. In fact, he's so full of **** that I am surprised the pressure build-up hasn't blown the top of his bloody head off.\n\n \n in response to statements like:\n \n \nSince 99.999% of all secular schools receive funding from Uncle Sam, It's a safe assumption to say secular = governmental controlled.\n\n \n The person in question only manages to make themselves look like an idiot. \n \n It simply begs the question, \"Is this person really so stupid that they ae unable to apply any common sense at all to theire reading comprehension (or lack thereof), or is their argument simply so pathetically weak that they have to nitpick at how the original poster phrased their comment?\"", 
   {
    "unicode_changes_made": true
   }, 
   93518, 
   null, 
   1109240460.0
  ], 
  [
   93633, 
   null, 
   "Socialist", 
   " \n The person in question only manages to make themselves look like an idiot.\n \n\n \n \n Why is it that so many high school kids here seem to be respectful, capable of making a coherent argument, intelligent, and just generally fairly pleasant (of sometimes a little naive) to interact with.\n \n The last couple of college kids who have shown up here, though, have been loud mouthed, rude, ignorant, conceited fools.\n\n \n You're an idiot. Highschool students are largely XXXXXX, which I think you are. You can't handle being wrong, so you whine and throw around lots of logical fallacies to cover-up your own ineptitude. Projection projection. You think you are right and smart, but you really aren't. You only look like a XXXXX on any credible discussion board, which this isn't. It's mostly a troll fest for creationists and illogical imbeciles who like to strawman other people's posts.\n \n You are committing the fallacy of false dilemma. Don't do it again. Or...you can always keep your lips firmly attatched to his genetalia. I suggest you read the above post and learn that I am not arguing that most schools are public secular. All your calculations are pointless regardless, since the argument is that private secular doesn't = government. Secular is secular, government is government.\n \n Only you and your dotard friend are XXXXXX, since you cannot form a logically coherent sentence combined with proper grammar.\n \n Both of your arguments are logically flawed. Your premises don't lead to the conclusion.\n \n  About 11 percent of American elementary and secondary school (high school) students attend private schools, and 24 percent of all elementary and secondary schools in the United States are private.\n \n Of this already small number, There are over 6k private secular schools that are nonsectarian (22%). Nonsectarian is, for all intents and purpouses, according to independent accredation agencies, secular. This means they have no affiliation with religion. If 22% of private schools are secular, and they are private, and most private secular are accredited by the independent agency, which logically means \"not government control,\" then all of them are not under government control. If all of them aren't under government control, then  XXXXXX  like you, who make universal quanitifcations, cannot logically say that \"secular = government.\"\n \n It's logically fallacious to say that all secular schools all(secular = government) are government schools, but it's not fallacious to say that all government schools are secular. Do you understand this very simple logical statement? Do I have to provide links to your logical fallacy?\n \n Happy now you whiney XXXXX?\n \n \n Nonsectarian, or secular, private schools are usually not affiliated with any religion or church. Some nonsectarian schools originated as religious institutions but now welcome all students. These schools generally emphasize the development of moral character more than the study of organized religion. Other independent schools may have highly specialized educational programs that focus on particular subjects, such as science, math, and the performing arts.\n\n \n \n \n It simply begs the question, \"Is this person really so stupid that they ae unable to apply any common sense at all to theire reading comprehension (or lack thereof), or is their argument simply so pathetically weak that they have to nitpick at how the original poster phrased their comment?\"[/quote]\n \n Actually, my argument is quite strong, since I am arguing with logical halfwits who can barely write an english sentence. It's neither stupid nor nitpicking to call ******** on someone when someone says \"secular = government.\" As I logically proved above, it doesn't, and it's a fallacy. Learn not to use them, then I will stop calling you on them. Untill then, buckle up, sit down, and let me teach you logic.\n \n Oh, and replace \"they\" with he, since in the above sentence you are attaching a plural pronoun to what requires a neutral gender singular personal pronoun.\n \n Talk about lack of reading comprehension. You need some basic grammar lessons to go with those logic lessons.\n \n \n \n \n \n \n \n \n \n \n \n I cannot believe that certian people here wasted an ENTIRE page berating another poster for making a statement that was obviously a general and personally held observation as opposed ot being presented as factual mathematics. Are our schools really turning out people so STUPID that they are completely unable to view anything with any objectivity at all?\n \n\n \n I cannot believe XXXXXX like you and the other dotard actually stated that Secular = Government, when that's not logically correct. When you have been proven wrong, you run around in circles with your finger up your XXX complaining and sucking your thumb. I already pointed out your fallacy. I will accept your logical concession now. You will realize the error of your ways, or you will continue to be the fool you are.\n \n \n \n \n \n \n It seems like some confrontations in some of these threads could be avoided if people would apply some common sense to the situation, such as recognisign that when people asy things like \"99.999999%\", they generally do so in order to indicate that they are generalising for the purpose of conversation.\n \n\n \n \n XXXXX ONE! OMG OMG OMG Secular = teh guvament!!!. LOLZ111 that means government!\n \n XXXXX TWO! OMGOMGOMG Someone saidz it doezn't! Let's pretendz it doesz despite logic!!!!\n \n \n \n So, lets assume that there are 6028 secular private schools in the country. Also, for the sake of this exercise, we will assume that these secular private schools do not recieve any public funding.\n\n \n Don't assume. It only makes an a s s out of you. Most of them are secular, and most of them are tremendously free. They are considerably different from public government schools. Your argument is horrendously flawed.\n \n \n\n This would lead us to believe that secular = government controlled 93.5949% of the time, if we assume that all nonsectarian scoools are secular (which they are not) and that none recieve any government funding.\n\n \n Most of them are secular, so 93% doesn't equate to 99%. Furthermore, this all proves that not all secular are government controlled. Secular also doesn't imply government, since they have two different defintions. Your aregument is horridly flawed.\n \n Most are independently accredited and work off of tuition. Even when they don't, they retain tremendous quantities of freedom, as is described.\n \n \n\n If you break it down by number of students, according to the first link, there are only 796,972 students in private nonsectarian schools.\n\n \n No one is arguing how many people are in schools. The discussion is about the preference of Secular Private over Religious Private, but you probably didn't bother to read that.", 
   {}, 
   93531, 
   null, 
   1109281020.0
  ], 
  [
   93652, 
   null, 
   "daewoo", 
   "There are over 6k private secular schools. 22% of privates schools are nonsectarian. Nonsectarian is, for all intents and purpouses, according to independent accredation agencies, secular. This means they have no affiliation with religion. If 22% of private schools are secular, and they are private, and most private secular are accredited by the independent agency, which logically means \"not government control,\" then all of them are not under government control. If all of them aren't under government control, then  XXXXXX  like you, who make universal quanitifcations, cannot logically say that \"secular = government.\"\n\n \n Schools such as Rockhurst high school, which is staffed entirely by jesuit priests, are considered non secretarian because they are not specifically alinged with any church or sect, and they allow students from all faiths, or those lacking any at all.\n \n The qualification made by JP (that was not me), was rather obviously a broad statement expressing personal belief, a generalization, as opposed to a stated fact. Again, is your reading comprehension so low that you are unable to differentiate the two based on context?\n \n \n \nActually, my argument is quite strong, since I am arguing with logical halfwits who can barely write an english sentence. It's neither stupid nor nitpicking to call ******** on someone when someone says \"secular = government.\" As I logically proved above, it doesn't, and it's a fallacy. Learn not to use them, then I will stop calling you on them. Untill then, buckle up, sit down, and let me teach you logic.\n\n \n After you learn some reading comprehension, then maybe you can come back and try to push your rediculous logic. What JP was essentially saying is:\n \n In our current education system, secular schools are controlled by the government in almost all cases\".\n \n I believe we just proved mathematically that he is correct. You prefer to focus on te 99.9999% statement, which was rather obvioulsy meant to imply \"near total\" as opposed to being presented as a statistic.\n \n You are wasting our time here with a stupid and childish argument regarding the was he phrased his statement, as opposed to actually arguing the obvious intent of the statement.\n \n I, for one, posess neither the time, nor the patience, to debate such obscure points with somebody of obviously substandard intellectual ability. Perhaps wherever you are at this time in your life, arguing points that are obviously outside the intentions of the speaker, or focusing on a few words while completely disregarding both the context of the statement and the rather obvious spirit in whihc the statement was made, is a worthy pursuit. I hope you learn better before you get out into tthe real world, because unless you plan on a career in either politics or the media, the first time you engage in such a pointless and worthless debate on company time, you are likely to find yourself unceremoniously sacked.\n \n \n This is what I was referring to in regards to the high school kids around here. I have yet to see a single one of them engage in pointless, and obviously worthless, debates such as this. I certainly have't seen any of the older and wiser folks doing so. BUT, I have seen a couple of the college kids here who absolutly insist on making fools of themselves by engaging in confrontations regarding terminology as opposed to content. IS the drug problem at our colleges really that bad?\n \n Do you really imagine for even 1 minute that anybody is sitting at home saying to themselves \"Man, that socialist as really smart to have refuted the 99.99999% figure\". Of course not. People are going \"what kind of idiot is this person that they are unable to recognise the context in which the post was made\".\n \n As I said, I personally have neither the time, nor the patience for dealing with such things. I live in the real world. I have things to do. I do believe I will give you the dubious honor of being the first person on my \"ignore\" list.", 
   {}, 
   93633, 
   null, 
   1109284440.0
  ], 
  [
   93658, 
   null, 
   "Socialist", 
   " Schools such as Rockhurst high school, which is staffed entirely by jesuit priests, are considered non secretarian because they are not specifically alinged with any church or sect, and they allow students from all faiths, or those lacking any at all.\n\n \n According to independent accredation, the non-sectarian = secular. Your own source divides private instituations into three categories. Catholic, Other Religious, and Non-sectarian. The \"other\" category is listed further as Affiliated and Nonaffiliated.\n \n \n\n The qualification made by JP (that was not me), was rather obviously a broad statement expressing personal belief, a generalization, as opposed to a stated fact. Again, is your reading comprehension so low that you are unable to differentiate the two based on context?\n\n \n You only should make stated facts in a discussion. Personal statements are worthless, as are such quantifications. I understand fine that that's his opinion. His opinion is ********, notwithstanding. My reading comprehension is fine. The problem is \"secular = government.\"\n \n 100% reading comprehension makes that wrong regardless of what rehetorical game you two are trying to play.\n \n \n \n After you learn some reading comprehension, then maybe you can come back and try to push your rediculous logic. What JP was essentially saying is:\n\n \n Two words for XXXXXX like you:\n \n Take Logic\n \n \n\n In our current education system, secular schools are controlled by the government in almost all cases\".\n\n \n He said secular = government, which is wrong. You do know that the statement you just provided to defend his statement that secular = government is called the fallacy of amphiboly, right? Duh! Dotards wouldn't.\n \n \n\n I believe we just proved mathematically that he is correct. You prefer to focus on te 99.9999% statement, which was rather obvioulsy meant to imply \"near total\" as opposed to being presented as a statistic.\n\n \n I don't care about the 99% statement. That's an obvious hyperbole. The secular = government is the problem.\n \n \n\n You are wasting our time here with a stupid and childish argument regarding the was he phrased his statement, as opposed to actually arguing the obvious intent of the statement.\n\n \n Your childish idiocy fails to comprehend that saying secular = government is a fallacy. XXXXXX who don't understand logic usually don't understand. You are like the twin brother of that creationist fool in the evolution thread.\n \n \n\n I, for one, posess neither the time, nor the patience, to debate such obscure points with somebody of obviously substandard intellectual ability.\n\n \n Please dotard. I am far smarter than you. Hahah. You again have no logical counter to the logical fallacy accusation.\n \n \n\n I hope you learn better before you get out into tthe real world, because unless you plan on a career in either politics or the media, the first time you engage in such a pointless and worthless debate on company time, you are likely to find yourself unceremoniously sacked.\n\n \n \n I accept your concession, since you cannot get around your fallacy.\n \n \n\n This is what I was referring to in regards to the high school kids around here. I have yet to see a single one of them engage in pointless, and obviously worthless, debates such as this.\n\n \n \n My argument is strong. You inability to comprehend basic 101 logic is also strong. Your concession is accepted, since Secular doesn't = government. It's a logical fallacy to say such.\n \n You say weak argument, I say \"logically fallacy.\"\n \n \n\n I certainly have't seen any of the older and wiser folks doing so. BUT, I have seen a couple of the college kids here who absolutly insist on making fools of themselves by engaging in confrontations regarding terminology as opposed to content. IS the drug problem at our colleges really that bad?\n\n \n Long-winded tirade with no pont, is all this paragraph is. I accept your concession untill you can get rid of your logical fallacy you casually ignore.\n \n \n\n Do you really imagine for even 1 minute that anybody is sitting at home saying to themselves \"Man, that socialist as really smart to have refuted the 99.99999% figure\". Of course not. People are going \"what kind of idiot is this person that they are unable to recognise the context in which the post was made\".\n\n \n That wasn't what the majority of the argument was about. The argument was about \"secular = government.\" I clearly proved him wrong. Now run along and keep playing with your toybox of logical fallacies, youngen.\n \n Only an idiot makes such a statement, but then again, you will continue to focus on the 99,.9999999 worthless quantification and not what the real argument was.\n \n \n\n As I said, I personally have neither the time, nor the patience for dealing with such things. I live in the real world. I have things to do. I do believe I will give you the dubious honor of being the first person on my \"ignore\" list.\n\n \n You live in the real world, yet you are on a webforum wasting time *wink*\n \n Good, ignore me. You are one less XXXXX with whom I have to deal. I use logic in my posts; you use rhetorical fallacies and emotivism.\n \n Bye bye now chuckles! Your idiocy was fun!", 
   {}, 
   93652, 
   null, 
   1109285520.0
  ], 
  [
   93714, 
   null, 
   "JPSartre12", 
   "Prove the source that says 99.99999% does. Then I will believe you. Regardless, it's not safe to assume that Secular = Government, since one doesn't imply the other. This is really basic logic you aren't understanding.\n\n \n Your argument is purely one of semantics. Show me one high school that receives ZERO governmental funds and has ZERO Federal or State requirements.\n \n\n Even schools that do recieve federal funding in the form of Categorical aid grants have a lot of operational leeway and are largely uncontrolled. That's why they are private. \n\n \n Largely uncontrolled?! Talk about weasel words. If you're so sure that there are schools that are completely out from under Uncle Sam's thumb, say so, don't use weasel words like \"largely uncontrolled.\"\n \n\n The freedom increases with Block Grants. That is why private schools like them.\n\n Oh, it increases? So, now you're admitting that private schools DO have governmental controls? This is like shooting fish in a barrel. \n \n\n However, many Private Secondary and Colleges are accredited by the\n Council for Higher Education Accreditation, which is an independant organization, not run by the Department of Education.\n\n Fine, show me where they get their funding and I'll show you where the governmental strings are.\n \n\n THere's that Flint Michigan Education of yours again at work. I said I would support a secular one more than I would support a religious private school, regardless if it were funded by the government or not.\n\n Flint? I was raised in NJ. Nice try, though, as silly as it may have been at least you took a swing. Strike Three ;)\n \n\n Yes, I have heard of the Department of Education. Have you heard of totally Private School run by the Board of Education of a Local Region or State? No. There are private, non religious schools, and I trust SECULAR education, not religious education. There is no secular = government. A doesn't follow from B, especially since I wasn't talking about ones controlled by government.\n\n You fail to realize that if a school gets money from Uncle Sam, it comes with strings, ALWAYS.\n \n\n  Keep beating that STrawman there.\n\n No need to beat a strawman when I have you making naive statements. ;)\n \n\n No really? I didn't know that *shock* This might actually be relevant if you read my post talking about supporting a private secular over a private religious, and there are many private secular instituations not controlled by the government. They are largely free and accredited by the organization shown above.\n\n Again with the weasel words. \"largely free\", eh? Why not totaly free? Where're your balls? \n \n\n Even the ones accredited by the DoE don't control the curriculum, they rather set an  agreed to minimum that is coordinated with other accredation agencies. \n\n Oh, so setting a FEDERAL or STATE MINIMUM ALLOWABLE CRITERIA isn't demonstrating control of the curriculum now? How obtuse of you. \n \n\n Blah blah blah, same repetitive strawman of my post, mixed with a complete inability to recognize his own Bifurcation of the issue. THere are private schools that aren't controlled by the government and non-religious. There exist more than 2 types of schools. Gub'ment! and \"Religious private\"\n\n Show me a high school with zero governmentl control and I'll retract my post.\n \n\n You are just pulling **** out of your anal cavity. \n\n No, I'm trying to educate you by pulling YOUR head out of my anal cavity. \n \n\n I\n You check wrong. Secular isn't = to government. It's Non-sequitor as a conclusion. They can be both totally private and recieve some federal aid. Saying Secular = Government is a universal quanitifer that can be disproven by finding 1 that isn't controlled by the big bad gub'ment. \n\n Name the school. I already told you that there were 2 colleges. Find ONE high school. That shouldn't be too hard.\n \n\n Too bad I am not talking about College. THere are Private schools for secondary education that aren't religious. Many are, but not all.\n\n Name one that accepts ZERO governmentl money and has zero strings.\n \n\n Interesting, since i just got several brochures for more religious colleges. They must recieve funding from the government. In that case, since they are colleges, and only 2 colleges don't get any funding, the government must fund religious colleges, therefore it must direct them, even though they are private religious ones.\n\n BINGO! Now you're finaly seeing the light. Uncle Sam has a say in EVERY school that it provides funding for.\n \n\n This means that even non-secular schools are secular, therefore run by the government, according to your twisted logic. In your world, relgious secular, and secular = government!\n\n Right again. \n emoticon_rolleyes\n \n\n You are an idiot, so I will only pwn your idiot rhetoric again, and then I will accept your concession.\n \n This is from the Departement of Education as well as multiple sources from Pirvate Instituations on private insitutions. \n \n \n Private schools generally seek periodic review, or accreditation, by an independent agency to maintain their reputation and to qualify for certain forms of governmental assistance.\n \n Regardless of their organizational structure, private schools are largely free to manage their own affairs. They can choose their students, their faculty, and their curriculum, and make their own internal rules.\n \n According to nearly all souces, the vast majority of nonsectarian schools are just like the religious schools. THey choose their own government, their own curriculum, their own rules and regulations, but they are subject largely to \n \n 1. Health regulations\n 2. Disabilities\n 3. Anti-discrimination laws\n 4. Some (SOME) subjects at least must be taught, but it doesn't say how, what.\n \n \n Private Education in the United States, programs of instruction in the United States that are created, controlled, operated, and principally financed by private individuals and groups rather than by governments. About 11 percent of American elementary and secondary school (high school) students attend private schools, and 24 percent of all elementary and secondary schools in the United States are private. Private education is also offered at many American preschools as well as at many colleges, universities, and technical institutes.\n \n Many private schools do NOT have to follow national standards, since Monmouth University, a private university, does not accept a lot of community credit colleges, while state colleges and other community colleges are required to accept all 64 credits.\n \n They are not required to accept 64 credits, because they use a  different curriculum, as is described by their transfer coordinator. They teach a different curriculum not controlled. Their history classes do not match up, their english classes don't match up, and they teach a higher grade math, even if it's the same class. MTH 113 is one example.\n\n \n Monmouth participates in the Federal Work Study program, right? No need to answer that, I checked. It does. With the FWS comes governmental strings. Look them up. They're in your student handbook. Here, in case you're incapable of finding it. http://www.monmouth.edu/academics/lcac/placement/EmploymentHandbook2004.pdf\n \n\n  Unlike public schools-which are controlled by state and local governments-private schools in the United States are relatively free from governmental regulation. Consequently, private schools vary considerably in their philosophy, mission, and educational method. Nevertheless, private schools typically share certain characteristics that distinguish them from public schools. These include (1) a decentralized system of governance, (2) high academic expectations, (3) small enrollment and class size, and (4) shared values.\n \n\n Take a look at this.\n \n\n Title IX\n It is the policy of Monmouth University not to discriminate on the basis of sex in its educational programs, activities, or employment practices as required by Title IX of the 1972 Educational Amendments. Inquiries regarding compliance with Title IX may be directed to the director of Affirmative Action, Human Relations, and Compliance, (732) 571-7577.\n\n Oh, what's that? Another governmental regulation?\n \n\n your Concession is accepted, dotard.\n\n I was just going to offer you an olive branch to concede with, but I guess I'll just have to continue beating you with it instead. ;)\n \n\n You're an idiot who likes to think he's smart because he can talk down to people who usually cower in fear because they are intimdated by your pseduo-intellectual ability. Before you call someone a noob, take a class in basic socio-economics and logic fool, so you won't spout so many logical errors. You don't even know what socialism is fool, for if you did, you would notice that everything I mentioned is part of market capitalism in the United States--a nation that is economically ranked 6th freest in the entire world. Liberals don't = socialists, as you would learn in a basic 101 class. Socialist is completely on the opposite end of the two-dimensional Idealog test as well as the results from the Pew Research Centre's Typology of American Voters. I am not a socialist, but you are still an idiot.\n\n OK, I'll continue, since you asked. \n \n Did you bother to read the references that you posted above? Let me excerpt a few salient points for your dimwit. \n .\n......but they are subject largely to \n 1. Health regulations\n 2. Disabilities\n 3. Anti-discrimination laws\n 4. [b]Some (SOME) subjects at least must be taught, but it doesn't say how, what.\n\n \n What part of #4 tells you that there's no governmental control present?\n How about this:\n\n private schools in the United States are relatively free from governmental regulation.\n\n Relatively free isn't FREE. It's another weasel term.\n \n Ever hear of the HEA of 1992, Bush's DOE Strategic Plan 2002-2007? \n Anyone receiving a Federal Student loan, eating a school free lunch from the gov't, etc., is attending a school that is following Federal guidelines.\n .....have to stop here for now. I have a presentation to write......\n You can be assured that I'll continue this though. I haven't even gotten to your Socialism yet.", 
   {
    "unicode_changes_made": true
   }, 
   92769, 
   null, 
   1109298960.0
  ], 
  [
   93738, 
   null, 
   "Duo_Maxwell", 
   "allow me to be immature for one moment: \n \n the obvious answer is there aren't any objects of affection (aka attractive boys or girls)! I remember spending hours talking to girls when I should have been studying.", 
   {}, 
   93714, 
   null, 
   1109306160.0
  ], 
  [
   93739, 
   null, 
   "Socialist", 
   " \n Your argument is purely one of semantics. Show me one high school that receives ZERO governmental funds and has ZERO Federal or State requirements.\n\n \n And your argument is an either/or fallacy. It's wrong to say \"secular = governmet\" when the definition of secular has nothing to do with government and secular private schools aren't controlled by government by default. Admit you are wrong.\n \n \n \n Largely uncontrolled?! Talk about weasel words. If you're so sure that there are schools that are completely out from under Uncle Sam's thumb, say so, don't use weasel words like \"largely uncontrolled.\"\n\n \n Call it whatever you want. THat's what the independent accredation agencies say about private schools. Unless you think they are wrong.\n \n \n Oh, it increases? So, now you're admitting that private schools DO have governmental controls? This is like shooting fish in a barrel.\n\n \n I never said schools that recieve funding don't have some control. I am saying they don't = government. They don't. Even many religious schools obey anti-discrimination laws. Take holy family, for example. Unless you want to say HOly Family is a gub'ment school, which is laughable.\n \n \n Fine, show me where they get their funding and I'll show you where the governmental strings are.\n Quote:\n\n \n Both religious and secular (nonsectarian institutions) get funding from various places. According to the the independent accredation agency: \n \n 1. Regardless of their organizational structure, private schools are largely free to manage their own affairs. They can choose their students, their faculty, and their curriculum, and make their own internal rules.\n \n 2. Unlike public schools-which are controlled by state and local governments-private schools in the United States are relatively free from governmental regulation. Consequently, private schools vary considerably in their philosophy, mission, and educational method. Nevertheless, private schools typically share certain characteristics that distinguish them from public schools. These include (1) a decentralized system of governance, (2) high academic expectations, (3) small enrollment and class size, and (4) shared values.\n \n 3. Private schools generally seek periodic review, or accreditation, by an independent agency to maintain their reputation and to qualify for certain forms of governmental assistance.\n \n Despite government assistance, according to the schools, they are mostly free of government involvement, because they get the bulk of money from private individuals and tuition. Their curriculae are largely unaffected by the government because they use higher standards anyway and they are accredited by independent agencies. Upon getting independent accredation, they are responsible for managing their own curriculum.\n \n There is some government involvement in both nonsectarian and relgious schools in the form of anti-discrimination laws. Holy Family is one example, and that's relgious, unless you want to say it's secular gub'ment run.\n \n Private Businesses  can be regulated somewhat by the government if they serve the public: health, sanitation, etc.\n \n \n \n Flint? I was raised in NJ. Nice try, though, as silly as it may have been at least you took a swing. Strike Three\n\n \n Your argument is still a silly strawman and a feeble bifurcation. Secular = government not. Secular merely means non-religious. Not all secular instituations are government, but all government institutions are secular. There is a difference.\n \n Since 22% of private schools are not religious, rather sectarian, and many of them are independently accredited, they are, they are not  controlled  by the government\n \n They are free to make their own rules, regulations, curriculae. \n \n \n \n \n You fail to realize that if a school gets money from Uncle Sam, it comes with strings, ALWAYS.\n\n \n This is another fallacy. It's either or. You are totally throwing away the middle. SOmething is not necessarily controlled or not controlled. The government doesn't run private secular schools any more than it runs private religious schools or any private business practice that must fall in line with limited government regulations.\n \n There is no such thing as absolute freedom. There is always government influence when dealing with the public.\n \n This doesn't mean you are either\n \n A. 100% free\n B. Controlled.\n \n It's a simple bifurcation.\n \n \n No need to beat a strawman when I have you making naive statements.\n\n \n That's why you use strawmen and bifurcations, yet you think it's perfectly ok to do so in an argument. Newsflash: It's not. IT makes your argument wrong.\n \n Now I will agree with you if you say MOST schools are secular and MOST schools are run by the government, therefore it's safe to assume that the government has some influence in education.\n \n However, from your premises, you cannot get Secular = Government, since the two aren't equated.\n \n \n\n Show me a high school with zero governmentl control and I'll retract my post.\n\n \n You are the one that said all secular = government. I already proved you wrong. Secular doesn't mean government and I already copy/pasted information on private secular schools from both the independent accredation and the US gov. There is no huge government conspiracy.\n \n \n Oh, so setting a minimum ISN'T controlling the curriculum now? How obtuse of you. \n\n \n No, it's not, since they voluntarily go well above that minimum on their own. The government doesn't set their tests, their teachers, their teacher rules or their individual class material. They don't pick their books or anything. \n \n There is no government  control  Perhaps you used the wrong word.\n \n \n No, I'm trying to educate you by pulling YOUR head out of my anal cavity. \n\n \n HHAAHHAHAHAHAHHAHAHHA educating by repeatedly using logical fallacies to prove your point. *wink* good one. HAHAHHAHAHA cute too.\n \n \n Name the school. I already told you that there were 2 colleges.\n\n \n There is more than one religious college.\n \n \n \nName one that accepts ZERO governmentl money and has zero strings.\n\n \n You want someone to prove that something doesn't exist.\n \n \n Interesting, since i just got several brochures for more religious colleges. They must recieve funding from the government. In that case, since they are colleges, and only 2 colleges don't get any funding, the government must fund religious colleges, therefore it must direct them, even though they are private religious ones.\n \n BINGO! Now you're finaly seeing the light. Uncle Sam has a say in EVERY school that it provides funding for.\n Quote:\n\n \n BINGO! ALL the colleges that are private are largely left to their own devices. They are't controlled by anyone but themselves. Maybe you consider a minium standard \"control,\" but the accredation agencies don't. \n \n I think it's funny you think the government controls religious schools. Quite entertaining.\n \n \n This means that even non-secular schools are secular, therefore run by the government, according to your twisted logic. In your world, relgious secular, and secular = government!\n \n Right again. \n\n \n Too bad that statement you made is inherently illogical, since it violates the principle of noncontradiction. You cannot be secular and nonsecular at the same time. Relgious schools are't secular, so they cannot be secular.\n \n Wrong again, but nice rhetorical ploy. This  IS  a fallacious statement, I hope you realize.\n \n \n \n Monmouth participates in the Federal Work Study program, right? No need to answer that, I checked. It does. With the FWS comes governmental strings. Look them up. They're in your student handbook. Here, in case you're incapable of finding it.\n\n \n I don't go to monmouth, so why would I already have their manual. the FWS is a student community and work program.\n \n Monmouth seeks independent accredation. Monmouth is mostly free and private. It's not a government school, and it's not controlled. YOu don't understand the meaning of control.\n \n \n \n \n I was just going to offer you an olive branch to concede with, but I guess I'll just have to continue beating you with it instead.\n\n \n I have nothing to concede, but you do, since yours is the argument from illogical rhetoric. Secular doesn't = religious, and secular doesn't = government lol. You're silly boy.\n \n \n Relatively free isn't FREE. It's another weasel term.\n .....have to stop here for now. I have a presentation to write......\n You can be assured that I'll continue this though. I haven't even gotten to your Socialism yet.\n\n \n Actually, mostly and relatively free are free dotard. In your world of black and white, it's not, however, but black and white is a logical fallacy. You don't have to be 100% free to be free.\n \n Some regulations doesn't = domination or control.\n \n really, bifurcation isn't hard to understand.\n \n Of course all major bussinesses and instituations adhere to basic anti-discrimination laws, fair business practice procedures. If they didn't, people would go somwhere that did. They do it on their own because of competition. In order to be accredited by independent agencies, they also have to have a minimum standard of education, which they argree to with those agencies.\n \n Private schools cannot do  whatever  they want. They are bound by minimum standards, not by government, but by independent sources.\n \n And I am not socialist. That's another example of your lack of logical skills. YOu consistently engage in a all or nothing bifurcation totally skipping the middleground, favouring instead, one or the other.\n \n \n Now. I will be at another forum, where logical fallacies aren't tolerated. You are free to sign up if you want. They will explain the importance of how to debate logically, if you come. It's been fun. emoticon_rolleyes Keep tryin' to intimidate the highschoolers lol.\n \n For your own entertainment: Go to google scholar and type \"Colleges\" AND \"free of government control.\" You get a lot of hits for private insitutions.\n \n \n \n ONe major essay is: The Federal Role in HIgher Education by Robert Wolanin.\n \n Describes that most of the funds go to state colleges and non-private institutions. Funds that do go still allow for a huge degree of freedom.", 
   {
    "unicode_changes_made": true
   }, 
   93714, 
   null, 
   1109306280.0
  ], 
  [
   93743, 
   null, 
   "JPSartre12", 
   "Schools such as Rockhurst high school, which is staffed entirely by jesuit priests, are considered non secretarian because they are not specifically alinged with any church or sect, and they allow students from all faiths, or those lacking any at all.\n \n The qualification made by JP (that was not me), was rather obviously a broad statement expressing personal belief, a generalization, as opposed to a stated fact. Again, is your reading comprehension so low that you are unable to differentiate the two based on context?\n \n \n \n \n After you learn some reading comprehension, then maybe you can come back and try to push your rediculous logic. What JP was essentially saying is:\n \n In our current education system, secular schools are controlled by the government in almost all cases\".\n \n I believe we just proved mathematically that he is correct. You prefer to focus on te 99.9999% statement, which was rather obvioulsy meant to imply \"near total\" as opposed to being presented as a statistic.\n \n You are wasting our time here with a stupid and childish argument regarding the was he phrased his statement, as opposed to actually arguing the obvious intent of the statement.\n \n I, for one, posess neither the time, nor the patience, to debate such obscure points with somebody of obviously substandard intellectual ability. Perhaps wherever you are at this time in your life, arguing points that are obviously outside the intentions of the speaker, or focusing on a few words while completely disregarding both the context of the statement and the rather obvious spirit in whihc the statement was made, is a worthy pursuit. I hope you learn better before you get out into tthe real world, because unless you plan on a career in either politics or the media, the first time you engage in such a pointless and worthless debate on company time, you are likely to find yourself unceremoniously sacked.\n \n \n This is what I was referring to in regards to the high school kids around here. I have yet to see a single one of them engage in pointless, and obviously worthless, debates such as this. I certainly have't seen any of the older and wiser folks doing so. BUT, I have seen a couple of the college kids here who absolutly insist on making fools of themselves by engaging in confrontations regarding terminology as opposed to content. IS the drug problem at our colleges really that bad?\n \n Do you really imagine for even 1 minute that anybody is sitting at home saying to themselves \"Man, that socialist as really smart to have refuted the 99.99999% figure\". Of course not. People are going \"what kind of idiot is this person that they are unable to recognise the context in which the post was made\".\n \n As I said, I personally have neither the time, nor the patience for dealing with such things. I live in the real world. I have things to do. I do believe I will give you the dubious honor of being the first person on my \"ignore\" list.\n\n \n Thanks Daewoo. I've got to learn to stop feeding the trolls. :)", 
   {}, 
   93652, 
   null, 
   1109309760.0
  ], 
  [
   93747, 
   null, 
   "Socialist", 
   " Thanks Daewoo. I've got to learn to stop feeding the trolls.\n\n \n You are a XXXXX. If you even had 1 ounce of brain, you would know why your argument's illogical. You are a waste of my time. If you want a real debate on this issue, and not recieve my diplomatic coddling of you, go here and debate Mike Wong. He can school you in logic far better than I.\n \n +http://bbs.stardestroyer.net/viewtopic.php?t=35857\n \n It's a link to the logic and arguments section. You wlil find a pretty good selection of information regarding your shortcommings. I suggest you talk with Wong on this issue; he has more tact. Unless you don't wish to have debate anywhere but here, where there are no regulations on your lying and dishonest debating.\n \n THere are several people there waiting to discuss how SEcular doesn't = Private school, and they won't tolerate your bifurcating, like I do.", 
   {}, 
   93743, 
   null, 
   1109310660.0
  ], 
  [
   94055, 
   null, 
   "Mach", 
   "I recall hearing that homeschoolers don't have to legally report their grades, as a result, only those that do well on average will report their grades, skewing the results. Anyone else know anything about that?\n \n That's skew #1.\n \n Skew #2 is the comittment and education of the parents. If the parents are dedicated to helping their child succeed at home, or in a public school setting, my guess is the child does better, regardless of the environment.\n \n Skew #3\n Parents without little educational background, or in some cases, finances (below poverty level) I would think are far, far less likely to undertake the rigours of home schooling, it's much easier to use the public school system. Children of such parents are statistically less likely to do well in school, right off the bat.\n \n ... I'm sure there are plenty more.\n \n \n -Mach", 
   {}, 
   91645, 
   null, 
   1109565780.0
  ], 
  [
   94057, 
   null, 
   "zachvac", 
   "I recall hearing that homeschoolers don't have to legally report their grades, as a result, only those that do well on average will report their grades, skewing the results. Anyone else know anything about that?\n \n That's skew #1.\n \n Skew #2 is the comittment and education of the parents. If the parents are dedicated to helping their child succeed at home, or in a public school setting, my guess is the child does better, regardless of the environment.\n \n Skew #3\n Parents without little educational background, or in some cases, finances (below poverty level) I would think are far, far less likely to undertake the rigours of home schooling, it's much easier to use the public school system. Children of such parents are statistically less likely to do well in school, right off the bat.\n \n ... I'm sure there are plenty more.\n \n \n -Mach\n\n \n \n Besides #1, those aren't skews. They are the reasons home-schoolers do better. They get more attention, more dedication and better teachers. Or what if they don't have grades in a homeschool situation? I'm not an expert on it, but if a parent can tell the kid how they are doing, why would they need grades to report on the progress of the child.", 
   {}, 
   94055, 
   null, 
   1109568000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why do homeschoolers do better academically?", 
  "url": "http://www.4forums.com/political/education-debates/4314-why-do-homeschoolers-do-better-academically.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 4314, 
  "discussion_files": [
   [
    "8749.html", 
    "http://www.4forums.com/political/education-debates/4314-why-do-homeschoolers-do-better-academically-print.html"
   ], 
   [
    "8750.html", 
    "http://www.4forums.com/political/education-debates/4314-why-do-homeschoolers-do-better-academically-5-print.html"
   ], 
   [
    "8751.html", 
    "http://www.4forums.com/political/education-debates/4314-why-do-homeschoolers-do-better-academically-4-print.html"
   ], 
   [
    "8752.html", 
    "http://www.4forums.com/political/education-debates/4314-why-do-homeschoolers-do-better-academically-3-print.html"
   ], 
   [
    "8753.html", 
    "http://www.4forums.com/political/education-debates/4314-why-do-homeschoolers-do-better-academically-2-print.html"
   ]
  ], 
  "identifier": 4314
 }
]