[
 [
  [
   91765, 
   null, 
   "joebrummer", 
   "This is just insane.......\n \n Administration Balks At 'Gay' In Gay Suicide Conference\n by Doreen Brandt 365Gay.com Washington Bureau \n \n Posted: February 16, 2005 11:02 am. ET \n Washington) The Bush administration has told a federally funded conference on LGBT suicide to remove the words \"gay,\" \"lesbian,\" \"bisexual\" and \"transgender\" from its material.\n \n The conference will be held Feb. 28 in Portland, Ore., and was organized by the Suicide Prevention Resource Center of Newton, Mass with funding from the Substance Abuse and Mental Health Services Administration (SAMHSA) part of the Department of Health and Human Services.\n \n It was originally titled \"Suicide Prevention Among Gay/Lesbian/Bisexual/Transgender Individuals.\"\n \n But the SAMHSA balked at the name according to the Washington Post. The request to change the name came from SAMHSA project manager Brenda Bruun who suggested the organizers use \"sexual orientation\" the Post reports.\n \n One of the three specialist who will lead the meeting says that \"sexual orientation\" is inadequate.\n \n \"Everyone has a sexual orientation,\" Ron Bloodworth told the Post. \"But this was about gays, lesbians, bisexuals and transgenders.\" \n \n In addition, he said that trans people differ from others in terms of sexual identity, not sexual orientation. \n \n \"Unless you use an accurate term, the people you are trying to reach don't recognize themselves and don't attend,\" he told the paper, adding that the agency told him he should not use \"gender identity.\" \n \n Bloodworth is a former coordinator of youth suicide prevention for Oregon.\n \n Studies show that LGBT suicide rates are three times higher than the national norm, with suicides among teens the highest.\n \n But the name change was not the only thing the Administration called for. It also wanted a session on faith-based suicide prevention.\n \n \"We find this behavior on the part of our government intolerable,\" Bloodworth wrote in an e-mail to colleagues that called for the government to \"end this shameful marginalization of an already marginalized at-risk population.\"\n \n The pressure on conference organizers by the Administration was slammed by gay rights advocates.\n \n \"It is unconscionable for politics to get into the way of life and death health care gay LGBT young people,\" Human Rights Campaign spokesperson Steven Fisher told 365Gay.com..\n \n SAMHSA says it has been flooded with complaints since word leaked out that the name of the conference was being changed.\n \n \"It is incredible, the venom from these people,\" said spokesperson Mark Weber who added that the name change was \"only a suggestion\".\n \n But, when pressed by the Post about how strong a suggestion it was, Weber replied: \"Well, they do need to consider their funding source.\"\n \n ©365Gay.com 2005", 
   {
    "post_info": {
     "post_title": "Take the gay out of gay suicide, and we'll pay"
    }
   }, 
   null, 
   null, 
   1108595460.0
  ], 
  [
   91767, 
   null, 
   "JustineCredible", 
   "PEOPLE UNCLEAR ON THE CONCEPT! \n \n ...is what that should have been titled.\n \n ps. Joe, hope things go well on that new House bill in your state. emoticon_xangel", 
   {}, 
   91765, 
   null, 
   1108595760.0
  ], 
  [
   91776, 
   null, 
   "joebrummer", 
   "I also find it offensive that they suggest using faith based prevention. Our federal dollars should remain secular. When they say faith based, which faith are they calling upon. Jewish, christian, Muslim, wicca?", 
   {}, 
   91767, 
   null, 
   1108597740.0
  ], 
  [
   91781, 
   null, 
   "BobNelson2", 
   "I also find it offensive that they suggest using faith based prevention. Our federal dollars should remain secular. When they say faith based, which faith are they calling upon. Jewish, christian, Muslim, wicca?\n\n \n Obviously, this administration is talking about the faiths that try to turn gay people straight. Frankly, I think they should be included in the program... as a CAUSE of higher rates of depression and suicide.", 
   {}, 
   91776, 
   null, 
   1108599000.0
  ], 
  [
   91791, 
   null, 
   "JustineCredible", 
   "Obviously, this administration is talking about the faiths that try to turn gay people straight. Frankly, I think they should be included in the program... as a CAUSE of higher rates of depression and suicide.\n\n \n \n \n emoticon_xagree\n \n Sad enough to say, I have to agree here. \n \n Blind leading the blind.", 
   {}, 
   91781, 
   null, 
   1108602060.0
  ], 
  [
   91852, 
   null, 
   "jitobear", 
   "Who let these dumb asses into office??????!!!!!!!!! :xcensored", 
   {}, 
   91791, 
   null, 
   1108625820.0
  ], 
  [
   91975, 
   null, 
   "JustineCredible", 
   "Who let these dumb asses into office??????!!!!!!!!! :xcensored\n\n \n \n LOL \n \n Not me, that much I can atested to.", 
   {}, 
   91852, 
   null, 
   1108677240.0
  ], 
  [
   91979, 
   null, 
   "Tala Kismet", 
   "Agreed there. And the whole faith based thing......\n well, its a conspiracy. emoticon_wow \n \n emoticon_rolleyes what wonderful government officials we have these days. Why don't we all go out and have a politics party? It's been reduced to digging those skeletons out of closets and name calling now. No wonder better people don't run. They'll be fried by the XXXXXX in the media......", 
   {}, 
   91765, 
   null, 
   1108678260.0
  ], 
  [
   91987, 
   null, 
   "Socialist", 
   "Faith-based suicide prevention? What's that? Praying you don't hit the ground on the way down?", 
   {}, 
   91979, 
   null, 
   1108679160.0
  ], 
  [
   91990, 
   null, 
   "Tala Kismet", 
   "Perhaps I will hit the soft spot on the concrete as opposed to the asphalt on the road. Seriously though, faith-based suicide prevention? Lemme tell ya, from personal experience, you don't really care about what other people think about you not committing suicide when you've made the decision to do it. XXXXXX.", 
   {}, 
   91765, 
   null, 
   1108679760.0
  ], 
  [
   92007, 
   null, 
   "joebrummer", 
   "Actually, with faith based prevention GLBT people with suicidal thoughts will be recruited into conversion therapy so they can be happy for a few weeks with their new found god, wait a few weeks to see that they are still gay, then kill themself. Very productive stuff here. Just ground breaking therapy.", 
   {}, 
   91990, 
   null, 
   1108682700.0
  ], 
  [
   92008, 
   null, 
   "Tala Kismet", 
   "can you say, brainwashing? COME ON GOVERNMENT, DO YOUR JOB. Or do I need to beg you for forgiveness like I'm supposed to do of Jesus, or whoever?", 
   {}, 
   91765, 
   null, 
   1108682880.0
  ], 
  [
   92182, 
   null, 
   "JustineCredible", 
   "Faith-based suicide prevention? What's that? Praying you don't hit the ground on the way down?\n\n \n \n ROFL, that's just what I was thinking! emoticon_xgood", 
   {}, 
   91987, 
   null, 
   1108765860.0
  ], 
  [
   92308, 
   null, 
   "zachvac", 
   "Actually, with faith based prevention GLBT people with suicidal thoughts will be recruited into conversion therapy so they can be happy for a few weeks with their new found god, wait a few weeks to see that they are still gay, then kill themself. Very productive stuff here. Just ground breaking therapy.\n\n \n What does GLBT mean? I would assume the first 2 are gay lesbian, but what do the B and the T mean?", 
   {}, 
   92007, 
   null, 
   1108847040.0
  ], 
  [
   92314, 
   null, 
   "joebrummer", 
   "What does GLBT mean? I would assume the first 2 are gay lesbian, but what do the B and the T mean?\n\n \n \n Gay, Lesbian, Bisexual Trangendered.", 
   {}, 
   92308, 
   null, 
   1108851840.0
  ], 
  [
   93083, 
   null, 
   "JustineCredible", 
   "What does GLBT mean? I would assume the first 2 are gay lesbian, but what do the B and the T mean?\n \n \n \n \n \n \n \nGay, Lesbian, Bisexual Trangendered.\n\n \n Yes, the GLBT abreviation is meant to encompass the entire \"XXXXX\" community. Even though transgendereds and bi-sexuals aren't always or even exactly homosexual, they are \"XXXXX\" in that they are different from Heterosexuals and the heterosexual view of heterosexuality. (If that made any sence...sorry)", 
   {}, 
   92314, 
   null, 
   1109103420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Take the gay out of gay suicide, and we'll pay", 
  "url": "http://www.4forums.com/political/gay-rights-debates/4318-take-gay-out-gay-suicide-well-pay.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 4318, 
  "discussion_files": [
   [
    "21054.html", 
    "http://www.4forums.com/political/gay-rights-debates/4318-take-gay-out-gay-suicide-well-pay-print.html"
   ], 
   [
    "21055.html", 
    "http://www.4forums.com/political/gay-rights-debates/4318-take-gay-out-gay-suicide-well-pay-2-print.html"
   ]
  ], 
  "identifier": 4318
 }
]