[
 [
  [
   92487, 
   null, 
   "jim's trucking", 
   "Two Svenssions were driving north across the Laponia. When they got to Östersund they saw a sign that read \"CLEAN RESTROOMS AHEAD,\" so when they got to the filling station, they pulled in, got out of their car and started cleaning the restrooms! \n \n As they traveled further east, they found it difficult to make any progress because there were so many \"CLEAN RESTROOMS AHEAD\" signs along the way. \n \n When they finally arrived in Kiruna, they came across a sign that read \"WANTED!!! Two Norwegian males for pedophile rape!\" \n \n The two Svenssions looked at each other and thought, \"Damn! Those jaevla Norrmen get all the good jobs!\" \n \n *********************************************\n \n This and others at:\n \n http://www.factnet.org/discus/messages/4/3709.html?1098794661\n \n emoticon_xhoho\n \n Swedish Prime Görrån Petsion,, Bill Gates and Z.O.G.'s crimi-chief were invited to dinner with God. During dinner, He told them, \"I need three important people to send my message to all people. Tomorrow I will destroy the earth!\" Swedish Prime immediately called together his new cabinet and told them, \"I have two very bad news items for you- \n 1. God really exists, and \n 2. Tomorrow He will destroy the earth.\" Bill Gates called an emergency joint session of company's committées and told them, \"I have good news and bad news- 1. Good news-God really accepted the qualities of Microsoft and \n 2. Bad news -- Its memory capasity is larger and more destroyable than our last products.\" Z.O.G. (Zionist Occupying Gang -on the occupied Palestine-)'s chief went back to the occupied territories in Palestine and happily announced; -I have two fantastic announcements: \n 1. I am one of the three most important people on earth although I am a head-suspect of Palestinian Genocide and \n 2. We don't need to pay back the money what we should! \n \n **\n \n Tuffe: -Why do swedes always drink their milk in the store? \n Jukka Derdicukka: -Because on the packet it says: OPEN HERE. \n \n \n **\n \n In the beginning, God created earth and rested. \n Then God created a Laponian and rested. \n Then God created woman. \n Since then, neither God nor man has rested. \n \n ** \n Lena Thorson Förskingrarsion: -Why do Swedes die before their wives? \n Lena Hedenstierna Fraudmastersion: -They want to. \n \n ** \n \n Ecke: -Do you know the punishment for bigamy in Swecia? \n Nicke: -Two Mother-in-laws. \n \n ** \n \n A Svenne speaks frantically into the phone, \"My wife is pregnant and her contractions are only two minutes apart!\" \n \"Is this her first child?\" the doctor queries. \n \"No, you idiot!\" the man shouts. \"This is her husband!\" \n \n \n ** \n \n Bill Clinton was guest by Wallenberg Svenssion, who giving tip for that the Malmskillnad Street is the famous prostitution area of Stockholm... How Bill can stay?! Bill goes just to make up and taking a late evening jog when he spotted a very attractive young lady standing on a street corner. Seizing the opportunity he goes up to her and starts a conversation. It doesn't take long for him to find out that she is a prostitute. \n Well,\" says Bill, \"How much do you charge? \n \"One hundred and fifty dollars.\" she answers. \n \"One hundred and fifty dollars!\" Bill exclaims. \n \"Yes, one hundred and fifty dollars.\" she says. \n \"I can't believe you charge one hundred and fifty dollars.\" He says. \n \"Well, how much do you think it should cost?\" she asks. \n \"About twenty dollars.\" Bill flatly states. \n \"Twenty dollars!\" she cries, \"Sorry, it's one hundred and fifty dollars.\" \n Bill shakes his head and continues his jog. A few days later, he is out jogging late in the evening again, but this time Hillary has joined him. Bill sees that same prostitute standing on the street corner and decides to steer Hillary away from her, so they jog on the opposite side of the street. The prostitute happens to see them running and yells: -Hey, Kossa! See what you get for twenty dollars!! \n \n **\n \n ...and one for the Bush-haters to enjoy!\n \n \n An aircraft is about to crash. There are five passengers on board, but unfortunately only 4 parachutes. \n \n The first passenger says \"I'm Shaquille O'Neill, the best NBA basketball player. The Lakers need me, it would be unfair to them if I died\". So he takes the first parachute and jumps. \n \n The second passenger, Hillary Clinton, says \"I am the wife of the former President of the United States. I am also the most symbolical woman in the world, a Senator who accepted all the non-moral deal of husband, living mirror of legalized whore system ZOG.\" \n \n She takes one of the parachutes and jumps. \n \n The third passenger, George W. Bush, says \" I am the living male example of same system. I have a huge responsibility in world politics. And apart from that, I am the most intelligent President in the history of the country and I have a responsibility to my people not to die\". \n \n So he jumps. \n \n The fourth passenger, the Pope, says to the fifth passenger, a ten year old schoolboy from Laponia: \"I am already old. I have already lived my life, as a good person and a priest. I will give you the last parachute\". \n \n The Laponian boy replies: \"No problem, there is also a parachute for you. America's most intelligent monkey BUSH has taken my schoolbag...\" \n \n ***", 
   {
    "post_info": {
     "post_title": "Some good clean jokes..."
    }
   }, 
   null, 
   null, 
   1108926180.0
  ], 
  [
   92709, 
   null, 
   "zachvac", 
   "haha, those are pretty funny. From the same site:\n \n There was this swedish teacher who was yelling at his class because they were so incredibly lazy, \"I wouldn't be surprised if 50% of you flunk this math class,\" he said. One of the kids put up his hand. \"But there aren't that many in this class,\" he said. \n \n Svenne had great tickets for the Taeby Gallop final. As he sits down, another Swede comes down and asks if anyone is sitting in the seat next to him. \"No,\" he says. \"The seat is empty.\" \"This is incredible!\" said the man. \"Who in their right mind would have a seat like this for the Taeby Gallop final, the biggest sporting event in the world, and not use it?\" He says, \"Well, actually, the seat belongs to me. My wife was supposed to come with me, but she passed away. This is the first Taeby Gallop Final we haven't been to together since we got married.\" \"Oh ... I'm sorry to hear that. That's terrible. But couldn't you find someone else - a friend or relative, or even a neighbour to take the seat?\" The man shakes his head... \"No. They're all at the funeral.\"", 
   {}, 
   92487, 
   null, 
   1109006580.0
  ], 
  [
   94622, 
   null, 
   "Come and go", 
   "These are probably corny jokes they dont top yours but i just feel like sharing lol\n Attacked by two muggers, a mand tried to defend himself. he fought ad fought and finally gave up. The muggers found .85 on him. \n \" You fought that hard for .85?\" asked the muggers. \n \"Gee, siad the man.\" I thought you were after the 500$ i have in my shoe\"\n \n ( what a dipwad ) :) \n \n \"Stop worrying so much,\" siad the doctor to the nervous patient. \n \"Throw yourself into your work.\"\n \"But, doc, i mix concrete for a living.\"\n \n ( what a nerd )\n \n \"would you like a nuckle sandwhich?\" \n \"No, thanks; but help yourself.\"\n \n ( OH WOW!! )\n \n DAD: Theres something wrong with my toothbrush\n SON: Thats funny it was perfectly fine when i used it yesturday\n \n (GROSS :)\n \n \"Joseph just broke a window.\"\n \"How did he do that?\"\n \" I threw a rock at him and he ducked.\"\n \n (SMART ONE jk)\n \n ok well i am dont for now i am looking forward in laughing my butt off when i here more from y'all", 
   {
    "post_info": {
     "post_title": "Corny"
    }
   }, 
   92709, 
   null, 
   1109720460.0
  ], 
  [
   95073, 
   null, 
   "Tastyfish", 
   "This guy goes into a bar with a really small piano playe..nevermind\n \n So this guy goes into a bar with a flamingo and a cat and...hmm, not that one either.\n \n So there is this bar, and a couple of roads are happily sitting drinking until a section of crazy paving comes along and says to one of the sections of road \n 'You're in my seat.' The road looks confused and the paving nuts him, knocking him out cold.\n Few minutes later the paving goes up to the next seat and says the same thing again 'Hey, you're in my seat.' Having seen what happened before the road decides to call it a night and head home.\n Bit later on a driveway enters the bar and sits next to the crazy paving, to which the paving replies 'hey, that seat's taken!' and punchs the driveway in the face.\n Little while later another section of road comes in, and asks the Crazy paving whether it can take the space stool - the paving smiles and stands for the rest of the night.\n As the rest of the patrons are leaving the barman finally plucks up the courage to ask the paving what is going on.\n \"Why didn't you put up a fight over the stools like you did for the other guys\"\n To which the paving replies \"I may be a Crazy paving, but that guys a Cycle Path\"\n \n baboom tsk...PUNTASTIC!", 
   {}, 
   94622, 
   null, 
   1109821440.0
  ], 
  [
   95103, 
   null, 
   "jitobear", 
   "Knock knock\n \n Who's there?\n \n The interupting cow.\n \n The interupting cow wh.....MOOOOOOO!\n \n \n \n (much funnier out loud)", 
   {}, 
   95073, 
   null, 
   1109833200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Some good clean jokes...", 
  "url": "http://www.4forums.com/political/fun-debates/4347-some-good-clean-jokes.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 4347, 
  "discussion_files": [
   [
    "3259.html", 
    "http://www.4forums.com/political/fun-debates/4347-some-good-clean-jokes-print.html"
   ]
  ], 
  "identifier": 4347
 }
]