[
 [
  [
   93028, 
   null, 
   "georged", 
   "The EU wants NATO downgraded in importance, arms sales to China opened, little or no support for our mess in Iraq, allow Iran to continue nuclear development, Kyoto Agreement subscription by the US, Russia will sell missiles to Syria, help Iran with reactor technology while Bush unapologetically defends the war in Iraq.\n \n Does anyone else feel our credibility has been forced down a toilet and flushed by our threats and actions?", 
   {
    "post_info": {
     "post_title": "Bush in Europe"
    }
   }, 
   null, 
   null, 
   1109095380.0
  ], 
  [
   93049, 
   null, 
   "jkca1", 
   "\n Does anyone else feel our credibility has been forced down a toilet and flushed by our threats and actions?\n\n \n I think the last time we were credible as a nation was under Ike and even he lied about the U2 flyovers so maybe it was Truman's admin.", 
   {
    "post_info": {
     "post_title": "What Credibility?"
    }
   }, 
   93028, 
   null, 
   1109100060.0
  ], 
  [
   93052, 
   null, 
   "georged", 
   "I think the last time we were credible as a nation was under Ike and even he lied about the U2 flyovers so maybe it was Truman's admin.\n\n \n I think you're correct, but I'll give Ike credit for his actual military background in making that mistake. We don't have that excuse for our current crusades, lies and slaps in the face to Europe and the rest of the world.", 
   {}, 
   93049, 
   null, 
   1109100360.0
  ], 
  [
   93105, 
   null, 
   "Dono", 
   "I, for one, was very pleased that the President went to Europe. I am somewhat disappointed to learn that he has plans to return.\n Dono", 
   {}, 
   93052, 
   null, 
   1109106600.0
  ], 
  [
   93115, 
   null, 
   "Another opinion", 
   "I, for one, was very pleased that the President went to Europe. I am somewhat disappointed to learn that he has plans to return.\n Dono\n\n Nice one emoticon_xgood - I agree completely.\n \n As to Europe, I certainly agreed with their criticism of the US in attacking Iraq, but I must also admit that I would not trust the EU or the UN to take sufficient action if there really WAS an international threat where military action was needed. Most situations can be resolved diplomatically, but not all. The US may rush into war too quickly, but being too stubornly pacifistic can let actual threats escalate (look at the example of Hitler).", 
   {}, 
   93105, 
   null, 
   1109112480.0
  ], 
  [
   93218, 
   null, 
   "georged", 
   "Nice one emoticon_xgood - I agree completely.\n \n As to Europe, I certainly agreed with their criticism of the US in attacking Iraq, but I must also admit that I would not trust the EU or the UN to take sufficient action if there really WAS an international threat where military action was needed. Most situations can be resolved diplomatically, but not all. The US may rush into war too quickly, but being too stubornly pacifistic can let actual threats escalate (look at the example of Hitler).\n\n \n Who else but the US has military capability for creating an international threat? Threats now seem to be the extent of our diplomacy. Dono is correct, too bad Bush has to return to the US.", 
   {}, 
   93115, 
   null, 
   1109131380.0
  ], 
  [
   93238, 
   null, 
   "daewoo", 
   "Who else but the US has military capability for creating an international threat? Threats now seem to be the extent of our diplomacy. Dono is correct, too bad Bush has to return to the US.\n\n \n In theory the russians. In reality I think that at this point the rest of the world trusts the russians more than they trust the US. The russians just want to be left alone to sell weapons and nuclear reactors to third tier nations. They don't seem to have any real interest in military interventionism anywhere.", 
   {}, 
   93218, 
   null, 
   1109135640.0
  ], 
  [
   93240, 
   null, 
   "georged", 
   "In theory the russians. In reality I think that at this point the rest of the world trusts the russians more than they trust the US. The russians just want to be left alone to sell weapons and nuclear reactors to third tier nations. They don't seem to have any real interest in military interventionism anywhere.\n\n \n Other than China telling the world Taiwan had best mind their manners, I think everyone but the US has decided trade, what one has and what it's worth, is the only reasonable goal for contemporary economic survival. Russia has oil. The US has consumer demand. Commodities have always produced more wealth than paper equity. You either have them or have the wealth to purchase them. As a debtor nation, US leadership has determined threats and military capability are our strong suit.", 
   {}, 
   93238, 
   null, 
   1109137020.0
  ], 
  [
   93251, 
   null, 
   "Another opinion", 
   "Who else but the US has military capability for creating an international threat? Threats now seem to be the extent of our diplomacy. Dono is correct, too bad Bush has to return to the US.\n\n Well, a few worst case scenarios come to mind:\n 1) What if North Korea decides that it is in their best interest to weaken the \"evil capitalist\" nations by secretly selling some nuclear supplies to anti-Western terrorist groups, who then explode suitcase sized nuclear weapons in major Western cities to terrorize us. Otherwise, what if they decide to reunite with South Korea by force and threaten nuclear retaliation against our cities (through terrorist methods) if we interfere.\n 2) If Iran does gain full nuclear weapon capability, then what is to stop it from forming alliances that harbor international terrorists or cause instability in the region.\n \n Yes, these are a few nightmare scenarios that probably won't happen, but the whole idea of nuclear proliferation is a scary one since the stakes are so high - it would be very dangerous to try to stop them if they do decide to take dangerous agressive actions. Frankly, I do not have a good idea how to solve the nuclear proliferation problem. Diplomacy may not always work but I would not want to jump the gun and go in militarily un-necessarily. I would hope that most countries that do want to gain nuclear weapons do so only with the desire to be left alone to control their own affairs, but that may not always be the case.", 
   {}, 
   93218, 
   null, 
   1109142600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush in Europe", 
  "url": "http://www.4forums.com/political/current-events-debates/4367-bush-europe.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 4367, 
  "discussion_files": [
   [
    "26721.html", 
    "http://www.4forums.com/political/current-events-debates/4367-bush-europe-print.html"
   ]
  ], 
  "identifier": 4367
 }
]