[
 [
  [
   93529, 
   null, 
   "lasty", 
   "The nuclear threat is not in Iraq, it's in the neighbourhood\n Instead of wasting lots of money, time and efforts to eliminate a hypothetic nuclear threat that is allegedly issuing from Iraq, GB better make efforts to eliminate the inner threat of mass annihilation weapons spread. The loss of 30kg of plutonium from Britain's research center Sellafield is a shocking news! You are seeking the Saddam's nuclear weapons while plutonium enough to make up to dozen nuclear bombs gets missing right from under the nose of MI5 and Scotland Yard!\n You might say the creation of a nuclear bomb is a hi-tech process impracticable to be run domiciliary. Let me say negative. To begin with, the progress ever advances. A number of years ago, one needed vast laboratories to perform some chemical experiments. Nowadays, a child can buy an assay kit at a store and run the same chemical reactions at his home. The same with a nuclear bomb. Second, it is not necessary to make a nuclear device. It is quite enough to make a \"dirty bomb\" that will also cause deathly after-effects impossible to prevent.\n Now bring back in mind the thousands of Moslems from Pakistan, Afghanistan, Saudi Arabia, Chechnya, Albania and Kosovo! Who can prevent the lost plutonium from coming to their hands? Who can prevent them from making a \"dirty bomb\" to retaliate upon Great Britain for its part in the war in Iraq?", 
   {
    "post_info": {
     "post_title": "The nuclear threat is not in Iraq, it\u0092s in the neighbourhood"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1109238840.0
  ], 
  [
   93533, 
   null, 
   "daewoo", 
   "The nuclear threat is not in Iraq, it's in the neighbourhood\n Instead of wasting lots of money, time and efforts to eliminate a hypothetic nuclear threat that is allegedly issuing from Iraq, GB better make efforts to eliminate the inner threat of mass annihilation weapons spread. The loss of 30kg of plutonium from Britain's research center Sellafield is a shocking news! You are seeking the Saddam's nuclear weapons while plutonium enough to make up to dozen nuclear bombs gets missing right from under the nose of MI5 and Scotland Yard!\n\n \n To be fair, aren't we just talking a book keeping error here?\n \n \nYou might say the creation of a nuclear bomb is a hi-tech process impracticable to be run domiciliary. Let me say negative. To begin with, the progress ever advances. A number of years ago, one needed vast laboratories to perform some chemical experiments. Nowadays, a child can buy an assay kit at a store and run the same chemical reactions at his home. The same with a nuclear bomb. Second, it is not necessary to make a nuclear device. It is quite enough to make a \"dirty bomb\" that will also cause deathly after-effects impossible to prevent.\n\n \n The problem is bonding the plutonium into a machinable surface. Sure, you could purchase an assay kit and do it at home, but to to the exceptionally high amounts of radiation involved, you would almost certinaly be killed long before you got your plutonium to a machinable form.\n \n Once you did get a machinable core, it does become a simple matter of machining it, since moder machine tools generally operate well within the tolerances required for a nuclear weapon.", 
   {
    "unicode_changes_made": true
   }, 
   93529, 
   null, 
   1109241120.0
  ], 
  [
   94956, 
   null, 
   "jim's trucking", 
   "To be fair, aren't we just talking a book keeping error here?....\nYes...and me thinks lasty and Mike557 are one in the same...registered, made a single post and disappeared.", 
   {}, 
   93533, 
   null, 
   1109806500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The nuclear threat is not in Iraq, it\u0092s in the neighbourhood", 
  "url": "http://www.4forums.com/political/current-events-debates/4384-nuclear-threat-not-iraq-s-neighbourhood.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 4384, 
  "discussion_files": [
   [
    "15722.html", 
    "http://www.4forums.com/political/current-events-debates/4384-nuclear-threat-not-iraq-s-neighbourhood-print.html"
   ]
  ], 
  "identifier": 4384
 }
]