[
 [
  [
   93659, 
   null, 
   "Socialist", 
   "Perhaps he should invest in a government. \"Secular = non-religious\". The fact that the government happens to be (ideally) non-religious does not mean that secularism is defined as the government.\n \n Break down his logic where secular=A, non-religious=B, and government=C. You will get \"A = B, and B is an attribute of C, therefore A=C\". Which is stupid since, by this logic, if \"mighty\" is a synonym for \"powerful\", and \"powerful\" is an attribute of a 2005 Corvette, then the word \"mighty\" means \"Corvette\".\n \n For any of you who has the slightest incling of a brain you can understand this and see why it shows the utter stupidity of daewoo and his posse.\n \n \n Logically, this  Since 99.999% of all secular schools receive funding from Uncle Sam, It's a safe assumption to say secular = governmental controlled.\n \n is a retarded statement, since it is purpously designed to attack my statement that I prefer secular private schools over religious ones.\n \n HIs idea is that Secular Private Schools = Government, and government is untrusthworthy, therefore, Secular private schools suffer from the same.\n \n  Dictionary \n \n your friend needs a better dictionary.\n \n merriam webster wrote:\n Main Entry: 1sec·u·lar\n Pronunciation: 'se-ky&-l&r\n Function: adjective\n Etymology: Middle English, from Old French seculer, from Late Latin saecularis, from saeculum the present world, from Latin, generation, age, century, world; akin to Welsh hoedl lifetime\n 1 a : of or relating to the worldly or temporal <secular concerns< b : not overtly or specifically religious <secular music< c : not ecclesiastical or clerical <secular courts< <secular landowners<\n 2 : not bound by monastic vows or rules; specifically : of, relating to, or forming clergy not belonging to a religious order or congregation <a secular priest<\n 3 a : occurring once in an age or a century b : existing or continuing through ages or centuries c : of or relating to a long term of indefinite duration\n \n \n nothing about secular institutions automatically being government institutions.\n \n Again, Your Concession is accepted when you learn to read and make a logical argument.\n \n Nope: It's not logical to assume secular = government, when dealing with private schools. Daewoo is a fool if he thinks so.\n \n \n According to his logic, since the government controlled media and organizations are secular, and that secular = government, secular music is synonomous with government music.", 
   {
    "post_info": {
     "post_title": "Math equation shows Daewoo Illogic."
    }
   }, 
   null, 
   null, 
   1109285700.0
  ], 
  [
   94058, 
   null, 
   "zachvac", 
   "I think we all know he's wrong, he wasn't trying to state that. He was making a generalization which also happened to be false.", 
   {}, 
   93659, 
   null, 
   1109568120.0
  ], 
  [
   94119, 
   null, 
   "daewoo", 
   "I didn't even make that statement. JPSartre did.\n \n My argument was that it was being misinterpeted, and rather OBVIOSLY so. \n \n Rather then establishing a cohesive argument, socialist has chosen to deliberatly misinterpet Jps comment and debate frivolous questions regarding his chosen terminology. It is childish and a rather pathetic manner of waging a debate.\n \n Personally, I am done feeding the troll. I have better things to do that argue with those who are unable to form a cohesive point.", 
   {}, 
   94058, 
   null, 
   1109609760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Math equation shows Daewoo Illogic.", 
  "url": "http://www.4forums.com/political/education-debates/4387-math-equation-shows-daewoo-illogic.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 4387, 
  "discussion_files": [
   [
    "20713.html", 
    "http://www.4forums.com/political/education-debates/4387-math-equation-shows-daewoo-illogic-print.html"
   ]
  ], 
  "identifier": 4387
 }
]