[
 [
  [
   95739, 
   null, 
   "sculder", 
   "Currently I am doing a survey for public opinons regarding this topic for my research paper. Could you guys please give me your 2 cents on this issue? I'd really appreciate it if you guys could state whether or not you own a gun or if you're somehow an expert in this field as i would love to do a follow-up e-mail interview. Thanks.", 
   {
    "post_info": {
     "post_title": "Does gun possession justify itself?"
    }
   }, 
   null, 
   null, 
   1110123480.0
  ], 
  [
   95781, 
   null, 
   "RooK", 
   "You would probably get much more out of it if you posted a question here, let people reply, then carry on in a similar way asking questions (even related to replies) and getting reponses.", 
   {}, 
   95739, 
   null, 
   1110138240.0
  ], 
  [
   95853, 
   null, 
   "Bryan", 
   "I don't consider myself an expert on firearms, but I do own them. Likewise, I do not consider myself an expert on crime/gun stats, but I have a lot of first hand knowledge of gun crime. I'll try to answer your questions, and I don't mind if you e-mail me. THe address is haskman@earthlink.net. Please use a subject line, however, like \"4forums gun survey\" or something like that. I get a lot of spam that I delete if I can't tell what it is right away. It also may take a day or to to respond.", 
   {}, 
   95781, 
   null, 
   1110171840.0
  ], 
  [
   95873, 
   null, 
   "sculder", 
   "You would probably get much more out of it if you posted a question here, let people reply, then carry on in a similar way asking questions (even related to replies) and getting reponses.\n\n Everyone is welcome to give their opinion on public gun possession here-whether you're for or against gun control (or does gun possession justifies itself) and please state the reasons as well. I would really appreciate it if you guys could include some extra informations regarding this issue.", 
   {}, 
   95781, 
   null, 
   1110195060.0
  ], 
  [
   95936, 
   null, 
   "jkca1", 
   "Everyone is welcome to give their opinion on public gun possession here-whether you're for or against gun control (or does gun possession justifies itself) and please state the reasons as well. I would really appreciate it if you guys could include some extra informations regarding this issue.\n\n But just try and remove them from those that think we do and you will have a war on your hands. It's too bad we didn't become more like Canada is respect to gun ownership. A lot more people would be alive today and others not sitting in prison for crimes they commited.", 
   {
    "post_info": {
     "post_title": "Guns, we don't need no stinking guns"
    }
   }, 
   95873, 
   null, 
   1110221700.0
  ], 
  [
   96033, 
   null, 
   "Shooterman", 
   "Everyone is welcome to give their opinion on public gun possession here-whether you're for or against gun control (or does gun possession justifies itself) and please state the reasons as well. I would really appreciate it if you guys could include some extra informations regarding this issue.\n\n \n Mr Sculder, I would point out to you, gun or firearm possession, constitutionally does not have to be justified.", 
   {}, 
   95873, 
   null, 
   1110243660.0
  ], 
  [
   96034, 
   null, 
   "Shooterman", 
   "But just try and remove them from those that think we do and you will have a war on your hands. It's too bad we didn't become more like Canada is respect to gun ownership. A lot more people would be alive today and others not sitting in prison for crimes they commited.\n\n \n Just how do you arrive at that conclusion?", 
   {}, 
   95936, 
   null, 
   1110243720.0
  ], 
  [
   96071, 
   null, 
   "pickleweaseler", 
   "A lot more people would be alive today and others not sitting in prison for crimes they commited.\n\n \n Aww... The poor widdle babies. The evil gun just jumped into their hands and turned them into mindless killing machines.", 
   {}, 
   95936, 
   null, 
   1110260340.0
  ], 
  [
   96107, 
   null, 
   "georged", 
   "But just try and remove them from those that think we do and you will have a war on your hands. It's too bad we didn't become more like Canada is respect to gun ownership. A lot more people would be alive today and others not sitting in prison for crimes they commited.\n\n \n And the loss to society because people used guns instead of an alternate weapon is?", 
   {}, 
   95936, 
   null, 
   1110298860.0
  ], 
  [
   120121, 
   null, 
   "inmyopinion", 
   "But just try and remove them from those that think we do and you will have a war on your hands. It's too bad we didn't become more like Canada is respect to gun ownership. A lot more people would be alive today and others not sitting in prison for crimes they commited.\n\n \n Excuse me. I live on the Candian border (takes 45 min. to cross w/good traffic). I know many Canadians who did not register their guns and don't intend too. AND:Their crime rates , like those of Australia and England, has skyrocketed.\n ------------------\n Also, I sincerely doubt their legal system is much different than ours. Illegal possession of a gun in my state is SUPPOSED to be a flat 7 year term. It is generally the first think in a plea bargain. Horrendous. If the person gets off on the plea, then they can't go after the gun charge (it was bargained away) I would rather see a felon (yes, illegal guns = felony) in jail than out, no matter what the other charges are.\n ------------------", 
   {}, 
   95936, 
   null, 
   1115747700.0
  ], 
  [
   120183, 
   null, 
   "lord tammerlain", 
   "I live in Canada, and crime rates have not skyrocketed where I live since gun control. \n \n As for any increase in crime in other areas, to correlate gun registration to rising crime at least in Canada is very faulty. Canada does not have a strong tradition of homeowners wanting guns for homeprotection reasons. Most criminals in Canada when doing a B&E or stealing cars even 10+ years ago were/are not concerned about the person they are robbing is going to have a gun ready to protect themselves.", 
   {}, 
   120121, 
   null, 
   1115757240.0
  ], 
  [
   121463, 
   null, 
   "inmyopinion", 
   "I live in Canada, and crime rates have not skyrocketed where I live since gun control. \n \n As for any increase in crime in other areas, to correlate gun registration to rising crime at least in Canada is very faulty. Canada does not have a strong tradition of homeowners wanting guns for homeprotection reasons? Most criminals in Canada when doing a B&E or stealing cars even 10+ years ago were/are not concerned about the person they are robbing is going to have a gun ready to protect themselves.\n\n \n Did I miss something here? \n \n Canadians never had a desire to have guns for self protection? I know many who did and currently still do. [It would be a sorry robber who met one of these men.] Hence, due to the lack of desire for self protection, your criminals never need to worry about crossing a homowner with a gun? Does this hold true for the entire country? I doubt it.\n \n What do Canadians protect themselves with? Or do those you know just accept being robbed or broken into as \"the natural order of things\"? You must have excellent insurance for these things.\n \n [BTW, you laws are so tight, my husband and his target pistol team stopped taking their .22 target pistols (low end value $750) across the border to have matches w/Canadians. And, the Canadians are afraid they won't be able to get theirs back over the boirder...hence, they have \"postal matches\" : shoot at home, mail the scores to the other team. The opinions of these men, whom I have known for YEARS, are highly different than yours. ]\n \n Just for my curiosity, do you own a gun? Or have you ever even held/shot one?", 
   {}, 
   120183, 
   null, 
   1115919720.0
  ], 
  [
   121477, 
   null, 
   "inmyopinion", 
   "To lord tammerlain: \n I am also seriously worried about the movement of several US Customs Plaza to the Canadian side of the bridges. I have a niece who is a US Customs officer . She will not be allowed her US legal right: her gun, as she will cross onto Canadian soil. [I think her \"protection\" will be a billy club.] She is not happy over it and is thinking about asking for a transfer to where she will not be on Canadian soil.", 
   {}, 
   121463, 
   null, 
   1115920260.0
  ], 
  [
   121596, 
   null, 
   "lord tammerlain", 
   "Did I miss something here? \n \n Canadians never had a desire to have guns for self protection? I know many who did and currently still do. [It would be a sorry robber who met one of these men.] Hence, due to the lack of desire for self protection, your criminals never need to worry about crossing a homowner with a gun? Does this hold true for the entire country? I doubt it.\n \n What do Canadians protect themselves with? Or do those you know just accept being robbed or broken into as \"the natural order of things\"? You must have excellent insurance for these things.\n \n [BTW, you laws are so tight, my husband and his target pistol team stopped taking their .22 target pistols (low end value $750) across the border to have matches w/Canadians. And, the Canadians are afraid they won't be able to get theirs back over the boirder...hence, they have \"postal matches\" : shoot at home, mail the scores to the other team. The opinions of these men, whom I have known for YEARS, are highly different than yours. ]\n \n Just for my curiosity, do you own a gun? Or have you ever even held/shot one?\n\n \n \n There are some Canadians who have guns for home protection but it is not a common occurance. Canada in general has less crime then the US and most Canadians do not live in fear that someone is going to break into our house in the middle of the night ( B&E's in Calgary usually occur during the day when people are not home). Generally only farmers, and for the city the criminals are the only people who usually have guns for self defence.\n \n Regarding the need for self protection, due to Canada's lower crime rate, and in general more relaxed attitude most are not that scared of being murder, mugged, robbed, etc. I live in a city of just under 1 million, and will walk through the most \"dangerous\" areas at any time of day or night, unarmed.\n \n \n I do not own a gun but yes I have fired them. Were handguns a little easier to access I would buy a few? I have no problems with guns at all, I think they are fun penis enlarging toys. But for MOST people the idea of having a gun for self protection in the states or Canada is a fallacy. MOST people are not going to have the training, the state of mind to properly use a gun in that situation.", 
   {}, 
   121463, 
   null, 
   1115925900.0
  ], 
  [
   122387, 
   null, 
   "inmyopinion", 
   "There are some Canadians who have guns for home protection but it is not a common occurance. Canada in general has less crime then the US and most Canadians do not live in fear that someone is going to break into our house in the middle of the night ( B&E's in Calgary usually occur during the day when people are not home). Generally only farmers, and for the city the criminals are the only people who usually have guns for self defence.\n \n Regarding the need for self protection, due to Canada's lower crime rate, and in general more relaxed attitude most are not that scared of being murder, mugged, robbed, etc. I live in a city of just under 1 million, and will walk through the most \"dangerous\" areas at any time of day or night, unarmed.\n \n \n I do not own a gun but yes I have fired them. Were handguns a little easier to access I would buy a few? I have no problems with guns at all, I think they are fun penis enlarging toys. But for MOST people the idea of having a gun for self protection in the states or Canada is a fallacy. MOST people are not going to have the training, the state of mind to properly use a gun in that situation.\n\n \n I think I get it:\n Farmers have guns for self defense. Well, I do live in the country (sadly encroached on by developers on the other side of town as of late) and my back lot neighbor is a farmer. Maybe that is part of my mentality...I still see the need to dispatch rabid animals, from a distance! (we are over a mile from the next house)\n \n However, I disagree w/your other reasoning:\n -I sure as anything would not want to be walking around some of our cities at night at all, armed or not. I am not that foolish or ignorant.\n - For your statemnt (incredibly crude) that you find the handgun a \n \"fun p---s e-------g toy\", you fail to realize there are many woman target shooters and rifle shooters who think that definition ludicrous. I am one of them.\n -Training in this state, even for hunting, is required and needs certification on ability to handle a gun correctly. Pistols are very stringently regulated for permits, moreso for carry permits.\n -When anyone takes a gun in hand, it should be with training. It also has to be with the understanding that, God forbid, you need to use it, you will use it.\n If you can't handle that last one, you truly NEVER should touch a gun.", 
   {}, 
   121596, 
   null, 
   1116026160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Does gun possession justifies itself?", 
  "url": "http://www.4forums.com/political/gun-control-debates/4452-does-gun-possession-justifies-itself.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 4452, 
  "discussion_files": [
   [
    "2686.html", 
    "http://www.4forums.com/political/gun-control-debates/4452-does-gun-possession-justifies-itself-print.html"
   ]
  ], 
  "identifier": 4452
 }
]