[
 [
  [
   96294, 
   null, 
   "zachvac", 
   "Dihydrogen monoxide, or dhmo is very dangerous to our health. See facts at http://www.dhmo.org/facts.html.\n \n Some selected facts:\n \n DHMO is a constituent of many known toxic substances, diseases and disease-causing agents, environmental hazards and can even be lethal to humans in quantities as small as a thimbleful.\n \n A similar study conducted by U.S. researchers Patrick K. McCluskey and Matthew Kulick also found that nearly 90 percent of the citizens participating in their study were willing to sign a petition to support an outright ban on the use of Dihydrogen Monoxide in the United States.\n \n Each year, Dihydrogen Monoxide is a known causative component in many thousands of deaths and is a major contributor to millions upon millions of dollars in damage to property and the environment. Some of the known perils of Dihydrogen Monoxide are:\n <http://www.dhmo.org/images/poisonbottle.gif<\n \n * Death due to accidental inhalation of DHMO, even in small quantities.\n * Prolonged exposure to solid DHMO causes severe tissue damage.\n * Excessive ingestion produces a number of unpleasant though not typically life-threatening side-effects.\n * DHMO is a major component of acid rain.\n * Gaseous DHMO can cause severe burns.\n * Contributes to soil erosion.\n * Leads to corrosion and oxidation of many metals.\n * Contamination of electrical systems often causes short-circuits.\n * Exposure decreases effectiveness of automobile brakes.\n * Found in biopsies of pre-cancerous tumors and lesions.\n * Often associated with killer cyclones in the U.S. Midwest and elsewhere.\n * Thermal variations in DHMO are a suspected contributor to the El Nino weather effect.\n \n \n Some common uses\n \n * as an industrial solvent and coolant,\n * in nuclear power plants,\n * by the U.S. Navy in the propulsion systems of some older vessels,\n * by elite athletes to improve performance,\n * in the production of Styrofoam,\n * in biological and chemical weapons manufacture,\n * as a spray-on fire suppressant and retardant,\n * in abortion clinics,\n * as a major ingredient in many home-brewed bombs,\n * as a byproduct of hydrocarbon combustion in furnaces and air conditioning compressor operation,\n * in cult rituals,\n * by the Church of Scientology on their members and their members' families (although surprisingly, many members recently have contacted DHMO.org to vehemently deny such use),\n * by both the KKK and the NAACP during rallies and marches,\n * by pedophiles and pornographers (for uses we'd rather not say here),\n * by the clientele at a number of homosexual bath houses in New York City and San Francisco,\n * historically, in Hitler's death camps in Nazi Germany, and in prisons in Turkey, Serbia, Croatia, Libya, Iraq and Iran,\n * in World War II prison camps in Japan, and in prisons in China, for various forms of torture,\n * by the Serbian military as authorized by Slobodan Milosevic in their ethnic cleansing campaign,\n * by many terrorist organizations,\n * by software engineers, including those producing DICOM software SDKs,\n * in animal research laboratories, and\n * in pesticide production and distribution.\n \n * as an additive to food products, including jarred baby food and baby formula, and even in many soups, carbonated beverages and supposedly \"all-natural\" fruit juices\n * in cough medicines and other liquid pharmaceuticals,\n * in spray-on oven cleaners,\n * in shampoos, shaving creams, deodorants and numerous other bathroom products,\n * in bathtub bubble products marketed to children,\n * as a preservative in grocery store fresh produce sections,\n * in the production of beer by all the major beer distributors,\n * in the coffee available at major coffee houses in the US and abroad,\n * in Formula One race cars, although its use is regulated by the Formula One Racing Commission, and\n * as a target of ongoing NASA planetary and stellar research.\n \n One of the most surprising facts recently revealed about Dihydrogen Monoxide contamination is in its use as a food and produce \"decontaminant.\" Studies have shown that even after careful washing, food and produce that has been contaminated by DHMO remains tainted by DHMO. \n \n A recent stunning revelation is that in every single instance of violence in our country's schools, including infamous shootings in high schools in Denver and Arkansas, Dihydrogen Monoxide was involved. In fact, DHMO is often very available to students of all ages within the assumed safe confines of school buildings. None of the school administrators with which we spoke could say for certain how much of the substance is in use within their very hallways.\n \n Is it true that using DHMO improves athletic performance?\n Absolutely! With the numerous allegations of amateur and professional athletes using anabolic steroids and/or blood doping to enhance performance, virtually no attention has been paid to the performance enhancing properties of Dihydrogen Monoxide. It is perhaps the sporting world's dirtiest of dirty little secrets that athletes regularly ingest large quantities of DHMO in an effort to gain a competitive edge over an opponent.\n One technique commonly used by endurance athletes in sports such as distance running and cycling is to take a large amount of DHMO immediately prior to a race. This is known within racing circles to dramatically improve performance.\n \n Sports-medicine physicians warn that ingesting too much Dihydrogen Monoxide can lead to complications and unwanted side-effects, but do acknowledge the link to improved performance. DHMO is not currently considered a banned substance, so post-race urine tests do not detect elevated or abnormal levels of DHMO.\n \n Watch for these symptoms:\n \n * Excessive sweating\n * Excessive urination\n * Bloated feeling\n * Nausea\n * Vomiting\n * Electrolyte imbalance\n * Hyponatremia (serum hypotonicity)\n * Dangerously imbalanced levels of ECF and ICF in the blood\n * Degeneration of sodium homeostasis", 
   {
    "post_info": {
     "post_title": "The Threat of dihydrogen monoxide"
    }
   }, 
   null, 
   null, 
   1110341580.0
  ], 
  [
   96295, 
   null, 
   "zachvac", 
   "And if anyone already knows about it please don't comment. This is for the information of people who have never heard about it before. A recent study also concluded that every single person serveyed had consumed DHMO sometime in their lifetime. It's likely you have consumed some.", 
   {}, 
   96294, 
   null, 
   1110341640.0
  ], 
  [
   96339, 
   null, 
   "greg 79 f150", 
   "Back in 1976, my buddy that lived way out in the country, made a VW in to a mud buggy. One day while muddin' I was standing up in the back of it holding on to the rollbar . My buddy was driving and going about 35 mph though this pasture that had angus cattle in it....\n \n All of a sudden I felt a \"wet\" something hit me in the face and it was forced in to my mouth. My buddies up front , hearing me gagging, shut the buggy down, turned around , looked at me and started dying laughing . The passenger buddy laughed so hard that he peed his pants. The \"thing\" that hit my face and was still dripping down it , was fresh cow manure. Would cow manure have this dihydrogen stuff in it ?? :)", 
   {}, 
   96295, 
   null, 
   1110375240.0
  ], 
  [
   96356, 
   null, 
   "jim's trucking", 
   "It's everywhere. It's colorless, odorless and relatively tasteless. You can't help but get some on you every now and then.", 
   {}, 
   96339, 
   null, 
   1110384540.0
  ], 
  [
   96668, 
   null, 
   "zachvac", 
   "It's everywhere. It's colorless, odorless and relatively tasteless. You can't help but get some on you every now and then.\n\n \n In fact, DHMO is the main ingredient in your body.", 
   {}, 
   96356, 
   null, 
   1110434100.0
  ], 
  [
   96669, 
   null, 
   "zachvac", 
   "Also, there was a state (I think if was California) where they successfully passed a ban of DHMO through one of the houses. It didn't reach the other before they realized what the stuff actually was. Kind of funny.", 
   {}, 
   96668, 
   null, 
   1110434220.0
  ], 
  [
   97846, 
   null, 
   "Duo_Maxwell", 
   "And just when you think the populace is getting smarter, things like this show you you're wrong.", 
   {}, 
   96669, 
   null, 
   1110844440.0
  ], 
  [
   98863, 
   null, 
   "zachvac", 
   "And just when you think the populace is getting smarter, things like this show you you're wrong.\n\n \n We actually started a petition around our school as a joke. We got over 300 signatures. It was kind of funny :)", 
   {}, 
   97846, 
   null, 
   1111029420.0
  ], 
  [
   98864, 
   null, 
   "zachvac", 
   "The petition was to ban DHMO, sorry I don't think that was clear.", 
   {}, 
   98863, 
   null, 
   1111029420.0
  ], 
  [
   99310, 
   null, 
   "Tastyfish", 
   "Sorry, but I think its an urban myth (not to mention who ever bothers to post here knows full well the dangers of DMHO - if they didn't this would be in the C&E forum or religion one)...don't think anyone's actually banned it. Seen quoted New Zealand (where the little book of urban myths say it originated), various states in america and brussels. Bizarrely, despite all the dangers the science knowlege required has prevented it from ever get beyond the most local sections of government.\n \n Don't they realise that simple plant processes can break down DMHO in to far more dangerously oxidative compounds?\n The body has a speficially designed pathway to deal with these toxic by-products - without them all animal life would cease to exist\n \n \n If DMHA scares you..you should really check out Brass Eye's warning of Cake, the killer drug just recently hitting the UK shores. It will be in the US anytime soon!", 
   {}, 
   98864, 
   null, 
   1111122720.0
  ], 
  [
   101540, 
   null, 
   "xeiah", 
   "We are all full of ****. One of the most toxic substance known to human kind. ;)", 
   {}, 
   99310, 
   null, 
   1111822860.0
  ], 
  [
   101738, 
   null, 
   "Leviathan", 
   "Omg, this post is hilarious. I know some med geeks that need to see that. I'll bet they will be stumped for a few mins.", 
   {}, 
   101540, 
   null, 
   1111883460.0
  ], 
  [
   111715, 
   null, 
   "zachvac", 
   "Sorry, but I think its an urban myth (not to mention who ever bothers to post here knows full well the dangers of DMHO - if they didn't this would be in the C&E forum or religion one)...don't think anyone's actually banned it. Seen quoted New Zealand (where the little book of urban myths say it originated), various states in america and brussels. Bizarrely, despite all the dangers the science knowlege required has prevented it from ever get beyond the most local sections of government.\n \n Don't they realise that simple plant processes can break down DMHO in to far more dangerously oxidative compounds?\n The body has a speficially designed pathway to deal with these toxic by-products - without them all animal life would cease to exist\n \n \n If DMHA scares you..you should really check out Brass Eye's warning of Cake, the killer drug just recently hitting the UK shores. It will be in the US anytime soon!\n\n \n I never said it was banned, just said we got over 300 signatures to ban it. Never actually got banned. Never even tried to ban it, just see how many signatures we could get.", 
   {}, 
   99310, 
   null, 
   1114392240.0
  ], 
  [
   112374, 
   null, 
   "The Barbarian", 
   "In fact, DHMO has been shown to cause cancer. But only if ingested in small amounts over a long period of time.", 
   {}, 
   111715, 
   null, 
   1114494300.0
  ], 
  [
   140936, 
   null, 
   "924x2150", 
   "Was drowning in the stuff mentioned as one of the health risks? I beleieve that if it gets into your lungs you will die of asphyxiation.", 
   {}, 
   112374, 
   null, 
   1119669120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Threat of dihydrogen monoxide", 
  "url": "http://www.4forums.com/political/science-math-debates/4471-threat-dihydrogen-monoxide.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 4471, 
  "discussion_files": [
   [
    "756.html", 
    "http://www.4forums.com/political/science-math-debates/4471-threat-dihydrogen-monoxide-print.html"
   ]
  ], 
  "identifier": 4471
 }
]