[
 [
  [
   97130, 
   null, 
   "akira_rayn216", 
   "Hey, I'm doing a report on the KKK. If anyone has any information/opinions on the Ku Klux Klan, please let me know.", 
   {
    "post_info": {
     "post_title": "Ku Klux Klan"
    }
   }, 
   null, 
   null, 
   1110577860.0
  ], 
  [
   97147, 
   null, 
   "Hunter", 
   "The Klan was a much needed force at one time in the South. They battled carpet-baggers and freed slaves who were breaking the law after they were freed.The first leader of the Klan was General Nathan Bedford Forrest. He was one of the greatest military stratagists of all time. He and his wife are buried in Memphis Tenn. beneath a large monument. Got to eat now, sorry.", 
   {}, 
   97130, 
   null, 
   1110582120.0
  ], 
  [
   97162, 
   null, 
   "sinjin", 
   "Hey, I'm doing a report on the KKK. If anyone has any information/opinions on the Ku Klux Klan, please let me know.\n\n \n Membership is falling.", 
   {}, 
   97130, 
   null, 
   1110585180.0
  ], 
  [
   97177, 
   null, 
   "sinjin", 
   "The Klan was a much needed force at one time in the South. \n\n \n Sure it was. So was segregation, lynching, etc. And now?", 
   {}, 
   97147, 
   null, 
   1110589740.0
  ], 
  [
   97223, 
   null, 
   "Hunter", 
   "Sure it was. So was segregation, lynching, etc. And now?\n\n \n Wheather you believe it or not, the Klan was a great and Godly movement in the South after the end of the war of Northern aggression. When it morphed into a hate group Gen. Forrest disbanded it and resigned as it's leader. You should read something about him, he was a great man. Lynching people without a trial has always been wrong. As to segregation, it is alive and well today, it is called white flight.As an interesting side note I will give you some statistics that may explain white flight.\n \n #1. 6 percent of the population comprises 44 percent of the prison population.\n #2. 13 percent of the population comprises 85 percent of all violent crime in America.\n #3. 13 percent of the population comprises 50 percent of all new Aids cases.\n #4. 70 percent of all births in the Black community are illegitimate.\n \n And I could go on and on, but to what end. I will never sacrifice the truth to be politically correct. BTW I am not part of the white flight movement. I live in the heart of my city and I have watched it continually get worse and worse because of the above mentioned statistics. Liberalism is the bane of all humanity. It destroys all that it touches. Make momma proud, vote conservative.", 
   {}, 
   97177, 
   null, 
   1110611760.0
  ], 
  [
   97227, 
   null, 
   "Nwarth", 
   "1- what the hell do any of those statistics have to do with \"liberalism,\" if you ask me they have more to do with abject poverty more than anything else.\n \n 1.1- as a good upstanding Christian one would think that you should take the bible close to your heart and help these poor people with good olde Christian Charity. One should be concerned, not spiteful at statistics like this.\n \n 1.2- A side conjecture, poor people are the ones who inordinately committee these crimes and they are mostly due to their condition and a sense of hopelessness. I wonder, how many white people commit more atrocious \"white collar\" crimes that effects many more people and devastates many more lives, such as Kenny Boy did.\n \n 2- \"the Klan was a great and Godly movement in the South after the end of the war of Northern aggression.\"\n \n Excuse me for defending the North but... the South was in the wrong. Slavery is wrong- period and they seceded because they didn't like the result of an election, well boo-hoo, order must be maintained someone for the nation to be stable. Just because you don't like the result of a Democratic practice doesn't mean you get to leave.", 
   {}, 
   97223, 
   null, 
   1110614280.0
  ], 
  [
   97229, 
   null, 
   "jitobear", 
   "Liberalism is the bane of all humanity. It destroys all that it touches.\n\n \n What a stupid thing to say. Greed, cruelty, extremism, lack of empathy, prejudice, hate - these are the things that destroy - not a political mind-set. All kinds of people are capable of great ill and great good. Pay attention to the details rather than the rhetoric. \n \n \n \nMake momma proud, vote conservative.\n\n \n \n That does not make this mamma nor this mamma's mamma proud. We both think you should vote for the person you feel is best. I swear some people would vote for Ted Bundy as long as he were endorsed by their church or party. Get a brain and try a little harder, please.", 
   {}, 
   97223, 
   null, 
   1110614460.0
  ], 
  [
   97253, 
   null, 
   "georged", 
   "The Klan was a much needed force at one time in the South. They battled carpet-baggers and freed slaves who were breaking the law after they were freed.The first leader of the Klan was General Nathan Bedford Forrest. He was one of the greatest military stratagists of all time. He and his wife are buried in Memphis Tenn. beneath a large monument. Got to eat now, sorry.\n\n \n Makes sense that the Klan would name an illiterate to lead them.", 
   {}, 
   97147, 
   null, 
   1110648960.0
  ], 
  [
   97255, 
   null, 
   "jim's trucking", 
   "I reserve the right to revise and extend my remarks.\n \n http://www.iupui.edu/~aao/kkk.html\n \n \n The KKK has been, is and is likely to continue to be a hate group, festering in the world of racism. It tainted the Confederate Flag to the point that it cannot be peacefully displayed today. It fostered hatred and racism to the point that white people who refused to joined (such as I) were looked down upon.\n \n All descendants of KKK members should be lynched! emoticon_xclown", 
   {}, 
   97253, 
   null, 
   1110650580.0
  ], 
  [
   97259, 
   null, 
   "Hunter", 
   "1- what the hell do any of those statistics have to do with \"liberalism,\" if you ask me they have more to do with abject poverty more than anything else.\n \n 1.1- as a good upstanding Christian one would think that you should take the bible close to your heart and help these poor people with good olde Christian Charity. One should be concerned, not spiteful at statistics like this.\n \n 1.2- A side conjecture, poor people are the ones who inordinately committee these crimes and they are mostly due to their condition and a sense of hopelessness. I wonder, how many white people commit more atrocious \"white collar\" crimes that effects many more people and devastates many more lives, such as Kenny Boy did.\n \n 2- \"the Klan was a great and Godly movement in the South after the end of the war of Northern aggression.\"\n \n Excuse me for defending the North but... the South was in the wrong. Slavery is wrong- period and they seceded because they didn't like the result of an election, well boo-hoo, order must be maintained someone for the nation to be stable. Just because you don't like the result of a Democratic practice doesn't mean you get to leave.\n\n \n Liberalism/permissive child rearing has a lot to do with crime stats. Spare the rod and spoil the child.\n \n 1.1 I do what I can for those less fortunate than myself. Since when do statistics have emotions, let alone a spiteful bent\n \n 1.2 It is my position that poverty does not cause crime. It is caused by a dark heart and a willingness to disregard the rights of others.\n \n 2 Slavery was an abomination to God and man. It was an evil practice then as it is now.", 
   {}, 
   97227, 
   null, 
   1110652560.0
  ], 
  [
   97260, 
   null, 
   "Hunter", 
   "I reserve the right to revise and extend my remarks.\n \n http://www.iupui.edu/~aao/kkk.html\n \n \n The KKK has been, is and is likely to continue to be a hate group, festering in the world of racism. It tainted the Confederate Battle Flag to the point that it cannot be peacefully displayed today. It fostered hatred and racism to the point that white people who refused to joined (such as I) were looked down upon.\n \n All descendants of KKK members should be lynched! emoticon_xclown\n\n \n Jim, I am not a Klan member. The Klan today is exactly as you have described it. I have stated the truth when I stated that for a brief period in history the Klan was a necessary evil. I don't know for sure if anyone in my past family was a member of the Klan. Does this exclude me from lynching, or should I be lynched just in case?", 
   {}, 
   97255, 
   null, 
   1110652920.0
  ], 
  [
   97262, 
   null, 
   "georged", 
   " I have stated the truth when I stated that for a brief period in history the Klan was a necessary evil. \n\n \n Then you probably consider the Crusaders and Hitler necessary evils. Your hero general and first leader of the clan was well known for his military massacres of black federal troops and then black ex-slaves. I guess he didn't get enough of that in the Civil War and used KKK to continue his vendetta.", 
   {}, 
   97260, 
   null, 
   1110654720.0
  ], 
  [
   97283, 
   null, 
   "Desaix", 
   "Seemingly the Klan was a different group when it opened up.Akira,that would be an interesting slant on your report,how the Klan changed over time.\n \n At there height they were a pack of murderers and cowards,who beat up black kids and raped black girls,while covering there faces with bedsheets.\n \n Some links.\n \n http://www.spartacus.schoolnet.co.uk/USAkkk.htm\n \n http://www.k-k-k.com/\n \n http://www.pointsouth.com/csanet/kkk.htm\n \n http://www.bartleby.com/65/ku/KuKluxKl.html", 
   {}, 
   97262, 
   null, 
   1110659520.0
  ], 
  [
   97293, 
   null, 
   "georged", 
   "Seemingly the Klan was a different group when it opened up.Akira,that would be an interesting slant on your report,how the Klan changed over time.\n \n At there height they were a pack of murderers and cowards,who beat up black kids and raped black girls,while covering there faces with bedsheets.\n \n Some links.\n \n http://www.spartacus.schoolnet.co.uk/USAkkk.htm\n \n http://www.k-k-k.com/\n \n http://www.pointsouth.com/csanet/kkk.htm\n \n http://www.bartleby.com/65/ku/KuKluxKl.html\n\n \n Your first link states they started that way, murdering blacks and sympathetic whites. The klan's goals were always white supremacy and no civil rights for blacks. Where's the good in that?", 
   {}, 
   97283, 
   null, 
   1110662580.0
  ], 
  [
   97323, 
   null, 
   "Desaix", 
   "Your first link states they started that way, murdering blacks and sympathetic whites. The klan's goals were always white supremacy and no civil rights for blacks. Where's the good in that?\n\n \n I never said it started humanely.I simply stated that the KKK changed over time(which it did) and that Akira would be smart to look further into the KKK's history then just the 1950's onwards.", 
   {}, 
   97293, 
   null, 
   1110669360.0
  ], 
  [
   97332, 
   null, 
   "Hunter", 
   "Then you probably consider the Crusaders and Hitler necessary evils. Your hero general and first leader of the clan was well known for his military massacres of black federal troops and then black ex-slaves. I guess he didn't get enough of that in the Civil War and used KKK to continue his vendetta.\n\n \n The black federal troops you refer to were killed in battle at Fort Pillow. They were given the chance to surrender and chose not to. These black troopers were guilty of rape and theft from people in the surrounding community. It was the folks in these communities who called on General Forrest and his cavalry to put a stop to the mahem that the federals were perpetrating on innocent civilians. It is a known fact that General Forrest never issued an order to his troops to massacre combatants. Had the South had a few more like General Forrest the outcome of the war of Northern agression would certainly have been different.", 
   {}, 
   97262, 
   null, 
   1110676200.0
  ], 
  [
   97334, 
   null, 
   "jitobear", 
   "Had the South had a few more like General Forrest the outcome of the war of Northern agression would certainly have been different.\n\n \n The War of Northern Aggression. ***snort - - pop coming out my nose***\n \n The south still would have lost - they had no factories, no equipment, no naval force - they put up a good fight, but in the end the north could have just starved them out.", 
   {}, 
   97332, 
   null, 
   1110676980.0
  ], 
  [
   97346, 
   null, 
   "zachvac", 
   "Wheather you believe it or not, the Klan was a great and Godly movement in the South after the end of the war of Northern aggression. When it morphed into a hate group Gen. Forrest disbanded it and resigned as it's leader. You should read something about him, he was a great man. Lynching people without a trial has always been wrong. As to segregation, it is alive and well today, it is called white flight.As an interesting side note I will give you some statistics that may explain white flight.\n \n\n whatever.\n \n \n\n #1. 6 percent of the population comprises 44 percent of the prison population.\n \n\n Now what the hell does that mean? Say there is 10% of the entire population in jail, I could say: \"10 percent of the population comprises 100 percent of the prison population.\" What point are you trying to make?\n \n \n\n #2. 13 percent of the population comprises 85 percent of all violent crime in America.\n #3. 13 percent of the population comprises 50 percent of all new Aids cases.\n \n\n Same as above, I could claim that 15 percent comprises all violent crime and 20 percent comprises all AIDS cases, what does that prove?\n \n \n\n #4. 70 percent of all births in the Black community are illegitimate.\n \n\n What do you mean by illegitimate?\n \n \n\n And I could go on and on, but to what end. I will never sacrifice the truth to be politically correct. BTW I am not part of the white flight movement. I live in the heart of my city and I have watched it continually get worse and worse because of the above mentioned statistics. Liberalism is the bane of all humanity. It destroys all that it touches. Make momma proud, vote conservative.\n\n \n \n This is sort of random. This last bit has nothing to do with the rest of your post and has no support whatsoever. Give me some examples of why liberalism is the bane of all humanity and destroys all that it touches.\n \n By the way liberalism isn't really the Democrats. I would say Republicans are pretty liberal too. Liberal pretty much means larger government and conservative means less government. Gay marriage laws, abortion laws, death penalty, etc. are all examples of liberalism.", 
   {}, 
   97223, 
   null, 
   1110679140.0
  ], 
  [
   97373, 
   null, 
   "Duo_Maxwell", 
   "Liberalism/permissive child rearing has a lot to do with crime stats. Spare the rod and spoil the child.\n\n \n RIGHT. So under that logic, there was no crime, no hate, and none of the problems before liberalism. emoticon_rolleyes and people wonder why fundementalists are seen as living in tiny boxes. \n \n \n\n 1.2 It is my position that poverty does not cause crime. It is caused by a dark heart and a willingness to disregard the rights of others.\n\n \n So the most caring person in the world would rather die then steal bread to live? emoticon_rolleyes and people wonder why fundementalists are seen as living in tiny boxes. \n \n \n\n 2 Slavery was an abomination to God and man. It was an evil practice then as it is now.\n\n \n Then why does the bible say slavery is a acceptable practice?", 
   {}, 
   97259, 
   null, 
   1110685980.0
  ], 
  [
   97383, 
   null, 
   "Hunter", 
   "whatever.\n \n \n Now what the hell does that mean? Say there is 10% of the entire population in jail, I could say: \"10 percent of the population comprises 100 percent of the prison population.\" What point are you trying to make?\n \n \n Same as above, I could claim that 15 percent comprises all violent crime and 20 percent comprises all AIDS cases, what does that prove?\n \n \n What do you mean by illegitimate?\n \n \n \n \n This is sort of random. This last bit has nothing to do with the rest of your post and has no support whatsoever. Give me some examples of why liberalism is the bane of all humanity and destroys all that it touches.\n \n By the way liberalism isn't really the Democrats. I would say Republicans are pretty liberal too. Liberal pretty much means larger government and conservative means less government. Gay marriage laws, abortion laws, death penalty, etc. are all examples of liberalism.\n\n \n The crime stats that I posted are FBI numbers relating to crimes commited by Blacks in America.\n Illegitimate means a child born to parents who are not married to each other.\n For an example of what liberalism has destroyed, look no further than the public school system in America/ NEA.\n True liberalism is a wing of the Democratic party not the Republican party. A few examples of liberals would be: Michael Moore, Ted Kennedy and John Kerry. What you say about the Republican party is true, it is becoming far to liberal. If they aren't careful, they are going to lose their base supporters.", 
   {}, 
   97346, 
   null, 
   1110695160.0
  ], 
  [
   97384, 
   null, 
   "Hunter", 
   "RIGHT. So under that logic, there was no crime, no hate, and none of the problems before liberalism. emoticon_rolleyes and people wonder why fundementalists are seen as living in tiny boxes. \n \n \n \n So the most caring person in the world would rather die then steal bread to live? emoticon_rolleyes and people wonder why fundementalists are seen as living in tiny boxes. \n \n \n \n Then why does the bible say slavery is a acceptable practice?\n\n \n Pardner, I am not a fundementalist. I am a Christian. That said, I can assure you that I make no claim of perfection. As to stealing anything, I refer you to The Ten Commandments. We live in a fallen world, there has always been crime and there always will be. That does not make it right.", 
   {}, 
   97373, 
   null, 
   1110695700.0
  ], 
  [
   97385, 
   null, 
   "Hunter", 
   "The War of Northern Aggression. ***snort - - pop coming out my nose***\n \n The south still would have lost - they had no factories, no equipment, no naval force - they put up a good fight, but in the end the north could have just starved them out.\n\n \n You make a good point, but towards the end of the war the folks up north were getting sick of all of the bodies being shipped north. Slavery was flat wrong and I do not believe that God would have ever allowed the South to win for that reason, no more than he allowed Hitler to dominate the world.", 
   {}, 
   97334, 
   null, 
   1110696060.0
  ], 
  [
   97390, 
   null, 
   "Nwarth", 
   "1. I should revise some remarks I said earlier. Poverty creates BLUE collar crime which includes theft and murder. \n \n 2. Hunter you wish not to be called a fundamentalist, but a simple Christian. Well this can be solved here and now:\n \n 2.1 Do you believe that Jesus was the \"Son of God\" sent from Heaven to Earth and sacrificed for the sins of mankind?\n \n 2.2 Do you believe in Creationism, Young Earth Creationism? And that Evolution is the work of Satan?\n \n 2.3 Do you believe in the Rapture\n \n 2.3.1 If answered yes to 2.3 I have a bonus question, do your cloths also disappear with you? I understand this is a really issue of debate among some 'evangelical' christians.\n \n 2.4 Do you believe that Satan is a real being out to trick you from falling form the path of the Lord?\n \n 2.5 Is heaven a real place?\n \n 2.6 Is the Bible to be taken literately as the holy word of God and thus inerrant.\n \n 3. You claim that slavery was always morally wrong, yet you call the Civil War the \"War of Northern Aggression.\" Didn't the South fire the first shot? What of that slavery thing? The North freed them all, doesn't that justify any \"assault?\"", 
   {}, 
   97385, 
   null, 
   1110700680.0
  ], 
  [
   97543, 
   null, 
   "Hunter", 
   "1. I should revise some remarks I said earlier. Poverty creates BLUE collar crime which includes theft and murder. \n \n 2. Hunter you wish not to be called a fundamentalist, but a simple Christian. Well this can be solved here and now:\n \n 2.1 Do you believe that Jesus was the \"Son of God\" sent from Heaven to Earth and sacrificed for the sins of mankind?\n \n 2.2 Do you believe in Creationism, Young Earth Creationism? And that Evolution is the work of Satan?\n \n 2.3 Do you believe in the Rapture\n \n 2.3.1 If answered yes to 2.3 I have a bonus question, do your cloths also disappear with you? I understand this is a really issue of debate among some 'evangelical' christians.\n \n 2.4 Do you believe that Satan is a real being out to trick you from falling form the path of the Lord?\n \n 2.5 Is heaven a real place?\n \n 2.6 Is the Bible to be taken literately as the holy word of God and thus inerrant.\n \n 3. You claim that slavery was always morally wrong, yet you call the Civil War the \"War of Northern Aggression.\" Didn't the South fire the first shot? What of that slavery thing? The North freed them all, doesn't that justify any \"assault?\"\n\n \n Poverty is not the root cause of crime.\n \n 2. I maintain that I am not a fundamentalist.\n \n 2.1 Jesus Christ is my Lord and the only available means of salvation.\n \n 2.2 I believe that belief in the Rapture has only been around for about two hundred years. I could be wrong with that number, but it is of recent history. I am in the midst of studying the Rapture in order to form my own opinion. My answer for now is that I don't know.\n \n 2.3 I am not familiar with this debate topic, but it seems silly to me.\n \n 2.4 Yes Satan was an Angel who was actually created by God. He rebelled against God and was banished to the earth along with his followers. Satan will do whatever he thinks is needed to prevent a person from believing in Christ. He is the Father of Lies.\n \n 2.5 Heaven is a very real place. You will find out about the truth of Heaven and Hell when you die.\n \n 2.6 The Holy Bible is the inspired word of God, and yes I believe in it and it's author.\n \n 3 Slavery was and is wrong. Down here we still call it the war of northern aggression, always will. Yes the South fired the first shot and we will fire the last shot. Pun intended. The assault on the South, I think, was justified in order to free the slaves, we certainly agree there. That same argument can be used to justify our attempt to free the people of iraq.", 
   {}, 
   97390, 
   null, 
   1110780300.0
  ], 
  [
   97553, 
   null, 
   "Duo_Maxwell", 
   "Pardner, I am not a fundementalist. I am a Christian. That said, I can assure you that I make no claim of perfection. As to stealing anything, I refer you to The Ten Commandments. We live in a fallen world, there has always been crime and there always will be. That does not make it right.\n\n \n But that directly goes aganist your claim that liberalism is the cause of the problem. You just made a internal contriction, unless you want to start blaming the fallen world on liberalism, which by the way didn't come around until the late 18th century. I didn't make any claim of you being perfect. In fact, your personal belief on yourself is completely irrevelvant to this discussion in virtually every way. \n \n You state that there has always been crime and there always will be. Yet liberalism, which you seem to think is the cause, did not exist until relatively lately; so then I ask you, what is the cause of crime pre-liberalism?\n \n The 10 commandemnts doesn't talk about theft. \n \n Exd 34:12-26\n \n I. For thou shalt worship no other god: for the LORD, whose name [is] Jealous, [is] a jealous God:\n \n II. Thou shalt make thee no molten gods.\n \n III. The feast of unleavened bread shalt thou keep.\n \n IV. But the firstling of an XXX thou shalt redeem with a lamb: and if thou redeem [him] not, then shalt thou break his neck. All the firstborn of thy sons thou shalt redeem. And none shall appear before me empty.\n \n V. Six days thou shalt work, but on the seventh day thou shalt rest:\n \n VI. And thou shalt observe the feast of weeks, of the firstfruits of wheat harvest, and the feast of ingathering at the year's end.\n \n VII. Thrice in the year shall all your men children appear before the Lord GOD, the God of Israel.\n \n VIII. Thou shalt not offer the blood of my sacrifice with leaven; neither shall the sacrifice of the feast of the passover be left unto the morning.\n \n IX. The first of the firstfruits of thy land thou shalt bring unto the house of the LORD thy God.\n \n X. Thou shalt not seethe a kid in his mother's milk.", 
   {}, 
   97384, 
   null, 
   1110782220.0
  ], 
  [
   97566, 
   null, 
   "pandion", 
   "Wow, Duo! Isn't it funny that you and I have both consulted the Bible and we have both come up with equivalent versions of the 10 commandments. Of course, since we both read the same verses of the Bible, it is understandable. And yet Hunter refers you to the 10 commandments in regard to theft. It's just not there - nothing about theft in the only commandments that the Bible calls the \"ten commandments.\" What is Hunter reading? Is he not familiar with the Bible?\n \n I suspect that Hunter thinks that the commandments that Judge Roy Moore had engraved on his monumental erection in the rotunda of the Alabama Supreme Court building are the real thing. Well, they may be commandments from the Bible, but they are not the commandments identified in the Bible as the \"ten commandments.\"", 
   {}, 
   97553, 
   null, 
   1110785580.0
  ], 
  [
   97567, 
   null, 
   "pandion", 
   "Just as an exercise, Hunter, how do you feel about the following statement? This a question of definition in order to open discussion. Please state clearly at the beginning of each point whether you agree or disagree. Feel free to elaborate after that.\n \n 1. Biblical inerrancy\n 2. The divinity of Jesus\n 3. The virgin birth\n 4. The belief that Jesus died to redeem man\n 5. An expectation of the Second Coming, or physical return of Jesus Christ to initiate his 1000-year rule on the earth.", 
   {
    "post_info": {
     "post_title": "Hey, Hunter"
    }
   }, 
   97566, 
   null, 
   1110785820.0
  ], 
  [
   97568, 
   null, 
   "Hunter", 
   "Wow, Duo! Isn't it funny that you and I have both consulted the Bible and we have both come up with equivalent versions of the 10 commandments. Of course, since we both read the same verses of the Bible, it is understandable. And yet Hunter refers you to the 10 commandments in regard to theft. It's just not there - nothing about theft in the only commandments that the Bible calls the \"ten commandments.\" What is Hunter reading? Is he not familiar with the Bible?\n \n I suspect that Hunter thinks that the commandments that Judge Roy Moore had engraved on his monumental erection in the rotunda of the Alabama Supreme Court building are the real thing. Well, they may be commandments from the Bible, but they are not the commandments identified in the Bible as the \"ten commandments.\"\n\n I stand by what I posted and point out to you that knowledge of the law without love of your fellow man is useless.", 
   {}, 
   97566, 
   null, 
   1110785940.0
  ], 
  [
   97569, 
   null, 
   "pandion", 
   "I stand by what I posted and point out to you that knowledge of the law without love of your fellow man is useless.\n\n Irrelevant. It seems that you have no knowledge of the law and seem to be lacking in love to boot. It seems that you have made yourself to look a fool, since you speak of the law and have no knowledge of it.\n \n Let me point out to you that falsly claiming knowledge of the law is hypocrisy. Deceit is never done in the spirit of love.\n \n Are you thinking about the 5 statements?", 
   {}, 
   97568, 
   null, 
   1110786420.0
  ], 
  [
   97574, 
   null, 
   "Duo_Maxwell", 
   "Wow, Duo! Isn't it funny that you and I have both consulted the Bible and we have both come up with equivalent versions of the 10 commandments. Of course, since we both read the same verses of the Bible, it is understandable.\n\n \n Actually I just copied yours. :p I just figured with your past history, you actually did the digging to find the real stuff, unlike many religious people who just preach the same church made up claims.\n \n However, Hunter has some internal contridictions in his arguments, and does seem to skirt issues when it becomes cumbersome to deal with them. \n \n \nknowledge of the law without love of your fellow man is useless\n\n \n Why do you say that? Law is not concerned with preaching love. Law is concered with preaching order. Singapore is a draconian state, and look how successful they are economically and culturally.", 
   {}, 
   97566, 
   null, 
   1110788940.0
  ], 
  [
   97620, 
   null, 
   "georged", 
   "[QUOTE=Duo_Maxwell\n However, Hunter has some internal contridictions in his arguments, and does seem to skirt issues when it becomes cumbersome to deal with them. \n [/QUOTE]\n \n There's a real understatement.", 
   {}, 
   97574, 
   null, 
   1110815100.0
  ], 
  [
   97826, 
   null, 
   "Hunter", 
   "1. Thou shall have no other gods before me.\n \n 2. Thou shalt not make unto the any graven image.\n \n 3. Thou shalt not take the name of the Lord thy God in vain.\n \n 4. Remember the Sabbath day, to keep it holy.\n \n 5. Honour thy father and thy mother.\n \n 6. Thou shalt not murder.\n \n 7. Thou shalt not commit adultery.\n \n 8. Thou shalt not steal.\n \n 9. Thou shalt not bear false witness against thy neighour.\n \n 10. Thou shalt not covet anything that is thy neighbour's.", 
   {
    "post_info": {
     "post_title": "The Ten Commandments"
    }
   }, 
   97620, 
   null, 
   1110843000.0
  ], 
  [
   97832, 
   null, 
   "Waxy", 
   "Wow. emoticon_wow \n \n I've never actually encountered anyone that referred to the Civil War as the \"war of northern aggression\" before, let alone anyone that thinks the KKK is/was a good thing.\n \n This truly is a diverse board. emoticon_frazzled \n \n The real beauty of it is, you don't have to look through those little holes in your hood when you're online, the internet provides all the anonymity one could ever ask for.\n \n Waxy", 
   {}, 
   97826, 
   null, 
   1110843420.0
  ], 
  [
   97842, 
   null, 
   "Duo_Maxwell", 
   "Hunter: where did you get those commandements from? \n \n Pandion's and mine are the ones specifically noted by the bible as the 10 commandements.", 
   {}, 
   97832, 
   null, 
   1110844140.0
  ], 
  [
   97844, 
   null, 
   "Hunter", 
   "Wow. emoticon_wow \n \n I've never actually encountered anyone that referred to the Civil War as the \"war of northern aggression\" before, let alone anyone that thinks the KKK is/was a good thing.\n \n This truly is a diverse board. emoticon_frazzled \n \n The real beauty of it is, you don't have to look through those little holes in your hood when you're online, the internet provides all the anonymity one could ever ask for.\n \n Waxy\n\n \n Hello Waxy, the civil war is widely known as The War of Northern Agression down South where I am located. Thats all I meant by writing that. Nothing more. As to the KKK, I am opposed to any hate group, and the Klan is a hate group. When it was originally formed it had a noble purpose but quickly morphed into a hate and vengeance group. When that happened General Forrest disbanded it and resigned as it's leader. Those are the facts as I know them.", 
   {}, 
   97832, 
   null, 
   1110844260.0
  ], 
  [
   97849, 
   null, 
   "Hunter", 
   "Hunter: where did you get those commandements from? \n \n Pandion's and mine are the ones specifically noted by the bible as the 10 commandements.\n\n \n Hello Maxwell, the commandments that I posted are widely accepted by Christiantity as being genuine. Exodus 20:15 clearly states-- Thou shalt not steal. Why did ya'll leave that part out. Anyone who is even somewhat familiar with the Bible knows that I have posted the truth in my post titled The Ten Commandments. What else can I say. You either know the commandments or you don't.", 
   {}, 
   97842, 
   null, 
   1110844800.0
  ], 
  [
   97891, 
   null, 
   "georged", 
   "Hello Waxy, the civil war is widely known as The War of Northern Agression down South where I am located. Thats all I meant by writing that. Nothing more. As to the KKK, I am opposed to any hate group, and the Klan is a hate group. When it was originally formed it had a noble purpose but quickly morphed into a hate and vengeance group. When that happened General Forrest disbanded it and resigned as it's leader. Those are the facts as I know them.\n\n \n A quick Google reveals the Civil War cost Forrest his real estate wealth and he was broke. The KKK was originally formed as a social club and swiftly turned into a militant, guerrilla order group, with a purpose to preserve white rule in the South, and to protect themselves from militant ex-slaves who sought revenge at any cost (gee, I wonder why). The reason Forrest left was because the association (KKK) would have eliminated any possibility of financing for the railroad he started running. He needed a job. Virtually all capital in the South long after the Civil War was supplied by Northern interests. \n \n War heroes always have a personal side. While no one will dispute Forrest's war victories, including the Ft. Pillow incident where he invoked the Tennessee Law of that period regarding 'runaway' slaves, using him as a role model is similar to worshiping any military figure who was/is adept at killing. Especially when the war was lost. While WW2 era Germany produced military leaders such as Rommel, considered one of military history's most brilliant strategists, I don't recall seeing statues of any WW2 generals in Germany. They lost that war and put it behind them. As the South should do instead of clinging to a past that no longer exists. Cultural history shattered by war is one thing, but without moral responsibility and compassion it becomes bittersweet and resists reality.", 
   {}, 
   97844, 
   null, 
   1110853200.0
  ], 
  [
   97902, 
   null, 
   "Hunter", 
   "A quick Google reveals the Civil War cost Forrest his real estate wealth and he was broke. The KKK was originally formed as a social club and swiftly turned into a militant, guerrilla order group, with a purpose to preserve white rule in the South, and to protect themselves from militant ex-slaves who sought revenge at any cost (gee, I wonder why). The reason Forrest left was because the association (KKK) would have eliminated any possibility of financing for the railroad he started running. He needed a job. Virtually all capital in the South long after the Civil War was supplied by Northern interests. \n \n War heroes always have a personal side. While no one will dispute Forrest's war victories, including the Ft. Pillow incident where he invoked the Tennessee Law of that period regarding 'runaway' slaves, using him as a role model is similar to worshiping any military figure who was/is adept at killing. Especially when the war was lost. While WW2 era Germany produced military leaders such as Rommel, considered one of military history's most brilliant strategists, I don't recall seeing statues of any WW2 generals in Germany. They lost that war and put it behind them. As the South should do instead of clinging to a past that no longer exists. Cultural history shattered by war is one thing, but without moral responsibility and compassion it becomes bittersweet and resists reality.\n\n \n You are partially correct about General Forrest's statue, it is a very nice statue which is also he and his wife's burial site. That is why some folks can not have his statue removed as they would like to. When the South needs some advice about how we should handle our cultural history, you will be the first who I will seek out. Pun intended. Have a great day.", 
   {}, 
   97891, 
   null, 
   1110854280.0
  ], 
  [
   97905, 
   null, 
   "zachvac", 
   "The crime stats that I posted are FBI numbers relating to crimes commited by Blacks in America.\n Illegitimate means a child born to parents who are not married to each other.\n For an example of what liberalism has destroyed, look no further than the public school system in America/ NEA.\n True liberalism is a wing of the Democratic party not the Republican party. A few examples of liberals would be: Michael Moore, Ted Kennedy and John Kerry. What you say about the Republican party is true, it is becoming far to liberal. If they aren't careful, they are going to lose their base supporters.\n\n Well this is really strange. We learned in government class and I thought it was common knowledge that liberalism favored more government to protect the people and conservatives wanted the government out of their business. Conservatives were also for laissez-faire government (let it be). Yet when I look it up on dictionary.com it specifically has laissez-faire under liberalsim along with free market. I thought those were conservative views.\n \n So from what I learned before dictionary.com true liberalism is more government and conservativism (?) is less government. Libertarian for example, is pure conservative (Republicans are more moderate) yet most liberals seem to be leaning libertarian. I would generally consider myself a conservative (not really far right, but further right than left) yet I seem to side with the Democrats on most issues.", 
   {}, 
   97383, 
   null, 
   1110854760.0
  ], 
  [
   97907, 
   null, 
   "Duo_Maxwell", 
   "Hello Maxwell, the commandments that I posted are widely accepted by Christiantity as being genuine.\n\n \n Then the accepted ones are not the ones specified in the bible. So technically you are following the Church's 10 commandements, not the bible's. \n \n \n\n Exodus 20:15 clearly states-- Thou shalt not steal. Why did ya'll leave that part out. Anyone who is even somewhat familiar with the Bible knows that I have posted the truth in my post titled The Ten Commandments. What else can I say. You either know the commandments or you don't.\n\n \n Can you link that to a non-propaganda source?", 
   {}, 
   97849, 
   null, 
   1110855120.0
  ], 
  [
   97908, 
   null, 
   "georged", 
   "You are partially correct about General Forrest's statue, it is a very nice statue which is also he and his wife's burial site. That is why some folks can not have his statue removed as they would like to. When the South needs some advice about how we should handle our cultural history, you will be the first who I will seek out. Pun intended. Have a great day.\n\n \n Thank you, but that task is still a work in progress.", 
   {}, 
   97902, 
   null, 
   1110855180.0
  ], 
  [
   97972, 
   null, 
   "Nwarth", 
   "1.1 Mark your calendar guys. I agree with Hunter on something. I opened up my Bible and it says \"Thou salt not steal\" in Exodus 20:15.\n \n http://bible.gospelcom.net/passage/?book_id=2&chapter=20&version=31\n \n 1.2 I've also cross checked this with numerous other cites. I believe you didn't notice but Commandments 3 & 5 have several parts to them. You may want to read a little further next time before you comment.\n \n 2. Oh, and hunter, do you believe that because you have the Truth with your religion, as given to you by God, that you aught to take political action to see that its rules and moral codes are implemented in American Law?", 
   {}, 
   97908, 
   null, 
   1110860640.0
  ], 
  [
   98032, 
   null, 
   "Hunter", 
   "Thank you, but that task is still a work in progress.\n\n \n What task? Grave desecration. We will have none of that down here.", 
   {}, 
   97908, 
   null, 
   1110865860.0
  ], 
  [
   98033, 
   null, 
   "Hunter", 
   "1.1 Mark your calendar guys. I agree with Hunter on something. I opened up my Bible and it says \"Thou salt not steal\" in Exodus 20:15.\n \n http://bible.gospelcom.net/passage/?book_id=2&chapter=20&version=31\n \n 1.2 I've also cross checked this with numerous other cites. I believe you didn't notice but Commandments 3 & 5 have several parts to them. You may want to read a little further next time before you comment.\n \n 2. Oh, and hunter, do you believe that because you have the Truth with your religion, as given to you by God, that you aught to take political action to see that its rules and moral codes are implemented in American Law?\n\n \n Thanks Nwarth. In honour of you agreeing with me, I am taking Tuesday off and having a few drinks to honour you. #2 sounds like a trick question to me. I am going to give you a yes to your question.", 
   {}, 
   97972, 
   null, 
   1110866160.0
  ], 
  [
   98095, 
   null, 
   "pandion", 
   "What else can I say. You either know the commandments or you don't.\n\n Exactly! And you don't. There are only three references to the 10 commandments in the Bible. Two of those are not listings of the commandments but references to the first time the ten commandments are mentioned. That is, of course, the story of Moses going up the mountain where he is given the commandments by God, the golden calf, and the smashing of the tablets, and going back up the mountain to get more tablets. The commandments listed in that story, referred to by the Bible as the ten commandments, are the ones that Duo Maxwell has listed here and that I listed in another thread.\n \n Now I don't deny that you did list 10 commandments, but they are not the 10 commandments from the Bible. Yours are just 10 of the hundreds of commandments given in the Bible. None of those other commandments are identified in the Bible as the 10 commandments.\n \n Perhaps if you atually read the Bible rather than letting other people tell you what it says.\n \n By the way, you never did tell us how you feel about the 5 points that I listed. Do you agree or disagree? Please feel free to expand on your answers. For convenience, I'll list them again.\n \n 1. Biblical inerrancy\n 2. The divinity of Jesus\n 3. The virgin birth\n 4. The belief that Jesus died to redeem man\n 5. An expectation of the Second Coming, or physical return of Jesus Christ to initiate his 1000-year rule on the earth.", 
   {}, 
   98033, 
   null, 
   1110872820.0
  ], 
  [
   98574, 
   null, 
   "Hunter", 
   "Exactly! And you don't. There are only three references to the 10 commandments in the Bible. Two of those are not listings of the commandments but references to the first time the ten commandments are mentioned. That is, of course, the story of Moses going up the mountain where he is given the commandments by God, the golden calf, and the smashing of the tablets, and going back up the mountain to get more tablets. The commandments listed in that story, referred to by the Bible as the ten commandments, are the ones that Duo Maxwell has listed here and that I listed in another thread.\n \n Now I don't deny that you did list 10 commandments, but they are not the 10 commandments from the Bible. Yours are just 10 of the hundreds of commandments given in the Bible. None of those other commandments are identified in the Bible as the 10 commandments.\n \n Perhaps if you atually read the Bible rather than letting other people tell you what it says.\n \n By the way, you never did tell us how you feel about the 5 points that I listed. Do you agree or disagree? Please feel free to expand on your answers. For convenience, I'll list them again.\n \n 1. Biblical inerrancy\n 2. The divinity of Jesus\n 3. The virgin birth\n 4. The belief that Jesus died to redeem man\n 5. An expectation of the Second Coming, or physical return of Jesus Christ to initiate his 1000-year rule on the earth.\n\n \n Sir, the commandments as I listed them are recognised by literally millions of Christians of every denomination. I mean no disrespect to you, but I really don't understand why you are fighting this losing battle with me. Perhaps I should do some research on the origin of the commandments as I posted them. Anyway, let us agree to disagree.\n \n 1. Bible inerrancy: It is my belief that every word in the Bible is the inspired word of God. Many different translations from the original texts could pose minor problems. Some people claim that there are books which were left out of the Bible for some reason. Be that as it may be, I still accept the the King James version of the Bible to be correct and satisfactory to God and man.\n \n 2. The divinity of Jesus: I accept this without question.\n \n 3. The virgin birth: I accept this without question.\n \n 4. The belief that Jesus died to redeem man: This is not a belief, it is a fact. Salvation is available to all who put their faith in Jesus. He is the only way to get Grace and salvation.\n \n 5. An expectation of the Second Coming, or physical return of Jesus Christ to initiate his 1000-year rule on earth: If you don't believe in his promise of return to earth to rule for a thousand years, there is no sense in believing in his first coming. Yes, I believe that Christ will return as he promised. The timing of his return is known only by him.", 
   {}, 
   98095, 
   null, 
   1110954000.0
  ], 
  [
   98591, 
   null, 
   "Nwarth", 
   "1. People please don't argue with Hunter about what the ten commandments are because he is right. His ten commandments are (albeit somewhat simplified and abridged) basically the ten commandments.\n \n 2. Hunter, you're answers to my previous question point to the very definition of what a fundamentalist is. To shed light on this, here is an article I wrote for my class, \"Fundamentalism and the Future of Religion:\"\n \n \nReligion and Fundamentalism\n \n I sat back today watching a documentary about the horrific events that have launched fundamentalism from the back of the newspapers, into the forefront of American lives. Nine-eleven was a catastrophic day when America was attacked on our own soil on a massive scale not seen since WWII. It woke all of us up to the dangers of not only radical Islamic fundamentalism, but the dangers of fundamentalism in general.\n It is easy, however, to simply throw terms around. We must go further and ask ourselves what we are talking about; what is a religion, what is fundamentalism, and what is their relationship with each other?\n Religion must have some central components to it. To create a laundry list of necessary criteria we must begin by saying that it engenders some sense of community. When you are a member of a religion, you are not alone. The next major component to a religion is that it has some systematic belief that is centered on \"the sacred.\" That is to say, they believe in something more than themselves and that there is a correct way, as well as an incorrect way, to live one's life.\n The three main elements described above (specific sense of community, belief in the sacred, and a systematic belief or doctrine) describe a lot about religion, but they cannot tell us the full story. Religion's mythos, or stories that identify themselves, also tells us a lot about religions. Since the written word was invented, religions began to write down their mythos' in what is now commonly known as scripture. \n Another fascinating portion of religion that cannot be ignored is the common experience. Ranged from the mystic medicine man of the Navajo Tribes to the vision of St Mary, all religions have some form of \"sacred imagery\" or some way to travel to the beyond world. This mythos and \"sacred imagery\" is often made \"real\" through the use of rituals which often try to close the infinite gap between the sacred and the individual through a communal practice.\n Rituals are very diverse; from the Native American sweat lodges to the Roman Catholic Eucharist, the common cardinal importance of the ritual is to bring members of the community together to affirm their beliefs and connect to the sacred. By closing the infinite gap it helps the individual to relate with the sacred. By communally reaffirming one's belief in the common creed through ritual, not only is the community being brought together, a common narrative being created, but also we see the individual being empowered through their religion.\n What has this to do with the violence that has been done in \"God's (or Allah's) name\"? What is fundamentalism? The preliminary definition given to us by Ian Lustig is a terrific place to start, yet we must keep in mind that it misses the retreatist fundamentalists. Maybe a more moderate version of his definition, coupled with Jessica Stern's observation is needed. Something along the lines of, \"A religious structure where its adherents regard its tenets as uncompromisable and have direct transcendental imperatives that may involve political action oriented toward the rapid and comprehensive reconstruction of society, or a radical and comprehensive escape from society aimed at living in a world that never truly existed.\"\n This definition, of course, assumes that fundamentalism is a subset of religion. In essence, one could say that all fundamentalist systems are religions, but not all religions are fundamentalist systems. As both Kimball and Armstrong point out, most of the world's major religions are weathered, and moderated. They have survived for a time and as such have come to understand and recognize other religions as an acceptable fact to life. \n In my conversation with Catholics, for example, they often say that Catholicism is the best way to get to God, yet they will quickly acknowledge that other religions have \"rays\" of truth in them. It affirms their beliefs, but accepts other interpretations as having some grace or truth value in them. \n Fundamentalist systems stand in opposition to this tolerance of diversity. A fundamentalist would argue that there is only one truth and that they know this truth, all other religions; therefore, are wrong on some, most, or all of their beliefs. They would then go further to say that, unless you believe in what they believe that you will not be saved. I am thankful that most fundamentalists, at least in America , tend not to take this to violent ends. Unfortunately there are those in the Middle East who have no problem with waging a Holy War, or as they call it, Jihad, on those infidels who are either slandering their religion or who believe in a different religion. \n In essence the major item that divides fundamental beliefs from the more \"mainstream\" religious beliefs is when they become hard in their tenets and view them as not only uncompromisable, but something that should be protected and kept \"pure.\" Now, I don't have a problem if they do this locked away in their own communities (e.g. the Amish) but when they take radical or violent action, then it is time to understand the threat that we face. \n \n \n \n 3. As a philosopher I am duty bound to ask: \n \n \n1. Bible inerrancy: It is my belief that every word in the Bible is the inspired word of God. Many different translations from the original texts could pose minor problems. Some people claim that there are books which were left out of the Bible for some reason. Be that as it may be, I still accept the the King James version of the Bible to be correct and satisfactory to God and man.\n \n 2. The divinity of Jesus: I accept this without question.\n \n 3. The virgin birth: I accept this without question.\n \n \n \n How do you know this? How do you know that you should believe in 1 and why should you believe in 2 or three \"without question?\"", 
   {
    "unicode_changes_made": true
   }, 
   98574, 
   null, 
   1110961800.0
  ], 
  [
   98592, 
   null, 
   "Duo_Maxwell", 
   "How is accepting parts of the bible without question any different then accepting anything, including the most heinous ideas without question?\n \n Shouldn't you at least question what you are accepting?", 
   {}, 
   98591, 
   null, 
   1110962100.0
  ], 
  [
   98596, 
   null, 
   "Nwarth", 
   "I'm an Existentialist... our central premise is highly Socratic--- let us just say that \"unexamined life\" is what interests us the most because it is not only absurd, but often self-destructive.", 
   {}, 
   98592, 
   null, 
   1110963120.0
  ], 
  [
   98603, 
   null, 
   "daewoo", 
   "Well this is really strange. We learned in government class and I thought it was common knowledge that liberalism favored more government to protect the people and conservatives wanted the government out of their business. Conservatives were also for laissez-faire government (let it be). Yet when I look it up on dictionary.com it specifically has laissez-faire under liberalsim along with free market. I thought those were conservative views.\n \n So from what I learned before dictionary.com true liberalism is more government and conservativism (?) is less government. Libertarian for example, is pure conservative (Republicans are more moderate) yet most liberals seem to be leaning libertarian. I would generally consider myself a conservative (not really far right, but further right than left) yet I seem to side with the Democrats on most issues.\n\n \n \n Thats becuase the US definitions of \"liberal\" and \"conservative\": are XXX backwards from the rest of the world.", 
   {}, 
   97905, 
   null, 
   1110969060.0
  ], 
  [
   98604, 
   null, 
   "Duo_Maxwell", 
   "Not to mention subjective when it comes to the person. Also, it doesn't help that the majority of people likely don't even know what conservatism IS. \n \n While a Democracy of XXXXXX is clearly a oxymoron, we have somehow managed to obtain one.", 
   {}, 
   98603, 
   null, 
   1110969300.0
  ], 
  [
   100336, 
   null, 
   "Hunter", 
   "1. People please don't argue with Hunter about what the ten commandments are because he is right. His ten commandments are (albeit somewhat simplified and abridged) basically the ten commandments.\n \n 2. Hunter, you're answers to my previous question point to the very definition of what a fundamentalist is. To shed light on this, here is an article I wrote for my class, \"Fundamentalism and the Future of Religion:\"\n \n \n \n 3. As a philosopher I am duty bound to ask: \n \n \n \n How do you know this? How do you know that you should believe in 1 and why should you believe in 2 or three \"without question?\"\n\n \n Thanks for agreeing with me on the truth that I posted concerning The Ten Commandments. That makes you and I both 100% correct.\n \n I believe that the most important thing that a person can do with their time on this earth is to seek the truth about the means to eternal life. Life after death in Heaven with God or eternity in Hell. I believe that a personal relationship with Jesus is the only way to salvation, I am totally convinced of it. Jesus Christ was either a poached egg or God himself. Jesus claimed to be God, I chose to believe him. Many others disagree with my beliefs and that is their right. One of the greatest gifts that God gave to mankind is free will. Use it wisely as your very soul depends on what you do with your use of free will.\n \n Why don't you actually read the New Testament with an open mind and see for yourself that Jesus spoke the absolute truth about everything. No man in the history of the world has had a greater impact on humanity than Jesus. I do not understand how that fact can be ignored. It is the truth and cannot be denied. Eleven of the twelve original deciples died because of their belief in Jesus. They were all sane men of greatly varied backgrounds. None of them would have chosen to die for a rumor. I know that I wouldn't, but I would die for my Lord. A man is to die, and then the judgement of Christ. That is is it in a nut shell. Salvation is not a complicated issue, there is no grey area here. You either believe in Christ and go to Heaven or not. The choice is yours and yours alone. Christianity excludes no body. All are welcome. It is my hope and prayer that everyone at least keep an open mind and give Jesus a chance to save you from yourself and eternity in Hell.", 
   {}, 
   98591, 
   null, 
   1111475160.0
  ], 
  [
   100505, 
   null, 
   "akira_rayn216", 
   "1.2 It is my position that poverty does not cause crime. It is caused by a dark heart and a willingness to disregard the rights of others.\n \n \n Okay, poverty doesn't cause crime? Think about poor families that have no money, so need to steal to stay alive. Have you ever read Les Miserables? Jean Valjean was thrown into jail for stealing bread to feed his family. Some people have to resort to crime. Not violent crimes at first, but the deterioration rolls downhill from there. From stealing, you befriend other thieves, they get you into all sorts of trouble, until finally, you're a full-fledged outlaw. What does any of this have to do with the KKK, anyway?", 
   {}, 
   97259, 
   null, 
   1111525800.0
  ], 
  [
   100513, 
   null, 
   "akira_rayn216", 
   "1. Thou shall have no other gods before me.\n \n 2. Thou shalt not make unto the any graven image.\n \n 3. Thou shalt not take the name of the Lord thy God in vain.\n \n 4. Remember the Sabbath day, to keep it holy.\n \n 5. Honour thy father and thy mother.\n \n 6. Thou shalt not murder.\n \n 7. Thou shalt not commit adultery.\n \n 8. Thou shalt not steal.\n \n 9. Thou shalt not bear false witness against thy neighour.\n \n 10. Thou shalt not covet anything that is thy neighbour's.\n\n \n These are the Ten Commandments. Where on Earth, or, more likely, some other planet, did Duo get whatever that was?", 
   {}, 
   97826, 
   null, 
   1111526760.0
  ], 
  [
   100582, 
   null, 
   "Hunter", 
   "These are the Ten Commandments. Where on Earth, or, more likely, some other planet, did Duo get whatever that was?\n\n \n Thank you. emoticon_xangel", 
   {}, 
   100513, 
   null, 
   1111539420.0
  ], 
  [
   100584, 
   null, 
   "Hunter", 
   "1.2 It is my position that poverty does not cause crime. It is caused by a dark heart and a willingness to disregard the rights of others.\n \n \n Okay, poverty doesn't cause crime? Think about poor families that have no money, so need to steal to stay alive. Have you ever read Les Miserables? Jean Valjean was thrown into jail for stealing bread to feed his family. Some people have to resort to crime. Not violent crimes at first, but the deterioration rolls downhill from there. From stealing, you befriend other thieves, they get you into all sorts of trouble, until finally, you're a full-fledged outlaw. What does any of this have to do with the KKK, anyway?\n\n Les Miserables by Victor Hugo is one of my favorites. I need to read it again. :)", 
   {}, 
   100505, 
   null, 
   1111539540.0
  ], 
  [
   100928, 
   null, 
   "zachvac", 
   "Les Miserables by Victor Hugo is one of my favorites. I need to read it again. :)\n\n \n It was a pretty good book.", 
   {}, 
   100584, 
   null, 
   1111634520.0
  ], 
  [
   101498, 
   null, 
   "Taranaki", 
   "If poverty is the root cause of crime, explain corporate fraud.If poverty is the cause of crime, explain rape.If poverty is the cause of crime, explain the Mafia.\n There is no single reason for crime, each criminal has their own mind, and their own justification.\n \n As to the KKK..........a failed pressure group.Stop writing reports about them,stop setting up platforms for them to sermonize from,prosecute them and sue the hell out of them every time they deliberately disadvantage someone or breach the law, and they'll eventually give up and go away.\n Ignorance is forgiveable in an individual, but when there is an organised effort to recruit people into beliefs backed by ignorance,then that recruiting should be starved of all publicity,including debate.", 
   {}, 
   100928, 
   null, 
   1111808100.0
  ], 
  [
   101539, 
   null, 
   "Hunter", 
   "Poverty does not cause crime. A dark heart causes crime. White people have no impact on another person's decision to take up a life of crime. Some folks just don't give a damn about there fellow man and intend to prove it. Some folks are just plain evil.\n The further away from Jesus that this nation gets, the worse things are going to get.\n I believe that every man is responsible for his own actions while he is on this earth. I grow so tired of the liberals trying to blame Black crime on slavery or white supremacy. The root cause of crime is a lack of morality on an individual basis. Who my baby daddy? Men of all colors need to start being true men. As an aside I throw out another horrible statistic, 70% of all Black children are born into this world as Bastards. What chance do they have in life when they have no positive male role model in their lives? Take responsability for your own life and quit playing the blame game.", 
   {}, 
   101498, 
   null, 
   1111822140.0
  ], 
  [
   101580, 
   null, 
   "jim's trucking", 
   "If poverty is the root cause of crime, explain corporate fraud.If poverty is the cause of crime, explain rape.If poverty is the cause of crime, explain the Mafia.\n There is no single reason for crime, each criminal has their own mind, and their own justification.\n \n As to the KKK..........a failed pressure group.Stop writing reports about them,stop setting up platforms for them to sermonize from,prosecute them and sue the hell out of them every time they deliberately disadvantage someone or breach the law, and they'll eventually give up and go away.\n Ignorance is forgiveable in an individual, but when there is an organised effort to recruit people into beliefs backed by ignorance,then that recruiting should be starved of all publicity,including debate.  \nBut that would be totally unfair to the Democratic/Socialist party.", 
   {}, 
   101498, 
   null, 
   1111851120.0
  ], 
  [
   101605, 
   null, 
   "jitobear", 
   "As an aside I throw out another horrible statistic, 70% of all Black children are born into this world as Bastards. What chance do they have in life when they have no positive male role model in their lives? Take responsability for your own life and quit playing the blame game.\n\n \n And you really care and are sensitive to the situation of children without fathers I see. Using derogatory words like \"bastard\" is so helpful (and let's just forget that in this day women are valid heads of household and one does not have to have a penis to make a child legitimate.)\n \n I can believe that 70% are born outside of marriage, but that does not automatically mean there is no father who cares.\n \n And you certainly put men on a pedastal! No chance of success for people unless one is near by, huh? I didn't START succeeding until I divorced. Chances for children exist with opportunity, good people and love. My son's father is absent, but he is a happy, awesome kid with lots of positive role models in his life (men and women).\n \n \nWho my baby daddy?\n\n \n Nice use of stereotype and condescention of women and single mothers. Original. Accurate. Useful. Honest. \n \n \nThe further away from Jesus that this nation gets, the worse things are going to get.\n\n \n Interesting that you to preach Jesus' name and pass judgement in one and the same breath. You need to read the gospels again if you really think doing that is helpful, or Christian.", 
   {}, 
   101539, 
   null, 
   1111857360.0
  ], 
  [
   101684, 
   null, 
   "Hunter", 
   "And you really care and are sensitive to the situation of children without fathers I see. Using derogatory words like \"bastard\" is so helpful (and let's just forget that in this day women are valid heads of household and one does not have to have a penis to make a child legitimate.)\n \n I can believe that 70% are born outside of marriage, but that does not automatically mean there is no father who cares.\n \n And you certainly put men on a pedastal! No chance of success for people unless one is near by, huh? I didn't START succeeding until I divorced. Chances for children exist with opportunity, good people and love. My son's father is absent, but he is a happy, awesome kid with lots of positive role models in his life (men and women).\n \n \n \n Nice use of stereotype and condescention of women and single mothers. Original. Accurate. Useful. Honest. \n \n \n \n Interesting that you to preach Jesus' name and pass judgement in one and the same breath. You need to read the gospels again if you really think doing that is helpful, or Christian.\n\n \n The word Bastard simply refers to any child who is born to parents who are not committed enough to be married. It is a widely accepted term and I did not mean it to be condescending.\n \n Men who run around breeding like rats on their first date and who do not take care of their children ain't no count for nothing. The females who breed with these trashy men are not worth spit.\n Preserving the sanctity of the traditional family unit is paramount to the success and peservation of all races. The family of children and two parents is the only healthy and Godly way to bring up the children. Morality counts. All children, especially boys need a positive male role model in their lives. That is it in a nutshell. As to--who my baby daddy---it is a question that more and more women are having to ask every day because of the promiscuous and wanton way that they chose to have sex. Once again, morality matters greatly. You can thank Bill Clinton directly for some of this trickle down immorality. No race of people who do not care about their children will ever succeed on this planet.", 
   {}, 
   101605, 
   null, 
   1111869600.0
  ], 
  [
   101691, 
   null, 
   "georged", 
   "The word Bastard simply refers to any child who is born to parents who are not committed enough to be married. It is a widely accepted term and I did not mean it to be condescending.\n \n Men who run around breeding like rats on their first date and who do not take care of their children ain't no count for nothing. The females who breed with these trashy men are not worth spit.\n Preserving the sanctity of the traditional family unit is paramount to the success and peservation of all races. The family of children and two parents is the only healthy and Godly way to bring up the children. Morality counts. All children, especially boys need a positive male role model in their lives. That is it in a nutshell. As to--who my baby daddy---it is a question that more and more women are having to ask every day because of the promiscuous and wanton way that they chose to have sex. Once again, morality matters greatly. You can thank Bill Clinton directly for some of this trickle down immorality. No race of people who do not care about their children will ever succeed on this planet.\n\n \n You certainly qualify a majority of your opinions with your obvious belief system based morality. A limitation suitable for your circumstances may not be applicable to the rest of the world. \n \n I've known many people, both genders, from divorced parentage leading very satisfying lives while making positive contributions to society. Don't let your belief system completely close your mind or isolate you from reality.", 
   {}, 
   101684, 
   null, 
   1111871340.0
  ], 
  [
   101701, 
   null, 
   "jim's trucking", 
   "The word Bastard simply refers to any child who is born to parents who are not committed enough to be married. It is a widely accepted term and I did not mean it to be condescending.\n \n Men who run around breeding like rats on their first date and who do not take care of their children ain't no count for nothing. The females who breed with these trashy men are not worth spit.\n Preserving the sanctity of the traditional family unit is paramount to the success and peservation of all races. The family of children and two parents is the only healthy and Godly way to bring up the children. Morality counts. All children, especially boys need a positive male role model in their lives. That is it in a nutshell. As to--who my baby daddy---it is a question that more and more women are having to ask every day because of the promiscuous and wanton way that they chose to have sex. Once again, morality matters greatly. You can thank Bill Clinton directly for some of this trickle down immorality. No race of people who do not care about their children will ever succeed on this planet.\nHow \"Christian\" of you!\n \n To say that a single parent cannot maintain a \"Godly\" home environment is pure bullspit. I see it all the time.\n \n Perhaps you've let your religiousness get the better of you. The world is full of valuable sinners. All they need is love and guidance. For you to say someone \"ain't no count for nothing\" or \"not worth spit\" is not only judgemental, it's totally out of keeping with the teachings of our Lord and Savior, Jesus Christ.\n \n This is a news flash! Read all about it, in the Bible...after you get down off your hobby horse!", 
   {}, 
   101684, 
   null, 
   1111873920.0
  ], 
  [
   101839, 
   null, 
   "Hunter", 
   "How \"Christian\" of you!\n \n To say that a single parent cannot maintain a \"Godly\" home environment is pure bullspit. I see it all the time.\n \n Perhaps you've let your religiousness get the better of you. The world is full of valuable sinners. All they need is love and guidance. For you to say someone \"ain't no count for nothing\" or \"not worth spit\" is not only judgemental, it's totally out of keeping with the teachings of our Lord and Savior, Jesus Christ.\n \n This is a news flash! Read all about it, in the Bible...after you get down off your hobby horse!\n\n You make a valid point. There are always exceptions to every rule. Many good people raise good children by themselves. I can't deny that. I still say that anyone, male or female who does not live up to their responsability in raising their children ain't worth spit. Any man who gets a woman pregnant and abandons her and the child is as useless as teats on a boar hog.", 
   {}, 
   101701, 
   null, 
   1111904400.0
  ], 
  [
   101873, 
   null, 
   "Eddie", 
   "You make a valid point. There are always exceptions to every rule. Many good people raise good children by themselves. I can't deny that. I still say that anyone, male or female who does not live up to their responsability in raising their children ain't worth spit. Any man who gets a woman pregnant and abandons her and the child is as useless as teats on a boar hog.\n\n \n Useless? How do you assign utility to a person?!? \n \n I also find it rather amusing that you somehow equate marriage with good and responsible parenting. There are many countries, and many cultures where marriage is un-common. This has nothing to with their caring and commitment to children.", 
   {}, 
   101839, 
   null, 
   1111924980.0
  ], 
  [
   101875, 
   null, 
   "greg 79 f150", 
   "You make a valid point. There are always exceptions to every rule. Many good people raise good children by themselves. I can't deny that. I still say that anyone, male or female who does not live up to their responsability in raising their children ain't worth spit. Any man who gets a woman pregnant and abandons her and the child is as useless as teats on a boar hog.\n\n \n \n Good one, especially the boar hog comment. I have not used that expression in a long time. It is kind of like my \"until the cows come home\". Be careful tho, we have a poster here that will want to see a pic of them . :) \n \n I agree about the responsibility of men today, in seems WAY too many shrug personal responsibility off, like it is rainwater. It comes from each generation of fathers not teaching responsibilty to their sons, and it passes on down in a degenerative mode with a snowballing effect. It is like a rope burning a both ends, damaging our society to the core.", 
   {}, 
   101839, 
   null, 
   1111933920.0
  ], 
  [
   101889, 
   null, 
   "georged", 
   "\n I agree about the responsibility of men today, in seems WAY too many shrug personal responsibility off, like it is rainwater. It comes from each generation of fathers not teaching responsibilty to their sons, and it passes on down in a degenerative mode with a snowballing effect. It is like a rope burning a both ends, damaging our society to the core.\n\n \n How about taking it one more step, where many children are far better off without an irresponsible parent due to that parent having problems with alcohol, drugs, lack of anger management, compulsive psychological control, antiquated sociodemographic tradition and pure stupidity? \n \n Limiting those afflictions to men is an assumption all women are perfect while some men lack responsibility. A best friend raised his two sons alone in an exemplary manner, both completing advanced educations and becoming contributing members of society without crippling psychological scars. That's not an exception, I can relate several circumstances where women were not, for whatever reasons, capable of raising children with fathers and grandparents successfully assuming that responsibility. \n \n IMO our society incurs far more damage from the general public ignoring personal responsibility as citizens while clinging to outdated and ill-functioning traditions encouraged by political control. Facilitated by decades of prosperity, it became much easier to chase the elusive American Dream than pay attention to diminishing civil rights reduced in the name of safety for purposes of political control. Most people now allow their government to do their thinking for them, regardless of the outcome, and blame our social ills on anything but themselves. We the people has become a cliché.", 
   {}, 
   101875, 
   null, 
   1111942680.0
  ], 
  [
   101898, 
   null, 
   "jim's trucking", 
   "You make a valid point. There are always exceptions to every rule. Many good people raise good children by themselves. I can't deny that. I still say that anyone, male or female who does not live up to their responsability in raising their children ain't worth spit. Any man who gets a woman pregnant and abandons her and the child is as useless as teats on a boar hog.\nI know I made a valid point.\n \n It appears I need to repeat it as you have again referred to some of God's creatures as \"ain't worth spit\" and \"useless\". How many times must I remind you that this is not part of the Christian ideology? People are sinners and need your love and direction, not your scornful abandonment.\n \n Stop judging people and do something to change them. Bend down and say, \"Brother, what you're doing is legally and morally wrong. I'd like to help you do the right thing.\" If he doesn't respond, you report him to legal authorities.", 
   {}, 
   101839, 
   null, 
   1111946580.0
  ], 
  [
   101919, 
   null, 
   "greg 79 f150", 
   "How about taking it one more step, where many children are far better off without an irresponsible parent due to that parent having problems with alcohol, drugs, lack of anger management, compulsive psychological control, antiquated sociodemographic tradition and pure stupidity? \n \n Limiting those afflictions to men is an assumption all women are perfect while some men lack responsibility. A best friend raised his two sons alone in an exemplary manner, both completing advanced educations and becoming contributing members of society without crippling psychological scars. That's not an exception, I can relate several circumstances where women were not, for whatever reasons, capable of raising children with fathers and grandparents successfully assuming that responsibility. \n \n IMO our society incurs far more damage from the general public ignoring personal responsibility as citizens while clinging to outdated and ill-functioning traditions encouraged by political control. Facilitated by decades of prosperity, it became much easier to chase the elusive American Dream than pay attention to diminishing civil rights reduced in the name of safety for purposes of political control. Most people now allow their government to do their thinking for them, regardless of the outcome, and blame our social ills on anything but themselves. We the people has become a cliché.\n\n \n \n Agreed, my generalization did not take in the whole scope of a family being other than a male /female, so I stand corrected. I generally see the male parent ( my own raising making my bias here of course) being the role model, enforcing the rule to the son/s, to accept responsibilty, pay their bills, care for their future wife/mother of their children, keeping them safe and comfortable. Yes, I know, in 2005 that is a biased, back woods, outdated , mode of thinking, with a sexist tone, but I cant help being how I was raised. Which is the point you are making by my over generalization of the topic :).", 
   {}, 
   101889, 
   null, 
   1111950120.0
  ], 
  [
   101928, 
   null, 
   "pandion", 
   "Sir, the commandments as I listed them are recognised by literally millions of Christians of every denomination.\n\n That's irrelevant. What you listed are some of the commandments found in the Bible. It doesn't matter how many \"christians\" recognize them, they are not THE 10 Commandments that are identified as such in the Bible. Isn't it amazing how many people claim to have read the Bible and who claim to base their faith on the Bible who aren't aware of what it says and are too lazy to find out?\n \nI mean no disrespect to you, but I really don't understand why you are fighting this losing battle with me.\n\n Yes you do. You have been full of insult from the beginning and you do mean disrespect. Just look how you declare yourself to be the winner and then follow up with the thought that you should possibly research the matter.\n \nPerhaps I should do some research on the origin of the commandments as I posted them. Anyway, let us agree to disagree.\n\n If you want. I doubt that you will actually research it. Moreover, when you find out that I am correct I doubt that you have the integrity to admit it. Just so we are clear on what I am asserting so you don't twist it to make yourself appear correct as you tend to do - I am asserting the the 10 commandments that Duo and I listed are the ONLY commandments that are identified IN THE BIBLE as the 10 commandments. I am not saying that the other commandments that you listed did not come from the Bible. I am saying that the Bible does not identify them as the 10 commandments that Moses brought down from the mountain.\n \n1. Bible inerrancy:\n \n 2. The divinity of Jesus:\n \n 3. The virgin birth:\n \n 4. The belief that Jesus died to redeem man:\n \n 5. An expectation of the Second Coming, or physical return of Jesus Christ to initiate his 1000-year rule on earth:\n\n Congratulations, Hunter. You have just accepted the 5 primary tenets of fundamentalism. So I guess that makes you a fundamentalist.\n \nPeople please don't argue with Hunter about what the ten commandments are because he is right. His ten commandments are (albeit somewhat simplified and abridged) basically the ten commandments.\n\n So you don't read the Bible either? What Hunter listed and what you agree with are 10 commandments. They do come from the Bible. But that is not the point. They are not THE 10 Commandments that are identified as such in the Bible. The problem is that on the one hand many so called christians claim to follow the doctrine of \"sola scriptura.\" And then they accept traditions that are not stated in the Bible. The commandments that you and Hunter accept are not the commandments that Moses was given on the mountain and that the Bible identifies as THE 10 Commandments. You and Hunter are using a modified version of the traditional 10 commandments of the Roman Catholic Church.", 
   {}, 
   101919, 
   null, 
   1111951380.0
  ], 
  [
   101937, 
   null, 
   "jitobear", 
   "Preserving the sanctity of the traditional family unit is paramount to the success and peservation of all races. The family of children and two parents is the only healthy and Godly way to bring up the children. \n\n \n Whatever. Tie yourself to tradition if you like. The best thing that happened to my family was divorce and a gay male mentor for my son. \n \n I now make double the income I did before, own my own home, have a wonderful support structure and a life filled with fun and interesting activity.\n \n When we were traditional - I was controlled, abused, poor, and unhappy. My baby boy would draw monsters on his wall every day to represent the hell we lived in.\n \n All kinds of people and structures can be loving and good. And the traditional one can be from hell.\n \n \nAs to--who my baby daddy---it is a question that more and more women are having to ask every day because of the promiscuous and wanton way that they chose to have sex.\n\n \n Maybe that's true with YOUR female friends - but all mine know.", 
   {}, 
   101684, 
   null, 
   1111953120.0
  ], 
  [
   101941, 
   null, 
   "georged", 
   "Agreed, my generalization did not take in the whole scope of a family being other than a male /female, so I stand corrected. I generally see the male parent ( my own raising making my bias here of course) being the role model, enforcing the rule to the son/s, to accept responsibilty, pay their bills, care for their future wife/mother of their children, keeping them safe and comfortable. Yes, I know, in 2005 that is a biased, back woods, outdated , mode of thinking, with a sexist tone, but I cant help being how I was raised. Which is the point you are making by my over generalization of the topic :).\n\n \n I was raised in that era, with those values, and there's no doubt they were generally effective in producing responsible citizens. A big difference between then and now was the background of parents and grandparents from those eras. A majority experienced the major economic depression of 1929, which continued right up to WW2. Even when prosperity arrived with and following WW2, personal responsibility was still important to those generations and reflected by empathsis on personal savings, limited or no debt and close, personal family relationships. Those days and values have generally disappeared.\n \n I now watch a majority of parents put themselves in financial positions that would give me high anxiety with every waking breath and allow little or no sleep. That's been the norm for the past couple of generations, with each generation sinking deeper and deeper in their pursuit of free personal time and unaffordable material acquisition. With a complete lack of personal responsibility to themselves or their children, and total apathy for their governing process creating widespread political corruption, where's the moral glue that's going to hold them together when times do get emotionally tough? Antiquated belief systems don't work, their divorce rates with younger parents are just as high as any other segment of society, court ordered marriage counseling is a huge service business, single parents now have favorable tax advantages, crime pays because the judicial system and jails are full of people convicted of crimes based on moral legislation while crimes against people and society result in walking away and the list goes on and on.\n \n I have no solutions, but grasping at the past isn't going to accomplish anything but another dark age with 'them' and 'us', guaranteed failure. Until we hit a real rough patch of road and people have no choice but to fend for themselves, I don't see our social ills curing itself. Not when government is so corrupt it continues to foster removal of personal responsibility by condoning and encouraging no longer generally valid past lifestyles and condemning those who pursue personal responsibility as unpatriotic. All that'll achieve is a faster migration to haves and have nots with government becoming the middle, governing class. \n \n All any society can depend on for its future is its youth. While we create debt that will literally bury our youth and their children, I don't hear them complaining. Unless being deprived of what the Jones have is now a national rallying point. Fat and lazy is our major problem.", 
   {}, 
   101919, 
   null, 
   1111953780.0
  ], 
  [
   101946, 
   null, 
   "greg 79 f150", 
   "I was raised in that era, with those values, and there's no doubt they were generally effective in producing responsible citizens. A big difference between then and now was the background of parents and grandparents from those eras. A majority experienced the major economic depression of 1929, which continued right up to WW2. Even when prosperity arrived with and following WW2, personal responsibility was still important to those generations and reflected by empathsis on personal savings, limited or no debt and close, personal family relationships. Those days and values have generally disappeared.\n \n I now watch a majority of parents put themselves in financial positions that would give me high anxiety with every waking breath and allow little or no sleep. That's been the norm for the past couple of generations, with each generation sinking deeper and deeper in their pursuit of free personal time and unaffordable material acquisition. With a complete lack of personal responsibility to themselves or their children, and total apathy for their governing process creating widespread political corruption, where's the moral glue that's going to hold them together when times do get emotionally tough? Antiquated belief systems don't work, their divorce rates with younger parents are just as high as any other segment of society, court ordered marriage counseling is a huge service business, single parents now have favorable tax advantages, crime pays because the judicial system and jails are full of people convicted of crimes based on moral legislation while crimes against people and society result in walking away and the list goes on and on.\n \n I have no solutions, but grasping at the past isn't going to accomplish anything but another dark age with 'them' and 'us', guaranteed failure. Until we hit a real rough patch of road and people have no choice but to fend for themselves, I don't see our social ills curing itself. Not when government is so corrupt it continues to foster removal of personal responsibility by condoning and encouraging no longer generally valid past lifestyles and condemning those who pursue personal responsibility as unpatriotic. All that'll achieve is a faster migration to haves and have nots with government becoming the middle, governing class. \n \n All any society can depend on for its future is its youth. While we create debt that will literally bury our youth and their children, I don't hear them complaining. Unless being deprived of what the Jones have is now a national rallying point. Fat and lazy is our major problem.\n\n \n That is a very sobering, but very true post George. Speaking of the GD, I remember my Mom telling me she would buy a 50 lb bag of brown beans and bake bread and feed us kids for weeks. My dad worked at a sawmill all day for two dollars, and would come in with his beard froze solid. Yes, it is going to take a \"correction\" of our overinflated economy to get people back on track as to what REALLY counts in life. My concern is that when that correction happens, I dont think the people today will stand in soup lines , being respectful of those in front of them. The movie Road Warrior comes to my minds eye instead,", 
   {}, 
   101941, 
   null, 
   1111954740.0
  ], 
  [
   101956, 
   null, 
   "jitobear", 
   "All any society can depend on for its future is its youth.\n\n \n Honestly - I am trying really hard with mine. :)", 
   {}, 
   101941, 
   null, 
   1111956360.0
  ], 
  [
   101961, 
   null, 
   "georged", 
   "That is a very sobering, but very true post George. Speaking of the GD, I remember my Mom telling me she would buy a 50 lb bag of brown beans and bake bread and feed us kids for weeks. My dad worked at a sawmill all day for two dollars, and would come in with his beard froze solid. Yes, it is going to take a \"correction\" of our overinflated economy to get people back on track as to what REALLY counts in life. My concern is that when that correction happens, I dont think the people today will stand in soup lines , being respectful of those in front of them. The movie Road Warrior comes to my minds eye instead,\n\n \n As history teaches us, when it comes to humans anything bad is possible. Like you, I can't imagine being in metropolitan areas during hard times. A majority of our society is so accustomed to the 'me' mentality that manners have been totally abandoned.", 
   {}, 
   101946, 
   null, 
   1111956960.0
  ], 
  [
   102131, 
   null, 
   "zachvac", 
   "You make a valid point. There are always exceptions to every rule. Many good people raise good children by themselves. I can't deny that. I still say that anyone, male or female who does not live up to their responsability in raising their children ain't worth spit. Any man who gets a woman pregnant and abandons her and the child is as useless as teats on a boar hog.\n\n \n You call a single parent working hard for his/her kid to try to get them through life the exception? You think that if there's only one parent they will probably just neglect the kid? You think with a second parent they will automatically raise the kid perfectly? It don't work that way.", 
   {}, 
   101839, 
   null, 
   1111988700.0
  ], 
  [
   102133, 
   null, 
   "zachvac", 
   "Some interesting child abuse statistics:\n \n 61% of all child abuse is committed by biological mothers\n 25% of all child abuse is committed by natural fathers\n \n http://www.deltabravo.net/custody/stats.htm\n \n This means that not only are mothers more likely to abuse the children, but child abuse is committed by the natural parent 61+25=86% of the time. Now that doesn't say anything about whether a single parent or married family were more likely to commit child abuse. I looked all over and found nothing. I would suspect there is more abuse in a home with 2 parents, but if anyone can find data on that, it would be great.", 
   {}, 
   102131, 
   null, 
   1111988880.0
  ], 
  [
   102136, 
   null, 
   "Hunter", 
   "I know I made a valid point.\n \n It appears I need to repeat it as you have again referred to some of God's creatures as \"ain't worth spit\" and \"useless\". How many times must I remind you that this is not part of the Christian ideology? People are sinners and need your love and direction, not your scornful abandonment.\n \n Stop judging people and do something to change them. Bend down and say, \"Brother, what you're doing is legally and morally wrong. I'd like to help you do the right thing.\" If he doesn't respond, you report him to legal authorities.\n\n Jim, I help who I can when I can. I fully admit that I was born a sinner, I live a sinful life and I will die a sinner saved only by the Grace of our Lord. And you? Paul said that Christians would have a part in judging the world and we will have a part in judging the Angels. If this is true, and it is, we are qualified to judge things that relate to this life. A man who mistreats or abandons his wife or children does not manifest that they are children of God. Without repentance this man can not enter the Kingdom of Heaven. Under these circumstances I suggest to you that he may be worth spit, but not much more.\n Further, I take your rebuke of me as you intended it. Kindly. But now you have judged a fellow Christian. By what measure shall you be judged? I mean no harm Jim, God bless.", 
   {}, 
   101898, 
   null, 
   1111989360.0
  ], 
  [
   102161, 
   null, 
   "georged", 
   "Jim, I help who I can when I can. I fully admit that I was born a sinner, I live a sinful life and I will die a sinner saved only by the Grace of our Lord. And you? Paul said that Christians would have a part in judging the world and we will have a part in judging the Angels. If this is true, and it is, we are qualified to judge things that relate to this life. A man who mistreats or abandons his wife or children does not manifest that they are children of God. Without repentance this man can not enter the Kingdom of Heaven. Under these circumstances I suggest to you that he may be worth spit, but not much more.\n Further, I take your rebuke of me as you intended it. Kindly. But now you have judged a fellow Christian. By what measure shall you be judged? I mean no harm Jim, God bless.\n\n \n For what reason would fundamentalist belief system testimony be inserted into a thread having no relation to topic except to other belief system advocates? While mythology is seemingly important to many people, due to lack of fact content can you understand it's considered inappropriate and insulting to non-believers and belongs in religious/belief system forums?", 
   {}, 
   102136, 
   null, 
   1112025300.0
  ], 
  [
   102232, 
   null, 
   "Hunter", 
   "For what reason would fundamentalist belief system testimony be inserted into a thread having no relation to topic except to other belief system advocates? While mythology is seemingly important to many people, due to lack of fact content can you understand it's considered inappropriate and insulting to non-believers and belongs in religious/belief system forums?\n\n \n Well, I guess I just ain't politically correct. For those who are insulted by my post, I apologize.", 
   {}, 
   102161, 
   null, 
   1112040720.0
  ], 
  [
   102234, 
   null, 
   "jim's trucking", 
   "Jim, I help who I can when I can. I fully admit that I was born a sinner, I live a sinful life and I will die a sinner saved only by the Grace of our Lord. And you? Paul said that Christians would have a part in judging the world and we will have a part in judging the Angels. If this is true, and it is, we are qualified to judge things that relate to this life. A man who mistreats or abandons his wife or children does not manifest that they are children of God. Without repentance this man can not enter the Kingdom of Heaven. Under these circumstances I suggest to you that he may be worth spit, but not much more.\n Further, I take your rebuke of me as you intended it. Kindly. But now you have judged a fellow Christian. By what measure shall you be judged? I mean no harm Jim, God bless.\nI don't think I judged you. I merely corrected you. There's a lot of difference between the two.\n \n \n Mistreating or abandonning children is not on the list of things that will keep someone from Heaven. There is only one unforgivable sin.", 
   {}, 
   102136, 
   null, 
   1112041140.0
  ], 
  [
   102244, 
   null, 
   "jitobear", 
   "Paul said that Christians would have a part in judging the world and we will have a part in judging the Angels.\n\n \n Paul AND Christ told us NOT to judge. It's one of the main messages of the New Testament (and I just finished reading the whole thing). The entire book of Romans is practically dedicated to it! When Paul lists all the people who aren't worthy of the kingdom of heaven - it is the beginning of a bait and switch. He then goes on to say that we are not fit to judge, because we are just as bad, and that when we pass judgement and make claims about who will be saved we are dismissing Christ's grace. Only Christ knows his followers - not you, Hunter.\n \n By the way, I am not saying that certain behaviors aren't preached against by Paul, they most certainly are - but, no we don't get to judge or make determinations about who will be saved.", 
   {}, 
   102136, 
   null, 
   1112043180.0
  ], 
  [
   102262, 
   null, 
   "zachvac", 
   "Paul AND Christ told us NOT to judge. It's one of the main messages of the New Testament (and I just finished reading the whole thing). The entire book of Romans is practically dedicated to it! When Paul lists all the people who aren't worthy of the kingdom of heaven - it is the beginning of a bait and switch. He then goes on to say that we are not fit to judge, because we are just as bad, and that when we pass judgement and make claims about who will be saved we are dismissing Christ's grace. Only Christ knows his followers - not you, Hunter.\n \n By the way, I am not saying that certain behaviors aren't preached against by Paul, they most certainly are - but, no we don't get to judge or make determinations about who will be saved.\n\n \n \n It's that thing about selective reading. If it doesn't help your cause then it isn't there. I'm not trying to say all Christians are like that, but it seems like a lot just read part of the bible and interpret it as they see fit. Thus we have many religions that all believe the bible is the holy book, but their interpretation and selection of facts to believe is correct.", 
   {}, 
   102244, 
   null, 
   1112045280.0
  ], 
  [
   102263, 
   null, 
   "zachvac", 
   "Kind of funny how far away this has gotten away from the original topic. From the KKK to Christianity? Saying something? :)", 
   {}, 
   102262, 
   null, 
   1112045340.0
  ], 
  [
   102270, 
   null, 
   "jim's trucking", 
   "Kind of funny how far away this has gotten away from the original topic. From the KKK to Christianity? Saying something? :)\nDidn't you know the KKK is made up of white, God fearin' Christian men? emoticon_rolleyes emoticon_xclown", 
   {}, 
   102263, 
   null, 
   1112046120.0
  ], 
  [
   102278, 
   null, 
   "Hunter", 
   "I don't think I judged you. I merely corrected you. There's a lot of difference between the two.\n \n \n Mistreating or abandonning children is not on the list of things that will keep someone from Heaven. There is only one unforgivable sin.\n\n \n That would be denial of the power of the Holy Spirit.", 
   {}, 
   102234, 
   null, 
   1112047620.0
  ], 
  [
   102279, 
   null, 
   "jim's trucking", 
   "That would be denial of the power of the Holy Spirit.\nHow so? I was told that the only unforgivable sin is to deny Christ. After all, Jesus took two thieves with Him when He died. All they had to do was believe in Him.", 
   {}, 
   102278, 
   null, 
   1112047800.0
  ], 
  [
   102365, 
   null, 
   "Hunter", 
   "How so? I was told that the only unforgivable sin is to deny Christ. After all, Jesus took two thieves with Him when He died. All they had to do was believe in Him.\n\n \n Only one of the people being crucified with Jesus was promised salvation, not both of them. One asked forgiveness and one did not.\n Denial of the Holy Spirit is denial of Christ. See Matthew 12:31.", 
   {}, 
   102279, 
   null, 
   1112061600.0
  ], 
  [
   102396, 
   null, 
   "zachvac", 
   "Didn't you know the KKK is made up of white, God fearin' Christian men? emoticon_rolleyes emoticon_xclown\n\n \n That was kind of my point.", 
   {}, 
   102270, 
   null, 
   1112075640.0
  ], 
  [
   102403, 
   null, 
   "Hunter", 
   "That was kind of my point.\n\n Do I detect some sarcasm here????? emoticon_idea", 
   {}, 
   102396, 
   null, 
   1112078220.0
  ], 
  [
   102572, 
   null, 
   "diana", 
   "Wow Hunter,finally someone who reads the same bible as me.", 
   {
    "post_info": {
     "post_title": "late baby boomer"
    }
   }, 
   97620, 
   null, 
   1112133000.0
  ], 
  [
   102573, 
   null, 
   "jim's trucking", 
   "Wow Hunter,finally someone who reads the same bible as me.\nWhich do you read? I'm partial to King James' version, but have several NIVs...and I know someone who is presently translating from original Greek.\n \n Which bible do you read?", 
   {}, 
   102572, 
   null, 
   1112133300.0
  ], 
  [
   102716, 
   null, 
   "Hunter", 
   "Wow Hunter,finally someone who reads the same bible as me.\n\n \n Greetings to you Diana from the conservative South, hope you are well. I like the King James version of the Bible but have many other versions. I have one Bible called The Book, it is a very easy read for beginners. Another good study book is --Josephus, The Complete Works, translated by William Whiston, A.M.-- It is a great source for corroboration of Biblical history. God bless.", 
   {}, 
   102572, 
   null, 
   1112161500.0
  ], 
  [
   102817, 
   null, 
   "Master_Shake", 
   "How about we get back to talking about the ****ing KKK.", 
   {}, 
   102716, 
   null, 
   1112209920.0
  ], 
  [
   102822, 
   null, 
   "Big Orn", 
   "How about we get back to talking about the ****ing KKK.\n\n snicker-snicker emoticon_rolleyes \n \n I wish we had the first-generation KKK in my neck of the woods now and then. These trashy n'erdowells wouldn't lurk in the bushes waiting for you to go to work and steal you blind.\n \n There are a few of us that keep an eye out for one another around the neighborhood, but the rest are content to \"call the law\"...who does nothing at all.\n \n I guess wearing a hood and keeping the community clean was a good idea until a generation came along thinking they were little gods who could deem dark skin color a sin... emoticon_frazzled", 
   {}, 
   102817, 
   null, 
   1112210760.0
  ], 
  [
   103003, 
   null, 
   "Hunter", 
   "snicker-snicker emoticon_rolleyes \n \n I wish we had the first-generation KKK in my neck of the woods now and then. These trashy n'erdowells wouldn't lurk in the bushes waiting for you to go to work and steal you blind.\n \n There are a few of us that keep an eye out for one another around the neighborhood, but the rest are content to \"call the law\"...who does nothing at all.\n \n I guess wearing a hood and keeping the community clean was a good idea until a generation came along thinking they were little gods who could deem dark skin color a sin... emoticon_frazzled\n\n \n Big Orn, is it true that you can shoot folks in Texas who are in the process of committing a property crime? I'm just curious. There is alot of crime in The People's Republic of Memphis. It is so bad here that bread delivery trucks have tail-gunners. BOY-HOWDY!!!!!", 
   {}, 
   102822, 
   null, 
   1112249220.0
  ], 
  [
   103715, 
   null, 
   "zachvac", 
   "Do I detect some sarcasm here????? emoticon_idea\n\n \n \n Not really, I was just saying it was kind of a funny coincidence that we went from the KKK - an organization made up of Christians - to Christianity. Just kind of interesting.", 
   {}, 
   102403, 
   null, 
   1112491440.0
  ], 
  [
   103767, 
   null, 
   "Hunter", 
   "Not really, I was just saying it was kind of a funny coincidence that we went from the KKK - an organization made up of Christians - to Christianity. Just kind of interesting.\n\n \n Well, you are correct in your observation. I don't know how to explain it, but it happens all the time. Anyway, the Klan is dead and Christianity is very much alive.", 
   {}, 
   103715, 
   null, 
   1112507940.0
  ], 
  [
   103781, 
   null, 
   "zachvac", 
   "Well, you are correct in your observation. I don't know how to explain it, but it happens all the time. Anyway, the Klan is dead and Christianity is very much alive.\n\n \n \n I know that. Just because all Klan members were Christian doesn't mean all Christians were with the Klan. I just thought our progression into Christianity from the KKK was kind of funny. Don't quite get what you are trying to say \"happens all the time\".", 
   {}, 
   103767, 
   null, 
   1112510340.0
  ], 
  [
   104078, 
   null, 
   "Big Orn", 
   "Big Orn, is it true that you can shoot folks in Texas who are in the process of committing a property crime? I'm just curious. There is alot of crime in The People's Republic of Memphis. It is so bad here that bread delivery trucks have tail-gunners. BOY-HOWDY!!!!!\n\n In a way, yes. It depends on the circumstances and then the lawyers will wreak havoc. We realize that we can protect our homes and property but we also realize that we have to use that law with discretion.\n \n An old saying goes like this: \"When you kill 'im, drag his body inside and plant a gun on it...just to make sure.\"\n \n And we're not to the point that our Ideal Bread guys need tail-gunners...yet. :)", 
   {
    "unicode_changes_made": true
   }, 
   103003, 
   null, 
   1112639700.0
  ], 
  [
   114753, 
   null, 
   "jazyjason", 
   "You know Hunter there is us (the Christians) and the world. We will always be persecuted for our faith in Christ. Just for encouragment there is a posting of the Ten Commandments in my school which I put up. I live in California so miracles DO happen! lol. After being threatened with expulsion and arrest I took the matter to the ACLJ. During the fight my name was slandered by many people yet I held fast to the Lord and he saw me through. Point is God is always with us. He loves us and everyone. Yet the world will not see the simplest things for what they are. Just like creationism vs. evolusionism. Fight the good fight, and hold true to Him.", 
   {}, 
   104078, 
   null, 
   1114933260.0
  ], 
  [
   121668, 
   null, 
   "akira_rayn216", 
   "Okay, I'm not exactly sure how asking for information on the KKK led to a passionate debate on religious philosophy, but, whatever works. Boy, is this getting out of hand or what? I need to know about the KKK. I want opinions on white-clad figures spreading hatred, not Bible passages and crime stats. :xbanghead", 
   {
    "post_info": {
     "post_title": "Wtf?"
    }
   }, 
   98574, 
   null, 
   1115932080.0
  ], 
  [
   121676, 
   null, 
   "Truthsayer", 
   "\n And we're not to the point that our Ideal Bread guys need tail-gunners...yet. :)\n\n \n I though it was Mrs. Baird's Bread down there by you guys. :p", 
   {
    "unicode_changes_made": true
   }, 
   104078, 
   null, 
   1115932860.0
  ], 
  [
   121681, 
   null, 
   "Big Orn", 
   "I though it was Mrs. Baird's Bread down there by you guys. :p\n\n \"Down here\" it's shortnin' :) emoticon_cool", 
   {}, 
   121676, 
   null, 
   1115933220.0
  ], 
  [
   121692, 
   null, 
   "gnojek", 
   " Anyway, the Klan is dead \n\n http://www.kkk.bz/\n \n Really? Well, like Christ and the south, they've risen again....", 
   {}, 
   103767, 
   null, 
   1115934120.0
  ], 
  [
   121696, 
   null, 
   "jim's trucking", 
   "Okay, I'm not exactly sure how asking for information on the KKK led to a passionate debate on religious philosophy, but, whatever works. Boy, is this getting out of hand or what? I need to know about the KKK. I want opinions on white-clad figures spreading hatred, not Bible passages and crime stats. :xbanghead\nYou'll get more accurate descriptions of the KKK from a Google or Copernic search of KKK history  than you will from posters on this board.", 
   {}, 
   121668, 
   null, 
   1115934240.0
  ], 
  [
   132492, 
   null, 
   "akira_rayn216", 
   "You know, everyone is keeps talking about the moral character of General Nathan Bedford Forrest, and his purposes for founding the Ku Klux Klan. Well, he wasn't even there when it started. The original KKK was meant to be a secret organization so that some kids could have some fun being secretive. It was started to rebel against the Reconstruction, and became a huge group extremely quickly. There was no real organization at all until they had representatives meet, and that was when General Forrest was appointed Imperial/Grand Wizard. He disbanded it, yes, in 1869 after it proved uncontrollable, and unnecessarilay violent. No, I do not know if I spelled unnecessarily right, so don't ask. emoticon_wow", 
   {
    "post_info": {
     "post_title": "General Forrest"
    }
   }, 
   98095, 
   null, 
   1117830240.0
  ], 
  [
   132560, 
   null, 
   "Dono", 
   "My grandfather had a problem with the local KKK back in the 20's. He was a farmer and was postmaster in the small community. One day the head of the local clan asked my grandfather to join. When my grandfather refused the man told my grandfather he \"was either with us or against us, and those that are against us can have their barns burn down and their stock die\". My grandfather replied that if his barn burned or his stock died or any harm came to any of his family, he would hold him personally responsible and would deal with him, and that he would tell his brothers of their conversation. For months after that my grandfather plowed with his rifle across the plow and his pistol in the bib of his overalls. My father recalled he and his brothers sleeping with loaded rifles in the room. My grandfather's barn was in good shape and his stock were healthy when he sold the farm years later.\n Dono", 
   {}, 
   97323, 
   null, 
   1117840020.0
  ], 
  [
   132646, 
   null, 
   "jyoshu", 
   "You know, everyone is keeps talking about the moral character of General Nathan Bedford Forrest, and his purposes for founding the Ku Klux Klan. Well, he wasn't even there when it started. The original KKK was meant to be a secret organization so that some kids could have some fun being secretive. It was started to rebel against the Reconstruction, and became a huge group extremely quickly. There was no real organization at all until they had representatives meet, and that was when General Forrest was appointed Imperial/Grand Wizard. He disbanded it, yes, in 1869 after it proved uncontrollable, and unnecessarilay violent. No, I do not know if I spelled unnecessarily right, so don't ask. emoticon_wow\n\n \n This is all true, but there is a separate thread about Forrest here in this forum where he's been discussed at length.", 
   {}, 
   132492, 
   null, 
   1117854420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Ku Klux Klan", 
  "url": "http://www.4forums.com/political/civil-rights-debates/4503-ku-klux-klan.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 4503, 
  "discussion_files": [
   [
    "25962.html", 
    "http://www.4forums.com/political/civil-rights-debates/4503-ku-klux-klan-print.html"
   ], 
   [
    "25963.html", 
    "http://www.4forums.com/political/civil-rights-debates/4503-ku-klux-klan-8-print.html"
   ], 
   [
    "25964.html", 
    "http://www.4forums.com/political/civil-rights-debates/4503-ku-klux-klan-6-print.html"
   ], 
   [
    "25965.html", 
    "http://www.4forums.com/political/civil-rights-debates/4503-ku-klux-klan-4-print.html"
   ], 
   [
    "25966.html", 
    "http://www.4forums.com/political/civil-rights-debates/4503-ku-klux-klan-5-print.html"
   ], 
   [
    "25967.html", 
    "http://www.4forums.com/political/civil-rights-debates/4503-ku-klux-klan-7-print.html"
   ], 
   [
    "25968.html", 
    "http://www.4forums.com/political/civil-rights-debates/4503-ku-klux-klan-3-print.html"
   ], 
   [
    "25969.html", 
    "http://www.4forums.com/political/civil-rights-debates/4503-ku-klux-klan-2-print.html"
   ]
  ], 
  "identifier": 4503
 }
]