[
 [
  [
   97179, 
   null, 
   "Phantos", 
   "Do you have a cell phone? Are you for or against them? In what situations do you feel that they are inappropriate?\n \n Personally, I'm against them. I find them really annoying, especially in school. Sitting in a huge lecture hall taking a test, and suddenly, a phone goes off breaking all 350 students' concentration. \n \n I've found that people are much less attentive while driving and talking on the phone at the same time. I've ridden withe people like that; over the center line, then back to the shoulder, then back to the center while they try to drive and dial at the same time. \n \n They can be very rude at times too, breaking into conversations. It astonishes me that a ringing phone will take precedence over an actual person. \n \n Sure, they can be good for certain people, people who use them for work, or emergencies, but otherwise, I don't see the purpose; what happened to regular phones...or privacy?", 
   {
    "post_info": {
     "post_title": "Cell Phones"
    }
   }, 
   null, 
   null, 
   1110590160.0
  ], 
  [
   97192, 
   null, 
   "Eddie", 
   "I can`t even recall how I managed to stay in touch with my friends before the cell phones became virtually mandatory. Sure, I agree that they can be annoying at times and in certain situations, but the fact that I even can reach my 85 year old grandpa on his cell phone whenever I want to have a chat or worry about him makes them indespensible.", 
   {}, 
   97179, 
   null, 
   1110591960.0
  ], 
  [
   97200, 
   null, 
   "georged", 
   "I can`t even recall how I managed to stay in touch with my friends before the cell phones became virtually mandatory. Sure, I agree that they can be annoying at times and in certain situations, but the fact that I even can reach my 85 year old grandpa on his cell phone whenever I want to have a chat or worry about him makes them indespensible.\n\n \n Asia and Europe are 18-24 months ahead of the US in cell technology consumer application, a standard that seems consistent. I don't know European market numbers, Asia demands the newest technology available, but it would seem to depend on market acceptance to change, where other than business/ youth, the general US population, an aging body, is reluctant to embrace change of any type.", 
   {}, 
   97192, 
   null, 
   1110594000.0
  ], 
  [
   97203, 
   null, 
   "Eddie", 
   "Ah. Your post intigued me so I looked into the issue a bit more closely. Apparantly mobile phone ownership is much more widespread in Europe than in the US. In 2001 you guys had 44 mobile phone subscritpions per 100 inhabitants. Western european countries landed somewhere between 70-90 subscriptions per 100 inhabitants (Luxemburg rated highest at 97).\n \n More recent figures (2004) showed that EU mobile phone subscriptions have increased to an average of 80 subscriptions per 100 inhabitant. The rate of subscriptions in Luxemburg was around 120 per 100 inhabitants. In Sweden we had 98 subscriptions per 100 inhabitants.\n \n I could`t find any recent figures from the US though...", 
   {}, 
   97200, 
   null, 
   1110595920.0
  ], 
  [
   97233, 
   null, 
   "jitobear", 
   "Oh my phone is most handy. Single mom, two jobs, co-parent who does not live with me. always on the run - I always reachable and it has helped improve my time management a TON. I agree there are times to put it on mute and let voice-mail get the call tho...", 
   {}, 
   97179, 
   null, 
   1110615660.0
  ], 
  [
   97251, 
   null, 
   "georged", 
   "Ah. Your post intigued me so I looked into the issue a bit more closely. Apparantly mobile phone ownership is much more widespread in Europe than in the US. In 2001 you guys had 44 mobile phone subscritpions per 100 inhabitants. Western european countries landed somewhere between 70-90 subscriptions per 100 inhabitants (Luxemburg rated highest at 97).\n \n More recent figures (2004) showed that EU mobile phone subscriptions have increased to an average of 80 subscriptions per 100 inhabitant. The rate of subscriptions in Luxemburg was around 120 per 100 inhabitants. In Sweden we had 98 subscriptions per 100 inhabitants.\n \n I could`t find any recent figures from the US though...\n\n \n Latest I could find (US) is also from 2004, 66% (66/100). Taiwan is 110%, Hong Kong 106%. Developed Asia and all of Europe are far ahead of the US in cell phone subscription. The big number is China. They add 60 million subscribers a year.\n \n Largest usage group in the US is under 25-years of age, even larger than business users. Land line subscription in the US is dropping only 3.2% yearly, lowest in the world. Hopefully our youth will also assist in moving us forward in other circumstances before our staid conceit sinks us.", 
   {}, 
   97203, 
   null, 
   1110647160.0
  ], 
  [
   97296, 
   null, 
   "Dono", 
   "I am one of those throwbacks that has resisted getting a cell phone (I did get one for my wife). I'm retired after years spent either on the phone or talking face to face all day long. Now if someone wants to talk with me they have to call my home and get past the caller ID. I will probably weaken soon because of advances in the technology. I was impressed last week when my son picked me up and I saw him with a small ear piece giving voice commands to his phone while we drove. I caught myself thinking I'm going to have to get one of those to play with.\n Dono", 
   {}, 
   97251, 
   null, 
   1110662880.0
  ], 
  [
   97316, 
   null, 
   "daewoo", 
   "Personally, I carry two, one for business use, one for personal, so I can turn the busness one off when appropriate (the personal one is always on). \n \n i don't know what I would do without my mobile. It does all the regular phone stuff, has a camer abuilt in (useless function as far as I can tell), and has a built in full function PDA. I get my important Emails there, keep my appointmnet book, etc.... AND, it syncs with my office network anytime I walk through the door. I hear the litle \"bing bong\" and I know that all is right with the world.\n \n Personally, I think that poor rate plan availability is part of what is keeping more widespread use in America. Once we see unlimited usage for a reasonable monthly price, including data access, we will, I think, start seeing cell phones replacing land lines. Until then, that will be the exception, not the norm.", 
   {}, 
   97296, 
   null, 
   1110667800.0
  ], 
  [
   97438, 
   null, 
   "georged", 
   "\n Personally, I think that poor rate plan availability is part of what is keeping more widespread use in America. Once we see unlimited usage for a reasonable monthly price, including data access, we will, I think, start seeing cell phones replacing land lines. Until then, that will be the exception, not the norm.\n\n \n I think it goes deeper than rate plans. In the West there are plans to suit anyone's budget, from $9.95/month limited to $49.95 unlimited. Land lines run $15/mo basic to $60.00 unlimited with all the cell features (call waiting, caller ID, etc.) other than email/text/camera. Only 7% of US cell subscribers with land lines have given up their land lines, effectively doubling telephone costs for those who choose both. Land line costs, due to decreasing subscription, are increasing without a corresponding increase in dropping them and going to cells. I think its mindset that parallels uncertain US economic and policy conditions. People in general, especially middle and senior age groups, fear change more than any other emotional factor. Dumping the kitchen telephone would have the same effect on many as their church or the VFW Hall closing down.", 
   {}, 
   97316, 
   null, 
   1110736500.0
  ], 
  [
   97466, 
   null, 
   "jitobear", 
   "I have gone without the land line and kept the cell phone at needing to save money periods in my life. I have also noticed land line prices going down. I just got digital phone for $40 a month. I can call anywhere in the US (including Hawaii and Alaska) and Canada at no additional charge.", 
   {}, 
   97438, 
   null, 
   1110744480.0
  ], 
  [
   97657, 
   null, 
   "Black Phoenix", 
   "Yea, I have a damn Nextel.....the batteries tend to go quick so you always have to charge it. I never thought it was necessary to own one till I got it, now I don't know where I would be with out it. I'm closer to my friends and family more than ever. It seems so much easier to give my dad/sister/mom a beep anytime rather than picking up the phone and dialing. I sure wouldn't mind the prices going down. I have 500 anytime cellular minutes, unlimited two-way, and free nights(after 9:00)/weekends all for about $47.00/month. Of course I have caller ID and Voicemail for 2 bucks extra. Still that seems like a lot of money compared to some plans that are at $19.99/month. \n \n I do agree with people who think they are annoying. You DON\"T NEED YOUR PHONE IN A RESTAURANT OR MOVIE!!! OK!! IF YOU EVER DO, AND MY DAD IS THERE HE WILL TELL YOU TO SHUT THE :xcensored PHONE :xcensored :xcensored :xcensored :xcensored :xcensored . SO TURN IT OFF MR/MRS HOLLYWOOD. IT ruined my movie and dinner with my family a couple weeks ago.\n \n That's my thoughts...", 
   {}, 
   97466, 
   null, 
   1110819300.0
  ], 
  [
   97773, 
   null, 
   "Tastyfish", 
   "Can't text on a landline like you can on a mobile, biggest thing for me, so much easier than leaving answerphone messages especially as you can do it silently (if in a noisy pub or club, or quite library or lecture). \n \n If it bothers you that much put them on silent (most cinemas here ask you to turn them off before the film starts or occasionally are shielded anyway). As for exams, they take them off you at the start at my Uni", 
   {}, 
   97657, 
   null, 
   1110835740.0
  ], 
  [
   97787, 
   null, 
   "Phantos", 
   "Yeah, my Uni doesn't though (or at least not that I know of). It comes down to the responsibility of owning a cell phone. If you're going to have one, you need to remember when and where to turn it off.", 
   {}, 
   97773, 
   null, 
   1110838020.0
  ], 
  [
   97790, 
   null, 
   "Tastyfish", 
   "Depends if you want to get disqualified in one of your exams...its serious enough and they are so common here they think its best to sak rather than accidently disqualify someone. For most people you just don't realise its there until it rings", 
   {}, 
   97787, 
   null, 
   1110838200.0
  ], 
  [
   97792, 
   null, 
   "georged", 
   "Yeah, my Uni doesn't though (or at least not that I know of). It comes down to the responsibility of owning a cell phone. If you're going to have one, you need to remember when and where to turn it off.\n\n \n You're correct. And most have a vibrating or light feature that allows MDs and other people on call to check the number and excuse themselves to tend anything of an emergency nature. \n \n Most decent restaurants and other public places where they'd be considered a nuisance no longer have to post notices; the sudden silence and people staring at the user normally end the conversation before staff can get there. Public consideration often seems to be consistent with surroundings and peer pressure.", 
   {}, 
   97787, 
   null, 
   1110838740.0
  ], 
  [
   102231, 
   null, 
   "JPSartre12", 
   "You're correct. And most have a vibrating or light feature that allows MDs and other people on call to check the number and excuse themselves to tend anything of an emergency nature. \n \n Most decent restaurants and other public places where they'd be considered a nuisance no longer have to post notices; the sudden silence and people staring at the user normally end the conversation before staff can get there. Public consideration often seems to be consistent with surroundings and peer pressure.\n\n \n I was very reluctant to join the cell phone parade because I just didn't want to be that accessible. Unfortunately, with a change in upper management, one of the first things my new boss did was ask me what kind of cell phone I wanted, miniature or PDA? Since I'm a gadget freak, I opted for a Kyocera 7135. Damn thing eats batteries, gets a lousy signal, but is a great calendar and electronic reminder for appointments and a good calculator. :)", 
   {}, 
   97792, 
   null, 
   1112040180.0
  ], 
  [
   102303, 
   null, 
   "Master_Shake", 
   "I have a cell phone. I got it for my birthday last year as I probably never would have gotten one for myself. I am also a reluctant cell-phone user as they are annoying and I, like JPSarte, do not really want to be that accessible. When I go out to the movies or something, it's because I want to get away from all of that ****. Mostly have it for emergencies and things like that.", 
   {}, 
   102231, 
   null, 
   1112050740.0
  ], 
  [
   104547, 
   null, 
   "DanPla234", 
   "In my opinion, overall cell phones are very useful, whether they are used for an emergency or to get together with aquitances after school or work. That being said, there are definately times to turn it off, such as while driving, at school, or while spending time with anyone other than you. Despite these times, when you are alone maybe watching TV or eating a home-cooked meal, the phone is very useful, and is here to stay", 
   {}, 
   97792, 
   null, 
   1112741760.0
  ], 
  [
   105857, 
   null, 
   "«¤Rãþtõr¤»", 
   "I'm not sure if this has been mentioned:--\n \n In my opinion the reason cell phone usage, here in the U.S., is so far behind is the billing process.\n \n In the U.S a cell phone owner pays for both incoming and outgoing calls. I've been told that we are the only that does that.\n \n Because of this many cell phone owners are reluctant to give out their numbers. They don't want incoming calls, from just anybody, because they have to pay for it.", 
   {}, 
   104547, 
   null, 
   1113111060.0
  ], 
  [
   105890, 
   null, 
   "Eddie", 
   "I'm not sure if this has been mentioned:--\n \n In my opinion the reason cell phone usage, here in the U.S., is so far behind is the billing process.\n \n In the U.S a cell phone owner pays for both incoming and outgoing calls. I've been told that we are the only that does that.\n \n Because of this many cell phone owners are reluctant to give out their numbers. They don't want incoming calls, from just anybody, because they have to pay for it.\n\n \n Yeah, that would explain alot. We only have the same system when outside national borders.", 
   {
    "unicode_changes_made": true
   }, 
   105857, 
   null, 
   1113142140.0
  ], 
  [
   108310, 
   null, 
   "Missouri Mule", 
   "We have two cell phones to ensure we both have one when outside the home. But they are just for emergencies. The reasons that many people don't like them is because of the complicated billing; what with the roaming charges, minutes, etc., etc. It needs to be much easier to understand and the reception needs to get better.\n \n I do believe, however that Bluetooth technology may very well speed their use. If I needed to be in contact immediately outside the office that would certainly be highly desireable.", 
   {}, 
   105890, 
   null, 
   1113785460.0
  ], 
  [
   108509, 
   null, 
   "wilted_laughter", 
   "Nobody I know can figure out how they managed to run their lives before mobile phones. In Irelend, if you don't have a phone, you are a social pariah.\n \n EDIT: The only serious relationship i've had (big teenage years one) began through someone I knew giving someone they knew (who I didn't know) my number, who passed it onto this girl (who I didn't know) who randomly texted me one day. The rest is history. emoticon_love", 
   {}, 
   97792, 
   null, 
   1113827760.0
  ], 
  [
   121091, 
   null, 
   "witzelcheck", 
   "So I'm sitting here overseas, trying to find a service I can use wherever I get deployed to without having to be over 20. Just because back in the States I became addicted to cell phones and I think calling cards are annoying. \n So I eventually got a pay as you go thing. And I LOVE the free incoming call thing. \n As for me. I think they're a plus. I got one as soon as I could afford it. (like my last year of highschool emoticon_frazzled ) \n My dad has his own business because of it.\n But we both know when to TURN THE :xcensored THING OFF!\n If your sitting in a movie and it goes off.. I will hunt you down afterwords and... I'll think of something creative later.", 
   {}, 
   108509, 
   null, 
   1115866020.0
  ], 
  [
   121407, 
   null, 
   "Tastyfish", 
   "So if you call somone on a mobile with a mobile you both pay? Crazy.\n \n Most cinemas here have a thing at the beginning telling you to turn it off. Orange have a really good series of adds that are now shown at the beginning - famous actor making a film pitch and then the orange film board ruining it by trying to get their phones in. With the slogan 'don't let a phone ruin your movie'", 
   {}, 
   121091, 
   null, 
   1115916300.0
  ], 
  [
   121522, 
   null, 
   "JPSartre12", 
   "So if you call somone on a mobile with a mobile you both pay? Crazy.\n \n Most cinemas here have a thing at the beginning telling you to turn it off. Orange have a really good series of adds that are now shown at the beginning - famous actor making a film pitch and then the orange film board ruining it by trying to get their phones in. With the slogan 'don't let a phone ruin your movie'\n\n \n The cinemas here have the similar ads prior to the movie. They also include one about talking during the movie. I'm surprised at how rude people are at the theater nowadays. emoticon_mad", 
   {}, 
   121407, 
   null, 
   1115922480.0
  ], 
  [
   121883, 
   null, 
   "witzelcheck", 
   "So if you call somone on a mobile with a mobile you both pay? Crazy.\n \n Most cinemas here have a thing at the beginning telling you to turn it off. Orange have a really good series of adds that are now shown at the beginning - famous actor making a film pitch and then the orange film board ruining it by trying to get their phones in. With the slogan 'don't let a phone ruin your movie'\n\n \n Yes, they have them here. Poeple still somehow manage to ignore them because they're so used to seeing them.\n \n I always have my phone on vibrate, rarely with a ringer on. I just think it's inappropriate to have it on in most places.", 
   {}, 
   121407, 
   null, 
   1115960580.0
  ], 
  [
   146206, 
   null, 
   "amadeus_reborn", 
   "well, i'd like to mention first of all that there is hardly any argument when concerning whether cell phones are needed for the country to run like it does. it's ridiculous to even think they are at all a bad thing. \n \n 1. they are able to be properly disposed of\n 2. they've saved lives in car accidnets and such\n 3. they make more oppertunites for communication, always a plus\n 4. they give thousands of more people more jobs\n 5. the technological and bissness worlds move much faster\n \n the only negitives, and some are just minor and are simply matters of common politeness, are that\n \n 1. they can go off during a lecture, seminar, class, ect.\n 2. they can be stolen (like any other item in the world)\n 3. and that they can be a great annoyance to an individual who just got a new cell phone and has difficulty working it due to lack of IQ or simply too lazy or full of it to read the manual. \n \n like I stated above, there are obviously no grounds for arguement.", 
   {}, 
   121883, 
   null, 
   1121023140.0
  ], 
  [
   292261, 
   null, 
   "Archangel", 
   "I was very reluctant to join the cell phone parade because I just didn't want to be that accessible. Unfortunately, with a change in upper management, one of the first things my new boss did was ask me what kind of cell phone I wanted, miniature or PDA? Since I'm a gadget freak, I opted for a Kyocera 7135. Damn thing eats batteries, gets a lousy signal, but is a great calendar and electronic reminder for appointments and a good calculator. :)\n\n \n I just recently bought the new RED Blackberry Curve at my daughters recommendation and it is an incredible machine. I have two e-mail addresses so I can access them both from the curve. And it has a browser too for general internet access from anywhere plus GPS and push to talk so I can communicate with anyone with AT&T service like a walkie talkie. I even turned it on just to check it while flying between Puerto Rico and St Thomas in the Caribbean while at altitude and it was fully functional with a strong signal, I was flabbergasted by that. It has more features than I need right now but that is better than wanting to do something it's incapable of doing. It will even act as a modem for my laptop so I can access the internet from anywhere on the laptop using the curves broadband capabilities. I constantly marvel at this technology and what it can do. Just click on the curve for all of its capabilities once you access the link. Has anyone else gotten into these new types of machines yet? \n \n http://www.google.com/pagead/iclk?sa=l&ai=BNNLrzBpSR4v7JIG-eoWbsaYK_ZLnM4miqtoE8uu5BvDIIQgAEAEYASC5VDAAOAFQpejEf2DJ7tmKsKTsD6ABy7ms-QOqAQllbittKzJHTUzIAQHIApX8kAPZA1wQWjXtUrHR4AMI&adurl=http://www.blackberry.com/select/yourchoice/%3FCPID%3DKNC-SMD_MultiDevice%26HBX_PK%3Drimggl113826s%26HBX_OU%3D50", 
   {}, 
   102231, 
   null, 
   1196572620.0
  ], 
  [
   292516, 
   null, 
   "Jenny_", 
   "I just can't think how people can live without a cell phone!\n \n I am surprised to read that in the US you are charged for incoming calls as well!\n That is robbery!\n From what I have read in this site billing there must be kind of... well, I don't know. Aren't there any offers like 90$ per month and for this price you get 9 hours of calls and this number of text messages? That's how it is here (Greece is where here is). 9 hours of outgoing calls of course! (don't pay attention to the numbers, it is just an example).\n \n We can also send a text message on a landline number but this is something relatively new.\n \n Annoying?... I just turn it off when I consider it is not the right time to talk on the phone.\n As for cinemas etc... well, it's not the cell phones that are rude but those who have them on while watching a movie or attending a concert etc etc etc.\n \n But what I like most on cell phones is that it is always much easier to change your number! You can do it either by having a new contract or just keeping the one you have and paying a small fee in order to get a new number.", 
   {
    "unicode_changes_made": true
   }, 
   292261, 
   null, 
   1196766840.0
  ], 
  [
   292636, 
   null, 
   "Archangel", 
   "I don't know what you have heard about the States, but for 90.00 a month I get 15 hours of call time, unlimited Internet access, 1500 text messages, free nights and weekends, free mobile to mobile with all AT&T users, and rollover minutes that accumulate for a year after they rollover. So whatever time I don't use this month adds on to my next months usage. Which is the least they can do since we pay for all the minutes each month. \n \n With my last cell provider I went years without using half of my monthly minutes allowed, and then on one busy month I went over by about 40 minutes and my bill was an extra 20 dollars. On principle alone it was infuriating.\n \n Tell me this though Jenny, why would you want to change your number regularly, I have more than a hundred friends, family and business people in my Blackberry phonebook I would have to contact if I changed my number. When I just converted to AT&T from T Mobile whom I was with for 9 years, I ported my number so I could keep the same one everyone I know and care about already has. Being able to keep ones number when we change carriers is the greatest capability out there today in my opinion.", 
   {}, 
   292516, 
   null, 
   1196836800.0
  ], 
  [
   292642, 
   null, 
   "Jenny_", 
   "\n Tell me this though Jenny, why would you want to change your number regularly\n\n \n Perhaps it hasn't happened to you... I can't tell. But there are some people who have great difficulty understanding a simple phrase: 'Do not contact me anymore'. So, you just change the number and you get rid of them.", 
   {}, 
   292636, 
   null, 
   1196839560.0
  ], 
  [
   292682, 
   null, 
   "Archangel", 
   "Perhaps it hasn't happened to you... I can't tell. But there are some people who have great difficulty understanding a simple phrase: 'Do not contact me anymore'. So, you just change the number and you get rid of them.\n\n \n That has never been an issue for me but if it did I wouldn't give anyone the satisfaction of changing my number because of them. I would warn them that I would change my phone mail message to name them directly to stop harassing me or even call my carrier and ask them to block the number if nothing else worked. Think about that next time rather than inconvenience yourself and everyone that you want to have your number. :)", 
   {}, 
   292642, 
   null, 
   1196873040.0
  ], 
  [
   292844, 
   null, 
   "Jenny_", 
   "Unfortunately we cannot block just one number. All or none is how it goes.", 
   {}, 
   292682, 
   null, 
   1196941740.0
  ], 
  [
   298152, 
   null, 
   "ServantOfChrist", 
   "Unfortunately we cannot block just one number. All or none is how it goes.\n\n \n Really? I can just block one number. weird.", 
   {}, 
   292844, 
   null, 
   1200906660.0
  ], 
  [
   342098, 
   null, 
   "pro-con", 
   "Why do 10 year olds have phones?? its stupid", 
   {}, 
   298152, 
   null, 
   1233109140.0
  ], 
  [
   390854, 
   null, 
   "maueze", 
   "I can`t even recall how I managed to stay in touch with my friends before the cell phones became virtually mandatory. Sure, I agree that they can be annoying at times and in certain situations, but the fact that I even can reach my 85 year old grandpa on his cell phone whenever I want to have a chat or worry about him makes them indespensible.\n\n \n \n \n Yes thats right cellphone is very useful invention but for sometimes.. it's annoying..", 
   {
    "post_info": {
     "post_title": "cellphone"
    }
   }, 
   97192, 
   null, 
   1266398340.0
  ], 
  [
   398451, 
   null, 
   "icey", 
   "Cellphone help us to keep in touch with our loved ones but we should avoid using it inside the church. Have some consideration :P", 
   {}, 
   390854, 
   null, 
   1271459220.0
  ], 
  [
   426285, 
   null, 
   "Hecter", 
   "Like many other things, It can be either good or bad..... personally i am against it due to misuse... I think it can do more harm than good....So, Use phone at needy time...!", 
   {}, 
   97792, 
   null, 
   1300799400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Cell Phones", 
  "url": "http://www.4forums.com/political/cell-phones/4507-cell-phones.html", 
  "breadcrumbs": [
   "Cell phones"
  ], 
  "id_number": 4507, 
  "discussion_files": [
   [
    "31068.html", 
    "http://www.4forums.com/political/cell-phones/4507-cell-phones-print.html"
   ], 
   [
    "31069.html", 
    "http://www.4forums.com/political/cell-phones/4507-cell-phones-3-print.html"
   ], 
   [
    "31070.html", 
    "http://www.4forums.com/political/cell-phones/4507-cell-phones-2-print.html"
   ]
  ], 
  "identifier": 4507
 }
]