[
 [
  [
   97218, 
   null, 
   "greg 79 f150", 
   "an atheist for president, how would/could that fact in itself, change the infrastructure of our nation ? Seeing our country now has the majority in deeply rooted religous voters , could it ever happen in the next say, 20 years ?", 
   {
    "post_info": {
     "post_title": "If we were ever to elect"
    }
   }, 
   null, 
   null, 
   1110602460.0
  ], 
  [
   97234, 
   null, 
   "jitobear", 
   "I have quite frankly never considered a candidate's religion or lack there of in deciding who to vote for, I can't imagine that I would, I look at the record and his or her stand on the issues. End of story.", 
   {}, 
   97218, 
   null, 
   1110615780.0
  ], 
  [
   97282, 
   null, 
   "billsco", 
   "Imagine a presidential candidate uttering this on the campaign trail:\n \n \"And the day will come, when the mystical generation of Jesus, by the Supreme Being as His Father, in the womb of a virgin, will be classed with the fable of the generation of Minerva, in the brain of Jupiter.\" \n \n Yet Thomas Jefferson was able to say that 200 years ago. It just demonstrates how activist the Christians have been in wresting control of this country since its founding, while simultaneously complaining how activist non-Christians have become. How many times have we heard the religious proclaim, \"We need to take back our country!\" Take back, indeed. If they only knew.\n \n And I really see no relief, save a scientific breakthrough or discovery which sets a critical mass in this country to once again lay the tired, sick, old man known as organized religion back on his deathbed. Meanwhile, our selection of presidential candidates (and politicians) will remain ashamedly limited. \n \n What an atheist could offer is a tantalizing question, and nothing to fear, IMO. Rather, he or she could bring a refreshing new angle to the Israeli-Palestinian conflict, for instance. Who would you rather have fingering the nuclear button, an atheist who fully understands the consequences and ramifications, or one who believes the events unfolding are all fore-ordained, and by pushing the button will allow Jesus to finally return?", 
   {}, 
   97234, 
   null, 
   1110659520.0
  ], 
  [
   97299, 
   null, 
   "georged", 
   "\n What an atheist could offer is a tantalizing question, and nothing to fear, IMO. Rather, he or she could bring a refreshing new angle to the Israeli-Palestinian conflict, for instance. Who would you rather have fingering the nuclear button, an atheist who fully understands the consequences and ramifications, or one who believes the events unfolding are all fore-ordained, and by pushing the button will allow Jesus to finally return?\n\n \n Especially since neither Muslim or Jew believes in Jesus. \n \n The problem with putting in an atheist now is providing a carrot and stick to rule middle (what's left) and lower class America. They're so Pavlovian trained that without their mythology they might have to think for themselves and discover how badly their government has screwed them over.", 
   {}, 
   97282, 
   null, 
   1110663480.0
  ], 
  [
   97328, 
   null, 
   "Mach", 
   "I guarantee you that there have been atheist presidents, and being atheist, and therefore probably of above average intellect (!!!), they weren't dumb enough to not hide it.\n \n Every read Machievalli? The guidebook to western philosophy and he openly advocates, rightfully so, tell the people what you need to in order to remain in power and be popular, it need not have any bearing on what you truly think or do.\n =========\n \n Secondly, I doubt it would change a thing. Our government is secular, having a non-mythology believing president carries no inherently negative implication that I can imagine, and in fact only carries positive implications. Namely that they observe reality. My survival depends on observing, and reacting to, reality.\n \n -Mach", 
   {}, 
   97218, 
   null, 
   1110674700.0
  ], 
  [
   97355, 
   null, 
   "zachvac", 
   "The problem is, people care more about personality and image than policy. People voted for Bush because they thought he was more appealing and closer to the average person. I was listening to the radio one day and they said \"Well Bush has got Laura Bush, who's a lot better than that Theresa Kerry's got.\" That's a horrible way to decide the president, but sadly all that matters these days is image. At first I thought what Mach pointed out made sense (there probably has been an atheist president, he just didn't admit it) but I'm not thinking he'd continue practicing religion once elected, or re-elected.\n \n It's pretty sad that every president has been a white, Christian, male in recent history. All that has mattered is image.", 
   {}, 
   97328, 
   null, 
   1110680820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  If we were ever to elect", 
  "url": "http://www.4forums.com/political/politics-debates/4509-if-we-were-ever-elect.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4509, 
  "discussion_files": [
   [
    "32073.html", 
    "http://www.4forums.com/political/politics-debates/4509-if-we-were-ever-elect-print.html"
   ]
  ], 
  "identifier": 4509
 }
]