[
 [
  [
   97447, 
   null, 
   "pandion", 
   "In the thread \"Are You a Secular Humanist?\" here in the Religion Forum, one of the questions was \"Do you support the posting of the Ten Commandments in courthouses?\" BlackPhoenix responded,\n \nYes since those were the foundation of most laws we have today. Any idiot that actually knows their history should know that.\nBlackPhoenix was asked which set of 10 Commandments he was refering to by more than one poster on more than one occasion. He failed to respond. I have actually made a point to study the history of the Revolutionary period as well as the period of the writing of the Constitution, so I was quite surprised to find out that I am an idiot who doesn't know history. You see, I just can't see how the 10 Commandments are the foundation of most laws we have today. For example, in my city there is a law that makes it illegal to drive through an intersection when the light is red. There is a law that requires all vehicles to come to a complete stop at intersections when they are faced with a red, octagonal sign with the word \"STOP\" on it. I just don't see how any set of 10 commandments could have included any requirement on which such laws are based.\n \n So I decided to research the matter since I didn't wish to remain an idiot. I searched the Bible (aren't computers great!) for the mention of the 10 Commandments. There are three (@Exd 34:28, Deu 4:13, and Deu 10:4). The second two are merely references to the story from Exodus that ends with the reference to the ten commandments. The actual ten commandments are listed at Exd 34:12-26.\n \n Here is an edited version with extraneous remarks about the slaughter of various civilizations that got in the way, removed. The text presented is merely a cut and paste from the KJV.\n \nExd 34:12-26\n \n I. For thou shalt worship no other god: for the LORD, whose name [is] Jealous, [is] a jealous God:\n \n II. Thou shalt make thee no molten gods.\n \n III. The feast of unleavened bread shalt thou keep.\n \n IV. But the firstling of an XXX thou shalt redeem with a lamb: and if thou redeem [him] not, then shalt thou break his neck. All the firstborn of thy sons thou shalt redeem. And none shall appear before me empty.\n \n V. Six days thou shalt work, but on the seventh day thou shalt rest:\n \n VI. And thou shalt observe the feast of weeks, of the firstfruits of wheat harvest, and the feast of ingathering at the year's end.\n \n VII. Thrice in the year shall all your men children appear before the Lord GOD, the God of Israel.\n \n VIII. Thou shalt not offer the blood of my sacrifice with leaven; neither shall the sacrifice of the feast of the passover be left unto the morning.\n \n IX. The first of the firstfruits of thy land thou shalt bring unto the house of the LORD thy God.\n \n X. Thou shalt not seethe a kid in his mother's milk.\nNow I know that these are the ten commandments because the Bible says that they are. These are the ones carved on the stone tablets that Moses brought down from the mountain. Here is what the Bible says:\n \nExd 34:27 And the LORD said unto Moses, Write thou these words: for after the tenor of these words I have made a covenant with thee and with Israel.\n Exd 34:28 And he was there with the LORD forty days and forty nights; he did neither eat bread, nor drink water. And he wrote upon the tables the words of the covenant, the ten commandments.\nI am certainly puzzled as to how these commandments could be the foundation of our laws. My son is an attorney who has studied criminal law, Constitutional law, patent law, copyright law, and he tells me that the 10 Commandments aren't covered in law school. Nor were they covered on the bar exam.\n \n And please don't be so obtuse as to tell me that you mean the other 10 commandments, the ones from Judge Roy Moore's monumental erection in the rotunda of the Alabama Supreme Court. Those are not identified as the 10 Commandments in the Bible. And don't tell me that you mean the ones from the Movie, \"The Ten Commandments\". Cecil B. DeMille was not God and Charleton Heston isn't Moses. Their version isn't the 10 commandments identified by the Bible as such. They may be in the Bible, but only the list that I have given are identified as such and are part of the story of the tablets of stone that Moses brought down from the mountain. However, I am willing to concede that the 10 commandments from the Bible that I have given are the ones represented by the 10 Roman numerals in the frieze from the Supreme Court - you know the one, where Moses is represented as one figure among 17 other \"law givers.\"\n \n So I would request that Black Phoenix (or any christian who agrees with him) explain how most of our laws today are based on these commandments. Please give several examples of laws that are binding on all citizens that are based on each of these commandments, please. This shouldn't be a problem since most of our laws are based on these 10 commandments.\n \n And I would also like to understand the rational of such people as Judge Roy Moore who carved some other commandments on his monumental erection in the rotunda of the Alabama Supreme Court and then had the gall to call them the 10 commandments. Apparently Judge Moore hasn't ever actually read the Bible.\n \n Thanks.", 
   {
    "post_info": {
     "post_title": "The 10 Commandments and our laws"
    }
   }, 
   null, 
   null, 
   1110739980.0
  ], 
  [
   97539, 
   null, 
   "Steeeeve", 
   "Good post...I haven't really made up my mind about whether or not the 10 commandments should be posted or not but I do have a few things to say...\n \n the 10 commandments were in fact laws of the land back in the day, so in that sense they might be viewed as one of the first lays written down or something. Kind of like a Ford model T was one of the first cars so it is a symbol for cars...the 10 commandments were some of the first laws so they are a symbol for laws. I don't know if this logic is any good yet but it is something I thought of.\n \n Another thing, Seperation of Church and State is no where in the Constitution. You may say \"well what about where it says 'congress shall make no law establishing a religion'\" Well It does say that. What does establish mean? you could say they meant Congress can not establish a religion to be the one we follow by...such as Baptist or something. Or you could look at establish like the Congress can not make a religion....like how England created the \"church of England\". If the second one is true...you can conlude that putting the 10 commandments up is not \"establishing\" anything but merely posting something from one religion.\n \n Just something to think about I guess....I really should research this topic more", 
   {}, 
   97447, 
   null, 
   1110776520.0
  ], 
  [
   97564, 
   null, 
   "pandion", 
   "Good post...\n\n Thanks.\n \nI haven't really made up my mind about whether or not the 10 commandments should be posted or not but I do have a few things to say...\n\n Well, I have made up my mind. But nevertheless, the same Amendment to the Constitution that is violated by the posting of the 10 commandments in public buildings supports your right to express your opinions. It does not protect you from criticism but it does absolutely protect your right to speak your mind (short of slander or liable). It says, \"Congress shall make no law...abridging the freedom of speech...\"\n \nthe 10 commandments were in fact laws of the land back in the day, so in that sense they might be viewed as one of the first lays written down or something.\n\n The 10 commandments were not ever the \"laws of the land.\" They were among the hundreds of commandments that can be found in the Old Testament. They were laws of the Hebrew people. I listed the 10 commandments that are named in the Bible as such. The commandments that Judge Moore caused to be engraved on his monumental erection in the rotunda of the Alabama Supreme Court are other commandments that can be found in the Old Testament. There are hundreds of \"commandments\". In fact, in Mat 22:37-39 we find Jesus' opinion of the greatest commandments. \"Jesus said unto him, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind. This is the first and great commandment. And the second [is] like unto it, Thou shalt love thy neighbour as thyself.\"\n \n And, of course, the 10 commandments weren't the first laws (I presume that is what you were trying to say) that were written down. I think that if you investigate you will find that there were other civilizations the existed long before the 10 commandments that had codified laws.\n \nKind of like a Ford model T was one of the first cars so it is a symbol for cars...the 10 commandments were some of the first laws so they are a symbol for laws. I don't know if this logic is any good yet but it is something I thought of.\n\n Well, the thought isn't all that bad, except for the claim that they are the \"first laws.\" They have been used as a symbol of laws. In fact, I have discussed the fact that Moses is depicted on a frieze at the Supreme Court building among 17 other lawgivers, most of which are not christians.\n \nAnother thing, Seperation of Church and State is no where in the Constitution. You may say \"well what about where it says 'congress shall make no law establishing a religion'\" Well It does say that.\n\n Actually, it doesn't say that. What it does say is this: \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof;\" The first draft of the Bill of Rights was written by James Madison. The final version is significantly different from the first draft - in fact, it is stronger in the statement of religious freedom. There are two clauses - the Establishment Clause, and the Free Exercise Clause. The first prohibits government from endorsing or supporting religion, not only a single religious sect, but all religion. The second prohibits the government from outlawing or seriously burdening a person's right to worship (or not) as he chooses.\n \nWhat does establish mean?\n\n The word is \"establishment.\"\n \nyou could say they meant Congress can not establish a religion to be the one we follow by...such as Baptist or something.\n\n Yes. That is what it means.\n \nOr you could look at establish like the Congress can not make a religion....like how England created the \"church of England\".\n\n Right. It means that too. It means that our government may neither endorse nor support religion.\n \nIf the second one is true...you can conlude that putting the 10 commandments up is not \"establishing\" anything but merely posting something from one religion.\n\n Right. And posting something from one religion is establishing that religion. It is an endorsement and support for that religion. By the way, which 10 commandments should be posted?\n \nJust something to think about I guess....I really should research this topic more\n\n Yes, you should.", 
   {}, 
   97539, 
   null, 
   1110784380.0
  ], 
  [
   97985, 
   null, 
   "Steeeeve", 
   "thanks man...You helped out in answering some of the questions. The example with the Ford Model T was to say it is not the first car..but kind of the symbol for cars...like the 10 commandments seems to be a symbol for laws.\n I have a few things you could maybe clear up for me if you could...\n Also how do we know they meant both meanings of establishment?\n \n Congress shall make no law respecting an establishment of religion\n ---couldnt this mean congress will make no law interferring with the establishment of a religion?\n \n I am trying to find out what the constitution actually says and what they meant when the wrote it if you couldnt guess :p these things are important in making decisions to me\n \n Thanks!", 
   {}, 
   97564, 
   null, 
   1110861780.0
  ], 
  [
   97998, 
   null, 
   "Steeeeve", 
   "On February 25, 2004, the Supreme Court ruled in Locke v. Davey that Washington State is permitted to withhold state college scholarship funds to students studying devotional theology. The case centers on Joshua Davey, a student awarded a state-sponsored college scholarship based upon academic merit and financial need. After enrolling in school, Davey was notified that he was no longer eligible to receive his scholarship because he had chosen to major in theology. The state argued that the exclusion of theology studies from its college scholarship program was mandated by the state constitution, which prohibits public money from being used to provide any religious instruction or support any religious establishment. Davey argued that exempting theology majors from the scholarship program violated his constitutional right to freely exercise his religion.\n \n In a 7-2 decision, the Court held that the state of Washington is free to interpret its constitution's anti-establishment clause to preclude funding of religious training in a general scholarship program, and that such exclusion does not run afoul of the First Amendment's Free Exercise clause. The Court noted that many states have similar anti-establishment provisions in their state constitutions and that such provisions permit, but do not require, states to exclude religious studies from state-funded educational programs.\n \n \n ------\n \n This seems a bit odd....and not even related :p", 
   {
    "post_info": {
     "post_title": "interesting court case..."
    }, 
    "unicode_changes_made": true
   }, 
   97985, 
   null, 
   1110862560.0
  ], 
  [
   98080, 
   null, 
   "pandion", 
   "The example with the Ford Model T was to say it is not the first car..but kind of the symbol for cars...like the 10 commandments seems to be a symbol for laws.\n\n OH. Right. Your point was obvious so I don't know why I missed it. In fact, they are used that way. The depiction of Moses with the tablets in the Supreme Court (and the depiction of the tablets with the Roman numerals on the doors of the Supreme Court chamber for that matter) are just that, symbols of law. But the monument in Alabama was more than that.\n \nAlso how do we know they meant both meanings of establishment?\n\n Because they are actually the same. What is literally stated is that Congress cannot establish a state religion, whether that is to make an already existing religion the state religion, or to invent one. The Establishment Clause has been interpreted by the Supreme Court (that is the job of the Supreme Court - to decide questions of the meaning of the Constitution) to mean that the government may not endorse or support religion. Not only is it prohibited from endorsing a particular religion, but neither may government support or endorse religion in general.\n \nCongress shall make no law respecting an establishment of religion\n ---couldnt this mean congress will make no law interferring with the establishment of a religion?\n\n No. That's the Free Exercise Clause which prevents the government from outlawing or burdening a person's pursuit of religion. This clause says that the government may not decide how anyone is to practice their religion or whether they are to practice religion.\n \nI am trying to find out what the constitution actually says and what they meant when the wrote it if you couldnt guess these things are important in making decisions to me\n\n At the time that the Constitution was written, many of the states had an official state religion (Rhode Island never did and Virginia had disestablished theirs in 1796). They were mostly Congregationalist (Puritan) in the north and Anglican (Episcopalean) in the south. But there was still some considerable religious diversity everywhere. Much of the opposition to the Constitution came from those who were horrified at the prospect of a non-Protestant holding office. The equality of all men proclaimed in the Declaration of Independence didn't extend as far as Quakers, Catholics, or Jews for many Protestants.", 
   {}, 
   97998, 
   null, 
   1110871140.0
  ], 
  [
   98084, 
   null, 
   "pandion", 
   "In re: Locke v. Davey (000 U.S. 02-1315 (2004))\n \n Interesting that Rehnquist didn't vote with Scalia and Thomas as he usually did in matters of religion. But this case has some state's rights aspects. Since the law in question did not interfere with the plaintif's right to practice his religion freely, it was not a violation of the Free Exercise Clause. Further, the Washington Constitution's prohibition against using the scholarship money to earn degrees in theology did not favor one religion over another. It applied equally to students of all religions. None were allowed to use the money in pursuit of theology degrees. The Court held that it is the right of the state to place such limits on the use of scholarship money.", 
   {}, 
   98080, 
   null, 
   1110871680.0
  ], 
  [
   98113, 
   null, 
   "Steeeeve", 
   "I agree...but it does seem kinda lame...I mean the state did offer the courses and major....but then say if you take them we cant give you money...doesnt seem fair :(", 
   {}, 
   98084, 
   null, 
   1110875040.0
  ], 
  [
   98117, 
   null, 
   "pandion", 
   "I mean the state did offer the courses and major\n\n No. You misunderstand. The scholarship is offered to a well defined segment of students who graduate from high schools in the state of Washington. The money may be used to attend any institution of higher learning in the state, even schools with a religious affiliation, and it may be used to study any field - with the exception of theology. The state does not offer the courses or degrees. A student could attend Gonzaga and study electrical engineering or the University of Washington and study English. But the money can't be used to study to be a Baptist minister or any other denomination.", 
   {}, 
   98113, 
   null, 
   1110877860.0
  ], 
  [
   98119, 
   null, 
   "BobNelson2", 
   "Kind of like a Ford model T was one of the first cars so it is a symbol for cars...the 10 commandments were some of the first laws so they are a symbol for laws. \n\n \n Actually, they weren't among the first laws, unless you allow for a very long period of \"firsts\". Moses came along in 1490 BC, almost a thousand years after the first legal codes and five hundred years after the oldest written legal codes we have found.\n \n A THOUSAND YEARS\n \n FIVE HUNDRED YEARS\n \n hardly seems like \"first\" to me...\n \n \n http://www.didyouknow.cd/history/bc.htm", 
   {}, 
   97539, 
   null, 
   1110879240.0
  ], 
  [
   98161, 
   null, 
   "trs", 
   "Actually, they weren't among the first laws, unless you allow for a very long period of \"firsts\". Moses came along in 1490 BC, almost a thousand years after the first legal codes and five hundred years after the oldest written legal codes we have found. ...\n \n http://www.didyouknow.cd/history/bc.htm\nInteresting cite reference. Taken together we learn:[*]1490 BC Moses came along ... [from above quote][*]1446 BC The Pentateuch ... are written .... [from referenced cite][*]1300 BC Moses received The Ten Commandments ... [from referenced cite][*]1250 BC Israelite exodus from Egypt ...[from referenced cite]There's something about all this that just doesn't feel right. :)", 
   {}, 
   98119, 
   null, 
   1110905580.0
  ], 
  [
   98183, 
   null, 
   "Steeeeve", 
   "Model T was far from the first car but people seem to see it along the lines of first car....10 commandments, for most, are the farthest back they can go :)\n \n As for the case...are you sure? As I read it, he attended Washington State which is not a private school. He was given money to attend this school. After getting there he choose the major of Theology....They then took his money away. WSU does have that major....www.wsu.edu :)", 
   {}, 
   98161, 
   null, 
   1110908700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The 10 Commandments and our laws", 
  "url": "http://www.4forums.com/political/religion-debates/4519-10-commandments-our-laws.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4519, 
  "discussion_files": [
   [
    "14051.html", 
    "http://www.4forums.com/political/religion-debates/4519-10-commandments-our-laws-print.html"
   ]
  ], 
  "identifier": 4519
 }
]