[
 [
  [
   97450, 
   null, 
   "simone", 
   "In my historical view of Iraq--please note that I am not anything near an expert on history--I was extremely annoyed that George Herbert Walker Bush did not take out Saddam Hussein back in 1991 or so, but, SIGH! it turns out historically that the elevation of Saddam Hussein to his position of power in Iraq was intrinsically linked with various power plays in the Middle East by our CIA and other operatives so it might have been a tad embarrassing for George HW Bush to pursue such a course.\n \n In the meantime, it seemed that Saddam Hussein was more or less contained by the various international sanctions upon him--ruinous as these sanctions were to the average citizen family and children of that nation. Nevertheless, I sort of wanted to see him removed but--BY ANY BODY BUT GEORGE W. BUSH WHO WOULDN'T KNOW DIDDLY SQUAT ABOUT PURSUING A WAR!!!!!\n \n And, time after time after time after time my fears and concerns have proven to be absolutely right on the mark in regard to George W. Bush. Honest to God! I think that George W. Bush is handing my country right over to our enemies!\n \n The latest--and it is even worse than even I, an inveterate hater of George W. Bush and his kind, could have possibly imagined--is the new discovery that in the days after the fall of Baghdad in April, 2003, there was a carefully orchestrated raiding of various nuclear installations in Iraq (which installations had the potential for weaponry manufacture but were kept idle by international sanctions) which yielded an enormous potential for weaponry manufacture by our newly created enemies (those spawned by Bush's invasion of Iraq and the uncurbed energies of Al-Qaeda in forming new units of insurgent hatred against my country) who merrily made off with them to places and intent quite unknown because the grossly incompetent George W. Bush (remember I said \"GEORGE W. BUSH WHO WOULDN'T KNOW DIDDLY SQUAT ABOUT PURSUING A WAR!!!) failed to listen to his military advisors and provide man and woman-power for the pacification and policing and protection of Iraq after invading it.\n \n Remember--and be warned--if you are going to invade a country be G*D D*MNED SURE YOU PROVIDE MILITARY PERSONNEL FOR PACIFYING SAID COUNTRY AFTER YOU INVADE IT--OTHERWISE YOU ARE A GOD AWFULLY STUPID NUMBSKULL TWIT WHO SHOULD BE HANGED AND QUARTERED AT DAWN!", 
   {
    "post_info": {
     "post_title": "Iraq and George W. Bush"
    }
   }, 
   null, 
   null, 
   1110740940.0
  ], 
  [
   97452, 
   null, 
   "simone", 
   "Oh yeah! Let me also provide a link to illustrate the source of my ire:\n \n http://www.nytimes.com/2005/03/13/international/middleeast/13loot.html?th\n \n Looting at Iraqi Weapons Plants Was Systematic, Official Says\n \n By JAMES GLANZ and WILLIAM J. BROAD \n Published: March 13, 2005", 
   {}, 
   97450, 
   null, 
   1110741120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Iraq and George W. Bush", 
  "url": "http://www.4forums.com/political/politics-debates/4520-iraq-george-w-bush.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4520, 
  "discussion_files": [
   [
    "22143.html", 
    "http://www.4forums.com/political/politics-debates/4520-iraq-george-w-bush-print.html"
   ]
  ], 
  "identifier": 4520
 }
]