[
 [
  [
   97472, 
   null, 
   "fishpower", 
   "I'm curious how the world moving towards a single currency is indicative of the End Times. I understand it's in a Bible passage somewhere (I'm ignorant in such matters) so maybe someone can point it out to me and help me understand why it's evil.", 
   {
    "post_info": {
     "post_title": "World Currency"
    }
   }, 
   null, 
   null, 
   1110746520.0
  ], 
  [
   97485, 
   null, 
   "Duo_Maxwell", 
   "fishpower, you should know that anything is the sign of the end times to the truly delusional.", 
   {}, 
   97472, 
   null, 
   1110751620.0
  ], 
  [
   97486, 
   null, 
   "Eddie", 
   "Well, it may be evil even though it doesn`t signal the end times. I mean, if we where all to have the same currency there would be some really daunting economic implications when we experience local or regional demand or suply shocks for example.", 
   {}, 
   97485, 
   null, 
   1110752700.0
  ], 
  [
   97490, 
   null, 
   "fishpower", 
   "Well, it may be evil even though it doesn`t signal the end times. I mean, if we where all to have the same currency there would be some really daunting economic implications when we experience local or regional demand or suply shocks for example.\n\n \n That's certainly an interesting point. I know next to nothing about global economics, so I won't try to argue here. But I will make a guess that such a thing will never happen as long as we're still a superpower and cling to our beloved dollar. Probably we'll devolve into just four or five major currencies in the next 50 or so years and leave it at that for a long while.\n \n But to stay on topic, I'm just wondering why such a thing was brought up as a Sign of The End. Why would it seem evil to someone living back then? It's an oft-quoted religious statistic that always leaves me scratching my head.", 
   {}, 
   97486, 
   null, 
   1110753480.0
  ], 
  [
   97492, 
   null, 
   "Eddie", 
   "That's certainly an interesting point. I know next to nothing about global economics, so I won't try to argue here. But I will make a guess that such a thing will never happen as long as we're still a superpower and cling to our beloved dollar. Probably we'll devolve into just four or five major currencies in the next 50 or so years and leave it at that for a long while.\n\n \n Actually I would say you would have less to loose with having a common currency with the world as long as you are an economic super-power. At least your financial situation would be taken seriously by the world bank. It would be far more damaging for a small country qith virtually no significance for the global economy. But either way, I wouldn`t recomend it to anyone, regardless off economic power.\n \n \nBut to stay on topic, I'm just wondering why such a thing was brought up as a Sign of The End. Why would it seem evil to someone living back then? It's an oft-quoted religious statistic that always leaves me scratching my head.\n\n \n No idea really. I haven`t even read the bible. Perhaps it has something to do with all that number of the beast, cashless society thingie that would herald anti-christ?\n \n Oh, and as for why people back then might have considered it evil.. No idea at all. Perhaps it had something to with the idea that the world would then be controlled by \"evil\" jewish bankers... oh wait, that was the idea of the national socialists emoticon_xclown", 
   {}, 
   97490, 
   null, 
   1110754140.0
  ], 
  [
   97502, 
   null, 
   "georged", 
   "Well, it may be evil even though it doesn`t signal the end times. I mean, if we where all to have the same currency there would be some really daunting economic implications when we experience local or regional demand or suply shocks for example.\n\n \n Going back to gold or another standard backing currencies could prove interesting. Especially in those countries with disproportionate debt.", 
   {}, 
   97486, 
   null, 
   1110758400.0
  ], 
  [
   97633, 
   null, 
   "Eddie", 
   "Going back to gold or another standard backing currencies could prove interesting. Especially in those countries with disproportionate debt.\n\n \n I`m not really a fan of monetary standards to be honest. I haven`t really seen the benefits of having one, but I can see the clear risks of implementing one. Now granted, it could perhaps put a disincentive on governments to accumulate large debts and then pursue a polycie of higher inflation in order to deflate the debts, but I would in that case advocate some form of constitutional arrangement securing the fiscal ballance over a financial cycle. It`s not impossible, and would peobably be easier to convince both the public and the politicians to adopt rather than going back to the gold standard (or rather equivalent).", 
   {}, 
   97502, 
   null, 
   1110816120.0
  ], 
  [
   97655, 
   null, 
   "Black Phoenix", 
   "The idea of a global currency isn't evil, it is just a sign of the end. It shows how the world is coming together and how much easier it would be for one person, in my opinion the Anti-Christ, to take over the whole world as it is stated in the Bible. This would be a means of control and a lot of power for whoever is on top. The Bible makes a reference of the Mark of The Beast, which is 666 that is required of all people on earth that are left behind/still here. It is believed that you will need this mark to buy or sell and pretty much do anything that has to do with money. So the concept isn't evil it's just what it foreshadows.", 
   {}, 
   97633, 
   null, 
   1110818760.0
  ], 
  [
   97660, 
   null, 
   "georged", 
   "I`m not really a fan of monetary standards to be honest. I haven`t really seen the benefits of having one, but I can see the clear risks of implementing one. Now granted, it could perhaps put a disincentive on governments to accumulate large debts and then pursue a polycie of higher inflation in order to deflate the debts, but I would in that case advocate some form of constitutional arrangement securing the fiscal ballance over a financial cycle. It`s not impossible, and would peobably be easier to convince both the public and the politicians to adopt rather than going back to the gold standard (or rather equivalent).\n\n \n We've always had a standard in one form or another, be it beads, gold, the USD for a period, Swiss Franc, trade guarantees, etc., all dictated by economic strength of the issue. I can't recall past ratios when gold was a world standard (not primary exchange), but 5% of outstanding national currency issues as a reserve seems familiar. The current trend seems to be leaning more towards stability of grouped individual currencies, shedding or adding on economic fluctuations, with most nations not politically tied to any one currency holding the most stable as reserves. \n \n The USD/Euro is, IMO, an excellent example of the trend to mixed basket reserves. While a good part of the swing to Euros is due to US fiscal irresponsibility and deceptive financial reporting (no secret to anyone other than general populations), the fact that EU countries are demanding and receiving 'honest' financial reporting from those members participating in the Euro (Greece as an example) says much about trade balance still being the world standard regardless of what's used as an exchange. Technology has eliminated currency and trade float and we're seemingly headed back in a direction of a world currency or three dictated by current financial reporting based on commodity exchange rather than political influence.", 
   {}, 
   97633, 
   null, 
   1110819720.0
  ], 
  [
   97678, 
   null, 
   "fishpower", 
   "The idea of a global currency isn't evil, it is just a sign of the end. It shows how the world is coming together and how much easier it would be for one person, in my opinion the Anti-Christ, to take over the whole world as it is stated in the Bible. This would be a means of control and a lot of power for whoever is on top.\n\n \n This isn't very fair, it seems. I would think the world coming together would be a good thing. Besides, is that really much different than the way things are now? If you want to talk about an evil person with the power to affect remote parts of the globe do we have look any farther than our own president? If you look at it this way, how do we know \"W\" isn't the anti-Christ? He certainly seems bent on bringing the world together to meet his own ends. ;)\n \n \nThe Bible makes a reference of the Mark of The Beast, which is 666 that is required of all people on earth that are left behind/still here. It is believed that you will need this mark to buy or sell and pretty much do anything that has to do with money. So the concept isn't evil it's just what it foreshadows.\n\n \n I already have a 16-digit number which I use to buy pretty much everything. Going down to a 3-digit number might make things easier. I take it when you mention everyone \"left behind\" you are referring to the Rapture, which makes me think of another question: us Heathens haven't accepted God because there is no proof, but if all the world's Christians suddenly got sucked up into the sky, that would be proof and we would be forced to change our beliefs. So would it still be too late for us?", 
   {}, 
   97655, 
   null, 
   1110821640.0
  ], 
  [
   97692, 
   null, 
   "Eddie", 
   "We've always had a standard in one form or another, be it beads, gold, the USD for a period, Swiss Franc, trade guarantees, etc., all dictated by economic strength of the issue. I can't recall past ratios when gold was a world standard (not primary exchange), but 5% of outstanding national currency issues as a reserve seems familiar. The current trend seems to be leaning more towards stability of grouped individual currencies, shedding or adding on economic fluctuations, with most nations not politically tied to any one currency holding the most stable as reserves.\n \n\n \n Ah sorry. With gold standard I thought you meant some form of \"objective\" (read fixed) value of currency rather than the floating systems we currently have. As for using gold or dollars as a reserve, I can`t really comment as I know to little of the risks involved with either currency/commodity.", 
   {}, 
   97678, 
   null, 
   1110822900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  World Currency", 
  "url": "http://www.4forums.com/political/religion-debates/4521-world-currency.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4521, 
  "discussion_files": [
   [
    "23244.html", 
    "http://www.4forums.com/political/religion-debates/4521-world-currency-print.html"
   ]
  ], 
  "identifier": 4521
 }
]