[
 [
  [
   97848, 
   null, 
   "Duo_Maxwell", 
   "Why? Why not?", 
   {
    "post_info": {
     "post_title": "Do you consider paganism bad?"
    }
   }, 
   null, 
   null, 
   1110844680.0
  ], 
  [
   97853, 
   null, 
   "Master_Shake", 
   "We'll probably need a good definition of paganism before we can answer that appropriately.", 
   {}, 
   97848, 
   null, 
   1110846360.0
  ], 
  [
   97864, 
   null, 
   "Big Orn", 
   "We'll probably need a good definition of paganism before we can answer that appropriately.\n\n I agree.\n \n It may have changed...", 
   {}, 
   97853, 
   null, 
   1110847860.0
  ], 
  [
   97885, 
   null, 
   "Clive14", 
   "Why? Why not?\nIt's no better or worse than any other religion.", 
   {}, 
   97848, 
   null, 
   1110851760.0
  ], 
  [
   97913, 
   null, 
   "Duo_Maxwell", 
   "It's no better or worse than any other religion.\n\n \n Well, I would say it is better then organized because people don't have a tendency of killing people in the name of paganism....\n \n Pagan: an unconverted member of a people or nation that does not acknowledge the God of the Bible.", 
   {}, 
   97885, 
   null, 
   1110855420.0
  ], 
  [
   97925, 
   null, 
   "Easyrider", 
   "Well, I would say it is better then organized because people don't have a tendency of killing people in the name of paganism....\n\n \n Well, the pagans sacrificed their children on pagan altars in the Bible. Not good.\n \n Nazi Paganism\n \n The Nazis defended paganism, both during the early stages, and also when they came to power in 1933. They tore German society away from Christianity, and tried to turn it to pagan beliefs. \n \n A short while after Hitler came to power, Christian holidays and festivals were replaced by pagan ones. 'Mother Earth' or 'Father Sky' were called on at wedding ceremonies. In 1935, Christian prayers in schools were stopped, and then all lessons concerning Christianity were banned. \n \n Schoolchildren were taught the so-called 'Glorious pre-Christian German history,' and various rites and ceremonies, legacies of pagan culture, were held all over Germany. All Nazi meetings were in the form of traditional pagan ceremonies. There was almost no difference between Nazi rallies, held under the shadow of flaming torches, where slogans full of hate and violence were shouted and Wagner's pagan music played, and the perverted ceremonies carried out thousands of years ago at pagan temples and altars. \n \n The Nazis also used the arts to re-awaken paganism. Ancient Greek concepts and symbols began to predominate under Nazi rule, and many statues similar to Greek statues were made, showing strong men and women of the Aryan race. Hitler dreamed that a 'superior race' would be formed by the use of eugenics, and establish a cruel and oppressive 'world kingdom' based on the Spartan model. The expression \n \n 'The Third Reich' is a statement of this dream. And as a result of this dream, 55 million people lost their lives in the Second World War, the bloodiest conflict that had ever been seen. \n \n http://www.islamdenouncesantisemitism.com/thepagan.htm", 
   {}, 
   97913, 
   null, 
   1110856980.0
  ], 
  [
   97928, 
   null, 
   "sinjin", 
   "Modern paganism is reactionary and therefore not bad, just silly.", 
   {}, 
   97925, 
   null, 
   1110857460.0
  ], 
  [
   97929, 
   null, 
   "pandion", 
   "That's great, EZ. Quote a Turkish Muslim who is known to twist the facts. Creationism makes strange bedfellows.", 
   {}, 
   97928, 
   null, 
   1110857640.0
  ], 
  [
   97931, 
   null, 
   "Duo_Maxwell", 
   "Easyrider, yes but Christianity and other orthodox religions are responsible for the death of millions, if not a billion in holy wars and heretical executions. \n As for such a reference, I find it hard to trust what was justified in the name of killing pagans. \n \n Assuming your claim of Nazi paganism is true, it doesn't mean much. Paganism encompasses a literal mountain of people with varying beliefs. \n \n \nMany current Pagans in industrial societies base their beliefs and practices on a connection to Nature, and a divinity within all living things, but this may not hold true for all forms of Paganism, past or present. Some believe that there are many deities, while some believe that the combined subconcious spirit of all living things forms the universal deity. Paganism predates modern monotheism, although its origins are lost in prehistory. Ancient paganism tended in many cases to be a deification of the political process, with \"state divinities\" assigned to various localities (Athena in Athens, for example). Many ancient regimes would claim to be the representative on earth of these gods, and would depend on more or less elaborate bureaucracies of state-supported priests and scribes to lend public support to their claims. This is something it shares with more 'mainstream' religions, as can be seen in the history of the Catholic church, the Church of England and the ancient and current trends in Islam. In one well-established sense, paganism is the belief in any non-monotheistic religion, which would mean that the Pythagoreans of ancient Greece would not be considered pagan in that sense, since they were monotheist, but not in the Abrahamic tradition. In an extreme sense, and like the pejorative sense below, any belief, ritual or pastime not sanctioned by a religion accepted as orthodox by those doing the describing, such as Burning Man, Halloween, or even Christmas, can be described as pagan by the person or people who object to them.\n\n \n http://en.wikipedia.org/wiki/Paganism\n \n Oh boy, you really didn't cite that did you? Seriously, you're only reinforcing the stereotype that religious people cannot debate. \n \n The entire part of Sparta doesn't even talk about paganism. It uses it onces without defining how it applied. In fact, the only link to Sparta and Paganism is that sparta existed before Christanity, and therefore is automatically a pagan society. Seriously, that's one hugely fallacious argument. Under such logic, every pre-christan society is therefore facists because it was paga.\n \n it's people like you who give christians a bad name\n \n The Pharaoh example again doesn't talk about how paganism applied, but merely gives another huge leap of logic that because it was pagan, and facist to a degree, that paganism is the root of facism. \n \n HUGE BIAS ALERT\n \n Christianity carried the basic ethical characteristics of the true religion revealed to man by the Prophet Jesus to European society.\n \n That by itself voids the credbility of the entire article. \n \n IT LIES TOO!\n \n \nRacial and tribal wars disappeared: In the pagan world, all tribes and races saw each other as enemies, and there was constant fighting between them. Each pagan society had its own gods and totems which it invented, and waged war in their name. With the coming of Christianity, there was a single belief, culture, and even language in Europe in general, and the conflict of the pagan world came to an end.\n\n \n No, anyone who knows anything about the dark ages knows that it was constant warfare, between lords, people and errants. The Dark Ages can be categorized by not only lack of scientitifc progression, but a age of constant war between supposively christian empires and lords.\n \n \nPeace and compassion came to be considered sacred, instead of violence: In pagan societies, inflicting bloodshed, suffering and torture was seen as heroic actions that appeased the imaginary 'gods of war.' Under Christianity however, European societies learned that people had to love and have compassion for each other (even for their enemies), and that bloodshed was a great sin in the sight of God.\n\n \n Wrong. The church used torture, bloodshed and suffering to eradicate heretical christians, not to mention used it as a means other then excommunication to get what they wanted. Seriously, why did you cite this?\n \n Do I NEED TO CONTINUE?", 
   {}, 
   97925, 
   null, 
   1110857820.0
  ], 
  [
   97933, 
   null, 
   "Master_Shake", 
   "Well, I would say it is better then organized because people don't have a tendency of killing people in the name of paganism....\n\n Not to be overly technical, but, in what many people would consider pagan religions (and you too by your definition) human sacrifice occured.\n \n \nPagan: an unconverted member of a people or nation that does not acknowledge the God of the Bible.\n\n I know I asked for a definition, but this is one awful definition. This defines pagan as anything outside of Christinity, Islam, and Judaism. That makes Buddhism, Taoism, Confucianism, and Hinduism, among others, pagan religions and this just isn't the case.\n \n I am not a christian, but this merely sounds like the beginning of yet another anti-christian rant about how millions have died in the name of christianity. If it is, there's no need to start a new thread about it, we already have plenty.", 
   {}, 
   97913, 
   null, 
   1110857940.0
  ], 
  [
   97937, 
   null, 
   "Duo_Maxwell", 
   "alright, people who do not subscribe to a organized religion.", 
   {}, 
   97933, 
   null, 
   1110858000.0
  ], 
  [
   97941, 
   null, 
   "Master_Shake", 
   "alright, people who do not subscribe to a organized religion.\n\n \n I don't think many, if any at all, of the people I mentioned in my last post would consider themselves to be subscribing to an organized religion, and I don't think any sensible person looking from the outside would either most of the time.", 
   {}, 
   97937, 
   null, 
   1110858300.0
  ], 
  [
   97944, 
   null, 
   "trebor", 
   "\n I know I asked for a definition, but this is one awful definition. This defines pagan as anything outside of Christinity, Islam, and Judaism. That makes Buddhism, Taoism, Confucianism, and Hinduism, among others, pagan religions and this just isn't the case.\n \n\n \n Actually, that definition is 100% accurate when it comes to WHO would be considered a pagan, as per the dictionary. That is defnition number 1!\n \n http://dictionary.reference.com/search?q=pagan", 
   {}, 
   97933, 
   null, 
   1110858480.0
  ], 
  [
   97945, 
   null, 
   "Duo_Maxwell", 
   "I don't think many, if any at all, of the people I mentioned in my last post would consider themselves to be subscribing to an organized religion, and I don't think any sensible person looking from the outside would either most of the time.\n\n \n ...seriously man. Alright, one who does not follow one of the major religions or its sects in this world.", 
   {}, 
   97941, 
   null, 
   1110858540.0
  ], 
  [
   97951, 
   null, 
   "Easyrider", 
   "Easyrider, yes but Christianity and other orthodox religions are responsible for the death of millions, if not a billion in holy wars and heretical executions.\n\n \n Sorry, but Biblical Christianity never killed a single soul. It is the violation / abrogation of Christian principles which are deadly. \n \n \"Love your enemies. Do good to those who persecute you.\"- Jesus Christ", 
   {}, 
   97945, 
   null, 
   1110859080.0
  ], 
  [
   97955, 
   null, 
   "Duo_Maxwell", 
   "Sorry, but Biblical Christianity never killed a single soul. It is the violation / abrogation of Christian principles which are deadly. \n \n \"Love your enemies. Do good to those who persecute you.\"- Jesus Christ\n\n \n Notice how you've completely abandoned your article.\n \n Why does Biblical Christainty have a variety of death sentences for various crimes? After all, you state that it never killed a soul, so why does it have any of those/ not to mention the bible has stories of them being carried out. \n \n So it appears you are either ignorant or you are lying: either way you're giving christans a bad name.", 
   {}, 
   97951, 
   null, 
   1110859260.0
  ], 
  [
   97964, 
   null, 
   "Easyrider", 
   "Why does Biblical Christainty have a variety of death sentences for various crimes?\n\n \n Got a New Testament passage to back that up? Or are you referring to the OLD Covenant / Testament? \n \n \nSo it appears you are either ignorant or you are lying: either way you're giving christans a bad name.\n\n \n What is it about \"Love your neighbor\", and \"Do good to those who persecute you\" that you are unable to fathom?", 
   {}, 
   97955, 
   null, 
   1110860100.0
  ], 
  [
   97969, 
   null, 
   "Duo_Maxwell", 
   "Got a New Testament passage to back that up? Or are you referring to the OLD Covenant / Testament? \n\n \n Does it really matter? Please, are you saying there is no punishment for working on sundays? Or for adulters? emoticon_rolleyes Besides, OT and T is irrevelant, religious people subjectively pick their morals from each. \n \n \n\n What is it about \"Love your neighbor\", and \"Do good to those who persecute you\" that you are unable to fathom?\n\n \n Belief and application are two different things.\n \n it's interesting how you pretend that your lying, fraudlent article doesn't exist", 
   {}, 
   97964, 
   null, 
   1110860340.0
  ], 
  [
   97970, 
   null, 
   "Mach", 
   "Well, the pagans sacrificed their children on pagan altars in the Bible. Not good.\n\n So let me get this straight. Christian propoganda refers to other religions in a negative way. This is what...surprising? Telling? \n \n \n \nNazi Paganism\n \n The Nazis defended paganism, both during the early stages, and also when they came to power in 1933. They tore German society away from Christianity, and tried to turn it to pagan beliefs. \n \n A short while after Hitler came to power, Christian holidays and festivals were replaced by pagan ones. 'Mother Earth' or 'Father Sky' were called on at wedding ceremonies. In 1935, Christian prayers in schools were stopped, and then all lessons concerning Christianity were banned. \n \n Schoolchildren were taught the so-called 'Glorious pre-Christian German history,' and various rites and ceremonies, legacies of pagan culture, were held all over Germany. All Nazi meetings were in the form of traditional pagan ceremonies. There was almost no difference between Nazi rallies, held under the shadow of flaming torches, where slogans full of hate and violence were shouted and Wagner's pagan music played, and the perverted ceremonies carried out thousands of years ago at pagan temples and altars. \n \n The Nazis also used the arts to re-awaken paganism. Ancient Greek concepts and symbols began to predominate under Nazi rule, and many statues similar to Greek statues were made, showing strong men and women of the Aryan race. Hitler dreamed that a 'superior race' would be formed by the use of eugenics, and establish a cruel and oppressive 'world kingdom' based on the Spartan model. The expression \n \n 'The Third Reich' is a statement of this dream. And as a result of this dream, 55 million people lost their lives in the Second World War, the bloodiest conflict that had ever been seen. \n \n http://www.islamdenouncesantisemitism.com/thepagan.htm\n[/QUOTE]\n \n \n Because a particular political group in power in germany supported something, the something is necessarily bad or wrong or evil?\n \n \n Are you just posting these to get a rise out of people or do you really believe any of it is really relevant?\n \n -Mach", 
   {}, 
   97925, 
   null, 
   1110860400.0
  ], 
  [
   97975, 
   null, 
   "Master_Shake", 
   "Duo Maxwell- Why are you so bent on ranting about things the church did in the middle ages? People like you almost give those crazy fundamentalists a reason to be paranoid about christianity being under attack.\n I'm not saying plenty of bad things haven't been done or continue to be done in the name of christianity, but you talk about but as if this doing something wrong while claiming to be righteous is something exclusive to christianity. This is nothing new. People did it long before christianity, people do it today in plenty of other areas other than christianity, and peopple will continue to do so. This doesn't make it right, only common. The real question is, why are you singling out christianity?", 
   {}, 
   97964, 
   null, 
   1110860880.0
  ], 
  [
   97977, 
   null, 
   "Easyrider", 
   "Got a New Testament passage to back that up? Or are you referring to the OLD Covenant / Testament? \n \n \n \nDoes it really matter? Please, are you saying there is no punishment for working on sundays? Or for adulters?\n\n \n I want you to back up your argument that New Testament Biblical Christianity has \"a variety of death sentences for various crimes\".\n \n Where's the beef?  \n \n To ease your agony, nowhere in the New Testament is man ordered by God or man to specifically put someone to death for any offense, whether it is adultery or working on Sundays, etc. \n \n So this fallacy of yours that \"Christianity...(is) responsible for the death of millions, if not a billion in holy wars and heretical executions\" is either born out of pure ignorance, or is just a vicious lie on your part (or both).", 
   {}, 
   97969, 
   null, 
   1110861000.0
  ], 
  [
   97981, 
   null, 
   "Master_Shake", 
   "Does it really matter? Please, are you saying there is no punishment for working on sundays? Or for adulters? emoticon_rolleyes \n\n Let me first preface this by again saying that I am not a christian.\n Yes it does matter. The Law of the OT is quite different from what Jesus taught in the NT. Why don't you please show us punishment for adulterers or people who work on Sundays in the Gospels. This would help your argument.\n \n \nBesides, OT and T is irrevelant, religious people subjectively pick their morals from each. \n\n This is yet another extremely broad overgeneralization. Yes, some do, but let's not insult decent people by equating them with right-wing crazies.", 
   {}, 
   97969, 
   null, 
   1110861480.0
  ], 
  [
   97990, 
   null, 
   "Duo_Maxwell", 
   "I want you to back up your argument that New Testament Biblical Christianity has \"a variety of death sentences for various crimes\"\n\n \n If you first state that there is no punishment for adultery or working on sabath, I'll post several. :p \n \n \n\n To ease your agony, nowhere in the New Testament is man ordered by God or man to specifically put someone to death for any offense, whether it is adultery or working on Sundays, etc.\n\n \n Then you now believe that the Bible is no longer the word of God?  \n \n \n\n So this fallacy of yours that \"Christianity...(is) responsible for the death of millions, if not a billion in holy wars and heretical executions\" is either born out of pure ignorance, or is just a vicious lie on your part (or both).\n\n \n So please tell me, the Roman catholic execution of thousands for being heretics was not because of religion? That the burining at the stake during England's religious turblence was not because of religion? That the calvnists were not murdered in Paris because of religion?\n \n Master_Shake: you mean the crazies like Easy here?", 
   {}, 
   97977, 
   null, 
   1110862200.0
  ], 
  [
   98001, 
   null, 
   "Master_Shake", 
   "[QUOTE=Duo_Maxwell]Then you now believe that the Bible is no longer the word of God? /QUOTE]\n \n I don't know how you could have possibly gotten that out of what he said.", 
   {}, 
   97990, 
   null, 
   1110862800.0
  ], 
  [
   98002, 
   null, 
   "Duo_Maxwell", 
   "\n I don't know how you could have possibly gotten that out of what he said.\n\n \n Actually it is very simple. Often people like him believe that the Bible is the word of God. he is stating that nowhere is man ordered to kill, yet there are instances of where people were ordered to kill. hence if he believe that, then he must therefore no longer belive the bible is the word of God.", 
   {}, 
   98001, 
   null, 
   1110862980.0
  ], 
  [
   98009, 
   null, 
   "Master_Shake", 
   "Actually it is very simple. Often people like him believe that the Bible is the word of God. he is stating that nowhere is man ordered to kill, yet there are instances of where people were ordered to kill. hence if he believe that, then he must therefore no longer belive the bible is the word of God.\n\n \n I know that he believes that the Bible is the word of God. First of all, I'm not sure what specific instances you are talking about, but even if they do exist this logic still does not follow. It would simply mean that he is ignorant, not that he has changed his belief.\n \n On a different note, please, if you would, respond to post #20", 
   {}, 
   98002, 
   null, 
   1110863940.0
  ], 
  [
   98012, 
   null, 
   "Easyrider", 
   "Actually it is very simple. Often people like him believe that the Bible is the word of God. he is stating that nowhere is man ordered to kill, yet there are instances of where people were ordered to kill.\n\n \n Still waiting on that New Testament Scripture showing where God, or whoever, commands men to put to someone to death for some infraction of God's law.\n \n Where's the beef? \n \n One more post with no New Testament example and you lose by default.", 
   {}, 
   98002, 
   null, 
   1110864240.0
  ], 
  [
   98013, 
   null, 
   "Steeeeve", 
   "I think religion is a good thing and many good things can come from it...look at the mormons...while I don't believe in them they do happen to have the lowest of everything bad across the board...crime, drug abuse, divorce, etc....so in that sense it worked....but then you got some that take it to extremes and blow **** up....booooo....the idea of a religion setting a high moral standard is not bad if you wish to believe in it. SO what is the question again? :p", 
   {}, 
   97951, 
   null, 
   1110864360.0
  ], 
  [
   98049, 
   null, 
   "thebootfitter", 
   "Sorry, but Biblical Christianity never killed a single soul. It is the violation / abrogation of Christian principles which are deadly. \n \n \"Love your enemies. Do good to those who persecute you.\"- Jesus Christ\n\n Ahhh, yes... no TRUE Scotsman... er, Christian... would... well, I hope you see the point.", 
   {}, 
   97951, 
   null, 
   1110868200.0
  ], 
  [
   98051, 
   null, 
   "Master_Shake", 
   "Ahhh, yes... no TRUE Scotsman... er, Christian... would... well, I hope you see the point.\n\n \n Maybe I'm being dense, but I don't see your point.", 
   {}, 
   98049, 
   null, 
   1110868380.0
  ], 
  [
   98107, 
   null, 
   "Duo_Maxwell", 
   "Still waiting on that New Testament Scripture showing where God, or whoever, commands men to put to someone to death for some infraction of God's law.\n\n \n Interesting how you refuse to comment. But then again...it's your style ignore what you do not like.\n \n \n\n Where's the beef? \n \n One more post with no New Testament example and you lose by default.\n\n \n You have refused, but unlike you I don't ignore\n \n 1. Ex. 22:20: He that sacrificeth unto any god, save unto the Lord only, he shall be utterly destroyed. \n \n 2. Lev. 24:16: And he that blasphemeth the name of the Lord, he shall surely be put to death. \n *\n 3. Ex. 31:15: Whosoever doeth any work in the Sabbath day, he shall surely be put to death. \n *\n 4. Ex. 21:15: He that smiteth his father, or his mother, shall be surely put to death. \n *\n 5. Ex. 21:17: He that curseth his father or his mother, shall surely be put to death. \n *\n 6. Ex. 22:19: Whosoever lieth with a beast shall surely be put to death. \n *\n 7. Lev. 20:13: If a man lie with mankind, as he lieth with a woman, both of them have committed an abomination: they shall surely be put to death. \n \n 8. Lev. 20:10: And the man that committeth adultery with another man's wife, the adulterer and the adulteress shall be put to death.\n \n \n It's interesting how you basically pretend that the OT is completely irrevelant. \n \n One more post without refuations on the other subjects in this forum makes you lose by default. :p", 
   {}, 
   98012, 
   null, 
   1110873840.0
  ], 
  [
   98114, 
   null, 
   "Master_Shake", 
   "Well, you still haven't responded to him seeing as those are all from the Old Testament. You still haven't responded to me either but oh well.\n \n \n\n It's interesting how you basically pretend that the OT is completely irrevelant. \n\n \n This just seems to be a way of avoiding actually coming up with what he is asking for. I imagine it is because you can't.", 
   {}, 
   98107, 
   null, 
   1110875880.0
  ], 
  [
   98133, 
   null, 
   "Easyrider", 
   "Looks like Duo struck out, alright!", 
   {}, 
   98114, 
   null, 
   1110893400.0
  ], 
  [
   98143, 
   null, 
   "trebor", 
   "Interesting how you refuse to comment. But then again...it's your style ignore what you do not like.\n \n \n \n You have refused, but unlike you I don't ignore\n \n 1. Ex. 22:20: He that sacrificeth unto any god, save unto the Lord only, he shall be utterly destroyed. \n \n 2. Lev. 24:16: And he that blasphemeth the name of the Lord, he shall surely be put to death. \n *\n 3. Ex. 31:15: Whosoever doeth any work in the Sabbath day, he shall surely be put to death. \n *\n 4. Ex. 21:15: He that smiteth his father, or his mother, shall be surely put to death. \n *\n 5. Ex. 21:17: He that curseth his father or his mother, shall surely be put to death. \n *\n 6. Ex. 22:19: Whosoever lieth with a beast shall surely be put to death. \n *\n 7. Lev. 20:13: If a man lie with mankind, as he lieth with a woman, both of them have committed an abomination: they shall surely be put to death. \n \n 8. Lev. 20:10: And the man that committeth adultery with another man's wife, the adulterer and the adulteress shall be put to death.\n \n \n It's interesting how you basically pretend that the OT is completely irrevelant. \n \n One more post without refuations on the other subjects in this forum makes you lose by default. :p\n\n \n \n Except, of course, those phrases that say begining GAY is a bad thing. \n \n He also is ignoring such passages as Matthew 15:4-7 and Matthew 18:8. His is pretending that Matthew 5:17 doesn't exist, and he goes into orgasms over\n Matthew 10:21.\n \n And of course, we must not forget jesus's opinon about Stoning disobedient children, such as in Mark 7:9-13\n \n And the view of God as a slave owner that beats his slaves with many stripes is not very complimentary to god, don't you think (see Luke 12:46-47).", 
   {}, 
   98107, 
   null, 
   1110899640.0
  ], 
  [
   98174, 
   null, 
   "Waxy", 
   "What is it about \"Love your neighbor\", and \"Do good to those who persecute you\" that you are unable to fathom?\n\n \n Interesting, so I take it then that those to phrases are fundamental to Christianity.\n \n However, you, Easyrider, claim to be a Christian.\n \n Now that's something I'm unable to fathom.\n \n Waxy", 
   {}, 
   97964, 
   null, 
   1110906840.0
  ], 
  [
   98205, 
   null, 
   "sinjin", 
   "I want you to back up your argument that New Testament Biblical Christianity has \"a variety of death sentences for various crimes\".\n \n\n \n I've read all the posts and this argument was never made by Duo. Most modern Christians subscribe to some combination of NT and OT law as the basis for their \"morals\". These might include some OT laws that could make a Christian support \"death\" for certain crimes.\n \n Those \"Christians\" that claimed AIDS was a punishment from God come to mind but of course they weren't \"true\" Christians, were they?", 
   {}, 
   97977, 
   null, 
   1110911520.0
  ], 
  [
   98215, 
   null, 
   "HeavenBound", 
   "I've read all the posts and this argument was never made by Duo.\n\n \n The argument was made when Duo made the following statement:\n \n \nWhy does Biblical Christainty have a variety of death sentences for various crimes?\n", 
   {}, 
   98205, 
   null, 
   1110912480.0
  ], 
  [
   98237, 
   null, 
   "Waxy", 
   "The argument was made when Duo made the following statement:\n\n \n HB.\n \n I've taken the liberty of posting the two quotes and highlighting the key words for you.\n \n \nWhy does Biblical Christainty have a variety of death sentences for various crimes? \n\n \n \nI want you to back up your argument that New Testament  Biblical Christianity has \"a variety of death sentences for various crimes\".\n\n \n Easyrider twisted the quote to serve his agenda.\n \n Waxy", 
   {}, 
   98215, 
   null, 
   1110913740.0
  ], 
  [
   98241, 
   null, 
   "HeavenBound", 
   ".\n \n Easyrider twisted the quote to serve his agenda.\n\n \n No, he didn't because Biblical Christianity didn't surface until the New Testament time period.", 
   {}, 
   98237, 
   null, 
   1110914160.0
  ], 
  [
   98281, 
   null, 
   "sinjin", 
   "No, he didn't because Biblical Christianity didn't surface until the New Testament time period.\n\n \n So \"Biblical Christianity\" as a term is used to divorce some sects from the evils of the Roman Catholic Church or Jews? All Christians use the \"Bible\" and to my mind that makes them \"Biblical\" Christians. Some Protestant \"hair splitting\" me thinks.", 
   {}, 
   98241, 
   null, 
   1110917280.0
  ], 
  [
   98325, 
   null, 
   "Duo_Maxwell", 
   "Adultery punishment in the Bible's Old and New Testaments:\n \n The following Verses are from the NIV Bible:\n \n Exodus 20:14 \"You shall not commit adultery.\"\n \n Deuteronomy 22:22 \"If a man is found sleeping with another man's wife, both the man who slept with her and the woman must die.\"\n \n Leviticus 20:10 \"If a man commits adultery with another man's wife--with the wife of his neighbor--both the adulterer and the adulteress must be put to death.\"\n \n Proverbs 6:32 \"But a man who commits adultery lacks judgment; whoever does so destroys himself.\" He destroys himself by being put to death as shown above.\n \n Leviticus 21:9 \"And the daughter of any priest, if she profane herself by playing the whore, she profaneth her father: she shall be burnt with fire.\" Why should only a daughter of a priest gets burnt to death if she profanes herself? Why can't this law apply to all daughters? \n \n Deuteronomy 25:11-12 \"If two men are fighting and the wife of one of them comes to rescue her husband from his assailant, and she reaches out and seizes him by his private parts, you shall cut off her hand. Show her no pity.\" This doesn't make any sense what so ever! Why should the woman get her hands cut off for defending her husband? It's not like she was cheating on him or anything like that!\n \n \n \n We clearly see that adultery causes death from the Verses above. Let us see what Jesus peace be upon him said about adultery:\n \n The following Verses are from the NIV Bible:\n \n Matthew 19:9 \"I tell you that anyone who divorces his wife, except for marital unfaithfulness, and marries another woman commits adultery.\" Wouldn't this cause the man to be put to death?\n \n Mark 10:11 \"Anyone who divorces his wife and marries another woman commits adultery against her.\" Again, wouldn't he then be put to death since he would have committed adultery?\n \n Mark 10:12 \"And if she divorces her husband and marries another man, she commits adultery.\" Same question I ask about the women who are considered have committed adultery. Wouldn't they be put to death also?\n \n Luke 16:18 \"Anyone who divorces his wife and marries another woman commits adultery, and the man who marries a divorced woman commits adultery.\" \n \n My question here is: Would an adulterer in the New Testament be put to death?\n \n Keep in mind that when Jesus gave the above laws, he gave them during the time when he spoke highly of the Old Testament's Law:\n \n Jesus orders Christians to follow the Old Testament's laws: \"Do not think that I [Jesus] have come to abolish the Law (the Old Testament) or the Prophets; I have not come to abolish them but to fulfill them. I tell you the truth, until heaven and earth disappear, not the smallest letter, not the least stroke or a pen, will by any means disappear from the Law (the Old Testament) until everything is accomplished. (Matthew 5:17-18)\" It is quite clear from these verses from the New Testament that Jesus peace be upon him did honor the Old Testament and did say that every single \"letter\" of it has to be honored, followed and fulfilled.\n \n \"Then Jesus said to the crowds and to his disciples: 'The teachers of the law and the Pharisees sit in Moses' seat. So you must obey them and do everything they tell you. But do not do what they do, for they do not practice what they preach.' (Matthew 23:1-3)\" We clearly see in these verses that Jesus peace be upon him did not prohibit for the Old Testament to be followed, but only warned his followers to not follow it the way the current religious leaders of the Law (the Jewish Rabies) were following it.\n \n So according to Jesus peace be upon him, the adulterer in the New Testament must be put to death.\n\n \n http://www.answering-christianity.com/bible_adultery.htm\n \n Suck it down easy, suck it down. \n \n Hold on a minute\n \n What Is biblical christanity? I can't find a decent definition anywhere of what biblibical christanity is. It appears Easy rider MADE THE TERMS UP. In fac the one I did find does not say that the OT is disregarded. it appears Easy Rider is completely ignoring the OT as it if has no impact upon Christanity. http://www.auburn.edu/~allenkc/truechr.html", 
   {}, 
   98281, 
   null, 
   1110920280.0
  ], 
  [
   98341, 
   null, 
   "Big Orn", 
   "So \"Biblical Christianity\" as a term is used to divorce some sects from the evils of the Roman Catholic Church or Jews? All Christians use the \"Bible\" and to my mind that makes them \"Biblical\" Christians. Some Protestant \"hair splitting\" me thinks.\n\n And why there are so many divisions in the Christian religion, I'm afraid.\n \n Jesus did not come to do away with the Old Testament, but to fulfill it. What He fulfills He makes new. In other words what the flesh fell prey to in the OT is what the spirit falls prey to now. \n \n Killing the flesh in the OT has now been made to kill spiritually, thus the adultry thing as well as the rest. God no longer kills the bad people...we kill ourselves spiritually. If you look at it like that, which I think we should, we would see one more reason for God to become man, and die, and live again.\n \n The Commandments are still in force no matter what.", 
   {}, 
   98281, 
   null, 
   1110921060.0
  ], 
  [
   98344, 
   null, 
   "Duo_Maxwell", 
   "Looks like Duo struck out, alright!\n\n \n Not really. you're clearly using your own term of biblical christanity, which by the way doesn't have a definition that disregards the OT entirely, which you are presuming to do. Also, trebor highlights passages that do have death penalties. \n \n And if we want to do it that way, you've struck out of the other threads in this forum by failing to back your arguments up when challenged", 
   {}, 
   98133, 
   null, 
   1110921540.0
  ], 
  [
   98357, 
   null, 
   "HeavenBound", 
   "http://www.answering-christianity.com/bible_adultery.htm\n \n Suck it down easy, suck it down.\n\n \n \n But this is what Jesus taught about adultery: \n \n \n John 8:4-59 (King James Version)\n \n 4They say unto him, Master, this woman was taken in adultery, in the very act. \n \n 5Now Moses in the law commanded us, that such should be stoned: but what sayest thou? \n \n 6This they said, tempting him, that they might have to accuse him. But Jesus stooped down, and with his finger wrote on the ground, as though he heard them not. \n \n 7So when they continued asking him, he lifted up himself, and said unto them, He that is without sin among you, let him first cast a stone at her.\n \n So, are we to ignore what Jesus taught and stone people to death anyway?", 
   {}, 
   98325, 
   null, 
   1110923220.0
  ], 
  [
   98372, 
   null, 
   "Big Orn", 
   "Not really. you're clearly using your own term of biblical christanity, which by the way doesn't have a definition that disregards the OT entirely, which you are presuming to do. Also, trebor highlights passages that do have death penalties. \n \n And if we want to do it that way, you've struck out of the other threads in this forum by failing to back your arguments up when challenged\n\n You have to remember that when using OT scripture to make a point that some scriptures were replaced or \"nailed to the Cross\" with Christ, meaning He was crucified to do away with them. For instance, stoning adulterers, atonement with the blood of animals, etc. Knowing which ones is why we study, align the scriptures, and study even more...and then we can't fully get the gist of it without prayer and help from Him.", 
   {
    "unicode_changes_made": true
   }, 
   98357, 
   null, 
   1110924660.0
  ], 
  [
   98384, 
   null, 
   "Waxy", 
   "No, he didn't because Biblical Christianity didn't surface until the New Testament time period.\n\n \n emoticon_rolleyes \n \n Is there such a thing as Non-Biblical Christianity?\n \n Give me a break HB. emoticon_xdonno \n \n Waxy", 
   {}, 
   98241, 
   null, 
   1110925920.0
  ], 
  [
   98390, 
   null, 
   "HeavenBound", 
   "\n Is there such a thing as Non-Biblical Christianity?\n \n Give me a break HB. \n \n Waxy\n\n \n No, of course not. I was referring to Christianity in general.\n \n \n Hey, Duo when are you going to answer Master Shake's question from #20?\n \n \n \nThe real question is, why are you singling out christianity?\n", 
   {}, 
   98384, 
   null, 
   1110926940.0
  ], 
  [
   98391, 
   null, 
   "Waxy", 
   "No, of course not. I was referring to Christianity in general.\n\n \n emoticon_confused emoticon_confused \n \n I can sure tell you're female. :p :p\n \n Waxy", 
   {}, 
   98390, 
   null, 
   1110927480.0
  ], 
  [
   98394, 
   null, 
   "Duo_Maxwell", 
   "But this is what Jesus taught about adultery: \n So, are we to ignore what Jesus taught and stone people to death anyway?\n\n \n So we have a dilemma. We cannot simply ignore the OT like easy rider does to suit his arguments, yet we cannot ignore the NT to suit our arguments. So what do we do? \n \n Besides, we are getting off track, easy rider claimed that christanity has never killed anyone. Do you agree? \n \n Big Orn: I'm not sure what you're trying to say.", 
   {}, 
   98357, 
   null, 
   1110927780.0
  ], 
  [
   98396, 
   null, 
   "trs", 
   "You have to remember that when using OT scripture to make a point that some scriptures were replaced ...\n\n Replacement theology is sham - little more than self-serving anti-Judaic babble promulgated by an increasingly gentile, increasingly vitriolic cult. There is no evidence that the early Jerusalem sect was any less Torah observant than their competition.", 
   {}, 
   98372, 
   null, 
   1110928020.0
  ], 
  [
   98397, 
   null, 
   "HeavenBound", 
   "So we have a dilemma. We cannot simply ignore the OT like easy rider does to suit his arguments, yet we cannot ignore the NT to suit our arguments. So what do we do? \n \n Besides, we are getting off track, easy rider claimed that christanity has never killed anyone. Do you agree?\n\n \n Christianity never has killed anyone per se, people howbeit misguided killed people.", 
   {}, 
   98394, 
   null, 
   1110928140.0
  ], 
  [
   98400, 
   null, 
   "Duo_Maxwell", 
   "Christianity never has killed anyone per se, people howbeit misguided killed people.\n\n \n Ah, I would agree. The same can be said for Paganism, which invalides Easy riders's claims. A mere ideology is helpless unless championed.\n \n So the real issues is that paganism has a smaller tendency to be used to kill people then orthodox religions.", 
   {}, 
   98397, 
   null, 
   1110928500.0
  ], 
  [
   98417, 
   null, 
   "Big Orn", 
   "Big Orn: I'm not sure what you're trying to say.\n\n Just to let you know that not all laws and/or commandments in the OT are still in effect today.\n \n It's time we stop using the OT as a basis for the Gospel. It's the apple-and-orange predicament in so many ways.", 
   {}, 
   98394, 
   null, 
   1110930960.0
  ], 
  [
   98418, 
   null, 
   "Duo_Maxwell", 
   "Just to let you know that not all laws and/or commandments in the OT are still in effect today.\n\n \n Well, it's hard to pick out laws that are directly from the OT and commandements in today's world. Many of the commandments existed in pre-christan times as laws, usually with death as a punishment. \n \n \n\n It's time we stop using the OT as a basis for the Gospel. It's the apple-and-orange predicament in so many ways.\n\n \n But one cannot merely make up new terms and ignore the OT when it suits them, just as easy rider has done.", 
   {}, 
   98417, 
   null, 
   1110931080.0
  ], 
  [
   98420, 
   null, 
   "Big Orn", 
   "Replacement theology is sham - little more than self-serving anti-Judaic babble promulgated by an increasingly gentile, increasingly vitriolic cult. There is no evidence that the early Jerusalem sect was any less Torah observant than their competition.\n\n But it's true. One only has to look into the Gospel of God and find it. \n \n Now, if we all are left to our own devices...well, I have my interpretation and you have yours - then we'd have a \"replacement theology\".\n \n Do you deny the different teachings, or perhaps, as a better way to say it, the difference in teachings between the OT and NT?", 
   {
    "unicode_changes_made": true
   }, 
   98396, 
   null, 
   1110931380.0
  ], 
  [
   98432, 
   null, 
   "Big Orn", 
   "Well, it's hard to pick out laws that are directly from the OT and commandements in today's world. Many of the commandments existed in pre-christan times as laws, usually with death as a punishment. \n\n That's true and the point that I was trying to make. \n \n We now, since the death and resurrection of Christ, have a new dispensation. Under that umbrella we are no longer bound to the earth by natural laws, but are granted, by grace, the freedom of Heaven while still on earth. Cross-referencing the two testaments is a hard row to hoe, even for the best theologians. I would say that sometimes it's even dangerous. You, yourself said that many have been killed because of it.\n \nBut one cannot merely make up new terms and ignore the OT when it suits them, just as easy rider has done.\n\n No, they can't. But, it's better to have an idea of what can and cannot be used as leverage in the OT when discussing its affect on Christianity.", 
   {
    "unicode_changes_made": true
   }, 
   98372, 
   null, 
   1110932580.0
  ], 
  [
   98445, 
   null, 
   "Duo_Maxwell", 
   "That's true and the point that I was trying to make.\n\n \n Then we are on the same page. Which is good.\n \n \nI would say that sometimes it's even dangerous. You, yourself said that many have been killed because of it.\n\n \n I did? I may have made references towards it.\n \n \nBut, it's better to have an idea of what can and cannot be used as leverage in the OT when discussing its affect on Christianity.\n\n \n There we have a dilemma. Who gets to decide what cannot and can be used?", 
   {
    "unicode_changes_made": true
   }, 
   98432, 
   null, 
   1110933960.0
  ], 
  [
   98449, 
   null, 
   "Big Orn", 
   "There we have a dilemma. Who gets to decide what cannot and can be used?\n\n It's already been decided for us.\n \n That's what the New Testament is all about.\n \n So simple, yet so difficult.\n \n I'm not pushing you to anything, Duo, but just start at the Books of Acts and read how and why that decision was made. Gotta have an open mind, though. And don't let religion get in the way...it fouls the water.", 
   {}, 
   98445, 
   null, 
   1110934380.0
  ], 
  [
   98467, 
   null, 
   "Duo_Maxwell", 
   "Duo Maxwell- Why are you so bent on ranting about things the church did in the middle ages? People like you almost give those crazy fundamentalists a reason to be paranoid about christianity being under attack.\n\n \n Because crazies have a tendency to ignore everything bad about their religion and pretend only the good happened. They need a swift kick to the head to jog their memories. \n \n \n\n I'm not saying plenty of bad things haven't been done or continue to be done in the name of christianity, but you talk about but as if this doing something wrong while claiming to be righteous is something exclusive to christianity.\n\n \n I'm not sure I follow you. I could complain about Islam, just no one brought it up. Nor do we have crazy muslims here. \n \n \nreal question is, why are you singling out christianity?\n\n \n See above.", 
   {}, 
   97975, 
   null, 
   1110935820.0
  ], 
  [
   98482, 
   null, 
   "trebor", 
   "You have to remember that when using OT scripture to make a point that some scriptures were replaced or \"nailed to the Cross\" with Christ, meaning He was crucified to do away with them. For instance, stoning adulterers, atonement with the blood of animals, etc. Knowing which ones is why we study, align the scriptures, and study even more...and then we can't fully get the gist of it without prayer and help from Him.\n\n \n Pardon me, but atonement for the blood of animals was not required. In the New Testament, Jesus said not one thing of the old law will pass away until all is complete. As far as I can see, things aren't complete yet, since Chrisitians are waiting for the second coming still.\n \n As for atonement, might I point out several verses in the old testament.\n \n Leviticus 5:11 But if he be not able to bring two turtledoves, or two young pigeons, then he that sinned shall bring for his offering the tenth part of an ephah of fine flour for a sin offering; he shall put no oil upon it, neither shall he put any frankincense thereon: for it is a sin offer\n \n and Isaiah 1:11 To what purpose is the multitude of your sacrifices unto me? saith the LORD: I am full of the burnt offerings of rams, and the fat of fed beasts; and I delight not in the blood of bullocks, or of lambs, or of he goats.\n \n And Miciah 6 is very clear what is required\n \n 6 Wherewith shall I come before the LORD, and bow myself before the high God? shall I come before him with burnt offerings, with calves of a year old? 7 Will the LORD be pleased with thousands of rams, or with ten thousands of rivers of oil? shall I give my firstborn for my transgression, the fruit of my body for the sin of my soul? 8 He hath shewed thee, O man, what is good; and what doth the LORD require of thee, but to do justly, and to love mercy, and to walk humbly with thy God?\n ", 
   {
    "unicode_changes_made": true
   }, 
   98372, 
   null, 
   1110937740.0
  ], 
  [
   98488, 
   null, 
   "trebor", 
   "Just to let you know that not all laws and/or commandments in the OT are still in effect today.\n \n It's time we stop using the OT as a basis for the Gospel. It's the apple-and-orange predicament in so many ways.\n\n \n \n To a large extent, it seems pretty important to Jesus. After all, he did say 'Not one wit of the law will pass away till all is complete'.", 
   {}, 
   98417, 
   null, 
   1110938580.0
  ], 
  [
   98569, 
   null, 
   "Easyrider", 
   "To a large extent, it seems pretty important to Jesus. After all, he did say 'Not one wit of the law will pass away till all is complete'.\n\n \n Here's your Sunday School lesson for today on that:\n \n Fulfilling the Law (vv. 17, 18)\n \n 17. \"Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them. \n Jesus did not intend to destroy, abolish, or disobey anything in God's Word. He and His disciples had not broken God's law regarding the Sabbath, as the Pharisees had charged (Mark 2:23, 24); they had ignored some mistaken interpretations of it.\n \n The teaching of Jesus in Matthew 5:21-48 does not contradict or condemn the Old Testament law; it fulfills it. Let's consider four ways in which Jesus fulfilled the law and the prophets:\n \n 1. He fulfilled Old Testament laws by calling attention to their true meaning and to the need to keep the laws inwardly as well as by one's actions (Matthew 5:21-48).\n 2. He fulfilled the laws by obeying them fully and applying them as God intended. Driving the sellers and the money changers out of the temple is one example. [See question #1.] \n 3. He fulfilled Old Testament prophecies by doing what they foretold. (Compare Isaiah 53:4 with Matthew 8:16, 17; Psalm 78:2 with Matthew 13:34, 35; and Zechariah 9:9 with Matthew 21:4, 5. Many other examples could also be cited.)\n 4. The most significant way Jesus fulfilled the law was to complete its purpose. The law told what was right and what was wrong before God. It let people know that they were sinners, not good enough to receive eternal life (Romans 3:19, 20). It was intended to lead us to Christ (Galatians 3:24), by whom our sins are forgiven. When we come to Christ and are forgiven, the law is fulfilled. Its purpose is accomplished, and we are no longer under the \"schoolmaster\" (Galatians 3:25, 26).\n \n Consider one example of how to apply this principle. The law required a sinner to sacrifice an animal to atone for his sin. But the sacrifice of an animal is not enough to take away the sins of anyone. Such sacrifices were offered repeatedly until Jesus' death on the cross, through which sins really are taken away. Thus the law is fulfilled, and animal sacrifices are no longer necessary (Hebrews 10:1-18).\n \n 18. I tell you the truth, until heaven and earth disappear, not the smallest letter, not the least stroke of a pen, will by any means disappear from the Law until everything is accomplished.\n \n The New International Version explains rather than translates a couple of terms in this verse. The \"jot\" (also called the yod) of the King James Version was \"the smallest letter\" in the Hebrew alphabet, just as the i is the smallest in the English alphabet. A \"tittle\" is merely a part of a letter, like the crossing of a t or the dotting of an i in English. It is, as the New International Version has it, just a slight \"stroke of a pen.\" Whichever version we follow make it clear Jesus' meaning: not even the tiniest part of the law would be removed till all be fulfilled. This happened when Jesus declared on the cross, \"It is finished\" (John 19:30).\n \n http://www.swordofthespiritchurch.net/lessons/Jesus%20Fulfills%20the%20Law%2011%2011%2001.htm", 
   {
    "unicode_changes_made": true
   }, 
   98488, 
   null, 
   1110951900.0
  ], 
  [
   98597, 
   null, 
   "Orion", 
   "Here's your Sunday School lesson for today on that:\n\n \n Well, not quite, EZ. Consider the following...\n \n Mt 5:18 For verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled. \n \n Has heaven and earth passed? Has all been fulfilled? Hardly. The fact that Jesus failed to fulfill messianic prophecies forced his early followers to create the concept of his imminent second coming, a concept, BTW, foreign to Judaism...\n \n Luke 21:31-32 - Even so, when you see these things happening, you know that the kingdom of God is near. I tell you the truth, this generation will certainly not pass away until all these things have happened. \n \n Hebrews 10:37 - For in just a very little while, He who is coming will come and will not delay. \n \n James 5:7-9 - Be patient, then, brothers, until the Lord's coming. . . You too, be patient and stand firm, because the Lord's coming is near. \n \n 1 Peter 1:20 - He was chosen before the creation of the world, but was revealed in these last times for your sake. \n \n 1 Peter 4:7 - The end of all things is near. \n \n Rev. 22:20 - Surely I come quickly.\n \n Tic Toc...\n \n Obviously, then, all has not been fulfilled. So I suggest to you, EZ, that you put down that bacon cheese burger and that you not even think about that shrimp cocktail. Don't touch a menstruating woman, either. And if your ox gores someone other than a slave, you'd better look out. BTW, are you of the opinion that we should stone to death adulturers or disobedient children?", 
   {}, 
   98569, 
   null, 
   1110963600.0
  ], 
  [
   98609, 
   null, 
   "Easyrider", 
   "Sorry, Orion, but glossing over what I previously provided doesn't help your cause.", 
   {}, 
   98597, 
   null, 
   1110977580.0
  ], 
  [
   98613, 
   null, 
   "trs", 
   "Do you deny the different teachings, or perhaps, as a better way to say it, the difference in teachings between the OT and NT?\nNo - I reject the silly idea that either are anything other than the works of man and view the NT as a particularly inane fabrication.", 
   {}, 
   98420, 
   null, 
   1110978360.0
  ], 
  [
   98624, 
   null, 
   "trebor", 
   "Sorry, Orion, but glossing over what I previously provided doesn't help your cause.\n\n \n Nor, does your ignoring what Orion says. \n \n It seems that when you take sentances out of context, you can make the Bible say anything you want. \n \n I wouldn't worry about the bacon cheeseburger, the restrictions in Levititucs are for the Jews only, Gentiles don't have to worry about them at all.\n \n However, if you go for the live clams, it's into the pit for you.", 
   {}, 
   98609, 
   null, 
   1110985980.0
  ], 
  [
   98640, 
   null, 
   "Big Orn", 
   "Pardon me, but atonement for the blood of animals was not required. In the New Testament, Jesus said not one thing of the old law will pass away until all is complete. As far as I can see, things aren't complete yet, since Chrisitians are waiting for the second coming still.\n \n As for atonement, might I point out several verses in the old testament.\n \n Leviticus 5:11 But if he be not able to bring two turtledoves, or two young pigeons, then he that sinned shall bring for his offering the tenth part of an ephah of fine flour for a sin offering; he shall put no oil upon it, neither shall he put any frankincense thereon: for it is a sin offer\n \n and Isaiah 1:11 To what purpose is the multitude of your sacrifices unto me? saith the LORD: I am full of the burnt offerings of rams, and the fat of fed beasts; and I delight not in the blood of bullocks, or of lambs, or of he goats.\n \n And Miciah 6 is very clear what is required\n \n 6 Wherewith shall I come before the LORD, and bow myself before the high God? shall I come before him with burnt offerings, with calves of a year old? 7 Will the LORD be pleased with thousands of rams, or with ten thousands of rivers of oil? shall I give my firstborn for my transgression, the fruit of my body for the sin of my soul? 8 He hath shewed thee, O man, what is good; and what doth the LORD require of thee, but to do justly, and to love mercy, and to walk humbly with thy God?\n \n\n You misunderstood me. I said atonement with the blood of animals. This means by the blood of animals was sin forgiven. Since the Cross took care of that, there is now no need for it.\n \nTo a large extent, it seems pretty important to Jesus. After all, he did say 'Not one wit of the law will pass away till all is complete'.\n\n Some was completed when He was born; some when the temple was \"rent\"; some when He was nailed to the cross, some when He \"died\"; some when He arose; and some on the Day of Pentecost. That's just a few instances.", 
   {
    "unicode_changes_made": true
   }, 
   98482, 
   null, 
   1110990000.0
  ], 
  [
   98648, 
   null, 
   "trs", 
   "Some was completed when He was born; some when the temple was \"rent\"; some when He was nailed to the cross, some when He \"died\"; some when He arose; and some on the Day of Pentecost. That's just a few instances.\n\n And what magic decoder ring is responsible for this creative piece of apologetics? And how is it that this gentile-centric revelation of yours was, as far as anyone can tell, wholly unaccepted by the Jerusalem sect? Your NT was fabricated and evolved by the victors of more than a few sectarian squabbles, and you meekly swallow their self-serving justifications hook, line, and sinker. What is this if not willful ignorance?", 
   {
    "unicode_changes_made": true
   }, 
   98640, 
   null, 
   1110991080.0
  ], 
  [
   98659, 
   null, 
   "Big Orn", 
   "And what magic decoder ring is responsible for this creative piece of apologetics? And how is it that this gentile-centric revelation of yours was, as far as anyone can tell, wholly unaccepted by the Jerusalem sect? Your NT was fabricated and evolved by the victors of more than a few sectarian squabbles, and you meekly swallow their self-serving justifications hook, line, and sinker. What is this if not willful ignorance?\n\n Faith.\n \n Christ is and will always be the author and finisher of that faith. Just because He came as any human would, who worked by the sweat of His brow, who suffered and cried, laughed and sang as a normal man, doesn't mean He wasn't The King.\n \n The reason the Jews and many others don't accept Him is because He didn't come brandishing a sword and beheading the Romans while riding a white stallion, and donned in armor. Because He came to give life instead of take it He was denied...and still is today.", 
   {
    "unicode_changes_made": true
   }, 
   98648, 
   null, 
   1110993120.0
  ], 
  [
   98674, 
   null, 
   "trebor", 
   "You misunderstood me. I said atonement with the blood of animals. This means by the blood of animals was sin forgiven. Since the Cross took care of that, there is now no need for it.\n \n Some was completed when He was born; some when the temple was \"rent\"; some when He was nailed to the cross, some when He \"died\"; some when He arose; and some on the Day of Pentecost. That's just a few instances.\n\n \n \n Yet, the earth and heavens have not passed away, which is one of the criteria he had. \n \n And no, you are not right. it is not with the blood of animals that sin was forgiven.. that was just giving up something the petitioner found valuable. Other methods were found for atonement..so blood of animals was never realliy needed. \n \n And, I just don't understand why you don't understand the phrase 'until heaven and earth pass'...", 
   {
    "unicode_changes_made": true
   }, 
   98640, 
   null, 
   1110995520.0
  ], 
  [
   98676, 
   null, 
   "trs", 
   "Faith. Christ is and will always be the author and finisher of that faith. \nThanks for sharing. Now let me offer something in return - also from a Christian source. \n Under the index of the Synoptic Gospels Primer, the text reads:\n \nFaith is no excuse for ignorance!\n Adherence to any tradition in disregard for textual evidence is sheer superstition.\n\n The Passion Narrative appears to be very much more farce than fact. The reason the Jews and many others don't accept your fictive Lord is because the Emperor has no clothes.", 
   {}, 
   98659, 
   null, 
   1110995820.0
  ], 
  [
   98691, 
   null, 
   "Big Orn", 
   "Thanks for sharing.\n\n You're welcome and I respect your opinion, trs.", 
   {}, 
   98676, 
   null, 
   1110997320.0
  ], 
  [
   99030, 
   null, 
   "Master_Shake", 
   "Except, of course, those phrases that say begining GAY is a bad thing. \n\n Wow, good thing you pointed that out seeing as we weren't even discussing that. It's always nice to have irellevant commentary inserted into threads especially when there isn't a very active thread going on on this very subject.\n \n You got these following passages from a site that lists \"offensive\" bible passages I imagine. How original. Maybe not, so I'll assume the best. It's also convenient that you didn't actually put the passages up here, only their references, when you could have easily copy and pasted them. This keeps them from someone as easily criticizing them. You also probably assumed people wouldn't bother to check them. So I took the liberty of posting them here.\n \n \nHe also is ignoring such passages as Matthew 15:4-7\n\n 4For God said, 'Honor your father and mother' and 'Anyone who curses his father or mother must be put to death.' 5But you say that if a man says to his father or mother, 'Whatever help you might otherwise have received from me is a gift devoted to God,' 6he is not to 'honor his father[c]' with it. Thus you nullify the word of God for the sake of your tradition. 7You hypocrites! Isaiah was right when he prophesied about you\n \n I fail to see how this has to do with God commanding someone to commit violence on another in the NT, as that is what what were discussing.\n \n \nand Matthew 18:8. \n\n 8If your hand or your foot causes you to sin, cut it off and throw it away. It is better for you to enter life maimed or crippled than to have two hands or two feet and be thrown into eternal fire.\n \n This is not about literally  cutting one's own limbs off. It is about cutting out the root of the sin. It's a metaphor.\n \n \nHis is pretending that Matthew 5:17 doesn't exist, \n\n 17\"Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them.\n \n I don't know how someone can ignore something that hadn't yet been brought up.\n I won't bother putting my two cents in here--it's already obviously in deep discussion among people who are saying things better than I could say them.\n \n \nand he goes into orgasms over Matthew 10:21.\n\n 16I am sending you out like sheep among wolves. Therefore be as shrewd as snakes and as innocent as doves. \n 17\"Be on your guard against men; they will hand you over to the local councils and flog you in their synagogues. 18On my account you will be brought before governors and kings as witnesses to them and to the Gentiles. 19But when they arrest you, do not worry about what to say or how to say it. At that time you will be given what to say, 20for it will not be you speaking, but the Spirit of your Father speaking through you. \n 21\"Brother will betray brother to death, and a father his child; children will rebel against their parents and have them put to death. 22All men will hate you because of me, but he who stands firm to the end will be saved. 23When you are persecuted in one place, flee to another. I tell you the truth, you will not finish going through the cities of Israel before the Son of Man comes.\n \n Yet again, I don't know how anyone is reacting in the way you say seeing as no one had brought this passage up.\n I put this into the context of the text around it for better understanding. This passage is obviously about Jesus telling his disciples that they will be persecuted by others for their belief in him, not because God commanded them too, but because that is what people do and did. Because of this, this statement is also obviously not about God telling people to \"betray...to death\" their family, he is simply saying this will happen because of their beliefs.\n \n \n \nAnd of course, we must not forget jesus's opinon about Stoning disobedient children, such as in Mark 7:9-13\n\n 9He said to them, \"All too well you reject the commandment of God, that you may keep your tradition. 10For Moses said, \"Honor your father and your mother';[a] and, \"He who curses father or mother, let him be put to death.'[b] 11But you say, \"If a man says to his father or mother, \"Whatever profit you might have received from me is Corban\"--' (that is, a gift to God), 12then you no longer let him do anything for his father or his mother, 13making the word of God of no effect through your tradition which you have handed down. And many such things you do.\"\n \n Jesus is simply saying here that the Jews he is talking to have not been honoring the word of God and are being hypocrtitical. I again fail to see how this has to do with God commanding violence in the NT.\n \n \nAnd the view of God as a slave owner that beats his slaves with many stripes is not very complimentary to god, don't you think (see Luke 12:46-47).\n\n 42The Lord answered, \"Who then is the faithful and wise manager, whom the master puts in charge of his servants to give them their food allowance at the proper time? 43It will be good for that servant whom the master finds doing so when he returns. 44I tell you the truth, he will put him in charge of all his possessions. 45But suppose the servant says to himself, 'My master is taking a long time in coming,' and he then begins to beat the menservants and maidservants and to eat and drink and get drunk. 46The master of that servant will come on a day when he does not expect him and at an hour he is not aware of. He will cut him to pieces and assign him a place with the unbelievers. \n \n 47\"That servant who knows his master's will and does not get ready or does not do what his master wants will be beaten with many blows. 48But the one who does not know and does things deserving punishment will be beaten with few blows. From everyone who has been given much, much will be demanded; and from the one who has been entrusted with much, much more will be asked.\n \n I also put this one in it's textual contex for the same reason as above.\n If it wasn't totally obvious, this passage is a metaphor--something Jesus used often. All it is basically saying is that someone who has heard and knows Jesus' message, but lives his life as if he hasn't, will go to hell. Someone who has not heard the message and lives the same way will not go to hell as you can't punish someone if they did not know that what they were doing was wrong. It is not about commanding violence on anyone.\n \n It seems to me that you are doing exactly what so many people like you (including myself) accuse fundies of doing--taking something literally that shouldn't be and taking things out of context.", 
   {
    "unicode_changes_made": true
   }, 
   98143, 
   null, 
   1111081980.0
  ], 
  [
   99041, 
   null, 
   "Master_Shake", 
   "Because crazies have a tendency to ignore everything bad about their religion and pretend only the good happened. They need a swift kick to the head to jog their memories. \n\n Yes, fundamentalist often do have a tendency to do this, but I don't think that not associating themselves with people in the Middle Ages or people on the fringe today, means they are ignoring these things--it is important to remember--it is just not often relevant to an average discussion.\n \n \nI'm not sure I follow you. I could complain about Islam, just no one brought it up. Nor do we have crazy muslims here. \n\n I'm sure you could complain about Islam and other religions, but it was Christianity that you singled out. Lest I remind you that you brought it up and began discussing violence committed by christians, not someone else.\n \n \nChristianity and other orthodox religions are responsible for the death of millions, if not a billion in holy wars and heretical executions. \n\n \n You were reacting to Easyrider, who had mentioned the bible, but only to reference pagans in it, not christians, this is an important point. And even then it was only brief. He spent most of his time talking about paganism and the Nazis.\n \n So the question remains. Why single out Christianity?", 
   {}, 
   98467, 
   null, 
   1111082880.0
  ], 
  [
   99094, 
   null, 
   "Big Orn", 
   "Yet, the earth and heavens have not passed away, which is one of the criteria he had.\n\n Not yet, anyway. And they will not pass away until He returns.\n If you are referring to the fulfillment of scripture, you have to remember that when He said that He had not yet been nailed to the cross. \n \nAnd no, you are not right. it is not with the blood of animals that sin was forgiven.. that was just giving up something the petitioner found valuable. Other methods were found for atonement..so blood of animals was never realliy needed.\n\n Look at what I said: Atonement was granted by the \"blood of bulls and goats\". You corrupted my post. That's not very ethical, trebor. \n BTW - it was and still is impossible that the blood of animals can take away sins. That's yet another reason God had to become flesh.\n \nAnd, I just don't understand why you don't understand the phrase 'until heaven and earth pass'...\n\n Please provide the scripture for that.\n \n All there is that refers to that is where Christ said in Matthew 5:18, I am telling you the truth, until heaven and earth pass away, not even the least bit of the the Law will pass away until all be fulfilled. If that's what you were referring to then, as I stated above, he had yet to endure the Cross. Also, as I stated in post #67, some have been fulfilled. \n \n Fulfilling scripture and \"doing away\" with the Law are two different things. I think we need to be on the same page as far as that goes, don't you agree?", 
   {
    "unicode_changes_made": true
   }, 
   99041, 
   null, 
   1111087860.0
  ], 
  [
   99174, 
   null, 
   "trebor", 
   "Not yet, anyway. And they will not pass away until He returns.\n If you are referring to the fulfillment of scripture, you have to remember that when He said that He had not yet been nailed to the cross. \n \n\n \n And then, until he returns, the laws has to be followed, according to Jesus.\n \n OF course, he was speaking to the Jews, and since christians are gentiles, the jewish laws don't apply to them.", 
   {}, 
   99094, 
   null, 
   1111096200.0
  ], 
  [
   99231, 
   null, 
   "Big Orn", 
   "And then, until he returns, the laws has to be followed, according to Jesus.\n\n Yes, but not the law of sin, which is why the law was established. You must not overlook that Christ came to fulfill the law and the scriptures, not \"do away\" with them, for any life in sin is under the law and therefore judged by that law. But, in Christ is that law fulfilled and by His blood sins are forgiven. \n The law was not made because of sin, but sin because of the law. Without sin there would be no law and without the law sin would be weak, for the strength of sin is the law. Have you not read in the Bible that \"cursed is the person that does not maintain all the things written in the law\"...? We've already discussed that no man can be justified by the law for there was many times that the blood of animals had to be spilt in atonement. So what came about to free us of that curse? A person is justified by his faith in Christ, right? That's what the NT says and that is what I've been saying. Christ came to die for our sins; He delivered us from that curse.\n \nOF course, he was speaking to the Jews, and since christians are gentiles, the jewish laws don't apply to them.\n\n Then why was the promise given to Abraham? If only the Jews suffer why is the law still killing the Gentiles or non-Jewish peoples around the world? Abraham was before Moses and Jesus was before Abraham. Are you saying that there was no sin before the Law of Moses? Nonsense. Then why was Lot saved of Sodom and Gomorrah? Was there no sin in those cities? If there was sin, then there was law; if there was law then it was before Moses and not imputed just to the Jewish people. The Law served no purpose accept through transgression of God's word. \n But, then came the promise of Abraham - the Seed - Christ. Through Him came grace and no longer the sting of death and the strength of sin, for all sin, from the Jewish people to the Gentiles, was and is paid for in full. Then why are people so angry at God or why all the hatred towards Him? Because of sin, not the law, for what does it profit anyone that they should reject Him? They lean on the law and perpetuate sin, leaving them no alternative but to crucify Christ each day, some with each breath.\n To those who wonder about the law and the promises of God - there is no connection. If there had been even one law that could bring life then all the others would be meaningless, bringing about righteousness. What law have you read that ever brought about righteousness? None.\n You have heard that Christ is the Redeemer. Have you ever wondered why? It is because He has redeemed us of the law.\n \n Like I said, it is very dangerous to interpret the law of God in any manner without first considering the highly unused, but very much required, linking of the scriptures. I am afraid that we have a very weak and uninformed society of religious people that cannot put aside one hour to study the Bible before they speak; too lazy to rightly align the scriptures before they haul off with some railing accusations against God or against Christianity. This is where hatred and antipathy get their start.", 
   {
    "unicode_changes_made": true
   }, 
   99174, 
   null, 
   1111103820.0
  ], 
  [
   99275, 
   null, 
   "trebor", 
   "Yes, but not the law of sin, which is why the law was established. You must not overlook that Christ came to fulfill the law and the scriptures, not \"do away\" with them, for any life in sin is under the law and therefore judged by that law. But, in Christ is that law fulfilled and by His blood sins are forgiven. \n The law was not made because of sin, but sin because of the law. Without sin there would be no law and without the law sin would be weak, for the strength of sin is the law. Have you not read in the Bible that \"cursed is the person that does not maintain all the things written in the law\"...? We've already discussed that no man can be justified by the law for there was many times that the blood of animals had to be spilt in atonement. So what came about to free us of that curse? A person is justified by his faith in Christ, right? That's what the NT says and that is what I've been saying. Christ came to die for our sins; He delivered us from that curse.\n \n Then why was the promise given to Abraham? If only the Jews suffer why is the law still killing the Gentiles or non-Jewish peoples around the world? Abraham was before Moses and Jesus was before Abraham. Are you saying that there was no sin before the Law of Moses? Nonsense. Then why was Lot saved of Sodom and Gomorrah? Was there no sin in those cities? If there was sin, then there was law; if there was law then it was before Moses and not imputed just to the Jewish people. The Law served no purpose accept through transgression of God's word. \n But, then came the promise of Abraham - the Seed - Christ. Through Him came grace and no longer the sting of death and the strength of sin, for all sin, from the Jewish people to the Gentiles, was and is paid for in full. Then why are people so angry at God or why all the hatred towards Him? Because of sin, not the law, for what does it profit anyone that they should reject Him? They lean on the law and perpetuate sin, leaving them no alternative but to crucify Christ each day, some with each breath.\n To those who wonder about the law and the promises of God - there is no connection. If there had been even one law that could bring life then all the others would be meaningless, bringing about righteousness. What law have you read that ever brought about righteousness? None.\n You have heard that Christ is the Redeemer. Have you ever wondered why? It is because He has redeemed us of the law.\n \n Like I said, it is very dangerous to interpret the law of God in any manner without first considering the highly unused, but very much required, linking of the scriptures. I am afraid that we have a very weak and uninformed society of religious people that cannot put aside one hour to study the Bible before they speak; too lazy to rightly align the scriptures before they haul off with some railing accusations against God or against Christianity. This is where hatred and antipathy get their start.\n\n \n \n Well, that is a bunch of changing the meanings of the words out of context from historical and context.\n \n I will point out that 'fullfill' is not 'replace'. However, it's your belief, and it is your allegedly immortal soul. It looks plain to me that 'not one with of the law will change will heaven and earth pass' means something different to you than it does to me.", 
   {
    "unicode_changes_made": true
   }, 
   99231, 
   null, 
   1111115220.0
  ], 
  [
   100021, 
   null, 
   "Master_Shake", 
   "You out there Duo?", 
   {}, 
   99275, 
   null, 
   1111391460.0
  ], 
  [
   100049, 
   null, 
   "Big Orn", 
   "Well, that is a bunch of changing the meanings of the words out of context from historical and context.\n\n I expected to get more than that, but at least that much I did expect. If it were not for the fact that religion seeks to justify itself...there is a remote possibility that it could be a good thing.\n \nI will point out that 'fullfill' is not 'replace'. However, it's your belief, and it is your allegedly immortal soul. It looks plain to me that 'not one with of the law will change will heaven and earth pass' means something different to you than it does to me.\n\n Maybe we can discuss your meaining...?", 
   {}, 
   100021, 
   null, 
   1111417860.0
  ], 
  [
   100051, 
   null, 
   "trebor", 
   "I expected to get more than that, but at least that much I did expect. If it were not for the fact that religion seeks to justify itself...there is a remote possibility that it could be a good thing.\n \n Maybe we can discuss your meaining...?\n\n \n Well, it is obvious to me that Jesus was a Jew, and did not intend to change the Jewish religion because of that quote. It was Paul, and the writers of Matthew and Luke that split the Christian religon away from Judaism. The people who followed Paul changed to be Christians, the people who followed James, (jesus's supposed brother), remained Jews.", 
   {}, 
   100049, 
   null, 
   1111418220.0
  ], 
  [
   100057, 
   null, 
   "Big Orn", 
   "Well, it is obvious to me that Jesus was a Jew, and did not intend to change the Jewish religion because of that quote. It was Paul, and the writers of Matthew and Luke that split the Christian religon away from Judaism. The people who followed Paul changed to be Christians, the people who followed James, (jesus's supposed brother), remained Jews.\n\n Even Christ knew that the Jews did not accept Him. And, yes, Peter, for example, did tend to stay with the Jewish tradition of following the law, but was soon led by the Holy Spirit to understand his mistakes.\n The Gospel was then preached in its entirety by all - for they all then understood the scripture where it says of Abraham:  By Abraham all the earth will be blessed... This means the Gentiles (non-Jews).\n \n Until the Gospel is accepted the law will continue for any- and everyone. But, at the same time, grace will be overlooked and misunderstood.", 
   {}, 
   100051, 
   null, 
   1111420320.0
  ], 
  [
   100146, 
   null, 
   "trebor", 
   "Even Christ knew that the Jews did not accept Him. And, yes, Peter, for example, did tend to stay with the Jewish tradition of following the law, but was soon led by the Holy Spirit to understand his mistakes.\n The Gospel was then preached in its entirety by all - for they all then understood the scripture where it says of Abraham:  By Abraham all the earth will be blessed... This means the Gentiles (non-Jews).\n \n Until the Gospel is accepted the law will continue for any- and everyone. But, at the same time, grace will be overlooked and misunderstood.\n\n \n \n The ones that knew Jesus personally stayed Jewish. If Judaism was good enough for Jesus, it should be good enough for you.", 
   {}, 
   100057, 
   null, 
   1111436340.0
  ], 
  [
   100189, 
   null, 
   "Big Orn", 
   "The ones that knew Jesus personally stayed Jewish. If Judaism was good enough for Jesus, it should be good enough for you.\n\n I'll have to sidestep you here for a moment, trebor. Judaism was, and is, a belief that was developed from the ancient Hebrews where the law of the Old Testament was paramount. There's nothing wrong with that belief if you consider that the Redeemer has yet to arrive. I believe that Christ was that Redeemer. He loved the scriptures and explained them in a way that if the Jewish people had listened they would have known that even the \"Law\" prophesied of Him.\n In your opinion Judaism was good enough for Jesus, but don't you know that He came to give life to those ceremonies - to those rituals - even to the \"Law\" itself? I believe that those that actually knew Christ were the very first to preach that fulfillment. James even preached the law of liberty : (James 2:12) If he was stuck on Judaism why would he teach the law of liberty? And why would he speak of adultery (James 4:4) in the spiritual other than the natural if the \"Law\" brought righteousness?", 
   {
    "unicode_changes_made": true
   }, 
   100146, 
   null, 
   1111443540.0
  ], 
  [
   100308, 
   null, 
   "trebor", 
   "I'll have to sidestep you here for a moment, trebor. Judaism was, and is, a belief that was developed from the ancient Hebrews where the law of the Old Testament was paramount. There's nothing wrong with that belief if you consider that the Redeemer has yet to arrive. I believe that Christ was that Redeemer. He loved the scriptures and explained them in a way that if the Jewish people had listened they would have known that even the \"Law\" prophesied of Him.\n In your opinion Judaism was good enough for Jesus, but don't you know that He came to give life to those ceremonies - to those rituals - even to the \"Law\" itself? I believe that those that actually knew Christ were the very first to preach that fulfillment. James even preached the law of liberty : (James 2:12) If he was stuck on Judaism why would he teach the law of liberty? And why would he speak of adultery (James 4:4) in the spiritual other than the natural if the \"Law\" brought righteousness?\n\n \n Except of course, Judaism has never considered a human being to be the Redeemer, nor ever believed that god would become flesh. They got into a lot of trouble with the romans for not accepting the ceasars as being divine.\n The \"messiah\" they are/were looking for is just a man, not a god.", 
   {
    "unicode_changes_made": true
   }, 
   100189, 
   null, 
   1111468200.0
  ], 
  [
   101225, 
   null, 
   "Master_Shake", 
   "You going to respond to me trebor?", 
   {}, 
   100308, 
   null, 
   1111741920.0
  ], 
  [
   101286, 
   null, 
   "trs", 
   "James even preached the law of liberty : (James 2:12) If he was stuck on Judaism why would he teach the law of liberty? And why would he speak of adultery (James 4:4) in the spiritual other than the natural if the \"Law\" brought righteousness?\n\n Because he didn't.\n \n \nKummel presents the reasons that most scholars suspect James to be a pseudepigraph (Introduction to the New Testament, pp. 412-3):[*]The cultured language of James is not that of a simple Palestinian. Sevenster's evidence that the Greek language was much used in Palestine at that time and could be learned does not prove that a Jew whose mother tongue was Aramaic could normally write in literary Greek. Most of those who defend the thesis that James was written by the Lord's brother must assume that it achieved its linguistic form through the help of a Hellenistic Jew, but there is no evidence in the text that the assistance of a secretary gave shape to the present linguistic state of the document, and even if this were the case the question would still remain completely unanswered which part of the whole comes from the real author and which part from the \"secretary.\"[*]It is scarcely conceivable that the Lord's brother, who remained faithful to the Law, could have spoken of \"the perfect law of freedom\" (1:25) or that he could have given concrete expression to the Law in ethical commands (2:11 f) without mentioning even implicitly any cultic-ritual requirements.[*]Would the brother of the Lord really omit any reference to Jesus and his relationship to him, even though the author of JAmes emphatically presents himself in an authoritative role?[*]The debate in 2:14 ff with a misunderstood secondary stage of Pauline theology not only presupposes a considerable chronological distance from Paul - whereas James died in the year 62 - but also betrays complete ignorance of the polemical intent of Pauline theology, which lapse can scarcely be attributed to James, who as late as 55/56 met with Paul in Jerusalem (Acts 21:18 ff).[*]As the history of the canon shows (see 27.2), it was only very slowly and against opposition that James became recognized as the owrk of the Lord's brother, therefore as apostolic and canonical. Thus there does not seem to have been any old tradition that it originated with the brother of the Lord.Udo Schnelle also argues against the authenticity of James (The History and Theology of the New Testament Writings, pp. 385-386):Nonetheless, there are weighty arguments against James the Lord's brother as author of the Letter of James. Central themes of strict Jewish Christian theology such as circumcision, Sabbath, Israel, purity laws and temply play no role in this letter. James is numbered among the few New Testament writings in which neither Israel nor the Jews are mentioned by name. The reception of Old Testament figures (cf. James 2.21-25; 5.10-11, 17-18) and also the references to the Law in an exclusively ethical context were general practices possible anywhere within early Christianity. In contrast to the Antioch incident, the problem of Gentile Christians/Jewish Christians does not appear at all in the Letter of James. The far-reaching differences in soterioogy (see below 7.1.9) indicate that the author of the Letter of James cannot be identical with James the Lord's brother, who according to Gal. 2.9 gave the right hand of fellowship to Paul and explicitly acknowledged his proclamation of the gospel among the Gentiles. In 1.1 the author designates himself douloV qeou kai kuriou Ihsou Xristou (servant of God and the Lord Jesus Christ), and in 3.1 indicates that he is an early Christian teacher. To be sure, a special position and dignity is associated with the term douloV (servant) in James 1.1., but it remains worthy of note that the author neither introduces himself as the Lord's brother nor claims the title stuloV (cf. Gal. 2.9). By including himself in the large group of early Christian teachers (cf. Acts 13.1; 1 Cor. 12.28-29), he disclaims the special authority of the Lord's brother or the three 'pillars' of the Jerusalem mother church, which were used in the Antioch conflict. In addition, James 3.1ff. presupposes an attack on the teaching office and a critical situation associated with it, which again does not correspond to the exclusive position of James the Lord's brother in the history of early Christianity.\n \n If James the Lord's brother were the author of the Letter, then it is amazing that in James 5.10-11 it is Job and not Jesus who serves as an example of willingness to suffer. Also, the presupposed church situation and the polemic in James 2.14-26 point to a later time. The social conflicts within the community that become visible are paralleled especially in the writings of Luke, the Pastorals, and in Revelation. They are evidence of a fundamental social change that happened within the Christian community at the end of the first century. More and more wealthy people entered the church, the gulf between rich and poor church members became greater, and the debate between them grew sharper. In any case, the conflict concerning the unity of faith and works points to the post-Pauline period, as in the churches previously belonging to the Pauline mission field the unity of new being and new actions that Paul had considered self-evident came apart. The polemic of James does not fit Paul himself (see below 7.1.9), so that one must assume either that James the Lord's brother was completely ignorant of Pauline theology or that we are dealing with a debate in post-Pauline times. The deuteropaulines and 2 Peter 3.15-16 docuemnt the fact that these debates in fact took place on very different levels and with distinct emphases. If the Letter of James were to have been writen by James the Lord's brother, then it is remarkable that there is no reflection of the sharp criticism of Paul by James in the deuteropauline writings. Finally, the history of the canon speaks against James the Lord's brother as author of the Letter of James. Prior to 200 CE there is no solid evidence of the literary use of James. In the Muratorian Canon (ca. 200) James is missing, just as in Tertullian, and Eusebius (HE 2.23, 24b, 25) reports of James: 'This is the story of James. He is supposed to be the author of the first of the so-called \"Catholic Letters,\" but let it be noted that its authenticity is doubted, since not many of the Elders have referred either to it or the so-called \"Letter of Jude,\" which likewise has been counted among the 'Catholic Letters.' Still, we are aware that these two letters, like the others, have been read aloud in most of the churches.' The Letter of James began to be generally accepted only after 200 CE, cited for the first time as Scripture in Origen (Select Ps 30.6 [PG 12.1300]). The canonical status of James continued to be disputed, however, and did not attain general acceptance as a canonical document until very late. This would be an extraordinary development if James had really been written by James the brother of the Lord and this had been known in early Christianity. - see Early Christian Writings\nParadoxically, this very Jewish work is written in an excellent Greek style, which ranks among the best in the New Testament and appears to be the work of a trained Hellenistic writer. Those who continue to regard James of Jerusalem as its author are therefore obliged to suppose that a secretary must have put the letter into its present literary form. This assumption is not implausible in the light of ancient practice. Some regard the letter as one of the earliest writings in the New Testament and feel that its content accurately reflects what we would expect of the leader of Jewish Christianity. Moreover, they argue that the type of Jewish Christianity reflected in the letter cannot be situated historically after the fall of Jerusalem in A.D. 70.\n \n Others, however, believe it more likely that James is a pseudonymous work of a later period. In addition to its Greek style, they observe further that (a) the prestige that the writer is assumed to enjoy points to the later legendary reputation of James; (b) the discussion of the importance of good works seems to presuppose a debate subsequent to that in Paul's own day; (c) the author does not rely upon prescriptions of the Mosaic law, as we would expect from the historical James; (d) the letter contains no allusions to James's own history and to his relationship with Jesus or to the early Christian community of Jerusalem. For these reasons, many recent interpreters assign James to the period A.D. 90-100.\n \n \n - see New American Bible: James - Introduction\n", 
   {
    "unicode_changes_made": true
   }, 
   100189, 
   null, 
   1111771800.0
  ], 
  [
   102170, 
   null, 
   "Big Orn", 
   "Because he didn't.\n\n Maybe you are among those interested in the letter of the works and not the spirit of it? Who are we to say who penned the original document? It is there in writing, is it not? If, at some later date, someone re-wrote it in a more readable text...so what? Does that make the message null and void? No.\n \n It appears that James was still strict with the Law, but only because of the innocence of it, not the strength of it. Even he recommended that the Gentiles be given a lesser stringent adherence to the \"letter\" of the law, due to the \"spirit\" of the Law of Christ. It is evident that he did not want Abraham to be forgotten, in part, because of those (like many here) that think the law was destroyed by the coming of Christ. When tradition is compromised, even in the least bit, there is a danger of throwing out the baby with the wash water. He was astute enough to know that, and that wisdom was needed more so then than now when dealing with the physical aspects of the law as compared to the spiritual aspects.", 
   {}, 
   101286, 
   null, 
   1112028900.0
  ], 
  [
   102172, 
   null, 
   "trs", 
   "Maybe you are among those interested in the letter of the works and not the spirit of it? ... It appears that James was still strict with the Law, but only because of the innocence of it, not the strength of it. \nIf the Epistle of James is, in fact, pseudepigraphic, you haven't a clue as to James' position or motivation. All you kow is that the history of your sect was written by the victors, and that these victors rapidly constituted themselves as a Gentile movement and purged themselves of all \"Judaizing\" influences.", 
   {}, 
   102170, 
   null, 
   1112029320.0
  ], 
  [
   102180, 
   null, 
   "Big Orn", 
   "If the Epistle of James is, in fact, pseudepigraphic, you haven't a clue as to James' position or motivation. All you kow is that the history of your sect was written by the victors, and that these victors rapidly constituted themselves as a Gentile movement and purged themselves of all \"Judaizing\" influences.\n\n I can see now that I'll have to step off this \"level playing field\" in order to correspond with you, trs. \n \n I don't think I will, though.\n \n BTW - When a reference is made in a manner where things \"seem\" to be one way or the other, there is always room for debate. You presented such a reference but totally disregarded what it said and inserting your emotional jabs. Who's whining now?\n \n And why present it then make the accusation that I have no clue? Did that reference show proof positive?\n \n As far as this statement:\n \nAll you kow is that the history of your sect was written by the victors...\n\n And we still walk in that victory today. You can't change what Christ did with your wisdom...or the lack thereof.", 
   {}, 
   102172, 
   null, 
   1112031120.0
  ], 
  [
   102192, 
   null, 
   "trebor", 
   "\n And we still walk in that victory today. You can't change what Christ did with your wisdom...or the lack thereof.\n\n \n Of course, people who control the present control what is taught about the past.\n \n And, since there is a good chance that the 'Christ' as written in the New Testament did not actually exist, that 'Chrst' might have done nothing.\n \n Of course, what happened or not actually doesn't matter. What matters is your belief about what happened.", 
   {}, 
   102180, 
   null, 
   1112035440.0
  ], 
  [
   102193, 
   null, 
   "Alan Ryan", 
   "Of course, what happened or not actually doesn't matter. What matters is your belief about what happened.\n\n \n Truth matters: or would you say that \"truth\" is merely what people can be persuaded to believe ?", 
   {}, 
   102192, 
   null, 
   1112035680.0
  ], 
  [
   102209, 
   null, 
   "trs", 
   "BTW - When a reference is made in a manner where things \"seem\" to be one way or the other, there is always room for debate. You presented such a reference but totally disregarded what it said and inserting your emotional jabs. \nWhat on earth are you babbling about?[*]Specifically, what did I disregard in the reference(s) I submitted?[*]Specifically, what are you characterizing as 'emotional jabs'?You made an argument predicated on a faulty presumption of authorship. Period.", 
   {}, 
   102180, 
   null, 
   1112037600.0
  ], 
  [
   102210, 
   null, 
   "trs", 
   "Truth matters: or would you say that \"truth\" is merely what people can be persuaded to believe ?\nThe question is without value: some truths matter, some do not, and 'truth' is never \"merely what people can be persuaded to believe\".", 
   {}, 
   102193, 
   null, 
   1112037840.0
  ], 
  [
   102213, 
   null, 
   "Big Orn", 
   "Of course, people who control the present control what is taught about the past.\n \n And, since there is a good chance that the 'Christ' as written in the New Testament did not actually exist, that 'Chrst' might have done nothing.\n \n Of course, what happened or not actually doesn't matter. What matters is your belief about what happened.\n\n But what good is a belief system if it doesn't work? Is it just magic? Do millions of people around the world go about their lives living a lie? Or does Christ actually perform His promises to those who believe and have faith? Wouldn't a person that holds true to a belief that doesn't work be an idiot? \n \n If Christ was not real and His word no good, I wouldn't stay with Him. If He was not actually born of a virgin, lived as He did, died as He did and arose as He did, then Christianity is a dead religion. Nothing at all would happen when you pray, nothing would happen \"out of nowhere\", so to speak, when things happen beyond your control.\n \n Honestly, there is much more proof for me (and more each passing day) the He is real, than not.", 
   {
    "unicode_changes_made": true
   }, 
   102192, 
   null, 
   1112038260.0
  ], 
  [
   102220, 
   null, 
   "Big Orn", 
   "What on earth are you babbling about? \n\n Don't give references without knowing what they say, trs. You state something as fact that only \"seems\" to be fact.\n \n Read your references first, then post your reply. \n \n Or am I to assume what the reference wants me to assume?\n \n And if you consider me a whiner and a babbler, then just hit the \"ignore\" button.", 
   {}, 
   102209, 
   null, 
   1112038860.0
  ], 
  [
   102222, 
   null, 
   "Alan Ryan", 
   "The question is without value: some truths matter, some do not, and 'truth' is never \"merely what people can be persuaded to believe\".\n \n \n It was obvious, in the context of this discussion, that I was referring to historical truth. It was also obvious that my question was rhetorical. \n \n If you'd bothered to read the post I was responding to, you might have observed it suggested that the \"truth\" about the past is controlled by what is taught about it now. \n \n Which truths that matter can be separated from those that don't ? Depends on what you mean by \"matter\", doesn't it ? Perhaps nothing matters very much, and few things matter at all ? Or are these further questions \"without value\"?", 
   {}, 
   102210, 
   null, 
   1112039160.0
  ], 
  [
   102267, 
   null, 
   "trebor", 
   "But what good is a belief system if it doesn't work? Is it just magic? Do millions of people around the world go about their lives living a lie? Or does Christ actually perform His promises to those who believe and have faith? Wouldn't a person that holds true to a belief that doesn't work be an idiot? \n \n If Christ was not real and His word no good, I wouldn't stay with Him. If He was not actually born of a virgin, lived as He did, died as He did and arose as He did, then Christianity is a dead religion. Nothing at all would happen when you pray, nothing would happen \"out of nowhere\", so to speak, when things happen beyond your control.\n \n Honestly, there is much more proof for me (and more each passing day) the He is real, than not.\n\n \n You know.. if you believe he did, and it is just a myth, does it matter, if it makes you happier, and lead a more productive life? \n \n Pray is a nice bit of placebo. It helps people handle tough situations. Why would the myth that he was 'born of a virgin' matter? \n \n It seems to me that you are, like many, are worshipping Christ the God rather than looking at the message of Jesus the preacher. All the 'Christ the God' stuff comes from Paul, and those that followed Paul. \n \n If you think that all those myths are needed to be the literal truth to have Christanity be a live religion, then christainity is dead.", 
   {
    "unicode_changes_made": true
   }, 
   102213, 
   null, 
   1112045760.0
  ], 
  [
   102287, 
   null, 
   "Master_Shake", 
   "You going to respond to me trebor?\n\n \n I guess not.", 
   {}, 
   101225, 
   null, 
   1112049120.0
  ], 
  [
   102296, 
   null, 
   "Big Orn", 
   "You know.. if you believe he did, and it is just a myth, does it matter, if it makes you happier, and lead a more productive life?\n\n No, what I'm asking is - if your belief system is just a belief system...period. Like believing in Santa Claus, but knowing, really that mom and dad buy the presents, but it makes you feel good knowing that someone, a stanger, wants to give you something for simply being good.\n If you can go through life letting that take your time with no returns on your investment, what do you gain? Might as well go fishing.\n \nPray is a nice bit of placebo. It helps people handle tough situations. Why would the myth that he was 'born of a virgin' matter?\n\n Placebo for what? What remedy? What ailments? If a placebo worked all the time there would be no need for doctors.\n \n What I'm referring to is the real drug, the one that actually cures something.\n \nIt seems to me that you are, like many, are worshipping Christ the God rather than looking at the message of Jesus the preacher. All the 'Christ the God' stuff comes from Paul, and those that followed Paul.\n\n Not really. I'm the inclusive type; One Gospel covers all. :)\n \nIf you think that all those myths are needed to be the literal truth to have Christanity be a live religion, then christainity is dead.\n\n If one word of the Bible is a lie the whole thing is a lie. Someone may argue with that, but they fool themselves by doing so.", 
   {}, 
   102267, 
   null, 
   1112050080.0
  ], 
  [
   102302, 
   null, 
   "trebor", 
   "Truth matters: or would you say that \"truth\" is merely what people can be persuaded to believe ?\n\n \n That sounds true to me.\n \n The war that happened in the states that ended in 1865. Was it the 'civil' war, or was it , as taught in the south, \"The war of northern aggression\"?", 
   {}, 
   102193, 
   null, 
   1112050680.0
  ], 
  [
   102305, 
   null, 
   "trebor", 
   "No, what I'm asking is - if your belief system is just a belief system...period. Like believing in Santa Claus, but knowing, really that mom and dad buy the presents, but it makes you feel good knowing that someone, a stanger, wants to give you something for simply being good.\n If you can go through life letting that take your time with no returns on your investment, what do you gain? Might as well go fishing.\n \n Placebo for what? What remedy? What ailments? If a placebo worked all the time there would be no need for doctors.\n \n\n \n That, it seems, is up to the individual person praying. All sorts of things are attributed to the power of prayer. Winning the lottery (disregarding all those who lost), Surviving a horrifying accident (disreguarding all those who died), and things like that.", 
   {}, 
   102296, 
   null, 
   1112050860.0
  ], 
  [
   102308, 
   null, 
   "trebor", 
   "\n Not really. I'm the inclusive type; One Gospel covers all. :)\n \n If one word of the Bible is a lie the whole thing is a lie. Someone may argue with that, but they fool themselves by doing so.\n\n \n \n If that is your belief, then the whole thing is a lie. \n \n There are some gospels that have mutually exclusive claims from other gospels.", 
   {}, 
   102296, 
   null, 
   1112051040.0
  ], 
  [
   102315, 
   null, 
   "Big Orn", 
   "If that is your belief, then the whole thing is a lie. \n \n There are some gospels that have mutually exclusive claims from other gospels.\n\n Pray tell...", 
   {}, 
   102308, 
   null, 
   1112051640.0
  ], 
  [
   102416, 
   null, 
   "Alan Ryan", 
   "That sounds true to me.\n \n The war that happened in the states that ended in 1865. Was it the 'civil' war, or was it , as taught in the south, \"The war of northern aggression\"?\n\n The truth is (in this instance) that it was a war. A war by any other name would still be a war.", 
   {}, 
   102302, 
   null, 
   1112089380.0
  ], 
  [
   102443, 
   null, 
   "trebor", 
   "The truth is (in this instance) that it was a war. A war by any other name would still be a war.\n\n \n \n Yes, it is a war. But the way it is taught in the South encourages prejudice against northerners. It is that the 'truth'??", 
   {}, 
   102416, 
   null, 
   1112107500.0
  ], 
  [
   102456, 
   null, 
   "Alan Ryan", 
   "Yes, it is a war. But the way it is taught in the South encourages prejudice against northerners. It is that the 'truth'??\n\n \n \n Of course not: I'm talking about objective truth - not the \"relative\" versions with which you are confusing it.", 
   {}, 
   102443, 
   null, 
   1112111700.0
  ], 
  [
   102459, 
   null, 
   "Big Orn", 
   "Yes, it is a war. But the way it is taught in the South encourages prejudice against northerners. It is that the 'truth'??\n\n Do you live in the south, trebor? I have lived here all my life and have never heard that.\n \n And \"the way it's taught in the south\" is the way it's \"taught\" anywhere else as far as I know.", 
   {}, 
   102443, 
   null, 
   1112112120.0
  ], 
  [
   102485, 
   null, 
   "trebor", 
   "Do you live in the south, trebor? I have lived here all my life and have never heard that.\n \n And \"the way it's taught in the south\" is the way it's \"taught\" anywhere else as far as I know.\n\n \n \n Ah, they changed it then. One of my friends was educated in South Carolina.. and said that is how it was taught to him. Mind you , this was about 40 years ago...", 
   {}, 
   102459, 
   null, 
   1112116200.0
  ], 
  [
   102486, 
   null, 
   "trebor", 
   "Of course not: I'm talking about objective truth - not the \"relative\" versions with which you are confusing it.\n\n \n In that case.. was the Korea confict a war?", 
   {}, 
   102456, 
   null, 
   1112116260.0
  ], 
  [
   102510, 
   null, 
   "Alan Ryan", 
   "In that case.. was the Korea confict a war?\n\n \n Since the army of North Korea came south without invitation and the United Nations sent an expeditionary force to oppose this invasion and this resulted in a lot of fighting, bloodshed, etc. etc. I have no problem calling this conflict a war. \n Whether it was a civil war, a war of \"liberation\", a war of conquest, a war of ideological aggression, a war against China by proxy, - give it any label you wish, it was still a war.", 
   {}, 
   102486, 
   null, 
   1112119440.0
  ], 
  [
   102640, 
   null, 
   "Master_Shake", 
   "Now we're talking about the Civil War and the Korean War? Seems like we have strayed quite far from the topic.", 
   {}, 
   102510, 
   null, 
   1112144820.0
  ], 
  [
   102652, 
   null, 
   "Duo_Maxwell", 
   "Now we're talking about the Civil War and the Korean War? Seems like we have strayed quite far from the topic.\n\n \n Not my fault. I blame you guys. emoticon_xangel", 
   {}, 
   102640, 
   null, 
   1112149200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Do you consider paganism bad?", 
  "url": "http://www.4forums.com/political/religion-debates/4533-do-you-consider-paganism-bad.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4533, 
  "discussion_files": [
   [
    "31647.html", 
    "http://www.4forums.com/political/religion-debates/4533-do-you-consider-paganism-bad-print.html"
   ], 
   [
    "31648.html", 
    "http://www.4forums.com/political/religion-debates/4533-do-you-consider-paganism-bad-8-print.html"
   ], 
   [
    "31649.html", 
    "http://www.4forums.com/political/religion-debates/4533-do-you-consider-paganism-bad-6-print.html"
   ], 
   [
    "31650.html", 
    "http://www.4forums.com/political/religion-debates/4533-do-you-consider-paganism-bad-4-print.html"
   ], 
   [
    "31651.html", 
    "http://www.4forums.com/political/religion-debates/4533-do-you-consider-paganism-bad-5-print.html"
   ], 
   [
    "31652.html", 
    "http://www.4forums.com/political/religion-debates/4533-do-you-consider-paganism-bad-7-print.html"
   ], 
   [
    "31653.html", 
    "http://www.4forums.com/political/religion-debates/4533-do-you-consider-paganism-bad-3-print.html"
   ], 
   [
    "31654.html", 
    "http://www.4forums.com/political/religion-debates/4533-do-you-consider-paganism-bad-2-print.html"
   ]
  ], 
  "identifier": 4533
 }
]