[
 [
  [
   98048, 
   null, 
   "daewoo", 
   "Ok, so it is older than dirt. When I got it, the thing was cutting edge. Now I can't erase the memory card, so I can only change about 7 of the songs (it really only hold 14)\n \n Anybody know anything about these things? If I buy a new memory card for it is it likely to straighten up its act?", 
   {
    "post_info": {
     "post_title": "RCA kazoo"
    }
   }, 
   null, 
   null, 
   1110868200.0
  ], 
  [
   98052, 
   null, 
   "Master_Shake", 
   "I haven't heard of it, but it sounds interesting. Could you tell us more about it or give us a website where we could see it and read about it?", 
   {}, 
   98048, 
   null, 
   1110868500.0
  ], 
  [
   98115, 
   null, 
   "daewoo", 
   "There is a review of it at :\n \n http://www.neoseeker.com/Articles/Hardware/Reviews/rcakazoo/\n \n I actually got mine at the end of 2000. the one in the article has 64 mb internal, mine only has 32. When I bought the thing it was supposed to be the coolest MP3 player going. It was the bomb. \n \n To its credit, it is more or less still going strong today. I lost it about 6 months ago, and found it the other day under the tool box in my truck, so it has been out int he weather for about 6 months. I disassembled it and dried it out, and it seems to work fine, except that when I plug it in to change the music on it, it does not access the memory card, only the internal memory. The player sees the card just fine, and I can play the music on it, I just can't change it.", 
   {}, 
   98052, 
   null, 
   1110877020.0
  ], 
  [
   98423, 
   null, 
   "Duo_Maxwell", 
   "Sounds like you're going to need to format the card externally. \n \n Its a MMC and you can likely find someone who has a reader for that. Just format it and you should be good.", 
   {}, 
   98115, 
   null, 
   1110931500.0
  ], 
  [
   98430, 
   null, 
   "daewoo", 
   "DAMN. I already went and bought a new card for it. 128 MB at staples for $32. Not as bad as I thought it would be (when I bought the 32 MB card I have been using it was nearly $90, and I haven't priced them since).\n \n New card seems to work fine. I will take the old one into the office and format it there (I know some of the machines have programmers).", 
   {}, 
   98423, 
   null, 
   1110932280.0
  ], 
  [
   98506, 
   null, 
   "Duo_Maxwell", 
   "DAMN. I already went and bought a new card for it. 128 MB at staples for $32. Not as bad as I thought it would be (when I bought the 32 MB card I have been using it was nearly $90, and I haven't priced them since).\n \n New card seems to work fine. I will take the old one into the office and format it there (I know some of the machines have programmers).\n\n \n Well, you're going to be saying Damn again.\n \n $20 for a 128 mb MCC, with shipping.\n \n http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&category=43476&item=7500935511&rd=1\n \n Ebay", 
   {}, 
   98430, 
   null, 
   1110942000.0
  ], 
  [
   98516, 
   null, 
   "daewoo", 
   "Well, you're going to be saying Damn again.\n \n $20 for a 128 mb MCC, with shipping.\n \n http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&category=43476&item=7500935511&rd=1\n \n Ebay\n\n \n Yes, but thats Ebay. I hate Ebay. When I want something, I want it RIGHT NOW. Waiting for shipping sucks.", 
   {}, 
   98506, 
   null, 
   1110942540.0
  ], 
  [
   98532, 
   null, 
   "Duo_Maxwell", 
   "Yes, but thats Ebay. I hate Ebay. When I want something, I want it RIGHT NOW. Waiting for shipping sucks.\n\n \n Spoken like a true American.\n \n hahahahahahhahaha", 
   {}, 
   98516, 
   null, 
   1110944400.0
  ], 
  [
   192557, 
   null, 
   "jazyjason", 
   "LOL pretty funny. I have an iRiver 20 gig, but it's $270. My cousin has an RCA and I helped her with it, she's computer illiterate (speling? lol). So now she has like 2 CD's on it.", 
   {}, 
   98532, 
   null, 
   1137395280.0
  ], 
  [
   208827, 
   null, 
   "tim_a33", 
   "The uploading and everything is quite easy on the kazoo unlike every one says. But it doesnt have nearly enough memory so i went out to by a 128 mb mmc card. I uploaded the songs to the card and put it in my kazoo and it readi it but the SONGS WERE NOT THERE please i need some help people does any one know emoticon_confused", 
   {
    "post_info": {
     "post_title": "MMC problems"
    }
   }, 
   192557, 
   null, 
   1145667060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  RCA kazoo", 
  "url": "http://www.4forums.com/political/music-players/4540-rca-kazoo.html", 
  "breadcrumbs": [
   "Music players"
  ], 
  "id_number": 4540, 
  "discussion_files": [
   [
    "27053.html", 
    "http://www.4forums.com/political/music-players/4540-rca-kazoo-print.html"
   ]
  ], 
  "identifier": 4540
 }
]