[
 [
  [
   98436, 
   null, 
   "daewoo", 
   "I just got chewed out and accused of planting seeds of agression in my 6 month old for letting him listen to the Ballad of the Green Beret. Personally, I think that the dire predictions made byt the half hysterical lady are a little off base. What do you guys think?\n \n A couple years ago I got a list of songs from a trusted family friend who works with young children with developmental disabilities. She caimed that in here experince, nearly all infants (under 2 years) respond positively to these songs. The green beret song (as done by Barry Sadler) was at the top of the list. For some reason, screaming children will stop screaming to listen to that song.\n \n Other songs on the list:\n \n He stopped loving her today by George Jones (no brainer...I mean, it IS the best country song ever written)\n Moonlight Sonata\n Pachabel\n Big Bad John (the original...Jimmy dean....they don't seem to like it as ddone by johnny cash)\n The magic flute (motzart)\n Its alright (big head todd)\n copperhead road (steve earl)\n \n As an interesting side not, Carmina Burana (carl orff) makes young children cry\n \n What do you guys think? Is my son destined to be a sociopath becuase I play the green beret song to him (it is what I sing when I rock him to sleep as well). \n \n I did the same with my daughter who is currently 2 and a half. She does not seem to be psychotic, though at time I wonder if maybe she does not have some pretty serious mental problems.", 
   {
    "post_info": {
     "post_title": "Music for infants"
    }
   }, 
   null, 
   null, 
   1110933060.0
  ], 
  [
   98446, 
   null, 
   "Big Orn", 
   "I just got chewed out and accused of planting seeds of agression in my 6 month old for letting him listen to the Ballad of the Green Beret. Personally, I think that the dire predictions made byt the half hysterical lady are a little off base. What do you guys think?\n \n A couple years ago I got a list of songs from a trusted family friend who works with young children with developmental disabilities. She caimed that in here experince, nearly all infants (under 2 years) respond positively to these songs. The green beret song (as done by Barry Sadler) was at the top of the list. For some reason, screaming children will stop screaming to listen to that song.\n \n Other songs on the list:\n \n He stopped loving her today by George Jones (no brainer...I mean, it IS the best country song ever written)\n Moonlight Sonata\n Pachabel\n Big Bad John (the original...Jimmy dean....they don't seem to like it as ddone by johnny cash)\n The magic flute (motzart)\n Its alright (big head todd)\n copperhead road (steve earl)\n \n As an interesting side not, Carmina Burana (carl orff) makes young children cry\n \n What do you guys think? Is my son destined to be a sociopath becuase I play the green beret song to him (it is what I sing when I rock him to sleep as well).\n\n Bimbo had two big blue eyes that lit up like the stars... by Jim Reaves. Now that one has put many of my kids to sleep or just to settle them down. It was all about Jim's voice mostly, though. I had to practice alot before they'd put up with me singing it.\n \n But, the Green Beret song is not a bad song, either. It's a good smooth tone. That lady must have been in bad mood. What did you do to her? emoticon_rolleyes :p \n Like you said it's a combination of music and singer that does the trick, regardless of the lyrics as far as children are concerned. My oldest love the Beach Boys song, Little Hood Scoop for the music and band only. The reason I say that is because he'd sing, \"My little Hula Hoop!!\", all day long. I think some folks are just plain dense to think that, in general, kids get the whole ball of wax out of songs.\n \nI did the same with my daughter who is currently 2 and a half. She does not seem to be psychotic, though at time I wonder if maybe she does not have some pretty serious mental problems.\n\n Maybe that's because she has to put up with you... emoticon_cool \n \n And I took that last quote as a joke...hope it was anyway. :)", 
   {}, 
   98436, 
   null, 
   1110934020.0
  ], 
  [
   98469, 
   null, 
   "daewoo", 
   "Bimbo had two big blue eyes that lit up like the stars... by Jim Reaves. Now that one has put many of my kids to sleep or just to settle them down. It was all about Jim's voice mostly, though. I had to practice alot before they'd put up with me singing it.\n \n But, the Green Beret song is not a bad song, either. It's a good smooth tone. That lady must have been in bad mood. What did you do to her? emoticon_rolleyes :p \n Like you said it's a combination of music and singer that does the trick, regardless of the lyrics as far as children are concerned. My oldest love the Beach Boys song, Little Hood Scoop for the music and band only. The reason I say that is because he'd sing, \"My little Hula Hoop!!\", all day long. I think some folks are just plain dense to think that, in general, kids get the whole ball of wax out of songs.\n\n \n I personally don't think that the kid has any idea what the lyrics mean, they like the beat and the voice, like you said. I was just really surprised at the suggestion I was somehow damaging my children by playing the green beret song to an infant. I wondered what other opinions may be on this.\n \n \nMaybe that's because she has to put up with you... emoticon_cool \n \n And I took that last quote as a joke...hope it was anyway. \n \n \n She is 2. They are all a littl e crazy at that age.\n \n the other day she was sitting on the counch in my shop watching me work on something. She was drinking milk out of a glass. When she finished, she threw the glass on the floor and broke it. The following conversation went like this:\n \n Dad: \"Why did you do that? You broke the cup\".\n kid: \"I didn't know\"\n Dad: \"You didn't know what? You didn't know that the glass would break\"\n kid: \"yes\"\n Dad: \"do glasses break when you drop them on the floor?\"\n Kid: \"yes\"\n Dad: \"If you throw the glass, is it going to hit the floor\"\n Kid: \"yes\"\n Dad: \"if the glass hits the floor, does it break\"\n Kid \"yes\"\n Dad \"So, if you throw the glass, it will break?\"\n Kid: \"I don't know.\"\n Dad \"Just don't throw glasses when you are done with them\"\n Kid \"I know\"\n Dad....wanders off confused in search of a broom and a dust pan\n \n Strange thing about two year olds. At times, some of the things they can do or figure out are som impressive that it makes you wonder if they are geniuses. Then they turn around and do things that make you wonder if maybe they are not mildly retarded.", 
   {}, 
   98446, 
   null, 
   1110936000.0
  ], 
  [
   99711, 
   null, 
   "jim's trucking", 
   "Try some classical music...no words, just pleasant sounds.", 
   {}, 
   98469, 
   null, 
   1111266900.0
  ], 
  [
   100134, 
   null, 
   "Anastasia", 
   "My youngest son responds very well to music!! He has since he was alittle infant.\n I will have to pay closer attention to what gets him going. We are a very musical family amnd the range of music we listen to is VERY wide.\n Interesting that Carmina Burana is said to make children cry, I will have to test that theory since that is one my favorites!\n Sinjin and I saw it live at the Hollywood Bowl a few years ago with the LA Masters Choral it was to die for!!!!!!", 
   {}, 
   99711, 
   null, 
   1111434300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Music for infants", 
  "url": "http://www.4forums.com/political/parenting/4547-music-infants.html", 
  "breadcrumbs": [
   "Parenting"
  ], 
  "id_number": 4547, 
  "discussion_files": [
   [
    "10464.html", 
    "http://www.4forums.com/political/parenting/4547-music-infants-print.html"
   ]
  ], 
  "identifier": 4547
 }
]