[
 [
  [
   98451, 
   null, 
   "MrWriteLA", 
   "...from \"morallybankrupt\" on the NY Times Gay Rights forum:\n \n \n1. Homosexuality is not natural, much like eyeglasses, polyester, and birth control. \n \n 2. Heterosexual marriages are valid because they produce children. Infertile couples and old people can't legally get married because the world needs more children. \n \n 3. Obviously, gay parents will raise gay children, since straight parents only raise straight children. \n \n 4. Straight marriage will be less meaningful if Gay marriage is allowed, since Britney Spears' 55-hour just-for-fun marriage was meaningful. Also, as further proof of this I have documented a long study which strictly proves that only heterosexuals are capable of upholding the sacred bonds of marriage that. Oh, wait, I'll have to get back to this later, \"Who Wants to Marry a Millionaire\" is on. \n \n 5. Heterosexual marriage has been around a long time and hasn't changed at all; women are property, blacks can't marry whites, and divorce is illegal and punishable by death. \n \n 6. Gay marriage should be decided by people not the courts because the majority-elected legislatures, not courts, have historically protected the rights of the minorities. \n \n 7. Gay marriage is not supported by religion. In a theocracy like ours, the values of one religion are imposed on the entire country. That's why we have only one religion in America. \n \n 8. Gay marriage will encourage people to be gay, in the same way that hanging around tall people will make you tall. \n \n 9. Legalizing gay marriage will open the door to all kinds of crazy behavior. People may even wish to marry their pets because a dog has legal standing and can sign a marriage contract. \n \n 10. Children can never succeed without a male and a female role model at home. That's why single parents are forbidden to raise children. \n \n 11. Gay marriage will change the foundation of society. Heterosexual marriage has been around for a long time, and we could never adapt to new social norms because we haven't adapted to things like cars or longer lifespan. \n \n 12. Civil unions, providing most of the same benefits as marriage with a different name are better, because a \"separate but equal\" institution is always constitutional. Separate schools for African-Americans worked just as well as separate marriages for gays and lesbians will. And let's not forget camps! If those homosexuals get too rowdy, we can always send them off to go camping for a bit. Just look at how it mellowed out the Jews in WWII Germany!\n", 
   {
    "post_info": {
     "post_title": "Satire: 12 Reasons Why Gay Marriage Should Not Be Allowed"
    }
   }, 
   null, 
   null, 
   1110934440.0
  ], 
  [
   98456, 
   null, 
   "Duo_Maxwell", 
   "I believed someone already posted that here, but it is no less funny. \n \n The sad thing is, the antis won't realize that their arguments are based on that very list.", 
   {}, 
   98451, 
   null, 
   1110934980.0
  ], 
  [
   98460, 
   null, 
   "Steeeeve", 
   "8. Gay marriage will encourage people to be gay, in the same way that hanging around tall people will make you tall. \n \n This may be true because you cant chance your height...but let me tell you...\n \n hanging around jack asses will make you a jack XXX", 
   {}, 
   98456, 
   null, 
   1110935160.0
  ], 
  [
   98463, 
   null, 
   "sinjin", 
   "8. Gay marriage will encourage people to be gay, in the same way that hanging around tall people will make you tall. \n \n This may be true because you cant chance your height...but let me tell you...\n \n hanging around jack asses will make you a jack XXX\n\n \n Hard to argue with the genuine article. emoticon_xclown", 
   {}, 
   98460, 
   null, 
   1110935640.0
  ], 
  [
   98483, 
   null, 
   "Steeeeve", 
   "hehe, I was just kidding around not trying to make a point...you gotta admit though, \"jerks\" (to use a nice term) breed \"jerks\".", 
   {}, 
   98463, 
   null, 
   1110937860.0
  ], 
  [
   98518, 
   null, 
   "sinjin", 
   "hehe, I was just kidding around not trying to make a point...you gotta admit though, \"jerks\" (to use a nice term) breed \"jerks\".\n\n \n Don't be so hard on your folks.", 
   {}, 
   98483, 
   null, 
   1110942600.0
  ], 
  [
   98563, 
   null, 
   "zachvac", 
   "The first time I read this I didn't realize it was satire. The version I saw didn't have #4 (it still had a #4 it was just something different or in a different order or whatever) there so I really thought someone believed this. At #5 I thought the person who posted it was completely insane and after reading the whole thing I posted something pointing out how stupid this was and how most of them weren't factually correct. When someone pointed it out, it seemed obvious it was satire.", 
   {}, 
   98518, 
   null, 
   1110951120.0
  ], 
  [
   98564, 
   null, 
   "zachvac", 
   "I would like to make one point about #12. I support gay marriage but the separate but equal argument doesn't work. Just because it didn't work in some instances doesn't mean it won't work in others. We have \"separate but equal\" bathrooms. \"separate and clearly unequal\" sports teams. I haven't heard arguments about that. The main problem is that civil unions aren't equal so it doesn't matter. Just thought I'd point that out.", 
   {}, 
   98563, 
   null, 
   1110951240.0
  ], 
  [
   98632, 
   null, 
   "wsm2506", 
   "The first time I read this I didn't realize it was satire. The version I saw didn't have #4 (it still had a #4 it was just something different or in a different order or whatever) there so I really thought someone believed this. At #5 I thought the person who posted it was completely insane and after reading the whole thing I posted something pointing out how stupid this was and how most of them weren't factually correct. When someone pointed it out, it seemed obvious it was satire.\n\n \n The sad part is, many people DO believe ALL of it!!!!!!!!!!!", 
   {}, 
   98563, 
   null, 
   1110987720.0
  ], 
  [
   99236, 
   null, 
   "mana'ia", 
   ". Homosexuality is not natural, much like eyeglasses, polyester, and birth control. \n \n There is a natural need to see clearly, wear clothes, and regulate child birth.\n \n \n \n \n2. Heterosexual marriages are valid because they produce children. Infertile couples and old people can't legally get married because the world needs more children. \n \n Marriage is to promote children bearing and making a family unit. Like small business loans are made to promtoe business, not every business will eb successful but that is the prupose of the loans.\n \n It is impossible to know if a heterosexual will give birth just the likelihood.\n \n \n \n \n \n \n3. Obviously, gay parents will raise gay children, since straight parents only raise straight children. \n \n No the agrument is misstated. Gay aprents are not the optimal palce to raise a family. Gay parents can but the ideal place is a traditional family.\n \n \n \n \n4. Straight marriage will be less meaningful if Gay marriage is allowed, since Britney Spears' 55-hour just-for-fun marriage was meaningful. Also, as further proof of this I have documented a long study which strictly proves that only heterosexuals are capable of upholding the sacred bonds of marriage that. Oh, wait, I'll have to get back to this later, \"Who Wants to Marry a Millionaire\" is on. \n \n Gay marriage will change the institution. Just becasue some epopel are bad at fulfilling something doesn't mean that others should be allwoed to corrupt the institution as well. It like saying since many people default on student loans, then loans standards should be relaxed to accommodate other people who can as easily default on a loan.\n \n \n \n5. Heterosexual marriage has been around a long time and hasn't changed at all; women are property, blacks can't marry whites, and divorce is illegal and punishable by death. \n \n Those haven't change the institution of marraige just the legal ramification, parameters, and requirements. The concept still is the same.\n \n \n \n \n \n6. Gay marriage should be decided by people not the courts because the majority-elected legislatures, not courts, have historically protected the rights of the minorities. \n \n The people should decide becasue that is democracy. There have been times which democracy has failed but when the courts intiate against the people. The people have the right to change the constitution when courts abuse their poswers. They can't violate separation of powers and not expect the people to change it. \n \n \n \n \n \n7. Gay marriage is not supported by religion. In a theocracy like ours, the values of one religion are imposed on the entire country. That's why we have only one religion in America. \n \n Democracy determines what is morally acceptable in this country. WE have prositution legalized in Nevada but other states do not accept it. That is democracy. The people decide what is \"right\" and \"wrong\" based upon teh criteria that is conforming to the constituion.\n \n \n \n \n8. Gay marriage will encourage people to be gay, in the same way that hanging around tall people will make you tall. \n \n Gay marriage will send the message that homosexuality is acceptable. it will enable many people to practice ti more freely isntead of seeking treatment.\n \n \n \n \n9. Legalizing gay marriage will open the door to all kinds of crazy behavior. People may even wish to marry their pets because a dog has legal standing and can sign a marriage contract. \n \n How can you draw a line where marraige will end? Polygamy, bigamy, underage people? Any argument for gay marriage can almsot be applied to those marraiges.\n \n \n \n \n\n 10. Children can never succeed without a male and a female role model at home. That's why single parents are forbidden to raise children. \n \n The argument is children are most successful in traditional families.\n \n \n \n \n11. Gay marriage will change the foundation of society. Heterosexual marriage has been around for a long time, and we could never adapt to new social norms because we haven't adapted to things like cars or longer lifespan. \n \n \n cars address the needs of transportation. The need for transportaion has always existed.\n \n Longre lifespans have been around before. We are adapted to living longer.\n \n \n \n \n \n12. Civil unions, providing most of the same benefits as marriage with a different name are better, because a \"separate but equal\" institution is always constitutional. Separate schools for African-Americans worked just as well as separate marriages for gays and lesbians will. And let's not forget camps! If those homosexuals get too rowdy, we can always send them off to go camping for a bit. Just look at how it mellowed out the Jews in WWII Germany! \n\n Civil unions is a copmpromised offer to no recognition. We are saying you ahve the irght to enter the marraige institution but oif you want to enter a different institution this is what we are willing to offer.\n \n It's like saying you have the right to cross the stree at the cross walk.\n \n Gays say that crosswalk isn't appealling to me. I want to cross right here. We say fine you can have a cross walk right there but we won't put a light to regulate it.\n \n Do you have every right to cross at the same cross walk?\n \n Why do you want a different crosswalk because the other one is appealling?", 
   {}, 
   98451, 
   null, 
   1111104240.0
  ], 
  [
   99239, 
   null, 
   "jyoshu", 
   "No the agrument is misstated. \n\n \n Of course the whole thing is pretty much a misrepresentation, from the first word. \n \n But we're supposed to let it go and not take it seriously--remember? Its a \"satire.\" emoticon_rolleyes", 
   {}, 
   99236, 
   null, 
   1111105200.0
  ], 
  [
   99306, 
   null, 
   "jitobear", 
   "There is a natural need to see clearly, wear clothes, and regulate child birth.\n \n Marriage is to promote children bearing and making a family unit. Like small business loans are made to promtoe business, not every business will eb successful but that is the prupose of the loans.\n \n It is impossible to know if a heterosexual will give birth just the likelihood.\n\n \n But what about the married couple who know right up front they do not intend to have children, don't even intend to try? Do we ban them from marriage to?\n \n \nNo the agrument is misstated. Gay aprents are not the optimal palce to raise a family. Gay parents can but the ideal place is a traditional family.\n\n \n Balls. It wasn't for mine, and I will thank you kindly to keep your narrow, boring, ideas about \"traditional\" out of MY family.\n \n \nGay marriage will change the institution. Just becasue some epopel are bad at fulfilling something doesn't mean that others should be allwoed to corrupt the institution as well. It like saying since many people default on student loans, then loans standards should be relaxed to accommodate other people who can as easily default on a loan.\n\n \n I know a miriad of gay couples who would corrupt it signifigantly less than Brittney.\n \n \nThe people should decide becasue that is democracy. There have been times which democracy has failed but when the courts intiate against the people. The people have the right to change the constitution when courts abuse their poswers. They can't violate separation of powers and not expect the people to change it. \n\n \n Actually it's a Republic. \n \n Shall we put your marriage to the vote?\n \n \nDemocracy determines what is morally acceptable in this country. WE have prositution legalized in Nevada but other states do not accept it. That is democracy. The people decide what is \"right\" and \"wrong\" based upon teh criteria that is conforming to the constituion.\n\n \n No - individuals determine what is morally acceptable. You consider homosexuality immoral. I consider your attempts to institutionalize your bigotry immoral.\n \n Governments determine what is legal - not moral.\n \n And once again - we are a Republic.\n \n \nGay marriage will send the message that homosexuality is acceptable. it will enable many people to practice ti more freely isntead of seeking treatment.\n\n \n There isn't treatment for being gay that is accepted by a single reputable medical or psychological organization. And homosexuality is acceptable - hate to break it you, but it's not illegal to be gay or engage in gay sex. \n \n \nHow can you draw a line where marraige will end? Polygamy, bigamy, underage people? Any argument for gay marriage can almsot be applied to those marraiges.\n\n \n How about right before your marriage? - if it leads to such disasters let's do away with all of it.\n \n \nThe argument is children are most successful in traditional families.\n\n \n Not mine.", 
   {}, 
   99236, 
   null, 
   1111122420.0
  ], 
  [
   99314, 
   null, 
   "joebrummer", 
   "Originally Posted by mana'ia\n Gay marriage will send the message that homosexuality is acceptable. it will enable many people to practice ti more freely isntead of seeking treatment.\n\n \n Treatment, none have been successful. There is no \"reliable\" evidence that sexual orientation can be changed. Except for religious groups some who mask themsleves as secular until you really read their lituature. No Evidence of treatment exists. Much has been tried, but none is needy. If it ain't broke, don't fix it.\n \n If you have some credible evidence I would be hapy to look at it, but I doubt that you do. Why do people insist on this rubbish that gays need treatment. It is like treating people who are left handed or those who see sound.", 
   {}, 
   99306, 
   null, 
   1111123080.0
  ], 
  [
   99324, 
   null, 
   "StrategosFF", 
   " Gay marriage will send the message that homosexuality is acceptable. it will enable many people to practice ti more freely isntead of seeking treatment. \n\n \n Are you implying homosexuals need treatment? And do you feel that the current social environment is condusive to said individuals to feel comfortable about seeking said treatment?", 
   {}, 
   99236, 
   null, 
   1111124700.0
  ], 
  [
   99377, 
   null, 
   "jyoshu", 
   "If you have some credible evidence I would be hapy to look at it, but I doubt that you do. Why do people insist on this rubbish that gays need treatment. It is like treating people who are left handed or those who see sound.\n\n \n Left handed people don't even need treatment to learn to write with their other hand successfully.\n \n And I agree there is no need to \"treat\" lefties, after all they don't have the highest HIV rates in the country and pretty much make social rebellion the norm in their lives.", 
   {}, 
   99314, 
   null, 
   1111160280.0
  ], 
  [
   99383, 
   null, 
   "joebrummer", 
   "Left handed people don't even need treatment to learn to write with their other hand successfully.\n \n And I agree there is no need to \"treat\" lefties, after all they don't have the highest HIV rates in the country and pretty much make social rebellion the norm in their lives.\n\n some gross generalization here! Social rebellion the norm? Are you smoking crack to assume that every gay person is about social rebellion. Many do everything they can to \"blend in\" best they can as to go unnoticed. You again show here how little you know about gays.\n \n \n Lefties don't need treatment, that was the point, neither do gays.", 
   {}, 
   99377, 
   null, 
   1111161420.0
  ], 
  [
   99411, 
   null, 
   "Jaxian", 
   "Left handed people don't even need treatment to learn to write with their other hand successfully.\n \n And I agree there is no need to \"treat\" lefties, after all they don't have the highest HIV rates in the country and pretty much make social rebellion the norm in their lives.\n\n \n Neither do homosexuals or bisexuals. The highest rates of HIV occur in promiscuous people, and the highest rates of social rebellion occur in civil rights activists.\n \n Or did you mean that homosexuals have higher rates of those things as compared to heterosexuals? Well in that case, I suppose we should really look into whether left-handed people have higher rates of those things than right-handed people. One group must have a higher rate of those things than the other, so it'll only make sense for us to provide treatment to whichever group, left-handed people or right-handed people, has the higher rate of those things. Or perhaps it is more logically to associate the problems with their causes, instead of simply claiming that a certain group is wrong because they have a higher rate of a problem.\n \n And what precisely is the problem with social rebellion, anyhow? Lots of people who have made social rebellion their way of life have become heroes in our history books. If a person thinks society should change, why not fight for it?", 
   {}, 
   99377, 
   null, 
   1111167000.0
  ], 
  [
   99487, 
   null, 
   "JustineCredible", 
   "First, let me say: \"SOMEONE UNCLEAR ON THE CONCEPT\" of satire. \n (Now let's get to the grit of mana'ia's comments)\n \n \n \n \nThere is a natural need to see clearly, wear clothes, and regulate child birth.\n\n \n It's natural to want to see clearly, but there's no law saying you have to, nor is there any law denying this from anyone. Clothes are not natural, if you really want to get picky. Cromagna man never wore clothes. Clothes are an invention of the concept of vanity. Regulating childbirth is also not natural, childbirth itself is natural, but regualating it isn't. Again, it's another concept of vanity. \n \n \nMarriage is to promote children bearing and making a family unit.\n\n \n But does anyone actually need a marriage to do this? No.\n Are there any laws stating one must be married before giving birth? No. \n \n \n \nIt is impossible to know if a heterosexual will give birth just the likelihood.\n\n \n Impossible? emoticon_rolleyes \n \n \n \nNo the agrument is misstated. Gay [parents] are not the optimal palce to raise a family. Gay parents can but the ideal place is a traditional family.\n\n \n Try reading reports done by the AAP (American Academy of Pediatrics) on gay parenting. \n Here's the link: \n \n http://aappolicy.aappublications.org/cgi/search?SITESECTION=policy_statement%2Cclinical_report%2Ctechnical_report%2Cpractice_guidelines%2Cparent_pages%2Cendorsed_policy_statement%2Cendorsed_clinical_report%2Cendorsed_technical_report%2Cendorsed_practice_guidelines&AAP_FLAG=CURRENT&datetype=rangedates&titleabstract=&fulltext=gay+parent&imageField.x=64&imageField.y=16\n \n (yeah it's a long one...)\n \n \n \n \nGay marriage will change the institution.\n\n \n So what? It's not like institutions in this country haven't been changed before, including the supposed intitution of marriage! \n \n Guess what? It's called progress, get used to it. \n \n \n Just becasue some [people] are bad at fulfilling something doesn't mean that others should be allwoed to corrupt the institution as well.\n\n \n Corruption and change are not the same thing.\n \n corruption\n \n n 1: lack of integrity or honesty (especially susceptibility to bribery); use of a position of trust for dishonest gain [syn: corruptness] [ant: incorruptness] 2: in a state of progressive putrefaction [syn: putrescence, putridness, rottenness] 3: decay of matter (as by rot or oxidation) 4: moral perversion; impairment of virtue and moral principles\n \n Hmmm... Seems \"some people are bad\" at understanding the meaning of the words they use.\n I hate to break it to you, but heterosexuals are corrupting marriage themselves. I really can't see how encouraging and extending marraige to a group who actually want it, who actively seek it, and who actually respect it can harm it more than you people already have. \n Acutally, I can't see how allowing gays to marry would have anything but a possitive effect on the institution, which obviously needs some change.\n \n \n [It's] like saying since many people default on student loans, then loans standards should be relaxed to accommodate other people who can as easily default on a loan.\n\n \n Nope, you're simply assuming that gays are anymore likely to default on student loans than are heterosexuals. Actually what is happening now is more akin to saying that because heterosexual students default on student loans then gay students shouldn't be approved for student loans because there's no evidence to show that gay students are anymore responcible than heterosexual students. \n What that is is an erronious assumption without any factual information to back it up. \n \n \n \nThose haven't change the institution of marraige just the legal ramification, parameters, and requirements.\n\n \n Gee, I don't know about the rest of the group here but changing the ramifications, parameters and requirements of an institution are indeed some major reconstrution vehicles. \n \n \n The concept still is the same.\n\n \n The concept being: Two Adult Human Beings entering into a legal contract which grants them certain rights, protections, priveledges, and liberties which are not granted to those citizens who choose to live their lives without a committed relationship. \n \n Extending this concept to include gay couples in NO WAY changes it. \n \n \n \n \nThe people should decide becasue that is democracy. There have been times which democracy has failed but when the courts intiate against the people. The people have the right to change the constitution when courts abuse their [powers]. They can't violate separation of powers and not expect the people to change it.\n\n \n Ah, but this is where you fail to understand the concept of a DEMOCRATIC REPUBLIC! We are not a nation founded solely on Democracy or Republicanism. We are a unique blend of both concepts. Our countries political concept is infact an ongoing experiment. \n If it were not for the courts and their \"Liberal Judges\" we wouldn't have interracial marriage in the first place. \n \n \n \nDemocracy determines what is morally acceptable in this country. WE have prositution legalized in Nevada but other states do not accept it. That is democracy. The people decide what is \"right\" and \"wrong\" based upon teh criteria that is conforming to the constituion.\n\n \n Well on this one, I will just say: read jitobears responce. \n \n \n \nGay marriage will send the message that homosexuality is acceptable. [It] will enable many people to practice [it] more freely [instead]of seeking treatment.\n\n \n Treatment for what? \n Being homosexual? \n For loving differently than you? \n \n Being gay isn't a disease, it's not a disorder and it's not \"bad\". You may not like it. So what? I don't like your atitude about it, but am I saying you can't be heterosexual? No. \n Do I try to change your sexuality? No.\n What you do in the PRIVACY of your bedroom is really your business. I don't want to know. I don't have any issues which prevents me from being content in my relationship to the point where I have to stick my nose into other people's relationships in order to feel somehow superior. \n That's the real illness.\n \n \n \nHow can you draw a line where marraige will end? Polygamy, bigamy, underage people? Any argument for gay marriage can almsot be applied to those marraiges.\n\n \n Pish-posh! \n Get real. It didn't happen with women gaining the right to vote, it didn't happen with desegragation, it didn't happen with interracial marriage. \n It's a slipery slope falicy and you know it. \n \n \n \nThe argument is children are most successful in traditional families.\n\n \n Which has been disproven already. The research has been done, as well as the personal testimonials here. \n Jitobear's family doesn't quite fit the \"traditional\" definition, nor does mine. Our children are just fine. They are not sexually confused, they are not gender disphoric, they are not ill adjusted or have anykind of esteam issues. \n \n Heck, being that I only know my son, not jito's, I can say with all confidence that my son is not only \"well adjusted\" but actually one of the \"popular\" kids. Which for this area is quite an accomplishment. But I do not feel the need to qualify this for you. You will indeed have to take my word for it. \n \n \n \ncars address the needs of transportation. The need for transportaion has always existed.\n\n \n But the modes have changed, grown and expanded with time. First it was the FEET, then the wheel was invented. Not the other way around. There is a wide range of choices when it comes to transportation. Cars are not the be all and end all. \n \n \n \n[Longer] lifespans have been around before.\n Before what? \n \n \n We are adapted to living longer.\n\n \n No, we have adapted, but we are not intended to do so. Just look at the soring needs of the elderly. The millions of dollars spent on drugs, just to keep people alive but for what? Just to need even more drugs as they get older? \n That's not really what I would call natural, but it is the current norm. \n \n \n \n \n \n Civil unions is a copmpromised offer to no recognition. We are saying you ahve the irght to enter the marraige institution but oif you want to enter a different institution this is what we are willing to offer.\n \n It's like saying you have the right to cross the stree at the cross walk.\n \n Gays say that crosswalk isn't appealling to me. I want to cross right here. We say fine you can have a cross walk right there but we won't put a light to regulate it.\n \n Do you have every right to cross at the same cross walk?\n \n Why do you want a different crosswalk because the other one is appealling?[/QUOTE]", 
   {}, 
   99236, 
   null, 
   1111179420.0
  ], 
  [
   99492, 
   null, 
   "tonybrown74", 
   "The Civil Union argument is a disingenuous one.\n \n Those people who are fighting against the rights of gays to marry do not want to see same-sex couples receive any rights or recognitions of their relationships. The authors of all those constitutional amendments ensured that there were no recognition of any other types of relationships in their wording.\n \n Why should any of us settle for something that these very same people are going to attempt to deny anyway?", 
   {}, 
   99487, 
   null, 
   1111180320.0
  ], 
  [
   99494, 
   null, 
   "JustineCredible", 
   "The Civil Union argument is a disingenuous one.\n \n Those people who are fighting against the rights of gays to marry do not want to see same-sex couples receive any rights or recognitions of their relationships. The authors of all those constitutional amendments ensured that there were no recognition of any other types of relationships in their wording.\n \n Why should any of us settle for something that these very same people are going to attempt to deny anyway?\n\n \n \n You bring up a very interesting point. \n All those state level marriage amendments which were voted on also made civil unions illegal as well. When polled, residents in those areas were actually unaware that the amendments also outlawed civil unions. \n So, not only are the anti's disingenuous as far as what they promoted, but were so in HOW these amendments were promoted.", 
   {}, 
   99492, 
   null, 
   1111180740.0
  ], 
  [
   102727, 
   null, 
   "mana'ia", 
   "But what about the married couple who know right up front they do not intend to have children, don't even intend to try? Do we ban them from marriage to?\n\n Do we ban people from welfare that never have the intentions of becoming self sufficient? Or the people on unemployment that have no intentions from working? You never know if they will change their mind.\n \n \n \nBalls. It wasn't for mine, and I will thank you kindly to keep your narrow, boring, ideas about \"traditional\" out of MY family.\n\n Agin personalizing doesn't make it anymore true or less true. We are talking statistically and generally.\n \n \n \n \nI know a miriad of gay couples who would corrupt it signifigantly less than Brittney.\n\n That is a great argument. Focus on the failures. It's like saying since these people failed out of harvard yous hould allow me to at elast be a D- student. \n \n \n \nActually it's a Republic. \n \n Shall we put your marriage to the vote?\n\n A republic is a form of democracy but good try. Put my marriage to a vote when I have one.\n \n \n \n \nNo - individuals determine what is morally acceptable. You consider homosexuality immoral. I consider your attempts to institutionalize your bigotry immoral.\n \n Governments determine what is legal - not moral.\n \n And once again - we are a Republic.\n\n Again we are a democratic republic. Republic is a form of representation and democracy is the form of government we have.\n \n The indivdiuals as a whole are the people. The people decide what is right and wrong. The constiution protects the majority from running over the rights of the minority.The majority still rules.\n \n \n \n \n \n \nThere isn't treatment for being gay that is accepted by a single reputable medical or psychological organization. And homosexuality is acceptable - hate to break it you, but it's not illegal to be gay or engage in gay sex. \n \n They are reputable but not according to pro-gay sympathizers.\n \n \n \nHow about right before your marriage? - if it leads to such disasters let's do away with all of it.\n\n The benefits of heterosexual marriages are important for society.\n \n \n \nNot mine.\n\n you may be the minority of the exception.", 
   {}, 
   99306, 
   null, 
   1112169000.0
  ], 
  [
   102728, 
   null, 
   "mana'ia", 
   "Treatment, none have been successful. There is no \"reliable\" evidence that sexual orientation can be changed. Except for religious groups some who mask themsleves as secular until you really read their lituature. No Evidence of treatment exists. Much has been tried, but none is needy. If it ain't broke, don't fix it.\n \n If you have some credible evidence I would be hapy to look at it, but I doubt that you do. Why do people insist on this rubbish that gays need treatment. It is like treating people who are left handed or those who see sound.\n\n Name your criteria and I will post credible evidence.", 
   {}, 
   99314, 
   null, 
   1112169060.0
  ], 
  [
   102729, 
   null, 
   "mana'ia", 
   "Are you implying homosexuals need treatment? And do you feel that the current social environment is condusive to said individuals to feel comfortable about seeking said treatment?\n\n \n It's like this, when something is functioning properly we look at it as a symptom.\n \n Symptoms help us to be aware of a problem. WE search until we find the cause of the symptom becasue that is the problem.\n \n \n There are many symptoms we dont' know what causes them but we knwo there is a problem. \n \n Many think homosexuality is functioning properly. Therefore no symptom and no problem.", 
   {}, 
   99324, 
   null, 
   1112169240.0
  ], 
  [
   102736, 
   null, 
   "JustineCredible", 
   "A republic is a form of democracy but good try. Put my marriage to a vote when I have one.\n \n Again we are a democratic republic. Republic is a form of representation and democracy is the form of government we have. \n\n \n Don't say \"Again\" when I was the one who reminded you of your previous error. Back peddling now isn't going to work. \n \n \nThe indivdiuals as a whole are the people. The people decide what is right and wrong. The constiution protects the majority from running over the rights of the minority.The majority still rules.\n\n \n First off, the minorty rights which are being run over are the rights of gays/lesbians to form lasting relationships and to have them recognized. It is precisely the right of which we are attempting to secure.\n Also, as for your assertation that the \"majority still rules.\" You are completely wrong there. Your so called \"liberal judges\" are the ones who decided the 2000 election results before all votes were tabulated. Regardless of the actual outcome. The majority voted for Gore, the majority didn't rule there. \n \n \nThey are reputable but not according to pro-gay sympathizers.\n\n \n Show me even one accredited and reputable medical or psychological association in the US which not only approves of but recomends any of these so-called \"treatments\" you boast about? Guess what, you can't. Beause they don't exist. \n Are you then saying that every medical and psychological association in the US are \"pro-gay sympathizers?\" \n \n \n \nThe benefits of heterosexual marriages are important for society.\n\n \n Actually the benefits of stable, safe and loving homes for chilren are important to society. To deny gays and lesbians are indeed able to provide this is a flat out lie. I have directed you to the AAP report on gay parenting. I would suggest you actually read it. \n \n \n \n \nyou may be the minority of the exception.\n\n \n Or do you mean the exception of the minority? \n Her family does indeed fall under the definition of \"non-traditional.\" It's just exactly how which is the exception. \n \n \n Also to finish responding to your previous post, since I neglected to do so earlier:  \n \n \nCivil unions is a copmpromised offer to no recognition. We are saying you ahve the irght to enter the marraige institution but oif you want to enter a different institution this is what we are willing to offer.\n\n \n Not sure if you meant to say \"civil unions\" are a compromise or if you meant they are \"comprised.\" So, I'll go for the previous of the two for argument's sake.   \n \n Why should gays and lesbians be forced to accept anything less than full and equal recognition? Settling for second best because you and those like you are simply uncomfortable with what we are demanding is really your problem. \n \n \n \nIt's like saying you have the right to cross the stree at the cross walk.\n \n Gays say that crosswalk isn't appealling to me. I want to cross right here. We say fine you can have a cross walk right there but we won't put a light to regulate it.\n\n \n No, your analogy is simply wrong. It's more akin to saying only heterosexuals are allowed to cross at the crosswalk but gays and lesbians must drive around the intersection altogether. Gays and lesbians are demanding their right to cross where everyone else crosses but the anti's would rather give them some place in the middle so that gays and lebians don't invade the place were heterosexuals cross. \n \n \nDo you have every right to cross at the same cross walk?\n \n Why do you want a different crosswalk because the other one is appealling?\n\n \n I don't want a different one, I want the same one without compromising who and what I am to suit your definition of a crosswalk.", 
   {}, 
   102727, 
   null, 
   1112177760.0
  ], 
  [
   103551, 
   null, 
   "mana'ia", 
   "Don't say \"Again\" when I was the one who reminded you of your previous error. Back peddling now isn't going to work. \n \n Republics and Democracy are used together often. So I can udnerstand your lack of understanding the difference. As I stated before we are a democracy and a republic. Republic refers to representation and democracy the form of government. I don't fault you, I fault our educdational system.\n \n Main Entry: de·moc·ra·cy \n Pronunciation: di-'mä-kr&-sE\n Function: noun\n Inflected Form(s): plural -cies\n Etymology: Middle French democratie, from Late Latin democratia, from Greek dEmokratia, from dEmos + -kratia -cracy\n 1 a : government by the people; especially : rule of the majority b : a government in which the supreme power is vested in the people and exercised by them directly or indirectly through a system of representation usually involving periodically held free elections\n 2 : a political unit that has a democratic government\n 3 capitalized : the principles and policies of the Democratic party in the U.S.\n 4 : the common people especially when constituting the source of political authority\n 5 : the absence of hereditary or arbitrary class distinctions or privileges \n \n 33 entries found for republic. The first 10 are listed below.\n To select an entry, click on it. For more results, click here. \n republicbanana republicAbkhaz RepublicAdjarian Autonomous RepublicBashkortostanBatavian RepublicBuryatiaCambodiaCentral African RepublicChecheno-Ingush Republic \n \n Main Entry: re·pub·lic \n Pronunciation: ri-'p&-blik\n Function: noun\n Etymology: French république, from Middle French republique, from Latin respublica, from res thing, wealth + publica, feminine of publicus public -- more at REAL, PUBLIC\n 1 a (1) : a government having a chief of state who is not a monarch and who in modern times is usually a president (2) : a political unit (as a nation) having such a form of government b (1) : a government in which supreme power resides in a body of citizens entitled to vote and is exercised by elected officers and representatives responsible to them and governing according to law (2) : a political unit (as a nation) having such a form of government c : a usually specified republican government of a political unit <the French Fourth Republic<\n 2 : a body of persons freely engaged in a specified activity <the republic of letters<\n 3 : a constituent political and territorial unit of the former nations of Czechoslovakia, the U.S.S.R., or Yugoslavia \n \n \n \n \n \n \nFirst off, the minorty rights which are being run over are the rights of gays/lesbians to form lasting relationships and to have them recognized. It is precisely the right of which we are attempting to secure.\n Also, as for your assertation that the \"majority still rules.\" You are completely wrong there. Your so called \"liberal judges\" are the ones who decided the 2000 election results before all votes were tabulated. Regardless of the actual outcome. The majority voted for Gore, the majority didn't rule there.\n\n In terms of minorities rights we refer to indivdiual rights. behavior isn't what the consitution meant to protect as a minority. It was meant to apply teh alw evenly to everyone and protect everyone's rights based ont eh individaul not because of behavior, hence the penal system.\n \n Since we are a republic then representatives vote on our behalf. The majority fo electoral votes went to Bush. The majority of electorates voted for Bush. As a side note they did count every vote and they recounted every vote. Even after the court decision a few newspapers did the recoutn and found that BUsh won even then.\n \n \n \n \n \nShow me even one accredited and reputable medical or psychological association in the US which not only approves of but recomends any of these so-called \"treatments\" you boast about? Guess what, you can't. Beause they don't exist. \n Are you then saying that every medical and psychological association in the US are \"pro-gay sympathizers?\" \n \n \n Define was is accredited and reputable.\n \n Yes the AMA and APA are both pro-gay. There minutes on the decision on DSM IV reflect that.\n \n \n \n \n \nActually the benefits of stable, safe and loving homes for chilren are important to society. To deny gays and lesbians are indeed able to provide this is a flat out lie. I have directed you to the AAP report on gay parenting. I would suggest you actually read it. \n \n There are reports that dispute that. The report focuses on gay parenting being good. If you understood that the AAP members disagree with their own boards decisions then you'd understand how much credibility the report has. Also it focus on the need for children to have two parents. it does not state that it is the optimal place for children. \n \n \n \n \n \n \nOr do you mean the exception of the minority? \n Her family does indeed fall under the definition of \"non-traditional.\" It's just exactly how which is the exception. \n \n I meant the exception or the minority in her case.\n \n \n \nAlso to finish responding to your previous post, since I neglected to do so earlier: \n \n \n \n Not sure if you meant to say \"civil unions\" are a compromise or if you meant they are \"comprised.\" So, I'll go for the previous of the two for argument's sake. \n \n I meant compromise\n \n \n \nWhy should gays and lesbians be forced to accept anything less than full and equal recognition? Settling for second best because you and those like you are simply uncomfortable with what we are demanding is really your problem.\n\n you can have full and legal recognition if you marry a psermissble partner. It's like someone going to dinner and saying I don't like that because I'm not a vegetarian. You may not be a vegetarian but we aren't discriminating you, jsut your preference. \n \n \n \n \n \nNo, your analogy is simply wrong. It's more akin to saying only heterosexuals are allowed to cross at the crosswalk but gays and lesbians must drive around the intersection altogether. Gays and lesbians are demanding their right to cross where everyone else crosses but the anti's would rather give them some place in the middle so that gays and lebians don't invade the place were heterosexuals cross. \n \n Post a statute that denies you a right based on your sexuality not your preference.\n \n \n \n\n I don't want a different one, I want the same one without compromising who and what I am to suit your definition of a crosswalk.\n Post a statute that denies you rights as an indivdual and not your preference.", 
   {}, 
   102736, 
   null, 
   1112418060.0
  ], 
  [
   103561, 
   null, 
   "jitobear", 
   "Yes the AMA and APA are both pro-gay. There minutes on the decision on DSM IV reflect that.\n\n \n I challenege you to find a single, reliable, medical or scientific source that holds that homosexuality is an illness to be treated. No holy rollers - one of actual doctors and or psychologists. You won't. \n \n \nThere are reports that dispute that. The report focuses on gay parenting being good. If you understood that the AAP members disagree with their own boards decisions then you'd understand how much credibility the report has. Also it focus on the need for children to have two parents. it does not state that it is the optimal place for children. \n\n \n Love trumps your hate any day. I can think of dozens of homosexuals I would trust around my kid before you and your ilk. I have seen what your training has done. You create hate which breeds violence. You make me want to puke.\n \n \nyou can have full and legal recognition if you marry a psermissble partner. It's like someone going to dinner and saying I don't like that because I'm not a vegetarian. \n\n \n No it isn't. It is saying look like me, taste like me, like what I like - FACIST.\n \n \nYou may not be a vegetarian but we aren't discriminating you, jsut your preference. \n\n \n Whatever lets you sleep at night, hater.", 
   {}, 
   103551, 
   null, 
   1112419980.0
  ], 
  [
   103631, 
   null, 
   "joebrummer", 
   "Originally Posted by mana'ia\n You may not be a vegetarian but we aren't discriminating you, jsut your preference. \n\n \n \n See, this is where I get annoyed. Preference implies that somewhere along the way I made a choice to be attracted to the same-sex and tht I can just as easily change it back... not the case. I never made any choice, I am not sexually attracted to women in anyway. Yet you will call it a prefernce. Really I am looking to have protections for my relationship. I cannot speak for the entire gay community, but I can and will speak for myself. I didn't choose this. So don't call it a preference.", 
   {}, 
   103561, 
   null, 
   1112464500.0
  ], 
  [
   103662, 
   null, 
   "wsm2506", 
   "See, this is where I get annoyed. Preference implies that somewhere along the way I made a choice to be attracted to the same-sex and tht I can just as easily change it back... not the case. I never made any choice, I am not sexually attracted to women in anyway. Yet you will call it a prefernce. Really I am looking to have protections for my relationship. I cannot speak for the entire gay community, but I can and will speak for myself. I didn't choose this. So don't call it a preference.\n\n \n You know Joe, I was out washing my car this morning, and I got to thinking about all this \"choice\" issue. And I came to a conclusion:\n \n Yes, I DID make a choice!!!! I even remember the internal struggle I went through and when I made that choice.\n \n I made a conscience choice to be ME! I made a conscience choice to quit pretending to be someone I am not, to quit worrying about what society at that time thought. To quit believing in mythology. I made a decision to open myself to who I really am and LIVE!!!!!!!!!!!!! For the first time in my life. No more lies, to myself or other people. I don't tell them how to live their life and they have not understanding or right to tell me how to live mine.\n \n And I found love. A love I had never thought possible. A commitment of myself and my love and respect for another human being that is more beautiful and meaningful than many people will ever know.\n \n So, yes,,, I made a choice. Are you happy now unkerpaulie? I admit it. Are you happy now jyoshu, JP, Jaaaman, ma'nia? \n \n I made a choice.\n \n I chose to LIVE!!!", 
   {}, 
   103631, 
   null, 
   1112476560.0
  ], 
  [
   103671, 
   null, 
   "mana'ia", 
   "You know Joe, I was out washing my car this morning, and I got to thinking about all this \"preference\" / \"choice\" issue. And I came to a conclusion:\n \n Yes, I DID make a choice!!!! I even remember the internal struggle I went through and when I made that choice.\n \n I made a conscience choice to be ME! I made a conscience choice to quit pretending to be someone I am not, to quit worrying about what society at that time thought. To quit believing in mythology. I made a decision to open myself to who I really am and LIVE!!!!!!!!!!!!! For the first time in my life. No more lies, to myself or other people. I don't tell them how to live their life and they have not understanding or right to tell me how to live mine.\n \n And I found love. A love I had never thought possible. A commitment of myself and my love and respect for another human being that is more beautiful and meaningful than many people will ever know.\n \n So, yes,,, I made a choice. Are you happy now unkerpaulie? I admit it. Are you happy now jyoshu, JP, Jaaaman, ma'nia? \n \n I made a choice.\n \n I chose to LIVE!!!\n\n \n The fact is everyone has preferences. We make a choice in how to behave. There are people in prison that have the same desires as us. We made choices though differently than them.\n \n There are many desires which we must learn to manage. How many people get upset while driving? Even though we are so upset we make a decisons not to chase them down and kill them. Some make the decision to chase them down and get back. That is our choice.", 
   {}, 
   103662, 
   null, 
   1112478600.0
  ], 
  [
   103675, 
   null, 
   "joebrummer", 
   "The fact is everyone has preferences. We make a choice in how to behave. There are people in prison that have the same desires as us. We made choices though differently than them.\n \n There are many desires which we must learn to manage. How many people get upset while driving? Even though we are so upset we make a decisons not to chase them down and kill them. Some make the decision to chase them down and get back. That is our choice.\n\n You are correct, but there is a big difference when this pertains to sexuality. When you long for companionship, and your desires are not like others. The choice is wether or not to follow your heart and find love or live in torture not having what you really want, what is really inside you. For some of us we fell in love and that is what brought us to the choice that we were going to just be ourselves. It wasn't a choice to have the attractions to the same sex. It was a choice to go with it. I made the choice to go with it when I realized that I was lonely, miserable, and couldn't hide my feelings anymore. So I didn't. Best move I ever made.\n \n \n There never was a preference. I never prefered men over women because I nver wanted to have sex with a women. Preference is when you choose between two things. There wasn't two choices. There was one. The real one.", 
   {}, 
   103671, 
   null, 
   1112478900.0
  ], 
  [
   103676, 
   null, 
   "wsm2506", 
   "The fact is everyone has preferences. We make a choice in how to behave. There are people in prison that have the same desires as us. We made choices though differently than them.\n \n There are many desires which we must learn to manage. How many people get upset while driving? Even though we are so upset we make a decisons not to chase them down and kill them. Some make the decision to chase them down and get back. That is our choice.\n\n \n I was not talking about any \"preference\". I was not talking about killing anyone. I was not speaking of harm to anyone. It is you who seems to advocate harm, not I.\n \n I was talking about finding myself and love. That harms absolutely no one.", 
   {}, 
   103671, 
   null, 
   1112478960.0
  ], 
  [
   103697, 
   null, 
   "Jaxian", 
   "In terms of minorities rights we refer to indivdiual rights. behavior isn't what the consitution meant to protect as a minority. It was meant to apply teh alw evenly to everyone and protect everyone's rights based ont eh individaul not because of behavior, hence the penal system.\n\n \n This does not make sense to me. The Constitution protects minorities in three ways: First, it spells out the powers of the government, and any powers invoked by the government that are not listed in the Constitution are unconstitutional. This means that since the Constitution does not list many powers of the government to take away freedoms, the government does not have that power. Second, it lists specific rights held by all individuals that the government is not entitled to take away. This includes freedom of speech, religion, the right to bear arms, the right to a fair trial to determine a crime, and others, each of which protect the behavior of individuals. Third, all governmental power is not given directly to the majority; it is dampened because officials must make decisions, it is an indirect power. The most prominant protection for minorities comes in the form of the judicial system, which is neither elected by the majority or held accountable to the majority or mob-rule in any fashion. Certainly the judicial system is able and intended to protect the minority when the majority is annoyed with their behavior.\n \n \nSince we are a republic then representatives vote on our behalf.\n\n \n As described in the Federalist papers, elected officials are intended to vote in such a fashion that benefits everyone; they are not intended to vote along the lines of the majority vote.\n \n \nThere are reports that dispute that. The report focuses on gay parenting being good. If you understood that the AAP members disagree with their own boards decisions then you'd understand how much credibility the report has. Also it focus on the need for children to have two parents. it does not state that it is the optimal place for children.\n\n \n No study or report is going to prove the optimal environment for children, but there is no reason to believe that two parents of different gender should be better than two parents of opposite gender. The only reasonable argument I have heard which suggests that this might be the case is that a child needs to learn from the experiences of both genders, for each gender holds a different role in society. Yet this argument is flawed in that teaching a child which role each gender holds in society limits that child's potential only to those roles, and I do not see how this can somehow be construed as a good thing.\n \n Even if there were a way to prove which set of parents were optimal, it would make absolutely no sense to deny marriage to the group less optimal. What if it were that same-sex parents are more optimal than opposite-sex parents? Does it then make sense to deny marriage benefits to opposite-sex parents? What if it could be shown that Muslim parents are more optimal than Christian parents? Would it then make sense to deny marriage to Christian parents. What if it could be shown that black parents are more optimal than white parents? Surely one must be more optimal than the other in every case. We've seen that same-sex couples are capable of raising children well, and it is not now and never has been the place of the government to benefit it's preferred type of family over its less preferred type. Same-sex parents have the same needs as opposite-sex parents, and that's the bottom line; to deny them benefits is to promote the majority lifestyle over the minority. It is to promote tyranny of the majority.\n \n \nyou can have full and legal recognition if you marry a psermissble partner. It's like someone going to dinner and saying I don't like that because I'm not a vegetarian. You may not be a vegetarian but we aren't discriminating you, jsut your preference.\n\n \n So let's assume for the moment that it is a choice, that it is just like vegetarianism. Is it morally good to go out to dinner with your vegetarian friend, but to choose a restaurant with no vegetarian dishes? Can you then just say, \"Hey, sorry, you chose to be a vegetarian\" and not feel like a jerk?\n \n But we're not talking about dinner, we're talking about legal benefits under the law. Is it thus fair to deny vegetarians food stamps, then say, \"hey, sorry, you can choose to be something different.\" Of course it isn't; there is no reason to deny vegetarians food stamps; to do so is evil. It is nothing but evil to force someone to conform to your beliefs and your lifestyle, your \"preference\", before you grant them equal benefits under the law. It is tyranny.\n \n \nPost a statute that denies you rights as an indivdual and not your preference.\n\n \n I challenge you to post any law which denies rights or benefits based not on harm caused, but solely because of a different preference, lifestyle, or belief. Then tell me, is such a law not morally evil?", 
   {}, 
   103551, 
   null, 
   1112484840.0
  ], 
  [
   103874, 
   null, 
   "jyoshu", 
   "The problem with trying to get as far away as we can from the idea of \"sexual preference\" and \"choice\" when it comes to homosexuality is that it leans too far into the thinking that we as human beings are slaves to our libido. People may not be easily attracted to those outside their \"sexual orientation\" but I don't think it's that big of a problem to call it \"preference.\" And we certainly have freedom of choice regardless.\n \n I also think that the phrase \"sexual orientation\" has been used in such a way by the gay lobby to give the idea that it means we are hard-wired, and slaves to this \"orientation.\" IMO this is not a very good use of the phrase. It's also an unfortunate way to catagorize people and \"put them in a box,\" so to speak. In reality there are often exceptions and people vary greatly in their attractions. The phrase \"sexual orientation\" should mean what it says: it's a way to show what one is oriented toward, not a slave to.", 
   {}, 
   103697, 
   null, 
   1112562600.0
  ], 
  [
   104020, 
   null, 
   "Dzeron", 
   "The problem with trying to get as far away as we can from the idea of \"sexual preference\" and \"choice\" when it comes to homosexuality is that it leans too far into the thinking that we as human beings are slaves to our libido. People may not be easily attracted to those outside their \"sexual orientation\" but I don't think it's that big of a problem to call it \"preference.\" And we certainly have freedom of choice regardless.\n\n \n Whether or not we have freedom of choice, preferences are preferences, and there are no \"good\" or \"bad\" preferences. Anyone who claims otherwise is standing on his head, because \"good\" and \"bad\" are defined by preferences, not the other way around.", 
   {}, 
   103874, 
   null, 
   1112588580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Satire: 12 Reasons Why Gay Marriage Should Not Be Allowed", 
  "url": "http://www.4forums.com/political/gay-rights-debates/4548-satire-12-reasons-why-gay-marriage-should-not-allowed.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 4548, 
  "discussion_files": [
   [
    "6870.html", 
    "http://www.4forums.com/political/gay-rights-debates/4548-satire-12-reasons-why-gay-marriage-should-not-allowed-print.html"
   ], 
   [
    "6871.html", 
    "http://www.4forums.com/political/gay-rights-debates/4548-satire-12-reasons-why-gay-marriage-should-not-allowed-3-print.html"
   ], 
   [
    "6872.html", 
    "http://www.4forums.com/political/gay-rights-debates/4548-satire-12-reasons-why-gay-marriage-should-not-allowed-2-print.html"
   ]
  ], 
  "identifier": 4548
 }
]