[
 [
  [
   98523, 
   null, 
   "Duo_Maxwell", 
   "The advancement of a non-christian religion in a nation also brings the advancement of atheism in that nation.", 
   {
    "post_info": {
     "post_title": "Do you agree with such logic?"
    }
   }, 
   null, 
   null, 
   1110943560.0
  ], 
  [
   98528, 
   null, 
   "trs", 
   "The advancement of a non-christian religion in a nation also brings the advancement of atheism in that nation.\nAbsurd. Note \"the advancement of atheism\" in Indonesia in the wake of the dramatic growth of Islam. emoticon_rolleyes", 
   {}, 
   98523, 
   null, 
   1110943980.0
  ], 
  [
   98533, 
   null, 
   "Duo_Maxwell", 
   "Absurd. Note \"the advancement of atheism\" in Indonesia in the wake of the dramatic growth of Islam. emoticon_rolleyes\n\n \n Thank you. That logic is completely absurd.", 
   {}, 
   98528, 
   null, 
   1110944400.0
  ], 
  [
   98536, 
   null, 
   "HeavenBound", 
   "The advancement of a non-christian religion in a nation also brings the advancement of atheism in that nation.\n\n \n \n Why did you have to start another thread to gather some bravado for an argument you have going on about the subject in Discrediting Christianity?", 
   {}, 
   98523, 
   null, 
   1110944940.0
  ], 
  [
   98538, 
   null, 
   "Duo_Maxwell", 
   "Why did you have to start another thread to gather some bravado for an argument you have going on about the subject in Discrediting Christianity?\n\n \n Because the grand absurdity of marc9000's logic deserves a thread of it;'s own. Also, it's a away of getting around his dishonest quote context, not to mention I'd like to get opinions about such thinking anyways regardless of his debate. Also, he keep avoiding explaining it, and this is simply a way of completely focusing on the subject. Btw:bravado doesn't make a ounce of sense in this context.\n \n What do you think of such logic?", 
   {}, 
   98536, 
   null, 
   1110945060.0
  ], 
  [
   98545, 
   null, 
   "marc9000", 
   "Why did you have to start another thread to gather some bravado for an argument you have going on about the subject in Discrediting Christianity?\n\n \n Because he lost that one!! emoticon_xangel", 
   {}, 
   98536, 
   null, 
   1110947700.0
  ], 
  [
   98557, 
   null, 
   "trebor", 
   "Why did you have to start another thread to gather some bravado for an argument you have going on about the subject in Discrediting Christianity?\n\n \n \n Oh no,. I think you and Easyrider do a much better job at discreditng Christainty that anybody else could.", 
   {}, 
   98536, 
   null, 
   1110950520.0
  ], 
  [
   98561, 
   null, 
   "Easyrider", 
   "\"You stiffnecked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit! - Acts 7:51", 
   {
    "unicode_changes_made": true
   }, 
   98557, 
   null, 
   1110950760.0
  ], 
  [
   98562, 
   null, 
   "HeavenBound", 
   "Oh no,. I think you and Easyrider do a much better job at discreditng Christainty that anybody else could.\n\n \n Please tell me how I have discredited christianity, I'd really like to hear this not that this has anything to with the subject of this post or what I posted!!! emoticon_rolleyes", 
   {}, 
   98557, 
   null, 
   1110950820.0
  ], 
  [
   98583, 
   null, 
   "Duo_Maxwell", 
   "Because he lost that one!! emoticon_xangel\n\n \n Are we in crazy land? you've failed to explain how that logic works. You ignored every single challenge to do so. The failure is yours.\n \n Interesting. I'm getting several opinions from other boards that the logic is not only completley absurd, but the believer of it is insane/crazy/stupid.\n \n Heavenbound & trebor: what do you think of such logic?", 
   {}, 
   98545, 
   null, 
   1110958980.0
  ], 
  [
   98606, 
   null, 
   "Clive14", 
   "Please tell me how I have discredited christianity\nThis is difficult to explain without being rude, but I'll do my best.\n \n 1. You come across as a less than sensible person with a very loose grip on reality.\n 2. You declare yourself a Christian.\n \n If you represent the majority of Christians then they too are \"less than sensible people with a very loose grip on reality\". Those of us who know a number of Christians thankfully know you do not represent the majority of Christians, but some might not know this and might think you an example of a typical Christian. Thus you discredit Christianity.\n \n Hope this makes sense to you now.", 
   {}, 
   98562, 
   null, 
   1110973560.0
  ], 
  [
   98610, 
   null, 
   "Wraith", 
   "This thread and indeed many of the threads on this board are hilarious - it's as if the main tactic of a 'certain group' ;) after saying something illogical is to battle post after post to avoid admitting it trying to tire and provoke a change in the subject or cause the abandonment of the discussion.\n \n \nThe advancement of a non-christian religion in a nation also brings the advancement of atheism in that nation.\n\n \n No, that is an absurd statement.", 
   {}, 
   98606, 
   null, 
   1110977640.0
  ], 
  [
   98611, 
   null, 
   "Easyrider", 
   "The message of the Cross is foolishness to the unregenerate. Heavenbound does not come accross as being non-sensible, nor does being a \"Christian\" discredit him in the least. To the contrary, he is doing the Lord's work in bringing you the truth about Jesus Christ.", 
   {}, 
   98606, 
   null, 
   1110977760.0
  ], 
  [
   98615, 
   null, 
   "Clive14", 
   "The message of the Cross is foolishness to the unregenerate. Heavenbound does not come accross as being non-sensible, nor does being a \"Christian\" discredit him in the least. To the contrary, he is doing the Lord's work in bringing you the truth about Jesus Christ.\nYou need to bear in mind that you have been accused of discrediting Christianity for the same reasons as HeavenBound.\n \n BTW I did not say that being a Christian descredits Heavenbound, nor does it discredit you. It is the non-sensible, reality devorced drivel that you and she spout that could be seen as discrediting Christianity. The difference is subtle, but you would do well to engage your brain please in order to understand it.", 
   {}, 
   98611, 
   null, 
   1110979980.0
  ], 
  [
   98627, 
   null, 
   "trebor", 
   "Please tell me how I have discredited christianity, I'd really like to hear this not that this has anything to with the subject of this post or what I posted!!! emoticon_rolleyes\n\n \n \n Of course. By refusing to understand knowledge and science, you have demonstrated that Christianity is a bundle of superstition. Your method of making wiseass remarks instead of dealing with the question shows a christianity that is shallow and unreasoning.", 
   {}, 
   98562, 
   null, 
   1110986400.0
  ], 
  [
   98628, 
   null, 
   "trebor", 
   "The message of the Cross is foolishness to the unregenerate. Heavenbound does not come accross as being non-sensible, nor does being a \"Christian\" discredit him in the least. To the contrary, he is doing the Lord's work in bringing you the truth about Jesus Christ.\n\n \n \n 1) Heavenbound is a woman, not a man.. \n \n 2) You discredit Christinaity with your glee for torture, your rudeness, and your hate a lot more than Heavenbound ever will.", 
   {}, 
   98611, 
   null, 
   1110986520.0
  ], 
  [
   98644, 
   null, 
   "unkerpaulie", 
   "Absurd. Note \"the advancement of atheism\" in Indonesia in the wake of the dramatic growth of Islam. emoticon_rolleyes\n\n isnt this exactly in support of what duo maxwell said in his first post? (unless youre being ironic)", 
   {}, 
   98528, 
   null, 
   1110990720.0
  ], 
  [
   98663, 
   null, 
   "HeavenBound", 
   "This is difficult to explain without being rude, but I'll do my best.\n \n 1. You come across as a less than sensible person with a very loose grip on reality.\n 2. You declare yourself a Christian.\n \n If you represent the majority of Christians then they too are \"less than sensible people with a very loose grip on reality\". Those of us who know a number of Christians thankfully know you do not represent the majority of Christians, but some might not know this and might think you an example of a typical Christian. Thus you discredit Christianity.\n \n Hope this makes sense to you now.\n\n \n \n How do I come across as a less than sensible person with a very loose grip on reality?\n \n Is it because I believe the bible is the inspired word of God?\n Is it because I believe in Jesus Christ and that he was crucified on the cross for our sins?\n Is it because I believe in the indwelling of the Holy Spirit?\n Is it because I believe Jesus performed the miracles the bible says he performed?\n Is it because I stand up for what I believe in?\n \n These are characteristics of most of the Christian people I know. If these make me unsensible and unrealistic (which is only your personal view) then glory be to God forever!!!", 
   {}, 
   98606, 
   null, 
   1110994080.0
  ], 
  [
   98669, 
   null, 
   "Waxy", 
   "The advancement of a non-christian religion in a nation also brings the advancement of atheism in that nation.\n\n \n This statement in and of itself is illogical.\n \n I have no idea how it relates to the \"debate\" between yourself and Marc9000.\n \n Waxy", 
   {}, 
   98523, 
   null, 
   1110995100.0
  ], 
  [
   98678, 
   null, 
   "Clive14", 
   "...These are characteristics of most of the Christian people I know.\nYou answer your own question here: the answer is no, it isn't for any of those reaons.\n \n \nIf these make me unsensible and unrealistic (which is only your personal view) then glory be to God forever!!!\nThis however is the reason. Are you really proud of taking the line of \"If I'm making no sense and being unrealistic then glory be to God forever!!!\" ?", 
   {}, 
   98663, 
   null, 
   1110996000.0
  ], 
  [
   98686, 
   null, 
   "sinjin", 
   "I took Marc9000 point to be that anything that serves to reduce the influence of Christian values on U.S. society or use of its symbols represents gains for both atheism and any other non-Christian belief system. I agree with this. I also beieve it appropriate to reduce the preferential treatment of Christianity in U.S. society in order to be more inclusive of other faiths as well as those with none. To argue for its continued preferences because of its historical role in our society is insupportable.", 
   {}, 
   98678, 
   null, 
   1110996600.0
  ], 
  [
   98689, 
   null, 
   "HeavenBound", 
   "You answer your own question here: the answer is no, it isn't for any of those reaons.\n \n This however is the reason. Are you really proud of taking the line of \"If I'm making no sense and being unrealistic then glory be to God forever!!!\" ?\n\n \n Why'd you change the wording to suit your own purpose? What I said was:\n \n \nIf these make me unsensible and unrealistic (which is only your personal view) then glory be to God forever!!! Referring to the reasons I had listed in Post #18\n\n \n So, you think standing up for one's faith makes them unsensible and unrealistic", 
   {}, 
   98678, 
   null, 
   1110996780.0
  ], 
  [
   98692, 
   null, 
   "Clive14", 
   "Why'd you change the wording to suit your own purpose?\nIt's called being concise. I used fewer words to say the same thing as you, but in a clearer manner.\n \n \nSo, you think standing up for one's faith makes them unsensible and unrealistic\nNope, you still aren't getting it. Adopting the line of \"If I'm making no sense and being unrealistic then glory be to God forever!!!\" is what makes you \"unsensible\" and unrealistic and gives Christianity a bad name. To put it another way, it's having faith that your own opinions are unquestionable right and thinking \"Glory be to God for making me assinine\" is a sensible response to anyone who says otherwise is that makes you \"unsensible\" and unrealistic.", 
   {}, 
   98689, 
   null, 
   1110997560.0
  ], 
  [
   98704, 
   null, 
   "HeavenBound", 
   "It's called being concise. I used fewer words to say the same thing as you, but in a clearer manner.\n \n Nope, you still aren't getting it. Adopting the line of \"If I'm making no sense and being unrealistic then glory be to God forever!!!\" is what makes you \"unsensible\" and unrealistic and gives Christianity a bad name. To put it another way, it's having faith that your own opinions are unquestionable right and thinking \"Glory be to God for making me assinine\" is a sensible response to anyone who says otherwise is that makes you \"unsensible\" and unrealistic.\n\n \n \n No, you did not say the same thing as I did by being concise. You took all the meaning out of what I was saying. So, here it is again:\n \n \nHow do I come across as a less than sensible person with a very loose grip on reality?\n \n Is it because I believe the bible is the inspired word of God?\n Is it because I believe in Jesus Christ and that he was crucified on the cross for our sins?\n Is it because I believe in the indwelling of the Holy Spirit?\n Is it because I believe Jesus performed the miracles the bible says he performed?\n Is it because I stand up for what I believe in?\n \n These are characteristics of most of the Christian people I know. If these make me unsensible and unrealistic (which is only your personal view)IN YOUR EYES ONLY then glory be to God forever!!! MEANING I DON'T CARE WHAT YOU CALL ME FOR GOD'S SAKE. \n\n \n It is obviously evident you have never believed in anything so strongly. So, now if I apply your logic I guess I'm not unsensible or unrealistic. Even if I didn't present it like this can you perhaps show me where I ever had wrote so previously. I mean here you tried to use this sentence against me as cause for considering me unsensible and unrealistic, where was the cause when you originally made the claim?\n __________________", 
   {}, 
   98692, 
   null, 
   1111000260.0
  ], 
  [
   98724, 
   null, 
   "Duo_Maxwell", 
   "isnt this exactly in support of what duo maxwell said in his first post? (unless youre being ironic)\n\n \n No, he was giving a example of where the logic failed.\n \n Waxy: The entire point of this is to force marc9000 to stop ignoring that the key part of his argument is flawed while he still uses it.\n \n What others think of such logic and its poster", 
   {}, 
   98644, 
   null, 
   1111004700.0
  ], 
  [
   98858, 
   null, 
   "marc9000", 
   "I took Marc9000 point to be that anything that serves to reduce the influence of Christian values on U.S. society or use of its symbols represents gains for both atheism and any other non-Christian belief system. I agree with this. \n\n \n That is exactly my point. Thanks, I do believe that's about the first thing you and I have agreed on since way back in the \"pig pen\" days!! :) \n \n \n I also beieve it appropriate to reduce the preferential treatment of Christianity in U.S. society in order to be more inclusive of other faiths as well as those with none. To argue for its continued preferences because of its historical role in our society is insupportable.\n\n \n As long as those \"continued preferences\" are removed in the proper constitutional way. By the people, not the courts.", 
   {}, 
   98686, 
   null, 
   1111029180.0
  ], 
  [
   98862, 
   null, 
   "Duo_Maxwell", 
   "I took Marc9000 point to be that anything that serves to reduce the influence of Christian values on U.S. society or use of its symbols represents gains for both atheism and any other non-Christian belief system. I agree with this.\n\n \n But that isn't what Marc9000 was talking about. \n \n He specifically noted that if a non-christian religion in a nation also brings the advancement of atheism in that nation. \n \n There was no reference towards any specific nation at all\n \n How can the rejection of religion benefit from the advancement of religion? That doesn't make any sense.\n \n That is not your point Marc, and you stating such is the fallacy of Equivocation.", 
   {}, 
   98686, 
   null, 
   1111029360.0
  ], 
  [
   98867, 
   null, 
   "marc9000", 
   "\n What others think of such logic and its poster\n\n \n Post #16 there was correct.", 
   {}, 
   98724, 
   null, 
   1111029720.0
  ], 
  [
   98871, 
   null, 
   "marc9000", 
   "\n That is not your point Marc, and you stating such is the fallacy of Equivocation.\n\n \n It went back to your post #12, which clearly concerned the US only, and you changed the subject. If you yourself didn't change it to generalize the whole world, then who did? Post # please.", 
   {}, 
   98862, 
   null, 
   1111030080.0
  ], 
  [
   98880, 
   null, 
   "Duo_Maxwell", 
   "Post #16 there was correct.\n\n \n That is the biggest load of bull I have ever heard of in my life. You haven't even talked about anything that would lead anyone to such a conclusion. It seems that rather then defend your logic in the context that it was, you are now taking HIS reasoning to back your logic which did not come from such reasoning. That is not only dishonest, but a cop out. Unless you can show me where you talked about something similar to what post #16 says, you are outright lying. Hint: you won't find anything similar.\n \n \nIt went back to your post #12, which clearly concerned the US only, and you changed the subject. If you yourself didn't change it to generalize the whole world, then who did? Post # please.\n\n \n Again, dishonest quote context. Post #12 has nothing do with the posts above 100. You are DISHONESTLY attempting to prove what I said in a different discussion on a different subject was about what we were talking about. You are clearly guilty of fraud, fallacy changing the subject. We were never talking about a specific country. We were always talking about the whole world.", 
   {}, 
   98867, 
   null, 
   1111030440.0
  ], 
  [
   98910, 
   null, 
   "marc9000", 
   " Unless you can show me where you talked about something similar to what post #16 says, you are outright lying. Hint: you won't find anything similar. \n\n \n Hint: A post # 16 phrase, \"dominent religion in the states\". \n \n Here's where I talked about something similar,\n \n \nTheres nothing wrong with the U.S. cooperating from time to time with \"godless\" governments. Religion doesn't matter in many secular activities. \n\n \n (you responded to the above post with an inchoherent, childlike squeal.)\n \n \n \n \n \nAgain, dishonest quote context. Post #12 has nothing do with the posts above 100. You are DISHONESTLY attempting to prove what I said in a different discussion on a different subject was about what we were talking about. You are clearly guilty of fraud, fallacy changing the subject. We were never talking about a specific country. We were always talking about the whole world.\n\n \n Tastyfish referrenced the US in post # 100. YOU carefully phrased post # 101 to exclude the US. So you really WERE the one who commited the fallacy of \"changing the subject\"?? \n \n Please, conceal your anger. Deeeeeeeeep breath.................", 
   {}, 
   98880, 
   null, 
   1111033680.0
  ], 
  [
   98922, 
   null, 
   "Mach", 
   "I took Marc9000 point to be that anything that serves to reduce the influence of Christian values on U.S. society or use of its symbols represents gains for both atheism and any other non-Christian belief system. I agree with this. I also beieve it appropriate to reduce the preferential treatment of Christianity in U.S. society in order to be more inclusive of other faiths as well as those with none. To argue for its continued preferences because of its historical role in our society is insupportable.\n\n \n I interpereted it in a similar way, and I agree with your conclusion. Despite the ferocious canines and poor treatment of females, I suppose baboons are wise too ;)\n ==\n \n Unrelated to your comment, I don't agree though that necessarily, reduced influence of Christianity leads to advancement of secular culture however, it can be replaced by other god-fearing religions just as easily. Additionally, I'm not sure I know of an \"atheistic\" movement, or what exactly would be \"advancing\". Atheism is a state of mind, not a political agenda. Yes, some atheists want to ensure the consistution remains intact, but one would think that's the agenda of a person who appreciates the constitution, not necessarily an atheist.\n \n -Mach", 
   {}, 
   98686, 
   null, 
   1111038120.0
  ], 
  [
   98932, 
   null, 
   "Duo_Maxwell", 
   "Hint: A post # 16 phrase, \"dominent religion in the states\". \n \n Here's where I talked about something similar,\n\n \n Again, dishonest quote context. Post #16 was on a different subject; do you realize that statements in different contexts on different subjects cannot be applied to discussions on different subjects? \n \n \nTheres nothing wrong with the U.S. cooperating from time to time with \"godless\" governments. Religion doesn't matter in many secular activities.\n\n \n Again, that was on a different subject. We were NOT discussing the logic which is the point of this thread, and the one you keep refusing to explain. Fallacy: changing the subject. \n \n \n\n Tastyfish referrenced the US in post # 100. YOU carefully phrased post # 101 to exclude the US. So you really WERE the one who commited the fallacy of \"changing the subject\"?? \n\n \n Notice how that was after post #96, where you clearly raised the bar by limiting the discussion to a place where it was not\n Two can play this game. \n \n seriously, stop using the word fallacy, you obvious do not understand what they mean nor how they apply.", 
   {}, 
   98910, 
   null, 
   1111042020.0
  ], 
  [
   99042, 
   null, 
   "sinjin", 
   "I interpereted it in a similar way, and I agree with your conclusion. Despite the ferocious canines and poor treatment of females, I suppose baboons are wise too ;)\n ==\n \n Unrelated to your comment, I don't agree though that necessarily, reduced influence of Christianity leads to advancement of secular culture however, it can be replaced by other god-fearing religions just as easily. Additionally, I'm not sure I know of an \"atheistic\" movement, or what exactly would be \"advancing\". Atheism is a state of mind, not a political agenda. Yes, some atheists want to ensure the consistution remains intact, but one would think that's the agenda of a person who appreciates the constitution, not necessarily an atheist.\n \n -Mach\n\n \n Thanks. I wasn't quite sure whether I'd be called upon to defend myself for being perceptive or psychic. I also agree with your further comments.", 
   {}, 
   98922, 
   null, 
   1111082880.0
  ], 
  [
   99048, 
   null, 
   "georged", 
   " To argue for its continued preferences because of its historical role in our society is insupportable.\n\n \n I agree. Emotion based on mythology versus rational reasoning normally produces unsupportable conclusions.", 
   {}, 
   98686, 
   null, 
   1111083360.0
  ], 
  [
   99049, 
   null, 
   "Big Orn", 
   "Despite the ferocious canines and poor treatment of females, I suppose baboons are wise too ;)\n \n -Mach\n\n Look again, Mach. It's not a baboon you're seeing. You oughta see that animal (avatar) in motion. \n \n It scared me and I ain't scared of nothin'... emoticon_xdonno", 
   {}, 
   98922, 
   null, 
   1111083420.0
  ], 
  [
   99056, 
   null, 
   "sinjin", 
   "Look again, Mach. It's not a baboon you're seeing. You oughta see that animal (avatar) in motion. \n \n It scared me and I ain't scared of nothin'... emoticon_xdonno\n\n \n http://www.thebigzoo.com/Animals/Mandrill.asp\n \n http://zing.ncsl.nist.gov/~gseidman/vrml/mandrill.jpg\n \n I'll see if I can get that .gif up.", 
   {}, 
   99049, 
   null, 
   1111084020.0
  ], 
  [
   99108, 
   null, 
   "sinjin", 
   "As long as those \"continued preferences\" are removed in the proper constitutional way. By the people, not the courts.\n\n \n One of the roles of the Judicial Branch(i.e. the Supreme Court) is to check abuses by the \"people\", meaning the majority, by reviewing legislation. That is the \"proper Constitutional way\" as I see it and I believe I'm on good footing there.", 
   {}, 
   98858, 
   null, 
   1111089240.0
  ], 
  [
   99266, 
   null, 
   "marc9000", 
   "\n what others think of such logic and it's poster\n http://www.onlinedebate.net/forums/showthread.php?p=71562#post71562 \n\n \n Why did you post a link for this site for us to see, yet you didn't post those people a link to see THIS site? Is there something here you didn't want them to see?", 
   {}, 
   98628, 
   null, 
   1111113600.0
  ], 
  [
   99271, 
   null, 
   "marc9000", 
   "Again, dishonest quote context. Post #16 was on a different subject; do you realize that statements in different contexts on different subjects cannot be applied to discussions on different subjects? \n\n \n LOL what subject was it? You posted the link.\n \n \n \n \nAgain, that was on a different subject. We were NOT discussing the logic which is the point of this thread, and the one you keep refusing to explain. Fallacy: changing the subject. \n\n \n It was about the U.S., the subject that you're unsuccessfully trying to change. Is there a fallacy for trying, and failing to change the subject? Must not be, I couldn't find it. :p \n \n \n \nNotice how that was after post #96, where you clearly raised the bar by limiting the discussion to a place where it was not\n Two can play this game. \n\n \n The U.S. was mentioned several times before post #96.\n \n \n \nseriously, stop using the word fallacy, you obvious do not understand what they mean nor how they apply.\n\n \n Explain how you DON'T use emotive language.", 
   {}, 
   98932, 
   null, 
   1111114200.0
  ], 
  [
   99272, 
   null, 
   "marc9000", 
   "One of the roles of the Judicial Branch(i.e. the Supreme Court) is to check abuses by the \"people\", meaning the majority, by reviewing legislation. That is the \"proper Constitutional way\" as I see it and I believe I'm on good footing there.\n\n \n There are some serious questions being raised about today's Judicial Branch LEGISLATING, not reviewing. Declaring capital punishment for minors unconstitutional is one of many examples. But that's a different forum.\n \n There is a chance that today's Judicial Branch could get more involved with the legislating process concerning laws with Judeo Christian principles. Dangerous.", 
   {}, 
   99108, 
   null, 
   1111114680.0
  ], 
  [
   99294, 
   null, 
   "Dzeron", 
   "The advancement of a non-christian religion in a nation also brings the advancement of atheism in that nation.\n\n \n Oh, sure. Atheists have lots of rights in Saudi Arabia.", 
   {}, 
   98523, 
   null, 
   1111120920.0
  ], 
  [
   99334, 
   null, 
   "Mach", 
   "There are some serious questions being raised about today's Judicial Branch LEGISLATING, not reviewing. Declaring capital punishment for minors unconstitutional is one of many examples. But that's a different forum.\n \n There is a chance that today's Judicial Branch could get more involved with the legislating process concerning laws with Judeo Christian principles. Dangerous.\n\n \n Who is raising these questions? The conservative propoganda machine? Who? Name them for us please, and give us some details about how these judges are somehow doing something other than what they have been appointed to do. No political party has your best interest at heart, they get paid to make you think that. Heavens man, break out of this \"sheeple\" mode, think for yourself. Your morality comes from a work of fiction? Your beliefs about our government come from politicians?...what next? \n \n How about this. Not thinking for yourself. The most dangerous thing there is...\n \n -Mach", 
   {}, 
   99272, 
   null, 
   1111128540.0
  ], 
  [
   99630, 
   null, 
   "zachvac", 
   "\n As long as those \"continued preferences\" are removed in the proper constitutional way. By the people, not the courts.\n\n \n So they were put there in an unconstitutional way but they must be removed in a constitutional way? Removing them would only be correcting the earlier mistake, so would only have to go through the courts. I know, I'll steal something and then you have to get it back Constitutionally, not through court.", 
   {}, 
   98858, 
   null, 
   1111213020.0
  ], 
  [
   99691, 
   null, 
   "marc9000", 
   "Who is raising these questions? \n\n \n One would be Justice Antonin Scalia. C-Span handed him a microphone, and allowed him to speak. They didn't cut him off in half sentence and try to twist what he says, unlike much of the mainstream media.\n \n \n The conservative propoganda machine? \n\n \n Shouldn't you call that the \"Republican propaganda machine\"? Haven't you heard, eevvvverybody wants to be a conservative!!! :p \n \n \n Who? Name them for us please, and give us some details about how these judges are somehow doing something other than what they have been appointed to do. No political party has your best interest at heart, they get paid to make you think that. \n\n \n So with nothing more than a choice between the two, I tend to favor the political party that doesn't seek to raise my taxes as much as the other one or take my guns as much as the other one. \n \n \n Heavens man, break out of this \"sheeple\" mode, think for yourself. Your morality comes from a work of fiction? Your beliefs about our government come from politicians?...what next? \n \n How about this. Not thinking for yourself. The most dangerous thing there is... \n \n -Mach\n\n \n And you're in favor of letting a group of unelected, activist judges do your thinking for you?\n \n We're in the wrong forum. Where would be the most appropriate forum to discuss this, \"Government, Politics, or Crime?", 
   {}, 
   99334, 
   null, 
   1111261020.0
  ], 
  [
   99692, 
   null, 
   "marc9000", 
   "So they were put there in an unconstitutional way but they must be removed in a constitutional way? \n\n \n That's exactly right. \n \n \nRemoving them would only be correcting the earlier mistake, so would only have to go through the courts. I know, I'll steal something and then you have to get it back Constitutionally, not through court.\n\n \n That's a perfect example. As private citizens, if you steal something from me, I'll be in trouble if I take the law into my own hands. I have to follow the law to get it back.", 
   {}, 
   99630, 
   null, 
   1111261380.0
  ], 
  [
   102419, 
   null, 
   "Duo_Maxwell", 
   "Why did you post a link for this site for us to see, yet you didn't post those people a link to see THIS site? Is there something here you didn't want them to see?\n\n \n Actually I did. There's a specific post detaling why they removed the link, but they did quote specific parts. Again, more disonesty and fraud on your part. \n \n \nIt was about the U.S., the subject that you're unsuccessfully trying to change. Is there a fallacy for trying, and failing to change the subject? Must not be, I couldn't find it.\n\n \n Sheer idiocy. I will concede you are correct if you can somehow prove that a post made in the past was specifically geared towards a discussion that occured in the future. emoticon_rolleyes :p \n \n \nThe U.S. was mentioned several times before post #96.\n\n \n Does the phrase \"different discussion\" mean anything to you? Simply because it is mentioned in a different dicussion in the same threat does not mean it is dealing with our discussion. If you noticed, threads often have more then one discussion at any one time. \n \n \nExplain how you DON'T use emotive language\n\n \n Emotive language deals with the aduience. The audience can go screw it self here for all I care.", 
   {}, 
   99266, 
   null, 
   1112091660.0
  ], 
  [
   102635, 
   null, 
   "Ladywolf", 
   "The advancement of a non-christian religion in a nation also brings the advancement of atheism in that nation.\n\n \n Hmmm, let's see...does that apply to Judiaism? Judiaism isn't a Christian religion. As a matter of fact, Christianity was born from it, so no, I don't think a non-christian religion brings the advancement of atheism in a nation.", 
   {}, 
   98523, 
   null, 
   1112144160.0
  ], 
  [
   102657, 
   null, 
   "Duo_Maxwell", 
   "As near as I can tell, he offers no support beyond the simple statement. I think your out of luck, you're debating a fool.\n\n \n \nDuo, you've discovered the greatest kind of fool; he who consciously refuses to consider the opposition.\n\n \n http://www.onlinedebate.net/forums/showthread.php?p=72551#post72551", 
   {}, 
   102635, 
   null, 
   1112150340.0
  ], 
  [
   102666, 
   null, 
   "marc9000", 
   "Actually I did. There's a specific post detaling why they removed the link, but they did quote specific parts. Again, more disonesty and fraud on your part. \n\n \n Yes, I see you did - all the way down in post#22, after post #21 said to you; \"we're only hearing your side\". The administrator that removed the link and quoted only a few posts of mine (which didn't tell the whole story at all) has a sig there that clearly indicates he is a non-Christian. But I'm not interested in other boards. I wonder if that's a first here at 4forums - a poster here calling attention to a completely different, unrelated forum for the sole purpose of downgrading someone here. \n \n \n \n \nSheer idiocy. I will concede you are correct if you can somehow prove that a post made in the past was specifically geared towards a discussion that occured in the future. emoticon_rolleyes :p \n\n \n Okay! Post #12 and #15 from the \"past\" (in the \"discrediting Christianity\" thread, at THIS forum) concerned U.S. law, and were the base for every exchange that you and I had in the \"future\" of that thread. \n \n \n \n \nDoes the phrase \"different discussion\" mean anything to you? Simply because it is mentioned in a different dicussion in the same threat does not mean it is dealing with our discussion. If you noticed, threads often have more then one discussion at any one time. \n\n \n There were several different discussions in that thread, by several different people. But the discussion you and I had, all went back to posts #12 & #15.\n \n \n \nEmotive language deals with the aduience. The audience can go screw it self here for all I care.\n\n \n This is fascinating. So if you proclaim that you don't care about the audience, you are exempt from using fallacies? Tell me, is the \"emotive language\" fallacy the only one that applies to, or are they all that way? If it's only some of them, no need to go to all the trouble to name them all. Just a rough percentage would be nice. emoticon_xclown \n \n I can see it now - A Democrat and Republican are about to debate on television, and the Democrat says;\n \n \"Before we begin, Mr. Moderator Sir, I want to make clear that I am here ONLY to answer your questions, and debate this fine Republican here, I'm not concerned about the audience in the least.\"\n \n And the Moderator says;\n \n \"What about you, Mr. Republican, do you care about the audience?\"\n \n And the Republican says; \"well, yes I do\". \n \n And the Moderator says; \"Okay, I hereby proclaim that the Democrat can use ALL THE FALLACIES HE WANTS, but if the Republican uses a single one, he LOSES.\"\n \n I guess that would be the only way to make it fair, come to think of it. :p", 
   {}, 
   102419, 
   null, 
   1112151420.0
  ], 
  [
   102669, 
   null, 
   "Duo_Maxwell", 
   "Yes, I see you did - all the way down in post#22, after post #21 said to you; \"we're only hearing your side\". The administrator that removed the link and quoted only a few posts of mine (which didn't tell the whole story at all) has a sig there that clearly indicates he is a non-Christian. But I'm not interested in other boards.\n\n \n Internal contridiction. You stated Why did you post a link for this site for us to see, yet you didn't post those people a link to see THIS site? Is there something here you didn't want them to see?\n \n And now you say I DID post a link. Why are you saying that I didn't but I did? emoticon_rolleyes Internal contricidiction. Make up your mind, did I link them the site or did I not? I don't care if you're not interested in other boards. I don't care if they are christian or not. The logic is still flawed regardless of the religious beliefs of the post. You keep ignoring that. \n \n \nI wonder if that's a first here at 4forums - a poster here calling attention to a completely different, unrelated forum for the sole purpose of downgrading someone here.\n\n \n fallacy: changing the subject. You apparently will not listen to me or anyone here. I'm merely attempting to try bring in opinions from a group you have not entirely rejected yet, apparently that doesn't work either. The mod is right,Duo, you've discovered the greatest kind of fool, he who consciously refuses to consider the opposition\n \n \n\n Okay! Post #12 and #15 from the \"past\" (in the \"discrediting Christianity\" thread, at THIS forum) concerned U.S. law, and were the base for every exchange that you and I had in the \"future\" of that thread.\n\n \n Please tell me how my posts on a different subject relate to your logic. \n \n Let's examine what I said. People question Christanity because certain officials are trying to legislate Christanity into law, and that Christianity is another egotistical religion, and it's always fun to poke holes in that ideology.\n \n How does that even relate to your flawed logic which states that if one religion advances over christanity then atheism does as well? You're not even make sense. It appears you just searched for whever I said US and then applied to a discussion that doesn't even relate! You posted #15, not me. Please make a link to the current one. You've failed to do so. \n \n \n\n There were several different discussions in that thread, by several different people. But the discussion you and I had, all went back to posts #12 & #15.\n \n\n \n That is not only a completely different discussion, but it's compltely different thread that doesn't even speak about such logic. HOW CAN YOU COMPARE THINGS THAT ARE NOT EVEN REMOTELY RELATED?\n \n \n\n This is fascinating. So if you proclaim that you don't care about the audience, you are exempt from using fallacies?\n\n \n It is quite clear you do not understand fallacies. Emotive attempts to sway the emotions of the audience; thus the audience must matter in the discussion. That doesn't work here. I have specifically stated I don't CARE about the audience. The fallacy only works if the user is attempts to sway emotions. How can I sway something I care nothing about? \n \n \nTell me, is the \"emotive language\" fallacy the only one that applies to, or are they all that way? If it's only some of them, no need to go to all the trouble to name them all. Just a rough percentage would be nice. emoticon_xclown\n\n \n That doesn't even make sense. \n \n Your analogy is bad. It is trying to link two different things that share no connection. Fallacy: Bad Analogy.", 
   {}, 
   102666, 
   null, 
   1112152140.0
  ], 
  [
   102684, 
   null, 
   "marc9000", 
   "Internal contridiction. You stated Why did you post a link for this site for us to see, yet you didn't post those people a link to see THIS site? Is there something here you didn't want them to see?\n \n And now you say I DID post a link. Why are you saying that I didn't but I did? \n\n \n You didn't post it when you asked them the question in the first post. You only attempted to post it when pressed. I said you didn't because I didn't follow that other board - I figured since you didn't do it initially, you never would. I see you or the moderator didn't want anyone there to see the posts that started our entire disscussion - #12 & #15.\n \n \n emoticon_rolleyes Internal contricidiction. Make up your mind, did I link them the site or did I not? I don't care if you're not interested in other boards. I don't care if they are christian or not. The logic is still flawed regardless of the religious beliefs of the post. You keep ignoring that. \n\n \n And I don't care about your unsuccessful attempts to link others here when you can't find enough support here, in THIS audience.\n \n \n \n \nfallacy: changing the subject. You apparently will not listen to me or anyone here. I'm merely attempting to try bring in opinions from a group you have not entirely rejected yet, apparently that doesn't work either. The mod is right,Duo, you've discovered the greatest kind of fool, he who consciously refuses to consider the opposition \n\n \n [sarcasm mode on] Well, I do appreciate your polite consideration of the opposition that I present to you. [sarcasm mode off]\n \n \n \n \nPlease tell me how my posts on a different subject relate to your logic. \n \n Let's examine what I said. People question Christanity because certain officials are trying to legislate Christanity into law, and that Christianity is another egotistical religion, and it's always fun to poke holes in that ideology.\n \n How does that even relate to your flawed logic which states that if one religion advances over christanity then atheism does as well? You're not even make sense. It appears you just searched for whever I said US and then applied to a discussion that doesn't even relate! You posted #15, not me. Please make a link to the current one. You've failed to do so. \n\n \n I've done it over and over. It's all in that other thread. You've probably forgot it all, during your absence.\n \n \n \n \nThat is not only a completely different discussion, but it's compltely different thread that doesn't even speak about such logic. HOW CAN YOU COMPARE THINGS THAT ARE NOT EVEN REMOTELY RELATED? \n\n \n Fallacy; failure to state. \n \n \n \n \nIt is quite clear you do not understand fallacies. Emotive attempts to sway the emotions of the audience; thus the audience must matter in the discussion. That doesn't work here. I have specifically stated I don't CARE about the audience. The fallacy only works if the user is attempts to sway emotions. How can I sway something I care nothing about? \n\n \n You said up above that you don't care if I'm interested in other boards. Let me guess - maybe we can agree on something - you probably don't care a thing about what I think about anything. Agreed?? emoticon_xclown If you also don't care about the audience either, WHY DO YOU POST HERE??\n \n \n \n \nThat doesn't even make sense. \n\n \n What other fallacies only apply to audiences? Example, the \"fallacy of needling\" - simply attempting to make the other person angry? Are you exempt from that one too, since you don't care about the audience? How about \"failure to state\"? That's a big one for you; \"if you make enough attacks, and ask enough questions, you may never have to actually define your own position on the topic\". You've never defined how removal of the ten commandments from public squares, removal of prayer from schools, etc. etc. - other advancements of atheism, will allow Christianity to have the same effect it had when the ten commandments were more visible, when prayer was allowed in public schools. Your posts on that other board and yours here focus on attacking ME a lot more than addressing your beliefs.\n \n Are you exempt from \"failure to state\", because you don't care about audiences? :p \n \n \nYour analogy is bad. It is trying to link two different things that share no connection. Fallacy: Bad Analogy.\n\n \n Your vacation has left you forgetfull.", 
   {}, 
   102669, 
   null, 
   1112154540.0
  ], 
  [
   102688, 
   null, 
   "Duo_Maxwell", 
   "You didn't post it when you asked them the question in the first post. You only attempted to post it when pressed.\n\n \n Pressed by whom? It doesn't change the fact that you still have a internal contridiction you're only feeding. Now you state that I DID give a link, where before you said I did not. Flip flopping aren't we? Do you concede that your claim that I did not link was wrong or do you want to contiune with charade of flip flopping? \n \n \nI said you didn't because I didn't follow that other board\n\n \n What? That doesn't even make sense. Please post sentences that make sense. \n \n \nI figured since you didn't do it initially, you never would. I see you or the moderator didn't want anyone there to see the posts that started our entire disscussion - #12 & #15.\n\n \n Fallacy: argument via laziness, More fraud on your part. Please prove that asseration. If you go back, they have a rule aganist linking other debate boards. Fallacy: least plausible hypothesis. Again more fraud on your part. \n \n \n\n And I don't care about your unsuccessful attempts to link others here when you can't find enough support here, in THIS audience.\n\n \n Obviously you don't care about much. I've discovered the greatest kind of fool, he who consciously refuses to consider the opposition. \n \n \nWell, I do appreciate your polite consideration of the opposition that I present to you. \n\n \n Where polite you mean constant use of fraudlent actions, and conserideration, constant ignoration of refutations and page citations? emoticon_rolleyes \n \n \n\n I've done it over and over. It's all in that other thread. You've probably forgot it all, during your absence.\n\n \n I asked you to prove it. I even cited it. It is your job to back your asseration. If you fail to do so, then the point is ejected from the debate. You made the claim, now back it up or lose. \n \n \n\n Fallacy; failure to state.\n\n \n I can't even beginning to understand how that applies! My asseration is that your constant citation of posts made before the discussion have no bearing upon that discussuion and such behavior as to make irrevelant posts relevent is not only dishonest, but unethical and shameful. Have I failed to state my position? No. I have no. Therefore your fallacy does not apply and is ejected from the debate as false and substanceless. \n \n \n\n You said up above that you don't care if I'm interested in other boards. Let me guess - maybe we can agree on something - you probably don't care a thing about what I think about anything. Agreed??\n\n \n No agreement. I'm trying to make you see that your logic is faulty. I'm also tossing our your constant use of fraud. Get back to proving your asseration; if you cannot, you therefore lose and the logic is therefore wrong and faulty. Are you willing to do that? You were the one constatnly changing the subject as well as raising the goal post and limiting the discussion to a restriction it never resided in. \n \n \n\n What other fallacies only apply to audiences? Example, the \"fallacy of needling\" - simply attempting to make the other person angry? Are you exempt from that one too, since you don't care about the audience? How about \"failure to state\"?\n\n \n Once again, fallacy: changing the subject. How does needling apply? I don't understand how you use fallacies, they don't evne apply, and whne challenged, you simply drop them. It is like you are merely randomly picking and hopeing one will stick. \n \n \nThat's a big one for you; \"if you make enough attacks, and ask enough questions, you may never have to actually define your own position on the topic\".\n\n \n Again, fallacy does not work. I made my stance that your logic is wrong and backed it up with real life examples. You have failed to prove your logic is correct. I have clearly stated my position. \n \n \nYou've never defined how removal of the ten commandments from public squares, removal of prayer from schools, etc. etc. - other advancements of atheism,\n\n \n How are they advancements of atheism? We weren't evne talking about that! Fallacy:changing the subject. \n \n \nYour posts on that other board and yours here focus on attacking ME a lot more than addressing your beliefs.\n\n \n I am attacking your logic which you refuse to support and resort to fraud to attempt to avoid proving. \n \n \n\n Your vacation has left you forgetfull.\n\n \n Fallacy: ad homenin.", 
   {}, 
   102684, 
   null, 
   1112155380.0
  ], 
  [
   102695, 
   null, 
   "marc9000", 
   "I see you now bring out your secret weapon. I've seen you do it so many times before with so many others here. When you get pretty far into a debate and see that you're losing, you claim your opponent has failed in EVERY WAY to prove his points. In a twisted way, it's a can't-lose method for you. The problem is, it's a calamity of fallacies, oh a multitude of fallacies. Ad Hominem, Moving Goalposts, Needling, Failure to State, some others, along with your standard, Emotive language. It makes a blanket statement that delays and frustrates your opponent, and attemps to bleed them of patience and time. If they attempt to go back and make more clear anything that they've said, then you turn up your fallacy use to further frustrate them. (usually more emotive language.) If your opponent gives up in frustration, then you have changed the SENTIMENTS, not the minds, of those who may tend to agree with you. \n \n It's been your secret weapon, but now it's not so secret anymore, is it?\n \n Have a good evening! :)", 
   {}, 
   99692, 
   null, 
   1112156100.0
  ], 
  [
   102698, 
   null, 
   "gnojek", 
   "Who circumsizes their heart and ears?\n How do you go about such things?", 
   {}, 
   102695, 
   null, 
   1112156160.0
  ], 
  [
   102820, 
   null, 
   "Duo_Maxwell", 
   "Marc9000, you haveconsistantly failed to back a single thing you have stated\n You have resorted to fraudulent act after fradulent act\n You have failed to give a half decent reason to why anyone should consider your points\n You resort to fabrication and dishonest quote context\n When challenged to prove something you claim, you lie to provide proof that does not exist\n Either argue your logic or concede.", 
   {}, 
   102698, 
   null, 
   1112210100.0
  ], 
  [
   102841, 
   null, 
   "georged", 
   "Duo, by now you must realize people rooted in the past, emotionally directed by political forces and committed to mythical belief systems as a life style are able to entertain few rational thoughts or facts outside that self-imposed world. You're attempting to communicate with the general public and that's impossible unless one is prepared to offer promises, feasible or not, of what they happen to desire.", 
   {}, 
   102820, 
   null, 
   1112214960.0
  ], 
  [
   102914, 
   null, 
   "Duo_Maxwell", 
   "So, really georged, i'm dealing with the greatest kind of fool: one who consciously refuses to consider the opposition.", 
   {}, 
   102841, 
   null, 
   1112224440.0
  ], 
  [
   102917, 
   null, 
   "georged", 
   "That's the conceit factor. There are no perceived options.", 
   {}, 
   102914, 
   null, 
   1112224860.0
  ], 
  [
   102957, 
   null, 
   "marc9000", 
   "Marc9000, you haveconsistantly failed to back a single thing you have stated\n You have resorted to fraudulent act after fradulent act\n You have failed to give a half decent reason to why anyone should consider your points\n You resort to fabrication and dishonest quote context\n When challenged to prove something you claim, you lie to provide proof that does not exist\n\n \n According to you. I wonder what the entire audience thinks. :p \n \n \nEither argue your logic or concede.\n\n \n I have, I have. It's just that you refuse to consider the opposition.", 
   {}, 
   102820, 
   null, 
   1112236800.0
  ], 
  [
   102958, 
   null, 
   "marc9000", 
   " You're attempting to communicate with the general public and that's impossible unless one is prepared to offer promises, feasible or not, of what they happen to desire.\n\n \n Are you saying ~I~ represent the general public? Wow, I'm honored. emoticon_xclown I guess if I and the rest of the general public would read up on some John LeCarre, we wouldn't be so clueless.", 
   {}, 
   102841, 
   null, 
   1112236980.0
  ], 
  [
   102975, 
   null, 
   "georged", 
   "Are you saying ~I~ represent the general public? Wow, I'm honored. emoticon_xclown I guess if I and the rest of the general public would read up on some John LeCarre, we wouldn't be so clueless.\n\n \n I don't know about your particular circumstances, but irregardless of their reading material most of the general public will remain clueless. That's their role in life.", 
   {}, 
   102958, 
   null, 
   1112240760.0
  ], 
  [
   102977, 
   null, 
   "Duo_Maxwell", 
   "Hence rational voter ignorance. \n \n marc9000, sure let's check what others have specifically said. \n \n \nAs near as I can tell, he offers no support beyond the simple statement. I think your out of luck, you're debating a fool.\n\n \n \nDuo, you've discovered the greatest kind of fool; he who consciously refuses to consider the opposition. The \"This is my view, and I don't intend to reconsider it\". By intentionally ignoring your statement, he is shutting his eyes to the opposition\n\n \n \nOh, sure. Atheists have lots of rights in Saudi Arabia.\n\n \n \nAbsurd. Note \"the advancement of atheism\" in Indonesia in the wake of the dramatic growth of Islam\n\n \n \nNo, that is an absurd statement.\n\n \n \nThis statement in and of itself is illogical.\n\n \n It appears you're losing. \n \n Run away, you have nothing", 
   {}, 
   102975, 
   null, 
   1112241540.0
  ], 
  [
   102984, 
   null, 
   "trebor", 
   "According to you. I wonder what the entire audience thinks. :p \n \n \n \n I have, I have. It's just that you refuse to consider the opposition.\n\n \n \n Actually, I agree with Duo on this matter, 100%", 
   {}, 
   102957, 
   null, 
   1112244480.0
  ], 
  [
   102985, 
   null, 
   "Debate_Queen615", 
   "I think it depends strictly on the people.", 
   {}, 
   102984, 
   null, 
   1112244780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Do you agree with such logic?", 
  "url": "http://www.4forums.com/political/religion-debates/4552-do-you-agree-such-logic.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4552, 
  "discussion_files": [
   [
    "16753.html", 
    "http://www.4forums.com/political/religion-debates/4552-do-you-agree-such-logic-print.html"
   ], 
   [
    "16754.html", 
    "http://www.4forums.com/political/religion-debates/4552-do-you-agree-such-logic-5-print.html"
   ], 
   [
    "16755.html", 
    "http://www.4forums.com/political/religion-debates/4552-do-you-agree-such-logic-4-print.html"
   ], 
   [
    "16756.html", 
    "http://www.4forums.com/political/religion-debates/4552-do-you-agree-such-logic-3-print.html"
   ], 
   [
    "16757.html", 
    "http://www.4forums.com/political/religion-debates/4552-do-you-agree-such-logic-2-print.html"
   ]
  ], 
  "identifier": 4552
 }
]