[
 [
  [
   98565, 
   null, 
   "zachvac", 
   "Many people argue that the second amendment claims we have the right to bear arms, but usually they leave out the rest. It says to form a militia. So unless you are forming a militia you don't have the right to bear arms by the Constitution.", 
   {
    "post_info": {
     "post_title": "The misinterpretations of the 2nd amendment"
    }
   }, 
   null, 
   null, 
   1110951480.0
  ], 
  [
   98572, 
   null, 
   "pickleweaseler", 
   "Many people argue that the second amendment claims we have the right to bear arms, but usually they leave out the rest. It says to form a militia. So unless you are forming a militia you don't have the right to bear arms by the Constitution.\n\n \n Uh... no.\n \n The 2nd doesn't mention forming a militia.", 
   {}, 
   98565, 
   null, 
   1110952320.0
  ], 
  [
   98601, 
   null, 
   "daewoo", 
   "A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed. \n \n \n Where does that talk about forming a militia?\n \n The first portion of the amendment is called a \"justification clause\", the second part is the \"actionable clause\". The justification clause does not limit the actionable clause.\n \n If you have further questions about this, you might cxonsider the writings of some of the founding fathers, since they wrote it and all, they are probably as quyalified to explain it as anybody, and they do....very well....and fairly frequently in their writings.", 
   {}, 
   98572, 
   null, 
   1110966780.0
  ], 
  [
   98925, 
   null, 
   "Bryan", 
   "What was the intent of the phrase: \"A well regulated militia being necessary to the security of a free State?\" Why was it included in the Second Amendment? Here is my poor opinion. Feel free to agree or disagree. \n \n I think you first have to understand the nature of the militia of the time when our nation was founded. For the short explanation, all we have to do is consult the case most often cited by the Brady Campaign in its claims that we have no individual RKBA:\n \n \"The signification attributed to the term Militia appears from the debates in the Convention, the history and legislation of the Colonies and the States, and the writings of approved commentators. These show plainly enough that the militia comprised all males physically capable of acting in concert for the common defense. \"A body of citizens enrolled for military discipline.\" And further, that ordinarily when called for service these men were expected to appear bearing arms supplied by themselves and of a kind in common use at the time.\"  U.S. v. Miller, 307 U.S. 174, 179 (1939).\n \n The next thing I believe we must acknowledge is the oft-expressed fear our founders had of the ability of a tyrant to use a standing professional army as an instrument of his dominion. Do you remember reading about Patrick Henry's famous \"give me liberty or give me death\" oration? Well, prior to giving that speech, Henry offered a draft resolution for forming a government which would rely on a militia instead of a professional army. That resolution said: \"that a well regulated militia, composed of gentlemen and yeomen, is the natural strength and only security of a free government.\" Speech of Patrick Henry in R. Meade's Patrick Henry, p. 28 (1969).\n \n Hold that thought, for you will see it expressed repeatedly by our founders when they drafted the various state constitutions after winning their freedom from England. Here are a few examples:\n \n Constitution of Virginia: That a well-regulated militia, composed of the body of the people, trained to arms, is the proper, natural, and safe defense of a free state; that standing armies, in time of peace, should be avoided, as dangerous to liberty. (As a proud son of Virginia, I feel compelled to note that this was the first American constitution, and that it even preceded the Declaration of Independence)\n \n Constitution of Pennsylvania: That the people have a right to bear arms for the defense of themselves and the state; And as standing armies in the time of peace are dangerous to liberty, they ought not to be kept up.\n \n Delaware Declaration of Rights: That a well-regulated militia is the proper, natural and safe defense of a free government. That standing armies are dangerous to liberty, and ought not to be raised or kept up without the consent of the legislature.\n \n Constitution of Maryland: That a well-regulated militia is the proper and natural defense of a free government. That standing armies are dangerous to liberty, and ought not to be raised or kept up, without consent of the legislature.\n \n Constitution of North Carolina: That the people have a right to bear arms, for the defense of the State; and, as standing armies, in time of peace, are dangerous to liberty, they ought not to be kept up.\n \n Constitution of Vermont: That the people have a right to bear arms for the defense of themselves and the State; and, as standing armies, in time of peace, are dangerous to liberty, they ought not to be kept up.\n \n Constitution of Massachusetts: The people have a right to keep and bear arms for the common defense. And as, in time of peace, armies are dangerous to liberty, they ought not to be maintained without the consent of the legislature.\n \n Constitution of New Hampshire: A well-regulated militia is the proper, natural, and safe defense of a state. Standing armies are dangerous to liberty, and ought not to be raised or kept up without the consent of the legislature.\n \n Do you see the widespread fear of a standing army, and the desire to rely upon the citizen's militia instead? Now remember that when the national Constitution was proposed it came before the people for ratification without any of this language expressing the intent to rely upon a militia over a professional army, nor did it contain any protection of the individual citizen's right to keep and bear arms \"supplied by themselves.\" There was nothing within the Constitution to prevent the federal government from disarming the militias through prohibiting the citizens from keeping and bearing their private arms. What did the great Anti-Federalist Patrick Henry have to say about this?\n \n \"My great objection to this Government is, that it does not leave us the means of defending our rights; or, of waging war against tyrants. . . .\n The Honorable Gentleman who presides, told us, that to prevent abuses in our Government, we will assemble in Convention, recall our delegated powers, and punish our servants for abusing the trust reposed in them. Oh, Sir, we should have fine times indeed, if to punish tyrants, it were only sufficient to assemble the people. Your arms wherewith you could defend yourselves, are gone. . . . Did you ever read of any revolution in any nation, brought about by the punishment of those in power, inflicted by those who had no power at all? You read of a riot act in a country which is called one of the freest in the world, where a few neighbors cannot assemble without the risk of being shot by hired soldiery, the engines of despotism. We may see such an act in America. A standing army we shall have also, to execute the execrable commands of tyranny: And how are you to punish them? Will you order them to be punished? Who shall obey these orders? Will your Mace-bearer be a match for a disciplined regiment? In what situation are we to be? . . . .What resistance could be made? The attempt would be madness.\"  Patrick Henry, Speeches of June 5 and 7, 1788, before the Virginia Ratifying Convention, reprinted in The Anti-Federalist Papers and the Constitutional Convention Debates, pages 199-216, Mentor Books, 1986, edited by Ralph Ketchum.\n \n How did some of the Federalists respond to the fears Patrick Henry voiced? Hey, you've already got the arms you provide when called forth for militia service by your states, and the federal government will not be powerful enough to take them from you and deprive you of your ability to resist tyranny. Here are a few examples of this line of thought: \n \n \"My friends and countrymen, it is not so, for the powers of the sword are in the hands of the yeomanry of America from sixteen to sixty. The militia of these free commonwealths, entitled and accustomed to their arms, when compared with any possible army, must be tremendous and irresistible. Who are the militia? Are they not ourselves? Is it feared, then, that we shall turn our arms each man against his own bosom? Congress shall have no power to disarm the militia. Their swords and every other terrible implement of the soldier, are the birth-right of an American ....[T]he unlimited power of the sword is not in the hands of either the federal or the state governments, but where I trust in God it will ever remain, in the hands of the People.\"  Tench Coxe, Pennsylvania Gazette, Feb. 20, 1788.\n \n \"Before a standing army can rule, the people must be disarmed; as they are in almost every kingdom of Europe. The supreme power in America cannot enforce unjust laws by the sword; because the whole body of the people are armed, and constitute a force superior to any bands of regular troops that can be, on any pretense, raised in the United States. A military force, at the command of Congress, can execute no laws, but such as the people perceive to be just and constitutional; for they will possess the power, and jealousy will instantly inspire the inclination, to resist the execution of a law which appears to them unjust and oppressive.\"  Noah Webster, \"An Examination into the Leading Principles of the Federal Constitution\" (1787) in Pamphlets on the Constitution of the United States (P. Ford, 1888).\n \n Yet, the passion for recognition of an individual RKBA and relying upon individually supplied arms in citizen militias as an alternative to a standing army remained strong. Consider the following comments: \n \n \"And that the said Constitution be never construed to authorize Congress to infringe the just liberty of the Press, or the rights of Conscience; or to prevent the people of the United States, who are peaceable citizens, from keeping their own arms. . .\"  Samuel Adams, Debates & Proceedings in the Convention of the Commonwealth of Massachusetts, 86-87 (February 6, 1788). [That's why I drink the man's beer]\n \n \"It has been asserted by the most respectable writers upon government, that a well-regulated militia, composed of the yeomanry of the country, have ever been considered as the bulwark of a free people. Tyrants have never placed any confidence on a militia composed of freemen.\" John DeWitt, The Anti-Federalist Papers, p. 75 (M. Borden ed. 1965)\n \n \"Whenever, therefore, the profession of arms becomes a distinct order in the state. . .the end of the social compact is defeated. . . .No free government was ever founded, or ever preserved its liberty, without uniting the characters of the citizen and soldier in those destined for defense of the state. . . .Such a well regulated militia, composed of freeholders, citizens and husbandman, who take up arms to preserve their property, as individuals, and their rights as freemen.\"  M. T. Cicero (a pseudonym), Charleston State Gazette, September 8, 1788.\n \n \"A militia, when properly formed, are in fact the people themselves, and render regular troops in a great measure unnecessary. . . .the constitution ought to secure a genuine and guard against a select militia. . .and include. . .all men capable of bearing arms. . . . But, say gentlemen, the general militia are for the most part employed at home in their private concerns, cannot well be called out, or be depended upon; that we must have a select militia. . . .[of the select militia] These Corps, not much unlike regular troops, well ever produce an inattention to the general militia. . .whereas, to preserve liberty, it is essential that the whole body of the people always possess arms, and be taught alike, especially when young, how to use them. . . .The mind that aims at a select militia, must be influenced by a truly anti-republican principle; and when we see many men disposed to practice upon it, whenever they can prevail, no wonder true republicans are for carefully guarding against it.\"  Richard Henry Lee, Additional Letters from the Federal Farmer, p. 169-170 (1788)\n \n Fortunately for us, our founders accepted the wisdom of creating an American bill of rights. James Madison was tasked with drafting the recognitions of these civil liberties. Here is a sampling of how his amendments were viewed:\n \n \"Mr. Madison has introduced his long expected amendments. . . .It contains a bill of rights [including] . . . .the right to keep and bear arms.\"  Fisher Ames, 1 Works of Fisher Ames, pp. 52-53 (1854) [Letter to Thomas Dwight, June 11, 1789].\n \n \"The rights of conscience, of bearing arms, of changing the government, are declared to be inherent in the people.\"  Fisher Ames, 1 Works of Fisher Ames, pp. 53-54 (1854) [Letter to F. I. Minoe, June 12, 1789].\n \n \"Last Monday, a string of amendments were presented to the lower house; these altogether respected personal liberty.\"  William Grayson, 3 Patrick Henry, p. 391 (1951) [letter from Grayson to Henry, June 12, 1789].\n \n As Madison traveled and exhorted ratification of his Bill of Rights, his good friend Tench Coxe published an explanation of the amendments submitted for approval by the public. Look at how the purpose of the Second Amendment was sold for ratification:\n \n \"As civil rulers, not having their duty to the people duly before them, may attempt to tyrannize, and as the military forces which must be occasionally raised to defend our country, might pervert their power to the injury of their fellow citizens, the people are confirmed by the article in their right to keep and bear private arms.\" Tench Coxe, Remarks on the First Part of the Amendments to the Federal Constitution. Published under the pseudonym, \"A Pennsylvanian\" in the Philadelphia Federal Gazette, June 18, 1789 at 2 Col. 1\n \n Do you see how comprehensively this definition of the Second Amendment addresses the fears that the federal government could disarm the public and then use a standing army as an instrument of oppression?\n \n Coxe forwarded his Remarks to Madison with the following statement: \"It has appeared to me that a few well tempered observations on these propositions might have good effect. . . .It may perhaps be of use in the present turn of the public opinions in New York State.\"  Tench Coxe, 12 Madison Papers, pp. 239-240 (Rutland Ed. 1979) [Letter from Coxe to Madison, June 18, 1789]. Madison replied by noting that Coxe's Remarks \"are already I find in the Gazettes here....\"  He went on to thank Coxe by stating that his Amendments were \"therefore already indebted to the co-operation of your pen.\" James Madison, 12 Madison Papers, p. 257 (Rutland Ed. 1979) [Letter from Madison to Coxe, June 24, 1789]. \n \n Here, then, is what I believe are the two core principles of the Second Amendment:\n \n 1. Avoid wherever possible maintaining a standing army. A well regulated militia, composed of all citizens capable of bearing their private arms, is the best method to provide for the security of a FREE state (ie. A state in which the people need not fear the ambitions of their own government); AND\n \n 2. That every citizen has the right to keep and bear private arms because they provide him with the ability to defend his life, his liberty, and his property from the \"tyranny of irritated ministers\" as well as providing him with the means to \"discourage and keep the invader and the plunderer in awe\" (citing the Continental Congress' \"Declaration of the Causes and Necessity of Taking Up Arms\" and Thomas Paine, respectively) \n \n Therefore, In my opinion,the language \"[a] well regulated militia being necessary to the security of a free State\" was NEVER intended by our founding fathers to limit the right of the people to keep and bear private arms. Rather, it is preamble which states the universally held principle that \"standing armies, in time of peace, should be avoided, as dangerous to liberty.\"  \n \n -------------------\n \n \"And I cannot see, why arms should be denied to any man who is not a slave, since they are the only true badges of liberty. . . .The possession of arms is the distinction between a freeman and a slave. He who has nothing, and belongs to another, must be defended by him, and needs no arms: but he who thinks he is his own master, and has anything he may call his own, ought to have arms to defend himself and what he possesses, or else he lives precariously and at discretion. And though for a while those who have the sword in their power abstain from doing him injury; yet, by degrees, he will be awed into submission to every arbitrary command. Our ancestors, by being always armed, and frequently in action, defended themselves against the Romans, Danes, and English; and maintained their liberty against encroachments of their own princes.\"  English republican writer Andrew Fletcher, Political Works, pp. 35 and 221 (1749).", 
   {
    "post_info": {
     "post_title": "The meaning of the militia clause"
    }, 
    "unicode_changes_made": true
   }, 
   98601, 
   null, 
   1111039260.0
  ], 
  [
   98927, 
   null, 
   "RooK", 
   "Bryan, you forgot the Kentucky Constitution in your list of constitutions securing individual rights to arms. It is very similar to the first sentence of the Pennsylvania one, then makes mention that they can only restrict concealed weapons.", 
   {}, 
   98925, 
   null, 
   1111039680.0
  ], 
  [
   99386, 
   null, 
   "Bryan", 
   "Bryan, you forgot the Kentucky Constitution in your list of constitutions securing individual rights to arms. It is very similar to the first sentence of the Pennsylvania one, then makes mention that they can only restrict concealed weapons.\n\n \n Yeah, I did forget Kentucky. No offense intended, it was just not in the book I was using when I compiled the original state constitutions, which I still highly recommend for anyone who wants to learn about the history of our civil liberties: Sources Of Our Liberties, American Bar Foundation, Richard L. Perry, editor, revised edition (William S. Hein & Co. 1990). It traces the origin of each of our civil liberties from Magna Carta to the United States Constitution, including complete copies of all significant documents. \n \n ------------\n \n \"Nothing will make a nation so unconquerable as a militia, or every man's being trained to arms. . . . And if the generality of housekeepers were only half disciplined, a designing prince, or ministry, would hardly dare to provoke the people by an open attack on their liberties. . . .But without the people's having some knowledge of arms, I see not what is to secure them against slavery. . . .The confidence, which a standing army gives a minister, puts him upon carrying things with a higher hand, than he would attempt to do, if the people were armed, and the court unarmed, that is, if there were no land-force in the nation, but a militia. Had we [England] at this time no standing army, we should not think of forcing money out of the pockets of three millions of our subjects. .[a long list of injustices suffered by the colonists is omitted here] . .There is no end to observations on the difference between the measures likely to be pursued by a minister backed by a standing army, and those of a court awed by the fear of an armed people.\"  James Burgh, 2 Political Disquisitions, pp. 390 and 475-76. (London 1774).\n \n \"It has been asserted by the most respectable writers upon government, that a well-regulated militia, composed of the yeomanry of the country, have ever been considered as the bulwark of a free people. Tyrants have never placed any confidence on a militia composed of freemen.\"  John DeWitt, The Anti-Federalist Papers, p. 75 (M. Borden ed. 1965) \n \n \"The most foolish mistake we could possibly make would be to allow the subject races to possess arms. History shows that all conquerors who have allowed their subject races to carry arms have prepared their own downfall by so doing. Indeed, I would go so far as to say that the supply of arms to the underdogs is a sine qua non for the overthrow of any sovereignty. So let's not have any native militia or native police. German troops alone will bear the sole responsibility for the maintenance of law and order throughout the occupied Russian territories, and a system of military strong-points must be evolved to cover the entire occupied country.\"  Adolf Hitler, dinner talk on April 11, 1942, quoted in Hitler's Table Talk 1941-44: His Private Conversations, Hugh Redwald Trevor-Roper (Introduction), H. R. Trevor-Roper, Norman Cameron, St, R. H. Stevens (Translator)Second Edition (1973), Pg. 425-426.", 
   {}, 
   98927, 
   null, 
   1111161720.0
  ], 
  [
   99398, 
   null, 
   "Black Phoenix", 
   "Wow....Bryan...are you a history teacher? That has to be one of the best posts. Not for the content really, but for the structure, research, and organization. \n \n I agree with your point.\n \n emoticon_xgood", 
   {}, 
   99386, 
   null, 
   1111164060.0
  ], 
  [
   99556, 
   null, 
   "Bryan", 
   "Thank you. I'm not a teacher. I am a prosecutor.", 
   {}, 
   99398, 
   null, 
   1111187580.0
  ], 
  [
   99558, 
   null, 
   "daewoo", 
   "Thank you. I'm not a teacher. I am a prosecutor.\n\n \n \n And a pretty good guy, for being a damn lawyer :) :) :)", 
   {}, 
   99556, 
   null, 
   1111187820.0
  ], 
  [
   99637, 
   null, 
   "Bryan", 
   "And a pretty good guy, for being a damn lawyer :) :) :)\n\n \n Thank you as well. Most of this **** I post is stuff I have already archived before. It's so much simpler and quicker to cut and paste from MSWord. \n \n -------------\n \n \"We're going to have to take one step at a time, and the first step is necessarily, given political realities, going to be very modest. Our ultimate goal, total control of handguns in the United States, is going to take time. The first problem is to slow down the increasing number of handguns in this country. The second problem is to get handguns registered, and the final problem is to make the possession of all handguns, and all handgun ammunition illegal.\"--Nelson T. Shields, founder of the Center to Prevent Handgun Violence and former Chairman of Handgun Control, Inc. quoted in The New Yorker magazine, July 26, 1976, at Page 53\n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\" Justice Brandeis, explaining why he could not condone the government's use of information in a criminal case that was obtained in violation of the Fourth Amendment, in Olmstead v. United States, 277 U.S. 438, 485 (1928).\n \n \"I honestly think - and I am not an expert on the amendments - I think the only people in this nation who should be allowed to own guns are police officers. I don't care if you want to hunt, I don't care if you think it's your right. I say 'sorry'. It is 1999, we have had enough as a nation. You are not allowed to own a gun and if you do own a gun, I think you should go to prison.\"-- Rosie O'Donnell, The Rosie O'Donnell Show, April 21, 1999\n \n \"Are we at last brought to such an humiliating and debasing degradation that we cannot be trusted with arms for our own defense? Where is the difference between having our arms under our own possession and under our own direction, and having them under the management of Congress? If our defense be the real object of having those arms, in whose hands can they be trusted with more propriety, or equal safety to us, as in our own hands?\"--  Patrick Henry, 3 Elliot, Debates at p386.", 
   {
    "unicode_changes_made": true
   }, 
   99558, 
   null, 
   1111216380.0
  ], 
  [
   99639, 
   null, 
   "pandion", 
   "Well done, Bryan. It seems that you actually paid attention in your Constitutional Law classes. When my son was in law school and came home during vacations, he used to tell me about what he was learning. Constitutional law was one of his favorite classes - actually, two of his favorite classes since the class spanned two semesters. He got me interested in the issue an I have done some research since. But your knowledge just blows me away. I couldn't cite a single state constitution on the issue if my life depended on it.\n \n There is one point that I don't think that you made. Many of the articles of the Bill of Rights have been incorporated against the states by the 14th Amendment. This is case law with which I am sure that you are familiar. However, the Supreme Court has declined to hear any case where a Constitutional right to bear arms is in question. That means that to date, the question is one of states rights. Thus, cities and states are free to impose laws that regulate and even ban the right to bear arms. I grew up in a state where it was legal to carry a side arm as long as it was NOT concealed. I now live in a state where it is legal to carry only if the weapon IS concealed and the carryer has a concealed weapon permit. Many of my friends do. Of course, there are local laws that may effect that right, and business establishments (banks, bars, restaurants, or mom&pop convenience stores) may also post their premises and declare that concealed weapons are not permitted. Such postings have the force of law.\n \n And Daewoo, you actually quoted the entire 2nd Amendment and you couldn't find the part about the militia? How strange.\n \n So please explain to me the difference between these two statements.\n \nA well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\n\n and\n \nThe right of the people to keep and bear arms, shall not be infringed.\n\n \n I think that the Congress that passed the Bill of Rights didn't throw in words that carried no meaning. What you propose is the second, making the initial phrase meaningless. Perhaps you should consult the meaning of the word \"militia\" in the body of the Constitution and, as Bryan has pointed out, the definition in the Virginia Constitution. Clearly the right to bear arms was linked to the militia.\n \n But if you want to have a weapon, all you have to do is conform with the law. It's no big deal. I have always done so and I do now. It's no big deal.", 
   {}, 
   99637, 
   null, 
   1111219440.0
  ], 
  [
   99654, 
   null, 
   "daewoo", 
   "And Daewoo, you actually quoted the entire 2nd Amendment and you couldn't find the part about the militia? How strange.\n\n \n I didn't say I couldnt find a part about the militia, I said that there was nothing there about forming a militia. \n \n Speaking of \"forming a militia\" at he time would have been rediculous, since the \"militia\" mentioned was not a select group, but rather the citizenry at large (or at least all males of military age, save some public officials). The militia was not something that was \"formed\" persay, it was something that could be organised if needed. In fact, every militia act we have ever had in this country differentialted between the organised militia (that which was currently active) and the unorganised militia, which consists of all people of military age (originally just all men, but we can assume that it extends to women now, too under the equal protection clause).\n \n \nSo please explain to me the difference between these two statements.\n\n \n From a practical standpoint, there is none. \n \n \n \nI think that the Congress that passed the Bill of Rights didn't throw in words that carried no meaning. What you propose is the second, making the initial phrase meaningless. Perhaps you should consult the meaning of the word \"militia\" in the body of the Constitution and, as Bryan has pointed out, the definition in the Virginia Constitution. Clearly the right to bear arms was linked to the militia.\n\n \n The regulation (or provision) of the milita was certainly the justification stated in the justification clause. The justification clause does not in any way limit the actionable clause. This was not simply \"extra words thrown in\". It was a writing style in common use at the time, especially in legal documents. It was taught in the schools. This is well documented. \n \n Look at the following examples. The first is from the New Hampshire constitution, the second is from the Massachuses constitution.\n \n \"The Liberty of the Press is essential to the security of freedom in a state; it ought, therefore, to be inviolably preserved.\"\n \n \"The liberty of the press is essential to the security of freedom in a state it ought not, therefore, to be restricted in this commonwealth.\"\n \n \n The first is similarly phrased to the second amendment(not surprising since the style was so commonly taught). Obviously both are meant to ensure free press. By your logic, however, since the justification clause in teh article from New Hampshire reads \"The Liberty of the Press is essential to the security of freedom in a state\", then only press which is immediatly linked to the security of a free state is protected. Cookbooks, fictional books, history books, textbooks, and any other printed material which is not linked to the protection of a free state would not be protected under the constitution of New Hampshire. In Massachuses, however, these thing are all constitutionally protected, since the sentence is constructed differently.\n \n Obviously this is not the case. Even items not connected to the security of a free state are protected in both states.\n \n The miller court did take a slightly different view on this, however. They ruled that the second ammendment only protected weapons that may be useful to the end of maintaining a militia. They focused on the type of weapon, specifically, they did not believe that a shotgun having a barrel of less than 18 inches was militarily useful. They did, however, recognise that the militia at the time the second amendment was authored consisted of all men of military age. \n \n Taken to extremes, the miller decsion would certianly imply that machine guns, rocket launchers, and bazookas should all enjoy the full protection of the second amendment. \n \n \n \nBut if you want to have a weapon, all you have to do is conform with the law. It's no big deal. I have always done so and I do now. It's no big deal\n\n \n It is no big deal depending on the law in question. Unless the second amendment is recognised as an individual right, and given the full protection of law as other rights are, there is nothing to say that a law could not be passed tomorrow banning all weapons in this country. Gun control has certainly become more restrictive during our nations history, and there is frankly no reason why this trend should reverse itself, barring a reversal in how the second amendment is viewed. Our constitution was written by men who went to war when the British government tried to seize their cannons, artillery pieces, and exploding shell mortars. Now we quibble about whether or not bayonette lugs should be allowed. Pathetic.", 
   {}, 
   99639, 
   null, 
   1111240680.0
  ], 
  [
   99713, 
   null, 
   "voiceofreason", 
   "I didn't say I couldnt find a part about the militia, I said that there was nothing there about forming a militia. \n \n Speaking of \"forming a militia\" at he time would have been rediculous, since the \"militia\" mentioned was not a select group, but rather the citizenry at large (or at least all males of military age, save some public officials). The militia was not something that was \"formed\" persay, it was something that could be organised if needed. In fact, every militia act we have ever had in this country differentialted between the organised militia (that which was currently active) and the unorganised militia,\n\n \"3.4 Was the term 'unorganized militia' used in colonial America?\n A. No. The term for those within the militia system was simply the militia. A distinction was drawn between those who did their militia duty in the compulsory units and those who did their militia duty in volunteer units. The compulsory militia was known as trainbands, beat militia, or enrolled militia. The volunteer milita was known as the volunteer militia, or the uniform militia. The term 'uniform' referred to the fact that the volunteers wore uniforms.\" \n http://www.militia-watchdog.org/faq1.asp \n \n \n \n which consists of all people of military age (originally just all men, but we can assume that it extends to women now, too under the equal protection clause).\n\n Equal protection clause? This clause was primarily written to correct racial inequality. The Supreme Court has allowed some gender discrimination. For example, they have upheld the Military Selective Service Act even though it only requires males to register. \n \n \n \n\n The regulation (or provision) of the milita was certainly the justification stated in the justification clause. The justification clause does not in any way limit the actionable clause. This was not simply \"extra words thrown in\". It was a writing style in common use at the time, especially in legal documents. It was taught in the schools. This is well documented.\n\n If that were true, then it seems that the Supreme Court would have found in \n United States v. Miller that a law requiring the registration of the shotgun with a barrel less than 18 inches to be unconstitutional. \n \n \n\n Look at the following examples. The first is from the New Hampshire constitution, the second is from the Massachuses constitution.\n \n \"The Liberty of the Press is essential to the security of freedom in a state; it ought, therefore, to be inviolably preserved.\"\n \n \"The liberty of the press is essential to the security of freedom in a state it ought not, therefore, to be restricted in this commonwealth.\"\n \n The first is similarly phrased to the second amendment\n \n\n I don't think so. The first one has two independent clauses. The second amendment doesn't have two independent clauses.", 
   {}, 
   99654, 
   null, 
   1111269000.0
  ], 
  [
   99720, 
   null, 
   "Eddie", 
   "Just two quick questions.\n \n What does the words \"...well regulated...\" in \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\" mean?...\n \n And if the right to bear arms is connected to the group of millitiamen imply that only males (but possibly females as well) over and under a certain age, and with adequate physical prowess and training should have the right to bear arms? I mean, I can`t think of a single modern day militia that allows anyone to participate ;)", 
   {}, 
   99713, 
   null, 
   1111273020.0
  ], 
  [
   99748, 
   null, 
   "RooK", 
   "I believe registration isn't and never has been unconstitutional unless you can fit it under the 4th. Most people reject it though, because once you are registered it makes confiscation so much easier should such an action be taken.", 
   {}, 
   99720, 
   null, 
   1111279620.0
  ], 
  [
   99798, 
   null, 
   "Bryan", 
   "Yeah, I did leave out the 14th. Amendment. It has it's own lengthy history which I believe also clearly illustrates the principle that the RKBA is individual (and, in this case, deserving protection from state encroachment). You're right about the Bill of Rights only applying to the national government. All of the rights in the BoR were originally intended to limit the authority of the federal government, and not that of the states. Here is an old Second Amendment case that illustrates that point:\n \n Presser v. Illinois: Presser was a member of a private militia organization, and he was convicted by an Illinois state court for marching four hundred armed men (although peacefully) through Chicago without having first obtained a permit from the Governor.\n \n \"We think the sections under consideration, which only forbid bodies of men to associate together as military organizations, or to drill or parade with arms in cities and towns unless authorized by law, do not infringe the right of the people to keep and bear arms. But a conclusive answer to the contention that this amendment prohibits the legislation in question lies in the fact that the amendment is a limitation only upon the power of Congress and the National Government, and not upon that of the States.\" 116 U.S. 252, 265 (1886). [note this case arose post-14th, amendment, but before SCOTUS began using it to incorporate the BoR against the states]\n \n In my opinion, Article I of the 14th. Amendment was intended to incorporate the first eight amendments in the BoR against the states.\n \n \"All persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\" United States Constitution, 14th. Amendment, Section 1.\n \n Why the shift to make the states respect the civil liberties in the BoR? I believe the inapplicability of the BoR to the states became a serious issue during post-civil war reconstruction in the South. Southern states reacted to the 13th. Amendment by enacting a number of \"Black Codes,\" with the purpose of infringing upon the basic civil liberties of blacks to ensure de facto  slavery continued. \n \n Here is a portion of a Black Code from Mississippi which abolished any right a black man or woman had to KBA:\n \n \"That no freedman, free negro or mulatto. . .not licensed to do so by the board of police of his or her county, shall keep or carry fire-arms of any kind, or any ammunition, dirk or bowie knife.\" Laws of Mississippi, 1865, p. 165 (November 29, 1865).\n \n Here is a comment upon the effect of a similar law from Kentucky:\n \n \"the civil law prohibits the colored man from bearing arms. . .their arms are taken from them by the civil authorities. . . .Thus, the right of the people to keep and bear arms as provided in the Constitution is infringed.  . .\" Executive Document #30, 39th. Congress, 1st. Session, part 1, pp. 233 and 236 (1866) [from the Report of the Commissioner of the Freedmen's Bureau].\n \n How were laws like this viewed by Congress?\n \n \"This is a fair sample of the legislation subsequently passed by all the \"States\" reconstructed under President Johnson's plan. . . .The Northern Republicans professed to see this new legislation at the South the virtual re-enslavement of the negroes....\" J. Burgess, Reconstruction and the Constitution, 1866-1876, p. 51-52 (1902).\n \n There were also complaints that southern whites were not relying merely on the passage of laws to deny blacks their civil rights:\n \n \"In Mississippi rebel State forces, men who were in the rebel armies, are traversing the State, visiting the freedmen, disarming them, perpetrating murders and outrages on them. . .\" Congressional Globe, 39th. Congress, 1st. Session, part 1, at p. 40 (December 13, 1865) [Speech of Senator Henry Wilson (Republican-Massachusetts)]\n \n Another Senator noted that the Mississippi state militia would roam throughout the state and habitually \"hang some freedmen or search negro houses for arms.\"-- Congressional Globe, 39th. Congress, 1st. Session, part 1, Senate Report Number 30, p. 813 (February 13, 1866) [Speech of Senator Lyman Trumball (Republican-Illinois)].\n \n What was the response from Congress? Here is a sample of speeches calling for action:\n \n \"Sir, I find in the Constitution of the United States an article which declares that \"the right of the people to keep and bear arms shall not be infringed.\" For myself, I shall insist that the reconstructed rebels of Mississippi respect the Constitution in their local laws. . .\" Congressional Globe, 39th. Congress, 1st. Session, part 1, p. 1838 (April 7, 1866) [Speech of congressman Sindey Clarke (Republican-Kansas)].\n \n \"The Constitution clearly describes that to be a republican form of government for which it was expressly framed. A government. . .where \"no law shall be made prohibiting a free exercise of religion;\". . .where \"the right of the people to keep and bear arms shall not be infringed;\". . .\" Congressional Globe, 39th. Congress, 1st. Session, part 2, p. 1266 (March 24, 1866) [Speech of congressman Roswell Hart (Republican-New York)]\n \n \"Make the colored man a citizen of the United States and he has every right which you or I have as citizens of the United States under the laws and Constitution of the United States. . . .He has a defined status; he has a country and a home; a right to defend himself and his wife and children; a right to bear arms. .  .\" Congressional Globe, 39th. Congress, 1st. Session, part 2, p. 1266 (March 8, 1866) [Speech of congressman Henry J. Raymond (Republican-New York)]\n \n In the House, the 14th. Amendment was introduced as follows:\n \n \"This immortal bill of rights embodied in the Constitution, rested for its execution and enforcement hitherto upon the fidelity of the States. . . .The proposition pending before the House is simply a proposition to arm Congress. . .with the power to enforce this bill of rights as it stands in the Constitution today\" Congressional Globe, 39th. Congress, 1st. Session, part 1, at p. 1033-34 (February 26, 1866) and p. 1088 (February 28, 1966) [Speeches by Congressman John A. Bingham (Republican-Ohio)]\n \n In the Senate, the 14th. Amendment was introduced by Jacob M. Howard. In his speech introducing the bill, Senator Howard stated:\n \n \"To these privileges and immunities should be added the personal rights guarantied and secured by the first eight amendments of the Constitution; such as the freedom of speech and of the press; the right of the people peaceably to assemble and petition the Government for a redress of grievances, a right appertaining to each and all the people; the right to keep and to bear arms; the right to be exempted from the quartering of soldiers in a house without the consent of the owner; the right to be exempt from unreasonable searches and seizures, and from any search or seizure except by virtue of a warrant issued upon a formal oath or affidavit; the right of an accused person to be informed of the nature of the accusation against him, and his right to be tried by an impartial jury of the vicinage; and also the right to be secure against excessive bail and against cruel and unusual punishments.. . .[A]ll these immunities, privileges, rights, thus guarantied by the Constitution or recognized by it, are secured to the citizens solely as a citizen of the United States and as a party in their courts. They do not operate in the slightest degree as a restraint or prohibition upon State legislation. . . .The great object of the first section of this amendment is, therefore, to restrain the power of the States and compel them at all times to respect these great fundamental guarantees.\" Congressional Globe, 39th. Congress, 1st. Session, part 3, p. 2765 (May 23, 1866) [Speech of Senator Jacob M. Howard (Republican-Michigan)] This quote was also cited by Justices Black and Duncan in their concurring opinion in Duncan v. LOUISIANA, 391 U.S. 145, 167 (1968), a landmark civil liberties case which held that the 14th. Amendment required the states to honor a defendant's 6th. Amendment right to trial by jury in criminal cases.\n \n The debates in the Senate displayed unanimous support for Senator Howard's position:\n \n \"In the entire Senate debate on the Fourteenth Amendment, running from May 23 to June 8, not a single senator challenged Senator Howard's declaration that Section 1 made the first eight amendments enforceable against the states.\" Irving Bryant, The Bill of Rights, p. 337 (1965).\n \n Now the Brady Campaign will tell you, if you chose to listen, that the 2nd. Amendment's RKBA is a right of the states to arm their militias. If so, then why did the entire membership of the Senate which passed the 14th. Amendment do so with the belief that it was an individual right which needed to be protected from state encroachment?\n \n Now as I have said, I think the 14th. Incorporates the first 8 of the BoR against the states. This is Justice Black's view, which we refer to as \"total incorporation.\" SCOUTS has taken a different path, however, which is more in line with its long tradition of refusing to decide matters until they are actually brought before the court in a case or controversy. SCOTUS' path on this issue is referred to as \"selective incorporation.\" Under this process, each right is considered for incorporation as it is brought individually before the Court in a case. For example, if a case came before SCOTUS on a claim that a state violated a defendant's 6th Amendment right to counsel, SCOTUS would decide only whether that right would be incorporated against state infringement. It would refuse to rule, for example, on whether the 4th. Amendment's right to be free of unreasonable searches and seizures would also be incorporated. Today, most of the fundamental civil liberties in the BoR have been incorporated. Notable exceptions to this are the 2nd. Amendment and the 3rd.(quartering of soldiers). I think this is because neither of the rights protected here have been dealt with by SCOTUS on a claim of incorporation by the 14th. against the states since SCOTUS began wandering down the path of selective incorporation. I do believe, however, that if SCOTUS ever does actually say what it has always either implied or taken for granted (namely, that the RKBA is an individual and not a state's right), then it will also have to incorporate the right against infringement from state encroachment. Only time will tell....\n \n I have really enjoyed becoming more active here, but I am not going to be able to post here every day. If any wants me to respond to something else they say then you are going to have to wait a bit. I'm going to be tied up for a few days.\n \n ----------------\n \n \"The issue, however, is not whether court rules are \"mutable\"; they assuredly are. It is not whether, in the light of \"various circumstances,\" they can be \"modifi[ed]\"; they assuredly can. The issue is whether, as mutated and modified, they must make sense. The requirement that they do so is the only thing that prevents this Court from being some sort of nine-headed Caesar, giving thumbs-up or thumbs-down to whatever outcome, case by case, suits or offends its collective fancy.\" From Justice Scalia's dissent in the case of DICKERSON v. UNITED STATES, 530 U.S. ___ 995525, Slip opinion (Scalia's dissent) p.12 (June 26, 2000) [Dickerson dealt with a review of the famous \"Miranda Rule\", and Scalia's dissent is based upon his view that the Court was modifying and expanding the reach of the rule.]", 
   {
    "post_info": {
     "post_title": "The 14th. Amendment"
    }, 
    "unicode_changes_made": true
   }, 
   99748, 
   null, 
   1111301640.0
  ], 
  [
   99909, 
   null, 
   "Rick_OShea", 
   "Many people argue that the second amendment claims we have the right to bear arms, but usually they leave out the rest. It says to form a militia. So unless you are forming a militia you don't have the right to bear arms by the Constitution.\n\n \n There have been some fine posts in this thread but I think you need a more fundamental answer.\n \n You are trying to understand the concept of rights but you are coming at it from the wrong direction.\n \n The Bill of Rights is not a permission slip, it is not a cobbled together list of actions, items and immunities that \"the government\" allows us to have and exercise under a ever expanding web of qualifications, licenses, user fees and bureaucratic oversight. Instead, think of it as a NO TRESPASSING sign, telling the government that even though no power was granted to impact these things, just in case you forget you have no power, we further declare that you are forbidden to act against these things.\n \n Whenever a law is written or a principle is codified there is a purpose for doing it, an intended outcome or specific condition to be preserved. This intention is known as the \"object\" of the Bill, Provision, Amendment or Act. The 2nd Amendment is no different, it had/has a very plain and understood object; to ensure that the militia would always remain a viable entity to protect the state and federal governments and the liberty of the people. In times of need, the civil power can summon a large group of citizens at a moments notice and have them muster with appropriate arms supplied by themselves and a couple days provisions. Also part of the object, . . . the fundamental principle that the people retain the final right to rescind consent to be governed.\n \n The only way for the founders to ensure that the object could be fulfilled was to secure from government's reach the means to achieve it; the already existing individual right to keep and bear arms. The Amendment does not create the right, it merely secures or guarantees it. The right is not dependent on the Amendment in any way for its existence.\n \n This discussion of the \"object\" and the \"means\" to achieve it, is important because this is exactly the point that the \"collective rights\" tangent emanates.\n \n The primary object of the Amendment is \"collective\" in its exercise. The following is a quote from a important court case in the history of the right to arms, read carefully because it contains some archaic syntax:\n \"The object, then, for which the right of keeping, and bearing arms is secured is of the public. The free white men may keep arms to protect the public liberty, to keep in awe those who are in power, and to maintain the supremacy of the laws and the constitution. . . . As the object for which the right to keep and bear arms is secured is of general and public nature, to be exercised by the people in a body, for their common defence, so the arms the right to keep which is secured are such as are usually employed in civilized warfare, and that constitute the ordinary military equipment. If the citizens have these arms in their hands, they are prepared in the best possible manner to repel any encroachments upon their rights by those in authority.\"\n The people acting in a body, for their common defence, . . . is \"the object for which the [already existing] right to keep and bear arms is secured [not created, granted, established, conferred, etc.].\" The Amendment exists because of the importance of the right, not the other way around. Anti-gunners would have you believe that the right exists proportionally to their perception of the importance of the Amendment.\n \n The object can not be realized without the means to achieve it. In this example, the means is protected by securing the individual right to acquire, posses, own and use the arms, \"such as are usually employed in civilized warfare, and that constitute the ordinary military equipment.\" Military usefulness is the current criteria for determining whether the ownership of a particular firearm is protected under the 2nd Amendment.\n \n The right is most certainly individual and existing without any governmental imposed qualifications because part of the object of the Amendment is to guarantee that, \"the citizens have these arms in their hands, [so] they are prepared in the best possible manner to repel any encroachments upon their rights by those in authority.\" If \"those in authority\" have the power to ban acquisition or forbid ownership, this part of the object of the amendment is extinguished.\n \n Returning to the text of the 2nd Amendment let's re-read it with the above in mind.\n \n \"A well-regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\"\n \n The first part of the amendment is stating the object of the Amendment, why the provision was written. The \"collective rights\" side takes this declaration of the collective object of the Amendment and applies it to the exercise of the individual means, the right to arms. Such a leap is neither justified or legitimate. Their position is in fact based on an artful twist on the Supreme Court's instruction on 2nd Amendment interpretation.\n \n Our rights predate the Constitution, they were not created or granted by that document or Amendments to it. Our right to keep and bear arms is not dependant on the Constitution or any Amendment for its existence. Since this was understood when it was written, it was understood that no conditions or qualifications could be forced onto the right in the provision securing it. \n \n I will close here with some quotes from the Supreme Court regarding our rights and their origin; I hope these help you understand where our rights come from.\n The constitution expressly declares, that the right of acquiring, possessing, and protecting property is natural, inherent, and unalienable. It is a right not ex gratia from the legislature, but ex debito from the constitution. . . VANHORNE'S LESSEE v. DORRANCE, 2 U.S. 304 (1795)\n \n The law is perfectly well settled that the first 10 amendments to the constitution, commonly known as the 'Bill of Rights,' were not intended to lay down any novel principles of government, but simply to embody certain guaranties and immunities which we had inherited from our English ancestors, . . . ROBERTSON v. BALDWIN, 165 U.S. 275 (1867)\n \n The right there specified is that of 'bearing arms for a lawful purpose.' This is not a right granted by the Constitution. Neither is it in any manner dependent upon that instrument for its existence. The second amendment declares that it shall not be infringed; but this, as has been seen, means no more than that it shall not be infringed by Congress. This is one of the amendments that has no other effect than to restrict the powers of the national government, . . . -- U S v. CRUIKSHANK, 92 U.S. 542 (1875)\n \n Men are endowed by their Creator with certain unalienable rights,-'life, liberty, and the pursuit of happiness;' and to 'secure,' not grant or create, these rights, governments are instituted. BUDD v. PEOPLE OF STATE OF NEW YORK, 143 U.S. 517 (1892)\n \n The first ten amendments to the Constitution, adopted as they were soon after the adoption of the Constitution, are in the nature of a bill of rights, and were adopted in order to quiet the apprehension of many, that without some such declaration of rights the government would assume, and might be held to possess, the power to trespass upon those rights of persons and property which by the Declaration of Independence were affirmed to be unalienable rights. UNITED STATES v. TWIN CITY POWER CO., 350 U.S. 222 (1956)", 
   {}, 
   98565, 
   null, 
   1111353180.0
  ], 
  [
   99934, 
   null, 
   "Jeffersonian", 
   "There have been some fine posts in this thread but I think you need a more fundamental answer.\n \n You are trying to understand the concept of rights but you are coming at it from the wrong direction.\n \n The Bill of Rights is not a permission slip, it is not a cobbled together list of actions, items and immunities that \"the government\" allows us to have and exercise under a ever expanding web of qualifications, licenses, user fees and bureaucratic oversight. Instead, think of it as a NO TRESPASSING sign, telling the government that even though no power was granted to impact these things, just in case you forget you have no power, we further declare that you are forbidden to act against these things.\n \n Whenever a law is written or a principle is codified there is a purpose for doing it, an intended outcome or specific condition to be preserved. This intention is known as the \"object\" of the Bill, Provision, Amendment or Act. The 2nd Amendment is no different, it had/has a very plain and understood object; to ensure that the militia would always remain a viable entity to protect the state and federal governments and the liberty of the people. In times of need, the civil power can summon a large group of citizens at a moments notice and have them muster with appropriate arms supplied by themselves and a couple days provisions. Also part of the object, . . . the fundamental principle that the people retain the final right to rescind consent to be governed.\n \n The only way for the founders to ensure that the object could be fulfilled was to secure from government's reach the means to achieve it; the already existing individual right to keep and bear arms. The Amendment does not create the right, it merely secures or guarantees it. The right is not dependent on the Amendment in any way for its existence.\n \n This discussion of the \"object\" and the \"means\" to achieve it, is important because this is exactly the point that the \"collective rights\" tangent emanates.\n \n The primary object of the Amendment is \"collective\" in its exercise. The following is a quote from a important court case in the history of the right to arms, read carefully because it contains some archaic syntax:\n \"The object, then, for which the right of keeping, and bearing arms is secured is of the public. The free white men may keep arms to protect the public liberty, to keep in awe those who are in power, and to maintain the supremacy of the laws and the constitution. . . . As the object for which the right to keep and bear arms is secured is of general and public nature, to be exercised by the people in a body, for their common defence, so the arms the right to keep which is secured are such as are usually employed in civilized warfare, and that constitute the ordinary military equipment. If the citizens have these arms in their hands, they are prepared in the best possible manner to repel any encroachments upon their rights by those in authority.\"\n The people acting in a body, for their common defence, . . . is \"the object for which the [already existing] right to keep and bear arms is secured [not created, granted, established, conferred, etc.].\" The Amendment exists because of the importance of the right, not the other way around. Anti-gunners would have you believe that the right exists proportionally to their perception of the importance of the Amendment.\n \n The object can not be realized without the means to achieve it. In this example, the means is protected by securing the individual right to acquire, posses, own and use the arms, \"such as are usually employed in civilized warfare, and that constitute the ordinary military equipment.\" Military usefulness is the current criteria for determining whether the ownership of a particular firearm is protected under the 2nd Amendment.\n \n The right is most certainly individual and existing without any governmental imposed qualifications because part of the object of the Amendment is to guarantee that, \"the citizens have these arms in their hands, [so] they are prepared in the best possible manner to repel any encroachments upon their rights by those in authority.\" If \"those in authority\" have the power to ban acquisition or forbid ownership, this part of the object of the amendment is extinguished.\n \n Returning to the text of the 2nd Amendment let's re-read it with the above in mind.\n \n \"A well-regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\"\n \n The first part of the amendment is stating the object of the Amendment, why the provision was written. The \"collective rights\" side takes this declaration of the collective object of the Amendment and applies it to the exercise of the individual means, the right to arms. Such a leap is neither justified or legitimate. Their position is in fact based on an artful twist on the Supreme Court's instruction on 2nd Amendment interpretation.\n \n Our rights predate the Constitution, they were not created or granted by that document or Amendments to it. Our right to keep and bear arms is not dependant on the Constitution or any Amendment for its existence. Since this was understood when it was written, it was understood that no conditions or qualifications could be forced onto the right in the provision securing it. \n \n I will close here with some quotes from the Supreme Court regarding our rights and their origin; I hope these help you understand where our rights come from.\n The constitution expressly declares, that the right of acquiring, possessing, and protecting property is natural, inherent, and unalienable. It is a right not ex gratia from the legislature, but ex debito from the constitution. . . VANHORNE'S LESSEE v. DORRANCE, 2 U.S. 304 (1795)\n \n The law is perfectly well settled that the first 10 amendments to the constitution, commonly known as the 'Bill of Rights,' were not intended to lay down any novel principles of government, but simply to embody certain guaranties and immunities which we had inherited from our English ancestors, . . . ROBERTSON v. BALDWIN, 165 U.S. 275 (1867)\n \n The right there specified is that of 'bearing arms for a lawful purpose.' This is not a right granted by the Constitution. Neither is it in any manner dependent upon that instrument for its existence. The second amendment declares that it shall not be infringed; but this, as has been seen, means no more than that it shall not be infringed by Congress. This is one of the amendments that has no other effect than to restrict the powers of the national government, . . . -- U S v. CRUIKSHANK, 92 U.S. 542 (1875)\n \n Men are endowed by their Creator with certain unalienable rights,-'life, liberty, and the pursuit of happiness;' and to 'secure,' not grant or create, these rights, governments are instituted. BUDD v. PEOPLE OF STATE OF NEW YORK, 143 U.S. 517 (1892)\n \n The first ten amendments to the Constitution, adopted as they were soon after the adoption of the Constitution, are in the nature of a bill of rights, and were adopted in order to quiet the apprehension of many, that without some such declaration of rights the government would assume, and might be held to possess, the power to trespass upon those rights of persons and property which by the Declaration of Independence were affirmed to be unalienable rights. UNITED STATES v. TWIN CITY POWER CO., 350 U.S. 222 (1956)\n\n \n This is a very fundamental difference how anti-gunners view the 2nd Amendment and the nature of rights. They think of the Bill of Rights as a 'permission slip', the view the text as proof that the government gives us rights. The government does nothing of that sort, the Bill of Rights as a document declares that government is FORBIDEN to grab power over the issuses and rights mentioned in the Bill of Rights.", 
   {}, 
   99909, 
   null, 
   1111359060.0
  ], 
  [
   99969, 
   null, 
   "StrategosFF", 
   "This is a very fundamental difference how anti-gunners view the 2nd Amendment and the nature of rights. They think of the Bill of Rights as a 'permission slip', the view the text as proof that the government gives us rights. The government does nothing of that sort, the Bill of Rights as a document declares that government is FORBIDEN to grab power over the issuses and rights mentioned in the Bill of Rights.\n\n \n How very Jeffersonian of you. Just a side note, as one of the Founding Fathers who pushed strongly for the rights of the citizens to be respected, and to have the power of the government limited and checked...his presidency was marked by the extrodinary actions/decisions he made without consulting Congress and keeping the citizens in the dark about them. Case in point the Louisana Purchase. Thats just what I learned from history class in high school.", 
   {
    "post_info": {
     "post_title": "How very..."
    }
   }, 
   99934, 
   null, 
   1111372740.0
  ], 
  [
   100004, 
   null, 
   "zachvac", 
   "This is a very fundamental difference how anti-gunners view the 2nd Amendment and the nature of rights. They think of the Bill of Rights as a 'permission slip', the view the text as proof that the government gives us rights. The government does nothing of that sort, the Bill of Rights as a document declares that government is FORBIDEN to grab power over the issuses and rights mentioned in the Bill of Rights.\n\n \n Personally, I agree that the public should be able to own guns, but I still am not convinced that the 2nd ammendment allows us to. A militia is only a militia when they are together and working together. 20 different people can not be considered a militia unless they are together and fighting for a cause. I understand what you mean about it isn't a permission slip, it's a list of rights that can't be taken away. Just because it's not in the Constitution doesn't mean it isn't a right. I just don't buy many people owning guns as being a militia.", 
   {}, 
   99934, 
   null, 
   1111383360.0
  ], 
  [
   100018, 
   null, 
   "RooK", 
   "The 2nd Amendment doesn't say you have to be in a militia or participate one, it just aknowledges your right to own firearms for the purpose of forming one; i.e. no membership is implied or required to exercise it. Also, US Code (anyone got the specific number?) lists all male citizens between 17 and 45 (?) as the unorganized militia to this day. So, a lot of people are members of a national militia and don't even know it.", 
   {}, 
   100004, 
   null, 
   1111389360.0
  ], 
  [
   154027, 
   null, 
   "hansberrym", 
   "as the preamble to the 1785 Virginia militia act cited in US v. Miller:\n \"The defense and safety of the commonwealth depend upon having its citizens properly armed and taught the knowledge of military duty.\"\n \n From the Second Amendment:\n \"A well regulated militia, being necessary to the security of a free state,...\"\n \n \n \n Note that the phrase \"the defense and safety of the commonwealth\" has the same meaning as the phrase \"security of a free state\", and the phrase \"citizens properly armed and taught the knowledge of military duty\" has the same meaning as \"A well regulated militia\".\n \n Furthermore the relationship \"A is necessary to B\" is the same as the relationship \"B depends on A\".\n \n \n There is no mystery to it, but there is an old adage: when the facts are in your favor -argue the facts. When they are not -muddy up the water. \n \n The Collective Rights advocates prattle on as if we are at a loss to know the meaning of words written just two hundreds years ago. But in fact, one can learn quite a bit by simply reading US v. Miller and Aymette v. Tenn. There is no mystery regarding the preamble, or the meaning of phrases such as \"keep and bear arms\" or \"the people\". We learn from reading those decisions who was to keep arms, which type of arms, and what limits could be placed on the bearing of arms without violating the Constitution.", 
   {
    "post_info": {
     "post_title": "The &quot;preamble&quot; of the Second Amendment means the same"
    }, 
    "unicode_changes_made": true
   }, 
   98565, 
   null, 
   1123653780.0
  ], 
  [
   154037, 
   null, 
   "zachvac", 
   "This is a very fundamental difference how anti-gunners view the 2nd Amendment and the nature of rights. They think of the Bill of Rights as a 'permission slip', the view the text as proof that the government gives us rights. The government does nothing of that sort, the Bill of Rights as a document declares that government is FORBIDEN to grab power over the issuses and rights mentioned in the Bill of Rights.\n\n \n Well I replied to this same post a couple months ago, but I would like to respond with a new perspective I have on it now.\n \n Basically the basics of the US government is that it is to secure our rights and our safety, so that we don't live in a state of anarchy, where the biggest strongest man wins. If a power isn't given to the government, they may not use it. The bill of rights is an even further prohibition of regulation. To make a law based on firearms or anything they have to have a reason for doing it, and the federal government may not be involved unless the Constitution grants them the right to (it doesn't mention guns in the powers it gives the US government). The 2nd amendment is restricting the government (federal, states, and local governments) from infringing upon that right. But the question still arises, what is meant by the mysterious militia clause?\n \n There are many interpreations on this but I think the basic meaning of this is so that a similar thing could happen as did in the American revolution. But then an even bigger problem arises. If that purpose is to be left intact we need to allow the citizens to access the same weapons the government has. But I really don't feel comfortable allowing citizens with atomic bombs and such. This is really a problem. Also, obviously if this were meant to be a tool for a revolution, wouldn't concealed weapons also be covered? Again it seems that it is currently impossible to follow the intentions of the amendment.\n \n Many will use the quote \"Those that sacrifice liberty for safety deserve neither\", but this is a hollow argument. The whole purpose of government is that we give up some of our natural liberties (the liberty to kill someone) for personal safety and protection of our other rights (the right to life). I agree you cannot go too far, but where do we draw the line? I don't like the idea of an oppressive government owning all the weapons or do I want them available to the worst criminals, so that instead of handguns and regular bombs, they are using uzies and atomic bombs? Do you have more trust in the government or in the general public? That's a hard question to answer because I don't have much trust in either one, therefor I seem to be undecided on where to really draw the line. As you can see, my opinion on this matter has changed drastically over the past few months, mostly because of this site (see, ideas really can change minds :)), so please don't tell me how I'm contradicting myself here.", 
   {}, 
   99934, 
   null, 
   1123657620.0
  ], 
  [
   154093, 
   null, 
   "Galileo", 
   "Well I replied to this same post a couple months ago, but I would like to respond with a new perspective I have on it now.\n \n Basically the basics of the US government is that it is to secure our rights and our safety, so that we don't live in a state of anarchy, where the biggest strongest man wins. If a power isn't given to the government, they may not use it. The bill of rights is an even further prohibition of regulation. To make a law based on firearms or anything they have to have a reason for doing it, and the federal government may not be involved unless the Constitution grants them the right to (it doesn't mention guns in the powers it gives the US government).\n\n Congress has justified its regulation of guns based on the Commerce Clause and the Taxing and Spending Clause of the Constitution. \n \n \n\n The 2nd amendment is restricting the government (federal, states, and local governments) from infringing upon that right. But the question still arises, what is meant by the mysterious militia clause?\n\n Maybe it is there just to take up space. \n \n \n\n There are many interpreations on this but I think the basic meaning of this is so that a similar thing could happen as did in the American revolution. But then an even bigger problem arises. If that purpose is to be left intact we need to allow the citizens to access the same weapons the government has. But I really don't feel comfortable allowing citizens with atomic bombs and such. This is really a problem. Also, obviously if this were meant to be a tool for a revolution, wouldn't concealed weapons also be covered? Again it seems that it is currently impossible to follow the intentions of the amendment.\n \n Many will use the quote \"Those that sacrifice liberty for safety deserve neither\", but this is a hollow argument. The whole purpose of government is that we give up some of our natural liberties (the liberty to kill someone) for personal safety and protection of our other rights (the right to life). I agree you cannot go too far, but where do we draw the line? I don't like the idea of an oppressive government owning all the weapons or do I want them available to the worst criminals, so that instead of handguns and regular bombs, they are using uzies and atomic bombs? Do you have more trust in the government or in the general public? That's a hard question to answer because I don't have much trust in either one, therefor I seem to be undecided on where to really draw the line. As you can see, my opinion on this matter has changed drastically over the past few months, mostly because of this site (see, ideas really can change minds :)), so please don't tell me how I'm contradicting myself here.\n\n I feel more comfortable with the government owning nuclear weapons rather than people in the general public.", 
   {}, 
   154037, 
   null, 
   1123693440.0
  ], 
  [
   154117, 
   null, 
   "Bryan", 
   "I believe the militia clause is nothing more than a preamble which states that militias, and not standing armies, should be relied upon to defend a free state. \n \n Look, for example, at the state constitutions of the time. You will see in them a clear linkage between the fear of a standing, professional army and the individual RKBA. I don't have access right now to all 13 state constitutions, but here are nine that I do have archived which I think demonstrate how the advocacy for reliance upon a militia is prefaced on the fear of a standing army:\n \n CONSTITUTION OF VIRGINIA  (June 6, 1776)\n \n That a well-regulated militia, composed of the body of the people, trained to arms, is the proper, natural, and safe defense of a free state; that standing armies, in time of peace, should be avoided, as dangerous to liberty; and that in all cases the military should be under strict subordination to, and governed by, the civil power.\n \n CONSTITUTION OF PENNSYLVANIA  (August 16, 1776)\n \n That the people have a right to bear arms for the defense of themselves and the state; And as standing armies in the time of peace are dangerous to liberty, they ought not to be kept up; And that the military should be kept under strict subordination to, and governed by, the civil power.\n \n DELAWARE DECLARATION OF RIGHTS  (September 11, 1776)\n \n That a well-regulated militia is the proper, natural and safe defense of a free government.\n \n That standing armies are dangerous to liberty, and ought not to be raised or kept up without the consent of the legislature.\n \n DELAWARE DECLARATION OF RIGHTS  (September 11, 1776)\n \n That a well regulated militia is the proper, natural and safe defense of a free government.\n \n That standing armies are dangerous to liberty, and ought to be under strict subordination to and governed by the civil power.  \n \n CONSTITUTION OF MARYLAND  (November 3, 1776)\n \n That a well-regulated militia is the proper and natural defense of a free government.\n \n That standing armies are dangerous to liberty, and ought not to be raised or kept up, without consent of the legislature.\n \n CONSTITUTION OF NORTH CAROLINA  (December 14, 1776)\n \n That the people have a right to bear arms, for the defense of the State; and, as standing armies, in time of peace, are dangerous to liberty, they ought not to be kept up; and that the military should be kept under strict subordination to, and governed by, the civil power.\n \n CONSTITUTION OF VERMONT  (July 8, 1777)\n \n That the people have a right to bear arms for the defense of themselves and the State; and, as standing armies, in time of peace, are dangerous to liberty, they ought not to be kept up; and that the military should be kept under strict subordination to, and governed by, the civil power.\n \n CONSTITUTION OF MASSACHUSETTS  (October 25, 1780)\n \n The people have a right to keep and bear arms for the common defense. And as, in time of peace, armies are dangerous to liberty, they ought not to be maintained without the consent of the legislature, and the military power shall always be held in exact subordination to the civil authority, and be governed by it.\n \n CONSTITUTION OF NEW HAMPSHIRE  (June 2, 1784)\n \n A well-regulated militia is the proper, natural, and safe defense of a state.\n \n Standing armies are dangerous to liberty, and ought not to be raised or kept up without the consent of the legislature.\n \n \n In my opinion, the Second Amendment was drafted in recognition of two important principles. They may be described as follows:\n \n 1. Whereas maintaining a standing army is dangerous to liberty, a well regulated militia, composed of all citizens capable of bearing arms, is the best method to provide for the security of a FREE state (ie. A state in which the people need not fear the ambitions of a tyrant within their own government); AND\n \n 2. That every citizen has the right to keep and bear arms; for this right provides the citizen with the ability to defend his life, his liberty, and his property from the \"tyranny of irritated ministers\" as well as providing him with the means of private self defense to \"discourage and keep the invader and the plunderer in awe.\" (quoting from the Continental Congress' Declaration of the Causes and Necessity of Taking Up Arms, and from Thomas Paine, Thoughts on Defensive War, 1775. I Writings of Thomas Paine at 56 (1894), respectively) \n \n Therefore, in my opinion, the language \"[a] well regulated militia being necessary to the security of a free State\" was never intended by our founding fathers to limit the right of the people to keep and bear private arms. Rather, it is preamble which states the universally held principle that \"standing armies, in time of peace, should be avoided, as dangerous to liberty.\" \n \n ----\n \n \"It has been asserted by the most respectable writers upon government, that a well-regulated militia, composed of the yeomanry of the country, have ever been considered as the bulwark of a free people. Tyrants have never placed any confidence on a militia composed of freemen.\" John DeWitt, The Anti-Federalist Papers, p. 75 (M. Borden ed. 1965)\n \n \"The power of the sword, say the minority of Pennsylvania, is in the hands of Congress. My friends and countrymen, it is not so, for the powers of the sword are in the hands of the yeomanry of America from sixteen to sixty. The militia of these free commonwealths, entitled and accustomed to their arms, when compared with any possible army, must be tremendous and irresistible. Who are the militia? Are they not ourselves? Is it feared, then, that we shall turn our arms each man against his own bosom? Congress shall have no power to disarm the militia. Their swords and every other terrible implement of the soldier, are the birth-right of an American ....[T]he unlimited power of the sword is not in the hands of either the federal or the state governments, but where I trust in God it will ever remain, in the hands of the People.\" Tench Coxe, Pennsylvania Gazette, Feb. 20, 1788.\n \n \"Little more can reasonably be aimed at with respect to the people at large than to have them properly armed and equipped. . . .This will not only lessen the call for military establishments, but if circumstances should at any time oblige the government to form an army of any magnitude that army can never be formidable to the liberties of the people while there is a large body of citizens, little if any inferior to them in discipline and the use of arms, who stand ready to defend their rights and those of their fellow citizens.\"  Alexander Hamilton, The Federalist Papers #29, reprinted at page 185 in The Federalist Papers, Mentor Books, 1969, edited by Clinton Rossiter.\n \n \"Before a standing army can rule, the people must be disarmed; as they are in almost every kingdom of Europe. The supreme power in America cannot enforce unjust laws by the sword; because the whole body of the people are armed, and constitute a force superior to any bands of regular troops that can be, on any pretense, raised in the United States. A military force, at the command of Congress, can execute no laws, but such as the people perceive to be just and constitutional; for they will possess the power, and jealousy will instantly inspire the inclination, to resist the execution of a law which appears to them unjust and oppressive.\"  Noah Webster, \"An Examination into the Leading Principles of the Federal Constitution\" (1787) in Pamphlets on the Constitution of the United States (P. Ford, 1888).\n \n \"Whenever, therefore, the profession of arms becomes a distinct order in the state. . .the end of the social compact is defeated. . . .No free government was ever founded, or ever preserved its liberty, without uniting the characters of the citizen and soldier in those destined for defense of the state. . . .Such a well regulated militia, composed of freeholders, citizens and husbandman, who take up arms to preserve their property, as individuals, and their rights as freemen.\"  M. T. Cicero  (a pseudonym), Charleston State Gazette, September 8, 1788.\n \n \"A militia, when properly formed, are in fact the people themselves, and render regular troops in a great measure unnecessary. . . .the constitution ought to secure a genuine and guard against a select militia. . .and include. . .all men capable of bearing arms. . . . But, say gentlemen, the general militia are for the most part employed at home in their private concerns, cannot well be called out, or be depended upon; that we must have a select militia. . . .[of the select militia] These Corps, not much unlike regular troops, well ever produce an inattention to the general militia. . .whereas, to preserve liberty, it is essential that the whole body of the people always possess arms, and be taught alike, especially when young, how to use them. . . .The mind that aims at a select militia, must be influenced by a truly anti-republican principle; and when we see many men disposed to practice upon it, whenever they can prevail, no wonder true republicans are for carefully guarding against it.\"  Richard Henry Lee, Additional Letters from the Federal Farmer, p. 169-170 (1788)\n \n \"The signification attributed to the term Militia appears from the debates in the Convention, the history and legislation of the Colonies and the States, and the writings of approved commentators. These show plainly enough that the militia comprised all males physically capable of acting in concert for the common defense. \"A body of citizens enrolled for military discipline.\" And further, that ordinarily when called for service these men were expected to appear bearing arms supplied by themselves and of a kind in common use at the time.\" United States v. Miller, 307 U.S. 174, 179 (1939).\n \n \"If the citizens have these arms in their hands, they are prepared in the best possible manner to repel any encroachments upon their rights....\"  Miller  at p. 178, citing Aymette v. State, 2 Hump. (21 Tenn.) 154, 158 (1840).", 
   {
    "post_info": {
     "post_title": "What the militia clause means to me"
    }, 
    "unicode_changes_made": true
   }, 
   154093, 
   null, 
   1123701720.0
  ], 
  [
   154273, 
   null, 
   "SymonTemplar", 
   "I have a question Bryan, and since you are the legal scholar here. What sorts of gun laws existed in infant America circa late 18th and early 19th century, with particular attention to federal laws? Also what were the gun laws of England at the time? It seems to me that given the framers of the Constitution were in fact the actual government at the time as well, it would shed a great deal of light on precisely what they wanted in regards to gun ownership.", 
   {}, 
   154117, 
   null, 
   1123735080.0
  ], 
  [
   154288, 
   null, 
   "zachvac", 
   "[QUOTE=Galileo]Congress has justified its regulation of guns based on the Commerce Clause and the Taxing and Spending Clause of the Constitution. \n [QUOTE]\n You mean this one?\n \n \n\n ...To regulate Commerce with foreign Nations, and among the several States, and with the Indian tribes...\n \n\n \n According to dictionary.com:\n \n com·merce ( P ) Pronunciation Key (kmrs)\n n. \n 1. The buying and selling of goods, especially on a large scale, as between cities or nations. See Synonyms at business. \n 2. Intellectual exchange or social interaction. \n 3. Sexual intercourse. \n \n While I really hope it doesn't refer to #3 and I doubt it means #2, I would think it means #1.\n \n So it can regulate buying and selling among the states, with foreign countries, and with Indian tribes. So as long as it is sold in the state, the federal government has no power to regulate it. I always thought it was just the states that did that, but the 2nd amendment stops them from doing that. Or so I thought.", 
   {}, 
   154093, 
   null, 
   1123737180.0
  ], 
  [
   154299, 
   null, 
   "SymonTemplar", 
   "Hopefully Bryan can find something about gun laws during the time period. There is no mystery in regards to miltias. They were the citizens themsleves. The basic tennet was that every able bodied man between age of 18 and 45 was required to enroll in the milita of their respective states. They bought their own equipment and uniforms with the federal government providing cash assistance for the purchase of firearms and ammunition. So in regards to the original intent, the practical application was not only did the federal government not infringe on RKBA, it bought the guns and ammo. The concept of the National guard as institution with armories and being subject to federalization didn't even happen for over 100 years after the Constitution was drafted.\n \n In additon law enforcement in the western US was based on the office of the Sherriff and gave him the power to raise a possee composed of able bodied armed citizens to assist in the capture of fleeing fugitives.\n \n The bottom line is I have never heard of any gun laws passed by the framers to limit a citizens access to firearms. That to me that ends the debate right there in regards to what they intended. The next hundred years of how the state miltias were organized and equipped further reinforces my opinion.\n \n I think given modern times we have sought to regulate and limit firearms as appropriate, although poorly done at times, ie AWB. In the end though I firmly believe the framers meant for ordinary citizens to keep and bear arms.", 
   {}, 
   154288, 
   null, 
   1123738680.0
  ], 
  [
   154341, 
   null, 
   "Galileo", 
   "Hopefully Bryan can find something about gun laws during the time period. There is no mystery in regards to miltias.\n\n I think the mystery was- if the right to bear arms has nothing to do with the militia (which some people seem to think) then why mention the militia in the 2nd amendment? \n \n \n \n They were the citizens themsleves. The basic tennet was that every able bodied man between age of 18 and 45 was required to enroll in the milita of their respective states. They bought their own equipment and uniforms with the federal government providing cash assistance for the purchase of firearms and ammunition. So in regards to the original intent, the practical application was not only did the federal government not infringe on RKBA, it bought the guns and ammo. The concept of the National guard as institution with armories and being subject to federalization didn't even happen for over 100 years after the Constitution was drafted.\n \n In additon law enforcement in the western US was based on the office of the Sherriff and gave him the power to raise a possee composed of able bodied armed citizens to assist in the capture of fleeing fugitives.\n \n The bottom line is I have never heard of any gun laws passed by the framers to limit a citizens access to firearms. That to me that ends the debate right there in regards to what they intended. The next hundred years of how the state miltias were organized and equipped further reinforces my opinion.\n \n\n There were gun laws in early America. Some states prohibited the carrrying of concealed weapons. Pennsylvania required that anyone be disarmed who refused to swear an oath of loyalty to the state. Going back to what zachvac said, in a state of anarchy might makes right. Government serves as a kind of an equalizer so that the biggest, strongest person with the most powerful weapons doesn't have the most political power. In a civilized society things are decided by law and order, not by might. Allowing individuals to stockpile arms without restriction (whether they be nuclear arms, biological weapons, UZI's, rpg's etc.) would seem to undermine the purpose of leaving a state of anarchy and entering into a civilized society. Thus, I don't think the question is if we can have gun control, but the question should be- how much?", 
   {}, 
   154299, 
   null, 
   1123763700.0
  ], 
  [
   154875, 
   null, 
   "hansberrym", 
   "\n There were gun laws in early America. Some states prohibited the carrrying of concealed weapons. \n\n \n Yes, some states even included this prohibition as part of their constitution's RKBA, but that only shows that the RKBA is an individual right of all persons. If the RKBA were only a Limited Individual right or a Collective Right (as defined in Silveira/9th circuit) then it would have been pointless to attach a prohibition against concealed weapons.\n \n \n \n\n Pennsylvania required that anyone be disarmed who refused to swear an oath of loyalty to the state. \n\n \n Yes, since the war for independence was as much a civil war as a war against England, this action was quite understandable. It only makes sense to disarm the enemy -which included the loyalists. FDR set up internment camps during WWII for persons of japanese descent because he feared they might remain loyal to Japan. That internment happened is a fact, but FDR's action would not lead us to conclude that \"the right to liberty\" or \"due process\" are merely collective rights. \n \n \n \n\n Going back to what zachvac said, in a state of anarchy might makes right. Government serves as a kind of an equalizer so that the biggest, strongest person with the most powerful weapons doesn't have the most political power. In a civilized society things are decided by law and order, not by might. Allowing individuals to stockpile arms without restriction (whether they be nuclear arms, biological weapons, UZI's, rpg's etc.) would seem to undermine the purpose of leaving a state of anarchy and entering into a civilized society. \n\n \n Would the Collective Rights advocates claim that the state of Kalifornia has the right to keep nuclear bombs? How about the Terminator leading a \"state militia\" in possession of Biological weapons? \n \n \n \n\n Thus, I don't think the question is if we can have gun control, but the question should be- how much?\n\n \n \n The Miller and Aymette decisions draw the lines fairly clearly, so I don't understand your confusion. \n \n 1) We can't prevent people for keeping arms which have a military usefulness.\n \n 2)\"Arms\" meaning the ordinary equipment of a soldier (Nuclear arms are not standard issue)\n \n 3)We can pass laws regarding the carrying of arms to further public safety, \n (i.e. restrictions on concealed carry, laws against brandishing) but we can not ban the carrying of arms altogether since that would violate the second amendment. \n \n \n The enforcement of gun control and the protection of an individual right to bear arms are not mutually exclusive. However the banning of civilian ownship of weapons does require the acceptance of a mere \"Collective Right\". \n \n What do the Collective Rights advocates really intend - reasonable gun control or an outright ban on ownership of weapons for most of the population?", 
   {}, 
   154341, 
   null, 
   1123979940.0
  ], 
  [
   154945, 
   null, 
   "Galileo", 
   "Yes, some states even included this prohibition as part of their constitution's RKBA, but that only shows that the RKBA is an individual right of all persons. If the RKBA were only a Limited Individual right or a Collective Right (as defined in Silveira/9th circuit) then it would have been pointless to attach a prohibition against concealed weapons.\n\n So what you are saying is that state constitution can attach a limits in their own individual RKBA that supercedes federal law? Maybe you ought to read the Supremacy clause of the Constitution. \n \n \n\n Yes, since the war for independence was as much a civil war as a war against England, this action was quite understandable. It only makes sense to disarm the enemy -which included the loyalists. FDR set up internment camps during WWII for persons of japanese descent because he feared they might remain loyal to Japan. That internment happened is a fact, but FDR's action would not lead us to conclude that \"the right to liberty\" or \"due process\" are merely collective rights.\n\n So are you saying that there are exceptions to rights in times of war but these exceptions don't justify a collective interpretation? \n \n \n\n Would the Collective Rights advocates claim that the state of Kalifornia has the right to keep nuclear bombs? How about the Terminator leading a \"state militia\" in possession of Biological weapons?\n\n I don't think the California is going to choose a fictional character to lead the militia. Seems like a pointless question. As I understand, soldiers in the National Guard swear an oath of loyalty to the federal government and state government so it wouldn't be the state of California owning WMD's alone. \n \n \n\n The Miller and Aymette decisions draw the lines fairly clearly, so I don't understand your confusion. \n \n 1) We can't prevent people for keeping arms which have a military usefulness.\n \n 2)\"Arms\" meaning the ordinary equipment of a soldier (Nuclear arms are not standard issue)\n \n 3)We can pass laws regarding the carrying of arms to further public safety, \n (i.e. restrictions on concealed carry, laws against brandishing) but we can not ban the carrying of arms altogether since that would violate the second amendment.\n\n Can you quote the exact text for me from these decisions that says arms mean only the ordinary equipment of a soldier? \n \n \n\n The enforcement of gun control and the protection of an individual right to bear arms are not mutually exclusive. However the banning of civilian ownship of weapons does require the acceptance of a mere \"Collective Right\". \n \n What do the Collective Rights advocates really intend - reasonable gun control or an outright ban on ownership of weapons for most of the population?\n\n I think most just want reasonable gun control.", 
   {}, 
   154875, 
   null, 
   1124037900.0
  ], 
  [
   154957, 
   null, 
   "hansberrym", 
   "So what you are saying is that state constitution can attach a limits in their own individual RKBA that supercedes federal law? Maybe you ought to read the Supremacy clause of the Constitution. \n\n \n Why must you dodge the issue? No one suggested any such thing.\n \n \n \n \n\n So are you saying that there are exceptions to rights in times of war but these exceptions don't justify a collective interpretation? \n\n \n No, I said it happened. The fact that it happened does not justify a Collective Rights interpretation of \"liberty\" or \"Due Process\". Do you think these to be collective rights also?\n \n \n \n \n\n I don't think the California is going to choose a fictional character to lead the militia. Seems like a pointless question. As I understand, soldiers in the National Guard swear an oath of loyalty to the federal government and state government so it wouldn't be the state of California owning WMD's alone. \n \n\n \n Its \"pointless\" only because you do not want to answer it. The \"nuclear bombs = arms\" is a red herring. It cuts against a \"state militia\" argument as much as an individual rights argument -unless you honestly believe that the state have the right to keep nuclear arms (note that the constitution forbids the states to keep ships of war, so nuclear arms would be out of the querstion)\n \n \n \n \n\n Can you quote the exact text for me from these decisions that says arms mean only the ordinary equipment of a soldier? \n\n \n Somehow I think you are well aware of teh full text of these decisions. They are each only 4 or 5 pages in length, but the Collective Rights advocates can not seem to find them -how odd.\n \n From Aymette:\n We think there is a manifest distinction. In the nature of things, if they were not allowed to bear arms openly, they could not bear them in their defence of the state at all. To bear arms in defence of the state is to employ them in war, as arms are usually employed by civilized nations. The arms, consisting of swords, muskets, rifles, etc., must necessarily be borne openly; so that a prohibition to bear them openly would be a denial of the right altogether. And, as in their constitution the right to bear arms in defence of themselves is coupled with the right to bear them in defence of the state, we must understand the expressions as meaning the same thing, and as relating to public, and not private, to the common, and not the individual, defence. \n \n From MIller:\n In the absence of any evidence tending to show that possession or use of a 'shotgun having a barrel of less than eighteen inches in length' at this time has some reasonable relationship to the preservation or efficiency of a well regulated militia, we cannot say that the Second Amendment guarantees the right to keep and bear such an instrument. Certainly it is not within judicial notice that this weapon is any part of the ordinary military equipment or that its use could contribute to the common defense. Aymette v. State of Tennessee, 2 Humph., Tenn., 154, 158. \n \n \n \n \n \nI think most just want reasonable gun control.\n\n \n \n Then why go to such extreme lengths to deny an individual right to keep and bear arms? There is no need to deny the existence of the right, since reasonable gun control is clearly not in conflict with the RKBA.\n \n I think most deniers of an individual RKBA want total civilian confiscation, though they will pursue it only incrementally.", 
   {
    "unicode_changes_made": true
   }, 
   154945, 
   null, 
   1124046720.0
  ], 
  [
   154998, 
   null, 
   "Galileo", 
   "Why must you dodge the issue? No one suggested any such thing.\n\n It seems you are the one dodging the issue. Why can a state attach limits \"in their own individual RKBA\" (such as prohibited concealed carry) that supercede the second amendment- unless the second amendment does not protect concealed carry. \n \n \n\n No, I said it happened. The fact that it happened does not justify a Collective Rights interpretation of \"liberty\" or \"Due Process\". Do you think these to be collective rights also?\n\n The law in Pennsylvania remained the law until 1789, suggesting that it was not simply an emergency response to war. Anti federalists defended it. It gives insight into how they understood their own state right to bear arms. \n \n \n\n Its \"pointless\" only because you do not want to answer it. The \"nuclear bombs = arms\" is a red herring. It cuts against a \"state militia\" argument as much as an individual rights argument -unless you honestly believe that the state have the right to keep nuclear arms (note that the constitution forbids the states to keep ships of war, so nuclear arms would be out of the querstion)\n\n If the terminator did exist and the state wanted to appoint him as an officer in the militia then I guess they could do it. But what is the point of such a question? I could say that guns should be illegal because what if Mickey Mouse got a hold of a gun he could murder someone. And as I understand, soldiers in the National Guard swear an oath of loyalty to the federal government and state government so it wouldn't be the state of California owning WMD's alone. Anyway, I'm not defending the states' rights theory. \n \n \n \n \n\n Somehow I think you are well aware of teh full text of these decisions. They are each only 4 or 5 pages in length, but the Collective Rights advocates can not seem to find them -how odd.\n \n From Aymette:\n We think there is a manifest distinction. In the nature of things, if they were not allowed to bear arms openly, they could not bear them in their defence of the state at all. To bear arms in defence of the state is to employ them in war, as arms are usually employed by civilized nations. The arms, consisting of swords, muskets, rifles, etc., must necessarily be borne openly; so that a prohibition to bear them openly would be a denial of the right altogether. And, as in their constitution the right to bear arms in defence of themselves is coupled with the right to bear them in defence of the state, we must understand the expressions as meaning the same thing, and as relating to public, and not private, to the common, and not the individual, defence. \n \n From MIller:\n In the absence of any evidence tending to show that possession or use of a 'shotgun having a barrel of less than eighteen inches in length' at this time has some reasonable relationship to the preservation or efficiency of a well regulated militia, we cannot say that the Second Amendment guarantees the right to keep and bear such an instrument. Certainly it is not within judicial notice that this weapon is any part of the ordinary military equipment or that its use could contribute to the common defense. Aymette v. State of Tennessee, 2 Humph., Tenn., 154, 158. \n\n Interesting how some people insist that the RKBA is not limited by the militia, but here you let \"arms\" in the second amendment be limited according to the militia. Seems inconsistent. \n \n \n \n \n \n\n Then why go to such extreme lengths to deny an individual right to keep and bear arms? There is no need to deny the existence of the right, since reasonable gun control is clearly not in conflict with the RKBA.\n \n I think most deniers of an individual RKBA want total civilian confiscation, though they will pursue it only incrementally.\n\n Slippery slope fallacy.", 
   {
    "unicode_changes_made": true
   }, 
   154957, 
   null, 
   1124075820.0
  ], 
  [
   155029, 
   null, 
   "hansberrym", 
   "It seems you are the one dodging the issue. Why can a state attach limits \"in their own individual RKBA\" (such as prohibited concealed carry) that supercede the second amendment- unless the second amendment does not protect concealed carry. \n\n \n \n Did I ever say that concealed carry was protected by the second amendment? Aymette and other decisions would seem to say that it isn't. \n \n What would be the purpose of a concealed carry prohibition in a Collective Rights RKBA? Individuals at large might carry a concealed weapon, but it makes no sense to speak of Collective concealed carry. That is the point you have been dodging.\n \n \n \n \n\n The law in Pennsylvania remained the law until 1789, suggesting that it was not simply an emergency response to war. Anti federalists defended it. It gives insight into how they understood their own state right to bear arms. \n \n\n \n How does the fact that the law lasted until 1789 suggest more? Specifically how does it suggest a Collective Right? That the law was instigated by the war, stricken after the war and never renewed is actually pretty good evidence that it was an emergency measure. You must know that the political landscape was unsettled in the years following the war and did not really get close to settled until well after the Constituiton was signed. The emergency/political unrest did not abruptly cease with the Paris Peace treaty of 1783. There were internal rebellions and also continued friction with England (we did fight another war with England in 1812 after years of harrasment of our shipping)\n \n \n \n \n\n If the terminator did exist and the state wanted to appoint him as an officer in the militia then I guess they could do it. But what is the point of such a question? I could say that guns should be illegal because what if Mickey Mouse got a hold of a gun he could murder someone. And as I understand, soldiers in the National Guard swear an oath of loyalty to the federal government and state government so it wouldn't be the state of California owning WMD's alone. Anyway, I'm not defending the states' rights theory. \n \n\n \n Of course you know that \"the terminator\" is a nickname for Governor Swartzenager. If not a states rights theory, then what sort of Collective Rights theory do you defend? \n \n \n \n\n Interesting how some people insist that the RKBA is not limited by the militia, but here you let \"arms\" in the second amendment be limited according to the militia. Seems inconsistent. \n\n \n Not at all. The RKBA belongs to the people, whether actively a member of an organized militia or not. The type of arms that one may keep are those that would ordinarily be used by a soldier/militiaman in civilized warfare as opposed to the weapons that a criminal might employ. This right existed before the creation of our government and the milita, and would still exist even if our government and/or the militia ceased to exist, so the RKBA can not be said to be dependent on them.", 
   {}, 
   154998, 
   null, 
   1124096520.0
  ], 
  [
   155165, 
   null, 
   "Bryan", 
   "Well I've searched for federal gun control laws which would or could have been enacted while our founding fathers were still dominating the federal legislature, and I can't find anything of significance. I'm not sure, however, that we can read into this a desire to have the individual RKBA viewed as absolute and beyond any restriction. Gun control has always been first and foremost a state issue. Congress has no specific grant of authority in the Constitution to regulate private ownership of firearms. Congress has sought to get around that limitation by basing gun control legislation which limits private citizen access to firearms on its power to regulate interstate commerce. I don't believe Congress started throwing its weight around with its interstate commerce authority in an attempt to regulate private firearm possession until long after our founders were dead. \n \n There is, by the way, an excellent online research resource to search statutes, debates, and journals of our early Congressional sessions offered by the Library of Congress:\n http://memory.loc.gov/ammem/amlaw/lawhome.html\n \n I think the better answer to the question would lie in searching the state enactments, and I don't presently have the time to devote to that lengthy a search. Suffice to say that both alternative theories for the collective right interpretation of the Second Amendment break down when we consider the state constitutional guarantees of the RKBA, and that's another argument for another day....", 
   {
    "post_info": {
     "post_title": "No luck finding restrictions by early congress"
    }, 
    "unicode_changes_made": true
   }, 
   155029, 
   null, 
   1124146020.0
  ], 
  [
   155170, 
   null, 
   "Bryan", 
   "I want to address if I might the most common argument I see offered against the individual right interpretation of the 2nd. Amendment RKBA. Namely, the attempt to paint the individual right argument as one in favor of an unrestricted right which would allow Bubba to keep and bear a nuke or a tank. (Why is it that gun control proponents love to use the stereotypical image of some backwoods boy named \"Bubba\" when they talk about restricting my RKBA?) The argument suggests that the only way we could have an individual interpretation of the RKBA would be to have an absurd \"absolute\" right, and since we can't have Bubba owning nukes then the only remedy is to say the collective you-have-no-right interpretation makes more sense. \n \n It is a straw man sham argument which I think needs exposing for the lie it is. First of all, I do not believe that our founders thought the right was absolute. For example, even one of the most famous quotes in support of the individual RKBA, offered during the Massachusetts ratification debates by Samuel Adams, contains its own qualifier of the right:\n \n \"And that the said Constitution be never construed to authorize Congress to infringe the just liberty of the Press, or the rights of Conscience; or to prevent the people of the United States, who are peaceable citizens, from keeping their own arms. . .\"Samuel Adams, Debates & Proceedings in the Convention of the Commonwealth of Massachusetts, 86-87 (February 6, 1788).\n \n Ah, but say my gun control friends, the Second Amendment states \"the right of the people to keep and bear arms shall not be infringed.\" It has no limitation built into it. (Unless, like U.S. v. Miller, you accept the militia preamble as a purpose driven limitation, which has its own logical flaws). In any event, my answer is to show how no right has ever been held to be absolute. For example, there is no qualifier in the 1st. Amendment on the right of the people to engage in free speech, but in reality it is riddled with limitations. \n \n NO RIGHT IS ABSOLUTE\n \n Consider, for example, the following case in which SCOTUS clearly holds (and this is consistent with a wealth of other cases) that just because a right is expressed in the Constitution in unqualified terms it does not mean that there can be no limitation set upon it. The case is Konigsberg v. States Bar, 366 U.S. 36, 56 (1961), and it discussed at length the \"unqualified\" expression of the right to freedom of speech. Interestingly enough, it also compares that language to the \"absolute\" language of the 2nd. Amendment and it also cites Miller. [In particular, look at footnote 10]:\n \n \"At the outset we reject the view that freedom of speech and association ( N. A. A. C. P. v. Alabama, 357 U.S. 449, 460 ), as protected by the First and Fourteenth Amendments, are \"absolutes,\" not only in the undoubted sense that where the constitutional protection exists it must prevail, but also in the sense that the scope of that protection must be gathered solely from a literal reading of the First Amendment. [FOOTNOTE 10] Throughout its history this Court has consistently recognized at least two ways in which constitutionally protected freedom of speech is narrower than an unlimited license to talk. On the one hand, certain forms of speech, or speech in certain contexts, has been considered outside the scope of constitutional protection. [FOOTNOTE 11] See, e. g., Schenck v. United States, 249 U.S. 47; Chaplinsky v. New Hampshire, 315 U.S. 568; Dennis v. United States, 341 U.S. 494; Beauharnais v. Illinois, 343 U.S. 250; Yates v. United States, 354 U.S. 298; Roth v. United States, 354 U.S. 476.\"\n \n Here are the footnotes:\n \n [FOOTNOTE 10] \"That view, which of course cannot be reconciled with the law relating to libel, slander, misrepresentation, obscenity, perjury, false advertising, solicitation of crime, complicity by encouragement, conspiracy, and the like, is said to be compelled by the fact that the commands of the First Amendment are stated in unqualified terms: \"Congress shall make no law . . . abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble . . . .\" But as Mr. Justice Holmes once said: \"[T]he provisions of the Constitution are not mathematical formulas having their essence in their form; they are organic living institutions transplanted from English soil. Their significance is vital not formal; it is to be gathered not simply by taking the words and a dictionary, but by considering their origin and the line of their growth.\" Gompers v. United States, 233 U.S. 604, 610. In this connection also compare the equally unqualified command of the Second Amendment: \"the right of the people to keep and bear arms shall not be infringed.\" And see United States v. Miller, 307 U.S. 174.\n \n [FOOTNOTE 11] \"That the First Amendment immunity for speech, press and assembly has to be reconciled with valid but conflicting governmental interests was clear to Holmes, J. (\"I do not doubt for a moment that by the same reasoning that would justify punishing persuasion to murder, the United States constitutionally may punish speech that produces or is intended to produce a clear and imminent danger that it will bring about forthwith certain substantive evils that the United States constitutionally may seek to prevent.\" Abrams v. United States, 250 U.S. 616, 627); to Brandeis, J. (\"But, although the rights of free speech and assembly are fundamental, they are not in their nature absolute.\" Whitney v. California, 274 U.S. 357, 373); and to Hughes, C. J. (\"[T]he protection [of free speech] even as to previous restraint is not absolutely unlimited.\" Near v. Minnesota, 283 U.S. 697, 716.)\"\n \n This legal mumbo-jumbo is confusing at times but to me it means this: A right which is stated in unqualified terms is still not absolute, and can be subject to some rational limitation.\n \n The real question for me is what test do you use to determine whether a particular infringement on the RKBA is constitutional. To find out what test to use, you must first determine whether the RKBA is a \"fundamental\" right or not. \n \n DEFINITION OF A \"FUNDAMENTAL\" RIGHT\n \n The nature of a \"fundamental\" right was explained in the landmark 1964 voting rights case of Reynolds v. Sims [a \"one man, one vote\" principle case]. In that case, the right to vote was deemed fundamental because the free exercise of it was deemed to be \"preservative\" of other rights:\n \n \"Undoubtedly, the right of suffrage is a fundamental matter in a free and democratic society. Especially since the right to exercise the franchise in a free and unimpaired manner is preservative of other basic civil and political rights, any alleged infringement of the right of citizens to vote must be carefully and meticulously scrutinized. Almost a century ago, in Yick Wo v. Hopkins, 118 U.S. 356, the Court referred to \"the political franchise of voting\" as \"a fundamental political right, because preservative of all rights.\" 118 U.S., at 370.\" Reynolds v. Sims, 377 U.S. 533, 561-562 (1964)\n \n Additionally, in the more recent case of Lawrence v. Texas, the Court gave a description of the historical nature of \"fundamental\" rights: \n \n \"rights which are \"'deeply rooted in this Nation's history and tradition,'\" ibid. See Reno v. Flores, 507 U.S. 292, 303 (1993) (fundamental liberty interests must be \"so rooted in the traditions and conscience of our people as to be ranked as fundamental\" (internal quotation marks and citations omitted)); United States v. Salerno, 481 U.S. 739, 751 (1987) (same). See also Michael H. v. Gerald D., 491 U.S. 110, 122 (1989) (\"[W]e have insisted not merely that the interest denominated as a 'liberty' be 'fundamental' . . . but also that it be an interest traditionally protected by our society\"); Moore v. East Cleveland, 431 U.S. 494, 503 (1977) (plurality opinion); Meyer v. Nebraska, 262 U.S. 390, 399 (1923) (Fourteenth Amendment protects \"those privileges long recognized at common law as essential to the orderly pursuit of happiness by free men\" (emphasis added)). Lawrence v. Texas, 539 U.S. 558, 593 (2003) [this case invalidated a Texas law that made it a crime for consenting adults to engage in homosexual conduct in the privacy of their home, where they were embarrassingly caught \"in the act\" by officers entering their home on a complaint of, ironically for us, a weapons disturbance]\n \n THE INDIVIDUAL RKBA IS A \"FUNDAMENTAL\" RIGHT.\n \n I believe that the individual RKBA is a \"fundamental\" right, because it has been traditionally protected by our society, and our constitutional framers considered its free exercise to be \"preservative of other rights.\" As I said earlier when I quoted the example of the public press response to the Boston call to arms, it was agreed that the individual RKBA was \"long recognized at common law.\" Now let me pick up with the Continental Congress' response to the outbreak of open hostilities at Lexington and Concord. On July 6, 1775, the Congress issued a DECLARATION OF THE CAUSES AND NECESSITY OF TAKING UP ARMS. [The quotes from this document which follow this may be found beginning at p. 286 in Sources Of Our Liberties, American Bar Foundation, Richard L. Perry, editor, revised edition (William S. Hein & Co. 1990)]. This Declaration is one of the three issued by the Continental Congress, and it stands at the critical midpoint between the peaceful resistance of the trade embargo announced in the DECLARATION AND RESOLVES OF THE FIRST CONTINENTAL CONGRESS (October 14, 1774) and the DECLARATION OF INDEPENDENCE (July 4, 1776).\n \n After listing many complaints, the Congress declared:\n \n \"But why should we enumerate out injuries in detail? By one statute it is declared that parliament can 'of right make laws to bind us in all cases whatsoever.' What is to defend us against so enormous, so unlimited a power? Not a single man of those who assume it, is chosen by us; or is subject to our control or influence; but, on the contrary, they are all of them exempt from the operation of such laws, and an American revenue, if not diverted from the ostensible purposes for which it is raised, would actually lighten their own burdens in proportion, as they increase ours. We saw the misery to which such despotism would reduce us. We for ten years incessantly and ineffectually besieged the throne as supplicants; we reasoned, we remonstrated with parliament, in the most mild and decent language.\"\n \n Regarding the Government's response to these complaints, the Congress noted that:\n \n \"Administration sensible that we should regard these oppressive measures as freemen ought to do, sent over fleets and armies to enforce them.\"\n \n This increased military presence ultimately encountered armed resistance from the colonists:\n \n \"General Gage . . . sent ought from [Boston] a large detachment of his army, who made an unprovoked assault on the inhabitants of the said province, at the town of Lexington, as appears by the affidavits of a great many persons, some of whom were officers and soldiers of the detachment, murdered eight of the inhabitants, and wounded many others. From thence the troops proceeded in warlike array to the town of Concord, where they set upon another party of the inhabitants of the same province, killing several and wounding more, until compelled to retreat by the country people suddenly assembled to repel this cruel aggression.\"\n \n Remember the call to the citizens of Boston to privately arm themselves? What was the ultimate response of the military government to this action? A sham \"registration\" and \"secured storage\" scheme:\n \n \"The inhabitants of Boston being confined within that town by the general their governor, and having, in order to procure their dismission, entered into a treaty with him, it was stipulated that the said inhabitants having deposited their arms with their own magistrates, should have liberty to depart, taking with them their own effects. They accordingly delivered up their arms, but in open violation of honor, in defiance of the obligation of treaties, which even savage nations esteemed sacred, the governor ordered the arms deposited as aforesaid, that they might be preserved for their owners, to be seized by a body of soldiers; detained the greatest part of the inhabitants in the town, and compelled the few who were permitted to retire, to leave their most valuable effects behind.\"\n \n While General Gage was using his authority to disarm the colonists, Parliament passed a law banning all exports of muskets and ammunition to the colonies. Finally, these actions were accompanied by the following proclamation:\n \n \"The general, further emulating his ministerial masters, by a proclamation bearing date on the 12th. of June, after venting the grossest falsehoods and calumnies against the good people of these colonies, proceeds to '[D]eclare them all, either by name or description, to be rebels and traitors, to supersede the course of the common law, and instead thereof to publish and order the use and exercise of the law martial.'\"\n \n Here, then, was the final response to this \"oppression.\" The justification of a call to take up and use arms for the preservation of their liberties:\n \n \"We are reduced to the alternative of choosing an unconditional submission to the tyranny of irritated ministers, or resistance by force. The latter is our choice. We have counted the cost of this contest, and find nothing so dreadful as voluntary slavery. Honor, justice, and humanity, forbid us tamely to surrender that freedom which we received from our gallant ancestors, and which our innocent posterity have a right to receive from us. We cannot endure the infamy and guilt of resigning succeeding generations to that wretchedness which inevitably awaits them, if we basely entail hereditary bondage upon them.\n Our cause is Just. Our Union is Perfect. Our internal resources are great, and, if necessary, foreign assistance is undoubtedly attainable. - We gratefully acknowledge, as signal instances of the Divine favor towards us, that his Providence would not permit us to be called into this severe controversy, until we were grown up to our present strength, had been previously exercised in warlike operation, and possessed of the means of defending ourselves. With hearts fortified with these animating reflections, we most solemnly, before God and the world, declare, that, exerting the utmost energy of those powers, which our beneficent Creator hath graciously bestowed upon us, the arms we have been compelled by our enemies to assume, we will, in defiance of every hazard, with unabating firmness and perseverance, employ for the preservation of our liberties; being with one mind resolved to die freemen rather than to live slaves.\n We fight not for glory or for conquest. We exhibit to mankind the remarkable spectacle of a people attacked by unprovoked enemies, without any imputation or even suspicion of offence. They boast of their privileges and civilization, and yet proffer no milder conditions than servitude or death.\n In our own native land, in defense of the freedom that is our birthright, and which we ever enjoyed till the late violation of it - for the protection of our property, acquired solely by the honest industry of our fore-fathers and ourselves, against violence actually offered, we have taken up arms. We shall lay them down when hostilities shall cease on the part of the aggressors, and all danger of their being renewed shall be removed, and not before.\"\n \n I've posted quotes from this declaration before, but I felt it needed to be posted again to show our founders belief that the individual RKBA was \"fundamental\" in that it free exercise preserved other liberties which were being violated.\n \n THE ACCEPTED TEST FOR ESTABLISHING WHETHER LIMITATIONS ON FUNDAMENTAL RIGHTS ARE CONSTITUTIONAL IS THE \"STRICT SCRUTINY\" TEST. WHEN A STATURE IS CHALLENGED ON THE GROUNDS THAT IT INFRINGES UPON THE INDIVIDUAL RKBA, THE TEST SHOULD BE THE \"STRICT SCRUTINY\" TEST.\n \n This is the test which is used for EVERY fundamental civil liberty, like those recognized in the 1st., 4th, 5th., 6th., and 8th. Amendments. [we can argue that the 4th. has a qualifier built in (unreasonable), as does the 8th. (cruel and unusual), yet the test for these fundamental rights is the same as those which are unqualified.] The test is also applied to rights which are NOT specifically enumerated in the BoR but which SCOTUS nevertheless has found to be fundamental [like abortion]. \n \n The \"strict scrutiny\" test for all fundamental rights is explained as follows: \n \n \"the Due Process Clause prohibits States from infringing fundamental liberty interests, unless the infringement is narrowly tailored to serve a compelling state interest.\"  Washington v. Glucksberg, 521 U.S., at 721\n \n \"Certain substantive rights we have recognized as \"fundamental\"; legislation trenching upon these is subjected to \"strict scrutiny,\" and generally will be invalidated unless the State demonstrates a compelling interest and narrow tailoring.\"  Regents of University of Michigan v. Ewing, 474 U.S. 214, 226 (1985) \n \n \"Thus [for example], the Fourth Amendment speaks only of \"unreasonable searches and seizures\" and of \"probable cause.\" These rights are \"fundamental,\" and we have held that in order to support legislative action the statute must be narrowly and precisely drawn and that a \"compelling state interest\" must be shown in support of the limitation. E. g., Kramer v. Union Free School District, 395 U.S. 621; Shapiro v. Thompson, 394 U.S. 618; [Page 212] Carrington v. Rash, 380 U.S. 89; Sherbert v. Verner, 374 U.S. 398; NAACP v. Alabama, 357 U.S. 449 .\"Doe v. Bolton, 410 U.S. 179, 211-212 (1973)\n \n \"[Where fundamental liberty interests are infringed] the statutory classification would have to be not merely rationally related to a valid public purpose but necessary to the achievement of a compelling state interest. E. g., Shapiro v. Thompson, 394 U.S. 618 (1969); Loving v. Virginia, 388 U.S. 1 (1967).\" Eisenstadt v. Baird, 405 U.S. 438, 455 (1972)\n \n The test is also applied to infringements that do not equal a complete ban on exercising the right:\n \n \"We have repeatedly found that infringements of fundamental rights are not limited to outright denials of those rights. First Amendment decisions have consistently held in a wide variety of contexts that the compelling-state-interest test is applicable not only to outright denials but also to restraints that make exercise of those rights more difficult. See, e. g., Sherbert v. Verner, 374 U.S. 398 (1963) (free exercise of religion); NAACP v. Button, 371 U.S. 415 (1963) (freedom of expression and association), Linmark Associates v. Township of Willingboro, 431 U.S. 85 (1977) (freedom of expression). The compelling-state-interest test has been applied in voting cases, even where only relatively small infringements upon voting power, such as dilution of voting strength caused by malapportionment, have been involved. See, e. g., Reynolds v. Sims, 377 U.S. 533, 562, 566 (1964); Chapman v. Meier, 420 U.S. 1 (1975); Connor v. Finch, 431 U.S. 407 (1977). Similarly, cases involving the right to travel have consistently held that statutes penalizing the fundamental right to travel must pass muster under the compelling-state-interest test, irrespective of whether the statutes actually deter travel. Memorial Hospital v. Maricopa County, 415 U.S. 250, 257 -258 (1974); Dunn v. Blumstein, 405 U.S. 330, 339 -341 (1972); Shapiro v. Thompson, 394 U.S. 618 (1969). And indigents asserting a fundamental right of access to the courts have been excused payment of entry costs without being required first to show that their indigency was an absolute bar to access. Griffin v. Illinois, 351 U.S. 12 (1956); Douglas v. California, 372 U.S. 353 (1963); Boddie v. Connecticut, 401 U.S. 371 (1971).\"  Maher v. Roe, 432 U.S. 464, 487-488 (1977) (J. Brennan dissent, outlining accepted court doctrine)\n \n \n This, then, is the test. It is one that by nature has been very fluid because no court can peer into the future and predict all possible scenarios of legislative action which might infringe upon a fundamental liberty interest, be it the RKBA or free speech or the right to counsel. Like the other liberty interests in the Bill of Rights, for each claim of infringement on the individual RKBA, the test which the government must pass to sustain the law is one of \"strict scrutiny.\" Under this test, the state must first show that a legitimate and \"compelling\" state interest exists for the particular infringement of the right. It must then show that the infringement is \"necessary\" to accomplish that compelling interest. Finally, it must show that the infringement was \"narrowly\" and \"precisely\" drawn [that is, no more restrictive than necessary to achieve the \"compelling\" interest.] This is how SCOTUS has \"gotten around\" the absolute language of other fundamental rights, and it both could and should be equally applied to the RKBA. \n \n In short, I'm not asking for special treatment with the RKBA. I'm asking that the right receive the same equal protection SCOTUS gives our other fundamental liberties.\n \n You can apply this test to any gun restriction you like: registration, mandatory gun safety training, the now defunct AW ban, etc, and this is where public policy enters our debate-where we will often disagree with one another: whether such laws can be justified as \"necessary\" to serve a \"compelling\" state interest while being \"narrowly tailored\" to that end. It really is a Pandora's box, but it is one which the Court has opened and dug around in for decades while searching for meaningful limitations on other fundamental rights, and I think it is disingenuous to suggest the Court should do otherwise and close the lid when it addresses the RKBA.", 
   {
    "post_info": {
     "post_title": "The 2nd. Amendment RKBA is individual and can be rationally limited"
    }, 
    "unicode_changes_made": true
   }, 
   155165, 
   null, 
   1124146440.0
  ], 
  [
   155172, 
   null, 
   "Galileo", 
   "\n Did I ever say that concealed carry was protected by the second amendment? Aymette and other decisions would seem to say that it isn't. \n What would be the purpose of a concealed carry prohibition in a Collective Rights RKBA? Individuals at large might carry a concealed weapon, but it makes no sense to speak of Collective concealed carry. That is the point you have been dodging.\n\n What would be the purpose of prohibiting concealed carry if there is a collective right to bear arms? Obviously, the purpose would be to keep individuals from carrying concealed weapons. A collective right to bear arms is neutral on the issue of individual concealed carry so states would be free to allow their citizens the priviledge of carrying concealed weapons or not. \n \n \n\n How does the fact that the law lasted until 1789 suggest more? Specifically how does it suggest a Collective Right? That the law was instigated by the war, stricken after the war and never renewed is actually pretty good evidence that it was an emergency measure. You must know that the political landscape was unsettled in the years following the war and did not really get close to settled until well after the Constituiton was signed. The emergency/political unrest did not abruptly cease with the Paris Peace treaty of 1783. There were internal rebellions and also continued friction with England (we did fight another war with England in 1812 after years of harrasment of our shipping)\n\n But the people who supported the law thought things were settled well enough after the war. They didn't think there needed to be a Federal Constitution. And why would the Pennsylvanians include an individual right to bear arms in their Constitution at about the same time they included this restriction if they were were so worried about loyalists owning guns? One historian explains-\n \" 'The same people who didn't want the federal government regulating their right to own guns showed little reluctance in allowing their own state governments to take aggressive measures to restrict access to guns,' Cornell said. \n \"For example, while Pennsylvania supposedly gave its citizens the right to own guns, the Legislature in 1777 enacted a sweeping law, the Test Act, that disarmed as much as 40 percent of the state's white male population who were deemed to be 'disaffected to the liberty and independence of the state.'\n \"Like Pennsylvania, many other states had laws that restricted who could own or possess guns -- there was no overriding individual right.\"\n http://oncampus.osu.edu/v29n22/research.html \n \n \n\n Not at all. The RKBA belongs to the people, whether actively a member of an organized militia or not. The type of arms that one may keep are those that would ordinarily be used by a soldier/militiaman in civilized warfare as opposed to the weapons that a criminal might employ. This right existed before the creation of our government and the milita, and would still exist even if our government and/or the militia ceased to exist, so the RKBA can not be said to be dependent on them. \n\n If the right existed before the creation of the militia why would it be limited to weapons that are used by militia members?", 
   {}, 
   155170, 
   null, 
   1124147340.0
  ], 
  [
   155180, 
   null, 
   "Galileo", 
   "\n THE ACCEPTED TEST FOR ESTABLISHING WHETHER LIMITATIONS ON FUNDAMENTAL RIGHTS ARE CONSTITUTIONAL IS THE \"STRICT SCRUTINY\" TEST. WHEN A STATURE IS CHALLENGED ON THE GROUNDS THAT IT INFRINGES UPON THE INDIVIDUAL RKBA, THE TEST SHOULD BE THE \"STRICT SCRUTINY\" TEST.\n \n\n As I understand, in Lewis v. United States the Supreme Court did not use the strict scrutiny test. The test they used was minimum or rational basis. So they did not recognize individual gun ownership as a fundamental right.", 
   {
    "unicode_changes_made": true
   }, 
   155170, 
   null, 
   1124148900.0
  ], 
  [
   155213, 
   null, 
   "hansberrym", 
   "What would be the purpose of prohibiting concealed carry if there is a collective right to bear arms? Obviously, the purpose would be to keep individuals from carrying concealed weapons. A collective right to bear arms is neutral on the issue of individual concealed carry so states would be free to allow their citizens the priviledge of carrying concealed weapons or not. \n\n \n But the second amendment is not neutral on the questions of concealed carry as both Aymette and Miller clearly indicate. Nor were the state constitutions we were discussing. Thus neither the second amendment nor those state constitutions could reasonlably be characterized as referring to collective rights.\n \n \n \n \n \n \n\n But the people who supported the law thought things were settled well enough after the war. They didn't think there needed to be a Federal Constitution. And why would the Pennsylvanians include an individual right to bear arms in their Constitution at about the same time they included this restriction if they were were so worried about loyalists owning guns? One historian explains-\n \" 'The same people who didn't want the federal government regulating their right to own guns showed little reluctance in allowing their own state governments to take aggressive measures to restrict access to guns,' Cornell said. \n \"For example, while Pennsylvania supposedly gave its citizens the right to own guns, the Legislature in 1777 enacted a sweeping law, the Test Act, that disarmed as much as 40 percent of the state's white male population who were deemed to be 'disaffected to the liberty and independence of the state.'\n \"Like Pennsylvania, many other states had laws that restricted who could own or possess guns -- there was no overriding individual right.\"\n http://oncampus.osu.edu/v29n22/research.html \n\n \n More of the same. As we have already discussed these restrictions were placed on those persons who (as per test act 1777) remained loyal to the crown during the war for independence. It is not surprising at all that the enemy would be disarmed. \n \n Note that during WWII the FDR went much further, he did not simply disarm people of japanese descent, he forcibly interned them. But no one would be foolish enough to say that FDR's actions support a collective right to \"liberty\" or \"due process\". Nor would anyone say there is \"no overiding individual right to liberty \" simply because the government with the Supreme Court's acquiescence allowed persons suspected of supporting the enemy in time of war to be locked away. One might (rightly IMO) say the government was unjustly abusing rights, but no one would say that the government's actions are proof that an individual right to liberty does not exist.\n \n \n \n \n \n \n\n If the right existed before the creation of the militia why would it be limited to weapons that are used by militia members?\n\n \n The militia and the citizens at large would only carry weapons that civilized nations would use in warfare, they would not rightfully carry weapons useful only to criminals. That the same restriction applies to both equally does not suggest a dependent relationship between the militia an the citizens at large.\n \n If you trip on curb, you will fall down. If I trip on a curb, I will fall down. That gravity limits us both does not suggest a dependent relationship between you and I.\n \n \n There is no \"if' about it - the Supreme court in Presser: \n \"It was so held by this court in the case of U. S. v. Cruikshank, 92 U.S. 542 , 553, in which the chief justice, in delivering the judgment of the court, said that the right of the people to keep and bear arms 'is not a right granted by the constitution. Neither is it in any manner dependent upon that instrument for its existence. The second amendment declares that it shall not be infringed, but this, as has been seen, means no more than that it shall not be infringed by congress. This is one of the amendments that has no other effect than to restrict the powers of the national government, leaving the people to look for their protection against any violation by their fellow-citizens of the rights it recognizes to what is called in City of New York v. Miln, 11 Pet. [116 U.S. 252, 102] 139, the 'powers which relate to merely municipal legislation, or what was perhaps more properly called internal police,' 'not surrendered or restrained' by the constitution of the United States.' See, also, Barron v. Baltimore", 
   {}, 
   155172, 
   null, 
   1124166900.0
  ], 
  [
   155234, 
   null, 
   "SymonTemplar", 
   "If the FF's were so pro-individual right to bear arms then why would they allow it be restricted so much? I don't think if you are truly pro- individual right to bear arms you would do it just to gain a little temporary safety. The second amendment talks about both the people and the militia. So it can be interpreted in more than one way. The courts have emphasized the militia so that's what the second amendment means because they have the authority to decide.\n\n \n You of course know that the \"militia\" of the time was every able bodied man between the age of 18 and 45 in the whole country. They purchased their own uniforms and equipment, and the government provided subsidies for the purchase of guns and ammuniton.", 
   {}, 
   155213, 
   null, 
   1124174520.0
  ], 
  [
   155265, 
   null, 
   "Galileo", 
   "But the second amendment is not neutral on the questions of concealed carry as both Aymette and Miller clearly indicate. Nor were the state constitutions we were discussing. Thus neither the second amendment nor those state constitutions could reasonlably be characterized as referring to collective rights.\n\n I don't remember Miller saying anything about concealed carry. \n \n \n\n More of the same. As we have already discussed these restrictions were placed on those persons who (as per test act 1777) remained loyal to the crown during the war for independence. It is not surprising at all that the enemy would be disarmed. Note that during WWII the FDR went much further, he did not simply disarm people of japanese descent, he forcibly interned them. But no one would be foolish enough to say that FDR's actions support a collective right to \"liberty\" or \"due process\". Nor would anyone say there is \"no overiding individual right to liberty \" simply because the government with the Supreme Court's acquiescence allowed persons suspected of supporting the enemy in time of war to be locked away. One might (rightly IMO) say the government was unjustly abusing rights, but no one would say that the government's actions are proof that an individual right to liberty does not exist.\n\n More of the same? I brought up several points that you didn't address. We don't look to FDR as a model to understand the right of due process. But, we do look at the 18th Century Americans and their attitude towards gun ownership in order to understand the right to bear arms.\n \n The fact that this law was in place both during and after the war gives us insight into how the RKBA was understood by 18th Century Americans just like the internment of Japanese Americans gives us insight into how the Supreme Court interpreted due process rights at the time of World War II. \n \n \n\n The militia and the citizens at large would only carry weapons that civilized nations would use in warfare, they would not rightfully carry weapons useful only to criminals. That the same restriction applies to both equally does not suggest a dependent relationship between the militia an the citizens at large.\n \n If you trip on curb, you will fall down. If I trip on a curb, I will fall down. That gravity limits us both does not suggest a dependent relationship between you and I.\n \n \n There is no \"if' about it - the Supreme court in Presser: \n \"It was so held by this court in the case of U. S. v. Cruikshank, 92 U.S. 542 , 553, in which the chief justice, in delivering the judgment of the court, said that the right of the people to keep and bear arms 'is not a right granted by the constitution. Neither is it in any manner dependent upon that instrument for its existence. The second amendment declares that it shall not be infringed, but this, as has been seen, means no more than that it shall not be infringed by congress. This is one of the amendments that has no other effect than to restrict the powers of the national government, leaving the people to look for their protection against any violation by their fellow-citizens of the rights it recognizes to what is called in City of New York v. Miln, 11 Pet. [116 U.S. 252, 102] 139, the 'powers which relate to merely municipal legislation, or what was perhaps more properly called internal police,' 'not surrendered or restrained' by the constitution of the United States.' See, also, Barron v. Baltimore\n\n Still the argument that people have a right to own weapons of war and not weapons that are only useful to criminals does not rule out nuclear weapons since nukes have military utility.", 
   {}, 
   155213, 
   null, 
   1124203560.0
  ], 
  [
   155266, 
   null, 
   "Galileo", 
   "If the FF's were so pro-individual right to bear arms then why would they allow it be restricted so much? I don't think if you are truly pro- individual right to bear arms you would do it just to gain a little temporary safety. \n\n The exact same thought occured to me when I read hansberrym's argument.", 
   {}, 
   155213, 
   null, 
   1124203800.0
  ], 
  [
   155386, 
   null, 
   "Bryan", 
   "As I understand, in Lewis v. United States the Supreme Court did not use the strict scrutiny test. The test they used was minimum or rational basis. So they did not recognize individual gun ownership as a fundamental right.\n\n \n Actually, I must disagree with you here. The quetion of whether it is an indiviudal right or not was never addressed in that case. The case you cite, Lewis v. U.S., 445 U.S. 55 (1980), did not deal with the Second Amendment or the individual/collective RKBA issue. At trial, the defendant was convicted of being a felon in possession of a firearm. His appeal was based on his attempt to collaterally attack the validity of his prior felony conviction which made it illegal to possess a firearm. \n \n His prior felony conviction was from the state of Florida in 1961. At that earlier felony trial, he was not represented by counsel because he could not afford one and the state of Florida would not give him court-appointed counsel. Two years after his felony conviction, SCOTUS decided the landmark 6th. Amendment case of Gideon v. Wainwright, 372 U.S. 335 (1963), which thereafter required the states to offer indigent defendants court-appointed counsel. Gideon held that felony convictions were unconstitutional unless an indigent defendant was offered the ability to apply for court-appointed legal assistance. \n \n At the present trial, Lewis was convicted of violating a 1968 law which made it illegal for felons to possess firearms. The statute's language was sweeping, and by implication it included those who were convicted of felonies without the assistance of a lawyer before Gideon was decided. \n \n Lewis argued that if the statute was read to include those with felony convictions pre-Gideon and without the right to counsel required by that case, then the statute violated his 5th./14th. Amendment equal protection due process right. Lewis' claim was equal protection, not 2nd. Amendment RKBA. SCOTUS used the \"rational basis\" test because that is the one it likes to use for equal protection violation claims. Here is what the court said about that test:\n \n \"The firearm regulatory scheme at issue here is consonant with the concept of equal protection embodied in the Due Process Clause of the Fifth Amendment if there is \"some 'rational basis' for the statutory distinctions made . . . or . . . they 'have some relevance to the purpose for which the classification is made.'\" Marshall v. United States, 414 U.S. 417, 422 (1974), quoting from McGinnis v. Royster, 410 U.S. 263, 270 (1973), and Baxstrom v. Herold, 383 U.S. 107, 111 (1966). See Vance v. Bradley, 440 U.S. 93, 97 (1979)\"  Lewis v. United States, 445 U.S. 55, 65 (1980).\n \n The Second Amendment RKBA issue was not raised in this case at all. However, the Court did mention the Amendment in a footnote, which I post here:\n \n \"These legislative restrictions on the use of firearms are neither based upon constitutionally suspect criteria, nor do they trench upon any constitutionally protected liberties. See United States v. Miller, 307 U.S. 174, 178 (1939) (the Second Amendment guarantees no right to keep and bear a firearm that does not have \"some reasonable relationship to the preservation or efficiency of a well regulated militia\"); United States v. Three Winchester 30-30 Caliber Lever Action Carbines, 504 F.2d 1288, 1290, n. 5 (CA7 1974); United States v. Johnson, 497 F.2d 548 (CA4 1974); Cody v. United States, 460 F.2d 34 (CA8), cert. denied, 409 U.S. 1010 (1972) (the latter three cases holding, respectively, that § 1202 (a)(1), § 922 (g), and § 922 (a)(6) do not violate the Second Amendment).\"Id @ fn8.\n \n All of the cases mentioned here are lower Federal Circuit court of appeals cases which, like Lewis, have cited back to Miller and have said some variant of the following, which I now cite from the 4th. Cir. Case of U.S. v. Johnson:\n \n \"Johnson's argument that section 922(g) is an unconstitutional violation of his Second Amendment right to keep and bear arms is not new. See, e.g., United States v. Miller, 307 U.S. 174, 59 S. Ct. 816, 83 L. Ed. 1206 (1939). The courts have consistently held that the Second Amendment only confers a collective right of keeping and bearing arms which must bear a \"reasonable relationship to the preservation or efficiency of a well regulated militia.\" 307 U.S. at 178, 59 S. Ct. at 818. Johnson presents no evidence that section 922(g) in any way affects the maintenance of a well regulated militia. See Cody v. United States, 460 F.2d 34 (8th Cir. 1972).\"  United States v. Johnson, 497 F.2d 548, 550 (4th Cir. 1974)\n \n There are two important things to remember about Lewis:\n \n 1. It did not deal with the Second Amendment or the RKBA, because that issue was not raised. It is true that the court used the \"rational basis\" test, but that was applied to the real claim raised, which was due process equal protection.\n \n 2. The footnote is not a correct statement or endorsement for the collective right view. The footnote and the cases it notes all cite back to Miller, and like Miller they all glancingly address what is the scope of the right (i.e. whether it would just protect \"militia useful\" arms or all firearms), and not the nature of the right, either individual or state/collective. As I have said before, I remain of the belief that U.S. v. Miller is actually an individual right interpretation case (and the \"collective\" term in Johnson was error). \n \n ----\n \n \"False is the idea of utility that sacrifices a thousand real advantages for one imaginary or trifling inconvenience; that would take fire from men because it burns, and water because one may drown in it; that has no remedy for evils, except destruction. The laws that forbid the carrying of arms are laws of such a nature. They disarm only those who are neither inclined nor determined to commit crimes. Can it be supposed that those who have the courage to violate the most sacred laws of humanity, the most important of the code, will respect the less important and arbitrary ones, which can be violated with ease and impunity, and which, if strictly obeyed, would put and end to personal liberty--so dear to men, so dear to the enlightened legislator--and subject innocent persons to all the vexations that the guilty alone ought to suffer? Such laws make things worse for the assaulted and better for the assailants; they serve rather to encourage than to prevent homicides, for an unarmed man may be attacked with greater confidence than an armed man. They ought to be designated as laws not preventative but fearful of crimes, produced by the tumultuous impression of a few isolated facts, and not by thoughtful consideration of the inconveniences and advantages of a universal decree.\" Thomas Jefferson, Commonplace Book, 1774-1776, quoting 18th century criminologist Cesare Beccaria in On Crimes and Punishment, 1764.", 
   {
    "post_info": {
     "post_title": "I must respectfully disagree"
    }, 
    "unicode_changes_made": true
   }, 
   155180, 
   null, 
   1124234280.0
  ], 
  [
   155463, 
   null, 
   "hansberrym", 
   "I don't remember Miller saying anything about concealed carry.\n\n \n \n Read the footnotes, also read the citation to Aymette. Sawed off shotguns were considered to be concealable weapons which only criminals would use-thus the keeping and bearing of them would not be protected by the RKBA.\n \n From Miller:\n 'That for the purposes of (sections 1132 to 1132q) this Act- \n 'Sec. 1 (Section 1132). (a) The term 'firearm' means a shotgun or rifle having a barrel of less than eighteen inches in length, or any other weapon, except a pistol or revolver, from which a shot is discharged by an explosive if such weapon is capable of being concealed on the person, or a machine gun, and includes a muffler or silencer for any firearm whether or not such firearm is included within the foregoing definition, (The Act of April 10, 1936, c. 169, 49 Stat. 1192, 26 U.S.C.A. 1132, added the words) but does not include any rifle which is within the foregoing provisions solely by reason of the length of its barrel if the caliber of such rifle is .22 or smaller and if its barrel is sixteen inches or more in length. \n \n \n If the defendants in Miller had NO right to keep and bear ANY weapon, why did the supreme court even consider whether they had a right to bear a PARTICULAR weapon? \n \n If the RKBA of the Kentucky constitution was meant only as a collective right, then why does that provision even mention a prohibition on concealled carry? Was there a concern that the state militias might be armed with concealed weapons? NO -the concern was that the people at large might carry concealed weapons and threaten the public safety. Furthermore a collective right to concealed carry makes no sense whatever, so the Kentucky RKBA was clearly not a collective right. It dealt with an individual right and further indentified the limits of that right to be certain that the RKBA provision would not be construed to protect the carrying of concealed weapons. \n \n \n As to Aymette the same question could be asked. If the court in Aymette thought the RKBA to have no individual component, why would they even make a distinction between concealed weapons and weapons carried openly.\n If the Aymette court had seen the RKBA as referring only to active duty members of a state militia, then the question of concealed carry would not even come up. The deciding question would be: were the defendants members of the organized state militia? But in Aymette we do not have to rely on inference alone since in that decision the court plainly laid out that the citizens had the unqualified right to keep arms of the type used in civilized warfare and went on to list swords, muskets, rifles, etc.\n \n \n \n \n \n \n \n\n More of the same? I brought up several points that you didn't address. We don't look to FDR as a model to understand the right of due process. But, we do look at the 18th Century Americans and their attitude towards gun ownership in order to understand the right to bear arms.\n \n The fact that this law was in place both during and after the war gives us insight into how the RKBA was understood by 18th Century Americans just like the internment of Japanese Americans gives us insight into how the Supreme Court interpreted due process rights at the time of World War II. \n .\n\n \n \n What new points? other than to put a date and a name to the legislation that we spoke of earlier, you presented nothing new. The date of passage and the circumstances of the war support the position that the legislation was indeed an emergency action. Furthemore the emergency did not end with the signing of the peace treaty, so the continuation of the Test act until 1789 does not support your contention that the Test act was something more than an emergency measure. Forced oathes are an abberation, they are not the norm.\n \n \n Are you now saying that the Supreme Court during WWII considered \"liberty\" and \"due process\" to be collective rights? \n \n We don't look to FDR's actions in WWII for guidance on whether \"liberty\" or \"due process\" are individual rights because we recognize that the extreme circumstances under which those actions were taken do not tell us how those rights were understood or overshadow the evidence that liberty and due process are indeed individual rights. \n \n Sad to say nearly the same situtation is present today. Pres Bush wants the power to proclaim citizens arrested on US soils as \"enemy combatants\" and deny them of \"due processs\" rights, trial by jury of peers, etc. But I trust that no one would argue that Bush's actions are proof that those rights are collective in nature and not belonging to individuals. Even if Congress in some provision of the Patriot act were found to support the President's contention it would not be proof of the collective nature of those rights, or of the legislators' or people's view of these rights in terms of individual vs. collective nature. \n \n \n \n Is it reasonable to look at the 18th Century Americans and their attitude towards gun ownership by the enemy in time of war in order to understand the right to bear arms?  NO. Your argument when viewed in full context makes little sense. \n \n \n If we, as the Miller court did, look at the framers attitudes towards arms ownership by looking at legislation enacted contemporay to the Bill of Rights we would see that the states and the federal government REQUIRED all able bodied free white men to keep a supply af arms, to provide themselves with arms, etc. And we know what types of arms they were expected to keep.\n The framers' attitude was that the people MUST provide themselves with arms, must keep arms, etc. \n \n \n \n\n Still the argument that people have a right to own weapons of war and not weapons that are only useful to criminals does not rule out nuclear weapons since nukes have military utility.\n\n \n \n Aymette lists the types of weapons which the citizens had a right to keep.\n They list swords, muskets, rifles etc. but did not include field pieces (artillery) or explosives. The various militia acts, both state and federal lists the types of weapons that individuals were required to keep, whether active duty (train band) or not. Again these weapons included muskets, rifles, swords, powder, shot, pistols, but not field pieces, and not explosives. Furthermore the Constitution forbids the states from keeping ships of war w/o consent of Congress so Nuclear weapons would be out of the question. \n \n \n Does each and every one of the 50 states have a right to keep nuclear arms?\n \n Do the people in their collective capacity apart from the state and federal governments have the right to keep nuclear weapons? \n \n Does the freedom of speech really mean one can say whatever one wants?\n \n Does the freedom of the press mean you can print your own money -that counterfeiting is protected under the first amendment?\n \n Does the RKBA refer to nuclear weapons? No, that claim is just a Red Herring.", 
   {
    "unicode_changes_made": true
   }, 
   155265, 
   null, 
   1124261640.0
  ], 
  [
   155466, 
   null, 
   "hansberrym", 
   "The exact same thought occured to me when I read hansberrym's argument.\n\n \n \n\n If the FF's were so pro-individual right to bear arms then why would they allow it be restricted so much? I don't think if you are truly pro- individual right to bear arms you would do it just to gain a little temporary safety\n\n \n Circular arguments do abound on the collective rights side.\n \n \n \n A right of the people, the same people as in other provisions of the Bill of Rights, to keep and bear arms -meaning the type of arms that are useful in civilized warfare -is a restricted right in your opinion? \n \n Who else should have the right to bear arms?, what other arms ought they have the right to keep and bear? Perhaps we ought to let persons who swear an allegiance to a foreign power keep and bear arms while we are at war with that very same power -that would surely demonstrate our commitment to an individual right -eh? Or maybe the government should hand out nuclear bombs the way they hand out M-1 Garands now (Muskets in 1792) ?\n \n \n Would you prefer a right to keep and bear any type of weapon one wanted-without any restrictions?\n \n From your previous statements I surmize that you would also say : \n \n -If the freedom of the press does not allow me to print my own money, or slander my neighbor, then WTF good is it?\n \n -If the freedom of speech does not allow me to present false testimony, or make false claims in order to swindle others, then WTF good is it?\n \n -Surely true believers in the freedom of speech would not attempt to gain a little security by allowing such restrictions.", 
   {}, 
   155266, 
   null, 
   1124263680.0
  ], 
  [
   155522, 
   null, 
   "kelvin90701", 
   "Circular arguments do abound on the collective rights side.\n \n \n \n A right of the people, the same people as in other provisions of the Bill of Rights, to keep and bear arms -meaning the type of arms that are useful in civilized warfare -is a restricted right in your opinion? \n \n Who else should have the right to bear arms?, what other arms ought they have the right to keep and bear? Perhaps we ought to let persons who swear an allegiance to a foreign power keep and bear arms while we are at war with that very same power -that would surely demonstrate our commitment to an individual right -eh? Or maybe the government should hand out nuclear bombs the way they hand out M-1 Garands now (Muskets in 1792) ?\n \n \n Would you prefer a right to keep and bear any type of weapon one wanted-without any restrictions?\n \n From your previous statements I surmize that you would also say : \n \n -If the freedom of the press does not allow me to print my own money, or slander my neighbor, then WTF good is it?\n \n -If the freedom of speech does not allow me to present false testimony, or make false claims in order to swindle others, then WTF good is it?\n \n -Surely true believers in the freedom of speech would not attempt to gain a little security by allowing such restrictions.\n\n \n Your afraid of the wrong things. You seem to be afraid that gun owners will want and have access to nukes, explosives, grandes, and mortars. Let me be clear on this. Is that what are you afraid of?\n \n Explosives, mortars, granades, nukes, are different from centerfire weapons. Rifles, pistols, and shotguns are centerfire weapons. Under the 1934 Firearms Act explosives, mortars, granades, and nukes are classifed as destructive devices. Rifles, pistols, and shotguns are classifed as centerfire weapons. \n \n Gun owners want centerfire weapons. It is that simple. Your clouding the issue.\n \n Your right to political speech is called the First Amendment. It is NOT free press. You don't have such a thing. You have First Amendment rights, there is no such thing as 'free press concept' that you are using in the Constitution. First Amendment rights are poltical, artistic, and economic communication. Slander, lies, and swindles are not communication and you don't have the right to do that. Think for a minute. What you just proposed is criminal. First Amendment rights are not criminal.", 
   {}, 
   155466, 
   null, 
   1124302980.0
  ], 
  [
   155764, 
   null, 
   "hansberrym", 
   " Let me be clear on this. Is that what are you afraid of?\n \n\n \n No, not even close. \n \n \n Read the back and forth bewtween myself and Galileo. Galileo claims that \"arms\" in second amendment includes even nuclear weapons. I point out that arms refers to the weapons that a soldier would carry in civilized warfare and that these weapons are listed in the various militia acts and the early court cases. It is clear that \"arms\" does not refer to explosives (or as you say destructive devices).\n \n \n From reading your post I gather that we are on the same page.", 
   {}, 
   155522, 
   null, 
   1124434320.0
  ], 
  [
   155774, 
   null, 
   "Galileo", 
   "\n What new points?\n\n How about the fact that I brought up a historian who has researched the issue in depth and come to different conculsions than you? I also said, \"But the people who supported the law thought things were settled well enough after the war. They didn't think there needed to be a Federal Constitution. And why would the Pennsylvanians include an individual right to bear arms in their Constitution at about the same time they included this restriction if they were were so worried about loyalists owning guns?\"\n \n \n\n The date of passage and the circumstances of the war support the position that the legislation was indeed an emergency action. Furthemore the emergency did not end with the signing of the peace treaty, so the continuation of the Test act until 1789 does not support your contention that the Test act was something more than an emergency measure. Forced oathes are an abberation, they are not the norm.\n \n \n Are you now saying that the Supreme Court during WWII considered \"liberty\" and \"due process\" to be collective rights? \n \n We don't look to FDR's actions in WWII for guidance on whether \"liberty\" or \"due process\" are individual rights because we recognize that the extreme circumstances under which those actions were taken do not tell us how those rights were understood or overshadow the evidence that liberty and due process are indeed individual rights. \n \n Sad to say nearly the same situtation is present today. Pres Bush wants the power to proclaim citizens arrested on US soils as \"enemy combatants\" and deny them of \"due processs\" rights, trial by jury of peers, etc. But I trust that no one would argue that Bush's actions are proof that those rights are collective in nature and not belonging to individuals. Even if Congress in some provision of the Patriot act were found to support the President's contention it would not be proof of the collective nature of those rights, or of the legislators' or people's view of these rights in terms of individual vs. collective nature. \n \n \n \n Is it reasonable to look at the 18th Century Americans and their attitude towards gun ownership by the enemy in time of war in order to understand the right to bear arms? NO. Your argument when viewed in full context makes little sense.\n\n Only by the enemy and only during the time of war? A significant portion of Americans were neutral during the war. It is reasonable to assume that they would not have taken an oath of loyalty to either side. In addition, about 50% of the time that the law was in existence there was no war. These facts demonstrate that I'm not just merely basing my argument on what the attitude was toward enemy combatants only during the time of war. Do we turn to Bush and the position of the Supreme Court during World War II as a model for understanding rights? Do we turn to 18th Century Americans in an attempt to understand the right to bear arms? These rhetorical questions demonstrate that your analogy makes little sense.\n \n And let's go back to a case that you have cited from-\n \"U. S. v. Cruikshank, 92 U.S. 542 , 553, in which the chief justice, in delivering the judgment of the court, said that the right of the people to keep and bear arms 'is not a right granted by the constitution. Neither is it in any manner dependent upon that instrument for its existence. The second amendment declares that it shall not be infringed, but this, as has been seen, means no more than that it shall not be infringed by congress. \"\n \n So it appears that many early Americans (including those who wrote the 2nd amendment) weren't that concerned about state gun laws infringing on a personal right to bear arms. It wasn't just an emergency response to war. It was a reflection of their general attitude.\n \n \nRead the footnotes, also read the citation to Aymette. Sawed off shotguns were considered to be concealable weapons which only criminals would use-thus the keeping and bearing of them would not be protected by the RKBA.\n \n From Miller:\n 'That for the purposes of (sections 1132 to 1132q) this Act- \n 'Sec. 1 (Section 1132). (a) The term 'firearm' means a shotgun or rifle having a barrel of less than eighteen inches in length, or any other weapon, except a pistol or revolver, from which a shot is discharged by an explosive if such weapon is capable of being concealed on the person, or a machine gun, and includes a muffler or silencer for any firearm whether or not such firearm is included within the foregoing definition, (The Act of April 10, 1936, c. 169, 49 Stat. 1192, 26 U.S.C.A. 1132, added the words) but does not include any rifle which is within the foregoing provisions solely by reason of the length of its barrel if the caliber of such rifle is .22 or smaller and if its barrel is sixteen inches or more in length. \n \n \n If the defendants in Miller had NO right to keep and bear ANY weapon, why did the supreme court even consider whether they had a right to bear a PARTICULAR weapon? \n \n If the RKBA of the Kentucky constitution was meant only as a collective right, then why does that provision even mention a prohibition on concealled carry? Was there a concern that the state militias might be armed with concealed weapons? NO -the concern was that the people at large might carry concealed weapons and threaten the public safety. Furthermore a collective right to concealed carry makes no sense whatever, so the Kentucky RKBA was clearly not a collective right. It dealt with an individual right and further indentified the limits of that right to be certain that the RKBA provision would not be construed to protect the carrying of concealed weapons.\n \n \n As to Aymette the same question could be asked. If the court in Aymette thought the RKBA to have no individual component, why would they even make a distinction between concealed weapons and weapons carried openly.\n If the Aymette court had seen the RKBA as referring only to active duty members of a state militia, then the question of concealed carry would not even come up. The deciding question would be: were the defendants members of the organized state militia? But in Aymette we do not have to rely on inference alone since in that decision the court plainly laid out that the citizens had the unqualified right to keep arms of the type used in civilized warfare and went on to list swords, muskets, rifles, etc.\n\n If the RKBA refers to a collective right, the question of concealed carrry could be brought up by those who misunderstood the right and thought it was individual. \n I looked up the Kentucky state right to bear arms.\n \"That the right of the citizens to bear arms in defense of themselves and the State shall not be questioned.\" \n I don't see anything in that about prohibiting concealed carry so I don't understand your point. And the Amyette decision seems to say that people have a right to keep and bear arms for public purposes, not for private purposes. If you that's what you call an individual right then that is very interesting.\n \n \n\n Aymette lists the types of weapons which the citizens had a right to keep.\n They list swords, muskets, rifles etc. but did not include field pieces (artillery) or explosives. The various militia acts, both state and federal lists the types of weapons that individuals were required to keep, whether active duty (train band) or not. Again these weapons included muskets, rifles, swords, powder, shot, pistols, but not field pieces, and not explosives.\n\n Natural rights existed before the Amyette decision. So it seems that you can't use the natural rights argument to rule out nuclear weapons. \n \n \n \n\n Furthermore the Constitution forbids the states from keeping ships of war w/o consent of Congress so Nuclear weapons would be out of the question.\n\n Irrelevant. We're not debating about whether states have a right to own nuclear weapons.", 
   {
    "unicode_changes_made": true
   }, 
   155764, 
   null, 
   1124452620.0
  ], 
  [
   155779, 
   null, 
   "Galileo", 
   "Actually, I must disagree with you here. The quetion of whether it is an indiviudal right or not was never addressed in that case. The case you cite, Lewis v. U.S., 445 U.S. 55 (1980), did not deal with the Second Amendment or the individual/collective RKBA issue. At trial, the defendant was convicted of being a felon in possession of a firearm. His appeal was based on his attempt to collaterally attack the validity of his prior felony conviction which made it illegal to possess a firearm. \n \n His prior felony conviction was from the state of Florida in 1961. At that earlier felony trial, he was not represented by counsel because he could not afford one and the state of Florida would not give him court-appointed counsel. Two years after his felony conviction, SCOTUS decided the landmark 6th. Amendment case of Gideon v. Wainwright, 372 U.S. 335 (1963), which thereafter required the states to offer indigent defendants court-appointed counsel. Gideon held that felony convictions were unconstitutional unless an indigent defendant was offered the ability to apply for court-appointed legal assistance. \n \n At the present trial, Lewis was convicted of violating a 1968 law which made it illegal for felons to possess firearms. The statute's language was sweeping, and by implication it included those who were convicted of felonies without the assistance of a lawyer before Gideon was decided. \n \n Lewis argued that if the statute was read to include those with felony convictions pre-Gideon and without the right to counsel required by that case, then the statute violated his 5th./14th. Amendment equal protection due process right. Lewis' claim was equal protection, not 2nd. Amendment RKBA. SCOTUS used the \"rational basis\" test because that is the one it likes to use for equal protection violation claims. Here is what the court said about that test:\n \n \"The firearm regulatory scheme at issue here is consonant with the concept of equal protection embodied in the Due Process Clause of the Fifth Amendment if there is \"some 'rational basis' for the statutory distinctions made . . . or . . . they 'have some relevance to the purpose for which the classification is made.'\" Marshall v. United States, 414 U.S. 417, 422 (1974), quoting from McGinnis v. Royster, 410 U.S. 263, 270 (1973), and Baxstrom v. Herold, 383 U.S. 107, 111 (1966). See Vance v. Bradley, 440 U.S. 93, 97 (1979)\"  Lewis v. United States, 445 U.S. 55, 65 (1980).\n \n The Second Amendment RKBA issue was not raised in this case at all. However, the Court did mention the Amendment in a footnote, which I post here:\n \n \"These legislative restrictions on the use of firearms are neither based upon constitutionally suspect criteria, nor do they trench upon any constitutionally protected liberties. See United States v. Miller, 307 U.S. 174, 178 (1939) (the Second Amendment guarantees no right to keep and bear a firearm that does not have \"some reasonable relationship to the preservation or efficiency of a well regulated militia\"); United States v. Three Winchester 30-30 Caliber Lever Action Carbines, 504 F.2d 1288, 1290, n. 5 (CA7 1974); United States v. Johnson, 497 F.2d 548 (CA4 1974); Cody v. United States, 460 F.2d 34 (CA8), cert. denied, 409 U.S. 1010 (1972) (the latter three cases holding, respectively, that § 1202 (a)(1), § 922 (g), and § 922 (a)(6) do not violate the Second Amendment).\"Id @ fn8.\n \n All of the cases mentioned here are lower Federal Circuit court of appeals cases which, like Lewis, have cited back to Miller and have said some variant of the following, which I now cite from the 4th. Cir. Case of U.S. v. Johnson:\n \n \"Johnson's argument that section 922(g) is an unconstitutional violation of his Second Amendment right to keep and bear arms is not new. See, e.g., United States v. Miller, 307 U.S. 174, 59 S. Ct. 816, 83 L. Ed. 1206 (1939). The courts have consistently held that the Second Amendment only confers a collective right of keeping and bearing arms which must bear a \"reasonable relationship to the preservation or efficiency of a well regulated militia.\" 307 U.S. at 178, 59 S. Ct. at 818. Johnson presents no evidence that section 922(g) in any way affects the maintenance of a well regulated militia. See Cody v. United States, 460 F.2d 34 (8th Cir. 1972).\"  United States v. Johnson, 497 F.2d 548, 550 (4th Cir. 1974)\n \n There are two important things to remember about Lewis:\n \n 1. It did not deal with the Second Amendment or the RKBA, because that issue was not raised. It is true that the court used the \"rational basis\" test, but that was applied to the real claim raised, which was due process equal protection.\n \n 2. The footnote is not a correct statement or endorsement for the collective right view. The footnote and the cases it notes all cite back to Miller, and like Miller they all glancingly address what is the scope of the right (i.e. whether it would just protect \"militia useful\" arms or all firearms), and not the nature of the right, either individual or state/collective. As I have said before, I remain of the belief that U.S. v. Miller is actually an individual right interpretation case (and the \"collective\" term in Johnson was error). \n \n ----\n \n \"False is the idea of utility that sacrifices a thousand real advantages for one imaginary or trifling inconvenience; that would take fire from men because it burns, and water because one may drown in it; that has no remedy for evils, except destruction. The laws that forbid the carrying of arms are laws of such a nature. They disarm only those who are neither inclined nor determined to commit crimes. Can it be supposed that those who have the courage to violate the most sacred laws of humanity, the most important of the code, will respect the less important and arbitrary ones, which can be violated with ease and impunity, and which, if strictly obeyed, would put and end to personal liberty--so dear to men, so dear to the enlightened legislator--and subject innocent persons to all the vexations that the guilty alone ought to suffer? Such laws make things worse for the assaulted and better for the assailants; they serve rather to encourage than to prevent homicides, for an unarmed man may be attacked with greater confidence than an armed man. They ought to be designated as laws not preventative but fearful of crimes, produced by the tumultuous impression of a few isolated facts, and not by thoughtful consideration of the inconveniences and advantages of a universal decree.\" Thomas Jefferson, Commonplace Book, 1774-1776, quoting 18th century criminologist Cesare Beccaria in On Crimes and Punishment, 1764.\n\n I believe you are correct about equal protection. However, it seems to me the Supreme Court does not recognize personal gun ownership as a fundamental right when it says in the footnote, \"These legislative restrictions on the use of firearms are neither based upon constitutionally suspect criteria, nor do they trench upon any constitutionally protected liberties.\"\n \n It doesn't recognize that convicted felons lose a fundamental right when they are deprived of gun ownership.", 
   {
    "unicode_changes_made": true
   }, 
   155386, 
   null, 
   1124458140.0
  ], 
  [
   156068, 
   null, 
   "hansberrym", 
   "How about the fact that I brought up a historian who has researched the issue in depth and come to different conculsions than you? I also said, \"But the people who supported the law thought things were settled well enough after the war. They didn't think there needed to be a Federal Constitution. \n\n \n The historian's conclusion is not supported by the facts.\n The people who didn't think the Federal Constitution constitution was needed were the Anti-federalists. They were clearly in favor of a broad individual RKBA and offered an RKBA proposal that would have established a personal right to possess arms for personal purposes. \n \n \n From Address of the Pennsylvania Minority:\n That the people have a right to bear arms for the defence of themselves and their own state, or the United States, or for the purpose of killing game, and no law shall be passed for disarming the people or any of them, unless for crimes committed, or real danger of public injury from individuals; and as standing armies in the time of peace are dangerous to liberty, they ought not to be kept up; and that the military shall be kept under strict subordination to and be governed by the civil powers.  \n \n \n \nAnd why would the Pennsylvanians include an individual right to bear arms in their Constitution at about the same time they included this restriction if they were were so worried about loyalists owning guns?\"\n\n \n They did not view disarming Loyalists or anyone else who posed a real threat to public safety as an infringement on the individual right to bear arms. Neither would they think that Arnolds letters to the British generals were protected by the freedom of the press. \n \n \n \n \n\n Only by the enemy and only during the time of war? A significant portion of Americans were neutral during the war. It is reasonable to assume that they would not have taken an oath of loyalty to either side. In addition, about 50% of the time that the law was in existence there was no war. These facts demonstrate that I'm not just merely basing my argument on what the attitude was toward enemy combatants only during the time of war. .\n\n \n The war was surely the impetus for the Test Acts. Without the war, there would have been no need for the test acts, as there would have been no threat from the Loyalists. While it is logical to assume that not all who would refuse to take the oath would be Loyalists, indeed some would be neutral, there would be no way to make that distinction with certainty. I doubt that every japanese person who was put into an internment camp during WWII was an actual supporter of Japan. \n \n \"About 50% of the time that the law was in existence there was no war\" -While there was no declared war after the Paris Peace Treaty of 1783, the British continued to harrass American shipping, there were internal revolts, and the political landscape remained quite undecided until the US Constitution was ratified. The emergency did not abruptly end after 1783. \n \n \n \n\n Do we turn to Bush and the position of the Supreme Court during World War II as a model for understanding rights? Do we turn to 18th Century Americans in an attempt to understand the right to bear arms? These rhetorical questions demonstrate that your analogy makes little sense\n\n \n We do not turn to the actions of Bush, nor FDR, to determine the individual vs. collective nature of rights since we know that those actions were emergency actions undertaken during wartime. Nor should we look to emergency actions undertaken during the American Revolution. Especially since those were instituted under a far worse emergency than FDR or Bush faced (the War for Independence was fought on american soil, was in many ways a civil war, and the early american cause was in far more danger of total destruction considering the relative strengths of the adversaries in each case) it would seem to be an even worse case than Bush or FDR. \n \n The analogy aptly demonstrates the weakness of trying to draw conclusions based on what was clearly an emergency measure undetaken during extreme times. Just as no one in their right mind would suggest that FDR's actions are proof that \"liberty\" and \"due process\" are merely collective rights, the case should be no different when we consider a situation in which the actual emergency was far greater.\n \n \n \n \n \n\n And let's go back to a case that you have cited from-\n \"U. S. v. Cruikshank, 92 U.S. 542 , 553, in which the chief justice, in delivering the judgment of the court, said that the right of the people to keep and bear arms 'is not a right granted by the constitution. Neither is it in any manner dependent upon that instrument for its existence. The second amendment declares that it shall not be infringed, but this, as has been seen, means no more than that it shall not be infringed by congress. \" \n \n So it appears that many early Americans (including those who wrote the 2nd amendment) weren't that concerned about state gun laws infringing on a personal right to bear arms. It wasn't just an emergency response to war. It was a reflection of their general attitude.\n\n \n Really? Do you suppose they were equally unconcerned about state laws abridging the freedom of the press? That the federal Bill of Rights could not be applied against state action does not mean the freedom of the press or the RKBA are merely collective rights. \n \n \n \n \n \n \n\n If the RKBA refers to a collective right, the question of concealed carrry could be brought up by those who misunderstood the right and thought it was individual. \n I looked up the Kentucky state right to bear arms.\n \"That the right of the citizens to bear arms in defense of themselves and the State shall not be questioned.\" \n I don't see anything in that about prohibiting concealed carry so I don't understand your point. And the Amyette decision seems to say that people have a right to keep and bear arms for public purposes, not for private purposes. If you that's what you call an individual right then that is very interesting.\n\n \n The prohibition against concealed carry was added to the Kentucky RKBA provision in 1850 in response to the early court cases which were split on whether the RKBA included concealed carry or not. And so some states began to add language to better define the extent of the right, but all RKBA provisions were interpreted as individual rights. For instance, in Bliss, the Kentucky courts struck down a law against concealed carry on the basis that it violated the provision you cited. That court read that early Kentucky RKBA provision as very broad-even covering concealed weapons - and certainly as an individual right.\n \n \n Aymette, as I am sure you are aware, says that the right to keep arms is an unqualified right of the citizens, but the state has the power to pass laws regulating the way that the citizens bear arms to prevent public injury.\n \n \n You still have not answered the question: If the RKBA is merely Collective and the individual has NO right to keep and bear arms outside of the state's organized militia then why do both Aymette and Miller go into discussions of the types of arms that persons do not have a right to keep and bear. \n \n If individuals have no right to keep and bear ANY weapon, why discuss PARTICULAR weapons?\n \n And in Aymette, why say the the citizens have an \"Unqualified\" right to keep weapons used in civilized warfare if this is not an individual right of all citizens -including those who are not part of an organized state militia? \n \n \n \n\n Natural rights existed before the Amyette decision. So it seems that you can't use the natural rights argument to rule out nuclear weapons. \n\n \n And you said earlier:\n \n \n\n If the right existed before the creation of the militia why would it be limited to weapons that are used by militia members?\n\n \n \n And I responded. They key restraining principle was civilized warfare. The restriction applies to both the individuals at large and the active state militia member, as well as the soldier in a regular army. No civilized nation would allow individuals to handle nuclear bombs at their individual discretion whether they were members of the regular Army, state organized militia, or neither. Yet every civilized nation I am aware of sends soldiers into battle with small arms (i.e. rifles, bayonettes, pistols, etc.). Note that every nation has controls so that no one person, not even the President of the US, nor any other head of state, can fire off a nuclear weapon by himself. \n \n \n \n \n \n \n \n\n Irrelevant. We're not debating about whether states have a right to own nuclear weapons\n \n \n Oh? What sort of Collective Right do you propose then? I asked this once already but have received no response.\n \n I can not think of any theory regarding the second amendment which the \"Nuclear weapons=arms\" argument would fit. It is a redfherring.", 
   {}, 
   155774, 
   null, 
   1124617380.0
  ], 
  [
   156183, 
   null, 
   "Galileo", 
   "The historian's conclusion is not supported by the facts.\n The people who didn't think the Federal Constitution constitution was needed were the Anti-federalists. They were clearly in favor of a broad individual RKBA and offered an RKBA proposal that would have established a personal right to possess arms for personal purposes. \n \n \n From Address of the Pennsylvania Minority:\n That the people have a right to bear arms for the defence of themselves and their own state, or the United States, or for the purpose of killing game, and no law shall be passed for disarming the people or any of them, unless for crimes committed, or real danger of public injury from individuals; and as standing armies in the time of peace are dangerous to liberty, they ought not to be kept up; and that the military shall be kept under strict subordination to and be governed by the civil powers. \n\n Then apparently, these people that believed in such a \"broad individual RKBA\"\n were quite willing to let it be infringed by the state by the passage of the Test Acts.\n \n \n\n They did not view disarming Loyalists or anyone else who posed a real threat to public safety as an infringement on the individual right to bear arms. Neither would they think that Arnolds letters to the British generals were protected by the freedom of the press.\n\n So nearly 40% of the adult white male population in Pennsylvania \"posed a real threat to public safety\"? How about neutral Americans? \n \n \n\n The war was surely the impetus for the Test Acts. Without the war, there would have been no need for the test acts, as there would have been no threat from the Loyalists. While it is logical to assume that not all who would refuse to take the oath would be Loyalists, indeed some would be neutral, there would be no way to make that distinction with certainty. I doubt that every japanese person who was put into an internment camp during WWII was an actual supporter of Japan. \n \n \"About 50% of the time that the law was in existence there was no war\" -While there was no declared war after the Paris Peace Treaty of 1783, the British continued to harrass American shipping, there were internal revolts, and the political landscape remained quite undecided until the US Constitution was ratified. The emergency did not abruptly end after 1783. \n \n\n The end of the war would have certainly diminished the emergency. Again, it is hard to believe that supporters of a broad, individual RKBA would have favored such a law. If the law was only aimed at disarming enemy combatants then it would be understandable. The law, however, went far beyond this. I don't think we view the Supreme Court as a supporter of a broad, individual right to due process in WWII so I fail to see your point. \n \n \n\n Really? Do you suppose they were equally unconcerned about state laws abridging the freedom of the press? That the federal Bill of Rights could not be applied against state action does not mean the freedom of the press or the RKBA are merely collective rights.\n\n I'm not claiming that. I'm just showing that the Pennsylvanians' actions were more than just an emergency response to war. They were much more concerned about the possibility of a Federal Government infringing on rights and were much more willing to trust the state thus the name anti-federalists. \n \n \n\n The prohibition against concealed carry was added to the Kentucky RKBA provision in 1850 in response to the early court cases which were split on whether the RKBA included concealed carry or not. And so some states began to add language to better define the extent of the right, but all RKBA provisions were interpreted as individual rights. For instance, in Bliss, the Kentucky courts struck down a law against concealed carry on the basis that it violated the provision you cited. That court read that early Kentucky RKBA provision as very broad-even covering concealed weapons - and certainly as an individual right.\n \n \n Aymette, as I am sure you are aware, says that the right to keep arms is an unqualified right of the citizens, but the state has the power to pass laws regulating the way that the citizens bear arms to prevent public injury.\n \n \n You still have not answered the question: If the RKBA is merely Collective and the individual has NO right to keep and bear arms outside of the state's organized militia then why do both Aymette and Miller go into discussions of the types of arms that persons do not have a right to keep and bear. \n \n \n If individuals have no right to keep and bear ANY weapon, why discuss PARTICULAR weapons?\n \n And in Aymette, why say the the citizens have an \"Unqualified\" right to keep weapons used in civilized warfare if this is not an individual right of all citizens -including those who are not part of an organized state militia? \n \n\n I don't think in Amyette it is clear whether or not the defendants were part of the militia. They probably were because the militia at that time included most adult males. Correct me if I'm wrong about that. They certainly do talk about people having weapons but this ownership seem tied to a public or collective purpose. \n \n \n\n And you said earlier:\n \n \n \n \n And I responded. They key restraining principle was civilized warfare. The restriction applies to both the individuals at large and the active state militia member, as well as the soldier in a regular army. No civilized nation would allow individuals to handle nuclear bombs at their individual discretion whether they were members of the regular Army, state organized militia, or neither. Yet every civilized nation I am aware of sends soldiers into battle with small arms (i.e. rifles, bayonettes, pistols, etc.). Note that every nation has controls so that no one person, not even the President of the US, nor any other head of state, can fire off a nuclear weapon by himself.\n\n Natural rights are people have in a state of nature (before entering a civilized society). So why should this right be determined by what civilized nations allow? \n \n \n\n Oh? What sort of Collective Right do you propose then? I asked this once already but have received no response.\n \n\n A right that is connected with a public/collective purpose. This right seems to be tied to the militia in the second amendment, but I'm not sure that is true for every state RKBA.", 
   {}, 
   156068, 
   null, 
   1124685960.0
  ], 
  [
   156272, 
   null, 
   "Bryan", 
   "I believe you are correct about equal protection. However, it seems to me the Supreme Court does not recognize personal gun ownership as a fundamental right when it says in the footnote, \"These legislative restrictions on the use of firearms are neither based upon constitutionally suspect criteria, nor do they trench upon any constitutionally protected liberties.\"\n \n It doesn't recognize that convicted felons lose a fundamental right when they are deprived of gun ownership.\n\n \n I disagree. What SCOTUS is saying in my opinion is merely that this restriction on the right (denying felons the RKBA) is not an unconstitutional infringement of the right. The right to vote is universally recognized as a fundamental individual right, yet SCOTUS has similarly held that laws denying felons the right to vote do not impermissibly encroach upon constitutional liberties. I think we all tend to confuse the nature of the right and the scope of the right. The nature of each of these rights is individual and fundamental, but the scope of the protection afforded by these rights does not protect those who chose to forfeit them through engaging in prior criminal conduct. \n \n (Before I go any further I want to make sure I'm not giving anyone a false impression about the current state of the law. SCOTUS has never  held the 2nd. Amendment RKBA to be a fundamental right. My argument is that it should do so.)\n \n Declaring a right to be individual and fundamental does not mean that it cannot be restricted in some way. In addition to the right to vote, another perfect example of this is the 1st. Amendment. Everyone recognizes that our rights to free speech, press, religion, and assembly are fundamental and individual rights. Some people have argued that because these rights are not only fundamental but are also couched in terms without limitation in the amendment then they must be viewed as \"absolutely inviolable\" and cannot ever be restricted in any way. That is, any possible restriction would be an unconstitutional infringement upon the right. SCOTUS has never agreed with this view of our rights. It has repeatedly held that laws infringing on our right of free speech, like civil penalties for libel and slander, and criminal penalties for cursing in public, solicitation of crime or encouragement to riot, etc., do not violate the fundamental right of free speech. See here in the following excerpt how SCOTUS deals with the \"absolutist\" argument for the fundamental rights in the 1st. Amendment, and how it draws by comparison the RKBA into the discussion [from Konigsberg v. States Bar, 366 U.S. 36, 56 (1961)]: \n \n \"At the outset we reject the view that freedom of speech and association (N. A. A. C. P. v. Alabama, 357 U.S. 449, 460), as protected by the First and Fourteenth Amendments, are \"absolutes,\" not only in the undoubted sense that where the constitutional protection exists it must prevail, but also in the sense that the scope of that protection must be gathered solely from a literal reading of the First Amendment. [Footnote 10]\"\n \n [Footnote 10] \"That view, which of course cannot be reconciled with the law relating to libel, slander, misrepresentation, obscenity, perjury, false advertising, solicitation of crime, complicity by encouragement, conspiracy, and the like, is said to be compelled by the fact that the commands of the First Amendment are stated in unqualified terms: \"Congress shall make no law . . . abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble . . . .\" But as Mr. Justice Holmes once said: \"[T]he provisions of the Constitution are not mathematical formulas having their essence in their form; they are organic living institutions transplanted from English soil. Their significance is vital not formal; it is to be gathered not simply by taking the words and a dictionary, but by considering their origin and the line of their growth.\" Gompers v. United States, 233 U.S. 604, 610. In this connection also compare the equally unqualified command of the Second Amendment: \"the right of the people to keep and bear arms shall not be infringed.\" And see United States v. Miller, 307 U.S. 174.  \"\n \n What SCOTUS is saying here about the 1st Amendment (and, I argue, about the 2nd. Amendment) is this: Yeah, the right is individual and fundamental, but this does not mean that it is unlimited and immune from all possible restriction. When SCOTUS declares that a right is fundamental, it does not mean that it cannot ever be infringed by government action. What SCOTUS does when it declares a right to be fundamental is this: It raises the bar to survive a constitutional challenge. Where fundamental rights are involved, the state must pass the \"strict scrutiny/compelling state interest\" test to justify a particular infringement (like prohibiting felons the exercise of the RKBA, or prohibiting/limiting concealed carry). I think each of these laws could pass such a test and survive as valid restrictions on the RKBA.", 
   {
    "unicode_changes_made": true
   }, 
   155779, 
   null, 
   1124731140.0
  ], 
  [
   156274, 
   null, 
   "Bryan", 
   "Let me address a question Galileo asked earler:\n \n \"Why can a state attach limits \"in their own individual RKBA\" (such as prohibited concealed carry) that supercede the second amendment- unless the second amendment does not protect concealed carry.\"\n \n I do not believe that the scope of the 2nd. Amendment protected individual RKBA will ever be construed as an unlimited license for concealed carry. However, the short answer is to note that the states can do what they want with the RKBA because the 2nd. Amendment at present offers zero protection against state infringement of the right. \n \n The BoR was ratified as a portion of the United States Constitution, and was therefore only binding upon the actions of the federal government. That was supposed to change when the 14th. Amendment was ratified. That amendment was the product of outrage at how my state (Virginia) and her sister southern states were oppressing newly-freed slaves after the civil war. The Amendment was specifically intended to bind the BoR on the states and force them to recognize and protect the individual liberties in the BoR. \n \n It took SCOTUS decades to recognize this. SCOTUS has also refused, in my opinion, to fully honor the purpose of the Amendment, which was total incorporation of the BoR against the states. Instead, SCOTUS has for years toyed with \"selective incorporation,\" where rights are individually incorporated and made binding upon the states as cases appear requiring the decision of the issue. An excellent example of this is one we have already addressed in our discussion of the Lewis case. It took SCOTUS until 1963 and the case of Gideon v. Wainwright to incorporate the 6th. Amendment right to counsel and force the states to protect that right. \n \n To date, no case has come before SCOTUS requiring it to decided whether the 2nd. Amendment RKBA is also binding upon state action. Until then, States remain free to enact whatever laws they want to restrict the RKBA, including having restrictions in their own constitutions. If SCOTUS ever decides that the 2nd. Amendment is incorporated, then the supremacy clause would invalidate all state restrictions which are not compatible with whatever SCOTUS decides the scope of the 2nd. Amendment RKBA to be.", 
   {
    "unicode_changes_made": true
   }, 
   156272, 
   null, 
   1124731440.0
  ], 
  [
   156505, 
   null, 
   "hansberrym", 
   "Then apparently, these people that believed in such a \"broad individual RKBA\" were quite willing to let it be infringed by the state by the passage of the Test Acts..\n\n \n The Anti-federalists did believe in a broad individual RKBA and we know that by simply reading the proposals that they put forth. No leaps of faith are required -though the same can not be said of the claim of the historian you mentioned earlier.\n \n \n \n \n\n So nearly 40% of the adult white male population in Pennsylvania \"posed a real threat to public safety\"? How about neutral Americans? .\n\n \n The War for Independence was as much a civil war as a war against a foreign power. Those who remained openly loyal to the crown would certainly be a threat, those who professed neutrality would be suspect. It seems plausible to me that would add to be something like 40% of the population, but the numbers are supplied by your source so it would be up to them to fact check them.\n \n \n \n \n \n\n The end of the war would have certainly diminished the emergency. Again, it is hard to believe that supporters of a broad, individual RKBA would have favored such a law. If the law was only aimed at disarming enemy combatants then it would be understandable. The law, however, went far beyond this. I don't think we view the Supreme Court as a supporter of a broad, individual right to due process in WWII so I fail to see your point. .\n\n \n \n But liberty and due process are broad individual rights, even if FDR/the Court temporarily lost sight of that in the course of dealing with an emergency.\n That is my point, we would not look at those specific measures (internment of persons of Japanese descent though they were not combatants and denial of liberty of large numbers of citizens w/o due process would also seem to go far beyond what would seem necessary) for evidence of the nature of those rights, because we know the duress under which those measures were taken.\n \n \n \n \n \n \n\n I'm not claiming that. \n I'm just showing that the Pennsylvanians' actions were more than just an emergency response to war. They were much more concerned about the possibility of a Federal Government infringing on rights and were much more willing to trust the state thus the name anti-federalists.\n \n\n \n What on earth do the Test Acts have to do with not wanting the Bill of Rights to be applied against the states? It simply does not follow that since the anti-federalists opposed the BofR being applied against the states, then the Test Acts were more than emergency measures. \n \n \n \n\n I don't think in Amyette it is clear whether or not the defendants were part of the militia. They probably were because the militia at that time included most adult males. Correct me if I'm wrong about that. They certainly do talk about people having weapons but this ownership seem tied to a public or collective purpose. \n\n \n The militia still includes most adult males. But the Collective Rights and the Limited Individual Rights (as defined in Silveira) deny the RKBA to anyone who is not in active service of the state militia. Yet neither Aymette nor Miller even ask the defendants if they are active duty members of the militia. \n \n Aymette does say the citizens have an unqualified right to keep arms, and goes on to say that restrictions can be placed on the manner in which arms are carried. But none of the restrictions relate to whether or not one is on active duty, the restrictions relate only to concealed carry as opposed to open carry, and preventing ruffians from displaying arms in a threatening manner.\n \n \n \n \n\n Natural rights are people have in a state of nature (before entering a civilized society). So why should this right be determined by what civilized nations allow? \n\n \n The word \"Civilized\" is descriptive. Just as we do not interpret the freedom of speech as meaning the right to steal by fraud or intimidation or to literally say whatever one wants, we would not interpret the rigth to keep and bear arms as a right to keep whatever arms one wants or to do whatever one wants with them. \n \n People entering civilized society do not give away any natural right to speak their mind on political matters or any other matters, but they are bound to follow the laws against fraud, perjury, etc so as not deprive others of their natural rights.\n \n \n \n \n\n A right that is connected with a public/collective purpose. This right seems to be tied to the militia in the second amendment, but I'm not sure that is true for every state RKBA.\n\n \n Your phrasing \"tied to the militia\" is hopelessly vague, but at least we have returned to the main point of this thread. My first post here was to answer the question posed regarding the meaning of the preamble. If one reads that language in historical context it would mean the same as the preamble to the 1785 Virgina militia act cited in Miller: \n \n \"The defense and safety of the commonwealth depend upon having its citizens properly armed and taught the knowledge of military duty.\"\n \n Note that this act then went on to require every able bodied free white to \"keep\" a supply of arms -musket, shot, powder, swords, etc.\n \n The declared purpose of the 1785 militia act of Virginia was \"the defense and safety of the commonwealth\" but that preamble would not lessen the requirement that every able bodied man \"keep\" arms. \n \n The declared purpose for the non-infringement of the RKBA in the second amendment is the securtiy of a free state, but that does not change the fact that the right itself relates to the individual citizen keeping and bearing arms.", 
   {
    "unicode_changes_made": true
   }, 
   156183, 
   null, 
   1124787000.0
  ], 
  [
   165886, 
   null, 
   "GX4", 
   "Many people argue that the second amendment claims we have the right to bear arms, but usually they leave out the rest. It says to form a militia. So unless you are forming a militia you don't have the right to bear arms by the Constitution.\n\n \n The truth is that the people have a right to bear arms. However, discussing what the second amendment means isn't even necessary.\n \n Firstly, the Second Amendment is a limitation on US Federal Power, not State power.\n \n Secondly, the reason that interpreting the Second Amendment isn't necessary is because Congress doesn't have the enumerated power to take guns away from the citizens. It has done so with the assault ban, but that taking is unconstituitonal.\n \n Hamilton in Federalist 84 said:\n \n \"I go further, and affirm that bills of rights, in the sense and in the extent in which they are contended for, are not only unnecessary in the proposed constitution, but would even be dangerous. They would contain various exceptions to powers which are not granted; and on this very account, would afford a colourable pretext to claim more than were granted. For why declare that things shall not be done which there is no power to do? Why for instance, should it be said, that the liberty of the press shall not be restrained, when no power is given by which restrictions may be imposed?\"\n \n Congress has neither the power to regulate speech nor regulate guns.\n \n But, of course, Congress has done both. It is unconstitutional, but the Supreme Court refuses to say so. Hamilton's fear has come true. Powers not granted have become assumed.\n \n Meanwhile, no one in their right mind really believes that at the time of the drafting of the Constitution and bill of rights, that the founders intended Congress the power to take away guns from individuals. No way.", 
   {}, 
   98565, 
   null, 
   1127678700.0
  ], 
  [
   165888, 
   null, 
   "GX4", 
   "By the way, the 2nd Amendment applies only as a restriction on federal power. \n \n Any individual state may regulate guns any way it wants. Not that they should, but they may.\n \n With regard to conceal and carry, what Federal Power would allow Congress to ban conceal and carry? None.\n \n A federal ban on conceal and carry would be unconstitutional.", 
   {}, 
   154945, 
   null, 
   1127679000.0
  ], 
  [
   166072, 
   null, 
   "Bryan", 
   "I agree that the 2nd. Amendment applies at present only as a restriction on the federal government. The entire catalogue of individual rights in the BoR were originally intended only to be a limitation on the power of the federal government. \n \n SCOTUS has used the 14th. Amendment to \"selectively incorporate\" certain individual liberties in the BoR and force the states to respect these rights, but it has done so on a case-by-case basis. To date, no case has come before SCOTUS requiring it to decide whether the RKBA would be \"incorporated\" and enforced against the states through the 14th. Amendment.", 
   {
    "post_info": {
     "post_title": "2nd. amendment not incorporated yet"
    }, 
    "unicode_changes_made": true
   }, 
   165888, 
   null, 
   1127756280.0
  ], 
  [
   166151, 
   null, 
   "GX4", 
   "I agree that the 2nd. Amendment applies at present only as a restriction on the federal government. The entire catalogue of individual rights in the BoR were originally intended only to be a limitation on the power of the federal government. \n \n SCOTUS has used the 14th. Amendment to \"selectively incorporate\" certain individual liberties in the BoR and force the states to respect these rights, but it has done so on a case-by-case basis. To date, no case has come before SCOTUS requiring it to decide whether the RKBA would be \"incorporated\" and enforced against the states through the 14th. Amendment.\n\n \n None has actually been heard by the Supreme Court, but they could have taken this case, but they didn't:\n \n \"[24] None of these arguments has merit. First, appellants offer no authority, other than their own opinions, to support their arguments that Presser is no longer good law or would have been decided differently today. Indeed, the fact that the Supreme Court continues to cite Presser, Malloy v. Hogan, 378 U.S. 1, 4 n. 2, 84 S.Ct. 1489, 1491 n. 2, 12 L.Ed.2d 653 (1964), leads to the opposite conclusion. Second, regardless of whether appellants agree with the Presser analysis, it is the law of the land and we are bound by it. Their assertion that Presser is illogical is a policy matter for the Supreme Court to address. Finally, their theory of implicit incorporation is wholly unsupported. The Supreme Court has specifically rejected the proposition that the entire Bill of Rights applies to the states through the fourteenth amendment. Adamson v. California, 332 U.S. 46, 67 S.Ct. 1672, 91 L.Ed. 1903 (1947), overruled on other grounds, Malloy v. Hogan, 378 U.S. 1, 84 S.Ct. 1489, 12 L.Ed.2d 653 (1964); Palko v. Connecticut, 302 U.S. 319, 58 S.Ct. 149, 82 L.Ed. 288 (1937); Twining v. New Jersey, 211 U.S. 78, 29 S.Ct. 14, 53 L.Ed. 97 (1908). \n \n [25] Since we hold that the second amendment does not apply to the states, we need not consider the scope of its guarantee of the right to bear arms. For the sake of completeness, however, and because appellants devote a large portion of their briefs to this issue, we briefly comment on what we believe to be the scope of the second amendment. \" \n \n Quilici v. Village of Morton Grove, 695 F.2d 261 (7th Cir. 1982)\n \n So that is the current state of the law.\n \n Now, if I had my way, none of the Bill of rights would be incorporated. That is not what the 14th Amendment was intended to do, but rather ensure that state governments treat blacks and whites equally.", 
   {
    "unicode_changes_made": true
   }, 
   166072, 
   null, 
   1127771220.0
  ], 
  [
   166237, 
   null, 
   "hansberrym", 
   "\n Now, if I had my way, none of the Bill of rights would be incorporated. That is not what the 14th Amendment was intended to do, but rather ensure that state governments treat blacks and whites equally.\n\n \n \n I do not agree that the 14th was ONLY meant to insure equal treatment, nor do I think a fair reading of the text would support such a limited purpose. The equal protection clause is just one of the protections afforded. \n \n 1) citizenship\n 2) priviledges and immunities\n 3) due process\n 4) equal protection of the laws.\n \n The priviedges and immunities clause can not simply be protecting the priviledge of equal treatment for the freedmen, since that particular protection is listed separately. Furthermore the history of the amendment and the reasons given for its drafting by multiple sources provide a record that should not be tossed aside simply because early decisions have ignored, or been ignorant of, that record.\n \n Fourteenth Amendment:\n Section 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside. No state shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any state deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws. \n \n \n History of the Fourteenth Amendment as quoted by Justice Hugo Black in his dissent in Adamson v. People of Californina.\n http://caselaw.lp.findlaw.com/scripts/getcase.pl?court=US&navby=case&vol=332&invol=46&friend=oyez\n \n 'Such is the character of the privileges and immunities spoken of in the second section of the fourth article of the Constitution. To these privileges and immunities, whatever they may be-for they are not and cannot be fully defined in their entire extent and precise nature-to these should be added [b]the personal rights guarantied and secured by the first eight amendments of the Constitution; such as the freedom of speech and of the press; the right of the people peaceably to assemble and petition the Government for a redress of grievances, a right appertaining to each and all the people; the right to keep and to bear arms; the right to be exempted from the quartering of soldiers in a house without the consent of the owner; <332 U.S. 46 , 106< the right to be exempt from unreasonable searches and seizures, and from any search or seizure except by virtue of a warrant issued upon a formal oath or affidavit; the right of an accused person to be informed of the nature of the accusation against him, and his right to be tried by an impartial jury of the vicinage; and also the right to be secure against excessive bail and against cruel and unusual punishments. (my emphasis)\n \n \n A fair reading of the record compiled by Justice Hugo Black demonstrates that there is certainly far more evidence for incorporating the first 8 amendments under the priviledges and immunities clause than there is for a partial incorporation under the due process clause, which has been transformed into the \"substantive\" due process clause by artful construction.", 
   {}, 
   166151, 
   null, 
   1127787780.0
  ], 
  [
   166367, 
   null, 
   "Bryan", 
   "Yeah, Morton Grove is the current state of the law in the 7th. Cir, which is similar to the state of the law in the 9th. Cir, which is radically different from the state of the law in the 5th. Cir. The field is ripe with the type of split among the lower circuits which has traditionally required SCOTUS to weigh in and equalize the law of the land. It's only a matter of time before the right case comes along which forces SCOTUS to address the issue of the nature of the RKBA. \n \n ---\n \n As far as the 14th. Amendment goes, I believe it was intended to incorporate all of the individual liberties in the BoR as a bar to state infringement of these liberties. Justice Black's famous dissent is an excellent history of the theory behind the amendment. Whether congress was wise to attempt total incorporation of the BoR or whether it trod on the sovereignty of the states in attempting to do so is another matter.\n \n For purposes of this forum, I have always been curious to see how the 2nd. Amendment RKBA was viewed throughout the process of creating the 14th. The point for me is that within the debates on the 14th. Amendment you can see a clear and universal understanding by the participants that the 2nd. Amendment RKBA was an individual right, and that it should be incorporated against the states along with the other \"right[s] of the people\" in the BoR. I think the Congress which adopted the 14th. Amendment believed the following: that the reconstructed southern states were actively depriving the black man of his individual RKBA; that the goal of the deprivation of the black man's RKBA was to ensure he remained cowed in fear and incapable of resisting a racist policy of de facto re-enslavement; and that the 14th. Amendment was needed to force the reconstructed southern states to recognize the black man's RKBA and prohibit the state's attempts to deprive him of that right. I attempted to address the history of the 14th. Amendment and how it helps show the individual and fundamental nature of the 2nd. Amendment RKBA in post #16 on this thread. For me, the history of the 14th. Amendment is a reaffirmation of the standard model individual RKBA interpretation of the 2nd. Amendment.", 
   {
    "post_info": {
     "post_title": "The lower circuit split, the intent of the 14th. Amendment"
    }, 
    "unicode_changes_made": true
   }, 
   166237, 
   null, 
   1127835600.0
  ], 
  [
   167513, 
   null, 
   "Freedom Fighter", 
   "All I have to say is that the 2nd ammendment clearly states that I can own a gun. So you :xcensored people against guns just need to give up trying to take them away. If you don't like them then don't have them the rest of us do, so were gonna keep them.", 
   {}, 
   166367, 
   null, 
   1128286020.0
  ], 
  [
   168308, 
   null, 
   "GX4", 
   "All I have to say is that the 2nd ammendment clearly states that I can own a gun. So you :xcensored people against guns just need to give up trying to take them away. If you don't like them then don't have them the rest of us do, so were gonna keep them.\n\n \n I own guns. I am not trying to take yours away, nor would I ever. But, it is also appropriate for people to understand what the Constitution means, and what it doesn't mean.\n \n At the time of the ratification of the 2nd Amendment, it applied as a restriction on Federal Power. This point is clear and easy to defend from the writings of Madison, the very person that introduced it on the floor of Congress.\n \n The issue is whether the 14th Amendment was originally intended to made the 2nd Amendment binding on the States as well. There are interesting arguments for such, as highlighted by the previous post. But this is not clear.", 
   {}, 
   167513, 
   null, 
   1128537240.0
  ], 
  [
   173187, 
   null, 
   "Freedom Fighter", 
   "I own guns. I am not trying to take yours away, nor would I ever. But, it is also appropriate for people to understand what the Constitution means, and what it doesn't mean.\n \n At the time of the ratification of the 2nd Amendment, it applied as a restriction on Federal Power. This point is clear and easy to defend from the writings of Madison, the very person that introduced it on the floor of Congress.\n \n The issue is whether the 14th Amendment was originally intended to made the 2nd Amendment binding on the States as well. There are interesting arguments for such, as highlighted by the previous post. But this is not clear.\n\n Good point, but I was simply replying to the orginal premise by the starter of this page about what the 2nd ammendment says. emoticon_smile", 
   {}, 
   168308, 
   null, 
   1130031300.0
  ], 
  [
   173958, 
   null, 
   "GreenMtnBoy", 
   "How do you reconcile your right to own a gun, but that a felon can not?", 
   {}, 
   173187, 
   null, 
   1130236380.0
  ], 
  [
   174035, 
   null, 
   "Bryan", 
   "How do you reconcile your right to own a gun, but that a felon can not?\n\n \n It is because I believe these laws punish the guilty without prejudicing the rights of the innocent. My opinion is that every citizen has an individual RKBA. However, that right can be forfeited through criminal behavior. A felony conviction operates as a disenfranchisement to more than just the RKBA. It also strips away a person's right to vote. In my opinion, these are appropriate punishments that attend a felony conviction. A felon can have his civil rights restored, including the RKBA and the right to vote. For the RKBA in my state, the final step in the process involves petitioning a court for restoration of the right. I have represented the state as opposing party in several of these petitions over the years, and I have rarely had an occasion to feel compelled to object to the petition for restoration being granted. By far the most typical case involves a man who was convicted of a felony 10 or more years ago, who now has a son of hunting age, and who wants to have his RKBA restored so he can hunt with his son.\n \n Significantly, I have never seen anyone who has had their right restored in this manner commit either a crime with a gun or a crime that would take away their RKBA again.\n \n Laws that strip the RKBA from felons pose no problem for me, because I have said before that no right in our BoR is absolute. Such laws target only those who forfeit the right through their own misconduct, and only do so after affording the accused a fair trial in which they enjoy the protections of the other individual rights which the RKBA was intended to help protect. \n \n ---\n \n \"False is the idea of utility that sacrifices a thousand real advantages for one imaginary or trifling inconvenience; that would take fire from men because it burns, and water because one may drown in it; that has no remedy for evils, except destruction. The laws that forbid the carrying of arms are laws of such a nature. They disarm only those who are neither inclined nor determined to commit crimes. Can it be supposed that those who have the courage to violate the most sacred laws of humanity, the most important of the code, will respect the less important and arbitrary ones, which can be violated with ease and impunity, and which, if strictly obeyed, would put and end to personal liberty--so dear to men, so dear to the enlightened legislator--and subject innocent persons to all the vexations that the guilty alone ought to suffer? Such laws make things worse for the assaulted and better for the assailants; they serve rather to encourage than to prevent homicides, for an unarmed man may be attacked with greater confidence than an armed man. They ought to be designated as laws not preventative but fearful of crimes, produced by the tumultuous impression of a few isolated facts, and not by thoughtful consideration of the inconveniences and advantages of a universal decree.\" Thomas Jefferson, Commonplace Book, 1774-1776, quoting 18th century criminologist Cesare Beccaria in On Crimes and Punishment, 1764", 
   {
    "post_info": {
     "post_title": "Here is my reasoning"
    }, 
    "unicode_changes_made": true
   }, 
   173958, 
   null, 
   1130256900.0
  ], 
  [
   174260, 
   null, 
   "Freedom Fighter", 
   "How do you reconcile your right to own a gun, but that a felon can not?\n\n Well I look at the fact of your rights are not to be abused, that and if you are a felon obviously you are abusing your rights, and you should be punished and consequences should follow.\n Definition of LIBERTY-the condition of being free to choose, with an implication of wisdom, resonibility, and voluntary restraint. \n They show no voluntary restraint therefor showing they do not to want to have liberty.", 
   {}, 
   173958, 
   null, 
   1130295540.0
  ], 
  [
   175420, 
   null, 
   "Howard Beale", 
   "Brian:\n \n Isn't a fundamental misinterpretation of the 2nd amendment the belief that the term \"bear arms\" refers only to guns. My reading of the 2nd amendment prevents congress from infringing the people's right to keep and own weapons - nuclear, biological or any means of offensive or defensive warfare.", 
   {
    "unicode_changes_made": true
   }, 
   99748, 
   null, 
   1130639100.0
  ], 
  [
   175794, 
   null, 
   "Bryan", 
   "Brian:\n \n Isn't a fundamental misinterpretation of the 2nd amendment the belief that the term \"bear arms\" refers only to guns. My reading of the 2nd amendment prevents congress from infringing the people's right to keep and own weapons - nuclear, biological or any means of offensive or defensive warfare.\n\n \n No, I don't agree with that reading of the 2nd. amendment. I accept that if taken in a literal context \"arms\" could mean anything from sticks to ICBMs, but in my experience only gun control supporters argue for what I believe to be such an unlimited literal interpretation of the RKBA. They do so for the purpose of making the straw man argument that SCOTUS should never declare the RKBA to be an individual right, because if it did so then it would have to declare the right to be unlimited and nothing would prevent the NRA bubba from celebrating his court victory by buying a tank or a nuke and terrorizing the neighborhood.\n \n The reality is far different in my experience with interpreting fundamental individual rights. No right is absolute. For example, the first amendment contains equally unqualified language, but restrictions abound with laws against libel, slander, child pornography, etc. Every right has to be structured within rational limits. My argument is simply to stop treating the second amendment like it is the red headed stepchild of the Bill of Rights. I ask that we stop inventing false interpretations to eliminate a right we don't agree with. I ask that it be recognized for what it was intended to protect-an individual citizen's RKBA. I ask that it receive nothing less that (nor more than) equal treatment for its fundamental liberty interest--that infringements on the right be subjected to the test of strict scrutiny.", 
   {
    "post_info": {
     "post_title": "No, I don't think the RKBA is unlimited"
    }, 
    "unicode_changes_made": true
   }, 
   175420, 
   null, 
   1130739840.0
  ], 
  [
   175796, 
   null, 
   "Howard Beale", 
   "So your position, despite the explicit words of the amendment (the right of the people to keep and bear arms, shall not be infringed), is that the Legislative, Executive and/or Judicial branches of government do have the right and power to infringe on the right to keep and bear arms spelled out in the amendment. Is that correct?", 
   {}, 
   175794, 
   null, 
   1130740260.0
  ], 
  [
   175886, 
   null, 
   "Bryan", 
   "So your position, despite the explicit words of the amendment (the right of the people to keep and bear arms, shall not be infringed), is that the Legislative, Executive and/or Judicial branches of government do have the right and power to infringe on the right to keep and bear arms spelled out in the amendment. Is that correct?\n\n \n Yes. \n \n Although I would not use the word \"right\" when referring to the government's ability to infringe upon the RKBA. In my opinion governments do not have rights, they have powers or authority. There is a very real difference in the distinction between \"rights\" and \"powers.\"\n \n For my reasoning behind my \"yes\" answer, see post #36 in this thread.", 
   {
    "post_info": {
     "post_title": "Yes I do believe that."
    }, 
    "unicode_changes_made": true
   }, 
   175796, 
   null, 
   1130780520.0
  ], 
  [
   184796, 
   null, 
   "skeptics2003", 
   "The posts on this site are extremely intelligent, and for the most part, very well-researched. However, it seems that sometimes they lose the forest for the trees. I think both sides of this argument have to concede that the 2nd Amendment was included in the Bill of Rights in order to allow the people of the US to defend themselves AGAINST their government, if necessary. The founding fathers may not have anticipated nuclear, biological, or chemical weapons, but their intention was cleary to provide for an armed citizenry that would be less likely to be oppressed by its government. All questions of which weapons, concealed or not, assault weapons or not, seem to be mute when considering the simplest, most elegant explanation.", 
   {
    "post_info": {
     "post_title": "Simplify"
    }
   }, 
   175886, 
   null, 
   1134425580.0
  ], 
  [
   184907, 
   null, 
   "GreenMtnBoy", 
   "But one must also remeber that the biggest issue of the constitution was not individual rights, but state's rights. I feel it was their intention to empower the states so as not to be intimidated or controlled by a federal army. This would of course be the \"Militia = National Guard\" arguement.\n \n Because many people have interpreted the 2nd amendment as an individual right, the states have lost their militas. The National Guard, while usually under state management, can be usurped by the federal government. What chance does any state have of seceding today?", 
   {}, 
   184796, 
   null, 
   1134460200.0
  ], 
  [
   185342, 
   null, 
   "hansberrym", 
   "\nBut one must also remeber that the biggest issue of the constitution was not individual rights, but state's rights. I feel it was their intention to empower the states so as not to be intimidated or controlled by a federal army. This would of course be the \"Militia = National Guard\" arguement.\n \n Because many people have interpreted the 2nd amendment as an individual right, the states have lost their militas. The National Guard, while usually under state management, can be usurped by the federal government. What chance does any state have of seceding today?\n\n \n \n \n The biggest issue in the Bill of Rights was individual rights. Since the Federal government under the Constitution could act directly on individuals (under the Articles it could not) a Bill of Rights was needed. \n \n From the start the militia has been subject to federal control. (see militia act of 1792). The National Guard (Dick Act early 1900s) only refers to a certain part of the militia that gets special training as regular military back-up. \n \n It simply does not follow that the cause of this supposed loss of control is due to many people having interpreted the 2nd amendment as protecting individual rights. The 2nd amendment was interpreted as an individual right from the start and the states were required from the start to maintain and train the militia according to the standards set by Congress, so it can hardly be said that an individual rights interpretation of the 2nd causes the states to lose their militia.\n \n To say the militia = National Guard is like saying 4 sided objects = squares.\n (squares are indeed 4 sided, but not all 4 sided objects are squares. By the same token not all militia are National Guard.)\n \n Furthermore, there is nothing whatever today that prevents the states from training all the militia, including those who are not members of the National Guard.\n \n \n Empower the states, or empower the people? \n \n \n From Federalist #46:\n \n \"The federal and State governments are in fact but different agents and trustees of the people, constituted with different powers, and designed for different purposes. The adversaries of the Constitution seem to have lost sight of the people altogether in their reasonings on this subject; and to have viewed these different establishments, not only as mutual rivals and enemies, but as uncontrolled by any common superior in their efforts to usurp the authorities of each other. These gentlemen must here be reminded of their error. They must be told that the ultimate authority, wherever the derivative may be found, resides in the people alone, and that it will not depend merely on the comparative ambition or address of the different governments, whether either, or which of them, will be able to enlarge its sphere of jurisdiction at the expense of the other. Truth, no less than decency, requires that the event in every case should be supposed to depend on the sentiments and sanction of their common constituents.\"\n \n \n and from Federalist #28:\n \n \n \"If the representatives of the people betray their constituents, there is then no resource left but in the exertion of that original right of self-defense which is paramount to all positive forms of government, and which against the usurpations of the national rulers, may be exerted with infinitely better prospect of success than against those of the rulers of an individual state. In a single state, if the persons intrusted with supreme power become usurpers, the different parcels, subdivisions, or districts of which it consists, having no distinct government in each, can take no regular measures for defense. The citizens must rush tumultuously to arms, without concert, without system, without resource; except in their courage and despair. The usurpers, clothed with the forms of legal authority, can too often crush the opposition in embryo. The smaller the extent of the territory, the more difficult will it be for the people to form a regular or systematic plan of opposition, and the more easy will it be to defeat their early efforts. Intelligence can be more speedily obtained of their preparations and movements, and the military force in the possession of the usurpers can be more rapidly directed against the part where the opposition has begun. In this situation there must be a peculiar coincidence of circumstances to insure success to the popular resistance. \"\n \n \"The obstacles to usurpation and the facilities of resistance increase with the increased extent of the state, provided the citizens understand their rights and are disposed to defend them. The natural strength of the people in a large community, in proportion to the artificial strength of the government, is greater than in a small, and of course more competent to a struggle with the attempts of the government to establish a tyranny. But in a confederacy the people, without exaggeration, may be said to be entirely the masters of their own fate. Power being almost always the rival of power, the general government will at all times stand ready to check the usurpations of the state governments, and these will have the same disposition towards the general government. The people, by throwing themselves into either scale, will infallibly make it preponderate. If their rights are invaded by either, they can make use of the other as the instrument of redress. How wise will it be in them by cherishing the union to preserve to themselves an advantage which can never be too highly prized! \"", 
   {
    "post_info": {
     "post_title": "Not so."
    }
   }, 
   184907, 
   null, 
   1134627420.0
  ], 
  [
   203027, 
   null, 
   "Galileo", 
   "The Anti-federalists did believe in a broad individual RKBA and we know that by simply reading the proposals that they put forth. No leaps of faith are required -though the same can not be said of the claim of the historian you mentioned earlier.\n\n Circular logic. That's only assuming that your interpretation of their words are correct. Do you think you can judge people more by their actions or their words?\n \n \n\n The War for Independence was as much a civil war as a war against a foreign power. Those who remained openly loyal to the crown would certainly be a threat, those who professed neutrality would be suspect. It seems plausible to me that would add to be something like 40% of the population, but the numbers are supplied by your source so it would be up to them to fact check them.\n \n But liberty and due process are broad individual rights, even if FDR/the Court temporarily lost sight of that in the course of dealing with an emergency.\n That is my point, we would not look at those specific measures (internment of persons of Japanese descent though they were not combatants and denial of liberty of large numbers of citizens w/o due process would also seem to go far beyond what would seem necessary) for evidence of the nature of those rights, because we know the duress under which those measures were taken.\n \n\n Okay so FDR and the Supreme Court were certainly not the best defenders of due process. I can see that. But neither were the Anti-Federalists of an individual right to bear arms if they were disarming everybody who refused to swear an oath of loyalty to the state. The inconsistency in your argument is that the words, but not the actions, of the antifederalists can tell us how they felt about the RKBA.", 
   {}, 
   156505, 
   null, 
   1142682780.0
  ], 
  [
   204102, 
   null, 
   "hansberrym", 
   "Okay so FDR and the Supreme Court were certainly not the best defenders of due process. I can see that. But neither were the Anti-Federalists of an individual right to bear arms if they were disarming everybody who refused to swear an oath of loyalty to the state. The inconsistency in your argument is that the words, but not the actions, of the antifederalists can tell us how they felt about the RKBA.\n\n \n \n FDR and the Supreme Court certainly believed that the right to due process, liberty, etc. to be individual rights. However, under the duress of a world war, they took actions that infringed those rights. Are you arguing that FDR and the Supreme Court did not hold those rigths to be individual in nature? \n \n \n The inconsistency in your argument is that you only look at actions taken under duress as evidence. The right to bear arms has been an individual right in PA for over 200 years and protection of that right has been the norm. The aberrant actions were enforcement of loyalty oathes, disarmament of those refusing, confiscation of their property, confinement w/o due process, etc.\n \n \n If actions speak louder than words, then surely the continuance of the right to bear arms long after ending loyalty oathes informs us as to which was more important in the long run.", 
   {}, 
   203027, 
   null, 
   1143351240.0
  ], 
  [
   204135, 
   null, 
   "hansberrym", 
   "Circular logic. That's only assuming that your interpretation of their words are correct. \n\n \n \n Here are their words from The Address and Reasons of Dissent\n Of the Minority of the Convention Of the State of Pennsylvania\n \n \"That the people have a right to bear arms for the defence of themselves and their own state, or the United States, or for the purpose of killing game, and no law shall be passed for disarming the people or any of them, unless for crimes committed, or real danger of public injury from individuals; and as standing armies in the time of peace are dangerous to liberty, they ought not to be kept up; and that the military shall be kept under strict subordination to and be governed by the civil powers\"\n \n \n Do you think those words can be interpreted as a collective right? Perhaps they meant a collective right to hunt? \n \n What does the phrase \"or any of them\" tell you? Answer: they were speaking of the people in the plural, not the singular, also note the people have (not has) a right to bear arms.\n \n When they wrote for \"crimes committed\" were they referring to crimes commited collectively? \n \n When they wrote \"or real public danger from individuals\" , do you think they were referring to individuals?\n \n \n It is not circular reasoning to conclude that the anti-federalists proposed an amendment to protect an individual right to bear arms. The words of their proposed amendment are not ambiguous. In fact it takes a great leap of faith to ignore the written evidence and to suppose otherwise.\n \n \n \n \nDo you think you can judge people more by their actions or their words?\n\n \n I think actions over the long run say much more than actions taken as temporary measures in times of extreme duress. \n \n Furthermore if one were to take the temporary disarmament of those refusing to take a loyalty oath as proof positive that the right to bear arms is not an individual right, then what to make of the denial of other rights which are commonly thought to be individual in nature? \n \n Are we to conclude that due process, liberty, free speech, are not individual rights because they were also denied? Of course not.", 
   {}, 
   203027, 
   null, 
   1143374940.0
  ], 
  [
   204293, 
   null, 
   "Galileo", 
   "You make some good points. I think that the Supreme Court allowed the violations of rights in WWII because they thought it served a compelling government interest. So their actions were contrary to the their understanding of rights. In contrast, the Test Acts may have been passed under extreme circumstances, but I don't think this law was in conflict with the Anti-Federalist understanding of rights. You talk about the people. I think the word \"people\" is always used in the plural. A historian, Saul Cornell, comments on how the words \"people\" and \"state\" were understood by the Anti-Federalists-\n \n \"For Anti-Federalists, appeals to the people that bypassed the existing structures of government, particularly the states, were viewed as a rhetorical ploy. The American people did not exist as an abstraction. The will of the people could only be organized though corporate entities such as towns and states. The effort to counterpose states' rights and individual rights is one of the most serious anachronisms in recent discussions of Anti-Federalism by supporters of the Standard Model.\" \n http://www.potowmack.org/scornell.html#text38\n \n So maybe from the Anti-Federalist point of view, \"people\" and \"state\" were two ways of saying the same thing. The will of the people was expressed through the state. That's what Cornell seems to be saying. And weren't Anti-Federalists like Patrick Henry in favor of states' rights? Isn't that why they opposed the Constitution because they thought it took too much power away from the states?", 
   {
    "unicode_changes_made": true
   }, 
   204135, 
   null, 
   1143486960.0
  ], 
  [
   204627, 
   null, 
   "hansberrym", 
   "You make some good points. I think that the Supreme Court allowed the violations of rights in WWII because they thought it served a compelling government interest. So their actions were contrary to the their understanding of rights. In contrast, the Test Acts may have been passed under extreme circumstances, but I don't think this law was in conflict with the Anti-Federalist understanding of rights. You talk about the people. I think the word \"people\" is always used in the plural. A historian, Saul Cornell, comments on how the words \"people\" and \"state\" were understood by the Anti-Federalists-\n \n \"For Anti-Federalists, appeals to the people that bypassed the existing structures of government, particularly the states, were viewed as a rhetorical ploy. The American people did not exist as an abstraction. The will of the people could only be organized though corporate entities such as towns and states. The effort to counterpose states' rights and individual rights is one of the most serious anachronisms in recent discussions of Anti-Federalism by supporters of the Standard Model.\" \n http://www.potowmack.org/scornell.html#text38\n \n So maybe from the Anti-Federalist point of view, \"people\" and \"state\" were two ways of saying the same thing. The will of the people was expressed through the state. That's what Cornell seems to be saying. And weren't Anti-Federalists like Patrick Henry in favor of states' rights? Isn't that why they opposed the Constitution because they thought it took too much power away from the states?\n\n \n \n \n Serious anachronism? Hardly -the anti-federalists counterposed individual rights versus state power in the same list of proposed amendements from the Address of the PA Minority. Note that in addition to the individual right to bear arms, they proposed another amendment:\n \n From The Address and Reasons of Dissent of the Minority of the Convention of the State of Pennsylvania to Their Constituents:\n \"11) That the power of organizing, arming and disciplining the militia (the manner of disciplining the militia to be prescribed by Congress) remain with the individual states, and that Congress shall not have authority to call or march any of the militia out of their own state, without the consent of such state, and for such length of time only as such state shall agree.\" \n \n Thus the PA anti-federalists demonstrated their understanding of the difference between the rights of the people as individuals and the rights/powers of the states. If #7 is really a state rights proposal as Cornell posits, what purpose does #11 serve? \n \n Cornell's arguments are self defeating in other areas as well. He dismisses individual rights as mere ploys in the eyes of the Anti-federalists. Yet later he reminds us that the same prominent citizens who wrote the PA costitution of 1776 were later to become the anti-federalists. But of course the PA constitution of 1776 was also loaded with language assuring that the individual has natural, inherent, unalienable rights.\n \n \n Pennsylvania Constitution of 1776, Declaration of Rights:\n I. That all men are born equally free and independent, and have certain natural, inherent and inalienable rights, amongst which are, the enjoying and defending life and liberty, acquiring, possessing and protecting property, and pursuing and obtaining happiness and safety.\n \n X. That the people have a right to hold themselves, their houses, papers, and possessions free from search and seizure, and therefore warrants without oaths or affirmations first made, affording a sufficient foundation for them, and whereby any officer or messenger may be commanded or required to search suspected places, or to seize any person or persons, his or their property, not particularly described, are contrary to that right, and ought not to be granted.\n \n XII. That the people have a right to freedom of speech, and of writing, and publishing their sentiments; therefore the freedom of the press ought not to be restrained.\n \n \n Is the right to freedom of speech a collective right? Note use of \"the people\" in X and XII -this undercuts his argument regarding \"the people\" and \"the state\". \n \n While Cornell repeatedly writes that proponents of the standard model are misreading history he offers no evidence to that effect. He offers no evidence of usage of the words \"the right of the people to bear arms\" or similar language in reference to state or collective power as opposed to an individual right. \n \n He takes great significance of the fact that the PA Minority proposal would allow the disarming of persons posing a real danger to the public -without considering that persons posing a real danger to the public can be deprived of other things as well. People shouting fire in a theater or otherwise inciting riot will be arrested and prevented from shouting, but no one seriously considers that a violation of the right of free speech. Nor would anyone make the claim that the government's authority to prevent someone from (falsely) shouting fire in a theater is evidence of any sort that the right of free speech is not an individual right. \n \n In like manner Cornell holds the PA test oath as significant in determing the individual vs, collective nature of the right to bear arms without considering that other rights were, and still are, often denied to persons in times of war and yet we do not take that as evidence that liberty, due process, free speech, etc. are actually collective rights.\n \n \n \n From Cornell:\n \"a number of supporters of the Standard Model have also drawn an analogy between the structural roles played by the press and by an armed population in checking government tyranny. While this comparison is instructive, it rests on an historically questionable reading of the way the press functioned in post- revolutionary America. 34 While leading Pennsylvania Constitutionalists certainly believed in freedom of the press, these same individuals also accepted the notion of seditious libel. Support for these two seemingly contradictory propositions did not mean that Constitutionalists were hypocrites. The appropriate means to both guard liberty and restrain licentiousness was to have the jury empowered to determine both the facts and the law on questions of libel. The conception of liberty that Constitutionalists embraced looked to the jury to protect liberty and to enforce communal norms. Because of this conception of liberty, Pennsylvania's constitution granted enormous latitude to the legislature to enact laws to promote the public good. Thus, for example, the authors of the Pennsylvania constitution showed no reservations about passing legislation banning the theater in Philadelphia as a threat to public virtue. Such a measure was perfectly compatible with constitutional ideas behind the Test Acts. Closing the theater or excluding large numbers of the population from claiming a right to gun ownership sprang from the same republican conception of liberty. 35 Once again, the notion that the Pennsylvania state constitution protected a modern liberal rights based vision of constitutionalism is simply anachronistic.\"\n \n Cornell knows some facts but misses the point. In early america the balance between individual rights and state authority was certainly different than it is today. Today we give more weight to individual rights and less to community power to pass laws. I do not disagree with him on that point, but he misses that it is exactly this fact that makes his argument -that the Test Oathes are significant evidence that the right of the people to bear arms is a state right and not an individual right -so weak. When we add this fact to the the fact that the test oathes and subsequent disarming of refusers were war measures, they are not at all at odds with the right to bear arms being an individual right. \n \n Cornwell himself points out how theaters were shut down on basis of upholding public morals, but this only highlights that in late 18th century America, individual rights were less important vis-a-vis state/public authority and more likely to be curtailed. It does not indicate that free speech was a state/collective right. \n \n Thus the temporary disarming of certain persons is NOT at all at odds with the right to bear arms being an individual right on par with the freedom of speech, press, etc. Cornell is himself guilty of viewing rights through today's eyes. He argues that since the anti-federalist supported the disarmament of large numbers of people, the anti-federalist would not have thought of the right to bear arms as an individual right. While that may have a ring of truth to someone only used to looking at individual rights from a modern liberal/libertarian viewpoint in which individual rights are nearly sacrosanct, it does not hold water when the times (emergency war measures, and an 18th century view of individual rights vs. public good) are factored in.\n \n \n \n Patrick Henry\n One can think that the states ought to have a greater share of the power in relation to the federal government AND consider the right to bear arms and individual right. The Address of The PA Minority takes both positions, and a reading of history indicates that Henry did as well.\n \n \n \n Cornell at his worst:\n \"Only by understanding the nature of Pennsylvania AntiFederalism can the claim of John Smilie in the Pennsylvania ratifying Convention be properly contextualized. Smilie argued that \"[w]hen a select militia is formed; the people in general may be disarmed.\" 46 What did Smilie mean? If lifted out of context, Smilie's words would seem to provide strong proof of the claims of Standard Modelers. Yet, Smile, one of the authors of An Old Whig and a strong supporter of his state's Test Acts, clearly accepted that serious restraints could be placed on the right to bear arms without undermining the idea of a liberty. Although he feared that federal control of the militia might disarm citizens, he showed no similar concern about his own state government- which had done precisely that with its Test Act. Smilie shared with many Anti-Federalists considerable faith in the ability of state government to regulate gun ownership. The state would decide who among the people demonstrated sufficient virtue to be trusted with the important task of serving in the militia.\n \n If lifted out of context? If? That's pure Chutzpah! He chops the quote from the context himself and then proceeds to chide others for supposedly doing same.\n \n \n \"Although he feared that federal control of the militia might disarm citizens, he showed no similar concern about his own state government\" -But of course his own state already had a Bill of Rights protecting the right to bear arms. Furthermore proposal #7 of the PA Minority Address was concerned with preventing the Federal goverment from disarming any citizen without cause (crime committed or real danger...) -that proviso is the thing left out in Cornell's above statement. The Antifederlists concerns were the same with their PA state government, they wanted the individual right to bear arms protected and would support disarming people only when there was a real danger of public injury. Cornell ignores the fact that the Test Oathes were only temporary measures and that in PA upholding the of right of ordinary citizens to bear arms has been the norm.", 
   {
    "unicode_changes_made": true
   }, 
   204293, 
   null, 
   1143711480.0
  ], 
  [
   204802, 
   null, 
   "Galileo", 
   "Serious anachronism? Hardly -the anti-federalists counterposed individual rights versus state power in the same list of proposed amendements from the Address of the PA Minority. Note that in addition to the individual right to bear arms, they proposed another amendment:\n \n From The Address and Reasons of Dissent of the Minority of the Convention of the State of Pennsylvania to Their Constituents:\n \"11) That the power of organizing, arming and disciplining the militia (the manner of disciplining the militia to be prescribed by Congress) remain with the individual states, and that Congress shall not have authority to call or march any of the militia out of their own state, without the consent of such state, and for such length of time only as such state shall agree.\" \n \n Thus the PA anti-federalists demonstrated their understanding of the difference between the rights of the people as individuals and the rights/powers of the states. If #7 is really a state rights proposal as Cornell posits, what purpose does #11 serve?\n\n How do you reach this conclusion? The passage you quote from above looks like it's talking about the division between state and federal control and the issue of individuals rights doesn't appear to be addressed in that passage. \n \n \n\n Cornell's arguments are self defeating in other areas as well. He dismisses individual rights as mere ploys in the eyes of the Anti-federalists. Yet later he reminds us that the same prominent citizens who wrote the PA costitution of 1776 were later to become the anti-federalists. But of course the PA constitution of 1776 was also loaded with language assuring that the individual has natural, inherent, unalienable rights.\n \n Pennsylvania Constitution of 1776, Declaration of Rights:\n I. That all men are born equally free and independent, and have certain natural, inherent and inalienable rights, amongst which are, the enjoying and defending life and liberty, acquiring, possessing and protecting property, and pursuing and obtaining happiness and safety.\n \n X. That the people have a right to hold themselves, their houses, papers, and possessions free from search and seizure, and therefore warrants without oaths or affirmations first made, affording a sufficient foundation for them, and whereby any officer or messenger may be commanded or required to search suspected places, or to seize any person or persons, his or their property, not particularly described, are contrary to that right, and ought not to be granted.\n \n XII. That the people have a right to freedom of speech, and of writing, and publishing their sentiments; therefore the freedom of the press ought not to be restrained.\n \n \n Is the right to freedom of speech a collective right? Note use of \"the people\" in X and XII -this undercuts his argument regarding \"the people\" and \"the state\".\n\n How does it do that? He's saying that counterposing (set in contrast to) the state and the people is anachronistic.\n He's saying that because the Anti-Federalists thought that there was no conflict between the people and the state.\n Depending on the context, I think there are times when \"the people\" can be more closely identified with the state than at other times. The 55 delegates that attended the Constitutional Convention referred to themselves as \"the people\" in the preamble to the Constitution. They probably thought they were representative of the interests of the people just as the state of Pennsylvania thought it was representative of the people in Pennsylvania. I notice that in modern day courtroom language the prosecution will often make statements like, \"Your Honor, the people ask for....\". Prosecutors are employees of the state and are thus equating the state with the people. Like Cornell points out, \"the people\" has not always had one static mutually agreed on meaning. \n \n \n\n While Cornell repeatedly writes that proponents of the standard model are misreading history he offers no evidence to that effect. He offers no evidence of usage of the words \"the right of the people to bear arms\" or similar language in reference to state or collective power as opposed to an individual right. \n \n He takes great significance of the fact that the PA Minority proposal would allow the disarming of persons posing a real danger to the public -without considering that persons posing a real danger to the public can be deprived of other things as well. \n \n People shouting fire in a theater or otherwise inciting riot will be arrested and prevented from shouting, but no one seriously considers that a violation of the right of free speech. Nor would anyone make the claim that the government's authority to prevent someone from (falsely) shouting fire in a theater is evidence of any sort that the right of free speech is not an individual right.\n\n But that seems to be a very narrow exception in the case of free speech. He points out how people who posed a real danger to the public could be interpreted quite broadly according to the political philosophy of the Anti Federalists. I don't think these two examples are comparable. \n \n \n\n In like manner Cornell holds the PA test oath as significant in determing the individual vs, collective nature of the right to bear arms without considering that other rights were, and still are, often denied to persons in times of war and yet we do not take that as evidence that liberty, due process, free speech, etc. are actually collective rights.\n\n It continued for several years after the end of the war and was not limited to disarming loyalists. And he points out Test Acts were not in conflict with how the Anti Federalists understood the right to bear arms. In contrast, the violations of rights during war in the example you give are in conflict with how we understand rights. \n \n \n\n Cornell knows some facts but misses the point. In early america the balance between individual rights and state authority was certainly different than it is today. Today we give more weight to individual rights and less to community power to pass laws. I do not disagree with him on that point, but he misses that it is exactly this fact that makes his argument -that the Test Oathes are significant evidence that the right of the people to bear arms is a state right and not an individual right -so weak. When we add this fact to the the fact that the test oathes and subsequent disarming of refusers were war measures, they are not at all at odds with the right to bear arms being an individual right. \n \n Cornwell himself points out how theaters were shut down on basis of upholding public morals, but this only highlights that in late 18th century America, individual rights were less important vis-a-vis state/public authority and more likely to be curtailed. It does not indicate that free speech was a state/collective right. \n \n Thus the temporary disarming of certain persons is NOT at all at odds with the right to bear arms being an individual right on par with the freedom of speech, press, etc. Cornell is himself guilty of viewing rights through today's eyes. He argues that since the anti-federalist supported the disarmament of large numbers of people, the anti-federalist would not have thought of the right to bear arms as an individual right. While that may have a ring of truth to someone only used to looking at individual rights from a modern liberal/libertarian viewpoint in which individual rights are nearly sacrosanct, it does not hold water when the times (emergency war measures, and an 18th century view of individual rights vs. public good) are factored in.\n \n\n You accuse him of \"guilty of viewing rights through today's eyes\" because he defines an individual right as people do today. Okay. But he is just using the term as it is commonly understood in the debate that surrounds the second amendment. We need to use terms consistently or else it gets confusing. \n \n \n \n\n Cornell at his worst:\n \"Only by understanding the nature of Pennsylvania AntiFederalism can the claim of John Smilie in the Pennsylvania ratifying Convention be properly contextualized. Smilie argued that \"[w]hen a select militia is formed; the people in general may be disarmed.\" 46 What did Smilie mean? If lifted out of context, Smilie's words would seem to provide strong proof of the claims of Standard Modelers. Yet, Smile, one of the authors of An Old Whig and a strong supporter of his state's Test Acts, clearly accepted that serious restraints could be placed on the right to bear arms without undermining the idea of a liberty. Although he feared that federal control of the militia might disarm citizens, he showed no similar concern about his own state government- which had done precisely that with its Test Act. Smilie shared with many Anti-Federalists considerable faith in the ability of state government to regulate gun ownership. The state would decide who among the people demonstrated sufficient virtue to be trusted with the important task of serving in the militia.\n \n If lifted out of context? If? That's pure Chutzpah! He chops the quote from the context himself and then proceeds to chide others for supposedly doing same.\n\n It seems he was just showing how others quote it out of context. \n \n \n\n \"Although he feared that federal control of the militia might disarm citizens, he showed no similar concern about his own state government\" -But of course his own state already had a Bill of Rights protecting the right to bear arms. Furthermore proposal #7 of the PA Minority Address was concerned with preventing the Federal goverment from disarming any citizen without cause (crime committed or real danger...) -that proviso is the thing left out in Cornell's above statement. The Antifederlists concerns were the same with their PA state government, they wanted the individual right to bear arms protected and would support disarming people only when there was a real danger of public injury. Cornell ignores the fact that the Test Oathes were only temporary measures and that in PA upholding the of right of ordinary citizens to bear arms has been the norm.\n\n Temporary or not, I think Cornell demonstrates that this laws was not in conflict with the Pennsylvania right to bear arms and the general political philosophy of the Anti Federalists about rights and thus can tell us about how they viewed the right to bear arms.", 
   {
    "unicode_changes_made": true
   }, 
   204627, 
   null, 
   1143824400.0
  ], 
  [
   204959, 
   null, 
   "hansberrym", 
   "How do you reach this conclusion? The passage you quote from above looks like it's talking about the division between state and federal control and the issue of individuals rights doesn't appear to be addressed in that passage. \n\n \n Yes indeed, proposal #11 is just that -in contrast to proposal #7 which just as clearly deals with the people as individuals. Cornell insists that #7 is really about the state, rather than individuals. But if that were true what purpose would #11 serve? (it would be redundant) And why would there be unambiguous references to individuals (\"or any of them\") in #7.\n \n \n \n \n\n How does it do that? He's saying that counterposing (set in contrast to) the state and the people is anachronistic.\n He's saying that because the Anti-Federalists thought that there was no conflict between the people and the state.\n Depending on the context, I think there are times when \"the people\" can be more closely identified with the state than at other times. The 55 delegates that attended the Constitutional Convention referred to themselves as \"the people\" in the preamble to the Constitution. They probably thought they were representative of the interests of the people just as the state of Pennsylvania thought it was representative of the people in Pennsylvania. I notice that in modern day courtroom language the prosecution will often make statements like, \"Your Honor, the people ask for....\". Prosecutors are employees of the state and are thus equating the state with the people. Like Cornell points out, \"the people\" has not always had one static mutually agreed on meaning. \n\n \n \n To answer your question -YES!, there are times when the people can refer to the collective and there are times when the people refers to individuals; and YES one can tell from the context. \n \n \n \n \n\n But that seems to be a very narrow exception in the case of free speech. He points out how people who posed a real danger to the public could be interpreted quite broadly according to the political philosophy of the Anti Federalists. I don't think these two examples are comparable. \n\n \n Note that Cornell also points out that the theater in Philadelpia was shut down at the time on the grounds that it was adversely affecting morals. Further he mentions support for laws on seditious libel, so the exceptions for free speech (speech that could be penalized by law) were actually quite wide.\n That community standards could define the limits of the freedom of the press does not make that individual right into a state/collective right. \n \n \n \n \n\n It continued for several years after the end of the war and was not limited to disarming loyalists. And he points out Test Acts were not in conflict with how the Anti Federalists understood the right to bear arms. In contrast, the violations of rights during war in the example you give are in conflict with how we understand rights. \n\n \n The danger did not cease with the signing of the treaty. This is another attempt by Cornell to use popular knowledge to make an argument that simply doesn't hold water. While most people who remember their American history would easily recall that the war ended with the treaty of Paris in 1783, they would not readily remember that the nation was not at ease in the years immediately following. There was the issue of debt, a weak national government, the question of the western territories with disputes among the states and still simmering animosity between US and Britain(trade issues, forcing of US citizens into service in british navy, etc) You might also recall that the Reconstruction period that followed the Civil War lasted more than a decade and the emergency measures undertaken lasted long after that war's official end at Appomatox. \n \n First he would have to demonstrate how Anti-federalists felt about the right to bear arms to be able to demonstrate that there was no conflict. However in the last paragraphs he shoots himself in the foot yet again. According to Cornell there was widespread difference in how anti-federalists in PA viewed the right to bear arms.\n \n Second, as he points out himself in the case of free speech -individual rights were often much more subject community standards than they are today. \n \n Since all of these are true:\n 1) Someone who would have held individual rights sacrosant in the 1780's might still support the Test Oathes owing to the gravity of the situation, just as the Supreme Curt did regarding due process and other rights during WWII, and as the Union did during and after the Civil war with suspected sympathizers with the Southern cause. \n 2) Someone who held individual rights as having some core that could not be violated but never-the-less thought that community standards ought to determine the outlines (the view of individual rights that pervaded until the 20th century) might support the Test Oathes owing to the gravity of the situation.\n \n 3) Someone who held the right to bear arms to be a purely state right could support the test oathes owing to the gravity of the situation, but might also support them under less dangerous circumstances. (However the rarity of Test Oathes leans against this third choice. Since they are not the norm, one is justified in concluding that #3 is the least likely to have been the case. Moreover instances of a disregard of individual rights during time of war and for a period after is practically the norm)\n \n Cornell's argument is extremely weak. It simply doesn't follow that since the Test Oathes were supported, the right to bear arms must have been thought of as a state/community right as opposed to an individual right. \n \n \n \n\n You accuse him of \"guilty of viewing rights through today's eyes\" because he defines an individual right as people do today. Okay. But he is just using the term as it is commonly understood in the debate that surrounds the second amendment. We need to use terms consistently or else it gets confusing. \n\n \n \n My beef is that he accuses others of anachronistic and out of context thinking, but relies on just that to give his argument a (false) ring of truth. \n \n \n \n\n It seems he was just showing how others quote it out of context. \n\n \n It would seem obvious that the way to do that is to show the quote IN context.\n \n \n \n\n Temporary or not, I think Cornell demonstrates that this laws was not in conflict with the Pennsylvania right to bear arms and the general political philosophy of the Anti Federalists about rights and thus can tell us about how they viewed the right to bear arms. \n\n \n The first statement is a Non-sequitor. What Cornell does not do, and can not do, is demonstrate that other interpretations would be inconsistent with the test oathes. \n Furthermore if the right to bear arms later proposed by the PA anti-federalists in the Address of the PA Minority is purely a collective right he has to explain away the inconsistencies such as the right to hunt, \"or any of them\", and the existence of a second proposal (#11)in the same address which we agree is concerned purely with state power; all of which ARE consistent with an individual rights interpretation of proposal #7, but inconsistent with his state=community view. \n \n \n However the temporary existence of the test oathes versus the long standing protection of the indivdual right to bear arms ought to tell us some thing.\n \n \n According to Cornell there was no consensus on how the PA anti-federlists thought about the right to bear arms, so how can he demostrate that the test oathes were not in conflict with same. (see the last 2 paragraphs of the article you posted earlier). \n \n Those last two paragraphs, aside from undermining his own arguments, demonstrate the abysmal level of Cornell's reasoning.\n \n Cornell concludes that the language of the State and Federal constitution provide the state with a means to crush resistance. \n -However the State and federal governments did not need to proclaim such means in the Bills of rights, that power is already listed in other section of the state and federal constitutions under legislative powers. \n \n - Nor does it make sense to put a purely state power in a state bill of rights. The function of the state Bills of rights was to reserve rights to the people, they are not a means of giving further power to the government.\n \n -While the same people who later became the Anti-federalists may have written the PA const. of 1776, the Anti-federalists did not write the US Constitution or Bill of Rights. \n \n -Furthermore Cornell finds it highly unlikely that the Federalists and Anti-federalists would have agreed agreed on the meaning -this is really self defeating if you follow his argument from the start. He said early on that for the anti-federalists \"appeals to the people that bypassed the existing structures of government, particularly the states, were viewed as a rhetorical ploy\". Keep in mind that the Federalists did make the argument repeatedly regarding citizens being armed to be able to resist tyranny. \n So if Cornell is to believed, the anti-federalists (the minority position) saw the right to bear arms as a state right, but the federalists who did not agree appealed to the people directly(apart from the state governments) -who wins this argument, the minority or the majority?", 
   {}, 
   204802, 
   null, 
   1143889200.0
  ], 
  [
   217014, 
   null, 
   "DrNo", 
   "A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\n \n This is all really quite simple. The right of the people to keep and bear arms is in no way related to or dependant on a well regulated militia. These are two seperate thoughts. Perhaps it would make more sense if it read:\n \n A well regulated militia is necessary to the security of a free state, and the right of the people to keep and bear arms shall not be infringed.\n \n Here is a fantastic analysis...\n \n http://www.firearmsandliberty.com/unabridged.2nd.html", 
   {
    "post_info": {
     "post_title": "It's really quite simple..."
    }
   }, 
   99748, 
   null, 
   1150345560.0
  ], 
  [
   220245, 
   null, 
   "Galileo", 
   "I found a review of a book by Saul Cornell about the second amendment that has recently been published:\n \n \"Americans are deeply divided over the Second Amendment. Some passionately assert that the Amendment protects an individual's right to own guns. Others, that it does no more than protect the right of states to maintain militias. Now, in the first and only comprehensive history of this bitter controversy, Saul Cornell proves conclusively that both sides are wrong. Cornell, a leading constitutional historian, shows that the Founders understood the right to bear arms as neither an individual nor a collective right, but as a civic right--an obligation citizens owed to the state to arm themselves so that they could participate in a well regulated militia.....\"\n http://www.amazon.com/gp/product/0195147863/ref=sr_11_1/102-9659684-4442504?ie=UTF8\n \n So I think in the above article that I quoted from Cornell is not trying to argue in favor of the of the collective interpretation, but rather to argue against the individualist interpretation. He rejects the individual/collective dichotomy that the modern day debate about the second amendment is based on:\n \n \"Framing the meaning of the Second Amendment in terms of such a simple dichotomy fits well with the politics of the modern gun control debate. The individual rights view serves the interests of gun rights advocates, while the collective rights view supports the goals of gun control. While this neat dichotomy furthers the interests of those involved in modern political debates about gun policy, it is not particularly useful for understanding the eighteenth-century world in which the Second Amendment was drafted and adopted.\"\n http://www.historycooperative.org/journals/lhr/22.1/comment_cornell.html", 
   {}, 
   217014, 
   null, 
   1151740980.0
  ], 
  [
   220368, 
   null, 
   "hansberrym", 
   " In 1999 Saul Cornell wrote:\n A new consensus on the meaning of the Second Amendment appears to be crystallizing among constitutional scholars. 1 This new model asserts that the Second Amendment protects both an individual and a collective right of the people to bear arms. Proponents of this interpretation also argue that Amendment is part of a checking function designed to enable the people to resist government tyranny, by arms if necessary. 2 Borrowing conceptual language from the physical sciences, supporters of this new interpretation contend that scholarship on the Second Amendment has produced a paradigm comparable to that employed by physicists to describe recent research: the new interpretation is dubbed the \"Standard Model.\" \n \n however, in his Spring 2004 Law and History Review he wrote:\n Contemporary debate over this provision of the Bill of Rights has been cast in terms of a simple dichotomy: either the Second Amendment protects an expansive individual right similar in nature to freedom of the press or it protects a narrow right of the states to maintain a well-regulated militia.1 Partisans of the individual rights view argue that the Second Amendment was designed to affirm a basic individual right to own firearms for hunting, recreation, and personal protection. The other view of the amendment, often described as the collective rights view, argues that the amendment was about the allocation of military power in the federal system. According to this view, the Second Amendment was a modest concession to moderate Antifederalists who feared the power of the new federal government. By affirming the right of the people to bear arms as part of a well-regulated militia, Federalists assuaged lingering Antifederalist qualms about the future of the state \n \n \n In addition to the lead-off strawman argument about a \"contemporary dichotomy\" that simply does not exist, Cornell heaps on his usual misdirection:\n \n As several recent critics of the individual rights model of the Second Amendment have noted, the subject of a private right to own firearms outside of the context of the militia was rarely discussed during the ratification debates, while the need to protect the militia from the threat posed by the Federal government received extensive commentary\n \n \n One is left to wonder just how much commentary from the ratification debates is there about \"collective right\" of the people to keep and bear arms as in Silveira and other recent court decisions. Answer:There is none! Why doesn't the Cornell inform his readers of the whole picture? \n \n Cornell's silence regarding the imbecility of the modern collective rights theory is in stark contrast to his rantings against the \"standard model\" (which he apparently was well acquainted with in 1999, but put out of mind in 2004 in order to set up the strawman \"dichotomy\"). Case in point:\n \n Konig's model for the Second Amendment also helps illuminate the thinking of important nineteenth-century commentators on the Second Amendment such as Joseph Story. Individual rights theorists such as David Kopel have argued that, since Story does not fit perfectly into the modern collective rights theory, he must be counted among supporters of the modern individual rights view of the amendment. Kopel's framework is a textbook illustration of the historical \"fallacy of false dichotomous question.\"14 Story wrote about arms-bearing as a civic right, not an individual right. \n \n One of the ordinary modes, by which tyrants accomplish their purposes without resistance, is, by disarming the people, and making it an offence to keep arms, and by substituting a regular army in the stead of a resort to the militia. The friends of a free government cannot be too watchful, to overcome the dangerous tendency of the public mind to sacrifice, for the sake of mere private convenience, this powerful check upon the designs of ambitious men.\n \n \n When Story relates that tyrants often make it an offense to keep arms (note please that Story writes KEEP arms, a point lost on Cornell), does Cornell believe that Story refers to an offense by the people collectively? Or by those individuals who keep arms? Do tyrants punish the people ONLY in some collective sense for maintaining a militia, or do they punish individuals who keep (meaning personal ownership) arms? Hint: game laws.\n \n Cornell's charge that Kopel presents a false Dichotomy is unbridled chutzpah considering Cornell began this tale by concocting a non-existent dichotomy of his own. Moreover, the modern collective rights theory as espoused in Silveira can not be shoe-horned into Story or any of the other early commentors, or Court decisions, or as Cornell begrudgingly points out, the actual language of the Second Amendment. The modern collective rights theory claims exclusivity in that it holds that individuals have no right to keep and bear arms and that the right resides exclusively with the collective, so it is not Kopel or other Standard Model proponents who are setting up a dichotomy. \n \n In fact, the proponents of the Standard Model have tried to bring together evidence pointing to individual right and evidence pointing to collective security into one theory on the second amendment - it is not purely individual, nor purely collective in nature. While there are many shades in the various Individual rights theories, some leaning more towards the Individual (as in Bliss, an early court decision), others leaning towards an individual right with underlying collective purpose that can be limited for public safety (as in Aymette vs Tenn.), some scholars have tried to develop a theory that fits all the evidence available and thus advance the so-called Standard Model of a broad individual right to keep and bear arms for defense of self and community. This theory takes into account the various statements from the ratification debates regarding both individual rights and collective security. \n \n Collective rights advocates on the other hand simply ignore historical facts that point to an individual right, ignore that there is no such direct support for their narrow stance (supposed purely collective character of the right), but instead rely on the absurdly weak argument that their position is not at odds with SOME of the arguments made during the ratification debates. \n \n Lastly, it is the collective rights advocates as in Silveira, who insist on exclusivity. It is they who insist that the Second Amendment is ALL collective and not in the least individual in nature, despite the language of the amendment and the various evidence of at least some individual right to keep and bear arms. And though the advocates of the Standard Model try to incorporate all of the evidence into a cohesive theory, Cornell saves all of his venom for them -why? \n \n Kopel's observation that Story's commentaries place the Collective Rights theory in doubt is not the result of a false dichotomy on Kopel's part. Rather, it is the collective rights advocates insistence that there is no individual component to the right to keep and bear arms that is at odds with Story. Proponents of the Standard Model take into account the individual right suggested by Story AND the aim of collective security suggested by Story rather than insist that it is an either/or individual/collective proposition.\n \n \n \n \n http://www.healylaw.com/cases/aymette.htm\n \n http://www.constitution.org/2ll/court/sta/bliss_v_ky.htm", 
   {
    "post_info": {
     "post_title": "Saul Cornell KOs a strawman"
    }
   }, 
   220245, 
   null, 
   1151824020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The misinterpretations of the 2nd amendment", 
  "url": "http://www.4forums.com/political/gun-control-debates/4553-misinterpretations-2nd-amendment.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 4553, 
  "discussion_files": [
   [
    "22697.html", 
    "http://www.4forums.com/political/gun-control-debates/4553-misinterpretations-2nd-amendment-print.html"
   ], 
   [
    "22698.html", 
    "http://www.4forums.com/political/gun-control-debates/4553-misinterpretations-2nd-amendment-6-print.html"
   ], 
   [
    "22699.html", 
    "http://www.4forums.com/political/gun-control-debates/4553-misinterpretations-2nd-amendment-4-print.html"
   ], 
   [
    "22700.html", 
    "http://www.4forums.com/political/gun-control-debates/4553-misinterpretations-2nd-amendment-5-print.html"
   ], 
   [
    "22701.html", 
    "http://www.4forums.com/political/gun-control-debates/4553-misinterpretations-2nd-amendment-3-print.html"
   ], 
   [
    "22702.html", 
    "http://www.4forums.com/political/gun-control-debates/4553-misinterpretations-2nd-amendment-2-print.html"
   ]
  ], 
  "identifier": 4553
 }
]