[
 [
  [
   98824, 
   null, 
   "gamehuis", 
   "http://www.cnn.com/2005/HEALTH/diet.fitness/03/16/obesity.longevity.ap/index.html\n \n Would be kinda funny if being fat actually helps the nation.", 
   {
    "post_info": {
     "post_title": "Fat Americans will save Social Security?"
    }
   }, 
   null, 
   null, 
   1111020840.0
  ], 
  [
   98848, 
   null, 
   "Duo_Maxwell", 
   "2-5 years? \n \n I don't think so buddy. Smoking would result in higher losses. \n \n Nothing but pragmatic, unpopular fisical decisions will save social security.", 
   {}, 
   98824, 
   null, 
   1111027200.0
  ], 
  [
   98850, 
   null, 
   "jitobear", 
   "I didn't read the link, but you know, fat people are harder to kidnap. :p", 
   {}, 
   98848, 
   null, 
   1111027500.0
  ], 
  [
   98851, 
   null, 
   "Duo_Maxwell", 
   "I didn't read the link, but you know, fat people are harder to kidnap. :p\n\n \n lol. Takes more ethene.", 
   {}, 
   98850, 
   null, 
   1111027560.0
  ], 
  [
   104300, 
   null, 
   "zelma", 
   "I don't think that article is very believable. Obesity leading to diabetes, for one thing, the medical care a diabetic needs can cost a small fortune before the person succumbs to complications of diabetes, they don't die due to obesity. The cost of all disease caused by alcoholism, smoking, obesity could be eliminated if people just didn't do these things.", 
   {}, 
   98851, 
   null, 
   1112682120.0
  ], 
  [
   109135, 
   null, 
   "Kuato", 
   "LOL! emoticon_xgood for the article. People are killing themselves by smoking and overeating, and while I agree with Duo that it won't save SS by itself, it might just help.\n \n On the SS front, if congress hadn't taken money out in the 50's and 60's, SS would likely be solvent. But the money removed was to be paid back without interest so for the time it was gone out of the SS system, no interest was gained. So blame congress (which has its own very secure retirement system) for messing it up for the rest of us.\n \n Personally, I don't plan on seeing any SS benefits.", 
   {}, 
   104300, 
   null, 
   1113926640.0
  ], 
  [
   167084, 
   null, 
   "GreenMtnBoy", 
   "It might help SS, but it hurts medicare / medicaide. On the whole they burden the system more.", 
   {}, 
   109135, 
   null, 
   1128078960.0
  ], 
  [
   167116, 
   null, 
   "Symbiote", 
   "On the SS front, if congress hadn't taken money out in the 50's and 60's, SS would likely be solvent. But the money removed was to be paid back without interest so for the time it was gone out of the SS system, no interest was gained. \n\n \n Taken the money out of what though? The supposed funds withdrawn from do not exist in any way shape or form, they are an accounting fiction.", 
   {}, 
   167084, 
   null, 
   1128100260.0
  ], 
  [
   190541, 
   null, 
   "chaoticgnome", 
   "We should just go into space. The fat people will be too heavy to be allowed on the ships.", 
   {}, 
   167116, 
   null, 
   1136707980.0
  ], 
  [
   256891, 
   null, 
   "jamesfreedman", 
   "It might help SS, but it hurts medicare / medicaide. On the whole they burden the system more.\n\n \n Yeah definately when people are overweight it will cost us more in the long run. I just bought health insurance recently and they said that they had to increase my policy 60.00 per month because my weight was 240 instead of 210. This is because their is a cost for being over weight besides the cost of food of course!!", 
   {
    "post_info": {
     "post_title": "Weight gain"
    }
   }, 
   167084, 
   null, 
   1175719920.0
  ], 
  [
   313262, 
   null, 
   "LloydRacer", 
   "Sixth post", 
   {}, 
   256891, 
   null, 
   1213485000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Fat Americans will save Social Security?", 
  "url": "http://www.4forums.com/political/social-security-debates/4561-fat-americans-will-save-social-security.html", 
  "breadcrumbs": [
   "Social Security"
  ], 
  "id_number": 4561, 
  "discussion_files": [
   [
    "25332.html", 
    "http://www.4forums.com/political/social-security-debates/4561-fat-americans-will-save-social-security-print.html"
   ]
  ], 
  "identifier": 4561
 }
]