[
 [
  [
   99112, 
   null, 
   "JM Ammans", 
   "as seen at www.PoliticalCafe.org\n \n Killing Terri Schiavo\n \n First Major Step toward Legalized Euthanasia and Abortion on Demand  \n \n 24 hours to live. That's all she has. Then, her feeding tube will be removed, per the orders of a renegade judge that has once again rewritten the law. \n \n Where's the outrage?\n PETA  would be screaming right now if this were about a dog that was going to be starved and dehydrated to death. \n \n Dr. Mengele would be carefully documenting all stages of the killing, monitoring Terri's every action, every vital pulse, heart beat and breath. \n \n Pro-abortion legal counselors globally are preparing their briefs right now to use this as precedent that it is OK to kill certain people and not others... it's a matter of choice, right? Terri's husband thinks so.\n \n He wants her dead so he can collect the million dollars, and share it with the woman with whom he has fathered two children out of wedlock. Yes, I know that sounds corny, old-fashioned, out-of-date, etc, etc. But it's the truth. \n \n In October of 2003, a Florida judge decided to play god (small \"g\" here, he is not worthy of a capital \"G\") and require her feeding tube to be removed. Six days later the Florida legislature passed \"Terri's Law\" which allowed Governor Jeb Bush to step in and stop the court-mandated starvation. \n \n She is not a vegetable as her \"husband\" would have you believe. He was able to find three or four medical \"experts\" who testified that she was in this non-responsive state. However, Terri's family has fourteen affidavits on file that prove otherwise. \n \n She is vocal.\n \n She is responsive.\n \n She did not, and does not, want to die. And she can't defend herself. Takes a real tough guy to pull the tube from his wife, all the while looking forward to receiving the money from the medical trust that was established to provide for Terri.\n \n Here are the facts as stated in Citizen online:\n \n After Terri's initial collapse from unknown causes in 1990, Michael Schiavo sued his wife's doctors for malpractice when it became clear she'd suffered brain damage. He told the court, in moving testimony, about his plans to rehabilitate his wife - and as a result, was awarded a $1 million judgment as well as court fees. Seventy percent of that money was put into a medical trust to pay for Terri's care. \n \n \"Clearly, [the money] would not have been awarded if she didn't want treatment and they were going to discontinue it,\" John Kilner, president of the Center for Bioethics and Human Dignity, told Citizen. \n \n But eight years later, as Schiavo was trying to end his wife's life over her parents' objections, he said he recalled that, after watching a movie about Karen Ann Quinlan - whose parents had to fight the state of New Jersey for the right to take her off a ventilator after she fell into a drug-induced coma - Terri said she'd never want to be hooked up to a \"machine\" or become a \"burden.\" There was no written record of the conversation, so he produced two witnesses: his brother, and his brother's wife. \n \n Yet the Schindler family and one of Terri's closest friends argued that she never would have said something like that - and, in fact, vividly recalled for the court conversations in which she'd said just the opposite.  \n Where is the proof her husband claims to have? Show me a document Terri signed before she was injured (some folks have speculated that he may have caused her injury). There is no proof, just a \"husband\" who is looking for money and an easy life with a woman and their illegitimate children. \n \n Wait, I'm wrong about there being no proof - there is proof of one very important fact in this case. There is proof that this is just one more example of judges rewriting the law. Are you ready for more of this? \n \n If, for no other reason that to maintain YOUR rights, you should immediately drop what you are doing, and call and/or email your state senator and representative and tell them to get ahold of their counterparts in Florida and save Terri Schiavo's life. \n \n Sen. Rick Santorum told The Hill newspaper on Wednesday, March 16, 2005, \"That's not going to happen on my watch.\"\n \n Don't let it happen on your watch. \n \n Take action today to save Terri.", 
   {
    "post_info": {
     "post_title": "SAVE Terri Schiavo... or, what would PETA do?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1111089540.0
  ], 
  [
   99129, 
   null, 
   "Nwarth", 
   "I once heard a quote by Isaac Asimov that I never understood until now. This case was strange enough for it to make just enough sense to me to be reasonable.\n \n \nnever let your sense of morality get in the way of what is right.\n \n \n As a soon to be student of Law I see two interesting conflicts at work here. Should (morally speaking) Terri be allowed to die? Why? Her 'husbands intentions are not as well indented as is initially thought. You see, 8 years without a wife is a long time, he has fallen in love with another woman and now wants marry her. Terri, however, is still alive. This means that the only way that Mr. Schiavo can get out of the marriage is either through a 'death due you part' or her signing a divorce papers. Well we see which way this scum is leaning. emoticon_angry \n \n However America is a country ruled by law. Let us look at the LAW. In cases like this the decision is to be made by the \"next of kin\" which is the husband. Thus the Judge wasn't \"renegade\" at all, he was simply following the law. \n \n Now what if he were to side with the family instead of the husband. Although he would be following his morals far greater harm would come. How so? He would begin to undermine the legal fiber of our country. Laws are made to be equal. This is an extremely rare case and as such a rare time when, unfortunately, one party really looses out. \n \n But what if...\n \n What if he was a renegade judge and ruled in the family's favor? If he had done that imagine what would happen, seven years later when a cases comes before the court and the reverse is true? The family wants to allow a child to die and the husband wants his wife to live. Why are we going to continue to be arbitrary in our decision?\n \n I'm sorry, but while I understand and feel morally outraged, I must do what is right. If we want to change the law we must do it through our legislatures, not through our court systems. After all we don't want any activist judges now do we?", 
   {}, 
   99112, 
   null, 
   1111091340.0
  ], 
  [
   99198, 
   null, 
   "Dono", 
   "Save her from what? To each his own, but I have left written instructions regarding feeding tubes and ventilators, etc. I believe there is a big difference between living and existing.\n Dono", 
   {}, 
   99129, 
   null, 
   1111099500.0
  ], 
  [
   99204, 
   null, 
   "JM Ammans", 
   "I'm glad you've left written instructions for your family, friends, etc. \n \n Unfortunately, she didn't.\n \n Her husband said his brother and sister-in-law heard her say she would rather die, and yet her family claims just the opposite. The only person not able to voice an opinion is Terri Schiavo.\n \n He wants to get on with his life... and if so, he should have divorced her years ago, which would have given control of this situation to her parents as legal guardians... and this whole situation would have been averted. \n \n It's a really emotional thing... and you did the right thing by having a living will.", 
   {
    "post_info": {
     "post_title": "written instructions"
    }
   }, 
   99198, 
   null, 
   1111099920.0
  ], 
  [
   99205, 
   null, 
   "Waxy", 
   "Save her from what? To each his own, but I have left written instructions regarding feeding tubes and ventilators, etc. I believe there is a big difference between living and existing.\n Dono\n\n \n Amen to that Dono.\n \n Waxy", 
   {}, 
   99198, 
   null, 
   1111099920.0
  ], 
  [
   99249, 
   null, 
   "daewoo", 
   "I'm with Dono on this one. I have written instructions for such eventualities, as everbody should. My wife has said before that she may not be inclined to follow them. My respionse is \"Then you had better HOPE I never wake up\". I have no desire to be a prisoner in my own body.\n \n I think that removing the feeding tube is rather cruel, and that there should be provisions in the law for euthenasia under such circumstances. A sjot would be much more humane, but under the current system, that is not allowed.\n \n Terry was examined by court appointed doctors, not just those her husband chose. The doctors testified that she was in a persistive vegetative state. That should be the end of things.\n \n Personally, I think it is nice that her husband has stood by her and fought this battle. A lot of men would simply divorce her and walk away. \n \n While I understand that it must be incredibly hard on her parents to see their little girl go, the time has come to pass the denial stage.\n \n If they are correct, and there is some small degree of consciousness there, then their actions are absolutly inexcusable. I cannot imagine that anybody would wish to remain alive under such circumstances. If she is indeed still \"in there\", that is more of a reason to end this torturous existance. \n \n All JMO, of course", 
   {}, 
   99205, 
   null, 
   1111106340.0
  ], 
  [
   99284, 
   null, 
   "jskufan", 
   "Since Terry was the parents child before and after she was a married woman, why not give the parents custody of her and release the husband of all legal and moral ties to her. If they wish to continue her care, and they can afford it, let them. As for the million dollar trust awarded for her care, I find it hard to believe it hasn't been completely depleted after being hospitalized for 8 years. This arguement, like abortion arguements, will never capture unanimous support from either side.", 
   {}, 
   99249, 
   null, 
   1111117680.0
  ], 
  [
   99293, 
   null, 
   "daewoo", 
   "While turning over custoday is as simple as signing a paper, relieving onesself of moral responsibility can be quite a bit more complicated (assuming the person is worth a damn in the first place).\n \n I think it is nice that he has stuck around to fight for his wife.", 
   {}, 
   99284, 
   null, 
   1111120800.0
  ], 
  [
   99323, 
   null, 
   "Steeeeve", 
   "someone said earlier we go by law.....well they passed a law saying you couldnt remove the tube and then the court said you cant pass that law....so whats up with judges doing crazy things like that?? The thing is no one can speak for her but herself....everyone would say something different in this situation....I would personally want to be kept alive, there is always hope. If you don't know what she would have wanted you should probably play it safe and let her live.", 
   {}, 
   99293, 
   null, 
   1111124340.0
  ], 
  [
   99379, 
   null, 
   "JM Ammans", 
   "This is not a red/blue issue as many are trying to make it ... enough of the finger pointing... I remember being told when I was a child that when I would point one finger at someone else, three pointed back at me... seems appropriate here. \n \n I just read some more on euthanasia ... PoliticalCafe.org has a whole section of political links... here is the page I was on trying to get some info: go to www.politicalcafe.org, and look in the Political Directory under Issues... \n \n Secondly, the \"nice\" husband didn't stick by her... for crying out loud, he went off and created a whole new, illegitimate family while her parents took care of her in the hospital, doing what they could financially, emotionally, legally, etc. Nice of him to stick by her... \n \n Drudge just posted this exclusive update on his site: \n \n \" **Exclusive Fri Mar 18 2005 00:50:07 ET** The Chairman of the Health, Education, Labor, and Pension (HELP) Committee, Mike Enzi (R-Wyoming) has requested Terri Schiavo to testify before his congressional committee, the DRUDGE REPORT has learned. In so doing it triggers legal or statutory protections for the witness, among those protections is that nothing can be done to cause harm or death to this individual. \n \n Members of Congress went to the U.S. Attorney in DC to ask for a temporary restraining order to be issued by a judge, which protects Terri Schiavo from having her life support, including her feeding and hydration tubes, removed... Developing... \"", 
   {
    "post_info": {
     "post_title": "Congress steps in to have Terri testify"
    }
   }, 
   99323, 
   null, 
   1111160700.0
  ], 
  [
   99446, 
   null, 
   "daewoo", 
   "Secondly, the \"nice\" husband didn't stick by her... for crying out loud, he went off and created a whole new, illegitimate family while her parents took care of her in the hospital, doing what they could financially, emotionally, legally, etc. Nice of him to stick by her... \n\n \n Teh guy is still fighting for her after all this time. Most men would have said \"screw it\" and walked away long ago.", 
   {}, 
   99379, 
   null, 
   1111174440.0
  ], 
  [
   99495, 
   null, 
   "jim's trucking", 
   "While turning over custoday is as simple as signing a paper, relieving onesself of moral responsibility can be quite a bit more complicated (assuming the person is worth a damn in the first place).\n \n I think it is nice that he has stuck around to fight for his wife.\nHe hasn't been just sticking around. He's been sticking his mistress to the point that they now have two children out of wedlock.\n \n The man is not a saint. And he hasn't been protecting his wife. He's been trying to have her killed. Noone but him and his blood family say that she wants to die. She hasn't said that and her family denies she would ever say that. I tend to believe her family.\n \n We have laws that protect even dogs and cats from being starved to death. Why should it all of a sudden become legal to starve this lady to death?\n \n The fact that thousands of people have living wills to protect their families from this kind of dilemma has absoutely nothing to do with this case. How you feel about living wills has absolutely nothing to do with this case. What this case is about is Terri Shaivo and the absense of a living will.\n \n Give that bastard husband of hers a divorce and let him go his own way. Let her live 'til God takes her away.\n \n I'd be willing to bet the husband has an insurance policy he wants to collect on.", 
   {}, 
   99293, 
   null, 
   1111180860.0
  ], 
  [
   99503, 
   null, 
   "JM Ammans", 
   "Hey, Jim's Trucking... he does have a policy ready to roll, doesn't he? I read that he will receive the money from the $1 million he told the original judge and jury he needed to help get Terri better... \n \n It's too bad people are saying this is a republican/democrat thing... it's not, is it? It's about her life, and like you, when God takes her home, not when a person who is her husband in name only decides to euthanize her with Judge Greer's blessing... \n \n Thanks for your input.", 
   {
    "post_info": {
     "post_title": "Terri's fighting"
    }
   }, 
   99495, 
   null, 
   1111182420.0
  ], 
  [
   99518, 
   null, 
   "sinjin", 
   "I'm stunned that anyone would condemn the husband for falling in love again and starting a family. He should have been a widower years ago. Illegitimate? Mistress? Shame on you for your self-righteousness. Sometimes I hope the Christians are right so I can see so many of them later in Hell. That would be worth the price of admission.", 
   {}, 
   99503, 
   null, 
   1111183860.0
  ], 
  [
   99522, 
   null, 
   "daewoo", 
   "He hasn't been just sticking around. He's been sticking his mistress to the point that they now have two children out of wedlock.\n\n \n What? You expect him to sit by her bed and pine for 15 years? \n \n \nThe man is not a saint. And he hasn't been protecting his wife. He's been trying to have her killed. Noone but him and his blood family say that she wants to die. She hasn't said that and her family denies she would ever say that. I tend to believe her family.\n\n \n I suppose this boils down to who is likely to have known her better. I would say husband over parents, but that is just based on my experience. I speak to my mother fairly often, but I am not sure I would recognise her if I saw her on the street. I have sisters I have't seen for 10 years or more. I certainly would not wnat them making such a decision for me. I am sure they would all turn up if something like that happened, though, with assanine opinions about what I would want.\n \n \nWe have laws that protect even dogs and cats from being starved to death. Why should it all of a sudden become legal to starve this lady to death?\n\n \n It is not \"all of a sudden legal\". Most states allow discontinuation of support for people in persistent vegetative states. The concern is that there may still be part of them in there. Would you want to live like that? Completely trapped in your own mind? I certainly would not.\n \n \nThe fact that thousands of people have living wills to protect their families from this kind of dilemma has absoutely nothing to do with this case. How you feel about living wills has absolutely nothing to do with this case. What this case is about is Terri Shaivo and the absense of a living will.\n\n \n Thats right, and the law says that her husband makes the decision in that case. there is logic here, jim. Most people grow up, move out of their parents house, get married, etc... and their partner generally knows them better than anybody else on the planet. I am sure her parents have an excellent idea of what she would have wanted when she was a kid, but very few people are the same as they were when they were kids. \n \n \nGive that bastard husband of hers a divorce and let him go his own way. Let her live 'til God takes her away.\n\n \n God did take her away. Without the medical treatment she has recieved, she would have died long ago. \n \n \nI'd be willing to bet the husband has an insurance policy he wants to collect on.\n\n \n No, he doesn't. What insurance company do you know of that would be willing to write a policy on a vegetable, where the benificiary has the right to terminate life support functions at any time? that is just foolish.", 
   {}, 
   99495, 
   null, 
   1111184220.0
  ], 
  [
   99524, 
   null, 
   "daewoo", 
   "Hey, Jim's Trucking... he does have a policy ready to roll, doesn't he? I read that he will receive the money from the $1 million he told the original judge and jury he needed to help get Terri better... \n\n \n There is less than $50,000.00 left of that original million, and he has already offered to donate that to charity. There is NO MONEY involved here.\n \n \nIt's too bad people are saying this is a republican/democrat thing... it's not, is it? It's about her life, and like you, when God takes her home, not when a person who is her husband in name only decides to euthanize her with Judge Greer's blessing... \n \n \n \n God has been trying to take her home for 15 years. Her parents just wont let her go. \n \n Whatever happens after death has got to be better than the life she is living now, assuming that there is anything of her left, which is not even questionable. She is just a shell. She is a breathing corpse.", 
   {}, 
   99503, 
   null, 
   1111184460.0
  ], 
  [
   99532, 
   null, 
   "Steeeeve", 
   "If God were trying to take her home he would have by now...assuming you want to use that arguement...no one prevents him from doing anything", 
   {}, 
   99522, 
   null, 
   1111185000.0
  ], 
  [
   99536, 
   null, 
   "jim's trucking", 
   "I'm stunned that anyone would condemn the husband for falling in love again and starting a family. He should have been a widower years ago. Illegitimate? Mistress? Shame on you for your self-righteousness. Sometimes I hope the Christians are right so I can see so many of them later in Hell. That would be worth the price of admission.\n\n I didn't condemn her husband for sticking his mistress and having illegitimate children. I'm condemning the poster for claiming he stuck by his wife.\n \n Adultery is an experience I had (over and over and over again) but it didn't make me want to kill somebody.\n \n The simple way out is to give him a divorce. (But then I guess he couldn't collect on his insurance policy {that I feel sure he has in a lockbox somewhere}.)", 
   {}, 
   99518, 
   null, 
   1111185360.0
  ], 
  [
   99542, 
   null, 
   "jim's trucking", 
   "What? You expect him to sit by her bed and pine for 15 years?\nNo. I'd expect him to get a divorce and move on down the line.\n \n His trying to kill her is what chaps my XXX. \n \n \n \n\n I suppose this boils down to who is likely to have known her better. I would say husband over parents, but that is just based on my experience. I speak to my mother fairly often, but I am not sure I would recognise her if I saw her on the street. I have sisters I have't seen for 10 years or more. I certainly would not wnat them making such a decision for me. I am sure they would all turn up if something like that happened, though, with assanine opinions about what I would want.\nJust like the living will thing, this does not apply to Terri. What you think about your own family has nothing to do with what she and her family think about each other.\n \n \n \n\n It is not \"all of a sudden legal\". Most states allow discontinuation of support for people in persistent vegetative states. The concern is that there may still be part of them in there. Would you want to live like that? Completely trapped in your own mind? I certainly would not.\nI believe the states allow it where it is spelled out in some agreement prior to the loss of function on the part of the injured person.\n \n \n \n\n Thats right, and the law says that her husband makes the decision in that case. there is logic here, jim. Most people grow up, move out of their parents house, get married, etc... and their partner generally knows them better than anybody else on the planet. I am sure her parents have an excellent idea of what she would have wanted when she was a kid, but very few people are the same as they were when they were kids.\nThere's a possibility that you are right. There's a possibility that you are wrong. You are correctly describing your own situation which has absolutely nothing to say about her situation. \n \n \n \n\n God did take her away. Without the medical treatment she has recieved, she would have died long ago. \nGod gave us doctors and medicine and life support methods. If God tried to take her away he'd have done it.\n \n What are you saying, that God caused the original doctor to botch her operation thus causing her vegetative state. Get serious, daewoo. You know better than that.\n \n \n \n\n No, he doesn't. What insurance company do you know of that would be willing to write a policy on a vegetable, where the benificiary has the right to terminate life support functions at any time? that is just foolish.\nYou must be a friend of the family. emoticon_rolleyes Actually, he could have had a policy on her before the original operation that screwed her up. We just don't know, do we?", 
   {}, 
   99522, 
   null, 
   1111186020.0
  ], 
  [
   99545, 
   null, 
   "daewoo", 
   "If God were trying to take her home he would have by now...assuming you want to use that arguement...no one prevents him from doing anything\n\n \n \n Assuming he wished too. I believe in god. I just don't belive he gives a rats XXX.\n \n \nIt's too bad people are saying this is a republican/democrat thing... it's not, is it? \n \n \n This is true. I certainly hope that if I am ever in that situation, there are no politicians willing to grandstand on my behalf.\n \n \nI didn't condemn her husband for sticking his mistress and having illegitimate children. I'm condemning the poster for claiming he stuck by his wife.\n\n \n He did stick by his wife. He has been fighting for her for 7 years now. \n \n \nThe simple way out is to give him a divorce. (But then I guess he couldn't collect on his insurance policy {that I feel sure he has in a lockbox somewhere}.)\n\n \n This is flordia, Jim, she doesn't have to be dead to collect on a life insurace policy anyway. A persistant vegitative state is enough in most states to make your insurace company pay out (most states allow this since, with no hope of recovery, they figure your life insurace can be used for your medical bills). He could have collected any insuracne policy years ago.\n \n Also, under flordia law, all her parents had to do was convicne the court that they were more likely to know her wishes than the judge, and the decision would have been THEIRS to make, not his. They could not do this. Not even close.\n \n How many times did you talk to your parents about your wishes if you should ever be in a vegitative state? I know I have never mentioned it to my folks, or any of my siblings. My wife is well aware of my wishes in that regard, though.", 
   {}, 
   99532, 
   null, 
   1111186140.0
  ], 
  [
   99547, 
   null, 
   "jim's trucking", 
   "There is less than $50,000.00 left of that original million, and he has already offered to donate that to charity. There is NO MONEY involved here.\nLack of evidence is not proof of non-existence. Unless you are the financial advisor or the family consultant for Mr Shaivo, I doubt you know the financial situation at all.\n \n \n \n \n\n God has been trying to take her home for 15 years. Her parents just wont let her go. \nFirst you say you don't think God gives a rat's XXX. Now you say He's trying to take her home. ...And you're saying her parents are stronger than God. If God wanted to take her on home He would do it and not ask anybody's permission. \n \n \n \n\n Whatever happens after death has got to be better than the life she is living now, assuming that there is anything of her left, which is not even questionable. She is just a shell. She is a breathing corpse.\nIt is the duty of the medical world to prolong life even in this case unless the patient has expressed a desire not to have that effort performed. You cannot prove, except on the word of her husband and his brother and his wife, that she ever said anything of the sort.", 
   {}, 
   99524, 
   null, 
   1111186620.0
  ], 
  [
   99550, 
   null, 
   "JM Ammans", 
   "http://www.msnbc.msn.com/id/7212079/page/2/\n \n really sad... all on the words of a man against a family.", 
   {
    "post_info": {
     "post_title": "they just pulled her feeding tube"
    }
   }, 
   99547, 
   null, 
   1111187040.0
  ], 
  [
   99552, 
   null, 
   "daewoo", 
   "No. I'd expect him to get a divorce and move on down the line.\n\n \n Wow, I am certianly glad my wife is more loyal thn you are. IF something happened to me, I would certainly expect her to re-marry, but not to just wash her hands of me completely.\n \n His trying to kill her is what chaps my XXX. \n \n \n \nJust like the living will thing, this does not apply to Terri. What you think about your own family has nothing to do with what she and her family think about each other.\n\n \n Obviously it does. The judge in this case had to make the determination of who would be more likley to know her wishes, her husband, or her parents. He chose the husband. If you want to argue about who has the right to make the choice, you essentially have to argue that her parents knew her better than her husband does.\n \n \nI believe the states allow it where it is spelled out in some agreement prior to the loss of function on the part of the injured person.\n\n \n Every state allows it, living will or no. The only real advantage to a living will is that you do not need a court order to terminate life support. The hospital is bound by the provisions of the living will. \n \n \nThere's a possibility that you are right. There's a possibility that you are wrong. You are correctly describing your own situation which has absolutely nothing to say about her situation. \n \n \n Except that this is what the judge had to look at, and he chose her husbamd as the one who was most likely to know her wishes. \n \n \n God gave us doctors and medicine and life support methods. If God tried to take her away he'd have done it.\n \n \nYou must be a friend of the family. emoticon_rolleyes Actually, he could have had a policy on her before the original operation that screwed her up. We just don't know, do we?\n\n \n And it didn't come out in all the legal proceedings, or with all the media exposure this case has had, and he hasn't elected to collect on it to date.\n \n You are big on the conspiracy theories, huh?", 
   {}, 
   99542, 
   null, 
   1111187100.0
  ], 
  [
   99557, 
   null, 
   "daewoo", 
   "Lack of evidence is not proof of non-existence. Unless you are the financial advisor or the family consultant for Mr Shaivo, I doubt you know the financial situation at all.\n\n \n Google it. It has been well reported. \n \n \nFirst you say you don't think God gives a rat's XXX. Now you say He's trying to take her home. ...And you're saying her parents are stronger than God. If God wanted to take her on home He would do it and not ask anybody's permission. \n \n \n I don't think god gives a rats XXX about terry schiavo or anybody else for that matter. \n \n \nIt is the duty of the medical world to prolong life even in this case unless the patient has expressed a desire not to have that effort performed. You cannot prove, except on the word of her husband and his brother and his wife, that she ever said anything of the sort.\n\n \n Apparently the court felt that the word of her husband was worth more than the word of her parents. Was the court right? We don't know, we weren't there. My personal experience says \"yes\", the court was probably right. \n \n The duty of the medical profession is not just to prolong life, but to preserve the quality of life as well. Realistically, we could all live for a VERY long time if the goal was simply to prolong \"life\" indefinatly. we have wonderous machines now that will circulate our blood for us, breathe for us, etc... If laying brain dead in a bed is your idea of life, you are welcome to it.\n \n This would not even be an issue if not for the fact that republican lawmakers have used it as an issue to garner votes from the religous right.", 
   {}, 
   99547, 
   null, 
   1111187580.0
  ], 
  [
   99559, 
   null, 
   "JM Ammans", 
   "Pass these around... and prove to yourself and others that she is still \"in there\". \n \n It's not too late. \n \n http://hyscience.typepad.com/hyscience/2005/02/the_video_micha.html", 
   {
    "post_info": {
     "post_title": "The Videos that prove she tracks, moves, etc."
    }
   }, 
   99557, 
   null, 
   1111187880.0
  ], 
  [
   99569, 
   null, 
   "daewoo", 
   "Pass these around... and prove to yourself and others that she is still \"in there\". \n \n It's not too late. \n \n http://hyscience.typepad.com/hyscience/2005/02/the_video_micha.html\n\n \n \n Ok, I watched the movies. \n \n She is still a veggie.\n \n Response to external stimulus does nto mean you are not in a persistent vegitative state. In the movies, you are seeing obvious reflex actions. this also does not mean you are not in a persistent vegitative state.\n \n Her core functions are intact. She still breathes, and still can be expected to exhibit some reflex actions. Doesn't matter. The wetware is gone. \n \n This is not the 1970's where we judges such things based on patient interviews and poked them with needles to see if they were in there or not. This is not a coma, where the subject is completely unresponsive. \n \n This is he 21st century. We hook up a machine, see no higehr brain functions, and we know she is a veggie. There is really no room for debate in this. That is why state laws regarding removing peope from life support have changed so much int eh last 20 years. At one point, you had to fight EVERY time you wanted somebody removed from life support, and roughly 15% of the time, when you removed them from life support, they woke up.\n \n That does nto happen anymore, since we now have the technology to accuratly asses peopels conditions based ont ehir brain activity, and we have the ability to map that activity.\n \n THERE IS NO DEBATE ABOUT WHETHER OR NOT SHE IS IN A PERSISTENT VEGETATIVE STATE. That has been scientifically proven in court. The only question is whether or not somebody in a persistent vegetative state should be allowed to die.", 
   {}, 
   99559, 
   null, 
   1111189380.0
  ], 
  [
   99656, 
   null, 
   "CCR1994", 
   "I once heard a quote by Isaac Asimov that I never understood until now. This case was strange enough for it to make just enough sense to me to be reasonable.\n \n \n \n As a soon to be student of Law I see two interesting conflicts at work here. Should (morally speaking) Terri be allowed to die? Why? Her 'husbands intentions are not as well indented as is initially thought. You see, 8 years without a wife is a long time, he has fallen in love with another woman and now wants marry her. Terri, however, is still alive. This means that the only way that Mr. Schiavo can get out of the marriage is either through a 'death due you part' or her signing a divorce papers. Well we see which way this scum is leaning. emoticon_angry \n \n However America is a country ruled by law. Let us look at the LAW. In cases like this the decision is to be made by the \"next of kin\" which is the husband. Thus the Judge wasn't \"renegade\" at all, he was simply following the law. \n \n Now what if he were to side with the family instead of the husband. Although he would be following his morals far greater harm would come. How so? He would begin to undermine the legal fiber of our country. Laws are made to be equal. This is an extremely rare case and as such a rare time when, unfortunately, one party really looses out. \n \n But what if...\n \n What if he was a renegade judge and ruled in the family's favor? If he had done that imagine what would happen, seven years later when a cases comes before the court and the reverse is true? The family wants to allow a child to die and the husband wants his wife to live. Why are we going to continue to be arbitrary in our decision?\n \n I'm sorry, but while I understand and feel morally outraged, I must do what is right. If we want to change the law we must do it through our legislatures, not through our court systems. After all we don't want any activist judges now do we?\n\n \n This case illustrates every person's need to have their wishes spelled out in writing before something like this happens. The reason we are having this debate is because Terry Schaivo failed to do this and now we are arguing over the husband's legal rights and the parents legal rights and the governments role (specifically the courts) but we really don't talk exclusively about Terry's legal rights. Does she have them? I would certainly think so. Do we know her wishes in this regard? No, because she didn't have them stated so that we can know for sure. We are being asked to trust her spouse. I wouldn't want to do that under the circumstances. But what can we do? As you have pointed out, the law is what it is. The real debate then is whether the law should be changed.", 
   {}, 
   99129, 
   null, 
   1111247400.0
  ], 
  [
   99727, 
   null, 
   "Steeeeve", 
   "Assuming he wished too. I believe in god. I just don't belive he gives a rats XXX.\n \n\n \n Not a good stance if you believe in God...as in the one the Bible refers to.", 
   {}, 
   99545, 
   null, 
   1111274100.0
  ], 
  [
   99729, 
   null, 
   "Steeeeve", 
   "Ok, I watched the movies. \n \n She is still a veggie.\n \n Response to external stimulus does nto mean you are not in a persistent vegitative state. In the movies, you are seeing obvious reflex actions. this also does not mean you are not in a persistent vegitative state.\n \n Her core functions are intact. She still breathes, and still can be expected to exhibit some reflex actions. Doesn't matter. The wetware is gone. \n \n This is not the 1970's where we judges such things based on patient interviews and poked them with needles to see if they were in there or not. This is not a coma, where the subject is completely unresponsive. \n \n This is he 21st century. We hook up a machine, see no higehr brain functions, and we know she is a veggie. There is really no room for debate in this. That is why state laws regarding removing peope from life support have changed so much int eh last 20 years. At one point, you had to fight EVERY time you wanted somebody removed from life support, and roughly 15% of the time, when you removed them from life support, they woke up.\n \n That does nto happen anymore, since we now have the technology to accuratly asses peopels conditions based ont ehir brain activity, and we have the ability to map that activity.\n \n THERE IS NO DEBATE ABOUT WHETHER OR NOT SHE IS IN A PERSISTENT VEGETATIVE STATE. That has been scientifically proven in court. The only question is whether or not somebody in a persistent vegetative state should be allowed to die.\n\n \n Actually no, there is a debate about whether or not she is in a persistent vegetative state. We can thank CSPAN for this. Dr Bill Frist was argueing this on the floor of the senate actually....many doctors would like to see a cat scan....many believe (and ones that have seen her) she is not.\n \n I would like to ask anyone what we should do about someone with alzheimers?? They seem to act just like Terri does. I would know my grandfather just died of it a few months back. They can not feed themselves nor use the bathroom, yet they are still able to move and do much of the things terri does. One could claim that alzheimers would be a vegetative state then. My grandma might disagree.", 
   {}, 
   99569, 
   null, 
   1111274460.0
  ], 
  [
   99740, 
   null, 
   "daewoo", 
   "Actually no, there is a debate about whether or not she is in a persistent vegetative state. We can thank CSPAN for this. Dr Bill Frist was argueing this on the floor of the senate actually....many doctors would like to see a cat scan....many believe (and ones that have seen her) she is not.\n\n \n A cat scan will tell them nothing. A brain scan gives readouts of brain waves including where in teh brain they originate. While we do not entirely understand how the brain works, we do have a pretty good working knowledge of what parts of the brain perform what functions. Terrys case is not at all unique. \n \n If you look abck at the court appointed dostors that have looked at her case, they are not GPs. They are all leading neurologists, somce of the best in the world. 1 of them did not even bother to examine her directly (one performed a rpefuntroy examination, and the others performed lenghty personal examinations) because he called it \"pointless\". There is no need. They can look at the results of the brain scan and see what her mental condition is. THERE IS NO QUESTION. \n \n \nI would like to ask anyone what we should do about someone with alzheimers?? They seem to act just like Terri does. I would know my grandfather just died of it a few months back. They can not feed themselves nor use the bathroom, yet they are still able to move and do much of the things terri does. One could claim that alzheimers would be a vegetative state then. My grandma might disagree.\n\n \n \n People with alzheimers certainly suffer from diminished capacity, but they still have full brain function. They are presumed to still be \"in there\" somewhere. While thier circuitry has certianly shorted out, the software does seem to still be intact, or at least appears to be, they just can't get the OS to boot. This is a huge difference.\n \n \n \n BTW, there is an article at http://www.wftv.com/news/4276065/detail.html that should knock the wind out of the sails of those who keep claiming that there is some financial incentive to her husband to pull the plug. When the guy has turned down (and been offended by) million dollar offers, and even a $10 million offer, to turn custoday over to her parents and keep his wife alive, it seems pretty unlikely that he is doingthis for the $50,000 left in her trust fund.", 
   {}, 
   99729, 
   null, 
   1111276200.0
  ], 
  [
   99763, 
   null, 
   "Mach", 
   "Terri is, unfortunately for those who love her, dead. Has been since the tragedy that atrophied her brain. It's not reversable, she's gone. Doctors have confired that indeed, it's a persistent vegitative state. No higher brain functions work anymore, haven't, ever, since the accident. They have given it quite some time...for emotional reasons I'm sure. It's time for them to move on and let the healing begin.\n \n There are death threats being made by made to the judge by our fine, upright, life-preserving citizens now.\n \n What moronic, ignorant evil resides in such people to make them deny reality, and suggest that killing judge for doing his job is somehow \"ok\"?\n \n Truly mind boggling.\n \n -Mach", 
   {}, 
   99524, 
   null, 
   1111283100.0
  ], 
  [
   99764, 
   null, 
   "Steeeeve", 
   "But it still stands...the alzheimers patient such as my grandfather still can't do anything more then terri can. So alzheimers should live and terri should die based on what?\n \n Also...taken from terrisfight.com..\n \n Dr. Victor Gambone testified that he visits Terri 3 times a year. His visits last for approximately 10 minutes. He also testified, after viewing the court videotapes at Terri's recent trial, that he was surprised to see Terri's level of awareness. This doctor is part of a team hand-picked by her husband, Michael Schiavo, shortly before he filed to have Terri's feeding removed. Contrary to Schiavo's team, 14 independent medical professionals (6 of them neurologists) have given either statements or testimony that Terri is NOT in a Persistent Vegetative State. Additionally, there has never been any medical dispute of Terri's ability to swallow. Even with this compelling evidence, Terri's husband, Michael Schiavo, has denied any form of therapy for her for over 10 years.\n \n Dr. Melvin Greer, appointed by Schiavo, testified that a doctor need not examine a patient to know the appropriate medical treatment. He spent approximately 45 minutes with Terri. Dr. Peter Bambakidis, appointed by Judge Greer, spent approximately 30 minutes with Terri. Dr. Ronald Cranford, also appointed by Schiavo and who has publicly labeled himself \"Dr. Death\", spent less than 45 minutes examining and interacting with Terri", 
   {
    "unicode_changes_made": true
   }, 
   99740, 
   null, 
   1111283280.0
  ], 
  [
   99769, 
   null, 
   "Mach", 
   "But it still stands...the alzheimers patient such as my grandfather still can't do anything more then terri can. So alzheimers should live and terri should die based on what?\n [/I]\n\n \n Terry does not have alzheimers, she suffered severe hypoxic brain damage. That means her brain was cut off from oxygen to the point where it caused sever damage. It's been 13 years. Some hope remains after a few months..3-6 months. After that, at later age, after 13 years...she's gone.\n \n If you'd like to start a thread on alzheimers, please do, it's another hot debate topic, and a tragic mental illness. However, this is not a case that involves alzheimers.\n \n -Mach", 
   {}, 
   99764, 
   null, 
   1111284720.0
  ], 
  [
   99777, 
   null, 
   "daewoo", 
   "But it still stands...the alzheimers patient such as my grandfather still can't do anything more then terri can. So alzheimers should live and terri should die based on what?\n \n Also...taken from terrisfight.com..\n \n Dr. Victor Gambone testified that he visits Terri 3 times a year. His visits last for approximately 10 minutes. He also testified, after viewing the court videotapes at Terri's recent trial, that he was surprised to see Terri's level of awareness. This doctor is part of a team hand-picked by her husband, Michael Schiavo, shortly before he filed to have Terri's feeding removed. Contrary to Schiavo's team, 14 independent medical professionals (6 of them neurologists) have given either statements or testimony that Terri is NOT in a Persistent Vegetative State. Additionally, there has never been any medical dispute of Terri's ability to swallow. Even with this compelling evidence, Terri's husband, Michael Schiavo, has denied any form of therapy for her for over 10 years.\n \n Dr. Melvin Greer, appointed by Schiavo, testified that a doctor need not examine a patient to know the appropriate medical treatment. He spent approximately 45 minutes with Terri. Dr. Peter Bambakidis, appointed by Judge Greer, spent approximately 30 minutes with Terri. Dr. Ronald Cranford, also appointed by Schiavo and who has publicly labeled himself \"Dr. Death\", spent less than 45 minutes examining and interacting with Terri\n\n \n Very touching. None of them needed to interact with her at all. All they needed to do is look at the brain scan and go \"yep, no higher brain functions. She is s veggie.\" And that is the end of the story. \n \n Again, THERE IS NO QUESTION ABOUT WHETHER SHE IS IN A PVS OR NOT. That has been scientifically proven. The only debate is whether or not she should be terminated, and whether or not her husband is more likely to know her wishes in this regard than her parents.\n \n We don't kill alzheimers patients because thier higher brain functions are still intact. They ARE still \"in there\". Terri Schiavo is NOT.", 
   {
    "unicode_changes_made": true
   }, 
   99764, 
   null, 
   1111286280.0
  ], 
  [
   99778, 
   null, 
   "Steeeeve", 
   "but it does!\n \n Whats the difference in not killing an Alzheimers patient? They have \"no hope\" either. What is the difference in thinking? The two patients act the same and have the same functions available to them? Is the only difference just the name of their disease?", 
   {}, 
   99769, 
   null, 
   1111286340.0
  ], 
  [
   99792, 
   null, 
   "daewoo", 
   "but it does!\n \n Whats the difference in not killing an Alzheimers patient? They have \"no hope\" either. What is the difference in thinking? The two patients act the same and have the same functions available to them? Is the only difference just the name of their disease?\n\n \n No. First, there is theoretically hope for alzheimers patients. Since their mind is not damaged, just malfunctioning, it is not only possible, but extremely likely that we will someday find a cure for alzheimers. Terry mind is not malfunctining. It is dead.", 
   {}, 
   99778, 
   null, 
   1111293840.0
  ], 
  [
   99796, 
   null, 
   "Steeeeve", 
   "How do you know that...you did an MRI no her? she can see...that is one mind function right there. That is already one up on my grandpa that had alzheimers....there is theoretical hope for everyone, you can't limit what can be done.", 
   {}, 
   99792, 
   null, 
   1111300500.0
  ], 
  [
   100114, 
   null, 
   "snakespit", 
   "24 hours to live. That's all she has. Then, her feeding tube will be removed, per the orders of a renegade judge that has once again rewritten the law. \n\n Yeah, that renegade judge who is enforcing the already existing law giving her surviving spouse the POA to make decisions for her in the event that she becomes incapacitated? That renegade judge? Yep, what a bastard.\n \n \nPETA  would be screaming right now if this were about a dog that was going to be starved and dehydrated to death. \n\n Thankfully, we give our dogs injections of drugs when they are in a debilitated state, so as to end their suffering. Too bad we cannot do so for humans. \n \n \nPro-abortion legal counselors globally are preparing their briefs right now to use this as precedent that it is OK to kill certain people and not others... it's a matter of choice, right? Terri's husband thinks so.\n\n No, Terri's husband is the only one in the legal position to convey Terri's wishes about what she would want done in this case. To allow anyone else to make the decision is setting the precedent.\n \n \nHe wants her dead so he can collect the million dollars, and share it with the woman with whom he has fathered two children out of wedlock. Yes, I know that sounds corny, old-fashioned, out-of-date, etc, etc. But it's the truth. \n\n There is an estimated 50k left of the original settlement money. M. Schaivo has already stated that he would donate it to charity. Besides, I think if he was about the money, he would have taken some of the multi-million dollar offers from people who are trying to buy him away from his responsibility.\n \n \nIn October of 2003, a Florida judge decided to play god (small \"g\" here, he is not worthy of a capital \"G\") and require her feeding tube to be removed. Six days later the Florida legislature passed \"Terri's Law\" which allowed Governor Jeb Bush to step in and stop the court-mandated starvation.\n\n The Florida judge was interpreting existing law and made a ruling based on law. I would hardly call this \"playing god\" I would think it more of playing god by keeping this woman alive artifically. \n \n \nShe is not a vegetable as her \"husband\" would have you believe. He was able to find three or four medical \"experts\" who testified that she was in this non-responsive state. However, Terri's family has fourteen affidavits on file that prove otherwise. \n\n Both sides could find medical experts willing to sign their names to a form stating that Terri is a broiled trout, for the right amount of money. The court appointed physicians should be the only ones who are impartial enough to make the call. \n \n \nShe is vocal.\n\n Define \"vocal\".\n \n \nShe is responsive.\n\n Define \"responsive\".\n \n \nShe did not, and does not, want to die. And she can't defend herself. Takes a real tough guy to pull the tube from his wife, all the while looking forward to receiving the money from the medical trust that was established to provide for Terri.\n\n How do you know her wishes? Have you ever sat down and talked with Terri? I think her husband is in much better position to know what she wanted than you. Making such statements only illustrates the basis of groundless drivel that your argument is made up of. \n \n \nAfter Terri's initial collapse from unknown causes in 1990, Michael Schiavo sued his wife's doctors for malpractice when it became clear she'd suffered brain damage. He told the court, in moving testimony, about his plans to rehabilitate his wife - and as a result, was awarded a $1 million judgment as well as court fees. Seventy percent of that money was put into a medical trust to pay for Terri's care. \n\n It was not for \"unknown causes\". It was a metabolic imbalance brought about by an eating disorder which precipitated her cardiac arrest. \n \n \n \nBut eight years later, as Schiavo was trying to end his wife's life over her parents' objections, he said he recalled that, after watching a movie about Karen Ann Quinlan - whose parents had to fight the state of New Jersey for the right to take her off a ventilator after she fell into a drug-induced coma - Terri said she'd never want to be hooked up to a \"machine\" or become a \"burden.\" There was no written record of the conversation, so he produced two witnesses: his brother, and his brother's wife. \n\n And who are you to rebuke this? In the absense of a written advanced directive, Terri's husband is the POA responsible for executing Terri's wishes. \n \n \nYet the Schindler family and one of Terri's closest friends argued that she never would have said something like that - and, in fact, vividly recalled for the court conversations in which she'd said just the opposite. [/I] \n Where is the proof her husband claims to have? Show me a document Terri signed before she was injured (some folks have speculated that he may have caused her injury). There is no proof, just a \"husband\" who is looking for money and an easy life with a woman and their illegitimate children. \n\n It does not matter what they say, they are not the legal POA in this case. Her husband as POA is not required to have any proof, if he was, the case would have been thrown out of the courts a long time ago. And Terri was not injured. I like your sentence there. \"some folks have speculated that he may have caused her injury\". Terri was not injured. She suffered a cardiac arrest due to a metabolic imbalance caused by an eating disorder. I doubt her husband was making her puke her food back up, in hopes that her heart would stop beating and he could cash in on some money. TALK ABOUT SPECULATION. You sir, should be ashamed of yourself.\n \n \nWait, I'm wrong about there being no proof - there is proof of one very important fact in this case. There is proof that this is just one more example of judges rewriting the law. Are you ready for more of this?\n\n Bring it on sugarsnaps. \n \n \nIf, for no other reason that to maintain YOUR rights, you should immediately drop what you are doing, and call and/or email your state senator and representative and tell them to get ahold of their counterparts in Florida and save Terri Schiavo's life. \n\n How would I be maintaining my rights, by telling the government what to do with Terri's life? This set's the precedent that if I tell my wife I would rather die than be on a respirator for longer than 3 weeks, that my mother, 3 friends, 40 lawyers, 57 senators, 200 congressmen, and 245764 total strangers can tell a judge that this simply isn't the case, just because they don't want me to die. I think I would rather let my wife make these decisions, being that I have never conveyed my advanced directive wishes to my mother, let alone everyone else. The law currently provides that the living spouse is the POA...now who is trying to re-write laws here?\n \n \nSen. Rick Santorum told The Hill newspaper on Wednesday, March 16, 2005, \"That's not going to happen on my watch.\"\n\n \"Stupid is as stupid does\". -Forrest Gump\n \n \nDon't let it happen on your watch. \n \n Take action today to save Terri.\n\n Do people feel some sort of moral justification that if they do something to \"save Terri\" they are somehow better people? They are meddling in affairs not their own to further political objectives. Terri is mearly a pawn for these people, and that is the most morally reprehensible thing I can imagine. Terri died many years ago, her body is being kept alive by a tube.", 
   {
    "unicode_changes_made": true
   }, 
   99112, 
   null, 
   1111430400.0
  ], 
  [
   100275, 
   null, 
   "zachvac", 
   "\n Do people feel some sort of moral justification that if they do something to \"save Terri\" they are somehow better people? They are meddling in affairs not their own to further political objectives. Terri is mearly a pawn for these people, and that is the most morally reprehensible thing I can imagine. Terri died many years ago, her body is being kept alive by a tube.\n\n \n If people really wanted to save lives, why don't they donate those millions to the thousands of people in Africa who starve to death every day? What about people dying because they can't find shelter in the winter? These people are alive and totally concious yet they try to save someone in a permanent, vegetative state. The reason is nothing but politics.\n \n \n \n \n GOP memo says issue offers political rewards\n \n By The Washington Post\n \n WASHINGTON - Republican leaders believe their attention to the Terri Schiavo issue could pay dividends with Christian conservatives whose support they covet in the 2006 midterm elections, according to a GOP memo intended to be seen only by senators. \n \n The one-page memo, distributed to Republican senators by party leaders, called the debate over Schiavo legislation \"a great political issue\" that would appeal to the party's base, or core, supporters. The memo singled out Sen. Bill Nelson, D-Fla., who is up for re-election next year. \n \n \"This is an important moral issue, and the pro-life base will be excited that the Senate is debating this important issue,\" said the memo, reported by ABC News and later given to The Washington Post. \"This is a great political issue, because Senator Nelson of Florida has already refused to become a co-sponsor and this is a tough issue for Democrats.\"", 
   {
    "unicode_changes_made": true
   }, 
   100114, 
   null, 
   1111459980.0
  ], 
  [
   100293, 
   null, 
   "Mach", 
   "Exactly zachvac, on both points.\n \n The lies we hear coming from republican politicians during this is simply amazing. Really, it embarasses me that they say it, but worse, that people actually listen to it. Really disappointing.\n \n -Mach", 
   {}, 
   100275, 
   null, 
   1111466340.0
  ], 
  [
   100302, 
   null, 
   "zachvac", 
   "Exactly zachvac, on both points.\n \n The lies we hear coming from republican politicians during this is simply amazing. Really, it embarasses me that they say it, but worse, that people actually listen to it. Really disappointing.\n \n -Mach\n\n \n It really disgusts me what Republicans will do to gain the support of religious people. They will attack abortion, try to save this \"life\" yet I don't see them trying to save the lives of starving definately living people in many countries that are very poor. The only reason they address these issues is to gain votes. Not that democrats are much better. They both do what they can to try to get votes. I still don't see why this has become a political issue. This should have stayed in a local court where the judge ruled that the husband had the say in what happens to her (I think the Supreme Court has even refused to even hear this case). It seems like a clear-cut case of someone who didn't want to live like this but then politicians stepped in. The Democrats or the Republicans don't give a shi* about her, they just want votes. It's disgusting what politics has come to these days.", 
   {}, 
   100293, 
   null, 
   1111467540.0
  ], 
  [
   100340, 
   null, 
   "Carlene", 
   "Ya know, being from Florida and in the heat of this \"debate\", I personally think it's appalling. Mr. Schiavo came out ahead in over 14 court debates. Note that I did not say the \"winner\". \n \n I can tell you from a personal aspect that I share more of my deep wishes and feelings with my Husband than I do with my mother, father, brothers or sister. He's my life-mate. He's the one I confide in. He's the one that knows me better than anyone else in the world. That's what I think should happen when you pledge to spend your life with someone. Since this Schiavo case, even though I'd never thought about it, since we were kinda on the young side of being married (13 years), we've created living wills and gave copies to both sides of our families. His mom think our living wills are wrong. Nomatter what our wishes are, she thinks that it's Gods will when it's our time to go. If it takes machines to keep us alive, then so be it. That's not my idea of living. Also, guess what, a living will is about as good as a pre-nuptual. Being in the litigation business, pre-nupt's don't mean there won't be a lawsuit. Put money & a goal into anything and you have a lawsuit.\n \n The thing I still don't get is that if Terri is so responsive when her parents are around, what's the big deal with the feeding tube. Shouldn't they be able to spoon feed her????? Even Alzheimers patients have that instinct to swallow when something is placed in their mouths (unless they're on the last leg).\n \n Let the girl go...........", 
   {}, 
   100302, 
   null, 
   1111477380.0
  ], 
  [
   100367, 
   null, 
   "jim's trucking", 
   "If people really wanted to save lives, why don't they donate those millions to the thousands of people in Africa who starve to death every day? What about people dying because they can't find shelter in the winter? These people are alive and totally concious yet they try to save someone in a permanent, vegetative state. The reason is nothing but politics.\n \n \n \n \n GOP memo says issue offers political rewards\n \n By The Washington Post\n \n WASHINGTON - Republican leaders believe their attention to the Terri Schiavo issue could pay dividends with Christian conservatives whose support they covet in the 2006 midterm elections, according to a GOP memo intended to be seen only by senators. \n \n The one-page memo, distributed to Republican senators by party leaders, called the debate over Schiavo legislation \"a great political issue\" that would appeal to the party's base, or core, supporters. The memo singled out Sen. Bill Nelson, D-Fla., who is up for re-election next year. \n \n \"This is an important moral issue, and the pro-life base will be excited that the Senate is debating this important issue,\" said the memo, reported by ABC News and later given to The Washington Post. \"This is a great political issue, because Senator Nelson of Florida has already refused to become a co-sponsor and this is a tough issue for Democrats.\"\nDan Rather would use a memo like that in a New York minute.\n \n http://www.washingtonpost.com/wp-dyn/articles/A49701-2005Mar19.html?referrer=email\n \n Sounds like a liberal ploy to me! ;)", 
   {
    "unicode_changes_made": true
   }, 
   100275, 
   null, 
   1111502520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  SAVE Terri Schiavo... or, what would PETA do?", 
  "url": "http://www.4forums.com/political/politics-debates/4574-save-terri-schiavo-what-would-peta-do.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4574, 
  "discussion_files": [
   [
    "8112.html", 
    "http://www.4forums.com/political/politics-debates/4574-save-terri-schiavo-what-would-peta-do-print.html"
   ], 
   [
    "8113.html", 
    "http://www.4forums.com/political/politics-debates/4574-save-terri-schiavo-what-would-peta-do-3-print.html"
   ], 
   [
    "8114.html", 
    "http://www.4forums.com/political/politics-debates/4574-save-terri-schiavo-what-would-peta-do-2-print.html"
   ]
  ], 
  "identifier": 4574
 }
]