[
 [
  [
   100288, 
   null, 
   "zachvac", 
   "\n thou shalt not kill\n \n\n \n Yet most people who follow the ten commandments are not vegetarians, will step on an ant without a second thought. Many but not all even support the death penalty. Can you say hypocritical? Why do they apply this commandment only to cerrtain circumstances (abortion) and not others?", 
   {
    "post_info": {
     "post_title": "Religion and Killing"
    }
   }, 
   null, 
   null, 
   1111462860.0
  ], 
  [
   100303, 
   null, 
   "HeavenBound", 
   "Yet most people who follow the ten commandments are not vegetarians\n\n \n \n Those are good questions. Why would we be vegetarians? God gave us meat to eat according to Deut. 14:4-6. He specified which animals we could and could not have for food.\n \n \n \n \n, will step on an ant without a second thought.\n\n \n \n God intended this commandment only for human beings, otherwise he wouldn't have had the people sacrifice burnt offerings, usually a ram, sheep or lamb, to him.\n \n \n \nMany but not all even support the death penalty.\n\n \n \n The ten commandments did not invalidate death as a punishment for a crime or disobedience. Exodus 21:12-17 which are the laws written after the ten commandments, clearly state death as a punishment for crimes committed.\n \n \n \n \nCan you say hypocritical?\n\n \n You haven't shown me anything that shows we're going against God's law.\n \n \n \nWhy do they apply this commandment only to cerrtain circumstances (abortion) and not others?\n\n \n We apply them to circumstances that fit a particular commandment. Abortion happens to fit under thou shalt not kill. You need to give me an example of what other circumstances you mean for me to finish answering your question.", 
   {}, 
   100288, 
   null, 
   1111467660.0
  ], 
  [
   100317, 
   null, 
   "Kaill", 
   "George Carlin's fifth commandment amendment:\n \"Thou shalt try real hard not to kill anyone, unless of course, they pray to a different invisible avenger than the one you pray to\"\n \n The idea that a magical being handed large stones with special rules written on them to an elderly man at the top of a mountain several thousand years ago seems to me at least somewhat factually suspect. I think this sort of assertion requires considerable evidence to be considered plausible.\n \n Ancient middle eastern books are often interesting, and in my opinion most contain some moral lessons capable of increases human happiness. However, to take the stories within them literally requires such a remarkable suspension of disbelief and rationality, that I should think people willing/capable to accept them as accurate history, would be giving up something very important. Bluntly, I'm speaking of intelligence, and the ability to think for oneself.\n \n Answer this. If their were no God/soul/afterlife/etc. (anyone should be able to at least IMAGINE this, with effort*), would abortion be necessarily immoral? If so, why?\n \n * If you can't, you've given up your creative intelligence, as well as your logical intelligence.\n \n Derek\n \n P.S: Not addressing anyone in particular.", 
   {}, 
   100303, 
   null, 
   1111470360.0
  ], 
  [
   100341, 
   null, 
   "thebootfitter", 
   "Answer this. If their were no God/soul/afterlife/etc. (anyone should be able to at least IMAGINE this, with effort*), would abortion be necessarily immoral? If so, why?\n\n Even WITH belief in a God/soul/afterlife, there is no consensus on the morality of abortion. Different religions today (even different Christian denominations) have differing views on abortion. So, the answer would have to be no. Morality is a subjective concept.\n \n Regardless of the value any individual places upon the life of a pre-born human entity, the result of an abortion is the same. A living human entity is killed. Laws determining the 'rights' and legal value of that pre-birth human entity can change. Perceptions of that human entity can change (depending on if it is 'wanted' or not). But the result is the same.\n \n My two cents.", 
   {}, 
   100317, 
   null, 
   1111479000.0
  ], 
  [
   100357, 
   null, 
   "Wraith", 
   "Is it not \"thou shalt not murder\" which makes for a subtle but important difference?", 
   {}, 
   100341, 
   null, 
   1111494600.0
  ], 
  [
   100363, 
   null, 
   "trs", 
   "If their were no God/soul/afterlife/etc. ..., would abortion be necessarily immoral?\nIt's a good question, bringing to mind Plato's 'Eurythro', where Socrates asks ...Consider this: is what is pious loved by the gods because it is pious, or is it pious because it is loved by the gods? If the latter, there is no coherent morality, only dictate - be it a prohibition against murder or a mandate to commit genocide.", 
   {
    "post_info": {
     "post_title": "the Eurythro Dilemma"
    }
   }, 
   100288, 
   null, 
   1111499040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Religion and Killing", 
  "url": "http://www.4forums.com/political/religion-debates/4615-religion-killing.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4615, 
  "discussion_files": [
   [
    "27188.html", 
    "http://www.4forums.com/political/religion-debates/4615-religion-killing-print.html"
   ]
  ], 
  "identifier": 4615
 }
]