[
 [
  [
   100297, 
   null, 
   "zachvac", 
   "We just started reading 1984 in school. It is really scary at how close we are to that society, but I'm talking about one particular aspect, 2 minutes hate. It was basically time to hate the enemy of the Party and love the party by shouting insults at Goldstein, the enemy of the Party, on the telescreen. They do this every day and play bad music and say that he's the enemy and then everyone is very angry about his ideas about overthrowing Big Brother, the savior of democracy and they are angry about his ideas of freedom of the press, speech, and thought. Now while the pledge isn't quite as bad, it's skeleton is the same. It's a time where every day people talk about how great America is with such vague generalizations (liberty and justice for all). It is proclaiming that America is all-great much like 2 minutes hate was for the Party. Only in 2 minutes hate they were hating the enimies, here we are worshipping the nation.\n \n We are not forced to participate as in 2 minutes hate (well they didn't have to participate but they would have been killed by the thought police if they didn't), but to not participate is certainly frowned upon. Many people try to force kids to stand despite countless rulings by the Supreme Court saying it is illegal (I'll cite sources if anyone wants them). The pledge of allegiance is nothing but a brainwashing activity just as 2 minutes hate was in 1984.", 
   {
    "post_info": {
     "post_title": "The Pledge of Allegiance and 2 minutes hate"
    }
   }, 
   null, 
   null, 
   1111466820.0
  ], 
  [
   100312, 
   null, 
   "HeavenBound", 
   "We are not forced to participate as in 2 minutes hate (well they didn't have to participate but they would have been killed by the thought police if they didn't), but to not participate is certainly frowned upon. Many people try to force kids to stand despite countless rulings by the Supreme Court saying it is illegal (I'll cite sources if anyone wants them). The pledge of allegiance is nothing but a brainwashing activity just as 2 minutes hate was in 1984.\n\n \n \n I feel if you hate America so much, when you graduate move to another country that doesn't have so much pride in their country. The freedoms you have here are founded upon much spilled blood. No this country is not perfect nor will it ever be, but you have a lot more luxury, liberty and opportunities than you will anywhere else. You ever hear that saying, \"if you're not part of the solution, you're part of the problem.\" Just what have you done for this country lately? Being an American is like being part of a large family. You may have disagreements and what not, but you'll always be proud to be an american, because that's what families do they stick together no matter what. So, you can see why I have no sympathy for you having to listen to the pledge of allegiance, perhaps feeling some pride, for 2 lousy minutes of your day. Just how is it brainwashing anyone?", 
   {}, 
   100297, 
   null, 
   1111469220.0
  ], 
  [
   100653, 
   null, 
   "zachvac", 
   "I feel if you hate America so much, when you graduate move to another country that doesn't have so much pride in their country. The freedoms you have here are founded upon much spilled blood. No this country is not perfect nor will it ever be, but you have a lot more luxury, liberty and opportunities than you will anywhere else. You ever hear that saying, \"if you're not part of the solution, you're part of the problem.\" Just what have you done for this country lately? Being an American is like being part of a large family. You may have disagreements and what not, but you'll always be proud to be an american, because that's what families do they stick together no matter what. So, you can see why I have no sympathy for you having to listen to the pledge of allegiance, perhaps feeling some pride, for 2 lousy minutes of your day. Just how is it brainwashing anyone?\n\n \n But it has nothing to do with pride, it is a pointless brainwashing activity taking place every single day. We have kindergarteners saying the pledge (indivisible? they have no idea what any of the pledge means, much less feel pride). Everything you have said here could be argued for the country in 1984. I am patriotic and I stand for the national anthem every time. That's an expression of pride. But especially when people force you to show pride, it's not pride anymore. And since there is no problem, I can't be part of it. That quote was kind of random.\n \n How about this one? Since you're not part of the solution to stop serial killers, you must be part of the problem. Logical? I have pride for this country, but the country I owe my allegiance to doesn't have to force everyone to hear how great this country is. It allows people to disagree and it gets respect and pride without having to repeat a stupid string of words every single day.", 
   {}, 
   100312, 
   null, 
   1111556040.0
  ], 
  [
   101496, 
   null, 
   "zelma", 
   "Brainwashing: NOUN: 1. Intensive, forcible indoctrination, usually political or religious, aimed at destroying a person's basic convictions and attitudes and replacing them with an alternative set of fixed beliefs. \n \n How is reciting the Pledge of Allegiance filling the definition for brainwashing?\n \n I said the pledge all of my first six school years, and probably at some other instances in my life--what have I been brainwashed into thinking or believing?", 
   {}, 
   100653, 
   null, 
   1111807980.0
  ], 
  [
   101501, 
   null, 
   "zelma", 
   "what is the difference in the pledge of allegiance and the national anthem, since the song goes:\n \n Oh say does that star spangled banner yet wave--\n \n Have you ever noticed how people put their hands over their hearts while the national anthem is playing? \n \n Actually, I do not put my hand over my heart while the song is playing, I think it is a social blunder to do so, and I wonder where that started, because the song refers to the flag? There is no pledge involved, do you put your hand over your heart when the national anthem is played?", 
   {}, 
   101496, 
   null, 
   1111810080.0
  ], 
  [
   101508, 
   null, 
   "zachvac", 
   "what is the difference in the pledge of allegiance and the national anthem, since the song goes:\n \n Oh say does that star spangled banner yet wave--\n \n Have you ever noticed how people put their hands over their hearts while the national anthem is playing? \n \n Actually, I do not put my hand over my heart while the song is playing, I think it is a social blunder to do so, and I wonder where that started, because the song refers to the flag? There is no pledge involved, do you put your hand over your heart when the national anthem is played?\n\n \n I take off my hat for the anthem but don't put it on my heart. I don't know why you think it's a social blunder to do so. It's showing that they hold the nation close to their heart.", 
   {}, 
   101501, 
   null, 
   1111813440.0
  ], 
  [
   101510, 
   null, 
   "zachvac", 
   "Brainwashing: NOUN: 1. Intensive, forcible indoctrination, usually political or religious, aimed at destroying a person's basic convictions and attitudes and replacing them with an alternative set of fixed beliefs. \n \n How is reciting the Pledge of Allegiance filling the definition for brainwashing?\n \n I said the pledge all of my first six school years, and probably at some other instances in my life--what have I been brainwashed into thinking or believing?\n\n \n Well you seem to have proven my point. Intensive? Only repeated every single day of school. Political or religious? Both. Destroying the basic conviction that the United States might not be the greatest country. Trying to say that it is under God, and claim that there is liberty and justice for all as if it is the only country that is like this. This would fit under the given definition of brainwashing quite nicely.", 
   {}, 
   101496, 
   null, 
   1111813560.0
  ], 
  [
   101550, 
   null, 
   "zelma", 
   "The pledge does not state or imply that the USA is the only country under a god or with liberty and justice--or that it is the greatest country in the world.\n YOU are putting YOUR own (or your learned) interpretation out as the final subliminal meaning of the pledge of allegiance. \n \n While this may not be the most perfect country in the world, it is much better than some countries. There simply is not a perfect place to live, but I am thinking you are probably living in the USA and have up to this time enjoyed your rights and privileges that you have.\n \n If someone is making you recite the pledge (which I severely doubt), then you can file a lawsuit, but to use the internet to distort and twist the meaning of things like the pledge of allegiance is akin to mutiny.\n \n I don't like a lot of things about the government or what is going on economically and politically today, but dear, this mess is not the fault of the pledge of allegiance. You might take a look at the word global.", 
   {}, 
   101510, 
   null, 
   1111827780.0
  ], 
  [
   101614, 
   null, 
   "zachvac", 
   "I have yet to claim that it has caused any problems. I have stated that it is brainwashing to basically make (they aren't informed that they don't have to do it) kindergarteners recite the pledge when they don't know what half of it means. Kind of pointless, no?", 
   {}, 
   101550, 
   null, 
   1111860600.0
  ], 
  [
   102152, 
   null, 
   "zelma", 
   "zachvac, if you feel the pledge is pointless, that is your perogative. I think, initially, it was used as a tool to commence the official school day, provide group participation and instill some values about citizenship, which during the 20th century were pretty common social norms.", 
   {}, 
   101614, 
   null, 
   1112006220.0
  ], 
  [
   102264, 
   null, 
   "zachvac", 
   "zachvac, if you feel the pledge is pointless, that is your perogative. I think, initially, it was used as a tool to commence the official school day, provide group participation and instill some values about citizenship, which during the 20th century were pretty common social norms.\n\n \n \n and I'm sure kindergarteners saying words they didn't understand every day really inspired them to be good citizens.", 
   {}, 
   102152, 
   null, 
   1112045460.0
  ], 
  [
   102405, 
   null, 
   "Hunter", 
   "and I'm sure kindergarteners saying words they didn't understand every day really inspired them to be good citizens.\n\n \n BOY-HOWDY!!!! I am proud to be a patriotic American.\n American by chance, Southern by the Grace of God.", 
   {}, 
   102264, 
   null, 
   1112078460.0
  ], 
  [
   102424, 
   null, 
   "zelma", 
   "why do you think kindergarten age kids are... XXXXXX? You act like they can't comprehend any of the meaning of a pledge......you have a low opinion of the intelligence of youngsters. They really are not robots.", 
   {}, 
   102405, 
   null, 
   1112092440.0
  ], 
  [
   102458, 
   null, 
   "georged", 
   "Well you seem to have proven my point. Intensive? Only repeated every single day of school. Political or religious? Both. Destroying the basic conviction that the United States might not be the greatest country. Trying to say that it is under God, and claim that there is liberty and justice for all as if it is the only country that is like this. This would fit under the given definition of brainwashing quite nicely.\n\n \n You're going to be labeled unpatriotic by those robot citizens who believe everything their politicians tell them to believe. Personal responsibility and individuality are no longer fashionable in the land of the free, mythology and conformity now being the primary governing tools.", 
   {}, 
   101510, 
   null, 
   1112111880.0
  ], 
  [
   102545, 
   null, 
   "daewoo", 
   "Just wait a while, zachvac, you will see a lot more similarities between todays society and the one in 1984, and even when the similarity is crystal clear, there will be those here who will deny it.", 
   {}, 
   102458, 
   null, 
   1112127180.0
  ], 
  [
   102583, 
   null, 
   "zelma", 
   "Yes, you are going to see more and more similarities to 1984 only you are too tunnel visioned to see you are the very people who are causing the changes. I am not against changes, but go ahead and promote your police state--and little by little breakdown those inalienable rights to freedom of speech, assembly, etc. blend yourselves right into the One World Order.\n \n Who started the flack about the pledge of allegiance? An atheist who decided that he didn't want his daughter to recite it in school because it said God. Well it seemed to me, he was the one brainwashing his child and not allowing that child to grow and make decisions on her own about God. \n \n I suppose you also think that spanking a child is child abuse and the government needs to regulate child raising, schools now have police in the school every day--why, schools can't control children either--we must keep police around to control them. \n \n Lets break down all structure for the generations to come and surely the police state will be necessary.\n \n Take down the ten commandments--and put bombs on your chests and go get those virgins waitin on you.\n \n \n Oh hell, now I am just ranting....", 
   {}, 
   102545, 
   null, 
   1112135100.0
  ], 
  [
   102609, 
   null, 
   "sinjin", 
   "Who started the flack about the pledge of allegiance? An atheist who decided that he didn't want his daughter to recite it in school because it said God. Well it seemed to me, he was the one brainwashing his child and not allowing that child to grow and make decisions on her own about God. \n \n\n \n So your parents taught you nothing in the way of religion so that you could grow and make your own decisions about God, right?", 
   {}, 
   102583, 
   null, 
   1112139660.0
  ], 
  [
   102613, 
   null, 
   "gnojek", 
   "I feel if you hate America so much, when you graduate move to another country that doesn't have so much pride in their country.\n\n It's usually the countries where pride is forced that have the least freedom.\n \n \nThe freedoms you have here are founded upon much spilled blood. \n\n Are little kids entirely free to not say the pledge?\n And you are saying that soldiers sacrificed their lives so that little kids can be forced into allegiance, or at least the pledging of said allegiance.\n \n \nYou ever hear that saying, \"if you're not part of the solution, you're part of the problem.\"\n\n Yes, it's usually used by people who are part of the problem.\n \n \n Being an American is like being part of a large family. You may have disagreements and what not, but you'll always be proud to be an american, because that's what families do they stick together no matter what. So, you can see why I have no sympathy for you having to listen to the pledge of allegiance, perhaps feeling some pride, for 2 lousy minutes of your day. Just how is it brainwashing anyone?\n\n The point is that it is mandatory.\n If it were voluntary and people were just expressing their complete joy and happiness at being born in the bestest country in whole wide world, then he wouldn't have a point. Then he'd just be a whiner. But, the fact that saying the pledge is pretty mandatory in just about every school in the country would tell me that it is some form of indoctrination, if not brainwashing.\n \n If it were less mandatory, then we might have something out of 1984:\n \"There have been spontaneous demonstrations of party workers expressing their graitutude and joy.\"\n \n \"While Winston is in the cafeteria, the telescreen makes an announcement stating that production output is higher than ever, and that people have been engaging in spontaneous demonstrations all over the state to show their gratitude to Big Brother.\"\n \n See zachvac, in 1984 all the shows of gratitude were spontaneous, not forced like in the land of the free.\n \n \nwhy do you think kindergarten age kids are... XXXXXX? You act like they can't comprehend any of the meaning of a pledge......you have a low opinion of the intelligence of youngsters. They really are not robots.\n\n I'm sorry but how many 5 year olds can say indivisible much less know what it means? They don't know what liberty is or what it's about. They don't know what a republic is or care at all. Something tells me that the writer of the pledge had no clue that his nice little pledge would be rammed down the throats of little kids that don't even know what it means. {Actually, seeing as how it was distributed to schools right after it was written (by a socialist) something tells me it was part of a larger scheme. I wonder if that scheme had anything to do with socialism.}\n \n \nYes, you are going to see more and more similarities to 1984 only you are too tunnel visioned to see you are the very people who are causing the changes. I am not against changes, but go ahead and promote your police state--and little by little breakdown those inalienable rights to freedom of speech, assembly, etc. blend yourselves right into the One World Order.\n\n That's pretty funny.\n What police state are you talking about?\n The one where kids don't have to show their spontaneous gratitude to the state?\n \n \nWho started the flack about the pledge of allegiance? An atheist who decided that he didn't want his daughter to recite it in school because it said God. Well it seemed to me, he was the one brainwashing his child and not allowing that child to grow and make decisions on her own about God.\n\n No, this \"flack\" has been going on since the pledge was written.\n The first to object to its existence were Baptists who thought that saying a pledge was against the word of Jesus.\n Then it was the 7th day adventists who were speaking against it in the 1940s and 50s.\n There have been a few times the case has gone to the supreme court through the years, but I just can't find those references right now.\n \n Also, should the child make her own decision now and decide to not recite the pledge, would that be ok with you? What if that's the way it started? \"Daddy, I don't want to say the pledge.\" \"Ok, you don't have to.\" \"But the teacher says I'll be punished if I don't.\" Anyway, I actually have no idea what the specifics were.", 
   {}, 
   100312, 
   null, 
   1112140140.0
  ], 
  [
   102620, 
   null, 
   "georged", 
   "I feel if you hate America so much, when you graduate move to another country that doesn't have so much pride in their country. The freedoms you have here are founded upon much spilled blood. No this country is not perfect nor will it ever be, but you have a lot more luxury, liberty and opportunities than you will anywhere else. You ever hear that saying, \"if you're not part of the solution, you're part of the problem.\" Just what have you done for this country lately? Being an American is like being part of a large family. You may have disagreements and what not, but you'll always be proud to be an american, because that's what families do they stick together no matter what. So, you can see why I have no sympathy for you having to listen to the pledge of allegiance, perhaps feeling some pride, for 2 lousy minutes of your day. Just how is it brainwashing anyone?\n\n \n You aptly voice being part of the problem by insisting another be forced to listen to the pledge of allegiance or get out of the country. Perhaps your view of America is as one large family, but we're also known as one big family full of prejudice towards minorities, nations not following our ideology and anything 'foreign'. 'Sticking together' with those members of any family is blind loyalty without rational thought or a desire for improvement. Conceit and mental inbreeding is a more accurate description of your image of America.", 
   {}, 
   100312, 
   null, 
   1112141940.0
  ], 
  [
   102644, 
   null, 
   "pandion", 
   "The California case in which the Pledge of Allegiance was found to be unconstitutional by a district court and by the 9th Circuit Court of Appeals was based on the inclusion of the words \"under God.\" It had already been decided in the 1940s that a child can not be forced to recited the pledge, but the courts here decided that the recitation of the pledge including the words \"under God\" in a classroom is a violation of the Establishment Clause of the 1st Amendment.\n \n However, the case was appealed to the Supreme Court where it was overturned, not because the previous court decisions were in error, but because, in the opinion of the Supreme Court, the father did not have standing to file such a case. He was the non-custodial parent.\n \n But the religious right confuses their efforts to impose their religion on everyone with patriotism. President Bush (#41) even commented at one time that an atheist couldn't be a patriot. Talk about smug hypocrisy. Patriots can be a draft dodging, alchoholic crack heads, but they can't be atheists.\n \n It is interesting to note that the movement to insert the \"under God\" phrase into the Pledge happened during the cold war. The Catholic men's fraternal organization, the Knights of Columbus, wanted to somehow show that we were better than those dirty, red, commies, so they started a petition that was presented to Congress, and Congress passed a resolution and we now have \"under God\" in the Pledge. About the same time the \"In God We Trust\" was made universal on all our money. Previously it had only appeared on various coins from time to time since the Civil War.\n \n But as I look around in my city and I see what money mills the churchs are, many times making the ministers into millionaires, I realize how appropriate it is to declare trust in the christian god on our money.\n \n Isn't it ironic that Zelma and HeavenBound complain about a police state because the 1st Amendment prevents them from imposing their religion on school children by law? And whoever doesn't want to practice their religion should leave the country. How unamerican can one get?", 
   {}, 
   102613, 
   null, 
   1112146680.0
  ], 
  [
   102649, 
   null, 
   "Duo_Maxwell", 
   "Heaven, do you realize that most people have stopped using such arguments because, one not only are they fact free, but they ignorant of history as well as how this country works. Not to mention it makes you look not only extremely hateful, but questions your intelligence as well.", 
   {}, 
   102644, 
   null, 
   1112148960.0
  ], 
  [
   102653, 
   null, 
   "Big_Bear_Scot", 
   "Do you have to say the Pledge of Allegiance everyday in School ?\n \n As an outsider I find that strange, I don't need to pledge allegiance to anything in order to prove that I am citizen of my Country, I don't need to pledge to prove that I love my Country.\n \n Apologies to anybody if you I am in error about the pledge, just as someone who doesn't live in the US I find an alien concept to pledge allegiance to anybody or anything, hell I don't even need pledge allegiance to my Queen. I only need to do that if I want to take political office and even then I can do it under protest.", 
   {}, 
   102644, 
   null, 
   1112149260.0
  ], 
  [
   102723, 
   null, 
   "Hunter", 
   "Do you have to say the Pledge of Allegiance everyday in School ?\n \n As an outsider I find that strange, I don't need to pledge allegiance to anything in order to prove that I am citizen of my Country, I don't need to pledge to prove that I love my Country.\n \n Apologies to anybody if you I am in error about the pledge, just as someone who doesn't live in the US I find an alien concept to pledge allegiance to anybody or anything, hell I don't even need pledge allegiance to my Queen. I only need to do that if I want to take political office and even then I can do it under protest.\n\n \n Patriotism is a good thing and the Pledge is merely an expression of that. It causes no harm. Another good idea is reciting The Lord's Prayer. It also is a good thing and causes no harm.", 
   {}, 
   102653, 
   null, 
   1112163300.0
  ], 
  [
   102765, 
   null, 
   "georged", 
   "Patriotism is a good thing and the Pledge is merely an expression of that. It causes no harm. Another good idea is reciting The Lord's Prayer. It also is a good thing and causes no harm.\n\n \n Why do you feel them a 'good thing' for other people? Patriotism is a personal feeling associated with citizenship that should require no reinforcement by rote and not everyone is a Christian, rendering the prayer an individual statement. To impose a requirement on any other individual, including young children, to recite either or both is not what America is suposedly all about.", 
   {}, 
   102723, 
   null, 
   1112198340.0
  ], 
  [
   102781, 
   null, 
   "wilted_laughter", 
   "Patriotism is a good thing and the Pledge is merely an expression of that. It causes no harm. Another good idea is reciting The Lord's Prayer. It also is a good thing and causes no harm.\n\n \n A certain degree of civil patriotism is a good thing, up to the point it becomes blind nationalism.\n \n EDIT: I can certaintly see how the daily recital of one country's greatness could be interpreted as dangerous to judging when one country (or one's government representing one's country) acts in a manner inconsistent with your value system and/or one country's supposed value system. Does the pledge of allegence amount to that? I don't know, maybe in some cases it does and others it doesn't, varying upon the impressionability of the individual concerned and what other elements that individual is exposed to. Here's an interesting question: Does the pledge controbute to the supposed insular nature of America, either on its own or of part of a greater mesh of civil patriotism and self glorifying culture?", 
   {}, 
   102723, 
   null, 
   1112204040.0
  ], 
  [
   102794, 
   null, 
   "georged", 
   "\n EDIT: I can certaintly see how the daily recital of one country's greatness could be interpreted as dangerous to judging when one country (or one's government representing one's country) acts in a manner inconsistent with your value system and/or one country's supposed value system. Does the pledge of allegence amount to that? I don't know, maybe in some cases it does and others it doesn't, varying upon the impressionability of the individual concerned and what other elements that individual is exposed to. Here's an interesting question: Does the pledge controbute to the supposed insular nature of America, either on its own or of part of a greater mesh of civil patriotism and self glorifying culture?\n\n \n If the individual is at the end of formative years and entering adolescent development I don't think there's any question of impressionability. With regard to a self-glorifying culture, we seemingly have no modesty about forcing our ideology complete with social ills on other, weaker nations.", 
   {}, 
   102781, 
   null, 
   1112206200.0
  ], 
  [
   102808, 
   null, 
   "jitobear", 
   "Patriotism is a good thing and the Pledge is merely an expression of that. It causes no harm. Another good idea is reciting The Lord's Prayer. It also is a good thing and causes no harm.\n\n \n Patriotism is fine. But pride is something felt and certainly not something that can be demanded. Rambling off the pledge doesn't constitute patriotism - it's constitutes memorization. I agree that it does no harm - I also feel it does no good. The little ones don't understand it and most teens could pretty much care less. \n \n There is nothing wrong with the Lord's prayer either, but prayer is an act of worship and should either be done privately or in church. It's not something teachers should lead kids through in public school. \n \n Also, rambling the words of the Lords Prayer is not indication of faith any more than rambling the pledge is an indicator of patriotism, it is, again, memorization. The prayer is was a model - an example. It's funny how it will get chanted again and again even though a few verses prior to it Jesus says prayer should not just be the recitation of the same thing day in and day out. A prayer requires a little bit of though and concentration - you are talking to God after all.", 
   {}, 
   102723, 
   null, 
   1112208720.0
  ], 
  [
   102842, 
   null, 
   "zelma", 
   "Okay, tear this one up.\n If you are saying, the pledge of allegiance should not be recited in school-- It is not that you think it is stupid, you are actually just wanting to take away a christian connotation in the oath, it is the christian (one God) that you are really against, not the pledge as a whole. right?\n \n No, I am not influenced by any politician. I am not into \"politically correct\" labels such as liberal, right wing, et. al , bandwagon labels. I am not affiliated with any party--I am not even a registered voter. \n \n And yes, religion was not forced on me as a child. My parents never set foot in a church, but I was taught that it was wrong to lie, steal, cheat, etc. I was exposed to religion by choice. Believe it or not. I am not a member of any church either, I simply believe in God.\n \n In my opinion, taking christian values out of society is causing a major breakdown in the moral fabric in the country and society as a whole. Why do you want to remove christianity? How is this country going to be better when all things relating to God are declared unconstitutional?\n \n Fill me in if anyone has ever been told they can not worship their Muslim, Catholic, Buddhist, etc. religion in the USA. I don't think so, I have attended the Catholic Church, Baptist, Nazarene, Church of Christ in my past. I don't attend church reguarly, actually, I don't even go at all anymore. Reciting the pledge of allegiance did not force me into believing in one God.\n \n So, be truthful about what you believe-you don't think the pledge is brainwashing anyone-you are simply against God. Is it that you want a country that is atheist? What do really want?", 
   {}, 
   102545, 
   null, 
   1112215200.0
  ], 
  [
   102846, 
   null, 
   "AlokaParyetra", 
   "If you are saying, the pledge of allegiance should not be recited in school-- It is not that you think it is stupid, you are actually just wanting to take away a christian connotation in the oath, it is the christian (one God) that you are really against, not the pledge as a whole. right?\n \n\n \n Why do you assume that the God under which the pledge states the nation is under is automatically christian? I always thought we were under the God of Baha'i.\n \n\n In my opinion, taking christian values out of society is causing a major breakdown in the moral fabric in the country and society as a whole. Why do you want to remove christianity? How is this country going to be better when all things relating to God are declared unconstitutional?\n \n\n \n I don't speak for everyone, but parts of the above really rile me. Especially the use of the phrase, \"christian value.\" The fact that all moral issues are somehow the result of christianity in the U.S.A bellittles the human ability reasoning and innate social order. How come these values are inherently christian? It is suggestive that such \"moral ethics\" are of christianity only. How come we don't have muslim values? Many of the moral issues brought up by christians are shared by muslims. How about buddhist values? Why don't we replace the phrase \"christian values\" with \"buddhist values?\" A simple reading of buddhist religious text reveals a comprehension of human ethics beyond common law. Zoroastrian values found in the Zend-Avesta? Hindu ethics found in the Vedas and Upanishads? How about atheist values? The common notion is that atheist are some-how immoral people without any realization of cause and effect, right and wrong. The use of the phrase, \"christian values\" suggest that only christians have any sense of right and wrong.\n \n I don't expect nor want Nitzche's (spelling?) quotes pasted on every wall. I don't want little children to learn during school why there is no god. Instead, all i hope for is for my tax dollars and my contribution to the U.S.A to serve a secular cause. No God, no anti-God; just non prejudicial morals.\n \n BUT, besides all of this, i DO NOT think zachvac's opposition to the pledge has to do with the phrase, \"under God.\" I am willing to bet he still would not like it even if the words \"under God\" were removed.\n \n \n\n Patriotism is a good thing and the Pledge is merely an expression of that. It causes no harm. Another good idea is reciting The Lord's Prayer. It also is a good thing and causes no harm.\n \n\n \n Yes, let us recite the Lord's Prayer. In fact, we should recite the Lord's Prayer as it is found in the Rig Veda. This will bring forth proper religious morals. Repeat after me:\n \n \n\n 1 NE'ER doth the man repent, who, seeking profit, bringeth his gift to the far-striding Visnu.\n He who adoreth him with all his spirit winneth himself so great a benefactor.\n 2 Thou, Visnu, constant in thy courses, gavest good-will to all men, and a hymn that lasteth,\n That thou mightst move us to abundant comfort of very splendid wealth with store of horses.\n 3 Three times strode forth this God in all his grandeur over this earth bright with a hundred splendours.\n Foremost be Visnu, stronger than the strongest: for glorious is his name who lives for ever.\n 4 Over this earth with mighty step strode Visnu, ready to give it for a home to Manu.\n In him the humble people trust for safety: he, nobly born, hath made them spacious dwellings.\n 5 To-day I laud this name, O gipivista, I, skilled in rules, the name of thee the Noble.\n Yea, I the poor and weak praise thee the Mighty who dwellest in the realm beyond this region.\n 6 What was there to be blamed in thee, O Visnu, when thou declaredst, I am Sipivista?\n Hide not this form from us, nor keep it secret, since thou didst wear another shape in battle.\n 7 O Visnu, unto thee my lips cry Vasat! Let this mine offering, Sipivista, please thee.\n May these my songs of eulogy exalt thee. Preserve us evermore, ye Gods, with blessings.\n \n\n \n I say we should recite the above at the start of each day in all schools. Afterall, it does no harm now, does it?", 
   {}, 
   102842, 
   null, 
   1112216280.0
  ], 
  [
   103004, 
   null, 
   "Hunter", 
   "Patriotism is fine. But pride is something felt and certainly not something that can be demanded. Rambling off the pledge doesn't constitute patriotism - it's constitutes memorization. I agree that it does no harm - I also feel it does no good. The little ones don't understand it and most teens could pretty much care less. \n \n There is nothing wrong with the Lord's prayer either, but prayer is an act of worship and should either be done privately or in church. It's not something teachers should lead kids through in public school. \n \n Also, rambling the words of the Lords Prayer is not indication of faith any more than rambling the pledge is an indicator of patriotism, it is, again, memorization. The prayer is was a model - an example. It's funny how it will get chanted again and again even though a few verses prior to it Jesus says prayer should not just be the recitation of the same thing day in and day out. A prayer requires a little bit of though and concentration - you are talking to God after all.\n\n \n As long as there are math tests in school, there will always be prayer. Case closed. emoticon_cool", 
   {}, 
   102808, 
   null, 
   1112249460.0
  ], 
  [
   103011, 
   null, 
   "jitobear", 
   "As long as there are math tests in school, there will always be prayer. Case closed. emoticon_cool\n\n \n As long as it is said privately - that is just fine. Although I would not count on the Lord stepping in if you didn't bother to study....", 
   {}, 
   103004, 
   null, 
   1112254500.0
  ], 
  [
   103030, 
   null, 
   "zelma", 
   "Oh, excuse me...I was under the impression that this was a country's values were primarily based on christianity. \n \n I don't know where you live, but there is no prayer in school in the state I live in--well, it is sorta like smokers, the students can go outside and say a prayer if they want, but there is no prayer during school hours in the school.\n \n To Aloka Paryetra\n \n I guess if i was talking about muslim values, the pledge would say Allah--if it were Buddhist values, the pledge would say Budda. so the pledge is based on christian values, hence God. I am not trying to infer that christians are the only people with values.", 
   {}, 
   103011, 
   null, 
   1112262060.0
  ], 
  [
   103084, 
   null, 
   "georged", 
   "\n In my opinion, taking christian values out of society is causing a major breakdown in the moral fabric in the country and society as a whole. Why do you want to remove christianity? How is this country going to be better when all things relating to God are declared unconstitutional?\n \n\n \n It isn't obvious to you that a pledge of allegiance using under god is mixing god in as a condition of allegiance to a nation? A condition our founders avoided for the very reason you're promoting? \n \n To assume Christian values equate to the moral fabric of any nation is stating moral legislation of that country will be determined by a mythical belief system, not what any thinking individual from any era would term rational direction. If civil organization of a governing system is to be dictated by mythical belief, why not use a dead tree, rock or other inanimate object as the center of worship so 'special' people can interpret that object's desires? What would be the difference between that worship than say a Pacific Ocean Island Cargo Cult or Christians? All are based on mythology.", 
   {}, 
   102842, 
   null, 
   1112286480.0
  ], 
  [
   103099, 
   null, 
   "jyoshu", 
   "It isn't obvious to you that a pledge of allegiance using under god is mixing god in as a condition of allegiance to a nation? A condition our founders avoided for the very reason you're promoting?\n\n \n It's true that \"under God\" was added later, but I think it's a stretch to say that the pledge portrays belief on God as a condition for allegiance. There are ways it could have been worded much more obviously if that were the intent when the line was added. \n \n At the same time, if the phrase were removed, I don't think it would be any less of a valid pledge of allegiance. However, I don't think the issue is a big enough deal to warrant removing the phrase. References and acknowledgements of a divine authority are all in our govt.: congressional prayers, govt. chaplains, inscriptions on state buildings, inscriptions on our currency, even wording in the Declaration of Independence. It would come off as nothing short of a frenzied witch hunt to attempt to remove every one of these references and acknowledgements of a divine power in government. None of them are harmful, and it's just not worth fooling with, given the amount of legal entanglements it would take and the fact it would infuriate perhaps the majority of Americans. Separation of church and state doesn't have to mean that the beliefs and ideals the majority of the people hold dear should not even be mentioned the moment someone enters a govt. building.\n \n \nTo assume Christian values equate to the moral fabric of any nation is stating moral legislation of that country will be determined by a mythical belief system . . . . If civil organization of a governing system is to be dictated by mythical belief . . . \n\n \n There's nothing mythical about the Christian value that stealing is wrong, or that murder is immoral. There's nothing mythical about the Christian ideal that it's a good idea to do unto others as you would want them to do unto you. These aren't myths, they are priniciples, and they are good ones. I see no reason for our laws not to reflect these priniciples.", 
   {}, 
   103084, 
   null, 
   1112289300.0
  ], 
  [
   103109, 
   null, 
   "sinjin", 
   "It's true that \"under God\" was added later, but I think it's a stretch to say that the pledge portrays belief on God as a condition for allegiance. There are ways it could have been worded much more obviously if that were the intent when the line was added. \n \n At the same time, if the phrase were removed, I don't think it would be any less of a valid pledge of allegiance. However, I don't think the issue is a big enough deal to warrant removing the phrase. References and acknowledgements of a divine authority are all in our govt.: congressional prayers, govt. chaplains, inscriptions on state buildings, inscriptions on our currency, even wording in the Declaration of Independence. It would come off as nothing short of a frenzied witch hunt to attempt to remove every one of these references and acknowledgements of a divine power in government. None of them are harmful, and it's just not worth fooling with, given the amount of legal entanglements it would take and the fact it would infuriate perhaps the majority of Americans. Separation of church and state doesn't have to mean that the beliefs and ideals the majority of the people hold dear should not even be mentioned the moment someone enters a govt. building.\n \n There's nothing mythical about the Christian value that stealing is wrong, or that murder is immoral. There's nothing mythical about the Christian ideal that it's a good idea to do unto others as you would want them to do unto you. These aren't myths, they are priniciples, and they are good ones. I see no reason for our laws not to reflect these priniciples.\n\n \n I think the \"Founding Fathers\" would find no fault with your reasoning here, nor do I. Well said.", 
   {}, 
   103099, 
   null, 
   1112291640.0
  ], 
  [
   103113, 
   null, 
   "georged", 
   "It's true that \"under God\" was added later, but I think it's a stretch to say that the pledge portrays belief on God as a condition for allegiance. There are ways it could have been worded much more obviously if that were the intent when the line was added. \n \n\n \n I was under the impression 'under god' was added in 1954 after a campaign by a Catholic male fraternal organization, Knights of Columbus, to illustrate how superior the US was to 'godless communists'. And not one congressional member voted against it out of fear of offending the Christian vote. Under god seems very obvious, was intentional and a condition of allegiance. It is a pledge, is it not?\n \n Confusing common sense with or substituting for and taking credit for is one thing mythical belief systems excel at. Attaching their encompassing carrot and stick definition of sin usually destroys the common sense aspect.", 
   {}, 
   103099, 
   null, 
   1112291880.0
  ], 
  [
   103141, 
   null, 
   "zelma", 
   "The pledge is to the flag, and the republic for which it stands. It is not a pledge to God. As I stated before, those who oppose reciting the pledge in school are really against the reference to God, not that they feel the pledge is senseless jibber that school children say out of brainwashing.\n \n Interesting discussion.", 
   {}, 
   103113, 
   null, 
   1112298720.0
  ], 
  [
   103142, 
   null, 
   "wilted_laughter", 
   "So why not just remove the reference and save all the hassle?", 
   {}, 
   103141, 
   null, 
   1112298960.0
  ], 
  [
   103240, 
   null, 
   "gnojek", 
   "Oh, excuse me...I was under the impression that this was a country's values were primarily based on christianity.\n\n No, it's built on democratic and libertarian values.\n It has strayed from these considerably.\n \n \n \nTo Aloka Paryetra\n \n I guess if i was talking about muslim values, the pledge would say Allah--if it were Buddhist values, the pledge would say Budda. so the pledge is based on christian values, hence God. I am not trying to infer that christians are the only people with values.\n\n Yeah, I know you weren't talking to me.\n \n Why would it say under Allah when the pledge is in english?\n Allah is just arabic for God.\n Buddha isn't considered a god, per se.\n In Buddhism there is no one eternal god, but \"gods\" that are created by the universe.\n \n I'd like to know where you see christian values in the original pledge. The original pledge from http://history.vineyard.net/pledge.htm .\n \n \n'I pledge allegiance to my Flag and (to*) the Republic for which it stands, one nation, indivisible, with liberty and justice for all.' He considered placing the word, 'equality,' in his Pledge, but knew that the state superintendents of education on his committee were against equality for women and African Americans. [ * 'to' added in October, 1892. ]\n", 
   {}, 
   103030, 
   null, 
   1112315280.0
  ], 
  [
   103340, 
   null, 
   "zachvac", 
   "why do you think kindergarten age kids are... XXXXXX? You act like they can't comprehend any of the meaning of a pledge......you have a low opinion of the intelligence of youngsters. They really are not robots.\n\n \n Are you serious? Have you ever seen kindergarteners recite the pledge? I will guarentee you the average kindergartener doesn't know the meaning of indivisible or allegiance.", 
   {}, 
   102424, 
   null, 
   1112337720.0
  ], 
  [
   103341, 
   null, 
   "zachvac", 
   "Yes, you are going to see more and more similarities to 1984 only you are too tunnel visioned to see you are the very people who are causing the changes. I am not against changes, but go ahead and promote your police state--and little by little breakdown those inalienable rights to freedom of speech, assembly, etc. blend yourselves right into the One World Order.\n \n Who started the flack about the pledge of allegiance? An atheist who decided that he didn't want his daughter to recite it in school because it said God. Well it seemed to me, he was the one brainwashing his child and not allowing that child to grow and make decisions on her own about God. \n \n I suppose you also think that spanking a child is child abuse and the government needs to regulate child raising, schools now have police in the school every day--why, schools can't control children either--we must keep police around to control them. \n \n Lets break down all structure for the generations to come and surely the police state will be necessary.\n \n Take down the ten commandments--and put bombs on your chests and go get those virgins waitin on you.\n \n \n Oh hell, now I am just ranting....\n\n \n Wow, you're calling me too narrow-minded? You think the pledge issue started with the atheist who didn't want his daughter to recite the pledge? There have been countless battles in school and the real start of that ruling is from tinker v. Des Moines, many years ago. I totally agree with you that he shouldn't teach his daughter that there is no God but if the kid agreed with it (minors can't sue) then I have no problem. I don't think spanking is child abuse. I don't support a police state but you are right we are going ever closer. With actions such as the Patriot Act and Congress passing laws to bypass the normal court rules (in the Terry Schiavo case taking it to the federal government).", 
   {}, 
   102583, 
   null, 
   1112338140.0
  ], 
  [
   103344, 
   null, 
   "zachvac", 
   "Okay, tear this one up.\n If you are saying, the pledge of allegiance should not be recited in school-- It is not that you think it is stupid, you are actually just wanting to take away a christian connotation in the oath, it is the christian (one God) that you are really against, not the pledge as a whole. right?\n \n No, I am not influenced by any politician. I am not into \"politically correct\" labels such as liberal, right wing, et. al , bandwagon labels. I am not affiliated with any party--I am not even a registered voter. \n \n And yes, religion was not forced on me as a child. My parents never set foot in a church, but I was taught that it was wrong to lie, steal, cheat, etc. I was exposed to religion by choice. Believe it or not. I am not a member of any church either, I simply believe in God.\n \n In my opinion, taking christian values out of society is causing a major breakdown in the moral fabric in the country and society as a whole. Why do you want to remove christianity? How is this country going to be better when all things relating to God are declared unconstitutional?\n \n Fill me in if anyone has ever been told they can not worship their Muslim, Catholic, Buddhist, etc. religion in the USA. I don't think so, I have attended the Catholic Church, Baptist, Nazarene, Church of Christ in my past. I don't attend church reguarly, actually, I don't even go at all anymore. Reciting the pledge of allegiance did not force me into believing in one God.\n \n So, be truthful about what you believe-you don't think the pledge is brainwashing anyone-you are simply against God. Is it that you want a country that is atheist? What do really want?\n\n \n \n I don't agree with the under god part of it but that's not all. I have explained why I think the pledge as a whole shouldn't be in public schools, not just the under god part.\n \n \"Fill me in if anyone has ever been told they can not worship their Muslim, Catholic, Buddhist, etc. religion in the USA.\"\n fill me in if anyone has every been told they can not worship their Christian religion in the USA.\n \n I also am being raised with no religious influence. My parents have said if I want they will drive me to a church and have explained to me a little about the major religions. I have come to the conclusion that I don't see any proof for a God. There may be one, but the Earth also may have been created by Martians. That's what I believe.", 
   {}, 
   102842, 
   null, 
   1112338740.0
  ], 
  [
   103345, 
   null, 
   "zachvac", 
   "Oh, excuse me...I was under the impression that this was a country's values were primarily based on christianity. \n \n I don't know where you live, but there is no prayer in school in the state I live in--well, it is sorta like smokers, the students can go outside and say a prayer if they want, but there is no prayer during school hours in the school.\n \n\n That is just as wrong as having school-sponsored prayer. You should be able to pray during passing periods, lunch time, or a religious club after school. You should not have to go outside. You should also get off for religious holidays if you don't already.", 
   {}, 
   103030, 
   null, 
   1112339100.0
  ], 
  [
   103404, 
   null, 
   "zachvac", 
   "It's true that \"under God\" was added later, but I think it's a stretch to say that the pledge portrays belief on God as a condition for allegiance. There are ways it could have been worded much more obviously if that were the intent when the line was added. \n \n\n There was a quote that addressed this, something like:\n \"Under God gives the same status to atheists in this country as liberty gives to tyrants, justice gives to criminals, and indivisible gives to rebels wishing to divide the country.\"\n \n \n \n\n At the same time, if the phrase were removed, I don't think it would be any less of a valid pledge of allegiance. However, I don't think the issue is a big enough deal to warrant removing the phrase.\n \n\n If it's not a big deal you wouldn't mind changing it? It really isn't that hard. They changed it to under God pretty easily, do the same only take it out. And while you're at it remove it from schools. I think the whole \"It isn't a big deal\" argument is just because you don't have an argument to stand on so you act like it's a big deal to remove 2 words.\n \n \n \n \nReferences and acknowledgements of a divine authority are all in our govt.: congressional prayers, govt. chaplains, inscriptions on state buildings, inscriptions on our currency, even wording in the Declaration of Independence.\n \n\n All of which I oppose except for the DOI which was a letter and is in no way official.\n \n \n \n\n It would come off as nothing short of a frenzied witch hunt to attempt to remove every one of these references and acknowledgements of a divine power in government.\n \n\n We don't have to go on a which hunt. We'll remove under God and In God we trust. Acknowledgements are fine but blantant statements such as these are just plain not true. We as a country do not trust in God (even if every citizen did, the country itself remains secular).\n \n \n \n\n None of them are harmful, and it's just not worth fooling with, given the amount of legal entanglements it would take and the fact it would infuriate perhaps the majority of Americans. Separation of church and state doesn't have to mean that the beliefs and ideals the majority of the people hold dear should not even be mentioned the moment someone enters a govt. building.\n \n\n So what would you call separation of church and state? It means that the government doesn't endorse religion and if that goes against the majority of the people so be it. Let them mention God all they want in govt. buildings, but not an official statement from the govt. telling me that there is a god.\n \n \n\n There's nothing mythical about the Christian value that stealing is wrong, or that murder is immoral. There's nothing mythical about the Christian ideal that it's a good idea to do unto others as you would want them to do unto you. These aren't myths, they are priniciples, and they are good ones. I see no reason for our laws not to reflect these priniciples.\n\n So you think if it were not for Christianity that people would steal and kill?", 
   {}, 
   103099, 
   null, 
   1112373780.0
  ], 
  [
   103876, 
   null, 
   "jyoshu", 
   "If it's not a big deal you wouldn't mind changing it? It really isn't that hard. They changed it to under God pretty easily, do the same only take it out. And while you're at it remove it from schools. I think the whole \"It isn't a big deal\" argument is just because you don't have an argument to stand on so you act like it's a big deal to remove 2 words.\n\n \n What's the point? No one is harmed by the religious allusions on our currency, inscriptions on state courthouses, congressional chaplains, congressional prayers, or the line \"under God\" in the pledge. If there is a reason (such as harm) to enforce separation of church and state in these cases, that's fine. Otherwise it's just wasting tax payer money and resources on an unncessary witch hunt. Use your resources to help people that have a real need instead of making sure religion can't be uttered in the halls of government. We have too many other, more serious problems in this country.\n \n \nWe don't have to go on a which hunt. We'll remove under God and In God we trust. Acknowledgements are fine but blantant statements such as these are just plain not true. We as a country do not trust in God (even if every citizen did, the country itself remains secular).\n\n \n If you start trying to strike any mention of a higher-power from govt. pledges, coins, and buildings, you're on a witch hunt, pure and simple. At least admit it.\n \n \nSo what would you call separation of church and state? It means that the government doesn't endorse religion and if that goes against the majority of the people so be it. Let them mention God all they want in govt. buildings, but not an official statement from the govt. telling me that there is a god.\n\n \n The statement's intention in the pledge isn't to tell you there's a God. Like I said I wouldn't care that much either way--it's still a good pledge regardless. But we have to pick our battles in this country and from what I can see, it's just not worth the legal entanglements and infuriating all the people it will infuriate. Let's use our resources for things that will help people and do good rather than being obsessed with eradicating religion. It would be different if it were an issue of harm going on, but it's not. Nobody's really being harmed by the \"under God\" phrase or the phrase on our currency. There may come a time when it will be warranted for some reason to carry out this purging that you think is needed, but I don't think it's necessary at this point.\n \n \n \nSo you think if it were not for Christianity that people would steal and kill?\n\n \n I didn't say that. Nevertheless \"thou shalt not steal\" is a Christian teaching. As I said, that's not mythology, it's a principle--and a pretty good one if you ask me.", 
   {}, 
   103404, 
   null, 
   1112563740.0
  ], 
  [
   103891, 
   null, 
   "zachvac", 
   "What's the point? No one is harmed by the religious allusions on our currency, inscriptions on state courthouses, congressional chaplains, congressional prayers, or the line \"under God\" in the pledge. If there is a reason (such as harm) to enforce separation of church and state in these cases, that's fine. Otherwise it's just wasting tax payer money and resources on an unncessary witch hunt. Use your resources to help people that have a real need instead of making sure religion can't be uttered in the halls of government. We have too many other, more serious problems in this country.\n \n\n But this kind of thing does offend people who don't believe in God. Would you feel the same if we had pledges and slogans with \"white supremecy\" in them?\n \n Wasting taxpayers money? Technically it costs money for each \"in God we trust\" put on money. Ink isn't free. Taking it off would actually save money.\n \n \n \n\n If you start trying to strike any mention of a higher-power from govt. pledges, coins, and buildings, you're on a witch hunt, pure and simple. At least admit it.\n \n\n Whatever you call it, we tackle each instance at a time.\n \n \n \n\n The statement's intention in the pledge isn't to tell you there's a God. Like I said I wouldn't care that much either way--it's still a good pledge regardless. But we have to pick our battles in this country and from what I can see, it's just not worth the legal entanglements and infuriating all the people it will infuriate. Let's use our resources for things that will help people and do good rather than being obsessed with eradicating religion. It would be different if it were an issue of harm going on, but it's not. Nobody's really being harmed by the \"under God\" phrase or the phrase on our currency. There may come a time when it will be warranted for some reason to carry out this purging that you think is needed, but I don't think it's necessary at this point.\n \n\n Yet people like you spend more time saying we don't need to waste time than the time it would actually take to just remove it.\n \n The intention isn't to tell you there's a God, only to tell you that real Americans believe in God. That was the reason it was added, trying to say that us Americans who are under God are better than those Commies. It is saying that us real Americans believe in God. That isn't the case and this phrase has to go because it is illegal. The whole pledge should go, but that's just an opinion with no legal backing.\n \n \n \n\n I didn't say that. Nevertheless \"thou shalt not steal\" is a Christian teaching. As I said, that's not mythology, it's a principle--and a pretty good one if you ask me.\n\n No one ever denied that, but to make Christianity the basis of our laws just because it has somee good priniciples is not right. Sure we should have the rule not to steal, but that would be a law without Christianity. We had that law because people didn't like other people stealing their stuff.", 
   {}, 
   103876, 
   null, 
   1112567040.0
  ], 
  [
   104042, 
   null, 
   "jyoshu", 
   "But this kind of thing does offend people who don't believe in God. Would you feel the same if we had pledges and slogans with \"white supremecy\" in them?\n\n \n But you have to ask \"why\" it offends. Why would it offend anyone who doesn't believe in God if there's no harm issue going on? There are good reasons that black people (for instance) are offended at racism: it causes them harm. But that's not the case with what we are talking about. People get offended for all sorts of reasons at government in this country. If the govt. tried to accomodated everyone, we wouldn't even have a government. To start making changes, we have to have a good reason for this \"being offended\" to be criteria for change. Anyone coming along and saying, \"that offends me\" isn't good enough. For instance, someone may come along and say \"the Washington monument offends me because it could be construed as a phallic symbol, so I want it removed.\" They may indeed feel offended, but that's not good enough reason to remove it.\n \n \nWasting taxpayers money? Technically it costs money for each \"in God we trust\" put on money. Ink isn't free. Taking it off would actually save money.\n\n \n Nah, I doubt it would make that much difference either way, considering all the ink that's already on our paper money.\n \n \nYet people like you spend more time saying we don't need to waste time than the time it would actually take to just remove it.\n\n \n Now you're just being silly. If you tried to purge govt. from all the religious mentionings and use, you'd have a protracted and expensive legal mess on your hands. It's taken literally years to get \"under God\" removed (and it still isn't), so you should realize that it would be a long drawn out process.\n \n \nThat was the reason it was added, trying to say that us Americans who are under God are better than those Commies. \n\n \n Well, we are. We have many freedoms here that communist countries do not. We not only have freedom of religion (unlike communist countries), we have a culture that is quite religious. To me, the phrase \"under God\" can just as easily be construed to mean that we allow that culture to thrive because we are a free nation. One of the biggest reasons our nation was founded was over the need for religious freedom. And I don't think it's an accident that modern free countries embrace religion, while those that aren't free often do not. (there are some exceptions--the Taliban for instance embraced religion but they weren't free.) So I think that we indeed ARE better off. I can only speak for myself, but I'd much rather live here than a communist country. Maybe you feel differently, and that's fine.\n \n \nNo one ever denied that, but to make Christianity the basis of our laws just because it has somee good priniciples is not right.\n\n \n Strawman on your part--no one here is saying \"make Christianity the basis of our laws.\"\n \n You've taken my conversation with GeorgeD and made it into something it was not. He was saying that we shouldn't take a mythology and equate it to the \"moral fabric of\" a nation. I was pointing out that it's not the supposedly mythological aspects of the religion (characters, miracles, etc.) that make the morality, but rather the principles.", 
   {}, 
   103891, 
   null, 
   1112626800.0
  ], 
  [
   104045, 
   null, 
   "Eddie", 
   "Filthy hippie-commie-scum. God will teach you. He will smite you like you`ve never been smited before. And then he`ll do it again!\n \n oh, and :p", 
   {}, 
   104042, 
   null, 
   1112627280.0
  ], 
  [
   104108, 
   null, 
   "wilted_laughter", 
   "Filthy hippie-commie-scum. God will teach you. He will smite you like you`ve never been smited before. And then he`ll do it again!\n \n oh, and :p\n\n \n emoticon_smile emoticon_xhoho emoticon_smile", 
   {}, 
   104045, 
   null, 
   1112645760.0
  ], 
  [
   104235, 
   null, 
   "zachvac", 
   "But you have to ask \"why\" it offends. Why would it offend anyone who doesn't believe in God if there's no harm issue going on? There are good reasons that black people (for instance) are offended at racism: it causes them harm. But that's not the case with what we are talking about. People get offended for all sorts of reasons at government in this country. If the govt. tried to accomodated everyone, we wouldn't even have a government. To start making changes, we have to have a good reason for this \"being offended\" to be criteria for change. Anyone coming along and saying, \"that offends me\" isn't good enough. For instance, someone may come along and say \"the Washington monument offends me because it could be construed as a phallic symbol, so I want it removed.\" They may indeed feel offended, but that's not good enough reason to remove it.\n\n I'm not talking about racism. I'm just talking about a slogan saying whites are supreme. No actual harm done in this statement. In a similar way same thing with religion, but when the government acts on these principles in the past we've seen some pretty bad consequences. And it's not just because it offends people, it's a little thing called the 1st ammendment.\n \n \n \n\n Nah, I doubt it would make that much difference either way, considering all the ink that's already on our paper money.\n \n\n I was kind of joking here, but they still print new money, and it doesn't cost much to just start not printing it.\n \n \n\n Now you're just being silly. If you tried to purge govt. from all the religious mentionings and use, you'd have a protracted and expensive legal mess on your hands. It's taken literally years to get \"under God\" removed (and it still isn't), so you should realize that it would be a long drawn out process.\n \n\n I'm not trying to do that. I'm trying to remove \"under God\" and \"in God we Trust\". That's all. Later I may sue for other things as well but for now just remove those 2. It's not an all or nothing scenario. You can remove some and not all.\n \n \n\n Well, we are. We have many freedoms here that communist countries do not. We not only have freedom of religion (unlike communist countries), we have a culture that is quite religious. To me, the phrase \"under God\" can just as easily be construed to mean that we allow that culture to thrive because we are a free nation. One of the biggest reasons our nation was founded was over the need for religious freedom. And I don't think it's an accident that modern free countries embrace religion, while those that aren't free often do not. (there are some exceptions--the Taliban for instance embraced religion but they weren't free.) So I think that we indeed ARE better off. I can only speak for myself, but I'd much rather live here than a communist country. Maybe you feel differently, and that's fine.\n \n\n My original comment was that we were claiming we were better because we believe in God. That very much makes the claim that any \"real\" American believes in God. But I'll take up these points as well :)\n You say we have freedom of religion yet we use that as an excuse to impose a certain religion on the population? And \"under God\" can not mean we allow the culture of religion. Because we are free we allow people to be racist as well (as long as they don't commit a violent act) so why not say under the KKK? Under does not mean we have allowed people to believe in, sorry but that's the biggest stretch of that phrase I have ever heard, and I've heard some stretches.\n \n I totally aggree with you that we are better off because we allow freedom of religion. But we are very hypocritical to say we have all these freedoms like freedom to disagree with the government and then we force people to recite a pledge in support of the government and claiming how much better we are? Now that's plain arrogance and it goes back to the original topic. I don't care if the US is the best country in the world, people should know it without having to recite a pledge every day proclaiming it.\n \n \n\n Strawman on your part--no one here is saying \"make Christianity the basis of our laws.\"\n \n\n But you said societies were better with laws based on Christianity, right? Sorry if I misunderstood you.\n \n \n\n You've taken my conversation with GeorgeD and made it into something it was not. He was saying that we shouldn't take a mythology and equate it to the \"moral fabric of\" a nation. I was pointing out that it's not the supposedly mythological aspects of the religion (characters, miracles, etc.) that make the morality, but rather the principles.\n\n \n OK, sorry for the misunderstanding, I see what you mean. I thought you had said that countries were better off when the laws were based on Christianity, but I guess I was wrong.", 
   {}, 
   104042, 
   null, 
   1112674080.0
  ], 
  [
   104295, 
   null, 
   "zelma", 
   "It is saying that us real Americans believe in God. \n \n I don't think that you would be considered as one of \"us\" real Americans. Sorry emoticon_rolleyes", 
   {}, 
   104235, 
   null, 
   1112681400.0
  ], 
  [
   104356, 
   null, 
   "jyoshu", 
   "I'm not talking about racism. I'm just talking about a slogan saying whites are supreme. No actual harm done in this statement. In a similar way same thing with religion, but when the government acts on these principles in the past we've seen some pretty bad consequences. And it's not just because it offends people, it's a little thing called the 1st ammendment.\n\n \n Well I would argue that there IS harm in white supremacist statements--it is hate speech, pure and simple. But the phrase \"under God\" is not hate speech, and I think you'd be awfully hard pressed to show how it is harmful.\n \n \nMy original comment was that we were claiming we were better because we believe in God.\n\n \n I don't see where you are getting that we claim we are better.\n \n \nYou say we have freedom of religion yet we use that as an excuse to impose a certain religion on the population? \n\n \n No one is imposing any certain religion on anyone. Everyone is free to believe or disbelieve whatever they want. For that matter, I doubt anyone is going to prevent you from dropping the phrase \"under God\" when you say it anyway, so go ahead and don't say it that way if you want. No one will force you to say \"under God\" when you recite the pledge. But don't use the law to prevent others from saying it the way they want, which is what you are supporting. You're the one supporting people being imposed upon, and you're the one suppressing free speech here.\n \n \nBut we are very hypocritical to say we have all these freedoms like freedom to disagree with the government and then we force people to recite a pledge in support of the government and claiming how much better we are? Now that's plain arrogance and it goes back to the original topic. I don't care if the US is the best country in the world, people should know it without having to recite a pledge every day proclaiming it.\n\n \n But no one has the freedom to force people to say the pledge without \"under God\" if they so choose, which is what you support. That would truly be tyranny. Do you really think that by taking \"under God\" out of the pledge \"officially\", that people will actually stop saying it? Maybe athiests. But the irony is that they can already not say it if they so choose. There are no \"pledge-police\" standing by ready to arrest anyone who leaves out the phrase \"under God.\"", 
   {}, 
   104235, 
   null, 
   1112713320.0
  ], 
  [
   104959, 
   null, 
   "zachvac", 
   "Well I would argue that there IS harm in white supremacist statements--it is hate speech, pure and simple. But the phrase \"under God\" is not hate speech, and I think you'd be awfully hard pressed to show how it is harmful.\n \n\n I think both are similar. Saying \"where whites are supreme\" (or we could go with any other ethnic group, whites are just the majority in the country) is fine as long as no action is taken, just as with under god. But if action is taken trying to make whites supreme we have a problem and if action is taken to try to make this country under god we have a problem.\n \n \n \n\n I don't see where you are getting that we claim we are better.\n \n\n The whole point of the phrase was to try to claim we were better than those commies.\n \n \n\n No one is imposing any certain religion on anyone. Everyone is free to believe or disbelieve whatever they want. For that matter, I doubt anyone is going to prevent you from dropping the phrase \"under God\" when you say it anyway, so go ahead and don't say it that way if you want. No one will force you to say \"under God\" when you recite the pledge. But don't use the law to prevent others from saying it the way they want, which is what you are supporting. You're the one supporting people being imposed upon, and you're the one suppressing free speech here.\n \n\n I'm not suppressing free speech, I'm trying to stop government-sponsored speech. There's a difference. People can say whatever they want before class, after class, during lunch, any other time. Free speech applies to citizens, not the government. The government doesn't have free speech, it is not a person. It's not that I am forced to say it (you're right, we don't have to say it), it's the mentality it creates. Just as \"where whites are supreme\" would make minorities dislike that phrase, \"under God\" gets atheists and people of religions who don't worship God a little upset. The government is claiming not only that there is a God, but that we are under him.\n \"under God gives the same status to atheists in this country as liberty gives to tyrants, justice gives to perpetrators of injustice, and indivisible gives to rebels\".\n \n \n\n But no one has the freedom to force people to say the pledge without \"under God\" if they so choose, which is what you support. That would truly be tyranny. Do you really think that by taking \"under God\" out of the pledge \"officially\", that people will actually stop saying it? Maybe athiests. But the irony is that they can already not say it if they so choose. There are no \"pledge-police\" standing by ready to arrest anyone who leaves out the phrase \"under God.\"\n\n If they took under god out of the pledge and played it it would be impossible for people to say under God during the pledge. Let them recite it with \"under God\" whenever the hell they want, just don't make the government-sponsored version, the one played every day in school, say \"under God\".", 
   {}, 
   104356, 
   null, 
   1112841420.0
  ], 
  [
   104960, 
   null, 
   "Duo_Maxwell", 
   "It is saying that us real Americans believe in God. \n \n I don't think that you would be considered as one of \"us\" real Americans. Sorry emoticon_rolleyes\n\n \n I hope your joking.", 
   {}, 
   104295, 
   null, 
   1112841540.0
  ], 
  [
   104962, 
   null, 
   "zachvac", 
   "It is saying that us real Americans believe in God. \n \n I don't think that you would be considered as one of \"us\" real Americans. Sorry emoticon_rolleyes\n\n \n \n This is the exact mentallity the pledge itself creates with or without \"under God\". I do not stand for the pledge and many people call me \"unpatriotic\" or \"communist\". This country is supposed to be a country where people are free to disagree with the government without fear of punishment or ridicule. Now they have the freedom of speech to tell me whatever the hell they want just as I am free to tell them they are full of $hit. Already on an online message board you have made a conclusion that I shouldn't be considered an American. I'd hate to see how fast you judge people in real life.", 
   {}, 
   104295, 
   null, 
   1112841600.0
  ], 
  [
   109098, 
   null, 
   "Tastyfish", 
   "Its the compulsory aspect with under God that is the issue, lot of people would probably not be bothered I think if it were voluntary. Seems far less of a stink being raised in the UK over the national anthem that is basically comprised of 'God save the Queen', though I guess it might be due more to seeing it in forums making it seem a larger issue.\n \n Apart from that I think its the power religion has in politics over there, here where religion plays little or no part especially in elections, most people don't really care about the odd religious phrases however as soon as the religions mentioned in your official songs and suchlike seem to start being a dominant force in politics then people start feeling threatened. Actions to remove the religious language are more an action against religion in government than the words themselves.\n \n As for compulsory pledges, its not brainwashing but it is a brainwashing technique (not the most effective but alongside everything else it can start to add up). Think about it, pride in your country is complete nonsense really - you had nothing to do with it nor does any country have anything near a spotless record. Feeling fortunate to have been born somewhere makes perfect sense but pride in your country is a completely artficial concept that has somehow sneaked its way into peoples minds somehow.", 
   {}, 
   104962, 
   null, 
   1113923280.0
  ], 
  [
   143407, 
   null, 
   "zachvac", 
   "Its the compulsory aspect with under God that is the issue, lot of people would probably not be bothered I think if it were voluntary. Seems far less of a stink being raised in the UK over the national anthem that is basically comprised of 'God save the Queen', though I guess it might be due more to seeing it in forums making it seem a larger issue.\n \n\n But it is voluntary. Some teachers try to force kids to stand and say it but legally they can't. My problem is not that it is compulsory but that it is government-sanctioned. I don't want the government telling me we are under God and I don't see why they should be allowed to tell me repeatedly every day how this country is the best.\n \n \n\n As for compulsory pledges, its not brainwashing but it is a brainwashing technique (not the most effective but alongside everything else it can start to add up). Think about it, pride in your country is complete nonsense really - you had nothing to do with it nor does any country have anything near a spotless record. Feeling fortunate to have been born somewhere makes perfect sense but pride in your country is a completely artficial concept that has somehow sneaked its way into peoples minds somehow.\n\n There is a difference between pride and love for your country and unconditional worship. I think pride in your country is fine, just as is rooting for your home sports team or school teams. But along with this pride and love of my country is a desire to make it better, to change it. I don't want a nation that has to force people to hear how great it is every day. If it's that great a nation, it should be able to convince the citizens of the greatness without a pledge.", 
   {}, 
   109098, 
   null, 
   1120196340.0
  ], 
  [
   143728, 
   null, 
   "Tastyfish", 
   "I understand want you mean, pride in your country as a purely personal thing makes sense. I really like it here and having been elsewhere around the world have found that as a place to live, the UK is really nice, a happy medium of everything. I certainly wouldn't say I'm patriotic.\n \n If anything, the constant barrage of 'advertising' would put me off (though the rare odd time they do it here just makes me want to cringe, the British don't do self praise well), despite the fact that they are not really trying to get me to buy anything, if anything with the problems developed countries have with immigration (both psychologically and in reality) surely..'well we arn't as good as Canada, or France' would surely be more desirable ;)\n \n Especially as those so easily moved by such 'patriotic' methods are the ones the rest of us could really do without...", 
   {}, 
   143407, 
   null, 
   1120263180.0
  ], 
  [
   149327, 
   null, 
   "Matthew S", 
   "I will not recite the pledge anymore and I either turn my back on the flag or stand silently with my head bowed as the pledge is being said. The is no justice for all as long as there is US government sponsored discrimination. \n \n The words Liberty and Justice for all are empty.\n \n The line should read Liberty and Justice for all white heterosexual christian males", 
   {}, 
   143728, 
   null, 
   1121986800.0
  ], 
  [
   149352, 
   null, 
   "Raastee", 
   "I will not recite the pledge anymore and I either turn my back on the flag or stand silently with my head bowed as the pledge is being said. The is no justice for all as long as there is US government sponsored discrimination. \n \n The words Liberty and Justice for all are empty.\n \n The line should read Liberty and Justice for all white heterosexual christian males\n\n \n Amen...we have let America **** its self...and it is time people take a stand for civil liberty", 
   {}, 
   149327, 
   null, 
   1121990520.0
  ], 
  [
   149455, 
   null, 
   "zachvac", 
   "I will not recite the pledge anymore and I either turn my back on the flag or stand silently with my head bowed as the pledge is being said. The is no justice for all as long as there is US government sponsored discrimination. \n \n The words Liberty and Justice for all are empty.\n \n The line should read Liberty and Justice for all white heterosexual christian males\n\n \n I'm curious, what US government sponsored discrimination are you talking about? I don't like that they force a pledge on us every day in school. Would you elaborate on what US sponsored discrimination is taking place? (I can see where you're going with heterosexual, but what do you mean by white and christian?)", 
   {}, 
   149327, 
   null, 
   1122012480.0
  ], 
  [
   149458, 
   null, 
   "Dzeron", 
   "I will not recite the pledge anymore and I either turn my back on the flag or stand silently with my head bowed as the pledge is being said. The is no justice for all as long as there is US government sponsored discrimination. \n \n The words Liberty and Justice for all are empty.\n \n The line should read Liberty and Justice for all white heterosexual christian males\n\n \n Sorry, but we don't even have liberty and justice for them.", 
   {}, 
   149327, 
   null, 
   1122014280.0
  ], 
  [
   149461, 
   null, 
   "Pravda", 
   "Justice and liberty for all is over-rated. Give me peace, order, and good government any day of the week.", 
   {}, 
   149458, 
   null, 
   1122017700.0
  ], 
  [
   149488, 
   null, 
   "Matthew S", 
   "I'm curious, what US government sponsored discrimination are you talking about? I don't like that they force a pledge on us every day in school. Would you elaborate on what US sponsored discrimination is taking place? (I can see where you're going with heterosexual, but what do you mean by white and christian?)\n\n \n \n \n Sorry I was mixing several messages without being clear. I mean Government sponsored discrimination against gay people.\n \n As for the rest the discrimination may not be sponsored but it does exist and is somtimes over looked.", 
   {}, 
   149455, 
   null, 
   1122030960.0
  ], 
  [
   149601, 
   null, 
   "Dzeron", 
   "Justice and liberty for all is over-rated. Give me peace, order, and good government any day of the week.\n\n \n How can peace and government coexist? Government is violence.", 
   {}, 
   149461, 
   null, 
   1122063900.0
  ], 
  [
   149647, 
   null, 
   "gnojek", 
   "Govt may be FORCE, but not necessarily violence.\n \n And I'll take freedom over order anyday.\n \n (And by freedom, I mean liberty, with protected rights and all that. If my rights are protected, that's all the order I need.)", 
   {}, 
   149601, 
   null, 
   1122068520.0
  ], 
  [
   149656, 
   null, 
   "zachvac", 
   "Govt may be FORCE, but not necessarily violence.\n \n And I'll take freedom over order anyday.\n \n (And by freedom, I mean liberty, with protected rights and all that. If my rights are protected, that's all the order I need.)\n\n \n \n I agree. The government's only role should be protecting the rights of the people.", 
   {}, 
   149647, 
   null, 
   1122069240.0
  ], 
  [
   193663, 
   null, 
   "Bassman", 
   "what is the difference in the pledge of allegiance and the national anthem, since the song goes:\n \n Oh say does that star spangled banner yet wave--\n \n Have you ever noticed how people put their hands over their hearts while the national anthem is playing? \n \n Actually, I do not put my hand over my heart while the song is playing, I think it is a social blunder to do so, and I wonder where that started, because the song refers to the flag? There is no pledge involved, do you put your hand over your heart when the national anthem is played?\nIt was meant to replace the right hand outstretched palms up because people participating eventually flipped their hands as they got tired. And during WWII, when that happened, the catchphrase became: \"Hotsie-Totsie another little Nazi\". So that's why the salute became right hand over the heart.", 
   {}, 
   101501, 
   null, 
   1137862860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Pledge of Allegiance and 2 minutes hate", 
  "url": "http://www.4forums.com/political/education-debates/4616-pledge-allegiance-2-minutes-hate.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 4616, 
  "discussion_files": [
   [
    "15455.html", 
    "http://www.4forums.com/political/education-debates/4616-pledge-allegiance-2-minutes-hate-print.html"
   ], 
   [
    "15456.html", 
    "http://www.4forums.com/political/education-debates/4616-pledge-allegiance-2-minutes-hate-5-print.html"
   ], 
   [
    "15457.html", 
    "http://www.4forums.com/political/education-debates/4616-pledge-allegiance-2-minutes-hate-4-print.html"
   ], 
   [
    "15458.html", 
    "http://www.4forums.com/political/education-debates/4616-pledge-allegiance-2-minutes-hate-3-print.html"
   ], 
   [
    "15459.html", 
    "http://www.4forums.com/political/education-debates/4616-pledge-allegiance-2-minutes-hate-2-print.html"
   ]
  ], 
  "identifier": 4616
 }
]