[
 [
  [
   100414, 
   null, 
   "wilted_laughter", 
   "I've been pondering this for a long time and I'm curious to see what people think of my thoughts on the matter.\n \n What I would like to see is two things 1) Greater democracy in EU institutions and 2) the development of real pan european political parties as opppossed to national party clubs\n \n This would involving the reforming the instutions of the EU to include:\n \n - A directly elected commission president (the commission being the executive of the EU). Power to veto legislation. Appoints commissioners to portfolios from nominess presented by party groups in lower house proportional to their representation in parliament, excluding those with representation less than say 10% (nominees may not be meps, obviously that applies to the president as well).\n \n - An upper house of the legislature made up of member states parliaments (ie each parliament has one vote, which is however the majority in that national parliament votes). No power to initiate legislation. Can override a commission president veto with 2/3 majority. Power to approve or block President's appointments to commission portfoilos. Legislation must be approved by upper house to pass.\n \n - A 1000 seat lower house elected by PR list system in a single community wide constituency (Representation of constiuents at European level goes to national mp's). Power to initiate legislation. Legislation must be approved by lower house to pass.\n \n - The council of ministers power would consist of initiating legislation.\n \n - Not sure about judiciary, don't know huge amounts about european court system as of yet.\n \n - At a loss about committees.\n \n \n The idea behind the no commission representation for groups represented by less than 10% is twofold. \n \n 1) To keep out nutters, and with PR elections they will be there (and if any get enough votes to be represented on the commission the president can use their nominees in a portfolio they can do no harm in as well). \n \n 2) To encourage pan-european parties to develop, how many national parties are going to be able to produce representation of greater than 10% as the union expands? Very, very few if any. (In the event that there are insufficient large party groupings to appoint enough commissioners then groups with less than 10% representation may be admitted but at a maximum of 1 commissioner each - but this does raise the problem of big country dominence still).\n \n Obviously with commission appointments depending on parliamentary representation commission president and parliamentarily elections would be best run concurrently. I'm not sure if this would be a bad or good thing. It's debatable.\n \n The president would be elected in a single transferrable vote election (voters select a number of candidates in order of preference, the votes are counted and the canditate with the least is elimated and his votes \"transferred\", keeps going until someone gets a majority). The idea being to trancend voters simple voting for the candidate(s) of their own nationality.\n \n That's all I can think of on the matter right now. \n \n PS Does anybody think the consitutional treaty will pass and have any thoughts on what happens if it doesn't (depending on the manner of it's failure)?\n \n EDIT: Term limits on the commission president? Two I suppose. Length? Four years, maybe five.\n \n EDIT: The use of a list system for parliamentary elections does raise the problem of the lists of pan-european problems being dominated by the big countries. I would hope that this, combined with the threat of big country dominence of the commission would encourage pan-european party development amongst the smaller nations and stimulate the development of a pan-european party system as a whole as a result.", 
   {
    "post_info": {
     "post_title": "Thoughts on how the EU should be run"
    }
   }, 
   null, 
   null, 
   1111512600.0
  ], 
  [
   100438, 
   null, 
   "georged", 
   "PS Does anybody think the consitutional treaty will pass and have any thoughts on what happens if it doesn't (depending on the manner of it's failure)?\n\n \n An excellent consideration. The only comparison I can offer is the US constitution drafting process; the original constitutional convention spent six months and innumerable drafts before arriving at a conclusion. That was for one country, with all parties having vested interests in that country.\n \n With the number of sovereign nations involved in EU composition, I'd think any timespan and the number of revisions required to serve various national interests will make it an ongoing work in progress regardless of draft approval/disapproval. Better to begin with a perhaps flawed document to create forward momentum and signify potential unity with revision requirements than milling around with public squabbles for political posturing would be my personal opinion.", 
   {}, 
   100414, 
   null, 
   1111517700.0
  ], 
  [
   100473, 
   null, 
   "wilted_laughter", 
   "Personally I think including greater democratisation is the best chance the constitutional treaty has of being passed, otherwise citizens will view it as a consolidation of EU power at the expense of their interests and it will fall somewhere. Whether it will be in several countries or just one (ie the UK) could be important in the future direction the EU takes.\n \n EDIT: I myself supported the treaty pretty regardless of it's content on the grounds you've mentioned. Now I'm not so sure, I want a say with what happens at EU level.", 
   {}, 
   100438, 
   null, 
   1111521120.0
  ], 
  [
   100485, 
   null, 
   "georged", 
   "Personally I think including greater democratisation is the best chance the constitutional treaty has of being passed, otherwise citizens will view it as a consolidation of EU power at the expense of their interests and it will fall somewhere. Whether it will be in several countries or just one (ie the UK) could be important in the future direction the EU takes.\n \n EDIT: I myself supported the treaty pretty regardless of it's content on the grounds you've mentioned. Now I'm not so sure, I want a say with what happens at EU level.\n\n \n I don't see much authoritarian rule in existing EU members, but Western style democratization as a governing standard for admission will poise insurmountable problems for low labor cost nations seeking membership. A mix of low cost labor with professional levels of existing, mature EU members holds the promise of trade unity creating structures that competitively serve markets within and outside the EU. To impose instant federalism on governing ideologies as a membership requirement would certainly serve current human rights interests in mature nations, IMO idealistic, but economic interests, the basis and thrust of EU future, would be severely compromised. Open immigration tied to industrial expansion would create examples of democratization for authoritarian states by participation, far more effective and feasible than attempts to impose same and abandonment of those unable or unwilling to conform on an instant basis.", 
   {}, 
   100473, 
   null, 
   1111522860.0
  ], 
  [
   100488, 
   null, 
   "wilted_laughter", 
   "georged:\n \n I can see your point. But my proposals are not for any additional powers for EU institutions, or for deepening of the union (at least not directly), which is a seperate issue in my mind and one my views on I'd like to keep seperate from the democratisation debate. \n \n They are however of course linked in the manner of the question at what point does governance by consensus amongst member state governments become insufficient to running the union, and if that point has already been reached is the union federal in nature if not in law? \n \n Your point brings us to the problem of where does expansion stop and where do Europeans want it to stop? In ten years are we going to have the EurAsian Union?", 
   {}, 
   100485, 
   null, 
   1111523640.0
  ], 
  [
   100503, 
   null, 
   "georged", 
   "georged:\n \n I can see your point. But my proposals are not for any additional powers for EU institutions, or for deepening of the union (at least not directly), which is a seperate issue in my mind and one my views on I'd like to keep seperate from the democratisation debate. \n \n They are however of course linked in the manner of the question at what point does governance by consensus amongst member state governments become insufficient to running the union, and if that point has already been reached is the union federal in nature if not in law? \n \n Your point brings us to the problem of where does expansion stop and where do Europeans want it to stop? In ten years are we going to have the EurAsian Union?\n\n \n I think the union is federal in nature, getting to centralized management will require overcoming existing national emotions. That primarily exists in general populaces as pride by rote and politicians as power leverage.\n Money, the economics side, recognizes those issues only as currently necessary evils and obviously negotiable. Everything is for sale at the right price. \n \n I've always sided with futurists, who offer sound arguments for initial economic unions by continental land mass. Not in my time, but certainly not that far out due to natural resource requirements, those commodities and their utilization still being the gauge of national and international wealth/power. We're still involved in petty quarreling about social customs, ideology, but supply and demand will eventually sort out that issue.", 
   {}, 
   100488, 
   null, 
   1111525320.0
  ], 
  [
   101464, 
   null, 
   "Eddie", 
   "I don`t think it`s possible to achieve a functioning european democracy until we have a common european civil society. And we are lightyears from that at the moment. At best, we`ll have a situation in Nigeria where political parties masquarading as based on ideology is nothing more than interest organisation for certain ethnic and geographic groups. Before we start to deepen the democracy of EU, we need to (among other things):\n \n * Have a major european news service that broadcasts and publishes european news, rather than national news.\n * Intensify cultural exchange between all countries.\n * Encourage language cohession. Now this might be extreamly difficult, but we should at least all adopt english as our second languages and enhance general profficiency.\n * Let things settle with the new member states, and wait for more economic and social convergance. As it is now, there are huge economic gaps between south-eastern and eastern europe on one hand and western and northern europe on the other hand. \n * Etc, etc ;)\n \n Just my oppinion though", 
   {}, 
   100503, 
   null, 
   1111799760.0
  ], 
  [
   101482, 
   null, 
   "georged", 
   "I don`t think it`s possible to achieve a functioning european democracy until we have a common european civil society. And we are lightyears from that at the moment. At best, we`ll have a situation in Nigeria where political parties masquarading as based on ideology is nothing more than interest organisation for certain ethnic and geographic groups. Before we start to deepen the democracy of EU, we need to (among other things):\n \n * Have a major european news service that broadcasts and publishes european news, rather than national news.\n * Intensify cultural exchange between all countries.\n * Encourage language cohession. Now this might be extreamly difficult, but we should at least all adopt english as our second languages and enhance general profficiency.\n * Let things settle with the new member states, and wait for more economic and social convergance. As it is now, there are huge economic gaps between south-eastern and eastern europe on one hand and western and northern europe on the other hand. \n * Etc, etc ;)\n \n Just my oppinion though\n\n \n Excellent points. An expanded economy, money, will also enable social convergence by driving European communications advertising, which could spread common language usage without serious disruption to national media revenue. Money is always first, providing motivation for many feats to we otherwise lazy humans. \n \n As a side note, most US immigrants credit TV as the biggest aid to learning English. Well, our version of English.", 
   {}, 
   101464, 
   null, 
   1111803960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Thoughts on how the EU should be run", 
  "url": "http://www.4forums.com/political/european-politics-economics/4623-thoughts-how-eu-should-run.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 4623, 
  "discussion_files": [
   [
    "757.html", 
    "http://www.4forums.com/political/european-politics-economics/4623-thoughts-how-eu-should-run-print.html"
   ]
  ], 
  "identifier": 4623
 }
]