[
 [
  [
   101022, 
   null, 
   "Yaacova", 
   "With the debate of taking \"under God\" out of the pledge of alligience has been influencing kids to take action. When it's time to recite the pledge they keep silent. Eventually the teachers catch on and either tell them to recite it or right them a lunch clean up. If we don't want to say the pledge are we forced to? What is our right as a student to boycott inside the school?", 
   {
    "post_info": {
     "post_title": "keeping silence and being yelled at"
    }
   }, 
   null, 
   null, 
   1111683300.0
  ], 
  [
   101187, 
   null, 
   "zachvac", 
   "With the debate of taking \"under God\" out of the pledge of alligience has been influencing kids to take action. When it's time to recite the pledge they keep silent. Eventually the teachers catch on and either tell them to recite it or right them a lunch clean up. If we don't want to say the pledge are we forced to? What is our right as a student to boycott inside the school?\n\n \n Not only are you allowed to keep silent, but you are allowed to sit during the pledge. You cannot be forced to stand during the pledge. They are not allowed to make you bring a note from a parent and they are not allowed to embarrass you or punish you for choosing to sit and/or stay silent. I'll post the legal information below this and if you want to you can write a letter to your principal about this.", 
   {}, 
   101022, 
   null, 
   1111724880.0
  ], 
  [
   101188, 
   null, 
   "zachvac", 
   "This is the legal precedent regarding sitting during the pledge. It refers to Maryland and Montgomerey County law, but also sites the US appeals court.\n \n http://elliott.dorm.duke.edu/web/pledgebrief.pdf\n \n some more court cases in a letter to the principal by the same student as above:\n \n \"The main precedent by which students are not forced to recite the pledge is the 1943 Supreme Court ruling in the case of the West Virginia State Board of Education v. Barnette. In the Court's opinion, \n \n \"We think the action of the local authorities in compelling the flag salute and pledge transcends constitutional limitations on their power and invades the sphere of intellect and spirit which it is the purpose of the First Amendment to our Constitution to reserve from all official control.\" \n \n Although the court makes no specific mention of forcing students to stand up, it still limits a school's right to force patriotic acts or political doctrine on students. \n \n From the Federal 2nd Circuit Court of Appeals, the 1973 case of Goetz v. Ansell is specific on the issue of whether students are required to stand. It allows non-participating students who do not wish to engage in the flag salute to engage in \"a silent, non-disruptive expression of belief by sitting down\" and does not require them to leave the classroom. \n \n The Maryland Supreme Court itself also decided that students objecting to the salute of the flag were not required to stand. The 1971 case of the State of Maryland v. Lundquist invalidated a state requirement that students who object to daily patriotic exercises stand while the rest of the class recites the pledge. \n \n The 1970 Florida case of Banks v. Board of Public Instruction also establishes that standing is \"no less a gesture of acceptance and respect than is the salute or the utterance of the words of allegiance.\" \n \n The Goetz v. Ansell case and the Banks v. Board case explicitly establish that standing out of respect for the flag can be construed as a patriotic exercise, and that a student's right to non-participation must be respected as with the act of reciting the pledge itself.\"\n \n He got a lawyer from the ACLU that would have sued the school for free but the principal decided to repeal the pledge policy that forced us to stand. If you really want to sue the school you could contact the ACLU.\n \n \n I'm not sure how serious you are or how strongly you feel about the pledge, but what they are doing is totally illegal and it outrages me that they take advantage of kids like this and don't inform them of their rights. I'm glad you asked here for help, many kids would just go with the flow to fit in. I say if we don't stand up for our rights, they will slowly deteriorate. The information's here if you want to write a letter to your principal and if he doesn't change the policy you can sue the school. It all depends on how strongly you feel about this.", 
   {
    "unicode_changes_made": true
   }, 
   101187, 
   null, 
   1111725480.0
  ], 
  [
   101475, 
   null, 
   "Yaacova", 
   "not that strong. Just strong enough to take the snearing comments and wierd looks.", 
   {}, 
   101188, 
   null, 
   1111801380.0
  ], 
  [
   101491, 
   null, 
   "StrategosFF", 
   "I'd just like to add that the original pledge of Alliegence did not include the phrase \"under god\", that was added on by Congress in the 1950s. There were also other add ons, can't recall exactly", 
   {}, 
   101475, 
   null, 
   1111806960.0
  ], 
  [
   101511, 
   null, 
   "zachvac", 
   "not that strong. Just strong enough to take the snearing comments and wierd looks.\n\n \n But the question is are you just going to go along and recite the pledge like everyone else, not say it and suffer getting lunch clean-ups, or fight it? The choice is yours.", 
   {}, 
   101475, 
   null, 
   1111813740.0
  ], 
  [
   101654, 
   null, 
   "Yaacova", 
   "probably, but it hasn't been that serious yet. I'm glad my 1st period teacher doesn't really care.", 
   {}, 
   101511, 
   null, 
   1111865100.0
  ], 
  [
   132002, 
   null, 
   "Morfos", 
   "Another example of a radical conservative stuffing morals and propaganda down the throats of the unwilling! emoticon_rolleyes", 
   {}, 
   101022, 
   null, 
   1117747440.0
  ], 
  [
   133505, 
   null, 
   "zachvac", 
   "Another example of a radical conservative stuffing morals and propaganda down the throats of the unwilling! emoticon_rolleyes\n\n \n \n and then when the judge sides with the student on this issue, ruling that he may sit and/or be silent they will rant about an activist judge.", 
   {}, 
   132002, 
   null, 
   1118033640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  keeping silence and being yelled at", 
  "url": "http://www.4forums.com/political/education-debates/4638-keeping-silence-being-yelled.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 4638, 
  "discussion_files": [
   [
    "11312.html", 
    "http://www.4forums.com/political/education-debates/4638-keeping-silence-being-yelled-print.html"
   ]
  ], 
  "identifier": 4638
 }
]