[
 [
  [
   101180, 
   null, 
   "Yaacova", 
   "I believe strongly in evolution and believe my opinion in school is very important. One thing that makes voicing my opinion is the fact that no one else thinks so. I find it hard to desrcribe evolution, I mean, I know how it works, I just have to work up vocabulary and get my facts really strait so that I don't have to stumble around trying to prove my point. Can anyone help explain to me simply (so that 8th graders can understand) the facts of evolution and examples ont he human body as well as in animals?\n \n It would help a great deal.", 
   {
    "post_info": {
     "post_title": "An evolution stink"
    }
   }, 
   null, 
   null, 
   1111723500.0
  ], 
  [
   101198, 
   null, 
   "zachvac", 
   "I believe strongly in evolution and believe my opinion in school is very important. One thing that makes voicing my opinion is the fact that no one else thinks so. I find it hard to desrcribe evolution, I mean, I know how it works, I just have to work up vocabulary and get my facts really strait so that I don't have to stumble around trying to prove my point. Can anyone help explain to me simply (so that 8th graders can understand) the facts of evolution and examples ont he human body as well as in animals?\n \n It would help a great deal.\n\n \n Where do you live? I would guess somewhere in the South.\n \n \n We are just beginning to learn about it but basically any real scientist realizes it's true. Some may believe that God created the Earth to evolve, but there is no doubt that evolution is true. It has just as much merit as the theory of gravity. First of all there is radiometric dating, which is based on the fact that many different isotopes of different elements decay at constant rates. They have found that the map of creatures in time has slowly changed and evolved. First there were sponges in the sea. Then there were Jellyfish who had the ability to move, then there were flatworms with the ability to sexually reproduce (that's as far as we are in the timeline of life in biology so far). Gradually creratures had different abilities and these things took millions of years. Genetics is a big key in this as well. Many times a certain gene is introduced (going forward in the timeline of life) and sometimes it hasn't continued but many times it has stayed. I'm not a scientist, and I'm sure there's stuff I missed, but that's my understanding of it, and the fact that not one single piece of evidence has contradicted the theory of evolution so far.", 
   {}, 
   101180, 
   null, 
   1111727940.0
  ], 
  [
   101201, 
   null, 
   "Yaacova", 
   "I actually live in southern California. Surprise? \n \n I've heard that a lot, but I don't think if I say that, 8th graders would spend two minutes listening to something they don't understand. Maybe an example closer to home? Something that they can relate to? I'm not saying I don't understand what you're talking about.", 
   {}, 
   101198, 
   null, 
   1111729140.0
  ], 
  [
   101206, 
   null, 
   "Hunter", 
   "I believe strongly in evolution and believe my opinion in school is very important. One thing that makes voicing my opinion is the fact that no one else thinks so. I find it hard to desrcribe evolution, I mean, I know how it works, I just have to work up vocabulary and get my facts really strait so that I don't have to stumble around trying to prove my point. Can anyone help explain to me simply (so that 8th graders can understand) the facts of evolution and examples ont he human body as well as in animals?\n \n It would help a great deal.\n\n \n Evolution is only a theory, and thus it shall remain. If a theory can't be proven in 150 years, there is very little possibility that it will ever be proven. I urge you to continue to seek the truth, start with the Bible. emoticon_xangel", 
   {}, 
   101180, 
   null, 
   1111733280.0
  ], 
  [
   101210, 
   null, 
   "pandion", 
   "Evolution is only a theory, and thus it shall remain. If a theory can't be proven in 150 years, there is very little possibility that it will ever be proven. I urge you to continue to seek the truth, start with the Bible. emoticon_xangel\n\n Well, I see that Hunter continues with his intentional ignorance. Even though it has been explained to him on several occasions, he still chants his \"evolution is only a theory\" mantra in hopes that his audience will be as ignorant as he. \n \n Yes, evolution is a theory. In science that means that it has been tested and accepted as essentially correct. Evolution is a theory just as gravity is a theory - several in fact; Newtonian gravity, general relativity, and quantum gravity. None of those theories actually work in all situations.\n \n But for all practical purposes, evolution has been proven. That's easy since evolution has been observed and the theories are build on the facts of those observations.\n \n You will notice that Hunter hasn't proven any of his assertions. He just knows that there are talking snakes, and magical beings that make people out of dirt. Sure - go ahead and start with the Bible so you can get the mythology of two different creation stories, an impossible flood, and such fantasies as a man being swallowed by a whale or the any human would know about a god that wagers with Satan, out of the way. Not only will you find no proof to support the Bible, you won't evern find any evidence.", 
   {}, 
   101206, 
   null, 
   1111735740.0
  ], 
  [
   101211, 
   null, 
   "Hunter", 
   "Well, I see that Hunter continues with his intentional ignorance. Even though it has been explained to him on several occasions, he still chants his \"evolution is only a theory\" mantra in hopes that his audience will be as ignorant as he. \n \n Yes, evolution is a theory. In science that means that it has been tested and accepted as essentially correct. Evolution is a theory just as gravity is a theory - several in fact; Newtonian gravity, general relativity, and quantum gravity. None of those theories actually work in all situations.\n \n But for all practical purposes, evolution has been proven. That's easy since evolution has been observed and the theories are build on the facts of those observations.\n \n You will notice that Hunter hasn't proven any of his assertions. He just knows that there are talking snakes, and magical beings that make people out of dirt. Sure - go ahead and start with the Bible so you can get the mythology of two different creation stories, an impossible flood, and such fantasies as a man being swallowed by a whale or the any human would know about a god that wagers with Satan, out of the way. Not only will you find no proof to support the Bible, you won't evern find any evidence.\n\n \n Evolution: Ride a monkey into Hell. BTW, there is more documentation to support the Bible than alleged proof to support the theory that man evolved from nothing. If the evolution theory is correct, who created the first atom. Hmmmmmm! Why are you so intent on debunking God? Why do you seemingly hate the Creator of your very soul? Where are the transitional fossils?\n How is it that man made the Atomic Bomb in a few years and yet in 150 years evolution is still a theory?\n Iwould like to ask you this question; do you claim to believe in God? Also, do you believe in the possibility of life after death. If you answer no to these questions, do you like really, really hot weather?", 
   {}, 
   101210, 
   null, 
   1111736880.0
  ], 
  [
   101237, 
   null, 
   "Big_Bear_Scot", 
   "What makes the Judea-Christian creation story more valid than any other creation story such as the North American Indian, Hindu, Celtic, Aboriginal etc ?\n \n And again Hunter you can be a Christian and believe that God used Evolution to create life on this planet, essentially that God started it all and he let evolution take its course(see the other thread where I posted Lectures from a Church of Scotland Minister on Evolution and Christianity).\n \n In fact here is what the Pope John Paul the 2nd said about Evolution\n \n \n\"In his encyclical Humani Generis, my predecessor Pius XII has already affirmed that there is no conflict between evolution and the doctrine of the faith regarding man and his vocation... Today, more than a half-century after the appearance of that encyclical, some new findings lead us toward the recognition of evolution as more than an hypothesis. In fact it is remarkable that this theory has had progressively greater influence on the spirit of researchers, following a series of discoveries in different scholarly disciplines... The convergence in the results of these independent studies-which was neither planned nor sought-constitutes in itself a significant argument in favor of the theory.\" \n \n \n But I suppose the Pope is going to hell emoticon_rolleyes \n \n Here is a link to a website that has a brief list of translational fossils, there are gaps but that could mean that we have yet to find those fossils, or we have found them but no one has made the link yet.\n \n \n You also keep stating that evolution is theory, we all agree it is still a theory but it is the most plausible theory that fits the evidence found that Evolution is the most likely mechanism to explain that we have lots of different species, to condense it to the real basics just think of it as the ancestry of the species.(Apologies for condensing the Theory into those small sentences could be here forever explaining Evolution :) )\n \n N.B Evolution does not mention how life started, there is another Scientific Theory on the Origin of life on Earth, but I can not think of it at this moment.\n \n Hunter it is really not good form on a message board when debating a subject to say someone is going to hell because they don't agree with your viewpoint, present your evidence why you believe that evolution is incorrect and we can have a proper debate.", 
   {
    "unicode_changes_made": true
   }, 
   101211, 
   null, 
   1111749660.0
  ], 
  [
   101269, 
   null, 
   "pandion", 
   "Evolution: Ride a monkey into Hell.\n\n But we weren't discussing either monkies or hell. One can only wonder at your thought processes that makes such irrelevant and disconnected thoughts pop up.\n \nBTW, there is more documentation to support the Bible than alleged proof to support the theory that man evolved from nothing.\n\n Actually, I think that lack of support for your mythology is one of the reasons that it isn't accepted as literal. I suspect that your documentation is just assertion that you believe because it tells you what you want to hear.\n \n Why is it that creationists keep claining to have \"proof\" and never present any? Have you checked out the threads in the Religion forum where some posters are having trouble demonstrating the historicity of Jesus? How can you claim documentation for Adam & Eve, the Garden, talking snake, the flood?\n \nIf the evolution theory is correct, who created the first atom. Hmmmmmm!\n\n If evolution theory is correct, who cares? What does cosmology have to do with how life changes? You still seem to lack the integrity to learn even the basics of what you claim to oppose. Wouldn't it be better, if you want to present arguments against evolution, that you actually discuss evolution?\n \nWhy are you so intent on debunking God? Why do you seemingly hate the Creator of your very soul?\n\n What are you talking about. Unless you're god, you're talking nonsense. What I have tried to debunk is your constant ignorant babble about nothing and I have tried to explain why you are not talking about evolutionary theory because you don't know what evolutionary theory is. I haven't attempted to debunk God, only your cultish view of god, and the topic of the Creator of anyone's soul hasn't come up.\n \nWhere are the transitional fossils?\n\n In museums of natural history, mostly. Big_Bear_Scot has referred you to a list of them. But my bet is that you can't even define what a transitional is. You'll go on about half a wing, or half an eye and demonstrate your unwillingness to learn. And then you'll keep on asserting that there are no transitionals no matter how many we show you simply because you don't understand what is being discussed and you have closed your mind so tight that you are incapable of grasping the simple ideas involved.\n \nHow is it that man made the Atomic Bomb in a few years and yet in 150 years evolution is still a theory?\n\n Perhaps you'll be good enough to explain what an unrelated accomplishment of technology has to do with a scientific theory. In fact, the atomic bomb, as well as the operation of nuclear power plants, is the engineering application of nuclear theory. All those bombs and power plants operate according to principles that were predicted by nuclear theory - and it's still only theory.\n \n And it has been explained to you before that in science, a theory is as good as it gets. Theories don't grow up to be facts. When something is raised to the status of a scientific theory it means that there is little doubt that it is correct.\n \nI would like to ask you this question; do you claim to believe in God? Also, do you believe in the possibility of life after death. If you answer no to these questions, do you like really, really hot weather?\n\n A little variation on Pascal's wager? What does that have to do with evolution? Again you demonstrate the hubris of your cult and userp the authority of God. Are you sure that you will be welcomed by your god after having done so?\n \n By the way, if your purpose here is to somehow bring people to your god, I would suggest that your actions are counterproductive. What you are actually doing is revealing the foolishness of your faith. You are an embarrassment to thinking Christians everywhere.", 
   {}, 
   101237, 
   null, 
   1111768620.0
  ], 
  [
   101270, 
   null, 
   "Yaacova", 
   "This is not a debate of if I believe in evolution, I already know I do. I want to convince my classmates that I'm not just babbling. I was asking people to simply list some of the evidence. I have no doubt in my mind that evolution is the truth. Sorry if it throws anyone off, but that is all I needed. Hunter remind me alot about my classmates! emoticon_rolleyes", 
   {}, 
   101237, 
   null, 
   1111768740.0
  ], 
  [
   101284, 
   null, 
   "pandion", 
   "This is not a debate of if I believe in evolution,I already know I do. I was asking people to simply list some of the evidence. I have no doubt in my mind that evolution is the truth. Sorry if it throws anyone off, but that is all I needed.\n\n Well, discussions on the web have a tendency to wander off topic. Especially discussions of religion v. evolution. Those who take the side of religion are usually ignorant of evolution and try to discuss their straw man versions.\n \n But to answer your question, it's not that simple. Here you are, 8th grade I think you said, and you are asking for a few simple paragraphs that will educate you on a topic that I didn't study in ernest until I was a junior in college - that was after I had taken the required coursed in general biology, zoology, botany, and especially genetics. What you are asking can't be done.\n \n But I can point you to a site where you can read about a variety of topics that are relevant - others have already linked pages from the site. It is The Talk.Origins Archive. You could start by reading the FAQ, and possibly some of the articles linked from there. Or you might go \"Browse the Archive\" and then click on \"Must-Read Files\" for a list of articles that cover some basic ideas. For example, 29+ Evidences for Macroevolution presents evidence based on phylogenetics. Or you can select one of the other topics on the \"Browse\" page for articles that pertain to more limited discussions. And finally, you can search the Archive for articles that deal with specific topics. There are articles that answer generally all of the creationist straw man arguements. There are even articles on creationism by creationists. For example, Mr. Kent Hovind's site is linked. Hovind is a particular embarrassment to Christianity because of his profound ignorance of science and his childish views of God and religion, as well as his weird political views.", 
   {}, 
   101270, 
   null, 
   1111771680.0
  ], 
  [
   101294, 
   null, 
   "Yaacova", 
   "I guess it will be a while before evolution can be explained simply like a lot of other known sciences.", 
   {}, 
   101284, 
   null, 
   1111772460.0
  ], 
  [
   101325, 
   null, 
   "pandion", 
   "I guess it will be a while before evolution can be explained simply like a lot of other known sciences.\n\n Now you're being silly. \"A lot of other sciences\" can't be explained simply. My son spent 5 years studying nuclear physics, and that includes several courses of higher math. Even at that, he didn't get into quantum mechanics, which has no simple explanation and isn't even understood completely by experts. On the other hand, the basics of chemistry has been reduced to physics.\n \n Evolutionary theory is quite mature and is the oldest of the basic scientific theories. Newton's theories of motion and gravity have been amended and then amended again. The three statements still haven't been reconciled - each is correct in a particular set of circumstances while none is correct in all cases.\n \n The older a scientific theory gets, the less likely it is that it can be explained \"simply.\" What you ask shows a lack of maturity and naive egotism. It's typical of children your age to think that you know almost every thing and are on the verge of understanding it all. Not so. Even if you were to pick one small subspecialty, you could spend the next 10-12 years studying and still not have gained a comprehensive knowledge. And yet, you want the whole thing explained in a few words in an internet board.\n \n Or maybe you are too lazy to actually put in some effort and do some research at Talk Origins? You expect to be spoon fed everything, at your whim. I guess expecting a little maturity from a 14 year old is a bit much. I tried to help you but I guess that was futile. I'll refrain from trying in the future since I can't learn for you and I'm not willing to try to meet your demands that everything be laid out for you.", 
   {}, 
   101294, 
   null, 
   1111775400.0
  ], 
  [
   101340, 
   null, 
   "Clive14", 
   "I guess it will be a while before evolution can be explained simply like a lot of other known sciences.\nOh it can be explained simply, just as say gravity can. But explaining where your stupid creationists friend have gone wrong often isn't easy. I can give you a simple explaination of evolution:\n \n \"Life evolves from generation to generation as DNA is imperfectly copied from parents to offspring\"\n \n If you are faced with an idiot comment such as \"if evolution is true, where did the first atom come from?\", you don't actually need to know how evolution works, you just need to know what evolution is and isn't. The question \"if evolution is true, where did the first atom come from?\" is akin to asking \"if gravity is true, where did the first atom come from?\", ie it has nothing to do with gravity and it has nothing to do with evolution.\n \n But if you get a simply naive question like \"prove evolution is true\", that gets a bit more difficult. The problem is, the same person will likely reply to \"prove gavity is true\" by dropping something. This of cause doesn't prove gravity true, but they don't understand that. Likewise showing them one of the many species that have evolved into two different species in recent years won't prove evolution true either, but they will not understand the equivalence with the gavity example.\n \n Perhaps if you can be more specific as to what sort of moronic statements regarding evolution your friends are making, we can give you answers to why they are being moronic.", 
   {}, 
   101294, 
   null, 
   1111777500.0
  ], 
  [
   101364, 
   null, 
   "trebor", 
   "This is not a debate of if I believe in evolution, I already know I do. I want to convince my classmates that I'm not just babbling. I was asking people to simply list some of the evidence. I have no doubt in my mind that evolution is the truth. Sorry if it throws anyone off, but that is all I needed. Hunter remind me alot about my classmates! emoticon_rolleyes\n\n \n \n If you want some pieces of evidence about evolution, first, define evolution for them (Change in genes over time).. and point out that an isolated community in Brenton how has a population that everyone has 6 fingers per hand instead of 5. \n People who were born before 1945 in that town have 5 fingers.\n \n Other than some oddities like that, point to the development of antibodic resistant germs, \n \n and also look at www.talkorigins.org in the FAQ , about evidence for evolution.", 
   {}, 
   101270, 
   null, 
   1111781520.0
  ], 
  [
   101474, 
   null, 
   "Yaacova", 
   "Oh it can be explained simply, just as say gravity can. But explaining where your stupid creationists friend have gone wrong often isn't easy. I can give you a simple explaination of evolution:\n \n \"Life evolves from generation to generation as DNA is imperfectly copied from parents to offspring\"\n \n If you are faced with an idiot comment such as \"if evolution is true, where did the first atom come from?\", you don't actually need to know how evolution works, you just need to know what evolution is and isn't. The question \"if evolution is true, where did the first atom come from?\" is akin to asking \"if gravity is true, where did the first atom come from?\", ie it has nothing to do with gravity and it has nothing to do with evolution.\n \n But if you get a simply naive question like \"prove evolution is true\", that gets a bit more difficult. The problem is, the same person will likely reply to \"prove gavity is true\" by dropping something. This of cause doesn't prove gravity true, but they don't understand that. Likewise showing them one of the many species that have evolved into two different species in recent years won't prove evolution true either, but they will not understand the equivalence with the gavity example.\n \n Perhaps if you can be more specific as to what sort of moronic statements regarding evolution your friends are making, we can give you answers to why they are being moronic.\n\n \n Exactly!! Answer all of those questions! \n \n Quotes: \"evolution is stupid, I don't know anyone who believes in evolution\"\n \"give me proof that evolution exists\"\n \"I don't believe in evolution because the bible doesn't say anything about it\"\n \"That's not evolution, it was like that to begin with\"\n and for more religios people:\n \"I'll have that teacher fired for teaching evolution in the 9th grade\"\n \"dinosaurs are never mentioned in the bible\"\n imagine quotes like that I might come up with more later, this is off the top of my head.\n \n :)Believe me when I tell you no child in my school of 1000 students believes in evolution", 
   {}, 
   101340, 
   null, 
   1111801140.0
  ], 
  [
   101476, 
   null, 
   "Eddie", 
   "Just get out of there as quick as you can. Move to another town, another state or even another country if you have to. It`s not worth the hazzle. :p \n \n \n \n (Oh and the above comment was made tounge in cheek so to speak, `just in case someone didn`t understand that)", 
   {}, 
   101474, 
   null, 
   1111801440.0
  ], 
  [
   101477, 
   null, 
   "Yaacova", 
   "Just get out of there as quick as you can. Move to another town, another state or even another country if you have to. It`s not worth the hazzle. :p \n \n \n \n (Oh and the above comment was made tounge in cheek so to speak, `just in case someone didn`t understand that)\n\n \n I sort of like the \"hazzle\" because I don't like being everybody. I like the friction that it causes to know that I have really good points, if you know what I mean. I hope I'm not coming off as a brat.", 
   {}, 
   101476, 
   null, 
   1111801680.0
  ], 
  [
   101480, 
   null, 
   "Clive14", 
   "\"evolution is stupid, I don't know anyone who believes in evolution\"\nEven in the USA, which is probably the most backward of all the western nations when it comes to science amongst the general population, 95+% of scientists accept evolution. That's a lot of people that your friends do not know about. So perhaps they should stop spouting ignorant nonsense and make the effort to get to know about science.\n \n \n\"give me proof that evolution exists\"\nAntibiotic resistance in bacteria for one. Have you and your friends heard anything about the risk of \"bird flu\" mutating into a pandemic? That is also evolution in action (one of the main topics of study with viruses is their evolution as it is so fast and easy to track). Fruit flies used in labs have evolved into different species from their wild cousins. There are lots of examples that have proved evolution occurs, the best ones are amongst viruses, bacteria and rapidly breeding invertibrates as their generation times are so short.\n \n \n\"I don't believe in evolution because the bible doesn't say anything about it\"\nThe Bible doesn't say anything about Windows XP, Linux, Australia, motorcars, diesel engines, digital cameras, plasma screen TVs, geostationary orbit satelites, Pluto, Disney, MacDonalds, electric light bulbs, C# programming language, Auantum Mechanics, radiation, hydrogen bombs, DVDs or the internet either. Guess none of those exist therefore...\n \n \n\"That's not evolution, it was like that to begin with\"\nProve it...\n \n \n\"I'll have that teacher fired for teaching evolution in the 9th grade\"\nI don't think they can due to your country's constitution.\n \n \n\"dinosaurs are never mentioned in the n=bible\"\nNor are three toed sloths. Their point?\n \n \nBelieve me when I tell you no child in my school of 1000 students believes in evolution\nA few years ago I wouldn't have believed you. These days I know just how bad parts of the USA are.", 
   {}, 
   101474, 
   null, 
   1111802340.0
  ], 
  [
   101525, 
   null, 
   "pandion", 
   "I hope I'm not coming off as a brat.\n\n Actually you're coming off as a troll. Nice going. I was hooked for a bit.\n \n We've been had guys. Yaacova and Hunter are a pair.", 
   {}, 
   101480, 
   null, 
   1111818900.0
  ], 
  [
   101530, 
   null, 
   "Tax_Law", 
   "Well, I see that Hunter continues with his intentional ignorance. Even though it has been explained to him on several occasions, he still chants his \"evolution is only a theory\" mantra in hopes that his audience will be as ignorant as he. \n \n Yes, evolution is a theory. In science that means that it has been tested and accepted as essentially correct. Evolution is a theory just as gravity is a theory - several in fact; Newtonian gravity, general relativity, and quantum gravity. None of those theories actually work in all situations.\n \n But for all practical purposes, evolution has been proven. That's easy since evolution has been observed and the theories are build on the facts of those observations.\n \n You will notice that Hunter hasn't proven any of his assertions. He just knows that there are talking snakes, and magical beings that make people out of dirt. Sure - go ahead and start with the Bible so you can get the mythology of two different creation stories, an impossible flood, and such fantasies as a man being swallowed by a whale or the any human would know about a god that wagers with Satan, out of the way. Not only will you find no proof to support the Bible, you won't evern find any evidence.\n\n \n Okay, let's look at evolution.\n \n Basically, there are two possibilities: (1) The universe predated itself into eternity past (most evolutionists refuse to even talk about this one); or (2) It all started at some point (big bang or something of that sort).\n \n (Did I get that right? There's not a third, I hope.)\n \n If we're to discuss the \"eternity past\" theory, then we're talking about the realm of infinity and that has never been, nor ever will be, proven. Mathematically, it isn't possible.\n \n If it all started at some point (as most evolutionists believe), from what did it start? It is accepted scientific hyposthesis that matter can neither be created nor destroyed. It can only change state. Based on this, everything tangible that we have today had to have been present at the beginning of time. Then where did it come from? If it came from nothing, how do you explain that? If I were an evolutionist, I'd much rather tackle the infinity problem. Even if you're one of the \"progressive evolutionists\" and claim that God started evolution, then where did God come from? (At some point, this issue requires faith.)\n \n You say evolution has been proven? Then prove either one of the two scenarios above. (Or tell me about that third possibility.)\n \n You say evolution has been observed? Then tell me -- who was it that observed the origin or lack thereof?\n \n You can rattle off all sorts of data (real or imagined). But until the origin question has been solved, evolution shall forever remain a huge mystery.", 
   {
    "post_info": {
     "post_title": "Evolution is neither proven nor observed."
    }
   }, 
   101210, 
   null, 
   1111820100.0
  ], 
  [
   101532, 
   null, 
   "Hunter", 
   "A fool has said in his heart, there is no God. What else is there to say? Some people believe in God, and some don't. Skeptics of Christianity should read the words to Amazing Grace. Those words explain a person's faith in Jesus very well. You folks who are wrapped up in secular humanism and liberalism need to ask yourselves what is truly at stake here. What do you stand to lose by denying God? What do you gain?\n To you alleged Christians who believe in evolution, I say this; belief in evolution is calling God a liar. Man did not evolve from a lower form of life, he was created in the image of God, by God. What man who has ever held his new born baby did not give thanks to God for such a great gift from Heaven? Denying the existence of God is the very definition of insanity.\n \n \" God said, let there be light, and there was light.\" Why do so many people chose to walk in complete darkness when the light of salvation still shines? That is the true question. Only you can answer that question.", 
   {}, 
   101480, 
   null, 
   1111820400.0
  ], 
  [
   101544, 
   null, 
   "Big_Bear_Scot", 
   "[QUOTE=Tax_Law]Okay, let's look at evolution.\n \n Basically, there are two possibilities: (1) The universe predated itself into eternity past (most evolutionists refuse to even talk about this one); or (2) It all started at some point (big bang or something of that sort).\n [\\QUOTE]\n \n That is because Evolutionists talk about the Theory of Evolution not the Origin of Life, there are other Scientists that study the Origin of the Life and the Universe. \n That is the thing about Science people Specialise in a certain field of study you would rarely have a Computer Scientist study Evolution, unless of course they are interested in Genetic Algorithms or some such. There is an overlap in some Science but most Scientists specialise.", 
   {}, 
   101530, 
   null, 
   1111826100.0
  ], 
  [
   101555, 
   null, 
   "pandion", 
   "Okay, let's look at evolution.\n\n Oh! Goody! At last someone who wants to actually discuss evolution instead of mythology!\n \nBasically, there are two possibilities: (1) The universe predated itself into eternity past (most evolutionists refuse to even talk about this one); or (2) It all started at some point (big bang or something of that sort).\n\n I thought you were going to talk about evolution? What does cosmology have to do with evolutionary theory? Do you actually know what evolution is? If you claim that you oppose something, wouldn't it be better to actually learn at least the basics of what you claim to oppose instead of making yourself look like a fool? The theory of evolution is a theory of biological science having to do with observed changes in living organisms. The theory of evolution does not apply to the origins of the universe, galaxies, stars, solar systems, planets, or even the origen of life. Those are other fields of science.\n \n(Did I get that right? There's not a third, I hope.)\n\n Obviously not. However, most \"evolutionists\" refuse to talk about an eternal, unchanging universe because it has been disproven. Einstein thought so until Hubble and Lemaître showed him that he was wrong. He included a \"cosmological constant\" in his calculations of general reletivity to make the universe eternal. He admitted that it was the greatest mistake of his scientific career.\n \n Of course there is at least a third hypothesis. A supernatural being created the universe last Thursday with the appearance of history, and created all of the necessary geology, archaeology, and paleontology, as well as history (including all of the books) and memories of all of those living last Thursday. I submit that my \"theory\" of Last Thursdayism is as correct as any theory of creationism. I have as much proof for my view as creationists do for theirs - none.\n \nIf we're to discuss the \"eternity past\" theory, then we're talking about the realm of infinity and that has never been, nor ever will be, proven. Mathematically, it isn't possible.\n\n Again I must ask, what does that nonsense statement have to do with the theories of evolution? How does that apply to observed changes in living organisms over time? Again, why didn't you have the integrity to learn the basics of what you claim to oppose? Are you just another dupe of creationist masters?\n \nIf it all started at some point (as most evolutionists believe), from what did it start?\n\n Yet again we see a demonstration of your ignorance. There is no requirement that an evolutionist must believe that the universe started at a singularity. It may be true that 99% of them do, but it isn't actually relevant to evolutionary theory. Evolutionary theory deals with changes to living organisms over time.\n \n As to the question of the start of the universe, it seems to be consistant with quantum fluctuation. In fact, the spontaneous creation of matter from nothing has been observed. But of course, that has nothing to do with evolution. Only the ignorant claim that it is so.\n \nIt is accepted scientific hyposthesis that matter can neither be created nor destroyed. It can only change state.\n\n I got ahead of you there, didn't I? Actually, you are talking about Newtonian physics, which has been amended twice. In fact, matter seems to spring into existance without cause. It has been observed and measured. It is two steps beyond the Newtonial physics that you cling to.\n \nBased on this, everything tangible that we have today had to have been present at the beginning of time.\n\n An already disproven hypothesis.\n \nThen where did it come from?\n\n It came from a quantum expansion of time and space.\n \nIf it came from nothing, how do you explain that?\n\n Well, scientists in the appropriate fields of science are working on that. I'm not a cosmologist so I rely on scientists in those fields to research those questions. I'm a biologist. I deal with questions of biology, that is living organisms. That is why I am concerned with how living organisms change through time. In other words, that is why I am concerned with evolution. While physicists, cosmologists, geologists and so on may accept evolutionary theory, that doesn't mean that their fields of science are \"evolution.\"\n \nIf I were an evolutionist, I'd much rather tackle the infinity problem.\n\n What are you talking about and what does that have to do with evolution?\n \nEven if you're one of the \"progressive evolutionists\" and claim that God started evolution, then where did God come from? (At some point, this issue requires faith.)\n\n Perhaps you can tell us where God came from. You have spent some considerable effort in arguing that your god is impossible, so where did it come from. Please don't forget to show how your discussion is relevant to evolutionary biology.\n \nYou say evolution has been proven?\n\n Not exactly. It has been proven beyond a reasonable doubt.\n \nThen prove either one of the two scenarios above. (Or tell me about that third possibility.)\n\n First I want you to explain how your two scenarios are linked to evolutionary theory. Cosmology, astrophysics, astronomy, and even abiogenesis aren't evolutionary theory. Go and learn what you are talking about before you speak. You make yourself look foolish with your arguments against cosmology while claiming that you are arguing against evolution.\n \nYou say evolution has been observed? Then tell me -- who was it that observed the origin or lack thereof?\n\n That's ignorant. Several examples of evolution have already been posted. Fruit flies speciated in the lab. Hawthorn maggot flies speciated to infest first apples, followed by cherries and pears. Those are observed speciation events.\n \n\n You can rattle off all sorts of data (real or imagined).\n\n But you can't. You may imagine it but you can't present evidence that supports your position. You can only argue against what you don't understand in the first place. I generally make it a rule to keep my mouth shut unless I have actually had the integrity to educate myself about the basics of a topic. You don't seem to do the same.\n \nBut until the origin question has been solved, evolution shall forever remain a huge mystery.\n\n I'll tell you just one more time, since you seem to be quite slow. Evolution does not consider the question of origins.", 
   {}, 
   101544, 
   null, 
   1111831560.0
  ], 
  [
   101558, 
   null, 
   "pandion", 
   "A fool has said in his heart, there is no God. What else is there to say?\n\n Probably there is a lot to say that actually addresses the topic. You, however, prefer to babble Bible.\n \nSome people believe in God, and some don't.\n\n Wow! I'm converted.\n \nSkeptics of Christianity should read the words to Amazing Grace. Those words explain a person's faith in Jesus very well.\n\n What emotional claptrap! How is that meaningful to a discussion of science? It seems that you can't actually present a rational reason why anyone should believe in Jesus, so you resort to emotional nonsense.\n \nYou folks who are wrapped up in secular humanism and liberalism need to ask yourselves what is truly at stake here.\n\n My be it is that you can't define either secular humanism or liberalism. All you know is that your religious guru has told you that they are wrong.\n \nWhat do you stand to lose by denying God? What do you gain?\n\n Pascal's wager. According to the game theory, it is a bad bet. What if I put my faith in the wrong god, namely your god? Where am I then?\n \nTo you alleged Christians who believe in evolution, I say this; belief in evolution is calling God a liar. Man did not evolve from a lower form of life, he was created in the image of God, by God. What man who has ever held his new born baby did not give thanks to God for such a great gift from Heaven? Denying the existence of God is the very definition of insanity.\n\n What irrational babble! Do you actually think that you were making sense? Why do you think that your version of christianity is more true than the majority view of Christians? Why does acceptance of evolutionary theory (not cosmology) call God a liar? What does a newborn have to do with the question? Why can't you actually address the issues without your emotional claptrap? Why don't you actually educate youself as to the basics of the question rather than continue to make yourself look like a fool?\n \n \" God said, let there be light, and there was light.\" Why do so many people chose to walk in complete darkness when the light of salvation still shines? That is the true question. Only you can answer that question.", 
   {}, 
   101555, 
   null, 
   1111832520.0
  ], 
  [
   101573, 
   null, 
   "trebor", 
   "Okay, let's look at evolution.\n \n Basically, there are two possibilities: (1) The universe predated itself into eternity past (most evolutionists refuse to even talk about this one); or (2) It all started at some point (big bang or something of that sort).\n \n (Did I get that right? There's not a third, I hope.)\n \n If we're to discuss the \"eternity past\" theory, then we're talking about the realm of infinity and that has never been, nor ever will be, proven. Mathematically, it isn't possible.\n \n If it all started at some point (as most evolutionists believe), from what did it start? It is accepted scientific hyposthesis that matter can neither be created nor destroyed. It can only change state. Based on this, everything tangible that we have today had to have been present at the beginning of time. Then where did it come from? If it came from nothing, how do you explain that? If I were an evolutionist, I'd much rather tackle the infinity problem. Even if you're one of the \"progressive evolutionists\" and claim that God started evolution, then where did God come from? (At some point, this issue requires faith.)\n \n You say evolution has been proven? Then prove either one of the two scenarios above. (Or tell me about that third possibility.)\n \n You say evolution has been observed? Then tell me -- who was it that observed the origin or lack thereof?\n \n You can rattle off all sorts of data (real or imagined). But until the origin question has been solved, evolution shall forever remain a huge mystery.\n\n \n \n Of course, evolution is not a theory about how the universe got here. It does not address that at all. That is in the realm of astrophysics and phyiscs.. \n \n What the theory of evolution decribes is how living creatures vary through the generations.. \n \n What you have done is build up a strawman, use a bad definiion for biological evolutoin, and attack that.", 
   {}, 
   101530, 
   null, 
   1111848420.0
  ], 
  [
   101574, 
   null, 
   "trebor", 
   "Probably there is a lot to say that actually addresses the topic. You, however, prefer to babble Bible.\n \n Wow! I'm converted.\n \n What emotional claptrap! How is that meaningful to a discussion of science? It seems that you can't actually present a rational reason why anyone should believe in Jesus, so you resort to emotional nonsense.\n \n My be it is that you can't define either secular humanism or liberalism. All you know is that your religious guru has told you that they are wrong.\n \n Pascal's wager. According to the game theory, it is a bad bet. What if I put my faith in the wrong god, namely your god? Where am I then?\n \n What irrational babble! Do you actually think that you were making sense? Why do you think that your version of christianity is more true than the majority view of Christians? Why does acceptance of evolutionary theory (not cosmology) call God a liar? What does a newborn have to do with the question? Why can't you actually address the issues without your emotional claptrap? Why don't you actually educate youself as to the basics of the question rather than continue to make yourself look like a fool?\n \n \" God said, let there be light, and there was light.\" Why do so many people chose to walk in complete darkness when the light of salvation still shines? That is the true question. Only you can answer that question.\n\n \n \n Well, you are quoting from a book that was written by someone who believed that. However, they are mistaken.\n \n There is no need for salvation, even if there was a god. You are responsible for your own actions, and nobodies blood sacrifice will take your actions away from you.\n \n Why people deceide to live to total superstition is the true question. Only you can answer that question.", 
   {}, 
   101558, 
   null, 
   1111848540.0
  ], 
  [
   101584, 
   null, 
   "Tax_Law", 
   "Oh! Goody! At last someone who wants to actually discuss evolution instead of mythology!\n\n \n Too bad I can't say the same. \n \n \nI thought you were going to talk about evolution? What does cosmology have to do with evolutionary theory? Do you actually know what evolution is? If you claim that you oppose something, wouldn't it be better to actually learn at least the basics of what you claim to oppose instead of making yourself look like a fool? The theory of evolution is a theory of biological science having to do with observed changes in living organisms. The theory of evolution does not apply to the origins of the universe, galaxies, stars, solar systems, planets, or even the origen of life. Those are other fields of science.\n\n \n One of the definitions of \"evolution,\" according to Websters New World Dictionary (I thought you'd like to know, especially because heretofore, you didn't.)\n \n \"Biol. a) the development of a species, organism, or organ from its original or primitive state to its present or specialized state; phylogeny or ontogeny b) DARWINIAN THEORY (see LAMARCKISM, MUTATION)\" [Emphasis added]\n \n The ORIGIN has EVERYTHING to do with evolution.\n \n What I'd like to know is why would you spend the time to do all of that typing when it amounts to nothing more than one long insult? Is that what you think you have to do to win a debate?", 
   {}, 
   101555, 
   null, 
   1111852740.0
  ], 
  [
   101587, 
   null, 
   "jim's trucking", 
   "...\n \"Life evolves from generation to generation as DNA is imperfectly copied from parents to offspring\"\n \n ... \nI'm not confident that this is true. It seems logical that the DNA has to change a bit as a species evolves, but I wouldn't agree with an accidental imperfect copying of DNA. Somehow, the DNA changes are intentional.\n \n There's a bird whose beak has evolved to match the compound curvature of the only flower it feeds from. There are numerous species whose camouflage skin colorations match perfectly the background provided by their environment. There are species that can change colors to more closely match a change in background. There are insects that produce odors exactly matching their prey so they can invade a colony and go undected as the eat the young. There are cave dwelling species that have lost their eyes and pigment (since they don't need them anymore).\n \n These things don't happen by accident.", 
   {}, 
   101340, 
   null, 
   1111854000.0
  ], 
  [
   101593, 
   null, 
   "jim's trucking", 
   "I believe strongly in evolution and believe my opinion in school is very important. One thing that makes voicing my opinion is the fact that no one else thinks so. I find it hard to desrcribe evolution, I mean, I know how it works, I just have to work up vocabulary and get my facts really strait so that I don't have to stumble around trying to prove my point. Can anyone help explain to me simply (so that 8th graders can understand) the facts of evolution and examples ont he human body as well as in animals?\n \n It would help a great deal.\nYou might try some of these sites. I've posted both sides so you can get a picture of how your opponents may think. Some of the sites will be over your head, as they are mine.\n \n Have fun!\n \n BTW, there are those of us who believe in creationism and evolution. Man wrote the bible in allegorical form. God created everything, including evolution!\n \n \n http://evolution.berkeley.edu/\n \n http://www.bsu.edu/web/rquinlan/anth206/basic%20of%20evolution.htm\n \n http://www.harunyahya.com/\n \n http://www.firstlight.net/~chythar/manawolf/articles/evolve.htm\n \n http://science.howstuffworks.com/evolution1.htm\n \n http://www.parentcompany.com/csrc/basics.htm\n \n http://www.abcog.org/evolve2.htm\n \n http://jesuit.ls.luc.edu/~braverman/loyolabio/me/outline03.html", 
   {}, 
   101180, 
   null, 
   1111855380.0
  ], 
  [
   101610, 
   null, 
   "Demon38", 
   "One of the definitions of \"evolution,\" according to Websters New World Dictionary (I thought you'd like to know, especially because heretofore, you didn't.) \"Biol. a) the development of a species, organism, or organ from its original or primitive state to its present or specialized state; phylogeny or ontogeny b) DARWINIAN THEORY (see LAMARCKISM, MUTATION)\" [Emphasis added] The ORIGIN has EVERYTHING to do with evolution.\n \n \n No, the origin of the universe has nothing to do with the theory of evolution. The origin of life has nothing to do with the theory of evolution. Scientific disciplines have bounds. Biologists don't have to account for cosmology because it has nothing to do with the evolution of life on earth. However the universe came into being doesn't affect the theory of evolution. However life first arose has no bearing on the theory of evolution. The ultimate origin has nothing to do with the theory of evoution. I don't see where the definition you quoted does anything to make this point.......", 
   {}, 
   101593, 
   null, 
   1111859280.0
  ], 
  [
   101646, 
   null, 
   "Tax_Law", 
   "No, the origin of the universe has nothing to do with the theory of evolution. The origin of life has nothing to do with the theory of evolution. Scientific disciplines have bounds. Biologists don't have to account for cosmology because it has nothing to do with the evolution of life on earth. However the universe came into being doesn't affect the theory of evolution. However life first arose has no bearing on the theory of evolution. The ultimate origin has nothing to do with the theory of evoution. I don't see where the definition you quoted does anything to make this point.......\n\n \n Recent facts surrounding the details of DNA structures have caused evolutionists to alter their thinking about the complexity of life and the things that must happen in order for changes to occur. With each new discovery of this sort comes more questions than answers. In spite of this one step forward -- two steps backward approach, evolutionists are constantly making claims that they are getting closer to calling their \"theory\" a proven fact.\n \n The laws of science are constant. They don't change to suit political agendas. Whatever forces were in existence at the origin (of life, of matter, of energy, etc.) are the same forces that are in play today. Evolutionists attempt to make this split strictly because they are unable to justify the beginning. And learning the truth about the origin is necessary if true scientists want to find out how it all works. Giving it another name (cosmology) does not provide relief for this requirement.", 
   {}, 
   101610, 
   null, 
   1111864560.0
  ], 
  [
   101655, 
   null, 
   "Yaacova", 
   "Isn't the origin of the universe come from the big bang? please correct me if I'm wrong.", 
   {}, 
   101646, 
   null, 
   1111865220.0
  ], 
  [
   101667, 
   null, 
   "Hunter", 
   "Isn't the origin of the universe come from the big bang? please correct me if I'm wrong.\n\n \n Okay then, you are wrong. Maybe. emoticon_wow", 
   {}, 
   101655, 
   null, 
   1111865760.0
  ], 
  [
   101674, 
   null, 
   "Big_Bear_Scot", 
   "The laws of science are constant. They don't change to suit political agendas. Whatever forces were in existence at the origin (of life, of matter, of energy, etc.) are the same forces that are in play today. Evolutionists attempt to make this split strictly because they are unable to justify the beginning. And learning the truth about the origin is necessary if true scientists want to find out how it all works. Giving it another name (cosmology) does not provide relief for this requirement.\n \n \n I'll repeat for the last time that Evolution does not deal with how life began, it deals with changes in existing life over time.(sometimes it feels like your banging your head off a brick wall in this forum).\n \n The Origin of life is addressed by a number of different theories such as Abiogenesis which examines the generation of life from primordial chemicals, the RNA World Theory where primitive RNA combined to create the very first cells, Extraterrestrial Life where life developed on another planet and then some how made to Earth and Intelligent Design where the building blocks of life was created by some sort of Intelligent being(God, Gods, Aliens).\n \n Evolutionists can believe in one of those theories above depending on the evidence presented to them, but the origin of life does not impact on their field of study.\n \n If anybody is interested I will post more on the topic of the Origin of Life(NB not part of Evolution).", 
   {}, 
   101667, 
   null, 
   1111866780.0
  ], 
  [
   101682, 
   null, 
   "jim's trucking", 
   "...review these sites and get back to me.\n \n \n \n \n \n \n \n http://www.gate.net/~rwms/EvoEvidence.html\n \n http://anthro.palomar.edu/evolve/evolve_3.htm\n \n http://www.txtwriter.com/Backgrounders/Evolution/EVcontents.html\n \n http://www.evolutionpages.com/\n \n http://www.talkorigins.org/faqs/evolution-research.html\n \n http://books.nap.edu/html/creationism/evidence.html\n \n http://www.amazon.com/exec/obidos/ASIN/0393315703/002-7491262-0572013\n \n http://bioweb.cs.earlham.edu/9-12/evolution/HTML/live.html\n \n http://www.pbs.org/wgbh/evolution/educators/lessons/lesson3/act2.html\n \n http://www.geocities.com/evolvedthinking/\n \n http://www.med.wayne.edu/news_media/2003/press5.asp", 
   {
    "post_info": {
     "post_title": "All those who doubt evolution..."
    }
   }, 
   101674, 
   null, 
   1111868580.0
  ], 
  [
   101687, 
   null, 
   "Yaacova", 
   "Okay then, you are wrong. Maybe. emoticon_wow\n\n \n at least you didn't totally deny it.", 
   {}, 
   101667, 
   null, 
   1111870740.0
  ], 
  [
   101694, 
   null, 
   "Alan Ryan", 
   "I'm not confident that this is true. It seems logical that the DNA has to change a bit as a species evolves, but I wouldn't agree with an accidental imperfect copying of DNA. Somehow, the DNA changes are intentional.\n \n There's a bird whose beak has evolved to match the compound curvature of the only flower it feeds from. There are numerous species whose camouflage skin colorations match perfectly the background provided by their environment. There are species that can change colors to more closely match a change in background. There are insects that produce odors exactly matching their prey so they can invade a colony and go undected as the eat the young. There are cave dwelling species that have lost their eyes and pigment (since they don't need them anymore).\n \n These things don't happen by accident.\n\n \n These examples (of \"intentional DNA change\" ?) are so well chosen in support of the conclusion in your final sentence that I'd like to believe it. \n \n However, I cannot suspend my disbelief in your conclusion which presupposes that the order and beauty of the universe reflects the greatness and demonstrates the reality of its Ultimate Cause. In other words, I think you are presenting the case for \"intelligent design\". (These things don't happen by accident).\n \n Apart from the scientific objections to such a case which other contributors to this thread could outline better than I could, I would draw attention to the following:\n \n If it were possible to engage in causal reasoning in this case, it would not warrant the intended conclusion. The presumed cause must be proportional to the observed effect, so the manifest imperfections of the natural world could not support a belief in the perfection of its creator. The argument from design is a two-edged sword which is as likely to persuade us of the frailty as of the power of the presumed cause of the world as we know it.", 
   {}, 
   101587, 
   null, 
   1111872180.0
  ], 
  [
   101698, 
   null, 
   "jim's trucking", 
   "These examples (of \"intentional DNA change\" ?) are so well chosen in support of the conclusion in your final sentence that I'd like to believe it. \n \n However, I cannot suspend my disbelief in your conclusion which presupposes that the order and beauty of the universe reflects the greatness and demonstrates the reality of its Ultimate Cause. In other words, I think you are presenting the case for \"intelligent design\". (These things don't happen by accident).\n \n Apart from the scientific objections to such a case which other contributors to this thread could outline better than I could, I would draw attention to the following:\n \n If it were possible to engage in causal reasoning in this case, it would not warrant the intended conclusion. The presumed cause must be proportional to the observed effect, so the manifest imperfections of the natural world could not support a belief in the perfection of its creator. The argument from design is a two-edged sword which is as likely to persuade us of the frailty as of the power of the presumed cause of the world as we know it.\nJesus! Could you possibly be more profound?", 
   {}, 
   101694, 
   null, 
   1111872840.0
  ], 
  [
   101703, 
   null, 
   "Alan Ryan", 
   "Jesus! Could you possibly be more profound?\n\n \n No Jim: not profound: I've just been doing a lot of reading lately on the subject of \"intelligent design\". I wanted to clarify my thoughts on why I reject this (powerful) concept without parroting arguments from evolutionary biology - a science which is covered more than adequately by people (on this forum) who know far more about it than I do.", 
   {}, 
   101698, 
   null, 
   1111874160.0
  ], 
  [
   101752, 
   null, 
   "Demon38", 
   "Tax Law said:\n \nRecent facts surrounding the details of DNA structures have caused evolutionists to alter their thinking about the complexity of life and the things that must happen in order for changes to occur. With each new discovery of this sort comes more questions than answers. In spite of this one step forward -- two steps backward approach, evolutionists are constantly making claims that they are getting closer to calling their \"theory\" a proven fact.\n \n \n First of all, this doesn't address the point I made. The theory of evolution has nothing to do with abiogenesis or the origin of the universe. Now, scientists alter their thinking about the complexity of life? Kind of a fuzzy statement, but that's what scientists do, they evaluate new data to increase their understanding of a theory. Your claim that we are taking one step forward and two steps backward is ridiculous. Our understanding of genetics is growing everyday, no steps backward. As to your claim that scientists are getting closer to calling the theory of evolution a fact, it demonstrates that you don't know what a scientific theory is! No theory EVER becomes a fact in science. Theories are proposed to explain facts. Evolution is a fact, it happens and the theory of evolution explains it.\n \n \nThe laws of science are constant. They don't change to suit political agendas. Whatever forces were in existence at the origin (of life, of matter, of energy, etc.) are the same forces that are in play today.\n \n \n This is true, the forces of natural selection, mutation, genetic drift, ect. have been working since life first arose on the earth, this is supported by all available evidence.\n \n \nEvolutionists attempt to make this split strictly because they are unable to justify the beginning.\n \n \n Untrue. Life on earth didn't arise at the begining, it arose 3.8 billion years ago. Evolutionary biologists don't have anything to do with the begining of the universe, they don't study it, they don't care about it, they make no attempt to justify it. However the universe came into being has nothing to do with the natural processes that drive evolution. Once life arose, no matter what it arose from, no matter how the universe came to exist, it evolved, the evidence makes that clear. Please explain WHY evolutionary biologists must explain the begining of the universe, how does it impact the theory of evolution.\n \n \nAnd learning the truth about the origin is necessary if true scientists want to find out how it all works. \n \n \n But biologists don't study the origin of the universe, the forces that were at work, they just don't have any bearing on the theory of evolution. Your assertion of what a true scientist wants is crazy. Does a medical researcher have to learn the truth about the origin of the universe before he developes a new vaccine? Does an oceanographer need the origin of the universe to explain deep sea currents? Does a geologist need the origin of the universe to explain oil field formation? Of course not. \n \n \nGiving it another name (cosmology) does not provide relief for this requirement.\n \n \n Theoretical physicists and astronomers study cosmology not biologists. Your confusion on this issue stems from your lack of understanding of what science is and how it works.", 
   {}, 
   101703, 
   null, 
   1111886940.0
  ], 
  [
   101782, 
   null, 
   "pandion", 
   "Too bad I can't say the same.\n\n My mistake. I thought you were going to discuss evolution. Instead you revealed your ignorance of cosmology. It is too bad that you clearly can't say the same since you are clearly unequiped to discuss evolution.\n \nOne of the definitions of \"evolution,\" according to Websters New World Dictionary (I thought you'd like to know, especially because heretofore, you didn't.)\n\n Actually, I have known the definition of evolution since I took my first course in evolutionary biology many years ago. That goes along with my courses in genetics, ecology, and the like, that form the basis upon which my degree in biology was granted.\n \n\"Biol. a) the development of a species, organism, or organ from its original or primitive state to its present or specialized state; phylogeny or ontogeny b) DARWINIAN THEORY (see LAMARCKISM, MUTATION)\" [Emphasis added]\n\n Well thanks for that. But what your Little Golden Dictionary says isn't really relevant to what biologists mean when they talk about evolution. That really isn't a very good definition - much too narrow and incorporating a flawed conception of the theory. But I'm sure that you notice that even that flawed definition talks about species, organisms, organs, phylogeny and ontogeny. It further specifies that these things already existed. Only a fool would think that that the definition included the origin of the universe. It doesn't even include the origin of life.\n \nThe ORIGIN has EVERYTHING to do with evolution.\n\n I tried to explain to you before, but if you want to insist on displaying intentional ignorance, go ahead.\n \nWhat I'd like to know is why would you spend the time to do all of that typing when it amounts to nothing more than one long insult?\n\n I was trying to educate you on the basics. But since you lack the integrity to actually learn, I can understand how pointing out your ignorance would seem like an insult to you.\n \nIs that what you think you have to do to win a debate?\n\n There wasn't any debate. You made some statements that are wrong. There is no doubt that you are wrong and that you don't know the slightest thing about the topic. A debate would imply that you were informed about the issues and were able to state why your position is correct. That is obviously not true.\n \nRecent facts surrounding the details of DNA structures have caused evolutionists to alter their thinking about the complexity of life and the things that must happen in order for changes to occur.\n\n And I'm sure that you can adequately explain these facts, what the \"old thinking\" was and how and why it has changed. Please explain what is meant by \"the complexity of life.\" What things must happen in order for changes to occur - you can limit the reply to the new things that must occur since biologists are pretty aware of how and why organisms change according to the \"old thinking,\" i.e., the theory of evolution.\n \nWith each new discovery of this sort comes more questions than answers. In spite of this one step forward -- two steps backward approach, evolutionists are constantly making claims that they are getting closer to calling their \"theory\" a proven fact.\n\n Oh, oh. You have just shown yourself to be just another scientific illiterate. Scientific theories don't grow up to be facts. Unlike \"creation science\" where the conclusion is the starting point and the facts are selectively mined and distorted to point to the conclusion, science starts with facts. The last step is a theory - theory of gravity, germ theory of disease, heliocentric theory, atomic theory, tectonic theory, and of course, evolutionary theory.\n \nThe laws of science are constant.\n\n Since the laws of science are actually statements by humans of observations of nature, they can change as our understanding increases. But there is an assumption made by science that the forces that we see in action today are the same forces that have been in action in the past. Thus, we see erosion and sedimentation going on today and we are sure that similar structures in the earth were created by the same forces. We see animals change today as they adapt to their environment, and we are sure that those sorts of adaptations took place in the past.\n \nThey don't change to suit political agendas.\n\n No they don't. And that is why it is so sad to see the religious right make a political issue of their religion and try to pretend that mythology has a place in science.\n \nWhatever forces were in existence at the origin (of life, of matter, of energy, etc.) are the same forces that are in play today.\n\n Exactly.\n \nEvolutionists attempt to make this split strictly because they are unable to justify the beginning.\n\n Now you're being silly. Evolutionists are biologists. That means that they study living organisms. How the universe formed is unimportant to the observed changes in living organisms. Whether it was the big bang or the big magical skyman makes no difference. Creationists try to lump all science they don't understand or that conflicts with their mythology under the name \"evolution.\"\n \nAnd learning the truth about the origin is necessary if true scientists want to find out how it all works.\n\n That may be true, but no single scientist is capable of learning and understanding all of science. No progress would be made at all. That is why scientists concentrate their studies on only a small specialized field of science. That is why there are astronomers, particle physicists, nuclear physicists, astrophysicists, geneticists, molecular biologists, population geneticists, cytologists, ornithologists, and on and on. But to be a competent ornithologist does not require intimate knowledge of the physics of the big bang. Nevertheless, I suspect that I know more about that topic than you do too.\n \nGiving it another name (cosmology) does not provide relief for this requirement.\n\n And trying to lump all science that conflicts with your mythology based religion does not impose a requirement. Either you can learn what you are talking about or you can continue to make yourself look foolish.", 
   {}, 
   101752, 
   null, 
   1111893900.0
  ], 
  [
   105121, 
   null, 
   "cannon21", 
   "\n Quote:\n \"dinosaurs are never mentioned in the n=bible\" \n \n Nor are three toed sloths. Their point?\n \n \n\n \n I'm not taking sides with this arguement at the moment but one of your arguements was a bit floored. In the Book of Job they mention creatures called Behemoth's which could fit the description. I'm not saying its right but the link below has some interesting information on it as well as some cartoons!\n \n http://www.angelfire.com/mi/dinosaurs/behemoth.html", 
   {}, 
   101480, 
   null, 
   1112889540.0
  ], 
  [
   105164, 
   null, 
   "trebor", 
   "I'm not taking sides with this arguement at the moment but one of your arguements was a bit floored. In the Book of Job they mention creatures called Behemoth's which could fit the description. I'm not saying its right but the link below has some interesting information on it as well as some cartoons!\n \n http://www.angelfire.com/mi/dinosaurs/behemoth.html\n\n \n Actually, no. \n A behemoth, if you understand Hebrew, is a huge wild ox. (Targum on Psalms 50:10). It can also refer to any cattle, or a hippopotomus. (\"Nile horse\")", 
   {}, 
   105121, 
   null, 
   1112895780.0
  ], 
  [
   105168, 
   null, 
   "unkerpaulie", 
   "Actually, no. \n A behemoth, if you understand Hebrew, is a huge wild ox. (Targum on Psalms 50:10). It can also refer to any cattle, or a hippopotomus. (\"Nile horse\")\n\n even if it behemoth did mean dinosaur in the context, it would support yaacova by helping him counter the creationist objections", 
   {}, 
   105164, 
   null, 
   1112896140.0
  ], 
  [
   105174, 
   null, 
   "unkerpaulie", 
   "I'm not confident that this is true. It seems logical that the DNA has to change a bit as a species evolves, but I wouldn't agree with an accidental imperfect copying of DNA. Somehow, the DNA changes are intentional.\n \n There's a bird whose beak has evolved to match the compound curvature of the only flower it feeds from. There are numerous species whose camouflage skin colorations match perfectly the background provided by their environment. There are species that can change colors to more closely match a change in background. There are insects that produce odors exactly matching their prey so they can invade a colony and go undected as the eat the young. There are cave dwelling species that have lost their eyes and pigment (since they don't need them anymore).\n \n These things don't happen by accident.\n\n intentional? jim, you specialized birds didnt always have beaks that way. the ancestor of the birds with specialized beaks didnt intentionlly create offspring with specialized beaks. how it works is that each offspring's beak may be slightly \"deformed\" because of dna copying imperfections. the birds born with beaks that happen to give them the ability to feed from those flowers would continue their flower diet. those that could not would either live on a different diet or die off. after many many generations, the flower feeding birds with the best adapted beaks would survive, those with beaks of a different shape would not.\n \n no \"intentional\" mutation, same results", 
   {}, 
   101587, 
   null, 
   1112896440.0
  ], 
  [
   105183, 
   null, 
   "jim's trucking", 
   "intentional? jim, you specialized birds didnt always have beaks that way. the ancestor of the birds with specialized beaks didnt intentionlly create offspring with specialized beaks. how it works is that each offspring's beak may be slightly \"deformed\" because of dna copying imperfections. the birds born with beaks that happen to give them the ability to feed from those flowers would continue their flower diet. those that could not would either live on a different diet or die off. after many many generations, the flower feeding birds with the best adapted beaks would survive, those with beaks of a different shape would not.\n \n no \"intentional\" mutation, same results\nI respectfully disagree.\n \n There's also a snake that has a tail that looks like a head...has fake eyes and other \"facial features\". How did that species of snake get that way without having lived through many genarations of being attacked on the head end before evolving to have its disposable tail end look like a head?\n \n How did the blind cave fish come to be without eyes? (They have places where eyes should be, but no eyes.) How did they come to have no pigment? It wasn't by accident. Living so many generations in pitch black cave water, they came to have no need of eyes or pigment, so they evolved into blind pigmentless fish. No accident there.", 
   {}, 
   105174, 
   null, 
   1112898300.0
  ], 
  [
   105227, 
   null, 
   "unkerpaulie", 
   "I respectfully disagree.\n \n There's also a snake that has a tail that looks like a head...has fake eyes and other \"facial features\". How did that species of snake get that way without having lived through many genarations of being attacked on the head end before evolving to have its disposable tail end look like a head?\n \n How did the blind cave fish come to be without eyes? (They have places where eyes should be, but no eyes.) How did they come to have no pigment? It wasn't by accident. Living so many generations in pitch black cave water, they came to have no need of eyes or pigment, so they evolved into blind pigmentless fish. No accident there.\n\n evolution isnt an accident. its just that its not intentional. when you say \"intentional\", i got the idea you mean either the organism was making a conscious effort to become more suited to its enironment, or that some intelligent force was \"molding\" that organism into something better suited for its environment\n \n in reality, every offspring of every organism or organism pair is slightly different than the sum of its parents. because of this, random variations arise, including that of physical features. an organism that happens to be born with a feature that gives it a competitive advantage in its environment will be more successful (produce more viable offspring) and preserve or build on that feature. if the advantage is very great, over generations the organisms with the new feature will likely overrun the organisms that lack it, creating a new species entirely, and displacing the species that was there before\n \n of courese, if the environment changes, then the new species may be disadvantaged and the species that lack the new feature might eventually be the more successful variation\n \n thats how fish could possibly lose their eyes from lack of use. in a lightless environment, a fish with poor sight might have developed a better sense of smell or temperature detection that those with good sight. the poor sighted specimen would end up being more successful. repeat this for a number of generations and you end up with blind fish thriving in caves\n \n so its not really an accident, but i would not call it intentional either", 
   {}, 
   105183, 
   null, 
   1112909340.0
  ], 
  [
   105254, 
   null, 
   "Duo_Maxwell", 
   "Evolution is only a theory, and thus it shall remain. If a theory can't be proven in 150 years, there is very little possibility that it will ever be proven. I urge you to continue to seek the truth, start with the Bible. emoticon_xangel\n\n \n I find this amusing. The Greek theory that the Earth was round wasn't proven beyond math for several hundred years. Yet we know that to be true. Concepts of eletricity have been around for eons yet only in the 1700s were they proven. Basic physic theories have been around since the scientific enlightenment but only proven in the mid 1900s. Time is really irrevelant to whether or not a theory will be proven and if it is worth discussing. \n \n I also find it amusing that you believe the truth comes from a book that no one can verify as the truth, or even historically accurate. \n \n Seems that instead of proven facts which we can do in the lab if you'd like to come over, you'd rather think that the truth is something that cannot be proven.", 
   {}, 
   101206, 
   null, 
   1112913600.0
  ], 
  [
   107767, 
   null, 
   "Kuato", 
   "Egads. emoticon_frazzled \n \n I think there's room for both the \"theory\" of evolution and the \"unproven truth\" of the Bible. How about this:\n \n God created all, and man in his own image. But God also gave all living things the ability to change over time -evolution- so as to be successful. Why would He create something doomed to failure? If God indeed knows all/sees all, then He would be aware of design flaws in what He was making. (Believe in God if you want to, or not)\n \n Take humans as an example of evolution. Wait, that's too much. Let's take a look at a couple of body parts and the general appearance of humans, in a very simple example.\n \n Northern Europeans, from a cold climate with less light. Light/white skin, as no protection from harmful UV in sunlight required. Lightly pigmented eyes, same reason. Thin noses, to slow and heat the air in nasal cavities prior to it entering the lungs. Generally large, as a larger form retains heat better than a smaller one.\n \n Central Africans, from a hot climate with much more light. Dark skin, as protection from sunlight required. Eyes also dark for same reason. Wider noses, to allow dispersal of heat. Generally thinner about the hips than northern Europeans, as to not retain as much heat (think wide receiver vs offensive lineman)\n \n Even inside the African continent we can see some genetic diversity (evolution). Take the Masai. They are tall and very thin. Very apt construction for people that live on the plains and are in the sunlight a lot. Thin to minimize exposure to the sun and disperse heat, and tall so with their long strides they can get places more efficiently. Now contrast with the pygmy peoples. They are much shorter than the Masai, and lighter skinned. They live in the thick jungle, where being tall and gangly would be a definite disadvantage; their lack of dark pigment echoes the fact that not as much sunlight reaches the jungle floor. \n \n With these examples I think it is easy to see that there is some sort of force at work. It's called natural selection; those organisms with the traits necessary to survive in a certain environment, will survive, while those without the necessary traits will not.", 
   {}, 
   105254, 
   null, 
   1113593640.0
  ], 
  [
   107917, 
   null, 
   "gnojek", 
   "Isn't the origin of the universe come from the big bang? please correct me if I'm wrong.\n\n \n The funny thing about the whole big band thing:\n \n While it is supported by the CBR and other observations, other theories claim to be supported by the same evidence. \n \n Then, when you realize how they came to the first conclusions about the BB back in the day, they did fancy extrapolations. They said, based on the way it looks now, let's assume that it had been doing the same thing the whole time. This is similar to when a creationist extrapolates the current waning of Earth's magnetic field to say that it can't be billions of years old. It's really the same concept (except there is evidence to contradict the creationists like the alternating polarity along the Atlantic seafloor). For all the cosmologists know, the universe breathes in and out for some unknown reason. The reason for breathing is as well known as the reason for accelerating expansion which has been recently observed. The only explanation the cosmologists can come up with is mysterious dark energy and such. It could be that, or it could be that the whole theory and hence our understanding of the universe is flawed.\n \n The BB is the best explanation out there for all the data (from what I know), but it can't explain certain problems very well at all. But one has to assume a beginning to the universe because infinite time, especially time with no beginning starts to run into logical paradoxes, IMO. \n \n Anyway, the whole thing about evolution being about origins:\n \n Maybe we could clear this up with a convention. Maybe, from now on we can refer to the change in species or whatnot over time as The Theory of Evolution, or maybe even biological evolution. I see no problem with calling the evolution of the universe from the \"beginning\" as evolution, as long as it's spelled with a little e. \n \n A biologist can get as PO'd as he wants and totally avoid questions about cosmology and physics. Afterall why would they want to argue outside their expertise? But, berating someone for referring to BB-<present as \"evolution\" which is just what things do (change over time) just makes them think that you are avoiding the question. WRT this, science is a long way off from making any hard and fast claims about the actual origins of the universe and life. These are big hard questions that don't really have a solid answer right now. So, anyone attacking the concept of evolution from these areas is attempting to attack science at weak points. They never seem to realize though that their alternative explanations are worlds weaker.", 
   {}, 
   101655, 
   null, 
   1113616980.0
  ], 
  [
   107921, 
   null, 
   "pandion", 
   "You can talk about evolution, meaning change over time, all you want. But you are not discussing the theory of evolution - small e, since a capital e isn't necessary. The theory of evolution deals with explanations for the changes observed in living organisms over time. Moreover, the changes must be genetic (heritable) for it to be part of the theories of evolution. Evolution is a change in the allele frequencies in a population over time. Any other meaning only means change and is not part of the theory of evolution. Those other theories that have to do with how stars and galaxies change have their own names - just as the big bang theory isn't part of the theory of evolution. The big bang theory is a theory in its own right and part of the science of cosmology. The theory of evolution is part of biological science.\n \n Think you can grasp that?", 
   {}, 
   107917, 
   null, 
   1113618240.0
  ], 
  [
   107929, 
   null, 
   "sinjin", 
   "I think a \"singularity\" is a pretty good start and \"breath in and breath out\" has not been established. I believe oddly the expansion just may continue infinitely as it looks just now.", 
   {}, 
   107921, 
   null, 
   1113621540.0
  ], 
  [
   107955, 
   null, 
   "Mach", 
   "But evolution is simple science.\n \n Children are different than their parents. Any 8th grader observes this. Over time, such continued differences can lead to organisms that no longer resemble distance ancestors.\n \n The End.\n \n Really now. I'm not sure what you think you're asking. If you are asking how you can teach 8th graders what is normally taught in 12th grade, college, and beyond, you are kidding us.\n \n If you are asking what PARTS of the fact of evolution might be good to teach at 5th grade, I'm sure there are ample references to help you.\n \n For starters:\n \n Humans evolved from other life.\n All living things carry the instructions on how they were made inside DNA.\n When animals reproduce, DNA is passed on to the offspring.\n DNA can change during reproduction, or through mutation.\n It's these changes in DNA, over thousands of years, that can lead to significant changes in a population.\n This is why children look different than their parents.\n Evolution is a fact.\n \n -Mach", 
   {}, 
   101180, 
   null, 
   1113633780.0
  ], 
  [
   108852, 
   null, 
   "gnojek", 
   "You can talk about evolution, meaning change over time, all you want. But you are not discussing the theory of evolution - small e, since a capital e isn't necessary. The theory of evolution deals with explanations for the changes observed in living organisms over time. Moreover, the changes must be genetic (heritable) for it to be part of the theories of evolution. \n\n Ok. No big e. The \"theory of evolution\" works for me.\n \n \nEvolution is a change in the allele frequencies in a population over time.\n\n Biological evolution, yes.\n Generic evolution, though, is just change of anything over time:\n Cosmic evolution\n Stellar evolution\n Galactic evolution\n Chemical evolution\n Cultural evolution\n \n \n \nAny other meaning only means change and is not part of the theory of evolution.\n\n Right, but when a creationist starts spouting about \"evolution\" and never says \"the theory of...\" we may not know what specifically they are attacking. Unless they specify that they are attacking the theory of evolution, then someone probably shouldn't retort with \"O, I thought you wanted to talk about evolution. The big bang has nothing to do with evolution.\" But it does, since it has to do with cosmic evolution. It has nothing to do with the theory of evolution because the theory of biological evolution already took the name \"theory of evolution\" in common parlance.\n \n \nThose other theories that have to do with how stars and galaxies change have their own names - just as the big bang theory isn't part of the theory of evolution. The big bang theory is a theory in its own right and part of the science of cosmology. The theory of evolution is part of biological science.\n \n Think you can grasp that?\n\n Yes, but I don't know if you are capable of grasping anyone else's viewpoint. \n \n Are you?\n \n A creationist views the world as mostly static. The basic way the world is now is the way it was in the beginning. Or really, any changes that occur do so only by the hands of men, or by divine intervention. To them, natural processes cannot change things over time to get them to the state we see today. This, to them is \"evolution.\" And they aren't wrong in calling it evolution. The entire universe evolves. Everything evolves in some way or another. Creationists don't like this idea and attack it. But, if you start off with \"you don't know what evolution is,\" you won't change any minds. \n \n I understand. Biology beat out the other sciences in naming a theory the theory of evolution. I'm just saying that berating someone for calling cosmic evolution \"evolution\" is pretty hard-headed. If they want to use the generic definition of the term, let them.", 
   {}, 
   107921, 
   null, 
   1113865200.0
  ], 
  [
   108855, 
   null, 
   "gnojek", 
   "Also, I'm surprised nobody totally creamed my little cartoon version of the BB.\n \n There are tons of evidence to suggest that some form of cosmic expansion has been taking place and that there was a beginning to it all. The Hubble Deep Field shows that galaxies 13 bya are different than they are now, which would be predicted by the BB theory. And before a certain time (at a certain distance from us) you can't see any galaxies at all, but you do see the first stars, which are different from the stars we see now. And before that, you can't see anything really. \n \n This is just one example. \n \n It's still a pitiful shame about inflation, dark energy, dark matter, and all that jazz. {shrug-whatchagonnado?}", 
   {}, 
   108852, 
   null, 
   1113865500.0
  ], 
  [
   108909, 
   null, 
   "Tastyfish", 
   "Trouble is the way evolution is used out of the normal context by creationists is similar to if we said the bible is clearly fiction, as it does not address the workings of plasma TVs. As we all know, 'bible' is greek for 'book' and to say that there is nothing in a book about plasma TVs is nonsense.", 
   {}, 
   108855, 
   null, 
   1113873360.0
  ], 
  [
   108919, 
   null, 
   "pandion", 
   "Generic evolution, though, is just change of anything over time:\n Cosmic evolution\n Stellar evolution\n Galactic evolution\n Chemical evolution\n Cultural evolution\n\n Was it that I wasn't clear or that you weren't paying attention. None of that is part of the theory of evolution. You have reduced the word to mean nothing more than change, and that is certainly not the connotation of biological evolution, i.e., the theory of evolution.\n \nI understand. Biology beat out the other sciences in naming a theory the theory of evolution. I'm just saying that berating someone for calling cosmic evolution \"evolution\" is pretty hard-headed. If they want to use the generic definition of the term, let them.\n\n No. Because they are wrong and you are wrong to let them. Just because creationists are so sloppy in their understanding of science is no reason that you have to be. Creationists do it so that they can lump anything in science that they don't like under the \"theory of evolution.\" So if they talk about stellar evolution, or chemical evolution or anything else, correct them. They will explain to you that it was all Darwin's idea and that it is an effort to reject God and escape punishment. They are wrong and you are wrong to take part in such sloppy pseudoscience.", 
   {}, 
   108909, 
   null, 
   1113876000.0
  ], 
  [
   109409, 
   null, 
   "gnojek", 
   "Trouble is the way evolution is used out of the normal context by creationists is similar to if we said the bible is clearly fiction, as it does not address the workings of plasma TVs. As we all know, 'bible' is greek for 'book' and to say that there is nothing in a book about plasma TVs is nonsense.\n\n \n We don't commonly use the term Bible for \"book\" anymore.\n If we did, your argument would be valid.", 
   {}, 
   108909, 
   null, 
   1113959160.0
  ], 
  [
   109419, 
   null, 
   "Tastyfish", 
   "OK then - so when the bible was written it did not contain instructions for making chariots...same argument.\n \n Evolution generally means biological evolution unless another term is added to change the meaning. Same as Bible refers to the Christian one rather than the 40K Fluff Bible, or the Photoshop bible and other various computing bibles etc.", 
   {}, 
   109409, 
   null, 
   1113959460.0
  ], 
  [
   109424, 
   null, 
   "gnojek", 
   "Was it that I wasn't clear or that you weren't paying attention. None of that is part of the theory of evolution.\n\n It's that you weren't paying attention and I must not have been clear enough.\n \n I just said what you said, like 3 times and stuff and junk.\n \n I said these things aren't the theory of evolution.\n They are evolution.\n Clear?\n \n \nYou have reduced the word to mean nothing more than change, and that is certainly not the connotation of biological evolution, i.e., the theory of evolution.\n\n \n That's all the word ever means. Change (over time as if you can have any other type of change).\n \n \n \nNo. Because they are wrong and you are wrong to let them. Just because creationists are so sloppy in their understanding of science is no reason that you have to be.\n\n Who's being sloppy?\n If they use the phrase \"theory of evolution\" you have every right to jump down their totally wrong throats. But they don't, they use the word evolution. \n \n Going around saying NOTHING is evolution except biological evolution is what's sloppy.\n \n \n \nCreationists do it so that they can lump anything in science that they don't like under the \"theory of evolution.\"\n\n No, it's so they can lump everything they don't like into something described by a word, evolution. It's evolution of ANYTHING, not just biology, that they oppose. \n \n They know exactly what they are attacking and they call it by its name.\n \n Hey, I'm sure every once an a while they call BB to present the \"theory of evolution\" and they are wrong to do so.\n \n \n \nSo if they talk about stellar evolution, or chemical evolution or anything else, correct them. They will explain to you that it was all Darwin's idea and that it is an effort to reject God and escape punishment. They are wrong and you are wrong to take part in such sloppy pseudoscience.\n\n I doubt they think that Darwin had anything to do with cosmology.\n They can be pretty dense, but give them a little bit of credit.", 
   {}, 
   108919, 
   null, 
   1113959700.0
  ], 
  [
   109426, 
   null, 
   "Tastyfish", 
   "But they don't oppose all forms of evolution then - I've seen very few arguments against cultural evolution, or the evolution of the modern sportscar. They mean 'biological evolution' and other bible contradicting science.", 
   {}, 
   109424, 
   null, 
   1113959940.0
  ], 
  [
   109432, 
   null, 
   "gnojek", 
   "OK then - so when the bible was written it did not contain instructions for making chariots...same argument.\n\n I think this is a bad analogy or something.\n And people usually say THE bible.\n If they said A book, or even A bible the meaning is different.\n \n \n Like I would say THE theory of evolution is something different from A theory of evolution. I could be talking about A theory of stellar evolution and I wouldn't be wrong.\n \n But BIBLE is not an english word, evolution is.\n But in english BIBLE means one particular book.\n \n But someone could say \"This is the fisherman's bible.\"\n And the next day say \"This is my bible.\" (referring to the fishing guide)\n Would you bitch them out for misuse of the term, even though they didn't misuse the term?\n \n \nEvolution generally means biological evolution unless another term is added to change the meaning. Same as Bible refers to the Christian one rather than the 40K Fluff Bible, or the Photoshop bible and other various computing bibles etc.\n\n Generally by whom?\n Generally, by creationists, evolution means what it says.\n Then they can qualify it by biological if they want to.\n \n Look we are just talking about common usage not absolute definitions.\n \n If someone uses a word correctly, I can't bitch at them for not using in the common way.", 
   {}, 
   109419, 
   null, 
   1113960300.0
  ], 
  [
   109433, 
   null, 
   "gnojek", 
   "But they don't oppose all forms of evolution then - I've seen very few arguments against cultural evolution, or the evolution of the modern sportscar. They mean 'biological evolution' and other bible contradicting science.\n\n Or cosmic evolution or any other bible contradicting form of evolution.", 
   {}, 
   109426, 
   null, 
   1113960360.0
  ], 
  [
   109443, 
   null, 
   "Tastyfish", 
   "But you said they are using evolution right - unless they are making themselves clear about which one they are talking about, or 'biological evolution' which is known as just evolution they are wrong if they want to start lumping all forms of evolution together. However you look at it, the theory of evolution is about change in allele frequency or on its own term so vague there is no point bringing it up as it covers the begining of the universe, evolution of man, abiogensis and sportscars.\n \n If you start talking about stellar evolution and then just use evolution to refer to it again thats all well an good. Using a general term to cast doubt on completely unrelated fields is not.", 
   {}, 
   109433, 
   null, 
   1113960900.0
  ], 
  [
   109467, 
   null, 
   "pandion", 
   "I doubt they think that Darwin had anything to do with cosmology.\n They can be pretty dense, but give them a little bit of credit.\n\n But they do. I've seen it time and again. The problem is that you do give them credit and allow them to believe that their idiocy is legitimate. They will tell you that the amount of dust on the moon disproves evolution. The shrinking sun disproves evolution. All kinds of idiocy, and you legitimize it by respecting it. Good going.", 
   {}, 
   109424, 
   null, 
   1113962040.0
  ], 
  [
   109723, 
   null, 
   "Kuato", 
   "I think this is a bad analogy or something.\n And people usually say THE bible.\n If they said A book, or even A bible the meaning is different.\n \n Like I would say THE theory of evolution is something different from A theory of evolution. I could be talking about A theory of stellar evolution and I wouldn't be wrong.\n \n But BIBLE is not an english word, evolution is.\n But in english BIBLE means one particular book.\n \n But someone could say \"This is the fisherman's bible.\"\n And the next day say \"This is my bible.\" (referring to the fishing guide)\n Would you bitch them out for misuse of the term, even though they didn't misuse the term?\n \n Generally by whom?\n Generally, by creationists, evolution means what it says.\n Then they can qualify it by biological if they want to.\n \n Look we are just talking about common usage not absolute definitions.\n \n If someone uses a word correctly, I can't bitch at them for not using in the common way.\n\n \n You're arguing semantics; I'm sure you realize that word usage is based on context. In your fishing book example above, it's understood that the word \"bible\" refers to the book in hand.\n \n While occasionally this sort of discussion is necessary for clarity, in this case, meh, I don't think so.", 
   {}, 
   109432, 
   null, 
   1114006320.0
  ], 
  [
   109930, 
   null, 
   "gnojek", 
   "But you said they are using evolution right - unless they are making themselves clear about which one they are talking about, or 'biological evolution' which is known as just evolution they are wrong if they want to start lumping all forms of evolution together. However you look at it, the theory of evolution is about change in allele frequency or on its own term so vague there is no point bringing it up as it covers the begining of the universe, evolution of man, abiogensis and sportscars.\n \n If you start talking about stellar evolution and then just use evolution to refer to it again thats all well an good. Using a general term to cast doubt on completely unrelated fields is not.\n\n \n Wait, scratch that.\n \n Cultural evolution would contradict the Bible in that all the cultures of the world came from the Tower of Babel.\n \n Even though there have been severe changes in culture since the time of the story.\n \n I'm not sure where that one would stand.", 
   {}, 
   109443, 
   null, 
   1114035300.0
  ], 
  [
   109931, 
   null, 
   "gnojek", 
   "You're arguing semantics; I'm sure you realize that word usage is based on context. In your fishing book example above, it's understood that the word \"bible\" refers to the book in hand.\n \n While occasionally this sort of discussion is necessary for clarity, in this case, meh, I don't think so.\n\n I didn't start it. :)", 
   {}, 
   109723, 
   null, 
   1114035360.0
  ], 
  [
   109935, 
   null, 
   "gnojek", 
   "But they do. I've seen it time and again. The problem is that you do give them credit and allow them to believe that their idiocy is legitimate. They will tell you that the amount of dust on the moon disproves evolution. The shrinking sun disproves evolution. All kinds of idiocy, and you legitimize it by respecting it. Good going.\n\n Fine, I only brought it up just in case people weren't aware of the fact that it makes it look like they are avoiding the question when they say \"that's not evolution.\" They may not be at all, but that's the way it looks to the creationist on the other end. \"Ha, he's just avoiding the question because he doesn't know how life began but I do.\" By showing their mistakes no respect, it does damage to the argument in their eyes. By showing it some respect at first (or at least playing along for a while) it may lend them some legitimacy, (I doubt that they are looking for reassurance from the person they are arguing with) but well into the debate they start to realize their mistakes. \n \n But what am I talking about? \n I'm treating them as rational people when they are anything but.\n {shrug-whatever}", 
   {}, 
   109467, 
   null, 
   1114035900.0
  ], 
  [
   109985, 
   null, 
   "pandion", 
   "Fine, I only brought it up just in case people weren't aware of the fact that it makes it look like they are avoiding the question when they say \"that's not evolution.\" They may not be at all, but that's the way it looks to the creationist on the other end. \"Ha, he's just avoiding the question because he doesn't know how life began but I do.\"\n\n But I don't avoid the question. I'm pretty sure that I'm a bit more scientifically literate than your run of the mill creationist. As a result I can intelligently discuss cosmology, nuclear physics, geology, as well as evolutionary biology. I know why the shrinking sun and the moon dust arguments are horsepucky. I know about quasars, novas, super novas, and black holes. I know about subduction, and tectonics.\n \nBy showing their mistakes no respect, it does damage to the argument in their eyes.\n\n Not at all. I show their arguments to be born of scientific illiteracy and then tell them why. I show them no respect and show whey they aren't worthy of respect.\n \nBy showing it some respect at first (or at least playing along for a while) it may lend them some legitimacy, (I doubt that they are looking for reassurance from the person they are arguing with) but well into the debate they start to realize their mistakes.\n\n But if they don't have the integrity to learn what they are arguing against in the first place, then they deserve no respect. By pointing out that they are dupes and parrots, and then showing them why, they realize their mistakes up front or never at all. I just don't see the point in humoring them by pretending that they are saying something intelligent.\n \nBut what am I talking about? \n I'm treating them as rational people when they are anything but.\n\n They're crazy as bed bugs.", 
   {}, 
   109935, 
   null, 
   1114042200.0
  ], 
  [
   110194, 
   null, 
   "Kuato", 
   "I didn't start it. :)\n\n \n \n Um, yeah... but I had to stick my snout in somewhere..... :)", 
   {}, 
   109931, 
   null, 
   1114090200.0
  ], 
  [
   115557, 
   null, 
   "peddler8111", 
   "I think this is a bad analogy or something.\n And people usually say THE bible.\n If they said A book, or even A bible the meaning is different.\n \n \n Like I would say THE theory of evolution is something different from A theory of evolution. I could be talking about A theory of stellar evolution and I wouldn't be wrong.\n \n But BIBLE is not an english word, evolution is.\n But in english BIBLE means one particular book.\n \n But someone could say \"This is the fisherman's bible.\"\n And the next day say \"This is my bible.\" (referring to the fishing guide)\n Would you bitch them out for misuse of the term, even though they didn't misuse the term?\n \n \n Generally by whom?\n Generally, by creationists, evolution means what it says.\n Then they can qualify it by biological if they want to.\n \n Look we are just talking about common usage not absolute definitions.\n \n If someone uses a word correctly, I can't bitch at them for not using in the common way.\n\n I am always amused listening to evolutionist using the meaning of the word that fits their argument when they have little clue what they are talking about. For instance you argue that evolution is an english word and bible is not. You argue that bible has to mean the Christian Bible. Has it ever occured \n to you that everything you know is wrong?\n For instance bible comes from middle english and means book. The Fishermans Bible is proper english and not offensive.\n When you think you are superior it is usually a delusion. \n You seem just the opposite when you brag about your intellect and everything you say is wrong.\n \n The sacred book of Christianity, a collection of ancient writings including the books of both the Old Testament and the New Testament. \n The Hebrew Scriptures, the sacred book of Judaism. \n A particular copy of a Bible: the old family Bible. \n A book or collection of writings constituting the sacred text of a religion. \n often bible A book considered authoritative in its field: the bible of French cooking. \n \n \n The sacred book of Christianity, a collection of ancient writings including the books of both the Old Testament and the New Testament. \n The Hebrew Scriptures, the sacred book of Judaism. \n A particular copy of a Bible: the old family Bible. \n A book or collection of writings constituting the sacred text of a religion. \n often bible A book considered authoritative in its field: the bible of French cooking. \n \n \n --------------------------------------------------------------------------------\n [Middle English, from Old French, from Late Latin biblia, from Greek, pl. of biblion, book diminutive of biblos, papyrus, book, from Bublos Byblos.]", 
   {}, 
   109432, 
   null, 
   1115082180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  An evolution stink", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4644-evolution-stink.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 4644, 
  "discussion_files": [
   [
    "8414.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4644-evolution-stink-print.html"
   ], 
   [
    "8415.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4644-evolution-stink-5-print.html"
   ], 
   [
    "8416.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4644-evolution-stink-4-print.html"
   ], 
   [
    "8417.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4644-evolution-stink-3-print.html"
   ], 
   [
    "8418.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4644-evolution-stink-2-print.html"
   ]
  ], 
  "identifier": 4644
 }
]