[
 [
  [
   101290, 
   null, 
   "Yaacova", 
   "Well? Is it?", 
   {
    "post_info": {
     "post_title": "believing in Jesus idolatry?"
    }
   }, 
   null, 
   null, 
   1111772220.0
  ], 
  [
   101308, 
   null, 
   "billsco", 
   "Doesn't idolatry require a physical object which one worships? Simply believing in Jesus--whatever that means--doesn't seem to fit the description.", 
   {}, 
   101290, 
   null, 
   1111773720.0
  ], 
  [
   101323, 
   null, 
   "johnhanks", 
   "Well? Is it?\n\n \n Doesn't every crucufix in the world break the Second Commandment?", 
   {}, 
   101290, 
   null, 
   1111775040.0
  ], 
  [
   101327, 
   null, 
   "Alan Ryan", 
   "Catholics have often been accused of idolatry because they appear to \"pray\" to statues or images of the saints, the Virgin Mary, etc. They deny this of course - since it's a breach of the First Commandment - and maintain that sacred representations or religious art are useful aids in achieving a kind of spiritual focus. \n Perhaps \"idols\" still have some power to arouse religious passions among unsophisticated Catholics (and others) in peasant societies ? Even on this basis of rather primitive religious enthusiasm, it seems unlikely that the idols are actually worshipped.", 
   {}, 
   101308, 
   null, 
   1111775580.0
  ], 
  [
   101328, 
   null, 
   "HeavenBound", 
   "Doesn't every crucufix in the world break the Second Commandment?\n\n \n No, they don't. We don't worship the cross, it's only a reminder what Christ did for us. emoticon_xangel", 
   {}, 
   101323, 
   null, 
   1111775580.0
  ], 
  [
   101331, 
   null, 
   "johnhanks", 
   "No, they don't. We don't worship the cross, it's only a reminder what Christ did for us. emoticon_xangel\n\n \n Hmmm. According to the KJV, Thou shalt not make unto thee any graven image...\n \n Nothing there about your only being forbidden to worship it.", 
   {}, 
   101328, 
   null, 
   1111775880.0
  ], 
  [
   101332, 
   null, 
   "HeavenBound", 
   "Hmmm. According to the KJV, Thou shalt not make unto thee any graven image...\n \n Nothing there about your only being forbidden to worship it.\n\n \n Any image of God or gods.", 
   {}, 
   101331, 
   null, 
   1111776120.0
  ], 
  [
   101336, 
   null, 
   "johnhanks", 
   "Perhaps \"idols\" still have some power to arouse religious passions among unsophisticated Catholics (and others) in peasant societies ? Even on this basis of rather primitive religious enthusiasm, it seems unlikely that the idols are actually worshipped.\n\n \n It's interesting in this context that the societies in which the proliferation of saints and their images was most prominent were indeed settled peasant societies - viz European Catholicism and the eastern Orthodoxies. I know it's unprovable speculation, but I suggest adoration of the BVM in such societies surely breached the austerities of strict, image-forbidding monotheism - itself the invention of desert nomads.", 
   {}, 
   101327, 
   null, 
   1111776600.0
  ], 
  [
   101337, 
   null, 
   "johnhanks", 
   "Any image of God or gods.\n\n \n I'm no authority on the trinity, but isn't an image of Jesus an image of god the son?\n \n (on edit) It goes on to add or any likeness of any thing that is in heaven above, or that is in the earth beneath, or that is in the water under the earth. That doesn't appear to restrict the proscription to images of gods.", 
   {}, 
   101332, 
   null, 
   1111776720.0
  ], 
  [
   101341, 
   null, 
   "Alan Ryan", 
   "It's interesting in this context that the societies in which the proliferation of saints and their images was most prominent were indeed settled peasant societies - viz European Catholicism and the eastern Orthodoxies. I know it's unprovable speculation, but I suggest adoration of the BVM in such societies surely breached the austerities of strict, image-forbidding monotheism - itself the invention of desert nomads.\n\n \n I think there's probably some elasticity in the Catholic concept of \"adoration\" when applied to the Virgin Mary - which as you correctly point out is at odds with strict monotheism. Probably, a devotion or reverence would be a preferred explanation for what appears to be the worship of Mary. \n \n To the \"unsophisticated\" however, this arcane point seems likely to have the appearance of a distinction without a difference.", 
   {}, 
   101336, 
   null, 
   1111777560.0
  ], 
  [
   101349, 
   null, 
   "johnhanks", 
   "I think there's probably some elasticity in the Catholic concept of \"adoration\" when applied to the Virgin Mary - which as you correctly point out is at odds with strict monotheism. Probably, a devotion or reverence would be a preferred explanation for what appears to be the worship of Mary. \n \n To the \"unsophisticated\" however, this arcane point seems likely to have the appearance of a distinction without a difference.\n\n \n You're right about the official 'preferred explanation', I'm sure. But I think you're also right in implying a gulf between de jure theology and de facto grass-roots practice. The following words are supposed to have been spoken by the BVM to Saint Juan Diego in 1531: \"Hark, my son the least, you must understand that I have many servants and messengers, to whom I must entrust the delivery of my message, and carry my wish, but it is of precise detail that you yourself solicit and assist and that through your mediation my wish be complied. I earnestly implore, my son the least, and with sternness I command that you again go tomorrow and see the bishop. You go in my name, and make known my wish in its entirety that he has to start the erection of a temple which I ask of him. And again tell him that I, in person, the ever-virgin Holy Mary, Mother of God, sent you.\"\n \n Emphases mine. It's hard to believe the (human) author of those words pictured Mary as a passive object of reverence without divine attributes of her own.", 
   {
    "unicode_changes_made": true
   }, 
   101341, 
   null, 
   1111779180.0
  ], 
  [
   101357, 
   null, 
   "Alan Ryan", 
   "\n Emphases mine. It's hard to believe the (human) author of those words pictured Mary as a passive object of reverence without divine attributes of her own.\n\n \n I agree - those words strongly imply divine attributes to Mary. However, I think Catholic theologians would argue most emphatically that though Mary was as \"perfect in every way\" as her son Jesus, this does not include sharing in his \"divinity\". (So she is not entitled to be worshipped).\n Even the doctrine of the Immaculate Conception makes no claim that Mary had a divine nature: the \"necessity\" of this notion together with the \"virgin birth\" is concerned with ensuring that Jesus had a mother untainted by original sin.", 
   {}, 
   101349, 
   null, 
   1111780260.0
  ], 
  [
   101359, 
   null, 
   "greg 79 f150", 
   "Catholics have often been accused of idolatry because they appear to \"pray\" to statues or images of the saints, the Virgin Mary, etc. They deny this of course - since it's a breach of the First Commandment - and maintain that sacred representations or religious art are useful aids in achieving a kind of spiritual focus. \n Perhaps \"idols\" still have some power to arouse religious passions among unsophisticated Catholics (and others) in peasant societies ? Even on this basis of rather primitive religious enthusiasm, it seems unlikely that the idols are actually worshipped.\n\n \n \n Good to hear from you again Alan,", 
   {}, 
   101327, 
   null, 
   1111780740.0
  ], 
  [
   101368, 
   null, 
   "HeavenBound", 
   "I'm no authority on the trinity, but isn't an image of Jesus an image of god the son?\n \n (on edit) It goes on to add or any likeness of any thing that is in heaven above, or that is in the earth beneath, or that is in the water under the earth. That doesn't appear to restrict the proscription to images of gods.\n\n \n So, who uses or worships the image of Jesus? You will usually only find such things in orthodox churches.", 
   {}, 
   101337, 
   null, 
   1111782840.0
  ], 
  [
   101427, 
   null, 
   "trebor", 
   "Well? Is it?\n\n \n Depends on who you talk to.\n \n To the Jewish faith, saying that God is a man made flesh, yes it is.", 
   {}, 
   101290, 
   null, 
   1111790580.0
  ], 
  [
   101428, 
   null, 
   "trebor", 
   "Any image of God or gods.\n\n \n It doesn't say 'image of god or gods'. it says graven image. A cross is a carved graven image. So was the 10 commandments monument in Alabama.", 
   {}, 
   101332, 
   null, 
   1111790640.0
  ], 
  [
   101444, 
   null, 
   "jim's trucking", 
   "http://www.christianity.com/partner/Article_Display_Page/1,,PTID1000|CHID74|CIID515852,00.html\n \n http://catholic.com/library/do_catholics_worship_statues.asp\n \n http://home.nyc.rr.com/mysticalrose/ex204.html", 
   {}, 
   101427, 
   null, 
   1111793760.0
  ], 
  [
   101472, 
   null, 
   "Yaacova", 
   "When I think of idolatry I think of bowing to a statue or picture. There are some cultures that say the believe in one God, but is that really true?", 
   {}, 
   101444, 
   null, 
   1111800540.0
  ], 
  [
   101490, 
   null, 
   "billsco", 
   "When I think of idolatry I think of bowing to a statue or picture. There are some cultures that say the believe in one God, but is that really true?\n\n \n It may be true but I don't know where. Here in America religionists believe in three gods, all one but three, and three all but one.", 
   {}, 
   101472, 
   null, 
   1111806840.0
  ], 
  [
   101560, 
   null, 
   "johnhanks", 
   "I agree - those words strongly imply divine attributes to Mary. However, I think Catholic theologians would argue most emphatically that though Mary was as \"perfect in every way\" as her son Jesus, this does not include sharing in his \"divinity\". (So she is not entitled to be worshipped).\n Even the doctrine of the Immaculate Conception makes no claim that Mary had a divine nature: the \"necessity\" of this notion together with the \"virgin birth\" is concerned with ensuring that Jesus had a mother untainted by original sin.\n\n \n This seems to me the crux of the matter: learned church doctrine is very clear on Mary's non-divinity; but what an illiterate peasant praying before an icon believed was, I suggest, often at odds with this. The official church line was essentially monotheistic, trinity or no trinity; but I suspect the spread of early catholic and orthodox christianity among the peasant societies of Europe and Russia was greatly eased by concessions (whether acknowledged or not) to the peasants' polytheisitic leanings, in the form of the BVM as a substitute mother-goddess and any number of 'patron saints' to replace the local household gods.\n \n It will be objected that neither the BVM nor the local patron saints were formally worshiped as gods; but they were (and are) prayed to to intercede on the supplicant's behalf, and my earlier post suggests that some societies at least (at grass roots level) pictured the BVM as having higher powers still.", 
   {}, 
   101357, 
   null, 
   1111833660.0
  ], 
  [
   101689, 
   null, 
   "Yaacova", 
   "What you're saying is you might pray to Jesus or Mary so they will tell God?", 
   {}, 
   101560, 
   null, 
   1111870860.0
  ], 
  [
   101699, 
   null, 
   "Alan Ryan", 
   "This seems to me the crux of the matter: learned church doctrine is very clear on Mary's non-divinity; but what an illiterate peasant praying before an icon believed was, I suggest, often at odds with this. The official church line was essentially monotheistic, trinity or no trinity; but I suspect the spread of early catholic and orthodox christianity among the peasant societies of Europe and Russia was greatly eased by concessions (whether acknowledged or not) to the peasants' polytheisitic leanings, in the form of the BVM as a substitute mother-goddess and any number of 'patron saints' to replace the local household gods.\n \n It will be objected that neither the BVM nor the local patron saints were formally worshiped as gods; but they were (and are) prayed to to intercede on the supplicant's behalf, and my earlier post suggests that some societies at least (at grass roots level) pictured the BVM as having higher powers still.\n \n Your observations on the theological compromises which have been made in order to render Catholic doctrine \"intelligible\" to uneducated or illiterate peoples are so pertinent that it would be impertinent of me to try and modify them in any way.", 
   {}, 
   101560, 
   null, 
   1111872960.0
  ], 
  [
   102894, 
   null, 
   "wilted_laughter", 
   "I went to the stations of the cross on good friday (to keep the peace in my house I didn't bother resisting) and was horrified afterwards when the priest starting talking about taking turns to venerate the cross by kissing this small wooden one he was holding with a gold jesus on it. I found the idea repulsive, it was very weird watching every else get up and do it (with the priest mechanically wiping the thing with a cloth after each kiss). Religion weirds me out sometimes.", 
   {}, 
   101699, 
   null, 
   1112222520.0
  ], 
  [
   102907, 
   null, 
   "gnojek", 
   "I went to the stations of the cross on good friday (to keep the peace in my house I didn't bother resisting) and was horrified afterwards when the priest starting talking about taking turns to venerate the cross by kissing this small wooden one he was holding with a gold jesus on it. I found the idea repulsive, it was very weird watching every else get up and do it (with the priest mechanically wiping the thing with a cloth after each kiss). Religion weirds me out sometimes.\n\n I remember doing that as a kid. \n I thought everyone was going up and tasting something on the wooden cross, so I got a tongueful of varnish! \n \n Anyway, just putting symbols, pictures, and statues up on the walls isn't idolatry. It's only idolatry if you look to the actual piece of wood or metal as a god. Even kissing the feet of the statue has nothing really to do with the statue itself, but it just symbolizes your devotion to Jesus.\n \n But the commandment says: You shall not make for yourself an idol in the form of anything in heaven above or on the earth beneath or in the waters below. 5 You shall not bow down to them or worship them; for I, the LORD your God, am a jealous God, punishing the children for the sin of the fathers to the third and fourth generation of those who hate me, 6 but showing love to a thousand {generations} of those who love me and keep my commandments.\n \n It says you shouldn't MAKE idols at all. \n But then is it an idol if you don't worship it?", 
   {}, 
   102894, 
   null, 
   1112223840.0
  ], 
  [
   102946, 
   null, 
   "epaphras_faith", 
   "Idolatry as described in both the new and old testament has less to do with making an image but worshipping anything that is not God. Remember that the first commandment is Thou shalt have no other gods before me. It means placing God as number one in your life is the number one commandment. It is why Israel was destroyed by Babylon during the time of Jeremiah. It is because they turned away from God and began to worship other things. \n \n It is as much a sin to place the Phoenix Suns as the most important thing in your life as it is to make a statue of Napolean and worship that. \n \n Remember Jesus said \"all the law and the prophets is summed up in this: Love the Lord your God with all your heart, with all your mind, with all your strength, with all your soul, and love your neighbor as yourself.\" Beyond that, ALL is idolatry.\n \n EF", 
   {}, 
   102907, 
   null, 
   1112231220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  believing in Jesus idolatry?", 
  "url": "http://www.4forums.com/political/religion-debates/4648-believing-jesus-idolatry.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4648, 
  "discussion_files": [
   [
    "16191.html", 
    "http://www.4forums.com/political/religion-debates/4648-believing-jesus-idolatry-print.html"
   ], 
   [
    "16192.html", 
    "http://www.4forums.com/political/religion-debates/4648-believing-jesus-idolatry-2-print.html"
   ]
  ], 
  "identifier": 4648
 }
]