[
 [
  [
   101907, 
   null, 
   "greg 79 f150", 
   "I get up fairly early every morning, so as I channel surf looking for a good show, I find the TV is full of infomercials peddling their wares . I also find that , what most of them are selling is a \"Cure ALL \" for obesity, usually in the form of a miracle fat burning drug , a PROVEN new scientific diet, or a MIRACULOUS fat burning machine for only $ 199.00 a month for eternity....\n \n \n As a 52 year old over weight person now, I am working on getting 20 extra pounds off of my torso. As I watch these commercials and emphasize with my heavy duty brethen , it brought the world of over weightness to the forefront for me. I found out I needed to lose weight, NOT because my wife started affectionally calling me OINK, it was when I could NOT get my pants buttoned up any longer. I gave myself a good talking to, and made a commitment to myself, to NOT increase the size of my clothing to accomodate the twinkies, pizza and snacks in between snacks. I have lost 9 pounds since 3/17/05 but am finding it EXTREMELY hard, and I am now aknowledging the FACT that , weight goes on quietly and without any noise, other than a taco burp now and again :) ...\n \n \n So, here is the revelation people. I usually offer up this information at a low , ONE TIME only cost of 19.95, with a second revelation on getting rid of those extra fat cells, being offered FREE, to those that will purchase my first revelation via master charge or visa card, within the next 30 minutes. :) Here it is, ...\n \n \n When people age/mature, by the age of say, 22, they have hit the weight/body mass that is comfortable for their frame. If one is comfortable with that look, weight, they purchase clothes to fit them. Now the revelation folks is,  If at ANY point later in their life , they find the NEED to upsize their clothes to keep them comfortable,  its time to DECREASE calorie intake, and get more excercise, thus ultimately eliminating the need for the TV people to make millions off of a suffering society , people like me, that are carrying too much weight around. ...\n \n Now, we have that group of obese people that will say, \" I was fat since I was 6 years old, I have never been able to get in my correct frame/weight category \". True statement for fact, but BEFORE everyone burns me at the stake here, it has been my understanding that fat babies CAN be that way because : The parents gorge the baby to keep them from crying, OR, the obese mother had a baby born with an abnormal amount of fat cells, OR the obese parents are constantly eating, and the child picks up the lifestyle. Of course, thyroid , diabetes, or any other glandular problems are not applicable here ...\n \n I may err in my opinion here, if so I apologize, but afterall its just my opinion. If it is NOT true about how babies become obese, then my conclusion on obese children MAY be a good topic on another thread for all of us to learn from. If any one that is reading this, does NOT think obesity is a problem in our society today, that person needs to stop walking with their head down, . ..\n \n SO, with my starting thread topic being stretch pants, we now see why they are indeed, people's worst fashion statement, for their own well being. all jmo", 
   {
    "post_info": {
     "post_title": "The scourge of sweat pants"
    }
   }, 
   null, 
   null, 
   1111948620.0
  ], 
  [
   101921, 
   null, 
   "billsco", 
   "You're losing almost a pound a day. Too fast!", 
   {}, 
   101907, 
   null, 
   1111950960.0
  ], 
  [
   101933, 
   null, 
   "greg 79 f150", 
   "You're losing almost a pound a day. Too fast!\n\n \n \n \n How come ? I feel o.k., just have a hunger feeling in my stomach most of the time, which needs to shrink a lot anyway\n \n Starting back at 3/17, I changed my eating habits to one bowl of cheerios w/slice banana and milk for breakfast. One Wendy's Jr. bacon Wendy's cheeseburger with medium pepsi for lunch. One dish of cottage cheese with peaches and crackers for dinner. One bowl of popcorn and a glass of sweet tea at 8 pm while watching tv some nights. No excercise other than my job (walk a lot) , and typing on forums :) \n \n No candy , no sweets, no in between snacks.", 
   {}, 
   101921, 
   null, 
   1111952340.0
  ], 
  [
   101940, 
   null, 
   "Dono", 
   "I believe that the healthy way to lose weight is the same way you put it on, slowly. Most Americans eat too much of the wrong things and exercise too little. Every January my gym is full of people we call the \"New Years Resolution Crowd\" and by mid February they are gone. Fitness is a life style that pays huge dividends, but it requires some steady investment.\n Dono", 
   {}, 
   101933, 
   null, 
   1111953480.0
  ], 
  [
   101952, 
   null, 
   "Alan Ryan", 
   "One sure fire way of losing weight quickly, Greg, is to take a vacation in somewhere like.....I'd better not mention the actual place except to say it's in the Middle East.....and come home with a belly full of strange germs. The fat rolls off in just no time at all.\n \n I once lost 20 pounds in a month after cruising down a certain river over there. (No sweatpants necessary). \n \n I forgot to mention: you have to put up with a drip feed to achieve this result.", 
   {}, 
   101940, 
   null, 
   1111955640.0
  ], 
  [
   101960, 
   null, 
   "jitobear", 
   "There is no magic trick, pill, gimmick or diet that will work. I have lost about 45 pounds in the past year or so. It's slow going - but it is going - and none of it comes back on. I added more and more exersize and tried not to eat like an idiot (balanced diet and reasonable portion sizes). Although I have more weight to lose, I am healthier, stronger, happier and more energetic for my efforts.\n \n I am also a strong believer in not hiding or being frumpy just because you are heavy. I will put on a low-cut shirt and go out and flirt with boys, regardless of my size. And they resopond. (And oh how the 20-something Barbies hate it. he he he) I see more heavy people in stretchy pants, not doing anything and not caring. I used to be like that - but one day I woke up - and HURRAH!\n \n If you don't believe you are worth NOW - no plan will work.", 
   {}, 
   101952, 
   null, 
   1111956960.0
  ], 
  [
   101974, 
   null, 
   "jim's trucking", 
   "You want to know how to lose weight...just ask me, I've lost thousands over pounds since I reached puberty!\n \n On a less serious note, the best way to lose weight is to diet and exercise, drink a gallon or two of water a day and stay out of the donut shops.\n \n Your diet can include just about anything you want to eat except shovels of sugar or salt. Fruits and vegetables work better than fatty foods. Small portions of food accompanied by large chugs of water will satisfy your stomach's need to be stretched. Transcendental meditation will keep your mind off of food.", 
   {}, 
   101960, 
   null, 
   1111961220.0
  ], 
  [
   101988, 
   null, 
   "georged", 
   "I spent last October through December mostly living in hotels and eating in decadent restaurants devoted to gluttony. 30 new pounds, mostly in my gut and face. \n \n On 1-15 I started a new diet recommended by my doctor (my first ever diet). Instead of the 2800 calories suitable for my frame and mass, she recommended 1800 calories, three meals daily, eliminating only fried foods and sugar while reducing bread/dairy products to a minimum. That plus my usual three days (two-hours every-other day) at the health club. By 3-20, I was back to my normal weight, often even using 270 of those daily calories for beer. If one doesn't want to see a doctor, spending a little time on the Internet will quickly provide a healthy, well-balanced diet with all the calories one needs for frame and mass. Just reduce the calories by approximately 30%.\n \n The fad diets, as any MD or health club dietitian can tell you, are, for most people, a sure method of repeated failure. They deprive the body of certain chemicals during the weight loss period. When the diet is abandoned the body has a new mission, replacing those chemicals and adding more in the form of fatty tissue in case that trick is repeated. The Atkins Diet is probably the most well known for removing 20 lbs and replacing it with 30 as many times as one wants to repeat it. \n \n Incidentally, exercise alone doesn't shed weight, it only changes fat tissue to muscle tissue.", 
   {}, 
   101960, 
   null, 
   1111962840.0
  ], 
  [
   102006, 
   null, 
   "jitobear", 
   "\n \n Incidentally, exercise alone doesn't shed weight, it only changes fat tissue to muscle tissue.\n\n \n Yes I know. But it does make you smaller. There are times where the scale shows little difference, but my pants are falling off! (woo hoo)", 
   {}, 
   101988, 
   null, 
   1111964400.0
  ], 
  [
   102036, 
   null, 
   "greg 79 f150", 
   "Yes I know. But it does make you smaller. There are times where the scale shows little difference, but my pants are falling off! (woo hoo)\n\n \n And NO, Billsco, you cant have a pic of that, :) :)", 
   {}, 
   102006, 
   null, 
   1111968120.0
  ], 
  [
   102040, 
   null, 
   "Steeeeve", 
   "someone stay outta the donut shop....I would like to know how this is possible when Krispy Kreme is soooo freakin good!", 
   {}, 
   102036, 
   null, 
   1111969800.0
  ], 
  [
   102120, 
   null, 
   "zachvac", 
   "People today are just plain lazy. Have you seen comercials for pills and stuff to lose weight, diets, and other plans. \"No exercise! No diets!\" they claim. People spend millions on weight loss programs when the one that has been proven time and time again to work is FREE. Don't eat a lot of fatty foods (don't eat fast food often at all) and excercise. People are just to lazy to excercise and diet which is why so many make that resolution yet almost none stick to it. In high school, we are required 1 year of PE. 1.5 hours every other day. For many people that's all the excercise they get. They even groan about having to take a year of it. For me, that's the fun part of the day and plan on taking 3 years of it (couldn't fit it in my schedule this year). I play on the baseball team and play basketball with some friends at lunch. It really isn't that hard to lose weight if people really want to do it, but too many people are just too damn lazy.", 
   {}, 
   102040, 
   null, 
   1111985820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The scourge of sweat pants", 
  "url": "http://www.4forums.com/political/fun-debates/4661-scourge-sweat-pants.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 4661, 
  "discussion_files": [
   [
    "5211.html", 
    "http://www.4forums.com/political/fun-debates/4661-scourge-sweat-pants-print.html"
   ]
  ], 
  "identifier": 4661
 }
]