[
 [
  [
   102639, 
   null, 
   "Ladywolf", 
   "A few weeks ago, I was \"damned to hell in a firey lake\" by a couple of Baptist people. I am Jewish and feel that the way they spoke to me was very rude and disrespectful (from one human to another).\n \n These people came to my door and trying to get me to convert from Judiaism to Christianity. I had to close the door because they asked me very personal questions that I would never dare to ask a stranger.\n \n I have a deep felt faith regarding my rich, Jewish heritage and for them to verbally assalt it was like throwing poison in my face. My faith remains unharmed and intact, but my faith in the humanity of Christians (not all) has faltered. I'm meeting with my rabbi this Friday to discuss it, but I still have not healed from the encounter. It seems this is one situation that requires time to heal.\n \n My debate question is...\n \n how do you respectfully handle missionaries like this without exploding at them or getting upset with them for weeks on end?", 
   {
    "post_info": {
     "post_title": "I've Been Damned to Hell for Not Believing Jesus is God"
    }
   }, 
   null, 
   null, 
   1112144760.0
  ], 
  [
   102646, 
   null, 
   "trebor", 
   "A few weeks ago, I was \"damned to hell in a firey lake\" by a couple of Baptist people. I am Jewish and feel that the way they spoke to me was very rude and disrespectful (from one human to another).\n \n These people came to my door and trying to get me to convert from Judiaism to Christianity. I had to close the door because they asked me very personal questions that I would never dare to ask a stranger.\n \n I have a deep felt faith regarding my rich, Jewish heritage and for them to verbally assalt it was like throwing poison in my face. My faith remains unharmed and intact, but my faith in the humanity of Christians (not all) has faltered. I'm meeting with my rabbi this Friday to discuss it, but I still have not healed from the encounter. It seems this is one situation that requires time to heal.\n \n My debate question is...\n \n how do you respectfully handle missionaries like this without exploding at them or getting upset with them for weeks on end?\n\n \n You tell them 'no thank you, I am not interested', and close the door as soon as you realise they are missionaries.\n \n I had as a weekly occurance some Jehovah witnesses coming to my door at 10 am when I worked 3rd shift. They finally stopped when I answered the door in my underwear.\n \n I heard of a wiccian lady who had some mormons come and 'witness' to her, and she answered the door 'skyclad', and invited them in to discuss their various theologies. The younger man was MOST interested, but got dragged away by the older gent.", 
   {}, 
   102639, 
   null, 
   1112147760.0
  ], 
  [
   102650, 
   null, 
   "GuyWithNoBrain", 
   "\n I heard of a wiccian lady who had some mormons come and 'witness' to her, and she answered the door 'skyclad', and invited them in to discuss their various theologies. The younger man was MOST interested, but got dragged away by the older gent.\n\n \n lol :) \n I also had experiences with this. but instead of going to my house and preaching me christianity, they went directly to my temple and tried to convert the monks living there. they tried several times to convert them but somehow they walked out learning more about Buddhism. i dont know how that happen. emoticon_frazzled \n if a missionary comes to ur house and tells u to go to hell for not believing in whatever their preaching simply smile, and close the door. i myself would laugh at the missionary.", 
   {}, 
   102646, 
   null, 
   1112149020.0
  ], 
  [
   102651, 
   null, 
   "Duo_Maxwell", 
   "Easy. When they come to your door, do every single sacriligious action within reason possible. Usually they will run away from your door and you don't have to even talk to them. Something like when mormons come to the door, offer them salted bread. :p \n \n You also have to realize that most missionaries, if not all, are egolistical believers who cannot possibly fathom that perhaps their own faith is incorrect. There's a way to deal with fanatics, and it involves hitting them over the head with a large frying pan.", 
   {}, 
   102646, 
   null, 
   1112149080.0
  ], 
  [
   102656, 
   null, 
   "joebrummer", 
   "A few weeks ago, I was \"damned to hell in a firey lake\" by a couple of Baptist people. I am Jewish and feel that the way they spoke to me was very rude and disrespectful (from one human to another).\n \n These people came to my door and trying to get me to convert from Judiaism to Christianity. I had to close the door because they asked me very personal questions that I would never dare to ask a stranger.\n \n I have a deep felt faith regarding my rich, Jewish heritage and for them to verbally assalt it was like throwing poison in my face. My faith remains unharmed and intact, but my faith in the humanity of Christians (not all) has faltered. I'm meeting with my rabbi this Friday to discuss it, but I still have not healed from the encounter. It seems this is one situation that requires time to heal.\n \n My debate question is...\n \n how do you respectfully handle missionaries like this without exploding at them or getting upset with them for weeks on end?\n\n \n \n \n Ask yourself as they explode...\"what of this explosion of emotion do I own?\"\n \n When you realize the answer is nothing, you go on with the rest of your day.\n \n I always ask myslef when someone is at odds with me....how much of this do I own? Did I contribute to their fiery emotion or is it theirs? I am only capable (and you too) of controling my own feelsings. If others are upset with me, or think I am going to hell. It is there issues at stake, their emotions..their beliefs...not mine. Cloisse the door with a casual..\"I am sorry you feel that way, but I don't own these feelings. I have my own\"\n \n then smile! being true to yourwelf and your beliefs and the fact you didn't push your beliefs on anyone else, because you only \"own\" your beliefs, feelings, emotions and reality.", 
   {}, 
   102639, 
   null, 
   1112150340.0
  ], 
  [
   102663, 
   null, 
   "trs", 
   "My debate question is ... how do you respectfully handle missionaries like this without exploding at them or getting upset with them for weeks on end?\nHandle people with the respect they deserve.", 
   {}, 
   102639, 
   null, 
   1112151240.0
  ], 
  [
   102664, 
   null, 
   "joebrummer", 
   "Handle people with the respect they deserve.\n\n \n \n or possibly they don't deserve.", 
   {}, 
   102663, 
   null, 
   1112151300.0
  ], 
  [
   102671, 
   null, 
   "Duo_Maxwell", 
   "Handle people with the respect they deserve.\n\n \n I'll remember that. :Devil Grin:", 
   {}, 
   102663, 
   null, 
   1112152200.0
  ], 
  [
   102674, 
   null, 
   "trs", 
   "I'll remember that. :Devil Grin:\nI seriously doubt it. Furthermore, remembering it is of little worth when you lack the maturity to implement it.", 
   {}, 
   102671, 
   null, 
   1112152440.0
  ], 
  [
   102676, 
   null, 
   "Duo_Maxwell", 
   "I seriously doubt it. Furthermore, remembering it is of little worth when you lack the maturity to implement it.\n\n \n Again, your arrogance is astounding. For one who criticizes others for percieved immaturity, you seem to have no qualms about acting immature yourself. Hypocritical isn't it?", 
   {}, 
   102674, 
   null, 
   1112152980.0
  ], 
  [
   102680, 
   null, 
   "joebrummer", 
   "I seriously doubt it. Furthermore, remembering it is of little worth when you lack the maturity to implement it.\n\n Trs,\n Have you ot noticed that respect is earned, it is not given on a whim. If I don't know them I will treat them with some respect, butnot when they are pushing something on me I am not willing to change my beliefs to hear. Respect is earned.\n \n Duo has a reputation on this board that has been very respectful of others beliefs, yet you have dissded that without really knowing his historyof teaction to others on the board. I would say it is you that should grow up.", 
   {}, 
   102674, 
   null, 
   1112154240.0
  ], 
  [
   102683, 
   null, 
   "Duo_Maxwell", 
   "*showers joe with dethorned roses*\n \n Seriously, Trs, I have a good feeling that you're just doing that for kicks and giggles. I really don't have a problem if that is the case, but if it's not, then, well we have a problem don't we?", 
   {}, 
   102680, 
   null, 
   1112154480.0
  ], 
  [
   102759, 
   null, 
   "wilted_laughter", 
   "\n how do you respectfully handle missionaries like this without exploding at them or getting upset with them for weeks on end?\n\n \n Engage in a friendly theological debate in which you rip their religion to shreds. Ask them challenging questions which expose the flaws in their religion. It's great fun, and doesn't have to be nasty as long as you are polite and smile.", 
   {}, 
   102639, 
   null, 
   1112196720.0
  ], 
  [
   102764, 
   null, 
   "Alan Ryan", 
   "Last summer a couple of Mormon guys from Salt Lake City came to my house and tried to interest me in a bizarre plan for my baptism - posthumously if necessary.\n \n I invited them into the garden and gave them some lemonade and said that things have come to a pretty pass when religion is allowed to invade the sphere of private life (and more to similar ridiculous effect). \n \n Unfortunately, the two young men who were amiable and polite, had no sense of humour whatever and were desperate to seek out other \"clients\" before 10 minutes had passed.\n \n I concluded that \"jokes\" are the best defence against those who knock at your door and want to convert you on the spot.", 
   {}, 
   102759, 
   null, 
   1112198160.0
  ], 
  [
   102772, 
   null, 
   "georged", 
   "A few weeks ago, I was \"damned to hell in a firey lake\" by a couple of Baptist people. I am Jewish and feel that the way they spoke to me was very rude and disrespectful (from one human to another).\n \n These people came to my door and trying to get me to convert from Judiaism to Christianity. I had to close the door because they asked me very personal questions that I would never dare to ask a stranger.\n \n I have a deep felt faith regarding my rich, Jewish heritage and for them to verbally assalt it was like throwing poison in my face. My faith remains unharmed and intact, but my faith in the humanity of Christians (not all) has faltered. I'm meeting with my rabbi this Friday to discuss it, but I still have not healed from the encounter. It seems this is one situation that requires time to heal.\n \n My debate question is...\n \n how do you respectfully handle missionaries like this without exploding at them or getting upset with them for weeks on end?\n\n \n Consider the source. There are two ways to deal with fanatics, force or humor. While humor often allows their mission to be briefly detoured, they'll return. Force, with civility, is a 'no solicitors' sign on your front door. Even if they have a permit, most don't, ignoring the notice makes them a public nuisance. If you must answer your door to strangers, do it with a telephone in your hand and when they start their pitch tell them you're calling the police for harrassment.", 
   {}, 
   102639, 
   null, 
   1112200860.0
  ], 
  [
   102825, 
   null, 
   "wilted_laughter", 
   "Ha ha ha, I just remembered one time when a couple of Jehovahs witnesses knocked on our door and they asked me if either of my parents were home. I said they weren't with the hope that they would go away (my Mum was on the phone) and a few moments later my Mum walked into the hall to see who was at the door. I was felt pretty shameful at the time, but looking back it was pure comedy.", 
   {}, 
   102772, 
   null, 
   1112211180.0
  ], 
  [
   102834, 
   null, 
   "jitobear", 
   "It's kind of funny hear the other side. One of my best friends is a Witness. One would not guess it - in his jeans, his sassy humor and his passion for rock and roll and his guitar - but he is pretty devout. They know they are not generally welcomed - and he has some pretty hysterical stories about how he has been turned away.", 
   {}, 
   102825, 
   null, 
   1112212980.0
  ], 
  [
   102838, 
   null, 
   "lord tammerlain", 
   "Consider the source. There are two ways to deal with fanatics, force or humor. While humor often allows their mission to be briefly detoured, they'll return. Force, with civility, is a 'no solicitors' sign on your front door. Even if they have a permit, most don't, ignoring the notice makes them a public nuisance. If you must answer your door to strangers, do it with a telephone in your hand and when they start their pitch tell them you're calling the police for harrassment.\n\n \n \n Now here I thought that force would have involved a 12 gauge shotgun blowing a hole through the front door, you know to protect yourself from home invaders", 
   {}, 
   102772, 
   null, 
   1112213820.0
  ], 
  [
   102861, 
   null, 
   "debategirl88", 
   "\n \n My debate question is...\n \n how do you respectfully handle missionaries like this without exploding at them or getting upset with them for weeks on end?\n\n \n First, you must realize that they are (or we are since i also witness door to door) not doing it for our health or to pass the time away, we do it because we care about people. We do not have a rule saying that we must witness like some other religions. Then if you are not interested just say no thanks, and please politely shut the door. :)", 
   {}, 
   102639, 
   null, 
   1112218560.0
  ], 
  [
   102863, 
   null, 
   "epaphras_faith", 
   "First, you must realize that they are (or we are since i also witness door to door) not doing it for our health or to pass the time away, we do it because we care about people. We do not have a rule saying that we must witness like some other religions. Then if you are not interested just say no thanks, and please politely shut the door. :)\n\n \n Debategirl is quite correct. They do what they do (most anyways) because they care. While you may disagree with them, they still care. Try to remember that. Saying no thanks and politely shutting your door is perfectly acceptable behavior. If you want to engage in a debate with them, tell them up front that is what you want. If you are willing to hear them and then want them to leave, let them speak their piece (peace?) on the stoop and then say thank you and shut the door.\n \n You aren't forced to listen to them. They may be pushy, but it is your responsibility to act on your behalf, not theirs. You don't have to be a jerk because they are jerks. That is only a reflection on you. If you are kind and polite and they are jerks, it makes them look much much much worse.\n \n EF", 
   {}, 
   102861, 
   null, 
   1112218800.0
  ], 
  [
   102990, 
   null, 
   "Orion", 
   "Debategirl is quite correct. They do what they do (most anyways) because they care. EF\n\n \n The question is, what is it that they care about? I get the impression that, most often, they care about their own insecurities. There is a local Baptist church which, from time to time, will send me a flyer in the mail inviting me to their Sunday service. I can deal with that. But when someone comes to my door attempting to sell me their particular Jesus, I find it quite annoying. And it evidences to me a degree of arrogance on their part.", 
   {}, 
   102863, 
   null, 
   1112245620.0
  ], 
  [
   102997, 
   null, 
   "Kaill", 
   "If one's concept of reality includes an otherwise unavoidable eternity of pain and torture, for that person, proselytizing is the right thing to do, morally speaking.\n \n Jehovah's Witnesses are tiresome, but they certainly mean well (in fact, i think believers of damnation who do less to spread their message are morally inferior)\n \n Baptists actually have a handbook for converting Jewish people. That makes me feel sick, and I'm not sure they (or at least, some of them) are REALLY doing it to save people. They might just enjoy flaunting their perceived spiritual superiority. Same goes for the J.W.s, but to a lessor degree, I think.\n \n emoticon_idea emoticon_xchicken \n \n Walk into the light...", 
   {}, 
   102990, 
   null, 
   1112247000.0
  ], 
  [
   103005, 
   null, 
   "Orion", 
   "If one's concept of reality includes an otherwise unavoidable eternity of pain and torture, for that person, proselytizing is the right thing to do, morally speaking.\n\n \n You'll perhaps excuse me if I don't take seriously the hellfire & brimstone warnings delivered to me by some seventeen year old 'elder'. Were I to discern some crisis in my faith, it would certainly not result from a sudden fear of eternal damnation resulting from my denial of Jesus. Fear is not a very good motivator. Regardless, were such crisis to emerge, I'd attempt to think it through, perhaps consult a priest, minister, or rabbi, rather than taking seriously the sales pitch of some juvenile who comes to my door.", 
   {}, 
   102997, 
   null, 
   1112251200.0
  ], 
  [
   103014, 
   null, 
   "jitobear", 
   "I can't speak for all those who do door to door preaching - but Witnesses preach because they believe they are commanded to (the Bible does say to spread the good news) - They do door to door, business, phone calling - and they do so, because believe it or not - they do have success with it.", 
   {}, 
   103005, 
   null, 
   1112255940.0
  ], 
  [
   103016, 
   null, 
   "Mach", 
   "They finally stopped when I answered the door in my underwear.\n .\n\n \n Caution: I suspect that's a good tip, on average, for males only. No offense Joe ;)", 
   {}, 
   102646, 
   null, 
   1112257080.0
  ], 
  [
   103017, 
   null, 
   "Mach", 
   "\n how do you respectfully handle missionaries like this without exploding at them or getting upset with them for weeks on end?\n\n \n Remember, they chose to interrupt your private life for their own desires/needs. It's your choice to allow them to take your time, or not. \"I'm not interested\" *close door* is entirely polite. Likewise with phone solicitation. Thank you, not interested, goodbye (even though they are still jabbering). (EP said a similar thing)\n \n As to dwelling on negative events for weeks on end, try mental conditioning. It's easier than it sounds. Just remember your mind is your body, it can be easily trained, actually it's designed to be trained. Force yourself to not think of what it is that's bugging you. And again, and again. Continue to push it from your thoughts (what you think about in it's place is irrelevant, it can be anything/nothing, doesn't have to be \"happy thoughts\", that's unecessary).\n \n Once you do this for a while, you'll find it's second-nature, a habit, to be able to re-focus your mind off a particular topic. And no, you won't \"forget\" it, it just won't occupy your mind as much. \n \n -Mach", 
   {}, 
   102639, 
   null, 
   1112257620.0
  ], 
  [
   103027, 
   null, 
   "pandion", 
   "Here's some suggestions on how to handle \"missionaries.\"\n \n If you get a phone call from a \"christian\" proselytizer (or any other annoying sales call), as soon as you realize the nature of the call, tell them that you would like to hear what they have to say but that there is someone at the door. Put the phone down and go on about your business. Check on them in a few minutes. If they are so stupid as to still be there, tell them to hang on, you're still dealing with the delivery. Put the phone down again. Repeat as necessary.\n \n When they come to your door, smile and tell them, \"No thank you. I'm a Christian.\" Slowly close the door and then throw the bolt with as much force as possible. I say to \"slowly close the door\" so that you might have the pleasure of observing their fish out of water expressions. Also, it they have heard the answer before, you are more likely to see them flip the rod and can throw open the door and get in their face - I'm better than 230 lbs at 6'5\" and it works for me.\n \n Another possibility is to invite them in and seat at the kitchen table and then offer them a cup of coffee. When they decline, berate their unwillingness to have a friendly cup of coffee with you and tell them to get out. Be sure that they are from a cult that doesn't drink coffee. A friend of mine did this with missionaries from one cult. They headed for the door when he started his hissy fit.\n \n Just some ideas.\n \n Edit: By the way, Ladywolf. It is totally irrelevant whether you are or are not a christian. The point is that you respond to the annoying dweebs that you are and shut the door (and throw the bolt). It adds to a bad day for the dweebs. Don't get mad - get even.", 
   {}, 
   103017, 
   null, 
   1112261520.0
  ], 
  [
   103044, 
   null, 
   "Easyrider", 
   "Sure, go ahead and ignore them....\n \n \"He who denies me before men, him will I deny before the Father.\" Jesus Christ \n \n Just remember the price you will eventually pay for that if you continue to reject Christ's salvation.", 
   {}, 
   103027, 
   null, 
   1112271660.0
  ], 
  [
   103047, 
   null, 
   "greg 79 f150", 
   "Here's some suggestions on how to handle \"missionaries.\"\n \n If you get a phone call from a \"christian\" proselytizer (or any other annoying sales call), as soon as you realize the nature of the call, tell them that you would like to hear what they have to say but that there is someone at the door. Put the phone down and go on about your business. Check on them in a few minutes. If they are so stupid as to still be there, tell them to hang on, you're still dealing with the delivery. Put the phone down again. Repeat as necessary.\n \n When they come to your door, smile and tell them, \"No thank you. I'm a Christian.\" Slowly close the door and then throw the bolt with as much force as possible. I say to \"slowly close the door\" so that you might have the pleasure of observing their fish out of water expressions. Also, it they have heard the answer before, you are more likely to see them flip the rod and can throw open the door and get in their face - I'm better than 230 lbs at 6'5\" and it works for me.\n \n Another possibility is to invite them in and seat at the kitchen table and then offer them a cup of coffee. When they decline, berate their unwillingness to have a friendly cup of coffee with you and tell them to get out. Be sure that they are from a cult that doesn't drink coffee. A friend of mine did this with missionaries from one cult. They headed for the door when he started his hissy fit.\n \n Just some ideas.\n \n Edit: By the way, Ladywolf. It is totally irrelevant whether you are or are not a christian. The point is that you respond to the annoying dweebs that you are and shut the door (and throw the bolt). It adds to a bad day for the dweebs. Don't get mad - get even.\n\n \n \n Good one. I would nix the \"in home\" invitation though. There are criminally minded people thinking of ways everyday, to get in to our homes, especially women alone in them. Being paranoid ?, maybe , but ask those survivors of home assaults, they will tell you they NEVER thought it could HAPPEN to THEM. I dont think mean people would care about whether portaying themselves as a JW , to get in to your home , would be morally wrong . Be mentally armed first , to protect yourself. jmo", 
   {}, 
   103027, 
   null, 
   1112274480.0
  ], 
  [
   103062, 
   null, 
   "trebor", 
   "If one's concept of reality includes an otherwise unavoidable eternity of pain and torture, for that person, proselytizing is the right thing to do, morally speaking.\n \n Jehovah's Witnesses are tiresome, but they certainly mean well (in fact, i think believers of damnation who do less to spread their message are morally inferior)\n \n Baptists actually have a handbook for converting Jewish people. That makes me feel sick, and I'm not sure they (or at least, some of them) are REALLY doing it to save people. They might just enjoy flaunting their perceived spiritual superiority. Same goes for the J.W.s, but to a lessor degree, I think.\n \n emoticon_idea emoticon_xchicken \n \n Walk into the light...\n\n \n \n They have a handbook that deals with converting hindus, muslims and Roman Catholics too. And I have been told the varous Baptist sects in some towns go after other variations of Baptists..", 
   {}, 
   102997, 
   null, 
   1112280840.0
  ], 
  [
   103088, 
   null, 
   "Orion", 
   "Sure, go ahead and ignore them....\n \n \"He who denies me before men, him will I deny before the Father.\" Jesus Christ \n \n Just remember the price you will eventually pay for that if you continue to reject Christ's salvation.\n\n \n Your fear tactics fail, EZ. Rude arrogance, fueled by ignorance and stupidity, will be dealt with, whether you like it or not. \n \n He that loveth not knoweth not God; for God is love. -- 1 John 4:8\n \n My mercy embraces all things. -- Islam, Qu'ran 7:156\n \n The great compassionate heart is the essence of Buddhahood. -- Buddhism, Gandavyuha Sutra\n \n To love is to know Me, My innermost nature, the truth that I am. -- Hinduism, Bhagavad Gita 18:55", 
   {}, 
   103044, 
   null, 
   1112287200.0
  ], 
  [
   103094, 
   null, 
   "georged", 
   "Now here I thought that force would have involved a 12 gauge shotgun blowing a hole through the front door, you know to protect yourself from home invaders\n\n \n I'd first have to let them into my home, distasteful enough, to avoid prison and then my wife would be very upset with me for creating a mess in the entry way. We're building a new home where those circumstances won't apply. If they make it through the front gate, they'll already be classified as members of a home invasion sect.", 
   {}, 
   102838, 
   null, 
   1112288640.0
  ], 
  [
   103122, 
   null, 
   "Waxy", 
   "OK, kind of in poor taste, but it worked like a charm, and it's a true story -\n \n A guy I know (he's about 70 years old) was getting visits from the Jehovah's Witnesses far too regularly because his wife was too polite to send them on their way.\n \n So here's the Cole's notes version of his method -\n \n They knocked on the door one day when his wife wasn't home and he answered. Two young women at the door asked if they could come in and have a minute of his time. He said something to the effect of \"Sure, the wife's been gone a week and I'm horny as hell.\" They bolted out the door and he's never had another visit.\n \n It's a darn funny story when he goes through all the details, especially when you see the 70 year old man telling the story. :p (I know, I know, it's not PC, but what are you gonna do.)\n \n As to the topic of the thread, why lose sleep over it? A simple \"whatever\" would have been my answer.\n \n Waxy", 
   {}, 
   103094, 
   null, 
   1112293920.0
  ], 
  [
   103148, 
   null, 
   "epaphras_faith", 
   "The question is, what is it that they care about? I get the impression that, most often, they care about their own insecurities. There is a local Baptist church which, from time to time, will send me a flyer in the mail inviting me to their Sunday service. I can deal with that. But when someone comes to my door attempting to sell me their particular Jesus, I find it quite annoying. And it evidences to me a degree of arrogance on their part.\n\n \n Very well. Perhaps there are some insecurities. I disagree, but I doubt it is anything we can prove one way or the other. The issue for you or I is simply to be honest and polite. What prevents us from treating humans like humans regardless of how we are treated? It is a truly good person who can, in the face of obnoxiousness, speak truthfully, and kindly, not stooping to that level.", 
   {}, 
   102990, 
   null, 
   1112299440.0
  ], 
  [
   103181, 
   null, 
   "jim's trucking", 
   "Not that I know exactly what I would do should a similar experience take place at my door, but I have in the past just smiled, said something like, 'You have your beliefs, I have mine. Have a nice day.\" and shut the door.\n \n My wife's grandmother, at about 93, answered the door only to offered The Watchtower and some other printed material to which she answered, \"We've got all the literature we need.\" and held up a well worn KJV Bible.", 
   {}, 
   103148, 
   null, 
   1112305140.0
  ], 
  [
   103217, 
   null, 
   "Ladywolf", 
   "Thanks for all of your responses and helpful feedback.\n \n It's ironic that 2 Baptist missionaries would be the cause of me embracing my Jewish roots. I'd write and thank the church, but that's just inviting more trouble. I'm looking into a torah study class now.\n \n I've already learned so much.\n \n I never knew that the Bible had been mistranslated before! I was shocked to find this out.\n \n Easyrider, as far as your feedback goes, it really didn't help me, but thanks for the input anyway. Should I end up in this eternal firey place you call hell because I am Jewish, at least I'll be in good company. At least 6 million of my anscestors should already be \"down there\" so I won't be alone.", 
   {}, 
   103181, 
   null, 
   1112310120.0
  ], 
  [
   103224, 
   null, 
   "trebor", 
   "Thanks for all of your responses and helpful feedback.\n \n It's ironic that 2 Baptist missionaries would be the cause of me embracing my Jewish roots. I'd write and thank the church, but that's just inviting more trouble. I'm looking into a torah study class now.\n \n I've already learned so much.\n \n I never knew that the Bible had been mistranslated before! I was shocked to find this out.\n \n Easyrider, as far as your feedback goes, it really didn't help me, but thanks for the input anyway. Should I end up in this eternal firey place you call hell because I am Jewish, at least I'll be in good company. At least 6 million of my anscestors should already be \"down there\" so I won't be alone.\n\n \n If you want a nice learning site, check out http://www.torah.org . It's comentaries and lessons are very good for the person begining to embrace their Jewish heritage. \n \n Also, www.outreachjudaism.org and www.messiahtruth.com are places that you can see the arugments of the missionaries, and the Jewish counterarguements. They will discuss such mistranslations and viewpoints as a discussion about Psalm 22, Isaiah 7:14 (How almah means young woman), and how the vast majority of Rabbis believe that Isaiah 53 refers to the nation of Israel, not a messiah.\n \n www.jewsforjudaism will have many counter arguemetns also, for such claims as the shema means that one is more than one, and about some references to the medival commentaries are actually modern forgeries.", 
   {}, 
   103217, 
   null, 
   1112312160.0
  ], 
  [
   103225, 
   null, 
   "trs", 
   "Easyrider, as far as your feedback goes, it really didn't help me, but thanks for the input anyway. Should I end up in this eternal firey place you call hell because I am Jewish, at least I'll be in good company. At least 6 million of my anscestors should already be \"down there\" so I won't be alone.\nAnd their memory deserves more than to be used for cheap polemical advantage.", 
   {}, 
   103217, 
   null, 
   1112312760.0
  ], 
  [
   103252, 
   null, 
   "Easyrider", 
   " It's ironic that 2 Baptist missionaries would be the cause of me embracing my Jewish roots. I'd write and thank the church, but that's just inviting more trouble. I'm looking into a torah study class now. I never knew that the Bible had been mistranslated before! I was shocked to find this out.\n\n \n It's nothing of any major consequence, Ladywolf. No major doctrines are different. We have the Dead Sea Scrolls, and other writings which pretty much confirm most of the Old Testament, etc.\n \n Regarding your \"Torah\" Study, (etc.), I'd like to recommend a series of books to help you out. They're written by Dr. Michael L. Brown (a Jew). They're at Amazon.com, and they address Jewish Objections to Jesus. Basically, Brown takes the Jewish \"anti-missionary\" arguments and places them in their proper perspective to answer them, and show that Jesus is the Jewish Messiah. Brown's last book is titled, \"Answering Jewish Objections to Jesus - Volume Three - Messianic Prophecy Objections.\" He also did one titled, \"Answering Jewish Objections to Jesus - Volume Two - Theological Objections.\" I really recommend you read them to familiarize yourself with both sides of the issues, and to be fair please don't let any pre-conceived biases cloud your reading. \n \n \nEasyrider, as far as your feedback goes, it really didn't help me, but thanks for the input anyway. Should I end up in this eternal firey place you call hell because I am Jewish, at least I'll be in good company. At least 6 million of my anscestors should already be \"down there\" so I won't be alone.\n\n \n Ha ha. You won't see Moses or Elijah there. They were on the Mount of Transfiguration talking to Jesus at last report. I suspect the \"good\" Old Testament Jews are in heaven now, and the \"bad Jews\" and \"bad Christians\" are having their problems getting through the Pearly Gates. \n \n But where folks will wind up is spoken of by the Jewish prophet Daniel, in Daniel 12:2: \"And many of those who sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and everlasting contempt.\"", 
   {}, 
   103225, 
   null, 
   1112316840.0
  ], 
  [
   103322, 
   null, 
   "Orion", 
   "Regarding your \"Torah\" Study, (etc.), I'd like to recommend a series of books to help you out. They're written by Dr. Michael L. Brown (a Jew).\n\n \n He's a Christian. He chairs a Christian ministry.\n \n http://www.icnministries.org/index.htm \n \n \nand to be fair please don't let any pre-conceived biases cloud your reading.\n\n \n This, coming from you? You have often voiced your opinion that Jews understand neither their scripture nor their language, and if they did, they'd be Christians.", 
   {}, 
   103252, 
   null, 
   1112333220.0
  ], 
  [
   103337, 
   null, 
   "jitobear", 
   "Easyrider.\n \n Remember the Jews were God's chosen people. Christ was a Jew. You owe them much for your salvation.\n \n You seem to glory in God's wrath too much with some illusion that you could never feel it. Only one knows his flock - and it ain't you.\n \n There are two things that all the laws are hinged upon. Jesus tells in Matthew - loving God and each other. You would also be hard pressed to find scripture to support your arrogance or sharp words.\n \n Daring to claim another or unworthy of salvation is braver than I would be. For we are all but sinners, and none of us deserving. You and the Baptists at Ladywolf's door cheapen Christ's love with your cruel and judgmental tongues.", 
   {}, 
   103322, 
   null, 
   1112336220.0
  ], 
  [
   103352, 
   null, 
   "Duo_Maxwell", 
   "Actually, how is this a bad thing?\n \n So what if they damn you? \n \n It merely shows that they are so caught up in their beliefs that they cannot possibly fathom that maybe, JUST maybe, their belief isn't the correct one. \n \n If anything, this expierence should reinforce your faith, that your faith is not one that condemns others simply because they refuse to understand your position.", 
   {}, 
   103337, 
   null, 
   1112345760.0
  ], 
  [
   103387, 
   null, 
   "trebor", 
   "Easyrider.\n \n Remember the Jews were God's chosen people. Christ was a Jew. You owe them much for your salvation.\n \n You seem to glory in God's wrath too much with some illusion that you could never feel it. Only one knows his flock - and it ain't you.\n \n There are two things that all the laws are hinged upon. Jesus tells in Matthew - loving God and each other. You would also be hard pressed to find scripture to support your arrogance or sharp words.\n \n Daring to claim another or unworthy of salvation is braver than I would be. For we are all but sinners, and none of us deserving. You and the Baptists at Ladywolf's door cheapen Christ's love with your cruel and judgmental tongues.\n\n \n \n I like your spirit.\n \n Easyrider needs his nipples twisted though.", 
   {}, 
   103337, 
   null, 
   1112367780.0
  ], 
  [
   103477, 
   null, 
   "epaphras_faith", 
   "I don't know about these huckleberries giving you damnation..........However, Technically, according to christian doctrine, we were all already damned. It is believing that provides salvation (saving from death). There is one other thing, it is a saving TO life. If anyone condemns anyone to hell, it is ourselves..............Technically.\n \n EF", 
   {}, 
   103387, 
   null, 
   1112388900.0
  ], 
  [
   103556, 
   null, 
   "Easyrider", 
   " Easyrider. Remember the Jews were God's chosen people. Christ was a Jew. You owe them much for your salvation.\n\n \n Christ is the one who died for my sins. But I am thankful also for all the \"Old Testament Saints\" and what they did for God and their people.\n \n \nYou seem to glory in God's wrath too much with some illusion that you could never feel it. Only one knows his flock - and it ain't you. \n \n \n Tsk, tsk, look who's being the Judgmental one now. For the record, those who deny Christ aren't of \"his flock\". At least not yet.\n \n \nDaring to claim another or unworthy of salvation is braver than I would be. For we are all but sinners, and none of us deserving. You and the Baptists at Ladywolf's door cheapen Christ's love with your cruel and judgmental tongues..\n\n \n Maybe you can cough up the quote where I claimed someone was unworthy of salvation? I won't hold my breath. So maybe you should take your self-righteous, condemning attitude on down the Pike, Jito?\n \n And take that flake Orion with you.\n \n :p", 
   {}, 
   103477, 
   null, 
   1112418660.0
  ], 
  [
   103570, 
   null, 
   "zachvac", 
   "\n Sure, go ahead and ignore them....\n \n \"He who denies me before men, him will I deny before the Father.\" Jesus Christ \n \n Just remember the price you will eventually pay for that if you continue to reject Christ's salvation.\n \n\n \n Would this be a valid quote for me to \"cough up\"? You say that if you ignore them you will have to pay a price (which you insinuated was going to hell).", 
   {}, 
   103556, 
   null, 
   1112423400.0
  ], 
  [
   103571, 
   null, 
   "zachvac", 
   "In response to the original question, my parents always just say \"We're not interested\" and shut the door. But it would be fun to try some of the other ideas :)", 
   {}, 
   103570, 
   null, 
   1112423460.0
  ], 
  [
   103578, 
   null, 
   "jitobear", 
   "\n Tsk, tsk, look who's being the Judgmental one now. For the record, those who deny Christ aren't of \"his flock\". At least not yet.\n\n \n Oh - so you can show me the scripture that justified the rude way you posted to Ladywolf?\n \n \nMaybe you can cough up the quote where I claimed someone was unworthy of salvation?\n \n \n Just remember the price you will eventually pay for that if you continue to reject Christ's salvation.\n \n And you call me self-righteous and condemning? Cheeky.\n \n \nSo maybe you should take your self-righteous, condemning attitude on down the Pike, Jito?\n\n \n Pardon me? I am not the who represented my God by being a mean SOB. \n \n \nAnd take that flake Orion with you.\n\n \n Well, if being a flake means talking to someone with kindness and an open mind - OK, would love his company.", 
   {}, 
   103556, 
   null, 
   1112424660.0
  ], 
  [
   103581, 
   null, 
   "Orion", 
   "Very well. Perhaps there are some insecurities. I disagree, but I doubt it is anything we can prove one way or the other. The issue for you or I is simply to be honest and polite. What prevents us from treating humans like humans regardless of how we are treated? It is a truly good person who can, in the face of obnoxiousness, speak truthfully, and kindly, not stooping to that level.\n\n \n I agree, to an extent. If someone approaches me with a proposition, I can respectfully decline. However, I'd ask that you consider the following scenario: It's Saturday morning, and I'm interrupted by my doorbell. I open the door to find an individual (or maybe a couple) who introduce themselves and then inquire as to my religious beliefs. Right off the bat, this constitutes an unwarranted intrusion into my personal life. So, OK fine. They then proceed to inform me (in so many words) that if my religious beliefs do not coincide with theirs, then my religious beliefs are obviously inferior, and that if I don't accept their beliefs, I'm going to suffer the consequences. Presented with such manner of arrogant, insulting propositions, I confess that it's very difficult for me to retain my composure. I'd further add that I've never encountered this coming from Jews, Muslims, Hindus, or even mainline Christian groups. The primary culprits, as best I can tell, are JWs, Mormons, and conservative evangelical Christian groups. \n \n Lastly, I hope you'll enjoy the following as a rather light-hearted approach to the subject...\n \n http://www.jhuger.com/kisshank.php", 
   {}, 
   103148, 
   null, 
   1112425500.0
  ], 
  [
   103615, 
   null, 
   "georged", 
   "Here come the Christian testimony, justification and conversion attempts regardless if the topic is how to get them to mind their own business without using a 12 gauge.", 
   {}, 
   103556, 
   null, 
   1112456220.0
  ], 
  [
   103622, 
   null, 
   "Easyrider", 
   "Oh - so you can show me the scripture that justified the rude way you posted to Ladywolf?\n\n \n First show me what you thought was rude and then we can go from there.\n \n \nMaybe you can cough up the quote where I claimed someone was unworthy of salvation?\n\n \n \nJust remember the price you will eventually pay for that if you continue to reject Christ's salvation.\n\n \n Still waiting for you to come up with the quote where I claimed someone was unworthy of salvation. That wasn't it.\n \n \nI am not the who represented my God by being a mean SOB. \n\n \n You didn't like what God inspired Daniel to write in Daniel 12:2? \n \n \"Multitudes who sleep in the dust of the earth will awake: some to everlasting life, others to shame and everlasting contempt.\"\n \n You probably won't like the Judgments in the Book of Revelation either then. Sounds like you have bought into the liberal \"feel-good\" God who doesn't hold anyone accountable (ever).", 
   {}, 
   103615, 
   null, 
   1112460840.0
  ], 
  [
   103626, 
   null, 
   "Easyrider", 
   "Here come the Christian testimony, justification and conversion attempts regardless if the topic is how to get them to mind their own business without using a 12 gauge.\n\n \n Jesus said to go and make disciples of all nations, baptizing them in the name of the Father and the Son and the Holy Ghost. He didn't call us to be silent and let people perish. Nor did the Old Testament prophets ever buy into that mentality, but went and spoke the Word of God boldly, even when people didn't want to hear it. Same with Paul and the Apostles. Should we do any different, especially in a public forum such as this one?", 
   {}, 
   103622, 
   null, 
   1112461800.0
  ], 
  [
   103630, 
   null, 
   "georged", 
   "Jesus said to go and make disciples of all nations, baptizing them in the name of the Father and the Son and the Holy Ghost. He didn't call us to be silent and let people perish. Nor did the Old Testament prophets ever buy into that mentality, but went and spoke the Word of God boldly, even when people didn't want to hear it. Same with Paul and the Apostles. Should we do any different, especially in a public forum such as this one?\n\n \n When the forum topic is how to avoid personal confrontation and inconvenience at one's place of residence by fanatical members of belief systems without resorting to physical violence, common manners and consideration for other posters attempting to offer solutions would seemingly stop the flow of testimony.", 
   {}, 
   103626, 
   null, 
   1112462700.0
  ], 
  [
   103632, 
   null, 
   "Alan Ryan", 
   "When the forum topic is how to avoid personal confrontation and inconvenience at one's place of residence by fanatical members of belief systems without resorting to physical violence, common manners and consideration for other posters attempting to offer solutions would seemingly stop the flow of testimony.\n\n \n NOTHING stops the flow of testimony: religious enthusiasm seeps into private residences, public occasions, and any discussion that offers a chink of opportunity.", 
   {}, 
   103630, 
   null, 
   1112465040.0
  ], 
  [
   103633, 
   null, 
   "georged", 
   "NOTHING stops the flow of testimony: religious enthusiam seeps into private residences, public occasions, and any discussion that offers a chink of opportunity.\n\n \n So a Beretta 1201 FP is, as lord tammerlain suggested, the best 'defense' for such an infestation.", 
   {}, 
   103632, 
   null, 
   1112465460.0
  ], 
  [
   103634, 
   null, 
   "Alan Ryan", 
   "So a Beretta 1201 FP is, as lord tammerlain suggested, the best 'defense' for such an infestation.\n\n \n We could be shot for saying so: but Yes !", 
   {}, 
   103633, 
   null, 
   1112465580.0
  ], 
  [
   103636, 
   null, 
   "jim's trucking", 
   "Jesus said to go and make disciples of all nations, baptizing them in the name of the Father and the Son and the Holy Ghost. He didn't call us to be silent and let people perish. Nor did the Old Testament prophets ever buy into that mentality, but went and spoke the Word of God boldly, even when people didn't want to hear it. Same with Paul and the Apostles. Should we do any different, especially in a public forum such as this one?\n\n I think Jesus meant for you to express your belief in Him to others and offer them a chance to believe, but He did not want you to browbeat people into submission. Tell them once...if they don't accept it...to hell with them! Move on down the line.\n \n I have been a soldier for Christ before, but I never approached the same people twice and I always took \"No\" for an answer. I do my bit for the Lord by trying to live my life in a Christian manner. Oftentimes, I fail, but I think the example works better than the threat and the pushing.", 
   {}, 
   103626, 
   null, 
   1112466480.0
  ], 
  [
   103648, 
   null, 
   "Dzeron", 
   "Sure, go ahead and ignore them....\n \n \"He who denies me before men, him will I deny before the Father.\" Jesus Christ \n \n Just remember the price you will eventually pay for that if you continue to reject Christ's salvation.\n\n \n That is fallacious - an argument to the future.\n \n I can easily say that if you do not agree with me, then you will be tortured by a fat gremlin after you die. What, you don't agree with even that statement? You will be tortured by the fat gremlin for that!", 
   {}, 
   103044, 
   null, 
   1112472120.0
  ], 
  [
   103649, 
   null, 
   "Easyrider", 
   " \"He who denies me before men, him will I deny before the Father.\" Jesus Christ - Would this be a valid quote for me to \"cough up\"? You say that if you ignore them you will have to pay a price (which you insinuated was going to hell).\n\n \n They very likely will have to pay a price, Zacvac. What do the Scriptures say?\n \n \"He who has the Son (Jesus) has life; he who does not have the Son does not have everlasting life but the wrath of God abides on him.\" John 3:36\n \n And, \"If you do not believe I am the one I claim to be, you will indeed die in your sins.\" - Jesus\n \n I'm quite sure God would rather give folks salvation in Christ. But if people reject that then there there's very probably going to be serious consequences.", 
   {}, 
   103636, 
   null, 
   1112472300.0
  ], 
  [
   103651, 
   null, 
   "Dzeron", 
   "I'm quite sure God would rather give folks salvation in Christ. But if people reject that then there there's very probably going to be serious consequences.\n\n \n Again, an argument to the future!", 
   {}, 
   103649, 
   null, 
   1112472540.0
  ], 
  [
   103667, 
   null, 
   "Duo_Maxwell", 
   "We could be shot for saying so: but Yes !\n\n \n Why do you need to resort to firearms? \n \n A large frying pan will do the job quite nicely. Fanatics can be dealt with by only one manner: Force. \n \n Dzeron, it is quite clear that easyrider is not paying attention to your reasoning. Therefore, to show him the ludacrious logic he is applying, let's simply write our OWN scriptures that condemn him to hell for his beliefs, after all, it has the same validity as his scriptures.", 
   {}, 
   103634, 
   null, 
   1112478000.0
  ], 
  [
   103674, 
   null, 
   "Easyrider", 
   "Maxwell's Follies\n \n \n Dzeron, it is quite clear that easyrider is not paying attention to your reasoning. Therefore, to show him the ludacrious logic he is applying, let's simply write our OWN scriptures that condemn him to hell for his beliefs, after all, it has the same validity as his scriptures.\n\n \n Fallacy # 1: I condemned people to Hell. Wrong. The Word of God spells out what happens to the unregenerate. I don't have the power to condemn people to hell. To the contrary, I encourage salvation via faith in Jesus Christ so all will be saved!\n \n Fallacy # 2: \"..after all, it (Maxwell's own \"created scriptures\") have the same validity as his scriptures (the Bible). In your dreams, Maxwell.\n \n Jesus is Risen! And the Bible is the most widely read best seller in history. Your inventions haven't even made it on this board yet, much less established themselves as being the first bit credible. LOL!\n \n Next....", 
   {}, 
   103667, 
   null, 
   1112478840.0
  ], 
  [
   103678, 
   null, 
   "Duo_Maxwell", 
   "You should know better to question someone you will invaribly run away from due to your argument's inherent and inevintable failures. \n \n \n\n Fallacy # 1: I condemned people to Hell. Wrong. The Word of God spells out what happens to the unregenerate. I don't have the power to condemn people to hell. To the contrary, I encourage salvation via faith in Jesus Christ so all will be saved!\n\n \n \nJust remember the price you will eventually pay for that if you continue to reject Christ's salvation.\n\n \n While you did not yourself condemn someone, you clearly have stated the outcome of such behaviors as Ladywolf. It makes little difference. This only supports my initial asseration that being condemned by such a group is good because it shows how weak that group is in understanding different beliefs. \n \n \n\n Fallacy # 2: \"..after all, it (Maxwell's own \"created scriptures\") have the same validity as his scriptures (the Bible). In your dreams, Maxwell.\n\n \n Considering how you constantly failed to address the same issue before, I expect you to run away like you did. You clearly believe that the scriptures are true, yet here you ignored the hard question. Hopefully this will shut you up like it did before.\n \n 2,000 years ago, billy, bob, ted, judy, and bart all wrote down that jim farted at 6 pm. there is no other evidence that he did. there is no evidence that any of these writers existed.\n \n Can we prove that jim farted at 6 pm with those soruces? Obvious answer: No we cannot. Therefore any such writing by ME would have the same validity as any such writing by people back in the ancient times that has no proof. Therefore, with such logic my scriptures have the same standing as yours. \n \n \n\n Jesus is Risen! And the Bible is the most widely read best seller in history. Your inventions haven't even made it on this board yet, much less established themselves as being the first bit credible. LOL!\n\n \n Apparently, if someone wrote it down, it is therefore true. Btw, that's the fallacy of majority, or bandwagon. Justify why we should consider your fraud or eject it yourself. Considering that many here consider you a fool, and a bad example of a christain, you should reconsider your crediblity first before attacking others for something you lack.", 
   {}, 
   103674, 
   null, 
   1112479380.0
  ], 
  [
   103681, 
   null, 
   "joebrummer", 
   "Maxwell's Follies\n Jesus is Risen! And the Bible is the most widely read best seller in history. Your inventions haven't even made it on this board yet, much less established themselves as being the first bit credible. LOL!\n \n Next....\n\n \n So if we based religion on what is popular reading. I guess any John Grishim could be the word of god?\n \n Does popularity of a belief give it more validity? \n \n Food for thought......coming from my athiest mind.....\n Author Samuel Huntington disagrees: \"The percentage of Christians in the world peaked at about 30 % in the 1980s, leveled off, is now declining, and will probably approximate to about 25% of the world's population by 2025. As a result of their extremely high rates of population growth, the proportion of Muslims in the world will continue to increase dramatically, amounting to 20 percent of the world's population about the turn of the century, surpassing the number of Christians some years later, and probably accounting for about 30 percent of the world's population by 2025.\" \n http://www.religioustolerance.org/worldrel.htm", 
   {}, 
   103674, 
   null, 
   1112479440.0
  ], 
  [
   103683, 
   null, 
   "Duo_Maxwell", 
   "If popularity says what is correct, that therefore means to Germans in the 1930s, that Hitler's words were the words of God. Furthermore, in the 1400-1600s, the ritual murder of elites and nobles in the Aztech culture was the act of a God because popularity said so. Let's go today, J.K. Rowling and Stephen King have had astronomical following, does that mean Harry Potter and Horror books are therefore the words of God? \n \n That's completely absurd. And such is the problem with a argument that says something true because lots of people believe it to be.\n \n Easyrider: Cut your losses and run, you will lose.\n \n I'm no longer going to play nice with you. Dealing with a fanatic requires force, and that is percisely what I intend to use with no mercy whatsoever.", 
   {}, 
   103681, 
   null, 
   1112479980.0
  ], 
  [
   103686, 
   null, 
   "georged", 
   "So if we based religion on what is popular reading. I guess any John Grishim could be the word of god?\n \n Does popularity of a belief give it more validity? \n \n Food for thought......coming from my athiest mind.....\n Author Samuel Huntington disagrees: \"The percentage of Christians in the world peaked at about 30 % in the 1980s, leveled off, is now declining, and will probably approximate to about 25% of the world's population by 2025. As a result of their extremely high rates of population growth, the proportion of Muslims in the world will continue to increase dramatically, amounting to 20 percent of the world's population about the turn of the century, surpassing the number of Christians some years later, and probably accounting for about 30 percent of the world's population by 2025.\" \n http://www.religioustolerance.org/worldrel.htm\n\n \n Don't recall the sources, but Christians are due to lose their dominance as a portion of US population around the middle of this century. With their lack of consideration for the privacy of others it may take that to stop them from knocking on the doors of private residences.", 
   {}, 
   103681, 
   null, 
   1112480400.0
  ], 
  [
   103690, 
   null, 
   "joebrummer", 
   "Don't recall the sources, but Christians are due to lose their dominance as a portion of US population around the middle of this century. With their lack of consideration for the privacy of others it may take that to stop them from knocking on the doors of private residences.\n\n If a man rose from the dead with such importance to god or a creator, would it not have been documented better than some scrolls hidden in a cave? It almost seems as if it was kept a secret until it was immpossible to prove. If it really was so important to our relationship with the creator, you would think there would be better records of such a mind blowing event. Reality no such records exist, only a highly disputed, overly translated bunch of scrolls.", 
   {}, 
   103686, 
   null, 
   1112481600.0
  ], 
  [
   103696, 
   null, 
   "Easyrider", 
   "\"The percentage of Christians in the world peaked at about 30 % in the 1980s, leveled off, is now declining, and will probably approximate to about 25% of the world's population by 2025. As a result of their extremely high rates of population growth, the proportion of Muslims in the world will continue to increase dramatically, amounting to 20 percent of the world's population about the turn of the century, surpassing the number of Christians some years later, and probably accounting for about 30 percent of the world's population by 2025.\"\n\n \n This too was foretold.\n \n \"Now the Spirit speaketh expressly, that in the latter times some shall depart from the faith, giving heed to seducing spirits, and doctrines of devils; Speaking lies in hypocrisy; having their conscience seared with a hot iron;\" 1 Timothy 4:1-2 (KJV) \n \n \"For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear. They will turn their ears away from the truth and turn aside to myths. 2 Timothy 4:3-4 \n \n Next...", 
   {}, 
   103690, 
   null, 
   1112484660.0
  ], 
  [
   103698, 
   null, 
   "Dzeron", 
   "Fanatics can be dealt with by only one manner: Force. \n\n \n Force is the way of extremists. If there are fanatics trying to convert people through nonviolent means - preaching, arguing, etc., then the use of force against them is not justified.\n \n Besides, fanatics are fun to laugh at.", 
   {}, 
   103667, 
   null, 
   1112485320.0
  ], 
  [
   103699, 
   null, 
   "Easyrider", 
   "While you did not yourself condemn someone, you clearly have stated the outcome of such behaviors as Ladywolf. It makes little difference.\n\n \n Hardly. I politely invited Ladywolf to review Dr. Michael Brown's works on \"Answering Jewish Objections to Jesus\". I also tried to show her that the concept of hell or eternal damnation / shame wasn't a Christian invention by showing her Daniel 12:2.\n \n \n Considering how you constantly failed to address the same issue before, I expect you to run away like you did. You clearly believe that the scriptures are true, yet here you ignored the hard question. Hopefully this will shut you up like it did before.\n\n \n Nope. Never saw a particularly hard question either. \n \n \nTherefore any such writing by ME would have the same validity as any such writing by people back in the ancient times that has no proof. Therefore, with such logic my scriptures have the same standing as yours.\n\n \n Nope. Need some historical references for Christ, and even some evidence chisseled in stone? Review the following links:\n \n Historical Jesus: http://www.sundayschoolcourses.com/histjesu/histjesu.htm\n \n Ancient Ossuaries bear witness too:\n http://www.leaderu.com/theology/burialcave.html\n \n Then there's the New Testament. You don't have anything like that for yourself, do you?\n \n \n Considering that many here consider you a fool, and a bad example of a christain, you should reconsider your crediblity first before attacking others for something you lack.\n\n \n Looks like you're the attack poodle around here. And some 80% of Americans believe in Jesus Christ, so you're also a minority attack poodle at best. LOL!\n \n Christ is Risen Indeed!", 
   {}, 
   103696, 
   null, 
   1112485380.0
  ], 
  [
   103700, 
   null, 
   "georged", 
   "If a man rose from the dead with such importance to god or a creator, would it not have been documented better than some scrolls hidden in a cave? It almost seems as if it was kept a secret until it was immpossible to prove. If it really was so important to our relationship with the creator, you would think there would be better records of such a mind blowing event. Reality no such records exist, only a highly disputed, overly translated bunch of scrolls.\n\n \n Even the 'primitives' carved their belief systems in stone. With christianity all that exists are words passed through so many hands who knows what the digressions added. The original idol could have been a monkey. I like the fart analogy.", 
   {}, 
   103690, 
   null, 
   1112485440.0
  ], 
  [
   103702, 
   null, 
   "Easyrider", 
   "Even the 'primitives' carved their belief systems in stone. With christianity all that exists are words passed through so many hands who knows what the digressions added.\n\n \n And here we have the double standard for validating historical writings. \n \n Guess your Julius Caesar and Alexander the Great accounts really started out as a monkey farting too? Tell it to the history professors as you chuck your history books into the trash. LOL!", 
   {}, 
   103700, 
   null, 
   1112485740.0
  ], 
  [
   103704, 
   null, 
   "georged", 
   "\n Looks like you're the attack poodle around here. And some 80% of Americans believe in Jesus Christ, so you're also a minority attack poodle at best. LOL!\n \n\n \n 80%? That figures, a little more than the bottom scale of intelligence.", 
   {}, 
   103699, 
   null, 
   1112486100.0
  ], 
  [
   103706, 
   null, 
   "Easyrider", 
   "Manuscript Evidence - New Testament vs. other Ancient Works:\n \n http://www.carm.org/questions/textualevidence.htm\n \n http://www.gospelcom.net/faithfacts/maps_m.html\n \n Gotta love it.\n \n Christ is Risen!", 
   {}, 
   103702, 
   null, 
   1112486220.0
  ], 
  [
   103707, 
   null, 
   "georged", 
   "And here we have the double standard for validating historical writings. \n \n Guess your Julius Caesar and Alexander the Great accounts really started out as a monkey farting too? Tell it to the history professors as you chuck your history books into the trash. LOL!\n\n \n I certainly didn't have any professors who fanatically spouted christianity as a language to live by. Nor do those persons with belief systems and manners attempt forcing their opinions on others.", 
   {}, 
   103702, 
   null, 
   1112486520.0
  ], 
  [
   103709, 
   null, 
   "Easyrider", 
   " I certainly didn't have any professors who fanatically spouted christianity as a language to live by.\n\n \n I can tell. Too bad. You could use the wisdom! Besides, they aren't ALLOWED to teach it in the Public Schools.\n \n \nNor do those persons with belief systems and manners attempt forcing their opinions on others.\n\n \n You're free to try another forum, George. No one is \"forcing\" you to read all this.", 
   {}, 
   103707, 
   null, 
   1112487240.0
  ], 
  [
   103716, 
   null, 
   "jim's trucking", 
   "I can tell. Too bad. You could use the wisdom! Besides, they aren't ALLOWED to teach it in the Public Schools. \nRightly so...and wisdom doesn't come from memorizing a slew of Bible verses and spitting them at people out of context either.\n \n \n \n\n You're free to try another forum, George. No one is \"forcing\" you to read all this.\nThat's about the silliest thing I've read in this thread so far. There are other ways of discussing religion and presenting one's beliefs without judging those who hold dissimilar beliefs. I don't think you're qualified to judge anyone or condemn anyone to hell. God appears to have reserved that right for Himself.", 
   {}, 
   103709, 
   null, 
   1112491500.0
  ], 
  [
   103722, 
   null, 
   "georged", 
   "\n \n You're free to try another forum, George. No one is \"forcing\" you to read all this.\n\n \n The irony is the original thread subject and suggestions on how to avoid same. Certainly no one is forcing you to preach and condemn other people.", 
   {}, 
   103709, 
   null, 
   1112492220.0
  ], 
  [
   103723, 
   null, 
   "zachvac", 
   "They very likely will have to pay a price, Zacvac. What do the Scriptures say?\n \n \"He who has the Son (Jesus) has life; he who does not have the Son does not have everlasting life but the wrath of God abides on him.\" John 3:36\n \n And, \"If you do not believe I am the one I claim to be, you will indeed die in your sins.\" - Jesus\n \n I'm quite sure God would rather give folks salvation in Christ. But if people reject that then there there's very probably going to be serious consequences.\n\n \n \n But what about these quotes?\n \n \n \"He who tries to convert people out of fear are the only ones with something to fear\" - zachvac book of life 4:24\n \n \"He who rejects Bob as the holy savior of the world will burn forever\" - zachvac book of life 7:14", 
   {}, 
   103649, 
   null, 
   1112492460.0
  ], 
  [
   103724, 
   null, 
   "zachvac", 
   "Maxwell's Follies\n \n \n Fallacy # 1: I condemned people to Hell. Wrong. The Word of God spells out what happens to the unregenerate. I don't have the power to condemn people to hell. To the contrary, I encourage salvation via faith in Jesus Christ so all will be saved!\n \n Fallacy # 2: \"..after all, it (Maxwell's own \"created scriptures\") have the same validity as his scriptures (the Bible). In your dreams, Maxwell.\n \n Jesus is Risen! And the Bible is the most widely read best seller in history. Your inventions haven't even made it on this board yet, much less established themselves as being the first bit credible. LOL!\n \n Next....\n\n Well if you read zachvac's book of life you would know that the silly book you call the bible is wrong and the only people who go to hell is people who threaten other people with it.", 
   {}, 
   103674, 
   null, 
   1112492520.0
  ], 
  [
   103725, 
   null, 
   "Duo_Maxwell", 
   "Again, You should know better to question someone you will invaribly run away from due to your argument's inherent and inevintable failures. \n \n \nHardly. I politely invited Ladywolf to review Dr. Michael Brown's works on \"Answering Jewish Objections to Jesus\". I also tried to show her that the concept of hell or eternal damnation / shame wasn't a Christian invention by showing her Daniel 12:2.\n\n \n Please, You specifically said you will eventually pay for that if you continue to reject Christ's salvation.. Condemnation? yes. \n \n \n\n Nope. Never saw a particularly hard question either.\n\n \n Because you ignored it. \n \n \nHistorical Jesus: http://www.sundayschoolcourses.com/histjesu/histjesu.htm\n\n \n ALmost the entire argument is based upon claims being made to fit the facts, not facts matching the claims. Please. \n \n \n\n Ancient Ossuaries bear witness too:\n http://www.leaderu.com/theology/burialcave.html\n \n Then there's the New Testament. You don't have anything like that for yourself, do you?\n\n \n You do realize that proves nothing in this argument? The scriptures have not been proven, nor have the existance of the writers themselves.\n \n I see you avoided the question again.\n \n \nAnd some 80% of Americans believe in Jesus Christ, so you're also a minority attack poodle at best. LOL!\n\n \n Again, you ignored the problem of such a argument. \n \n If popularity says what is correct, that therefore means to Germans in the 1930s, that Hitler's words were the words of God. Furthermore, in the 1400-1600s, the ritual murder of elites and nobles in the Aztech culture was the act of a God because popularity said so. Let's go today, J.K. Rowling and Stephen King have had astronomical following, does that mean Harry Potter and Horror books are therefore the words of God? \n \n That's completely absurd. And such is the problem with a argument that says something true because lots of people believe it to be.\n \n Easyrider: Cut your losses and run, you will lose.", 
   {}, 
   103699, 
   null, 
   1112493180.0
  ], 
  [
   103736, 
   null, 
   "Easyrider", 
   "Wrong again, Duo Maxwell, on all counts.\n \n Recoomend YOU get Christ while you still can. You aren't guaranteed tomorrow.", 
   {}, 
   103725, 
   null, 
   1112494920.0
  ], 
  [
   103737, 
   null, 
   "Duo_Maxwell", 
   "Wrong again, Duo Maxwell, on all counts.\n \n Recoomend YOU get Christ while you still can. You aren't guaranteed tomorrow.\n\n \n [scarasm]Wow, wise words from a fanatic.[/scarasm]\n \n I see you again refuse to answer the question. \n \n You should know better to question someone you will invaribly run away from due to your argument's inherent and inevintable failures.\n \n I don't believe in your religion, and considering you, I don't want to.", 
   {}, 
   103736, 
   null, 
   1112495100.0
  ], 
  [
   103744, 
   null, 
   "trebor", 
   "I think Jesus meant for you to express your belief in Him to others and offer them a chance to believe, but He did not want you to browbeat people into submission. Tell them once...if they don't accept it...to hell with them! Move on down the line.\n \n I have been a soldier for Christ before, but I never approached the same people twice and I always took \"No\" for an answer. I do my bit for the Lord by trying to live my life in a Christian manner. Oftentimes, I fail, but I think the example works better than the threat and the pushing.\n\n \n \n Then you are a better Christian than Easyrider will ever be.", 
   {}, 
   103636, 
   null, 
   1112497500.0
  ], 
  [
   103749, 
   null, 
   "jitobear", 
   "First show me what you thought was rude and then we can go from there.\n\n \n Everything you say every time you post. \n \n \nStill waiting for you to come up with the quote where I claimed someone was unworthy of salvation. That wasn't it.\n\n \n It was implied. It was implied that she will never have a chance in front the Lord. It is implied in that your have correct interpretation. \n \n \nYou didn't like what God inspired Daniel to write in Daniel 12:2? \n \n \"Multitudes who sleep in the dust of the earth will awake: some to everlasting life, others to shame and everlasting contempt.\"\n\n \n Only Paul ever tickes me off. The man spoke in circles. What a yakker.\n \n \nYou probably won't like the Judgments in the Book of Revelation either then. Sounds like you have bought into the liberal \"feel-good\" God who doesn't hold anyone accountable (ever).\n\n \n Really now. And since you are so knowledgable about me why don't you tell me what color my underwear are.\n \n I simply read the Bible - and went from there. Never felt inclined to check in with the fundies on whether they think I am correct. And since it's a moment of assumptions - you seem to be one of those with the zeal of \"can't wait to see the judgement\" completely forgetting the God, first and foremost, is love.\n \n Oh - and there is no hell. The three words that have been translated into hell mean death. You get life or not. I hate it whan people paint God up like a common thug. Cruelty is a human trait.", 
   {}, 
   103622, 
   null, 
   1112500380.0
  ], 
  [
   103783, 
   null, 
   "Dzeron", 
   "Wrong again, Duo Maxwell, on all counts.\n \n Recoomend YOU get Christ while you still can. You aren't guaranteed tomorrow.\n\n \n I recommend that you get Boris while you can, or it's fat-gremlin-land for you.", 
   {}, 
   103736, 
   null, 
   1112510460.0
  ], 
  [
   103786, 
   null, 
   "zachvac", 
   "I recommend that you get Boris while you can, or it's fat-gremlin-land for you.\n\n \n \n no it's wrong, you must get zachvac while you can. He's the only true God. If you read the book of life you would know how he punishes those who dare believe in another God. You aren't guarenteed tommorrow. You'll never know when a lightning bolt might come down and smite you.", 
   {}, 
   103783, 
   null, 
   1112510940.0
  ], 
  [
   103789, 
   null, 
   "Orion", 
   "Really now. And since you are so knowledgable about me why don't you tell me what color my underwear are.\n\n \n White, with red polka-dots? :-)\n \n \nThis too was foretold.\n \n \"Now the Spirit speaketh expressly, that in the latter times some shall depart from the faith, giving heed to seducing spirits, and doctrines of devils; Speaking lies in hypocrisy; having their conscience seared with a hot iron;\" 1 Timothy 4:1-2 (KJV) \n \n Next...\n\n \n Interesting, is it not, how conservative Christians continue to push the 'end times' further and further into the future? EZ, please consider the following...\n \n Luke 21:31-32 - Even so, when you see these things happening, you know that the kingdom of God is near. I tell you the truth, this generation will certainly not pass away until all these things have happened. \n \n Hebrews 10:37 - For in just a very little while, He who is coming will come and will not delay. \n \n 1 Thess. 4:16-17 - For this we say unto you by the word of the Lord, that we which are alive and remain unto the coming of the Lord shall not prevent them which are asleep. For the Lord himself shall descend from heaven with a shout, with the voice of the archangel, and with the trump of God: and the dead in Christ shall rise first: Then we which are alive and remain shall be caught up together with them in the clouds, to meet the Lord in the air: and so shall we ever be with the Lord. \n \n James 5:7-9 - Be patient, then, brothers, until the Lord's coming. . . You too, be patient and stand firm, because the Lord's coming is near. \n \n 1 Peter 1:20 - He was chosen before the creation of the world, but was revealed in these last times for your sake. \n \n 1 Peter 4:7 - The end of all things is near. \n \n Rev. 22:20 - Surely I come quickly.\n \n These are 1st century writings, EZ, and they leave no doubt as to the author's beliefs that Jesus' second coming was imminent and would bring with it the end of all earthly things. They were obviously wrong, EZ. Apparently, the author of 2 Peter was aware of this and put forth the following apologetic sometime circa 90 CE...\n \n 2pet 3:8 But, beloved, be not ignorant of this one thing, that one day is with the Lord as a thousand years, and a thousand years as one day.\n \n Quoting the NRSV Study Bible...\n \n The best clue to the date of 2 Peter lies in 3.3-4. These verses seem to reflect a time when the early Christian expectation that Christ would come in glory within the lifetime of the first Christian generation had been disappointed.\n \n And where did that expectation come from? See above.", 
   {}, 
   103696, 
   null, 
   1112512860.0
  ], 
  [
   103815, 
   null, 
   "Easyrider", 
   "Orion, you've got no credibility around here to be mocking and bashing anyone else's religion, since you are unwilling and unable to tell us who your own so-called \"God\" is, where he / she / it lives, and provide us with some basic information so we can vet it all out. After 5+ years of ducking this, you've shown you are nothing more than an anti-Christian shill. For all we know you suck up to the Zachvac \"god\". So you and Maxwell and the Christ-bashers can all go wonder why you're still lost.", 
   {}, 
   103789, 
   null, 
   1112529120.0
  ], 
  [
   103821, 
   null, 
   "Orion", 
   "Orion, you've got no credibility around here to be mocking and bashing anyone else's religion,\n\n \n I did neither, EZ. I simply brought to your attention probematic verses from your very own Bible. That you chose not to address them says something.", 
   {}, 
   103815, 
   null, 
   1112532180.0
  ], 
  [
   103846, 
   null, 
   "Dzeron", 
   "Orion, you've got no credibility around here to be mocking and bashing anyone else's religion, since you are unwilling and unable to tell us who your own so-called \"God\" is, where he / she / it lives, and provide us with some basic information so we can vet it all out. After 5+ years of ducking this, you've shown you are nothing more than an anti-Christian shill. For all we know you suck up to the Zachvac \"god\". So you and Maxwell and the Christ-bashers can all go wonder why you're still lost.\n\n \n You just don't get it, do you? Christianity is just as incredible as the zachvac god, and Boris, and the fat gremlins, and so on and so forth. The threat of Hell is void.", 
   {}, 
   103815, 
   null, 
   1112554860.0
  ], 
  [
   103848, 
   null, 
   "jim's trucking", 
   "2pet 3:8 But, beloved, be not ignorant of this one thing, that one day is with the Lord as a thousand years, and a thousand years as one day.\n\n \n Does this mean the creation could have actually taken 6000 years and then the Lord rested for 1000 years?\n \n That' essentially what I've been trying to tell the orthodox creationists. God really created all this stuff, but He did it in his own way and in His own time. It took a helluva lot longer than 6 days, as we know days.\n \n \n The Bible is full of allegories. Get over it! emoticon_xangel", 
   {}, 
   103846, 
   null, 
   1112555760.0
  ], 
  [
   103864, 
   null, 
   "zachvac", 
   "You just don't get it, do you? Christianity is just as incredible as the zachvac god, and Boris, and the fat gremlins, and so on and so forth. The threat of Hell is void.\n\n \n No, the zachvac God is more credible than any of the other ideas. I have proof. It's all in a book and everyone believes it so it must be true. :P", 
   {}, 
   103846, 
   null, 
   1112559720.0
  ], 
  [
   103881, 
   null, 
   "Easyrider", 
   "You just don't get it, do you? Christianity is just as incredible as the zachvac god, and Boris, and the fat gremlins, and so on and so forth. The threat of Hell is void.\n\n \n And your evidence for this nonsense is..... ?", 
   {}, 
   103864, 
   null, 
   1112564640.0
  ], 
  [
   103892, 
   null, 
   "Duo_Maxwell", 
   "and I see easyrider has obviously fullied my prophecy by running away from my argument, just as I said he would.", 
   {}, 
   103881, 
   null, 
   1112567040.0
  ], 
  [
   103948, 
   null, 
   "trebor", 
   "And your evidence for this nonsense is..... ?\n\n \n Why Mr Rider, the evidence is Christians.", 
   {}, 
   103881, 
   null, 
   1112572140.0
  ], 
  [
   103976, 
   null, 
   "zachvac", 
   "And your evidence for this nonsense is..... ?\n\n \n \n I don't have to prove anything to prove my religion is as credible as Christianity, since it has no credibility. It's up to you to provide evidence for its credibility. Since I have come up with just as much evidence for zachvac being God, he is just as credible as God and Christianity.", 
   {}, 
   103881, 
   null, 
   1112574420.0
  ], 
  [
   103983, 
   null, 
   "Easyrider", 
   "I don't have to prove anything to prove my religion is as credible as Christianity, since it has no credibility. It's up to you to provide evidence for its credibility. Since I have come up with just as much evidence for zachvac being God, he is just as credible as God and Christianity.\n\n \n <chuckle< <guffaw<\n \n When you get 1.1 billion followers, create the World's all-time best-seller, and come up with something which contains 1/100th the wisdom of the Holy Bible, then I'll be impressed. Until then it's just hot air.", 
   {}, 
   103976, 
   null, 
   1112578260.0
  ], 
  [
   103989, 
   null, 
   "Duo_Maxwell", 
   "Wisdom? \n \n In your opinion. \n \n Notice how easy rider has completely ignored the problem of the fallacy of the bandwagon yet contitunes using such obvious fraud", 
   {}, 
   103983, 
   null, 
   1112581320.0
  ], 
  [
   104016, 
   null, 
   "Orion", 
   "Wisdom? \n \n In your opinion. \n \n Notice how easy rider has completely ignored the problem of the fallacy of the bandwagon yet contitunes using such obvious fraud\n\n \n I wouldn't go so far as to label it as fraud. EZ has a limited number of arguments which he can put forth in support of his theology. Given that he appears to be allergic to authoritative scholarship, he's forced to obtain his arguments from 'other' sources. And given that virtually all of his arguments have previously been shot down, his only choice is to recycle them in his continued attempt to 'witness' at these fora.", 
   {}, 
   103989, 
   null, 
   1112587740.0
  ], 
  [
   104025, 
   null, 
   "zachvac", 
   "<chuckle< <guffaw<\n \n When you get 1.1 billion followers, create the World's all-time best-seller, and come up with something which contains 1/100th the wisdom of the Holy Bible, then I'll be impressed. Until then it's just hot air.\n\n \n Well guess what, almost all people from birth to around 10 years old believe in Santa Clause and the Easter Bunny. Does that make them true as well? Many people still don't believe we went to the moon, does that make it true? Star Trek has a ton of followers and I would guess the TV show makes money since last I checked, you can still watch it (I don't) and they just created a Star Trek club at our school. Is that automatically deemed true? Just because you have a lot of people who believe in it doesn't mean it's true.\n \n Not only that. If you have no proof yet still have a ton of people believe in it that means that you are attracting people who require no proof to believe in something. All the proof you have is a book, which I have as well. If you send me $50 I'll send you the book. It tells of how I created the world and what you have to do to have a good afterlife.\n \n And since Christianity isn't even the major religion in the entire world, you can only assume it's wrong. After all, most people aren't Christians and there are more Muslims than Christians.", 
   {}, 
   103983, 
   null, 
   1112589540.0
  ], 
  [
   104036, 
   null, 
   "Alan Ryan", 
   "It's amazing how long this thread has become, since there's no such thing as \"hell and damnation\".", 
   {}, 
   104025, 
   null, 
   1112606220.0
  ], 
  [
   104064, 
   null, 
   "georged", 
   "It's amazing how long this thread has become, since there's no such thing as \"hell and damnation\".\n\n \n That should attract every scripture quoting fundamentalist on the board.", 
   {}, 
   104036, 
   null, 
   1112635020.0
  ], 
  [
   104072, 
   null, 
   "joebrummer", 
   "\n And since Christianity isn't even the major religion in the entire world, you can only assume it's wrong. After all, most people aren't Christians and there are more Muslims than Christians.\n\n \n Check your facts.....Read back a bunch of posts and you will find we already covered this and this statement is not true.", 
   {}, 
   104025, 
   null, 
   1112638860.0
  ], 
  [
   104110, 
   null, 
   "trebor", 
   "\n \n And since Christianity isn't even the major religion in the entire world, you can only assume it's wrong. After all, most people aren't Christians and there are more Muslims than Christians.\n\n \n Actually, Christians outnumber Muslims by a 2 to 1 margin (unless you are talking about \\'true christians\\', then the numbers get all mixed up, since a lot of Christians claim Catholics aren\\'t \"true Chrstians\".", 
   {}, 
   104025, 
   null, 
   1112646720.0
  ], 
  [
   104117, 
   null, 
   "epaphras_faith", 
   "I think Jesus meant for you to express your belief in Him to others and offer them a chance to believe, but He did not want you to browbeat people into submission. Tell them once...if they don't accept it...to hell with them! Move on down the line.\n \n I have been a soldier for Christ before, but I never approached the same people twice and I always took \"No\" for an answer. I do my bit for the Lord by trying to live my life in a Christian manner. Oftentimes, I fail, but I think the example works better than the threat and the pushing.\n\n \n Amen Jim! I too have had the distinction of doing the very same thing. I also know how to take no for an answer.\n \n I would also add, that I have never never never tried to SCARE someone into salvation as God never did that. The quoted verse (go and make disciples) uses that word disciple. It is one who is learning about who God is. No where in that statement does it say go and preach hellfire and brimstone. It tells us to teach who christ is. I think some of us try to do that. I note that many nonchristians have been tolerant of this and been willing to discuss with us.\n \n EZ, once again you offend these good folks. Once again you offend me by protraying God as one who cannot wait to destroy those souls who do not choose HIM. He hates this and I do wish you would quit trying to tell people they are going to go to hell if they don't.....\n \n Well, you get the point. We have had this discussion before. God is a god of mercy and grace. It is His desire that none should perish. But it is also His desire that each choose. Christ died on the cross to give people a choice. The coercive method you employ subverts this very thing.\n \n EF", 
   {}, 
   103636, 
   null, 
   1112650020.0
  ], 
  [
   104129, 
   null, 
   "Duo_Maxwell", 
   "I wouldn't go so far as to label it as fraud.\n\n \n I'm not sure. The fallacy he is using a obvious one. If a majority believe it to be true, it is therefore true. Absurd. One who uses fallacies often using deception to serve his point. One who delibeately uses deception is fraudlent. \n \n \nhis only choice is to recycle them in his continued attempt to 'witness' at these fora.\n\n \n So he's guilty not only of the fallacy of bandwagon by ad naseum was well.", 
   {}, 
   104016, 
   null, 
   1112652900.0
  ], 
  [
   104213, 
   null, 
   "Easyrider", 
   "EZ, once again you offend these good folks. Once again you offend me by protraying God as one who cannot wait to destroy those souls who do not choose HIM.\n\n \n That's your twisted spin, EF. I say God gives them a whole lifetime (or however many years God lets them live) to repent and receive Christ. \n \n \n He hates this and I do wish you would quit trying to tell people they are going to go to hell if they don't.....\n\n \n If, by the time people die, they have not received Jesus Christ as their Lord and Savior for the remission of their sins, they are very likely going to be in real deep sneakers, EF. The more years people keep saying no to Christ the easier it gets for them to say no again, until by their 70's very few people get saved.\n \n If all that offends people then so be it.", 
   {}, 
   104129, 
   null, 
   1112669820.0
  ], 
  [
   104214, 
   null, 
   "Easyrider", 
   "EZ has a limited number of arguments which he can put forth in support of his theology. Given that he appears to be allergic to authoritative scholarship, he's forced to obtain his arguments from 'other' sources.\n\n \n Liberal theologians \"breaking wind\" is always your grand idea of \"authoritative scholarship\". Let's see how one of your own liberal scholar hero's fared:\n \n What's Wrong with the liberal Bishop Spong?\n \n http://www.answersingenesis.org/docs/1119.asp\n \n Spong the Greek scholar:\n \n Spong boasts that he spends hours studying the Bible and professes an acquaintance with Koinè Greek, the language the NT was first written in. Therefore it is not surprising that in RMR, where he denies Jesus' bodily resurrection, that he turns to an analysis of the Greek text to see what the Bible really means. In RMR p. 53-55, Spong draws our attention to Gal. 1:15-16a which says:\n \n 15 But when He who had set me apart, even from my mother's womb, called me through His grace, was pleased 16to reveal His son in me ...\n \n From v. 16, 'to reveal His son in me', Spong claims: This was not a physical body recalled from the grave. The word for 'reveal' in this text is ophthe, the same word used in the Greek Septuagint translation of the Hebrew Scriptures to describe the appearances of God (theophanies) or angels of God (angelophanies) ... . What was the nature of a theophany? Was it really 'physical'? What was the means of hearing God's voice speak? Was it audible to any ear? Was it capable of being recorded or objectified?\n \n At first, we were impressed by this depth. But on checking a computerised concordance,81 we found that òphthè is sometimes used of ordinary physical 'seeing' (Acts 7:26, 1 Tim. 3:16) - not surprising that we derive the word 'ophthalmologist' from a related word, and such a doctor definitely deals with physical sight. A logician would also note that Spong commits the fallacy of false alternatives, because he overlooks the possibility that seeing could be both physical and supra-physical, rather that either/or. We thought that it was strange that Spong should ignore this point. However, we decided to check a Greek NT82 to see if Spong had at least analysed the word correctly in this passage. But we could not find òphthè in the passage. To give Spong a second shot, we checked a NT Greek Interlinear. The word was not there either. Instead, the Greek word for 'reveal' in Gal. 1:16 is actually apokalupsai, not òphthè! Apokalupsai is often used in the NT in an objective sense.83 \n \n It is shocking to see that Spong was trying to attack traditional Christian belief by appealing to a mistranslation of a Greek word which is not even in the passage he is explaining. Prof. O'Collins is undoubtedly referring to this blunder when he wrote: 'What is said about a key verb St. Paul uses in Gal. 1:15f. shows that the bishop [Spong] has forgotten any Greek that he knew.'79 Spong should heed O'Collins' kindly 'advice for his next book [which] is to let some real experts check it before publication.\n \n There's your \"Authoritative Scholarship\" Orion - the Liberal Bishop Spong breaking wind and getting nailed on it. LOL!!!\n \n You've got no juice around here, Orion.", 
   {
    "unicode_changes_made": true
   }, 
   104213, 
   null, 
   1112670540.0
  ], 
  [
   104255, 
   null, 
   "zachvac", 
   "Amen Jim! I too have had the distinction of doing the very same thing. I also know how to take no for an answer.\n \n I would also add, that I have never never never tried to SCARE someone into salvation as God never did that. The quoted verse (go and make disciples) uses that word disciple. It is one who is learning about who God is. No where in that statement does it say go and preach hellfire and brimstone. It tells us to teach who christ is. I think some of us try to do that. I note that many nonchristians have been tolerant of this and been willing to discuss with us.\n \n\n I am fine with people trying to discuss God as long as they do those 2 things: Not try to convert by threatening with hell (or anything for that matter) and knowing that when someone says no, they mean no. Thank you for understanding that different people have different beliefs and not acting as EasyRider has here in trying to tell everyone they are going to hell if they don't convert. He should realize that that doesn't convert people, that makes people view Christianity that much worse and although I know most Christians are kind and decent human beings, it's hard to remember that sometimes with the remarks some people make on these boards.", 
   {}, 
   104117, 
   null, 
   1112675880.0
  ], 
  [
   104282, 
   null, 
   "Orion", 
   "Liberal theologians \"breaking wind\" is always your grand idea of \"authoritative scholarship\". Let's see how one of your own liberal scholar hero's fared:\n \n What?s Wrong with the liberal Bishop Spong?\n \n http://www.answersingenesis.org/docs/1119.asp\n\n \n Tell me, EZ, how many of Spong's books have you read? None? Oh, OK. I've previously invited you to discuss Spong with me on condition that you first read one or more of his books. You've declined my offers. \n \n Ever read any books by Karen Armstrong, Ray Brown, Paul Tillich, John Dominic Crossan, Marcus Borg, Elaine Pagels, Richard E. Friedman, Huston Smith? No? I've previously invited you to discuss Crossan with me on condition that you first read one or more of his books. You've declined my offers. \n \n Ever read Abraham Cohen's Everyman's Talmud or Adin Steinsaltz' The Essential Talmud? How about Telushkin's Biblical Literacy? And wait, here's a long shot, Mircea Eliades' A History of Religious Ideas, Vols. 1 & 2? I didn't think so. \n \n Do you even know who these people are? Or, do you limit your sources to websites such as AIG, CARM, LeaderU, and various 'Jews for Jesus' (aka Southern Baptist) sites? \n \n I've frequently quoted to you from the six-volume Anchor Bible Dictionary, which is considered to be one of the most, if not the most, authoritative sources regarding biblical scholarship. Yes, I know it's expensive, but there is a CD version which you can obtain from Amazon which is considerably less expensive than the hard-copy version. Are you interested? I suspect not.\n \n \nYou've got no juice around here, Orion.\n\n \n Let's let folks here decide.", 
   {}, 
   104214, 
   null, 
   1112679720.0
  ], 
  [
   104306, 
   null, 
   "epaphras_faith", 
   "That's your twisted spin, EF. I say God gives them a whole lifetime (or however many years God lets them live) to repent and receive Christ. \n \n \n \n If, by the time people die, they have not received Jesus Christ as their Lord and Savior for the remission of their sins, they are very likely going to be in real deep sneakers, EF. The more years people keep saying no to Christ the easier it gets for them to say no again, until by their 70's very few people get saved.\n \n If all that offends people then so be it.\nYou say you are a christian and so I will accept that. Since that is the case, by definition you are one who wants to be conformed to the image of christ. Christ prayed not that his children would escape hell but that they would be one with He and the Father? Is that your prayer for these? It seems more towards the \"i've warned them and will bully them into saying a prayer that they do not mean.\" form of \"evangelism.\" I do not say this to offend you but believe that as a brother in christ I am called to encourage you to see God rightly. \"Seek first the kingdom of heaven and HIS righteousness and all esle shall be added.\" Notice it does not say avoid hell at all costs. It says SEEK FIRST THE KINGDOM OF HEAVEN.\n \n In doing this we avoid hell. It is a by product. It is not the goal. The Goal in being christian is \"christ likeness\". In the Psalms God is described by the word \"Lovingkindness\" more than 250 times (NASB). The word for judgement is used less than 20. That is an indication of who our God is. These folks take your comments as threats and you represent Jesus on this earth. Therefore they see Jesus as threatening. Is that really what you want?\n \n You don't have to take my advice and I fully expect you to argue with me to try and show that God wants them to avoid hell. I agree He does. He just doesn't want them to avoid it because they have been threatened about it. It is that kind of thinking that lead to the inquisitions.\n \n The fruit of the spirit is Love JOy Peace, Mercy Kindness etc. It does not say the fruit of the spirit is hounding people. \n \n God Bless.\n \n EF", 
   {}, 
   104213, 
   null, 
   1112685600.0
  ], 
  [
   104558, 
   null, 
   "Easyrider", 
   "EF, God gives people different styles of ministries. A ministry of a John the Baptist, telling people to \"Repent, for the axe is laid at the foot of the tree,\" is quite different than that of a Mother Theresa. \n \n Like I've said a hundred times, I prefer people receive Jesus Christ as their Lord and Savior for the remission of their sins. You always tell these folks I just like to talk about hell. Wrong. \n \n But if they don't do it by the time they die, then they are in dire danger of going to hell.\n \n And that's the Gospel truth.\n \n Don't just sugar coat the Word of God EF, give it all to them, because some will come to Christ out of fear of going to hell, and many come to him out of love. You personally are not privy to knowing which is which. How do I know this? From 5 years of preaching the Gospel. \n \n So save your energy and go preach the Gospel your way. I'll do it the way I feel I am called to.", 
   {}, 
   104306, 
   null, 
   1112746560.0
  ], 
  [
   104564, 
   null, 
   "Kaill", 
   "I'm interviewing Bishop Spong this Thursday for Humanist in Canada magazine. Anyone have a question they'd like me to ask him?\n \n Derek\n \n emoticon_idea emoticon_xchicken \n \n Walk into the light...", 
   {}, 
   104558, 
   null, 
   1112747460.0
  ], 
  [
   104566, 
   null, 
   "sinjin", 
   "EF, God gives people different styles of ministries. A ministry of a John the Baptist, telling people to \"Repent, for the axe is laid at the foot of the tree,\" is quite different than that of a Mother Theresa. \n \n Like I've said a hundred times, I prefer people receive Jesus Christ as their Lord and Savior for the remission of their sins. You always tell these folks I just like to talk about hell. Wrong. \n \n But if they don't do it by the time they die, then they are in dire danger of going to hell.\n \n And that's the Gospel truth.\n \n Don't just sugar coat the Word of God EF, give it all to them, because some will come to Christ out of fear of going to hell, and many come to him out of love. You personally are not privy to knowing which is which. How do I know this? From 5 years of preaching the Gospel. \n \n So save your energy and go preach the Gospel your way. I'll do it the way I feel I am called to.\n\n \n I'll take Mother Teresa's approach any day. You're disgraceful IMO.", 
   {}, 
   104558, 
   null, 
   1112747580.0
  ], 
  [
   104574, 
   null, 
   "Duo_Maxwell", 
   "Easyrider in my opinion, gives Christians and Christanity a bad name.", 
   {}, 
   104566, 
   null, 
   1112747880.0
  ], 
  [
   104575, 
   null, 
   "Easyrider", 
   "Sinjin, Mother Theresa would probably tell you to repent and ask Jesus to be your Lord and Savior for the remission of your sins. But you would think that was stupid too. So I'm supposed to listen to a man or woman (whatever you are) that is one heartbeat away from an eternal disaster without Christ?\n \n Never happen, Sinjin. Get Christ while you still can.", 
   {}, 
   104566, 
   null, 
   1112747880.0
  ], 
  [
   104577, 
   null, 
   "jitobear", 
   "EF, God gives people different styles of ministries. A ministry of a John the Baptist, telling people to \"Repent, for the axe is laid at the foot of the tree,\" is quite different than that of a Mother Theresa. \n \n Like I've said a hundred times, I prefer people receive Jesus Christ as their Lord and Savior for the remission of their sins. You always tell these folks I just like to talk about hell. Wrong. \n \n But if they don't do it by the time they die, then they are in dire danger of going to hell.\n \n And that's the Gospel truth.\n \n Don't just sugar coat the Word of God EF, give it all to them, because some will come to Christ out of fear of going to hell, and many come to him out of love. You personally are not privy to knowing which is which. How do I know this? From 5 years of preaching the Gospel. \n \n So save your energy and go preach the Gospel your way. I'll do it the way I feel I am called to.\n\n \n You turn me off my Bible for sure.\n \n You are wrong about using fear to bring people to Christ. If they aren't there out of love - they aren't really there at all. For love comes first. All the rest hinges on that - none of the laws after it matter if you are missing that peice. Jesus said that.\n \n And there is no hell.", 
   {}, 
   104558, 
   null, 
   1112748000.0
  ], 
  [
   104578, 
   null, 
   "Easyrider", 
   "Duo, all I can say is get Christ before you die. And remember who tried to warn you people.", 
   {}, 
   104575, 
   null, 
   1112748060.0
  ], 
  [
   104587, 
   null, 
   "Duo_Maxwell", 
   "Duo, all I can say is get Christ before you die. And remember who tried to warn you people.\n\n \n I think I'll pass. It's people like you that make me not want it. Besides, I don't believe in orthodoxy. \n \n It's interesting how you preach condemnation as a reason rather the love. I suppose we see the true factor driving some christians now don't we?", 
   {}, 
   104578, 
   null, 
   1112748960.0
  ], 
  [
   104588, 
   null, 
   "Easyrider", 
   "You turn me off my Bible for sure.\n\n \n From reviewing your posts, you were cold and/or lukewarm towards the Word of God before I ever conversed with you. \n \n \nYou are wrong about using fear to bring people to Christ. If they aren't there out of love - they aren't really there at all.\n\n \n Wrong again, son. \"Sinners in the Hands of Angry God\" is considered the most famous sermon ever preached in American history. Jonathan Edwards delivered this message on July 8, 1741 in Enfield, Connecticut. Many who heard it trembled and cried out for mercy. Others fainted. Five hundred people were converted that day. You can find it on Yahoo.\n \n http://www.monergismbooks.com/sinnersaudio7405.html\n \n \nFor love comes first. All the rest hinges on that - none of the laws after it matter if you are missing that peice. Jesus said that.\n\n \n If you're so impressed with the love of Jesus why aren't you preaching his Gospel? Go do that and I'll be impressed with your own claim of \"love\".\n \n \nAnd there is no hell.\n\n \n Jesus said otherwise. But why do you believe what he said about love and the law and disbelieve what he taught about hell? What's your criteria for that kind of logic?", 
   {}, 
   104578, 
   null, 
   1112749020.0
  ], 
  [
   104592, 
   null, 
   "Easyrider", 
   "Duo, if you don't believe what Christ tried to tell you, you won't believe anyone else who tells you the same thing. Because it's spiritually discerned, and the carnal mind cannot comprehend it (1 Corinthians 2:14, etc.). \n \n Recommend you submit it to prayer.", 
   {}, 
   104588, 
   null, 
   1112749200.0
  ], 
  [
   104597, 
   null, 
   "Duo_Maxwell", 
   "Duo, if you don't believe what Christ tried to tell you, you won't believe anyone else who tells you the same thing. Because it's spiritually discerned, and the carnal mind cannot comprehend it (1 Corinthians 2:14, etc.). \n \n Recommend you submit it to prayer.\n\n \n Oh sorry, I was in my daily sacriligious act. Were you saying something? \n \n It seems to me you are driven by fear of Hell rather then the love of Christanity.", 
   {}, 
   104592, 
   null, 
   1112749560.0
  ], 
  [
   104605, 
   null, 
   "trebor", 
   "Oh sorry, I was in my daily sacriligious act. Were you saying something? \n \n It seems to me you are driven by fear of Hell rather then the love of Christanity.\n\n \n \n It sounds like he has done something horrible, and is going 'ultra religious' and fire and brimstone to convince himself faith is enough to get him his 'get out of hell free' card.", 
   {}, 
   104597, 
   null, 
   1112750940.0
  ], 
  [
   104609, 
   null, 
   "Easyrider", 
   "Trebor,\n \n You and your boy Duo speaking on spiritual matters, reminds me of when they asked John Dean what his favorite New Testament book was. He answered, \"Job\". LOL!! You guys are the blind leading the blind. But rest assured Jesus can show you the way if you will seek him.", 
   {}, 
   104605, 
   null, 
   1112751900.0
  ], 
  [
   104611, 
   null, 
   "trebor", 
   "Trebor,\n \n You and your boy Duo speaking on spiritual matters, reminds me of when they asked John Dean what his favorite New Testament book was. He answered, \"Job\". LOL!! You guys are the blind leading the blind. But rest assured Jesus can show you the way if you will seek him.\n\n \n \n You certainly are a good 'bad' example. With that, due to your behavior, deciede to strengthen my position, and keep away from Christianity. \n \n I wonder what you have done to make you so bitter towards life?", 
   {}, 
   104609, 
   null, 
   1112752860.0
  ], 
  [
   104615, 
   null, 
   "Duo_Maxwell", 
   "Do you think trebor, that easy realizes his bad behavior makes us only more anti?", 
   {}, 
   104611, 
   null, 
   1112753040.0
  ], 
  [
   104624, 
   null, 
   "trebor", 
   "Do you think trebor, that easy realizes his bad behavior makes us only more anti?\n\n \n \n I don't think he cares. I suspect he is actually trying keep his doubts under control, and not convince others.", 
   {}, 
   104615, 
   null, 
   1112754240.0
  ], 
  [
   104632, 
   null, 
   "sinjin", 
   "Sinjin, Mother Theresa would probably tell you to repent and ask Jesus to be your Lord and Savior for the remission of your sins. But you would think that was stupid too. So I'm supposed to listen to a man or woman (whatever you are) that is one heartbeat away from an eternal disaster without Christ?\n \n Never happen, Sinjin. Get Christ while you still can.\n\n \n I firmly believe the subject would not have come up should I have had the great honor to have been in her presence and I have associated with numerous Catholic clergy. In addition, that whole \"ask Jesus to be your Lord and Savior\" thing is so not Catholic.\n \n You don't have to listen to me but I wish you'd show me the same courtesy, but no, you're on a mission. I have no \"wisdom\" to spare anyways.\n \n I am a man but nothing more. Aren't you?", 
   {}, 
   104575, 
   null, 
   1112757540.0
  ], 
  [
   104633, 
   null, 
   "jitobear", 
   "From reviewing your posts, you were cold and/or lukewarm towards the Word of God before I ever conversed with you. \n\n \n I disagree with you and think you are mean. My feelings towards you are not an indication of my feelings towards God. Just who is it that you think you are?\n \n \nWrong again, son. \"Sinners in the Hands of Angry God\" is considered the most famous sermon ever preached in American history. Jonathan Edwards delivered this message on July 8, 1741 in Enfield, Connecticut. Many who heard it trembled and cried out for mercy. Others fainted. Five hundred people were converted that day. You can find it on Yahoo.\n \n http://www.monergismbooks.com/sinnersaudio7405.html\n\n \n That's fantastic - but this what Jesus said in Matthew 22:36-40\n \n \"Teacher, which is the greatest commandment in the Law?\" Jesus replied: \" 'Love the Lord your God with all your heart and with all your soul and with all your mind.' This is the first and greatest commandment. And the second is like it: 'Love your neighbor as yourself.' All the Law and the Prophets hang on these two commandments.\"  \n \n \nIf you're so impressed with the love of Jesus why aren't you preaching his Gospel? Go do that and I'll be impressed with your own claim of \"love\".\n\n \n I speak of my faith freely - am discussing it now. Or are you wondering why I don't run around scaring people into it?\n \n \nJesus said otherwise. But why do you believe what he said about love and the law and disbelieve what he taught about hell? What's your criteria for that kind of logic?\n\n \n He never taught about a place called hell. He made several warnings against losing yourself there. The actual word he used is Gehena. Gehena was a real place outside of Jerusalem where people were scarificed and refuse was burned. It was metaphor for destruction. He came to save us to life, he doesn't want us destroyed.\n \n I do believe there are those that will not see eternal life - and maybe their end will be fiery- but I don't believe that they will be tortured for an eternity. That isn't the act of a loving God. Would you do that to your child? How can you think the father in heaven would treat you as such? He did not grant free will to toy with it like a gangsta. I couldn't love God if he operated the way you seem to believe.\n \n There are two more words that have been translated into hell - one is the Hebrew sheol - it means the pit or the grave, the Greek haides replaced sheol, Jesus used Gehena as I stated above.\n \n Jews don't believe in hell - 3/4 of the Bible, not to mention our savior is Jewish. What they believe is relevant to me.\n \n I am aware of the Lazarus story and the passages in Revelation that are used to argue for hell. Neither are enough to convince that an eternity of torment awaits anyone.\n \n And nothing in the Bible that I have ever read (and I have read all of it) would condone the way you wish to represent God - with fear tactics.\n \n I don't want to love or please God for any reason other than he loves me. I know I wouldn't want to be loved for any other reason either. Would you put a gun to somebody's head and demand their love - and then believe it was sincere?", 
   {
    "unicode_changes_made": true
   }, 
   104588, 
   null, 
   1112757540.0
  ], 
  [
   104639, 
   null, 
   "Easyrider", 
   "So Jitobear,\n \n Is Jesus Christ your divine Lord and Resurrected Savior for the remission of your sins?", 
   {}, 
   104633, 
   null, 
   1112759160.0
  ], 
  [
   104650, 
   null, 
   "Orion", 
   "Trebor,\n \n You and your boy Duo speaking on spiritual matters, reminds me of when they asked John Dean what his favorite New Testament book was. He answered, \"Job\". LOL!! You guys are the blind leading the blind. But rest assured Jesus can show you the way if you will seek him.\n\n \n So tell me, EZ, who else ya gonna alienate today?\n \n \nEF, God gives people different styles of ministries.\n\n \n So then, in your opinion, God is directing your particular style of 'witness'? I think it's more realistic to say that people such as you who evangelize at these fora decide upon a particular methodology. I'll have more to say about that in a second. Fact is, I've watched you do your thing at these fora for 6+ years, from the USAT to the New York Times to the Atlantic Monthly, to here. And in every such case, I've observed that the result of your methodology has been to alienate people not only from your particular version of Christianity, but oftentimes from Christianity itself. Now, if I desire a certain result, I may decide upon a certain methodology in an attempt to reach that result. But if after several years, I discover that, not only is my chosen methodology not bringing about the desired result, but is in effect bringing about the opposite result, I might want to reconsider my methodology. Just a thought, EZ.\n \n \n\"Sinners in the Hands of Angry God\" is considered the most famous sermon ever preached in American history. Jonathan Edwards delivered this message on July 8, 1741 in Enfield, Connecticut.\n \n \n You're not Jonathan Edwards, and this ain't 1741.\n \n But, don't take my word for it. Your fellow Christians, here and elsewhere, have repeatedly suggested to you that fear is not a very good motivator, at least not for long. It may work for a time with children, but children eventually learn to think for themselves. Furthermore, an insulting, abrasive, and obnoxious delivery is not going to win very many people over to one's position, regardless of the merits of that position.", 
   {}, 
   104609, 
   null, 
   1112761320.0
  ], 
  [
   104867, 
   null, 
   "Duo_Maxwell", 
   "Guys, have you considered that perhaps Easy Rider is in fact a atheist trying to convince people of the horrors of Christanity? \n \n I've considered running such gags aganist creationists in the past, i don't see why he couldn't be doing a similar act with christainity.", 
   {}, 
   104650, 
   null, 
   1112826420.0
  ], 
  [
   104887, 
   null, 
   "trs", 
   "Guys, have you considered that perhaps Easy Rider is in fact a atheist trying to convince people of the horrors of Christanity? \nOutstanding!", 
   {}, 
   104867, 
   null, 
   1112828220.0
  ], 
  [
   104889, 
   null, 
   "Dzeron", 
   "Guys, have you considered that perhaps Easy Rider is in fact a atheist trying to convince people of the horrors of Christanity? \n\n \n Or worse - he is sent by Satan, to make Christians look like fools!", 
   {}, 
   104867, 
   null, 
   1112829120.0
  ], 
  [
   104916, 
   null, 
   "Easyrider", 
   "\"You stiffnecked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit!\" - Acts 7:51", 
   {
    "unicode_changes_made": true
   }, 
   104889, 
   null, 
   1112834760.0
  ], 
  [
   104927, 
   null, 
   "trebor", 
   "Guys, have you considered that perhaps Easy Rider is in fact a atheist trying to convince people of the horrors of Christanity? \n \n I've considered running such gags aganist creationists in the past, i don't see why he couldn't be doing a similar act with christainity.\n\n \n \n Apparently, he has been doing this consistantly for years over a variety of different forums. If that is the case, he has been very consistant over many years.\n \n Of course, that is less frightening than him being SERIOUS about it.", 
   {}, 
   104867, 
   null, 
   1112837160.0
  ], 
  [
   104935, 
   null, 
   "Dzeron", 
   "\"You stiffnecked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit!\" - Acts 7:51\n\n \n Hoh, he cannot even come up with his own insults.", 
   {
    "unicode_changes_made": true
   }, 
   104916, 
   null, 
   1112838360.0
  ], 
  [
   104951, 
   null, 
   "Duo_Maxwell", 
   "Let's take a poll.\n \n Is easyrider masquerading as a religious fanatic or is he serious? \n \n I'm not sure. If he's masquerading, he's doing a fantastic job as a religious nutcase. If he's serious, then he IS a a religious nutcase. \n \n I'm not sure how to deal with either case.", 
   {}, 
   104935, 
   null, 
   1112839800.0
  ], 
  [
   104969, 
   null, 
   "zachvac", 
   "I think he's serious (as in he believes what he's typing). I think he really thinks he can convert people with threats and continuous quotes from the bible about hell and punishment. He doesn't realize that I don't give into threats. Especially empty ones.", 
   {}, 
   104951, 
   null, 
   1112842380.0
  ], 
  [
   105206, 
   null, 
   "epaphras_faith", 
   "EF, God gives people different styles of ministries. A ministry of a John the Baptist, telling people to \"Repent, for the axe is laid at the foot of the tree,\" is quite different than that of a Mother Theresa. \n \n Like I've said a hundred times, I prefer people receive Jesus Christ as their Lord and Savior for the remission of their sins. You always tell these folks I just like to talk about hell. Wrong. \n \n But if they don't do it by the time they die, then they are in dire danger of going to hell.\n \n And that's the Gospel truth.\n \n Don't just sugar coat the Word of God EF, give it all to them, because some will come to Christ out of fear of going to hell, and many come to him out of love. You personally are not privy to knowing which is which. How do I know this? From 5 years of preaching the Gospel. \n \n So save your energy and go preach the Gospel your way. I'll do it the way I feel I am called to.\n\n \n Style is not a fruit of the spirit nor is it one of the gifts of the spirit.", 
   {}, 
   104558, 
   null, 
   1112903520.0
  ], 
  [
   105266, 
   null, 
   "Duo_Maxwell", 
   "wait, wait, wait. I just found the gist of this thread. \n \n Would that mean Christians who believe God is Jesus would condemn other Christians who thought Jesus is merely God's son and is NOT God? \n \n emoticon_frazzled emoticon_confused emoticon_wow", 
   {}, 
   105206, 
   null, 
   1112915400.0
  ], 
  [
   105300, 
   null, 
   "epaphras_faith", 
   "The book of Jeremiah is full of threats of destruction if repentance does not come. The children of Israel did not repent and they were scattered.\n \n Judgement is real. Don't get me wrong. But Jesus said \"By this will all men know that you are my disciples, that you love one another\" \n \n He goes on to talk about what that means.\n \n Nowhere does he say \"threaten people.\"\n \n EZ, as a brother in Christ, I am requesting you look at the truth and ask God to humble your heart. The things you post are from a position of superiority not humility.\n \n EF", 
   {}, 
   105266, 
   null, 
   1112923140.0
  ], 
  [
   105302, 
   null, 
   "joebrummer", 
   "The book of Jeremiah is full of threats of destruction if repentance does not come. The children of Israel did not repent and they were scattered.\n \n Judgement is real. Don't get me wrong. But Jesus said \"By this will all men know that you are my disciples, that you love one another\" \n \n He goes on to talk about what that means.\n \n Nowhere does he say \"threaten people.\"\n \n EZ, as a brother in Christ, I am requesting you look at the truth and ask God to humble your heart. The things you post are from a position of superiority not humility.\n \n EF\n\n \n EP,\n you post are always so respectful... Thank you!", 
   {}, 
   105300, 
   null, 
   1112923560.0
  ], 
  [
   105536, 
   null, 
   "epaphras_faith", 
   "EP,\n you post are always so respectful... Thank you!\n\n \n Thanks Joe. I appreciate the encouragement. I wouldn't go so far to say always but I do try hard.\n \n EF", 
   {}, 
   105302, 
   null, 
   1112995800.0
  ], 
  [
   105882, 
   null, 
   "johnhanks", 
   "Guys, have you considered that perhaps Easy Rider is in fact a atheist trying to convince people of the horrors of Christanity? \n\n \n If so, it's an act he has sustained with iron self-control over many years and many forums. I can't tell you how delighted I was to arrive here and find EZ in residence; and he hasn't changed a bit. To be fair, I haven't seen him call anyone a 'crotch-rot harlot' yet; but the message of good ol' christian love and compassion is as compelling as ever.", 
   {}, 
   104867, 
   null, 
   1113127500.0
  ], 
  [
   105883, 
   null, 
   "Orion", 
   "If so, it's an act he has sustained with iron self-control over many years and many forums. I can't tell you how delighted I was to arrive here and find EZ in residence; and he hasn't changed a bit. To be fair, I haven't seen him call anyone a 'crotch-rot harlot' yet; but the message of good ol' christian love and compassion is as compelling as ever.\n\n \n Good to see you here.", 
   {}, 
   105882, 
   null, 
   1113129000.0
  ], 
  [
   105892, 
   null, 
   "Easyrider", 
   "Educating Epaphras Faith\n \n \nNowhere does he say \"threaten people.\" EZ, as a brother in Christ, I am requesting you look at the truth and ask God to humble your heart. The things you post are from a position of superiority not humility.\n\n \n FYI, Jesus and others in the New Testament warned or taught people about hell, etc., time after time, which is what I have done here on occasion. Need some examples?\n \n But except you repent, you shall all likewise perish. Luke 13:5 \n \n Now EF, is that a THREAT, OR A WARNING?\n \n Does Love Speak the Truth on that? Jesus just did!\n \n 2 Thessalonians 1: 8 He will punish those who do not know God and do not obey the gospel of our Lord Jesus. 9 They will be punished with everlasting destruction and shut out from the presence of the Lord and from the majesty of his power \n \n Philippians 3:18 (For many walk, of whom I have told you often, and now tell you even weeping, that they are the enemies of the cross of Christ: 19 Whose end is destruction, whose God is their belly, and whose glory is in their shame, who mind earthly things.)\n \n \"And these shall go away into everlasting punishment: but the righteous into life eternal.\" Matthew 25:46.\n \n Now there's a promise!\n \n Revelation 20:12, 15, And I saw the dead, small and great, stand before God; and the books were opened: and another book was opened, which is the book of life...And whosoever was not found written in the book of life was cast into the lake of fire.\n \n Matthew 10:28, And fear not them which kill the body, but are not able to kill the soul: but rather fear him which is able to destroy both soul and body in hell.\n \n Luke 12:5, But I will tell you whom you should fear: Fear him, who AFTER the killing of the body, has the power to cast you into hell; yes, I warn you, Fear him.\n \n Matthew 18:8, 9 Wherefore if thy hand or thy foot offend thee, cut them off, and cast them from thee: it is better for thee to enter into life halt or maimed, rather than having two hands or feet to be cast into everlasting fire. And if thine eye offend thee, pluck it out, and cast it from thee: it is better for thee to enter into life with one eye, rather than having two eyes to be cast into hell fire. \n \n Matthew 25:46 And these shall go away into EVERLASTING punishment: but the righteous into life eternal.\n \n II Thessalonians 1:9 Who shall be punished with EVERLASTING destruction from the presence of the Lord, and from the glory of his power. \n \n Jude 7, Sodom and Gomorrha...are set forth for an example, suffering the vengeance of eternal fire.\n \n Matthew 22:13, ...Bind him hand and foot, and take him away, and cast him into outer darkness; there shall be weeping and gnashing of teeth. \n \n Matthew 13:41-42, The Son of man (Jesus) shall send forth his angels, and they shall gather out of his kingdom all things that offend, and them which do iniquity; and shall cast them into a furnace of fire: there shall be wailing and gnashing of teeth. \n \n Revelation 21:8, But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death.\n \n Daniel 12:2, And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and EVERLASTING contempt. http://www.jesus-is-lord.com/hellreal.htm \n \n EF, feel free to trade in your arrogance and self-righteous blather evident here for some humility, and then go preach the Gospel and you will be on the right track.", 
   {}, 
   105883, 
   null, 
   1113142620.0
  ], 
  [
   105905, 
   null, 
   "jitobear", 
   "EF, feel free to trade in your arrogance and self-righteous blather evident here for some humility, and then go preach the Gospel and you will be on the right track.\n\n \n He is kind, even-toned, even-tempered, and aware of God's love (not to mention the way people function). He does not deny that there are consequences for those who deny Christ, but he understands you can't come to Christ out of terror.\n \n I have watched you both speak, preach and use the gospel as well as other Bible passages to do it. I have seen him impress and recieve compliments and an ear from those who do not believe. You, do not. People turn from you, and I can't help but wonder if that is what you prefer.\n \n Nobody wishes to be treated unkind. And few people are convinced that way.", 
   {}, 
   105892, 
   null, 
   1113150360.0
  ], 
  [
   105906, 
   null, 
   "johnhanks", 
   "People endow the gods they invent with whatever characters are needed to reinforce and justify the behaviours they approve of. Tyrant-gods of the kind invoked by ez are ideal for reinforcing an intolerant and censorious worldview.", 
   {}, 
   105892, 
   null, 
   1113151080.0
  ], 
  [
   105908, 
   null, 
   "jitobear", 
   "People endow the gods they invent with whatever characters are needed to reinforce and justify the behaviours they approve of. Tyrant-gods of the kind invoked by ez are ideal for reinforcing an intolerant and censorious worldview.\n\n \n Yes - projection. A terribly difficult thing not to do - but I suppose especially difficult in the case of diety who is believed vs. tangible.", 
   {}, 
   105906, 
   null, 
   1113152280.0
  ], 
  [
   105956, 
   null, 
   "Duo_Maxwell", 
   "If so, it's an act he has sustained with iron self-control over many years and many forums. I can't tell you how delighted I was to arrive here and find EZ in residence; and he hasn't changed a bit. To be fair, I haven't seen him call anyone a 'crotch-rot harlot' yet; but the message of good ol' christian love and compassion is as compelling as ever.\n\n \n Yes, the \"if you don't believe, you're going straight to enternal condementation in the fiery pits of Hell?\" \n \n Yes, that's a surefire way to get people to believe!", 
   {}, 
   105882, 
   null, 
   1113165060.0
  ], 
  [
   106044, 
   null, 
   "Easyrider", 
   "Tyrant-gods of the kind invoked by ez are ideal for reinforcing an intolerant and censorious worldview.\n\n \n 1. What Jesus did at the Cross of Calvary to save people from their sins is hardly condusive to the kind of \"tyrant god\" you think I invoke. Think again, John.\n \n 2. The kind of \"god\" you believe in is the kind who endorses wickedness, fornication, gay sex, idolatry, etc., etc., and doesn't hold anyone accountable. Typical of the bleeding heart liberal theology. \n \n p.s. You could use a revival in Britain. The place is a secular sewer which has largely forgotten God.", 
   {}, 
   105906, 
   null, 
   1113193380.0
  ], 
  [
   106050, 
   null, 
   "Orion", 
   "1. What Jesus did at the Cross of Calvary to save people from their sins is hardly condusive to the kind of \"tyrant god\" you think I invoke. Think again, John.\n\n \n Translation: Jesus loves you very much. However, if you don't do exactly as he says, he's going to drop-kick your butt into the Lake-o-Fire, where you'll fry for ever and ever, and maybe even longer.", 
   {}, 
   106044, 
   null, 
   1113194400.0
  ], 
  [
   106054, 
   null, 
   "Duo_Maxwell", 
   "Interesting. Easy obviously paints christanity to be primarily a fear driven religion. \n \n Fear of Hell is the reason he appears to believe.", 
   {}, 
   106050, 
   null, 
   1113195540.0
  ], 
  [
   106070, 
   null, 
   "johnhanks", 
   "1. What Jesus did at the Cross of Calvary to save people from their sins is hardly condusive to the kind of \"tyrant god\" you think I invoke. Think again, John.\n\n \n Hi, EZ. We've had this exchange several times, I think, but what the hell.\n \n Your rabbi Y'shua was executed for sedition - no doubt unjustly, and certainly barbarically. The manner of his death, however, was by no means unique for his time. Later, members of his cult turned this catastrophe into a mumbo-jumbo nonsense whereby god is supposed to have engineered the whole affair, thereby sacrificing himself to himself to allow himself to forgive humankind for a transgression he had led them into in the first place. The proposition makes no more sense now than it did then.\n \n \n\n 2. The kind of \"god\" you believe in is the kind who endorses wickedness, fornication, gay sex, idolatry, etc., etc., and doesn't hold anyone accountable. Typical of the bleeding heart liberal theology.\n\n \n As you are well aware of my atheism, I assume the quotes around 'god' are intended to imply that I have made a 'god' of secularism. This is very weak rhetoric. In the conflation of 'wickedness, fornication, gay sex, idolatry' it is interesting to note the 50% sexual content. Odd how the right-wing fundamentalist's god is a non-sexual being obsessed with genitalia.\n \n \n\n p.s. You could use a revival in Britain. The place is a secular sewer which has largely forgotten God.\n\n \n I wasn't aware you'd been here, EZ. Next time you visit we must meet up.", 
   {}, 
   106044, 
   null, 
   1113207600.0
  ], 
  [
   106250, 
   null, 
   "Easyrider", 
   "Your rabbi Y'shua was executed for sedition...\n\n \n \"I find no fault with this man\" Pontius Pilate\n \n \nLater, members of his cult turned this catastrophe into a mumbo-jumbo nonsense whereby god is supposed to have engineered the whole affair, thereby sacrificing himself to himself to allow himself to forgive humankind for a transgression he had led them into in the first place. The proposition makes no more sense now than it did then.\n\n \n There's simply no credible foundation for that hypothesis - that his disciples engineered all that.\n \n John, you just laid two eggs on the table with no credible evidence to back them up.", 
   {}, 
   106070, 
   null, 
   1113265620.0
  ], 
  [
   106256, 
   null, 
   "Duo_Maxwell", 
   "\n John, you just laid two eggs on the table with no credible evidence to back them up.\n\n \n How is that any different then you? \n \n You haven't been able to provide any credible evidence yourself in any of the arguments. You attack someone for something you do is hypocritical.", 
   {}, 
   106250, 
   null, 
   1113266580.0
  ], 
  [
   106338, 
   null, 
   "Orion", 
   "\"I find no fault with this man\" Pontius Pilate\n\n \n I assume you took this from Luke 23:13-14. The date of this gospel (circa 90 CE) as well as its contents suggest that the author was not an eyewitness to the events he describes. Indeed, he tells us in his prologue that he compiled his gospel from the writings of others. However, the fact that Luke's genealogy of Jesus conflicts with that given to us by Matthew should tell you something. They can't both be correct. Apologists have attempted to get around this by claiming that, whereas Matthew's genealogy of Jesus runs through Joseph, Luke's genealogy of Jesus runs through Mary. This, despite the fact that Luke's account mentions Jesus' father Joseph, but not Mary. Luke traces Jesus' genealogy through Joseph. \n \n \nThere's simply no credible foundation for that hypothesis - that his disciples engineered all that.\n\n \n And what is your evidence to the contrary, EZ? The conflicting accounts given to us by non-eyewitness followers of the Jesus cult written decades after the fact? I thus introduce you to the idea of probability based upon historical study. You're not going to like this, but I hope that you'll at least consider it. Jesus was executed by the Romans (not the Jews) by virtue of the likelihood that the Romans considered Jesus to be both a troublemaker (temple incident on the eve of Passover) and seditionist (\"King of the Jews\"). A king was expected to liberate his people from foreign occupation. Am I going too fast for you? \n \n Thus, Pilate probably ordered one of his officers to get rid of Jesus in an expedient manner. There would have been no trial, given that Jesus was considered to be a nobody, lacking power, influence, or wealth. Thus, death by crucifixion. Following this, Jesus' body was probably thrown into a garbage dump, to be consumed by birds and dogs. This was part of the punishment inflicted by the Romans, denying the body a proper burial. Thus, in all probability, no tomb. Thus, no bodily resurrection of Jesus from a tomb. Thus, no bodily ascension of Jesus into the sky toward heaven.\n \n In all probability, Jesus's followers attempted to make sense of all this, and wove a story around it as justification for Jesus' untimely and humiliating death. And you've obviously bought into it. \n \n EZ, if you're going to attempt to defend the literalness of these gospel accounts, I suggest that you have your work cut out for you. You're going to have to defend, for example, NT accounts of demonic possession as a cause of disease, an account of a solar eclipse at Jesus' death (during a full moon!), Matthew's description of dead folks getting out of their graves at the time of Jesus' death, as well as various NT prophecies concerning Jesus' imminent second coming...\n \n Hebrews 10:37 - For in just a very little while, He who is coming will come and will not delay. \n \n James 5:7-9 - Be patient, then, brothers, until the Lord's coming. . . You too, be patient and stand firm, because the Lord's coming is near. \n \n 1 Peter 1:20 - He was chosen before the creation of the world, but was revealed in these last times for your sake. \n \n 1 Peter 4:7 - The end of all things is near. \n \n Rev. 22:20 - Surely I come quickly.", 
   {}, 
   106250, 
   null, 
   1113289860.0
  ], 
  [
   106348, 
   null, 
   "johnhanks", 
   "John, you just laid two eggs on the table with no credible evidence to back them up.\n\n \n I note that you avoided dealing with the issue of whether the 'Jesus-died-that-we-may-be-forgiven' theory actually makes any sense. I repeat: it does not. If I have to choose between its actuality, and the alternative explanation that it is some cultists' desperate rationalisation of their leader's ignominious death, I will go for the latter. (Before anyone points it out, I am aware of the fallacy of false dichotomy, and acknowledge that other explanations are possible.)\n \n As Orion has already pointed out, quoting Luke on what Pilate may or may not have said is futile. The author of Luke wasn't there, nor in all probability even alive at the time.", 
   {}, 
   106250, 
   null, 
   1113294780.0
  ], 
  [
   106349, 
   null, 
   "epaphras_faith", 
   " Educating Epaphras Faith\n \n \n \n FYI, Jesus and others in the New Testament warned or taught people about hell, etc., time after time, which is what I have done here on occasion. Need some examples?\n \n But except you repent, you shall all likewise perish. Luke 13:5 \n\n \n Allow me to add context so that people can see what is really being said and see the deciever that you are. Luke 13:4-5 says this (it is all one sentence by the way): Or do you suppose that those 18 on whom the tower in siloam fell and killed them were worse culprits than the men who lived in Jerusalem? I tell you, no, but unless you repent you will likewise perish.\" Jesus is not talking about hell he is talking about Physical death. He gave a similar story concerning some galileans in Luke 13:2-3.\n \n So if you are going to educate me I do wish you would not lie about what Jesus is saying by intentionally leaving out what is obviously there. You \"conveniently\" left out the part about others perishing and this being an answer to a question about physical death. Do not use the scriptures to your own end. Jesus did get angry at a few groups of people. The pharisees, the sadducees, and the money changers in the temple. Not because of their great sin, but because of how they, the religious leaders (read that EasyRider), were falsely representing God.\n \n \nNow EF, is that a THREAT, OR A WARNING?\n \n Does Love Speak the Truth on that? Jesus just did!\n \n 2 Thessalonians 1: 8 He will punish those who do not know God and do not obey the gospel of our Lord Jesus. 9 They will be punished with everlasting destruction and shut out from the presence of the Lord and from the majesty of his power .\n\n \n \nPhilippians 3:18 (For many walk, of whom I have told you often, and now tell you even weeping, that they are the enemies of the cross of Christ: 19 Whose end is destruction, whose God is their belly, and whose glory is in their shame, who mind earthly things.).\n\n \n This verse legitimately speaks of ultimate destruction. But it also is not a teaching to non believers. Paul is writing to the thessalonians who were undergoing a persecution at the time. It is writtent to BELIEVERS and intended to encourage them not to \"threaten\" others with their own destruction. Ultimate destruction is a reality. That has never been denied. What is wrong, yes wrong, is that you threaten people with what God does not threaten them. This does not happen in this scripture, no threat, instead we see the heart of Christ and Paul to encourage others to know that God is just and will do right by the persecutions suffered. Again you take the scripture out of context and make it fit your own twisted and warped sense of right and wrong. I have been patient and appealed to you as a brother, one who also knows christ, as I believe that is appropriate.\n \n \n\"And these shall go away into everlasting punishment: but the righteous into life eternal.\" Matthew 25:46..\n\n \n Again, out of context. He is Speaking to His disciples. They are believers. He is not speaking as a warning but simply stating what is true and instructing His disciples on the things to come. Once again you have chosen to misrepresent God.\n \n Just so you know, none of what you quoted was Jesus or Paul or anyone else threatening anyone with ultimate destruction. They certainly teach of Hell. Never does Jesus warn anyone that they will be going there if they don't shape up.\n \n You see, the grace of God is what makes us able to shape up. If we have to shape up in order to be acceptable then we cannot possibly and are all doomed.\n \n By the way, telling someone they are headed for hell is, by definition, judgement. \n \n Romans 2:1-2 \"Therefore, you are without excuse, every man of you who passes judgement, for in that you judge another, you condemn yourself; for you who judge practices the same things. And we know that the judgement of God rightly falls upon those who practice such things.\"\n \n I would encourage you to continue reading the book of Romans until you discover the grace of God. I do not judge you, for only God can do that, although I have know doubt you will feel and act judged. I simply tell you that I will no longer accept your rantings and will fight you as you misrepresent God and Jesus. \n \n EF", 
   {}, 
   105892, 
   null, 
   1113295080.0
  ], 
  [
   106473, 
   null, 
   "Ladywolf", 
   "Sure, go ahead and ignore them....\n \n Good suggestion...I will ignore them.\n \n \"He who denies me before men, him will I deny before the Father.\" Jesus Christ \n \n Christ is not G-d or the messia, he is dead like any other man that died on the cross. I do not believe in Christ and never ever will.\n \n Just remember the price you will eventually pay for that if you continue to reject Christ's salvation.\n\n \n You are the one that will have trouble after you pass on. G-d does not idol worshipers, nor does G-d approve of any G-d but him.", 
   {
    "post_info": {
     "post_title": "Damned to Hell"
    }
   }, 
   103044, 
   null, 
   1113342660.0
  ], 
  [
   106550, 
   null, 
   "Easyrider", 
   "You are the one that will have trouble after you pass on.\n\n \n Sorry, but I've ALREADY crossed over to eternal life through faith in Jesus Christ (John 5:24, Ephesians 2:8-9, etc.).\n \n \n \nG-d does not idol worshipers, nor does G-d approve of any G-d but him.\n\n \n Interesting. Now, which God are you talking about? The God-child promised in Isaiah 9:6-7? Or maybe the descendant of King David who would arise who would be called, 'THE LORD (JEHOVAH) OUR RIGHTEOUSNESS' in Jeremiah 23:5-6, i.e.\n \n THE HEBREW SCRIPTURES\n \n \"Behold, the days are coming,\" says the LORD, \"That I will raise to David a Branch of righteousness; a King shall reign and prosper, and execute judgement and righteousness in the earth. In His days Judah will be saved, and Israel will dwell safely; now this is His name by which He will be called: THE LORD OUR RIGHTEOUSNESS.\" (Jeremiah 23:5-6 )\n \n THE RABBINIC WRITINGS\n \n Behold the days come, saith the Lord, that I will raise up to David the MESSIAH, who is righteous, and he will reign a King, and shall prosper, and execute the judgement of truth and justice in the earth. (Targum Jonathan)\n \n And they shall worship before the Lord their God, and they shall hearken to MESSIAH, the Son Of David, their King, whom I will raise up unto them.(Targum Jonathan on Jeremiah 30:9,21)\n \n THE NEW TESTAMENT\n \n The book of the genealogy of Jesus the Messiah, the Son of David, the Son of Abraham: (Matthew 1:1)\n \n Then the multitudes who went before and those who followed cried out, saying: \"Hosanna to the Son of David! Blessed is He who comes in the name of the LORD! Hosanna in the highest!\" (Matthew 21:9)\n \n From this man's [David's] seed, according to the promise, God raised up for Israel a Saviour -- Jesus. (Acts 13:23) - messiahpages.com\n \n Jesus is Risen!!\n \n God bless!", 
   {
    "unicode_changes_made": true
   }, 
   106473, 
   null, 
   1113353760.0
  ], 
  [
   106570, 
   null, 
   "trebor", 
   "Sorry, but I've ALREADY crossed over to eternal life through faith in Jesus Christ (John 5:24, Ephesians 2:8-9, etc.).\n \n \n \n \n Interesting. Now, which God are you talking about? The God-child promised in Isaiah 9:6-7? Or maybe the descendant of King David who would arise who would be called, 'THE LORD (JEHOVAH) OUR RIGHTEOUSNESS' in Jeremiah 23:5-6, i.e.\n \n THE HEBREW SCRIPTURES\n \n \"Behold, the days are coming,\" says the LORD, \"That I will raise to David a Branch of righteousness; a King shall reign and prosper, and execute judgement and righteousness in the earth. In His days Judah will be saved, and Israel will dwell safely; now this is His name by which He will be called: THE LORD OUR RIGHTEOUSNESS.\" (Jeremiah 23:5-6 )\n \n THE RABBINIC WRITINGS\n \n Behold the days come, saith the Lord, that I will raise up to David the MESSIAH, who is righteous, and he will reign a King, and shall prosper, and execute the judgement of truth and justice in the earth. (Targum Jonathan)\n \n And they shall worship before the Lord their God, and they shall hearken to MESSIAH, the Son Of David, their King, whom I will raise up unto them.(Targum Jonathan on Jeremiah 30:9,21)\n \n THE NEW TESTAMENT\n \n The book of the genealogy of Jesus the Messiah, the Son of David, the Son of Abraham: (Matthew 1:1)\n \n Then the multitudes who went before and those who followed cried out, saying: \"Hosanna to the Son of David! Blessed is He who comes in the name of the LORD! Hosanna in the highest!\" (Matthew 21:9)\n \n From this man's [David's] seed, according to the promise, God raised up for Israel a Saviour -- Jesus. (Acts 13:23) - messiahpages.com\n \n Jesus is Risen!!\n \n God bless!\n\n \n Out of context quotes, lies, and myths do not mean anything. If you look at the lineages in both Luke and in Matthew, neither of those two contradictory lineages would qualify for being of the Seed of David out of solomon. \n \n And Jesus is dead. He didn't rise. And he is not coming back.", 
   {
    "unicode_changes_made": true
   }, 
   106550, 
   null, 
   1113357420.0
  ], 
  [
   106580, 
   null, 
   "Easyrider", 
   "Liar, liar, pants on fire!", 
   {}, 
   106570, 
   null, 
   1113359820.0
  ], 
  [
   106583, 
   null, 
   "trebor", 
   "Liar, liar, pants on fire!\n\n \n \n Prove it then.\n \n Have Jesus return for me, oh, within my life time.", 
   {}, 
   106580, 
   null, 
   1113360720.0
  ], 
  [
   106585, 
   null, 
   "Easyrider", 
   "It is written: \"Thou shalt not put the Lord thy God to the test.\"", 
   {}, 
   106583, 
   null, 
   1113361020.0
  ], 
  [
   106633, 
   null, 
   "trebor", 
   "It is written: \"Thou shalt not put the Lord thy God to the test.\"\n\n \n \n So saith someone who knows that if a test was made, the Lord would be found to be a fantasy.", 
   {}, 
   106585, 
   null, 
   1113398940.0
  ], 
  [
   106659, 
   null, 
   "johnhanks", 
   "It is written: \"Thou shalt not put the Lord thy God to the test.\"\n\n \n Well, if I were peddling snake-oil I wouldn't let people test it before buying either.", 
   {}, 
   106585, 
   null, 
   1113406260.0
  ], 
  [
   106860, 
   null, 
   "epaphras_faith", 
   "Out of context quotes, lies, and myths do not mean anything. If you look at the lineages in both Luke and in Matthew, neither of those two contradictory lineages would qualify for being of the Seed of David out of solomon. \n \n And Jesus is dead. He didn't rise. And he is not coming back.\n\n \n I rarely agree with EZ but........... His quotes are not out of context. Your comments about myths are ad hominem. The lineages are not contradictory, they simply emphasize different people as they are not complete lineages naming every individual. That was never done in jewish geneologies. The scripture clearly marks Jesus as a son of david. It is all over.\n \n As for the risen savior, that is a matter of faith and your demand for proof is as illogical as me demanding you prove he didn't rise.\n \n EF", 
   {}, 
   106570, 
   null, 
   1113430260.0
  ], 
  [
   107013, 
   null, 
   "trebor", 
   "I rarely agree with EZ but........... His quotes are not out of context. Your comments about myths are ad hominem. The lineages are not contradictory, they simply emphasize different people as they are not complete lineages naming every individual. That was never done in jewish geneologies. The scripture clearly marks Jesus as a son of david. It is all over.\n \n As for the risen savior, that is a matter of faith and your demand for proof is as illogical as me demanding you prove he didn't rise.\n \n EF\n\n \n \n Right. Huh uh? Have you ever seen people rise from the dead? I haven't seen any. How can you trust a bunch of books written 40 years after the fact that is alleged to have happened from a group of unsophistocated people?? It sounds to me that the basic claim is rather unbelieveable, and you need more than just some books to show it happened.\n \n As for 'Jesus' being of the line of David.. well, you have two people claiming that. Their geneologies disagree. Not only that, but the lineage is Matthew is from a line that was NOT through solomon, and therefore, according to Jewish expections, is eliminated as being of the seed of David.\n \n Plus, both lineages go through the line of Joseph. Guess what. According to those self same gospels, Joseph was not Jesus's father. The term 'SEED OF DAVID' means the direct male line from david through Solomon. If Joseph was not Jesus's father, then, he would not be from the seed of david. The contradictions of Christian belief rolled up in the whole virgin birth/messiah issue make it totally unbelievable...\n \n Jesus was not god. If he existed at all, he is dead, and gone. As far as I can see, you can't demonstrate that he is coming back.", 
   {}, 
   106860, 
   null, 
   1113453180.0
  ], 
  [
   107519, 
   null, 
   "Easyrider", 
   "Educating Trebor\n \n \nAs for 'Jesus' being of the line of David.. well, you have two people claiming that. Their geneologies disagree. Not only that, but the lineage is Matthew is from a line that was NOT through solomon, and therefore, according to Jewish expections, is eliminated as being of the seed of David.....\n\n \n Time for you to study up, Trebor, so you won't look so foolish:\n \n Jesus Genealogy http://www.westarkchurchofchrist.org/library/genealogy.htm\n \n Jesus Genealogy http://www.arabicbible.com/islam/answers.htm\n \n The Messianic Line http://www.messiahrevealed.org/genealogy.html\n \n Get some new material, Trebor. You keep stricking out....", 
   {}, 
   107013, 
   null, 
   1113525060.0
  ], 
  [
   107520, 
   null, 
   "epaphras_faith", 
   "Right. Huh uh? Have you ever seen people rise from the dead? I haven't seen any. How can you trust a bunch of books written 40 years after the fact that is alleged to have happened from a group of unsophistocated people?? It sounds to me that the basic claim is rather unbelieveable, and you need more than just some books to show it happened.\n \n As for 'Jesus' being of the line of David.. well, you have two people claiming that. Their geneologies disagree. Not only that, but the lineage is Matthew is from a line that was NOT through solomon, and therefore, according to Jewish expections, is eliminated as being of the seed of David.\n \n Plus, both lineages go through the line of Joseph. Guess what. According to those self same gospels, Joseph was not Jesus's father. The term 'SEED OF DAVID' means the direct male line from david through Solomon. If Joseph was not Jesus's father, then, he would not be from the seed of david. The contradictions of Christian belief rolled up in the whole virgin birth/messiah issue make it totally unbelievable...\n \n Jesus was not god. If he existed at all, he is dead, and gone. As far as I can see, you can't demonstrate that he is coming back.\n\n \n There is definite debate on the geneologies. I would not call what you say as fact. I would not say it is unbelievable. The evidence has been discussed in many other threads and one could not say it is a myth as this assumes facts not in evidence (given that it is debatable, which it is evidenced by the fact that it has been debated).\n \n As for Jesus raising from the dead, it is a matter of faith. I may not be able to prove he is coming back, but neither can you prove he is not.\n \n Leave it as faith and quit trying to force proof. \n \n EF", 
   {}, 
   107013, 
   null, 
   1113525180.0
  ], 
  [
   107617, 
   null, 
   "Orion", 
   "There is definite debate on the geneologies\n\n \n I wouldn't call it a debate. The issue is pretty much settled. The two genealogies of Jesus, given to us by both Matthew and Luke, cannot be reconciled. The only conclusion we can draw is that one, the other, or both, are incorrect. This should come as no surprize, so long as you approach the gospels as the works of non-eyewitnesses written long after the events which they attempt to describe. \n \n The key, I think, is to try and get beyond the trivia/hype/midrash (virgin birth, miracles, bodily resurrection, bodily ascension stuff) and to try and understand what Jesus of Nazareth actually said. That's really the bottom line, is it not? But that's easier said than done, given that we don't really know what Jesus said as opposed to words attributed to him by his later followers. For example, I find it difficult to accept as valid the long, rambling discourses which the author of John attributes to Jesus. Add to this the fact that one can discern an evolution of Christology from Paul to John, and you begin to see the problem. \n \n \nAs for Jesus raising from the dead, it is a matter of faith.\n\n \n Faith? Sure, you can certainly fall back on that. And no one can argue with you.", 
   {}, 
   107520, 
   null, 
   1113548820.0
  ], 
  [
   107628, 
   null, 
   "johnhanks", 
   "As for Jesus raising from the dead, it is a matter of faith. I may not be able to prove he is coming back, but neither can you prove he is not.EF\n\n In principle, proving a negative is impossible. I do not believe there are fairies at the bottom of my garden, but cannot ever prove their non-existence. In any case, if we are to talk of 'proof', it is for the supporter of an extraordinary claim to provide the evidence, not its opponents. But, of course, you are right to say:\n \n \nLeave it as faith and quit trying to force proof.\n\n As orion has said, faith is immune to argument, which raises the prickly question of why atheists like myself argue on religion forums. To argue against someone's personal faith-based convictions purely because you don't share them is at best futile, at worst impudent. For me, the motivation is that so many of the faithful insist that their faith should also set the ground-rules for my life - assuming proprietorship, for example, of what I should be allowed to view on television, how I should run my sex life, or what I should teach my students about the origin of species. From what I have read so far, EF, you do not appear to be in this camp, so I wish you joy of your faith.\n \n JH", 
   {}, 
   107520, 
   null, 
   1113552000.0
  ], 
  [
   107694, 
   null, 
   "epaphras_faith", 
   "In principle, proving a negative is impossible. I do not believe there are fairies at the bottom of my garden, but cannot ever prove their non-existence. In any case, if we are to talk of 'proof', it is for the supporter of an extraordinary claim to provide the evidence, not its opponents. But, of course, you are right to say:\n \n \n As orion has said, faith is immune to argument, which raises the prickly question of why atheists like myself argue on religion forums. To argue against someone's personal faith-based convictions purely because you don't share them is at best futile, at worst impudent. For me, the motivation is that so many of the faithful insist that their faith should also set the ground-rules for my life - assuming proprietorship, for example, of what I should be allowed to view on television, how I should run my sex life, or what I should teach my students about the origin of species. From what I have read so far, EF, you do not appear to be in this camp, so I wish you joy of your faith.\n \n JH\n\n \n I appreciate that. I do have some opinions on what should be taught about the origin of the species. However, it is more along the lines of showing the students the evidence and saying this is what the current thought is on the evidence, but there are detractors. I have a problem when theories are taught as fact. Beyond that........how you teach is up to you. I expect you to be integrous to the data, whatever it may say, even if I differ with it.\n \n EF", 
   {}, 
   107628, 
   null, 
   1113585540.0
  ], 
  [
   107729, 
   null, 
   "trebor", 
   "I appreciate that. I do have some opinions on what should be taught about the origin of the species. However, it is more along the lines of showing the students the evidence and saying this is what the current thought is on the evidence, but there are detractors. I have a problem when theories are taught as fact. Beyond that........how you teach is up to you. I expect you to be integrous to the data, whatever it may say, even if I differ with it.\n \n EF\n\n \n Do you know the difference between a theory and a fact? What is the scientific theory of evolution? Did you know that evolution is both a theory and a fact? Life changes over time, that is observed Why and how it changes is what the Theory of evolution addresses.\n \n Same thing for gravity. Gravity happens. How and why it happens is what the theory of gravity addresses. Or is that getting to heavy for you?", 
   {}, 
   107694, 
   null, 
   1113589560.0
  ], 
  [
   107908, 
   null, 
   "Easyrider", 
   "The issue is pretty much settled. The two genealogies of Jesus, given to us by both Matthew and Luke, cannot be reconciled.\n\n \n Hogwash.\n \n Time for you to study up too, Orion:\n \n Jesus Genealogy  \n \n http://www.westarkchurchofchrist.or...y/genealogy.htm\n \n Jesus Genealogy \n \n http://www.arabicbible.com/islam/answers.htm\n \n The Messianic Line  \n \n http://www.messiahrevealed.org/genealogy.html\n \n Also, since you make the same tired old charge at least 2-3 times a year that the resurrection accounts can't be harmonized, you will need to reacquaint yourself with the following, which makes you out to be either a liar or someone who is unable or unwilling to learn.\n \n Harmony of the Resurrection\n \n http://www.new-life.net/resurrct.htm\n \n Harmony of the Resurrection\n \n http://answeringislam.org/Andy/Resurrection/harmony.html\n \n Harmony of the Resurrection\n \n http://thebereans.net/arm-resurr2.shtml", 
   {}, 
   107729, 
   null, 
   1113613080.0
  ], 
  [
   107928, 
   null, 
   "Orion", 
   "Hogwash. Time for you to study up too, Orion:\n\n \n EZ, when you've learned to discuss, when you've learned to present your own arguments in your own words, I'll pay attention.", 
   {}, 
   107908, 
   null, 
   1113621000.0
  ], 
  [
   107959, 
   null, 
   "Mach", 
   "I appreciate that. I do have some opinions on what should be taught about the origin of the species. However, it is more along the lines of showing the students the evidence and saying this is what the current thought is on the evidence, but there are detractors. I have a problem when theories are taught as fact. Beyond that........how you teach is up to you. I expect you to be integrous to the data, whatever it may say, even if I differ with it.\n \n EF\n\n \n You should tackle this issue of scientific \"theory\" it will help expand your knowledge of philosophy, science, and how they relate to reality, I know you'll appreciate it.\n \n Your concept of \"there are detractors\" can be said about all knowledge, it's called skepticism. Because it's generally possible to deny everything except one's own existence, all knowledge can be denied except one's own existence, thus, discussing \"decrators\" is irrelevant and meaningless.\n \n Evolution is a fact.\n Human life (matter) arising form other matter, is a fact.\n \n I'm not sure what you think a \"theory\" is. A theory is the truth, in your definition. It corresponds to reality, this correspondance is achived through observation of evidence, and assimilation of such evidence in the logical hierarchy of other truths. Like all truths, it is falsifable.\n \n The fact of evolution is no different than any other truth, it's only religion that compels people en masse to declare otherwise, for the wrong reasons.\n \n Remember, religion is not subject to reason, it's mutually exclusive. Faith requires no correspondance to anything, it's not falsifable, it's not true or false, it's dogmatic. Huge difference.\n \n -Mach", 
   {}, 
   107694, 
   null, 
   1113636660.0
  ], 
  [
   107967, 
   null, 
   "johnhanks", 
   "I do have some opinions on what should be taught about the origin of the species. However, it is more along the lines of showing the students the evidence and saying this is what the current thought is on the evidence, but there are detractors.\n\n Within professional biology, there is hardly anyone who disputes that species arise by a process of evolution. There is, of course, dispute about the detail of the mechanism, and these conflicting ideas are discussed to the extent that time allows. If by 'detractors' you mean non-biologists with religious motives, I have no intention whatsoever of offering their views as though they were some valid alternative. Science lessons should be about science.\n \n \nI have a problem when theories are taught as fact. Beyond that........how you teach is up to you. I expect you to be integrous to the data, whatever it may say, even if I differ with it.\n\n Those who agitate for science teachers to put 'theory, not fact' warning labels on certain topics do not, as a rule, understand what a scientific theory actually is. Virtually everything that is taught as the working foundation of science is actually theory: atomic structure, the model of the solar system, the nature of electromagnetic radiation - all theories. However, they are all backed up by such mountains of experimental and observational evidence, and are so powerful in their predictive capabilities, that to keep warning students 'Remember - this is theory!' would be a pointless distraction. The theory of evolution rests on an equally impressive bedrock of evidence, and is an equally powerful predictive tool. Why should it be singled out among scientific theories as the one to carry a health warning?", 
   {}, 
   107694, 
   null, 
   1113642900.0
  ], 
  [
   108073, 
   null, 
   "Easyrider", 
   "John,\n \n You and Orion & Company STILL can't even name the specific direct-line hominid that man allegedly \"evolved\" from. When you guys can identify that one you get to go on to square two.", 
   {}, 
   107967, 
   null, 
   1113705360.0
  ], 
  [
   108079, 
   null, 
   "Dzeron", 
   "John,\n \n You and Orion & Company STILL can't even name the specific direct-line hominid that man allegedly \"evolved\" from. When you guys can identify that one you get to go on to square two.\n\n \n Homo erectus?", 
   {}, 
   108073, 
   null, 
   1113707400.0
  ], 
  [
   108081, 
   null, 
   "Orion", 
   "John,\n \n You and Orion & Company STILL can't even name the specific direct-line hominid that man allegedly \"evolved\" from. When you guys can identify that one you get to go on to square two.\n\n \n Still attempting to peddle this one, are you?\n \n You can find this information for yourself, EZ. That's the best way to learn. Bring up Google and do a search on human origins. That should keep you busy for a couple of days. Oh, and, avoid those Christian fundie websites, especially the ones that declare evolution to be \"Satan's lie\".", 
   {}, 
   108073, 
   null, 
   1113707880.0
  ], 
  [
   108115, 
   null, 
   "johnhanks", 
   "John,\n \n You and Orion & Company STILL can't even name the specific direct-line hominid that man allegedly \"evolved\" from. When you guys can identify that one you get to go on to square two.\n\n \n Well, I see you have at last learned not to use the term 'missing link'. Fingers burned too many times, eh?\n \n Which 'one' ancestral hominid do you want? Modern humans are the one surviving tip of one twig of a branching bush of hominid evolution. There's good reason to believe that H. habilis and H. erectus were located on branches leading to that twig. (Remember that in their day they were twig-tips too.) And there's a huge abundance of fragments from elsewhere on the bush.\n \n Take orion's advice and do a little googling. You can then argue from an informed perspective.", 
   {}, 
   108073, 
   null, 
   1113727440.0
  ], 
  [
   108121, 
   null, 
   "Orion", 
   "There's good reason to believe that H. habilis and H. erectus were located on branches leading to that twig.\n\n \n What? You dare link us with Homo erectus, so named for its disgusting habits?", 
   {}, 
   108115, 
   null, 
   1113741300.0
  ], 
  [
   108220, 
   null, 
   "Easyrider", 
   "Which 'one' ancestral hominid do you want? Modern humans are the one surviving tip of one twig of a branching bush of hominid evolution. There's good reason to believe that H. habilis and H. erectus were located on branches leading to that twig. (Remember that in their day they were twig-tips too.) And there's a huge abundance of fragments from elsewhere on the bush.\n\n \n Mere inference. You've got zero conclusive DNA evidence for that squirrel hunt.\n \n \nTake orion's advice and do a little googling. You can then argue from an informed perspective.\n\n \n What does Orion know? He can't even tell us who his so-called \"divine god\" is, or where he / she/ it lives, or if it had anything to do with creating the earth and mankind.", 
   {}, 
   108121, 
   null, 
   1113767280.0
  ], 
  [
   108240, 
   null, 
   "Orion", 
   "Mere inference. You've got zero conclusive DNA evidence for that squirrel hunt.\n\n \n What do you know about DNA other than the fact that you've learned to spell it? What do you know about the process of fossilization? \n \n \nWhat does Orion know? He can't even tell us who his so-called \"divine god\" is, or where he / she/ it lives, or if it had anything to do with creating the earth and mankind.\n\n \n Clearly, John and I know a lot more about evolution than do you. It's obvious that you can't discuss the subject intelligently and that you have no interest whatsoever in studying it.", 
   {}, 
   108220, 
   null, 
   1113770460.0
  ], 
  [
   108247, 
   null, 
   "Easyrider", 
   "Orion, you can't pretend to play smart here. You can't even tell us who your so-called \"divine god\" is, or where he / she/ it lives, or if it had anything to do with creating the earth and mankind.", 
   {}, 
   108240, 
   null, 
   1113772920.0
  ], 
  [
   108258, 
   null, 
   "Duo_Maxwell", 
   "Orion, you can't pretend to play smart here. You can't even tell us who your so-called \"divine god\" is, or where he / she/ it lives, or if it had anything to do with creating the earth and mankind.\n\n \n And if Orion does not have such a God? \n \n It it amazing how little you know of evolution. \n \n Even if we cannot prove how exactly humans evolved, we can prove other species, such as the horse, which has one of the most complete fossil records. \n http://www.talkorigins.org/faqs/horses/horse_evol.html\n \n If you do not read the link and contiune spouting lies, you are guilty of fraud, specifically argument via laziness", 
   {}, 
   108247, 
   null, 
   1113774720.0
  ], 
  [
   108262, 
   null, 
   "Orion", 
   "You can't even tell us who your so-called \"divine god\" is, or where he / she/ it lives, or if it had anything to do with creating the earth and mankind.\n\n \n Perhaps because I enjoy watching you stew in your frustration?\n \n Actually, given that you're here to evangelize and I'm not, I'd much rather discuss your god.\n \n So, care to tell us again about your belief in demonic possession? You know, Ez, the Bible says that Jesus cast out demons and instructed his followers to do likewise. He also said that his followers could drink poison without fear of harm. Any thoughts on that?", 
   {}, 
   108247, 
   null, 
   1113775020.0
  ], 
  [
   108299, 
   null, 
   "Easyrider", 
   "Let's be real clear on this, Orion. You won't say who your so-called god is because, apart from your \"feel-good-anything-goes\" theology, you can't document it, much less survive the vetting process with a straight face.", 
   {}, 
   108262, 
   null, 
   1113781500.0
  ], 
  [
   108301, 
   null, 
   "Easyrider", 
   "And if Orion does not have such a God?\n\n \n He's said in the past he believes in a divine being, but he is unable to substantiate who it is, where it lives, or anything about it other than it approves of gay sex. \n \n \nIt it amazing how little you know of evolution.\n\n \n Tell me more about the Neanderthal \"Man\"? You know, the hominid slug that was up there on your high school and college charts in the classrooms as evidence of man's evolutionary heritage. Come to find out the DNA doesn't match. Of course you knew that, right, Einstein? Now, after all the rocks you've looked under, you can't even name man's direct-line ancestor. At least I know who the Creator is.", 
   {}, 
   108299, 
   null, 
   1113781920.0
  ], 
  [
   108336, 
   null, 
   "Duo_Maxwell", 
   "He's said in the past he believes in a divine being, but he is unable to substantiate who it is, where it lives, or anything about it other than it approves of gay sex.\n\n \n Who? Since when were in the business of declaring things about God? Lives, if I recall, a god is neither dead nor alive and therefore cannot \"live\" anywhere. As for gay sex, what the **** does a ominpotent being care? \n \n \n\n Tell me more about the Neanderthal \"Man\"? You know, the hominid slug that was up there on your high school and college charts in the classrooms as evidence of man's evolutionary heritage. Come to find out the DNA doesn't match. Of course you knew that, right, Einstein? Now, after all the rocks you've looked under, you can't even name man's direct-line ancestor. At least I know who the Creator is.\n\n \n I'm sorry, I don't speak the langage of garbage. You'll need to translate for me into english. Hominid slug? That doesn't make any sense. Slug is a not even a mammal. The DNA doesn't match? Can you prove this? The DNA isn't going to match perfectly. It shouldn't. Evolutionarly theory even states it should not given mutations and recombination. Any claim that it should and therefore if it doesn't make evolution false is a sign that the posters is clearly ignorant of the theory. You don't know who the creator is, or if there even is a creator, you have faith, nothing more.", 
   {}, 
   108301, 
   null, 
   1113789960.0
  ], 
  [
   108384, 
   null, 
   "Dzeron", 
   "He's said in the past he believes in a divine being, but he is unable to substantiate who it is, where it lives, or anything about it other than it approves of gay sex. \n\n \n When has he said this? In what context? Perhaps that should shed light on the issue.", 
   {}, 
   108301, 
   null, 
   1113795720.0
  ], 
  [
   108389, 
   null, 
   "Orion", 
   "The DNA isn't going to match perfectly. It shouldn't. Evolutionarly theory even states it should not given mutations and recombination. Any claim that it should and therefore if it doesn't make evolution false is a sign that the posters is clearly ignorant of the theory.\n\n \n I believe that what Ez is referring to is a paper published in one of the science journals a couple of years ago. It described the finding of the remains of a Neanderthal in a cave somewhere in northern Europe. Conditions within the cave were excellent for preservation, and a sample was taken for DNA analysis. Subsequent analysis suggested that Neanderthal was not likely to have been an ancestor of Homo sapiens (as previously thought by some) but that the two were probably evolutionary cousins.\n \n Ez touts this as a failure of evolutionary theory. Exactly how he reached that conclusion is beyond me. Evolutionary theory is not diminished one whit by these findings. But what he fails to recognize is that science is a self-correcting discipline and that it is receptive to new evidence.", 
   {}, 
   108336, 
   null, 
   1113796680.0
  ], 
  [
   108397, 
   null, 
   "Duo_Maxwell", 
   "I believe that ... evolutionary cousins.\n\n \n Then easy is just ignorant and uniformed. Neanderthal have already been proven not to be part of the ancestors of homo sapien for quite some time.", 
   {}, 
   108389, 
   null, 
   1113799620.0
  ], 
  [
   108502, 
   null, 
   "johnhanks", 
   "Mere inference. You've got zero conclusive DNA evidence for that squirrel hunt.\n\n \n Ah, good old deja vu. Tell, you what, ez: you describe in detail what you would regard as 'conclusive DNA evidence', and we'll discuss that.\n \n To put it another way: if 98% DNA overlap with chimps isn't evidence of common descent, what would be?", 
   {}, 
   108220, 
   null, 
   1113823260.0
  ], 
  [
   108635, 
   null, 
   "sinjin", 
   "...if 98% DNA overlap with chimps isn't evidence of common descent, what would be?\n\n \n My thoughts exactly. We have a pretty good handle on the orangutan/gorilla/chimp branches of the tree and a time frame.", 
   {}, 
   108502, 
   null, 
   1113844560.0
  ], 
  [
   108642, 
   null, 
   "trebor", 
   "Ah, good old deja vu. Tell, you what, ez: you describe in detail what you would regard as 'conclusive DNA evidence', and we'll discuss that.\n \n To put it another way: if 98% DNA overlap with chimps isn't evidence of common descent, what would be?\n\n \n For the bible to say so, of course.", 
   {}, 
   108502, 
   null, 
   1113845520.0
  ], 
  [
   108810, 
   null, 
   "Duo_Maxwell", 
   "Ah, good old deja vu. Tell, you what, ez: you describe in detail what you would regard as 'conclusive DNA evidence', and we'll discuss that.\n \n To put it another way: if 98% DNA overlap with chimps isn't evidence of common descent, what would be?\n\n \n I believe Easy rider wants a 100% match. LOL. \n \n Everyone point fingers at him and laugh.", 
   {}, 
   108502, 
   null, 
   1113862980.0
  ], 
  [
   108886, 
   null, 
   "Easyrider", 
   " if 98% DNA overlap with chimps isn't evidence of common descent, what would be?\n\n \n Evidence of intelligent design using similar genetics when convenient? A distinct possibility....\n \n p.s. The chimp isn't our forefather", 
   {}, 
   108810, 
   null, 
   1113868380.0
  ], 
  [
   108894, 
   null, 
   "sinjin", 
   "Evidence of intelligent design using similar genetics when convenient? A distinct possibility....\n \n p.s. The chimp isn't our forefather\n\n \n How does convenience apply to an all-powerful being?", 
   {}, 
   108886, 
   null, 
   1113869340.0
  ], 
  [
   108895, 
   null, 
   "trebor", 
   "Evidence of intelligent design using similar genetics when convenient? A distinct possibility....\n \n p.s. The chimp isn't our forefather\n\n \n Of course, that is not what the evidence shows, nor what the theory of evolution says. Your ignorance about what you reject is obvious.", 
   {}, 
   108886, 
   null, 
   1113869460.0
  ], 
  [
   108916, 
   null, 
   "Irvine", 
   "The whole talk of Neanderthal man being an evolutionary 'cousin' and chimps not being our forefathers disproving evolution seems to stem in my mind from a common misconception possibly shared by a few members of this board that evolution should occur on a linear progression. To clarify just this once for any members of the board that share this misconception - evolution branches - Pan troglodytes and Homo sapiens have a fairly recent common ancestor (relative to the time-scale of evolution), so we share lots of genetic information, however we are on two separate branches of the evolutionary map.", 
   {}, 
   108895, 
   null, 
   1113875220.0
  ], 
  [
   109012, 
   null, 
   "Orion", 
   "Evidence of intelligent design using similar genetics when convenient? A distinct possibility....\n\n \n Intelligent Design (aka 'Creationism Lite') is a solution in search of a problem. It violates the principle of Occam's Razor (are you familar with the concept?), and it has little or no explanatory or predictive value. I'll give you a clue: evolution makes due with what it already has - sometimes it works out; sometimes not. My backbone, for example, hurts tonight. Evolution has an explanation for that, given the evolutionary transition from a quadrupedal to a bipedal configuration, making use of what was already there. Likewise, the human temperature regulation system (sweating), an evolutionary adaptation, leaves a lot to be desired, hardly what one would describe as 'intelligent design'. \n \n You're a babe in the woods, Ez. \n \n \np.s. The chimp isn't our forefather\n\n \n John Hanks did not suggest that it was. Are you once again getting desperate, Ez, or are you simply showing your ignorance of evolutionary theory?", 
   {}, 
   108886, 
   null, 
   1113895140.0
  ], 
  [
   109111, 
   null, 
   "johnhanks", 
   "Evidence of intelligent design using similar genetics when convenient? A distinct possibility...\n\n I'm puzzled. You objected to my proposing H. habilis and H. erectus as human ancestors on the grounds of 'lack of conclusive DNA evidence'. Now you appear to be saying that DNA evidence can never be conclusive. Which do you mean?\n \n \np.s. The chimp isn't our forefather\n\n As Orion has already pointed out, I did not suggest that it was. Your cousins aren't your forefathers either, but we can deduce by comparing your genes with theirs that you share a set of grandparents. Comparing human and chimp DNA is analogous.", 
   {}, 
   108886, 
   null, 
   1113924180.0
  ], 
  [
   109369, 
   null, 
   "Easyrider", 
   "Hey John - God / Jesus is the Creator.\n \n Praise the Lord!", 
   {}, 
   109111, 
   null, 
   1113954780.0
  ], 
  [
   109389, 
   null, 
   "Duo_Maxwell", 
   "And people wonder why crazies like easyrider are seen as intellectually incompetent. \n \n lol.", 
   {}, 
   109369, 
   null, 
   1113956460.0
  ], 
  [
   111322, 
   null, 
   "Ray Martinez", 
   "Trebor: I heard of a wiccian lady who had some mormons come and 'witness' to her, and she answered the door 'skyclad', and invited them in to discuss their various theologies. The younger man was MOST interested, but got dragged away by the older gent.\n\n \n Atheist invent attempting to infuriate christians and portray them as hypocrites.\n \n Ray M.", 
   {}, 
   102646, 
   null, 
   1114293840.0
  ], 
  [
   111340, 
   null, 
   "Duo_Maxwell", 
   "Atheist invent attempting to infuriate christians and portray them as hypocrites.\n \n Ray M.\n\n \n lol. I love it when people proudly broadcast their ignorance in attempts to refute others.\n \n wiccian is one of the many pagan religions. A atheist is one who rejects a belief in God. Pagan religions worship a number of Gods. Therefore a wiccian lady cannot be a athiest. Not to mention paganism predates christanity by at least a good 1000 years. \n \n Please, continue, contribute to the theory that fundementalist christians are ignorant of other religions, athiesm, and history as a whole.", 
   {}, 
   111322, 
   null, 
   1114295700.0
  ], 
  [
   111347, 
   null, 
   "Dzeron", 
   "Hey John - God / Jesus is the Creator.\n \n Praise the Lord!\n\n \n Hey EZ - The almighty fat gremlin / the omnipotent ogre is the Creator.\n \n Praise the King!", 
   {}, 
   109369, 
   null, 
   1114297020.0
  ], 
  [
   111367, 
   null, 
   "Orion", 
   "Hey EZ - The almighty fat gremlin / the omnipotent ogre is the Creator.\n \n Praise the King!\n\n \n Minor correction: The Gay almighty fat gremlin / omnipotent ogre is the Creator.", 
   {}, 
   111347, 
   null, 
   1114299660.0
  ], 
  [
   111370, 
   null, 
   "Jo Bennett", 
   "lol. I love it when people proudly broadcast their ignorance in attempts to refute others.\n \n wiccian is one of the many pagan religions. A atheist is one who rejects a belief in God. Pagan religions worship a number of Gods. Therefore a wiccian lady cannot be a athiest. Not to mention paganism predates christanity by at least a good 1000 years. \n \n Please, continue, contribute to the theory that fundementalist christians are ignorant of other religions, athiesm, and history as a whole.\n\n \n Paganism may, but Wicca doesn't. Wicca is about 50 years old. I have a fair few friends who are Wiccans.", 
   {}, 
   111340, 
   null, 
   1114299900.0
  ], 
  [
   111374, 
   null, 
   "Duo_Maxwell", 
   "Paganism may, but Wicca doesn't. Wicca is about 50 years old. I have a fair few friends who are Wiccans.\n\n \n True, but Wicca is one of the many Pagan religions. Nevertheless, ray is still very wrong. \n \n http://www.religioustolerance.org/witchcr7.htm", 
   {}, 
   111370, 
   null, 
   1114301160.0
  ], 
  [
   111375, 
   null, 
   "Duo_Maxwell", 
   "Minor correction: The Gay almighty fat gremlin / omnipotent ogre is the Creator.\n\n \n Minor correction: The Gay almighty fat gremlin half hobbit / omnipotent ogre fairy scientific experiment 626 (stich from lilo & stich) is the Creator!", 
   {}, 
   111367, 
   null, 
   1114301220.0
  ], 
  [
   111377, 
   null, 
   "Orion", 
   "Minor correction: The Gay almighty fat gremlin half hobbit / omnipotent ogre fairy scientific experiment 626 (stich from lilo & stich) is the Creator!\n\n \n No, I have Spiritual Discernment and you obviously do not. Your liberal, revisionist, backsliding, \"feel good - anything goes\" theology will eventually be your ruin. Remember who tried to warn you.\n \n Bob 7:11!", 
   {}, 
   111375, 
   null, 
   1114302180.0
  ], 
  [
   111402, 
   null, 
   "Dzeron", 
   "Bob 7:11!\n\n \n \"He who listeneth not to threats of Eternal-Reality-TV-Land shall be banished to Eternal-Reality-TV-Land.\"", 
   {}, 
   111377, 
   null, 
   1114306560.0
  ], 
  [
   111416, 
   null, 
   "Duo_Maxwell", 
   "No, I have Spiritual Discernment and you obviously do not. Your liberal, revisionist, backsliding, \"feel good - anything goes\" theology will eventually be your ruin. Remember who tried to warn you.\n \n Bob 7:11!\n\n \n Ah, but your Spiritual Discernment is Satanic! It is obviously wrong, and immoral. Your sanatic revisionist, backsliding, anti all that is good theology will be your down fall! Remember who warned you when the \"great wine pressing\" comes and erases you from the spotted fabric of Eternity! Your hooting and stupid pet tricks won't save you from the Grapes!\n \n Easy Rider 2:16", 
   {}, 
   111377, 
   null, 
   1114310760.0
  ], 
  [
   111417, 
   null, 
   "billsco", 
   "Minor correction: The Gay almighty fat gremlin / omnipotent ogre is the Creator.\n\n \n Show us your gay fat almighty gremlin omnipotent ogre. Me and EZ Rider want to know. Five years and all. :)", 
   {}, 
   111367, 
   null, 
   1114310880.0
  ], 
  [
   111419, 
   null, 
   "Duo_Maxwell", 
   "Show us your gay fat almighty gremlin omnipotent ogre. Me and EZ Rider want to know. Five years and all. :)\n\n \n Only if you believe will you see. And if you don't believe, FIREY DEATH AND HORRIBLE SUFFERING WILL COME YOUR WAY! \n \n Heretic! ABANDON YOUR SINFUL WAYS AND PREPARE, for the great wine pressing is upon us!\n \n LOL. There's a super inappropiate response to that that I won't state :xcensored", 
   {}, 
   111417, 
   null, 
   1114311240.0
  ], 
  [
   111435, 
   null, 
   "Orion", 
   "Show us your gay fat almighty gremlin omnipotent ogre. Me and EZ Rider want to know. Five years and all. :)\n\n \n I've explained this many times before. Please see my previous posts on the subject. \n emoticon_xbye\n \n See how easy (EZ) this is?", 
   {}, 
   111417, 
   null, 
   1114313520.0
  ], 
  [
   111591, 
   null, 
   "Dzeron", 
   "Show us your gay fat almighty gremlin omnipotent ogre. Me and EZ Rider want to know. Five years and all. :)\n\n \n He's in the Superverse / he lived in Antarctica three thousand years ago.", 
   {}, 
   111417, 
   null, 
   1114378080.0
  ], 
  [
   111594, 
   null, 
   "Duo_Maxwell", 
   "He's in the Superverse / he lived in Antarctica three thousand years ago.\n\n \n But the Gay almighty fat gremlin half hobbit / omnipotent ogre fairy scientific experiment 626 new home is in the heavenly purple skies.", 
   {}, 
   111591, 
   null, 
   1114378860.0
  ], 
  [
   111658, 
   null, 
   "Ray Martinez", 
   "lol. I love it when people proudly broadcast their ignorance in attempts to refute others.\n \n wiccian is one of the many pagan religions. A atheist is one who rejects a belief in God. Pagan religions worship a number of Gods. Therefore a wiccian lady cannot be a athiest. Not to mention paganism predates christanity by at least a good 1000 years. \n \n Please, continue, contribute to the theory that fundementalist christians are ignorant of other religions, athiesm, and history as a whole.\n\n \n You don't get it.\n \n The scenario of evangelists knocking on a door and a naked woman desiring to discuss, then the younger being manhandled away by the older = atheist invented story intended to infuriate and portray christians as hypocrites.\n \n The fact that you were dumb enough to think you could school someone about what wiccan means shows how you bought the unsupported story without a thought.\n \n Obviously you are an ordinary atheist.\n \n Ray M.", 
   {}, 
   111340, 
   null, 
   1114386900.0
  ], 
  [
   111683, 
   null, 
   "Duo_Maxwell", 
   "You don't get it.\n\n \n Well I don't understand a argument that makes no sense. \n \n \n\n The scenario of evangelists knocking on a door and a naked woman desiring to discuss, then the younger being manhandled away by the older = atheist invented story intended to infuriate and portray christians as hypocrites.\n\n \n What? How is that athiest? You make claims you cannot subsantiate. Besides, that story came from a religion that believes in a God or Gods. Therefore, they cannot be a atheists. It's funny how you don't even understand what you are railing against. \n \n Do you even know what atheism is?    \n \n \n\n The fact that you were dumb enough to think you could school someone about what wiccan means shows how you bought the unsupported story without a thought.\n\n \n Again, stupid arguments. You attack the Wiccan religion as atheistic. I proved that is ridiculous on the basis that Wiccan is pagan and is not athiesm. \n \n \n\n Obviously you are an ordinary atheist.\n\n \n No. I'm a lassie-faire Unothodox diest.\n \n btw, it's people like you that make us rational people want to mock you. \n \n You are wrong because the Great Wine Pressing says you are wrong!\n \n IMMORAL HERETIC, abandon such claims!", 
   {}, 
   111658, 
   null, 
   1114390680.0
  ], 
  [
   131720, 
   null, 
   "canadianman77", 
   "If you're good in your heart, then good things will happen for, and to you. If you're bad in your heart, then bad times are comin. What if you enjoy being miserable?", 
   {}, 
   111322, 
   null, 
   1117706640.0
  ], 
  [
   132840, 
   null, 
   "epaphras_faith", 
   "If you're good in your heart, then good things will happen for, and to you. If you're bad in your heart, then bad times are comin. What if you enjoy being miserable?\n\n \n It rains on the righteous and unrighteous.\n \n Bad things happen to good people. Good things happen to bad people. You would be hard pressed to prove your cause and effect relationship.", 
   {}, 
   131720, 
   null, 
   1117914360.0
  ], 
  [
   136658, 
   null, 
   "Ladywolf", 
   "Sure, go ahead and ignore them....\n \n \"He who denies me before men, him will I deny before the Father.\" Jesus Christ \n \n Just remember the price you will eventually pay for that if you continue to reject Christ's salvation.\n\n \n \n You worship a false God. Christ does not offer salvation.", 
   {}, 
   103044, 
   null, 
   1118691060.0
  ], 
  [
   136660, 
   null, 
   "Truthsayer", 
   "So, you've been damned to a mythical place for not believing in a mythical diety? I wouldn't lose too much sleep over it. :p", 
   {}, 
   136658, 
   null, 
   1118691360.0
  ], 
  [
   136701, 
   null, 
   "Ladywolf", 
   "So, you've been damned to a mythical place for not believing in a mythical diety? I wouldn't lose too much sleep over it. :p\n\n \n I won't loose sleep over it, but after dinner...I'll faint (smirk).\n \n This thread has led me to believe in what I've originally believe...\n \n That God is the source of all things, in the beginning, energy, and created things that could create more energy to sustain the world. Energy is very flexible (i.e. good energy and negative energy). For example, the one that preaches fire and damnation is a good example of negative energy, the one that speaks of love is a good example of positive energy. Energy never disapates, but grows or is used up (this goes for good energy and negative energy). Energy comes in many forms...humans, animals, living things...what we do with this energy is up to us...we can create gods, bow to them and give our free will up to them (a total waste of a life).\n \n We create stories or record history (i.e. Koran, Bible, Book of Mormon) about this energy. We use our own energy to discuss and disagree or agree with one another.\n \n Bottom line...it's up to us.", 
   {}, 
   136660, 
   null, 
   1118694000.0
  ], 
  [
   138128, 
   null, 
   "Easyrider", 
   "You worship a false God. Christ does not offer salvation.\n\n \n Tsk tsk.....\n \n John 11:25 Jesus said to her, \"I am the resurrection and the life. He who believes in me will live, even though he dies; 26 and whoever lives and believes in me will never die. Do you believe this?\" 27\"Yes, Lord,\" she told him, \"I believe that you are the Christ, the Son of God, who was to come into the world.\" \n \n Acts 4:8 - Then Peter, filled with the Holy Spirit, said to them: \"Rulers and elders of the people! 9 If we are being called to account today for an act of kindness shown to a cripple and are asked how he was healed, 10 then know this, you and all the people of Israel: It is by the name of Jesus Christ of Nazareth, whom you crucified but whom God raised from the dead, that this man stands before you healed. 11 He is \n \" 'the stone you builders rejected, \n which has become the capstone\"(Psalm 118:22; Isaiah 28:16; Zech 10:4; Matthew 21:42, etc.). 12 Salvation is found in no one else, for there is no other name under heaven given to men by which we must be saved.\" \n \n Jesus is Lord and God!!", 
   {}, 
   136701, 
   null, 
   1118980860.0
  ], 
  [
   138132, 
   null, 
   "trebor", 
   "Tsk tsk.....\n \n John 11:25 Jesus said to her, \"I am the resurrection and the life. He who believes in me will live, even though he dies; 26 and whoever lives and believes in me will never die. Do you believe this?\" 27\"Yes, Lord,\" she told him, \"I believe that you are the Christ, the Son of God, who was to come into the world.\" \n \n Acts 4:8 - Then Peter, filled with the Holy Spirit, said to them: \"Rulers and elders of the people! 9 If we are being called to account today for an act of kindness shown to a cripple and are asked how he was healed, 10 then know this, you and all the people of Israel: It is by the name of Jesus Christ of Nazareth, whom you crucified but whom God raised from the dead, that this man stands before you healed. 11 He is \n \" 'the stone you builders rejected, \n which has become the capstone\"(Psalm 118:22; Isaiah 28:16; Zech 10:4; Matthew 21:42, etc.). 12 Salvation is found in no one else, for there is no other name under heaven given to men by which we must be saved.\" \n \n Jesus is Lord and God!!\n\n \n \n Of course, you are using false scripture to try to show that, or misquotes and mistranslations.\n \n That, however, is your problem.", 
   {}, 
   138128, 
   null, 
   1118981940.0
  ], 
  [
   138228, 
   null, 
   "Wraith", 
   "Of course, you are using false scripture to try to show that, or misquotes and mistranslations.\n\n \n Indeed, even the name 'Jesus' Easyrider uses is a Greek mis-transliteration, the proper name is Yeshua...", 
   {}, 
   138132, 
   null, 
   1119011040.0
  ], 
  [
   138383, 
   null, 
   "trebor", 
   "Indeed, even the name 'Jesus' Easyrider uses is a Greek mis-transliteration, the proper name is Yeshua...\n\n \n And 'Christ' is the Hellenised version of 'The Annointed One', which refers to\n either the High Priest in the temple, or the king of Judah. It is a very human, non-divine title. All this claiming about the 'literal' son of God is quite pagan.\n \n As for the New Testament proclaiming Jesus as 'The only begotten son of god', the writer of that gospel certainly did not read or know of the Psalm of David (number 2), where David is proclaimed the begotton son of god.. by making him king.", 
   {}, 
   138228, 
   null, 
   1119038640.0
  ], 
  [
   138415, 
   null, 
   "Wraith", 
   "As for the New Testament proclaiming Jesus as 'The only begotten son of god', the writer of that gospel certainly did not read or know of the Psalm of David (number 2), where David is proclaimed the begotton son of god.. by making him king.\n\n \n Interesting, I've read a sparse few sources which discuss the idea that Yeshua wasn't the 'literal' son of the biblical god rather a human that he was first to achieve some sort of 'closeness' with god and hence in 'spirit' became 'the son of god'.", 
   {}, 
   138383, 
   null, 
   1119044580.0
  ], 
  [
   138423, 
   null, 
   "trebor", 
   "Interesting, I've read a sparse few sources which discuss the idea that Yeshua wasn't the 'literal' son of the biblical god rather a human that he was first to achieve some sort of 'closeness' with god and hence in 'spirit' became 'the son of god'.\n\n \n \n That source would be more in line with the traditional Jewish tradition.. but it wouldn't be a 'first'. \n \n From the KJV, psalms of david.\n \n \n\n 2:6 Yet have I set my king upon my holy hill of Zion. \n 2:7 I will declare the decree: the LORD hath said unto me, Thou art my Son; this day have I begotten thee.\n \n", 
   {}, 
   138415, 
   null, 
   1119045960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I've Been Damned to Hell for Not Believing Jesus is God", 
  "url": "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4679, 
  "discussion_files": [
   [
    "33059.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-print.html"
   ], 
   [
    "33060.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-16-print.html"
   ], 
   [
    "33061.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-14-print.html"
   ], 
   [
    "33062.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-12-print.html"
   ], 
   [
    "33063.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-10-print.html"
   ], 
   [
    "33064.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-8-print.html"
   ], 
   [
    "33065.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-7-print.html"
   ], 
   [
    "33066.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-5-print.html"
   ], 
   [
    "33067.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-9-print.html"
   ], 
   [
    "33068.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-4-print.html"
   ], 
   [
    "33069.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-13-print.html"
   ], 
   [
    "33070.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-6-print.html"
   ], 
   [
    "33071.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-15-print.html"
   ], 
   [
    "33072.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-11-print.html"
   ], 
   [
    "33073.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-3-print.html"
   ], 
   [
    "33074.html", 
    "http://www.4forums.com/political/religion-debates/4679-ive-been-damned-hell-not-believing-jesus-god-2-print.html"
   ]
  ], 
  "identifier": 4679
 }
]