[
 [
  [
   103379, 
   null, 
   "Nobunaga", 
   "This government is preeching against propaganda, but yet it uses propaganda, the only difference between the nazi germany's propaganda and Bush's administration's propaganda is that the nazi germany had a Propaganda Ministry like Goebbles, but our propaganda is constantly on the most popular source of entertainment in the world, the television.\n Amendment 1 can be counted as slander as many times as the government uses it to get people on their side.", 
   {
    "post_info": {
     "post_title": "Propaganda"
    }
   }, 
   null, 
   null, 
   1112364840.0
  ], 
  [
   103381, 
   null, 
   "Eddie", 
   "Propaganda is great. It creates utility at a relative low cost. Ecpessially in the form of entertainment!", 
   {}, 
   103379, 
   null, 
   1112365680.0
  ], 
  [
   103417, 
   null, 
   "Alan Ryan", 
   "Propaganda (which is a means of spreading opinions) is a morally neutral concept: to pass judgement on it depends on what characterises it and what it is used for.\n \n In the modern (western) world of mass democracy, mass entertainment, etc., propaganda is probably an indispensible tool in the hands of those who would impose social control. \n \n Many people have no opinions of their own, and these have to be pumped into them from outside like lubricants into machinery.", 
   {}, 
   103381, 
   null, 
   1112376960.0
  ], 
  [
   117350, 
   null, 
   "zelma", 
   "Propaganda should include the word bias or biased. def: The propogation of ideas, information, etc. that is biased or slanted to a particular thought.\n \n Traditionally, the word propaganda has been used as a term meaning political lies.", 
   {}, 
   103417, 
   null, 
   1115321940.0
  ], 
  [
   117613, 
   null, 
   "zachvac", 
   "it doesn't preach against propoganda. I think there's a government office in charge of propoganda. During the Cold War they used it to try to convince people Communism was bad. Telling you that killing is bad is propoganda. Actually you telling me that propoganda is bad is propoganda.", 
   {}, 
   117350, 
   null, 
   1115350500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Propaganda", 
  "url": "http://www.4forums.com/political/government-debates/4704-propaganda.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 4704, 
  "discussion_files": [
   [
    "17488.html", 
    "http://www.4forums.com/political/government-debates/4704-propaganda-print.html"
   ]
  ], 
  "identifier": 4704
 }
]