[
 [
  [
   5718, 
   null, 
   "hetero-male", 
   "Individual Responsibility and Freedom\n by Jeff Hall\n October 2, 2002\n In today's society it is becoming more, and more frequent for people to attribute their problems to someone else. Many people think of themselves, and their fellow men, women and children as victims of various circumstances, and social inequities beyond their control. \n \n There are a multitude of complaints from people around the world who wrongfully blame other people for their problems and inconveniences, which are actually a result of their own actions. Not someone else's. \n \n The root of such a mindset stems from various forms of socialism such as liberalism. Liberals are guided by their emotions more than logic when formulating decisions and taking a stance on the issues concerning themselves and society. They are also collective minded, and do not believe in the individual persons ability to advance civilization. To any full-blown socialist, the individual cannot be trusted to consistently be fair and just to other people. \n \n Therefore, they put their faith in the strong arm of government to right all that they see as being wrong, or unfair. To a liberal, individual freedoms ranging from free speech, to gun ownership, to owning private property should be curtailed by government in their attempts to equalize everyone so life will be fair for all. \n \n When ever a liberal feels they, or someone else they sympathize with is treated unfairly, they sometimes try to blame other people who are not at fault. They are people unwilling to accept any blame for their own actions that are the cause of the plight they find themselves in. \n \n As a result of a lack of personal responsibility among them, and their inability to face their own mistakes and failures in life, individual freedom will be suppressed. Individual freedom ultimately rests on responsibility for ones own actions, because responsibility is what makes people worthy of the right to live as they choose in a peaceful manner among their fellow citizens. \n \n Freedom is the individual right to be free from the initiation of force by other people. Therefore, if a person wrongly accuses someone else for their own deeds, and brings down the heavy hand of the government upon that innocent person, then the individual right to freedom is being denied. It is because the government will force that innocent person to pay the consequences for another person's irresponsible behavior and actions. \n \n Those who initiate force against the innocent cede their right to freedom to whom ever despot in government who will take it. Once individual responsibility and accountability are lost, the door becomes wide open to erroneous accusations from people who are looking for a scapegoat to blame for their own problems. \n \n The number of phony accusations abound. The first one that comes to mind are a few fat lazy people with zero discipline to control their eating habits who are filing lawsuits in order to sue McDonald's, Burger King, Wendy's, and Kentucky Fried Chicken. The gluttons are blaming the fast food chains for their obesity because they eat too much! It is totally ludicrous. No one is to blame for eating to many burgers, fries, and sundaes along with drinking a whole pail full of soda, except for those who eat too much to start with. \n \n The same reasoning goes for cigarette smokers who sue tobacco companies for their aliments such as cancer. People start smoking because they choose to. Cigarettes are addictive, but there are millions who have quit smoking after many years and decades of lighting up a pack or more a day. It has been known for over a century and perhaps many more that smoking tobacco is unhealthy, and it has been known for certain by most everyone for at least forty years that smoking causes cancer. The lawsuits against tobacco companies are a way that irresponsible people take money from them through government courts with liberal judges sitting on the bench. \n \n With all of the information put forth by anti-smoking organizations about the danger from smoking, there is no excuse for any smoker to lay the blame upon someone else if they get cancer. \n \n Alcoholism is another condition that has people laying the blame elsewhere. It is said that alcoholism is a disease and those who suffer from it have no control over their habit of imbibing too much, and too often. Again people drink booze because they choose to. Yes, it is addictive, but many have quit by themselves after many years of drinking every day. It just takes the will to want to stop. \n \n Also, alcoholism as a disease is questionable. A serious condition yes, but it is not something a person involuntarily contracts from a virus or bacterium. An alcoholic is not the host to some parasite that causes sickness. Instead, a little like cancer from smoking, and obesity from over eating, alcoholism is more like a self inflicted wound. One always has the choice not to drink, smoke, or over eat regardless of how tempting they may be. \n \n Another example is guns. Gun manufactures are often blamed by socialists for fatal gun accidents that were due to careless, or inappropriate use by the gun owner. Guns by themselves do not kill. It takes a person with intent to load it and pull the trigger. Any accidents that happen are the fault of the gun owner, not the gun maker. Blaming the gun maker for the actions by those who purchase the guns does not make sense. It stands logic on its head. It is comparable to blaming car accidents on the carmaker, not the people who were driving too fast, and were possibly drunk as well. \n \n Of all the blame games there are, one of the silliest accusations is that rich people become wealthy at the expense of the poor. How can it be that the rich take from the poor when it is the rich who provide the most jobs, and the best ones? There are many large companies who employ very many people such as Caterpillar, General Motors, General Mills, Microsoft, General Electric, and many others. Then there are also many more small businesses that distribute, or sell their products, thus employing more people still. \n \n In every case, for those who are poverty stricken, it is due to socialism in government. Socialist governments support the populace with many if not most of their needs to live. In order to do that there must be heavy taxation, which dampens economic activity since the people have less money. The result is always poverty such as in the old Soviet Union and eastern bloc, Cuba, China, Zimbabwe, and others. \n \n Socialism doesn't work since those countries that embrace it the most are generally the poorest. Collective means to accomplish goals are not always practical because not everyone agrees on every matter at hand. People have different interests, and levels of ability and intelligence so it is pure nonsense to set up a government that blankets everyone with the same regulations. Regulations that quell responsibility since government will take care of the matter at hand anyhow. People have the right to exercise their individual freedoms through responsible courses of action, so government should never be allowed to make incursions upon individual freedoms. \n \n Even in America and western Europe, the poverty that does exist is due to socialist policies because the free handouts from government, along with the Marxist/Communist progressive income tax, causes people to lose the incentive to excel in their daily pursuit of creating a better life for themselves and their families. Socialism levies punitive taxes and regulation that depresses the economy, which helps put a damper on the number of well paying jobs as well as opportunities in entrepreneurship. \n \n So if anyone ever complains that the rich have too much money, and that they are poor because of the rich, then the only reasons for being poor is primarily due to socialism, or that some people just happen to be lazy. \n \n When people start blaming other people for their own mistaken thoughts and deeds they are essentially relinquishing their freedom to the government. For if the government is to be granted the power to force responsible people to pay the price for the consequences of irresponsible people, who will be left to stop the government from usurping all of our individual freedoms and responsibilities?", 
   {
    "post_info": {
     "post_title": "Individual Responsibility and Freedom"
    }
   }, 
   null, 
   null, 
   1048761360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Individual Responsibility and Freedom", 
  "url": "http://www.4forums.com/political/politics-debates/471-individual-responsibility-freedom.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 471, 
  "discussion_files": [
   [
    "1805.html", 
    "http://www.4forums.com/political/politics-debates/471-individual-responsibility-freedom-print.html"
   ]
  ], 
  "identifier": 471
 }
]