[
 [
  [
   103780, 
   null, 
   "Siegfriedson", 
   "Race-Mixing is Genocide For All Races that Engage in it\n \n The following quote is from the United Nations \"Genocide Convention\":\n \n \n\"Acts Constituting Genocide \"Article II \"In the present Convention, genocide means any of the following acts committed with intent to destroy, in whole or in part, a national, ethnic, racial or religious group, as such: \"(a) Killing members of the group; \"(b) Causing serious bodily or mental harm to members of the group; \"(c) Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part; \"(d) Imposing measures intended to prevent births within the group; \"(e) Forcibly transferring children of the group to another group.\"\n\n \n Think about racial integration. The laws which formerly protected the freedom of association of different racial groups, who in all of recorded history have shown a strong tendency to segregate themselves and evinced a strong desire to live among their own kind and by their own values, were all reversed by illegal decrees of a leftist Supreme Court, until today freedom of association is virtually illegal.\n \n It is my contention that the people of European descent of this world are the targets of a constant, consistent, systematic, sustained campaign of genocide, with the intention of humiliating, subjugating, and eventually eliminating our people.\n \n Read more:\n \n http://www.natall.com/free-speech/fs951b.html\n \n \n \n .", 
   {
    "post_info": {
     "post_title": "Racial Integration = Genocide"
    }
   }, 
   null, 
   null, 
   1112510280.0
  ], 
  [
   104066, 
   null, 
   "Mucusaur", 
   "Bla, bla bla bla bla bla race bla bla bla bla integration bla bla bla bla genocide.\n \n I cant make any sense of the rambling thoughts of that article you posted. Does it make sense to you? It appears to be a tirade of baseless accusations and darkside conspiracies.\n \n And since when did people of a different skin colour constitute a different species?", 
   {}, 
   103780, 
   null, 
   1112635860.0
  ], 
  [
   104071, 
   null, 
   "Alan Ryan", 
   ".\n \n It appears to be a tirade of baseless accusations and darkside conspiracies.\n \n \n \n \n You are almost correct: except, what this tirade appears to be, is also its reality - and no counter argument based on facts and knowledge will make any difference.\n \n To combat the mindset that produces this sort of outburst, perhaps the \"philosophy\" of James Cagney is almost justified - i.e. that the fist is mightier than the pen ?", 
   {}, 
   104066, 
   null, 
   1112638440.0
  ], 
  [
   104219, 
   null, 
   "jitobear", 
   "Look at Seig's pretty post. All articulate and with links and everything. I told him in a PM that my son was Latino and he sent me TWO derogatory cartoons and called my son a spic. I would be happy to forward them to anyone who has doubts that this poster is anything more than your typical hate-filled creep.\n \n Although, I will admit I was pretty mean to him. But since he is mean to everyone with a good heart and mind in general, and towards to my son in particular, every single time he posts, I don't feel particurly compelled to play nice. :)", 
   {}, 
   104071, 
   null, 
   1112671320.0
  ], 
  [
   104238, 
   null, 
   "Dzeron", 
   "Race-Mixing is Genocide For All Races that Engage in it\n \n The following quote is from the United Nations \"Genocide Convention\":\n \n \n \n Think about racial integration. The laws which formerly protected the freedom of association of different racial groups, who in all of recorded history have shown a strong tendency to segregate themselves and evinced a strong desire to live among their own kind and by their own values, were all reversed by illegal decrees of a leftist Supreme Court, until today freedom of association is virtually illegal.\n \n It is my contention that the people of European descent of this world are the targets of a constant, consistent, systematic, sustained campaign of genocide, with the intention of humiliating, subjugating, and eventually eliminating our people.\n \n Read more:\n \n http://www.natall.com/free-speech/fs951b.html\n \n \n \n .\n\n \n Now, I am not a racist, but I must say that I agree with some of your points - namely, that the freedom of association has been violated by forced integration. It is unconstitutional - the 14th amendment implies that government cannot force people to do things on the basis of race.\n \n I would not call it \"genocide,\" though I would call it \"liberticide.\" (I am not sure if that is even a word.) I do not think this violation of liberty specifically targets European Americans, because all races are forced to integrate - black, white, hispanic, etc.", 
   {}, 
   103780, 
   null, 
   1112674260.0
  ], 
  [
   104247, 
   null, 
   "zachvac", 
   "Now, I am not a racist, but I must say that I agree with some of your points - namely, that the freedom of association has been violated by forced integration. It is unconstitutional - the 14th amendment implies that government cannot force people to do things on the basis of race.\n \n I would not call it \"genocide,\" though I would call it \"liberticide.\" (I am not sure if that is even a word.) I do not think this violation of liberty specifically targets European Americans, because all races are forced to integrate - black, white, hispanic, etc.\n\n \n Since when is the government forcing people to associate with other races?", 
   {}, 
   104238, 
   null, 
   1112675040.0
  ], 
  [
   104267, 
   null, 
   "Hunter", 
   "Have lunch with who you wish, love and marry who you wish; I don't care. Just don't tell me who I have to rent a house to. I will not allow the goverment to meddle in my ability to rent my properties to who I want to. For one thing, I refuse to rent any of my properties to anyone who does not speak english. The Hell with the law. The Great Society envisioned by the worst liberal of all, President Johnson, has been nothing but a great failure. Forced integration of our nation's public school system has destroyed the concept of every child getting a good education. I believe in freedom, just don't try to shove someone down my throat with the law.", 
   {}, 
   104247, 
   null, 
   1112678880.0
  ], 
  [
   104286, 
   null, 
   "jitobear", 
   "Relax Hunter - \n \n I am pretty sure you are safe. If it is fewer than four units and your primary residence you can discriminate at will. I sure hope that when and if you visit other lands they are equally as accepting of you. Gringa pendeja.\n \n Regarding the schools - I am all about keeping the kids of short sighted red neck fundies seperate from my kid. Is that doable?\n \n LBJ was neurotic.", 
   {}, 
   104267, 
   null, 
   1112680260.0
  ], 
  [
   104288, 
   null, 
   "Steeeeve", 
   "considering our country is pretty much founded by immigrants I don't see any backing for not wanting them here. We have no set language and no set religion and not set way to rent a building. So you don't have to rent from a Mexican but don't complain when they don't wanna rent to you either. One can be a racist if he or she pleases...it is free choice. (note: not calling anyone a racist)", 
   {}, 
   104286, 
   null, 
   1112680740.0
  ], 
  [
   104292, 
   null, 
   "zelma", 
   "I don't think school integration is a problem. I do think there is so many people who are white haters, it would please them to blend out the white race.", 
   {}, 
   104286, 
   null, 
   1112680980.0
  ], 
  [
   104302, 
   null, 
   "Hunter", 
   "Relax Hunter - \n \n I am pretty sure you are safe. If it is fewer than four units and your primary residence you can discriminate at will. I sure hope that when and if you visit other lands they are equally as accepting of you. Gringa pendeja.\n \n Regarding the schools - I am all about keeping the kids of short sighted red neck fundies seperate from my kid. Is that doable?\n \n LBJ was neurotic.\n\n I have more than four properties and am doing quite well. I have no desire to visit any other land besides Miss. I treat all people with the respect which they have earned by their behaviour. I remember when a discriminating person was not labaled in a negative fashion. It used to be called common sense. If you want to send your child to an under-performing public school filled with ghetto trash, that is your perogative. Me, I would never do it.\n Label as you will, but my point is that no government has the right to tell me how to conduct my affairs concerning what I have worked so hard to attain.\n My friend, Red Neck is not such a bad thing. I am a patriot, I believe fervently in my Lord, and, if need be, I can kill my own food and drag it home and cook it. I believe that there are only two types of men on this earth; the dead and the deadly. I believe that gun control means that a man can hit what he aims at.\n \n \" Tolerance, is the virtue of a man without conviction.\" I have strong God fearing convictions and am not afraid to display them in public. I wish you well.", 
   {}, 
   104286, 
   null, 
   1112682240.0
  ], 
  [
   104409, 
   null, 
   "sinjin", 
   "Forced integration of our nation's public school system has destroyed the concept of every child getting a good education.\n\n \n So prior to integration this nation was committed to a \"good education\" for children of color? I got news for you, this nation wasn't and still isn't.", 
   {}, 
   104267, 
   null, 
   1112720940.0
  ], 
  [
   104411, 
   null, 
   "sinjin", 
   "The laws which formerly protected the freedom of association of different racial groups, who in all of recorded history have shown a strong tendency to segregate themselves and evinced a strong desire to live among their own kind and by their own values, were all reversed by illegal decrees of a leftist Supreme Court, until today freedom of association is virtually illegal.\n \n\n \n I suspect you mean \"freedom from association\" as in having to deal with people of other \"races\".\n \n Could I recommend Iceland?", 
   {}, 
   103780, 
   null, 
   1112721120.0
  ], 
  [
   104422, 
   null, 
   "Duo_Maxwell", 
   "Let's play with this guy. It's clear his world history background can fit in a thimble. \n \n IF racial intergration is genocide, why is it that latin America, a population made up of mixed blood consisting of native populations, Spanish, Portugese and a smaller number of other white Europeans is vastly populated? After all, it's been about 500 years of such racial intergration and they don't seem to have any problems with growing population, in fact, that seems to be the problem they face. \n \n Huh. Seems contridictiory to such a argument. \n \n Let's take it further, \n \n IF racial intergration is genocide, why is it that the US, a mixing of races that would detail about a meg of forum space has one of the largest populations in the US?", 
   {}, 
   104411, 
   null, 
   1112724540.0
  ], 
  [
   104445, 
   null, 
   "sinjin", 
   "Let's play with this guy. It's clear his world history background can fit in a thimble. \n \n IF racial intergration is genocide, why is it that latin America, a population made up of mixed blood consisting of native populations, Spanish, Portugese and a smaller number of other white Europeans is vastly populated? After all, it's been about 500 years of such racial intergration and they don't seem to have any problems with growing population, in fact, that seems to be the problem they face. \n \n Huh. Seems contridictiory to such a argument. \n \n Let's take it further, \n \n IF racial intergration is genocide, why is it that the US, a mixing of races that would detail about a meg of forum space has one of the largest populations in the US?\n\n \n I gather it is his racist position that a drop of \"non-white\" blood means you're not white and therefore lost to the \"white\" race. Race mixing leads to extinction of discreet \"races\". I still don't see how this applies to any of the U.N. requirements to be classified as \"genocide\". I say good riddance to \"race consciousness\".", 
   {}, 
   104422, 
   null, 
   1112727000.0
  ], 
  [
   104450, 
   null, 
   "jitobear", 
   "I have more than four properties and am doing quite well. I have no desire to visit any other land besides Miss.\n\n \n That does not surprise me. A whole world filled with people who look, speak, think, and do things different than you must be absolutely terrifying.\n \n \nI treat all people with the respect which they have earned by their behaviour. I remember when a discriminating person was not labaled in a negative fashion. It used to be called common sense.\n\n \n Common sense if you want to maintain some illusion of superiority because you lack the self esteem to feel valuable without bringing others down.\n \n \nIf you want to send your child to an under-performing public school filled with ghetto trash, that is your perogative. Me, I would never do it.\n\n \n I live in what you call a ghetto - and I would take it over an inbreeding trailor park of white trash any day.\n \n My son attends a public Spanish Immersion school with kids who are white, black and Latino. All the kids rock. And at the tender age of ten he is learning to be bi-lingual and a world taveler (been all over the US and Canada - wants to go to Italy, Egypt and Mexico). Already wiser than you about people and the world.\n \n Oh - and only a complete coward labels any child as trash. \n \n \nLabel as you will, but my point is that no government has the right to tell me how to conduct my affairs concerning what I have worked so hard to attain.\n\n \n OK - how about HYPOCRITE.\n \n You seem to have no problem having Uncle Sam tell women how to conduct the affairs of their bodies.\n \n \nMy friend, Red Neck is not such a bad thing. I am a patriot, I believe fervently in my Lord, and, if need be, I can kill my own food and drag it home and cook it. I believe that there are only two types of men on this earth; the dead and the deadly. I believe that gun control means that a man can hit what he aims at.\n\n \n Red neck is silliness. Racism is not. It is THE definition of evil to me.\n \n \n\" Tolerance, is the virtue of a man without conviction.\"\n\n \n Racism is a false and misguided conviction. Segregationad discrimination the desires of mean-spirited cowards. (Not to mention BORING.)\n \n \nI have strong God fearing convictions and am not afraid to display them in public. I wish you well.\n\n \n Oh - you mean the one who is said to a crowd of people from all languages and nations and whose son told us to love our neighbor? Would that be the God you are reffering to?", 
   {}, 
   104302, 
   null, 
   1112729760.0
  ], 
  [
   104451, 
   null, 
   "wilted_laughter", 
   "Go jitobear! emoticon_xgood", 
   {}, 
   104450, 
   null, 
   1112729940.0
  ], 
  [
   104463, 
   null, 
   "sinjin", 
   "I have no desire to visit any other land besides Miss. \n\n \n What a coincidence, I have never had the desire to visit Mississippi. I'm sure your views make you right at home there. I'll take the rest of the world, deal?", 
   {}, 
   104302, 
   null, 
   1112732460.0
  ], 
  [
   104507, 
   null, 
   "gnojek", 
   "Since when is the government forcing people to associate with other races?\n\n Maybe they don't anymore, but at least when I was in school we had various \"bussing\" programs. You didn't go to the closest school, you had to go to a school across town so that there was an equal mix of races. It was pretty stupid and a horrible failure for the most part. In my town they later tried a program where each school had a different specialty, math/science, athletics, music. They thought that kids would want to go to these schools 10-15 miles away so that they could specialize. Wrong. Not only was it wrong and not voluntary, but it made for a 1+ hour bus ride. A short bus would come pick you up from your neighborhood (and you were laughed at) and bring you to a hub where a larger bus would take you to your school. It was lame.\n \n Anyway, I agree with dzeron that forcing kids to go to a school 10 miles away just because there are more white or black kids there is just wrong. But to say that bussing kids to schools is genocide, give me a break. That's really going overboard.\n \n Segregation = wrong\n Forced bussing = wrong\n \n \nI don't think school integration is a problem. I do think there is so many people who are white haters, it would please them to blend out the white race.\n\n \n Who? I've never met any of these people. Please, if you will, give us a description of who these people are and what they do. How do they plan to \"blend out\" the white race? \n \n \n \n \n Oh, and I'd just like to add how much Mississippi sucks.", 
   {}, 
   104247, 
   null, 
   1112737500.0
  ], 
  [
   104511, 
   null, 
   "jitobear", 
   "What a coincidence, I have never had the desire to visit Mississippi. I'm sure your views make you right at home there. I'll take the rest of the world, deal?\n\n \n Mind sharing with me? :)", 
   {}, 
   104463, 
   null, 
   1112738160.0
  ], 
  [
   104524, 
   null, 
   "sinjin", 
   "Mind sharing with me? :)\n\n \n \n It would be my honor but don't rent to \"whitey\" without prior approval and your son's blessing. emoticon_rolleyes", 
   {}, 
   104511, 
   null, 
   1112739540.0
  ], 
  [
   104550, 
   null, 
   "fracas", 
   "funny that whites think they are at the top of the race pyramid", 
   {}, 
   104524, 
   null, 
   1112743020.0
  ], 
  [
   104569, 
   null, 
   "Duo_Maxwell", 
   "I gather it is his racist position that a drop of \"non-white\" blood means you're not white and therefore lost to the \"white\" race.\n\n \n Well, he did state that it is genocide for all races that engage in it, white or not. Anyways, I didn't seriously think he would consider history. Most racists can't grasp such basic ideas. \n \n \nRace mixing leads to extinction of discreet \"races\". I still don't see how this applies to any of the U.N. requirements to be classified as \"genocide\". I say good riddance to \"race consciousness\".\n\n \n Me too. \n \n Besides, here's a reason why race mixing is good\n \n She's I think Japanese, German and Portuges. emoticon_xlove", 
   {}, 
   104445, 
   null, 
   1112747700.0
  ], 
  [
   104583, 
   null, 
   "Mucusaur", 
   "Good point Fracas made. How are we so certain that \"whites\" are better? If I were to invoke logic, logic would clearly dictate that africans are more pure, since that was where all humans came from, but those that left were \"altered\" and made less \"pure\" by local enviroments and different conditions.\n \n Perhaps siegfriedson could explain this to me? Unless of course he is talking out of his bung hole, which I suspect.", 
   {}, 
   104569, 
   null, 
   1112748480.0
  ], 
  [
   104649, 
   null, 
   "Siegfriedson", 
   "Now, I am not a racist\n\n \n It's funny how many Whites make the obligatory claim in public that they are \"not racist\" and \"have Black friends\", etc. We all know the truth, however. Whites that live in racially diverse areas are some of the most resentful people concerning the forced racial integration that has swept America over the last few decades.\n \n \nSince when is the government forcing people to associate with other races?\n\n \n Since Brown vs. Board of Ed. in 1954, since the so-called \"Civil Rights\" era of the 1960's, and since the borders have been thrown open to the Third Worlders who flood into a previosly White America at the rate of 1 million annually.\n \n \nI don't think school integration is a problem. I do think there is so many people who are white haters, it would please them to blend out the white race.\n\n \n No doubt about it. There is a Jewish professor at Harvard who openly advocates the destruction of the White race. Unfortunately, many of those whom you refer to are White themselves - they are the product of years and years of race-mixing propaganda that has been broadcast by Hollywood and the mass media.\n \n \n \nIF racial intergration is genocide, why is it that latin America, a population made up of mixed blood consisting of native populations, Spanish, Portugese and a smaller number of other white Europeans is vastly populated?\n\n \n The original Indian inhabitants of Central and South America have largely been exterminated through contact with Europeans. Either the Spaniards killed them, or they mongrelized with them. Both situations result in the same trend - namely, the disappearance of Indian bloodlines and culture from the earth. Whites must take action to avoid this fate for themselves.\n \n As to why there are \"so many\" individuals in Latin America, it is because the Mestizo population down there is artificially inflated because of White technology and medicine which have increased the life spans and reproduction rates of all Third Worlders. Simultaneously there has been a decrease of White births, along with the flooding of Europe and North America with non-Whites. Therefore, it is plain to see that Whites are suffering from a sort of passive genocide.\n \n Some White people could care less if their people are vanquished forever from this planet. I am not one of those Whites.\n \n \nfunny that whites think they are at the top of the race pyramid\n\n \n That is a very hateful, prejudiced, and bigoted statement. It's amazing that people like you exist in this day and age.", 
   {}, 
   104583, 
   null, 
   1112760600.0
  ], 
  [
   104653, 
   null, 
   "Hunter", 
   "What a coincidence, I have never had the desire to visit Mississippi. I'm sure your views make you right at home there. I'll take the rest of the world, deal?\n\n \n Sinjin, you are most welcome to visit the great state of Miss. It is a very progressive and wonderfull place. As to my views, I find myself welcome everywhere. You and I both can \"take\" the rest of the world. You seem to be trying to imply that I am racist, nothing could be further from the truth. Just because I am from the South does not mean that I hate anyone. I take every man for how he carries himself and presents himself to humanity. However, I will never sacrifice the truth to be politically correct.\n I am American by chance and Southern by the grace of God. I am an un-hyphenated American who wishes you well.\n Boot straps, every man has them but some men fail to pull them up.", 
   {}, 
   104463, 
   null, 
   1112766420.0
  ], 
  [
   104654, 
   null, 
   "Hunter", 
   "That does not surprise me. A whole world filled with people who look, speak, think, and do things different than you must be absolutely terrifying.\n \n \n \n Common sense if you want to maintain some illusion of superiority because you lack the self esteem to feel valuable without bringing others down.\n \n \n \n I live in what you call a ghetto - and I would take it over an inbreeding trailor park of white trash any day.\n \n My son attends a public Spanish Immersion school with kids who are white, black and Latino. All the kids rock. And at the tender age of ten he is learning to be bi-lingual and a world taveler (been all over the US and Canada - wants to go to Italy, Egypt and Mexico). Already wiser than you about people and the world.\n \n Oh - and only a complete coward labels any child as trash. \n \n \n \n OK - how about HYPOCRITE.\n \n You seem to have no problem having Uncle Sam tell women how to conduct the affairs of their bodies.\n \n \n \n Red neck is silliness. Racism is not. It is THE definition of evil to me.\n \n \n \n Racism is a false and misguided conviction. Segregationad discrimination the desires of mean-spirited cowards. (Not to mention BORING.)\n \n \n \n Oh - you mean the one who is said to a crowd of people from all languages and nations and whose son told us to love our neighbor? Would that be the God you are reffering to?\n\n \n I refer you to the seperation of mankind by God at the tower of Babel. No further explanation is required. You either get it or you don't.", 
   {}, 
   104450, 
   null, 
   1112766660.0
  ], 
  [
   104672, 
   null, 
   "jitobear", 
   "I refer you to the seperation of mankind by God at the tower of Babel. No further explanation is required. You either get it or you don't.\n\n \n Whatever gets you through the night baby. You and Seig can go swap spittle in an all white tastes just like chicken world f you want. \n \n I am not interested.", 
   {}, 
   104654, 
   null, 
   1112783280.0
  ], 
  [
   104682, 
   null, 
   "fracas", 
   "That is a very hateful, prejudiced, and bigoted statement. It's amazing that people like you exist in this day and age.\n\n \n in what way was my statement \"very hateful, prejudiced, and bigoted\"?", 
   {}, 
   104649, 
   null, 
   1112791140.0
  ], 
  [
   104683, 
   null, 
   "wilted_laughter", 
   "I refer you to the seperation of mankind by God at the tower of Babel. No further explanation is required. You either get it or you don't.\n\n \n Sounds to me like humans reasoning a divine explanation for something currently beyond their understanding, the standard substitute for a lack of knowledge. \n \n The \"seperation of mankind\" can now be explained by a variety of evolutionary, environmental, cultural and social factors.", 
   {}, 
   104654, 
   null, 
   1112792880.0
  ], 
  [
   104684, 
   null, 
   "Mucusaur", 
   "I refer you to the seperation of mankind by God at the tower of Babel. No further explanation is required. You either get it or you don't.\n\n \n What by people \"babbling\" incoherently? By faulty construction methods? Where exactly are you going with this? Surely you dont beleive that all the worlds langauges came from God trying to obfusicate the construction of this tower?", 
   {}, 
   104654, 
   null, 
   1112794380.0
  ], 
  [
   104725, 
   null, 
   "sinjin", 
   "... it is plain to see that Whites are suffering from a sort of passive genocide.\n \n\n \n So now it's \"passive genocide\". I didn't see anything like that in your reference to U.N. standards for \"genocide\". Better stick to your c/p style and not tread out into deep water with only your own thoughts for flotation. About time to run away again isn't it?\n \n Some white people have no preference for white people. That just kills you doesn't it? You have to borrow some line of reasoning to explain this which usually involves characterizing them as dupes or worse. Could it be that it is you that fits this description?", 
   {}, 
   104649, 
   null, 
   1112806260.0
  ], 
  [
   104779, 
   null, 
   "jitobear", 
   "It's funny how many Whites make the obligatory claim in public that they are \"not racist\" and \"have Black friends\", etc. We all know the truth, however. Whites that live in racially diverse areas are some of the most resentful people concerning the forced racial integration that has swept America over the last few decades.\n\n \n I am white and live in a racially diverse neighborhood and household and am here to officially tell you that you are full of it.\n \n \nSince Brown vs. Board of Ed. in 1954, since the so-called \"Civil Rights\" era of the 1960's, and since the borders have been thrown open to the Third Worlders who flood into a previosly White America at the rate of 1 million annually.\n\n \n Whites were amongst those that flooded in actually. Have you never had a basic history lesson? You know \"Way back in 1492, Columbus sailed the ocean blue...\"\n \n \nNo doubt about it. There is a Jewish professor at Harvard who openly advocates the destruction of the White race.\n\n \n Name please. I want to read for myself what it is he is advocating. However I more than suspect you are distorting information if not bold face fibbing.\n \n \nUnfortunately, many of those whom you refer to are White themselves - they are the product of years and years of race-mixing propaganda that has been broadcast by Hollywood and the mass media.\n\n \n Or maybe they are products of actually getting to know other real live breathing people vs. stereotypes. The media did not have to tell me a thing. I simply got to know a wide variety of people.\n \n \nThe original Indian inhabitants of Central and South America have largely been exterminated through contact with Europeans. Either the Spaniards killed them, or they mongrelized with them. Both situations result in the same trend - namely, the disappearance of Indian bloodlines and culture from the earth. Whites must take action to avoid this fate for themselves.\n\n \n Why? What's so great about being pasty?\n \n \nAs to why there are \"so many\" individuals in Latin America, it is because the Mestizo population down there is artificially inflated because of White technology and medicine which have increased the life spans and reproduction rates of all Third Worlders. Simultaneously there has been a decrease of White births, along with the flooding of Europe and North America with non-Whites. Therefore, it is plain to see that Whites are suffering from a sort of passive genocide.\n\n \n Explain that one to some Mexicans - regardless of where they rank on the European vs. native scale and they will look at you like you are a friggen lunatic. It's all classism down there. Learned that from actually talking to and knowing Mexicans - I take their word over your inane babble any day.\n \n \nSome White people could care less if their people are vanquished forever from this planet. I am not one of those Whites.\n\n \n Some humans could care less if their fellow humans have any kind of character, courage or substance just so long as they are the right shade. I am not one of those humans.\n \n \nThat is a very hateful, prejudiced, and bigoted statement. It's amazing that people like you exist in this day and age.\n\n \n You are so THE WRONG person to say something like that, pal. You actually think you get rant about other races without hearing about yours? Honkey? Gringo? Cracker? White trash? WASP?", 
   {}, 
   104649, 
   null, 
   1112815440.0
  ], 
  [
   104882, 
   null, 
   "Duo_Maxwell", 
   "The original Indian inhabitants of Central and South America have largely been exterminated through contact with Europeans.\n\n \n Most of them yes, but that was not due to racial mixing, that was due to contact with diseases they lacked exposure to. \n \n \nEither the Spaniards killed them, or they mongrelized with them. Both situations result in the same trend - namely, the disappearance of Indian bloodlines and culture from the earth.\n\n \n Wrong. The Spanish military machine was met by the Aztecs (cortez that is) and was held off for quite some time. Only because of a epidemic brought by the Spanish was the Aztec empire crushed. As for the disappearnace of the Indian bloodlines, I disagree significently. If that was true, then the Latin American populations would be heavily Spanish and portugese, yet they are not. Significent phentypical varations exist between most of the natives of Latin america and Spain and portugal. The bloodlines are very much alive in the genes of millions. As for the culture, have you seen anything in Latin America? \n \n \n\n As to why there are \"so many\" individuals in Latin America, it is because the Mestizo population down there is artificially inflated because of White technology and medicine which have increased the life spans and reproduction rates of all Third Worlders.\n\n \n Artificially? That does apply to all races then. There would be no boom for European races if it was not for better medicine and the introduction of pest resilient crops and higher caloric crops such as the potato. \n \n \nSimultaneously there has been a decrease of White births, along with the flooding of Europe and North America with non-Whites. Therefore, it is plain to see that Whites are suffering from a sort of passive genocide.\n\n \n Ridiculous. Decrease in white births because of mixing? Plese, prove that. The countries with low birth rates are the countries that have significent child raising costs. If we assumed your assertion was correct, then Japan, who does not have a big mix of races should be suffering FROM flooding of other races. Yet that's not true at all. Japan has a low birth rate because of high costs, better jobs and a society that isn't pro-large families.", 
   {}, 
   104649, 
   null, 
   1112827440.0
  ], 
  [
   104946, 
   null, 
   "zachvac", 
   "\n That is a very hateful, prejudiced, and bigoted statement. It's amazing that people like you exist in this day and age.\n\n \n \n Lol, can you say hypocrite?", 
   {}, 
   104649, 
   null, 
   1112838900.0
  ], 
  [
   104947, 
   null, 
   "Duo_Maxwell", 
   "Lol, can you say hypocrite?\n\n \n Repeat after me class: HYP - O - CR - ITE!", 
   {}, 
   104946, 
   null, 
   1112839020.0
  ], 
  [
   104953, 
   null, 
   "zachvac", 
   "It's funny how many Whites make the obligatory claim in public that they are \"not racist\" and \"have Black friends\", etc. We all know the truth, however. Whites that live in racially diverse areas are some of the most resentful people concerning the forced racial integration that has swept America over the last few decades.\n \n\n I'm not racist. I have black friends. I have friends of many other races as well. How many people do you know that are resentful about racial integration?\n \n \n \n\n Since Brown vs. Board of Ed. in 1954, since the so-called \"Civil Rights\" era of the 1960's, and since the borders have been thrown open to the Third Worlders who flood into a previosly White America at the rate of 1 million annually.\n \n\n You are not forced to associate with them. If you want to have all white friends, fine. No one is forcing you to associate with anyone. You can stay locked up in your house if you want to. What's wrong with people imigrating from other countries? As long as it doesn't overpopulate the US, I don't have a problem with it.\n \n \n \n \n\n No doubt about it. There is a Jewish professor at Harvard who openly advocates the destruction of the White race. Unfortunately, many of those whom you refer to are White themselves - they are the product of years and years of race-mixing propaganda that has been broadcast by Hollywood and the mass media.\n \n\n Again, which professor.\n \n It's not race-mixing propaganda, it's first-hand experience. Sure I have white friends, but I have asian friends, Hispanic friends, black friends and many from races I don't know. It doesn't really matter to me.\n \n \n \n\n As to why there are \"so many\" individuals in Latin America, it is because the Mestizo population down there is artificially inflated because of White technology and medicine which have increased the life spans and reproduction rates of all Third Worlders. Simultaneously there has been a decrease of White births, along with the flooding of Europe and North America with non-Whites. Therefore, it is plain to see that Whites are suffering from a sort of passive genocide.\n \n\n Right, so all the technology and medicine is from whites. What's the difference if there are less whites? Let's get mad because of genocide against people with the last name starting with Z. There aren't many of them. It's genocide. Same as your scenario, pure bullshi*.\n \n \n \n\n Some White people could care less if their people are vanquished forever from this planet. I am not one of those Whites.\n \n\n I think we shouldn't even differentiate people based on race. I oppose black history month and affirmative action for that reason, the government shouldn't even recognize race when doing this kind of thing and a month for specifically teaching one race is just plain stupid. The only way we can acheive equality is when we eliminate race from the picture when the government is examining anything about anyone.\n \n \n \n \n\n That is a very hateful, prejudiced, and bigoted statement. It's amazing that people like you exist in this day and age.\n\n Again, you aren't one to talk after this post about hateful, prejudiced and bigoted.\n \n \"When there's only one race, and that's mankind, we shall be free\" - Garth Brooks", 
   {}, 
   104649, 
   null, 
   1112840520.0
  ], 
  [
   104954, 
   null, 
   "Big_Bear_Scot", 
   "I normally respect other posters points of view even if I don't agree with them, but unfortunally I can not do this is in this case.\n \n The first thing I need to point out is when did being white become a race, I thought white just meant skin colour ? How do you qualify for being in the white race for example I am from Celtic stock and I normally have white skin but when I get a tan I go really dark. So if we use the logic of skin colour=race then for about 8 months of the year I am of the white race and for the other 4 months I am of the slightly brown race then I guess ;)\n \n I point out several great things Racial integration has brought to my country Kebabs, Curry, Burritos, thousands of jobs with Immigrants coming in and making a success of themselves, Bangra(sp?) Music and I could go on forever.", 
   {}, 
   104947, 
   null, 
   1112840520.0
  ], 
  [
   104955, 
   null, 
   "Duo_Maxwell", 
   "What? No Greek food? \n \n I feel sorry for you. That stuff is the best.", 
   {}, 
   104954, 
   null, 
   1112840640.0
  ], 
  [
   104957, 
   null, 
   "Big_Bear_Scot", 
   "What? No Greek food?\n \n \n Yep, there is a few Greek Restraunts about Glasgow. I have still to try Greek food but I have tried nearly everything else so Greek is next on my list.\n \n In fact lets hijack this thread with good things that have been brought into our various Countries by Immigrants and Racial Integration.", 
   {}, 
   104955, 
   null, 
   1112840820.0
  ], 
  [
   104963, 
   null, 
   "Duo_Maxwell", 
   "Yep, there is a few Greek Restraunts about Glasgow. I have still to try Greek food but I have tried nearly everything else so Greek is next on my list.\n \n In fact lets hijack this thread with good things that have been brought into our various Countries by Immigrants and Racial Integration.\n\n \n If you're a cheese lover, see if they offer, I forgot what it's called, but it's a big piece of some kind of cheese, they pour some alochol on it, and then light it on fire. It's apparently extremely tasty, but bad for your weight and cholesteral. \n \n Know what's even better then that? \n \n Posting pictures of hot mixed girls. emoticon_xlove emoticon_xlove emoticon_xlove\n \n How many of the top  50 female models are mixed? I'd say a good amount.", 
   {}, 
   104957, 
   null, 
   1112841660.0
  ], 
  [
   104964, 
   null, 
   "sinjin", 
   "I wish I were sitting in Tennents Bar right now.", 
   {}, 
   104957, 
   null, 
   1112841900.0
  ], 
  [
   104965, 
   null, 
   "Duo_Maxwell", 
   "Nothing hijacks a thread faster then raging male hormones coupled with pictures of pretty girls.", 
   {}, 
   104964, 
   null, 
   1112842080.0
  ], 
  [
   105044, 
   null, 
   "Big_Bear_Scot", 
   "I wish I were sitting in Tennents Bar right now.\n \n \n Are you talking about Tennents Bar in Byers Road in Glasgow ?\n \n \nIf you're a cheese lover, see if they offer, I forgot what it's called, but it's a big piece of some kind of cheese, they pour some alochol on it, and then light it on fire. It's apparently extremely tasty, but bad for your weight and cholesteral.\n \n \n Cool sounds really good, don't worry as I get older I realise I am fighting losing battle against weight and cholesterol. It has got to the stage I don't calories anymore.\n \n \nPosting pictures of hot mixed girls.\n \n \n Nice, some of the most beautiful women I have ever seen have been mixed race. That is the best method I have ever seen to hijack thread just post some pics of Hot women. :)", 
   {}, 
   104965, 
   null, 
   1112867400.0
  ], 
  [
   105133, 
   null, 
   "sinjin", 
   "Are you talking about Tennents Bar in Byers Road in Glasgow ?\n \n\n \n The very same. When you mentioned Glasgow I had a fond recollection come to mind.", 
   {}, 
   105044, 
   null, 
   1112892720.0
  ], 
  [
   105261, 
   null, 
   "Dzeron", 
   "It's funny how many Whites make the obligatory claim in public that they are \"not racist\" and \"have Black friends\", etc. We all know the truth, however. Whites that live in racially diverse areas are some of the most resentful people concerning the forced racial integration that has swept America over the last few decades.\n \n\n \n Forced racial integration should create resentment, but not towards the other races - towards the government.", 
   {}, 
   104649, 
   null, 
   1112914380.0
  ], 
  [
   105297, 
   null, 
   "gnojek", 
   "funny that whites think they are at the top of the race pyramid\n\n Which whites are these? All whites?\n \n \nNo doubt about it. There is a Jewish professor at Harvard who openly advocates the destruction of the White race. \n\n Why aren't Jews considered white?\n Even the ones in Israel look pretty white to me.\n \n \nAs to why there are \"so many\" individuals in Latin America, it is because the Mestizo population down there is artificially inflated because of White technology and medicine which have increased the life spans and reproduction rates of all Third Worlders.\n\n This is pretty funny. They have \"artificially\" long lifespans because of \"white technology.\" This is amazing. emoticon_smile\n Like the other guy said, how long would our lives be or how advanced would our technology be without the agricultural advances made by very non-white people at the same time that white europeans were still hunting and gathering and saying \"UG\"?", 
   {}, 
   104550, 
   null, 
   1112922180.0
  ], 
  [
   105530, 
   null, 
   "Mucusaur", 
   "Siegfriedson, what are you willing to do about this rise of moral decay, this rise of anti white feeling? What will you do? \n \n If anything the fact that there never has been a \"race war\" in recent times means either \n a) there never was a conflict, or \n b) the white race is unable to take action, showing that it is the inferior \"species\", doomed to extinction by the superior blacks, hispanics, etc.", 
   {}, 
   105297, 
   null, 
   1112992380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Racial Integration = Genocide", 
  "url": "http://www.4forums.com/political/civil-rights-debates/4718-racial-integration-genocide.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 4718, 
  "discussion_files": [
   [
    "13922.html", 
    "http://www.4forums.com/political/civil-rights-debates/4718-racial-integration-genocide-print.html"
   ], 
   [
    "13923.html", 
    "http://www.4forums.com/political/civil-rights-debates/4718-racial-integration-genocide-4-print.html"
   ], 
   [
    "13924.html", 
    "http://www.4forums.com/political/civil-rights-debates/4718-racial-integration-genocide-3-print.html"
   ], 
   [
    "13925.html", 
    "http://www.4forums.com/political/civil-rights-debates/4718-racial-integration-genocide-2-print.html"
   ]
  ], 
  "identifier": 4718
 }
]