[
 [
  [
   103855, 
   null, 
   "jim's trucking", 
   "...to curtail abortions.\n \n Any woman who has an abortion for convenience only (not raped, no incest, no danger to the mother's life) shall have both ovaries removed.\n \n What do y'all think?", 
   {
    "post_info": {
     "post_title": "I have a solution..."
    }
   }, 
   null, 
   null, 
   1112558580.0
  ], 
  [
   103863, 
   null, 
   "Steeeeve", 
   "We have that \"cruel and unusual\" thing going on the constitution sadly :p", 
   {}, 
   103855, 
   null, 
   1112559660.0
  ], 
  [
   103875, 
   null, 
   "jitobear", 
   "...to curtail abortions.\n \n Any woman who has an abortion for convenience only (not raped, no incest, no danger to the mother's life) shall have both ovaries removed.\n \n What do y'all think?\n\n \n As long as we cut off the privates of the fathers as well.", 
   {}, 
   103855, 
   null, 
   1112562660.0
  ], 
  [
   103877, 
   null, 
   "Cone", 
   "why don't we just outlaw convenience abortions?", 
   {}, 
   103875, 
   null, 
   1112563800.0
  ], 
  [
   103878, 
   null, 
   "Clive14", 
   "why don't we just outlaw convenience abortions?\nWon't work. \"danger to the mother's life\" has to cover allowing an abortion if there is a significant risk of psychological damage which might lead to suicide. Any doctor, especially in a country like yours with a runaway litigation culture, faced with \"I will kill myself and the baby if you don't abort\" will decide there is a significant risk (to his wallet mainly). It is for this reason that \"convenience abortions\" are technically illegal here in the UK, but they occur anyway.", 
   {}, 
   103877, 
   null, 
   1112564160.0
  ], 
  [
   103883, 
   null, 
   "Cone", 
   "Won't work. \"danger to the mother's life\" has to cover allowing an abortion if there is a significant risk of psychological damage which might lead to suicide. Any doctor, especially in a country like yours with a runaway litigation culture, faced with \"I will kill myself and the baby if you don't abort\" will decide there is a significant risk (to his wallet mainly). It is for this reason that \"convenience abortions\" are technically illegal here in the UK, but they occur anyway.\n\n Those abortions that are perpetrated as \"birth control\" should be outlawed.", 
   {}, 
   103878, 
   null, 
   1112565420.0
  ], 
  [
   103886, 
   null, 
   "Duo_Maxwell", 
   "...to curtail abortions.\n \n Any woman who has an abortion for convenience only (not raped, no incest, no danger to the mother's life) shall have both ovaries removed.\n \n What do y'all think?\n\n \n Actually there is a better solution. \n \n Mandatory male and female birth control pills, financial penalties if you stop taking. Anyone who would get off the pill would want a kid, therefore, abortions would cease.", 
   {}, 
   103855, 
   null, 
   1112566080.0
  ], 
  [
   103887, 
   null, 
   "Cone", 
   "Actually there is a better solution. \n \n Mandatory male and female birth control pills, financial penalties if you stop taking. Anyone who would get off the pill would want a kid, therefore, abortions would cease.\n\n so we would penalize financially those who want to have kids?", 
   {}, 
   103886, 
   null, 
   1112566320.0
  ], 
  [
   103898, 
   null, 
   "Duo_Maxwell", 
   "so we would penalize financially those who want to have kids?\n\n \n Well, I forgot to add one thing: a legal notice to the gov't about such behavior.", 
   {}, 
   103887, 
   null, 
   1112568120.0
  ], 
  [
   103940, 
   null, 
   "Steeeeve", 
   "or just outlaw abortion..", 
   {}, 
   103898, 
   null, 
   1112571600.0
  ], 
  [
   103946, 
   null, 
   "Clive14", 
   "or just outlaw abortion..\nNope, doesn't work as that just forces women into illegal abortions which threatens their health and life as well as terminating another before it has properly begun.", 
   {}, 
   103940, 
   null, 
   1112572020.0
  ], 
  [
   103955, 
   null, 
   "Steeeeve", 
   "IF women dieing is so bad then why is it not bad to kill the baby in her?", 
   {}, 
   103946, 
   null, 
   1112572680.0
  ], 
  [
   103960, 
   null, 
   "Clive14", 
   "IF women dieing is so bad then why is it not bad to kill the baby in her?\nIt is. If you kill a pregnant woman, then you should be charged with a double murder.", 
   {}, 
   103955, 
   null, 
   1112572860.0
  ], 
  [
   103971, 
   null, 
   "Steeeeve", 
   "so if you outlaw abortion you save all the lives that woulda been killed if there was abortion...So why is having abortion outlawed and SOME women kill themsevles getting an abortion better than having abortion where millions of unborns are killed?", 
   {}, 
   103960, 
   null, 
   1112573460.0
  ], 
  [
   104216, 
   null, 
   "jitobear", 
   "so if you outlaw abortion you save all the lives that woulda been killed if there was abortion...So why is having abortion outlawed and SOME women kill themsevles getting an abortion better than having abortion where millions of unborns are killed?\n\n \n I think the number of women that would go underground would make your head spin.\n \n Anyway - I still don't see why lifers and choicers simply join forces and use all this time and energy to help pregnant women more. There are ways to address abortion that neither side should have to be opposed to. I know Steve here isn't.\n \n Lots of nothing has been going on for years.", 
   {}, 
   103971, 
   null, 
   1112670840.0
  ], 
  [
   104240, 
   null, 
   "Steeeeve", 
   "I think the number of women that would go underground would make your head spin.\n\n \n But all the evidence shows otherwise...what little we have atleast.\n Besides, there would still be more abortions then women going underground...and even less deaths. I think once a few doctors got charged with murder then we would see less of those anyway.\n \n \nAnyway - I still don't see why lifers and choicers simply join forces and use all this time and energy to help pregnant women more. There are ways to address abortion that neither side should have to be opposed to. I know Steve here isn't.\n\n A good call indeed. In fact I would like to see more of this (it doesn't even have to be just women)...Instead of marches and protests...I think it would be more helpful to actually help the people. For example we had on campus a \"take back the night\" womens march. Besides the fact that it did nothing, the men were not allowed to march in front, they had to stay in the back...It just seemed odd and didn't solve anything. I am more than willing to help out, maybe we can come up with some ideas here on the forums!! Lets here some!", 
   {}, 
   104216, 
   null, 
   1112674500.0
  ], 
  [
   104245, 
   null, 
   "zachvac", 
   "\n A good call indeed. In fact I would like to see more of this (it doesn't even have to be just women)...Instead of marches and protests...I think it would be more helpful to actually help the people. For example we had on campus a \"take back the night\" womens march. Besides the fact that it did nothing, the men were not allowed to march in front, they had to stay in the back...It just seemed odd and didn't solve anything. I am more than willing to help out, maybe we can come up with some ideas here on the forums!! Lets here some!\n\n \n \n How about a compromise. All people who want abortions are just killed. It's a compromise. Pro-lifers give up the right to life they want of the embryo and pro-choicers give up the right they want for woman to control their bodies. It's a win-win situation, actually it's really a lose-lose situation, but at least neither of them has the upper hand (I hope you can tell I'm joking)", 
   {}, 
   104240, 
   null, 
   1112674800.0
  ], 
  [
   104251, 
   null, 
   "Steeeeve", 
   "lol, yeah I could tell....hehe, I laughed :)\n \n I actually suggested to my friend that we have abortions for people up to the age of 60...and then again at 70. So a 10 year period where you can't be aborted. If your parents are dead then the government or spouse gets to decide. The one plus to this would be no more annoying high school/middle school kids.", 
   {}, 
   104245, 
   null, 
   1112675400.0
  ], 
  [
   104259, 
   null, 
   "Hunter", 
   "I have an idea. Why don't folks get their heads out of their rectums and just realize that abortion is murder. Only the village idiot could argue otherwise. What in the Hell has happened to America that one half of the population thinks that the murder of un-born children for the conveniance of the mother is a healthy activity?", 
   {}, 
   104216, 
   null, 
   1112678040.0
  ], 
  [
   104284, 
   null, 
   "Steeeeve", 
   "same reason why slavery was \"ok\" back in the day...after it is around awhile people assume it is right.", 
   {}, 
   104259, 
   null, 
   1112680080.0
  ], 
  [
   104289, 
   null, 
   "jitobear", 
   "I have an idea. Why don't folks get their heads out of their rectums and just realize that abortion is murder. Only the village idiot could argue otherwise. What in the Hell has happened to America that one half of the population thinks that the murder of un-born children for the conveniance of the mother is a healthy activity?\n\n \n \n SEE - SEE! Trivialize the issues. There is never anything wrong. Every pregnant woman is happy, healthy and needs nothing from me. She can just have that baby - and I don't even have to give a ****.\n \n Attitude's like Hunter's keep me pro-choice.", 
   {}, 
   104259, 
   null, 
   1112680740.0
  ], 
  [
   104291, 
   null, 
   "Steeeeve", 
   "emoticon_cool Hunter, no offense intended to you...i am even pro-life...but you gotta calm it down a bit. Yellng and calling people murderers will only enrage more and does not help any cause. Pro-life is about promoting life...not hate.", 
   {}, 
   104289, 
   null, 
   1112680920.0
  ], 
  [
   104351, 
   null, 
   "Clive14", 
   "I have an idea. Why don't folks get their heads out of their rectums and just realize that abortion is murder. Only the village idiot could argue otherwise.\nVillage idiot ro the rescue! Murder is an illegal killing, abortion is legal. Therefore which ever way one looks at it, abortion in your country ain't murder.\n \n Lucky there was a village idiot around to explain this simple concept. Hurrah!", 
   {}, 
   104259, 
   null, 
   1112712600.0
  ], 
  [
   106028, 
   null, 
   "Sgt. Moose", 
   "I am a firm believer in being responsible for your actions; I feel that you must be held accountable for the choices you make. Therefore, I think convenience abortions should be illegal. The suicide thing....that's ****, for lack of a better term. No matter what happens to you, you are the one who pulls the trigger, ties the rope, etc. An abortion should only be allowed if the mother's life is directly in danger. You shouldn't be allowed to have an abortion just because you could have psycological damage otherwise. That's like saying, \"Y'know, I don't think I'm gonna drive my car today, because I could get killed.\" \n \n Meh. \n \n (oh, and the above poster is right......murder is defined as the \"unlawful killing of a human being.\" So therefore, abortion is not murder as it is legal. The same principle could be applied to war, the death penalty, and any number of things.\"\n \n \n EDIT: We're not allowed to say \"the-word-that-starts-with-a-c-and-rhymes-with-'Rap'\"? Huh.", 
   {}, 
   104351, 
   null, 
   1113187260.0
  ], 
  [
   106042, 
   null, 
   "Steeeeve", 
   "lol, its not exactly legal...the laws that make it illegal just can't be enforced thanks to our congress..you know...the 9 guys that make decisions for us all. (note for the slow: I'm making fun of the SC)", 
   {}, 
   106028, 
   null, 
   1113192660.0
  ], 
  [
   106043, 
   null, 
   "jitobear", 
   "Sorry Sarge - as I have told Steve and countless others - unless you can see why a rape victim deserves the right to end a pregnancy your 'responsibility' argument doesn't hold water and I won't see you as anything but a schmuck who wants to control women.\n \n Plus it only demands the responsibility from women. Now don't start your \"he can pay child support\" rhetoric - as nobody HAS to be a parent - what I wantto know is how you expect to hold men accountable for the pregnancies  they start? How about - she has to carry the child and he has to foot the doctor's bill? Come on - something to prove to me that you actually believe that men should be responsible, too. Or maybe you don't.", 
   {}, 
   106042, 
   null, 
   1113193380.0
  ], 
  [
   106059, 
   null, 
   "Hunter", 
   "Okay then, one more time, abortion is wrong and every person knows that in their heart and soul. How many people who are pro-murdering un-born children wish that their mommas had aborted them? None! Case closed. emoticon_wow", 
   {}, 
   106043, 
   null, 
   1113197520.0
  ], 
  [
   106069, 
   null, 
   "Duo_Maxwell", 
   "Okay then, one more time, abortion is wrong and every person knows that in their heart and soul. How many people who are pro-murdering un-born children wish that their mommas had aborted them? None! Case closed. emoticon_wow\n\n \n With a few magic words, the case is now magically open:\n \n Me at times.\n \n Don't you hate it when someone just comes in and proves your arrogant statement's oh so very wrong?\n \n Lesson to be learned; don't make such statements.", 
   {}, 
   106059, 
   null, 
   1113206640.0
  ], 
  [
   106093, 
   null, 
   "Sgt. Moose", 
   "Sorry Sarge - as I have told Steve and countless others - unless you can see why a rape victim deserves the right to end a pregnancy your 'responsibility' argument doesn't hold water and I won't see you as anything but a schmuck who wants to control women.\n \n \n\n \n \n I don't see why a rape victim doesn't have the right to end a pregnancy.", 
   {}, 
   106043, 
   null, 
   1113228060.0
  ], 
  [
   106103, 
   null, 
   "Clive14", 
   "Okay then, one more time, abortion is wrong and every person knows that in their heart and soul.\nI very much doubt I have a soul and I use my heart for pumping blood, not for moralising. Now I know with my head that abortion is right in some circumstances. You too could form this opinion if you used your head. :p", 
   {}, 
   106059, 
   null, 
   1113230280.0
  ], 
  [
   106194, 
   null, 
   "jitobear", 
   "I don't see why a rape victim doesn't have the right to end a pregnancy.\n\n \n In your previous post you touted responsibility and then said you only believed abortion acceptable if the pregnancy threatened the life of the mother. Well a rape victim is not irresponsible, so demanding the same of her as somebody who was irresponsible just shoots holes through a responsibility stance. But if that is not your view, and you do believe rape victims should have the option, I buy your argument and am willing to work to find middle ground in reducing abortion with you.\n \n However, I am pro-choice. I don't believe abortion bans will fix the problem.", 
   {}, 
   106093, 
   null, 
   1113249060.0
  ], 
  [
   106214, 
   null, 
   "simone", 
   "SEE - SEE! Trivialize the issues. There is never anything wrong. Every pregnant woman is happy, healthy and needs nothing from me. She can just have that baby - and I don't even have to give a ****.\n \n Attitude's like Hunter's keep me pro-choice.\n\n Amen! JitoBear! Amen!", 
   {}, 
   104289, 
   null, 
   1113254100.0
  ], 
  [
   106225, 
   null, 
   "Sgt. Moose", 
   "In your previous post you touted responsibility and then said you only believed abortion acceptable if the pregnancy threatened the life of the mother. Well a rape victim is not irresponsible, so demanding the same of her as somebody who was irresponsible just shoots holes through a responsibility stance. But if that is not your view, and you do believe rape victims should have the option, I buy your argument and am willing to work to find middle ground in reducing abortion with you.\n \n However, I am pro-choice. I don't believe abortion bans will fix the problem.\n\n \n \n \n Well of course it's ok in a rape case, I think just about everyone thinks it's ok in rape, incest, or if the mother's life was threatened. All I meant is that I thought \"convenience abortions\" shouldn't be ok.", 
   {}, 
   106194, 
   null, 
   1113256620.0
  ], 
  [
   106242, 
   null, 
   "simone", 
   "Um, so just tell me how wonderfully \"convenient\" being pregnant is. Swollen ankles, peeing every two minutes, doctor bills, mass discomfort, the trauma of giving birth, the responsibilities of a child--um, guess you're a guy who's never had any responsibility at all for a child so what the heck would you know.", 
   {}, 
   106225, 
   null, 
   1113264060.0
  ], 
  [
   106303, 
   null, 
   "Steeeeve", 
   "I really don't like the arguement about doing what the women wants over the kids life...seems to selfish to me...I am all about helping others.\n \n We talked about this before...\n \n rape doesn't seem like a good reason for an abortion to me...in fact, logically you would think they would do the opposite and have the kid...lets explain again why...\n \n If one is raped chances are they didn't like it...they didn't like someone doing what the wanted to them (nor should they)...now, a little kid is in the mom now...you think he/she would want someone to do what they wanted to him/her? To me rape, in a way, is a form of killing...I think that the solution to this would be killing. However, should we maybe help raped victims more? Yes, I think there should be programs that actually help the girl out...she is probably in a tramatic state and asking her whether or not she wants to kill the kid doesn't seem like a great question then.", 
   {}, 
   106242, 
   null, 
   1113277140.0
  ], 
  [
   106308, 
   null, 
   "jitobear", 
   "I really don't like the arguement about doing what the women wants over the kids life...seems to selfish to me...I am all about helping others.\n \n We talked about this before...\n \n rape doesn't seem like a good reason for an abortion to me...in fact, logically you would think they would do the opposite and have the kid...lets explain again why...\n \n If one is raped chances are they didn't like it...they didn't like someone doing what the wanted to them (nor should they)...now, a little kid is in the mom now...you think he/she would want someone to do what they wanted to him/her? To me rape, in a way, is a form of killing...I think that the solution to this would be killing. However, should we maybe help raped victims more? Yes, I think there should be programs that actually help the girl out...she is probably in a tramatic state and asking her whether or not she wants to kill the kid doesn't seem like a great question then.\n\n \n Your musings are very sweet. But I don't have to muse. If I were pregnant from rape I would get rid of it. As a matter of fact if I were raped I would go to the hospital, get a rape kit done, report the crime, and take the morning after pill. I have no romantic illusions about rape, pregnancy or parenting, having been through all three in this life. I am am absolutely certain this would be my course of action, even now with my tubes tied - I would take NO chance. No way.\n \n And Steve, lifers have got to stop with the \"I know what's best for you\" tone with total strangers when they clearly can't possibly know.\n \n Help pregnant women, don't demonize, and be responsible yourself and you will do tons more for abortion than endorsing restrictive legislation.", 
   {}, 
   106303, 
   null, 
   1113278100.0
  ], 
  [
   106313, 
   null, 
   "jitobear", 
   "Well of course it's ok in a rape case, I think just about everyone thinks it's ok in rape, incest, or if the mother's life was threatened. All I meant is that I thought \"convenience abortions\" shouldn't be ok.\n\n \n But pregnancy is more than an inconvenience. It's a really big deal. Women who are pregnant have to face serious issues and many potential risks. It has massive financial, health, emotional, and mental impacts. Everything has to change. Women who choose to have an abortion have valid reasons. Very few women treat abortion lightly - and the ones who do - well it's unlikely they will maintain a healthy pregnancy. Whatever her reason for choosing abortion be - money, fear, health, in an abusive situation, her age, addictions - they are valid things that WILL impact the pregnancy. Taking away abortion won't make everything OK and save a bundle of babies - it will simply make everything scarier and harder for a woman in an already hard place.\n \n So do we do nothing? No. I say we find ways to address these things so that abortion doesn't have to be the choice they turn to. But I tell you - it is really hard to get lifers on board for this. They simply dismiss that there are any real issues - dump them all in a bucket they either label \"convenience\" or \"birth control\" and demonize the women in these situations.\n \n You can't have a successful pregnancy without the mother - that means acknowledging and addressing her issues - not demonizing her and putting shackles on her options.", 
   {}, 
   106225, 
   null, 
   1113278700.0
  ], 
  [
   106316, 
   null, 
   "Sgt. Moose", 
   "Um, so just tell me how wonderfully \"convenient\" being pregnant is. Swollen ankles, peeing every two minutes, doctor bills, mass discomfort, the trauma of giving birth, the responsibilities of a child--um, guess you're a guy who's never had any responsibility at all for a child so what the heck would you know.\n\n \n Reap what you sow...that's all I've got to say.", 
   {}, 
   106242, 
   null, 
   1113279300.0
  ], 
  [
   106317, 
   null, 
   "jitobear", 
   "Reap what you sow...that's all I've got to say.\n\n \n And the men? What is their consequence? \n \n And I am not talking about parenting - as noboby ever has to be a parent. What is their consequence in having helped cause an unwanted pregnancy? Or do you only think women deserve punishment for their sexuality?\n \n It has been stated before - using pregnancy as punishment is a horrible thing to do to both mother and child - and does not indicate that you really care about the welfare of anyone at all.", 
   {}, 
   106316, 
   null, 
   1113279420.0
  ], 
  [
   106318, 
   null, 
   "Sgt. Moose", 
   "Dunno. I agree that women get the short end of the stick though. Maybe stick the father with the kid? I dunno.\n \n \n \n EDIT: Don't edit your post to make me look stupid.", 
   {}, 
   106317, 
   null, 
   1113279540.0
  ], 
  [
   106326, 
   null, 
   "Steeeeve", 
   "Your musings are very sweet. But I don't have to muse. If I were pregnant from rape I would get rid of it. As a matter of fact if I were raped I would go to the hospital, get a rape kit done, report the crime, and take the morning after pill. I have no romantic illusions about rape, pregnancy or parenting, having been through all three in this life. I am am absolutely certain this would be my course of action, even now with my tubes tied - I would take NO chance. No way.\n \n And Steve, lifers have got to stop with the \"I know what's best for you\" tone with total strangers when they clearly can't possibly know.\n \n Help pregnant women, don't demonize, and be responsible yourself and you will do tons more for abortion than endorsing restrictive legislation.\n\n \n lol, the \"I know whats best\" doesnt exist. Even so...do you know whats best for the kid inside you? Probably not...the kid knows best...and since he can't speak we should probably wait until he can and ask him whether or not he wishes to live... I never said don't help pregnant women...in fact I think I promoted that. But abortion is not helping anyone other then it being a quick fix. This culture of selfishness is not gonna lead to anything good..in fact it has already caused severe harm.\n \n \nAnd the men? What is their consequence? \n \n\n What does this matter? Don't turn the attention to the men..the consequences for the men don't really matter in this issue...and don't make the consequences for thet women any less.", 
   {}, 
   106308, 
   null, 
   1113283560.0
  ], 
  [
   106437, 
   null, 
   "jitobear", 
   "Dunno. I agree that women get the short end of the stick though. Maybe stick the father with the kid? I dunno.\n \n \n \n EDIT: Don't edit your post to make me look stupid.\n\n \n I didn't - I posted and edited it twice before ever seeing your post. It was just a timing issue.", 
   {}, 
   106318, 
   null, 
   1113334620.0
  ], 
  [
   106439, 
   null, 
   "jitobear", 
   "lol, the \"I know whats best\" doesnt exist.\n\n \n And just what is your whole paragragh about why it would be better for a rape victim to keep the baby then? How the hell would you know?\n \n \nEven so...do you know whats best for the kid inside you? Probably not...the kid knows best...and since he can't speak we should probably wait until he can and ask him whether or not he wishes to live... \n\n \n Are you suggesting the emancipation of all children then?\n Regardless of what you may muse will be best for the baby inside me - it doesn't get to be there without my OK. And in rape - that never happened. You can't come into my damned house without my OK - let alone my body.\n \n You will not get me to squish here, Steve. I know you have good intentions in your heart but I will fight you bloody to protect the rights of raped women. You have no damned idea what you are proposing. A woman's right to her body has been taken away and you would suggest continuing that? That is what I call a nine month rape.\n \n Thank God the law is not on your side here - and neither are most people - even those who are pro-life.\n \n \nI never said don't help pregnant women...in fact I think I promoted that. But abortion is not helping anyone other then it being a quick fix. This culture of selfishness is not gonna lead to anything good..in fact it has already caused severe harm.\n\n \n I know you didn't - I have acknowledged that you are for helping them.\n \n And the hell it hasn't helped anyone. I can think of two people right off the top of my head. One was a 12 year old girl pregnant by her own father after years of sexual abuse. She got an abortion, a foster family and a the right to have safety and control of her own body for the first time in her life.\n \n \nThis culture of selfishness is not gonna lead to anything good..in fact it has already caused severe harm.\n\n \n It is not selfish for a rape victim to not want the responsibility of a pregnancy she did not consent to. Women are not mere baby making machines who can be expected to DROP EVERYTHING the second they get pregnant regardless of their own lives, needs, and responsibilities.\n \n \nWhat does this matter? Don't turn the attention to the men..the consequences for the men don't really matter in this issue...and don't make the consequences for thet women any less.\n\n \n The hell I won't and don't you dare skirt this or you can take your high horse right back in the barn. Why would you hold women to a higher standard of responsibility regarding pregnancy than men? Granted, men can't BE pregnant - but how you dare you insult women and call them selfish and then ask that we look the other way in regards to men being selfish. \n \n And remember - not parenting - but pregnancy. What are his consequences?", 
   {}, 
   106326, 
   null, 
   1113335580.0
  ], 
  [
   106521, 
   null, 
   "Steeeeve", 
   "I believe I have already addressed all these claims.", 
   {}, 
   106439, 
   null, 
   1113347880.0
  ], 
  [
   106553, 
   null, 
   "Sgt. Moose", 
   "\n \n And remember - not parenting - but pregnancy. What are his consequences?\n\n \n \n Well, there aren't any really. That's the way humans and almost every animal I know of are set up. Is it fair? No. But who said life was fair?\n \n \n *note that this isn't an argument, simply an explanation.", 
   {}, 
   106439, 
   null, 
   1113354060.0
  ], 
  [
   106559, 
   null, 
   "Voice Of Reason", 
   "...to curtail abortions.\n \n Any woman who has an abortion for convenience only (not raped, no incest, no danger to the mother's life) shall have both ovaries removed.\n \n What do y'all think?\n\n \n I personally think you go after the butcher abortion doctor and prosecute him.....", 
   {}, 
   103855, 
   null, 
   1113355140.0
  ], 
  [
   106623, 
   null, 
   "Duo_Maxwell", 
   "I personally think you go after the butcher abortion doctor and prosecute him.....\n\n \n Yes, let's prosecute someone for following the law. emoticon_rolleyes", 
   {}, 
   106559, 
   null, 
   1113381060.0
  ], 
  [
   106653, 
   null, 
   "VTCruiser", 
   "Maybe one reason that we would have a problem with illegal abortions is because ALL WE TEACH IN OUR DANG PUBLIC SCHOOLS IS THAT AN ABORTION IS OK TO HAVE!!\n \n We need to change our sex education philosophy..", 
   {}, 
   103855, 
   null, 
   1113405840.0
  ], 
  [
   106655, 
   null, 
   "Steeeeve", 
   "What law are you referring to? Something like 38 states I think have laws against abortion....so what law??? I don't recall any law saying that doctors have to give abortions and I don't recall a law the permits them (in most states)...So I ask again, which law?\n \n To which he will most likely answer \"roe vs wade\"....In which I will respond to \"thats not a law because judges don't make laws (in theory)\" Thus proving my case that roe vs wade was an illegal decision.\n \n So lets just skip over all of this.", 
   {}, 
   106623, 
   null, 
   1113406020.0
  ], 
  [
   106676, 
   null, 
   "jitobear", 
   "Well, there aren't any really. That's the way humans and almost every animal I know of are set up. Is it fair? No. But who said life was fair?\n \n \n *note that this isn't an argument, simply an explanation.\n\n \n Then this isn't about babies for you. It's controlling and demeaning women.", 
   {}, 
   106553, 
   null, 
   1113409560.0
  ], 
  [
   106775, 
   null, 
   "Steeeeve", 
   "lol, not to be mean or another, but the belief that all men are out there to demean and degrade women is just not true...there are as many men out there hurting women as there aer women hurting men....I don't think \"abuse\" (for lack of better word) is based on anything other then the way a person is brought up.", 
   {}, 
   106676, 
   null, 
   1113420720.0
  ], 
  [
   106783, 
   null, 
   "Cone", 
   "Yes, let's prosecute someone for following the law. emoticon_rolleyes\n\n This has already been said, but I add my curiosity to the mix...\n \n What law are you referring to? emoticon_rolleyes", 
   {}, 
   106623, 
   null, 
   1113421260.0
  ], 
  [
   106834, 
   null, 
   "jitobear", 
   "lol, not to be mean or another, but the belief that all men are out there to demean and degrade women is just not true...there are as many men out there hurting women as there aer women hurting men....I don't think \"abuse\" (for lack of better word) is based on anything other then the way a person is brought up.\n\n \n I did not say all men do. I accused the Sgt only.", 
   {}, 
   106775, 
   null, 
   1113427560.0
  ], 
  [
   110062, 
   null, 
   "Linus", 
   "Yo Jim, ever wonder why abortion is still legal?\n Keep making posts like that...seriously, maybe you'll understand then.", 
   {
    "unicode_changes_made": true
   }, 
   103855, 
   null, 
   1114053360.0
  ], 
  [
   110073, 
   null, 
   "Duo_Maxwell", 
   "This has already been said, but I add my curiosity to the mix...\n \n What law are you referring to? emoticon_rolleyes\n\n \n The law that VOR is talking about. He says we should prosecute abortion doctors for performing abortions.", 
   {}, 
   106783, 
   null, 
   1114054740.0
  ], 
  [
   110108, 
   null, 
   "Steeeeve", 
   "Yo Jim, ever wonder why abortion is still legal?\n Keep making posts like that...seriously, maybe you'll understand then.\n\n \n It is still legal because it would take a constitution amendment to make it illegal...Which if odd because he court case was illegal to begin with!! Talk about abuse of power.", 
   {
    "unicode_changes_made": true
   }, 
   110062, 
   null, 
   1114059000.0
  ], 
  [
   110146, 
   null, 
   "Linus", 
   "\"It is still legal because it would take a constitution amendment to make it illegal...\" \n \n You had your chance with the Human Life Amendment during the 1980s and you guys blew it. It has nothing to do with a constitutional amendment but instead that so many become turned off by the pro-life movement because of it's radical tactics. If people were against Roe v Wade then it would happen...however that isn't the case. \n \n \n \"Which if odd because he court case was illegal to begin with!! Talk about abuse of power.\"\n \n The criminalization of abortion was the real abuse of power. It was mostly done by a few sexist and political oppertunist members of the AMA to stop women from practicing medicine and by xenophobic/racist Protestant groups who feared a non-white/non-Protestant majority here in America after the Civil War cleared out many of them.", 
   {}, 
   110108, 
   null, 
   1114066200.0
  ], 
  [
   110196, 
   null, 
   "jim's trucking", 
   "And the men? What is their consequence?  And I am not talking about parenting - as noboby ever has to be a parent. What is their consequence in having helped cause an unwanted pregnancy? Or do you only think women deserve punishment for their sexuality?\n \n It has been stated before - using pregnancy as punishment is a horrible thing to do to both mother and child - and does not indicate that you really care about the welfare of anyone at all.\n\n \n In an Appalachian\n \n Greyhound Station\n \n She sits waitin'\n \n In a family way.\n \n \n \n \n Well, goodbye , brother.\n \n Tell Mom I love her.\n \n An' tell all the others\n \n I'll write someday.\n \n \n \n From a teenage lover\n \n to an unwed mother\n \n kept under covers\n \n like some bad dream\n \n while unwed fathers\n \n they can't be bothered\n \n they run like water\n \n from a mountain stream.\n \n \n \n \n \n \n \n In a cold and grey town\n \n a nurse says, \"Lay down!\n \n This ain't no play ground\n \n and this ain't home.\n \n Someone's children\n \n out havin' children\n \n in a grey stone buildin'\n \n all alone.\"\n \n \n \n \n From a teenage lover\n \n to an unwed mother\n \n kept under covers\n \n like some bad dream\n \n while unwed fathers\n \n they can't be bothered\n \n they run like water\n \n from a mountain stream.\n \n \n \n \n \n Somewhere else bound\n \n Smokey Mountain Greyhound\n \n she bows her head down\n \n hummin' lullabies.\n \n Your Daddy never\n \n meant to hurt you ever\n \n he just don't live here\n \n but you've got his eyes.\n \n \n \n \n \n From a teenage lover\n \n to an unwed mother\n \n kept under covers\n \n like some bad dream\n \n while unwed fathers\n \n they can't be bothered\n \n they run like water\n \n from a mountain stream.", 
   {}, 
   106317, 
   null, 
   1114091700.0
  ], 
  [
   110204, 
   null, 
   "Cone", 
   "\"It is still legal because it would take a constitution amendment to make it illegal...\" \n \n You had your chance with the Human Life Amendment during the 1980s and you guys blew it. It has nothing to do with a constitutional amendment but instead that so many become turned off by the pro-life movement because of it's radical tactics. If people were against Roe v Wade then it would happen...however that isn't the case.\n\n Roe v Wade legalized [a legizlative power mind you] abortion on demand. If you are right to say that Roe v Wade would be overturned if people don't support abortion, you are mistaken. It is very clear from the polls that an overwhelming majority of people support abortion in only three instances (rape, incest, mother's life in danger). Why doesn't the abortion \"law\" reflect this?\n \n Oh that's right, because of the radical tactics of a small minority of \"pro-life\" wackos who do things like bomb abortion clinics etc. I will infer from your statement that no such leftist radicals exist on the pro-choice side. Oh wait, people like Barak Obama are pro-choice and support live birth abortion, the killing of a live and born infant.\n \n Tell me, can you name one pro-life organization that endorses or supports somone who bombs an abortion clinic attaching their reason to the pro-life cause? It seems that you should be able name many if the tactics of pro-lifers is radical enough to repulse people.\n \n \nThe criminalization of abortion was the real abuse of power. It was mostly done by a few sexist and political oppertunist members of the AMA to stop women from practicing medicine and by xenophobic/racist Protestant groups who feared a non-white/non-Protestant majority here in America after the Civil War cleared out many of them.\n\n So the intent hiding behind abortion laws all along was to keep women in the gutter. There was not any legititamte concern for the unborn fetus. It was all about how they could keep women down. Tell me then, would someone who supports a ban on partial birth abortion do so simply because they want to repress women?", 
   {}, 
   110146, 
   null, 
   1114095840.0
  ], 
  [
   110357, 
   null, 
   "Linus", 
   "\"Roe v Wade legalized [a legizlative power mind you] abortion on demand. If you are right to say that Roe v Wade would be overturned if people don't support abortion, you are mistaken. It is very clear from the polls that an overwhelming majority of people support abortion in only three instances (rape, incest, mother's life in danger). Why doesn't the abortion \"law\" reflect this?\"\n \n Funny...last time I checked it was 60% who support Roe v Wade. It is one thing to be personally against them. For instance I am personally against sitcoms and FM radio stations but I would never criminalized these. People can feel personally opposed as much as they want to but if they support the landmark decision then their personal feelings are moot. \n \n \n \n \"Oh that's right, because of the radical tactics of a small minority of \"pro-life\" wackos who do things like bomb abortion clinics etc. I will infer from your statement that no such leftist radicals exist on the pro-choice side.\"\n \n Never said it was common place. Just like there is a small minority of \"pro-life wackos\" who tour the nation with blown up images of aborted fetuses or that abortion should be outright criminalized. \n \n \n \n \"Oh wait, people like Barak Obama are pro-choice and support live birth abortion, the killing of a live and born infant.\"\n \n And there are radicals on the right too. Alan Keyes supported the post-birth abortions of over hundreds of black African babies in South Africa during the 1980s. \n \n \n \n \"Tell me, can you name one pro-life organization that endorses or supports somone who bombs an abortion clinic attaching their reason to the pro-life cause? It seems that you should be able name many if the tactics of pro-lifers is radical enough to repulse people.\"\n \n Goodness! Did I strike a nerve? You guys call abortion murder but when anyone acts like it is you condemn them for it. Talk about mixed messages. \n \n \n \n \"So the intent hiding behind abortion laws all along was to keep women in the gutter.\" \n \n Considering the AMA lead the way. Yes.", 
   {
    "unicode_changes_made": true
   }, 
   110204, 
   null, 
   1114116600.0
  ], 
  [
   110449, 
   null, 
   "Steeeeve", 
   "Linus can you learn to use the quote things...it will make it easier for us.\n \n \nFunny...last time I checked it was 60% who support Roe v Wade\n\n \n As said earlier....supporting Roe vs Wade doesn't mean you support abortion.\n \n \nIt is one thing to be personally against them.\n\n The old \"personally against\" arguement. THis one is a classic. With this thought you wouldn't be against slavery (assuming you lived in 1850) because you would be \"personally against it\" but you wouldn't want to make other people think that!!\n \n \nGoodness! Did I strike a nerve? You guys call abortion murder but when anyone acts like it is you condemn them for it. Talk about mixed messages.\n\n \n Huh??? First off, I doubt many pro-lifers support blowing up buildings. You also think that we are a cult or something with a leader that instructs on how to think. Ever stop and think that maybe we just have a common beliefe that abortion is wrong? I speak for myself not anyone else. Therefore blowing up abortion clinics is just as wrong as abortion.", 
   {
    "unicode_changes_made": true
   }, 
   110357, 
   null, 
   1114125540.0
  ], 
  [
   110553, 
   null, 
   "Sigma", 
   "\n As said earlier....supporting Roe vs Wade doesn't mean you support abortion.\n\n \n How is this so? The decision made abortion unrestricted in the beginning of the pregnancy. To support this you would need to support a woman's right to choose to have an abortion.\n \n \n\n The old \"personally against\" arguement. THis one is a classic. With this thought you wouldn't be against slavery (assuming you lived in 1850) because you would be \"personally against it\" but you wouldn't want to make other people think that!!\n\n \n Do you smoke Steve? Drink? Lets say you do not. Lets also say you support other's right to drink and smoke. This is a perfectly realistic position to have. Does this now mean you personally disagree with slavery but support others to have slaves?", 
   {}, 
   110449, 
   null, 
   1114132620.0
  ], 
  [
   110598, 
   null, 
   "Steeeeve", 
   "How is this so? The decision made abortion unrestricted in the beginning of the pregnancy. To support this you would need to support a woman's right to choose to have an abortion.\n\n \n I support Roe vs Wade in the way that I wouldn't support it being overturned (other than for the reason that it is an illegal case).\n \n \nDo you smoke Steve? Drink? Lets say you do not. Lets also say you support other's right to drink and smoke. This is a perfectly realistic position to have. Does this now mean you personally disagree with slavery but support others to have slaves?\n\n \n I don't personally think it is wrong to smoke or drink...just stupid.", 
   {}, 
   110553, 
   null, 
   1114138260.0
  ], 
  [
   110697, 
   null, 
   "Linus", 
   "Linus can you learn to use the quote things...it will make it easier for us. \n\n \n Okay...I will...grudgingly. \n \n \n \n \nAs said earlier....supporting Roe vs Wade doesn't mean you support abortion.\n\n \n No, but it would mean you support another's right to abortion. Just like I support someone's right to listen to Rush Limbaugh despite my personal opposition to ever listening to it. \n \n \n \n \n\"The old \"personally against\" arguement. THis one is a classic. With this thought you wouldn't be against slavery (assuming you lived in 1850) because you would be \"personally against it\" but you wouldn't want to make other people think that!\"\n\n \n Don't you mean assuming that I supported slavery instead of 1850? Slavery is live and well today and you make it sound as if it is something of the past. However if I personally didn't like X but supported people to do X I would only mark my personal reason against it and may even condemn them for doing it. \n I don't drink alcohol but I wouldn't force that habit upon everyone else. Understand?\n \n \n \n \nHuh??? First off, I doubt many pro-lifers support blowing up buildings. You also think that we are a cult or something with a leader that instructs on how to think. Ever stop and think that maybe we just have a common beliefe that abortion is wrong? I speak for myself not anyone else. Therefore blowing up abortion clinics is just as wrong as abortion. \n\n \n So would you have been opposed to Allied forces using lethal force against Nazis within a concentration camp? Would you be opposed to assassinating a hijacker in order to prevent them from driving a truck loaded with explosives into a school building full of children? Would you be opposed to pro-life activist murdering an abortionists if it meant the cancellation of 23 abortion appointments/prevention of 23 \"unborn babies\" from becoming \"murdered\"? \n It's not that pro-lifers support blowing up buildings or that they have some underground cult where they take orders from the anti-abortion emperor. It is the fact that pro-life rhetoric against abortion follows people down a path where terrorism and murder is justified. Considering we live in a society where many agree with the death penalty.", 
   {
    "unicode_changes_made": true
   }, 
   110449, 
   null, 
   1114153140.0
  ], 
  [
   116133, 
   null, 
   "nikki22005", 
   "Any woman who has an abortion for convenience only (not raped, no incest, no danger to the mother's life) shall have both ovaries removed.\n \n What do y'all think? \n \n \n \n As long as we cut off the privates of the fathers as well.\n \n That is amazing! the best reply ever! i am now so much more aware of how insane pro lifers are, it's scary to know that we live in a country that has fools like this in it. What's next, any woman that has an abortion should have her head cut off?", 
   {
    "post_info": {
     "post_title": "What's next?"
    }
   }, 
   103855, 
   null, 
   1115164980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I have a solution...", 
  "url": "http://www.4forums.com/political/abortion-debates/4724-i-have-solution.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 4724, 
  "discussion_files": [
   [
    "18431.html", 
    "http://www.4forums.com/political/abortion-debates/4724-i-have-solution-print.html"
   ], 
   [
    "18432.html", 
    "http://www.4forums.com/political/abortion-debates/4724-i-have-solution-5-print.html"
   ], 
   [
    "18433.html", 
    "http://www.4forums.com/political/abortion-debates/4724-i-have-solution-4-print.html"
   ], 
   [
    "18434.html", 
    "http://www.4forums.com/political/abortion-debates/4724-i-have-solution-3-print.html"
   ], 
   [
    "18435.html", 
    "http://www.4forums.com/political/abortion-debates/4724-i-have-solution-2-print.html"
   ]
  ], 
  "identifier": 4724
 }
]