[
 [
  [
   104548, 
   null, 
   "gnojek", 
   "Hi, out of pure curiosity, I'd like to know if anyone here voted for Bush in the last election only to feel betrayed by his push for SS privatization? What I mean is did you expect him to pull this out right after being re-elected? Did it surprise you when he did? Or did you vote for Bush and you are totally behind privatization, or even the abolishment of SS?", 
   {
    "post_info": {
     "post_title": "Did you vote for Bush?"
    }
   }, 
   null, 
   null, 
   1112741940.0
  ], 
  [
   104601, 
   null, 
   "Duo_Maxwell", 
   "How can you not feel betrayed by voting for Bush?\n \n I'm for the abolishment of SS, but I didn't vote for Bush.", 
   {}, 
   104548, 
   null, 
   1112750040.0
  ], 
  [
   105304, 
   null, 
   "gnojek", 
   "How can you not feel betrayed by voting for Bush?\n \n I'm for the abolishment of SS, but I didn't vote for Bush.\n\n I know some people who don't have much money at all (dad works for a cable company and mom works as a CNA) who have a daughter with cerebral palsy. If it wasn't for SS and other governement programs then they wouldn't have had the money for various surgeries and treatments she's had through the years, and it helps now that she's 18 with some bills and stuff. \n \n My grandfather was disabled at work and after his insurance ran out about all he had to go on was SS and family. When my grandmother also became disabled from cancer and couldn't work, there went that income and she had to rely on, guess what, social security. \n \n Social security is there for the people who need it. You don't need it so you don't see a need for it, but it's essential to an American way of life that does not include old and disabled people dying in abject poverty.\n \n Why would you want to abolish it?", 
   {}, 
   104601, 
   null, 
   1112923680.0
  ], 
  [
   105358, 
   null, 
   "Duo_Maxwell", 
   "One because it's socialist. \n Two, because it allows the government to spend more then it should. SS taxes has a way of going into the general fund and making the deficits look smaller then they really are. \n Three, it is being treated in a manner for which it was never intended, created or modified to be used for: as people's only retirement fund\n Four, it supports the notion that government is saving for us, taking away personal responsibility and furthering a nanny state perception.\n \n While I'm not going to deny that people like the ones you know exist, the sad fact is the majority of people aren't and they are problem. \n \n In a ideal world, we would levy one huge tax for those already on then kill the program.", 
   {}, 
   105304, 
   null, 
   1112936940.0
  ], 
  [
   105454, 
   null, 
   "gnojek", 
   "Well, a lot of our government is \"socialist\" if you really think about it.\n I think we in America are turned off by the word \"socialism\" just because we were enemies of countries with \"socialist\" in their names.\n \n I think what you are calling for is some sort of reform on SS, maybe not the complete abolishment.\n \n I think you might have favored Al Gore's totally stupid sounding yet totally right way to handle SS and that is to make it a true trust fund. Al Gore screwed up by repeatedly saying \"Lockbox\" in his Forrest Gump accent, and it just made it a bad sell. Besides, congress would never give up the ability to dip into it.\n \n Anyway, it's not a perfect system by a long shot, but these involuntary voluntary private accounts would be a disaster. It's like forcing people to invest in the stock market, that's not only socialist but fascist (in a Mussolini sort of way). \n \n Sure the program needs reform, but so many people depend on it and not just to suck money from the government. Most of the people that get benefit checks need them to stay out of total poverty.", 
   {}, 
   105358, 
   null, 
   1112981400.0
  ], 
  [
   105518, 
   null, 
   "Duo_Maxwell", 
   "Well, a lot of our government is \"socialist\" if you really think about it.\n I think we in America are turned off by the word \"socialism\" just because we were enemies of countries with \"socialist\" in their names.\n\n \n Yes I realize that. Not to mention much of it is supported by lying republicans who pretend they are conservative. Scum SOBs. I don't support socialism because it has inherent problems, such as high taxes, high unemployment, and extreme regulations. \n \n \n\n I think what you are calling for is some sort of reform on SS, maybe not the complete abolishment.\n\n \n I suppose. Turn the entire SS into individual, goverment hands off 401ks. \n \n \n\n I think you might have favored Al Gore's totally stupid sounding yet totally right way to handle SS and that is to make it a true trust fund. Al Gore screwed up by repeatedly saying \"Lockbox\" in his Forrest Gump accent, and it just made it a bad sell. Besides, congress would never give up the ability to dip into it.\n\n \n Hence why it should be killed. Congress is a load of scumbags. \n \n \n\n Anyway, it's not a perfect system by a long shot, but these involuntary voluntary private accounts would be a disaster. It's like forcing people to invest in the stock market, that's not only socialist but fascist (in a Mussolini sort of way).\n\n \n Well it would be voluntary, but considering the problems we're going to be facing with or without private accounts, it's not really a big issue. I'm predicting a huge citizen bailout of SS, something along the lines of the S & L. \n \n \n\n Sure the program needs reform, but so many people depend on it and not just to suck money from the government. Most of the people that get benefit checks need them to stay out of total poverty.\n\n \n Then we should create a program specificaly for that and then axe SS.", 
   {}, 
   105454, 
   null, 
   1112990460.0
  ], 
  [
   105630, 
   null, 
   "gnojek", 
   "Yes I realize that. Not to mention much of it is supported by lying republicans who pretend they are conservative. Scum SOBs. I don't support socialism because it has inherent problems, such as high taxes, high unemployment, and extreme regulations. \n\n I guess. I never said I support a totally socialistic government, but a touch of socialism curbs things like poverty and disease. It's tough to do that under a purely \"free-market\" system.\n \n \n \n \nI suppose. Turn the entire SS into individual, goverment hands off 401ks. \n\n 401k's already exist.\n So do IRA's and Roth IRA's.\n There are all kinds of personl retirement accounts that are voluntary and , well maybe not govt hands off :) but that's dreaming.\n There are many choices already out there for anyone who wants to build their retirement. I think forcing people into these personal accounts through FICA is poop. (can't type ****).\n \n \n \n\n Hence why it should be killed. Congress is a load of scumbags.\n\n So the only choices are a \"lockbox\" trust or kill it and there's no way there'll be a lockbox trust? I don't know if I can disagree. \n \n \n \n\n Well it would be voluntary, but considering the problems we're going to be facing with or without private accounts, it's not really a big issue. I'm predicting a huge citizen bailout of SS, something along the lines of the S & L.\n\n How voluntary would it be? \n Can anyone just totally opt out?\n I think I heard on some radio show (Dave Ramsey?) that you can try to opt out of social security altogether. I think there are some forms to fill out.\n \n If anyone can opt out, then what's the point in having it as part of SS?\n Anyone can voluntarily set up an IRA now, without dealing with FICA.\n \n Now I'm confused. emoticon_confused \n \n What was even the point of having PSA's as part of SS (if they are voluntary)?\n \n \n \nThen we should create a program specificaly for that and then axe SS.\n\n I thought that's what SS was specifically for.\n I guess people get their retirement benefits and death benefits from it too though.\n I think maybe people that have a certain income (a pretty high one) and are retired should not get the measly SS benefit checks and that money could be redistributed to the disabled, etc.", 
   {}, 
   105518, 
   null, 
   1113008340.0
  ], 
  [
   105644, 
   null, 
   "Duo_Maxwell", 
   "401k's already exist.\n So do IRA's and Roth IRA's.\n There are all kinds of personl retirement accounts that are voluntary and , well maybe not govt hands off :) but that's dreaming.\n There are many choices already out there for anyone who wants to build their retirement. I think forcing people into these personal accounts through FICA is poop. (can't type ****).\n\n \n I know. I say we allow people to have 401ks that have clauses that let a specific limit of savings to come off as as a tax credit. People are suppose to save for themselves, the gov't is not suppose to. \n \n \n\n So the only choices are a \"lockbox\" trust or kill it and there's no way there'll be a lockbox trust? I don't know if I can disagree. \n\n \n SS is suppose to be a lockbox. Except every Congress since the beginning of SS has raided it. Usually adminstrations don't do that, but Bush took a estimated $150 billion out of the fund for general use. \n \n \n\n How voluntary would it be? \n Can anyone just totally opt out?\n\n \n You don't have to invest in private accounts. However, you're still getting taxed. \n \n \n\n I think I heard on some radio show (Dave Ramsey?) that you can try to opt out of social security altogether. I think there are some forms to fill out.\n\n \n Most people should do that. There is a way, it's just not well known. \n \n \n\n If anyone can opt out, then what's the point in having it as part of SS?\n Anyone can voluntarily set up an IRA now, without dealing with FICA.\n\n \n Well, it could be SS entirely. Personally I favor full y private accounts with almost no government interaction whatsoever.\n \n \nWhat was even the point of having PSA's as part of SS (if they are voluntary)?\n\n \n I'm not sure. Bush's plan is half baked. \n \n \n\n I thought that's what SS was specifically for.\n I guess people get their retirement benefits and death benefits from it too though.\n I think maybe people that have a certain income (a pretty high one) and are retired should not get the measly SS benefit checks and that money could be redistributed to the disabled, etc.\n\n \n That's the problem with SS. SS was never designed to be such a fund. Social security is the American version of the Bismarckian version in Germany. It was meant to supplment the savings of workers in their retirment, it was never designed to be the retirement fund. Sadly, that is how many people see it today, that the govermnent is saving for their retirment with SS and therefore I don't need to save for myself. IT's also a part of the reason why the US has one of the lowest per capita savings in the industralized world.", 
   {}, 
   105630, 
   null, 
   1113016500.0
  ], 
  [
   105673, 
   null, 
   "Steeeeve", 
   "After asking some of my accounting profs. I have decided that politics doesn't even escape the logical world of Accounting. Some suggest that Bushs idea sucks, some say it is good...however they all agree on a few things...\n \n 1) getting rid of SS altogether aint that bad of an idea\n 2) Bush's SS plan will work for young workers but will screw over the ones above the age of 45 or so.\n 3) SS system now is messed up in that the younger workers are paying for the ones retired....instead of what the people put in is what they get.\n - Bush's idea makes it more of a defined contribution pension plan rather then the current system which (in a way) is a defined benefit pension plan.\n \n Further detail....\n \n Defined benefit is where you are supposed to get a set amount of money based on a forumla. The company takes care of all the risk and thus would get return on assets money...however with the government there really is no return on assets so you keep the little that there is...in theory. More over, the government plan we got is more of a young pay the old type deal.\n \n Defined contribution pension plans are like your 401k's and what not. You bare the risk but you keep the return on assets...thus making it more profitable. Now, why is this bad for someone? Well if you are 45, it might be bad...the stock market gives 15% RoA...while treasury bonds gives 3% or so. However, the 15% is long term....the economy goes up in down but over all you will get 15% RoA...Now if you are 45, you retire in a few years and there might be a bad economy if you just started invested for retirment...this might even makes you RoA 1% or lower... Thus a tearsury bond woulda been better....if you are 25 though, a bad economy is not gonna happen for 40 yrs...and if it does, you wouldn't have a job anyway. So a 401k or Roff IRA, IRA would be better.\n \n This has been a brief lesson in pension plans brought to you by Steve :)", 
   {}, 
   105644, 
   null, 
   1113028740.0
  ], 
  [
   105718, 
   null, 
   "georged", 
   "After asking some of my accounting profs. I have decided that politics doesn't even escape the logical world of Accounting. Some suggest that Bushs idea sucks, some say it is good...however they all agree on a few things...\n \n 1) getting rid of SS altogether aint that bad of an idea\n 2) Bush's SS plan will work for young workers but will screw over the ones above the age of 45 or so.\n 3) SS system now is messed up in that the younger workers are paying for the ones retired....instead of what the people put in is what they get.\n - Bush's idea makes it more of a defined contribution pension plan rather then the current system which (in a way) is a defined benefit pension plan.\n \n Further detail....\n \n Defined benefit is where you are supposed to get a set amount of money based on a forumla. The company takes care of all the risk and thus would get return on assets money...however with the government there really is no return on assets so you keep the little that there is...in theory. More over, the government plan we got is more of a young pay the old type deal.\n \n Defined contribution pension plans are like your 401k's and what not. You bare the risk but you keep the return on assets...thus making it more profitable. Now, why is this bad for someone? Well if you are 45, it might be bad...the stock market gives 15% RoA...while treasury bonds gives 3% or so. However, the 15% is long term....the economy goes up in down but over all you will get 15% RoA...Now if you are 45, you retire in a few years and there might be a bad economy if you just started invested for retirment...this might even makes you RoA 1% or lower... Thus a tearsury bond woulda been better....if you are 25 though, a bad economy is not gonna happen for 40 yrs...and if it does, you wouldn't have a job anyway. So a 401k or Roff IRA, IRA would be better.\n \n This has been a brief lesson in pension plans brought to you by Steve :)\n\n \n Steve, it sounds like some of those accounting professors have been on the public teat so long they're believing political funny numbers. The historical return for common stocks, 401k fodder, has been posted several times and its less than half of 15%. And that's assuming everyone retires during an up market. 5% of an average annual income compounded at 6% as a retirement fund will cause most of those retirees to creat a bull market in pet food and mini-mart robberies.", 
   {}, 
   105673, 
   null, 
   1113063120.0
  ], 
  [
   105726, 
   null, 
   "Steeeeve", 
   "This would be all of the accounting professors...and they said the stock market yields about 12% (i was a bit high) over long term..\n \n Over the period 1926-1992, equity premium was 6.1%\n 2. The equity premium has been higher in recent times.\n \n Those are from my notes :). \n So i think that maybe the accounting professors got the 12% from more recent numbers. However, 6% is still better then treasury bonds. (the notes were from my Finance teacher). Also...\n \n The average long-run return on stock markets has been very stable in the past century. The average return has been about 6 %-points above the return of long risk-free bond. (With the current interest rates this means about 11% per annum.)  \n \n They mighta meant this though...this means 11% prior to inflation. Either way, it is risk premium. The higher the risk the more you want in return. You also, don't need to end on a high note in order to achiever that 6%...after all, long term in a way diversifies this away.", 
   {}, 
   105718, 
   null, 
   1113071580.0
  ], 
  [
   105745, 
   null, 
   "georged", 
   "This would be all of the accounting professors...and they said the stock market yields about 12% (i was a bit high) over long term..\n \n Over the period 1926-1992, equity premium was 6.1%\n 2. The equity premium has been higher in recent times.\n \n Those are from my notes :). \n So i think that maybe the accounting professors got the 12% from more recent numbers. However, 6% is still better then treasury bonds. (the notes were from my Finance teacher). Also...\n \n The average long-run return on stock markets has been very stable in the past century. The average return has been about 6 %-points above the return of long risk-free bond. (With the current interest rates this means about 11% per annum.)  \n \n They mighta meant this though...this means 11% prior to inflation. Either way, it is risk premium. The higher the risk the more you want in return. You also, don't need to end on a high note in order to achiever that 6%...after all, long term in a way diversifies this away.\n\n \n I've always read 6.1% period, with no relation to the long bond. Blue chips generally strive for 8% ROI, but 401ks seldom see blue chips as stable companies periodically park issues to freeze dividends and reissue. A managed portfolio pays out at current portfolio value. The last market adjustment, the dot.com bubble, left many funds well underwater. Even with substantial gains from the prior decade, many net portfolio values were below contribution and accumulated gain levels. They come back up, but that's what makes the 6%.\n \n What politicians and brokerage interests are attempting to do with individual SS accounts is offset future equity market withdrawals from retiring baby boomers discovering they can't maintain their employed standard of living on equity market dividends. They will get into capital, in a serious manner, dragging equity markets way down over extended periods of time. Combine that with foreign equity market investment having flown the coup with the USD, an anticipated reduction in average worker income levels and they're facing some very serious problems. That's why the current administration is still pushing individual SS accounts, even in the face of widespread public and congressional rejection, including enough Republican members of congress to where they don't have the votes to implement it. \n \n Let me know when you get to net present and future values factoring in inflation with yield discounts. Then you'll better understand why dividends should be utilized as they're paid rather than rolling them over. Accounting is financial reporting, treasury is the fun side of numbers.", 
   {}, 
   105726, 
   null, 
   1113074640.0
  ], 
  [
   105794, 
   null, 
   "Steeeeve", 
   "I've always read 6.1% period, with no relation to the long bond. Blue chips generally strive for 8% ROI, but 401ks seldom see blue chips as stable companies periodically park issues to freeze dividends and reissue. A managed portfolio pays out at current portfolio value. The last market adjustment, the dot.com bubble, left many funds well underwater. Even with substantial gains from the prior decade, many net portfolio values were below contribution and accumulated gain levels. They come back up, but that's what makes the 6%.\n \n What politicians and brokerage interests are attempting to do with individual SS accounts is offset future equity market withdrawals from retiring baby boomers discovering they can't maintain their employed standard of living on equity market dividends. They will get into capital, in a serious manner, dragging equity markets way down over extended periods of time. Combine that with foreign equity market investment having flown the coup with the USD, an anticipated reduction in average worker income levels and they're facing some very serious problems. That's why the current administration is still pushing individual SS accounts, even in the face of widespread public and congressional rejection, including enough Republican members of congress to where they don't have the votes to implement it. \n \n Let me know when you get to net present and future values factoring in inflation with yield discounts. Then you'll better understand why dividends should be utilized as they're paid rather than rolling them over. Accounting is financial reporting, treasury is the fun side of numbers.\n\n \n done all of that....twice. I don't understand your point in the last paragraph.\n \n as for your second paragraph, this is pure speculation and unfounded. The 6.1% I was referring to was after inflation. I mean, these ideas are fairly simple....more ROA (or ROI) the higher the risk. I mean, it is not like we don't invest for retirement today...it is done and it is better then buying treasury bonds. Either way, one has to have a retirement fund and the best place to do this is the stock market. Social Security is ****, we know that....so letting someone choose to put money in a more profitable area aint that bad of an idea...unless they start using that money for stuff. I don't really understand where you are coming from with the idea that investing accounts is bad...our current system is what is bad...It does seem that \"experts\" have different opinions though.", 
   {}, 
   105745, 
   null, 
   1113083700.0
  ], 
  [
   105831, 
   null, 
   "Voice Of Reason", 
   "I voted for President Bush......I was not crazy about the idea but when I saw what the democrats had to offer as and alternative it was a slam dunk........\n \n I think putting aside a small portion of your SS is a great idea..I wish I could have done it when I was young.........\n \n The only real reason the democrats are against it is because a Republican thought of it.......\n \n It is strictly partisan politics..That is the sad part.........", 
   {}, 
   105794, 
   null, 
   1113092940.0
  ], 
  [
   105834, 
   null, 
   "Steeeeve", 
   "yeah, one can't deny that the SS issue has nothing to do with trying to actually save SS...but repubs vs dems.", 
   {}, 
   105831, 
   null, 
   1113093660.0
  ], 
  [
   105836, 
   null, 
   "zachvac", 
   "I voted for President Bush......I was not crazy about the idea but when I saw what the democrats had to offer as and alternative it was a slam dunk........\n \n I think putting aside a small portion of your SS is a great idea..I wish I could have done it when I was young.........\n \n The only real reason the democrats are against it is because a Republican thought of it.......\n \n It is strictly partisan politics..That is the sad part.........\n\n \n \n You do realize there's more than one party, right? If you don't like either major candidate you can vote for someone else. It's people like you who give third parties no chance at all.", 
   {}, 
   105831, 
   null, 
   1113095160.0
  ], 
  [
   105837, 
   null, 
   "georged", 
   "done all of that....twice. I don't understand your point in the last paragraph.\n \n as for your second paragraph, this is pure speculation and unfounded. The 6.1% I was referring to was after inflation. I mean, these ideas are fairly simple....more ROA (or ROI) the higher the risk. I mean, it is not like we don't invest for retirement today...it is done and it is better then buying treasury bonds. Either way, one has to have a retirement fund and the best place to do this is the stock market. Social Security is ****, we know that....so letting someone choose to put money in a more profitable area aint that bad of an idea...unless they start using that money for stuff. I don't really understand where you are coming from with the idea that investing accounts is bad...our current system is what is bad...It does seem that \"experts\" have different opinions though.\n\n \n Try this for speculation: From 2005-2015 77-million workers will supposedly begin retirement, or 38% of the current population. Current average retirement savings (primarily 401k and lesser assorted letters) of the age group 58-64 is now $55k, dry pet food chump change when considering retirement. Once that last paycheck is cashed, they'll spend that $55k so fast your head will spin. Try draining $40-billion/yr never to return 60% in medium and small cap issues out of equity markets for a front-end loaded ten year period (deferred taxes) and see how your market model responds without a corresponding investment influx.\n \n An argument of equity investments versus federal or state treasury issues is a real no-brainier. That's not the important issue. 5% of annual earnings compounded for the average worker on historical returns simply won't facilitate retirement. Unless standards of living are reduced to a point where civil obedience is guaranteed to fail. Figure each worker will require $260k stashed to provide current SS benefit levels of $15k/yr at a 6% annual return without getting into capital. How many average workers will accumulate that over a 40-year period and who could possibly retire anywhere but in a cave eating leaves and insects on $15k/yr? It certainly wasn't accomplished during the recent extended period of prosperity. \n \n I'm of an age that this type discussion is of interest to a point, but if you prefer to believe the deceptive fiscal propaganda that's being thrown at you, that's certainly your decision to make. You'll get the tab for it, not me. Should be quite a challenge when added to public debt service at the rate we're currently incurring that with a declining tax base, a service economy gushing national wealth out of the country with trade imbalance and 50% of annual budget going for military expenses. \n \n My curiosity on reaction to the subject is sated and I'm beyond being personally concerned with payroll withholding tax rates or personal 'contribution' retirement accounts, so I'm going to continue pursuing other hobbies. How the general public and our youth is responding to their future seems pretty well defined. Good luck.", 
   {}, 
   105794, 
   null, 
   1113099360.0
  ], 
  [
   105843, 
   null, 
   "Duo_Maxwell", 
   "I voted for President Bush......I was not crazy about the idea but when I saw what the democrats had to offer as and alternative it was a slam dunk........\n \n I think putting aside a small portion of your SS is a great idea..I wish I could have done it when I was young.........\n \n The only real reason the democrats are against it is because a Republican thought of it.......\n \n It is strictly partisan politics..That is the sad part.........\n\n \n This comming from the person who thinks that a CD now is a good idea.  \n \n I suggest you actually research the idea before innante, fact less comments.", 
   {}, 
   105831, 
   null, 
   1113102780.0
  ], 
  [
   105864, 
   null, 
   "Steeeeve", 
   "Try this for speculation: From 2005-2015 77-million workers will supposedly begin retirement, or 38% of the current population. Current average retirement savings (primarily 401k and lesser assorted letters) of the age group 58-64 is now $55k, dry pet food chump change when considering retirement. Once that last paycheck is cashed, they'll spend that $55k so fast your head will spin. Try draining $40-billion/yr never to return 60% in medium and small cap issues out of equity markets for a front-end loaded ten year period (deferred taxes) and see how your market model responds without a corresponding investment influx.\n \n \n Not only do I not know what you are argueing but I don't even know what you think should happen. from what I gather...\n \n -Average retirement savings is 55,000 bucks...ok not sure where that comes from but we can roll with it\n -This will all be spent within minutes...I didn't know pension plans could all be spent at once emoticon_rolleyes \n -40 billion bucks is gonna be burned up on the sidewalks as retirement folks say \"screw the economy\".\n \n Even if all of this is true I still don't see how putting your money into equity markets is a bad thing...if the stock market crashes Great Depression style then we probably got more things to worry about then your retirement fund...cause you won't have a job. I just doubt you when my finance teachers and accounting professors (all with CPAs) all say differently. They have a bit more credibility. I will ask my finance professor some more detailed things if you want...", 
   {}, 
   105843, 
   null, 
   1113113100.0
  ], 
  [
   105875, 
   null, 
   "jitobear", 
   "I did not vote for the monkey. I have disgareed with several politicians in my life - this one I whole-heartedly despise. I think he his a spoiled little frat boy with his nose up the rears of the wealthiest and the fundies. I think he uses our troops like they are his own little toy soldiers and barely maintains the intelligence to string a full sentence together. Not to mention he is an appalingly bad public speaker. Not that Clinton or Kerry are my heros mind you. I have liked very few politicians - Paul Wellstone, The Doles and Bill Richardson - I have not always agreed with them on every issue - but I think they are/were genuine - and that is rare in politics. \n \n However - regarding SS - jury is out on that one for me. I do not know the details, really. It would probably be OK as long as it happened slowly and as long as the low income earner - blue collar guy has a way to invest and save, too. I work for a financial services company - and currently even getting a plan is out of range for a lot of people ($500) - not to mention having restrictions on how much money you have to have to use a certain product to invest.", 
   {}, 
   105864, 
   null, 
   1113120600.0
  ], 
  [
   105943, 
   null, 
   "Steeeeve", 
   "but I think they are/were genuine\n \n \n Bush is probably more genuine then you think....example would be the audio tape of his friend and bush speaking together...he mentioned a lot of things that he believes and he believes today....Is he stupid? No...Is he a liar? A liar would indicate that he knew he was wrong when he did something...so who can say? Was he wrong on some stuff? Yes, very much so. Does he believe in things he says? I think for the most part he does...this doesn't mean you have to like what he believes though. Does he stink at speaking? well, yes, but this is not the worst thing a President could be bad at.\n \n So to say he is not genuine maybe a little off....I think he is probably more genuine then Clinton but probably not as genuine as some others.\n \n note: please don't try and respond with reasons why George W. is a \"liar\"...no one has proof (unless you are CBS using Microsoft Word) to make it true so don't waste my time.", 
   {}, 
   105875, 
   null, 
   1113161700.0
  ], 
  [
   105946, 
   null, 
   "jitobear", 
   "Bush is probably more genuine then you think....example would be the audio tape of his friend and bush speaking together...he mentioned a lot of things that he believes and he believes today....Is he stupid? No...Is he a liar? A liar would indicate that he knew he was wrong when he did something...so who can say? Was he wrong on some stuff? Yes, very much so. Does he believe in things he says? I think for the most part he does...this doesn't mean you have to like what he believes though. Does he stink at speaking? well, yes, but this is not the worst thing a President could be bad at.\n \n So to say he is not genuine maybe a little off....I think he is probably more genuine then Clinton but probably not as genuine as some others.\n \n note: please don't try and respond with reasons why George W. is a \"liar\"...no one has proof (unless you are CBS using Microsoft Word) to make it true so don't waste my time.\n\n \n What I mean by genuine is havinga genuine interest in real live people vs. whatever special interests are paying them off.\n \n I think Bush is a genuine horse's XXX. There is nothing I like about the man. The fact that he is a bad public speaker is the only area where I understand him - I am a bad public speaker, too - so I feel for him there. However, he is an appallingly bad president. \n \n I don't think I said he lied - but I do think he is beyond foul. He disgusts me on so many levels - you will never convince me to want to do anything but give him a solid kick in the teeth.", 
   {}, 
   105943, 
   null, 
   1113162360.0
  ], 
  [
   106101, 
   null, 
   "Steeeeve", 
   "I guess one can have his/her own opinion", 
   {}, 
   105946, 
   null, 
   1113229740.0
  ], 
  [
   313261, 
   null, 
   "LloydRacer", 
   "A prophetic post", 
   {}, 
   104548, 
   null, 
   1213484940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Did you vote for Bush?", 
  "url": "http://www.4forums.com/political/social-security-debates/4744-did-you-vote-bush.html", 
  "breadcrumbs": [
   "Social Security"
  ], 
  "id_number": 4744, 
  "discussion_files": [
   [
    "8697.html", 
    "http://www.4forums.com/political/social-security-debates/4744-did-you-vote-bush-print.html"
   ], 
   [
    "8698.html", 
    "http://www.4forums.com/political/social-security-debates/4744-did-you-vote-bush-2-print.html"
   ]
  ], 
  "identifier": 4744
 }
]