[
 [
  [
   105085, 
   null, 
   "wilted_laughter", 
   "The Constitution may have suited the situation in 1787, but are there too many checks and balances for the system to operate effectively in the 21st century?", 
   {
    "post_info": {
     "post_title": "Checks and balances"
    }
   }, 
   null, 
   null, 
   1112884140.0
  ], 
  [
   105143, 
   null, 
   "Dono", 
   "The Constitution may have suited the situation in 1787, but are there too many checks and balances for the system to operate effectively in the 21st century?\n\n I would say that there are too many checks (debits) for our balances (income).\n Dono", 
   {}, 
   105085, 
   null, 
   1112893800.0
  ], 
  [
   105203, 
   null, 
   "Jaxian", 
   "The Constitution may have suited the situation in 1787, but are there too many checks and balances for the system to operate effectively in the 21st century?\n\n \n It is my opinion that there are not enough checks and balances, though perhaps not in the way you are thinking.\n \n I would not change our checks and balances system regarding checking the government against itself. That is, I do not think that we should decrease the number of government officials, change the way decisions are made, eliminate a branch or the power of a branch, etc. Our government has been able to protect the liberty of all people in a way that I don't think would have been possible without our checks and balances. To destroy those checks and balances is likely to create either a tyranny or a government that is too weak. The government has the same powers that it once did, and we do not implement checks and balances to protect against poor decisions, we cannot expect a government to remain good for long.\n \n The additional check I was referring to implementing would be to have Senators elected not by the majority of people, but by the state legislatures. This was the way the Constitution originally worked (until an amendment changed this), and it would put an additional check on the power of the majority.", 
   {}, 
   105085, 
   null, 
   1112902260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Checks and balances", 
  "url": "http://www.4forums.com/political/politics-debates/4765-checks-balances.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4765, 
  "discussion_files": [
   [
    "1951.html", 
    "http://www.4forums.com/political/politics-debates/4765-checks-balances-print.html"
   ]
  ], 
  "identifier": 4765
 }
]