[
 [
  [
   105097, 
   null, 
   "jim's trucking", 
   "My Living Will\n \n \n \n \n I, _________________________ (fill in the blank), being of sound mind and body, do not wish to be kept alive indefinitely by artificial means.\n \n Under no circumstances should my fate be put in the hands of peckerwood politicians who couldn't pass ninth-grade biology if their lives depended on it.\n \n If a reasonable amount of time passes and I fail to sit up and ask for a cold beer, it should be presumed that I won't ever get better. When such a determination is reached, I hereby instruct my spouse, children and attending physicians to pull the plug, reel in the tubes and call it a \n day& have a Party cause the old bastard is gone . \n \n Under no circumstances shall the members of the Legislature enact a special law to keep me on life-support machinery for all eternity. It is my wish that these boneheads mind their own damn business, and pay attention instead to the health, education and future of the millions of Americans who aren't in a permanent coma.\n \n Under no circumstances shall any politicians butt into this case. I don't care how many fundamentalist votes they're trying to scrounge for their run for the presidency in 2008, it is my wish that they play politics with someone else's life and leave me alone to die in peace.\n \n I couldn't care less if a hundred religious zealots send e-mails to legislators in which they pretend to care about me. I don't know these people, and I certainly haven't authorized them to preach and crusade on my behalf. They should mind their own damn business.\n \n If any of my family goes against my wishes and turns my case into a political cause, I hereby promise to come back from the grave and make his or her existence a living hell.\n \n \n signed --------------------------------------------\n this day -----------------------------", 
   {
    "post_info": {
     "post_title": "Free Living Will Form...just fill in your name!"
    }
   }, 
   null, 
   null, 
   1112885880.0
  ], 
  [
   105098, 
   null, 
   "Big Orn", 
   "Just in case you have this protected under the copyright laws, I am now officially asking for a copy of it... :p", 
   {}, 
   105097, 
   null, 
   1112886600.0
  ], 
  [
   105125, 
   null, 
   "georged", 
   "With the addition of brand of beer, without that in my case it could just be a motor spasm, it looks perfect.", 
   {}, 
   105098, 
   null, 
   1112891160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Free Living Will Form...just fill in your name!", 
  "url": "http://www.4forums.com/political/fun-debates/4767-free-living-will-form-just-fill-your-name.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 4767, 
  "discussion_files": [
   [
    "24819.html", 
    "http://www.4forums.com/political/fun-debates/4767-free-living-will-form-just-fill-your-name-print.html"
   ]
  ], 
  "identifier": 4767
 }
]