[
 [
  [
   105314, 
   null, 
   "gnojek", 
   "Do you agree with the use of napalm in Iraq by the U.S.?\n \n \n http://www.globalsecurity.org/org/news/2003/030810-napalm-iraq01.htm\n \n http://www.sundaymirror.co.uk/news/tm_objectid=14920109&method=full&siteid=106694&headline=fallujah-napalmed-name_page.html\n \n http://www.independent-media.tv/item.cfm?fmedia_id=1878&fcategory_desc=Under%20Reported\n \n http://www.aljazeera.com/cgi-bin/news_service/middle_east_full_story.asp?service_id=5875\n \n http://www.signonsandiego.com/news/military/20030805-9999_1n5bomb.html", 
   {
    "post_info": {
     "post_title": "Got napalm?"
    }
   }, 
   null, 
   null, 
   1112924520.0
  ], 
  [
   105347, 
   null, 
   "Black Phoenix", 
   "I don't know...I mean napalm is very nasty business...but it's war. I think to often that's what people forget about wars and battles, it's exactly that...WAR. If the use of napalm saves some of my friends and relatives who are in the service and over in Iraq fighting then so be it. \n \n BOMBS AWAY", 
   {}, 
   105314, 
   null, 
   1112934360.0
  ], 
  [
   105352, 
   null, 
   "Duo_Maxwell", 
   "Black Phoenix, that can just as easily be said for a thermonuclear weapon. \n \n Virtually anyone can make napalm in their kitchen.", 
   {}, 
   105347, 
   null, 
   1112935800.0
  ], 
  [
   105372, 
   null, 
   "Hunter", 
   "Black Phoenix, that can just as easily be said for a thermonuclear weapon. \n \n Virtually anyone can make napalm in their kitchen.\n\n \n DO NOT make napalm in your kitchen, your wife will kill you!!!!!!", 
   {
    "post_info": {
     "post_title": "Warning, Warning!!!!!!!!!!!!"
    }
   }, 
   105352, 
   null, 
   1112939280.0
  ], 
  [
   105411, 
   null, 
   "lord tammerlain", 
   "Then make it in the garage, styrofoam and gasoline.\n \n Besides which napalm is not called napalm any more.", 
   {}, 
   105372, 
   null, 
   1112955480.0
  ], 
  [
   105415, 
   null, 
   "Eddie", 
   "Black Phoenix, that can just as easily be said for a thermonuclear weapon. \n\n \n Or suicide-bombs targetting civillians...", 
   {}, 
   105352, 
   null, 
   1112967420.0
  ], 
  [
   105450, 
   null, 
   "gnojek", 
   "I don't know...I mean napalm is very nasty business...but it's war. I think to often that's what people forget about wars and battles, it's exactly that...WAR. If the use of napalm saves some of my friends and relatives who are in the service and over in Iraq fighting then so be it. \n \n BOMBS AWAY\n\n \n I like how people always say \"It's war and war is hell\" as if we had absolutely no choice in whether we started this war or not. We chose to start this war and we can chose to fight it without burning people (including children) alive. \n \n \nThen make it in the garage, styrofoam and gasoline.\n \n Besides which napalm is not called napalm any more.\n\n \n Yeah, I think their called M77-Firebombs now.\n \n \n I'd also like to link to a blog article about American Media in Iraq that I thought was interesting.\n \n http://riverbendblog.blogspot.com/2005_04_01_riverbendblog_archive.html#111247654157434704\n \n \nAl-Hurra, the purported channel of freedom, is the American gift to the Arab world. What they do is show us translated documentaries about certain historical events (American documentaries) or about movie stars (American stars) or vacation spots. Throughout this, there are Arab anchors giving us the news (which is like watching Fox in Arabic). It's news about the Arab world with the American twist.\n \n Our new \"national\" channels are a joke. One of the most amusing, in a gruesome sort of way, is Al-Iraqiya. It's said to be American sponsored but the attitude is decidedly pro-Iran, anti-Sunni. There's a program where they parade 'terrorists' on screen for us to see in an attempt to show us that our National Guard are not only good at raiding homes and harassing people in the streets. The funny thing about the terrorists is that the majority of them have \"Sunni\" names like Omar and Othman, etc. They admit to doing things such as having sexual intercourse in mosques and raping women and the whole show is disgusting. Iraqis don't believe it because it's so obviously produced to support the American definition of the Iraqi, Sunni, Islamic fanatic that it is embarrassing. Couldn't the PSYOPS people come up with anything more subtle?\n \n I've been enchanted with the shows these last few weeks. The thing that strikes me most is the fact that the news is so... clean. It's like hospital food. It's all organized and disinfected. Everything is partitioned and you can feel how it has been doled out carefully with extreme attention to the portions- 2 minutes on women's rights in Afghanistan, 1 minute on training troops in Iraq and 20 minutes on Terri Schiavo! All the reportages are upbeat and somewhat cheerful, and the anchor person manages to look properly concerned and completely uncaring all at once.\n\n \n So apparently while their being firebombed they can watch the Terri Schiavo story! How lucky are they?", 
   {
    "unicode_changes_made": true
   }, 
   105347, 
   null, 
   1112980800.0
  ], 
  [
   105508, 
   null, 
   "Duo_Maxwell", 
   "Or suicide-bombs targetting civillians...\n\n \n Exactly. Just depends on your perspective.\n \n Do the ends justify the means?", 
   {}, 
   105415, 
   null, 
   1112989920.0
  ], 
  [
   105526, 
   null, 
   "Taranaki", 
   "Do the ends justify the means?\n \n Who knows, there seems to be some contention as to what the 'ends' are.\n \n First the plan was to neutralise the threat of WMD.\n Then it became the hunt for Saddam.\n Then it became secure Iraq for free elections\n Then it became support the Iraqi government until it can fight terrorism alone.\n If someone can tell us that this is the ultimate objective in the Middle East, then perhaps we can argue whether the ends justify the means.\n \n Myself, I believe that this 'liberation' is the precursor to a sustained occupation of oil-producing nations.To which the answer is 'yes, the end does justify the means. John Doe must be allowed enough cheap gas to run his V8 pickup, American politicians find it far easier to justify war than to justify responsible use of non-renewable resources.", 
   {}, 
   105508, 
   null, 
   1112991660.0
  ], 
  [
   105541, 
   null, 
   "fracas", 
   "Exactly. Just depends on your perspective.\n \n Do the ends justify the means?\n\n \n not quite\n using nalpalm against insurgents/soldiers is not the same as suicide attacks against civilians.\n \n there is still a sense of right and wrong even in war and death.", 
   {}, 
   105508, 
   null, 
   1112996580.0
  ], 
  [
   105552, 
   null, 
   "Duo_Maxwell", 
   "not quite\n using nalpalm against insurgents/soldiers is not the same as suicide attacks against civilians.\n \n there is still a sense of right and wrong even in war and death.\n\n \n Let's see. If the use of ______ saves some of my friends and relatives who are in the \"service\" and over in _____fighting then so be it. \n \n Replace it when any form of war. How is that different?", 
   {}, 
   105541, 
   null, 
   1112998320.0
  ], 
  [
   105563, 
   null, 
   "Big_Bear_Scot", 
   "not quite\n using nalpalm against insurgents/soldiers is not the same as suicide attacks against civilians.\n \n there is still a sense of right and wrong even in war and death.\n \n \n Napalm and firebombs are very imprecise weapon that can quickly spread fire through an area. Its not as if the fire reaches a civilian area and then suddenly stops, this stuff is very indiscriminate just like suicide bombers.", 
   {}, 
   105552, 
   null, 
   1112999400.0
  ], 
  [
   105567, 
   null, 
   "georged", 
   "Do the ends justify the means?\n \n Who knows, there seems to be some contention as to what the 'ends' are.\n \n First the plan was to neutralise the threat of WMD.\n Then it became the hunt for Saddam.\n Then it became secure Iraq for free elections\n Then it became support the Iraqi government until it can fight terrorism alone.\n If someone can tell us that this is the ultimate objective in the Middle East, then perhaps we can argue whether the ends justify the means.\n \n Myself, I believe that this 'liberation' is the precursor to a sustained occupation of oil-producing nations.To which the answer is 'yes, the end does justify the means. John Doe must be allowed enough cheap gas to run his V8 pickup, American politicians find it far easier to justify war than to justify responsible use of non-renewable resources.\n\n \n IMO it merely illustrates the ease our politicians have in refocusing the general public regardless of the subject. Responsibility and long-range planning are not our strong suits, we pursue immediate gratification as a god.", 
   {}, 
   105526, 
   null, 
   1112999820.0
  ], 
  [
   105569, 
   null, 
   "Big_Bear_Scot", 
   "Further to my last post on napalm if any Country wants to maintain the moral high ground in any conflict then they should refrain from using any weapons that are too indiscriminate. \n \n I believe we shouldn't use weapons such as napalm and cluster bombs, napalm mainly because it is a very indiscriminate weapons(see post above). \n \n Cluster bombs should not be used as these bombs when dropped, deployed many hundreds or thousands bomblets which spread over a wide area, these bomblets if they don't explode in effect turn into small landmines which often or not cause unnecessary civilian casualties even after a War is over. That is not even to mention the costs involved in disarming these bomblets.", 
   {}, 
   105567, 
   null, 
   1113000240.0
  ], 
  [
   105576, 
   null, 
   "georged", 
   "Further to my last post on napalm if any Country wants to maintain the moral high ground in any conflict then they should refrain from using any weapons that are too indiscriminate. \n \n I believe we shouldn't use weapons such as napalm and cluster bombs, napalm mainly because it is a very indiscriminate weapons(see post above). \n \n Cluster bombs should not be used as these bombs when dropped, deployed many hundreds or thousands bomblets which spread over a wide area, these bomblets if they don't explode in effect turn into small landmines which often or not cause unnecessary civilian casualties even after a War is over. That is not even to mention the costs involved in disarming these bomblets.\n\n \n Some of the most effective weapons in our arsenal and widely used in our humanitarian effort of spreading democracy throughout Iraq. As were depleted uranium AP rounds, which are truly indiscriminate in water systems and skin contact. Moral high ground is a claim we use to spread our ideology by 'precision bombing'.", 
   {}, 
   105569, 
   null, 
   1113001740.0
  ], 
  [
   105580, 
   null, 
   "Big_Bear_Scot", 
   "Some of the most effective weapons in our arsenal and widely used in our humanitarian effort of spreading democracy throughout Iraq. As were depleted uranium AP rounds, which are truly indiscriminate in water systems and skin contact. Moral high ground is a claim we use to spread our ideology by 'precision bombing'.\n \n \n Isn't it strange that we(UK & US+ Collation of Willing emoticon_rolleyes ) went in to liberate Iraq from WMD and a mad dictator that killed innocent civilians, and we go in use weapons that are more dangerous than anything Saddam could have came up with(in that War anyway). \n \n We still do not know the full effects of depleted Uranium to the civilian population of War zones, but we still use them.", 
   {}, 
   105576, 
   null, 
   1113002160.0
  ], 
  [
   105585, 
   null, 
   "fracas", 
   "Let's see. If the use of ______ saves some of my friends and relatives who are in the \"service\" and over in _____fighting then so be it. \n \n Replace it when any form of war. How is that different?\n\n \n you don't seem to get it\n it is not about saving just friends and relative\n war is a very unfortunate and dirty undertaking. once started, should be resolved as soon as possible. had any diplomatic channels remain, a war would not have occurred. thus to end a war needs a victor. the faster the victory the better for both sides.\n \n bbs, ;)\n \n last i check, no napalm were used in a market square or in a line of civilians looking for work. yes Death is indiscriminate, as is a knife, a gun, a bomb. it is the same in your hand, mine, or bin laden. there is no intrinsic morality to the weapons we use. the morality is in the choice we have of who and when to kill. and aside from the morality, killing your own civilians is a foolish way to try to win a war.\n \n just as what differentiate us from animals is not what we do, animal wars as well, and frequently conducting total war. what differentiate us is our choice in when to wage war, as well as how to conduct ourselves in war.", 
   {}, 
   105552, 
   null, 
   1113003480.0
  ], 
  [
   105589, 
   null, 
   "Duo_Maxwell", 
   "That's not my point fracas. \n \n I'm merely saying any weapon can be justified on such logic.", 
   {}, 
   105585, 
   null, 
   1113003960.0
  ], 
  [
   105592, 
   null, 
   "fracas", 
   "That's not my point fracas. \n \n I'm merely saying any weapon can be justified on such logic.\n\n \n what i am saying is there is no use to asign moral value to weapons, but we should instead analyze the men wielding them, their reasons, motives and choices.\n if i kill a serial rapist with an assault rifle does it make me equivalent or worse than a molester killing a child with his hands?\n if i napalm a nazi battalion is this the same as using a plane on office workers?\n \n \n napalm, nukes, car bombs, whatever\n look at who and why they are being use and used against.", 
   {}, 
   105589, 
   null, 
   1113004440.0
  ], 
  [
   105658, 
   null, 
   "Hunter", 
   "Do the ends justify the means?\n \n Who knows, there seems to be some contention as to what the 'ends' are.\n \n First the plan was to neutralise the threat of WMD.\n Then it became the hunt for Saddam.\n Then it became secure Iraq for free elections\n Then it became support the Iraqi government until it can fight terrorism alone.\n If someone can tell us that this is the ultimate objective in the Middle East, then perhaps we can argue whether the ends justify the means.\n \n Myself, I believe that this 'liberation' is the precursor to a sustained occupation of oil-producing nations.To which the answer is 'yes, the end does justify the means. John Doe must be allowed enough cheap gas to run his V8 pickup, American politicians find it far easier to justify war than to justify responsible use of non-renewable resources.\n\n \n Wait a minute......I have a V8 pick-up truck that gets good mileage. The entire U.S. economy is vey dependent on oil. Without it, our economy would collapse. Think about that for awhile. After what those rats did on 9/11 I could care less about them. We should have nuked Iraq, paved it and called it the world's biggest parking lot---with oil spiggots.", 
   {}, 
   105526, 
   null, 
   1113024300.0
  ], 
  [
   105677, 
   null, 
   "Big_Bear_Scot", 
   "Wait a minute......I have a V8 pick-up truck that gets good mileage. The entire U.S. economy is vey dependent on oil. Without it, our economy would collapse. Think about that for awhile. After what those rats did on 9/11 I could care less about them. We should have nuked Iraq, paved it and called it the world's biggest parking lot---with oil spiggots.\n \n \n Not one of the 9/11 suicide bombers was from Iraq, Saddam had no links to the 9/11 attacks. So what would the nuking of Iraq achieve apart from killing a lot of innocent people, just like what happened on 9/11 ?\n \n \nwhat i am saying is there is no use to asign moral value to weapons, but we should instead analyze the men wielding them, their reasons, motives and choices.\n \n \n I respectively disagree :) , there are weapons we have in out arsenals that cause so much indiscriminate damage that you have to assign some sort of moral value to that weapon. For example I think a Nuclear Weapon is such a devastating weapon that the use of that weapon in no way can be morally justified. If there was no sort of moral value assigned to those sorts of weapons then those weapons would be used more often. Is this not one of the founding principles of MAD ?", 
   {}, 
   105658, 
   null, 
   1113032040.0
  ], 
  [
   105709, 
   null, 
   "georged", 
   "Not one of the 9/11 suicide bombers was from Iraq, Saddam had no links to the 9/11 attacks. \n\n \n Most Americans are still haven't mentally reconciled that fact in their infrequent stabs at reality. They're a little slow on the uptake because the US administration is still telling them the world is a much better place without Saddam. That means attempting to apply rational thinking to two subjects at the same time, which quite often has to compete with their favorite TV reality or game shows.", 
   {}, 
   105677, 
   null, 
   1113060060.0
  ], 
  [
   105712, 
   null, 
   "fracas", 
   "bbs\n the fall of communist europe started with Poland. why poland and not the soviet union itself? because the opportunity and events pointed to Poland.\n the fall of autocratic and extreme islam will start with Iraq.\n \n \n the course of history is defined by those who seek strategic changes, not a tit for tat response, and know a good opportunity for change when it occurs.", 
   {}, 
   105709, 
   null, 
   1113061560.0
  ], 
  [
   105715, 
   null, 
   "Eddie", 
   "not quite\n using nalpalm against insurgents/soldiers is not the same as suicide attacks against civilians.\n \n there is still a sense of right and wrong even in war and death.\n\n \n Agreed. But there`s a sliding scale. Killing someone needs to be justified, regardless if it`s a soldier dying from direct fire, civillian melted by \"collateral damage\" or innocent bystander being blown to pieces by a suicide-bomber.\n \n \nbbs\n the fall of communist europe started with Poland. why poland and not the soviet union itself? because the opportunity and events pointed to Poland.\n the fall of autocratic and extreme islam will start with Iraq.\n \n \n the course of history is defined by those who seek strategic changes, not a tit for tat response, and know a good opportunity for change when it occurs.\n\n \n I don`t see any paralells at all...", 
   {}, 
   105712, 
   null, 
   1113061980.0
  ], 
  [
   105716, 
   null, 
   "fracas", 
   "Eddie\n \n there is always a sliding scale because reality is not black and white\n \n \n and as to the parrel\n take it as either tsunami of changes often occur in the most unlikely of places\n or that the spread of freedom in Poland spread throughout eastern Europe, as the spread of freedom in Iraq will spread throughout the middle east.", 
   {}, 
   105715, 
   null, 
   1113062400.0
  ], 
  [
   105723, 
   null, 
   "Eddie", 
   "Eddie\n \n there is always a sliding scale because reality is not black and white\n\n \n Well, not always :) But, yeah, i get your point\n \n \nand as to the parrel\n take it as either tsunami of changes often occur in the most unlikely of places\n or that the spread of freedom in Poland spread throughout eastern Europe, as the spread of freedom in Iraq will spread throughout the middle east.\n\n \n But the change in Poland was not unlikely. Solidaritet had fought for independance for the Soviet Union for years, and had even achieved some considerablen successes in decades past. \n \n The fall of communism was not really the fall of an idea (like the fall of islamiso-fascism would require). It was the fall of central control and could, and did spread like ripples when the central control faltered due to ideological conflict and hesitation in its central authority. There is no such authority in islamo-fascism. Only figure-heads. There is no ideological authority. It`s like a dicease rather than a vicous animal. You can`t expect them to behave the same.", 
   {}, 
   105716, 
   null, 
   1113067440.0
  ], 
  [
   105725, 
   null, 
   "fracas", 
   "But the change in Poland was not unlikely. Solidaritet had fought for independance for the Soviet Union for years, and had even achieved some considerablen successes in decades past. \n \n The fall of communism was not really the fall of an idea (like the fall of islamiso-fascism would require). It was the fall of central control and could, and did spread like ripples when the central control faltered due to ideological conflict and hesitation in its central authority. There is no such authority in islamo-fascism. Only figure-heads. There is no ideological authority. It`s like a dicease rather than a vicous animal. You can`t expect them to behave the same.\n\n \n was not unlikely? as in likely or unlikely.\n there were many at the time who thought containment would be forever, and to challenge the soviet was foolish.\n Arab News link \n all ideas need a physical manifest, a control. good ones tend to reside within the hearts of men, bad one need a central system to perpetuate it. i see little difference in state sponsored communism and state sponsored islamofascism.", 
   {}, 
   105723, 
   null, 
   1113070980.0
  ], 
  [
   105733, 
   null, 
   "Eddie", 
   "was not unlikely? as in likely or unlikely.\n there were many at the time who thought containment would be forever, and to challenge the soviet was foolish.\n [URL=http://arabnews.com/? \n\n \n Many bellieved the Soviet Union would last. I don`t dispute this. But that Poland would be one of the first nations within the Soviet that would dissent was hardly a surprise (when the fall eventually came)...\n \n \n \n all ideas need a physical manifest, a control. good ones tend to reside within the hearts of men, bad one need a central system to perpetuate it. i see little difference in state sponsored communism and state sponsored islamofascism.\n\n \n Because the physical manifest of islamo-fascism resides in the hearts of men. While it is quite possible that islamo-fascism eventually will die out, or loose it`s political strength, it cannot be destroyed by severing its head (or as in the Soviet case, the head severing itself)...", 
   {}, 
   105725, 
   null, 
   1113072240.0
  ], 
  [
   105738, 
   null, 
   "Big_Bear_Scot", 
   "bbs\n the fall of communist europe started with Poland. why poland and not the soviet union itself? because the opportunity and events pointed to Poland.\n the fall of autocratic and extreme islam will start with Iraq.\n \n \n the course of history is defined by those who seek strategic changes, not a tit for tat response, and know a good opportunity for change when it occurs.\n\n \n The problems is Iraq was never a haven for the extreme form of Islam that we seen in Taliban and the 9/11 hijackers, Saddam was a ruthless secular dictator that oppressed the majority of the extreme Shia Islamist in Iraq. Sure he did use Islam every now and again but only when it suited his goals. \n \n Saddam seen himself in the mould of Nassar in trying to forge a Secular Pan Arab Nation and would destroy Israel and unite all Arab Countries under his control. \n In taking out Saddam we have allowed extreme Islamists to gain a foothold in Iraq, which only bodes badly for the future development of that Country. \n \n So the goals of the Bush admin was to topple Islamists, I can not think of any Country that is under the Islamists terrorist control, maybe parts of Iraq at the moment but no where else.\n \n As always fracas its a pleasure to cross swords with you again, but i still miss the old Portent P&R. emoticon_cry", 
   {}, 
   105725, 
   null, 
   1113072780.0
  ], 
  [
   105758, 
   null, 
   "fracas", 
   "the problem of islamofascism is that it is exported to the west and bred by the oppression of arabs at home.\n remove the oppression, undermine the export.", 
   {}, 
   105738, 
   null, 
   1113077520.0
  ], 
  [
   105868, 
   null, 
   "Hunter", 
   "the problem of islamofascism is that it is exported to the west and bred by the oppression of arabs at home.\n remove the oppression, undermine the export.\n\n \n Okay then, air drop porno tapes on the adherents of the cult of Islam. Maybe if those XXXXXX had more orgasms they would be easier to git along with. That failing, make sure to dip your bullets in pork fat before dispensing an idiot to Allah. On a serious note, just read the koran to realize what muslims won't to happen to you.", 
   {}, 
   105758, 
   null, 
   1113114600.0
  ], 
  [
   106235, 
   null, 
   "Big_Bear_Scot", 
   "the problem of islamofascism is that it is exported to the west and bred by the oppression of arabs at home.\n remove the oppression, undermine the export.\n\n \n I honestly can't see how the toppling of Oppressive dictators and the installation of a democracy can curb Terrorism, we live in democracies and we still have terrorist attacks e.g in Northern Ireland for years, McViegh & Unabomber in the US, France with Algerian Terror groups and Spain with ETA.", 
   {}, 
   105758, 
   null, 
   1113259560.0
  ], 
  [
   106283, 
   null, 
   "fracas", 
   "I honestly can't see how the toppling of Oppressive dictators and the installation of a democracy can curb Terrorism, we live in democracies and we still have terrorist attacks e.g in Northern Ireland for years, McViegh & Unabomber in the US, France with Algerian Terror groups and Spain with ETA.\n\n \n all depends on what you believe the root cause of terrorism is (and i'll tell you that it is not poverty)\n the problem is political disenfranchizement, at home in authoritarian states or abroad in marginalized ethnic neighborhood\n \n like crime (economic disenfranchizement) it won't be eliminated but can be managed\n but you still need to manage it by imposing accountability", 
   {}, 
   106235, 
   null, 
   1113272460.0
  ], 
  [
   106287, 
   null, 
   "georged", 
   "all depends on what you believe the root cause of terrorism is (and i'll tell you that it is not poverty)\n the problem is political disenfranchizement, at home in authoritarian states or abroad in marginalized ethnic neighborhood\n \n like crime (economic disenfranchizement) it won't be eliminated but can be managed\n but you still need to manage it by imposing accountability\n\n \n And who or what imposes that accountability? We in the US are a perfect example of a democracy being unable to provide political accountability. I think you're neglecting the fact that it becomes very simple to purchase public approval through designed fear, intentional or accumulative, by using public funds and ignoring accountability.", 
   {}, 
   106283, 
   null, 
   1113273900.0
  ], 
  [
   106293, 
   null, 
   "fracas", 
   "And who or what imposes that accountability? We in the US are a perfect example of a democracy being unable to provide political accountability. I think you're neglecting the fact that it becomes very simple to purchase public approval through designed fear, intentional or accumulative, by using public funds and ignoring accountability.\n\n \n accountability doesn't mean you get what you want\n \n even presidents get impeached here\n \n and between are the elections. lets not be naive to believe only one side exploit the system to win, and it wasn't a public funding issue either.\n fear: they will destroy social security\n fear: they will institute the draft\n wonder who propagated those gems", 
   {}, 
   106287, 
   null, 
   1113275100.0
  ], 
  [
   107033, 
   null, 
   "Taranaki", 
   "How do you think the Iraqis are going to view consensus and accountability when the country spearheading the regime change refuses to be bound by the wider community of the UN?\n \n Here's the rules,guys, Saddam was bad because he wouldn't obey UN resolutions, and kept killing people. So, things are gonna get done differently around here.....or WE'LL kill you.", 
   {}, 
   106293, 
   null, 
   1113456720.0
  ], 
  [
   107043, 
   null, 
   "Hunter", 
   "How do you think the Iraqis are going to view consensus and accountability when the country spearheading the regime change refuses to be bound by the wider community of the UN?\n \n Here's the rules,guys, Saddam was bad because he wouldn't obey UN resolutions, and kept killing people. So, things are gonna get done differently around here.....or WE'LL kill you.\n\n \n America should invade the UN next!!!!", 
   {}, 
   107033, 
   null, 
   1113457680.0
  ], 
  [
   107154, 
   null, 
   "georged", 
   "accountability doesn't mean you get what you want\n \n even presidents get impeached here\n \n and between are the elections. lets not be naive to believe only one side exploit the system to win, and it wasn't a public funding issue either.\n fear: they will destroy social security\n fear: they will institute the draft\n wonder who propagated those gems\n\n \n I suggest you reread your history on on presidential impeachment. None have been removed from office. \n \n I think you actually believe the common voter has a decision on how he/she is governed. That's hilarious.", 
   {}, 
   106293, 
   null, 
   1113491040.0
  ], 
  [
   107498, 
   null, 
   "Dono", 
   "Okay then, air drop porno tapes on the adherents of the cult of Islam. Maybe if those XXXXXX had more orgasms they would be easier to git along with. That failing, make sure to dip your bullets in pork fat before dispensing an idiot to Allah. On a serious note, just read the koran to realize what muslims won't to happen to you.\n\n If stupidity was music, this post would be a symphony. This \"cult\" you refer to is the fastest growing religion on earth with over 1.2 billion followers. While I am not a religious man, I have read both the Bible and the Quran with interest (and have found much wisdom in both tomes) and I can tell you that terrorism cannot be reconciled with the teachings of Islam. The radicals that distort religious teachings to promote their agenda, be they Bible-thumping KKK members or Al Kaida do not represent Christians or Muslims, and that mistake should not be made. To win, we must know who our enemies are.\n Dono", 
   {}, 
   105868, 
   null, 
   1113522300.0
  ], 
  [
   107537, 
   null, 
   "georged", 
   "If stupidity was music, this post would be a symphony. This \"cult\" you refer to is the fastest growing religion on earth with over 1.2 billion followers. While I am not a religious man, I have read both the Bible and the Quran with interest (and have found much wisdom in both tomes) and I can tell you that terrorism cannot be reconciled with the teachings of Islam. The radicals that distort religious teachings to promote their agenda, be they Bible-thumping KKK members or Al Kaida do not represent Christians or Muslims, and that mistake should not be made. To win, we must know who our enemies are.\n Dono\n\n \n Dono, you're suggesting realism and you know that's not applicable to many Americans. Most require someone else to blame things on and our politicians seldom fail in providing targets to refocus the general public from their compounded mistakes.", 
   {}, 
   107498, 
   null, 
   1113528360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Got napalm?", 
  "url": "http://www.4forums.com/political/current-events-debates/4775-got-napalm.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 4775, 
  "discussion_files": [
   [
    "312.html", 
    "http://www.4forums.com/political/current-events-debates/4775-got-napalm-print.html"
   ], 
   [
    "313.html", 
    "http://www.4forums.com/political/current-events-debates/4775-got-napalm-3-print.html"
   ], 
   [
    "314.html", 
    "http://www.4forums.com/political/current-events-debates/4775-got-napalm-2-print.html"
   ]
  ], 
  "identifier": 4775
 }
]