[
 [
  [
   106167, 
   null, 
   "Duo_Maxwell", 
   "Again shows why he's not a scumbag or a idiot. \n \n \nWASHINGTON - Sen. John McCain (news, bio, voting record) (R-Ariz.), breaking from his party's Senate leadership, said Sunday that he would oppose any move to prohibit filibusters against judicial nominations...\n \n In that way, he argued, the precedent could ultimately hurt the GOP by allowing Democrats to bar the filibuster the next time they hold the White House and a majority in the Senate. \n\n \n http://story.news.yahoo.com/news?tmpl=story&cid=2026&ncid=2026&e=5&u=/latimests/20050411/ts_latimes/mccainseesslipperyslopeinfilibusterban", 
   {
    "post_info": {
     "post_title": "Good Ol' McCain"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1113244080.0
  ], 
  [
   106208, 
   null, 
   "Alan Ryan", 
   "I know the filibuster is a legitimate Congressional privilege, but talking about nothing in particular for hours on end merely to frustrate some legislative proceedings etc., seems a bit ridiculous and perhaps undemocratic ?\n \n It might be said that the filibuster, at least indirectly, thwarts the \"will of the people\".", 
   {}, 
   106167, 
   null, 
   1113253200.0
  ], 
  [
   106230, 
   null, 
   "Duo_Maxwell", 
   "I know the filibuster is a legitimate Congressional privilege, but talking about nothing in particular for hours on end merely to frustrate some legislative proceedings etc., seems a bit ridiculous and perhaps undemocratic ?\n\n \n But it does prevent the majority from passing legislation clearly to discriminate and rob the minority of their voice and rights. \n \n \n\n It might be said that the filibuster, at least indirectly, thwarts the \"will of the people\".\n\n \n But the will of the people is not unified, as represneted in the mix of the politicans in the senate. \n \n Either way, the Senate will invaribly become Democrat heavy in the future and such precedent in just as frightening in their hands as in the Republicans. the irony of such is that if the measure passes, when it is used aganist the Republicans in the future, they will be crying foul for the lesgilation their own party passed. Bunch of hypocritical SOBs.", 
   {}, 
   106208, 
   null, 
   1113257700.0
  ], 
  [
   106236, 
   null, 
   "Big_Bear_Scot", 
   "I have heard a few thing about John McCain and from what I have heard he is one of the few true Conservatives left in the Republican Party that has been taken over by the Neo-cons and the Religious Right. BTW this is my own opinion and is taken from an outside perspective of US politics.\n \n It seems like McCain is not like your usual politician, he is thinking of the Long term consequences of the removal of the filibuster and he is also thinking outside of party political concerns. I can respect him for this.", 
   {}, 
   106230, 
   null, 
   1113260220.0
  ], 
  [
   106239, 
   null, 
   "Dono", 
   "McCaine is right. The Democrats are using the exact tactics that Republicans have used on them in the past, but now with the shoe on the other foot, the Republicans want to change the rules. Only a relatively small number of potential judges are in question with over 200 approved (I don't recall the exact numbers) and less than 30 in question. As far as the will of the people being thwarted, the people have no clue about the nominees or the process and will not unless a nominee is caught in bed with a dead girl or a live boy.\n Dono", 
   {}, 
   106208, 
   null, 
   1113262080.0
  ], 
  [
   106245, 
   null, 
   "daewoo", 
   "I disagree on this one.\n \n While he is certainly correct that the republicans have used this tactic in the past (a fact that republicans like to ignore when discussing the issue), I think that it is a poor tactic and we should put an end to it.", 
   {}, 
   106239, 
   null, 
   1113264360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Good Ol' McCain", 
  "url": "http://www.4forums.com/political/politics-debates/4793-good-ol-mccain.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4793, 
  "discussion_files": [
   [
    "12677.html", 
    "http://www.4forums.com/political/politics-debates/4793-good-ol-mccain-print.html"
   ]
  ], 
  "identifier": 4793
 }
]