[
 [
  [
   106233, 
   null, 
   "Sgt. Moose", 
   "...why I should be a liberal. \n \n (btw, I have no party....just curious)", 
   {
    "post_info": {
     "post_title": "Give me a few good reasons...."
    }
   }, 
   null, 
   null, 
   1113258480.0
  ], 
  [
   106238, 
   null, 
   "Big_Bear_Scot", 
   "...why I should be a liberal. \n \n (btw, I have no party....just curious)\n\n \n What kind of a Liberal ? Classical, Neo, American, European ?\n \n Liberalism is broad term, can you be a bit more specific ?", 
   {}, 
   106233, 
   null, 
   1113260700.0
  ], 
  [
   106257, 
   null, 
   "Duo_Maxwell", 
   "Liberal isn't a party just for your knowledge. \n \n Democrats aren't liberal just like republicans aren't conservative.", 
   {}, 
   106238, 
   null, 
   1113266940.0
  ], 
  [
   106307, 
   null, 
   "Steeeeve", 
   "...why I should be a liberal. \n \n (btw, I have no party....just curious)\n\n \n because you wanna be wrong all the time...that seems like a good reason :)", 
   {}, 
   106233, 
   null, 
   1113277980.0
  ], 
  [
   106311, 
   null, 
   "Duo_Maxwell", 
   "because you wanna be wrong all the time...that seems like a good reason :)\n\n \n Or you want to be a comedian like Steeeeve.", 
   {}, 
   106307, 
   null, 
   1113278220.0
  ], 
  [
   106312, 
   null, 
   "joebrummer", 
   "...why I should be a liberal. \n \n (btw, I have no party....just curious)\n\n \n \n Because you want to be fashionable......maybe because you don't want to look like dubya......maybe because liberals are more intelligent.......Pick any reason you like...\n \n \n To be a conservative means you are rigid and unopen to new ideas because you are too busy living in the past to realize where the world is going and how we should act when we get there......\n \n To be a liberal means you are open to new ideas and technology....it means that the goverment should stay out of where it shouldn't be and get in where it hasn't.", 
   {}, 
   106233, 
   null, 
   1113278640.0
  ], 
  [
   106319, 
   null, 
   "Master_Shake", 
   "Because you want to be fashionable......maybe because you don't want to look like dubya......maybe because liberals are more intelligent.......Pick any reason you like...\n \n \n To be a conservative means you are rigid and unopen to new ideas because you are too busy living in the past to realize where the world is going and how we should act when we get there......\n\n :) First of all, let me say that I try to lean away from labels when discussing things like this. Usually far too much overgeneneralization occurs as a result.\n \n When I am being light or talking about more specific groups, I tend to discuss this in the same way, but we can't generalize to every conservative with this. Yes this is true of some who call themselves conservateives, even many, but certainly not all. And it isn't true to true conservativism.\n \n \nTo be a liberal means you are open to new ideas and technology....it means that the goverment should stay out of where it shouldn't be and get in where it hasn't.\n\n I definitely agree with the first part(although this is only part of what it means to be a liberal). The part about the government staying out of where it shouldn't  be I think is a general ideal of most (if not all) political ideologies. These ideologies just have different ideas of what shouldn't  be gotten into. But to be honest, that idea is really talked  more about by true conservatives and libertarians.", 
   {}, 
   106312, 
   null, 
   1113281760.0
  ], 
  [
   106643, 
   null, 
   "kickin50", 
   "...why I should be a liberal. \n \n (btw, I have no party....just curious)\nSearch me. I'm still trying to figure out the difference between liberal and conservative - since frequently the labels don't seem to match the opinion.\n \n I have a shirt-tail relative that would certainly call himself a Conservative -- Southern -- very religious. He was recently heard to say \"I don't like to talk about other religions, but I hope that the next Pope will be an Evangelical.\" emoticon_wow emoticon_frazzled \n \n Therefore, since there are only two choice, I'll call myself a liberal.", 
   {}, 
   106233, 
   null, 
   1113403740.0
  ], 
  [
   106660, 
   null, 
   "Alan Ryan", 
   "Liberalism is often (if not always) understood as springing from a vision of society that is composed of individuals rather than, for example, classes. \n \n Such individuals are in a voluntary contractual relationship with government that emphasises liberty as a primary social good.\n \n Liberty is usually defended in such rights as those to free political institutions, religious practice, intellectual and artistic expression, and the right to private property. \n \n Thus liberalism implies a distrust of the right or efficiency of the state to interfere with personal freedoms and with the operation of economic markets.\n \n If this \"manifesto\" appeals to you, then I guess you can call yourself a liberal.", 
   {}, 
   106643, 
   null, 
   1113406260.0
  ], 
  [
   106863, 
   null, 
   "Duo_Maxwell", 
   "Search me. I'm still trying to figure out the difference between liberal and conservative - since frequently the labels don't seem to match the opinion.\n\n \n Or as we have often seem, people on the right throw out liberal any anyone who disagrees with them. The defintion of liberal for many is anyone who disgarees with the rank and file notions of the republican party, Skyllops for instances defines liberal by that defintiion.", 
   {}, 
   106643, 
   null, 
   1113430500.0
  ], 
  [
   106881, 
   null, 
   "Steeeeve", 
   "Or you want to be a comedian like Steeeeve.\n\n \n Nah, liberals are by no means comedians...And neither am I...however liberals due tend to be wrong on many things.", 
   {}, 
   106311, 
   null, 
   1113432120.0
  ], 
  [
   106938, 
   null, 
   "jskufan", 
   "Nah, liberals are by no means comedians...And neither am I...however liberals due tend to be wrong on many things.\n\n \n Why don't you humor everyone and elaborate on all the \"things\" that Liberals are \"wrong\" about as they pertain to today's political environment. Just mention a few of the important ones.", 
   {}, 
   106881, 
   null, 
   1113442980.0
  ], 
  [
   106946, 
   null, 
   "Big_Bear_Scot", 
   "Nah, liberals are by no means comedians...And neither am I...however liberals due tend to be wrong on many things.\n \n [*]The framers of the US constitution where wrong ?[*]Adam Smith and other porponents of Capitlaism are wrong ?[*]Individual Rights and Property Laws are wrong ?\n I could keep the list going of things Liberals have championed that we enjoy today.", 
   {}, 
   106938, 
   null, 
   1113444360.0
  ], 
  [
   107110, 
   null, 
   "Comrade Brian", 
   "you capitalists are all corrupt, you vote democrat or republican and then a company bribes/lobbies them,they get more money to be in office later,companies get more money, you get stuff taken away,there is hardly a politician who hasn't voted for corps. rather than helping people", 
   {}, 
   106946, 
   null, 
   1113481440.0
  ], 
  [
   107426, 
   null, 
   "Dzeron", 
   "[*]The framers of the US constitution where wrong ?[*]Adam Smith and other porponents of Capitlaism are wrong ?[*]Individual Rights and Property Laws are wrong ?\n I could keep the list going of things Liberals have championed that we enjoy today.\n\n \n What, liberals champion these things? Liberals have a tendency to undermine free markets.\n \n Liberals do champion individual rights, but they support an economic system that combines the worst aspects of capitalism and socialism. They combine taxation with real property - theft and theft.", 
   {}, 
   106946, 
   null, 
   1113518340.0
  ], 
  [
   107472, 
   null, 
   "Big_Bear_Scot", 
   "What, liberals champion these things? Liberals have a tendency to undermine free markets.\n \n \n I am talking about your classical Liberals, Classical Liberals tend to try and keep the Government out of business. An example of Classical Liberalism is the Whig Party(or The Liberal Party) in the UK of the last century, or the framers of the Constitution in the US.\n \n If you are talking about the Democrats in the US I would tend to say they don't fit the definition of Classical Liberalism. The Democrats in the US tend to resemble the Social Democrats of much of Europe except they seem to be more Centrist in their views in things such as Taxation and some Social issues.\n \n In the US I would say that maybe the Libertarian Party, seem to meet the definition of a classical Liberal. In the fact they support the free market, the reduction of Government in the Personal and Business spheres, the reduction of taxes etc etc.\n \n I would also say that when some posters say that Liberals come up with daft ideas they need to remember if it wasn't for Liberals through out the centuries we wouldn't have some of positive freedom we enjoy today.", 
   {}, 
   107426, 
   null, 
   1113520260.0
  ], 
  [
   107486, 
   null, 
   "Dzeron", 
   "I am talking about your classical Liberals, Classical Liberals tend to try and keep the Government out of business. An example of Classical Liberalism is the Whig Party(or The Liberal Party) in the UK of the last century, or the framers of the Constitution in the US.\n \n\n \n Well, if you are talking about classical liberals, say classical liberals. \"Liberal\" alone means an advocate of personal freedom and a mixed economy, at least in the U.S.", 
   {}, 
   107472, 
   null, 
   1113521040.0
  ], 
  [
   107506, 
   null, 
   "Dono", 
   "because you wanna be wrong all the time...that seems like a good reason :)\n\n NO one is wrong all the time. I expect Steeeeve to be right any day now.\n Dono", 
   {}, 
   106307, 
   null, 
   1113523440.0
  ], 
  [
   107509, 
   null, 
   "Big_Bear_Scot", 
   "Well, if you are talking about classical liberals, say classical liberals. \"Liberal\" alone means an advocate of personal freedom and a mixed economy, at least in the U.S.\n \n \n See that is main problem here, when you ask a definition of Liberalism to me or many European you will get the definition the same as the definition of a Classical Liberal. I qualified my post to you with Classical Liberal so the posters from the US understand what I am saying.\n \n The current definition of Liberalism in the US confuses me slightly, I understand how the term was used by the Democrats to describe themselves. During the McCarthy era many left leaning Democrats(the so called New Dealers) where in danger of getting accused of being Communists so to separate themselves distinctly from the Communists, the Socialists or even the Social Democrats they decided to call themselves Liberal. \n \n Now I am all for calling a spade, a spade so I don't like using the term Liberal to describe the Democrats. I prefer to use the term Social Democrats rather than Liberal.", 
   {}, 
   107486, 
   null, 
   1113523680.0
  ], 
  [
   107535, 
   null, 
   "georged", 
   "NO one is wrong all the time. I expect Steeeeve to be right any day now.\n Dono\n\n \n We're all waiting for that event, but he obviously still has many obstacles to overcome. He still believes in politicians, but young men normally outgrow those fantasies. Care to take odds?", 
   {}, 
   107506, 
   null, 
   1113528060.0
  ], 
  [
   107538, 
   null, 
   "jskufan", 
   "We're all waiting for that event, but he obviously still has many obstacles to overcome. He still believes in politicians, but young men normally outgrow those fantasies. Care to take odds?\n\n \n They typically outgrow those fantasies just about when they enter the workforce and start paying taxes.", 
   {}, 
   107535, 
   null, 
   1113529140.0
  ], 
  [
   107546, 
   null, 
   "georged", 
   "They typically outgrow those fantasies just about when they enter the workforce and start paying taxes.\n\n \n This forum seemingly has an abundance of posters who haven't mentally entered the reality of mainstream society. At least for their sake I hope that's the excuse.", 
   {}, 
   107538, 
   null, 
   1113530880.0
  ], 
  [
   107560, 
   null, 
   "Duo_Maxwell", 
   "This forum seemingly has an abundance of posters who haven't mentally entered the reality of mainstream society. At least for their sake I hope that's the excuse.\n\n \n I'd hate to have to accept that they are just stupid. It does seem that we have had a increase in the average stupidity level though. \n \n From people with horrible grasps on finances to biology to the legal system, there's no end.", 
   {}, 
   107546, 
   null, 
   1113533580.0
  ], 
  [
   107570, 
   null, 
   "sinjin", 
   "This forum seemingly has an abundance of posters who haven't mentally entered the reality of mainstream society. At least for their sake I hope that's the excuse.\n\n \n I've gotten the feeling lately that someone had forgotten to lock the \"ward\".", 
   {}, 
   107546, 
   null, 
   1113536820.0
  ], 
  [
   107641, 
   null, 
   "georged", 
   "My recent very favorite was the poster who condemned society for 'taking the life of a perfectly coherent woman' (Schiavo).\n \n Justifications of our Iraq policies are always good for a few laughs, especially the spreading of democracy in Saudi Arabia, as is those believing they can retire to more than a cardboard box and dry petfood on 5% of lifetime earnings under the crusader's proposed SS reform.\n \n I avoid religious and creation forums but the bible thumpers now seem to be spilling out of those venues preaching angry scipture as answers to virtually every forum topic. \n \n More than one ward was left unlocked.", 
   {}, 
   107570, 
   null, 
   1113576240.0
  ], 
  [
   107810, 
   null, 
   "Duo_Maxwell", 
   "I love the posts of self proclaimed conservatives calling actual conservative judges \"activists\" for following the law to the letter. Not to mention another so called conservative wanting to prosecute people for following the law.\n \n I find endless humor in the destruction of their own badly made fascades.", 
   {}, 
   107641, 
   null, 
   1113596940.0
  ], 
  [
   108209, 
   null, 
   "Mach", 
   "What, liberals champion these things? Liberals have a tendency to undermine free markets.\n \n Liberals do champion individual rights, but they support an economic system that combines the worst aspects of capitalism and socialism. They combine taxation with real property - theft and theft.\n\n \n How can one enforce invidiual rights without taxation? It seems you have to deny the importance of enforcing individual rights if you want to do away with taxation. \n \n Likewise, property ownership is required to place ownership in some orderly, controlled strucutre. The alternative is chaos/anarachy, where no one owns anything, a state of living most people don't seem to think is a good way to exist in a society. It's one way, but doesn't seem to achieve the goals we have as a society. And this is just one of many societies.\n \n There is no sliver bullet for a dynamic, complex society. It's a give and take based on the time, the individuals that form it, and the environment.\n \n -Mach", 
   {}, 
   107426, 
   null, 
   1113765420.0
  ], 
  [
   108427, 
   null, 
   "Voice Of Reason", 
   "...why I should be a liberal. \n \n \n So I can spend tax payers hard earned money, as long as its not mine..... :)", 
   {}, 
   108209, 
   null, 
   1113801720.0
  ], 
  [
   108430, 
   null, 
   "Duo_Maxwell", 
   "So I can spend tax payers hard earned money, as long as its not mine..... :)\n\n \n Well, liberals do that now, republicans let you spend your grandchildren's future tax payer money: how does it feel vor to rob your grandchildren of their money? ", 
   {}, 
   108427, 
   null, 
   1113801840.0
  ], 
  [
   108434, 
   null, 
   "REMF Hunter", 
   "So I can spend tax payers hard earned money, as long as its not mine..... :)\n\n \n \n HMMMMMMN, let us see, record deficits, corporate welfare to the point where they are only responsible for 16% of the tax base, tax cuts for the wealthy, a Medicare Program headed for Bankruptcy, Schools going under, new laws that hold people responsible for their spending, but let the Corporations and Government do whatever they feel. Yes Sir, being an Independent Conservative with Republican leanings sure has proven your ability to be analytical and well informed. \n \n Remind me again which Party is the Fiscally responsible one? emoticon_confused", 
   {}, 
   108427, 
   null, 
   1113802500.0
  ], 
  [
   108479, 
   null, 
   "Duo_Maxwell", 
   "Vor as a conservative. \n \n That's the funniest thing I've ever heard. VOR is a hardcore republican, conservative ideology hater. The fact that he still supports the republican adminstration is a sign of that. The adminstration that has forsaken conservatism virtually as a whole. \n \n Which is better: Pay as you go, or spend, borrow, spend, borrow, spend, borrow, and screw the future generations?", 
   {}, 
   108434, 
   null, 
   1113812940.0
  ], 
  [
   109043, 
   null, 
   "kickin50", 
   "See that is main problem here, when you ask a definition of Liberalism to me or many European you will get the definition the same as the definition of a Classical Liberal. I qualified my post to you with Classical Liberal so the posters from the US understand what I am saying.\n \n The current definition of Liberalism in the US confuses me slightly, I understand how the term was used by the Democrats to describe themselves. During the McCarthy era many left leaning Democrats(the so called New Dealers) where in danger of getting accused of being Communists so to separate themselves distinctly from the Communists, the Socialists or even the Social Democrats they decided to call themselves Liberal. \n \n Now I am all for calling a spade, a spade so I don't like using the term Liberal to describe the Democrats. I prefer to use the term Social Democrats rather than Liberal.\nThat's my point exactly,too. The terms liberal and conservative are being completely mangled in American politics. Working off of the definition in post #9, I don't think I've ever met a true liberal or a true conservative. At this point in time, the term Conservative really means, in my opinion, a desire to legislate a return to a happier time, say the 1950's, when TV was I Love Lucy, all girls were virgins, drugs were aspirin, and everybody paid their bills. Of course, most Conservatives weren't actually there. I was and know that it can't be recaptured. I also know that they wouldn't like it if they had it. Our standard of living was very different. Conservatives don't actually want to become a one car family. The term Liberal got hung on everybody else. Liberal and Conservative aren't about text book definitions. It not even about government. It's about societal rules. Those labels are simply being used interchangeably with the Republican and Democratic parties. It no longer follows that the liberals are for the individual and the conservatives are for classes (as the definition puts it).\n \n That definition SHOULD work. It doesn't. A true liberal or a true conservative doesn't fit in to either party. It's best to have a mental scorecard on where each party stands on each issue. It's a crazy illogical mix.\n \n From the definiton in post # 9 paragraph #4 - Thus liberalism implies a distrust of the right or efficiency of the state to interfere with personal freedoms and with the operation of economic markets.\n \n That paragraph best describes the Republican party regarding issues such as the environment, gun control, and the economy/taxes.\n \n That paragraph best describes the Democratic party on issues such as prayer in school, the Patriot Act, and .....\n \n I'm here in Ohio. I heard recently that my state legislature is considering a law that says I couldn't pull the plug on my husband of 32 years until I get permission from our children, his parents, and his siblings. Wonderful. He hasn't seen his brother and sister in 20 years, doesn't care, and neither sibling lives in Ohio. There's an example of just plain stupidity in the legislature. A one size fits all law because of a distrust of the judiciary. By the definition, distrust of the judiciary should be a Liberal belief - yet it's not - it's Conservative.\n \n So, I'm still sticking with Liberal - because I'm actually sticking with the Democrats. I'm not a liberal. I just have to be prepared to be called one.", 
   {
    "unicode_changes_made": true
   }, 
   107509, 
   null, 
   1113908820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Give me a few good reasons....", 
  "url": "http://www.4forums.com/political/politics-debates/4794-give-me-few-good-reasons.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4794, 
  "discussion_files": [
   [
    "15167.html", 
    "http://www.4forums.com/political/politics-debates/4794-give-me-few-good-reasons-print.html"
   ], 
   [
    "15168.html", 
    "http://www.4forums.com/political/politics-debates/4794-give-me-few-good-reasons-3-print.html"
   ], 
   [
    "15169.html", 
    "http://www.4forums.com/political/politics-debates/4794-give-me-few-good-reasons-2-print.html"
   ]
  ], 
  "identifier": 4794
 }
]