[
 [
  [
   106560, 
   null, 
   "Voice Of Reason", 
   "Your comments please:", 
   {
    "post_info": {
     "post_title": "Should Partial Birth Abortion be banned?"
    }
   }, 
   null, 
   null, 
   1113355320.0
  ], 
  [
   106562, 
   null, 
   "Duo_Maxwell", 
   "If there is a clause that allows it to be legal if the mother's life is in danger.", 
   {}, 
   106560, 
   null, 
   1113355500.0
  ], 
  [
   106586, 
   null, 
   "Steeeeve", 
   "At least you didn't say \"Mothers health\"....I hate that term...it means anything.", 
   {}, 
   106562, 
   null, 
   1113361440.0
  ], 
  [
   106587, 
   null, 
   "Sgt. Moose", 
   "If there is a clause that allows it to be legal if the mother's life is in danger.\n\n \n \n What he said. Or if it's rape or incest.", 
   {}, 
   106562, 
   null, 
   1113361560.0
  ], 
  [
   106592, 
   null, 
   "Master_Shake", 
   "At least you didn't say \"Mothers health\"....I hate that term...it means anything.\n\n \n Exactly, this has been used as a loophole to get away with anything.", 
   {}, 
   106586, 
   null, 
   1113363240.0
  ], 
  [
   106601, 
   null, 
   "Voice Of Reason", 
   "I think it goes without saying that any time the mother's life is endangered then and abortion can take place............\n \n \n As far as rape and incest if and abortion has to take place lets hope that it is before the last 3 months of the pregnancy........", 
   {}, 
   106592, 
   null, 
   1113370920.0
  ], 
  [
   106604, 
   null, 
   "Hunter", 
   "Abortion is never justifiable homicide. It is never manslaughter. It is never an accidental killing. It is murder. It is the taking of a human life with malice and aforethought. If it goes un-punished in this life, rest assured that it will be judged by your creator in the next life. You liberal females who think that killing un-born children is a healthy activity are going to be in for a great surprise some day.\n I have talked to many women who had abortions in their past; all of them were ashamed of what they did. For them, their guilt was almost too great to bear. So, I ask one more time; what person posting on this topic can say that they wish that their mothers had aborted them???", 
   {}, 
   106592, 
   null, 
   1113371520.0
  ], 
  [
   106608, 
   null, 
   "Cone", 
   "a lot of folks have said that partial birth abortion should be banned. My question is why should it be banned?", 
   {}, 
   106604, 
   null, 
   1113373260.0
  ], 
  [
   106609, 
   null, 
   "Steeeeve", 
   "I dunno about if the mother is gonna die...granted it is 1 out of a million at best...and probably would come down to you save the life you can (which is the mothers). Rape and Incest should not be in there ever...even if you believe in this reason for aborition it should be done in the first 3 weeks...which I still dont agree with.", 
   {}, 
   106604, 
   null, 
   1113373260.0
  ], 
  [
   106610, 
   null, 
   "Steeeeve", 
   "Yeah, answer Cones question...\n \n WHY SHOULD IT BE BANNED?\n \n \nMy question is why should it be banned?\n", 
   {}, 
   106609, 
   null, 
   1113373320.0
  ], 
  [
   106617, 
   null, 
   "Duo_Maxwell", 
   "I think it goes without saying that any time the mother's life is endangered then and abortion can take place.\n\n \n Then why have you attacked Kerry and other democrats for voting aganist abortion bills that did not have such clauses? \n \n Oh yes, I know why, because you're a lying hypocrite.", 
   {}, 
   106601, 
   null, 
   1113378720.0
  ], 
  [
   106652, 
   null, 
   "Steeeeve", 
   "either that or John Kerry said he wanted a clause about the MOTHERS HEALTH....why don't you not call people liars too...I recall someone by the name of \"Steen Banned\" that didn't stop doing this...He/she hasn't posted in awhile.", 
   {}, 
   106617, 
   null, 
   1113405780.0
  ], 
  [
   106675, 
   null, 
   "Cone", 
   "Then why have you attacked Kerry and other democrats for voting aganist abortion bills that did not have such clauses?\n\n \n \neither that or John Kerry said he wanted a clause about the MOTHERS HEALTH\n\n \n Incidentally, the bill John Kerry voted against had a clause in it protecting the life of the mother. It said:\n \n \n(a) Any physician, who, in or affecting interstate of foreign commerce, knowingly performs a partial-birth abortion and thereby kills a human fetus shall be fined under this title or imprisoned not more than two years, or both. This subsection does not apply to a partial-birth abortion that is necessary to save the life of a mother whose life is endangered by a physical disorder, physical illness, or physical injury, including a life-endangering physical condition caused by or arising from the pregnancy itself...\n\n John Kerry's refusal to vote for this bill is understandable because it would actually ban the practice of partial-birth abortion. He would rather it include mother's health in the legal sens so it looks like he supported a bill that appeared to ban partial birth abortions, but in reality had no affect on the practice.", 
   {}, 
   106617, 
   null, 
   1113409380.0
  ], 
  [
   106678, 
   null, 
   "jitobear", 
   "As long as the mother's life is considered first - ban away. The argument has always seemed like window dressing to me. The number of late term abortions is rare, and very few doctors perform them unless medically necessary - so any law is pretty much just stating out loud that what is happening must happen.\n \n Waste of time and not the real issue for either the pro-life or pro-choice if you ask me.\n \n Energy needs to be focused on reducing unwanted pregnancy and reducing the reasons women choose to abort (early pregnancy). That is where most of the problem lay.", 
   {}, 
   106675, 
   null, 
   1113409920.0
  ], 
  [
   106680, 
   null, 
   "jitobear", 
   "You liberal females who think that killing un-born children is a healthy activity are going to be in for a great surprise some day.\n\n \n Who said it was healthy? It's not, but then, neither is pregnancy.\n \n And you conservative men that think that healthy pregnancies can a occur without addressing the needs of mothers or think that demonizing women in a hard situation will lead happy, healthy loving mothers and home environments for babies need to GET A BRAIN.\n \n \nSo, I ask one more time; what person posting on this topic can say that they wish that their mothers had aborted them???\n\n \n Wish it? That is silly. Nobody wishes for abortion.\n \n Do I support her to have had the right to abort me? YES. Especially if I were the result of a violent crime or if I were a threat to her health or livlihood. I do not believe it my right at any stage of my life to do her harm.", 
   {}, 
   106604, 
   null, 
   1113410040.0
  ], 
  [
   106770, 
   null, 
   "Steeeeve", 
   "No one has answered the question yet....Why would you want to ban Partial Birth abortion?", 
   {}, 
   106680, 
   null, 
   1113420240.0
  ], 
  [
   106821, 
   null, 
   "jitobear", 
   "No one has answered the question yet....Why would you want to ban Partial Birth abortion?\n\n \n Because by the third trimester it stands a reasonable chance of survival outside the mother.", 
   {}, 
   106770, 
   null, 
   1113425280.0
  ], 
  [
   106823, 
   null, 
   "Steeeeve", 
   "So it is a person at the third trimester? Not only that, the basis for being a person would presumably be when one can survive outside the mothers womb. If this is the case...it would be 24weeks is when a person is formed...however, this changed all the time so I guess when a person has rights varies whenever...However!!!!A kid really can't survive on its own outside the womb for awhile...So I dunno how survival outside of the womb is a basis for whether or not you can live or die.", 
   {}, 
   106821, 
   null, 
   1113425700.0
  ], 
  [
   106827, 
   null, 
   "Cone", 
   "Because by the third trimester it stands a reasonable chance of survival outside the mother.\n\n A fetus enjoys a reasonable chance of survival outside of the mother not just from the third trimester to birth, but from conception to birth so long as it isn't interfered with.", 
   {}, 
   106821, 
   null, 
   1113426300.0
  ], 
  [
   106861, 
   null, 
   "Duo_Maxwell", 
   "Incidentally, the bill John Kerry voted against had a clause in it protecting the life of the mother. It said:\n \n John Kerry's refusal to vote for this bill is understandable because it would actually ban the practice of partial-birth abortion. He would rather it include mother's health in the legal sens so it looks like he supported a bill that appeared to ban partial birth abortions, but in reality had no affect on the practice.\n\n \n And if you remember, during the 3rd debate, he specifically noted his second reason: clauses that did forced minors to get approval. Notice that the bill you cite lacks such a clause. \n \n VOR is a hypocritical liar. I have posted alink where you can look at his history. Merely because you are too LAZY to do so does not make my claim wrong.", 
   {}, 
   106675, 
   null, 
   1113430380.0
  ], 
  [
   106873, 
   null, 
   "Steeeeve", 
   "haha, calling people names is a good way to win an arguement.", 
   {}, 
   106861, 
   null, 
   1113431640.0
  ], 
  [
   106882, 
   null, 
   "Voice Of Reason", 
   "Then why have you attacked Kerry and other democrats for voting aganist abortion bills that did not have such clauses?\n \n \n Because you hero Kerry is a hypocrite........When he is in New England he is pro choice..When he is in the bible belt he is pro life.........\n \n You can't have it both ways little man..........", 
   {}, 
   106680, 
   null, 
   1113432120.0
  ], 
  [
   106902, 
   null, 
   "Cone", 
   "And if you remember, during the 3rd debate, he specifically noted his second reason: clauses that did forced minors to get approval. Notice that the bill you cite lacks such a clause. \n \n VOR is a hypocritical liar. I have posted alink where you can look at his history. Merely because you are too LAZY to do so does not make my claim wrong.\n\n I don' care what VOR thinks, I care what you think. \n \n To the question\n \n \nShould Partial Birth Abortion be banned?\n\n You said \n \n \nIf there is a clause that allows it to be legal if the mother's life is in danger.\n\n I thought, whoa Duo just might have a conscience afterall. But then you posted this \n \n \nThen why have you attacked Kerry and other democrats for voting aganist abortion bills that did not have such clauses?\n \n Oh yes, I know why, because you're a lying hypocrite.\n\n This perplexed me, so I posted the following:\n \n \nIncidentally, the bill John Kerry voted against had a clause in it protecting the life of the mother. It said:\n \n Quote:\n Originally Posted by Partial Birth Abortion Ban Act of 2003\n (a) Any physician, who, in or affecting interstate of foreign commerce, knowingly performs a partial-birth abortion and thereby kills a human fetus shall be fined under this title or imprisoned not more than two years, or both. This subsection does not apply to a partial-birth abortion that is necessary to save the life of a mother whose life is endangered by a physical disorder, physical illness, or physical injury, including a life-endangering physical condition caused by or arising from the pregnancy itself...\n \n\n Which clearly proves that the Partial Birth Abortion Ban act of 2003 had a clause that would allow this procedure in cases necessary to preserve the life of the mother. This bill, under your criteria for a ban (see your own quote I posted), should have been happily accepted and praised by you.\n \n Now, it being the case that a clause claiming the \"health\" of the mother would actually do nothing, you should chide the good Senator for not accepting this ban. Kerry cannot be accused of hypocrisy as he has always used the health reason, not the life reason. But you, Duo, judging from your post do not accept the health reason.\n \n Therefore, I conclude that you should be gravely disappointed in Senator Kerry (and everyone else opposing this ban). This presents several implications that I will point out.\n [*]You should be upset with John Kerry and any politician who opposed this ban because they opposed a bill that had within it the clause that would cause you to approve of a ban on partial birth abortion.[*]By calling those people who attack politicians not supporting the Partial Birth Ban Act of 2003 hypocrites, you are essentially calling yourself a hypocrite.[*]If you wish to avoid calling yourself a hypocrite, you must do one of the following:\n [*] Support the Partial Birth Abortion procedure[*] Amend your necessary protectionist clause for a ban from \"to protect the life of the mother\" to \"protect the health of the mother\". But this would just be the same as 1.[*] Simply quit calling people hypocrites for attacking politicians not supporting this ban, because in doing so, you are essentialy saying \"Hello everyone, my name is Duo_Maxwell and I'm a hypocrite\" \n To sum up, Kerry's secondary reasons for opposing the ban are not relavent because you did not say in your post, \"We should ban partial birth abortions so long as there is a clause protecting the mothers life and a clause that didn't require minors to get parental approval.\" But you didn't say this.\n \n Therefore, in calling those who attack Kerry for not supporting that ban hypocrites, you are calling yourself a hypocrite. Since I would never want to be accused of calling myself a hypocrite, I offered some solutions that might fix your paradoxical situation.\n \n So Duo, which option do you choose, or are you satisfied with calling yourself a hypocrite?", 
   {}, 
   106861, 
   null, 
   1113435420.0
  ], 
  [
   106942, 
   null, 
   "Duo_Maxwell", 
   "I don't care if you don't care what VOR thinks. \n \n \nThis bill, under your criteria for a ban (see your own quote I posted), should have been happily accepted and praised by you.\n\n \n I didn't talk about that bill at all. \n \n \nyou should chide the good Senator for not accepting this ban. Kerry cannot be accused of hypocrisy as he has always used the health reason, not the life reason. But you, Duo, judging from your post do not accept the health reason.\n\n \n What? I chide Kerry for being a incompetent douchebag. He's a horrible candidate. Make no assumption that I actually like him or much of what he says. I don't accept any morality that is shoved down my throat as a reasons to ban or not to ban anything.  \n \n \nYou should be upset with John Kerry and any politician who opposed this ban because they opposed a bill that had within it the clause that would cause you to approve of a ban on partial birth abortion.\n\n \n You assume too much. Merely because I don't agree with partial birth does not mean I support legislation. It's clearly a infrigment about women's ability to control their reproduction. I may not like the idea but I won't support laws that restrict rights. That by itself invalides your entire argument. You based your claims on something that was unproven. That is the fallacy of begging the question. Before you made such claims, you should have asked. I however, have dealt with VOR for over two years. You have seen me for less then 1/4 of that. \n \n \nBy calling those people who attack politicians not supporting the Partial Birth Ban Act of 2003 hypocrites, you are essentially calling yourself a hypocrite.\n\n \n Wrong. Very much so. I don't even understand how you came to such conclusion. Vor is a lying hypocrite because he has previously attack Kerry for voting aganist other bills that did not have such clauses when he here says it is good reason for abortion. See above. \n \n Your third clause is irrevelant because it assumes I will support such legislation. \n \n \nBut you didn't say this.\n\n \n I suppose I over estaminted the the level of informity of you and other members. I will remember not to do such things in the future. I expected you and others to have watched the debates and realized such basic information. I will lower my standards for you people next time. \n \n \nSo Duo, which option do you choose, or are you satisfied with calling yourself a hypocrite?\n\n \n Since your argument is based upon a huge assumption that hasn't panned out, it is quite irrevelant to ask me such a question.", 
   {}, 
   106902, 
   null, 
   1113443520.0
  ], 
  [
   106943, 
   null, 
   "Duo_Maxwell", 
   "Because you hero Kerry is a hypocrite........When he is in New England he is pro choice..When he is in the bible belt he is pro life.........\n \n You can't have it both ways little man..........\n\n \n You obviously don't understand. No one wants you to get a abortion. You are still spouting that bull**** that the pro choice wants you to get a abortion. Pro choice merely respects your decision either way.\n \n You're still a lying hypocrite for attacking someone for doing what you support.", 
   {}, 
   106882, 
   null, 
   1113443700.0
  ], 
  [
   106951, 
   null, 
   "Voice Of Reason", 
   "You obviously don't understand. No one wants you to get a abortion. You are still spouting that bull**** that the pro choice wants you to get a abortion. Pro choice merely respects your decision either way.\n \n You're still a lying hypocrite for attacking someone for doing what you support.\n\n \n Little man is your real name John KerrY? you flip flop just like him", 
   {}, 
   106943, 
   null, 
   1113444780.0
  ], 
  [
   106953, 
   null, 
   "Duo_Maxwell", 
   "Little man is your real name John KerrY? you flip flop just like him\n\n \n Please. Why would I insult myself? That is ridiculous. \n \n How am I flip flopping? Oh wait, I'm not. You assume that I support right restricting laws even I support the intension of that law. WRONG. \n \n Amazing how you constantly avoid discussing what you quote.", 
   {}, 
   106951, 
   null, 
   1113445020.0
  ], 
  [
   106969, 
   null, 
   "chloe", 
   "I don't care if you don't care what VOR thinks. \n \n\n Oh Yeah,\n I don't care if duo doesn't care if cone doesnt care what vor thinks!\n \n \n so there! emoticon_xclown", 
   {}, 
   106942, 
   null, 
   1113448680.0
  ], 
  [
   106985, 
   null, 
   "Cone", 
   "You assume too much. Merely because I don't agree with partial birth does not mean I support legislation.\n\n Duo, the question that you responded to was this \"Should partial birth abortion be banned?\" to which you answered \"If there is a clause that allows it to be legal if the mother's life is in danger.\"\n \n Putting the question together with your answer we easily infer that you think partial birth abortion should be banned if there is a clause that allows it to be legal if the mother's life is in danger. The question wasn't \"In what cases would it be acceptible to ban partial birth abortion\" it was \"Should it be banned.\" You answered in the affirmative. What other way could the procedure be banned but through legislation?\n \n \nYou based your claims on something that was unproven. That is the fallacy of begging the question.\n \n I based my claims solely on the merit of your own words in this forum. As I have pointed out, if you do not amend what you said at the beginning, you undermine your own argument by calling yourself a hypocrite.\n \n \nI suppose I over estaminted the the level of informity of you and other members. I will remember not to do such things in the future. I expected you and others to have watched the debates and realized such basic information. I will lower my standards for you people next time.\n\n Wow, your standards are so high. What else would you expect except that when you say \"Partial birth abortion should be banned so long as there is a clause protecting the life of the mother\" everyone reads that as saying \"Partial birth abortion should be banned so long as there is a clause protecting the life of the mother\"\n \n If you are going to respond to something, you should at least make your position generally clear. As I have pointed out, the only thing your answer to the poll made clear is that you believe abortion should be banned so long as there is a clause protecting the life of the mother. You may not actually believe that, but who could tell this from your statement? Why bother answering a question with a statement affirming something you don't believe?", 
   {}, 
   106942, 
   null, 
   1113450060.0
  ], 
  [
   106989, 
   null, 
   "Steeeeve", 
   "Oh Yeah,\n I don't care if duo doesn't care if cone doesnt care what vor thinks!\n \n \n so there! emoticon_xclown\n\n \n Oh yeah!! well,\n \n I don't care if you dont care if due doesn't care if cone doesnt care what vor thinkgs!!!\n \n SO HA..take that you ...you...you....loser! emoticon_xbouncer emoticon_xgood emoticon_xhoho", 
   {}, 
   106969, 
   null, 
   1113450360.0
  ], 
  [
   106996, 
   null, 
   "Duo_Maxwell", 
   "Duo, the question that you responded to was this \"Should partial birth abortion be banned?\" to which you answered \"If there is a clause that allows it to be legal if the mother's life is in danger.\"\n\n \n Does it mean that we should? Merely because I agree that it should be banned doesn't mean I will support legislation that infringes upon the rights of women. I think alot of things should be done, but not at significent costs. The question lacks such questions. Again, you assume too much \n \n \nYou answered in the affirmative. What other way could the procedure be banned but through legislation?\n\n \n Killing those who perform it, of course that's not very viable. See above though. Complexity is something your asseration lacks. \n \n \n \n I based my claims solely on the merit of your own words in this forum. As I have pointed out, if you do not amend what you said at the beginning, you undermine your own argument by calling yourself a hypocrite.\n\n \n On the contrary, I never called myself a hypocrite, not to mention how and why I support such issues, and on what grounds and what costs goes into if I support actual legislation. The question again lacks specifics, as to what cost, why, when by whom, all sorts of importnat issues.\n \n \n\n Wow, your standards are so high. What else would you expect except that when you say \"Partial birth abortion should be banned so long as there is a clause protecting the life of the mother\" everyone reads that as saying \"Partial birth abortion should be banned so long as there is a clause protecting the life of the mother\"\n\n \n You're not responding to what I said. I expected people to have listened, or at least read the transcript of the debate. If you have failed to watch the debate, you shouldn't be commenting upon my position. \n \n \n\n If you are going to respond to something, you should at least make your position generally clear. As I have pointed out, the only thing your answer to the poll made clear that you believe abortion should be banned so long as there is a clause protecting the life of the mother. You may not actually believe that, but who could tell this from your statement?\n\n \n One who understand that issues are never cut and dry.", 
   {}, 
   106985, 
   null, 
   1113451800.0
  ], 
  [
   107006, 
   null, 
   "Cone", 
   "Does it mean that we should? Merely because I agree that it should be banned doesn't mean I will support legislation that infringes upon the rights of women. I think alot of things should be done, but not at significent costs. The question lacks such questions. Again, you assume too much\n\n My induction is sound, and you have not showed it to be incorrect. You need to change your first statement before I will accept your arguments.\n \n \nYou're not responding to what I said. I expected people to have listened, or at least read the transcript of the debate. If you have failed to watch the debate, you shouldn't be commenting upon my position.\n\n I have clearly responded to what you said because I included your full statements in my argument, thus showing I have read the whole debate. If you have decided not to make your position clear, you shouldn't be commenting on this topic.", 
   {}, 
   106996, 
   null, 
   1113452640.0
  ], 
  [
   107010, 
   null, 
   "Duo_Maxwell", 
   "My induction is sound, and you have not showed it to be incorrect. You need to change your first statement before I will accept your arguments.\n\n \n Your induction is based upon a assumption that is not true. I have clearly stated that while I think something should ____ that does not mean I support actual legislation when we account for other factors. That by itself invalides your claims. You need to realize the foundation of your argument has just evaporated. \n \n \n\n I have clearly responded to what you said because I included your full statements in my argument, thus showing I have read the whole debate. If you have decided not to make your position clear, you shouldn't be commenting on this topic.\n\n \n on the contrary, you clearly cited a quote where I was talking about how one should have paid attention to the debates, specifically to Kerry's speech. you failed to comment upon that in your response to such a quote. Therefore, if you are not actually paying attention, you shouldn't be commenting. Look at at Marc9000, he makes insane comments that have nothing to do with what he quotes. Do you want to look like him?", 
   {}, 
   107006, 
   null, 
   1113453000.0
  ], 
  [
   107018, 
   null, 
   "Cone", 
   "Your induction is based upon a assumption that is not true. I have clearly stated that while I think something should ____ that does not mean I support actual legislation when we account for other factors. That by itself invalides your claims. You need to realize the foundation of your argument has just evaporated.\n\n So is it now safe to say that your initial claim \"Partial birth abortion should be banned so long as there is a clause protecting the life of the mother\" has now been amended to \"Partial birth abortion should be banned so long as there is a clause protecting the life of the mother and other clauses that take into account other factors?\"", 
   {}, 
   107010, 
   null, 
   1113453540.0
  ], 
  [
   107019, 
   null, 
   "Steeeeve", 
   "Your induction is based upon a assumption that is not true. I have clearly stated that while I think something should ____ that does not mean I support actual legislation when we account for other factors. That by itself invalides your claims. You need to realize the foundation of your argument has just evaporated.\n\n \n I hate to say it...but you said eariler that you would agree to a ban on partial birth abortion if the clause for a womens life was included...Are you changing your stance on this now?...We will just assume you meant something different...thats fine...\n \n But then you go on and say\n \n \nThen why have you attacked Kerry and other democrats for voting aganist abortion bills that did not have such clauses? \n \n Oh yes, I know why, because you're a lying hypocrite.\n\n \n And they actually did have that clause...so therefore he is not a liar nor a hypocrite....Will you concede that you were wrong here and apologize to VOR?", 
   {}, 
   107010, 
   null, 
   1113453600.0
  ], 
  [
   107047, 
   null, 
   "Duo_Maxwell", 
   "So is it now safe to say that your initial claim \"Partial birth abortion should be banned so long as there is a clause protecting the life of the mother\" has now been amended to \"Partial birth abortion should be banned so long as there is a clause protecting the life of the mother and other clauses that take into account other factors?\"\n\n \n In a sense yes. The original question did not include other factors. Also, I wrongfully assumed that people would understand how legislation works and how it affects the rights and lives of the people. I now know not to assume that people will understand the complexities and that I must list how things really work. You have clearly taught me that people are not informed, do not understand how legislation works, clearly are ignorant of consequences and that it is wrong for me to assume the audience is educated. \n \n Steeeeve: cone, this is exactly what I am talking about. I cannot assume that the audinece is educated or informed, as Steeeeve here shows. Kerry has voted aganist other abortion bills for the same reason in his history. Vor has attacked his for those as well. While I realize you clearly do not know this, even after I provided the link to his history, you cannot assume there is only one bill. \n \n Under such, Vor is still very much a lying hypocrite.", 
   {}, 
   107018, 
   null, 
   1113458820.0
  ], 
  [
   107053, 
   null, 
   "Steeeeve", 
   "other abortion bans huh....we are talking about partial birth abortion ban...thats all...now I take it you won't apologize to VOR eventhough you were in fact wrong.", 
   {}, 
   107047, 
   null, 
   1113459840.0
  ], 
  [
   107054, 
   null, 
   "Cone", 
   "In a sense yes. The original question did not include other factors. Also, I wrongfully assumed that people would understand how legislation works and how it affects the rights and lives of the people. I now know not to assume that people will understand the complexities and that I must list how things really work. You have clearly taught me that people are not informed, do not understand how legislation works, clearly are ignorant of consequences and that it is wrong for me to assume the audience is educated. \n\n Not informed? How so? Don't understand how legislation works? How so? Ignorant of consequences? How so? You are drawing outright faulty conclusions. The real case is that you were just confusing. The other stuff you assert is based out of the confusion you caused with your original statement. Why?\n \n You did not state your position on this issue. You misled readers of this topic by making the following claim: \"Partial birth abortion should be banned so long as there is a clause protecting the life of the mother\" when you really meant \"Partial birth abortion should be banned so long as there is a clause protecting the life of the mother and a clause about other factors as well\"\n \n As such, I think we have cleared the whole matter up by your admittance that your first statement did not represent your position. I just have a problem when people make a statement that would lead us to believe one thing (in this case that you support banning partial birth abortion so long as one thing is included) when the reality is another (that you support banning partial birth abortion so long as more than one thing is included).", 
   {}, 
   107047, 
   null, 
   1113460140.0
  ], 
  [
   107057, 
   null, 
   "Duo_Maxwell", 
   "Not informed? How so? Don't understand how legislation works? How so? Ignorant of consequences? How so? You are drawing outright faulty conclusions. The real case is that you were just confusing. The other stuff you assert is based out of the confusion you caused with your original statement. Why?\n\n \n The evidence is right here. The fact that we are discussing it.  \n The other stuff is because I wrongfully assumed you people would understand something other then the obvious. \n \n \n\n You did not state your position on this issue.\n\n \n So how can I be a hypocrite? emoticon_rolleyes In all seriousness, the mere fact we are still talking about it is a sign that I assumed too much. \n \n \n\n As such, I think we have cleared the whole matter up by your admittance that your first statement did not represent your position.\n\n \n represent my whole position? no. Part of it, yes. However, in dealing with such a simple, complexity avoiding question, I answered in a simple, complexity avoiding answer. The answer fit the question. \n \n \nI just have a problem when people make a statement that would lead us to believe one thing (in this case that you support banning partial birth abortion so long as one thing is included) when the reality is another (that you support banning partial birth abortion so long as more than one thing is included).\n\n \n I can live with that. I now know I cannot assume anything more then the basic knowledge of the audience.", 
   {}, 
   107054, 
   null, 
   1113460920.0
  ], 
  [
   107058, 
   null, 
   "Duo_Maxwell", 
   "other abortion bans huh....we are talking about partial birth abortion ban...thats all...now I take it you won't apologize to VOR eventhough you were in fact wrong.\n\n \n You could learn alot from Cone's style. \n \n I am not wrong. Vor clearly states that: \n \n \nthink it goes without saying that any time the mother's life is endangered then and abortion can take place.\n\n \n Yet Vor has in the past attacked Kerry for voting aganist all abortion bills. Yet he clearly states he supports abortion for the reasons Kerry has voted aganist the bills for. He is by all means a lying hypocrite. Merely because you are too lazy to read his history does not make your asserations correct.", 
   {}, 
   107053, 
   null, 
   1113461100.0
  ], 
  [
   107061, 
   null, 
   "Steeeeve", 
   "You could learn alot from Cone's style. \n \n I am not wrong. Vor clearly states that: \n \n \n \n Yet Vor has in the past attacked Kerry for voting aganist all abortion bills. Yet he clearly states he supports abortion for the reasons Kerry has voted aganist the bills for. He is by all means a lying hypocrite. Merely because you are too lazy to read his history does not make your asserations correct.\n\n \n I am not even gonna say how you could learn a few things.... emoticon_rolleyes \n However, cone maybe good at styling his posts and what not...however, I have facts just like he does..it doesn't matter how bad I suck at typing them down, they still remain correct. Unlike some, I only post on the forums I know about...it took me some 3-4 years to learn about abortion and actually make a stand on it. I only talk something if I know what I am talking about :) (oddly enough I took a personality test for a job and that was said on there)\n \n As for VOR....who cares? We are talking about what you said.", 
   {}, 
   107058, 
   null, 
   1113461520.0
  ], 
  [
   107068, 
   null, 
   "Cone", 
   "The other stuff is because I wrongfully assumed you people would understand something other then the obvious.\n\n As far as I'm concerned, this should be the last thing I post about this, but I want it to remain clear that the reason the whole discussion came up is because it wasn't obvious what your position was. Now that it is, we can move on.\n \n also,\n \n \nYou could learn alot from Cone's style.\n \n I hope that's a complement to my style. If it is, Thanks :)", 
   {}, 
   107057, 
   null, 
   1113461940.0
  ], 
  [
   107084, 
   null, 
   "Duo_Maxwell", 
   "As far as I'm concerned, this should be the last thing I post about this, but I want it to remain clear that the reason the whole discussion came up is because it wasn't obvious what your position was. Now that it is, we can move on.\n\n \n I can live with that.\n \n \nI hope that's a complement to my style. If it is, Thanks :)\n\n \n It is. You have a much more refined style as well as few internal problems. Also, you don't ignore alot of stuff when it suits you. Not to mention you don't come blaring out like other people. It's very good, very nice use of tact.\n \n Steeeeve: I care. I cannot tolerate his lies, fabrications, and other dishonest behavior. As I have done before, you are more then free to look up his background at www.whistlestopper.com", 
   {}, 
   107068, 
   null, 
   1113463740.0
  ], 
  [
   107085, 
   null, 
   "Steeeeve", 
   "Steeeeve: I care. I cannot tolerate his lies, fabrications, and other dishonest behavior. As I have done before, you are more then free to look up his background at www.whistlestopper.com\n \n\n \n Ugh, I really don't care what you think about him though...Not to be mean...It just doesn't really matter much.", 
   {}, 
   107084, 
   null, 
   1113464040.0
  ], 
  [
   107088, 
   null, 
   "Duo_Maxwell", 
   "Ugh, I really don't care what you think about him though...Not to be mean...It just doesn't really matter much.\n\n \n Then why are you commenting?", 
   {}, 
   107085, 
   null, 
   1113464220.0
  ], 
  [
   107089, 
   null, 
   "Steeeeve", 
   "I wanted you to know I care enough to read your posts :)", 
   {}, 
   107088, 
   null, 
   1113464280.0
  ], 
  [
   116606, 
   null, 
   "FISHX", 
   "a lot of folks have said that partial birth abortion should be banned. My question is why should it be banned?\n\n \n \n It could be the fact that it is the most barbaric inhumane procedure that an obs/gyno could preform or maybe the fact that the baby/fetus is delivered alive and then killed whilst struggling and kicking outside the mothers womb.", 
   {}, 
   106608, 
   null, 
   1115228700.0
  ], 
  [
   116638, 
   null, 
   "Voice Of Reason", 
   "It could be the fact that it is the most barbaric inhumane procedure that an obs/gyno could preform or maybe the fact that the baby/fetus is delivered alive and then killed whilst struggling and kicking outside the mothers womb.\n\n \n Actually its even worse then that.......The baby's head is crushed to remove it from the womb...........\n \n It sounds like something the Nazis would do against the Jews in WW2.....How Liberals can condone this procedure is beyond me..........", 
   {}, 
   116606, 
   null, 
   1115229960.0
  ], 
  [
   116649, 
   null, 
   "FISHX", 
   "Do you know once the baby/fetus has been delivered to the head theyinsert scissors into the back of the skull to kill the baby/fetus?", 
   {}, 
   116638, 
   null, 
   1115230440.0
  ], 
  [
   117730, 
   null, 
   "tomharrybill", 
   "Imagine, for a moment this scenario, you are a baby, nice and warm in the womb. There is nowhere else you would rather be, you are asleep, it could be described as paradise, and all of a sudden you feel some forceps grip your leg, your leg is still forming it is soft. These forceps feel like a vice, crushing your leg. Image the horror, shock and pain you must feel, what is happening? No doctor has given you an insight or explanation of what is happening, this really happens to some babies. Then you feel yourself being dragged down, you are being born prematurely and unnaturally, eventually, all but your head is left within the mother, leaving the rest of your body exposed. You are cold and you've been taken from the warm place that was so comfortable. The next thing you feel is a pair of scissors enter the back of your head; this is used to open and forces a hole. After removing the scissors, a suction catheter is inserted into your skull and this removes your brain; the collapsed head is then removed from the uterus. This method is used primarily to prevent the woman from suffering additional pain so that the babies head passes out of her with ease, how thoughtful, and it is happening to millions of babies, by those sworn to protect them. I really could have exaggerated this, but I have put it mildly, this particular procedure is known as the partial birth abortion. \n \n Who can claim that this is right, and that abortion opens up opportunity? Can you honestly say: \"Yes, abortion is right\", no rational person can, it is horrendous, abortion is wrong, and it must be stopped.\n \n For more of this talk, goto the forum at: XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX/", 
   {
    "post_info": {
     "post_title": "Here's your answer!"
    }
   }, 
   106680, 
   null, 
   1115378760.0
  ], 
  [
   117813, 
   null, 
   "sinjin", 
   "Imagine, for a moment this scenario, you are a baby, nice and warm in the womb. There is nowhere else you would rather be, you are asleep, it could be described as paradise, and all of a sudden you feel some forceps grip your leg, your leg is still forming it is soft. These forceps feel like a vice, crushing your leg. Image the horror, shock and pain you must feel, what is happening? No doctor has given you an insight or explanation of what is happening, this really happens to some babies. Then you feel yourself being dragged down, you are being born prematurely and unnaturally, eventually, all but your head is left within the mother, leaving the rest of your body exposed. You are cold and you've been taken from the warm place that was so comfortable. The next thing you feel is a pair of scissors enter the back of your head; this is used to open and forces a hole. After removing the scissors, a suction catheter is inserted into your skull and this removes your brain; the collapsed head is then removed from the uterus. This method is used primarily to prevent the woman from suffering additional pain so that the babies head passes out of her with ease, how thoughtful, and it is happening to millions of babies, by those sworn to protect them. I really could have exaggerated this, but I have put it mildly, this particular procedure is known as the partial birth abortion. \n \n Who can claim that this is right, and that abortion opens up opportunity? Can you honestly say: \"Yes, abortion is right\", no rational person can, it is horrendous, abortion is wrong, and it must be stopped.\n \n For more of this talk, goto the forum at: XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX/\n\n \n \n Please support your claim that \"millions\" of \"partial birth\" abortions are happening.", 
   {}, 
   117730, 
   null, 
   1115397480.0
  ], 
  [
   118234, 
   null, 
   "FISHX", 
   "Sorry but A that was not a partial birth abortion that was a suction method and your link should really have a graphic image warning on it.\n \n I know that these pictures need to be shown but it is only fair to warn people who do not wish to see it that it contains graphic images.", 
   {}, 
   117813, 
   null, 
   1115475240.0
  ], 
  [
   122852, 
   null, 
   "Wez", 
   "I have talked to many women who had abortions in their past; all of them were ashamed of what they did. For them, their guilt was almost too great to bear.\n\n I have talked to many women who had abortions in their past; all of them were proud of what they did. For them, their joy of living their lives unhindered was almost too great to bear.\n \n -Wez", 
   {}, 
   106604, 
   null, 
   1116118020.0
  ], 
  [
   122914, 
   null, 
   "Sigma", 
   "I have been a part of discussions with women who have abortions in their past. Some were upset, some were very upset, and some were not very upset (the ones who were unaffected generally were not a part of the discussion and I've read the majority are relieved afterward). However, very few regretted it unless they felt coerced into the decision.", 
   {}, 
   122852, 
   null, 
   1116135300.0
  ], 
  [
   122921, 
   null, 
   "Hunter", 
   "Actually its even worse then that.......The baby's head is crushed to remove it from the womb...........\n \n It sounds like something the Nazis would do against the Jews in WW2.....How Liberals can condone this procedure is beyond me..........\n\n \n Here is your answer: Liberals embrace that procedure because liberalism is a form of mental illness. Liberals walk in complete darkness and are forbidden to see or embrace the truth. Liberalism is a cancer on the very soul of America.\n \n One liberal--one :xcensored", 
   {}, 
   116638, 
   null, 
   1116135900.0
  ], 
  [
   122925, 
   null, 
   "Sigma", 
   "Here is your answer: Liberals embrace that procedure because liberalism is a form of mental illness. Liberals walk in complete darkness and are forbidden to see or embrace the truth. Liberalism is a cancer on the very soul of America.\n \n One liberal--one :xcensored\n\n \n No, no, you have it all wrong! Liberals eat the brains of puppies and have sex with Satan in the hopes of producing the anti-christ. Jeez, you fundies can't get anything right.", 
   {}, 
   122921, 
   null, 
   1116136200.0
  ], 
  [
   122928, 
   null, 
   "Hunter", 
   "No, no, you have it all wrong! Liberals eat the brains of puppies and have sex with Satan in the hopes of producting the anti-christ. Jeez, you fundies can't get anything right.\n\n Your response to my post is inflammatory. I am going to have another Bloody Mary and take my dog for a walk. :)", 
   {}, 
   122925, 
   null, 
   1116136560.0
  ], 
  [
   122929, 
   null, 
   "Sigma", 
   "Your response to my post is inflammatory. I am going to have another Bloody Mary and take my dog for a walk. :)\n\n \n haha :p \n \n That is one of the funniest things you've said!", 
   {}, 
   122928, 
   null, 
   1116136560.0
  ], 
  [
   122939, 
   null, 
   "Hunter", 
   "haha :p \n \n That is one of the funniest things you've said!\n\n \n Thanks. I meant it to be funny. I love humour. Wishing you.........pause for one more drink, ahhhhhh, thats better........well. emoticon_cool", 
   {}, 
   122929, 
   null, 
   1116137280.0
  ], 
  [
   122994, 
   null, 
   "Redratio1", 
   "PBA is an abomination, and is nothing short of infanicide.\n Someone please tell me in what situation PBA is truely necessary?", 
   {}, 
   122939, 
   null, 
   1116145020.0
  ], 
  [
   123071, 
   null, 
   "Sigma", 
   "\n Someone please tell me in what situation PBA is truely necessary?\n\n \n I don't know... can you find a medical site that can say what situations \"partial birth abortion\" is used in? What trimesters is it recommended for?", 
   {}, 
   122994, 
   null, 
   1116174420.0
  ], 
  [
   123137, 
   null, 
   "Voice Of Reason", 
   "So I would like to ask the question: Do my friends Wez and Sigma favor PBA?", 
   {}, 
   123071, 
   null, 
   1116182880.0
  ], 
  [
   123139, 
   null, 
   "Sigma", 
   "So I would like to ask the question: Do my friends Wez and Sigma favor PBA?\n\n \n I'm afraid there is no medical procedure called \"partial birth abortion\". If you were to ask me about an actual procedure I could answer you.", 
   {}, 
   123137, 
   null, 
   1116182940.0
  ], 
  [
   123147, 
   null, 
   "Voice Of Reason", 
   "I'm afraid there is no medical procedure called \"partial birth abortion\". If you were to ask me about an actual procedure I could answer you.\n\n \n Well that is what the Congress called it when they passed the bill to ban it.......\n \n I guess i could not expect anymore then a cop out form you on the question though...........What else is new? emoticon_rolleyes", 
   {}, 
   123139, 
   null, 
   1116183780.0
  ], 
  [
   123148, 
   null, 
   "FISHX", 
   "I'm afraid there is no medical procedure called \"partial birth abortion\". If you were to ask me about an actual procedure I could answer you.\n\n \n \n Do you suport the use of the d&x procedure?", 
   {}, 
   123139, 
   null, 
   1116183780.0
  ], 
  [
   123150, 
   null, 
   "FISHX", 
   "I don't know... can you find a medical site that can say what situations \"partial birth abortion\" is used in? What trimesters is it recommended for?\n\n \n The pba(d&x) is used primarly in the third trimester and usualy as a way to save the mothers life.\n What i can't understand is why not a c-section if the procedure is only done to save the mothers life?\n That way both mother and baby/fetus have a chance of life.", 
   {}, 
   123071, 
   null, 
   1116183960.0
  ], 
  [
   123157, 
   null, 
   "Sigma", 
   "The pba(d&x)\n\n \n \"partial birth abortion\" is not a D&X.\n \n \n\n is used primarly in the third trimester and usualy as a way to save the mothers life.\n\n \n Agreed. To answer your previous question, yes I do support the use of D&X.\n \n \n\n What i can't understand is why not a c-section if the procedure is only done to save the mothers life?\n That way both mother and baby/fetus have a chance of life.\n\n \n C-sections are dangerous to the woman, and there are some conditions of the fetus that prohibit the use of a c-section.", 
   {}, 
   123150, 
   null, 
   1116184680.0
  ], 
  [
   123158, 
   null, 
   "Sigma", 
   "Well that is what the Congress called it when they passed the bill to ban it.......\n\n \n Yes, they did :) Your point? There is no medical procedure called that, it was a political bill.\n \n \n\n I guess i could not expect anymore then a cop out form you on the question though...........What else is new? emoticon_rolleyes\n\n \n A cop out? I asked you to name an actual medical procedure if you wished to question me on abortion procedures. That is not a cop out.", 
   {}, 
   123147, 
   null, 
   1116184740.0
  ], 
  [
   123160, 
   null, 
   "FISHX", 
   "\"partial birth abortion\" is not a D&X.\n \n \n \n Agreed. To answer your previous question, yes I do support the use of D&X.\n \n \n \n C-sections are dangerous to the woman, and there are some conditions of the fetus that prohibit the use of a c-section.\n\n \n \n Actualy a pba and a d&x are one in the same.\n Do you have a source or anything that states that there are circumstances/conditions of the baby/fetus that would prohibit a c-section?\n \n I have truly never heard of any condition that would prohibit a c-section even after having three not trying to be a bitch but i honestly haven't.", 
   {}, 
   123157, 
   null, 
   1116185220.0
  ], 
  [
   123203, 
   null, 
   "Sigma", 
   "Actualy a pba and a d&x are one in the same.\n\n \n If this were true, the ban would only affect D&X. This is not the case. Since the ban does not mention any specific procedure, the language can be used to prosecute doctors who use other types of abortion.\n \n \n\n Do you have a source or anything that states that there are circumstances/conditions of the baby/fetus that would prohibit a c-section?\n\n \n I misspoke. The risk of complications is much higher to both the mother and the fetus during a c-section. The danger to the mother is most likely the reason c-sections are not done instead.\n \n \n\n I have truly never heard of any condition that would prohibit a c-section even after having three not trying to be a bitch but i honestly haven't.\n\n \n I spaced out and was thinking of the dangers of vaginal delivery.", 
   {}, 
   123160, 
   null, 
   1116191820.0
  ], 
  [
   123209, 
   null, 
   "FISHX", 
   "Seriously pba and d&x are one and the same try the link there are plenty more of them if you want.\n http://womensissues.about.com/od/partialbirthabortion/i/ispartialbirth.htm", 
   {}, 
   123203, 
   null, 
   1116192780.0
  ], 
  [
   123219, 
   null, 
   "Cone", 
   "If this were true, the ban would only affect D&X. This is not the case. Since the ban does not mention any specific procedure, the language can be used to prosecute doctors who use other types of abortion.\n\n \n \n`(1) the term `partial -birth abortion' means an abortion in which the person performing the abortion --\n \n `(A) deliberately and intentionally vaginally delivers a living fetus until, in the case of a head-first presentation, the entire fetal head is outside the body of the mother, or, in the case of breech presentation, any part of the fetal trunk past the navel is outside the body of the mother, for the purpose of performing an overt act that the person knows will kill the partially delivered living fetus; and\n \n `(B) performs the overt act, other than completion of delivery, that kills the partially delivered living fetus...\n\n Sigma, how many other procedures induce labor, and then wait until the entire fetal head is outside of the mothers body (or in the case of breech presentation, any part of the fetal trunk past the navel is outside the body of the mother), before performing the action necessary to terminate the life of the fetus? The words of this bill cannot be construed any differently than to the exact procedure described in the bill. What makes you think it can?", 
   {}, 
   123203, 
   null, 
   1116193860.0
  ], 
  [
   123230, 
   null, 
   "Sigma", 
   "Seriously pba and d&x are one and the same try the link there are plenty more of them if you want.\n http://womensissues.about.com/od/partialbirthabortion/i/ispartialbirth.htm\n\n \n The media and laymen associate them because of pro-life propaganda, but \"partial birth abortion\" is not a medical procedure, let alone the same as a D&X. If you get a procedure called \"partial birth abortion\" from a medical site, then I may believe you.\n \n Found here \n \n[...]United States District Court Judge Gerald Rosen concluded, based on the testimonies of physician witnesses for the plaintiffs and for the defendants, that what the law aims to prohibit is unclear. \"All of the witnesses agreed, the term 'partial-birth' abortion is not one found in the medical literature,\" Rosen noted in his opinion. \"Nor is it defined in the statute in medical terms. And, the 'plain language' of the statute clearly left the physicians who testified confused as to its meaning and application.\"\n\n \n Even Sandra Day O'Connor wrote in the Carhart case: \"a ban on partial- birth abortion that only proscribed the D&X method of abortion and that included an exception to preserve the life and health of the mother would be constitutional in my view.\" A ban on D&X has been proposed by Democrats but has been voted down by Republicans. A \"partial birth abortion\" ban serves their political purposes better.", 
   {
    "unicode_changes_made": true
   }, 
   123209, 
   null, 
   1116198000.0
  ], 
  [
   123239, 
   null, 
   "Sigma", 
   "Sigma, how many other procedures induce labor, and then wait until the entire fetal head is outside of the mothers body (or in the case of breech presentation, any part of the fetal trunk past the navel is outside the body of the mother), before performing the action necessary to terminate the life of the fetus? The words of this bill cannot be construed any differently than to the exact procedure described in the bill. What makes you think it can?\n\n \n From what I understand, the objection (one of the many objections) is in the fact that many abortion procedures \"deliver\" the fetus vaginally and there is no gestational age specified in the ban. I unfortunately am not intimately familiar with all abortion procedures nor am I an expert in the application of law. Many judges have stated that the language is too broad.", 
   {}, 
   123219, 
   null, 
   1116200220.0
  ], 
  [
   123326, 
   null, 
   "Cone", 
   "From what I understand, the objection (one of the many objections) is in the fact that many abortion procedures \"deliver\" the fetus vaginally and there is no gestational age specified in the ban. I unfortunately am not intimately familiar with all abortion procedures nor am I an expert in the application of law. Many judges have stated that the language is too broad.\n\n Yes, but do these procedures deliver a live fetus to the points described in that ban before terminating its life? I don't think so.\n \n Too broad? The only way that the Partial Birth Abortion Ban Act of 2003 can be construed to ban any procedure other than the exact procedure described in the ban is if a judge decides that evolving standards of society actually change the meaning of the ban, i.e. \"the PBABA of 2003 formally banned this one procedure, but now it bans this other one as well.\"\n \n This whole fiasco would be avoided if judges adopted the correct judicial philosophy of interpreting laws in their original form and intent. It would then be the case that the law's meaning doesn't change because some judge decides that society wants it to change. The law doesn't even change because the judge himself has a personal view that it should change. If the correct judicial philosophy is adopted, it would never be the case that the PBABA of 2003 would ban more than the one procedure defined in the bill.", 
   {}, 
   123239, 
   null, 
   1116218880.0
  ], 
  [
   123350, 
   null, 
   "Sigma", 
   " If the correct judicial philosophy is adopted, it would never be the case that the PBABA of 2003 would ban more than the one procedure defined in the bill.\n\n \n It wouldn't be the judges, it would be prosecutors who would do this to get a buck.\n \n Unless the ban is clear exactly what procedure it bans, it lends itself to this. Don't be disengenious, the creators of the ban intended for it to be interpreted for as many abortion procedures as it could. That was why they named it for a non-existant procedure. It was a political move.", 
   {}, 
   123326, 
   null, 
   1116220620.0
  ], 
  [
   123375, 
   null, 
   "Cone", 
   "It wouldn't be the judges, it would be prosecutors who would do this to get a buck.\n \n Unless the ban is clear exactly what procedure it bans, it lends itself to this. \n\n First, the ban is blatantly clear as to what it bans.\n \n Secondly, any prosecutor looking to make a buck could do this with any law. This is why we have oversight by judges who have the final say. Prosecutors might try to contruct charges based on their own personal opinion of a given law, yet a judge ultimately has the authority to throw the charges out. If a prosecutor approached a judge wanting to charge someone for murder, when in reality that person only jaywalked, that judge would throw the murder charges out. If a prosecutor approached a judge (who has adopted the correct judicial philosophy of interpreting laws based on their original intent) wanting to charge someone with violating the PBABA of 2003 when they really hadn't, the judge would throw the charges out.\n \n \nDon't be disengenious, the creators of the ban intended this.\n \n What exactly is it that you are claiming they intended? To make a ban that is purposefully unclear? You are able to read people's intentions like a book?\n \n Besides that, I thought you were in support of vague laws; \n The vague language allows the Courts to apply it in different ways.\n", 
   {}, 
   123350, 
   null, 
   1116222000.0
  ], 
  [
   123388, 
   null, 
   "Sigma", 
   "First, the ban is blatantly clear as to what it bans.\n\n \n Really? Can you post where in the bill it names the procedure it bans? Even doctors can be confused as to what it applies to since the bill does not use medical terms.\n \n \n\n Secondly, any prosecutor looking to make a buck could do this with any law. This is why we have oversight by judges who have the final say.\n\n \n Agreed, but to even have a case the law must be vague enough to allow for what they are prosecuting for to apply. If the law is not clear as to what it bans, you can always find judges who will interpret it one way or the other. This is simply a fact.\n \n \n\n Prosecutors might try to contruct charges based on their own personal opinion of a given law, yet a judge ultimately has the authority to throw the charges out. If a prosecutor approached a judge wanting to charge someone for murder, when in reality that person only jaywalked, that judge would throw the murder charges out.\n\n \n However, if the jaywalking law was vague enough and mentions killing another person, the prosecutor could find a judge willing to at least hear it.\n \n \n\n If a prosecutor approached a judge (who has adopted the correct judicial philosophy of interpreting laws based on their original intent) wanting to charge someone with violating the PBABA of 2003 when they really hadn't, the judge would throw the charges out.\n\n \n However, since the ban does not mention any specific procedure, the judge would have no criteria except colorful descriptions to go by.\n \n \n\n What exactly is it that you are claiming they intended? To make a ban that is purposefully unclear? You are able to read people's intentions like a book?\n\n \n I can read pro-lifers intentions like a book :)\n \n Actually, a politicians agenda are always constant. Get re-elected, refocus people the way you want, push hot-buttons, etc etc. That's what this ban is for. It refocuses the public from early abortions to late abortions because most of the nation do not favor late-term abortions but most of the nation does favor legal early abortions. There were other bills that would directly ban D&X procedures that were voted against in favor of this. It's a political move, designed to push the hot buttons of the public. It's designed to be controversial.\n \n \n\n Besides that, I thought you were in support of vague laws;\n\n \n The vague language allows the Courts to apply it in different ways is a statement of fact, not an endorsment or a condemnation. Whether I agree or disagree with any certain law is a matter of opinion. I happen to think the Constitution was designed with vague terms on purpose as well, in order for it to evolve. You, however, don't even admit this law is using vague terms, so you can hardly attack me on this point.", 
   {}, 
   123375, 
   null, 
   1116223260.0
  ], 
  [
   123403, 
   null, 
   "Cone", 
   "Really? Can you post where in the bill it names the procedure it bans? Even doctors can be confused as to what it applies to since the bill does not use medical terms.\n\n \n \n`(1) the term `partial -birth abortion' means an abortion in which the person performing the abortion --\n \n `(A) deliberately and intentionally vaginally delivers a living fetus until, in the case of a head-first presentation, the entire fetal head is outside the body of the mother, or, in the case of breech presentation, any part of the fetal trunk past the navel is outside the body of the mother, for the purpose of performing an overt act that the person knows will kill the partially delivered living fetus; and\n \n `(B) performs the overt act, other than completion of delivery, that kills the partially delivered living fetus...\n\n If you perform the above action, you have broken the law. If you induce labor, wait until the fetus' head is outside of the mother's body, or, in the case of breech presentation, any part of the fetal trunk past the naval is outside the body of the mother, and you perform an act that kills the partially delivered living fetus, you have broken the law. If doctors do not understand what this bill bans, they are hardly competent enough to be called doctors.\n \n Any abortion performed that does not terminate the fetus' life before the points defined in the bill are not banned by this bill.\n \n \nAgreed, but to even have a case the law must be vague enough to allow for what they are prosecuting for to apply.\n\n Not sure what you mean here.\n \n \n If the law is not clear as to what it bans, you can always find judges who will interpret it one way or the other. This is simply a fact.\n\n If the law is clear as to what it bans and you have a judge who refuses to let his personal opinions change what the law says, then the law will be applied as it was intended to be applied.\n \n \nHowever, if the jaywalking law was vague enough and mentions killing another person, the prosecutor could find a judge willing to at least hear it.\n\n What? If you were jaywalking, you could hardly be charged for murder. The definition of jaywalking, like the definition of Partial Birth Abortion, is not vague; it is quite specific.\n \n \nHowever, since the ban does not mention any specific procedure, the judge would have no criteria except colorful descriptions to go by.\n\n Even if the ban chose to ban D&X abortions, they would still define D&X abortions the exact same way they defined partial birth abortions. This goes to show that the importance in a law is not it's terminolgy per se, but the definitions it applies to its terminology. The law banned a specific action. If you perform the action it banned, you broke the law...is that so difficult?\n \n \nI can read pro-lifers intentions like a book :)\n\n This ban was supported by more than the pro-life side.\n \n \nIt refocuses the public from early abortions to late abortions because most of the nation do not favor late-term abortions but most of the nation does favor legal early abortions.\n\n Under certain circumstances, which is a far cry from saying they support universal early abortion rights.\n \n \nThere were other bills that would directly ban D&X procedures that were voted against in favor of this.\n\n Could you provide evidence of this? Maybe some of the other bills? I'm actually quite interested to look into this some more.\n \n \nThe vague language allows the Courts to apply it in different ways is a statement of fact, not an endorsment or a condemnation. Whether I agree or disagree with any certain law is a matter of opinion. I happen to think the Constitution was designed with vague terms on purpose as well, in order for it to evolve.\n\n If by evolve you mean via Constitutional Amendments, then you are correct to say that the founders designed a changeable document. However, if by evolve you mean that judges can change the meaning of laws based on their personal opinion, then you would be wrong to say the founders designed the constitution to evolve.\n \n \nYou, however, don't even admit this law is using vague terms, so you can hardly attack me on this point.\n\n So I have to agree with you in order to disagree with you?\n \n Hey, have you noticed that our posts are getting ever so longer?", 
   {}, 
   123388, 
   null, 
   1116225780.0
  ], 
  [
   123449, 
   null, 
   "Sigma", 
   "If you perform the above action, you have broken the law.\n\n \n The question was where in the bill a procedure was named. I have read the bill, but thank you :)\n \n I notice you did not say \"If you perform a D&X abortion\".\n \n \n\n If you induce labor\n\n \n Huh? Where does it say that?\n \n \n\n wait until the fetus' head is outside of the mother's body, or, in the case of breech presentation, any part of the fetal trunk past the naval is outside the body of the mother, and you perform an act that kills the partially delivered living fetus, you have broken the law. If doctors do not understand what this bill bans, they are hardly competent enough to be called doctors.\n\n \n What they don't understand is what procedures this bill applies to. Are pre-viability abortions ok to perform?\n \n \n\n Any abortion performed that does not terminate the fetus' life before the points defined in the bill are not banned by this bill.\n\n \n So a D&X that kills the fetus before it comes out of the uterus is fine? What is the purpose of the ban then, if not to ban D&X procedures?\n \n \n\n Not sure what you mean here.\n\n \n Probably not important.\n \n \n\n If the law is clear as to what it bans\n\n \n That's the point, it's not.\n \n \n\n and you have a judge who refuses to let his personal opinions change what the law says, then the law will be applied as it was intended to be applied.\n\n \n Personal opinions aren't the issue. Clear laws that don't require judgement calls are.\n \n \n\n What? If you were jaywalking, you could hardly be charged for murder.\n\n \n If the laws against jaywalking mentioned killing someone, you perhaps could. You are talking apples and oranges here, this example hardly applies to what we are talking about.\n \n \n\n The definition of jaywalking, like the definition of Partial Birth Abortion, is not vague; it is quite specific.\n\n \n Obviously I disagree.\n \n \n\n Even if the ban chose to ban D&X abortions, they would still define D&X abortions the exact same way they defined partial birth abortions.\n\n \n Except it would be a \"D&X abortion ban\" and everyone would know exactly what procedure they could not legally perform. And there would be no confusion.\n \n \n\n This goes to show that the importance in a law is not it's terminolgy per se, but the definitions it applies to its terminology. The law banned a specific action. If you perform the action it banned, you broke the law...is that so difficult?\n\n \n \"It is against the law to do this\" \"Do what?\" \"This!\" \"What is this?\" \"It doesn't matter, just don't do it! Is that so hard?\"\n \n \n\n This ban was supported by more than the pro-life side.\n\n \n It is also supported by those who don't know much about it.\n \n \n\n Under certain circumstances, which is a far cry from saying they support universal early abortion rights.\n\n \n The majority of the nation supports the Roe v. Wade decision, which allowed unrestricted 1st trimester abortions. In every poll I've seen, the vast majority of the nation supports early abortion with little to no restriction.\n \n \n\n Could you provide evidence of this? Maybe some of the other bills? I'm actually quite interested to look into this some more.\n\n \n Here are a couple opinions on the subject.\n \n \nHere's another piece of the puzzle. The Republicans in congress don't want a real ban - but the Democrats do. The Democrats have proposed constitutional bans on late-term D&X abortions again and again, and have been voted down by Republicans every time. It doesn't matter how the health ban is worded - the Republicans even rejected Dick Durbin's bill, which would \"ban all abortions after a fetus is viable unless two physicians certify that the abortion is necessary to protect the life of the pregnant woman or that she was at risk of grievous injury to her physical health.\"\n\n \n \nThe problem is, most pro-lifers have no interest in a narrow, reasonable ban of D&X - such a ban has been proposed by Democrats and voted down by Republicans time and again. Pro-lifers have been well served by \"partial birth\" bans which get struck down (by the courts or by Clinton's veto); keeping the issue alive let them pound Democrats with the issue, and assured their pro-life base that they were fighting the good fight.\n\n \n And here is one of the bills I mentioned, proposed by Democrats.\n \n \nJoined by U.S. Sens. Olympia Snowe (R-ME), Susan Collins (R-ME), Robert Torricelli (D-NJ), Barbara Mikulski (D-MD), Mary Landrieu (D-LA), Bob Graham (D-FL) and Joseph Lieberman (D-CT), Durbin introduced the Late-Term Abortion Limitation Act of 1998. \n ...\n The bill would ban all post-viability abortions except when both the attending physician and an independent physician certify in writing that, in their medical judgment, continuation of the pregnancy would threaten the mother's life or risk grievous injury to her physical health.\n ...\n Unlike the proposal to ban all \"partial birth\" abortions, which Durbin opposes, the new legislation would preserve the option of abortion in cases where a woman faces grievous physical injury if she continues the pregnancy.\n\n \n I'll attempt to find more when I have the time.\n \n \n\n If by evolve you mean via Constitutional Amendments, then you are correct to say that the founders designed a changeable document. However, if by evolve you mean that judges can change the meaning of laws based on their personal opinion, then you would be wrong to say the founders designed the constitution to evolve.\n\n \n That's not quite what I meant, but it's not relevant to our current discussion\n \n \n\n So I have to agree with you in order to disagree with you?\n\n \n You have to accept what I say is true in order to attack me using the same logic. You have to accept the bill uses vague language to say that \"well, you support laws with vague language anyway so you have to support this!\"\n \n \n\n Hey, have you noticed that our posts are getting ever so longer?\n\n \n Apologies, I'll try and limit them.\n \n ETA, interesting side note: According to the Unborn Child Pain Awareness Act of 2005, Jitobear is not a woman. According to the Act, The term `woman' means a female human being who is capable of becoming pregnant, whether or not she has reached the age of majority.\n \n So, while a 13 year old girl is a woman by this definition Jitobear is not since her tubes are tied. It's nice to know that to some conservatives women are only women if they can breed. Our wacky representatives... it's a good thing they don't make medical decisions for us... oh wait...", 
   {
    "unicode_changes_made": true
   }, 
   123403, 
   null, 
   1116236820.0
  ], 
  [
   123917, 
   null, 
   "Cone", 
   "Huh? Where does it say that?\n\n My mistake. While the bill covers deliveries that are induced, it certainly does not limit the ban to only induced deliveries.\n \n \nWhat they don't understand is what procedures this bill applies to. Are pre-viability abortions ok to perform?\n\n If you perform that procedure pre or post viability, you broke the law.\n \n \nExcept it would be a \"D&X abortion ban\" and everyone would know exactly what procedure they could not legally perform. And there would be no confusion.\n\n I think I understand where you are coming from. However, if you believe that the law is vague (which, as you know, I do not), I fail to see how changing the word from 'Partial Birth Abortion' to 'D&X' makes it any more clear. Maybe an example will help explain my point.\n \n Currently, there are two bills before the Senate proposing to ban human cloning, . These bills seem clear, as they ban a very well known scientific practice: human cloning. However, I couldn't help but wonder why there were two bills proposing to ban human cloning; isn't one bill enough?\n \n I looked at the bills and realized why there were two, S.876 and S.658 . They both proposed to ban human cloning, yet they both defined human cloning differently.\n S.658 defines human cloning as \"`(1) HUMAN CLONING- The term `human cloning' means human asexual reproduction, accomplished by introducing nuclear material from one or more human somatic cells into a fertilized or unfertilized oocyte whose nuclear material has been removed or inactivated so as to produce a living organism (at any stage of development) that is genetically virtually identical to an existing or previously existing human organism.\" S.876, on the other hand, defines human cloning as \"`(1) HUMAN CLONING- The term `human cloning' means implanting or attempting to implant the product of nuclear transplantation into a uterus or the functional equivalent of a uterus.\"\n \n This is a case where clear scientific terminolgy is used in a ban, yet the use of this clear and well known scientific term would not help the scientist know what is actually banned. He would have to know how the bill defines human cloning. This is an example of why I think the definitions of various terms are more important than the terms themselves. Does any of that make sense?\n \n \n\"It is against the law to do this\" \"Do what?\" \"This!\" \"What is this?\" \"It doesn't matter, just don't do it! Is that so hard?\"\n\n I think my answer above covers this.\n \n \nI'll attempt to find more when I have the time.\n\n I surely appreciate it emoticon_xgood.\n \n \nETA\n\n What's that mean? I'm sure you've told me before, but I always forget these abbreviations.\n \n \ninteresting side note: According to the Unborn Child Pain Awareness Act of 2005, Jitobear is not a woman. According to the Act, The term `woman' means a female human being who is capable of becoming pregnant, whether or not she has reached the age of majority.\n \n So, while a 13 year old girl is a woman by this definition Jitobear is not since her tubes are tied. It's nice to know that to some conservatives women are only women if they can breed. Our wacky representatives... it's a good thing they don't make medical decisions for us... oh wait...\n\n Sigma, I have to admit that I did not believe this until I looked it up myself. This is indeed interesting, and I plan on contacting the sponsors of the bill in order to get an explanation/raise concern about their definition of the term woman.", 
   {
    "unicode_changes_made": true
   }, 
   123449, 
   null, 
   1116306180.0
  ], 
  [
   124983, 
   null, 
   "Kuato", 
   "To answer the initial question should partial birth abortions be banned, I say\n \n YES.\n \n Arguments that the mother's health is at risk are invalid, she's already given birth but for the last push when this occurs. Arguments that it's her right are invalid (at this point) as she has had nearly 10 months prior to this to \"discover\" she was pregnant and do something about it before her baby was about to be born.\n \n To induce labor so that this \"procedure\" can be performed is heinous.", 
   {
    "post_info": {
     "post_title": "wow, this has wandered."
    }
   }, 
   123917, 
   null, 
   1116519180.0
  ], 
  [
   125025, 
   null, 
   "Voice Of Reason", 
   "To answer the initial question should partial birth abortions be banned, I say\n \n YES.\n \n Arguments that the mother's health is at risk are invalid, she's already given birth but for the last push when this occurs. Arguments that it's her right are invalid (at this point) as she has had nearly 10 months prior to this to \"discover\" she was pregnant and do something about it before her baby was about to be born.\n \n To induce labor so that this \"procedure\" can be performed is heinous.\n\n \n \n Yet sadly it is done all the time..............", 
   {}, 
   124983, 
   null, 
   1116523800.0
  ], 
  [
   125074, 
   null, 
   "FISHX", 
   "To answer the initial question should partial birth abortions be banned, I say\n \n YES.\n \n Arguments that the mother's health is at risk are invalid, she's already given birth but for the last push when this occurs. Arguments that it's her right are invalid (at this point) as she has had nearly 10 months prior to this to \"discover\" she was pregnant and do something about it before her baby was about to be born.\n \n To induce labor so that this \"procedure\" can be performed is heinous.\n\n \n \n Couldn't have said it better myself :)", 
   {}, 
   124983, 
   null, 
   1116528420.0
  ], 
  [
   125195, 
   null, 
   "Sigma", 
   "My mistake. While the bill covers deliveries that are induced, it certainly does not limit the ban to only induced deliveries.\n \n If you perform that procedure pre or post viability, you broke the law.\n \n I think I understand where you are coming from. However, if you believe that the law is vague (which, as you know, I do not), I fail to see how changing the word from 'Partial Birth Abortion' to 'D&X' makes it any more clear. Maybe an example will help explain my point.\n\n \n You see why it is vague. Banning abortions pre-viability violates Roe v Wade. Therefore if this ban can apply pre-viability it can be struck down as unconstitutionally vague. I'm glad you see at least a bit where I am coming from. I am not objecting to the fact that it bans abortions, I am objecting that it is not clear in what it bans. If the bill named \"D&X abortions\" as what it banned, I would be more or less content with it.\n \n \n\n Currently, there are two bills before the Senate proposing to ban human cloning, . These bills seem clear, as they ban a very well known scientific practice: human cloning. However, I couldn't help but wonder why there were two bills proposing to ban human cloning; isn't one bill enough?\n\n \n Lets go further and say that there were some methods of cloning that are allowed, and since they are similar the wording of the bill disallowed both. Wouldn't you want the bill to name the one that it was banning?\n \n \n\n I surely appreciate it emoticon_xgood.\n\n \n Replying to other threads has taken up all of the time I dedicate to these boards ;)\n \n \n\n What's that mean? I'm sure you've told me before, but I always forget these abbreviations.\n\n \n \"Edited to Add\". There have been cases where someone replied to my points as I was editing them, so I try to be clear.\n \n \n\n Sigma, I have to admit that I did not believe this until I looked it up myself. This is indeed interesting, and I plan on contacting the sponsors of the bill in order to get an explanation/raise concern about their definition of the term woman.\n\n \n I'm glad that it concerns you :) I hope it shows that the descriptions in bills are done for political purposes or the purposes of the bill and as such should not be treated as truth.", 
   {}, 
   123917, 
   null, 
   1116539880.0
  ], 
  [
   125198, 
   null, 
   "Sigma", 
   "Arguments that the mother's health is at risk are invalid, she's already given birth but for the last push when this occurs.\n\n \n \"she's already given birth but for the last push when this occurs\"? If you had read the thread, you would see this is not the case. This bill does not just apply to late term abortions, nor is premature birth \"born but for the last push\".\n \n Not only that, but health concerns for the mother are never invalid.\n \n \n\n Arguments that it's her right are invalid (at this point) as she has had nearly 10 months prior to this to \"discover\" she was pregnant and do something about it before her baby was about to be born.\n\n \n Where did you arrive at \"10 months\"? This bill does not specify gestational age or stage of pregnancy.\n \n \n\n To induce labor so that this \"procedure\" can be performed is heinous.\n\n \n Nor is inducing labor part of the bill.\n \n Tell me, would your objections fall away if her life were at risk? There are conditions where the head of the fetus could not pass through the uterus of the woman without severe damage to her.", 
   {}, 
   124983, 
   null, 
   1116540120.0
  ], 
  [
   125387, 
   null, 
   "Kuato", 
   "When I think partial birth abortion, I am thinking of a baby that is viable, or near to it.\n \n \n [QUOTE=Sigma]\"she's already given birth but for the last push when this occurs\"? If you had read the thread, you would see this is not the case. This bill does not just apply to late term abortions, nor is premature birth \"born but for the last push\".\n \n \n The law as quoted states that as long as most of the child is still in the birth canal (I'm paraphrasing) that the p-b abortion can be performed. I have seen a child born, and once the fetus is this far out, it takes only one small push for the birth to be completed.\n \n \n\"\n Not only that, but health concerns for the mother are never invalid.\n\n \n So you're saying it's ok for the woman to carry a baby to term or nearly so, do nothing about it, then at the last minute have a p-b abortion? What I'm saying here is that she has known for quite awhile that she's pregnant. If she never wanted the child she should have done something in the first trimester. If she DID want the child and is near-term, then a c-section is warranted.\n \n \n\"\n Where did you arrive at \"10 months\"? This bill does not specify gestational age or stage of pregnancy.\n\n \n It's about 10 months from conception until birth. Used for illustration.\n \n \n \n\"\n Tell me, would your objections fall away if her life were at risk? There are conditions where the head of the fetus could not pass through the uterus of the woman without severe damage to her.\n\n \n Of course there are conditions such as that. In that case, see my previous response suggesting a c-section.", 
   {}, 
   125198, 
   null, 
   1116558720.0
  ], 
  [
   125408, 
   null, 
   "Voice Of Reason", 
   "Many babies have been born in the 7th, 8th, and 9th month and lived.........They are viable outside the womb and I don't have to explain again the barbaric way that is used to kill them........", 
   {}, 
   125387, 
   null, 
   1116561900.0
  ], 
  [
   125450, 
   null, 
   "Sigma", 
   "When I think partial birth abortion, I am thinking of a baby that is viable, or near to it.\n\n \n That's great for you, but we're talking about the bill. It does not specify viable or not, nor is there any procedure called \"partial birth abortion\".\n \n \n\n The law as quoted states that as long as most of the child is still in the birth canal (I'm paraphrasing) that the p-b abortion can be performed. I have seen a child born, and once the fetus is this far out, it takes only one small push for the birth to be completed.\n\n \n A pre-viable fetus isn't \"almost born\". It's a miscarriage. You're objection is with late term abortions, not \"partial birth abortions\" because the bill can apply pre-viability.\n \n \n\n So you're saying it's ok for the woman to carry a baby to term or nearly so, do nothing about it, then at the last minute have a p-b abortion? What I'm saying here is that she has known for quite awhile that she's pregnant. If she never wanted the child she should have done something in the first trimester. If she DID want the child and is near-term, then a c-section is warranted.\n\n \n Do you actually think a woman would go through the pregnancy and wait until late term to have an abortion unless her situation was pretty bad? I assure you, late-term abortions are not lightly done, by either women or doctors.\n \n C-sections are fine... for women who want to go through them. Not every woman does.\n \n \n\n It's about 10 months from conception until birth. Used for illustration.\n\n \n When 95-98% of abortions happen in the first two trimesters, late term abortions happen in more extreme situations. No woman would wait this long casually. ETA, Though I must say, if pro-life people have their way, early abortions will be harder to acquire (parent notification, moral objection by the doctor, banning it in particular states, etc) so many more abortions will be performed late-term.\n \n \n\n Of course there are conditions such as that. In that case, see my previous response suggesting a c-section.\n\n \n C-sections are fine for women who want to go through them. Not every woman does.", 
   {}, 
   125387, 
   null, 
   1116570540.0
  ], 
  [
   125532, 
   null, 
   "Kuato", 
   "That's great for you, but we're talking about the bill. It does not specify viable or not, nor is there any procedure called \"partial birth abortion\".\n\n \n It does, so please redress your position(my emphasis):\n \n One Hundred Eighth Congress\n \n of the United States of America\n \n AT THE FIRST SESSION\n \n Begun and held at the City of Washington on Tuesday,\n \n the seventh day of January, two thousand and three\n \n An Act\n \n \n To prohibit the procedure commonly known as partial-birth abortion.\n \n Be it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, \n \n SECTION 1. SHORT TITLE.\n \n This Act may be cited as the `Partial-Birth Abortion Ban Act of 2003'. \n \n SEC. 2. FINDINGS.\n \n The Congress finds and declares the following: \n \n (1) A moral, medical, and ethical consensus exists that the practice of performing a partial-birth abortion--an abortion in which a physician deliberately and intentionally vaginally delivers a living, unborn child's body until either the entire baby's head is outside the body of the mother, or any part of the baby's trunk past the navel is outside the body of the mother and only the head remains inside the womb, for the purpose of performing an overt act (usually the puncturing of the back of the child's skull and removing the baby's brains) that the person knows will kill the partially delivered infant, performs this act, and then completes delivery of the dead infant--is a gruesome and inhumane procedure that is never medically necessary and should be prohibited. \n \n (2) Rather than being an abortion procedure that is embraced by the medical community, particularly among physicians who routinely perform other abortion procedures, partial-birth abortion remains a disfavored procedure that is not only unnecessary to preserve the health of the mother, but in fact poses serious risks to the long-term health of women and in some circumstances, their lives. As a result, at least 27 States banned the procedure as did the United States Congress which voted to ban the procedure during the 104th, 105th, and 106th Congresses. \n <snip<\n \n http://www.theorator.com/bills108/s3.html\n \n \n \n\n A pre-viable fetus isn't \"almost born\". It's a miscarriage. You're objection is with late term abortions, not \"partial birth abortions\" because the bill can apply pre-viability.\n\n \n If you'll read the description contained in the law above, you'll see that the fetus is, in fact, almost born. A miscarriage is a spontaneous expelling of the fetus for whatever reason, NOT caused by outside influence. A partial birth abortion is an intentional act.\n \n -edit- AND my objection is with virtually ALL abortions, not just late term. Making suppositions about another's position when the other person hasn't made a statement isn't a sound debate tactic.\n \n \n \n\n Do you actually think a woman would go through the pregnancy and wait until late term to have an abortion unless her situation was pretty bad? \n \n\n \n Yes, I do. I knew a girl in college that \"put it off\" for months and months.\n \n \n \n\n I assure you, late-term abortions are not lightly done, by either women or doctors. \n\n \n Although it's nice to have your assurances, do you have any personal experience or anything else to back this up? Please show some statistics.\n \n \n \n\n When 95-98% of abortions happen in the first two trimesters, late term abortions happen in more extreme situations. No woman would wait this long casually. ETA, Though I must say, if pro-life people have their way, early abortions will be harder to acquire (parent notification, moral objection by the doctor, banning it in particular states, etc) so many more abortions will be performed late-term.\n\n \n I understand the medical needs to save the mother if something goes badly, health-wise, for her near the end of a pregnancy. That must be an agonizing decision for all involved.\n \n But do you have any statistics to back up your % of abortions and when they're performed?\n \n (and, ETA??)\n \n \n \n\n C-sections are fine... for women who want to go through them. Not every woman does.\n\n \n A C-section is used to preserve the health of the baby or the mother at or near the time of birth, or when a vaginal birth is not possible for whatever reason. At the point where a C-section is considered, the baby is viable (insert argument about viable here). Your saying that the mother wanted the baby but not a C-section is ludicrous. If she wants the baby, she's not going to go through labor and partially deliver the child just to have it killed by the doctor. And if the baby or mother is in danger at the time of delivery, C-section is often the only option to save one or both.", 
   {}, 
   125450, 
   null, 
   1116605220.0
  ], 
  [
   125592, 
   null, 
   "Sigma", 
   "It does, so please redress your position(my emphasis):\n\n \n I said:  That's great for you, but we're talking about the bill. It does not specify viable or not, nor is there any procedure called \"partial birth abortion\".\n \n Perhaps I missed it, but where does the bill state what gestational age it applies to or what trimester it is to be used in or if it refers to pre-viability or post-viability? Also, where was the link to the medical site that described a medical procedure called \"partial birth abortion\"?\n \n Descriptions and labels in bills are done for political purposes and have no necessary connection to reality. The fact that a legislative bill refers to a \"partial birth abortion\" in no way proves a \"partial birth abortion\" procedure exists.\n \n You have in no way refuted what I have said.\n \n \n\n If you'll read the description contained in the law above, you'll see that the fetus is, in fact, almost born. A miscarriage is a spontaneous expelling of the fetus for whatever reason, NOT caused by outside influence. A partial birth abortion is an intentional act.\n\n \n Is it? Where in the bill does it state that labor was induced? All that is required is for a physician to \"deliberately and intentionally vaginally deliver\" a fetus, whether the labor was spontaneous or not. A pre-viability fetus is not almost born.\n \n \n\n -edit- AND my objection is with virtually ALL abortions, not just late term. Making suppositions about another's position when the other person hasn't made a statement isn't a sound debate tactic.\n\n \n I made an assumption based upon what you have stated within this thread. It was a sound assumption.\n \n \n\n Yes, I do. I knew a girl in college that \"put it off\" for months and months.\n\n \n I don't believe you. For what reason? Early abortions are quick and easy on the woman, the later it is performed the harder it is.\n \n Unless she was in denial or it there were extenuating circumstances, this is not a believable scenario.\n \n \n\n Although it's nice to have your assurances, do you have any personal experience or anything else to back this up? Please show some statistics.\n\n \n I do have personal experience, I have been a part of discussions with many women who have had abortions, early and late, coerced and not, abused and not. You ask for personal experience and then demand statistics? Wouldn't the two be mutually exclusive?\n \n \n\n I understand the medical needs to save the mother if something goes badly, health-wise, for her near the end of a pregnancy. That must be an agonizing decision for all involved.\n\n \n Agreed, it must be. Would you forbid late term abortions in cases where the woman's health was impacted?\n \n \n\n But do you have any statistics to back up your % of abortions and when they're performed?\n\n \n That's common knowledge, and backed up by virtually every study on the matter. I don't have to hold your hand for this.\n \n \n\n (and, ETA??)\n\n \n Check a couple of posts above and you'll see what it means, in my reply to Cone.\n \n \n\n A C-section is used to preserve the health of the baby or the mother at or near the time of birth, or when a vaginal birth is not possible for whatever reason. At the point where a C-section is considered, the baby is viable (insert argument about viable here). Your saying that the mother wanted the baby but not a C-section is ludicrous. If she wants the baby, she's not going to go through labor and partially deliver the child just to have it killed by the doctor. And if the baby or mother is in danger at the time of delivery, C-section is often the only option to save one or both.\n\n \n I never mentioned whether or not the mother wanted to actually keep it. If she does and is willing to go through a C-section then wonderful :)\n \n We were talking about abortions, so naturally assumed she would not want to keep it.", 
   {
    "unicode_changes_made": true
   }, 
   125532, 
   null, 
   1116612780.0
  ], 
  [
   125640, 
   null, 
   "Voice Of Reason", 
   "That's common knowledge, and backed up by virtually every study on the matter. I don't have to hold your hand for this.\n emoticon_rolleyes \n \n I noticed you very conveniently failed to mention that you were wrong about what the name of the bill in the congress is..........", 
   {
    "unicode_changes_made": true
   }, 
   125592, 
   null, 
   1116620040.0
  ], 
  [
   125649, 
   null, 
   "Sigma", 
   "emoticon_rolleyes \n \n I noticed you very conveniently failed to mention that you were wrong about what the name of the bill in the congress is..........\n\n \n Eh? What are you talking about? The \"partial birth abortion\" bill?", 
   {}, 
   125640, 
   null, 
   1116621360.0
  ], 
  [
   125662, 
   null, 
   "Voice Of Reason", 
   "Eh? What are you talking about? The \"partial birth abortion\" bill?\n\n \n You said the bill was not called the PBA bill\n \n Kuato corrected you\n \n \n\n To prohibit the procedure commonly known as partial-birth abortion.\n \n Be it enacted by the Senate and House of Representatives of the United States of America in Congress assembled,\n \n SECTION 1. SHORT TITLE.\n \n This Act may be cited as the `Partial-Birth Abortion Ban Act of 2003'.\n \n SEC. 2. FINDINGS.\n \n The Congress finds and declares the following:\n \n (1) A moral, medical, and ethical consensus exists that the practice of performing a partial-birth abortion--an abortion in which a physician deliberately and intentionally vaginally delivers a living, unborn child's body until either the entire baby's head is outside the body of the mother, or any part of the baby's trunk past the navel is outside the body of the mother and only the head remains inside the womb, for the purpose of performing an overt act (usually the puncturing of the back of the child's skull and removing the baby's brains) that the person knows will kill the partially delivered infant, performs this act, and then completes delivery of the dead infant--is a gruesome and inhumane procedure that is never medically necessary and should be prohibited.\n \n (2) Rather than being an abortion procedure that is embraced by the medical community, particularly among physicians who routinely perform other abortion procedures, partial-birth abortion remains a disfavored procedure that is not only unnecessary to preserve the health of the mother, but in fact poses serious risks to the long-term health of women and in some circumstances, their lives. As a result, at least 27 States banned the procedure as did the United States Congress which voted to ban the procedure during the 104th, 105th, and 106th Congresses.\n <snip<\n \n http://www.theorator.com/bills108/s3.html\n \n \n Quote:\n Originally Posted by Sigma\n A pre-viable fetus isn't \"almost born\". It's a miscarriage. You're objection is with late term abortions, not \"partial birth abortions\" because the bill can apply pre-viability.\n \n \n If you'll read the description contained in the law above, you'll see that the fetus is, in fact, almost born. A miscarriage is a spontaneous expelling of the fetus for whatever reason, NOT caused by outside influence. A partial birth abortion is an intentional act.\n \n -edit- AND my objection is with virtually ALL abortions, not just late term. Making suppositions about another's position when the other person hasn't made a statement isn't a sound debate tactic.\n \n \n Quote:\n Originally Posted by Sigma\n Do you actually think a woman would go through the pregnancy and wait until late term to have an abortion unless her situation was pretty bad?\n \n", 
   {}, 
   125649, 
   null, 
   1116622200.0
  ], 
  [
   125671, 
   null, 
   "Sigma", 
   "You said the bill was not called the PBA bill\n \n Kuato corrected you\n\n \n lol. The issue was never about the name of the bill. I said there was no medical procedure called \"partial birth abortion\".\n \n If you read it again, I said: That's great for you, but we're talking about the bill. It does not specify viable or not, nor is there any procedure called \"partial birth abortion\".", 
   {}, 
   125662, 
   null, 
   1116623520.0
  ], 
  [
   125713, 
   null, 
   "Voice Of Reason", 
   "lol. The issue was never about the name of the bill. I said there was no medical procedure called \"partial birth abortion\".\n \n If you read it again, I said: That's great for you, but we're talking about the bill. It does not specify viable or not, nor is there any procedure called \"partial birth abortion\".\n\n \n Yhen why do they call the bill Partial Birth Abortion if there is no procedure called that? emoticon_confused", 
   {}, 
   125671, 
   null, 
   1116630120.0
  ], 
  [
   125719, 
   null, 
   "Michele", 
   "There is no procedure called partial birth abortion. You will find it in no medical text or hospital form.\n \n This is a political title only. A mad attempt to stampede the cattle.\n \n There is late-term abortion. And for your information, most miscarriages are called abortions in medical records. Natural or man made, an expulsion of a fetus is an abortion.\n \n I would never have an abortion (induced) myself. That is my decision. But I am not arrogant enough to make decisions for all the other women in the USA.\n \n Two points:\n \n Rich women will always be able to have a safe and legal abortion whether it is outlawed or not. They always have because they have options that money makes possible such as flying somewhere else.\n \n Abortions will always be done. Poor women will die, at least some of them.\n \n Legislating morality is always a bad idea. emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "Partial Birth"
    }
   }, 
   106680, 
   null, 
   1116630840.0
  ], 
  [
   125737, 
   null, 
   "Sigma", 
   "Yhen why do they call the bill Partial Birth Abortion if there is no procedure called that? emoticon_confused\n\n \n Because if they make up a label, the bill is not limited to a single procedure or gestational age or anything like that. This allows a sort of \"backdoor ban\" in that it can be used for different procedures for prosecution purposes. Late term abortions (what ignorant people assume this applies to exclusively) are used to emotionally charge people. It's a political move to shift focus from early abortion to late abortion since most of the nation disagrees with late term abortions.\n \n The interest isn't in banning late term abortion (there were bills created by democrats that would ban all late term abortion except in cases of grevious physical injury), the interest is in riling up ignorant people such as yourself that know little about the issue and then dishonestly try to ban early abortions. D&X abortions (the actual procedure that most associate this bill with, although the bill is not limited to this procedure) account for less than 1 tenth of 1 percent of abortions performed, so banning just them doesn't really serve these decietful pro-life people's purpose. However, banning \"partial birth\" is much more useful, since it isn't limited to an actual procedure (for no actual procedure called \"partial birth\" exists) and it's useful for riling up emotions, isn't it?\n \n To sum up: For political purposes.", 
   {}, 
   125713, 
   null, 
   1116633000.0
  ], 
  [
   125767, 
   null, 
   "Voice Of Reason", 
   "the interest is in riling up ignorant people such as yourself \n \n \n Or perhaps it was directed to non caring people like you who have no compassion or value for human life in the womb and can think only of her miserable selfish existence.......\n \n I think the latter applies.......... emoticon_rolleyes", 
   {}, 
   125737, 
   null, 
   1116636480.0
  ], 
  [
   125769, 
   null, 
   "Sigma", 
   "Or perhaps it was directed to non caring people like you who have no compassion or value for human life in the womb and can think only of her miserable selfish existence.......\n \n I think the latter applies.......... emoticon_rolleyes\n\n \n haha, who says I'm a she? ;) You do know that when you say \"the latter\" it implies you had two options. I see only one.\n \n I should have figured you could not address the point of my response to you.", 
   {}, 
   125767, 
   null, 
   1116636720.0
  ], 
  [
   125772, 
   null, 
   "Voice Of Reason", 
   "haha, who says I'm a she? ;) You do know that when you say \"the latter\" it implies you had two options. I see only one.\n \n I should have figured you could not address the point of my response to you.\n\n \n You said you were a while back....\n \n Your option and mine.........\n \n You did not address mine either except to attack me personally.....\n \n Just because you write a whole bunch of horse manure does not make it so.......", 
   {}, 
   125769, 
   null, 
   1116636960.0
  ], 
  [
   125782, 
   null, 
   "jitobear", 
   "\n \n Just because you write a whole bunch of horse manure does not make it so.......\n\n \n You could always go check some medical text books or ask a doctor.", 
   {}, 
   125772, 
   null, 
   1116637560.0
  ], 
  [
   125786, 
   null, 
   "Sigma", 
   "You said you were a while back....\n\n \n haha truly? Could you quote me on that? I seriously doubt you can back this up\n \n \n\n Your option and mine.........\n\n \n ?\n \n \n\n You did not address mine either except to attack me personally.....\n\n \n Nope, I said you were ignorant of the issues involved. I sincerely believe that. It isn't an attack, though it can be insulting. I addressed your question directly.\n \n \n\n Just because you write a whole bunch of horse manure does not make it so.......\n\n \n Are you saying it isn't true? Perhaps you would care to debate it then :D", 
   {}, 
   125772, 
   null, 
   1116638280.0
  ], 
  [
   125869, 
   null, 
   "Voice Of Reason", 
   "haha truly? Could you quote me on that? I seriously doubt you can back this up\n \n \n \n ?\n \n \n \n Nope, I said you were ignorant of the issues involved. I sincerely believe that. It isn't an attack, though it can be insulting. I addressed your question directly.\n \n \n \n Are you saying it isn't true? Perhaps you would care to debate it then :D\n\n \n 1. you said it and its not important enough for me to look it up\n \n 2. you call someone ignorant.Is that a compliment in your mind?\n \n 3. I am saying its smoking mirrors...", 
   {}, 
   125786, 
   null, 
   1116652200.0
  ], 
  [
   125898, 
   null, 
   "Nurglitch", 
   "A thought occured to me: If partial birth abortions are banned, and there are no medical procedures called \"partial birth abortions\", then what's the problem exactly?", 
   {}, 
   125869, 
   null, 
   1116658440.0
  ], 
  [
   125904, 
   null, 
   "Sigma", 
   "Voice Of Reason,\n \n1. you said it and its not important enough for me to look it up\n\n \n No, I didn't :)\n \n \n\n 2. you call someone ignorant.Is that a compliment in your mind?\n\n \n No, but it's not an attack. It's a statement about your knowledge on the subject\n \n \n\n 3. I am saying its smoking mirrors...\n\n \n Which, of course, you have no intention of backing up. As usual :p\n \n Nurglitch,\n \nA thought occured to me: If partial birth abortions are banned, and there are no medical procedures called \"partial birth abortions\", then what's the problem exactly?\n\n \n Because it doesn't simply state that \"partial birth abortions\" are banned, it's that they have a description within the bill that can apply to different abortion procedures.\n \n It's a bit like if I made a bill called the \"happy fun time procedure ban\" and in the bill itself described the \"happy fun time procedure\" as \"Whenever a physician cuts open the skin for the purpose of removing a part of the body\". Despite the fact that there is no medical procedure called the \"happy fun time procedure\" doctors can be prosecuted under this bill if they remove tonsils or an appendix or a kidney for a transplant. It could also apply to donating blood, since the skin is punctured and blood is a part of the body. The wording is vague enough to do that.", 
   {}, 
   125869, 
   null, 
   1116660360.0
  ], 
  [
   125915, 
   null, 
   "Nurglitch", 
   "It seems to me that if such a law were enforced, a strong defense could be mounted by challenging whether the opinion of non-medical-expert could be truthfully applied to what laws applied to what medical procedures. \n \n How can someone who is not a medical expert, like a specialist doctor (obstetrician/gynecologist/paediatrics/etc), decide what counts as what where a medical procedure is concerned?\n \n Not banning specific medically defined procedures, and instead banning a group of procedures that conform to a set of criteria that is not medically defined, seems to me like asking legislative representatives for their medical opinions. \n \n While some legislators may also be doctors (Bill Frist springs to mind), this strikes me as something that should be regulated by the medical profession itself rather than by some of its members with the aid of the government. Y'know, so that it has access to dissenting peer reviews such that a genuine choice be made by the profession according to the rules of their profession.", 
   {}, 
   125898, 
   null, 
   1116661860.0
  ], 
  [
   126100, 
   null, 
   "Voice Of Reason", 
   "A thought occured to me: If partial birth abortions are banned, and there are no medical procedures called \"partial birth abortions\", then what's the problem exactly?\n\n \n Pro abortion/choice types don't like the name of PBA, but make no mistake that it what it is...........The definition has been posted here several times.......The gist of it is the baby is partially delivred then murdered..........", 
   {}, 
   125898, 
   null, 
   1116705180.0
  ], 
  [
   127425, 
   null, 
   "Sigma", 
   "It seems to me that if such a law were enforced, a strong defense could be mounted by challenging whether the opinion of non-medical-expert could be truthfully applied to what laws applied to what medical procedures. \n \n How can someone who is not a medical expert, like a specialist doctor (obstetrician/gynecologist/paediatrics/etc), decide what counts as what where a medical procedure is concerned?\n\n \n What's stopping them?\n \n \n\n Not banning specific medically defined procedures, and instead banning a group of procedures that conform to a set of criteria that is not medically defined, seems to me like asking legislative representatives for their medical opinions. \n \n While some legislators may also be doctors (Bill Frist springs to mind), this strikes me as something that should be regulated by the medical profession itself rather than by some of its members with the aid of the government. Y'know, so that it has access to dissenting peer reviews such that a genuine choice be made by the profession according to the rules of their profession.\n\n \n Bill Frist is a hack.", 
   {}, 
   125915, 
   null, 
   1116885240.0
  ], 
  [
   127474, 
   null, 
   "Nurglitch", 
   "Pro abortion/choice types don't like the name of PBA, but make no mistake that it what it is...........The definition has been posted here several times.......The gist of it is the baby is partially delivred then murdered..........\n That's nice, but it seems that figuring out when a particular procedure involves such a partial birth would require a medical opinion or interpretation right? \n \nWhat's stopping them?\nIgnorance, I would suppose. I thought the reason that we trained doctors in medicine and governed them as a professional body was so that we had a body of experts to make those kinds of decisions about medical practice.\n \nBill Frist is a hack.\n I can't really comment, having never been a patient of his.", 
   {}, 
   127425, 
   null, 
   1116892380.0
  ], 
  [
   127504, 
   null, 
   "Sigma", 
   "\n Ignorance, I would suppose. I thought the reason that we trained doctors in medicine and governed them as a professional body was so that we had a body of experts to make those kinds of decisions about medical practice.\n\n \n Even knowing that, what actually would stop them?\n \n \n\n I can't really comment, having never been a patient of his.\n\n \n If we're talking about the same fellow, I saw him in an interview talking about the abstinence program he helped create where it lists the dangers of tears transmitting AIDS. When the host questioned him on if he actually thinks tears transmitted AIDS (I have to commend the host for actually challenging him), he said \"I don't know\" and tried to change the subject even when the host stopped and asked \"Wait a minute, you don't know whether or not tears transmits AIDS?\". He tried to weasel out of it and never actually answered the question, a bit like Voice of Reason does.\n \n He cares nothing for good medicine, only political ends. He, and I'm starting to believe the majority of pro-life people are this way, is a disgusting excuse for a human being.", 
   {}, 
   127474, 
   null, 
   1116896460.0
  ], 
  [
   127570, 
   null, 
   "Voice Of Reason", 
   "That's nice, but it seems that figuring out when a particular procedure involves such a partial birth would require a medical opinion or interpretation right?\n \n \n Yes, sadly its usually and abortion butcher doctor who profits nicely from performing the operation...........", 
   {}, 
   127504, 
   null, 
   1116901620.0
  ], 
  [
   127653, 
   null, 
   "Nurglitch", 
   "Even knowing that, what actually would stop them?\n I'm talking about Nothing is stopping legislators from tabling whatever bills they want, regardless of whether they know anything about what they're voting on. But you're missing my point. I'm not talking about whether legislators can write laws. I'm talking about whether they can write laws that actually regulate things. A law to regulate traffic that required that cars both stop and go on red lights could be passed. Such a law would do little to regulate traffic though. Do you see what I'm getting at?\n \nIf we're talking about the same fellow, I saw him in an interview talking about the abstinence program he helped create where it lists the dangers of tears transmitting AIDS. When the host questioned him on if he actually thinks tears transmitted AIDS (I have to commend the host for actually challenging him), he said \"I don't know\" and tried to change the subject even when the host stopped and asked \"Wait a minute, you don't know whether or not tears transmits AIDS?\". He tried to weasel out of it and never actually answered the question, a bit like Voice of Reason does.\n Oh yeah, I've read some pretty terrible things about him too, but I don't think I've ever known a doctor that didn't regularly make mistakes on that calibre. They're unfortunately humans trying to do a machine's job.\n \nHe cares nothing for good medicine, only political ends. He, and I'm starting to believe the majority of pro-life people are this way, is a disgusting excuse for a human being.\n I wouldn't say that. Sure, I think that ignorance and stupidity in an adult are the result of character flaws, but I wouldn't go so far as to slander all pro-lifers by comparing them to Hunter or Voice of Reason.", 
   {}, 
   127570, 
   null, 
   1116910140.0
  ], 
  [
   127712, 
   null, 
   "Voice Of Reason", 
   "Senator Frist is a renown heart surgeon who has donated his time to go around the world to 3rd world countries and perform heart surgery free of charge to people in need.........\n \n Shame on you for insulting him........", 
   {}, 
   127653, 
   null, 
   1116917640.0
  ], 
  [
   128037, 
   null, 
   "Sigma", 
   "Senator Frist is a renown heart surgeon who has donated his time to go around the world to 3rd world countries and perform heart surgery free of charge to people in need.........\n \n Shame on you for insulting him........\n\n \n He's also a political hack who trades in his title for politcal gain.", 
   {}, 
   127712, 
   null, 
   1116971520.0
  ], 
  [
   128041, 
   null, 
   "Sigma", 
   "I'm talking about Nothing is stopping legislators from tabling whatever bills they want, regardless of whether they know anything about what they're voting on. But you're missing my point. I'm not talking about whether legislators can write laws. I'm talking about whether they can write laws that actually regulate things. A law to regulate traffic that required that cars both stop and go on red lights could be passed. Such a law would do little to regulate traffic though. Do you see what I'm getting at?\n\n \n Oh, sure, they can pass a law banning the moon from reflecting light but that ain't gonna happen. However, unless we revolt we are generally bound to follow the laws they pass, however rediculous.\n \n \n\n Oh yeah, I've read some pretty terrible things about him too, but I don't think I've ever known a doctor that didn't regularly make mistakes on that calibre. They're unfortunately humans trying to do a machine's job.\n\n \n Mistakes, sure. Deceit is something else entirely, at least to me.\n \n \n\n I wouldn't say that. Sure, I think that ignorance and stupidity in an adult are the result of character flaws, but I wouldn't go so far as to slander all pro-lifers by comparing them to Hunter or Voice of Reason.\n\n \n I happen to think it's intrinsic in the philosophy.", 
   {}, 
   127653, 
   null, 
   1116971760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Should Partial Birth Abortion be banned?", 
  "url": "http://www.4forums.com/political/abortion-debates/4801-should-partial-birth-abortion-banned.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 4801, 
  "discussion_files": [
   [
    "12678.html", 
    "http://www.4forums.com/political/abortion-debates/4801-should-partial-birth-abortion-banned-print.html"
   ], 
   [
    "12679.html", 
    "http://www.4forums.com/political/abortion-debates/4801-should-partial-birth-abortion-banned-8-print.html"
   ], 
   [
    "12680.html", 
    "http://www.4forums.com/political/abortion-debates/4801-should-partial-birth-abortion-banned-6-print.html"
   ], 
   [
    "12681.html", 
    "http://www.4forums.com/political/abortion-debates/4801-should-partial-birth-abortion-banned-4-print.html"
   ], 
   [
    "12682.html", 
    "http://www.4forums.com/political/abortion-debates/4801-should-partial-birth-abortion-banned-5-print.html"
   ], 
   [
    "12683.html", 
    "http://www.4forums.com/political/abortion-debates/4801-should-partial-birth-abortion-banned-7-print.html"
   ], 
   [
    "12684.html", 
    "http://www.4forums.com/political/abortion-debates/4801-should-partial-birth-abortion-banned-3-print.html"
   ], 
   [
    "12685.html", 
    "http://www.4forums.com/political/abortion-debates/4801-should-partial-birth-abortion-banned-2-print.html"
   ]
  ], 
  "identifier": 4801
 }
]