[
 [
  [
   106681, 
   null, 
   "VTCruiser", 
   "Doesnt the majority in America matter anymore?? The majority of americans dont want Gay marriage... Its obvious because not one state that has let the people actually vote on this issue has legallized it. So i ask this question... Is it truly demoralizing to deny gays to marry? ha. yeah right, its actually the most moral thing we can do on this one issue. And i speak on behalf of the majority of America.... some 80% or greater..", 
   {
    "post_info": {
     "post_title": "Doesnt public opinion matter?"
    }
   }, 
   null, 
   null, 
   1113410160.0
  ], 
  [
   106687, 
   null, 
   "sinjin", 
   "Doesnt the majority in America matter anymore?? The majority of americans dont want Gay marriage... Its obvious because not one state that has let the people actually vote on this issue has legallized it. So i ask this question... Is it truly demoralizing to deny gays to marry? ha. yeah right, its actually the most moral thing we can do on this one issue. And i speak on behalf of the majority of America.... some 80% or greater..\n\n \n Are you familiar withe the phrase \"tyranny of the majority\"? Amazing how many Americans don't understand how the Constitution is intended to protect minorities from the majority.", 
   {}, 
   106681, 
   null, 
   1113410760.0
  ], 
  [
   106694, 
   null, 
   "VTCruiser", 
   "Are you familiar withe the phrase \"tyranny of the majority\"? Amazing how many Americans don't understand how the Constitution is intended to protect minorities from the majority.\n\n \n oh brother.. so what if a minority of americans wanted to legalize murder.\n \n this is rediculous.", 
   {}, 
   106687, 
   null, 
   1113411720.0
  ], 
  [
   106704, 
   null, 
   "sinjin", 
   "oh brother.. so what if a minority of americans wanted to legalize murder.\n \n this is rediculous.\n\n \n You mean your hypothetical I presume? Murder violates the rights of the murdered by relieving them of their life. That's why it's illegal. \n \n You're a bit slow I see.", 
   {}, 
   106694, 
   null, 
   1113412920.0
  ], 
  [
   106705, 
   null, 
   "Jo Bennett", 
   "If you can't see the difference between gay marriage and murder then you need your head examining. In a society based on the right to \"life, liberty and the pursuit of happiness\" what is the overriding need that means the rights of gays to the latter must be sacrificed. The saying goes that my right to swing my fist stops at your nose, whose nose is smashed by the right of gays to marry?", 
   {}, 
   106694, 
   null, 
   1113413100.0
  ], 
  [
   106714, 
   null, 
   "jitobear", 
   "What I want to know is if all these folks who feel it is their right to vote on marriage for gays would mind if the gays were allowed to vote on their marriages?", 
   {}, 
   106705, 
   null, 
   1113413880.0
  ], 
  [
   106722, 
   null, 
   "Jaxian", 
   "Doesnt the majority in America matter anymore?? The majority of americans dont want Gay marriage... Its obvious because not one state that has let the people actually vote on this issue has legallized it. So i ask this question... Is it truly demoralizing to deny gays to marry? ha. yeah right, its actually the most moral thing we can do on this one issue. And i speak on behalf of the majority of America.... some 80% or greater..\n\n \n I suppose I should mention that those who support banning same-sex marriage is probably significanlty less than 80%.\n \n With that done, allow me to explain why the majority opinion does not matter. In truth, the opinion of the majority has no bearing on what is morally right or wrong. There were times when the vast majority supported slavery, murder of minorities, denying women the right to vote, kings and monarchs, and countless other atrocities. There is no reason to believe that the majority is morally right or wrong. In fact, the majority generally seeks to oppress the minority, destroying its freedom and equality. Such a situation is known as the tyranny of the majority.\n \n To prevent the tryanny of the majority, our government was created in a system of checks and balances; these checks and balances do not just check different branches of the government against each other; they check the power of majority against the power of government officials. The judicial system, for example, was created specifically to be free from the influence of the majority. The president is not elected by the majority, and senators originally were not elected by the majority. Our federal government was made very powerful, even though Anti-Federalists were arguing for state governments to be powerful; this was done because the more people a government official has to represent, the more difficult it is for any one group to achieve a majority, and the less likely it is that an individual who represents only a single group will be elected. Government officials are intended to consider the wellbeing of all of their citizens, not just the majority. This does not mean that a majority cannot form, certainly we have a majority religion in our nation, as can be seen with same-sex marriage, but the power of that majority needs to be limited. More information on this can be found in The Federalist Papers, particularly #9, #10, and #51.\n \n So short, there is no reason to believe that the majority will not just think of itself and refuse to treat the minority fairly. Although the majority has been given a lot of political power, its power was never intended to go unchecked. The power of the majority is the real problem with democracy, and the creators of our Constitution realized this. \n \n In answer to your question, certainly the majority opinion in America matters a lot, for the majority has much power. One of the primary goals of same-sex marriage supporters is to change that opinion, for even though the majority has a lot of power, it is sometimes morally evil.", 
   {}, 
   106681, 
   null, 
   1113414780.0
  ], 
  [
   106728, 
   null, 
   "jyoshu", 
   "If you can't see the difference between gay marriage and murder then you need your head examining. In a society based on the right to \"life, liberty and the pursuit of happiness\" what is the overriding need that means the rights of gays to the latter must be sacrificed. The saying goes that my right to swing my fist stops at your nose, whose nose is smashed by the right of gays to marry?\n\n \n But the difference is, if you take a swing and hit someone, or harm them in a worse way, you can get locked up for it. But no cop is going to bar the door to a chapel where you get married to a same-sex partner, and you won't be arrested afterwards. Yes, it's completely legal for you to do that, right now.\n \n Apples and oranges.\n \n \nIn truth, the opinion of the majority has no bearing on what is morally right or wrong.\n\n \n Perhaps it shouldn't, but as I explained to you in another post yesterday, in the real world it always does anyway. No civil rights reform has ever come about until enough people are behind it.", 
   {}, 
   106705, 
   null, 
   1113415740.0
  ], 
  [
   106731, 
   null, 
   "BobNelson2", 
   "Perhaps it shouldn't, but as I explained to you in another post yesterday, in the real world it always does anyway. No civil rights reform has ever come about until enough people are behind it.\n\n \n Yeah, like school desegregation.\n \n Or the integration of the armed forces.\n \n Or interracial marriage.", 
   {}, 
   106728, 
   null, 
   1113416040.0
  ], 
  [
   106734, 
   null, 
   "VTCruiser", 
   "I suppose I should mention that those who support banning same-sex marriage is probably significanlty less than 80%.\n \n\n \n show me that evidence.", 
   {}, 
   106722, 
   null, 
   1113416460.0
  ], 
  [
   106735, 
   null, 
   "VTCruiser", 
   "No civil rights reform has ever come about until enough people are behind it.\n\n \n I guess what the Christian Right would ask is \"is this truly a civil rights movement, or a selfish rights movement?\"\n \n and i think they would answer the latter. Also, i dont think the Christian Right would let this happen.", 
   {}, 
   106728, 
   null, 
   1113416640.0
  ], 
  [
   106737, 
   null, 
   "VTCruiser", 
   "\n one of the primary goals of same-sex marriage supporters is to change that opinion, for even though the majority has a lot of power, it is sometimes morally evil.\n\n \n What makes you so certain that the minority is right on this issue?", 
   {}, 
   106722, 
   null, 
   1113417120.0
  ], 
  [
   106738, 
   null, 
   "Jaxian", 
   "Perhaps it shouldn't, but as I explained to you in another post yesterday, in the real world it always does anyway. No civil rights reform has ever come about until enough people are behind it.\n\n \n I don't think this is true. Racial segregation, for example, was destroyed by a supreme court despite that ruling being wildly unpopular. But yes, I do agree that more support of same-sex marriage will be necessary.", 
   {}, 
   106728, 
   null, 
   1113417120.0
  ], 
  [
   106739, 
   null, 
   "VTCruiser", 
   "I don't think this is true. Racial segregation, for example, was destroyed by a supreme court despite that ruling being wildly unpopular. But yes, I do agree that more support of same-sex marriage will be necessary.\n\n \n \n well i guess that leaves us back to the majority thing.. alright thats all i wanted to know, thanks for all your comments.", 
   {}, 
   106738, 
   null, 
   1113417240.0
  ], 
  [
   106744, 
   null, 
   "Jaxian", 
   "show me that evidence.\n\n \n Well, I'm basing it first and formost on the states which passed ammendments banning same-sex marriage. The percentages in those states were almost completely lower than 80%, with perhaps one or two exceptions. This indicates that even in the least supportive states, 80% is usually too high a number. Unfortunately, I cannot come up with a good website that lists all of the percentages, but you should be able to look around. This was the least important thing I wrote in that entire post, so I'm not too worried about it.\n \n \nWhat makes you so certain that the minority is right on this issue?\n\n \n Well, now this is the question that really matters, and the answer is a long one. But to state it as simply as possible: denying same-sex marriage hurts many people. It forces same-sex couples to pay for the marriage of opposite-sex couples while no one is forced to pay for their marriages. It denies them access to raise children and ability to cover their children and spouses with their medical insurance, along with the many other benefits of marriage. It uses the law to teach the people that the lifestyle and religion held by same-sex couples is wrong, and this forces them to feel the disapproval of society.\n \n There is no reason to perpetuate these harms. I have heard many arguments opposed to same-sex marriage, but there is not even one of them that justifies these harms. In fact, I would even say that there is not one argument against same-sex marriage that makes logical sense at all. Thus, even if same-sex marriage brought no benefits, there would be no reason to keep it illegal; a free and equal society does not deny rights or benefits to anyone, unless it has a very good reason to. And there just isn't any reason to deny rights and benefits to same-sex couples.", 
   {}, 
   106734, 
   null, 
   1113418020.0
  ], 
  [
   106746, 
   null, 
   "VTCruiser", 
   "\n There is no reason to perpetuate these harms. I have heard many arguments opposed to same-sex marriage, but there is not even one of them that justifies these harms. In fact, I would even say that there is not one argument against same-sex marriage that makes logical sense at all. Thus, even if same-sex marriage brought no benefits, there would be no reason to keep it illegal; a free and equal society does not deny rights or benefits to anyone, unless it has a very good reason to. And there just isn't any reason to deny rights and benefits to same-sex couples.\n\n \n Well, its not just morally wrong in America, but its morally wrong in the middle east as well. And i think that if we continue our way downward morally as a nation, it would give terrorists even more hate for america because we are supposedly a \"christian nation\" and dont live morally.\n \n anyways.", 
   {}, 
   106744, 
   null, 
   1113418320.0
  ], 
  [
   106753, 
   null, 
   "tonybrown74", 
   "I guess what the Christian Right would ask is \"is this truly a civil rights movement, or a selfish rights movement?\"\n \n and i think they would answer the latter. Also, i dont think the Christian Right would let this happen.\n\n \n Those damn black people! All wanting respect and equal opportunity! They should just be happy with what they got!Why should they work for the same pay? They are just selfish! [/end sarcasm]\n \n This argument is tired *yawn*", 
   {}, 
   106735, 
   null, 
   1113418860.0
  ], 
  [
   106755, 
   null, 
   "Jaxian", 
   "Well, its not just morally wrong in America, but its morally wrong in the middle east as well. And i think that if we continue our way downward morally as a nation, it would give terrorists even more hate for america because we are supposedly a \"christian nation\" and dont live morally.\n \n anyways.\n\n \n Are you from the Middle East? I wasn't aware of that; so perhaps much of my references to American government may not have impacted your opinion, though my explanation should be equally applicable in any nation.\n \n Legalizing same-sex marriage is morally right in both places, and denying same-sex marriage is morally wrong. The majority just doesn't understand that yet. But certainly a majority of Americans would see this as a step toward immorality, and you're right that I don't think it would much help your situation with America, at least not today. But if Americans are going to hate you because of your nation's stance on same-sex marriage, then that is a moral problem with Americans, not with same-sex marriage.", 
   {}, 
   106746, 
   null, 
   1113418920.0
  ], 
  [
   106760, 
   null, 
   "VTCruiser", 
   "Those damn black people! All wanting respect and equal opportunity! They should just be happy with what they got!Why should they work for the same pay? They are just selfish! [/end sarcasm]\n \n This argument is tired *yawn*\n\n \n \n Well, i dont know about you, but i think the majority of people in 1860 that were the christian right (when it came down to slavery opponents and embracers) were the people in the northern states. its called the ABOLITION movement which was based from William Lloyd Garrison who was a preacher..", 
   {}, 
   106753, 
   null, 
   1113419460.0
  ], 
  [
   106761, 
   null, 
   "VTCruiser", 
   "Are you from the Middle East? I wasn't aware of that; so perhaps much of my references to American government may not have impacted your opinion, though my explanation should be equally applicable in any nation.\n \n Legalizing same-sex marriage is morally right in both places, and denying same-sex marriage is morally wrong. The majority just doesn't understand that yet. But certainly a majority of Americans would see this as a step toward immorality, and you're right that I don't think it would much help your situation with America, at least not today. But if Americans are going to hate you because of your nation's stance on same-sex marriage, then that is a moral problem with Americans, not with same-sex marriage.\n\n \n emoticon_wow that made no sense. :p", 
   {}, 
   106755, 
   null, 
   1113419700.0
  ], 
  [
   106765, 
   null, 
   "Jaxian", 
   "emoticon_wow that made no sense. :p\n\n \n Rereading my post, it appears to make perfect sense. Could you elaborate on what you are confused about?", 
   {}, 
   106761, 
   null, 
   1113420000.0
  ], 
  [
   106776, 
   null, 
   "VTCruiser", 
   "Rereading my post, it appears to make perfect sense. Could you elaborate on what you are confused about?\n\n \n Maybe saying it in english, instead of approaching me like im from the middle east.", 
   {}, 
   106765, 
   null, 
   1113420720.0
  ], 
  [
   106778, 
   null, 
   "tonybrown74", 
   "Well, i dont know about you, but i think the majority of people in 1860 that were the christian right (when it came down to slavery opponents and embracers) were the people in the northern states. its called the ABOLITION movement which was based from William Lloyd Garrison who was a preacher..\n\n \n One thing the discussion if civil equality of GLBT people has always shown me, is that for those who have an issue with it, hind sight can sure be a bit of an itch.\n \n You sit there and announce that the \"christian right\" was responsible for the abolitionist movement, forgetting that it was \"christian\" bigotry that argued for the \"right\" to own slaves, using the bible to do so (which version is anyone's guess).\n \n Do you honestly believe that you can conclude that, if you had lived (I am assuming here, that you weren't an adult in the 40s or 50s) during the 40s and 50s, you would have been pro-equal rights for black people? Do you honestly think that you would have not been under the 'influence' of your parents' morality when you initially formed your own decision?", 
   {}, 
   106760, 
   null, 
   1113420900.0
  ], 
  [
   106784, 
   null, 
   "BobNelson2", 
   "Well, i dont know about you, but i think the majority of people in 1860 that were the christian right (when it came down to slavery opponents and embracers) were the people in the northern states. its called the ABOLITION movement which was based from William Lloyd Garrison who was a preacher..\n\n \n Uh... let's see... northern chrisitians... umh... wouldn't that be the christian left?", 
   {}, 
   106760, 
   null, 
   1113421620.0
  ], 
  [
   106788, 
   null, 
   "VTCruiser", 
   "Do you honestly think that you would have not been under the 'influence' of your parents' morality when you initially formed your own decision?\n\n \n well to answer your question, i know for sure that i wouldve been marching with Martin Luther King Jr. just like i marched in January in the walk for life (led by a black man himself). ALL PEOPLE are created equal. I'm not degrading gays to lesser of a person than me, im just degrading their lifestyle. They are people just like me though.", 
   {}, 
   106778, 
   null, 
   1113421980.0
  ], 
  [
   106790, 
   null, 
   "VTCruiser", 
   "Uh... let's see... northern chrisitians... umh... wouldn't that be the christian left?\n\n \n LoL :p great comic relief.", 
   {}, 
   106784, 
   null, 
   1113422040.0
  ], 
  [
   106808, 
   null, 
   "Jaxian", 
   "Maybe saying it in english, instead of approaching me like im from the middle east.\n\n \n Every word I wrote is in English, and I wrote it precisely as I would have written it to anyone else, with the excpetion of using \"your situation\" to describe the situation of the Middle East. Your remark seems sarcastic, and it is not helping me clarify my words.\n \n To simplify, I will summarize what I said:\n \n 1) Morality has nothing to do with majority opinion. The majority thinks same-sex marriage is immoral, but just the opposite is true.\n \n 2) You're right that the American image of the Middle East would not be improved by legalizing same-sex marriage, at least not today, but that doesn't mean you shouldn't legalize it.", 
   {}, 
   106776, 
   null, 
   1113424020.0
  ], 
  [
   106815, 
   null, 
   "VTCruiser", 
   "Every word I wrote is in English, and I wrote it precisely as I would have written it to anyone else, with the excpetion of using \"your situation\" to describe the situation of the Middle East. Your remark seems sarcastic, and it is not helping me clarify my words.\n \n To simplify, I will summarize what I said:\n \n 1) Morality has nothing to do with majority opinion. The majority thinks same-sex marriage is immoral, but just the opposite is true.\n \n 2) You're right that the American image of the Middle East would not be improved by legalizing same-sex marriage, at least not today, but that doesn't mean you shouldn't legalize it.\n\n \n ok, that makes more sense. Well, i thought we were supposed to care how and what the world thinks about us.", 
   {}, 
   106808, 
   null, 
   1113424500.0
  ], 
  [
   106817, 
   null, 
   "Jaxian", 
   "ok, that makes more sense. Well, i thought we were supposed to care how and what the world thinks about us.\n\n \n Well, you have to care about that, I mean, what the world thinks of you determines how you're treated. But this issue won't have too large an impact on anyone's reputation, and sometimes it's better to do something unpopular that helps people than to do something popular that hurts them. I think the impact to reputation is small enough that little harm would come from legalizing same-sex marriage, but a lot of people would be helped.", 
   {}, 
   106815, 
   null, 
   1113424800.0
  ], 
  [
   106818, 
   null, 
   "VTCruiser", 
   "Well, you have to care about that, I mean, what the world thinks of you determines how you're treated. But this issue won't have too large an impact on anyone's reputation, and sometimes it's better to do something unpopular that helps people than to do something popular that hurts them. I think the impact to reputation is small enough that little harm would come from legalizing same-sex marriage, but a lot of people would be helped.\n\n \n i was just coming from that perspective because one of the terrorists main reason for hating america is because of its lack of morality.. and legalizing gay marriage would be degrading to them..", 
   {}, 
   106817, 
   null, 
   1113424920.0
  ], 
  [
   106825, 
   null, 
   "Jaxian", 
   "i was just coming from that perspective because one of the terrorists main reason for hating america is because of its lack of morality.. and legalizing gay marriage would be degrading to them..\n\n \n Ah, well terrorists build up support by saying that America is immoral, but they're going to say it as much and get as many recruits whether we legalize same-sex marriage or not. I'm pretty sure they are more concerned with America's percieved use of military force to get what it wants and interfere with the lives of other people, that kind of immorality. You don't see terrorists targetting other countries that legalized same-sex marriage, after all. Regardless, even if terrorists may or may not have good points about America sometimes, it is never a good idea to let people who use violence get what they want, to control a nation, because that only encourages other people to use violence to get what they want. America has a zero-tolerance policy on terrorism for a reason: if we ever give in to terrorism, more people will attempt it.", 
   {}, 
   106818, 
   null, 
   1113426000.0
  ], 
  [
   106828, 
   null, 
   "joebrummer", 
   "well to answer your question, i know for sure that i wouldve been marching with Martin Luther King Jr. just like i marched in January in the walk for life (led by a black man himself). ALL PEOPLE are created equal. I'm not degrading gays to lesser of a person than me, im just degrading their lifestyle. They are people just like me though.\n\n \n Yes, you are degrading gays, we do not have a lifestyle, we have lives and we happen to be gay. We have no more of a lifestyle than a heterosexual. We have different lifestyles varied by our circumstances. All in all we have a life, not a lifestyle. When you learn that part of this game, your words will sound less degrading to gays. \n \n Part of who I am in gay, just like part of who I am is American, and part od who I am is a man. These are just the facts.", 
   {}, 
   106788, 
   null, 
   1113426420.0
  ], 
  [
   106831, 
   null, 
   "VTCruiser", 
   " I'm pretty sure they are more concerned with America's percieved use of military force to get what it wants and interfere with the lives of other people, that kind of immorality. \n\n \n Swift military action came after the fact that we found out they hate our guts..... so, with or without military action, they'd still hate us. thus, my argument still stands, they hate how demoralizing we are becoming.\n \n \n \n You don't see terrorists targetting other countries that legalized same-sex marriage, after all. \n\n \n wasnt spain the first to legalize it??\n \n \n \n Regardless, even if terrorists may or may not have good points about America sometimes, it is never a good idea to let people who use violence get what they want, to control a nation, because that only encourages other people to use violence to get what they want. \n \n\n \n with this logic, we should stay in iraq just to smite the terrorists and not give them what they want. (a pullout)", 
   {}, 
   106825, 
   null, 
   1113426780.0
  ], 
  [
   106832, 
   null, 
   "VTCruiser", 
   "Yes, you are degrading gays, we do not have a lifestyle, we have lives and we happen to be gay.\n\n \n \n ok heres another example. A sex offender has a lifestyle of rape and whatever you wanna say he has done over and over again. in parallel, i think his actions actions are wrong just like i think a homesexual's actions are wrong. But in no way do i think they are less of a person for that. Human beings are human beings no matter what they do. But sometimes they do things that are wrong... and you gotta fix it.", 
   {}, 
   106828, 
   null, 
   1113427020.0
  ], 
  [
   106835, 
   null, 
   "Jaxian", 
   "Swift military action came after the fact that we found out they hate our guts..... so, with or without military action, they'd still hate us. thus, my argument still stands, they hate how demoralizing we are becoming.\n\n \n I'm not referring to the Afghanistan war. The US interferes in foreign affairs all the time; our military is everywhere, and usually provide aid to one side of another country's domestic dispute or the other. One very disputed example of this is the US's support of Israel over Palestine. We knew Afghanistan leaders and terrorists hated us long before the terrorist attacks, but we didn't realize they'd allow terrorism to get so far.\n \n \nwasnt spain the first to legalize it??\n\n \n No, Denmark was the first to legalize it. In fact, Spain still has not legalized it. Spain did very recently announce plans to legalize same-sex marriage, but I believe that occurred after terrorist attacks to it, not before.\n \n \nwith this logic, we should stay in iraq just to smite the terrorists and not give them what they want. (a pullout)\n\n \n No, we certainly should not do immoral things just to smite the terrorists. We should, however, refuse to let terrorists make our decisions for us. If we pull out of Iraq, we should do it because pulling out of Iraq is the best idea, not because terrorists demanded it. If people can change the actions of the US by committing a few acts of terrorism, then they are going to do it. Certainly we shouldn't go out of our way to offend anyone.", 
   {}, 
   106831, 
   null, 
   1113427680.0
  ], 
  [
   106837, 
   null, 
   "jitobear", 
   "But sometimes they do things that are wrong... and you gotta fix it.\n\n \n Homosexuals don't need to be fixed. Can I fix you to like something you don't. You can and will be turned on my the same sex. If they can change so can you.\n \n Dumb XXX thing to say......", 
   {}, 
   106832, 
   null, 
   1113427860.0
  ], 
  [
   106840, 
   null, 
   "VTCruiser", 
   "Homosexuals don't need to be fixed. Can I fix you to like something you don't. You can and will be turned on my the same sex. If they can change so can you.\n \n Dumb XXX thing to say......\n\n \n lol, i didnt say homesexuals need to be fixed... i said that the issue needs to be fixed and the mindset of \"oh now im all for gay marriage\" bla bla. whatever, i think that your reactions to things come out too stongly... maybe you should approach things with more of a friendly attitude.", 
   {}, 
   106837, 
   null, 
   1113428280.0
  ], 
  [
   106841, 
   null, 
   "VTCruiser", 
   "I'm not referring to the Afghanistan war. The US interferes in foreign affairs all the time; our military is everywhere, and usually provide aid to one side of another country's domestic dispute or the other. One very disputed example of this is the US's support of Israel over Palestine. We knew Afghanistan leaders and terrorists hated us long before the terrorist attacks, but we didn't realize they'd allow terrorism to get so far.\n \n \n \n No, Denmark was the first to legalize it. In fact, Spain still has not legalized it. Spain did very recently announce plans to legalize same-sex marriage, but I believe that occurred after terrorist attacks to it, not before.\n \n \n \n No, we certainly should not do immoral things just to smite the terrorists. We should, however, refuse to let terrorists make our decisions for us. If we pull out of Iraq, we should do it because pulling out of Iraq is the best idea, not because terrorists demanded it. If people can change the actions of the US by committing a few acts of terrorism, then they are going to do it. Certainly we shouldn't go out of our way to offend anyone.\n\n \n sorry, i didnt mean to get into a big debate over that, but i was just pointing out stuff that could happen.", 
   {}, 
   106835, 
   null, 
   1113428340.0
  ], 
  [
   106842, 
   null, 
   "joebrummer", 
   "ok heres another example. A sex offender has a lifestyle of rape and whatever you wanna say he has done over and over again. in parallel, i think his actions actions are wrong just like i think a homesexual's actions are wrong. But in no way do i think they are less of a person for that. Human beings are human beings no matter what they do. But sometimes they do things that are wrong... and you gotta fix it.\n\n being gay isn't an action, it is a state of being. Even if I sit in a corner and do nothing, I will still be gay. If I was single and I didn't have sexual \"actions\" for years, I would still be gay. Being gay isn't about what you do, it is about who you are.\n \n and yes, you are still degrading gays, even if you don't realize it, even though I am pointing it out how degrading what you are saying is.", 
   {}, 
   106832, 
   null, 
   1113428400.0
  ], 
  [
   106845, 
   null, 
   "BobNelson2", 
   "No, Denmark was the first to legalize it. In fact, Spain still has not legalized it. Spain did very recently announce plans to legalize same-sex marriage, but I believe that occurred after terrorist attacks to it, not before.\n \n\n \n Uh... The Netherlands was the first nation in the (modern) world to recognize same-sex marriage. Belgium joined them last year, as did most Canadian provinces. Denmark, I believe, has had some form of civil union or domestic partnership for many years, but it is not equal to marriage.\n \n Spain and Taiwan are both scheduled to legalize same-sex marriage in the near future.", 
   {}, 
   106835, 
   null, 
   1113428520.0
  ], 
  [
   106846, 
   null, 
   "Jaxian", 
   "sorry, i didnt mean to get into a big debate over that, but i was just pointing out stuff that could happen.\n\n \n You can't be sorry for getting in a debate on a debate forum. That's why we're here!\n \n Regarding your disapproval of homosexual actions; I understand that you're saying that you disapprove of actions associated with being homosexual, not the homosexuals themselves. But I also understand why everyone finds it so degrading. To associate homosexual activity with rape, that is very insulting to people who engage in homosexual activity. Not everyone believes that homosexual activity is immoral. With rape, it's easy to see why people disapprove of it: it is harmful, and it abuses the rights of others. But homosexuality doesn't hurt anyone. There's no reason to believe it to be immoral.", 
   {}, 
   106841, 
   null, 
   1113428760.0
  ], 
  [
   106847, 
   null, 
   "Jaxian", 
   "Uh... The Netherlands was the first nation in the (modern) world to recognize same-sex marriage. Belgium joined them last year, as did most Canadian provinces. Denmark, I believe, has had some form of civil union or domestic partnership for many years, but it is not equal to marriage.\n\n \n Oh. You're probably right about this.", 
   {}, 
   106845, 
   null, 
   1113428940.0
  ], 
  [
   106848, 
   null, 
   "jyoshu", 
   "Yes, you are degrading gays, we do not have a lifestyle, we have lives and we happen to be gay. We have no more of a lifestyle than a heterosexual. We have different lifestyles varied by our circumstances. All in all we have a life, not a lifestyle. When you learn that part of this game, your words will sound less degrading to gays.\n\n \n Come on Joe, by now you must know that when people ask questions it doesn't mean they are \"degrading\" anyone. How can you expect any sort of dialogue on these issues if you say you are being degraded in the very asking of questions? This is in fact a forum and discussion is expected here--including questions. You know what people mean by the term \"lifestyle;\" you've been around the debate long enough to know that. It's not a slam, it's a way to refer to sexual and romantic activities among gay people.\n \n People should be able to talk about these matters in a forum without being accused of \"degrading\" someone in the very act of discussing it.", 
   {}, 
   106828, 
   null, 
   1113429060.0
  ], 
  [
   106850, 
   null, 
   "VTCruiser", 
   "being gay isn't an action, it is a state of being. Even if I sit in a corner and do nothing, I will still be gay. If I was single and I didn't have sexual \"actions\" for years, I would still be gay. Being gay isn't about what you do, it is about who you are.\n \n and yes, you are still degrading gays, even if you don't realize it, even though I am pointing it out how degrading what you are saying is.\n\n \n \n i could say as well that even if a sex offender keeps from his actions, hes still considered a sex offender so i dont see your point.", 
   {}, 
   106842, 
   null, 
   1113429540.0
  ], 
  [
   106852, 
   null, 
   "VTCruiser", 
   "You can't be sorry for getting in a debate on a debate forum. That's why we're here!\n \n Regarding your disapproval of homosexual actions; I understand that you're saying that you disapprove of actions associated with being homosexual, not the homosexuals themselves. But I also understand why everyone finds it so degrading. To associate homosexual activity with rape, that is very insulting to people who engage in homosexual activity. Not everyone believes that homosexual activity is immoral. With rape, it's easy to see why people disapprove of it: it is harmful, and it abuses the rights of others. But homosexuality doesn't hurt anyone. There's no reason to believe it to be immoral.\n\n \n \n i catch your drift. but im not meaning to degrade a homosexual to a sex offender, but i was merely just trying to give an example of what i meant or whatever.", 
   {}, 
   106846, 
   null, 
   1113429660.0
  ], 
  [
   106855, 
   null, 
   "joebrummer", 
   "i could say as well that even if a sex offender keeps from his actions, hes still considered a sex offender so i dont see your point.\n\n \n The difference is that a sex offender is about violence and being gay is about love and attraction. Either way, I find your posts offensive. Gays should not be compared to sex offenders, it is extremely offensive. They are no wheres near the same thing.", 
   {}, 
   106850, 
   null, 
   1113429840.0
  ], 
  [
   106856, 
   null, 
   "VTCruiser", 
   "The difference is that a sex offender is about violence and being gay is about love and attraction. Either way, I find your posts offensive. Gays should not be compared to sex offenders, it is extremely offensive. They are no wheres near the same thing.\n\n \n \n ill compare you to a heterosexual then... OH WAIT THATS DEGRADING! ha. but seriously\n \n i dont agree with the lifestyle's of many heterosexuals because their actions to me are very wrong. So in the same sense i think the actions of homosexuals are wrong as well. is that better?? sorry if i offended you.", 
   {}, 
   106855, 
   null, 
   1113430020.0
  ], 
  [
   106862, 
   null, 
   "jyoshu", 
   "I seriously doubt that most times \"sex offender\" or \"pedophile\" or other things are brought up in the context of homosexuality, that they are done so with the intent to insult or degrade gay people. The fact is, because homosexuality is such a moral issue with many people that there is sometimes simply no way to discuss it without bringing in analogies of other things that some also find to be moral issues. There is no way to have a serious discussion if one side is going to balk everytime they hear an analogy they don't like even when the analogy is used simply as a way to discuss the moral implications of the matter. Like it or not, many people in this country DO view homosexuality as a moral problem and refusing to argue analogies on the merits of the analogy for the current discussion's context just because one thinks something broader is being implied is not going to help in the least. One would think if gay rights people want to \"correct\" people's view of the morality of homosexuality, they would address the analogies rather than condemning them.", 
   {}, 
   106852, 
   null, 
   1113430440.0
  ], 
  [
   106866, 
   null, 
   "VTCruiser", 
   "I seriously doubt that most times \"sex offender\" or \"pedophile\" or other things are brought up in the context of homosexuality, that they are done so with the intent to insult or degrade gay people. The fact is, because homosexuality is such a moral issue with many people that there is sometimes simply no way to discuss it without bringing in analogies of other things that some also find to be moral issues. There is no way to have a serious discussion if one side is going to balk everytime they hear an analogy they don't like even when the analogy is used simply as a way to discuss the moral implications of the matter. Like it or not, many people in this country DO view homosexuality as a moral problem and refusing to argue analogies on the merits of the analogy for the current discussion's context just because one thinks something broader is being implied is not going to help in the least. One would think if gay rights people want to \"correct\" people's view of the morality of homosexuality, they would address the analogies rather than condemning them.\n\n \n yeah, i wasnt even one bit tryin to degrade anyone. Thanks for the clarity within your statement!", 
   {}, 
   106862, 
   null, 
   1113430620.0
  ], 
  [
   106867, 
   null, 
   "Jaxian", 
   "I had tried to address the analogy in my previous post, though maybe it didn't come across that way. I do think it is okay to condemn the analogy (though not the individual who used it) so long as you explain why the analogy is invalid.", 
   {}, 
   106862, 
   null, 
   1113430800.0
  ], 
  [
   106869, 
   null, 
   "BobNelson2", 
   "yeah, i wasnt even one bit tryin to degrade anyone. Thanks for the clarity within your statement!\n\n \n \n Well, just to prove it, from now on, just use \"analogies\" you think most folks would find complimentary.", 
   {}, 
   106866, 
   null, 
   1113430860.0
  ], 
  [
   106870, 
   null, 
   "Jaxian", 
   "Well, just to prove it, from now on, just use \"analogies\" you think most folks would find complimentary.\n\n \n Well, that would make it kind of hard to argue, though. I mean, I can't think of any good analogy for denying same-sex marriage. Denying same-sex marriage is like... flowers? no... candy? no again... Blast! My analogies always compare denying same-sex marriage to something bad, because I think denying same-sex marriage is very bad.", 
   {}, 
   106869, 
   null, 
   1113431040.0
  ], 
  [
   106871, 
   null, 
   "BobNelson2", 
   "I seriously doubt that most times \"sex offender\" or \"pedophile\" or other things are brought up in the context of homosexuality, that they are done so with the intent to insult or degrade gay people. \n\n \n No doubt, many, including you, actually see them as similar. But you can't explain how, so you resort to making the comparison and discussing the negatives aspects of the associated evil. Then, unable to demonstrate how homosexuality shares the characteristics that make the associated evil wrong, you refuse to address the inadequecy of YOUR analogy.\n \n As the Church Lady says... very conveeeeeeenient.\n \n \nOne would think if gay rights people want to \"correct\" people's view of the morality of homosexuality, they would address the analogies rather than condemning them.\n\n \n We do, over and over. \n \n Go ahead, pick an analogy. But this time, don't just drag it out. Point out the pertinent connection. Tell us exactly how it relates. Let's see if we can address it.", 
   {}, 
   106862, 
   null, 
   1113431340.0
  ], 
  [
   106872, 
   null, 
   "JustineCredible", 
   "Let's get something straight here. (pun intentional only in certain frames of mind)\n \n Marriage is an institution of the state, ie government. It is NOT an institution of the church. This is apparent when a couple asks their pastor/priest to marry them. What is the phrase used? \"By the power vested in me by the state of ______.\" (fill in the blank)\n \n I dare anyone who is married to go to their pastor/priest and ask them for a divorce. Once their pastor/priest stops laughing in their face they will be told to \"get a lawyer.\" Because marriage and it's disolvment are institutions of the STATE!!! \n \n Morality has NOTHING to do with it.\n \n The real problem is that people are confusing Marriages with Weddings. A marriage is a contractual state of being, a wedding is a cerimony. \n How a couple chooses to celebrate their wedding cerimony is a personal issue. They can choose to invite the church into their cerimony or not. Once we open the door for the church to decide what is to be legal or not is when we loose our liberty as Americans.", 
   {}, 
   106852, 
   null, 
   1113431580.0
  ], 
  [
   106878, 
   null, 
   "jyoshu", 
   "No doubt, many, including you, actually see them as similar.\n\n \n Only in terms of both being immoral, NOT in terms of degree. That's what I think you miss when you jump to conclusions about these analogies: no one is claiming gay people are sex offenders. When you jump to a red herring about some non-intended broader implication in an analogy, you broadside the discussion at hand and get off-topic everytime. (Maybe that's you intention.)", 
   {}, 
   106871, 
   null, 
   1113432000.0
  ], 
  [
   106885, 
   null, 
   "joebrummer", 
   "ill compare you to a heterosexual then... OH WAIT THATS DEGRADING! ha. but seriously\n \n i dont agree with the lifestyle's of many heterosexuals because their actions to me are very wrong. So in the same sense i think the actions of homosexuals are wrong as well. is that better?? sorry if i offended you.\n\n \n \n What actions are you directly referring to? Are you suggesting sex is the action? Maybe you would prefer all gay people remain celebant? Of course I find that ludicrus.\n \n \n As for jyoshu, Seuxality in itself is a moral issue gay or straight.", 
   {}, 
   106856, 
   null, 
   1113432540.0
  ], 
  [
   106886, 
   null, 
   "BobNelson2", 
   "Only in terms of both being immoral, NOT in terms of degree. \n\n \n So, just as I suspected, your analogies rest on nothing but your perception. Why don't you just compare homosexuality to something else you don't like. Say creamed peas, for instance. It would have as much bearing.\n \n \nThat's what I think you miss when you jump to conclusions about these analogies: no one is claiming gay people are sex offenders.\n \n \n Oh, really? Are you unaware that in large parts of this country we WERE sex offenders until last year? Are you unaware that the folks who lead the anti-same-sex marriage fight would like those laws reinstated?\n \n \nWhen you jump to a red herring about some non-intended broader implication in an analogy, you broadside the discussion at hand and get off-topic everytime. (Maybe that's you intention.)\n\n \n Then, don't give me the opportunity to derail your sincere discussion. Stick to homosexuality.", 
   {}, 
   106878, 
   null, 
   1113432540.0
  ], 
  [
   106888, 
   null, 
   "BobNelson2", 
   "Homosexuality is like shopping on Sunday.\n \n Homosexuality is like having a beer.\n \n Homosexuality is like divorce.\n \n \n There. Three examples of less offensive 'moral' comparisons.\n \n I've barely insulted myself at all.\n \n Give it a try.", 
   {}, 
   106886, 
   null, 
   1113432780.0
  ], 
  [
   106889, 
   null, 
   "tonybrown74", 
   "well to answer your question, i know for sure that i wouldve been marching with Martin Luther King Jr. just like i marched in January in the walk for life (led by a black man himself). ALL PEOPLE are created equal. I'm not degrading gays to lesser of a person than me, im just degrading their lifestyle. They are people just like me though.\n\n \n \n That is such a dishonest answer.\n \n As if your mindset regarding blacks or gays would not have been determined by what the \"majority\" thinks. You do not know that any more than I would.", 
   {}, 
   106788, 
   null, 
   1113432780.0
  ], 
  [
   106891, 
   null, 
   "jyoshu", 
   "So, just as I suspected, your analogies rest on nothing but your perception. Why don't you just compare homosexuality to something else you don't like. Say creamed peas, for instance. It would have as much bearing.\n\n \n There's no large contingent of people in this country who view creamed peas as immoral, as there is homosexual behavior. It don't fit.\n \n \nThen, don't give me the opportunity to derail your sincere discussion. Stick to homosexuality.\n\n \n I'll keep using whatever analogies I feel are best when \"sticking\" to homosexuality, thank you. Whether or not you jump to conclusions on them and assume something is intended that's not is up to you.", 
   {}, 
   106886, 
   null, 
   1113432960.0
  ], 
  [
   106892, 
   null, 
   "JustineCredible", 
   "Well, its not just morally wrong in America, but its morally wrong in the middle east as well. And i think that if we continue our way downward morally as a nation, it would give terrorists even more hate for america because we are supposedly a \"christian nation\" and dont live morally.\n \n anyways.\n\n \n \n Hate to remind you, or inform you...which ever, but this country is NOT a \"Christian nation.\" It was never founded as such nor intended as such. The ONLY thing that points to us being even close to being a supposedly \"christian nation\" is the fact that christians make up a larger number in the religion debate. But our laws are NOT solely \"christian\" nor do we have any type of state religion. Or did you forget about that little thing known as \"Freedom of religion?\"", 
   {}, 
   106746, 
   null, 
   1113433200.0
  ], 
  [
   106898, 
   null, 
   "BobNelson2", 
   "There's no large contingent of people in this country who view creamed peas as immoral, as there is homosexual behavior. It don't fit.\n\n \n So your choice of analogies isn't based on true applicability but on the level of universal revulsion you can glomb onto.\n \n Well, knock me over with a feather...", 
   {}, 
   106891, 
   null, 
   1113433980.0
  ], 
  [
   106909, 
   null, 
   "VTCruiser", 
   "That is such a dishonest answer.\n \n As if your mindset regarding blacks or gays would not have been determined by what the \"majority\" thinks. You do not know that any more than I would.\n\n \n \n you cant sit there and tell me that was a dishonest answer. good grief, who are you to say that?", 
   {}, 
   106889, 
   null, 
   1113436500.0
  ], 
  [
   106910, 
   null, 
   "VTCruiser", 
   "Hate to remind you, or inform you...which ever, but this country is NOT a \"Christian nation.\" It was never founded as such nor intended as such. The ONLY thing that points to us being even close to being a supposedly \"christian nation\" is the fact that christians make up a larger number in the religion debate. But our laws are NOT solely \"christian\" nor do we have any type of state religion. Or did you forget about that little thing known as \"Freedom of religion?\"\n\n \n duh, but our founders based a lot of laws from the Bible.", 
   {}, 
   106892, 
   null, 
   1113436500.0
  ], 
  [
   106915, 
   null, 
   "JustineCredible", 
   "duh, but our founders based a lot of laws from the Bible.\n\n \n \n Oh get off it, those things aren't exclusive to the Bible and you know it.", 
   {}, 
   106910, 
   null, 
   1113437040.0
  ], 
  [
   106921, 
   null, 
   "Jaxian", 
   "duh, but our founders based a lot of laws from the Bible.\n\n \n Actually, I'm rather certain that our founders did not base even a single law on the Bible.", 
   {}, 
   106910, 
   null, 
   1113439260.0
  ], 
  [
   106935, 
   null, 
   "Duo_Maxwell", 
   "Doesnt the majority in America matter anymore?? The majority of americans dont want Gay marriage... Its obvious because not one state that has let the people actually vote on this issue has legallized it. So i ask this question... Is it truly demoralizing to deny gays to marry? ha. yeah right, its actually the most moral thing we can do on this one issue. And i speak on behalf of the majority of America.... some 80% or greater..\n\n \n Let's assume such a asseration is correct. That if the majority wants something, that it is free to make any such laws, even if the strip specific individuals of any and all rights. \n \n Under your logic, you must therefore support any action by the majority that wants to tar, feather and quater any user who goes by the name of VTcruiser\n \n Well, do you? \n \n This my friends is another example of how the antis have nothing but lies, fallacies and majority oppression", 
   {}, 
   106681, 
   null, 
   1113442680.0
  ], 
  [
   106941, 
   null, 
   "VTCruiser", 
   "Let's assume such a asseration is correct. That if the majority wants something, that it is free to make any such laws, even if the strip specific individuals of any and all rights. \n \n Under your logic, you must therefore support any action by the majority that wants to tar, feather and quater any user who goes by the name of VTcruiser\n [/b]\n\n \n Well, that is obsurd and you know it yourself.. If you are going to make arguments, at least make ones that matter.", 
   {}, 
   106935, 
   null, 
   1113443460.0
  ], 
  [
   106950, 
   null, 
   "Duo_Maxwell", 
   "Well, that is obsurd and you know it yourself.. If you are going to make arguments, at least make ones that matter.\n\n \n Answer the question. It is just as absurd as your argument; that was the point.\n \n if the majority believes something, then under your argument, we should do it. The problem with the rule by majority is that anything can occur. We can strip specific minorities of all rights. We can kill people like you for stupid reasons. That is perceisely why your argument is completely ridiculous.\n \n Merely because the majority wants something (or not want) does not mean we act upon it. \n \n Hence, why we would NOT tar, feather and quater you if the mob said to.", 
   {}, 
   106941, 
   null, 
   1113444720.0
  ], 
  [
   106965, 
   null, 
   "joebrummer", 
   "Well, that is obsurd and you know it yourself.. If you are going to make arguments, at least make ones that matter.\n\n \n \n Why, you haven't", 
   {}, 
   106941, 
   null, 
   1113448080.0
  ], 
  [
   106973, 
   null, 
   "VTCruiser", 
   "Answer the question. It is just as absurd as your argument; that was the point.\n \n if the majority believes something, then under your argument, we should do it. The problem with the rule by majority is that anything can occur. We can strip specific minorities of all rights. We can kill people like you for stupid reasons. That is perceisely why your argument is completely ridiculous.\n \n Merely because the majority wants something (or not want) does not mean we act upon it. \n \n Hence, why we would NOT tar, feather and quater you if the mob said to.\n\n \n Sometimes the majority can get it wrong.. Hence, slavery in the early stages of our nation... but, on this issue, i think the majority has it right.. I dont see the gay rights movement in any comparison to the abolition movement!", 
   {}, 
   106950, 
   null, 
   1113448980.0
  ], 
  [
   106982, 
   null, 
   "joebrummer", 
   "Sometimes the majority can get it wrong.. Hence, slavery in the early stages of our nation... but, on this issue, i think the majority has it right.. I dont see the gay rights movement in any comparison to the abolition movement!\n\n \n \n That is what you think, as you have said, but I thin you are wrong. Gay rights are about people who are misunderstood, taken for granted, and denied thier due rights. huum where has this happen before?", 
   {}, 
   106973, 
   null, 
   1113449820.0
  ], 
  [
   106987, 
   null, 
   "VTCruiser", 
   "That is what you think, as you have said, but I thin you are wrong. Gay rights are about people who are misunderstood, taken for granted, and denied thier due rights. huum where has this happen before?\n\n \n taken for granted?? what special thing do gays have to offer our society?", 
   {}, 
   106982, 
   null, 
   1113450300.0
  ], 
  [
   106997, 
   null, 
   "Duo_Maxwell", 
   "Sometimes the majority can get it wrong.. Hence, slavery in the early stages of our nation... but, on this issue, i think the majority has it right.. I dont see the gay rights movement in any comparison to the abolition movement!\n\n \n The majority has been wrong litterally millions of time throughout history. \n \n If the majority decided to do something that deined people rights, is that just and correct? \n \n But many, including the wife of Martin Luther King Jr see the gay rights movement similar to the civil rights movement.", 
   {}, 
   106973, 
   null, 
   1113451980.0
  ], 
  [
   107009, 
   null, 
   "VTCruiser", 
   "The majority has been wrong litterally millions of time throughout history. \n \n If the majority decided to do something that deined people rights, is that just and correct? \n \n But many, including the wife of Martin Luther King Jr see the gay rights movement similar to the civil rights movement.\n\n \n so why dont you stand up for the unborn?? seems like they are denied the most rights in this country... And they have the majority to face... (well, not the majority anymore since the last election said that the majority wants to end abortion)\n \n if martin luther king jr.'s wife really believed in civil rights, she would stand up for the black children in the womb.", 
   {}, 
   106997, 
   null, 
   1113452940.0
  ], 
  [
   107017, 
   null, 
   "Duo_Maxwell", 
   "so why dont you stand up for the unborn?? seems like they are denied the most rights in this country... And they have the majority to face... (well, not the majority anymore since the last election said that the majority wants to end abortion)\n\n \n For a number of reasons. First of all, the unborn are not productive citizens. Second, the unborn are not granted rights. Third, the unborn, especially those aborted, would be a financial strain upon this country, and this world. Fourth, the aborted, if forced to be born, would likely be born into a parentage that did not want them. Fifth, we already have a large amount of children in foster homes and many waiting to be adopted. Sixth, our facilities for caring for thise children as a nation is not up to par with other countries. Seventh, for pure labor reasons, it is cheaper to have immigrants immigrant and save us the billions in education, housing, and other such until age 18. \n \n \n\n if martin luther king jr.'s wife really believed in civil rights, she would stand up for the black children in the womb.\n\n \n You make a asseration you cannot prove. \n \n Besides, you are clearly changing the subject to avoid discussing something you are losing.", 
   {}, 
   107009, 
   null, 
   1113453360.0
  ], 
  [
   107020, 
   null, 
   "VTCruiser", 
   "For a number of reasons. First of all, the unborn are not productive citizens. Second, the unborn are not granted rights. Third, the unborn, especially those aborted, would be a financial strain upon this country, and this world. Fourth, the aborted, if forced to be born, would likely be born into a parentage that did not want them. Fifth, we already have a large amount of children in foster homes and many waiting to be adopted. Sixth, our facilities for caring for thise children as a nation is not up to par with other countries. Seventh, for pure labor reasons, it is cheaper to have immigrants immigrant and save us the billions in education, housing, and other such until age 18. \n \n \n \n You make a asseration you cannot prove. \n \n Besides, you are clearly changing the subject to avoid discussing something you are losing.\n\n \n not changin the subject at all, im just simply relating the right of the majority to the affliction of the minority which you think that people against gay marriage are doing, and which i think people who support abortion are doing.\n \n i think that you just contradicted yourself with your statement because if you really stood up for the minority, you would stand up for the unborn..", 
   {}, 
   107017, 
   null, 
   1113453660.0
  ], 
  [
   107026, 
   null, 
   "chloe", 
   "The majority has been wrong litterally millions of time throughout history. \n \n\n \n What is this \"wrong\" you speak of duo? are you acknowledging the existance of some sort of universal absolute moral ethic? Very interesting.", 
   {}, 
   107017, 
   null, 
   1113454920.0
  ], 
  [
   107041, 
   null, 
   "Duo_Maxwell", 
   "What is this \"wrong\" you speak of duo? are you acknowledging the existance of some sort of universal absolute moral ethic? Very interesting.\n\n \n No. Pure pragamatic and economical reasons. you can't argue with the math. You, like Cone and Steeve need to learn not to assume. I already learned not to assume my opponent is informed. You need to not assume such things as well. \n \n \nnot changin the subject at all, im just simply relating the right of the majority to the affliction of the minority which you think that people against gay marriage are doing, and which i think people who support abortion are doing.\n\n \n That's a stretch. First of all, gays are legally citizens with rights. Unborn childrne are not. Let's get that out of the way. A unborn fetus/whatever has no consitutional rights. A gay person does. \n \n \n\n i think that you just contradicted yourself with your statement because if you really stood up for the minority, you would stand up for the unborn..\n\n \n How so? The unborn are not a minority. A minority is classifed as \"the smaller in number of two groups constituting a whole; specifically : a group having less than the number of votes necessary for control.\" Please, do not change the defintion of words when it suits you.", 
   {}, 
   107026, 
   null, 
   1113457440.0
  ], 
  [
   107051, 
   null, 
   "Cone", 
   "This my friends is another example of how the antis have nothing but lies, fallacies and majority oppression\n\n What a broad reaching generalization you have made. Since you are in the habit of naming logical fallacies, you should like this...You are committing the fallacy of hasty generalization as well as the fallacy of using an unrepresentative sample. This is very disturbing for one who seems to have a handle on his logical fallacies. But kudos must be given out to you as you have managed to commit two fallacies in one sentence.", 
   {}, 
   106935, 
   null, 
   1113459300.0
  ], 
  [
   107052, 
   null, 
   "chloe", 
   "What a broad reaching generalization you have made. Since you are in the habit of naming logical fallacies, you should like this...You are committing the fallacy of hasty generalization as well as the fallacy of using an unrepresentative sample. This is very disturbing for one who seems to have a handle on his logical fallacies. But kudos must be given out to you as you have managed to commit two fallacies in one sentence.\n\n \n not that there is anything \"wrong\" with that of course", 
   {}, 
   107051, 
   null, 
   1113459720.0
  ], 
  [
   107060, 
   null, 
   "Duo_Maxwell", 
   "What a broad reaching generalization you have made. Since you are in the habit of naming logical fallacies, you should like this...You are committing the fallacy of hasty generalization as well as the fallacy of using an unrepresentative sample.\n\n \n I suggest you learn that fallacy before claiming others of usage. the fallacies would work if I classified this one person and one event as the whole. However, I did not. I merely said it was a example of such behavior. If you will put the effort into it, you will notice a long list of cited fallacies in the posts of Jshiou, Jaaaman, Mai'ana and others. Also, if you take the time to look, you will notice articles specifically aganist gay marriage that have been dissected and proven to be full of fallacies, lies and majority oppression. \n \n \nThis is very disturbing for one who seems to have a handle on his logical fallacies. But kudos must be given out to you as you have managed to commit two fallacies in one sentence.\n\n \n I have found that the majority of people who claim others use fallacies haven't the faintess clue about how they work. As I have shown, your accusation fails on several grounds. I suggest you try again. Many have tried this tactic you attempt, many have failed.", 
   {}, 
   107051, 
   null, 
   1113461460.0
  ], 
  [
   107092, 
   null, 
   "JustineCredible", 
   "so why dont you stand up for the unborn?? seems like they are denied the most rights in this country... And they have the majority to face... (well, not the majority anymore since the last election said that the majority wants to end abortion)\n \n if martin luther king jr.'s wife really believed in civil rights, she would stand up for the black children in the womb.\n\n \n \n And you complain about others not sticking to the subject at hand? \n \n This IS the Gay Rights forum, if you want to discuss/debate abortion or whatever...go there. \n \n Also, your tactic to change subjects just isn't working. It's a weak attempt to use WMD's. (Weapons of Mass Distraction)", 
   {}, 
   107009, 
   null, 
   1113467340.0
  ], 
  [
   107093, 
   null, 
   "JustineCredible", 
   "not changin the subject at all, im just simply relating the right of the majority to the affliction of the minority which you think that people against gay marriage are doing, and which i think people who support abortion are doing.\n \n i think that you just contradicted yourself with your statement because if you really stood up for the minority, you would stand up for the unborn..\n\n \n You truly are someone unclear on the concept here. Again, just so you didn't miss it the first few times it was pointed out to you...THIS IS THE GAY RIGHTS FORUM! If you want to discuss/debate abortion, go to that forum! \n \n It's really quite simple.", 
   {}, 
   107020, 
   null, 
   1113467460.0
  ], 
  [
   107095, 
   null, 
   "JustineCredible", 
   "What a broad reaching generalization you have made. Since you are in the habit of naming logical fallacies, you should like this...You are committing the fallacy of hasty generalization as well as the fallacy of using an unrepresentative sample. This is very disturbing for one who seems to have a handle on his logical fallacies. But kudos must be given out to you as you have managed to commit two fallacies in one sentence.\n\n \n \n Actually no, Duo has not. If you had ever bothered to read any previous posts by Duo in THIS forum you would ALREADY know he explained this assertation multiple times. \n You are once again making assumptions.", 
   {}, 
   107051, 
   null, 
   1113467640.0
  ], 
  [
   107098, 
   null, 
   "Duo_Maxwell", 
   "Actually no, Duo has not. If you had ever bothered to read any previous posts by Duo in THIS forum you would ALREADY know he explained this assertation multiple times. \n You are once again making assumptions.\n\n \n thank you. \n \n *showers JustineCredible with high denomination bills, roses and gifts*", 
   {}, 
   107095, 
   null, 
   1113468180.0
  ], 
  [
   107119, 
   null, 
   "VTCruiser", 
   "You truly are someone unclear on the concept here. Again, just so you didn't miss it the first few times it was pointed out to you...THIS IS THE GAY RIGHTS FORUM! If you want to discuss/debate abortion, go to that forum! \n \n It's really quite simple.\n\n \n \n how is my argument not valid to you?? the guy is contradicting himself. He saying he stands up for the opressed, and the afflicted.. .but in all reality he doesnt!", 
   {}, 
   107093, 
   null, 
   1113483900.0
  ], 
  [
   107137, 
   null, 
   "joebrummer", 
   "taken for granted?? what special thing do gays have to offer our society?\n\n Don't get out much do ya? Elton, Will and Grace, Queen, Shakespere, should I go on", 
   {}, 
   106987, 
   null, 
   1113490080.0
  ], 
  [
   107138, 
   null, 
   "VTCruiser", 
   "Don't get out much do ya? Elton, Will and Grace, Queen, Shakespere, should I go on\n\n \n tell me what gays have to offer that no other human can...YOU CANT! BECAUSE EVERYONE IS THE SAME! no one is more special than the other.", 
   {}, 
   107137, 
   null, 
   1113490140.0
  ], 
  [
   107142, 
   null, 
   "joebrummer", 
   "tell me what gays have to offer that no other human can...YOU CANT! BECAUSE EVERYONE IS THE SAME! no one is more special than the other.\n\n I never said differently, I never said gays were more special. Show me where I said that.", 
   {}, 
   107138, 
   null, 
   1113490380.0
  ], 
  [
   107143, 
   null, 
   "VTCruiser", 
   " Gay rights are about people who are misunderstood, taken for granted\n\n \n Taken for granted means, you have something to offer that no one else has.", 
   {}, 
   106982, 
   null, 
   1113490440.0
  ], 
  [
   107146, 
   null, 
   "joebrummer", 
   "Taken for granted means, you have something to offer that no one else has.\n\n No, it doesn't. You must not have a grip on English. It means that you are not appreicated for what you do offer.", 
   {}, 
   107143, 
   null, 
   1113490560.0
  ], 
  [
   107148, 
   null, 
   "VTCruiser", 
   "No, it doesn't. You must not have a grip on English. It means that you are not appreicated for what you do offer.\n\n \n \n THATS MY POINT! WHAT DO YOU OFFER THAT NO ONE ELSE DOES? Gays are just as human as anyone else.", 
   {}, 
   107146, 
   null, 
   1113490620.0
  ], 
  [
   107152, 
   null, 
   "joebrummer", 
   "THATS MY POINT! WHAT DO YOU OFFER THAT NO ONE ELSE DOES? Gays are just as human as anyone else.\n\n What does that matter?", 
   {}, 
   107148, 
   null, 
   1113490800.0
  ], 
  [
   107156, 
   null, 
   "VTCruiser", 
   "What does that matter?\n\n \n why do you think you deserve some special right then?? its not like you are being oppressed. Everyone views you as a human and respects you for who you are.", 
   {}, 
   107152, 
   null, 
   1113491100.0
  ], 
  [
   107163, 
   null, 
   "joebrummer", 
   "why do you think you deserve some special right then?? its not like you are being oppressed. Everyone views you as a human and respects you for who you are.\n\n \n I am not looking for special rights, I am looking for existing rights not currently extended to my partner and myself. Why is that \"special\" it is only special if the rights we received were not given to others, but they are. So this is not about special rights, it is about civil rights. \n \n No offense, but you really don't seem to know much about gays at all.", 
   {}, 
   107156, 
   null, 
   1113491580.0
  ], 
  [
   107165, 
   null, 
   "VTCruiser", 
   "I am not looking for special rights, I am looking for existing rights not currently extended to my partner and myself. Why is that \"special\" it is only special if the rights we received were not given to others, but they are. So this is not about special rights, it is about civil rights. \n \n No offense, but you really don't seem to know much about gays at all.\n\n \n well then according to you, the right to have 15 wives is there but im being denied it. GOOD GRIEF! this is rediculous", 
   {}, 
   107163, 
   null, 
   1113491640.0
  ], 
  [
   107167, 
   null, 
   "wsm2506", 
   "duh, but our founders based a lot of laws from the Bible.\n\n \n I have posted this before, but will do so again for your edification:\n \n \n Treaty of Triploi:\n \n \n Art. 11. As the Government of the United States of America is not, in any sense, founded on the Christian religion; as it has in itself no character of enmity against the laws, religion, or tranquillity, of Mussulmen; and, as the said States never entered into any war, or act of hostility against any Mahometan nation, it is declared by the parties, that no pretext arising from religious opinions, shall ever produce an interruption of the harmony existing between the two countries.\n\n \n \nAuthored by American diplomat Joel Barlow in 1796, the following treaty was sent to the floor of the Senate, June 7, 1797, where it was read aloud in its entirety and unanimously approved. John Adams, haven seen the treaty, signed it and proudly proclaimed it to the Nation.\n\n \n Now do you get the idea?", 
   {}, 
   106910, 
   null, 
   1113491640.0
  ], 
  [
   107169, 
   null, 
   "VTCruiser", 
   "I have posted this before, but will do so again for your edification:\n\n \n The real purpose of that was so that we would not become like england and be a theocracy. But you cant deny that a lot of our laws are based out of the Bible.. The 10 commandments sit right there inside our supreme court... i guess that they didnt think christianity was all that important to our government", 
   {}, 
   107167, 
   null, 
   1113491880.0
  ], 
  [
   107172, 
   null, 
   "wsm2506", 
   "The real purpose of that was so that we would not become like england and be a theocracy. But you cant deny that a lot of our laws are based out of the Bible.. The 10 commandments sit right there inside our supreme court... i guess that they didnt think christianity was all that important to our government\n\n \n \"The 10 commandments sit right there inside our supreme court..\"\n \n Duh?? While at the same time the Supreme Court has ruled that they cannot be displayed in other courts? emoticon_frazzled \n \n Besides, I don't think homosexuality or same-sex marriage are mentioned anywhere in the 10 commandments.", 
   {}, 
   107169, 
   null, 
   1113492120.0
  ], 
  [
   107175, 
   null, 
   "joebrummer", 
   "These are not special rights.\n \n \n Protecting LGBT Families\n Same-sex couples are denied over 1,000 benefits, rights, and protections that federal law affords to married, heterosexual couples, as well as hundreds of such protections at the state level.\n \n \n Marriage\n The national debate about whether or not same-sex couples should be allowed to receive a marriage license has elevated after Ontario and British Columbia legalized same-sex marriage and the Supreme Court declared sodomy laws unconstitutional.\n \n \n Workplace Discrimination\n Gay, lesbian, and bisexual employees can be fired on the basis of their sexual orientation in 34 states. Transgender employees can be fired on the basis of their gender identity and expression in 44 states.\n \n Immigration\n Current U.S. immigration law does not allow lesbian and gay citizens or permanent residents to petition for their same-sex partners to immigrate.\n \n \n Privacy Issues\n On June 26, 2003, the U.S. Supreme Court handed down its decision in Lawrence v. Texas. The Court overturned Texas' sodomy law as a violation of privacy rights under the due process clause of the 14th Amendment.\n \n Health\n HRC's health work has historically been focused on issues surrounding the HIV/AIDS pandemic, but has broadened to encompass a wide variety of health issues, such as lesbian health, that impact upon the LGBT community.\n \n Hate Crimes\n Anti-gay hate crimes are underreported, increasing, and state laws are inadequate. The federal hate crimes bill does not include hate crimes based on sexual orientation, gender or disability.\n \n Military\n Under the U.S. military's \"don't ask, don't tell, don't pursue, don't harass\" policy, gay, lesbian and bisexual service members are prohibited from serving openly. Current military regulations also medically disqualify transsexual men and women from service.\n \n Judicial Nominations\n HRC monitors judicial nominations that could place courts outside the mainstream, which would make it increasingly difficult for GLBT Americans to achieve basic justice and equality through the federal courts.\n \n with regard to marriage\n \n The right to make decisions on a partner's behalf in a medical emergency. Specifically, the states generally provide that spouses automatically assume this right in an emergency. If an individual is unmarried, the legal \"next of kin\" automatically assumes this right. This means, for example, that a gay man with a life partner of many years may be forced to accept the financial and medical decisions of a sibling or parent with whom he may have a distant or even hostile relationship. \n The right to take up to 12 weeks of leave from work to care for a seriously ill partner or parent of a partner. The Family and Medical Leave Act of 1993 permits individuals to take such leave to care for ill spouses, children and parents but not a partner or a partner's parents. \n The right to petition for same-sex partners to immigrate. \n The right to assume parenting rights and responsibilities when children are brought into a family through birth, adoption, surrogacy or other means. For example, in most states, there is no law providing a noncustodial, nonbiological or nonadoptive parent's right to visit a child - or responsibility to provide financial support for that child - in the event of a breakup. \n The right to share equitably all jointly held property and debt in the event of a breakup, since there are no laws that cover the dissolution of domestic partnerships. \n Family-related Social security benefits, income and estate tax benefits, disability benefits, family-related military and veterans benefits and other important benefits. \n The right to inherit property from a partner in the absence of a will. \n The right to purchase continued health coverage for a domestic partner after the loss of a job.\n \n NOT SPECIAL RIGHTS,BUT CIVIL RIGHTS\n http://www.hrc.org/", 
   {}, 
   107167, 
   null, 
   1113492240.0
  ], 
  [
   107177, 
   null, 
   "VTCruiser", 
   "These are not special rights.\n\n \n in response to all that, i think i wanna point out the 15 wives thing again. It seems to me that if some mormon in utah wants to move to the east coast, and bring his wife and 5 \"other wives\" and 35 children with him, he and his family would be looked down upon.\n \n I really dont see how gays are treated worse than anyone else. EVERYONE GETS MADE FUN OF IN LIFE!!!!!!!!!! And everyone, anywhere in the world, has to go through poo. Id say that your \"struggles\" are nowhere in comparison to the struggles of the pro-democratic government supporters in china trying to get rid of communism..", 
   {}, 
   107175, 
   null, 
   1113492540.0
  ], 
  [
   107180, 
   null, 
   "wsm2506", 
   "tell me what gays have to offer that no other human can...YOU CANT! BECAUSE EVERYONE IS THE SAME! no one is more special than the other.\n\n \n That is exactly the point to be argued. Those against same-sex marriage argue to maintain their \"special\" status and rights while denying it to others.", 
   {}, 
   107138, 
   null, 
   1113492660.0
  ], 
  [
   107181, 
   null, 
   "jyoshu", 
   "One can only come to one of two conclusions with the fact that there are obvious similarities in the themes of the Bible and the ideologies of our govt. (freedom, life, liberty, pursuit of happiness, laws that are parallel such as those against theft, murder, etc.)\n \n a.) Either they came about due to the religous influences on our founders (obviously many of them were religious to varying degrees), or \n \n b.) It's purely a coincidence.\n \n It is naive and shortsighted to think that religious men would not be influenced by religious ideals in their work to create a nation by the people and for the people. To think that the founders somehow divorced themselves from their religious influences for a bit in order to draft the same ideological laws and principles to ensure they were as secular as possible is to not only deny the power of ideology, but to insult the founders themselves by implying their beliefs should have been \"locked in the closet\" as our nation formed.\n \n The truth is, it is much more likely that religion DID play a role in the founding of our govt., simply because many of the founders had religious beliefs, the principles of our govt. are in many case parallel to Christian ones, and we can't deny that a person's beliefs have a way of playing out in everyday life. One has to ask, how could it NOT have been an influence?", 
   {}, 
   107167, 
   null, 
   1113492840.0
  ], 
  [
   107182, 
   null, 
   "VTCruiser", 
   "That is exactly the point to be argued. Those against same-sex marriage argue to maintain their \"special\" status and rights while denying it to others.\n\n \n So if gay marriage isnt a special right, then how come it hasnt always been?? how come all of a sudden people think their rights are being violated?? why wasnt this universal in the first place??", 
   {}, 
   107180, 
   null, 
   1113492900.0
  ], 
  [
   107184, 
   null, 
   "wsm2506", 
   "So if gay marriage isnt a special right, then how come it hasnt always been?? how come all of a sudden people think their rights are being violated?? why wasnt this universal in the first place??\n\n \n In my reading of the constitution, it always HAS been a right.", 
   {}, 
   107182, 
   null, 
   1113493140.0
  ], 
  [
   107185, 
   null, 
   "VTCruiser", 
   "In my reading of the constitution, it always HAS been a right.\n\n \n lol, i guess in the constitution its says \"Gays can marry, People may have 15 wives even, ok how about we just let people marry animals!\"\n \n cmon man, thats rediculous to say that you read it in the constitution.", 
   {}, 
   107184, 
   null, 
   1113493320.0
  ], 
  [
   107186, 
   null, 
   "VTCruiser", 
   "and by the way, our rights dont come from the government, but from the creator (according to the declaration of independence). I dont think God would create a right for homosexuals to marry... That would be contradicting Himself.", 
   {}, 
   107185, 
   null, 
   1113493380.0
  ], 
  [
   107190, 
   null, 
   "wsm2506", 
   "lol, i guess in the constitution its says \"Gays can marry, People may have 15 wives even, ok how about we just let people marry animals!\"\n \n cmon man, thats rediculous to say that you read it in the constitution.\n\n \n Quite the contrary. The constitution says nothing about any marriage whatsoever.\n \n However, the Bill of Rights does state that any right not specifically reserved to the federal government by the constitution is granted to the states or to the people.\n \n Loving vs. Virginia  establishes marriage as a basic human right.\n \n Why do you think some are so hot on a constitutional ammendment to specifically bar it?\n \n This constitutional argument has been disscussed and debated on this forum before to great lenght.", 
   {}, 
   107185, 
   null, 
   1113493920.0
  ], 
  [
   107191, 
   null, 
   "VTCruiser", 
   "Loving vs. Virginia  establishes marriage as a basic human right.\n \n Why do you think some are so hot on a constitutional ammendment to specifically bar it?.\n\n \n Well, in all things, you gotta draw the line somewhere right?", 
   {}, 
   107190, 
   null, 
   1113494040.0
  ], 
  [
   107193, 
   null, 
   "jyoshu", 
   "Quite the contrary. The constitution says nothing about any marriage whatsoever.\n \n However, the Bill of Rights does state that any right not specifically reserved to the federal government by the constitution is granted to the states or to the people.\n\n \n Unless it's illegal. And as VT pointed out, by your interpretation, 15 wives or husbands should be completely allowed by the govt.\n \n \nLoving vs. Virginia  establishes marriage as a basic human right.\n\n \n But it doesn't mean you can call any arrangement you want a \"marriage.\" Obviously the parties in Loving vs. Virginia were thinking of marriage in terms of it's most fundamental aspect: that it's between a man and woman. The only thing the Loving case did was say that marriage (a man and woman of course) is a human right, but of course it is: that is why men and women marry each other. Marriage is a straight thing. (It's real purpose was to say that a man and woman of different races could marry, BTW).", 
   {}, 
   107190, 
   null, 
   1113494400.0
  ], 
  [
   107196, 
   null, 
   "wsm2506", 
   "Unless it's illegal. And as VT pointed out, by your interpretation, 15 wives or husbands should be completely allowed by the govt.\n\n \n I did not say anything about 15 spouses. It is you and he that are attempting that analogy. However, there is nothing in the constitution that would bar it.\n \n \"Illegality\"? \n \n \n \n \nBut it doesn't mean you can call any arrangement you want a \"marriage.\" Obviously the parties in Loving vs. Virginia were thinking of marriage in terms of it's most fundamental aspect: that it's between a man and woman. The only thing the Loving case did was say that marriage (a man and woman of course) is a human right, but of course it is: that is why men and women marry each other. Marriage is a straight thing. (It's real purpose was to say that a man and woman of different races could marry, BTW).\n\n \n Please point out the wording in Loving vs. Virginia  ruling that leads you to the \"OBVIOUS\"  conslusion that it applies only to opposite sex marriage. (Hint: It doesn't.)", 
   {}, 
   107193, 
   null, 
   1113495420.0
  ], 
  [
   107200, 
   null, 
   "VTCruiser", 
   "Please point out the wording in Loving vs. Virginia  ruling that leads you to the \"OBVIOUS\"  conslusion that it applies only to opposite sex marriage. (Hint: It doesn't.)\n\n \n Please point out to me where it says both gays and straight people can marry whoever. \n \n Isnt a law created to keep the nation moral?? I wouldve thought that the ruling would lead towards that since back then gay marriage wasnt even an issue to think about because people knew it was wrong.", 
   {}, 
   107196, 
   null, 
   1113495600.0
  ], 
  [
   107201, 
   null, 
   "wsm2506", 
   "Please point out to me where it says both gays and straight people can marry whoever.\n\n \n Read the Bill of Rights. It doesn't have to specifically spell it out. But it does say, if it is not specifically spelled out, it is a right of the people. It doesn't say heterosexually people ONLY.", 
   {}, 
   107200, 
   null, 
   1113495900.0
  ], 
  [
   107202, 
   null, 
   "jyoshu", 
   "However, there is nothing in the constitution that would bar it (polygamy).\n\n \n See, that's the problem. With your interpretation of marriage by the constitution, anyone can say that any possible arrangement is a marriage and demand govt. benefits for it. \n \n \nPlease point out the wording in Loving vs. Virginia  ruling that leads you to the \"OBVIOUS\"  conslusion that it applies only to opposite sex marriage. (Hint: It doesn't.)\n\n \n The purpose of Loving wasn't to define marriage: that what DOMA is for (actually, DOMA only puts in writing what most people understand marriage to be anyway). As far as if the parties in Loving approached marriage from an opposite-sex standpoin, why wouldn't they have???? That's what it's been about for most of American history, and certainly at the time of Loving. The idea that marriage is about other things is a more recent phenomenon.", 
   {}, 
   107196, 
   null, 
   1113495960.0
  ], 
  [
   107205, 
   null, 
   "VTCruiser", 
   "Read the Bill of Rights. It doesn't have to specifically spell it out. But it does say, if it is not specifically spelled out, it is a right of the people. It doesn't say heterosexually people ONLY.\n\n \n i guess it doesnt say gays and heterosexualls only either, i could marry the moon if i believed this philosophy.", 
   {}, 
   107201, 
   null, 
   1113496260.0
  ], 
  [
   107207, 
   null, 
   "wsm2506", 
   "i guess it doesnt say gays and heterosexualls only either, i could marry the moon if i believed this philosophy.\n\n \n Go right ahead if you wish. It does me no harm. emoticon_xangel", 
   {}, 
   107205, 
   null, 
   1113496440.0
  ], 
  [
   107210, 
   null, 
   "joebrummer", 
   "Unless it's illegal. And as VT pointed out, by your interpretation, 15 wives or husbands should be completely allowed by the govt.\n \n \n No, I don't see that at all. That is against the law. Gay marriage isn't recognized, but it is not illegal. Pologamy is illegal.\n \n \n \n\n But it doesn't mean you can call any arrangement you want a \"marriage.\" Obviously the parties in Loving vs. Virginia were thinking of marriage in terms of it's most fundamental aspect: that it's between a man and woman. The only thing the Loving case did was say that marriage (a man and woman of course) is a human right, but of course it is: that is why men and women marry each other. Marriage is a straight thing. (It's real purpose was to say that a man and woman of different races could marry, BTW).\n\n \n \n You are speculating about what they thought marriage meant. Reality is, no one knows what they thought it meant. EIther way, the ruling did establish that marriage is a basic human right.\n \n To say marriage is a straight thing shows the whole problem. It is a straight thing and that means that some couples have and some don't. The 14th ammendment say that everyone should have equal protection under the law, If marriage is a staight thing, then everyone isn't getting equal protection.", 
   {}, 
   107193, 
   null, 
   1113496680.0
  ], 
  [
   107212, 
   null, 
   "joebrummer", 
   "Please point out to me where it says both gays and straight people can marry whoever. \n \n Isnt a law created to keep the nation moral?? I wouldve thought that the ruling would lead towards that since back then gay marriage wasnt even an issue to think about because people knew it was wrong.\n\n \n \n Laws aren't based on morality. Laws are based in the constitution. Capital punishment isnt moral, but it is legal in some states.", 
   {}, 
   107200, 
   null, 
   1113496800.0
  ], 
  [
   107213, 
   null, 
   "VTCruiser", 
   " If marriage is a staight thing, then everyone isn't getting equal protection.\n\n \n What if i wanna marry my horse?? then it would just be a gay and straight thing.. and my rights would be violated..", 
   {}, 
   107210, 
   null, 
   1113496860.0
  ], 
  [
   107214, 
   null, 
   "VTCruiser", 
   "Laws aren't based on morality. Laws are based in the constitution. Capital punishment isnt moral, but it is legal in some states.\n\n \n \n wasnt the constitution created to provide rights through morality? geeees", 
   {}, 
   107212, 
   null, 
   1113496920.0
  ], 
  [
   107215, 
   null, 
   "VTCruiser", 
   "oh and according to the creators of the constitution, our rights arent given to us by the government, but we are endowed by our creator with certain inalienable rights!", 
   {}, 
   107214, 
   null, 
   1113497040.0
  ], 
  [
   107216, 
   null, 
   "MrWriteLA", 
   "Please point out the wording in Loving vs. Virginia  ruling that leads you to the \"OBVIOUS\"  conslusion that it applies only to opposite sex marriage. (Hint: It doesn't.)\n As is OBVIOUS by the fact that the decision was cited as precedence for rulings in Massachusetts, Vermont, and Hawaii, among others. From the Vermont decision: \nThe Supreme Court's observations in Loving  merely acknowledged what many states, including Vermont, had long recognized. One hundred thirty-seven years before Loving, this Court characterized the reciprocal rights and responsibilities flowing from the marriage laws as \"the natural rights of human nature.\" See Overseers of the Poor, 2 Vt. at 159. Decisions in other New England states noted the unique legal and economic ramifications flowing from the marriage relation. See, e.g., Adams v. Palmer, 51 Maine 481, 485 (Me. 1863) (\"it establishes fundamental and most important domestic relations\"). Early decisions recognized that a marriage contract, although similar to other civil agreements, represents much more because once formed, the law imposes a variety of obligations, protections, and benefits. As the Maine Supreme Judicial Court observed, the rights and obligations of marriage rest not upon contract, \"but upon the general law of the State, statutory or common, which defines and prescribes those rights duties and obligations. They are of law, not contract.\" See id. at 483; see also Ditson v. Ditson, 4 R.I. 87, 105 (1856) (marriage transcends contract because \"it gives rights, and imposes duties and restrictions upon the parties to it\"). In short, the marriage laws transform a private agreement into a source of significant public benefits and protections.\n Gee, I don't see anything there (let alone anything OBVIOUS) about the fundamental right in Loving pertained solely to inter-racial marriage.\n \n And in Washington... \nIn Loving v. Virginia  (1967), the Supreme Court struck down a Virginia law against interracial marriages. In Zablocki v. Redhail, it invalidated a law that denied marriage licenses to parents who had defaulted on child support obligations. In Turner v. Safley, the court struck down a prison regulation barring inmates from marrying.\n \n But [King County Superior Court Judge] Downing found that the Court's reasoning in each of those cases was based on a broad view of marriage as a fundamental right. The Court did not hold that interracial marriage, marriage by deadbeats, or marriage by prisoners is a fundamental right. Rather, it held that the ability to enter the institution of marriage is a fundamental right-all of which would apply, in some way, to same-sex couples, including procreation, the reason most often cited for denying same-sex couples the right to marry. Downing noted that many same-sex couples are raising children, and that many heterosexual couples who can't or don't intend to procreate get married, so allowing same-sex marriage does not break the link between marriage and children.\n But of course, the great minds who spend all day knocking gays on Internet fora have much keener legal eyes for spotting the OBVIOUS.", 
   {
    "unicode_changes_made": true
   }, 
   107196, 
   null, 
   1113497040.0
  ], 
  [
   107224, 
   null, 
   "joebrummer", 
   "wasnt the constitution created to provide rights through morality? geeees\n\n \n \n NO it wasn't. It was based on rights and liberties. If you feel it was morality, the burden of proof is on you to show that it was.", 
   {}, 
   107214, 
   null, 
   1113498600.0
  ], 
  [
   107225, 
   null, 
   "joebrummer", 
   "oh and according to the creators of the constitution, our rights arent given to us by the government, but we are endowed by our creator with certain inalienable rights!\n\n \n \n That wasn't in the constitution, that was the declaration of independance. Have you been to school? Do you know American History.", 
   {}, 
   107215, 
   null, 
   1113498780.0
  ], 
  [
   107226, 
   null, 
   "jyoshu", 
   "Gee, I don't see anything there (let alone anything OBVIOUS) about the fundamental right in Loving pertained solely to inter-racial marriage.\n\n \n It didn't define marriage as being other than between a man and a woman, that's for sure. It just said marriage is a human right. Since the general understanding of marriage was and still is that it's between a man and woman, it's not unreasonable to assume that's the 'marriage' at issue. That's what marriage IS.\n \n We need to stop looking at the Loving case as a rubber stamp for any sort of arrangement possible, that anyone might want to claim govt. benefits for. Of course it said marriage was a human right--that doesn't mean we get to call any sort of arrangement in the world we want a \"marriage.\" It didn't address the nature of what constitutes a marriage.\n \n \nBut of course, the great minds who spend all day knocking gays on Internet fora have much keener legal eyes for spotting the OBVIOUS.\n\n \n Or those who get their dander up over the least amount of disagreement, and can't tolerate hearing any other views than your own. But regarding the above snide comment, if about 20-30 minutes a day of posting constitutes \"all day,\" and mere disagreement constitutes \"knocking gays\" (whatever the heck that means), hey. I'll own up. :p", 
   {}, 
   107216, 
   null, 
   1113498900.0
  ], 
  [
   107228, 
   null, 
   "MrWriteLA", 
   "From the Massachusetts opinion (http://www.law.umkc.edu/faculty/projects/ftrials/conlaw/Goodridge.html): \n...civil marriage has long been termed a \"civil right.\" The United States Supreme Court has described the right to marry as \"of fundamental importance for all individuals\" and as \"part of the fundamental 'right of privacy' implicit in the Fourteenth Amendment's Due Process Clause.\" Zablocki v. Redhail  (1978). See Loving v. Virginia  (\"The freedom to marry has long been recognized as one of the vital personal rights essential to the orderly pursuit of happiness by free men\").\n \n Without the right to marry--or more properly, the right to choose to marry--one is excluded from the full range of human experience and denied full protection of the laws for one's \"avowed commitment to an intimate and lasting human relationship...\" \n \nIn this case, as in Loving, a statute deprives individuals of access to an institution of fundamental legal, personal, and social significance--the institution of marriage--because of a single trait: skin color in Loving, sexual orientation here. As it did in Loving, history must yield to a more fully developed understanding of the invidious quality of the discrimination.\n Don't expect to see any cogent arguing of the points in these rulings from the anti-gay contributors to this forum. What you can  expect to see is the another repetition of that popular homophobe ad hominem buzzword, \"activist.\"", 
   {}, 
   107216, 
   null, 
   1113498900.0
  ], 
  [
   107232, 
   null, 
   "wsm2506", 
   "Or those who get their dander up over the least amount of disagreement, and can't tolerate hearing any other views than your own. But regarding the above snide comment, if about 20-30 minutes a day of posting constitutes \"all day,\" and mere disagreement constitutes \"knocking gays\" (whatever the heck that means), hey. I'll own up. :p\n\n \n Your whining is getting pathetic.", 
   {}, 
   107226, 
   null, 
   1113499800.0
  ], 
  [
   107234, 
   null, 
   "MrWriteLA", 
   "From Alaska (Brause v. Bureau of Vital Statistics, 1998) \nAt stake here is whether same-sex marriage can be denied by the state without violating fundamental rights, including the fundamental right to privacy. It is undisputed that marriage between persons of opposite gender is a fundamental right. See, e.g., Griswold; Loving v. Virginia, 388 U.S. 1, 87 S.Ct. 1817, 18 L.Ed.2d 1010 (1967). The question presented by this case is whether the personal decision by those who choose a mate of the same gender will be recognized as the same fundamental right. Clearly, the right to choose one's life partner is quintessentially the kind of decision which our culture recognizes as personal and important. Though the choice of a partner is not left to the individual in some cultures, in ours it is no one else's to make. Indeed, the marriage license and the marriage ceremony themselves make clear that this must be a choice freely made by the individual. Certainly the choice of a life partner is as important and personal as the choices involved in determining one's personal appearance.\n", 
   {
    "unicode_changes_made": true
   }, 
   107228, 
   null, 
   1113499920.0
  ], 
  [
   107240, 
   null, 
   "MrWriteLA", 
   "Apparently, in some people's books, repeatedly making derogatory and fallacious opinions about people's civil rights, even after being proven wrong over and over, constitutes mere \"slight disagreement,\" which for some reason renders it immune from discussion in a debate forum.", 
   {}, 
   107234, 
   null, 
   1113500520.0
  ], 
  [
   107246, 
   null, 
   "Duo_Maxwell", 
   "how is my argument not valid to you?? the guy is contradicting himself. He saying he stands up for the opressed, and the afflicted.. .but in all reality he doesnt!\n\n \n Not really. You're assuming again. I have repeatively stated I don't care if they get it or not. I'm merely here to point out the lies, fallacies and majority oppression in the anti's arguments. Also, technically I'm aganist gay marriage as well, I must be if i'm agnaist all marriage in goverment, but since that isn't going to happen, well, that doesn't need to be said.", 
   {}, 
   107119, 
   null, 
   1113501180.0
  ], 
  [
   107279, 
   null, 
   "JPSartre12", 
   "I don't think this is true. Racial segregation, for example, was destroyed by a supreme court despite that ruling being wildly unpopular. But yes, I do agree that more support of same-sex marriage will be necessary.\n\n \n The SCOTUS also established the original \" Separate but equal\" in 1896, Plessy v. Ferguson.", 
   {}, 
   106738, 
   null, 
   1113504960.0
  ], 
  [
   107293, 
   null, 
   "wsm2506", 
   "And Plessy v. Ferguson  was overturned by Brown v. Board of Education in 1954.", 
   {}, 
   107279, 
   null, 
   1113507000.0
  ], 
  [
   107294, 
   null, 
   "VTCruiser", 
   "That wasn't in the constitution, that was the declaration of independance. Have you been to school? Do you know American History.\n\n \n good grief i didnt say it was in the constitution! you read to fast. I said according to the CREATORS of the constitution... in no way did i say it was in the constitution.\n \n i said that to say that the creators of the constitution were very moral.", 
   {}, 
   107225, 
   null, 
   1113507480.0
  ], 
  [
   107295, 
   null, 
   "MrWriteLA", 
   "From the decision by HON. DORIS LING-COHAN, Justice, SUPREME COURT OF THE STATE OF NEW YORK in Hernandez, et al v. Robles http://www.lambdalegal.org/binary-data/LAMBDA_PDF/pdf/378.pdf : \nRote reliance on historical exclusion as a justification improperly forecloses constitutional analysis  and would have served to justify slavery, anti-miscegenation laws and segregation. There has been a steady evolution of the institution of marriage throughout history which belies the concept of a static traditional definition. Marriage, as it is understood today, is both a partnership of two loving equals who choose to commit themselves to each other and a State institution designed to promote stability for the couple and their children. The relationships of plaintiffs fit within this definition of marriage.\n \n Similar to opposite-sex couples, same-sex couples are entitled to the same fundamental right to follow their hearts and publicly commit to a lifetime partnership with the person of their choosing. The recognition that this fundamental right applies equally to same-sex couples cannot legitimately be said to harm anyone.\n \n While, undeniably, religious institutions have a historical and spiritual interest in marriage and the recognition of those married under their tenets, ultimately it is the government's choice as to which relationships to recognize as valid civil marriages and whether, and the degree to which, legal protections, burdens and privileges should be conferred on that civil institution. The Court recognizes that this decision may cause pain to some in that their religious convictions forbid the recognition of same-sex marriage. However, the Court emphasizes that government recognition that same-sex couples may be civilly married does not impact on those married under the tenets of their individual faith, and does not require that religious institutions change their tenets, nor their definition of marriage under their faith. Moreover, such religious considerations cannot legally be the basis upon which to curtail the constitutional rights of plaintiffs. \n (Emphases mine)", 
   {
    "unicode_changes_made": true
   }, 
   107279, 
   null, 
   1113507660.0
  ], 
  [
   107298, 
   null, 
   "VTCruiser", 
   "wasnt the constitution created to provide rights through morality? geeees\n\n \n i meant to say, created to provide rights with morality. But through the morality of our founders, our constitution was established.. They also used their morality to say, everyone has rights which are endowed by our creator.", 
   {}, 
   107214, 
   null, 
   1113507900.0
  ], 
  [
   107302, 
   null, 
   "wsm2506", 
   "i meant to say, created to provide rights with morality. But through the morality of our founders, our constitution was established.. They also used their morality to say, everyone has rights which are endowed by our creator.\n\n \n Then are not gay people a part of \"everyone\"?", 
   {}, 
   107298, 
   null, 
   1113508860.0
  ], 
  [
   107303, 
   null, 
   "VTCruiser", 
   "Then are not gay people a part of \"everyone\"?\n\n \n i never said they arent! like i said, homosexuals are just as human as me and you.. ha... and by the way, do you think the creator would contradict himself and say \"homesexual marriage is alright\"?", 
   {}, 
   107302, 
   null, 
   1113508920.0
  ], 
  [
   107306, 
   null, 
   "Jaxian", 
   "i never said they arent! like i said, homosexuals are just as human as me and you.. ha... and by the way, do you think the creator would contradict himself and say \"homesexual marriage is alright\"?\n\n \n I certainly think the creator would agree that homosexual marriage is good and moral, though I by no means think that he would be contradicting himself. Neither would the founders, who believed that men were created equal with unalienable rights, and that among those are the rights to life, liberty, and the persuit of happiness. Denying same-sex marriage denies equality as well as both liberty and the persuit of happiness.", 
   {}, 
   107303, 
   null, 
   1113509400.0
  ], 
  [
   107308, 
   null, 
   "VTCruiser", 
   "I certainly think the creator would agree that homosexual marriage is good and moral, though I by no means think that he would be contradicting himself. \n\n \n ha, show me in the bible where it says God thinks homesexuality is good and moral... show me..", 
   {}, 
   107306, 
   null, 
   1113509520.0
  ], 
  [
   107309, 
   null, 
   "Fishbulb", 
   "and by the way, do you think the creator would contradict himself and say \"homesexual marriage is alright\"?\n\n \n Why would this be a contradiction?\n \n \nWe hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\n\n \n Sorry, there's nothing here that indicates a specifically Christian God, nor is there any mention of the bible.", 
   {}, 
   107303, 
   null, 
   1113509520.0
  ], 
  [
   107311, 
   null, 
   "VTCruiser", 
   "Why would this be a contradiction?\n\n \n Go read Romans 1 and you'll see why. God cant be for and against sin.", 
   {}, 
   107309, 
   null, 
   1113509760.0
  ], 
  [
   107313, 
   null, 
   "Fishbulb", 
   "Oh, so you're talking about the bible. I was talking about God.", 
   {}, 
   107311, 
   null, 
   1113509880.0
  ], 
  [
   107318, 
   null, 
   "jitobear", 
   "ha, show me in the bible where it says God thinks homesexuality is good and moral... show me..\n\n \n Show me where in the Bible you get license to condemn. Show me where it says you are any better than any other sinner. Show me where you have been granted the privelege of judging anyone.\n \n Actually - why not just go to the ever abused book of Romans - and do try and get past the first chapter that mentions homosexuality.", 
   {}, 
   107308, 
   null, 
   1113510180.0
  ], 
  [
   107319, 
   null, 
   "VTCruiser", 
   "\n Sorry, there's nothing here that indicates a specifically Christian God, nor is there any mention of the bible.\n\n \n i think anyone on this forum can tell you that you are wrong about that. The creator refferred to in the declaration of independence is the Judeo-Christian God... Even my homesexual RA who majors in political science says that.!!!", 
   {}, 
   107309, 
   null, 
   1113510240.0
  ], 
  [
   107320, 
   null, 
   "VTCruiser", 
   "Show me where in the Bible you get license to condemn. Show me where it says you are any better than any other sinner. Show me where you have been granted the privelege of judging anyone.\n \n Actually - why not just go to the ever abused book of Romans - and do try and get past the first chapter that mentions homosexuality.\n\n \n Im no better than any other sinner, never claimed i was! Im not judging anyone, i am just pointing out what the Bible says. Why dont you quit skippin over romans 1.. and dont assume that i dwell on that..", 
   {}, 
   107318, 
   null, 
   1113510360.0
  ], 
  [
   107323, 
   null, 
   "wsm2506", 
   "Im no better than any other sinner, never claimed i was! Im not judging anyone, i am just pointing out what the Bible says. Why dont you quit skippin over romans 1.. and dont assume that i dwell on that..\n\n \n Keep your Bible within your religion. Also, keep in mind what I pointed out to you in an earlier post regarding what our founding fathers said in the Treaty of Tripoli. You have every right to your religion, but not at the expense of someone elses civil rights.", 
   {}, 
   107320, 
   null, 
   1113510780.0
  ], 
  [
   107324, 
   null, 
   "jitobear", 
   "Im no better than any other sinner, never claimed i was! Im not judging anyone, i am just pointing out what the Bible says. Why dont you quit skippin over romans 1.. and dont assume that i dwell on that..\n\n \n The hell you aren't judging. The minute you turn to the Bible to justify denying homosexuals anything you are judging.\n \n The mis-use of Romans is a pet peeve of mine. Every anti-gay Christian I have met uses it as justification to hate, condemn, deny rights, disapprove of, etc. homosexuality. \n \n The list of all those who aren't fit to enter the kingdom of heaven isn't a laundry list of the unsaved for your information. They are examples. Paul later goes on to say that (in summed up modern vernacular) \"hey they may not be worthy, but neither are you, and the only reason anyone will get saved is through the grace of Christ\" for anyone to make claims about who is or is not worthy of heaven cheapens that grace. They are out of line. Mind your own keep. Christ talked about it, too, a lot - you know, judge not, the one without sin can throw the first stone, worrying about the speck in your brother's eye rather than the plank in your own. One thing Jesus never once mentioned in the gospels though, is homosexuality.", 
   {}, 
   107320, 
   null, 
   1113510840.0
  ], 
  [
   107325, 
   null, 
   "VTCruiser", 
   "Keep your Bible within your religion. Also, keep in mind what I pointed out to you in an earlier post regarding what our founding fathers said in the Treaty of Tripoli. You have every right to your religion, but not at the expense of someone elses civil rights.\n\n \n buuuut, those founding fathers said those rights arent given by the government, but we are endowed by our creator with those certain inalienable rights... Seems like they didnt put aside their Bible to point that out..", 
   {}, 
   107323, 
   null, 
   1113510840.0
  ], 
  [
   107328, 
   null, 
   "wsm2506", 
   "buuuut, those founding fathers said those rights arent given by the government, but we are endowed by our creator with those certain inalienable rights... Seems like they didnt put aside their Bible to point that out..\n\n \n I find no reference to the Bible or Judeo/Christianity anywhere in the constitution.", 
   {}, 
   107325, 
   null, 
   1113511020.0
  ], 
  [
   107337, 
   null, 
   "VTCruiser", 
   "The hell you aren't judging. The minute you turn to the Bible to justify denying homosexuals anything you are judging.\n\n \n Are you judging me for \"judging\"?\n \n \n\n The mis-use of Romans is a pet peeve of mine. Every anti-gay Christian I have met uses it as justification to hate, condemn, deny rights, disapprove of, etc. homosexuality. \n\n \n Misuse?? oh brother.. by the way, i dont hate, condemn, deny rights, disapprove of the homesexual as a human... BUT I DO NOT AGREE WITH THEIR ACTIONS! big difference. i respect them as humans!\n \n \n \n\n \"hey they may not be worthy, but neither are you, and the only reason anyone will get saved is through the grace of Christ\" for anyone to make claims about who is or is not worthy of heaven cheapens that grace. \n\n \n well, i know that i am covered by the blood of Jesus and my sins are forgiven.. but that doesnt mean i never struggle with sin.. i never said i was higher than anyone. Also, Paul also goes on later in Romans 6:1 to say \"What shall we say then?? Are we to continue in sin that grace might increase??\" then in verse 2 \"MAY IT NEVER BE! how shall we who died to sin still live in it?\" \n \n \n\n They are out of line. Mind your own keep. Christ talked about it, too, a lot - you know, judge not, the one without sin can throw the first stone, worrying about the speck in your brother's eye rather than the plank in your own. One thing Jesus never once mentioned in the gospels though, is homosexuality.\n\n \n You could say all the things that Jesus never mentioned must obviously be right if you truly believed that. We are all sinners, born into sin.. but Christ died and rose again so that we would be free from it. im not throwing a stone at anyone, because i myself was a sinner and yes, sin is still in the world and i am a human and still struggle with it sometimes. im just simply pulling out what the Bible says about sin.. dont blame me for coming up with this.. blame the God if you want, but dont blame me.", 
   {}, 
   107324, 
   null, 
   1113511560.0
  ], 
  [
   107339, 
   null, 
   "wsm2506", 
   "Are you judging me for \"judging\"?\n \n \n \n Misuse?? oh brother.. by the way, i dont hate, condemn, deny rights, disapprove of the homesexual as a human... BUT I DO NOT AGREE WITH THEIR ACTIONS! big difference. i respect them as humans!\n \n \n \n \n well, i know that i am covered by the blood of Jesus and my sins are forgiven.. but that doesnt mean i never struggle with sin.. i never said i was higher than anyone. Also, Paul also goes on later in Romans 6:1 to say \"What shall we say then?? Are we to continue in sin that grace might increase??\" then in verse 2 \"MAY IT NEVER BE! how shall we who died to sin still live in it?\" \n \n \n \n You could say all the things that Jesus never mentioned must obviously be right if you truly believed that. We are all sinners, born into sin.. but Christ died and rose again so that we would be free from it. im not throwing a stone at anyone, because i myself was a sinner and yes, sin is still in the world and i am a human and still struggle with it sometimes. im just simply pulling out what the Bible says about sin.. dont blame me for coming up with this.. blame the God if you want, but dont blame me.\n\n \n Take it to the \"Religion\" forum.", 
   {}, 
   107337, 
   null, 
   1113511680.0
  ], 
  [
   107341, 
   null, 
   "VTCruiser", 
   "I find no reference to the Bible or Judeo/Christianity anywhere in the constitution.\n\n \n dont you think the constitution was birthed FROM THE DECLARATION OF INDEPENDENCE??", 
   {}, 
   107328, 
   null, 
   1113511740.0
  ], 
  [
   107344, 
   null, 
   "VTCruiser", 
   "Take it to the \"Religion\" forum.\n\n \n Im just referring back to \"we are enowed by our creator with certain inalienable rights\" and i want you to prove that the reference there isnt to God.. ha You Cant.. and if you want, i can go down the hall here and ask my Gay RA if he'll pull out all of his political science books where it states that.", 
   {}, 
   107339, 
   null, 
   1113511800.0
  ], 
  [
   107345, 
   null, 
   "wsm2506", 
   "dont you think the constitution was birthed FROM THE DECLARATION OF INDEPENDENCE??\n\n \n What does that have to do with anything?", 
   {}, 
   107341, 
   null, 
   1113511860.0
  ], 
  [
   107351, 
   null, 
   "VTCruiser", 
   "What does that have to do with anything?\n\n \n my point being, that the rights given in the constitution were based from the belief that we are \"endowed by our creator with certain inalienable rights\"\n \n thats got everything to do with the constitution.", 
   {}, 
   107345, 
   null, 
   1113512100.0
  ], 
  [
   107360, 
   null, 
   "gnojek", 
   "What I want to know is if all these folks who feel it is their right to vote on marriage for gays would mind if the gays were allowed to vote on their marriages?\n\n Well, they are in the minority no matter what.", 
   {}, 
   106714, 
   null, 
   1113512640.0
  ], 
  [
   107361, 
   null, 
   "tonybrown74", 
   "you cant sit there and tell me that was a dishonest answer. good grief, who are you to say that?\n\n \n I am a person with a lick of sense. That is who I am.\n \n As if you could sit there and actually say that you KNOW you would have marched with MLK! What makes you think that you would not have been affected by the societal mores of that time? \n \n As I said, Hindsight is a bit of an itch that way.", 
   {}, 
   106909, 
   null, 
   1113512640.0
  ], 
  [
   107363, 
   null, 
   "JustineCredible", 
   "how is my argument not valid to you?? the guy is contradicting himself. He saying he stands up for the opressed, and the afflicted.. .but in all reality he doesnt!\n\n \n \n Oye, point being in regard to GAYS. Gees, what part of GAY RIGHTS do you not understand?", 
   {}, 
   107119, 
   null, 
   1113512700.0
  ], 
  [
   107364, 
   null, 
   "Jaxian", 
   "ha, show me in the bible where it says God thinks homesexuality is good and moral... show me..\n\n \n First off, there is no reason to believe that our creator is the God described in the Bible. The founders, though Christian, did not claim to know for certain who our creator is, excepting that they could all agree that each person is given rights. \n \n Next, there is much dispute over the translation of the Bible regarding homosexuals. Not everyone believes that the Bible specifically referenced homosexuality at all. References posted previously on this topic include:\n \n http://www.gaysouthafrica.org.za/homosexuality/bible.asp\n http://www.whosoever.org/bible/\n http://www.godmademegay.com/Letter.htm\n http://www.musingson.com/\n \n I wonder why you are so certain that Bible, which was written by man, who is fallible, accurately represents the word of God. Looking at the Old Testament, which mandates many absurd things, should reveal this fact more than my words. Here is but one of many passages in the old testament that mandates murder:\n \n Deuteronomy 13:6-10 \"If thy brother, the son of thy mother, or thy son, or thy daughter, or the wife of thy bosom, or thy friend, which is as thine own soul, entice thee secretly, saying, Let us go and serve other gods, which thou hast not known, thou, nor thy fathers; Namely, of the gods of the people which are round about you, nigh unto thee, or far off from thee, from the one end of the earth even unto the other end of the earth; Thou shalt not consent unto him, nor hearken unto him; neither shall thine eye pity him, neither shalt thou spare, neither shalt thou conceal him: But thou shalt surely kill him; thine hand shall be first upon him to put him to death, and afterwards the hand of all the people. And thou shalt stone him with stones, that he die...\"\n \n It is my opinion that although the authors of the Bible did intend to capture the will of the Christian God, they did not accurately do so, and the true will of the Christian God can only be determined through the words of Jesus:\n \n Luke 9:52-56: \"...they did not receive him...And when his disciples James and John saw this, they said, Lord, wilt thou that we command fire to come down from heaven, and consume them, even as Elias did? But he turned, and rebuked them, and said, Ye know not what manner of spirit ye are of. For the Son of man is not come to destroy men's lives, but to save them. And they went to another village.\"\n \n Matthew 5:10-11: \"Blessed are they which are persecuted for righteousness' sake: for theirs is the kingdom of heaven. Blessed are ye, when men shall revile you, and persecute you, and shall say all manner of evil against you falsely, for my sake.\"\n \n Matthew 5:44:But I say unto you, Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you;\n \n Read then Romans 12, and tell me if these verses came from the same mouth that told us to stone our mothers to death if they practice a different religion.", 
   {}, 
   107308, 
   null, 
   1113512760.0
  ], 
  [
   107365, 
   null, 
   "VTCruiser", 
   "I am a person with a lick of sense. That is who I am.\n \n As if you could sit there and actually say that you KNOW you would have marched with MLK! What makes you think that you would not have been affected by the societal mores of that time? \n \n As I said, Hindsight is a bit of an itch that way.\n\n \n So either way, we cant say. but you shouldnt tell me it was a dishonest answer.", 
   {}, 
   107361, 
   null, 
   1113512760.0
  ], 
  [
   107367, 
   null, 
   "JustineCredible", 
   "well then according to you, the right to have 15 wives is there but im being denied it. GOOD GRIEF! this is rediculous\n\n \n \n No one is afforded the right to marry more than one person, therefore you are not being oppressed in any way, shape or form.", 
   {}, 
   107165, 
   null, 
   1113512820.0
  ], 
  [
   107368, 
   null, 
   "wsm2506", 
   "my point being, that the rights given in the constitution were based from the belief that we are \"endowed by our creator with certain inalienable rights\"\n \n thats got everything to do with the constitution.\n\n \n And I am one of those \"we\" that you wish to deny \"certain inalienable rights\" to.", 
   {}, 
   107351, 
   null, 
   1113513000.0
  ], 
  [
   107370, 
   null, 
   "BobNelson2", 
   "No one is afforded the right to marry more than one person, therefore you are not being oppressed in any way, shape or form.\n\n \n The polygamists most certainly are being oppressed. BUT they are oppressed just as all other citizens are in being restricted to marrying one other citizen.\n \n Theirs is a moral argument. Not a constitutional one.", 
   {}, 
   107367, 
   null, 
   1113513420.0
  ], 
  [
   107371, 
   null, 
   "JustineCredible", 
   "i never said they arent! like i said, homosexuals are just as human as me and you.. ha... and by the way, do you think the creator would contradict himself and say \"homesexual marriage is alright\"?\n\n \n Which idea of a \"creator\" are you eluding to? Hate to remind you, but there is a little thing in this country called \"Freedom of Religion\" this means the government cannot promote any one specific religious view over any other. It cannot create a national religion nor force the entire citizenry to follow one specific view of religion. \n So, really you idea of a \"creator\" is just that...YOUR VIEW...and no one else has to agree with it.", 
   {}, 
   107303, 
   null, 
   1113513480.0
  ], 
  [
   107374, 
   null, 
   "JustineCredible", 
   "ha, show me in the bible where it says God thinks homesexuality is good and moral... show me..\n\n \n \n Again, this \"bible\" you speak of eludes to one specific view of a \"creator\" as well as one specific idea of \"religion.\" \n \n What you are completely denying is the right of every citizen to follow whatever religious doctrine they choose, or to not follow any at all if they so choose. \n \n Your religion is NOT everyone's religion and you have no right to enforce your religious views on anyone but yourself, nor do you have the right to enact or attempt to create laws which only reflect your specific religious views.", 
   {}, 
   107308, 
   null, 
   1113513720.0
  ], 
  [
   107375, 
   null, 
   "BobNelson2", 
   "i think anyone on this forum can tell you that you are wrong about that. The creator refferred to in the declaration of independence is the Judeo-Christian God... Even my homesexual RA who majors in political science says that.!!!\n\n \n Well, your homosexual RA majoring in political science is either not too bright or is being brainwashed. What school are we talking about?\n \n The phrasing in the Declaration of Indendence is intentionally vague. If those wanting a direct reference to \"God\" had prevailed, some of the leading figures of the independence movement would have refused to sign.\n \n The POINT of our founding documents is that WE do not look to God as the foundation of our government, WE look to ourselves.\n \n Americans like to think that our founders looked around at a world of tyranny and chose freedom. What we tend not to think about is that MANY of the tyrannical governments around them WERE FOUNDED ON RELIGION or were fusions of religion and monarchy. Our forefathers were smart enough to see how wrong such arrangements could go.\n \n Too many of our current leaders are too dim to see the danger or so dim that they see the danger and embrace it.", 
   {}, 
   107319, 
   null, 
   1113513780.0
  ], 
  [
   107376, 
   null, 
   "JustineCredible", 
   "Are you judging me for \"judging\"?\n \n \n \n Misuse?? oh brother.. by the way, i dont hate, condemn, deny rights, disapprove of the homesexual as a human... BUT I DO NOT AGREE WITH THEIR ACTIONS! big difference. i respect them as humans!\n\n \n So what? Is anyone forcing you to engage in actions of which you do not agree? If not, how is it affecting you in any way? \n \n \n \n \n \nwell, i know that i am covered by the blood of Jesus and my sins are forgiven.. but that doesnt mean i never struggle with sin.. i never said i was higher than anyone. Also, Paul also goes on later in Romans 6:1 to say \"What shall we say then?? Are we to continue in sin that grace might increase??\" then in verse 2 \"MAY IT NEVER BE! how shall we who died to sin still live in it?\" \n\n \n Good for you, I'm glad you have your religion, but you do not have the right to force anyone but yourself to follow your religion or your religious views. \n \n \n \n \n \nYou could say all the things that Jesus never mentioned must obviously be right if you truly believed that. We are all sinners, born into sin.. but Christ died and rose again so that we would be free from it. im not throwing a stone at anyone, because i myself was a sinner and yes, sin is still in the world and i am a human and still struggle with it sometimes. im just simply pulling out what the Bible says about sin.. dont blame me for coming up with this.. blame the God if you want, but dont blame me.\n\n \n Oh so you have no control over your own actions or the words you use? Honey, that's not religion or sin, it's a mental disorder and you need treatment for it.", 
   {}, 
   107337, 
   null, 
   1113513900.0
  ], 
  [
   107377, 
   null, 
   "BobNelson2", 
   "One can only come to one of two conclusions with the fact that there are obvious similarities in the themes of the Bible and the ideologies of our govt. (freedom, life, liberty, pursuit of happiness, laws that are parallel such as those against theft, murder, etc.)\n\n \n You have the most fanciful, revisionist view of Christianity I have ever encountered. For someone supposedly so opposed to moral relativism, you certainly embrace it.\n \n \nIt is naive and shortsighted to think that religious men would not be influenced by religious ideals in their work to create a nation by the people and for the people. To think that the founders somehow divorced themselves from their religious influences for a bit in order to draft the same ideological laws and principles to ensure they were as secular as possible is to not only deny the power of ideology, but to insult the founders themselves by implying their beliefs should have been \"locked in the closet\" as our nation formed.\n \n The truth is, it is much more likely that religion DID play a role in the founding of our govt., simply because many of the founders had religious beliefs, the principles of our govt. are in many case parallel to Christian ones, and we can't deny that a person's beliefs have a way of playing out in everyday life. One has to ask, how could it NOT have been an influence?\n\n \n Of course it was an influence, and I daresay the founders had a much better grasp on the influences, good and bad, of religion than you do. That men steeped in Christianity chose to create a nation built on secularism should tell you something.\n \n Life, liberty and the pursuit of happiness are NOT Christian ideas. If they are for you, then why in the world are you so clearly standing in the way of my life, my liberty, and my pursuit of happiness?", 
   {}, 
   107181, 
   null, 
   1113514080.0
  ], 
  [
   107378, 
   null, 
   "BobNelson2", 
   "tell me what gays have to offer that no other human can...YOU CANT! BECAUSE EVERYONE IS THE SAME! no one is more special than the other.\n\n \n Well, certainly more than most groups, we offer you an opportunity to test your principles.\n \n P.S. You're coming up short.", 
   {}, 
   107138, 
   null, 
   1113514140.0
  ], 
  [
   107380, 
   null, 
   "JustineCredible", 
   "The polygamists most certainly are being oppressed. BUT they are oppressed just as all other citizens are in being restricted to marrying one other citizen.\n \n Theirs is a moral argument. Not a constitutional one.\n\n \n Bob: As you know I agree with you here. I just can't stand it when someone attempts to change the subject in order to prove their point, when all it does is muddy the waters. \n \n I just think the whole polygamy issue is irrelavent to the gay marriage issue.", 
   {}, 
   107370, 
   null, 
   1113514320.0
  ], 
  [
   107387, 
   null, 
   "JPSartre12", 
   "From the decision by HON. DORIS LING-COHAN, Justice, SUPREME COURT OF THE STATE OF NEW YORK in Hernandez, et al v. Robles http://www.lambdalegal.org/binary-data/LAMBDA_PDF/pdf/378.pdf : (Emphases mine)\n\n \n \n And from Today's MSNBC Website:\n \n\n Oregon justices nullify 3,000 gay marriages\n Governor wants expanded rights, lawmakers to weigh next\n The Associated Press\n Updated: 1:03 p.m. ET April 14, 2005SALEM, Ore. - The Oregon Supreme Court on Thursday nullified nearly 3,000 marriage licenses issued to same-sex couples by Multnomah County a year ago, saying a single county couldn't take such action on its own.\n \n The court said while the county can question the constitutionality of laws governing marriage, they are a matter of statewide concern so the county had no authority to issue licenses to gay couples.\n \n The court noted that last November, Oregonians approved a constitutional amendment that limits marriages to a man and a woman. The court also said that long before that vote, state law had set the same limitations on marriages since Oregon became a state.\n \n \"Today, marriage in Oregon - an institution once limited to opposite-sex couples only by statute - now is so limited by the state Constitution as well,\" the court ruling said.\n http://www.msnbc.msn.com/id/7502399/ \n\n \n Emphasis is mine.", 
   {
    "unicode_changes_made": true
   }, 
   107295, 
   null, 
   1113514860.0
  ], 
  [
   107397, 
   null, 
   "jyoshu", 
   "You have the most fanciful, revisionist view of Christianity I have ever encountered. For someone supposedly so opposed to moral relativism, you certainly embrace it. Of course it was an influence, and I daresay the founders had a much better grasp on the influences, good and bad, of religion than you do. That men steeped in Christianity chose to create a nation built on secularism should tell you something. Life, liberty and the pursuit of happiness are NOT Christian ideas.\n\n \n It never ceases to amaze me that some refuse to try and see how so many people embrace religion, not because of it's restrictions or rules (which is often the athiest's only portrayal of it) but because of the freedom it brings. It's hard to understand how someone can read the writings of Christ and not see how he would support life and liberty, as well as the pursuit of happiness--indeed life, liberty, and the pursuit of happiness ARE Christian ideals, and only someone prejudiced against religion could possibly try so hard to purge religious influence from the founders' thinking through modern revisionism.\n \n \nIf they are for you, then why in the world are you so clearly standing in the way of my life, my liberty, and my pursuit of happiness?\n\n \n When a person goes so far as to try to legitimize their lifestyle (yes, I used the \"L\" word!!! emoticon_wow No, it's not referring to anything other than homosexual sex and relationships) by trying to piggyback off institutions held dear by the rest of society, and then has the gall to call it a \"pursuit of happiness\" (when you can get married to a gay person now), it only goes to show why state after state is rejecting your movement. The govt. benefits just ain't gonna bring happiness to your life.", 
   {}, 
   107377, 
   null, 
   1113516480.0
  ], 
  [
   107402, 
   null, 
   "BobNelson2", 
   "And from Today's MSNBC Website:\n \n \n Emphasis is mine.\n\n \n Were you to read the full decision, you might emphasize differently.\n \n http://www.publications.ojd.state.or.us/S51612.htm", 
   {}, 
   107387, 
   null, 
   1113517020.0
  ], 
  [
   107406, 
   null, 
   "wsm2506", 
   "When a person goes so far as to try to legitimize their lifestyle ([i]yes, I used the \"L\" word!!! emoticon_wow\n\n \n Is that not exactly what your are doing, trying to legitimize YOUR 'LIFESTYLE\" as superior?\n \n \nThe govt. benefits just ain't gonna bring happiness to your life.\n Perhaps not, but how about equality?", 
   {}, 
   107397, 
   null, 
   1113517380.0
  ], 
  [
   107411, 
   null, 
   "jyoshu", 
   "And from Today's MSNBC Website:\n \n \n Emphasis is mine.\n\n \n Hey, JP!! \n \n Have you noticed that they're usually arguing their case from the standpoint that it's unconstitutional to not do things the way they want, and yet the minute they are faced with constitutional basis that marriage isn't for same-sex relationships, they move on to other things, as if they were never holding up the constitutional mantra to begin with? (\"Oh, well, THAT constitution is just wrong.\") It only goes to show it's not about rights at all, but validifying homosexual behavior, and it always has been.\n \n Where will they turn for validity when an even higher court rules that there is no constitutional basis for redefining marriage??", 
   {}, 
   107387, 
   null, 
   1113517800.0
  ], 
  [
   107413, 
   null, 
   "joebrummer", 
   "It never ceases to amaze me that some refuse to try and see how so many people embrace religion, not because of it's restrictions or rules (which is often the athiest's only portrayal of it) but because of the freedom it brings. It's hard to understand how someone can read the writings of Christ and not see how he would support life and liberty, as well as the pursuit of happiness--indeed life, liberty, and the pursuit of happiness ARE Christian ideals, and only someone prejudiced against religion could possibly try so hard to purge religious influence from the founders' thinking through modern revisionism.\n\n \n I read the writings of christ but if you are gay they don't offer any of what you have said. My reasons for being athiest have nothing to do with being gay, but none the less. Laws in this country are not and cannot be based on one religion or any religion. Why can't you understand that is the best for everyone muslim, jewish, chrisitian and even atheist.\n \n \n\n When a person goes so far as to try to legitimize their lifestyle (yes, I used the \"L\" word!!! emoticon_wow No, it's not referring to anything other than homosexual sex and relationships) by trying to piggyback off institutions held dear by the rest of society, and then has the gall to call it a \"pursuit of happiness\" (when you can get married to a gay person now), it only goes to show why state after state is rejecting your movement. The govt. benefits just ain't gonna bring happiness to your life.\n\n \n \n No govermnent anything won't bring happiness, but it can protect the happiness you have. I could give you lists of stuff in my relationship that are not protected things because the government is either going to tax it or just doesn't recognize us as anything more than strangers. Civil Unions would be fine if they carried the same weight, but they don't and never will. If you were in a relationship and had a house, kids, investments and the goverment didn't recognize you as anything more than strangers. You would fight to.\n \n If by chance someday, either partner or I have to go to a nursing home, we are screwed. The other will lose the house and we cannot stop that. Married people can stop it. We also wouldn't be able to stay together in a nursing home. We would be separated and can do nothing about it. Married people are kept together by law.\n \n When we travel to visit my parents in Virginia, our \"documents\" deignating each other as the one to make medical decisions wouldn't be honored if something should happen. THe hospital could infact stop us from making those decision because of the wording of their ammendment regarding marriage. That is why we don't go to virginia. We make my parents come here.\n \n I could go on and on with stuff just like this. Civil Unions are like \"marriage lite\". They just dont' have the same wieght.", 
   {}, 
   107397, 
   null, 
   1113517800.0
  ], 
  [
   107415, 
   null, 
   "BobNelson2", 
   "It never ceases to amaze me that some refuse to try and see how so many people embrace religion, not because of it's restrictions or rules (which is often the athiest's only portrayal of it) but because of the freedom it brings. \n\n \n Please point out cases of YOUR religion bringing freedom to gay people. Make sure to include examples from several major historical periods.\n \n Religion can bring freedom (well, at least distraction) and solace. When it does so for gay people, you yourself mock it as illegitimate.\n \n \nIt's hard to understand how someone can read the writings of Christ and not see how he would support life and liberty, as well as the pursuit of happiness--indeed life, liberty, and the pursuit of happiness ARE Christian ideals, and only someone prejudiced against religion could possibly try so hard to purge religious influence from the founders' thinking through modern revisionism.\n\n \n No writings of Christ survive.\n \n One can certainly read much of the New Testament as an endorsement of freedom and equality -- left-leaning believers have done that for hundreds of years. Had Christianity consistently embraced that view for 2000 years, it wouldn't have the stains on its history that it most definitely carries and I'd be married to my partner right now. Even so, I would still see religion for what it is, a human construct.\n \n \nWhen a person goes so far as to try to legitimize their lifestyle (yes, I used the \"L\" word!!! emoticon_wow No, it's not referring to anything other than homosexual sex and relationships) by trying to piggyback off institutions held dear by the rest of society, and then has the gall to call it a \"pursuit of happiness\" (when you can get married to a gay person now), it only goes to show why state after state is rejecting your movement. The govt. benefits just ain't gonna bring happiness to your life.\n\n \n Does it matter what I piggyback on? I'm either entitled to life, liberty and the pursuit of happiness or I'm not. In your book, I'm not. Religious bigotry trumped \"Christian principles\". Quelle surprise!\n \n P.S. You're sounding awfully selfish about those things you hold dear.", 
   {}, 
   107397, 
   null, 
   1113517920.0
  ], 
  [
   107417, 
   null, 
   "joebrummer", 
   "Hey, JP!! \n \n Have you noticed that they're usually arguing their case from the standpoint that it's unconstitutional to not do things the way they want, and yet the minute they are faced with constitutional basis that marriage isn't for same-sex relationships, they move on to other things, as if they were never holding up the constitutional mantra to begin with? (\"Oh, well, THAT constitution is just wrong.\") It only goes to show it's not about rights at all, but validifying homosexual behavior, and it always has been.\n \n Where will they turn for validity when an even higher court rules that there is no constitutional basis for redefining marriage??\n\n \n Opposite sexed couples should have marriage just for them, they are so much better than gay couples and of course fat more superiour to gay couples. Who cares if the gay couples need marriage to protect their realtionships. It is not important as long as we protect marriage as one man,one women. Even if that is wrong. Even if it creates second class citizens. I don't care. It doesn't effect my straight self. Why should I care. [/sarcasm]", 
   {}, 
   107411, 
   null, 
   1113518040.0
  ], 
  [
   107418, 
   null, 
   "JustineCredible", 
   "It never ceases to amaze me that some refuse to try and see how so many people embrace religion, not because of it's restrictions or rules (which is often the athiest's only portrayal of it) but because of the freedom it brings. It's hard to understand how someone can read the writings of Christ and not see how he would support life and liberty, as well as the pursuit of happiness--indeed life, liberty, and the pursuit of happiness ARE Christian ideals, and only someone prejudiced against religion could possibly try so hard to purge religious influence from the founders' thinking through modern revisionism.\n\n \n You're right, it's not modern revisionism, it's traditional revisionism. Christ didn't write any part of the Bible, darlin. \n \n \n \n \nWhen a person goes so far as to try to legitimize their lifestyle (yes, I used the \"L\" word!!! emoticon_wow No, it's not referring to anything other than homosexual sex and relationships) by trying to piggyback off institutions held dear by the rest of society, and then has the gall to call it a \"pursuit of happiness\" (when you can get married to a gay person now), it only goes to show why state after state is rejecting your movement. The govt. benefits just ain't gonna bring happiness to your life.\n\n \n Oh right, and so women should not vote because the majority of society still believes women are chattle. Or should it be that seggragation should be reinstated because why again? Oh that's right, thier lifestyles are so different. \n \n Just be honnest, you have no rational argument against gay marriage. The falicies and out & out lies you use are disproven time and again. Yet, you still hold fast to your claim that somehow homosexuality or homosexuals themselves (or whatever your claim this week) are somehow immoral, when you can't even admit that your idea of morality is simply derrived from your religioius intollerence, but that our laws are NOT based in once specific religioius idealism. Nor where they ever intended to be.\n \n You can keep your idea of marriages as \"near and dear\" all you want, but do not even assume that your idea of it is the ONLY view of it. Also do not dilude yourself to believe that marriage is in any way a religious institution. \n Do not attempt to deny others access to marriage because you are so blind to others views or ideals. Understand and realize that your contention is purely based on your religious intollerances and bigotry. Pure and simple.", 
   {}, 
   107397, 
   null, 
   1113518040.0
  ], 
  [
   107420, 
   null, 
   "Jaxian", 
   "It never ceases to amaze me that some refuse to try and see how so many people embrace religion, not because of it's restrictions or rules (which is often the athiest's only portrayal of it) but because of the freedom it brings. It's hard to understand how someone can read the writings of Christ and not see how he would support life and liberty, as well as the pursuit of happiness--indeed life, liberty, and the pursuit of happiness ARE Christian ideals, and only someone prejudiced against religion could possibly try so hard to purge religious influence from the founders' thinking through modern revisionism.\n\n \n Remember that it was incredibly difficult for anyone before Locke to use the Bible to justify life, liberty, and the persuit of happiness. In medival times, for example, most people used the Bible to justify kings, slavery, and subservience of women. If you'd told them that the Bible supports life, liberty, and happiness, they would have laughed.\n \n Many believed in a different interpretation of the Bible, one which does support life, liberty, and happiness, and they slowly worked to change the view of the church until we arrived at our modern interpretation.\n \n \nWhen a person goes so far as to try to legitimize their lifestyle (yes, I used the \"L\" word!!! emoticon_wow No, it's not referring to anything other than homosexual sex and relationships) by trying to piggyback off institutions held dear by the rest of society, and then has the gall to call it a \"pursuit of happiness\" (when you can get married to a gay person now), it only goes to show why state after state is rejecting your movement. Govt. benefits just ain't gonna bring happiness to your life.\n\n \n Isn't legitimizing one's lifestyle part of the persuit of happiness? Doesn't everyone have the right to try to speak his opinion, to change people's minds? That isn't gall, that's freedom, that's happiness, that's liberty. But denying someone access to the same rights and institutions that you have simply because you don't want their lifestyle validated, now that's what is really wrong. That's destruction of freedom, an attack on happiness. We're not talking about forcing this lifestyle on anyone, we're not talking about special treatment; we're talking about the same treatment, exactly the same. Deny some people the same treatment, the same chance at proving the worth of their lifestyle that you have of yours, and you've done them wrong.\n \n People are voting against same-sex marriage because they've been taught all their lives that it's wrong or because they want to punish people for asking for equality. Those aren't good reasons, those are evil reasons.", 
   {}, 
   107397, 
   null, 
   1113518160.0
  ], 
  [
   107422, 
   null, 
   "BobNelson2", 
   "Hey, JP!! \n \n Have you noticed that they're usually arguing their case from the standpoint that it's unconstitutional to not do things the way they want, and yet the minute they are faced with constitutional basis that marriage isn't for same-sex relationships, they move on to other things, as if they were never holding up the constitutional mantra to begin with? (\"Oh, well, THAT constitution is just wrong.\") It only goes to show it's not about rights at all, but validifying homosexual behavior, and it always has been.\n\n \n What are you talking about?", 
   {}, 
   107411, 
   null, 
   1113518160.0
  ], 
  [
   107423, 
   null, 
   "wsm2506", 
   "When reason and logic and all else fail, they resort to religion.", 
   {}, 
   107422, 
   null, 
   1113518280.0
  ], 
  [
   107431, 
   null, 
   "JustineCredible", 
   "When reason and logic and all else fail, they resort to religion.\n\n \n What else would you expect from sheeple?", 
   {}, 
   107423, 
   null, 
   1113518580.0
  ], 
  [
   107436, 
   null, 
   "tonybrown74", 
   "So either way, we cant say. but you shouldnt tell me it was a dishonest answer.\n\n \n \n But it was. You were the one to bring it up, to somehow \"prove\" that you were not bigotted.\n \n \"I would have marched with MLK, so therefore you cannot call me a bigot!\"\n \n Puh-bloody-lease ... emoticon_rolleyes", 
   {}, 
   107365, 
   null, 
   1113518640.0
  ], 
  [
   107439, 
   null, 
   "jyoshu", 
   "Remember that it was incredibly difficult for anyone before Locke to use the Bible to justify life, liberty, and the persuit of happiness. In medival times, for example, most people used the Bible to justify kings, slavery, and subservience of women. If you'd told them that the Bible supports life, liberty, and happiness, they would have laughed.\n\n \n While I understand what you are saying, I see it differently. Religion was one of the few things medieval people had to hold onto--it WAS a source of happiness to many I'm sure, in the midst of a harsh era (the plague, hard work, terrible sanitary conditions, etc.) \n \n I agree with you though that there were times that governments and the Church mis-used religion to justify evil things. On the other hand, there were good popes as well, and the most we can say is that religion was misused at times throughout history. Nevertheless, for the context of this discussion, I think religion in modern times is more to the point than the use (or really misuse) of the Bible in medieval times.\n \n \nIsn't legitimizing one's lifestyle part of the persuit of happiness? Doesn't everyone have the right to try to speak his opinion, to change people's minds? That isn't gall, that's freedom, that's happiness, that's liberty.\n\n \n There's no such thing as TOTAL uninhibited liberty. If we had that, we'd have anarchy. That goes for both civil law and 'natural law.' What this discussion ultimately is about is drawing limiting lines: you want the line drawn somewhere PAST gay marriage, and most of the country wants it drawn before gay marriage. I happen to agree with the rest of the country, because drawing the line past gay marriage is to redefine what marriage is. With that said, if there are benefits you need, I say let's find a way to give them to you.\n \n Regarding happiness: you'll never find true happiness in benefits from the government.", 
   {}, 
   107420, 
   null, 
   1113518880.0
  ], 
  [
   107440, 
   null, 
   "jyoshu", 
   "What else would you expect from sheeple?\n\n \n Hey, that was a \"baaaaaad\" thing to say. :p", 
   {}, 
   107431, 
   null, 
   1113518940.0
  ], 
  [
   107455, 
   null, 
   "wsm2506", 
   "Hey, that was a \"baaaaaad\" thing to say. :p\n\n \n Aren't you a part of the flock?", 
   {}, 
   107440, 
   null, 
   1113519540.0
  ], 
  [
   107463, 
   null, 
   "Jaxian", 
   "While I understand what you are saying, I see it differently. Religion was one of the few things medieval people had to hold onto--it WAS a source of happiness to many I'm sure, in the midst of a harsh era (the plague, hard work, terrible sanitary conditions, etc.) \n \n I agree with you though that there were times that governments and the Church mis-used religion to justify evil things. On the other hand, there were good popes as well, and the most we can say is that religion was misused at times throughout history. Nevertheless, for the context of this discussion, I think religion in modern times is more to the point than the use (or really misuse) of the Bible in medieval times.\n\n \n I guess my point is that if the Bible can be so misued, so misinterpreted in the past, then there is no reason to believe that it is not happening again. This wasn't the common man holding onto the Bible who made these claims; it was scholars and authors, people who wanted to justify holding on to their traditional ways, even though their old ways are certainly wrong.\n \n \nThere's no such thing as TOTAL uninhibited liberty. If we had that, we'd have anarchy. That goes for both civil law and 'natural law.' What this discussion ultimately is about is drawing limiting lines: you want the line drawn somewhere PAST gay marriage, and most of the country wants it drawn before gay marriage. I happen to agree with the rest of the country, because drawing the line past gay marriage is to redefine what marriage is. With that said, if there are benefits you need, I say let's find a way to give them to you.\n\n \n Remember that gay marriage is not further down the line than straight marriage. It would certainly be possible to allow gay marriage but draw the line when it comes to straight marriage. Remember further that with the majority of rights held by our citizens we choose to draw no line, to give that right to everyone. This includes breathing, eating, jumping, dancing, crying, walking, and billions of other actions that are allowed to everyone under the law. Now certainly there are some benefits for which we must draw a line, but we only do so when it is more beneficial to everyone to stop people from having that freedom. This is not true of same-sex marriage. \n \n The line can be drawn around both same-sex and opposite-sex couples, and although this would change our current legal definition of marriage, there is absolutely no reason to believe that doing so is a bad idea. We change laws every day, and we change them because our old ways weren't as good. Again, the fact that marriage is being redefined is no reason at all not to do it; it is simply a statement of what we want to do. Only explaining why marriage should not be redefined can validate your argument.\n \n \nRegarding happiness: you'll never find true happiness in benefits from the government.\n\n \n No? Well, why not tell that to anyone in the past who has been denied equal treatment under the law? Why not tell that to slaves, the oppressed, the victims of genocide? Benefits under the law aren't everything, but they mean a lot.\n \n I can say with certainty, though, that I will never find true happiness if I sit around while good people are denied benefits under the law without a good reason. I won't be the one to let this atrocity stand unchallenged.", 
   {}, 
   107439, 
   null, 
   1113519960.0
  ], 
  [
   107475, 
   null, 
   "JustineCredible", 
   "Hey, that was a \"baaaaaad\" thing to say. :p\n\n \n Whew...I'm glad to see you caught that bit of humor. :)", 
   {}, 
   107440, 
   null, 
   1113520380.0
  ], 
  [
   107484, 
   null, 
   "jyoshu", 
   "I guess my point is that if the Bible can be so misued, so misinterpreted in the past, then there is no reason to believe that it is not happening again. This wasn't the common man holding onto the Bible who made these claims; it was scholars and authors, people who wanted to justify holding on to their traditional ways, even though their old ways are certainly wrong.\n\n \n Indeed, it can certainly be misused and is from time to time. I still feel however that a correct interpretation of the Bible is that it (in it's way) is about life, liberty, and happiness. But that doesn't mean liberty doesn't have to have some boundaries at some point.\n \n \nRemember that gay marriage is not further down the line than straight marriage. \n\n \n On what do you base this?\n \n \nNo? Well, why not tell that to anyone in the past who has been denied equal treatment under the law? Why not tell that to slaves, the oppressed, the victims of genocide? Benefits under the law aren't everything, but they mean a lot.\n\n \n Freeing someone from slavery is not the same as granting them benefits over and above a life of freedom. Gay people aren't prevented from marrying each other, they just don't get the benefits that are given for it. Gay people aren't owned or traded like property. What you might portray as oppression is really just not getting benefits that are over and above an already free life. That doesn't mean you shouldn't get those benefits--in fact you should. But even as a straight person who is married, if the govt. suddenly decided to stop giving me marriage benefits, I'd still be free and still be living in a free country. This isn't like not having the right to vote or being enslaved. It's about benefits over and above a life of freedom already. Remember, single people don't get those benefits either, but we don't consider them oppressed for it.", 
   {}, 
   107463, 
   null, 
   1113520920.0
  ], 
  [
   107487, 
   null, 
   "BobNelson2", 
   "While I understand what you are saying, I see it differently. Religion was one of the few things medieval people had to hold onto--it WAS a source of happiness to many I'm sure, in the midst of a harsh era (the plague, hard work, terrible sanitary conditions, etc.) \n\n \n An era that religion helped initiate and perpetuated for hundreds and hundreds of years. An era that ended only when people started to look back to what came before Christianity and started to communicate with those who had been spared the imposition of the \"true faith\".\n \n \nI agree with you though that there were times that governments and the Church mis-used religion to justify evil things. On the other hand, there were good popes as well, and the most we can say is that religion was misused at times throughout history. Nevertheless, for the context of this discussion, I think religion in modern times is more to the point than the use (or really misuse) of the Bible in medieval times.\n\n \n During what percentage of the past 2000 years, with Christianity swinging back and forth between liberating and oppressing, did the Church (or churches) treat gay people well?\n \n You're asking us to give the benefit of the doubt to an institution that has pummelled us for centuries, right up to the present.\n \n Now remember, before you answer, that whenever we have brought up those very very few occasions when Christianity recognized gay couples, you have scoffed at them as \"misunderstood\" and \"self-serving\".\n \n \n \nRegarding happiness: you'll never find true happiness in benefits from the government.\n\n \n Of course not, but you can sure find misery and pain when it withholds equal treatment.", 
   {}, 
   107439, 
   null, 
   1113521220.0
  ], 
  [
   107489, 
   null, 
   "VTCruiser", 
   "But it was. You were the one to bring it up, to somehow \"prove\" that you were not bigotted.\n \n \"I would have marched with MLK, so therefore you cannot call me a bigot!\"\n \n Puh-bloody-lease ... emoticon_rolleyes\n\n \n oh cmon, there you go again.. tellin me i wouldnt have done it.. emoticon_wow", 
   {}, 
   107436, 
   null, 
   1113521280.0
  ], 
  [
   107492, 
   null, 
   "jyoshu", 
   "An era that religion helped initiate and perpetuated for hundreds and hundreds of years. An era that ended only when people started to look back to what came before Christianity and started to communicate with those who had been spared the imposition of the \"true faith\".\n\n \n Oh come on. Organized religion can't be blamed for the plague, low life expectancy, or the sanitary conditions of the middle ages. I suppose next you'll be blaming it for earthquakes and typhoons. And there are very valid arguments that the rennaissance and enlightenment didn't so much come about as a rebellion against religion, but as a result of it--an advancement of it. There were many factors afoot including the protestant reformation.\n \n \nDuring what percentage of the past 2000 years, with Christianity swinging back and forth between liberating and oppressing, did the Church (or churches) treat gay people well?\n\n \n Bob, \"gay\" wasn't even an issue until recently (relatively speaking of course).\n \n \nYou're asking us to give the benefit of the doubt to an institution that has pummelled us for centuries, right up to the present.\n\n \n Who said I'm asking you to give them the benefit of the doubt?", 
   {}, 
   107487, 
   null, 
   1113521640.0
  ], 
  [
   107499, 
   null, 
   "BobNelson2", 
   "Oh come on. Organized religion can't be blamed for the plague, low life expectancy, or the sanitary conditions of the middle ages. I suppose next you'll be blaming it for earthquakes and typhoons. And there are very valid arguments that the rennaissance and enlightenment didn't so much come about as a rebellion against religion, but as a result of it--an advancement of it. There were many factors afoot including the protestant reformation.\n\n \n Yeah, whatever.\n \n By the way, blaming people for earthquakes and typhoons is part of YOUR side's proud heritage, not mine.\n \n \nBob, \"gay\" wasn't even an issue until recently (relatively speaking of course).\n\n \n Use whatever word you want and answer the question.", 
   {}, 
   107492, 
   null, 
   1113522540.0
  ], 
  [
   107502, 
   null, 
   "Duo_Maxwell", 
   "Oh come on. Organized religion can't be blamed for the plague, low life expectancy, or the sanitary conditions of the middle ages.\n\n \n Actually it can. Organized religion during the middle ages is a reason science and reason died out. Sanitary conditions during the roman period, which valued science were at a all time high for the era. Life expectancy as well, and the plague, well, it wasn't half as bad during Roman years then during the middle ages.", 
   {}, 
   107492, 
   null, 
   1113522780.0
  ], 
  [
   107589, 
   null, 
   "JPSartre12", 
   "I read the writings of christ but if you are gay they don't offer any of what you have said. My reasons for being athiest have nothing to do with being gay, but none the less. Laws in this country are not and cannot be based on one religion or any religion. Why can't you understand that is the best for everyone muslim, jewish, chrisitian and even atheist.\n\n Laws in this country are based on the morals of the citizens...who just so happen to be predominantly Christian. You can't change the fact that the majority of Americans are Christians and are comfortable with their Christian values.\n \n\n No govermnent anything won't bring happiness, but it can protect the happiness you have. I could give you lists of stuff in my relationship that are not protected things because the government is either going to tax it or just doesn't recognize us as anything more than strangers. Civil Unions would be fine if they carried the same weight, but they don't and never will. If you were in a relationship and had a house, kids, investments and the goverment didn't recognize you as anything more than strangers. You would fight to.\n \n If by chance someday, either partner or I have to go to a nursing home, we are screwed. The other will lose the house and we cannot stop that. Married people can stop it. We also wouldn't be able to stay together in a nursing home. We would be separated and can do nothing about it. Married people are kept together by law.\n \n When we travel to visit my parents in Virginia, our \"documents\" deignating each other as the one to make medical decisions wouldn't be honored if something should happen. THe hospital could infact stop us from making those decision because of the wording of their ammendment regarding marriage. That is why we don't go to virginia. We make my parents come here.\n \n I could go on and on with stuff just like this. Civil Unions are like \"marriage lite\". They just dont' have the same wieght.\n\n \n Then why not fight to make the rights of civil unions equivalent to the rights granted a married couple without the term marriage? The all or nothing approach is going to net you NOTHING. Just look at today's Oregon Supreme Court ruling. The handwriting's on the wall. Chirstians have drawn the line at marriage and it'll take more than Sherman's Army to cross it.\n I'm about as Conservative as they come, but I'm also a strong believer in fairness. If someone like me can live with civil unions that have all the benefits of marriage, surely you can sell it to moderate and liberal Christians, can't you? Just leave out the word marriage. It holds too much religious significance that you just aren't going to shake, no matter how hard you try.", 
   {}, 
   107413, 
   null, 
   1113540540.0
  ], 
  [
   107597, 
   null, 
   "JPSartre12", 
   "Were you to read the full decision, you might emphasize differently.\n \n http://www.publications.ojd.state.or.us/S51612.htm\n\n \n \n\n ......\n Based on the foregoing, we conclude that the use of the word \"policy\" in Measure 36 is intended to signal a presently enforceable tenet of Oregon constitutional law. And, with respect to the remaining text, there is no ambiguity regarding the measure's substantive effect. Today, marriage in Oregon -- an institution once limited to opposite-sex couples only by statute -- now is so limited by the state constitution as well. As the later-enacted (and more specific) constitutional provision, Measure 36 resolves any prospective claims that plaintiffs may have had under Article I, section 20, to obtain marriage licenses. The claims of the five same-sex couples that they are entitled as a matter of state law, now or hereafter, to obtain marriage licenses and to marry thus fail.\n ......\n Accordingly, plaintiffs urge this court to conclude that the voters did not intend to hinder this court from fashioning a remedy in these appeals that extends such benefits to same-sex couples. However, the issue of the availability of marriage benefits to same-sex couples is not properly before us. At trial, plaintiffs did not seek access to the benefits of marriage apart from, or as an alternative to, marriage itself. The trial court therefore improperly went beyond the pleadings in fashioning the particular remedy that it chose. We do not address that topic further.\n \n The foregoing cases demonstrate that the state and, more specifically, the legislature, is the locus of power over marriage-related matters in Oregon. If that power is broad enough to preempt other states' contrary marriage policies, it inescapably is broad enough to preempt similar policies generated by a political subdivision of this state, such as the county. It is true that nothing in ORS chapter 106 expressly reserves exclusive authority over marriage to the state; however, we cannot ignore this court's jurisprudence that expressly recognizes that exclusive authority, absent some clear legislative directive to the contrary. We conclude that Oregon law currently places the regulation of marriage exclusively within the province of the state's legislative power.\n ........\n In summary, we conclude as follows. First, since the effective date of Measure 36, marriage in Oregon has been limited under the Oregon Constitution to opposite-sex couples. Second, Oregon statutory law in existence before the effective date of Measure 36 also limited, and continues to limit, the right to obtain marriage licenses to opposite-sex couples. Third, marriage licenses issued to same-sex couples in Multnomah County before that date were issued without authority and were void at the time that they were issued, and we therefore need not consider the independent effect, if any, of Measure 36 on those marriage licenses. In short, none of plaintiffs' claims properly before the court is well taken. Finally, the abstract question whether ORS chapter 106 confers marriage benefits in violation of Article I, section 20, of the Oregon Constitution is not properly before the court.\n \n The judgment of the circuit court is reversed, and the case is remanded to the circuit court with instructions to dismiss the action.\n\n \n That translated into a 4 - 0 shutout. All four claims were denied.", 
   {}, 
   107402, 
   null, 
   1113542280.0
  ], 
  [
   107599, 
   null, 
   "JakeCJB", 
   "JP Sartre:\n What Christians are you speaking of? They are not all of the same mind on this issue. They don't all have the same morality. A group practicing a morality or belief or way of being, that is different from the majority, is not reason alone to deny that group full rights. \n \n If the handwriting is on the wall from what happened in Oregon, it is also on the wall from what has happened in Mass. and New York.", 
   {}, 
   107589, 
   null, 
   1113542340.0
  ], 
  [
   107601, 
   null, 
   "BobNelson2", 
   "I'm about as Conservative as they come, but I'm also a strong believer in fairness. \n\n \n Looks like you're seriously out of step with your party.", 
   {}, 
   107589, 
   null, 
   1113542580.0
  ], 
  [
   107602, 
   null, 
   "BobNelson2", 
   "That translated into a 4 - 0 shutout. All four claims were denied.\n\n \n Good lord, man, have the intellectual honesty to recognize what the court is saying. It's a 3 - 0 shutout. They chose not to recognize the fourth pitch.\n \n \n Your original post included this line in BOLD:\n \n <<\"Today, marriage in Oregon - an institution once limited to opposite-sex couples only by statute - now is so limited by the state Constitution as well,\" the court ruling said.<<\n \n The court quite clearly says that it did not take up the issue of whether that statute was constitutional because the issue was not raised properly. Now, at least under Oregon law, the issue is moot.", 
   {
    "unicode_changes_made": true
   }, 
   107597, 
   null, 
   1113542820.0
  ], 
  [
   107611, 
   null, 
   "JustineCredible", 
   "Oh come on. Organized religion can't be blamed for the plague, low life expectancy, or the sanitary conditions of the middle ages. I suppose next you'll be blaming it for earthquakes and typhoons. And there are very valid arguments that the rennaissance and enlightenment didn't so much come about as a rebellion against religion, but as a result of it--an advancement of it. There were many factors afoot including the protestant reformation.\n\n \n Now you're conveniently fogetting the Puritans of those periods which routinely burned \"witches\", banished theives and decievers and forced adulterers to wear the letter \"A\" on their chests...and no, I'm not confusing puritan America with Puritan Europe. During the English and Spanish renaissance England broke away from the RCC to form it's own church because good ol' Hank 8 wanted a divorce from his first wife, Catherine of Aragon, 1534. (Yeah, I know just a wee bit about Renaissance England and the role religion played...which by the way was England's entire political basis at the time). It did, however, rejoin the RCC briefly during the reign of Queen Mary 1, in 1555. \n \n Don't even attempt to give me that \"because of religion\" line, it just isn't going to fly.", 
   {}, 
   107492, 
   null, 
   1113546420.0
  ], 
  [
   107642, 
   null, 
   "jyoshu", 
   "Good lord, man, have the intellectual honesty to recognize what the court is saying. It's a 3 - 0 shutout. They chose not to recognize the fourth pitch.\n \n Your original post included this line in BOLD:\n \n <<\"Today, marriage in Oregon - an institution once limited to opposite-sex couples only by statute - now is so limited by the state Constitution as well,\" the court ruling said.<<\n \n The court quite clearly says that it did not take up the issue of whether that statute was constitutional because the issue was not raised properly. Now, at least under Oregon law, the issue is moot.\n\n \n Heh, well I guess if you try hard enough you can always try to read a silver lining into it somewhere . . .\n \n \nNow you're conveniently fogetting the Puritans of those periods which routinely burned \"witches\", banished theives and decievers and forced adulterers to wear the letter \"A\" on their chests...and no, I'm not confusing puritan America with Puritan Europe. During the English and Spanish renaissance England broke away from the RCC to form it's own church because good ol' Hank 8 wanted a divorce from his first wife, Catherine of Aragon, 1534. (Yeah, I know just a wee bit about Renaissance England and the role religion played...which by the way was England's entire political basis at the time). It did, however, rejoin the RCC briefly during the reign of Queen Mary 1, in 1555. \n\n \n The puritans came later than medieval times, (which was our context), well after the rennaissance was well under way and after the pre-reformation church. No one is claiming the church didn't go astray at some points in history, or that they didn't misinterpret or misuse the scriptures.\n \n \nActually it can. Organized religion during the middle ages is a reason science and reason died out. Sanitary conditions during the roman period, which valued science were at a all time high for the era. Life expectancy as well, and the plague, well, it wasn't half as bad during Roman years then during the middle ages.\n\n \n Science didn't die out. There was science in the middle ages, just not the emphasis there was in the rennaissance. If I were you, I wouldn't hold the Roman Empire up as any glorious standard of human achievement; it was a culture laden with periods of oppression, forced take-overs, slavery, gladiator combat (in certain periods), etc. And they weren't as advanced scientifically as other cultures of their time, such as China in the far east. \n \n There are many reasons why the middle ages were troublesome; laying the blame squarely at the feet of the religious establishment may be convenient, but it just isn't accurate. One could more easily blame trade for the plague, since some theories have the plague originating from the far east and wiping out Europeans because they had no immunity built up to it.", 
   {
    "unicode_changes_made": true
   }, 
   107602, 
   null, 
   1113576420.0
  ], 
  [
   107676, 
   null, 
   "VTCruiser", 
   "So what? Is anyone forcing you to engage in actions of which you do not agree? If not, how is it affecting you in any way? \n\n \n Its not how it affects me, but how it affects society which i happen to be a part of.\n \n \n\n Good for you, I'm glad you have your religion, but you do not have the right to force anyone but yourself to follow your religion or your religious views. \n\n \n Well, then i guess you think the founding fathers forced it down on everyone as well.. Where will you pull your moral basis as a nation from if its not the Bible?? This is the reason why our founding fathers used it as a reference in writing out our laws.. Who do you think created the idea of freedom and the idea of having laws???? This wasnt a manmade idea..\n \n \n \n\n Oh so you have no control over your own actions or the words you use? Honey, that's not religion or sin, it's a mental disorder and you need treatment for it.\n\n \n what the heck, that made absolutetly no sense.. I dont come out sayin you have some mental disorder, so at least be decent and try having a conversation without acting the way you are arguing we are acting.. (dissenting and demeaning) (which i havent demeaned anyone on this post yet just to let you know)", 
   {}, 
   107376, 
   null, 
   1113584340.0
  ], 
  [
   107681, 
   null, 
   "wsm2506", 
   "Its not how it affects me, but how it affects society.\n\n \n Please explain just what those effects on sociery would be.", 
   {}, 
   107676, 
   null, 
   1113584640.0
  ], 
  [
   107685, 
   null, 
   "VTCruiser", 
   "Please explain just what those effects on sociery would be.\n\n \n well, please tell me how it wouldnt affect society in a bad way and actually be good for it.. Cause there are too many things to list for it to be a downfall.", 
   {}, 
   107681, 
   null, 
   1113584760.0
  ], 
  [
   107686, 
   null, 
   "wsm2506", 
   "well, please tell me how it wouldnt affect society in a bad way and actually be good for it.. Cause there are too many things to list for it to be a downfall.\n\n \n Look, you stated it would effect society, I didn't. It is up to you to support your statement, not for me to disprove it.\n \n If there are so many, surely you can come up with at least a few.", 
   {}, 
   107685, 
   null, 
   1113584940.0
  ], 
  [
   107687, 
   null, 
   "Jo Bennett", 
   "I would just like to remind people that opression of gay people is not a Christian value by any stretch of the imagination. All supposed references to homosexuality in the Bible are subject to dispute about translation. If certain translations are correct then there are no references to homosexuality in the Bible, if any of them are correct then there is no condemnation of loving, committed same sex relationships, and even if you interpret that there is, then it only applies to men, and not to women.", 
   {}, 
   107685, 
   null, 
   1113585120.0
  ], 
  [
   107689, 
   null, 
   "Jaxian", 
   "well, please tell me how it wouldnt affect society in a bad way and actually be good for it.. Cause there are too many things to list for it to be a downfall.\n\n \n Two of my earlier response to CvT might help you understand both what the benefits of same-sex marriage are and why the burden of proving harm is on the people who seek to deny same-sex marriage. They are here:\n \n http://www.4forums.com/political/showpost.php?p=106736&postcount=60\n and\n http://www.4forums.com/political/showpost.php?p=107237&postcount=65\n \n Both are from the \"Legalizing same-sex marriage improves everybody's rights\" thread. The first one is probably more relevant, as it describes the benefits of same-sex marriage as I see them. Both are relevant though, because they discuss why, even if same-sex marriage had no benefits, it should still be allowed if there are no harms.", 
   {}, 
   107685, 
   null, 
   1113585180.0
  ], 
  [
   107702, 
   null, 
   "jyoshu", 
   "I would just like to remind people that opression of gay people is not a Christian value by any stretch of the imagination. \n\n \n Of course not. I don't think anyone here is arguing that it is. Even those that typically oppose marriage benefits for gay couples are not trying to get anyone \"oppressed.\"", 
   {}, 
   107687, 
   null, 
   1113586740.0
  ], 
  [
   107710, 
   null, 
   "joebrummer", 
   "Of course not. I don't think anyone here is arguing that it is. Even those that typically oppose marriage benefits for gay couples are not trying to get anyone \"oppressed.\"\n\n \n \n We know that from you, but from reading VT Crusier' s posts I am not so sure. He doesn't seem to favor gays having any rights. See as though he calls them \"special rights\" he doesn't seem to agree there is a need for gay rights. You have never expressed that he has.", 
   {}, 
   107702, 
   null, 
   1113587400.0
  ], 
  [
   107718, 
   null, 
   "JustineCredible", 
   "Its not how it affects me, but how it affects society which i happen to be a part of.\n\n \n Oh now that's just the lamest cop-out yet. Gays aren't the downfall of society and you know it. It's these Extremist Evangelicals that are ruining our American Society. Denying these rights, removing others, attempting to tamper with our Constitution...these are the people who are going to be downfall of America. They aren't protecting it, they aren't pro-marriage or even pro-life. They want what they want, when they want it...everyone else be damned. \n You want to protect marriage? Then protest divorce, protest adultery...but don't deny marriage to those of US who actually want it. That's counter productive and you know it. \n \n \n \nWell, then i guess you think the founding fathers forced it down on everyone as well.. Where will you pull your moral basis as a nation from if its not the Bible?? This is the reason why our founding fathers used it as a reference in writing out our laws.. Who do you think created the idea of freedom and the idea of having laws???? This wasnt a manmade idea..\n\n \n Please, the founding fathers never once quoted scripture in making our laws. They didn't site their specific idea of \"God\" or \"Christianity\" for that matter. They purposefully left the wording vague so that those who believed differently could interpret it as it fit their lives. Morality isn't \"Christian\" in origin. The world wasn't amorral before \"Christians\" came along. That's rediculous to even suggest so. Ancient pre-christian cultures had laws and order WAY before Christianity ever came along and destroyed their cultures. \n Even your Christian holidays were STOLLEN from Pagan traditions. So, don't you dare attempt to sell me your \"who do you think created the idea of freedom and the idea of having laws\" because it's bunk. Pure and simple. \n \n \n \n \nwhat the heck, that made absolutetly no sense.. I dont come out sayin you have some mental disorder, so at least be decent and try having a conversation without acting the way you are arguing we are acting.. (dissenting and demeaning) (which i havent demeaned anyone on this post yet just to let you know)\n\n \n I never said \"dissenting and demeaning\" and you know it. What I did say was that if you do not have control of your own actions you have a problem. Most humans have some knowledge of right and wrong, derrived from society, school, parents..etc. Not everyone learns these principles from religion. The presumption that one is unable to control one's own actions but for religion is wholey absurd.", 
   {}, 
   107676, 
   null, 
   1113588360.0
  ], 
  [
   107835, 
   null, 
   "BobNelson2", 
   "I would just like to remind people that opression of gay people is not a Christian value by any stretch of the imagination. \n\n \n What an odd thing to say. Today, after a century-long struggle by gay people to be treated decently, many (certainly not all) Christians have bought enough of our argument to no longer want to lock us up or lobotomize us. It may no longer be a \"value\" today, but it most certainly was a well-documented, nearly continuous policy for much of the previous 1500 years.", 
   {}, 
   107687, 
   null, 
   1113600060.0
  ], 
  [
   107837, 
   null, 
   "BobNelson2", 
   "laying the blame squarely at the feet of the religious establishment may be convenient, but it just isn't accurate. \n\n \n Speaking of convenient, how about going from \"contributing\" (my assertion) to \"laying the blame squarely at the feet\" (your transparent distortion).", 
   {}, 
   107642, 
   null, 
   1113600180.0
  ], 
  [
   107849, 
   null, 
   "jyoshu", 
   "Speaking of convenient, how about going from \"contributing\" (my assertion) to \"laying the blame squarely at the feet\" (your transparent distortion).\n\n \n If you feel so sure I was directly referring to you, (especially when that section of my post was clearly responding to someone else) then you must have an awfully guilty conscience. ;)", 
   {}, 
   107837, 
   null, 
   1113602340.0
  ], 
  [
   107851, 
   null, 
   "Jo Bennett", 
   "What an odd thing to say. Today, after a century-long struggle by gay people to be treated decently, many (certainly not all) Christians have bought enough of our argument to no longer want to lock us up or lobotomize us. It may no longer be a \"value\" today, but it most certainly was a well-documented, nearly continuous policy for much of the previous 1500 years.\n\n \n The church has done and does do many things that are, as best I can tell, not Christian, the oppression of gays, I am sorry to say, was and is one of them. Another was the subjugation of women, which thankfully is gradually being eradicated. Catholic priests also molested small boys for a long time. That does not make it a Christian value.", 
   {}, 
   107835, 
   null, 
   1113602460.0
  ], 
  [
   107857, 
   null, 
   "jyoshu", 
   "The church has done and does do many things that are, as best I can tell, not Christian, the oppression of gays, I am sorry to say, was and is one of them. Another was the subjugation of women, which thankfully is gradually being eradicated. Catholic priests also molested small boys for a long time. That does not make it a Christian value.\n\n \n The church (both Catholic and Protestant) has also done many wonderful things throughout history, whether it be feeding the hungry, taking care of orphans, or helping the poor and poverty-stricken. They still do at lo of this. In fact overall, there is most likely more humanitarian work being done by churches now than ever before.", 
   {}, 
   107851, 
   null, 
   1113603000.0
  ], 
  [
   107863, 
   null, 
   "Jo Bennett", 
   "Yes... I know that, my church has recently been campaigning to MakePovertyHistory as part of a national campaign here. I'm not sure how it's relevant to the topic at hand though.", 
   {}, 
   107857, 
   null, 
   1113603660.0
  ], 
  [
   107867, 
   null, 
   "jyoshu", 
   "Yes... I know that, my church has recently been campaigning to MakePovertyHistory as part of a national campaign here. I'm not sure how it's relevant to the topic at hand though.\n\n \n It's not necessarily, except that I feel when the church is described only in terms of its dark times and problems, I prefer to show the other side as well.", 
   {}, 
   107863, 
   null, 
   1113604080.0
  ], 
  [
   107869, 
   null, 
   "Duo_Maxwell", 
   "Science didn't die out.\n\n \n For the time in the middle ages, yes it for general purposes did. \n \n \nThere was science in the middle ages, just not the emphasis there was in the rennaissance.\n\n \n Alright, I'll agree there was 'science'. Just a tiny bit with no reasoning behind it. Look at the scientific advancement during the middle ages. You can sum it up with a word: Nothing. \n \n \nIf I were you, I wouldn't hold the Roman Empire up as any glorious standard of human achievement; it was a culture laden with periods of oppression, forced take-overs, slavery, gladiator combat (in certain periods), etc. And they weren't as advanced scientifically as other cultures of their time, such as China in the far east. \n\n \n True, they were a oppressive goverment, but they were scientifically advanced over the fuedal kingdoms of the middle ages. Life spans were longer, diseases were less widescale, and scientific advancement was far more progressive then the middle ages. However, I'm not holding them up as glorious, merely a standard in which science, which was supported, have clear beneficial outcomes. \n \n \n\n There are many reasons why the middle ages were troublesome; laying the blame squarely at the feet of the religious establishment may be convenient, but it just isn't accurate. One could more easily blame trade for the plague, since some theories have the plague originating from the far east and wiping out Europeans because they had no immunity built up to it.\n\n \n Perhaps, but that is ignorant, and your claims are hardly accurate. That assumes no such disease ever occured in roman times. Laughable. Besides, Rome had litterally million sof traders from the far east to the north brining every sort of bug you can think of. Yet they managed to survive with fewer problems. What was the difference? Oh yes, science wasn't actively suppressed during roman times. The plague came from the Crimae, the fundemental reason why the plague was so epidemic was because of horrible sanitation. People were litterally throwing their **** into the streets. That did not exist in roman times as sewer systems moved filth away from the cities. As for the immunization claim, that is inhernetly wrong. The same europeans who fled to the country had proportionally lower death rates then those who stayed in the city. If immunity was the key, they would have died out at the same rates. Yet they did not. I suggest you revist the text books.", 
   {}, 
   107642, 
   null, 
   1113604260.0
  ], 
  [
   108011, 
   null, 
   "BobNelson2", 
   "The church has done and does do many things that are, as best I can tell, not Christian, the oppression of gays, I am sorry to say, was and is one of them. Another was the subjugation of women, which thankfully is gradually being eradicated. Catholic priests also molested small boys for a long time. That does not make it a Christian value.\n\n \n Bishops, Cardinals, and Popes have never spoken from the pulpit on the importance of molesting little boys. They have openly called for the subjugation of women and the suppression of gay people for 1500 years.\n \n We can look back today and say that none of these are \"truly Christian values\", but it is supremely dishonest to look back and fail to see that they WERE certainly put forth as \"truly Christian values\" by those who determine such things: theologians and church leaders. \n \n Now, you can argue that those folks were wrong or misguided or, at least occasionally, evil. And that is precisely the point. Religion is not constant. It is relative. It can be dangerous. It has been dangerous in the past. It's a lousy foundation for civil law.", 
   {}, 
   107851, 
   null, 
   1113678540.0
  ], 
  [
   108013, 
   null, 
   "BobNelson2", 
   "It's not necessarily, except that I feel when the church is described only in terms of its dark times and problems, I prefer to show the other side as well.\n\n \n Need I point out that when others here point to Christian denominations that offer acceptance and hope to gay people, that embrace us as equally \"made in the image of God\" as heterosexuals are, it's is YOU who dismiss those Christians as \"false\" or teaching erroneously.\n \n YOU are the one who insists that all Christianity has to offer gay people is \"dark times and problems\". And if you don't think a life of involuntary celibacy and emotional castration isn't \"dark times\", YOU give it a try.", 
   {}, 
   107867, 
   null, 
   1113678780.0
  ], 
  [
   108019, 
   null, 
   "Jo Bennett", 
   "I quite agree that religion should not be a foundation of civil law. Civil law should be based on the principle of prohibiting those things that cause substantial harm to others. The degree to which this should go is rather a moot point.\n \n I'm certainly not saying that reprehensible things weren't put forward as Christian doctrine, I'm saying that just because they were put forward does not mean that they were Christian. I am of the belief that slowly, over excruciatingly long periods, the Christian church is dragging itself back to its beginnings, before the Roman hierarchy was imposed. Thousands of people over the course of Christianity have added little pieces to our understanding, and we continue to pick our way almost blindly to what God wants, through a fog of personal prejudice, selectively compiled scripture and our own failings. I once read that the Anglican church, of which I am a member, is about having the courage, on occasion, to say \"we don't know\" about some issues. Hope that makes my thoughts clearer.", 
   {}, 
   108013, 
   null, 
   1113679920.0
  ], 
  [
   108038, 
   null, 
   "BobNelson2", 
   "I'm certainly not saying that reprehensible things weren't put forward as Christian doctrine, I'm saying that just because they were put forward does not mean that they were Christian.\n\n \n I don't understand how a believer in the Christian tradition can think this way. When a person faces judgement, pardon me, Judgement, is that assessment made on what the person ought to have been, how he/she ought to have behaved, how he/she meant to behave in his/her better moments?\n \n Like all other human endeavors, a religion should be, must be, viewed as a whole. It's meaningless to attribute only the good to the belief and the ill to the faults of humanity. Religion IS people (apologies to the producers of Soylent Green). Jyoshu thinks I see only the bad side (despite several posts of mine pointing to the good things religion can bring). I see both sides. He sees the good parts and calls them \"Christianity\". He sees the bad sides and calls them \"mistakes\".\n \n Well, listen to religion in the case of same-sex marriage. I would suggest that the pronouncements of conservative religious leaders and the deeply held feelings of many, many \"orthodox\" believers against same-sax marriage (and against gay people in general) do not resemble the sentiments of religion when it's up to something good. I don't hear about concern for the downtrodden, or a call to self-examination or \"what would Jesus do?\". What I hear bears an uncanny resemblance to the words of those not-so-christian Christians of the past when they were up to one of their \"mistakes\". It often reads like it's the same script.", 
   {}, 
   108019, 
   null, 
   1113688440.0
  ], 
  [
   108045, 
   null, 
   "Jo Bennett", 
   "I don't understand how a believer in the Christian tradition can think this way. When a person faces judgement, pardon me, Judgement, is that assessment made on what the person ought to have been, how he/she ought to have behaved, how he/she meant to behave in his/her better moments?\n\n \n I don't know. My best guess is that we all fail to live up to what we might have been, in no small part due to our own submission to doing things we know to be wrong. It is debatable, largely given an individuals view of human nature, whether wrong things done in the past were a result of that, or a genuine desire to do the right thing but believing right to be something different to what we believe it to be today. Then there is the issue of whether people believe certain things because they want to believe them. In any case, I can only place my trust in the grace of God, and hope that his grace is great enough to forgive all of us. Part of me also things that in the process of that forgiveness, we will come to understand what it is that we have done wrong.\n \n I also need a course in philosophy to make sense of what I'm trying to say", 
   {}, 
   108038, 
   null, 
   1113689220.0
  ], 
  [
   108269, 
   null, 
   "jyoshu", 
   "Like all other human endeavors, a religion should be, must be, viewed as a whole. It's meaningless to attribute only the good to the belief and the ill to the faults of humanity. Religion IS people (apologies to the producers of Soylent Green). Jyoshu thinks I see only the bad side (despite several posts of mine pointing to the good things religion can bring). I see both sides. He sees the good parts and calls them \"Christianity\". He sees the bad sides and calls them \"mistakes\".\n\n \n The problem is that you insist upon judging Christianity by the history and actions of some of it's leaders (in some sects), instead of the tenets of the faith itself, or especially the founder of the faith and his teachings. You are also judging Christianity based on political entaglements when the lines between church and state were non-existent, and trying to carry that judgement and generalization over to a time when those lines ARE there.\n \n Your view also doesn't allow for instances such as a leader calling himself a Christian for political gain but really caring nothing for the faith at all. If you are going to call THAT Christianity, we might as well assume no leaders ever claimed the mantra of the people's religion and used it to keep their support, and controlling them. Doing that isn't Christianity, it's using Christianity as a mean to an end.\n \n \nWell, listen to religion in the case of same-sex marriage. I would suggest that the pronouncements of conservative religious leaders and the deeply held feelings of many, many \"orthodox\" believers against same-sax marriage (and against gay people in general) \n\n \n Not against gay people,--against gay actions. (gay sex, marriage, etc.)\n \n \ndo not resemble the sentiments of religion when it's up to something good. I don't hear about concern for the downtrodden, or a call to self-examination or \"what would Jesus do?\".\n \n \n It would be the ideal religion for you, huh--one from whom you never had to hear a lesson about behavior, one that said 'anything goes!' 'No correction found here for anything!' 'Only a feel-good message, everytime!' But no, there's no contradiction between religion's message of things that one shouldn't do, and the things one should do (take care of the homeless, destitute, etc.) You just don't like the concept of spiritual authority guiding morality, and more to the point, you just don't like being corrected over something. But it's your choice to reject Christian teaching on morality and what one shouldn't do. No one is going to hold a gun to you and make you obey. Freedom of choice is yours.", 
   {}, 
   108038, 
   null, 
   1113775620.0
  ], 
  [
   108273, 
   null, 
   "JustineCredible", 
   "Heh, well I guess if you try hard enough you can always try to read a silver lining into it somewhere . . .\n \n \n \n The puritans came later than medieval times, (which was our context), well after the rennaissance was well under way and after the pre-reformation church. No one is claiming the church didn't go astray at some points in history, or that they didn't misinterpret or misuse the scriptures.\n\n \n Actually, you may have meant the middle ages, but the plague was still a HUGE factor during the Renaissance. Which by the way, puritans were as well. That is what I was getting at. Something I see you simply missed entirely. \n If you want to get really picky, the term Puritan came about with the movement during the sixteenth century. The group itself had origins stemming from the secularism of the Renaissance. (fifteenth century)\n \n So, you may have used the term \"middle ages\" but what you discribed was actually the Renaissance. \n \n \n \n \nScience didn't die out. There was science in the middle ages, just not the emphasis there was in the rennaissance.\n\n \n Yeah, alchemy was a BIG hit!", 
   {}, 
   107642, 
   null, 
   1113776940.0
  ], 
  [
   108274, 
   null, 
   "JustineCredible", 
   "The problem is that you insist upon judging Christianity by the history and actions of some of it's leaders (in some sects), instead of the tenets of the faith itself, or especially the founder of the faith and his teachings. You are also judging Christianity based on political entaglements when the lines between church and state were non-existent, and trying to carry that judgement and generalization over to a time when those lines ARE there.\n \n Your view also doesn't allow for instances such as a leader calling himself a Christian for political gain but really caring nothing for the faith at all. If you are going to call THAT Christianity, we might as well assume no leaders ever claimed the mantra of the people's religion and used it to keep their support, and controlling them. Doing that isn't Christianity, it's using Christianity as a mean to an end.\n\n \n Yup, and your kind voted that type of theocratic leadership in.\n \n No, I believe Bob is indeed seperating the \"founder of the faith\" (Which by the way wasn't Jesus, it was PAUL) from the actions of those utilizing it's name. If someone of power is going to call himself/herself \"Chrsitian\" I would expect they be held up to the standards of said faith's tenents, and that those who actually do follow said tenents would be OUTRAGED at leaders who misuse the title of \"Christian\" to such ends as gaining political power over entire peoples. \n But no, insted we see just the opposite. \n \n \n \n [/QUOTE=jyoshu]Not against gay people,--against gay actions. (gay sex, marriage, etc.)[/QUOTE]\n \n Right, and if the tables were turned and the government was attempting to enact laws restrictive of HETEROSEXUAL \"activity\" would you tell us that heterosexuals and heterosexuality are all that removed from each other? \n I seriously doubt it. \n \n \n \nIt would be the ideal religion for you, huh--one from whom you never had to hear a lesson about behavior, one that said 'anything goes!' 'No correction found here for anything!' 'Only a feel-good message, everytime!' But no, there's no contradiction between religion's message of things that one shouldn't do, and the things one should do (take care of the homeless, destitute, etc.) You just don't like the concept of spiritual authority guiding morality, and more to the point, you just don't like being corrected over something. But it's your choice to reject Christian teaching on morality and what one shouldn't do. No one is going to hold a gun to you and make you obey. Freedom of choice is yours.\n\n \n See that's just it, it isn't a freedom when laws are being enacted and promoted to curtail one's freedom of choice. \n What you don't seem to get is that your \"Christian\" beliefs SHOULD have NO power over the entire populous. Not to mention the fact that indeed the freedom to choose or reject such religious beliefs is being chipped away by corrupt leadership which abuses the title of \"Christian.\"", 
   {}, 
   108269, 
   null, 
   1113777600.0
  ], 
  [
   108280, 
   null, 
   "JakeCJB", 
   "Not against gay people,--against gay actions. (gay sex, marriage, etc.)\n\n \n Your prejudiced actions affect and harm gay people, because gay people practice gay actions. I am against your harmful actions which deny equality and rights on the basis of prejudice alone, and not on the basis of any logically justifiable reason.", 
   {}, 
   108269, 
   null, 
   1113778260.0
  ], 
  [
   108305, 
   null, 
   "JPSartre12", 
   "Good lord, man, have the intellectual honesty to recognize what the court is saying. It's a 3 - 0 shutout. They chose not to recognize the fourth pitch.\n\n \n I can't get back into your linked site to re-extract the ruling, but IIRC, there were 4 denid claims.", 
   {}, 
   107602, 
   null, 
   1113784260.0
  ], 
  [
   108396, 
   null, 
   "BobNelson2", 
   "The problem is that you insist upon judging Christianity by the history and actions of some of it's leaders (in some sects), instead of the tenets of the faith itself, or especially the founder of the faith and his teachings.\n\n \n You know, my problem with Christianity's treatment of gay people would go away if you'd apply the same logic you expect of me. Treat us based on the teachings of the Founder. In other words, since He didn't say a thing about us, leave us alone.\n \n As for the rest of your silly posts, by the same logic, Christianity has not harmed the Jews. I suspect quite a few Jews, including the Founder, would have trouble with that understanding of Christianity's history. As would all Christians, except for those who continue the tradition...", 
   {}, 
   108269, 
   null, 
   1113799440.0
  ], 
  [
   108406, 
   null, 
   "jyoshu", 
   "You know, my problem with Christianity's treatment of gay people would go away if you'd apply the same logic you expect of me.\n\n \n Yeah right.\n \n \nTreat us based on the teachings of the Founder. In other words, since He didn't say a thing about us, leave us alone.\n\n \n There are plenty of vices he didn't directly address that are considered bad in our society. I suppose next you will be arguing that since He didn't say a thing about prostitution, we should never assume it's wrong (or rather, as you put it--we should \"leave\" prostitutes \"alone.\") You seem to be arguing that Christianity should be a purely humanitarian endeavor rather than have elements of critique and correction for what it considers sin. Sorry, that's never going to happen, nor should it.\n \n \nAs for the rest of your silly posts, by the same logic, Christianity has not harmed the Jews.\n\n \n Christianity is a religion--a system, if you will, of beliefs and a way of thinking--a worldview. It is incapable of harming anyone--people harm others. You just don't seem to get the fact that people don't always follow that religion the way they should (as in the case of oppression toward the Jews) and so the harm is done when they don't.", 
   {}, 
   108396, 
   null, 
   1113800280.0
  ], 
  [
   108412, 
   null, 
   "BobNelson2", 
   "Christianity is a religion--a system, if you will, of beliefs and a way of thinking--a worldview. It is incapable of harming anyone--people harm others. You just don't seem to get the fact that people don't always follow that religion the way they should (as in the case of oppression toward the Jews) and so the harm is done when they don't.\n\n \n Well, I'm tired of this silly semantic debate, so I'll join you in YOUR version and agree that Christians, not Christianity, have a horrible history of doing evil things to gay people for 1500+ years.\n \n There. You agree with that, I hope.", 
   {}, 
   108406, 
   null, 
   1113800820.0
  ], 
  [
   108415, 
   null, 
   "Duo_Maxwell", 
   "Does that mean christians never invoked christanity as a justification for such actions? \n \n I find that hard to believe. \n \n I'm still waiting for my reply.", 
   {}, 
   108412, 
   null, 
   1113801000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Doesnt public opinion matter?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 4808, 
  "discussion_files": [
   [
    "569.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-print.html"
   ], 
   [
    "570.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-16-print.html"
   ], 
   [
    "571.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-14-print.html"
   ], 
   [
    "572.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-12-print.html"
   ], 
   [
    "573.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-10-print.html"
   ], 
   [
    "574.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-8-print.html"
   ], 
   [
    "575.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-7-print.html"
   ], 
   [
    "576.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-5-print.html"
   ], 
   [
    "577.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-9-print.html"
   ], 
   [
    "578.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-4-print.html"
   ], 
   [
    "579.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-13-print.html"
   ], 
   [
    "580.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-6-print.html"
   ], 
   [
    "581.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-15-print.html"
   ], 
   [
    "582.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-11-print.html"
   ], 
   [
    "583.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-3-print.html"
   ], 
   [
    "584.html", 
    "http://www.4forums.com/political/gay-rights-debates/4808-doesnt-public-opinion-matter-2-print.html"
   ]
  ], 
  "identifier": 4808
 }
]