[
 [
  [
   107414, 
   null, 
   "Voice Of Reason", 
   "I hope the \"Tree Huggers\" and the liberals in Congress are happy........By constantly blocking attempts in the Senate from drilling in ANWAR for the last 10 years they have cost all Americans to pay up to $3.00 a gallon for gas and the end is not in sight yet..\n \n Thank you very much left wingers.......What you forget most is the price of gas hurts the poor the most, the people you are always boasting about helping.....", 
   {
    "post_info": {
     "post_title": "I hope the &quot;Tree Huggers&quot; and the liberals in Congress are happy."
    }
   }, 
   null, 
   null, 
   1113517920.0
  ], 
  [
   107429, 
   null, 
   "Duo_Maxwell", 
   "Idiocy. \n \n The oil prices are caused by OPEC, Russian insecurities, and oil speculators. Our price of oil is dependent upon the rest of the world's prices. Unless we nationalized our oil companies, we would still be paying the same amount of money. Besides, oil is dirt cheap now. it's the taxes that are killing us. drop the taxes and oil is less then a dollar. \n \n Do you really think that the oil companies are going to sell at a rate lower then the market price? \n \n Oh wait, you think a CD is a good investment when inflation is low.", 
   {}, 
   107414, 
   null, 
   1113518460.0
  ], 
  [
   107450, 
   null, 
   "gnojek", 
   "Yeah, it is pretty stupid to think that drilling in one potential oil field would affect the market price significantly at all. \n \n There is a way to reduce your gas bill, though : drive less.", 
   {}, 
   107429, 
   null, 
   1113519300.0
  ], 
  [
   107459, 
   null, 
   "Duo_Maxwell", 
   "Or get a hybrid. Or carpool. \n \n But it is quite impossible to reason financially with one who holds the most idiotic of fisical ideas. \n \n It still amuses me that VOr thinks a CD during low inflation is a good idea.\n \n Hey, why is it that VOR has cowardly fled from virtually every argument I met him in?\n \n Btw VOR, everytime you say something that is just financially idiotic, I'm going to bring up the CD comment.", 
   {}, 
   107450, 
   null, 
   1113519840.0
  ], 
  [
   107470, 
   null, 
   "Waxy", 
   "I hope the \"Tree Huggers\" and the liberals in Congress are happy........By constantly blocking attempts in the Senate from drilling in ANWAR for the last 10 years they have cost all Americans to pay up to $3.00 a gallon for gas and the end is not in sight yet..\n \n Thank you very much left wingers.......What you forget most is the price of gas hurts the poor the most, the people you are always boasting about helping.....\n\n \n Apparently you were too blinded by your misplaced contempt to bother reading the thread directly below this one. emoticon_rolleyes \n \n Start there.\n \n This post is laughable for its lack of reason.\n \n Waxy", 
   {}, 
   107414, 
   null, 
   1113520260.0
  ], 
  [
   107514, 
   null, 
   "Voice Of Reason", 
   "I can afford to pay the price for gas no matter what it is........I don't want to hear you liberals complaining about it like I have for the last couple of months.......", 
   {}, 
   107470, 
   null, 
   1113524700.0
  ], 
  [
   107517, 
   null, 
   "Waxy", 
   "I can afford to pay the price for gas no matter what it is........I don't want to hear you liberals complaining about it like I have for the last couple of months.......\n\n \n Good for you, your mom must be proud.\n \n I'm starting to think that maybe you're a troll, right down to your choice of username - kind of like the 6'8\" 350lb biker that goes by \"Tiny\".\n \n Waxy", 
   {}, 
   107514, 
   null, 
   1113525000.0
  ], 
  [
   107527, 
   null, 
   "lord tammerlain", 
   "Since when is complaining about high gas prices a liberal thing? Is not a universal thing like complaining about the weather?", 
   {}, 
   107517, 
   null, 
   1113526620.0
  ], 
  [
   107531, 
   null, 
   "georged", 
   "I hope the \"Tree Huggers\" and the liberals in Congress are happy........By constantly blocking attempts in the Senate from drilling in ANWAR for the last 10 years they have cost all Americans to pay up to $3.00 a gallon for gas and the end is not in sight yet..\n \n Thank you very much left wingers.......What you forget most is the price of gas hurts the poor the most, the people you are always boasting about helping.....\n\n \n I suggest you educate yourself on US oil consumption and US oil reserves, including Alaska. You seem to know nothing about facts. Your lack of knowledge, use of labels and belief in political propaganda are obviously a large factor in your opinions.", 
   {}, 
   107414, 
   null, 
   1113526920.0
  ], 
  [
   107549, 
   null, 
   "Duo_Maxwell", 
   "When inflation is taken into account, we are actually paying less then we did during the oil crisis. \n \n lord tammerlain is correct, complaining about high oil prices has nothing to do with political ideology.\n \n However, Vor again shows that he will not comment on the facts but relies immature labeling to avoid proving anything he says", 
   {}, 
   107531, 
   null, 
   1113531420.0
  ], 
  [
   107672, 
   null, 
   "Jo Bennett", 
   "Those who are actually poor can't afford a car in the first place, so pump prices make very little difference. Also, $3/gallon? Big whoop, it's about 85p ($1.65 ish) a litre here. Pump prices are high enough when they force people to drive less and use more efficient cars.", 
   {}, 
   107549, 
   null, 
   1113584160.0
  ], 
  [
   107683, 
   null, 
   "georged", 
   "Those who are actually poor can't afford a car in the first place, so pump prices make very little difference. Also, $3/gallon? Big whoop, it's about 85p ($1.65 ish) a litre here. Pump prices are high enough when they force people to drive less and use more efficient cars.\n\n \n Many Americans will remain in denial about that until their credit cards are maxed out.", 
   {}, 
   107672, 
   null, 
   1113584700.0
  ], 
  [
   107692, 
   null, 
   "Jo Bennett", 
   "I thought they generally already were, or is the personal debt problem in the US going to get worse before it gets better?", 
   {}, 
   107683, 
   null, 
   1113585480.0
  ], 
  [
   107703, 
   null, 
   "Symbiote", 
   "Those who are actually poor can't afford a car in the first place\n\n \n Sure, but some of them buy petrol anyway. \n \n In any case, even if they're unable to afford the purchase of a car, they may still own one. We're not exactly talking about the \"sleeping on the sidewalk\" klnd of poor, but there certainly are people you'd call poor who do own cars.\n \n Anyway - the taxes are the big thing. Though an extra oil field certainly wouldn't hurt.", 
   {}, 
   107692, 
   null, 
   1113586800.0
  ], 
  [
   107705, 
   null, 
   "georged", 
   "I thought they generally already were, or is the personal debt problem in the US going to get worse before it gets better?\n\n \n Much worse. We're just beginning to feel the effects of inflation due to the USD's abrupt decline and our frightening trade imbalance. Interest rates will increase and many credit cards are tied to a prime rate plus factor. Last time I looked $6k (USD) was the average credit card balance. Many of our citizens follow government lead in debt accumulation.", 
   {}, 
   107692, 
   null, 
   1113586920.0
  ], 
  [
   107725, 
   null, 
   "Alan Ryan", 
   "Those who are actually poor can't afford a car in the first place, so pump prices make very little difference. Also, $3/gallon? Big whoop, it's about 85p ($1.65 ish) a litre here. Pump prices are high enough when they force people to drive less and use more efficient cars.\n\n \n Do you long for the day when pump prices rise to the point where so many people are forced off the road, that only the \"rich\" can afford to drive on virtually empty highways ? (As used to be the case about a hundred years ago).", 
   {}, 
   107672, 
   null, 
   1113588720.0
  ], 
  [
   107726, 
   null, 
   "georged", 
   "Traveling on empty highways brings visions of the poor seeking retaliation for their 'conditions'. They tend to become unruly when not provided for.", 
   {}, 
   107725, 
   null, 
   1113589020.0
  ], 
  [
   107728, 
   null, 
   "Alan Ryan", 
   "Traveling on empty highways brings visions of the poor seeking retaliation for their 'conditions'. They tend to become unruly when not provided for.\n\n \n I'm not quite sure what variety of \"retaliation\" you have in mind. Your comment reminds me of the story of the revolutionary mob who took to the streets demanding \"peace and bread\" - then burned down the bakeries.", 
   {}, 
   107726, 
   null, 
   1113589320.0
  ], 
  [
   107782, 
   null, 
   "georged", 
   "I'm not quite sure what variety of \"retaliation\" you have in mind. Your comment reminds me of the story of the revolutionary mob who took to the streets demanding \"peace and bread\" - then burned down the bakeries.\n\n \n Same concept.", 
   {}, 
   107728, 
   null, 
   1113595500.0
  ], 
  [
   107785, 
   null, 
   "gamehuis", 
   "Do you long for the day when pump prices rise to the point where so many people are forced off the road, that only the \"rich\" can afford to drive on virtually empty highways ? (As used to be the case about a hundred years ago).\n\n Is driving to the mall some kind of universal human right or something? What happened to walking or riding a bike?\n \n As for the first post of this thread: :xbanghead.", 
   {}, 
   107725, 
   null, 
   1113595740.0
  ], 
  [
   107795, 
   null, 
   "Duo_Maxwell", 
   "Those who are actually poor can't afford a car in the first place, so pump prices make very little difference. Also, $3/gallon? Big whoop, it's about 85p ($1.65 ish) a litre here. Pump prices are high enough when they force people to drive less and use more efficient cars.\n\n \n OUCH. That's $6.18 for a gallon.", 
   {}, 
   107672, 
   null, 
   1113596160.0
  ], 
  [
   107800, 
   null, 
   "Alan Ryan", 
   "Is driving to the mall some kind of universal human right or something? What happened to walking or riding a bike?\n \n As for the first post of this thread: :xbanghead.\n\n \n \n Who mentioned \"rights\" ? I used to live 20 miles from the nearest shopping mall, so I committed a big sin and drove there. Still do, though we live within biking distance now. I don't want to give up my mobility and return to the age of Shanks' pony.", 
   {}, 
   107785, 
   null, 
   1113596340.0
  ], 
  [
   107812, 
   null, 
   "gamehuis", 
   "Who mentioned \"rights\" ? I used to live 20 miles from the nearest shopping mall, so I committed a big sin and drove there. Still do, though we live within biking distance now. I don't want to give up my mobility and return to the age of Shanks' pony.\n\n The way you phrased it, it looked to me like you were saying that everybody should have the right to drive. If you didn't mean it like that then I apologise.\n \n \n \nOUCH. That's $6.18 for a gallon.\n\n Meh, in Holland we pay about $ 12,- per gallon, and from what I hear, those Scandinavians have it even worse. I laugh at the $ 3,- per gallon in the US.", 
   {}, 
   107800, 
   null, 
   1113597180.0
  ], 
  [
   107815, 
   null, 
   "lord tammerlain", 
   "Is driving to the mall some kind of universal human right or something? What happened to walking or riding a bike?\n \n As for the first post of this thread: :xbanghead.\n\n \n \n Much of North America has been designed to accomodate the automobile. Unlike much of europe newer areas of North America have made walking an unpleasent experience. Suburbs in which the majority of NA's live are so far spread apart that walking to the grocery store would more then triple the time taken.", 
   {}, 
   107785, 
   null, 
   1113597480.0
  ], 
  [
   107827, 
   null, 
   "Jo Bennett", 
   "I'm sure if cars became economically unviable you would see investment in light rail and tram services fairly quickly.", 
   {}, 
   107815, 
   null, 
   1113598920.0
  ], 
  [
   107836, 
   null, 
   "sinjin", 
   "I'm sure if cars became economically unviable you would see investment in light rail and tram services fairly quickly.\n\n \n Not in the hinterland.", 
   {}, 
   107827, 
   null, 
   1113600180.0
  ], 
  [
   107853, 
   null, 
   "Jo Bennett", 
   "I'm sure the remaining isolated areas could run off vegetable oil.", 
   {}, 
   107836, 
   null, 
   1113602520.0
  ], 
  [
   107872, 
   null, 
   "Waxy", 
   "I'm sure the remaining isolated areas could run off vegetable oil.\n\n \n Yeah, but we'll only need that when the little energy fairies are on their break. ;) :p \n \n Waxy", 
   {}, 
   107853, 
   null, 
   1113604560.0
  ], 
  [
   107975, 
   null, 
   "Comrade Brian", 
   "I hope the \"Tree Huggers\" and the liberals in Congress are happy........By constantly blocking attempts in the Senate from drilling in ANWAR for the last 10 years they have cost all Americans to pay up to $3.00 a gallon for gas and the end is not in sight yet..\n \n Thank you very much left wingers.......What you forget most is the price of gas hurts the poor the most, the people you are always boasting about helping.....\n\n \n Are you right-wing, they always say how important our economy is so environment can wait, but environment doesn't need an economy, but an economy needs environment, why not revert to communism where there is no money, and besides public trans. is better for environment\n Also ANWAR drilling will make capitalists richer without regards for environmental damage", 
   {}, 
   107414, 
   null, 
   1113649980.0
  ], 
  [
   107985, 
   null, 
   "georged", 
   "He started the thread with uninformed nonsense and complaints about the cost of gasoline. Then went on to say he can afford gasoline at any cost. Not only is he uninformed, he has no point to make that I can determine.", 
   {}, 
   107975, 
   null, 
   1113661320.0
  ], 
  [
   108003, 
   null, 
   "Alan Ryan", 
   "I'm sure the remaining isolated areas could run off vegetable oil.\n \n \n What makes you so \"sure\" ?", 
   {}, 
   107853, 
   null, 
   1113675120.0
  ], 
  [
   108009, 
   null, 
   "Symbiote", 
   "Why not go further Jo, why not wish the price of public motorised transport go so high that we be forced to revert to horse and buggy, is there simply something aesthetically appealing to you about a communal mode of transportation?\n \n Oil is not simply fuel, the wide variety of uses it has, ie plastics, mean an exceptionally expensive oil supply would make everything more expensive. It's very much debatable if under such a situation the poor would be able to afford food, let alone a tram fare. Is this a price you are willing to pay?\n \n Comrade, in Communism there is money, projects are bought in human lives.", 
   {}, 
   107985, 
   null, 
   1113677040.0
  ], 
  [
   108012, 
   null, 
   "Jo Bennett", 
   "The vast majority of fossil fuels are used to produce energy. True there are other uses as well, but they use a relatively small quantity. If fuel can be replaced for the most part with renewables then it will reduce demand for oil, lowering the price for less wasteful uses. Fossil fuel use for burning should be kept artificially high after this, assuming advances in technology don't reduce the cost of renewables substantially, which it seems likely they will.\n \n As for vegetable oil, I was being facetious, but it is well known that some diesel engines run fine off vegetable oil, the problem is that is could never be produced in sufficient quantity to meet current demands for fuel. It's debatable whether it could meet to fuel demands of remote areas. I have no objection to private transport, it's just that until we have a renewable means of powering it, it is advisable to strike the balance more in favour of the environment than at present. I'm not sure the vast amount of horses, plus oats etc. would be viable as alternative transport.", 
   {}, 
   108009, 
   null, 
   1113678720.0
  ], 
  [
   108017, 
   null, 
   "Symbiote", 
   "Undoubtedly the development of efficient alternatives to fossil fuels would be a desirable outcome.\n \n The whole \"I hope the price of fuel goes high so that there will be less demand for fuel so that fuel will be cheaper\" thing doesn't work though. If anything, it may be the plastics that disappear first and the fuel last.\n \n The system of supply and demand allocates given quantities of resources as efficiently over time as it does over space, provided full privatisation exists, which it obviously does not at present, and is exceptionally unlikely to be in future. What you would expect is a steadily rising oil price until a replacement was found, with the actual supply of oil never running dry (at some sufficiently high price point, alternatives to oil will be more economic).\n \n Interestingly, a well regarded scientist at the moment is putting forward the theory that so-called \"fossil fuels\" are not the decaying remnants of ancient animals at all, but are actually constantly generated in the earth's core, periodically rising to the crust. In which case they would be \"renewable\", though at what rate I am unsure.", 
   {}, 
   108012, 
   null, 
   1113679560.0
  ], 
  [
   108020, 
   null, 
   "Jo Bennett", 
   "How much did Exxon Mobil pay for that nugget I wonder... ;)\n \n I think the idea of plastics disappearing first is unlikely, simply because of the relative consumption for both uses. That said, if we can find alternative to oil in plastic as well as in fuel, so much the better.", 
   {}, 
   108017, 
   null, 
   1113680160.0
  ], 
  [
   108058, 
   null, 
   "georged", 
   "In the US agriculture accounts for nearly 25% of fossil fuel (oil) consumption.\n Then add transporatation, cooling and cooking and you're almost up to fuel consumption. Efficient vehicles alone simply won't cure long-range supply problems.", 
   {}, 
   108020, 
   null, 
   1113694680.0
  ], 
  [
   108076, 
   null, 
   "Duo_Maxwell", 
   "So if we go to 100% organic with natural fertilizers, we could cut down significently.", 
   {}, 
   108058, 
   null, 
   1113706860.0
  ], 
  [
   108084, 
   null, 
   "Symbiote", 
   "How much did Exxon Mobil pay for that nugget I wonder\n\n \n If anything, Exxon Mobil would want the public to think oil was in relatively short supply. As an apple seller would you want the public, and your competition, to know there were a whole bunch of apple trees just waiting to be discovered?", 
   {}, 
   108076, 
   null, 
   1113710580.0
  ], 
  [
   108218, 
   null, 
   "lord tammerlain", 
   "If Exxon Mobil was found to be providing false reserve reports in todays regulatory environment they would be hammered. Royal Dutch Shell had to reduce official reserves and was severly negatively impacted. Exxon Mobil I doubt would want the same fate.", 
   {}, 
   108084, 
   null, 
   1113766740.0
  ], 
  [
   108358, 
   null, 
   "georged", 
   "If Exxon Mobil was found to be providing false reserve reports in todays regulatory environment they would be hammered. Royal Dutch Shell had to reduce official reserves and was severly negatively impacted. Exxon Mobil I doubt would want the same fate.\n\n \n That also cost the CEO his job; a ripe plum as energy based companies are at the top of the corporate pile.", 
   {}, 
   108218, 
   null, 
   1113792300.0
  ], 
  [
   108592, 
   null, 
   "Waxy", 
   " Interestingly, a well regarded scientist at the moment is putting forward the theory that so-called \"fossil fuels\" are not the decaying remnants of ancient animals at all, but are actually constantly generated in the earth's core, periodically rising to the crust. In which case they would be \"renewable\", though at what rate I am unsure.\n\n \n May I ask who this \"well regarded scientist\" is? Links?\n \n I have one in mind, but I certainly wouldn't say that he is \"well regarded\" in the scientific community.\n \n That being said, I suspect there is some very minor relevence to the theory, at least in so far as it relates to methane. I would never completely dismiss a theory like this, as that would be completely unscientific, but I have never seen any real evidence to support it that was not easily deconstructed using the current model for petroleum generation, or in some cases, very simple logic/mathematics/operation issues. (ie the wells that are \"replenished\")\n \n Waxy", 
   {}, 
   108017, 
   null, 
   1113841800.0
  ], 
  [
   108619, 
   null, 
   "Alan Ryan", 
   "That being said, I suspect there is some very minor relevence to the theory, at least in so far as it relates to methane. I would never completely dismiss a theory like this, as that would be completely unscientific, but I have never seen any real evidence to support it that was not easily deconstructed using the current model for petroleum generation, or in some cases, very simple logic/mathematics/operation issues. (ie the wells that are \"replenished\")\n \n Waxy\n \n \n Is there any doubt about the biological origin of \"fossil fuels\" ? (i.e. inside orthodox geological science)", 
   {}, 
   108592, 
   null, 
   1113843660.0
  ], 
  [
   108620, 
   null, 
   "Missouri Mule", 
   "I'll weigh in on this. In historical terms we are nowhere near at the highest prices. That would have been in 1981 in inflation adjusted prices. \n \n As to energy policy we ought to drill everywhere, anywhere, and all the time until we can through old fashioned American knowhow come up with a solution to free ourselves from unreliable middle east oil. That includes ANWR.", 
   {}, 
   107414, 
   null, 
   1113843900.0
  ], 
  [
   108628, 
   null, 
   "Symbiote", 
   "I'd be thinking of Thomas Gold, sorry not to name name's earlier, had to look it up myself.\n \n I'm sure there is a great deal of controversy around his work, he's at the least though a member of the scientific community, not a crackpot with a wild idea.\n \n His major paper on the idea (there is now a published book), is here: http://people.cornell.edu/pages/tg21/usgs.html if you are interested in reading.", 
   {}, 
   108619, 
   null, 
   1113844320.0
  ], 
  [
   108632, 
   null, 
   "Waxy", 
   "Is there any doubt about the biological origin of \"fossil fuels\" ? (i.e. inside orthodox geological science)\n\n \n NO.\n \n I'm actually working on a project that relates to this topic right now in cooperation with the Geological Survey of Canada.\n \n I'll see if I can get a few pictures of actual primary oil generation and migration from organic sources hosted somewhere. \n \n Waxy", 
   {}, 
   108619, 
   null, 
   1113844500.0
  ], 
  [
   108634, 
   null, 
   "Waxy", 
   "As to energy policy we ought to drill everywhere, anywhere, and all the time until we can through old fashioned American knowhow come up with a solution to free ourselves from unreliable middle east oil. That includes ANWR.\n\n \n Never gonna happen. We could drill wells 40 acres apart from the Mexican border to the Arctic Circle and the problem isn't going to go away. \n \n That's just simple reality.\n \n Waxy", 
   {}, 
   108620, 
   null, 
   1113844560.0
  ], 
  [
   108639, 
   null, 
   "Missouri Mule", 
   "Never gonna happen. We could drill wells 40 acres apart from the Mexican border to the Arctic Circle and the problem isn't going to go away. \n \n That's just simple reality.\n \n Waxy\n\n \n That's not what I said. We need to buy time to develop new technologies. We used to rely on whale oil prior to the oil age. I'm sure we will solve this problem in due course but we can't allow our economy to tank in the interests of an ideology that would return us to the days of the horse and buggy. We have industry, transportation and personal needs that requires energy in order to operate. Now we have China that is scrambling to line up energy sources in such places as Venezuela and Canada. Our proven oil resources are less than 30 billion barrels. We use 20 million barrels a day. You can do the math.", 
   {}, 
   108634, 
   null, 
   1113844920.0
  ], 
  [
   108761, 
   null, 
   "Waxy", 
   "That's not what I said. We need to buy time to develop new technologies. We used to rely on whale oil prior to the oil age. I'm sure we will solve this problem in due course but we can't allow our economy to tank in the interests of an ideology that would return us to the days of the horse and buggy. We have industry, transportation and personal needs that requires energy in order to operate. Now we have China that is scrambling to line up energy sources in such places as Venezuela and Canada. Our proven oil resources are less than 30 billion barrels. We use 20 million barrels a day. You can do the math.\n\n \n Actually, I responded to exactly what you wrote, though that may not have been what you meant.\n \n \nAs to energy policy we ought to drill everywhere, anywhere, and all the time until we can through old fashioned American knowhow come up with a solution to free ourselves from unreliable middle east oil. That includes ANWR.\n\n \n You're suggesting that we should drill everywhere and anywhere to support ourselves while we try to find a solution to our dependence on Middle Eastern oil. (Which we actually aren't that dependent on.) \n \n As to that suggestion, my response applies perfectly. It will have little or no effect how much we drill.\n \n Waxy", 
   {}, 
   108639, 
   null, 
   1113857520.0
  ], 
  [
   108766, 
   null, 
   "Waxy", 
   "I'd be thinking of Thomas Gold, sorry not to name name's earlier, had to look it up myself.\n \n I'm sure there is a great deal of controversy around his work, he's at the least though a member of the scientific community, not a crackpot with a wild idea.\n \n His major paper on the idea (there is now a published book), is here: http://people.cornell.edu/pages/tg21/usgs.html if you are interested in reading.\n\n \n I was thinking of Warren Hunt, but it looks like their premises are largely the same.\n \n I assure you that there is a great deal of controversy. :p \n \n Waxy", 
   {}, 
   108628, 
   null, 
   1113857940.0
  ], 
  [
   111110, 
   null, 
   "Voice Of Reason", 
   "Since when is complaining about high gas prices a liberal thing? Is not a universal thing like complaining about the weather?\n\n \n \n The Liberal thing is that the dems in the Senate have blocked drilling in ANWAR for the last 20 years keeping us at the mercy of the Arabs for the bulk of our oil.......\n \n Dems are suppose to be so compassionate for the poor when by causing the price of gas to rise the very people they say they want to help our hurt the most...........", 
   {}, 
   107527, 
   null, 
   1114233480.0
  ], 
  [
   111112, 
   null, 
   "Duo_Maxwell", 
   "The Liberal thing is that the dems in the Senate have blocked drilling in ANWAR for the last 20 years keeping us at the mercy of the Arabs for the bulk of our oil\n\n \n Where is symbiote when I need him? You are ignorant. During the 90s and 80s, the ANWR bills were killed by the public. If you will recall, significent public outcry aganist drilling is what killed the bill. Mercy of the Arabs? We import less ten 20% of our oil from the middle east. \n \n \n\n Dems are suppose to be so compassionate for the poor when by causing the price of gas to rise the very people they say they want to help our hurt the most...........\n\n \n Um no. The price of gas isn't directly hurting the poor. If you want to get rid of the high prices, cut the taxes. \n \n It's amusing how you have completely ignored the rest of the thread as it already refutes your recent claim", 
   {}, 
   111110, 
   null, 
   1114233660.0
  ], 
  [
   111116, 
   null, 
   "Voice Of Reason", 
   "The worst part of it is thanks to the left and people like \"Little Man\" we are being held hostage by the Arabs.........", 
   {}, 
   111112, 
   null, 
   1114234500.0
  ], 
  [
   111118, 
   null, 
   "Duo_Maxwell", 
   "The worst part of it is thanks to the left and people like \"Little Man\" we are being held hostage by the Arabs.........\n\n \n Arab Opec accounts for 25% of of our imports, which is roughly 15% of our total oil usage. \n \n Imports from the Americas make up 44% of total imports, or 26% of our total energy. \n \n http://www.eia.doe.gov/neic/rankings/crudebycountry.htm\n \n The reason gas prices are so high is because of 1) oil speculators 2) Yuko's financial problem spooking those speculators and 3) gas taxes. \n \n Even if we did have the ANWR, what makes you think gas prices would be any lower? Why would Shell and other oil producers sell at price lower then what they could get? The ANWR can't even make a dent in our own oil production and wouldn't do anything in terms of lowering global gas prices, which we are paying for at the pump. Your argument is only incompentent, but it has no financial understnading whatsoever.", 
   {}, 
   111116, 
   null, 
   1114235100.0
  ], 
  [
   111186, 
   null, 
   "Jo Bennett", 
   "There is also the issue the the arctic reserves would draw only a tiny fraction (around 3% as I recall) of US needs, which would make no difference at all to the world price for a massive environmental penalty.", 
   {}, 
   111118, 
   null, 
   1114253400.0
  ], 
  [
   111191, 
   null, 
   "gamehuis", 
   "I say do some preliminary drilling first to see how much oil there really is up there. If it's a lot then start drilling commercially, if not, then leave it alone.", 
   {}, 
   111186, 
   null, 
   1114255020.0
  ], 
  [
   111208, 
   null, 
   "georged", 
   "There is also the issue the the arctic reserves would draw only a tiny fraction (around 3% as I recall) of US needs, which would make no difference at all to the world price for a massive environmental penalty.\n\n \n That's correct. VOR's statement 'at the mercy of the Arabs' is straight from talk radio and, like most of his statements, erroneous. Our consumption is so high we simply don't have the reserves to ever supply all of our own needs until oil is no longer a requirement.\n \n Actually Canada is now our #1 crude oil supplier. I wonder why VOR and Bush aren't railing at that country?", 
   {}, 
   111186, 
   null, 
   1114266120.0
  ], 
  [
   111246, 
   null, 
   "lord tammerlain", 
   "That's correct. VOR's statement 'at the mercy of the Arabs' is straight from talk radio and, like most of his statements, erroneous. Our consumption is so high we simply don't have the reserves to ever supply all of our own needs until oil is no longer a requirement.\n \n Actually Canada is now our #1 crude oil supplier. I wonder why VOR and Bush aren't railing at that country?\n\n \n \n Because we are white, christian, speak english and almost like Americans for the most part, hard to rail at almost mirror images.", 
   {}, 
   111208, 
   null, 
   1114283460.0
  ], 
  [
   111266, 
   null, 
   "Duo_Maxwell", 
   "Can someone please give VOR a lesson in the very basics of international finance? \n \n It's amazing how dumb some people are.", 
   {}, 
   111246, 
   null, 
   1114286940.0
  ], 
  [
   111495, 
   null, 
   "georged", 
   "Can someone please give VOR a lesson in the very basics of international finance? \n \n\n \n There are other basics to be mastered before that curve....", 
   {}, 
   111266, 
   null, 
   1114354440.0
  ], 
  [
   111572, 
   null, 
   "Duo_Maxwell", 
   "There are other basics to be mastered before that curve....\n\n \n Like basic critical thinking? lol.", 
   {}, 
   111495, 
   null, 
   1114375560.0
  ], 
  [
   111598, 
   null, 
   "gamehuis", 
   "Like basic critical thinking? lol.\n\n Uhm no, that would normal social interaction.;)", 
   {}, 
   111572, 
   null, 
   1114379400.0
  ], 
  [
   111621, 
   null, 
   "Duo_Maxwell", 
   "Uhm no, that would normal social interaction.;)\n\n \n That would require a functional brain, something VOR has shown he clearly lacks. \n \n Still, he's a huge coward. I find it amusing that he calls me a little man when if he acted in his manner in the military, he would be serving quite a long time for deseration.", 
   {}, 
   111598, 
   null, 
   1114382640.0
  ], 
  [
   111652, 
   null, 
   "gamehuis", 
   "Still, he's a huge coward. I find it amusing that he calls me a little man when if he acted in his manner in the military, he would be serving quite a long time for deseration.\n\n I don't believe for one second that VOR was in the military. Someone as immature as him would have been kicked out on day one. Most likely he's a 16 year old troll with an overactive imagination.", 
   {}, 
   111621, 
   null, 
   1114385340.0
  ], 
  [
   111996, 
   null, 
   "Waxy", 
   "I don't believe for one second that VOR was in the military. Someone as immature as him would have been kicked out on day one. Most likely he's a 16 year old troll with an overactive imagination.\n\n \n I completely believe him about the military service.\n \n His \"personality\" wreaks of career low level military service.\n \n Lack of basic social skills, complete lack of critical thinking skills, lack of any real backbone or ambition, and a generally low level of education. Combine that with years of simply accepting anything you're told by \"superiors\" as absolute truth and the instilling of a rigid \"us vs. them\" mentality, and you have one VOR.\n \n Besides, you shouldn't be so hard on the average 16 year old. :p \n \n Waxy", 
   {}, 
   111652, 
   null, 
   1114446840.0
  ], 
  [
   112024, 
   null, 
   "gamehuis", 
   "I completely believe him about the military service.\n \n His \"personality\" wreaks of career low level military service.\n \n Lack of basic social skills, complete lack of critical thinking skills, lack of any real backbone or ambition, and a generally low level of education. Combine that with years of simply accepting anything you're told by \"superiors\" as absolute truth and the instilling of a rigid \"us vs. them\" mentality, and you have one VOR.\n\n Hmm, I've never really thought about it like that. My mental image of a US serviceman is one of a clearheaded, disciplined, rational individual, but maybe that only applies to the Marines. \n \n *is reminded of the movie Full Metal Jacket*\n \n Nevermind I said anything. :p\n \n \nBesides, you shouldn't be so hard on the average 16 year old. :p \n \n Waxy\n\n I know, I know. emoticon_emb", 
   {}, 
   111996, 
   null, 
   1114451820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I hope the \"Tree Huggers\" and the liberals in Congress are happy.", 
  "url": "http://www.4forums.com/political/environmental-debates/4823-i-hope-tree-huggers-liberals-congress-happy.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 4823, 
  "discussion_files": [
   [
    "2847.html", 
    "http://www.4forums.com/political/environmental-debates/4823-i-hope-tree-huggers-liberals-congress-happy-print.html"
   ], 
   [
    "2848.html", 
    "http://www.4forums.com/political/environmental-debates/4823-i-hope-tree-huggers-liberals-congress-happy-5-print.html"
   ], 
   [
    "2849.html", 
    "http://www.4forums.com/political/environmental-debates/4823-i-hope-tree-huggers-liberals-congress-happy-4-print.html"
   ], 
   [
    "2850.html", 
    "http://www.4forums.com/political/environmental-debates/4823-i-hope-tree-huggers-liberals-congress-happy-3-print.html"
   ], 
   [
    "2851.html", 
    "http://www.4forums.com/political/environmental-debates/4823-i-hope-tree-huggers-liberals-congress-happy-2-print.html"
   ]
  ], 
  "identifier": 4823
 }
]