[
 [
  [
   107888, 
   null, 
   "Faithless623", 
   "Yes... the 6,000 year old debate... here we go again :) \n \n Atheism is the most logical default position one could take.\n The lack of belief or knowledge is most usually the first position taken by one on a subject before they are to aquire knowledge or investigate the matter.\n \n So how does the theist move from this default position to his position of belief?\n \n How have you, presuming you to be a theist, come to the conclusion that God exists?\n \n 1. Please first define what you mean by God so we avoid any bad assumptions or confusion.\n \n 2. Please exclude all evidence and reason relating to the word \"feeling\".\n Ex. \"I feel there is a God deep within my heart\"\n - Feelings are personal to the individual and cannot be used as evidence within a conversation unless I (the atheist) have the same feeling; which I assure you, I do not.", 
   {
    "post_info": {
     "post_title": "Atheism to Theism"
    }
   }, 
   null, 
   null, 
   1113608580.0
  ], 
  [
   108319, 
   null, 
   "Faithless623", 
   "Hello....?", 
   {
    "post_info": {
     "post_title": "Theists... are you out there?"
    }
   }, 
   107888, 
   null, 
   1113788280.0
  ], 
  [
   108335, 
   null, 
   "Duo_Maxwell", 
   "Hello....?\n\n \n Good luck with that. \n \n I believe in something, certainlty not orthodox in any way. Why, because I am a irrational being. \n \n Good luck getting THAT out of any of the crazies here though.", 
   {}, 
   108319, 
   null, 
   1113789720.0
  ], 
  [
   108610, 
   null, 
   "Waxy", 
   "Hello....?\n\n \n 1. This has been done to death. As soon as I saw the post, I figured you weren't likely to get any new responses.\n \n 2. The question completely handicaps people's ability to respond.\n \n Do a search of this forum, you should be able to find plenty of threads on the subject.\n \n Waxy", 
   {}, 
   108319, 
   null, 
   1113843000.0
  ], 
  [
   108798, 
   null, 
   "Faithless623", 
   "1. This has been done to death. As soon as I saw the post, I figured you weren't likely to get any new responses.\n\n \n Yes but it seems many discussions eventually leas to some type of feeling or claims of personal experiences which cannot be used very effectivley in a debate or logical argument.\n \n \n2. The question completely handicaps people's ability to respond\n\n \n Requiring reason and logic instead of personal feelings handicaps peoples ability to respond completely? I would hope not...\n \n \nDo a search of this forum, you should be able to find plenty of threads on the subject.\n\n \n There arent very recent discussions on this subject so I made a new thread for it. The risk of posting to an older thread is that some of the main members or responders in that thread may no longer use the site or pay attention to this particular forum.\n \n And also I wanted to set limits on the type of response, by beginning a new discussion.\n \n - - - \n \n \n Surely there is some theist out there willing to defend his claim in the field of reason?", 
   {}, 
   108610, 
   null, 
   1113862320.0
  ], 
  [
   108911, 
   null, 
   "Irvine", 
   "Due to the current lack of success you seem to be having with your thread and the reasons for why seeming to be logical to this reader, could i instead ask why you think that atheism is the default starting point in the debate. Surely agnosticism would be the starting point for someone who does not know whether there is a god or not. Atheism claims that there is no god. This requires explanation as well.", 
   {}, 
   108798, 
   null, 
   1113873840.0
  ], 
  [
   108917, 
   null, 
   "Master_Shake", 
   "Due to the current lack of success you seem to be having with your thread and the reasons for why seeming to be logical to this reader, could i instead ask why you think that atheism is the default starting point in the debate. Surely agnosticism would be the starting point for someone who does not know whether there is a god or not. Atheism claims that there is no god. This requires explanation as well.\n\n \n This is exactly what I was going to ask. But please, let's not get into another argument about the definitions of athiesm and agnosticism. That will totally kill any discussion as it has in the past.", 
   {}, 
   108911, 
   null, 
   1113875340.0
  ], 
  [
   108925, 
   null, 
   "Irvine", 
   "I happily bow to your greater experience. :)", 
   {}, 
   108917, 
   null, 
   1113877020.0
  ], 
  [
   108938, 
   null, 
   "Faithless623", 
   "Due to the current lack of success you seem to be having with your thread and the reasons for why seeming to be logical to this reader, could i instead ask why you think that atheism is the default starting point in the debate. Surely agnosticism would be the starting point for someone who does not know whether there is a god or not. Atheism claims that there is no god. This requires explanation as well.\n\n \n I do not want to sidetrack. So while not debating the technical defintion of atheism and agnosticism; I will say that when I say atheism I MEAN the absence of belief in God. (This would include agnostics) Not a position one way or the other.\n \n Is this an atheist message board? (Seems like it)", 
   {
    "post_info": {
     "post_title": "Atheism / Agnosticism"
    }
   }, 
   108925, 
   null, 
   1113879720.0
  ], 
  [
   108939, 
   null, 
   "Orion", 
   "Is this an atheist message board? (Seems like it)\n\n \n You create a thread and you take your chances. If the subject is deemed interesting, people will respond.", 
   {}, 
   108938, 
   null, 
   1113880260.0
  ], 
  [
   108941, 
   null, 
   "sinjin", 
   "Due to the current lack of success you seem to be having with your thread and the reasons for why seeming to be logical to this reader, could i instead ask why you think that atheism is the default starting point in the debate. Surely agnosticism would be the starting point for someone who does not know whether there is a god or not. Atheism claims that there is no god. This requires explanation as well.\n\n \n Atheism is default because before someone gave you your mythology you had no concept of a creator. You might have made one up for yourself ultimately if no one had splained things to you but not necessarily.", 
   {}, 
   108911, 
   null, 
   1113880860.0
  ], 
  [
   108951, 
   null, 
   "Master_Shake", 
   "Atheism is default because before someone gave you your mythology you had no concept of a creator. You might have made one up for yourself ultimately if no one had splained things to you but not necessarily.\n\n \n I have to disagree. This may be your experience, but it is not everyone's and it is certainly not mine.\n I was not raised in a religious home. I did not go to church (nor do I now), god was not discussed, and yet from as far back as I can remember, I have been aware of god's presence. As a young child I may not have had a name for god or for this experience yet, but that doesn't mean that's not what it was.\n \n As for the default stance atheism (in Faithless' definition as a lack of belief in god, not necessarily disbelief [what I would call agnosticism, but that's beside the point]) makes sense yes. You can't automatically (or ever) know for sure either way, so admitting this is the only sound thing to do. This is where I stand. You might call me an agnostic believer :)", 
   {}, 
   108941, 
   null, 
   1113882300.0
  ], 
  [
   108971, 
   null, 
   "Steeeeve", 
   "At some point everyone has to have faith in something...So faith is another good answer", 
   {}, 
   108951, 
   null, 
   1113884940.0
  ], 
  [
   109075, 
   null, 
   "Faithless623", 
   "As for the default stance atheism (in Faithless' definition as a lack of belief in god, not necessarily disbelief [what I would call agnosticism, but that's beside the point]) makes sense yes. \n \n \n Then let me re-state my question: How do you go from atheism or agnosticism to theism?\n Why do you believe in God? (Rules of response in the first post apply still)\n \n \nAt some point everyone has to have faith in something...So faith is another good answer\n\n \n Untrue, but I dont want to get off topic. If you'd like to discuss this we could make a separate thread for it.", 
   {}, 
   108971, 
   null, 
   1113918600.0
  ], 
  [
   109350, 
   null, 
   "Master_Shake", 
   "So how does the theist move from this default position to his position of belief?\n \n How have you, presuming you to be a theist, come to the conclusion that God exists?\n \n 1. Please first define what you mean by God so we avoid any bad assumptions or confusion.\n \n 2. Please exclude all evidence and reason relating to the word \"feeling\".\n Ex. \"I feel there is a God deep within my heart\"\n - Feelings are personal to the individual and cannot be used as evidence within a conversation unless I (the atheist) have the same feeling; which I assure you, I do not.\n\n \n Like I said before, you could call me an agnostic believer. I'm agnostic in the sense that I realize there is no absolutely surefire way for us to know if god exists or not; or if god does exist, what the nature of god is. But I believe. Belief isn't about \"knowing\" in the way we usually think of it.\n As to your rules of response:\n 1. To be honest, I don't know if I have ever thought about a way to define god in this sense, so I'll have to mull over it for a while. I'll get back to you on that one.\n 2. I don't think it is possible to not talk about \"feeling\" or things associated with it in some way when discussing why I personally believe the way I do. I know that this cannot be used as evidence, but this doesn't really matter to be honest. I'm not out to prove anything, so I don't really need evidence. It is sorta one of those things where if you have to ask, you just wouldn't understand.", 
   {}, 
   107888, 
   null, 
   1113952380.0
  ], 
  [
   109440, 
   null, 
   "Faithless623", 
   "You are not the type of theist I am interested in talking to.", 
   {}, 
   109350, 
   null, 
   1113960840.0
  ], 
  [
   109577, 
   null, 
   "Dzeron", 
   "At some point everyone has to have faith in something...So faith is another good answer\n\n \n How about we have faith in ourselves?", 
   {}, 
   108971, 
   null, 
   1113967980.0
  ], 
  [
   109595, 
   null, 
   "Master_Shake", 
   "You are not the type of theist I am interested in talking to.\n\n \n Well excuuuuuuuuuuuse me.\n You are obviously not simply inquiring into the way people think then, so instead of asking generally what people think, why don't you tell us exactly who you are looking for so they can present themselves.", 
   {}, 
   109440, 
   null, 
   1113970800.0
  ], 
  [
   109755, 
   null, 
   "unkerpaulie", 
   "Yes... the 6,000 year old debate... here we go again :) \n \n Atheism is the most logical default position one could take.\n The lack of belief or knowledge is most usually the first position taken by one on a subject before they are to aquire knowledge or investigate the matter.\n \n So how does the theist move from this default position to his position of belief?\n \n How have you, presuming you to be a theist, come to the conclusion that God exists?\n \n 1. Please first define what you mean by God so we avoid any bad assumptions or confusion.\n \n 2. Please exclude all evidence and reason relating to the word \"feeling\".\n Ex. \"I feel there is a God deep within my heart\"\n - Feelings are personal to the individual and cannot be used as evidence within a conversation unless I (the atheist) have the same feeling; which I assure you, I do not.\n\n i saw this a few days ago but i didnt give it much thought since i probably misread it. but looking at the responses, i think i understand your first post better\n \n 1. God is defined as a supernatural invisible being that my parents and the bible taught me about. all the things that my parents said he did, and what the bible said he did, are the things he did, and he deserves the credit for ultimately everything that ever was done since the beginning of the world.\n \n 2. not really a question...\n \n coming to theism was natural for me. as far as i remember i was a theist. i wasnt born that way, but i became one at a very early age. no real dramatic story about it. i grew up in a christian home\n \n coming to the conclusion that God exist was as easy as all the othr beliefs that i adopted. i was taught so, and i ws taught to look around at the world and find the evidence that God exist, such as order, intelligent design and unexpected good fortune. even chaos and bad fortune helped strengthen my case that God exists, since these things are of the devil.\n \n as a side note, i think the definition of atheist as \"without a belief in God\" is conveniently ambigious and i disagree with that definition. someone with no belief about or in God i would define as an agnostic. an agnostic is someone that doesnt know whether they believe in God. because your atheist definition overlaps this, it makes it less useful and more difficult to work with. thats why i avoid using that definition", 
   {}, 
   107888, 
   null, 
   1114013580.0
  ], 
  [
   109769, 
   null, 
   "Waxy", 
   "You are not the type of theist I am interested in talking to.\n\n \n That's a great way to get more people to respond to your post. emoticon_rolleyes \n \n Apparently the fish in this pond are too smart to take the lure you're casting. :p \n \n Waxy", 
   {}, 
   109440, 
   null, 
   1114015620.0
  ], 
  [
   109868, 
   null, 
   "Irvine", 
   "\n coming to the conclusion that God exist was as easy as all the othr beliefs that i adopted. i was taught so, and i ws taught to look around at the world and find the evidence that God exist, such as order, intelligent design and unexpected good fortune. even chaos and bad fortune helped strengthen my case that God exists, since these things are of the devil.\n \n\n Surely if order/design = God and chaos = Devil\n and good fortune = God and bad fortune = Devil\n there wasn't much chance of you not finding evidence for Christian beliefs in the world...", 
   {}, 
   109755, 
   null, 
   1114026360.0
  ], 
  [
   109879, 
   null, 
   "trebor", 
   "Surely if order/design = God and chaos = Devil\n and good fortune = God and bad fortune = Devil\n there wasn't much chance of you not finding evidence for Christian beliefs in the world...\n\n \n \n I find plenty of evidence of CHristian beliefs. I just don't find any evidence that the Christian beliefs are true.", 
   {}, 
   109868, 
   null, 
   1114027440.0
  ], 
  [
   109948, 
   null, 
   "Faithless623", 
   "Master_Shake,\n \n \nWell excuuuuuuuuuuuse me.\n You are obviously not simply inquiring into the way people think then, so instead of asking generally what people think, why don't you tell us exactly who you are looking for so they can present themselves.\n\n \n Are you kidding me? Did you not read the first post?\n \n As I made clear in the first post I'm looking for theists who believe in God for logical reasons and would be willing to debate them. (Or reasons not involving faith, feelings, or personal experiences)\n \n Unkerpaulie,\n \n \n1. God is defined as a supernatural invisible being that my parents and the bible taught me about. all the things that my parents said he did, and what the bible said he did, are the things he did, and he deserves the credit for ultimately everything that ever was done since the beginning of the world.\n\n \n All right. \n \n \n \nsuch as order, intelligent design and unexpected good fortune. even chaos and bad fortune helped strengthen my case that God exists, since these things are of the devil.\n\n \n Pick one and use that as your argument and please expand a little.\n \n Waxy,\n \n \nthat's a great way to get more people to respond to your post.\n\n \n I'm not interested in posts that disregard what I am looking for.", 
   {}, 
   109879, 
   null, 
   1114037460.0
  ], 
  [
   109966, 
   null, 
   "Duo_Maxwell", 
   "\n As I made clear in the first post I'm looking for theists who believe in God for logical reasons and would be willing to debate them. (Or reasons not involving faith, feelings, or personal experiences)\n\n \n Then you are clearly looking for a rare species, one that usually believes because of the problems of origin and not because of anything a religious text says. \n \n Good luck finding one of those. I believe that way but I will freely admit it;s completely irrational.", 
   {}, 
   109948, 
   null, 
   1114039680.0
  ], 
  [
   109977, 
   null, 
   "Faithless623", 
   "Then you are clearly looking for a rare species, one that usually believes because of the problems of origin and not because of anything a religious text says. \n \n \n If the theist would like to bring in the \"problem of origin\", I will accept that as a \"reasonable\" argument and we can go from there.\n \n But the theist must set the premise.", 
   {}, 
   109966, 
   null, 
   1114041060.0
  ], 
  [
   109992, 
   null, 
   "Waxy", 
   "But the theist must set the premise.\n\n \n Why insist on baiting a trap?\n \n Why not openly present your argument and see if anyone wishes to counter?\n \n You might find that more effective than lying in the weeds. :p \n \n Waxy", 
   {}, 
   109977, 
   null, 
   1114043340.0
  ], 
  [
   109994, 
   null, 
   "Master_Shake", 
   "Then you are clearly looking for a rare species, one that usually believes because of the problems of origin and not because of anything a religious text says. \n\n \n It sounds like you are sayin that these are the only two possible options and this just isn't the case.", 
   {}, 
   109966, 
   null, 
   1114043760.0
  ], 
  [
   110005, 
   null, 
   "Faithless623", 
   "Waxy,\n \n \nWhy insist on baiting a trap?\n \n Why not openly present your argument and see if anyone wishes to counter?\n \n You might find that more effective than lying in the weeds\n\n \n Because as Ive said before: the lack of belief is the default position. So I would like to see the argument that convinces the theist there is a God. \n \n Once that argument is presented and somewhat explained we can go from there. \n \n I am calling into question all theists who claim to have logic and reason on their side in their belief. \n I am asking them to first define their God. And second to state why they believe in him without relating to (as ive said before): feelings, faith, or personal experiences because these cannot be used well in a logical debate.", 
   {}, 
   109994, 
   null, 
   1114045200.0
  ], 
  [
   110023, 
   null, 
   "Duo_Maxwell", 
   "It sounds like you are sayin that these are the only two possible options and this just isn't the case.\n\n \n When you throw the term \"logic\" in the field tends to get very small, very quickly. Even then it's questionable, as it is not logical to jump to a proofless conclusion that there is a god merely because we do not have all the answers now, so perhaps this rare species is in reality non-existant. Faithless may be looking for someone who just does not exist.", 
   {}, 
   109994, 
   null, 
   1114047720.0
  ], 
  [
   110026, 
   null, 
   "Faithless623", 
   "Faithless may be looking for someone who just does not exist.\n\n \n I am looking for a theist who can define their God and then tell me why they believe in him.\n \n I would prefer that the reasons for belief are limited to logical arguments such as design arguments, origin of life arguments, etc...\n \n Is this possible?", 
   {}, 
   110023, 
   null, 
   1114047960.0
  ], 
  [
   110027, 
   null, 
   "Duo_Maxwell", 
   "I am looking for a theist who can define their God and then tell me why they believe in him.\n \n I would prefer that the reasons for belief are limited to logical arguments such as design arguments, origin of life arguments, etc...\n \n Is this possible?\n\n \n In my opinion? No. Drop the logic part, and you'll find many theists, however, good luck on your quest for the holy imaginary logic grail.", 
   {}, 
   110026, 
   null, 
   1114048380.0
  ], 
  [
   110028, 
   null, 
   "DrAtH", 
   "I think I understand what you're asking. The only problem is that, there is no logical explanation or evidence that really supports the Bible or God. When people start to talk about God and all the evidence surrounding him, everything sort of gets foggy and you don't really understand what they're talking about and right at the end they give defined, yet questionable point.\n \n An argument I might come up with, as I believe I can argue a theist position, would be, \"If there is no God and the Bible is false, how do you explain the universe's origin? How can you explain logically, with evidence, that there is no chance the universe was created by an all-powerful being?\n \n \"And when I say God, I am referring to the Christian one; He (or well, It) is omnipotent, omniscient and omnipresent, Christ is his son who died for our sins. I believe in God because the Big Bang Theory doesn't completely hold up under scrutiny and it leaves no explanation for the origin of what we call life. Despite what science has come up with, the explanation the bible gives is still more \"perfect\", as I believe it is impossible to disprove.\"\n \n And that is a theist argument which I've come up with. Destroy it if you can. Bwahahahaaa... :)", 
   {}, 
   110005, 
   null, 
   1114048560.0
  ], 
  [
   110033, 
   null, 
   "Duo_Maxwell", 
   "An argument I might come up with, as I believe I can argue a theist position, would be, \"If there is no God and the Bible is false, how do you explain the universe's origin? How can you explain logically, with evidence, that there is no chance the universe was created by an all-powerful being?\n\n \n That's not a logical argument itself, you have said. Occam's Razor by itself takes the argument out of its own misery. That is a huge assumption and by all means unncessary. Nor it is the simplest assumption as well. Science and natural occurances are far more simple then a all power being who just exists. Logically we have a problem with the idea of such a being. Logic dictates everything must have a origin. The universe, you and I, and everything around us. Yet how can a diety have no origin and be explained with logic? It cannot, and therefore exists outside of logic if it exists. Under such circumstances, a belief in a diety cannot be logically reasoned. Hence, why I believe faithless may be looking for someone who does not exist.\n \n The most likely answer is one we have not come up with, and before someone jumps on my back about that, look at history and how completely ridiculous claims were made that were later proven by very simple science. It is ultimately patience that will allow for the real answers to present themselves, not leaping to proofless, illogical conclusions of dieties. \n \n That being said, I still believe in something upstairs because I am a irrational being.", 
   {}, 
   110028, 
   null, 
   1114049100.0
  ], 
  [
   110039, 
   null, 
   "DrAtH", 
   "I've heard much about Occam's Razor, but it's never been satisfactorily explained. Please, enlighten me. (if the last post was explaing Occam's Razor, I will feel very stupid)", 
   {}, 
   110033, 
   null, 
   1114050120.0
  ], 
  [
   110041, 
   null, 
   "Duo_Maxwell", 
   "Occam's Razor (also Ockham's Razor or any of several other spellings), is a principle attributed to the 14th century English logician and Franciscan friar, William of Ockham that forms the basis of methodological reductionism, also called the principle of parsimony.\n \n In its simplest form, Occam's Razor states that one should make no more assumptions than needed. When multiple explanations are available for a phenomenon, the simplest version is preferred. A charred tree on the ground could be caused by a landing alien ship or a lightning strike. According to Occam's Razor, the lightning strike is the preferred explanation as it requires the fewest assumptions.\n\n \n http://en.wikipedia.org/wiki/Occam%27s_Razor", 
   {}, 
   110039, 
   null, 
   1114050540.0
  ], 
  [
   110044, 
   null, 
   "Orion", 
   "I've heard much about Occam's Razor, but it's never been satisfactorily explained. Please, enlighten me. (if the last post was explaing Occam's Razor, I will feel very stupid)\n\n \n This is one of the best explanations I've found...\n \n Here", 
   {}, 
   110039, 
   null, 
   1114051200.0
  ], 
  [
   110084, 
   null, 
   "Duo_Maxwell", 
   "Orion and my link are one and the same.", 
   {}, 
   110044, 
   null, 
   1114055580.0
  ], 
  [
   110173, 
   null, 
   "johnhanks", 
   "... as Ive said before: the lack of belief is the default position. So I would like to see the argument that convinces the theist there is a God.\n\n I think you're starting from a false premise: that human minds emerged as some kind of blank slate, on which people later inscribed belief in god for some 'logical' reason.\n \n More likely, in my view, is that when modern human brains emerged they incorporated a strong tendency to 'believe' as part of their operating system: specifically, to believe that effects have causes, for it was the construction of cause-and-effect chains that enabled early human technology. Once you have a hard-wired predisposition to seek causes for effects, it is a small step to invoke supernatural causes for effects whose physical cause you cannot see. To project anthropomorphic form and motivation on these invisible causes is hardly surprising either.\n \n Our need to see a cause for anything that happens is still very strong. It's what makes some of the findings of, say, quantum physics so counter-intuitive. It's what drives conspiracy theorists. And it's what makes an uncaused origin of life and the universe very hard for religious people to swallow.", 
   {}, 
   110005, 
   null, 
   1114073820.0
  ], 
  [
   110213, 
   null, 
   "unkerpaulie", 
   "Pick one and use that as your argument and please expand a little.\n\n i dont need to pick one. all 3 combined contribute to collective evidence for God's existence\n \n order and intelligent design go hand in hand, but order is probably on a much wider scale. the balance and consistency of the universe, the excellent meshing of environment and life, the stability of the planet and all its systems, these are all examples of order. \n \n intellegent design pertains to attention to detail, like the filtering function of the kidneys to remove toxins from the circulatory system, or the marvels of the brain. even the peculiar tactics of sother species that allow them to thrive. those are examples of intellegent design\n \n unexpected good fortune include escaping a would-be fatal accident intact, or recieving a gift of something you needed from an unlikely source at time when you could not obtain it yourself.\n \n combined, and with the right perspective, all these make a compelling case for God's existence", 
   {}, 
   109948, 
   null, 
   1114097580.0
  ], 
  [
   110214, 
   null, 
   "unkerpaulie", 
   "I think you're starting from a false premise: that human minds emerged as some kind of blank slate, on which people later inscribed belief in god for some 'logical' reason.\n\n i think that is what faithless is saying, but he is using the label atheist, and i disagree. an atheist is not someone with a blank slate about their belief in God. that is an agnostic, by definition\n \n other than that, it is not always necessary for a theist to adopt a 'logical' reason for believing in God. usually their belief in God comes long before thinking logically about it. in fact, it is nearly always imperative that no logic be applied at all. logic is counterproductive to faith, and vice versa. very often, people that attempt to apply logic to their religion inevitably lose some or all of their faith. likewise, in order to increase in faith, you need to deny yourself of logic", 
   {}, 
   110173, 
   null, 
   1114098000.0
  ], 
  [
   110220, 
   null, 
   "Big Orn", 
   "other than that, it is not always necessary for a theist to adopt a 'logical' reason for believing in God. usually their belief in God comes long before thinking logically about it. in fact, it is nearly always imperative that no logic be applied at all. logic is counterproductive to faith, and vice versa. very often, people that attempt to apply logic to their religion inevitably lose some or all of their faith. likewise, in order to increase in faith, you need to deny yourself of logic\n\n I agree that it is not \"always necessary\", but logic has it's place. For example when Jesus talked about Himself as being the Door, the Light, the Vine, Living Water - who was called the Rock. If we apply logic in certain areas we see the reflection (or what God was trying to tell us) of the rock that Moses struck that brought forth water, or the Tree of Life in the Garden of Eden. God always allows us to use our brains if need be to \"see\" Him. It is, I think, imperative in some instances.", 
   {}, 
   110214, 
   null, 
   1114099020.0
  ], 
  [
   110293, 
   null, 
   "Master_Shake", 
   "I am looking for a theist who can define their God and then tell me why they believe in him.\n \n I would prefer that the reasons for belief are limited to logical arguments such as design arguments, origin of life arguments, etc...\n \n Is this possible?\n\n \n It sounds to me like you are just trying to bait very specific arguments that you feel you already know how to shoot down and give yourslef an ego boost. That's a poor use of discussion if you ask me.", 
   {}, 
   110026, 
   null, 
   1114107960.0
  ], 
  [
   110301, 
   null, 
   "Master_Shake", 
   "Logically we have a problem with the idea of such a being. Logic dictates everything must have a origin. The universe, you and I, and everything around us. Yet how can a diety have no origin and be explained with logic? It cannot, and therefore exists outside of logic if it exists. Under such circumstances, a belief in a diety cannot be logically reasoned. Hence, why I believe faithless may be looking for someone who does not exist.\n\n Now what you are saying is making a lot more sense to me and I think you are absolutely right.\n \n \n \nThat being said, I still believe in something upstairs because I am a irrational being.\n\n Which is fine. We are all irrational to some extent. It is our nature. The problems come when we assume irrational means \"bad\" and the rationality is supreme to everything.", 
   {}, 
   110033, 
   null, 
   1114108260.0
  ], 
  [
   110308, 
   null, 
   "Master_Shake", 
   "I believe in God, but none of these are good reasons for belief.\n \n \norder and intelligent design go hand in hand, but order is probably on a much wider scale. the balance and consistency of the universe, the excellent meshing of environment and life, the stability of the planet and all its systems, these are all examples of order. \n \n intellegent design pertains to attention to detail, like the filtering function of the kidneys to remove toxins from the circulatory system, or the marvels of the brain. even the peculiar tactics of sother species that allow them to thrive. those are examples of intellegent design\n\n For every example of order, there are ten examples of chaos and disorder.\n The same applies to life. For everything that the body is doing right, there are things it is doing wrong.\n \n \nunexpected good fortune include escaping a would-be fatal accident intact, or recieving a gift of something you needed from an unlikely source at time when you could not obtain it yourself.\n\n Same idea here. What about everyone that dies in those car accidents? What about all the times that you didn't get something you needed? In fact, these events happen more often than the ones you propose.", 
   {}, 
   110213, 
   null, 
   1114108740.0
  ], 
  [
   110351, 
   null, 
   "unkerpaulie", 
   "I believe in God, but none of these are good reasons for belief.\n\n i agree. the thing is, i dont believe in God. so what are your reasons?", 
   {}, 
   110308, 
   null, 
   1114114380.0
  ], 
  [
   110403, 
   null, 
   "Duo_Maxwell", 
   "Now what you are saying is making a lot more sense to me and I think you are absolutely right.\n\n \n Thank you. \n \n \n\n Which is fine. We are all irrational to some extent. It is our nature. The problems come when we assume irrational means \"bad\" and the rationality is supreme to everything.\n\n \n Well, irrational behavior often leads to bad decisions. I noticed that admitting why I believe often leaves strong atheists dumbstruck and silent. On a previous board I had a atheist friend who was about three times as smart as anyone here who was litterally silenced when I stated the irrationality reason. Good fun to say the least.", 
   {}, 
   110301, 
   null, 
   1114123260.0
  ], 
  [
   110425, 
   null, 
   "Big Orn", 
   "...friend who was about three times as smart as anyone here...\n\n Gee, Duo, don't give us much slack there, lad... emoticon_frazzled", 
   {}, 
   110403, 
   null, 
   1114124220.0
  ], 
  [
   110430, 
   null, 
   "Duo_Maxwell", 
   "Gee, Duo, don't give us much slack there, lad... emoticon_frazzled\n\n \n No, I didn't mean it that way. This guy was just brillant. Absolutely brillant. There isn't anyone here that can even remotely compare to him. He had the knowledge of a fricken encylopedia, the socratic skill of socrates himself, litterally knew about world events before 99% of the rest of the forum did, and could bring up virtually any philosopher you can imagine, and use cold logic to shread almost any argument. I avoided discussing anything he could remotely disagree with me on merely because I knew I could not match him any day of the year.", 
   {}, 
   110425, 
   null, 
   1114124400.0
  ], 
  [
   110437, 
   null, 
   "Big Orn", 
   "No, I didn't mean it that way. This guy was just brillant. Absolutely brillant. There isn't anyone here that can even remotely compare to him. He had the knowledge of a fricken encylopedia, the socratic skill of socrates himself, litterally knew about world events before 99% of the rest of the forum did, and could bring up virtually any philosopher you can imagine, and use cold logic to shread almost any argument. I avoided discussing anything he could remotely disagree with me on merely because I knew I could not match him any day of the year.\n\n Were you afraid of his wit? Or was his knowledge over your head? I think the former, right?\n \n I have a man working for me whose knowledge is also brilliant, like a gift. He rarely ever uses it anymore to his advantage, but it's still there. He could be the plant manager, but would rather stick to his tools. Funny how things like that happen.", 
   {}, 
   110430, 
   null, 
   1114124760.0
  ], 
  [
   110440, 
   null, 
   "Duo_Maxwell", 
   "Were you afraid of his wit? Or was his knowledge over your head? I think the former, right?\n\n \n Both. He was too **** smart for me. We'd need to get him throughly drunk and have hot women in the background in skimpy lingerie to even the playfield. \n \n \n\n I have a man working for me whose knowledge is also brilliant, like a gift. He rarely ever uses it anymore to his advantage, but it's still there. He could be the plant manager, but would rather stick to his tools. Funny how things like that happen.\n\n \n That is odd. Also, he has this weird fasination with batman, and he was a brit.", 
   {}, 
   110437, 
   null, 
   1114124940.0
  ], 
  [
   110475, 
   null, 
   "sinjin", 
   "I think you're starting from a false premise: that human minds emerged as some kind of blank slate, on which people later inscribed belief in god for some 'logical' reason.\n \n More likely, in my view, is that when modern human brains emerged they incorporated a strong tendency to 'believe' as part of their operating system: specifically, to believe that effects have causes, for it was the construction of cause-and-effect chains that enabled early human technology. Once you have a hard-wired predisposition to seek causes for effects, it is a small step to invoke supernatural causes for effects whose physical cause you cannot see. To project anthropomorphic form and motivation on these invisible causes is hardly surprising either.\n \n Our need to see a cause for anything that happens is still very strong. It's what makes some of the findings of, say, quantum physics so counter-intuitive. It's what drives conspiracy theorists. And it's what makes an uncaused origin of life and the universe very hard for religious people to swallow.\n\n \n Nicely put and approximates my own reasoning. I like to think of a group huddled around some prehistoric campfire with beasts lurking. Tall tales sound reasonable in such a setting.", 
   {}, 
   110173, 
   null, 
   1114127100.0
  ], 
  [
   110478, 
   null, 
   "Big Orn", 
   "...beasts lurking. \n\n LOL ! You so funny sinjison, so funny. You left \"r\" out of beasts. So funny. emoticon_xclown", 
   {}, 
   110475, 
   null, 
   1114127340.0
  ], 
  [
   110614, 
   null, 
   "Faithless623", 
   "Master_Shake,\n \n \nIt sounds to me like you are just trying to bait very specific arguments that you feel you already know how to shoot down and give yourslef an ego boost. That's a poor use of discussion if you ask me.\n\n \n Its called a debate. Yes I have come to the table prepared. I am familiar with theist arguments and I would like to debate them.\n \n Johnhanks,\n \n \nI think you're starting from a false premise: that human minds emerged as some kind of blank slate, on which people later inscribed belief in god for some 'logical' reason.\n \n More likely, in my view, is that when modern human brains emerged they incorporated a strong tendency to 'believe' as part of their operating system: specifically, to believe that effects have causes, for it was the construction of cause-and-effect chains that enabled early human technology. Once you have a hard-wired predisposition to seek causes for effects, it is a small step to invoke supernatural causes for effects whose physical cause you cannot see. To project anthropomorphic form and motivation on these invisible causes is hardly surprising either.\n \n Our need to see a cause for anything that happens is still very strong. It's what makes some of the findings of, say, quantum physics so counter-intuitive. It's what drives conspiracy theorists. And it's what makes an uncaused origin of life and the universe very hard for religious people to swallow.\n\n \n No, I do not believe the human mind to be a clean slate.\n But most belief from God arises from indoctrination by parents and society on the commonly accepted belief of God.\n \n But in a logical procedure to arrive at a conclusion about the existance of such a diety one would start at the agnostic / atheist position. \n \n unkerpaulie,\n \n \norder and intelligent design go hand in hand, but order is probably on a much wider scale. the balance and consistency of the universe, the excellent meshing of environment and life, the stability of the planet and all its systems, these are all examples of order. \n \n \n Order does not constitute design. \n \n \nintellegent design pertains to attention to detail, like the filtering function of the kidneys to remove toxins from the circulatory system, or the marvels of the brain. even the peculiar tactics of sother species that allow them to thrive. those are examples of intellegent design\n\n \n The natural adaptation and functions within life forms are not examples of design, but rather order. And order does not require a designer.\n \n Order is only the natural course of events and the natural course of events do not lead to the inference of a design.\n \n A kidney has a function and it completes it. This did not happen over night or in a day. It took millions upon millions of years for such a complex system of life to develop.\n \n \nunexpected good fortune include escaping a would-be fatal accident intact, or recieving a gift of something you needed from an unlikely source at time when you could not obtain it yourself.\n\n \n What does that show?\n \n \ncombined, and with the right perspective, all these make a compelling case for God's existence\n\n \n What do you mean the \"right perspective\"? Or did you mean the right bias and presuppositions?\n \n \n \n - - - \n \n Are we starting to get somewhere here or have I been hit with a false hope?", 
   {}, 
   110351, 
   null, 
   1114142100.0
  ], 
  [
   110775, 
   null, 
   "unkerpaulie", 
   "What do you mean the \"right perspective\"? Or did you mean the right bias and presuppositions?\n\n yes, presuppositions and biases are key. remember, before i even began to assess my surroundings as evidence of God's existence, i had already been taught by my parents that God exists, and that the evidence is all around me. it doesnt take long to catch on once this is established. pretty soon i can immediately discern what things are good, and come from God, what things are not good, and come from the devil. because both good and bad exists, this is evidence that both God and the devil exists. and because both are in abundance around us, the evidence is inescapable", 
   {}, 
   110614, 
   null, 
   1114181160.0
  ], 
  [
   110876, 
   null, 
   "Master_Shake", 
   "i agree. the thing is, i dont believe in God?\n\n \n Could have fooled me.\n Faithless doesn't want to hear them (because they aren't \"reasons\" in a logical sense anyway) and I've basically given them in other threads and I don't feel like rehashing it every time a new religion thread comes up.", 
   {}, 
   110351, 
   null, 
   1114196760.0
  ], 
  [
   110956, 
   null, 
   "epaphras_faith", 
   "Yes... the 6,000 year old debate... here we go again :) \n \n Atheism is the most logical default position one could take.\n The lack of belief or knowledge is most usually the first position taken by one on a subject before they are to aquire knowledge or investigate the matter.\n \n So how does the theist move from this default position to his position of belief?\n \n How have you, presuming you to be a theist, come to the conclusion that God exists?\n \n 1. Please first define what you mean by God so we avoid any bad assumptions or confusion.\n \n 2. Please exclude all evidence and reason relating to the word \"feeling\".\n Ex. \"I feel there is a God deep within my heart\"\n - Feelings are personal to the individual and cannot be used as evidence within a conversation unless I (the atheist) have the same feeling; which I assure you, I do not.\n\n \n I would not debate this one as I don't accept your premise that atheism is the most logical or the default. You make an assertion and do not back it up with any evidence. This is the fallacy of the begged question. You assume that lack of belief is the most logical and you assume that it is the default.\n \n I would say much more logical is the searcher. I would say we all come to belief in something, inclulding the atheist. It takes as much faith to believe that there is no god as to believe that there is.\n \n Therefore, your assumptions have no grounds. Therefore, your faith is in those assumptions, therefore, you really do have a god you just don't call it god.\n \n EF", 
   {}, 
   107888, 
   null, 
   1114204860.0
  ], 
  [
   110987, 
   null, 
   "Faithless623", 
   "unkerpaulie,\n \n \nyes, presuppositions and biases are key. remember, before i even began to assess my surroundings as evidence of God's existence, i had already been taught by my parents that God exists, and that the evidence is all around me. it doesnt take long to catch on once this is established. pretty soon i can immediately discern what things are good, and come from God, what things are not good, and come from the devil. because both good and bad exists, this is evidence that both God and the devil exists. and because both are in abundance around us, the evidence is inescapable\n\n \n I hope your kidding...\n If you are... stop wasting my time.\n \n But assuming your not:\n \n If you have already made the presupposition that there is a God to be found then of course all surrouding natural \"evidence\" would be evident of his existance.\n \n Because most \"good\" and \"bad\" in Christianity and other theistic religions is designated as God's will you are using circular reasoning.\n Good and bad presuppose the existance of a God to designate such good and bad. Thus such \"obvious\" good and bad no matter in how much \"abundance\" it is, does not qualify as evidence.\n \n Epaphras_faith,\n \n \nI would not debate this one as I don't accept your premise that atheism is the most logical or the default. You make an assertion and do not back it up with any evidence. This is the fallacy of the begged question. You assume that lack of belief is the most logical and you assume that it is the default.\n\n \n A lack of belief is the default. How could it logically not be?\n \n You claim x. I do not know. I am unknowing on the subject before I have investigated the matter. The same is applied to God.\n \n You claim God. I do not know. I am unknowing on the subject before I have investigated the matter.\n \n \nI would say much more logical is the searcher.\n\n \n Searcher = Agnostic\n Agnostic = Atheist\n \n (Please see definition in prior post of what I mean by atheist)\n \n An atheist simply lacks theistic belief.\n All agnostics therefore are atheists... but not in the typical sense.\n \n \n \nIt takes as much faith to believe that there is no god as to believe that there is.\n\n \n Untrue.\n Faith is belief not resting on logic or material evidence. (See dictionary)\n The lack of belief in God is not faith.\n \n In the case of denying a god's existance. It would depend on which God you are referring to.\n In my own case: I deny the existance of God but that is not based on faith.\n I have reasons that I deny the possibility of the existance of the modern Christian God. But those reasons are not for this thread.\n \n \n \nTherefore, your assumptions have no grounds. Therefore, your faith is in those assumptions, therefore, you really do have a god you just don't call it god.\n\n \n What?\n \n What assumptions have no grounds?\n I do not believe in God.\n If you are speaking of God in the sense of highest value, yes I do have a highest value but to speak of it as God would be a wide unnecessary stretch of the word.\n \n How does this relate to the topic?", 
   {}, 
   110956, 
   null, 
   1114212240.0
  ], 
  [
   111988, 
   null, 
   "unkerpaulie", 
   "If you have already made the presupposition that there is a God to be found then of course all surrouding natural \"evidence\" would be evident of his existance.\n \n Because most \"good\" and \"bad\" in Christianity and other theistic religions is designated as God's will you are using circular reasoning.\n Good and bad presuppose the existance of a God to designate such good and bad. Thus such \"obvious\" good and bad no matter in how much \"abundance\" it is, does not qualify as evidence.\n\n you say that good and bad support the existence of God, therefore good and bad cannot be used as evidence for the existence of God? you lost me...\n \n \nSearcher = Agnostic\n Agnostic = Atheist\n \n (Please see definition in prior post of what I mean by atheist)\n \n An atheist simply lacks theistic belief.\n All agnostics therefore are atheists... but not in the typical sense.\n\n the lack of distinction between agnostic and atheist makes the term redundant and therefore useless. why bother", 
   {}, 
   110987, 
   null, 
   1114445040.0
  ], 
  [
   112042, 
   null, 
   "Master_Shake", 
   "the lack of distinction between agnostic and atheist makes the term redundant and therefore useless. why bother\n\n \n Like I was trying to say earlier, let's not get into another battler about that. It will be another waste of time.", 
   {}, 
   111988, 
   null, 
   1114453380.0
  ], 
  [
   112315, 
   null, 
   "Faithless623", 
   "unkerpaulie,\n \n \nyou say that good and bad support the existence of God, therefore good and bad cannot be used as evidence for the existence of God? you lost me...\n\n \n Yes, apparently I did...\n \n I said:\n \n \nIf you have already made the presupposition that there is a God to be found then of course all surrouding natural \"evidence\" would be evident of his existance.\n \n Because most \"good\" and \"bad\" in Christianity and other theistic religions is designated as God's will you are using circular reasoning.\n Good and bad presuppose the existance of a God to designate such good and bad. Thus such \"obvious\" good and bad no matter in how much \"abundance\" it is, does not qualify as evidence.\n\n \n Meaning:\n \n You cannot use your version of \"good\" and \"evil\" as evidence to support the existance of God. Because good and evil are defined by God himself.\n To use this argument is to make the presupposition that God exists and that is called circular reasoning.\n \n Which part did you not understand?\n \n \n \n \nthe lack of distinction between agnostic and atheist makes the term redundant and therefore useless. why bother\n\n \n This has become irrelevant to the conversation.\n The point is that whether you think agnosticism or atheism is the default it is clear that theism or belief is not the default.\n \n So how does one arrive at theism?\n \n That is the point of this thread, not to debate a meaningless technical defintion.", 
   {}, 
   112042, 
   null, 
   1114483920.0
  ], 
  [
   112319, 
   null, 
   "sinjin", 
   "So how does one arrive at theism?\n \n\n \n Implantation I would think.", 
   {}, 
   112315, 
   null, 
   1114484280.0
  ], 
  [
   112469, 
   null, 
   "unkerpaulie", 
   "well, i think you answered your own question. theism is adopted through the use of circular reasoning that actually makes sense if you dont take the time to really trace the logic of it.", 
   {}, 
   112315, 
   null, 
   1114529760.0
  ], 
  [
   112682, 
   null, 
   "Faithless623", 
   "unkerpaulie,\n \n \nwell, i think you answered your own question. theism is adopted through the use of circular reasoning that actually makes sense if you dont take the time to really trace the logic of it.\n\n \n Either you are making fun of theism...\n \n Or your serious...\n \n Either which in this case is a waste of my time.", 
   {}, 
   112469, 
   null, 
   1114554960.0
  ], 
  [
   112911, 
   null, 
   "unkerpaulie", 
   "Either you are making fun of theism...\n \n Or your serious...\n \n Either which in this case is a waste of my time.\n\n is there a point that YOU'd like to make? you seem to be seeking some form of religious whipping boy that you can make an example of. i'm sorry if this board disappoints you. there are lots of christian forums out there where your ideal specimen would be found. apparently you have a problem with honest opinions. too bad\n \n my responses answer your question. i am talking from first hand experience, having been a fundamentalist for most of my life. i am now in a position where i can dettach myself from my beliefs and give you a more balanced and unbiased commentary of the workings of the theist rationale. i dare you to find a better source.\n \n i'm sorry that i didnt fall into your mould by trying to protect my beliefs because of emotional attachment. those are hard to find and even harder to carry on a rational discussion with. best of luck with that", 
   {}, 
   112682, 
   null, 
   1114617300.0
  ], 
  [
   113653, 
   null, 
   "Faithless623", 
   "theism is adopted through the use of circular reasoning\n\n \n \n Are you serious?\n Do you understand what circular reasoning is?\n \n Let me give you an example:\n \n I ask you to prove that God exists... You use circular reasoning and claim that:\n \n A. The Bible is true and God exists because the Bible says so\n B. God exists and so the Bible must be true\n \n You CANNOT use circular reasoning to prove a point. Its irrelevant and illogical.\n \n \n \nactually makes sense if you dont take the time to really trace the logic of it.\n\n \n Logic is exactly what I've been trying to discuss.\n \n There is no side-stepping reason for the sake of a point.", 
   {}, 
   112911, 
   null, 
   1114727340.0
  ], 
  [
   113701, 
   null, 
   "Dzeron", 
   "The issue with theists, though, is that if you back them into a corner they will say that God created logic and is therefore above it.", 
   {}, 
   113653, 
   null, 
   1114730820.0
  ], 
  [
   114020, 
   null, 
   "Faithless623", 
   "The issue with theists, though, is that if you back them into a corner they will say that God created logic and is therefore above it.\n\n \n \n Which of course is more circular reasoning which is not valid in the field of legitimate logical debate.", 
   {}, 
   113701, 
   null, 
   1114788900.0
  ], 
  [
   114049, 
   null, 
   "unkerpaulie", 
   "Are you serious?\n Do you understand what circular reasoning is?\n \n Let me give you an example:\n \n I ask you to prove that God exists... You use circular reasoning and claim that:\n \n A. The Bible is true and God exists because the Bible says so\n B. God exists and so the Bible must be true\n \n You CANNOT use circular reasoning to prove a point. Its irrelevant and illogical.\n \n \n Logic is exactly what I've been trying to discuss.\n \n There is no side-stepping reason for the sake of a point.\n\n *sigh* yes i am serious. since you're so logical, i thought you'd have figured it out by now: theism REQUIRES a denial of logic. theism, by its very nature, is not just illogical, but counter-logical. therefore, you cannot use logic to define or discuss theological issues.\n \n i see you dont really like to figure things out through hints, so there, i spelled it out for you plain as possible", 
   {}, 
   113653, 
   null, 
   1114791540.0
  ], 
  [
   114054, 
   null, 
   "Faithless623", 
   "therefore, you cannot use logic to define or discuss theological issues.\n\n \n \n \n ...\n \n How many times did I need to indicate that I wished to discuss the idea of God from a logical perspective?\n \n \n Just forget it", 
   {}, 
   114049, 
   null, 
   1114792440.0
  ], 
  [
   114066, 
   null, 
   "Waxy", 
   "...\n \n How many times did I need to indicate that I wished to discuss the idea of God from a logical perspective?\n \n Just forget it\n\n \n How many times in how many different ways do you need to be told it's not possible? emoticon_rolleyes \n \n A few have tried, look up some of \"Montalban\"'s posts, but it's a losing hand.\n \n Waxy", 
   {}, 
   114054, 
   null, 
   1114793880.0
  ], 
  [
   114075, 
   null, 
   "unkerpaulie", 
   "How many times did I need to indicate that I wished to discuss the idea of God from a logical perspective?\n \n \n Just forget it\n\n this is a waste of a wish that could have been used elsewhere.\n \n would you be willing to discuss the idea of God from an obscure philosophical perspective? i didnt think so... sometimes you just cant have it your way emoticon_rolleyes", 
   {}, 
   114054, 
   null, 
   1114795260.0
  ], 
  [
   114668, 
   null, 
   "Faithless623", 
   "would you be willing to discuss the idea of God from an obscure philosophical perspective? i didnt think so... \n \n \n Your correct.\n \n I would not be willing to discuss the idea of God from an \"obscure philosophical perspective\" that disregards all forms of reason and logic.", 
   {}, 
   114075, 
   null, 
   1114908000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Atheism to Theism", 
  "url": "http://www.4forums.com/political/religion-debates/4827-atheism-theism.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4827, 
  "discussion_files": [
   [
    "20951.html", 
    "http://www.4forums.com/political/religion-debates/4827-atheism-theism-print.html"
   ], 
   [
    "20952.html", 
    "http://www.4forums.com/political/religion-debates/4827-atheism-theism-5-print.html"
   ], 
   [
    "20953.html", 
    "http://www.4forums.com/political/religion-debates/4827-atheism-theism-4-print.html"
   ], 
   [
    "20954.html", 
    "http://www.4forums.com/political/religion-debates/4827-atheism-theism-3-print.html"
   ], 
   [
    "20955.html", 
    "http://www.4forums.com/political/religion-debates/4827-atheism-theism-2-print.html"
   ]
  ], 
  "identifier": 4827
 }
]