[
 [
  [
   107926, 
   null, 
   "Duo_Maxwell", 
   "The 14th ammendemnet forces states to recognize and abide to the laws and rights of other states. The 14th also forces other states to recognize marriages performed in other states. The 14th is in the federal consitution, which overrides any state law. \n \n Do the state laws that have been passed banning gay marriage also cause the state not to recognize gay marriages performed in other states? \n I can see how this would work legally if they could only ban such marriages taking place in their state, but would recognize marriages performed in other states.\n \n How does that get around the 14th?", 
   {
    "post_info": {
     "post_title": "I'm missing something here."
    }
   }, 
   null, 
   null, 
   1113620640.0
  ], 
  [
   108022, 
   null, 
   "BobNelson2", 
   "<<How does that get around the 14th?<<\n \n It doesn't. That's why they want the Federal Marriage Amendment.", 
   {}, 
   107926, 
   null, 
   1113680460.0
  ], 
  [
   108251, 
   null, 
   "jyoshu", 
   "The 14th ammendemnet forces states to recognize and abide to the laws and rights of other states. The 14th also forces other states to recognize marriages performed in other states. The 14th is in the federal consitution, which overrides any state law. \n\n \n What are you talking about? If that were true, every law in every state would have to be \"abided by\" no matter what state you were in, even if 49 other state didn't have that law on the books. That doesn't even make any sense; there have always been differences in state law between states.", 
   {}, 
   107926, 
   null, 
   1113773700.0
  ], 
  [
   108255, 
   null, 
   "Duo_Maxwell", 
   "What are you talking about? If that were true, every law in every state would have to be \"abided by\" no matter what state you were in, even if 49 other state didn't have that law on the books. That doesn't even make any sense; there have always been differences in state law between states.\n\n \n Article IV\n \n Section 1. Full faith and credit shall be given in each state to the public acts, records, and judicial proceedings of every other state. And the Congress may by general laws prescribe the manner in which such acts, records, and proceedings shall be proved, and the effect thereof. \n \n Section 2. The citizens of each state shall be entitled to all privileges and immunities of citizens in the several states.", 
   {}, 
   108251, 
   null, 
   1113774360.0
  ], 
  [
   108261, 
   null, 
   "JustineCredible", 
   "Article IV\n \n Section 1. Full faith and credit shall be given in each state to the public acts, records, and judicial proceedings of every other state. And the Congress may by general laws prescribe the manner in which such acts, records, and proceedings shall be proved, and the effect thereof. \n \n Section 2. The citizens of each state shall be entitled to all privileges and immunities of citizens in the several states.\n\n \n I'm thinking jyoshu's misunderstanding is comming from the concept of \"acts, records and judicial proceedings.\" \n Not to mention Section 2 which you also discribed.", 
   {}, 
   108255, 
   null, 
   1113774960.0
  ], 
  [
   108877, 
   null, 
   "gnojek", 
   "The constitution is so damned confusing. ARRRGH!\n \n I never got this:\n \n Ok, if this is true:\n \n  The citizens of each state shall be entitled to all privileges and immunities of citizens in the several states.\n \n And this:\n \n Section 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside. No state shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any state deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n \n \n How can one state have laws that, for example, say you can't sell liquor on Sunday, but some states don't have these laws?\n \n Can I sell liquor on Sunday in Utah and claim the 14th ammendment or Article 2?\n \n If so, what's the point of even having states?", 
   {}, 
   108261, 
   null, 
   1113867720.0
  ], 
  [
   108887, 
   null, 
   "Duo_Maxwell", 
   "Utah has a law like that?", 
   {}, 
   108877, 
   null, 
   1113868440.0
  ], 
  [
   108920, 
   null, 
   "Master_Shake", 
   "As I understand it, the full faith and credit clause applies primarily to contracts, not just any law. Marriage is a contract, so it does apply to marriages. It is not only the gay marriage bans in this case that are causing the problem here, it is the bans in conjunction with the Federal Marriage Protection Act which says that no state has to recognize any gay marriage from any other state. This law will have to be challenged in the courts before anything can really happen. Maybe it already isbeing challenged, I'm not sure. But if someone isn't challenging it, that needs to change real fast.", 
   {}, 
   108887, 
   null, 
   1113876000.0
  ], 
  [
   108998, 
   null, 
   "Missouri Mule", 
   "It's a good question and one I have puzzled over for many years as I worked in child support. We constantly had to go back to court even after a valid support order existed in another state. My own personal view was that doing an end around the 14th Amendment is part of the Lawyer's Full Employment Act. And as most people know, about all of Congress are made up of lawyers. So perhaps this is all too obvious.", 
   {}, 
   108920, 
   null, 
   1113890820.0
  ], 
  [
   109097, 
   null, 
   "jyoshu", 
   "Article IV\n \n Section 1. Full faith and credit shall be given in each state to the public acts, records, and judicial proceedings of every other state. And the Congress may by general laws prescribe the manner in which such acts, records, and proceedings shall be proved, and the effect thereof. \n \n Section 2. The citizens of each state shall be entitled to all privileges and immunities of citizens in the several states.\n\n \n So if California decides one day to allow it's citizens to have 15 spouses and call that a marriage, you think the 14th amendment requires all the other states to recognize that? No. You have an odd way of constitutional interpretation.", 
   {}, 
   108255, 
   null, 
   1113923040.0
  ], 
  [
   109218, 
   null, 
   "wsm2506", 
   "So if California decides one day to allow it's citizens to have 15 spouses and call that a marriage, you think the 14th amendment requires all the other states to recognize that? No. You have an odd way of constitutional interpretation.\n\n \n SCOTUS Justice jyoshu has SPOKEN!!!! How DARE you peons doubt him!!!!!!! emoticon_frazzled", 
   {}, 
   109097, 
   null, 
   1113935040.0
  ], 
  [
   109382, 
   null, 
   "Duo_Maxwell", 
   "So if California decides one day to allow it's citizens to have 15 spouses and call that a marriage, you think the 14th amendment requires all the other states to recognize that? No. You have an odd way of constitutional interpretation.\n\n \n Why wouldn't it? After all, you offer nothing but insults", 
   {}, 
   109097, 
   null, 
   1113955860.0
  ], 
  [
   109402, 
   null, 
   "gnojek", 
   "Utah has a law like that?\n\n I don't know, couldn't find it:\n http://www.alcbev.state.ut.us/Liquor_Laws/liquor_laws_affecting_visitors.html\n \n \n \n For a while there, Louisiana was the only state in the union to allow people 18 and older to drink alcohol. Does this mean that I could have had a drink anywhere in the country because of the Full Faith and Credit clause or the 14th ammendment?\n \n Every state has different liquor laws. Some can sell it in supermarkets. Some can sell all types of alcohol together, others segregate liquor and wine from beer and malt liquor. How can this be under these clauses in the Constitution?\n \n Some states have different laws as to how much alcohol beer can contain.\n \n Here's something more about Utah, but it sounds pretty similar to a lot of states in the midsouth (bible belt):\n http://www.fortogden.com/utahliqlaw.html\n \n \nUTAH STATE-OWNED LIQUOR STORES are the sole dispensers of carry-out liquor, wine and real beer. There are a number of these stores hidden throughout the state. They are closed on Sundays, holidays and other designated times. Lack of competition keeps the selection severely limited. Prices for wine and liquor are fixed with a minimum of 61% mark-up over cost, plus high state taxes. For real beer, the mark-up is 75% plus taxes, making the retail cost of some six-packs well over $10. Because of all this, the small community of Evanston, Wyoming (located about 70 miles east of Salt Lake City just over the Utah border) enjoys a bustling economy based on a large number of retail liquor stores located along Interstate 80. \n\n \n Maybe the stores aren't state run, but they follow the same rules.\n They are closed on Sunday and close promptly at 10pm on weekdays and saturdays.\n \n The prices are always high. I've gone to other states without these dumb laws and the selection is much better and the prices are much lower.\n \n Anyway, I'm not feeling like I have all the privileges and immunites granted in the several states.", 
   {}, 
   108887, 
   null, 
   1113958020.0
  ], 
  [
   109459, 
   null, 
   "Duo_Maxwell", 
   "Actually i think louisana got rid of that law. Guess paying for their own highway system became too expensive.\n \n That is weird. Some things are okay, and somethings are not. Seems double stadnardish.", 
   {}, 
   109402, 
   null, 
   1113961860.0
  ], 
  [
   109953, 
   null, 
   "gnojek", 
   "Actually i think louisana got rid of that law. Guess paying for their own highway system became too expensive.\n \n That is weird. Some things are okay, and somethings are not. Seems double stadnardish.\n\n \n O yeah they did quite a while ago.\n \n I used to live there and I turned 18 before they changed the law.\n And I turned 21 a few years after they changed it so I was in the clear.\n \n \n \n I still don't know which laws or rights or privileges are considered \"privileges and immunites\" by the courts. At least enough for the 14th ammendment to apply.\n \n I've been told in other forums that teaching creationism in public schools violates the 1st ammendment. When I say that it doesn't if the 1st ammendment is interpreted strictly by its wording, they say, OK, it violates the 14th ammendment because other people in other states are immune from these practices, or it's discrimination or something. \n \n Why don't liquor laws (and gambling and prostituion, any vice law) apply to the same criteria? \n \n \n I don't get it.", 
   {}, 
   109459, 
   null, 
   1114038600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I'm missing something here.", 
  "url": "http://www.4forums.com/political/gay-rights-debates/4830-im-missing-something-here.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 4830, 
  "discussion_files": [
   [
    "24645.html", 
    "http://www.4forums.com/political/gay-rights-debates/4830-im-missing-something-here-print.html"
   ]
  ], 
  "identifier": 4830
 }
]