[
 [
  [
   108165, 
   null, 
   "Missouri Mule", 
   "I have read these assertions that Norway is so wealthy. This article in the NYT seems to take issue with that. What is the real story here?\n \n http://www.nytimes.com/2005/04/17/weekinreview/17bawer.html?", 
   {
    "post_info": {
     "post_title": "Wealth in Europe"
    }
   }, 
   null, 
   null, 
   1113755820.0
  ], 
  [
   108172, 
   null, 
   "Eddie", 
   "I have read these assertions that Norway is so wealthy. This article in the NYT seems to take issue with that. What is the real story here?\n \n http://www.nytimes.com/2005/04/17/weekinreview/17bawer.html?\n\n \n First of all, I`m not norweigan so I don`t have any real experience with the norweigan economic system. But here is my explanations and points:\n \n Norway is incredibly rich. But it chooses not to spend this wealth for two reasons: 1. Unlike most countries on this planet, Norway has realized that their main source of wealth, their oil deposits are finite. and 2: Because of their massive national income from oil, Norway are afraid of setting of an inflation spiral that would undercut their international competativity. With prices allready higher than their neighbouring countries, Norway`s government is wary of their spending (even though they could easily afford it).\n \n With this in mind, the Norweigan government saves a tremendous amount of their GDP in foreign funds and currencies. Compare this to most countries high national debts and rampant budget decifits and you`ll understand why norweigans, one of the wealthiest people in the world, doesn`t drive around in the newest model of sportscars.\n \n Another aspect is also the difference between european and american relation or preferences towards working and leisure time. Just like most european countries, norweigans on average work far less than the average american. Naturally this will be reflected in material standards (such as GDP and access to new shiny toys).\n \n As for the reference to the \"Swedish research organization, Timbro\", this should be taken with a pinch of salt. The research organisation is nothing more than a political think-tank bent on destroying the Swedish and european wellfare state. It`s a joke to call it a research organisation... I actually think we discussed the so-called study on this board. I have read it numerous times and is full of deceptive and even fraudulent errors, such as comparing american households with Swedish household without even mentioning that US households are two person households (families) where as hushåll in Sweden are generally one person households.\n \n I would also like to point out that Norway constantly tops every attempt to compare material or immaterial wellfare of countries. I certainly would say that Norway is, if not the richest country, at least among the richest countries in the world. And with a populace with the highest wellfare.", 
   {}, 
   108165, 
   null, 
   1113757740.0
  ], 
  [
   108174, 
   null, 
   "Missouri Mule", 
   "Thanks. That was most helpful. What is your perception of American economic status?", 
   {}, 
   108172, 
   null, 
   1113758040.0
  ], 
  [
   108176, 
   null, 
   "Eddie", 
   "Thanks. That was most helpful. What is your perception of American economic status?\n\n \n America is most probably the richest country on this planet. Only Luxemburg and perhaps Norway could rival the US economic performance. It`s GDP per capita has been higher than every other country since the second world war. And while the gap between Europe and the US has slowly been shrinking the last 50 years (due to catching up effects) the gap has actually increased the last decade. I`m not as worried about the US economic situation as some of the posters on this board, but I also don`t consider laisse fare economics to be superior to interventionistic or partial-socialistic system.", 
   {}, 
   108174, 
   null, 
   1113758280.0
  ], 
  [
   108180, 
   null, 
   "fracas", 
   "no one in the US really believes the economic system should be free of all restraints and constraints. the question really is how much freedom in the market place should there be, and where to place the brakes.\n my take is that the european model is to try and apply the break apriori with rules and regulation, whereas the US model is more of a post priori with rules and punishments. thus the EU model appears to have more onerous conditions to provent harm, while that of the US as more freedom thus more likelihood of harm (and a great deal of good) to be punished.\n lots of generalization there i know.", 
   {}, 
   108176, 
   null, 
   1113758820.0
  ], 
  [
   108181, 
   null, 
   "Missouri Mule", 
   "America is most probably the richest country on this planet. Only Luxemburg and perhaps Norway could rival the US economic performance. It`s GDP per capita has been higher than every other country since the second world war. And while the gap between Europe and the US has slowly been shrinking the last 50 years (due to catching up effects) the gap has actually increased the last decade. I`m not as worried about the US economic situation as some of the posters on this board, but I also don`t consider laisse fare economics to be superior to interventionistic or partial-socialistic system.\n\n \n You seem to have your feet firmly planted on solid ground. I'm a conservative but am concerned about the drift that seems to have come over us with respect to the economic problems; such as the deficit and medical care costs. Bush is not handling those as he should. He is also now a lame duck president and his power will erode rapidly as time goes by. Just a FYI: With the low number of GOP presidential heavyweights I would not be at all surprised to see Hillary Clinton as the next president; especially if the economy is sluggish. Our politics has become so divisive that is just getting crazy.", 
   {}, 
   108176, 
   null, 
   1113758940.0
  ], 
  [
   108189, 
   null, 
   "gamehuis", 
   "As a Dutchman I admire the way the Norwegians handle their affairs. Their politicians seem to have a clear view as to what is best for the people and act accordingly. As such the Norwegians enjoy a rather high standard of living without the massive debt that for example the US has.", 
   {}, 
   108181, 
   null, 
   1113761760.0
  ], 
  [
   108190, 
   null, 
   "Missouri Mule", 
   "As a Dutchman I admire the way the Norwegians handle their affairs. Their politicians seem to have a clear view as to what is best for the people and act accordingly. As such the Norwegians enjoy a rather high standard of living without the massive debt that for example the US has.\n\n \n What is the Norwegian national debt?\n ---------------------------------\n I did my own investigation. Pretty good shape at 22% of GDP. Here is the CIA take on Norway. \n =====================\n The Norwegian economy is a prosperous bastion of welfare capitalism, featuring a combination of free market activity and government intervention. The government controls key areas, such as the vital petroleum sector (through large-scale state enterprises). The country is richly endowed with natural resources - petroleum, hydropower, fish, forests, and minerals - and is highly dependent on its oil production and international oil prices, with oil and gas accounting for one-third of exports. Only Saudi Arabia and Russia export more oil than Norway. Norway opted to stay out of the EU during a referendum in November 1994. The government has moved ahead with privatization. With arguably the highest quality of life worldwide, Norwegians still worry about that time in the next two decades when the oil and gas begin to run out. Accordingly, Norway has been saving its oil-boosted budget surpluses in a Government Petroleum Fund, which is invested abroad and now is valued at more than $43 billion. GDP growth was a lackluster 1% in 2002 and 0.5% in 2003 against the background of a faltering European economy.\n ===================================\n \n BTW, the U.S. public debt is 62.4% of GDP. By contrast, Japan is 154.6% of GDP. Germany is 64.2% and France is 68.8% and Sweden is 51.8% (pretty good). Netherlands is 54.1%.", 
   {}, 
   108189, 
   null, 
   1113761940.0
  ], 
  [
   108198, 
   null, 
   "Eddie", 
   "no one in the US really believes the economic system should be free of all restraints and constraints. \n\n \n Hehe... surely some do ;) But I was more refering to the population on this board. We have quite a few self-declared anarcho-capitalists in here...\n \n \n \nthe question really is how much freedom in the market place should there be, and where to place the brakes.\n my take is that the european model is to try and apply the break apriori with rules and regulation, whereas the US model is more of a post priori with rules and punishments. thus the EU model appears to have more onerous conditions to provent harm, while that of the US as more freedom thus more likelihood of harm (and a great deal of good) to be punished.\n lots of generalization there i know.\n\n \n I think it`s a good generalisation. Another difference is also how the wellfare and resource re-distribution systems work. In Europe, we tend to have an inclusive wellfare system where everyone pays, whereas the US seem to have a rather exclusive wellfare system and the rich foot the bill. The pro of the US system is that you get the same safety-net for much less, while the cons are that there is much disagreement of the existance of wellfare-programes, and there is a risk of people \"falling between chairs\" (ie; not rich enough to pay themselve, not poor enough to qualify for governmental aid)... \n \n \n \nYou seem to have your feet firmly planted on solid ground. \n\n \n Hehe.. Thanks :) What can I say, I think Fracas has rubbed off on me :p \n \n \nI'm a conservative but am concerned about the drift that seems to have come over us with respect to the economic problems; such as the deficit and medical care costs. Bush is not handling those as he should. He is also now a lame duck president and his power will erode rapidly as time goes by. \n\n \n These could very well be a problem in the future. But they are certainly over-come-able. I mean, virtually every country suffer from economic crisis from time to time. We (Sweden) had a pretty serious one in the early ninetiees. We haven`t caught up what we lost during those years yet, but a crisis result in improved foreign competativity and gives the politicians leeway to reform stale and innefficient agencies/systems/etc. I the end, you`ll do just fine :)\n \n \nJust a FYI: With the low number of GOP presidential heavyweights I would not be at all surprised to see Hillary Clinton as the next president; especially if the economy is sluggish. Our politics has become so divisive that is just getting crazy.\n\n \n It would be interesting to see a woman lead the world`s most powerful nation (and possibly a socialist to boot!)... Recently, we had a launch of a political party based on feministic ideology. If they make it to parliament the next election we could quite possibly have the first government that includes party officials from a party based on feministic ideology. Perhaps this is the wave of the future...", 
   {}, 
   108180, 
   null, 
   1113763140.0
  ], 
  [
   108278, 
   null, 
   "Missouri Mule", 
   "Hehe... surely some do ;) But I was more refering to the population on this board. We have quite a few self-declared anarcho-capitalists in here...\n \n I think it`s a good generalisation. Another difference is also how the wellfare and resource re-distribution systems work. In Europe, we tend to have an inclusive wellfare system where everyone pays, whereas the US seem to have a rather exclusive wellfare system and the rich foot the bill. The pro of the US system is that you get the same safety-net for much less, while the cons are that there is much disagreement of the existance of wellfare-programes, and there is a risk of people \"falling between chairs\" (ie; not rich enough to pay themselve, not poor enough to qualify for governmental aid)... \n \n Hehe.. Thanks :) What can I say, I think Fracas has rubbed off on me :p \n \n These could very well be a problem in the future. But they are certainly over-come-able. I mean, virtually every country suffer from economic crisis from time to time. We (Sweden) had a pretty serious one in the early ninetiees. We haven`t caught up what we lost during those years yet, but a crisis result in improved foreign competativity and gives the politicians leeway to reform stale and innefficient agencies/systems/etc. I the end, you`ll do just fine :)\n \n It would be interesting to see a woman lead the world`s most powerful nation (and possibly a socialist to boot!)... Recently, we had a launch of a political party based on feministic ideology. If they make it to parliament the next election we could quite possibly have the first government that includes party officials from a party based on feministic ideology. Perhaps this is the wave of the future...\n\n \n Whatever happens will have the fingerprints of Bill Clinton all over it. Essentially, our country is a conservative country but there comes a point in time when the people want something done about endemic problems such as the ridiculous cost of prescription drugs. Our problem is that most of the politicians have been bought and paid for by the big money special interests. The drug companies spend enormous sums on both parties to get special treatment. And then there is the 90,000 page IRS code and gerrrymandering. It's a mess. We truly need a constitutional convention to fix a lot of these problems. We are truly a divided nation.", 
   {}, 
   108198, 
   null, 
   1113778020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Wealth in Europe", 
  "url": "http://www.4forums.com/political/european-politics-economics/4839-wealth-europe.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 4839, 
  "discussion_files": [
   [
    "20005.html", 
    "http://www.4forums.com/political/european-politics-economics/4839-wealth-europe-print.html"
   ]
  ], 
  "identifier": 4839
 }
]