[
 [
  [
   108203, 
   null, 
   "Mach", 
   "Seems to be a common theme on a number of threads.\n \n My first impression that moral objectivism is primarily a result of the dogmatic teachings of relgious mythologies, or just a lack of having though about the topic (which at some point all of us were guilty of!).\n \n Moral relativism in contrast, is realistic, and justifiable, and important for a society to understand.\n \n We can jump right to the problem with moral objectivism that I see being dodged in the threads:\n \n 1. From where does a person come to know what is objectively right or wrong?\n 2. What method can we use to obtain this objective information?\n 3. How do we determine if the information received from this source, is true or false?\n \n Moral relativism on the other hand, is quite easily justifiable and demonstrated, and does not suffer from such problems.\n \n I define what is right or wrong, relative to me.\n You define what is right or wrong, relative to you.\n \n We often, as a society, discuss our individual ideas of right and wrong, and often by majority, agree that some of our ideas need to apply to everyone, need to be described by law, and punishable, if we are to function as a society.\n \n \n -Mach", 
   {
    "post_info": {
     "post_title": "Moral objectivism vs Moral relativism"
    }
   }, 
   null, 
   null, 
   1113764220.0
  ], 
  [
   108206, 
   null, 
   "Alan Ryan", 
   "Seems to be a common theme on a number of threads.\n \n My first impression that moral objectivism is primarily a result of the dogmatic teachings of relgious mythologies, or just a lack of having though about the topic (which at some point all of us were guilty of!).\n \n -Mach\n\n \n \n Before this discussion gets under way, would you include in your defence of the relativist position, the assertion that truth itself is a product of cultural relativism ? It might turn out to be important.", 
   {}, 
   108203, 
   null, 
   1113764700.0
  ], 
  [
   108223, 
   null, 
   "Mach", 
   "Before this discussion gets under way, would you include in your defence of the relativist position, the assertion that truth itself is a product of cultural relativism ? It might turn out to be important.\n\n \n I want to understand it first.\n \n I keep thinking it's all related to Godels (2nd) incompleteness theorem:\n No consistent system can be used to prove its own consistency.  \n \n In general, I'm taking your input to mean that we define truth, by using some agreed upon \"system\" (which is relative), and this allows us to define, and agree upon, our definition of truth. In that way \"truth\" is relative, but within the system itself, it's not relative. It's the understanding that all systems we discuss conceptually are necessarily relative.\n \n Am I understanding you correctly?\n \n -Mach", 
   {}, 
   108206, 
   null, 
   1113768180.0
  ], 
  [
   108496, 
   null, 
   "Alan Ryan", 
   "I want to understand it first.\n \n I keep thinking it's all related to Godels (2nd) incompleteness theorem:\n No consistent system can be used to prove its own consistency.  \n \n In general, I'm taking your input to mean that we define truth, by using some agreed upon \"system\" (which is relative), and this allows us to define, and agree upon, our definition of truth. In that way \"truth\" is relative, but within the system itself, it's not relative. It's the understanding that all systems we discuss conceptually are necessarily relative.\n \n Am I understanding you correctly?\n \n -Mach\n\n No, I'm not referring to a mathematical theory. \n \n What I had in mind was the idea, popular among some relativists, that \"truth\" is culturally determined. To give an example: In Iran it is generally agreed there is only one god; so in Iran it is true there is only one god. But in Papua New Guinea, the people tend to believe in many gods - so in that place a different \"truth\" emerges about the same thing. In other words, every culture has the power to make its own truth.\n \n I do not think, unless some religious enthusiast enters the fray, that you will find anyone contributing to this thread and arguing that moral values have an absolute character that is impervious to changes of time or circumstance. Apart from people agreeing with you, all you will get, I guess, is the oddball like me who is uneasy at the subjective implications of:\n \n I define what is right or wrong, relative to me. \n You define what is right or wrong, relative to you.\n \n My other source of uneasiness with clinical unqualified relativism in moral questions, would be based on the (historical) evidence that many notions of what is right or wrong have been shared by many different peoples at many different times in many different places. This apparent consistency suggests (at least to me) that there is and always has been a similar moral consensus which societies evolve for themselves. Given the open ended possibilities that a relative position implies, why have we arrived at a most particular moral consensus ?", 
   {}, 
   108223, 
   null, 
   1113820620.0
  ], 
  [
   108499, 
   null, 
   "Eddie", 
   "If truth is entirely determined by culture, wouldn`t that imply that if my culture believe themselves to have the universal truth to everything, this would be true? Perhaps this has been borught up before though...", 
   {}, 
   108496, 
   null, 
   1113821760.0
  ], 
  [
   108504, 
   null, 
   "Alan Ryan", 
   "If truth is entirely determined by culture, wouldn`t that imply that if my culture believe themselves to have the universal truth to everything, this would be true? Perhaps this has been borught up before though...\n\n \n Something like that would be the case; but I'm not asserting it - I was just asking a question about whether a broad definition of moral relativism would include such an assertion about the \"truth\"", 
   {}, 
   108499, 
   null, 
   1113825840.0
  ], 
  [
   108547, 
   null, 
   "Symbiote", 
   "I found this resource interesting:\n http://plato.stanford.edu/entries/moral-relativism/\n \n There are a few possibilities.\n \n For example, it could be that no absolute right or wrong exist. But to positively claim this, is like being a gnostic atheist - it involves claiming the absolute non-existence of something perhaps undetectable. It's all very well and good to say \"Undetectable Pink Unicorns certainly don't exist in my basement\", but its a claim that can't really ever be proved.\n \n It could be for example, that an absolute right and wrong exist, but that we have no way of knowing them. God could have generated an objective right and wrong set and be sitting back, from behind the curtains. But we can't know.\n \n The agnostic position is that we can't know whether they exist or don't, because of epistemological problems we encounter. Given an absence of any other proof for them, this would seem to be the most reasonable position - \"I don't believe in an objective morality because I have not seen any proof of its existence, however I do not positively claim it does not exist.\"\n \n The questioned posed therefore, somewhat miss the mark.\n \n \n1. From where does a person come to know what is objectively right or wrong?\n 2. What method can we use to obtain this objective information?\n 3. How do we determine if the information received from this source, is true or false?\n \n\n \n Even if someone has no way of knowing, (epistemological problems), this does not show the objective does not exist. Again we fall back to the agnostic position - it's possible we simply cannot know. In short, the fact we have no way of knowing if there is life on other planets, or if God exists, in no way demonstrates that the answers to these questions are not objective - as such, absence of knowledge poses no logical problem for moral absolutism, though it does make it very much irrelevant to our everyday lives. If, that is, this absolute system is unknowable. And even if we lacked knowledge now, that would not demonstrate to us that something was inherently unknowable.\n \n As Eddie pointed out however, there is a degree of circularity in the assertion of moral relativism. Even if it were true, why should anyone believe it? Why shouldn't someone simply believe there exist an absolute set? Whatever answer you provide undermines the position. To say, \"You should believe it, because it is true\" rests on the idea that truth is a universal or absolute good. Otherwise, why isn't something's truth just as good a reason for not believing in it? Why not say, \"Because moral relativism is true, we should all believe in moral absolutism.\"?\n \n Indeed, it may be that moral absolutism, even if not actually true, is a more profitable system to live by. Christianity has survived for thousands of years, and it preaches moral absolutism. Even if moral relativism is true, why should anyone believe it - unless Truth is ultimately, and absolutely, the right system to live by?\n \n So essentially, you can pick at absolutism, but the holes dug so far aren't really holes at all. Even if it is impossible to determine what the objective system is, that does not imply it does not exist. At best we can say there is no reason we should believe in it - but if moral relativism is true, there is no such thing as an \"objectively\" good reason to believe in anything anyway.\n \n By the moral relativist's own admission, there is no more reason we should believe in moral relativism than moral absolutism.\n \n So it appears the debate is insoluble - if we cannot identify a set of ethics, objectively, and somehow determine them in such a way that they are undeniably and irreffutably true, there is no real reason we should believe in either system any more than the other, if we believe in either of them at all.\n \n Kant however, and those who have drawn from him, raise the possibility of a way out of this bind. I was inspired by Mach actually, who I had seen argue that thought neccessarily implied language. Descartes wrote; Cogito, Ergo Sum. Perhaps the important lesson we should draw from Descartes is not that we exist, but that we think. And if thought, as Mach argues, implies language - language implies certain rules. There can be no language in which X is not X, or in which a square is round. Certainly you could have a language in which the word \"square\" meant \"round thing\", but you cannot have a language in which a 4 cornered shape with equal length sides is perfectly round. Bound up in this language, which is implied in thought, are the rules, for example of mathematics. If we were to travel to the other side of the galaxy, and discover an alien race who had independently, with minds vastly dissimilar to ours, discovered the science of numbers, the rules of their maths would be, at the deepest level, the same as ours. (Even if they used Base 8 or 13 instead of 10, for example).\n \n And, some would argue, ethical rules are bound up in this language too, they are implied in the very nature of thinking. By this token they would apply to all conscious minds, and by their very nature be egalitarian, applying to all people (and indeed, alien life forms with a reasonably high level of intelligence). They would satisfy for example, the requirements of Kant's Categorical Imperative. The conclusions drawn are remarkably cohesive with traditional ethical principles - Equal rights for all, the golden rule, eye for an eye, the sanctity of life, \"that which is consented to is no harm\", a great deal of coherence with the \"natural law\" theories that blossomed during the enlightenment, and so on, all appear closely related to the deductions these apriori theorists claim are logical consequences of the fact that we are thinking beings.\n \n Now I am personally agnostic on the issue. I have not studied such arguments in depth enough to declare them correct. But at least they may offer one thing which the moral relativist's position does not - if they are correct, we will actually have a good reason to believe in them.", 
   {}, 
   108504, 
   null, 
   1113835260.0
  ], 
  [
   108555, 
   null, 
   "Alan Ryan", 
   "I found this resource interesting:\n http://plato.stanford.edu/entries/moral-relativism/\n \n \n By the moral relativist's own admission, there is no more reason we should believe in moral relativism than moral absolutism.\n \n \n\n \n I pick just this one proposition from your erudite commentary because I've also asked questions about the ultimate subjectivity of the relativist position and not received, in my view, a logically satisfactory answer.", 
   {}, 
   108547, 
   null, 
   1113836460.0
  ], 
  [
   108581, 
   null, 
   "johnhanks", 
   "By the moral relativist's own admission, there is no more reason we should believe in moral relativism than moral absolutism.\n\n For me it is a matter of empirical observation rather than philosophical reasoning. Human behaviour toward others, now and throughout history, has had no difficulty in encompassing the entire spectrum from the most astonishing altruism to the most astonishing cruelty. This seems to me to fit a morality that is plastic and negotiable rather than with one that is fixed and invariant.\n \n \nEven if moral relativism is true, why should anyone believe it[?]\n\n \n Let's accept for a moment that we would all like to see a world in which kindness and cooperation eclipse cruelty and aggression. I would suggest our chances of achieving this state are greater if we understand the nature of what we are trying to change. Believing that anyone who holds values different from our own is wilfully or misguidedly evil, and is transgressing against an absolute standard to which we adhere. is unlikely to get us there.", 
   {}, 
   108547, 
   null, 
   1113840780.0
  ], 
  [
   108585, 
   null, 
   "Symbiote", 
   "But why should we want a world of kindness and co-operation, by way of moral relativism, a world of cruelty and aggression, by any means, are equally valid goals.\n \n Furthermore, it seems unlikely to me that a world in which cruelty and aggression are considered equally valid norms as kindness and co-operation would lead to a world of kindness and co-operation. It seems to me a case of those who do believe in kindness and co-operation laying down their arms and ceding any chance at moral suasion of those who wish to destroy.\n \n \nFor me it is a matter of empirical observation rather than philosophical reasoning.\n\n \n But why should we trust empirical observation, isn't it an equally valid norm to do the opposite of what empirical observation suggests, according to moral relativism? Additionally, empirical reasoning is of little use here. Let us say we accept that human behaviour does come in great variety - that says nothing about ethics themselves. People have the capacity to behave unethically.\n \n It seems to me that behind the cloak of \"moral relativism\" an absolute norm is being proposed - the norm of tolerance.", 
   {}, 
   108581, 
   null, 
   1113841140.0
  ], 
  [
   108623, 
   null, 
   "johnhanks", 
   "But why should we want a world of kindness and co-operation, by way of moral relativism, a world of cruelty and aggression, by any means, are equally valid goals.\n \n Furthermore, it seems unlikely to me that a world in which cruelty and aggression are considered equally valid norms as kindness and co-operation would lead to a world of kindness and co-operation. It seems to me a case of those who do believe in kindness and co-operation laying down their arms and ceding any chance at moral suasion of those who wish to destroy.\n\n You are arguing from your own version of moral relativism, which looks suspiciously like a straw man. I have outlined a fuller version of my own position (which does not correspond to the one you paint) elsewhere (in the Question of Evil thread) and on grounds of economy am reluctant to re-post it here; though I will if you request it.\n \n \nLet us say we accept that human behaviour does come in great variety - that says nothing about ethics themselves. People have the capacity to behave unethically.\n\n Of course. I was talking, you will recall, about goodness of fit. Given the choice between believing that all of history's 'evil-doers' (to borrow dubya's phrase) knew that they were transgressing against an absolute standard of rightness but did it anyway, or believing that they had adopted a view of what was moral which encompassed the rightness of their actions, I simply find the latter more convincing. If 'evil-doers' were more obviously aberrant and sparsely scattered the 'wilful transgression' model would be less weak; but the fact is that whole societies (the Aztec come to mind) have been founded on moral principles that ours would find abhorrent.", 
   {}, 
   108585, 
   null, 
   1113844200.0
  ], 
  [
   108640, 
   null, 
   "Symbiote", 
   "Given the choice between believing that all of history's 'evil-doers' (to borrow dubya's phrase) knew that they were transgressing against an absolute standard of rightness but did it anyway, or believing that they had adopted a view of what was moral which encompassed the rightness of their actions, I simply find the latter more convincing.\n\n \n Who said anything about them \"knowing\" they were transgressing? It's quite coherent to say that history's Hitler's and Slave Traders believed they were acting morally but actually were not. There appears to be some confusion here. Moral absolutism does not require moral agents be aware of its existence. No one is saying history's wrongdoers knew they were doing wrong. Only that they were doing it.\n \n Please, explain what you mean by strawman. What don't you agree with, that there are no absolute rights or wrongs?\n \n To take your position briefly\n \nif an act is inherently, absolutely evil, then its perpetrator must be capable of sensing that\n\n \n That someone is capable of sensing something does not mean that they do actually sense it.\n \n Your argument is a very peculiar twist on moral relativism, it amounts essentially, and correct me if I am wrong, to \"If there were objective wrongs and rights, we would know what they were\". I don't think that is a supportable position, any more than \"If the first 12 digits of the number Pi had an objectively true value, we would know what they were\". I can see no mechanism by which humans could simply \"know\" an objective right from wrong, if it did exist. It would take a fairly complex deductive chain to get there, and most slaveowners weren't philosophers.\n \n I agree with you in fact, that there is no absolute Good and Evil, or at least, if someone is Evil, it is impossible to know for sure. But Good and Evil are not the same as right and wrong - Evil refers to bad motivations, Wrong refers to unethical actions. You must see that even Good people can do unethical things sometimes, no? that they can do them without even realising it?", 
   {}, 
   108623, 
   null, 
   1113844980.0
  ], 
  [
   108657, 
   null, 
   "toby", 
   "\n My other source of uneasiness with clinical unqualified relativism in moral questions, would be based on the (historical) evidence that many notions of what is right or wrong have been shared by many different peoples at many different times in many different places. This apparent consistency suggests (at least to me) that there is and always has been a similar moral consensus which societies evolve for themselves. Given the open ended possibilities that a relative position implies, why have we arrived at a most particular moral consensus?\n\n \n The Haves enact laws that support the status quo. They could set up the laws to read that it is punishable for the Have Nots to kill or steal from the Haves, but not vice versa. This is not a prudent way to do business (pretty soon a revolt ensues). A better ploy is to have the killing and stealing done through the state, in a \"justifiable\" way. Therefore we get laws supporting property rights, taxation, conscription, (de-facto) slavery, and punishment of wrong-doers. These are supposedly for the state's good; therefore they are also good for members of the state, including the Have Nots. The Have Nots are propagandized with this notion, but so are the Haves. \"It is fortunate for governments that people do not think for themselves.\"-A.H.\n \n I am not saying, by the way, that the Haves Not (much less the Haves) should think for themselves. People should (in a Darwinian sense) adapt to whatever game is at foot (short of, say, starvation). And what better way than being competely ignorant?", 
   {
    "unicode_changes_made": true
   }, 
   108496, 
   null, 
   1113847080.0
  ], 
  [
   108683, 
   null, 
   "johnhanks", 
   "No one is saying history's wrongdoers knew they were doing wrong. Only that they were doing it.\n\n And all I am adding is that they had adopted a worldview that told them they were doing right, and there is no demonstrable external referent by which we can show them to have been mistaken.\n \n \nPlease, explain what you mean by strawman. What don't you agree with, that there are no absolute rights or wrongs?\n\n I use the term strawman in its standard sense. It seemed to me you were using a crude 'anything-goes' caricature of moral relativism. It certainly doesn't correspond to my take on it. \n \n If you're interested, you'll find that in post #75 in the Question of Evil thread. I'm reluctant to re-post it out of respect for bandwidth.\n \n \nYou must see that even Good people can do unethical things sometimes, no? that they can do them without even realising it?\n\n We're discussing moral relativism. Things we do without realising it are not moral decisions.", 
   {}, 
   108640, 
   null, 
   1113848580.0
  ], 
  [
   108689, 
   null, 
   "Alan Ryan", 
   "The Haves enact laws that support the status quo. They could set up the laws to read that it is punishable for the Have Nots to kill or steal from the Haves, but not vice versa. This is not a prudent way to do business (pretty soon a revolt ensues). A better ploy is to have the killing and stealing done through the state, in a \"justifiable\" way. Therefore we get laws supporting property rights, taxation, conscription, (de-facto) slavery, and punishment of wrong-doers. These are supposedly for the state's good; therefore they are also good for members of the state, including the Have Nots. The Have Nots are propagandized with this notion, but so are the Haves. \"It is fortunate for governments that people do not think for themselves.\"-A.H.\n \n \n Are you suggesting that the ethical principles upon which moral laws are based were originated for the expedience of the \"Haves\" in order to keep the \"Have Nots\" in their place and to justify the coercion of the state ?\n \n Such a possibility may be among the unfortunate applications of a moral code, but I do not believe that moral values, even if we ignore the question of whether human morality is relative or absolute, evolved simply as instruments of oppression. \n \n Moral values, I would argue, do not and did not evolve by rational calculation but are actually sentiments - i.e. expressions of the passions.", 
   {
    "unicode_changes_made": true
   }, 
   108657, 
   null, 
   1113848700.0
  ], 
  [
   108724, 
   null, 
   "toby", 
   "Are you suggesting that the ethical principles upon which moral laws are based were originated for the expedience of the \"Haves\" in order to keep the \"Have Nots\" in their place and to justify the coercion of the state? \n\n \n Perhaps I don't know what you mean by a moral law. \n \n It happens different ways. The Church of England is one way (i.e., power concentration). Roman Catholicism is another way (i.e., power sharing). I don't know when you think moral laws clicked in, so it's hard to know where to start.\n \n \nSuch a possibility may be among the unfortunate applications of a moral code, but I do not believe that moral values, even if we ignore the question of whether human morality is relative or absolute, evolved simply as instruments of oppression. \n\n \n That's okay. It's best (Darwin, again) that you not believe it. Power over one's sole is a grand thing, especially if you want somebody to go fight in a crusade. The Hindu caste system is another excellent example. Render unto Caesar what is Caesar's. \n \n As to evolution: Equate chief with Caesar and medicine man with Pope. I assume this collusion has been going on for eons. \n \n \nMoral values, I would argue, do not and did not evolve by rational calculation but are actually sentiments - i.e. expressions of the passions.\n\n \n What are passions? Where did they come from?", 
   {
    "unicode_changes_made": true
   }, 
   108689, 
   null, 
   1113851160.0
  ], 
  [
   108736, 
   null, 
   "Alan Ryan", 
   "[QUOTE=toby]\nI don't know what you mean by a moral law\n\n I hope this isn't another game of quibbles - but I'll persevere for now. The \"moral law\" is generally understood to be shorthand for the idea there is right and wrong and there are some things we \"ought\" to do and others that we \"ought not\" to do.\n \nIt happens different ways. The Church of England is one way (i.e., power concentration). Roman Catholicism is another way (i.e., power sharing). I don't know when you think moral laws clicked in, so it's hard to know where to start.\n\n Where did this information come from ?\n \nAs to evolution: Equate chief with Caesar and medicine man with Pope. I assume this collusion has been going on for eons\n. \n And this assumption ?\n \n \nWhat are passions? Where did they come from?\n\n Again, I suspect that you already know the answer to this question, but passions are the subjective basis (feelings) from which sentiments arise. In this particular, for moral sentiments.", 
   {
    "unicode_changes_made": true
   }, 
   108724, 
   null, 
   1113853380.0
  ], 
  [
   108862, 
   null, 
   "toby", 
   "\n I hope this isn't another game of quibbles - but I'll persevere for now. The \"moral law\" is generally understood to be shorthand for the idea there is right and wrong and there are some things we \"ought\" to do and others that we \"ought not\" to do.\n \n\n \n Thank you. I'm not trying to quibble or cause any problem. I'm trying to ensure I know what you're talking about. Please try to understand that I do not understand morality in the context of relative morality. \n \n Since, I gather you don't believe in god: Why should we ought not to do them (let's call them wrongs, for a minute)? Are you saying we should each act according to our own concept of morality? So, that Attila should act according to his morals? \n \n \n\n Where did this information come from? \n\n I'm not sure what you are asking for exactly. The creation of the Church of England is a matter of history. I am not a scholar, but I do not think the theory that Henry VIII created the Church of England and established himself as the head of the church (supreme ruler) is a matter of much debate. \n http://spider.georgetowncollege.edu/english/brady/211.16TH%20CENTURY%20INTRODUCTION.htm\n Again, I am not a scholar. The creation of the Imperial Church of Rome by Roman Emperor Constantine in 313 is a matter of history. In that time, the Bishop of Rome was Miltiades (later to be known as Pope Miltiades). Constantine established the church in order to unify the religious components (pagan and Christian) and restore the Empire. Constantine claimed to be a Christian, but apparently went on with pagan ways (and wasn't baptized, until perhaps death). He also proclaimed himself to be the head of the churches loyal to Rome. My point here is that he apparently gave legitimacy to the Christians, in order to gain more power. \n \n \n\n And this assumption? \n\n I'm guessing. But Crazy Horse (Oaglala Sioux), Sitting Bear (Kiowa), Geronimo (Chiricahua apache), Sitting Bull (Dakota Sioux), Minimic (Cheyenne) are all of \"recent day\" examples of the chief and medicine man having concentrated power (since they were all both). I suspect where mutual support was not present between chief and medicine man, one was soon supplanted. Do you suggest otherwise?\n \n \n\n Again, I suspect that you already know the answer to this question, but passions are the subjective basis (feelings) from which sentiments arise. In this particular, for moral sentiments.\n\n \n Thank you. I'm just trying to be sure. \n Where do they come from? Are moral feelings instinctual? If so, how could they change in one's lifetime? People's convictions do seem to change from birth onward. Or do you maintain that nobody since the beginning of time has changed their moral stance? No criminal has ever \"found god\"? Malcolm X, for example? Or a mother against the death penalty that has her child ruthlessly murdered? \n It seems to me that morality is learned. And that makes sense from a Darwinian perspective. I still contend that one should (Darwin-wise) join whatever game is at foot. Being able to learn morals is more flexible, adaptable. If cannibalism is the prevailing custom, one will be less likely to be passing on genes if one is predisposed against it.", 
   {
    "unicode_changes_made": true
   }, 
   108736, 
   null, 
   1113866280.0
  ], 
  [
   108993, 
   null, 
   "Symbiote", 
   "And all I am adding is that they had adopted a worldview that told them they were doing right, and there is no demonstrable external referent by which we can show them to have been mistaken.\n\n \n Even if it is not possible to show them they were mistaken, and many would content that it is, that would not prove they were not mistaken, only that we were unable to show it. Trying to disprove the existence of an objective morality is like trying to disprove God. (Note, I am saying this as an atheist).\n \n \nI use the term strawman in its standard sense. It seemed to me you were using a crude 'anything-goes' caricature of moral relativism. It certainly doesn't correspond to my take on it.\n\n \n Please explain what it is you believe differently to my caricature. You seem to think moral systems are all relative, but some are objectively better than others. This is contradictory. If you simply throw around words like \"strawman\" without explaining what you mean vs what is being attacked, you may as well not say anything at all. I could quote your whole post and reply \"Fallacy!\" with it adding equally little to any discussion taking place.\n \n \nThings we do without realising it are not moral decisions.\n\n \n Any action other than the act of deciding is not a decision of any kind.\n \n What I think you mean to say is, it is not possible to do the wrong thing unless you believe it to be wrong. Justify this, it seems to be begging the question. Moral relativism is true, because morality is relative.\n \n No one is claiming that people who do wrong things (Just about everyone does wrong things sometimes) are evil, or that even if they knew right from wrong, absolutely and correctly, and did the wrong thing anyway, that they would be evil.\n \n Take for example, killing one person to save ten. In my opinion the act would be wrong, but the actor in this circumstance clearly appears to be good, not evil, and the consequences, for most people, appear good.\n \n An absolute right and wrong, and a belief in them, do not imply intolerance of those with dissenting views - in fact it may be an absolute principle of ethics that people be able to have whatever views they want, and pursue whatever goals they want.", 
   {}, 
   108689, 
   null, 
   1113889380.0
  ], 
  [
   109017, 
   null, 
   "Alan Ryan", 
   "[QUOTE=toby][QUOTE]\nThank you. I'm not trying to quibble or cause any problem. I'm trying to ensure I know what you're talking about. Please try to understand that I do not understand morality in the context of relative morality. \n \n The relative context, in this instance, is understood to be the assertion that a moral consensus is limited by a shifting perspective - i.e. changing from time to time and from place to place, etc. \n \n \nSince, I gather you don't believe in god: Why should we ought not to do them (let's call them wrongs, for a minute)? Are you saying we should each act according to our own concept of morality? So, that Attila should act according to his morals? \n \n \n A radical relativist might say that's what Attila should do - even assuming you have some heinous behaviour in mind: I'm not.\n \n \nAre moral feelings instinctual? It seems to me that morality is learned. And that makes sense from a Darwinian perspective. I still contend that one should (Darwin-wise) join whatever game is at foot. Being able to learn morals is more flexible, adaptable\n\n It might be argued that moral sentiments are instinctive. I'm not going quite that distance: I'm saying that moral values are expressions of approval/disapproval that don't arise from rational deliberation, but from the affective part of human nature.", 
   {
    "unicode_changes_made": true
   }, 
   108862, 
   null, 
   1113900240.0
  ], 
  [
   109054, 
   null, 
   "toby", 
   " \n The relative context, in this instance, is understood to be the assertion that a moral consensus is limited by a shifting perspective - i.e. changing from time to time and from place to place, etc. \n\n Fine. Thank you. \n \n \n A radical relativist might say that's what Attila should do - even assuming you have some heinous behaviour in mind: I'm not. \n\n \n What I'm hearing is that you believe Attila should act in accordance with the prevailing moral consensus. How do you define the moral consensus? In Attila's case, would that be among the Huns? Among the Hun ruling elite? Or should Attila act in accordance with a wider consensus of which he (for the sake of argument) has no intimate knowledge? \n \n Now why should he act in accordance with the consensus? \n \n \n \n It might be argued that moral sentiments are instinctive. I'm not going quite that distance: I'm saying that moral values are expressions of approval/disapproval that don't arise from rational deliberation, but from the affective part of human nature.\n \n \n This is not completely clear to me. So, do you take the position that moral sentiments are learned?", 
   {
    "unicode_changes_made": true
   }, 
   109017, 
   null, 
   1113911400.0
  ], 
  [
   109071, 
   null, 
   "toby", 
   "Let's accept for a moment that we would all like to see a world in which kindness and cooperation eclipse cruelty and aggression. I would suggest our chances of achieving this state are greater if we understand the nature of what we are trying to change. Believing that anyone who holds values different from our own is wilfully or misguidedly evil, and is transgressing against an absolute standard to which we adhere. is unlikely to get us there.\n\n \n I could not agree more. To have the position that people should not do unpleasant things is to be lost in a morass of denial. People should do exactly as they do. If you want to set out a plan to change how they act, it is best understand how they operate, and this is shown by what they do in fact do.", 
   {}, 
   108581, 
   null, 
   1113916860.0
  ], 
  [
   109073, 
   null, 
   "Symbiote", 
   "People should do exactly as they do.\n\n \n Is this objectively true, or is it only true for you?\n \n The irony in this position is that it also implies; If what you do is stop other people from doing what they do, you should keep doing what you do.\n \n It is absolutely futile to try and derive from moral relativism, if it is true, objective norms for people to follow (ie, let people do what they want, do what you do, tolerate difference). The relativist position is precisely that there are no objective norms.", 
   {}, 
   109071, 
   null, 
   1113918000.0
  ], 
  [
   109089, 
   null, 
   "Alan Ryan", 
   "This is not completely clear to me. So, do you take the position that moral sentiments are learned?\n\n \n \n All human behaviours are not of equal value. In my view, the judgements and recommendations of morality are not elicited by reason, but arise from an affective moral sense. Thus the practice of what are called virtues is accompanied by pleasure, and vices by feelings of disapprobation. Example: we praise an act of courage; we blame cowardice. Our feelings provide a natural guide for moral conduct and are discoverable by experience.\n \n OK: I've answered quite a few questions in this \"moral discourse\", and my position must now be intelligible to you.\n \n It's time now for you to put your views concerning the principles of morals and to give me the opportunity of examining them.", 
   {}, 
   109054, 
   null, 
   1113922200.0
  ], 
  [
   109090, 
   null, 
   "toby", 
   "Is this objectively true, or is it only true for you?\n \n\n I cannot know it for certain (I cannot know that people exist, for that matter). I possibly can be deluded into believing anything. But it is consistent logically. The opposing view is not and Aristotle showed this. (Supposedly, he then turned around, and disavowed the logic he created, as he preferred free will.)\n In order to progress past I think therefore I am, I had to make some provisional assumptions. I do not know that the universe is logical, but it seems reasonable (to me!) to assume (for the moment) that it is, just to see what the implications are. If the implications seem reasonable (to me!), then I can continue playing the game. I prefer to guess than to sit in stagnation. \n \n \nThe irony in this position is that it also implies; If what you do is stop other people from doing what they do, you should keep doing what you do. \n\n Yes. That's about the size of it: Things are. It seems we are all just playing out this melodrama. It's probably pointless, but it's also the only game in town.\n \n \nIt is absolutely futile to try and derive from moral relativism, if it is true, objective norms for people to follow (ie, let people do what they want, do what you do, tolerate difference). The relativist position is precisely that there are no objective norms.\n\n I did not mean to imply that objective norms exist. One person, or a group of like minded people, can decide what is unpleasant (to them!). They can then (for the sake of argument) cajole everybody else to follow their program. They certainly have no objective moral authority to do so, but they can do it (again, the sake of argument) nonetheless.", 
   {
    "unicode_changes_made": true
   }, 
   109073, 
   null, 
   1113922260.0
  ], 
  [
   109109, 
   null, 
   "Symbiote", 
   "But it is consistent logically. The opposing view is not and Aristotle showed this. \n\n \n Why shouldn't you believe things which are logically inconsistent? This seems as valid an ethic to me as any other.", 
   {}, 
   109090, 
   null, 
   1113924060.0
  ], 
  [
   109144, 
   null, 
   "toby", 
   "Why shouldn't you believe things which are logically inconsistent? This seems as valid an ethic to me as any other.\n\n \n Please try that road and let me know how it turns out. There is no absolute imperative that one choose to believe that things are logical, Aristotle being a case in point (if he existed, and actually did choose that path). \n \n For me, my experience seems extremely logical. I put gas in the car, the car works. I let it run out, it ceases to work. There may be no car, no gas. But experientially, it's no fun running out of gas, so I keep filling up the tank. Pain and pleasure-wise, I seem to be rewarded for being logical. Logic may be total nonsense, but I like the reward, so I keep pressing the lever.", 
   {
    "unicode_changes_made": true
   }, 
   109109, 
   null, 
   1113927960.0
  ], 
  [
   109181, 
   null, 
   "toby", 
   "All human behaviours are not of equal value. In my view, the judgements and recommendations of morality are not elicited by reason, but arise from an affective moral sense. Thus the practice of what are called virtues is accompanied by pleasure, and vices by feelings of disapprobation. Example: we praise an act of courage; we blame cowardice. Our feelings provide a natural guide for moral conduct and are discoverable by experience. \n \n OK: I've answered quite a few questions in this \"moral discourse\", and my position must now be intelligible to you.\n \n \n Your position is quite unintelligible to me. You did not answer any of my questions in words that I understand. I am too stupid to find any reference to learning (one way or the other) in your reply.\n You were asked: Do you take the position that moral sentiments are learned? If you wish to communicate, please use my words and answer to the affirmative or negative (or if you don't understand my words, please ask for a definition). Your position remains unassailable so long as it remains a mystery. \n \n You were also asked: How do you define the moral consensus? In Attila's case, would that be among the Huns? Among the Hun ruling elite? Or should Attila act in accordance with a wider consensus of which he (for the sake of argument) has no intimate knowledge?\n \n You were also asked: Now why should he [Attila] act in accordance with the consensus? \n \n \nIt's time now for you to put your views concerning the principles of morals and to give me the opportunity of examining them.\n\n Morals [I should have said: according to what I'm hearing] are an illusion. Attila should not act according to a consensus. He is incapable of doing so (unless he was in concert with the consensus in the first place).", 
   {
    "unicode_changes_made": true
   }, 
   109089, 
   null, 
   1113929340.0
  ], 
  [
   109193, 
   null, 
   "Alan Ryan", 
   "\n Morals are an illusion. .\n\n \n OK: end of conversation.", 
   {}, 
   109181, 
   null, 
   1113929760.0
  ], 
  [
   109214, 
   null, 
   "johnhanks", 
   "You seem to think moral systems are all relative, but some are objectively better than others. This is contradictory.\n\n I probably do need to explain my position more fully. I do not subscribe to a relativist view of morality whereby 'anything goes' - for example whereby the paedophile's approval of his actions is as valid as others' condemnation of them. Instead, I come at the whole issue from a biological / anthropological angle, rather than a philosophical one (and yes, I am aware of the forum title). In this respect, I regard humankind's capacity for making moral judgements as an evolved trait, part of our broader biology and inextricably intertwined with our strong drive to classify other people in in-groups and out-groups of varying depth. The 'relative' aspect of morality in this view lies in our ability simultaneously to apply different moral standards to different groups, or to re-define group membership over time and adjust our attitudes and behaviour to others accordingly.\n \n To put it simplistically, we are strongly inclined to behave altruistically toward in-group members, and non-altruistically toward out-groups. To call these behaviours 'objectively better than others' is meaningful only if by better we mean that they increased our ancestors' Darwinian fitness. In a globalised age we would arguably improve our overall prospects if we were able to maximise our concept of who we identify as 'Us'.", 
   {}, 
   108993, 
   null, 
   1113934620.0
  ], 
  [
   109238, 
   null, 
   "toby", 
   "\n \n To put it simplistically, we are strongly inclined to behave altruistically toward in-group members, and non-altruistically toward out-groups. To call these behaviours 'objectively better than others' is meaningful only if by better we mean that they increased our ancestors' Darwinian fitness. In a globalised age we would arguably improve our overall prospects if we were able to maximise our concept of who we identify as 'Us'.\n\n \n Would you agree then that establishing in vs. out is learned? Take for example: No Irish need apply, being posted by other white, English speaking, European shop keepers. \n \n A potent example of establishing in vs. out is in war-time propaganda, where the adversary is dehumanized to the greatest extent possible. If the soldiers on each side only realized that they have far more in common with each other than the powerful people that make policy (whose own kids got a deferment or National Guard appointment, by the way), then wars would be less common, I suspect.", 
   {}, 
   109214, 
   null, 
   1113937500.0
  ], 
  [
   109257, 
   null, 
   "johnhanks", 
   "Would you agree then that establishing in vs. out is learned?\n\n Oh yes. I think we're strongly (innately?) predisposed to seek such classifications; but who goes where is culturally determined.\n \n In the hunter-gatherer bands of our early days it was more or less inevitable that in-group = my band = genetic kin. Things are more complex these days, and we might be optimistic that global communication admits more diverse people into 'Us' than ever before. Your point about the need to dehumanise the enemy in wartime is a good one; the good news is that once you've chatted to him on the internet, it's harder to see him as an Untermensch. (On edit: depends who you've chatted to, I suppose.)\n \n (All IMHO, of course.)", 
   {}, 
   109238, 
   null, 
   1113939480.0
  ], 
  [
   109283, 
   null, 
   "toby", 
   "Oh yes. I think we're strongly (innately?) predisposed to seek such classifications; but who goes where is culturally determined.\n \n In the hunter-gatherer bands of our early days it was more or less inevitable that in-group = my band = genetic kin. .)\n\n \n Yes, I was going to say that even today, there are Amazon tribes that kill members of the other tribe. You can also see this with the Crypts and the Bloods. \n \n Black on black crime is an interesting phenomenon. In fact, thieves in general are more likely steal from their own neighborhoods. Does this seem to suggest that convenience can over-rule in vs. out, or is everybody an \"out\" from a thief's perspective?\n \n I was wondering, whether you might have an opinion about the phenomenon that each race that apparently recognize member of its own better than different races. Is that purely conditioned?", 
   {
    "unicode_changes_made": true
   }, 
   109257, 
   null, 
   1113942900.0
  ], 
  [
   109291, 
   null, 
   "johnhanks", 
   "In fact, thieves in general are more likely steal from their own neighborhoods. Does this seem to suggest that convenience can over-rule in vs. out, or is everybody an \"out\" from a thief's perspective?\n\n That's a deep and difficult question. A serious problem with the in-group/out-group hypothesis is that it's inherently unfalsifiable: when faced with any situation like the one you describe, you can just say \"Yeah, they've just re-classified everyone else as 'out'\": problem solved. Paradoxically, this is a weakness, not a strength.\n \n \nI was wondering, whether you might have an opinion about the phenomenon that each race that apparently recognize member of its own better than different races. Is that purely conditioned?\n\n You'll have to explain this more fully. I don't have a clue what you mean.", 
   {
    "unicode_changes_made": true
   }, 
   109283, 
   null, 
   1113943740.0
  ], 
  [
   109299, 
   null, 
   "toby", 
   "That's a deep and difficult question. A serious problem with the in-group/out-group hypothesis is that it's inherently unfalsifiable: when faced with any situation like the one you describe, you can just say \"Yeah, they've just re-classified everyone else as 'out'\": problem solved. Paradoxically, this is a weakness, not a strength. \n\n \n Yes, I agree. \n \n \n \nYou'll have to explain this more fully. I don't have a clue what you mean.\n\n Oh, sorry. The phenomenon that all Japanese look alike, from the point of view of a white. Apparently, members of a race are much better at distinguishing members of their own race, than member of another race. I was wondering if you thought that that was entirely do to conditioning (seeing members of their race with greater frequency). My guess would be: yes. I wondered what the studies on this have concluded (if you know). (Is it possible that we are biologically inclined to be bigots?)", 
   {}, 
   109291, 
   null, 
   1113945420.0
  ], 
  [
   109549, 
   null, 
   "Mach", 
   "I suspect you saved me a lot of time with your comment Symbiote:\n \n \nWhy shouldn't you believe things which are logically inconsistent? This seems as valid an ethic to me as any other.\n\n \n If we cannot debate while attempting to remaing logically consistent, I will not debate, but I do appreciate you stating it up front. It saves me time and frustration.\n \n -Mach", 
   {}, 
   109238, 
   null, 
   1113965580.0
  ], 
  [
   109569, 
   null, 
   "Mach", 
   "I think defining morality is the first step.\n Right away we can differentiate rational positions from irrational ones.\n \n The first bridge to cross:\n \n 1. Morality \"exists\", that is, exist indpendent of the human mind?\n 2. Morality refers to a concept (an idea), such as:\n The arbitrary rules of (human) behavior that apply to an indivudal and to all of society.\n \n Example of a #2 type of morality:\n Moral\n No human should every steal from another human.\n No human should kill another human for anything other than self-defense.\n \n What word defines someone who adheres to their moral code? Integrity.\n Does integrity imply moral? Yes. Can someone have morals that are the exact opposite if yours? Yes.\n ========================\n \n I should note that I think the type of morality #1 above, requires for me, for someone to detail how:\n 1. this can be known, independant of another human.\n \n Since I know it cannot, it's rejected immediately.\n \n All concepts are relative, not just morality, all concepts, by definition. We humans choose to follow certain rules, and within those systems of rules we either adhere to them, or we don't.\n \n \n Toby \"Morals are an illusion\".\n Agreed. To suggest they exist is absurd, and an illusion often refers to something that looks as if it exists, but does not. Actually a good use of the word! If two people agree upon a set of morals, and declare that set of rules are their \"moral code\", I think we all agree, they indeed do HAVE a moral code, but it no more exists as a \"thing\" than any thought we have.\n Some might argue that then everything is an illusion, but I think that's about as useful as the notion that \"not following logic is good\". We seem to be able to do useful things with differentiating reality, from illusion...for instance, putting away a criminal based on evidence, rather than putting away a non-existent criminal, or putting away an innocent person on non-existent evidence.\n \n Johnhanks:\n Your morality as defined is a relative morality.\n In your case, you are proposing a more \"society-useful\" morality. That's probably closest to what many of us are use to discussing, that is, some loose set of (arbitrary) rules that MOST people would agree are good rules to follow for the good of society. Most of it stems from the thought \"If everyone did what I'm doing now, would I like it?\" For example, if someone stole something, but also held the opinion that they would NOT like to be stolen from, they would seem to think stealing is not \"good\" for society (And would be doing a bad thing!).\n \n This is still relative however, each individual thinks about it, and agrees or disagrees with the majorities decree of what good and bad behavior is. And if nothing else, we know that different societies have different \"majority\" rules of morality...relative from society to society, by definition.\n \n -Mach", 
   {}, 
   108724, 
   null, 
   1113967500.0
  ], 
  [
   109682, 
   null, 
   "Symbiote", 
   "I expressed that from a moral relativistic standpoint, no objective reason can be provided why people should adhere to logic. Try to keep up.", 
   {}, 
   109569, 
   null, 
   1113990480.0
  ], 
  [
   109742, 
   null, 
   "Mach", 
   "I expressed that from a moral relativistic standpoint, no objective reason can be provided why people should adhere to logic. Try to keep up.\n\n \n Then let's examine your remark:\n \n \nOriginally Posted by symbiote\n Why shouldn't you believe things which are logically inconsistent? This seems as valid an ethic to me as any other. \n \n \n Moral relativism involves individual choice. There is no \"should\", there is no \"validity\", other than relatively valid. And it's not that we fail to give an objective reason the term \"objective reason\" is a contradiction with regards to a belief. \n \n Morality is a belief, and you cannot demonstrate for us how a belief exists independant of a consciousness because it's absurd. The very definition of a belief comes from a consciousness, and is just a particular mental state.\n \n Secondly, the concept of moral relativism, that is, each individual can arbitrarily define their own set of guidelines for behavior, doesn't indicate that morality doesn't help guide behavior. You offer up that morality is invalid, if it's not a contradiction, which is sensless to be sure, but also reveals that you don't understand the concept of moral relativity.\n \n For instance, I choose to be as logical as possible (within reason), and I think it's ethical to do so. Given my system of ethics, it's important, good, etc., etc. Yet you say :\nThis seems as valid an ethic to me as any other.\n\n \n So what does this mean? Does it mean you have no personal morality with regards to adhering to logic in a debate? That would mean I'm correct. OR, you made an error, since moral relativism can certainly provide an ethical guideline to an individual *BY DEFINITION*, in which case you just made an error, which we'll of course accept your correction of. I gave you the benefit of the doubt and assumed you didn't intend to make such an error.\n \n I had hoped you'd just admit that you don't really feel like adhering to logic, instead you psuedo-denied it, while contradicting yourself. \n \n -Mach", 
   {}, 
   109682, 
   null, 
   1114011600.0
  ], 
  [
   109779, 
   null, 
   "Symbiote", 
   "Morality is not a belief, any more than gravity is a belief. People have beliefs about morality. For example, you believe (incorrectly) that morality is by definition relative. Morality is a system of rules which govern what is right and what is wrong, and exist independent of anyone's beliefs about them. At the least you must accept this possibility.\n \n You can provide no reason anyone should adhere to logic in a debate, yet you get all huffy if someone doesn't. This appears to me to be hypocrisy.\n \n You have no argument for morality being relative, you only chant to yourself that it is.", 
   {}, 
   109742, 
   null, 
   1114016820.0
  ], 
  [
   109781, 
   null, 
   "johnhanks", 
   "Johnhanks:\n Your morality as defined is a relative morality.\n In your case, you are proposing a more \"society-useful\" morality. That's probably closest to what many of us are use to discussing, that is, some loose set of (arbitrary) rules that MOST people would agree are good rules to follow for the good of society.\n\n Partly. I vehemently disagree that the rules are in any way arbitrary: they are in general adaptive - promoting the society's survival and expansion - and if they become maladaptive through change of circumstances then they change accordingly or the society goes under.\n You make much of 'deviant' behaviour such as stealing. Being neither clones nor robots, people show wide variety in their conformity to social norms of behaviour: possibly a bell curve (I've not seen data on this), with Ned Flanders at one extreme, criminals at the other, and most of us - come on, I can't believe you've never used office stationery for personal purposes - somewhere in the middle.", 
   {}, 
   109569, 
   null, 
   1114017000.0
  ], 
  [
   109800, 
   null, 
   "unkerpaulie", 
   "i think mach brings up a good point which could well be the litmus test for the existence of objective morality\n \n could morality exist independent of human imagination and communication? \n \n other than that, the idea that morality is \"natural\" implies that it exists among all organisms, not just humans, not so?", 
   {}, 
   109781, 
   null, 
   1114018980.0
  ], 
  [
   109806, 
   null, 
   "Symbiote", 
   "could morality exist independent of human imagination and communication? \n\n \n The moral objectivist argues that the same standard of morality applies to all people, even if they do not know about it, not that it applies without people.", 
   {}, 
   109800, 
   null, 
   1114019400.0
  ], 
  [
   109809, 
   null, 
   "unkerpaulie", 
   "The moral objectivist argues that the same standard of morality applies to all people, even if they do not know about it, not that it applies without people.\n\n is this objective morality subject to change? or is it constant? if we extrapolate humanity backwards, we'd find at some point objective morality did not apply to us (if you subscribe to evolution). how then did ojective morality first arise in humans?", 
   {}, 
   109806, 
   null, 
   1114019760.0
  ], 
  [
   109815, 
   null, 
   "Symbiote", 
   "Well, some would argue that morality is implied in all conscious (that is to say, rational, as opposed to a habitual reaction) thought, and applies to actions which take place between conscious beings. So it applied in humans when they evolved to the point of being conscious, and only between them and other conscious beings. We can call things which possess consciousness/rationality, \"persons\".\n \n If aliens rocked up it would apply to them too. (We will assume, for the sake of argument, that any alien species advanced enough to master space travel is conscious).\n \n Alternatively, some argue that it is implied in rational communication (ie language), rather than the thought process itself, but that's the general idea.\n \n Of course there are the religious types, who will say that it applied from the creation of man onwards, and maybe changed around 0 AD.", 
   {}, 
   109809, 
   null, 
   1114020420.0
  ], 
  [
   109842, 
   null, 
   "unkerpaulie", 
   "Well, some would argue that morality is implied in all conscious (that is to say, rational, as opposed to a habitual reaction) thought, and applies to actions which take place between conscious beings. So it applied in humans when they evolved to the point of being conscious, and only between them and other conscious beings. We can call things which possess consciousness/rationality, \"persons\".\n\n but isnt there a morality that also extends to non-humans, such as clubbing baby seals and killing endangered species? or is that something different?\n \n your explanation of how morality across the board arose in humans is lacking. in fact, its not really an explanation. did early humans collectively become aware of a code of conduct they needed to adhere to? was it made a mandate by the then ruling class of humans? or did it slowly develop over time through trial and error? any speculations and theories are welcome", 
   {}, 
   109815, 
   null, 
   1114023420.0
  ], 
  [
   109855, 
   null, 
   "Symbiote", 
   "Whether they were aware of the code or not is irrelevant to the code's existance. I am not saying humans became moral when they became conscious. I am not saying when they became conscious they started doing the right thing all the time. I am saying once they became conscious, rational beings, when they killed each other it was wrong. If a jellyfish kills a jellyfish, it is not being immoral, it is not violating any ethical code, because it is not bound by any ethical code. A pre-human ancestor incapable of rational thought would not be doing anything wrong when it killed another of its kind. A rational human may still kill another of its kind, but it would be committing a wrong in doing so.\n \n Where humanity got its ideas about morality is another story. But that's not a story about ethics, that's a story about history. Probably there were a variety of ideas, and the tribes with bad ideas died out. Maybe one tribe said \"You must kill yourself at the age of 12\", and didn't last very long. Maybe one said \"Don't murder people\" and they prospered. \n \n \nbut isnt there a morality that also extends to non-humans, such as clubbing baby seals and killing endangered species? or is that something different?\n\n \n I wouldn't say clubbing a baby seal is wrong, maybe the motivations behind it are bad, or the consequences are bad, but that doesn't make it wrong. You can call these other aspects other components of morality though, too.", 
   {}, 
   109842, 
   null, 
   1114024320.0
  ], 
  [
   109905, 
   null, 
   "unkerpaulie", 
   "Whether they were aware of the code or not is irrelevant to the code's existance.\n\n therefore the code is independent of imagination and communication. it exists always.\n \n the problem still lies in the revelation of this existing code of morals in humans. can we assume that humans suddenly became conscious, or was it also a gradual thing, with several intermediate stages of partial consciousness (if such a thing makes sense)? this is relevant, because if this moral code was first discovered by one person, or group of people that gained their consciousness earlier than another group of \"people\", then they would be bearing the burden of the knowledge of right and wrong, while their neighboors didnt. in that sense, morality wouldnt be a common issue for everyone.\n \n another idea i'm getting from you is that the omni-existing moral code would be revealed to all conscious populations, even if they were in separate locations. for example, say the first generation of 4 conscious human offspring is born, but they move to different lands and spawn their own tribes of conscious humans. since all these 4 tribes are populated with conscious constituents, are you saying that they would all be internally aware of the same moral code, without interaction or discussion among each other?\n \n finally, why is this universal ethical code seemingly missing in modern times? if this universally interal code of ethics existed, would there be any debate as to whether it exists?", 
   {}, 
   109855, 
   null, 
   1114031520.0
  ], 
  [
   109939, 
   null, 
   "toby", 
   "Partly. I vehemently disagree that the rules are in any way arbitrary: they are in general adaptive - promoting the society's survival and expansion - and if they become maladaptive through change of circumstances then they change accordingly or the society goes under.\n You make much of 'deviant' behaviour such as stealing. Being neither clones nor robots, people show wide variety in their conformity to social norms of behaviour: possibly a bell curve (I've not seen data on this), with Ned Flanders at one extreme, criminals at the other, and most of us - come on, I can't believe you've never used office stationery for personal purposes - somewhere in the middle.\n\n \n Thank you for your input.\n \n Let me like-wise attempt to clarify my position: That morals are an illusion within the context of morality by consensus as it seemed to be presented. Attila cannot reasonably be expected to act un-Attila-like, and thus \"should\" not act in accordance with a norm. In John's presentation, it seems that Attila can act as Attila (somewhere within the curve)-correct me if this is wrong. If so, this solves all three problems I saw in morality by consensus: 1) That Attila is expected to act un-Attila-like. 2) That the constitution of the consensus was arbitrary. 3) That the manner of moral accrual in individuals (the degree to which one is moral) did not seem to support either empirical data or the premise that members of a society \"should\" act in accordance with a norm.\n In John's presentation: 1) is not an issue. 2) is also not much of an issue. If one wishes to make curves, it will be slightly arbitrary as to which individuals to include. This is not much of a concern, since no member need be at any particular spot within the curve. For 3), it seems that John favors (correct me) that morals are primarily learned. This matches empirical data, and there is no issue as to supporting moral adherence, since no adherence is required. In short, I see no problem with John's presentation.\n My reason for calling morals an illusion in the context of the moral consensus was that the construct as presented seemed illogical and only served to obscure reality. I think one common mistake made in deciding how people \"should\" act, is to imagine how we would act in their place: I wouldn't do that if I were Attila. This is meaningless. If your morals were embedded in Attila, Attila wouldn't be Attila anymore. If you were really Attila, you wouldn't be you, and you'd do exact as he did. A better way of seeing how Attila would behave is by seeing how you would behave in an analogous situation. Suppose that the moral consensus (in your country) was to donate (tithe) to the church for the work of god. If you didn't believe in god, and there was no penalty for not tithing, would you tithe anyway? If you wouldn't conform to the norm in this respect, Attila would not conform, either. You would say: \"That's silly. These silly people have bought into something, and I'm not going along.\" Attila would say exactly the same thing.", 
   {
    "unicode_changes_made": true
   }, 
   109781, 
   null, 
   1114036260.0
  ], 
  [
   110054, 
   null, 
   "Mach", 
   "Partly. I vehemently disagree that the rules are in any way arbitrary: they are in general adaptive - promoting the society's survival and expansion - and if they become maladaptive through change of circumstances then they change accordingly or the society goes under.\n You make much of 'deviant' behaviour such as stealing. Being neither clones nor robots, people show wide variety in their conformity to social norms of behaviour: possibly a bell curve (I've not seen data on this), with Ned Flanders at one extreme, criminals at the other, and most of us - come on, I can't believe you've never used office stationery for personal purposes - somewhere in the middle.\n\n \n Yes, I agree, by no means is it \"accidental\" or \"random\", the majority of people seem to have a fairly similar idea of morality on broad issues, and I think there are good reasons for that. By arbitrary I only mean that there is nothing forcing a rule to be one way or another, it's human choice.\n ====\n on a lighter note - \n Actually I use to think morality was in some way real and missed out on a LOT of office supplies, and other vices that I now regret having missed at a time when I wasn't really \"responsible\" enough to know better ;)\n \n Now that I know better, I'm plagued by knowing that the world is literally what I make of it...dogon can't get around doing the right thing.\n \n -Mach", 
   {}, 
   109781, 
   null, 
   1114052520.0
  ], 
  [
   110057, 
   null, 
   "Dzeron", 
   "May I add two cents?\n \n Morality can be split into two types: personal morality and interpersonal morality. The former involves how you live your own life - the latter involves how you treat other people. For example, the claim \"It is immoral to drink alcohol,\" is personal morality, while the claim \"It is immoral to kill people,\" is interpersonal morality.\n \n In the realm of personal morality, moral relativism makes sense. But in the realm of interpersonal morality, moral objectivism makes sense. I'm fine with people drinking alcohol, but I don't want anyone killing me. In general, I think the fundamental principle of interpersonal morality should be, \"Don't violate the right of others to live their own lives.\"", 
   {}, 
   110054, 
   null, 
   1114053000.0
  ], 
  [
   110061, 
   null, 
   "Mach", 
   "You have no argument for morality being relative, you only chant to yourself that it is.\n\n \n Yet I'm not chanting to myself, I'm posting a significant amount of reasoned justification, why would you suggest otherwise? I actually know the answer to that, it's because you choose to, and you have no desire to have a logical debate, you prefer sophistry.\n \n \nYou can provide no reason anyone should adhere to logic in a debate, yet you get all huffy if someone doesn't. This appears to me to be hypocrisy.\n\n \n I don't have to, nor should I have to. It's painfully obvious to any mature-minded individual why a logical discussion is preferred over an illogical one, and if you don't prefer it, there is no need to debate, since debates and definitions and reason are irrelevant if logic is ignored. \n \n \nMorality is not a belief, any more than gravity is a belief. People have beliefs about morality. For example, you believe (incorrectly) that morality is by definition relative. Morality is a system of rules which govern what is right and what is wrong, and exist independent of anyone's beliefs about them. \n\n \n Amusing. I,have continually pointed out that:\n \n 1. If you aren't going to adhere to logic, then your arugment is nonsensical in any case, along with any rebuttal.\n \n 2. If you make a claim:\n Symbiote claims:\n Morality is a system of rules which govern what is right and what is wrong, and exist independent of anyone's beliefs about them.   \n \n Then justifying the claim is required for a rational debate.\n \n So, answer the simple questions if you can:\n \n - 1. How can anyone know such a thing?\n - 2. How do you know this?\n - 3. How can this be rationally demonstrated?\n - 4. Where did these rules come from?\n - 5. In what form do they \"exist\", if they exist independant of thought?\n \n \n \n -Mach", 
   {}, 
   109779, 
   null, 
   1114053300.0
  ], 
  [
   110065, 
   null, 
   "Symbiote", 
   "therefore the code is independent of imagination and communication. it exists always.\n\n \n It exists for conscious beings, it applies to conscious beings. There have not always been conscious beings.\n \n \n \nthe problem still lies in the revelation of this existing code of morals in humans.\n\n \n There was no revelation. It wasn't revealed to them. They didn't suddenly know \"killing is wrong\". But they became capable of understanding \"Killing is wrong\".\n \n \ncan we assume that humans suddenly became conscious, or was it also a gradual thing, with several intermediate stages of partial consciousness (if such a thing makes sense)?\n\n \n A thing is either conscious or it isn't. Things can be smarter than others, more quick witted. But even a very stupid person is conscious.\n \n \nthis is relevant, because if this moral code was first discovered by one person, or group of people that gained their consciousness earlier than another group of \"people\", then they would be bearing the burden of the knowledge of right and wrong, while their neighboors didnt. in that sense, morality wouldnt be a common issue for everyone.\n\n \n If someone isn't conscious, they aren't a person, in the technical use of the term, they're an animal with a human face.\n \n \nanother idea i'm getting from you is that the omni-existing moral code would be revealed to all conscious populations, even if they were in separate locations. for example, say the first generation of 4 conscious human offspring is born, but they move to different lands and spawn their own tribes of conscious humans. since all these 4 tribes are populated with conscious constituents, are you saying that they would all be internally aware of the same moral code, without interaction or discussion among each other?\n\n \n The code is not magically revealed to them. They are bound by the same code, none of them suddenly know what it is. It can be deduced through a process of reasoning, alternatively they could get lucky and stumble upon an idea fairly similar to it because it just \"feels\" right or works for th survival of their community. They may make up a religion based around an idea they have about morality, even if they are incorrect.\n \n \nfinally, why is this universal ethical code seemingly missing in modern times? if this universally interal code of ethics existed, would there be any debate as to whether it exists?\n\n \n Yes, we are having one. That it exists does not imply everyone has knowledge of it. That the laws of economics exist the same everywhere does not imply that everyone will know them and agree upon them.", 
   {}, 
   110057, 
   null, 
   1114053840.0
  ], 
  [
   110242, 
   null, 
   "unkerpaulie", 
   "It exists for conscious beings, it applies to conscious beings. There have not always been conscious beings.\n \n There was no revelation. It wasn't revealed to them. They didn't suddenly know \"killing is wrong\". But they became capable of understanding \"Killing is wrong\".\n \n A thing is either conscious or it isn't. Things can be smarter than others, more quick witted. But even a very stupid person is conscious.\n \n If someone isn't conscious, they aren't a person, in the technical use of the term, they're an animal with a human face.\n\n here you imply that there is no gradual process from a lack of conciousness to a possession of conciousness. therefore animals suddenly became capable of understanding that killing is wrong. at this point they also suddenly became \"persons\"\n \n i think the best evidence for the development of consciousness in humans is the growth of a child. newborn babies have no consciousness, and therefore no moral responsibility. as a baby becomes a toddler, basic social skills are taught to him. he learns to mimic those around him, and he learns to communicate. he is also taught manners and values. this only makes sense because he is being prepared to live in an environment with other humans, and these skills are essential\n \n a baby, raised devoid of interaction with other humans, will also grow up with survival skills very different to the one in a social environment. yet our \"bush child\" is as capable of knowing right and wrong as any other \"person\". however, because this is not implicitly taught to him, he has no need to exercise manners, and his values are totally different. in such a case, killing would have no moral bearing on him. he would probably be curious if he encountered another human, or any other animal, but there would be no compulsion to \"not kill because its wrong\" for him.\n \n would this \"bush child\" qualify as a \"person\"? are you saying that even he would inherently know that killing is wrong?\n \n \nYes, we are having one. That it exists does not imply everyone has knowledge of it. That the laws of economics exist the same everywhere does not imply that everyone will know them and agree upon them.\n\n the fact that this debate exists implies that this universal moral code is not apparent to everyone, even though according to you it should be. either we all have knowledge of this code and are in denial, or something is wrong with the functions of our consciousness. could it be that this moral code, even though inherently internal and common to all conscious persons, can be suppressed? what exercises can be practiced to make this internal universal moral code more apparent to individuals?", 
   {}, 
   110065, 
   null, 
   1114102320.0
  ], 
  [
   110252, 
   null, 
   "Symbiote", 
   "his universal moral code is not apparent to everyone, even though according to you it should be\n\n \n That it exists does not imply everybody knows it. Only that every person *can* come to know it through a process of reasoning.\n \n \ncould it be that this moral code, even though inherently internal and common to all conscious persons, can be suppressed?\n\n \n \"Suppressed\" by default.\n \n \nwhat exercises can be practiced to make this internal universal moral code more apparent to individuals?\n\n \n Well, that's what the whole philosophy of morals thing is about.", 
   {}, 
   110242, 
   null, 
   1114103640.0
  ], 
  [
   110304, 
   null, 
   "unkerpaulie", 
   "the only way that this code of ethics becomes common knowledge among persons is through direct indoctrination. people are taught at an early age that its beneficial to their survival in their present environment to wait their turn, speak the truth, not kill others, etc. i submit that this code is not innate. if it is not taught, then it will never be recieved. someone who has not been directly taught this list of moral do's cannot be considered morally responsible. it only seems as though this code is innate because it is one of the very first things that are necessarily and directly taught to us, but that is the way that it becomes common and universal", 
   {}, 
   110252, 
   null, 
   1114108320.0
  ], 
  [
   110504, 
   null, 
   "fracas", 
   "consider this\n \n if Moral relativsim is true, then moral objectivism is also true and equally valid. afterall, one's belief is as good as any other.\n \n if moral objectivism is true, then moral relativism is false.\n \n try to come up with a condition in which relativism is true without objectivism being true?", 
   {}, 
   110304, 
   null, 
   1114129500.0
  ], 
  [
   110628, 
   null, 
   "Mach", 
   "consider this\n \n if Moral relativsim is true, then moral objectivism is also true and equally valid. afterall, one's belief is as good as any other.\n \n if moral objectivism is true, then moral relativism is false.\n \n try to come up with a condition in which relativism is true without objectivism being true?\n\n \n Fracas, that's unbelieviably wrong (but that's not a bad thing!)\n \n Moral relativism is the definition of a concept that has meaning, namely, that some humans have beliefs about some behaviors being bad and some good, relative to themselves, some society, or some other consciousness. Is it possible to prove that \"false\" in any meaningful way? Of course not.\n \n Worse is your attempt to link the recognition that some people say some things are good or bad to them, has any relevance whatsoever to the concept of \"moral objectivity\".\n \n In your twisted illogical phrasing, literally, the theory of relativity requires that time is constant, since time is also relative. Or that if rob has more money than tom, then tom has the most money. It's as if you said purple pears have wings.\n \n Here is the obvious analysis of your claim:\n \n \nif Moral relativsim is true, then moral objectivism is also true and equally valid. afterall, one's belief is as good as any other.\n if moral objectivism is true, then moral relativism is false.\n\n \n Moral relativism: A concept describing how human beings believe some behaviors are good, or bad, based on some criteria.\n \n Moral objectivity: The claim that rules of behavior exist indpendant of consciousness, and thus, exist in reality.\n \n Now, let's plug in your \"puzzle\".\n \n Humans beings hold the concept that some behaviors are good, or bad, based on some criteria\n \n Therefore\n And it's hard to stay focused while typing this...\n \n Rules of behavior exist indpendant of consciousness and thus, exist in reality.\n \n ======================\n \n Sorry fracas,that one didn't stick, but creative to be sure. \n \n There is no \"therefore\" as a result of acknowledging that some people believe XYZ, with regards to the existence or non-existence of XYZ.\n \n A simple analogy also shows it, for anyone on a shorter attention span:\n \n Premise: I believe that people have different beliefs.\n Premise: President Bush thinks he's literally superman, a super human hero that can fly, has laser beams, and super strength, and a fetish for tights.\n \n Since some people have different beliefs is a true statement, and George Bush has a belief he's superman, then George Bush is superman.\n \n Come with with a scenario where that isn't true...\n \n -Mach", 
   {}, 
   110504, 
   null, 
   1114144440.0
  ], 
  [
   110639, 
   null, 
   "fracas", 
   "@mach\n \n it is even worse, but naturally normal and expected, when self proclaimed moral relativists don't even know what moral relativism means.\n but since there is no absolute meanings in relativism, that is all part of the absurdity of relativism still\n \n \nMoral relativism is the position that moral propositions do not reflect absolute or universal truths. It not only holds that ethical judgments emerge from social customs and personal preferences, but also that there is no single standard by which to assess an ethical proposition's truth. Many relativists see moral values as applicable only within certain cultural boundaries. Some would even suggest that one person's ethical judgments or acts cannot be judged by another, though most relativists propound a more limited version of the theory.\n \n Some moral relativists - for example, Jean-Paul Sartre (1905-1980) - hold that a personal and subjective moral core lies at the foundation of our moral acts. They believe that public morality is a reflection of social convention, and that only personal, subjective morality is truly authentic.\n \n Moral relativism is not the same as moral pluralism, which acknowledges the co-existence of opposing ideas and practices, but does not suggest that they are equally valid. Moral relativism, in contrast, contends that opposing moral positions have no truth value, and that there is no preferred standard of reference by which to judge them.\n\n \n perhaps you are more a moral pluralist (per your post) than a moral relativist. i'll give you a chance to reconsider.", 
   {
    "unicode_changes_made": true
   }, 
   110628, 
   null, 
   1114146660.0
  ], 
  [
   110701, 
   null, 
   "Mach", 
   "@mach\n it is even worse, but naturally normal and expected, when self proclaimed moral relativists don't even know what moral relativism means.\n but since there is no absolute meanings in relativism, that is all part of the absurdity of relativism still\n perhaps you are more a moral pluralist (per your post) than a moral relativist. i'll give you a chance to reconsider.\n\n \n I suggest you start reasoning, rather than making rhetorical and misrepresentitive posts. Or simply stop debating, your choice.\n \n I seem to agree with moral relativism, including the wikipedia definition which was one source read before starting the first thread of this post. So factually, you're incorrect, to begin with.\n \n Further, I'm still in agreement, despite your desire for me to be otherwise. Any other questions?\n \n -Mach", 
   {}, 
   110639, 
   null, 
   1114153680.0
  ], 
  [
   110770, 
   null, 
   "fracas", 
   "I suggest you start reasoning, rather than making rhetorical and misrepresentitive posts. Or simply stop debating, your choice.\n \n I seem to agree with moral relativism, including the wikipedia definition which was one source read before starting the first thread of this post. So factually, you're incorrect, to begin with.\n \n Further, I'm still in agreement, despite your desire for me to be otherwise. Any other questions?\n \n -Mach\noh Mach\n \n don't be that way\n its not my fault that your moral relativism is absurd\n \n rhetoric? reason? ;)\n i've given a definition of moral relativism via wikipedia\n laid out how there can be no refutation of moral absolutism within moral relativism\n and i can't reason?\n cute\n \n and then my \"factually, [i'm] incorrect, to begin with\" statement.\n what would that be?\n i neither claim you were a moral relativist nor that you were a moral pluralist? and for this i am \"factually incorrect\"?\n that is darling\n if you are a true relativist, how can you deny the validity of absolutism?\n or is it wikipedia is wrong? and how could it be wrong in a relative world?\n besides, you agreed to it as well ... \n but then i guess you mean incorrect as in correct, aren't they one and the same and neither in a relativist world?\n \n as i see it\n you are still treating moral relativism as a moral absolute concept, \n and again fail to maintain internal consistency by declaiming moral absolutism\n \n \n it gives me great pleasure on this board when posters resort to making charges of rhetoric or fallacies instead of providing reasons in defense/explanations for their ideations.\n \n btw:\n \nMoral relativism: A concept describing how human beings believe some behaviors are good, or bad, based on some criteria.\n \n Moral objectivity: The claim that rules of behavior exist indpendant of consciousness, and thus, exist in reality.\n\n seems you neither understand moral relativism nor moral objectivity\n 1. when you say \"some criteria\" you really meant no criteria and all criterias, eh? or are you really mean one criteria? (after all, the remainder of that definition about behaviours being good or bad is a definition of morality, common to both relativists and objectivists)\n 2. it is silly to claim that rules of behaviour exist independent of consciousness as you continue to post about it", 
   {}, 
   110701, 
   null, 
   1114178820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Moral objectivism vs Moral relativism", 
  "url": "http://www.4forums.com/political/philosophy-debates/4840-moral-objectivism-vs-moral-relativism.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 4840, 
  "discussion_files": [
   [
    "10575.html", 
    "http://www.4forums.com/political/philosophy-debates/4840-moral-objectivism-vs-moral-relativism-print.html"
   ], 
   [
    "10576.html", 
    "http://www.4forums.com/political/philosophy-debates/4840-moral-objectivism-vs-moral-relativism-5-print.html"
   ], 
   [
    "10577.html", 
    "http://www.4forums.com/political/philosophy-debates/4840-moral-objectivism-vs-moral-relativism-4-print.html"
   ], 
   [
    "10578.html", 
    "http://www.4forums.com/political/philosophy-debates/4840-moral-objectivism-vs-moral-relativism-3-print.html"
   ], 
   [
    "10579.html", 
    "http://www.4forums.com/political/philosophy-debates/4840-moral-objectivism-vs-moral-relativism-2-print.html"
   ]
  ], 
  "identifier": 4840
 }
]