[
 [
  [
   5951, 
   null, 
   "Stormin Norman", 
   "Dear NAMBLA, \n \n \n Although I have been aware of your most despicable organization for some time, I have chosen to let others condemn it for me. Previously, I thought that outspoken critics, like Bill O'Rielly, were sufficient in advocating your remove from our society. Recently, my attitude has changed. I have decided to take to various media for the purpose of helping to eradicate the most malignant tumors that threaten America's civil society. Unfortunately for you, your organization NAMBLA, short for North American Malignant Boy-molesters who operate Licentiously and Act immorally, has shown up on my radar screen as possibly one of the most dangerous threats to American culture. \n \n Let me start by saying that I have nothing against homosexuals. What people chose to do on their own time is their own business, up to a point. If degenerates like you chose to simply poke each other in the XXX, I would have no problem. However, sexual gratification between adults is not your business. As an extension of the gay agenda, your organization wishes to further infiltrate my society by overrunning the socialization processes necessary for the creation of decent citizens. This is done in an attempt to change people's perceptions about what is acceptable in a civil society. Like the white supremacists, you wish to legitimize your demented world-view through shared perception. Like the group that dangers you the most, you wish to indoctrinate the youth and spread your perversion throughout society. \n \n Unfortunately for me, I had to visit your homepage in order to research what your group claims to represent. Your objectives were clearly stated. \n \n Your \"goal is to end the extreme oppression of men and boys in mutually consensual relationships by: building understanding and support for such relationships; educating the general public on the benevolent nature of man/boy love; cooperating with lesbian, gay, feminist, and other liberation movements; supporting the liberation of persons of all ages from sexual prejudice and oppression\". \n \n Exactly as I suspected, you wish to erode the mores that prevent society from accepting pedophilia. I have got some bad news for you. Nothing you can do will ever end the extreme oppression felt by the pedophiles that molest little boys. Your attempts to redefine what is socially accepted will be hindered by the majority of people that support decency. Regular people, including most gays, will never understand your insatiable desire to have sex with children. Your \"relationships\" will forever be considered as criminal behavior. Get use to it sickos. You have no hope in being accepted by normal people. Just like in your adolescents, you are considered by everyone to be awkward freaks, who deserve shunning or constant ridicule. Further updating you to the feelings of most Americans, I say that we have no use for \"education\" into what it means for an adult to damage a child. Surely, it is the workings of a convoluted mind that claims such spoliation to be a benevolent act. What value would society have for teachings offered by a cankerous sore on its customs and morals? If society were a living system, you would be a pathogen aimed at its destruction. Consider those decent people, who refuse to acquiesce to your lies and deception, to be the immune system dedicated to the destruction of a harmful agent. \n \n Furthermore, you claim one of your objectives to be the support of \"greater economic, political and social opportunities for young people and denounce the rampant ageism that segregates and isolates them in fear and mistrust.\" How foolish do you think people are? This is obviously a poor attempt to lure insecure children into your organization. Do you really think that taking on a role of child advocate will convince any normal child to expose themselves to your perverse organization? I think not. Even the children are not as blind as you would hope. Even children who have had the misfortune of ever hearing about your organization revile you. Those like you are true outcasts. Even the most innocent among us are able to recognize your sickly presence. I liken this attempt to speak for the children to the tactic of luring children away with candy that child molesters use. To your credit, it is a more elaborate scheme that demonstrates how advanced your type has evolved to become. Like the pathogens you are, it was necessary for you to find more innovative ways of fooling the immune system. We are not fooled. Consider me to be the cytotoxic T lymphocyte (CTL) whose purpose it is to limit virus reproduction and destroy virus-infected cells. In other words, you are the disease and I am the cure. \n \n In addition, you call for the \"fundamental reform of the laws regarding relations between youths and adults. Today, many thousands of men and boys are unjustly ground into the disfunctional criminal justice system. Blindly, this system condemns consensual, loving relationships between younger and older people\". First, let me tell you that you spelled dysfunctional wrong. Secondly, let me tell you that I agree the system is dysfunctional. For years I have been asking myself about the validity of a sex offender registry. Why should we need one? Why do we let perverts back out into the population after the have committed a crime against humanity? You are right, we do need reform of the criminal justice system. Perhaps this will be the purpose of my cytokines, to send messages of reforming the system. However, I think we will disagree on how this should be done. I say we stiffen the penalty on child offenders. No man convicted of child molestation should ever see the light of day again. Furthermore, upon their conviction, child molesters should face the death penalty. Of course, in the interest of a speedy trial system, the appeals process should be expedited. Instead of a twenty-year wait, they should only have to face a two-year wait. Instead of wasting energy electrifying someone not worthy of the electricity we shall find a more cost effective, perhaps more painful method of execution. \n \n Your web-site also states, \"Our prisoner program seeks to provide moral support to incarcerated boy-lovers. These people experience a harsh and exceptionally hostile environment, which undermines their self-concepts and self-respect. We keep in touch with prisoners, primarily through a monthly Prisoners' Letter.\" I'm sorry, but I am having a real hard time feeling any sympathy for these monsters, and I don't agree with your intentions to lighten the burden these prisoners face while incarcerated. Unlike your organization, I feel the criminal pecking order remains a form of poetic justice. Child rapists should be thrown into the general population where they can suffer humiliating beatings for the rest of their days. This form of justice will do just fine until the day when they can be terminated for their hideous actions. They should have more to worry about than whether or not they can receive NAMBLA mail. Society would be better served if they had to worry more about surviving another day in prison. Furthermore, shouldn't these sick ****s be questioning their self-concepts? If they had any self-respect they wouldn't defile children, so that's a moot point. \n \n It sickens me that you would find this to be an important cause. Obviously, only a child molester would feel as you do, and that is why they should lock up everyone associated with your organization. The chances are, most of you have or will assault a child, and allowing those so vocal in their fight for child molestation is a game of Russian roulette society shouldn't play. In the interest of protecting our youth a rapid campaign for the extermination of all child molesters should be waged. Now that's a cause worth championing, so much worthier than the rights of the child molesters who deserve nothing better than death. \n \n Your enemy, \n \n Stormin Norman \n \n P.S. If one of your kind ever touches someone that I care about you will have more to worry about than the current justice system.", 
   {
    "post_info": {
     "post_title": "My letter to NAMBLA....Your thoughts and comments are welcome"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1049104200.0
  ], 
  [
   6665, 
   null, 
   "gilligan8503", 
   "very well written and thought-out letter (finally had time to sit down and read it :)). that web site kind of reminds me of the pro-anorexia web site. sick, sick people.", 
   {}, 
   5951, 
   null, 
   1050366240.0
  ], 
  [
   12297, 
   null, 
   "tuesdeb", 
   "Stormin-\n The fact is that most boy molestors are not interested in ADULTS at all, and when they do have a relationship with an adult, it is just a cover and almost ALWAYS heterosexual. I too find child molestation dispicable, but you should get your facts straight before you send your letter...it is addressed to the experts, after all.\n \n \n edit--\n My bad, after looking at the material they have posted on their website, i can see that they do PRESENT themselves as gay...I dont think the American Psychological Association would agree...the facts are that pedophilia has no link to homosexuality. Many child molesters cannot be meaningfully described as homosexuals, heterosexuals, or bisexuals because they are not really capable of a relationship with an adult man or woman. Instead of gender, their sexual attractions are based primarily on age. These individuals are attracted to children, not to men or women.", 
   {}, 
   6665, 
   null, 
   1059429960.0
  ], 
  [
   12312, 
   null, 
   "Jonathan_Fox", 
   "Stormin-\n The fact is that most boy molestors are not interested in ADULTS at all, and when they do have a relationship with an adult, it is just a cover and almost ALWAYS heterosexual. I too find child molestation dispicable, but you should get your facts straight before you send your letter...it is addressed to the experts, after all.\n \n \n edit--\n My bad, after looking at the material they have posted on their website, i can see that they do PRESENT themselves as gay...I dont think the American Psychological Association would agree...the facts are that pedophilia has no link to homosexuality. Many child molesters cannot be meaningfully described as homosexuals, heterosexuals, or bisexuals because they are not really capable of a relationship with an adult man or woman. Instead of gender, their sexual attractions are based primarily on age. These individuals are attracted to children, not to men or women.\n\n \n Liking boys as young as 14 is about the limit of where I'll go and consider someone gay without just being a pedophile (and I realise some people will find even that disturbing, but keep in mind the age of consent in Japan is only 14). Much younger and it's just... yech. No longer allowed to call themselves gay, in my book. But if they're actually interested in older men, then they're a gay pedophile. Most of those who are interested in adults at all are actually heterosexual, though.", 
   {}, 
   12297, 
   null, 
   1059456780.0
  ], 
  [
   12575, 
   null, 
   "sassy1", 
   "Liking boys as young as 14 is about the limit of where I'll go and consider someone gay without just being a pedophile (and I realise some people will find even that disturbing, but keep in mind the age of consent in Japan is only 14). Much younger and it's just... yech. No longer allowed to call themselves gay, in my book. But if they're actually interested in older men, then they're a gay pedophile. Most of those who are interested in adults at all are actually heterosexual, though.\n\n \n \n NAMBLA does need to be taken to task. They present themselves as Gay in order to fall on the coat tails of the increasingly acceptance of homosexuality. IMHO, it is a group of individuals who seek justification for immoral and illegal behavior by organizing. \n \n Geesh.\n \n Nice letter.\n \n :)", 
   {}, 
   12312, 
   null, 
   1059883080.0
  ], 
  [
   12588, 
   null, 
   "Ness757", 
   "Is the NAMBLA that child molesting organization?", 
   {}, 
   12575, 
   null, 
   1059939840.0
  ], 
  [
   12602, 
   null, 
   "maximus", 
   "Jonathan,\n It sounds like your 14 year old line is arbitrary. How did you come up with it (besides Japan endorsing it)? Why is a 13 year old \"yech\" and not a 14 year old? Looking back on your own life, don't you feel that a lot of maturity and life changes take place in that 7 year span from 14 to 21?", 
   {}, 
   12575, 
   null, 
   1059955860.0
  ], 
  [
   12604, 
   null, 
   "tuesdeb", 
   "Is the NAMBLA that child molesting organization?\n\n \n Ness757,\n \n Yes, the full name is North American Man/Boy Love Association.", 
   {}, 
   12588, 
   null, 
   1059961020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  My letter to NAMBLA....Your thoughts and comments are welcome", 
  "url": "http://www.4forums.com/political/gay-rights-debates/487-my-letter-nambla-your-thoughts-comments-welcome.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 487, 
  "discussion_files": [
   [
    "26137.html", 
    "http://www.4forums.com/political/gay-rights-debates/487-my-letter-nambla-your-thoughts-comments-welcome-print.html"
   ]
  ], 
  "identifier": 487
 }
]