[
 [
  [
   109785, 
   null, 
   "Voice Of Reason", 
   "The new pope is a great pick if your catholic and a conservative......Not good news for pro gay and abortion issues........", 
   {
    "post_info": {
     "post_title": "Great pick for Pope if your conservative..."
    }
   }, 
   null, 
   null, 
   1114017480.0
  ], 
  [
   109790, 
   null, 
   "gamehuis", 
   "Nothing new here with regards to the policies of the Vatican. Just business as usual. They should have named him John Paul III.", 
   {}, 
   109785, 
   null, 
   1114017900.0
  ], 
  [
   109791, 
   null, 
   "wilted_laughter", 
   "Pro Gay? \n \n Yes, I actively support the homosexualisation of the entire species.!11!!!eleven!!!one!!!11!1!\n \n Abortion wouldn't get approval from the most liberal of popes.\n \n Meh, it was always going to a conservative. Church is just going to alienate more and more of its followers (in western Europe at least).", 
   {}, 
   109785, 
   null, 
   1114018020.0
  ], 
  [
   109794, 
   null, 
   "Waxy", 
   "I don't know anything about him, I just know that I don't like the name he chose.\n \n Benedict XVI? \n \n There's my deep moral and religious thought for the day. :p \n \n Waxy", 
   {}, 
   109791, 
   null, 
   1114018560.0
  ], 
  [
   109808, 
   null, 
   "Alan Ryan", 
   "Catholicism is essentially a \"conservative\" belief system and is likely to remain an anachronism under any pope.\n \n If you're catholic and liberal, it's probably time to join another club/cult: the Church of England lets you believe more or less whatever you want.", 
   {}, 
   109794, 
   null, 
   1114019700.0
  ], 
  [
   109817, 
   null, 
   "jitobear", 
   "Granted I am not Catholic and and therefor whatever any pope believes is pretty irrelevant to me personally - HOWEVER, I kind of hoped they would elect a Latin American pope....", 
   {}, 
   109808, 
   null, 
   1114020420.0
  ], 
  [
   109818, 
   null, 
   "REMF Hunter", 
   "Surely, I do not see a continuing frustration with the Vatican over American Catholic's wish for them to enter at least the 20th Century as good news. If all the reporting is correct, and it may well be very false when it comes to today's media standards, these are important concerns for the majority of American Catholics, and have actually created the shortage of men entering the Priesthood, and parishoners moving on to nondenomanation Christian worship. To continue this is good news?\n \n Pope Benny is 78-years-old. Can you say temporary while behind the scenes power broking is going on, for who the Next next Pope is going to be?\n \n The Catholic Church in America has its image problems, and I do not see how reinforcing them is good news----at least in the long run.", 
   {}, 
   109808, 
   null, 
   1114020540.0
  ], 
  [
   109819, 
   null, 
   "gnojek", 
   "A priest in a small rural town was very fond of his 10 chickens and 1\n handsome XXXX he kept in a hen house behind the rectory.\n \n One Saturday night the priest discovered that the rooster was missing.\n \n At the same time the priest heard rumors of cockfights being held in town.\n \n Shocked and dismayed, he decided to say something during Mass.\n \n During Mass he asked the congregation, \"Who among you will confess to sporting a handsome XXXX?\"\n \n All the men stood up.\n \n \"No, no,\" he said. \"That's not what I mean. Who among you will confess to having seen a handsome XXXX?\"\n \n All the women stood up.\n \n \"Oh, no,\" he said. \"That's not what I mean either. Who among you will confess to having seen a XXXX that doesn't belong to you?\n \n \" Half the women stood up.\n \n \"Oh Lord,\" he said. \"Perhaps I should rephrase the question: Has anybody seen my XXXX?\"\n \n All the choirboys stood up.", 
   {
    "post_info": {
     "post_title": "Unsolicited Priest Joke"
    }
   }, 
   109818, 
   null, 
   1114020660.0
  ], 
  [
   109965, 
   null, 
   "Duo_Maxwell", 
   "ahhaha\n \n \n New Pope's Ex-Students Express Skepticism\n \n \"It's going to be interesting to see what he does,\" said Thomas Burchard, a 20-year-old Protestant studying for the ministry. \"He's very conservative and, like the Catholic Church, he goes against what the Bible says.\" \n \n OUCH.\n \n http://story.news.yahoo.com/news?tmpl=story&cid=535&ncid=535&e=3&u=/ap/20050420/ap_on_re_eu/pope_s_university_1", 
   {}, 
   109819, 
   null, 
   1114039560.0
  ], 
  [
   110066, 
   null, 
   "Voice Of Reason", 
   "I think what most Catholics in the U.S. forget is that there are over a billion Catholics in the world and only 6 percent come from this country.......", 
   {}, 
   109965, 
   null, 
   1114053900.0
  ], 
  [
   110067, 
   null, 
   "Voice Of Reason", 
   "Granted I am not Catholic and and therefor whatever any pope believes is pretty irrelevant to me personally - HOWEVER, I kind of hoped they would elect a Latin American pope....\n\n \n That is interesting to hear.........I am also a Roman Catholic and although not that religeous I believe the Pope is the spiritual leader of the church and try to follow the precepts he advocates.........", 
   {}, 
   109817, 
   null, 
   1114054080.0
  ], 
  [
   110200, 
   null, 
   "kickin50", 
   "I think what most Catholics in the U.S. forget is that there are over a billion Catholics in the world and only 6 percent come from this country.......\nAs a non-Catholic observer... Americans are 6 percent of the followers. What percent of the donations? European churches, so they say, are nearly empty. How can the church continue to attract followers in the developing countries if they're not bearing gifts? I do wonder if they'll implode financially.\n \n Also, I wonder how they count followers, since most Catholics I know haven't seen the inside of a church in a VERY long time. If they're counting batismal records, the actual numbers in America could truly be much lower.\n \n Lastly, the Catholic church claims OVER a billion followers. 6% of a billion is 60 million. The census puts the U.S. population at about 300 million. So, a little math brings us to conclude that AT LEAST 1 in 5 Americans are Catholic. Frankly, I've got my doubts. There certainly aren't that many showing up every Sunday. Looking at the seating capacity of ALL churches around me, they couldn't hold 20% of the population. Maybe, just maybe, if we squish, they could hold 1%. Do the parking lots look as if they could handle 1/5 of the Monday morning traffic on the freeway?\n \n It looks to me as if religion, all of the them, are in trouble. (despite what the politicians say) Americans like to cheer on the religious. They just don't want to participate.", 
   {}, 
   110066, 
   null, 
   1114093740.0
  ], 
  [
   110234, 
   null, 
   "thebootfitter", 
   "Lastly, the Catholic church claims OVER a billion followers. 6% of a billion is 60 million. The census puts the U.S. population at about 300 million. So, a little math brings us to conclude that AT LEAST 1 in 5 Americans are Catholic. Frankly, I've got my doubts. There certainly aren't that many showing up every Sunday. Looking at the seating capacity of ALL churches around me, they couldn't hold 20% of the population. Maybe, just maybe, if we squish, they could hold 1%. Do the parking lots look as if they could handle 1/5 of the Monday morning traffic on the freeway?\n \n It looks to me as if religion, all of the them, are in trouble. (despite what the politicians say) Americans like to cheer on the religious. They just don't want to participate.\n\n Your rough guesstimations are just that: pretty rough. You are forgetting that many churches have multiple services every Sunday. (Some churches I've seen have over five services.) Remember, too, that just because someone considers themself a Catholic does not mean that they necessarily attend services on Sundays.\n \n See this link for some statistics on religious affiliation. \"This table [that shows that in March 2002, 24% of U.S. residents considered themselves Catholis] matches data from Gallup, Barna, and other polling organizations...\"", 
   {}, 
   110200, 
   null, 
   1114101180.0
  ], 
  [
   110277, 
   null, 
   "jitobear", 
   "That is interesting to hear.........I am also a Roman Catholic and although not that religeous I believe the Pope is the spiritual leader of the church and try to follow the precepts he advocates.........\n\n \n It's just that there are so many Catholics in Latin America, and culturally different than in Europe. It would have been interesting to see a Pope from there - or anywhere besides Europe.", 
   {}, 
   110067, 
   null, 
   1114106880.0
  ], 
  [
   110295, 
   null, 
   "Voice Of Reason", 
   "Your rough guesstimations are just that: pretty rough. You are forgetting that many churches have multiple services every Sunday. (Some churches I've seen have over five services.) Remember, too, that just because someone considers themself a Catholic does not mean that they necessarily attend services on Sundays.\n \n See this link for some statistics on religious affiliation. \"This table [that shows that in March 2002, 24% of U.S. residents considered themselves Catholis] matches data from Gallup, Barna, and other polling organizations...\"\n\n \n Not sure but I go to mass every Sunday and the pews are full......There are a lot of people in this country who hate catholics and the catholic church and would like to see it go down........\n \n Its not going to happen............", 
   {}, 
   110234, 
   null, 
   1114108020.0
  ], 
  [
   110298, 
   null, 
   "Voice Of Reason", 
   "Your rough guesstimations are just that: pretty rough. You are forgetting that many churches have multiple services every Sunday. (Some churches I've seen have over five services.) Remember, too, that just because someone considers themself a Catholic does not mean that they necessarily attend services on Sundays.\n \n See this link for some statistics on religious affiliation. \"This table [that shows that in March 2002, 24% of U.S. residents considered themselves Catholis] matches data from Gallup, Barna, and other polling organizations...\"\n\n \n You are absolutley right.........The church I attend has a Saturday night mass and 2 on Sunday morning and they all full........", 
   {}, 
   110234, 
   null, 
   1114108140.0
  ], 
  [
   110321, 
   null, 
   "Waxy", 
   "There are a lot of people in this country who hate catholics and the catholic church and would like to see it go down........\n\n \n Maybe they just \"hate\" some catholics and certain aspects of the catholic church.\n \n Waxy", 
   {}, 
   110295, 
   null, 
   1114109580.0
  ], 
  [
   110404, 
   null, 
   "Duo_Maxwell", 
   "Maybe they just \"hate\" some catholics and certain aspects of the catholic church.\n \n Waxy\n\n \n Well, that is quite obvious to us. If I may generalization, it is likely that everyone hates at least one person of a specific faith and one aspect of a specific religious organization.", 
   {}, 
   110321, 
   null, 
   1114123320.0
  ], 
  [
   110613, 
   null, 
   "snakespit", 
   "Well, that is quite obvious to us. If I may generalization, it is likely that everyone hates at least one person of a specific faith and one aspect of a specific religious organization.\n\n Yes..hate...yet another christian value.", 
   {}, 
   110404, 
   null, 
   1114141920.0
  ], 
  [
   110619, 
   null, 
   "Easyrider", 
   "Yes..hate...yet another christian value.\n\n \n That's the kind of liberal left nonsense that loses you people elections.", 
   {}, 
   110613, 
   null, 
   1114142760.0
  ], 
  [
   110731, 
   null, 
   "Duo_Maxwell", 
   "Yes..hate...yet another christian value.\n\n \n I wouldn't specifically say that. While at times the Church has propagated hate as a means to get what it wants, hate is a inherent human trait. You don't have to be a christian to hate, nor does being a christian mean you aren't hateful. I know plenty of hateful christians, and I know plenty of non-hateful atheists, and everything in between. What I find hard is to make a buddhist hate you though. I mean, you have to work at that.", 
   {}, 
   110613, 
   null, 
   1114161840.0
  ], 
  [
   110796, 
   null, 
   "kickin50", 
   "Your rough guesstimations are just that: pretty rough.\n From my previous post: Lastly, the Catholic church claims OVER a billion followers. 6% of a billion is 60 million. The census puts the U.S. population at about 300 million. So, a little math brings us to conclude that AT LEAST 1 in 5 Americans are Catholic.\n \n That's not that rough of a guesstimate. They're not my numbers. It's just multiplication using the church's numbers and the U.S. Census.\n \n \nYou are forgetting that many churches have multiple services every Sunday. (Some churches I've seen have over five services.) \nThe size of a congregation looks entirely different depending on what part of the country you're in. The redder the state, the harder it is to locate a Catholic church. For my in-laws in central Florida, the closest is a half hour drive - and that church is very small. In the Northeast, the picture appears quite different.\n \n \nRemember, too, that just because someone considers themself a Catholic does not mean that they necessarily attend services on Sundays.\nMy point exactly. How Catholic are they really?\n \n \nSee this link for some statistics on religious affiliation. \"This table [that shows that in March 2002, 24% of U.S. residents considered themselves Catholis] matches data from Gallup, Barna, and other polling organizations...\"\nSo, your numbers are more generous than mine. I came to 1 in 5. You came to 1 in 4.\n \n It's not about hating Catholics. I'm married to one. Or am I? I'm just asking how realistic the numbers are when it comes to those that truly follow the teachings vs those who just label themselves. The same arguments could be made for each of the Protestant denominations. Remember that I said I didn't think that ALL of the churches together could hold 20% (25%) of the population. And I don't. I'm in Cleveland. If I could transplant the Brown's stadium into my little suburb, it couldn't hold 20% of the population of just my town - much less 25%.\n \n Then add to that 25% all of the Christians who are non-Catholic. The numbers who count themselves as opposed to the size of the religious structures becomes pretty obviously and pretty rediculously lopsided.", 
   {}, 
   110234, 
   null, 
   1114183920.0
  ], 
  [
   110800, 
   null, 
   "Black Phoenix", 
   "Well let's see I'm far from Catholic, I think they are extremely mislead on their doctrine such as pergatory and confessing to a priest, but watch the movie Martin Luther if you want to better understand some of my points.\n \n As for the pope, I agree with whoever posted that this is just a temporary pope. This guy looks like he is on his last leg already. I'm glad that he actually hold to Biblical Doctrine concerning gays and abortion though...it's going to be hard enough with constant pressure for us Christians to give into secular conformity and accceptance...\n \n We'll have to see how this plays out over the next few years...\n \n With Love in Christ...", 
   {}, 
   110796, 
   null, 
   1114184640.0
  ], 
  [
   111054, 
   null, 
   "Voice Of Reason", 
   "Well let's see I'm far from Catholic, I think they are extremely mislead on their doctrine such as pergatory and confessing to a priest,\n \n \n That is your opinion my friend and you know what opinions are like.........Everybody has one..........", 
   {}, 
   110800, 
   null, 
   1114221600.0
  ], 
  [
   111100, 
   null, 
   "Steeeeve", 
   "Has anyone pointed out the fact that \"your\" is different from \"you're\"....\n \n GREAT PICK FOR POPE IF YOU'RE CONSERVATIVE....\n \n I am the worst speller and I know that :p", 
   {}, 
   110295, 
   null, 
   1114230300.0
  ], 
  [
   111162, 
   null, 
   "pandion", 
   "Thanks, Steeeeve. I was trying to resist. Of course I understood the OP to read, \"The new pope is a great pick if my catholic and a conservative.\" The point has been reduced to gibberish by semiliteracy since the poster doesn't know the difference between \"your\" and \"you're.\" Does this mean that the poster never attended high school?", 
   {}, 
   111100, 
   null, 
   1114243440.0
  ], 
  [
   111197, 
   null, 
   "kickin50", 
   "Well let's see I'm far from Catholic, I think they are extremely mislead on their doctrine such as pergatory and confessing to a priest\nConfession is good - although not to a priest - as I'm not Catholic. Confession is simply an acknowledgement of the difference between right and wrong. A little soul searching is a good thing. That's what religion is all about -- how we treat our fellow human beings.\n \n However, of late the focus seems to be on SEX. SEX SEX SEX. I'm just sick of the pre-occupation with it. One too many choruses of the abstinance song. Second verse, same as the first. A little bit louder and a little bit worse. Good grief. What a one track mind. There must be something else in The Good Book that's worth talking about. But just like toothpaste commercials, nothing sells like sex.\n \n Let's just air drop condoms into Africa and get it over with. Then we could move on to worth while humanitarian goals. Send my money to faith based organizations? Not if they're going to use it to spit into the wind.\n \n The Pope does have the power to change the world. That's the only reason I care.", 
   {}, 
   110800, 
   null, 
   1114260720.0
  ], 
  [
   111622, 
   null, 
   "maximus", 
   "Confession is good - although not to a priest - as I'm not Catholic. \n \n Confession is good to anyone but a priest in these times, I suppose. Confession to one's therapist, confession to one's family, one's friends, over the radio to the masses, on reality TV to people we don't even know, etc. All of those people are much more appropriate confessors than priests. \n \n \"If a girl must not mention sin to a man in a corner of a church, it is apparently the only place nowadays in which she may not do so.\" G.K. Chesterton in The Thing: Why I Am A Catholic\n \n But I understand what you were saying, Kickin'. It might cause a bit of a scandal for a Methodist to confess to a priest. I will try to answer your post on the political forum soon. I haven't forgotten about it.", 
   {}, 
   111197, 
   null, 
   1114382640.0
  ], 
  [
   111665, 
   null, 
   "Black Phoenix", 
   "In no way am I arguing against confession, however, I don't believe you need a priest to mediate for you to Christ. That diminishes the purpose somewhat as to why Christ came. He, Jesus Christ, is the mediator between man and God. I see priest as just an unnecessary added middle man. I simply confess my sins to Jesus, not to another man who also struggles with sins, because no one is perfect except for Jesus.", 
   {}, 
   111622, 
   null, 
   1114388520.0
  ], 
  [
   111816, 
   null, 
   "maximus", 
   "In no way am I arguing against confession, however, I don't believe you need a priest to mediate for you to Christ. That diminishes the purpose somewhat as to why Christ came. He, Jesus Christ, is the mediator between man and God. I see priest as just an unnecessary added middle man. I simply confess my sins to Jesus, not to another man who also struggles with sins, because no one is perfect except for Jesus.\n\n Phoenix,\n God is definitely powerful enough and merciful enough to forgive someone's sins via direct interaction. So confession is not the only way to be forgiven but it is the most appropriate way. Why? Because Jesus himself instructed us in this manner and told us that men would be mediators in that way. John 20: 21-23 \"Jesus said to them again, 'Peace be with you. As the Father has sent me, even so I send you. And when he had said this, he breathed on them, and said to them, 'Receive the Holy Spirit. If you forgive the sins of any, they are forgiven; if you retain the sins of any, they are retained.\"\n \n And there is no mediator between God and man like Jesus but we all do mediate in varying degrees (1 Timothy 2:1-5). \n \n I believe that you said you were a Lutheran--what synod? or ELCA? My wife is Lutheran ELCA. I have learned a bit about that denomination. I believe that some Lutherans sects continue to utilize private confession. I also have seen the movie Luther. I think you suggested earlier that it was a good lesson in history. Luther seems to have been the victim of scrupulosity to a certain extent. I believe if you look into his history he never gave up private confession. Research it and let me know if my memory is hazy though.", 
   {}, 
   111665, 
   null, 
   1114399500.0
  ], 
  [
   112259, 
   null, 
   "gnojek", 
   "The new pope is a great pick if your catholic and a conservative......Not good news for pro gay and abortion issues........\n\n Or pro-death penalty issues.\n http://www.chron.com/cs/CDA/ssistory.mpl/world/3143687\n \n http://4forums.com/political/showpost.php?p=111105&postcount=1\n \n \nI say waste this guy, the sooner the better....What say you?\n\n \n \n \nAll popes are against the taking of human life, all human life.....\n\n \n By ALL popes, do you mean all popes through history?\n \n What about The Inquisition?\n \n http://galileo.rice.edu/chr/inquisition.html\n \nPenalties went from visits to churches, pilgrimages, and wearing the cross of infamy to imprisonment (usually for life but the sentences were often commuted) and (if the accused would not abjure) death. Death was by burning at the stake, and it was carried out by the secular authorities. In some serious cases when the accused had died before proceedings could be instituted, his or her remains could be exhumed and burned. Death or life imprisonment was always accompanied by the confiscation of all the accused's property.\n\n \n I guess the church has changed its mind.\n \n What liberals!", 
   {}, 
   109785, 
   null, 
   1114474560.0
  ], 
  [
   112786, 
   null, 
   "Black Phoenix", 
   "maximus I'm not sure what your point was in favor for...I think you were trying to say you think man should still confess to priest about their sins. There is scripture in John somewhere also that states about Jesus being the only mediator between man and God. As for your scripture I think that was implying more or less that in order for us to be forgiven for our sins and inequities we need to forgive those who wronged us first. Bitterness, anger, and resentment often become footholds in our life when we don't forgive someone, I don't believe that passage was implying we confess to a Father. I admit a close group of friends of mine, we all confess to one another about our difficulties, and build each other up. However, I don't belive one man can say another man is forgiven as in the case of the priest, that is a personal matter between the person and Jesus Christ. That was my point.\n \n I'm not Lutheran, but more non-denominational, although I attend an Assembly of God church. I stated previously that the Luther movie pointed out why the Catholic church was flawed in many ways and how inspiring it was for me at least. For one man to go against everything that was said to be right and had to be \"right\" just because the Holy Roman Catholic Church said so. As for Luther never giving up private confession, well I'm sure you are correct on that for the movie portrayed it in that way at least. In no way am I bashing confession to a priest, I just don't believe it is necessary. Christ is my one and only Father I need to confess to, this is my belief.\n \n Love in Christ...", 
   {}, 
   112259, 
   null, 
   1114575600.0
  ], 
  [
   113257, 
   null, 
   "maximus", 
   "maximus I'm not sure what your point was in favor for...I think you were trying to say you think man should still confess to priest about their sins. There is scripture in John somewhere also that states about Jesus being the only mediator between man and God. As for your scripture I think that was implying more or less that in order for us to be forgiven for our sins and inequities we need to forgive those who wronged us first. Bitterness, anger, and resentment often become footholds in our life when we don't forgive someone, I don't believe that passage was implying we confess to a Father. I admit a close group of friends of mine, we all confess to one another about our difficulties, and build each other up. However, I don't belive one man can say another man is forgiven as in the case of the priest, that is a personal matter between the person and Jesus Christ. That was my point.\n \n I'm not Lutheran, but more non-denominational, although I attend an Assembly of God church. I stated previously that the Luther movie pointed out why the Catholic church was flawed in many ways and how inspiring it was for me at least. For one man to go against everything that was said to be right and had to be \"right\" just because the Holy Roman Catholic Church said so. As for Luther never giving up private confession, well I'm sure you are correct on that for the movie portrayed it in that way at least. In no way am I bashing confession to a priest, I just don't believe it is necessary. Christ is my one and only Father I need to confess to, this is my belief.\n \n Love in Christ...\n\n Black Phoenix,\n You understood me correctly. My point in citing John 20  was to affirm that confession to priests was instituted by Jesus and is a worthwhile practice. \n \n Notice what the verse says, John 20: 21-23  \"Jesus said to them again, 'Peace be with you. As the Father has sent me, even so I send you. And when he had said this, he breathed on them, and said to them, 'Receive the Holy Spirit. If you forgive the sins of any, they are forgiven; if you retain the sins of any, they are retained.\" The power of forgiving wasn't the only power given the apostles. How were the apostles to retain a sin? They had to know what sin it was in order to know whether to forgive it or retain it. How were they to know without it being confessed to them? \n \n If Catholic priests are mediating between God and man then they are mediating in the way Jesus intended. Jesus gave them this power as seen in the verse from John. Because of Apostolic Succession all Catholic Bishops and priests can trace their ordination back to the Apostles. So they have been give this power of absolution in persona Christi.\n \n The scripture you are thinking of about Jesus being the only mediator between God and man is not in John but in the very scripture from Timothy that I cited you, 1 Timothy 2:1-5. But we can't just read one verse from scripture and get the whole picture. Paul wrote this verse and if we look at some of his other writings then we will get a clearer picture of what he thought of mediation.\n \n Many say that there is one mediator between God and man and that is Jesus Christ (1 Timothy 2:5). Jesus is the one mediator of salvation between God and Man. No one else could have done what Jesus did. \n \n But our salvation also depends on a cooperation with the free gift of grace by the free will given to us. 1 Corinthians 3:9, \"For we are God's fellow workers; you are God's field, God's building.\" Does this make us equal with Jesus? No. But we work with God.\n \n Other verses that indicate our cooperation with God:\n \n 2 Corinthians 5:20 and 6:1 \"we are ambassadors of Christ, God making his appeal through us...Working together with him, then, we entreat you...\" \n \n Romans 8:16-17  \"children of God, and if children, then heirs, heirs of God, FELLOW heirs with Christ, provided that we suffer with him in order that we may also be glorified with him.\" \n \n If you look at the first line of chapter 2 of 1 Timothy-a few lines above the mediator quote, you read, \"First of all, then, I urge that supplications, prayers, intercessions and thanksgivings be made for all men...This is good, and it is acceptable in the sight of God our Saviour...\" Why does Paul ask that we pray and make supplication for others if Jesus' mediation disallows our mediation? (by the power of Jesus' saving act on the cross) What good will our prayers do if Jesus' mediation excludes our intercession and action? Jesus is the primary mediator but others can intercede (Colossians 1:24, 1 Corinthians 3:9). This is why Catholics pray to Mary and the saints, as Paul intended--that is to say we ask them for their prayers just as you ask those living on earth to pray for you. Our intercession takes away nothing from the glory of Christ.\n \n You said that you were inspired by Luther going against everything that the Catholic Church said was right. That was the main problem with Luther. He ended up going against everything in the Catholic Church. He didn't simply go against practices that he felt were not in line with (Catholic) Christian teaching. He ended up going against 1500 years of constant teaching on theology, faith, and morals. That is something you should think about. How did the Church get it wrong all those years? And how did the Church founded by Jesus himself get it wrong? How did the Church get it wrong when Jesus told it that the \"gates of hell would not prevail against it?\" Luther all of a sudden came up with the right theology????????And then, of course, Calvin came up with the right theology, Zwingli did, John Wesley did, Henry V did, etc. \n \n I can't remember where I read this or I would cite the author--The events of that time are often called the Reformation. But they would be more accurately called a revolution. Re-form implies that one will return to a form already in place--not invent a totally new form. If one is going to return to a form then what form was there originally? And where did it come from?", 
   {
    "unicode_changes_made": true
   }, 
   112786, 
   null, 
   1114659180.0
  ], 
  [
   113262, 
   null, 
   "Voice Of Reason", 
   "I have been going to Confession since I made my First Communion when i was 6 years old and have no problem with it at all.........It is considered a sacrament in the catholic religion...........\n \n Why does it bother people who are not even catholic?", 
   {}, 
   113257, 
   null, 
   1114660500.0
  ], 
  [
   113364, 
   null, 
   "trebor", 
   "I have been going to Confession since I made my First Communion when i was 6 years old and have no problem with it at all.........It is considered a sacrament in the catholic religion...........\n \n Why does it bother people who are not even catholic?\n\n \n It doesn't bother me. However, those people who wish to claim that Catholics are 'true christians' use anything they can to try to push their viewpoint across.", 
   {}, 
   113262, 
   null, 
   1114697640.0
  ], 
  [
   115058, 
   null, 
   "Voice Of Reason", 
   "It doesn't bother me. However, those people who wish to claim that Catholics are 'true christians' use anything they can to try to push their viewpoint across.\n\n \n Well you can believe as you want but Roman Catholics believed that Jesus Christ through Peter who was the first Pope founded the RCC...........", 
   {}, 
   113364, 
   null, 
   1114997700.0
  ], 
  [
   115209, 
   null, 
   "Alan Ryan", 
   "It doesn't bother me. However, those people who wish to claim that Catholics are 'true christians' use anything they can to try to push their viewpoint across.\n\n \n It's not true that Catholics \"use anything they can\" to validate and to propagate their belief system.\n \n Sure, they have religious doctrines which they believe have a theological authority and they reject some bits of other versions of Christianity on the grounds that the Catholic Church is the one true \"keeper of the flame\".\n \n These doctrines can be and are attacked by rationalists; in which case, a catholic apologist would have to answer rational objections on the basis of rational arguments or retreat behind a barrier of \"faith\" where reasoned enquiry cannot follow.\n \n I'm not trying to defend Catholicism here, but I am trying to give an impartial view of where that religion stands in relation to your ill thought out generalisation.", 
   {}, 
   113364, 
   null, 
   1115030460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Great pick for Pope if your conservative...", 
  "url": "http://www.4forums.com/political/religion-debates/4877-great-pick-pope-if-your-conservative.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4877, 
  "discussion_files": [
   [
    "20020.html", 
    "http://www.4forums.com/political/religion-debates/4877-great-pick-pope-if-your-conservative-print.html"
   ], 
   [
    "20021.html", 
    "http://www.4forums.com/political/religion-debates/4877-great-pick-pope-if-your-conservative-3-print.html"
   ], 
   [
    "20022.html", 
    "http://www.4forums.com/political/religion-debates/4877-great-pick-pope-if-your-conservative-2-print.html"
   ]
  ], 
  "identifier": 4877
 }
]