[
 [
  [
   110206, 
   null, 
   "gamehuis", 
   "Let the debates and/or flames begin:\n \n http://news.bbc.co.uk/1/hi/england/hampshire/4466855.stm", 
   {
    "post_info": {
     "post_title": "A new 'Terri Chiavo' case"
    }
   }, 
   null, 
   null, 
   1114095960.0
  ], 
  [
   110285, 
   null, 
   "Duo_Maxwell", 
   "what does the United Kingdom law state about this?", 
   {}, 
   110206, 
   null, 
   1114107300.0
  ], 
  [
   110615, 
   null, 
   "snakespit", 
   "So just what is the benefit for prolonging the inevitable in this case? This baby would not be alive without extensive medical intervention up until this date.", 
   {}, 
   110285, 
   null, 
   1114142280.0
  ], 
  [
   111156, 
   null, 
   "WhiteFalcon", 
   "So just what is the benefit for prolonging the inevitable in this case? This baby would not be alive without extensive medical intervention up until this date.\n\n \n \n Exactly. \"Let him die\", because there is no point in trying to \"have him live\".", 
   {}, 
   110615, 
   null, 
   1114241820.0
  ], 
  [
   111182, 
   null, 
   "Clive14", 
   "what does the United Kingdom law state about this?\nAFAIK the law states that doctors can decide when it is no longer in the patient's interests to sustain his or her life, but that next of kin consent must be obtained. When the doctors and next of kin cannot agree, such as in this case, then a court is given the task of deciding whether the doctors are right or not. In this case it ruled they were.\n \n It received a lot of media coverage (first time around), but we thankfully do not suffer a large rabid religious fundamentalist movement here in the UK, so the general consensus was that it was a very sad case, and we could understand why the parents didn't want to let go, but the doctors were right.", 
   {}, 
   110285, 
   null, 
   1114252020.0
  ], 
  [
   112247, 
   null, 
   "gnojek", 
   "There are hundreds of cases simlar to the Terry Shiavo thing every year in the US.\n \n I think the only reason it became sensationalized was because of the nature of the dispute between the parents and the husband, and the few facts that could have been spun to make the husband out to be a villian. \n \n Put that together with the video clips and you have a news story.\n \n Put the news stories together with eager politicians and you have the farce that we saw.\n \n The Terry Schiavo case, as far as she was concerned, was far from unique.\n \n The fact that there is another case like it is no surprise.", 
   {}, 
   111182, 
   null, 
   1114473420.0
  ], 
  [
   112283, 
   null, 
   "Diogenes99", 
   "He said that if she should stop breathing all treatment up to, but not including, intubation and ventilation, would be in Charlotte's best interests, \"but nothing further\".\n\n It doesn't sound to me like the baby would last two weeks, as Terri did when she fought for her life. There's a big difference between a ventilator and a feeding tube.", 
   {}, 
   112247, 
   null, 
   1114478220.0
  ], 
  [
   112302, 
   null, 
   "gnojek", 
   "It doesn't sound to me like the baby would last two weeks, as Terri did when she fought for her life. There's a big difference between a ventilator and a feeding tube.\n\n What is it?\n \n They both do by machine what is normally done by a properly functioning body.\n \n But the type of machine keeping you alive isn't the point. \n Steven Hawking can't live without a feeding tube but they keep his XXX alive.\n \n If someone is conscious but can't breathe on their own, their life would also be prolonged. This is the case with most heart bypass surgeries.\n \n This case with the baby though is like so many other cases.\n It most closely resembles this case:\n http://www.foxnews.com/story/0,2933,151448,00.html\n \n \nSun Hudson (search) was born Sept. 25 with thanatophoric dysplasia (search), an incurable and fatal form of dwarfism. Doctors said his tiny lungs would never fully grow and that he would never breathe on his own.\n \n Hudson's mother, Wanda, put up a fight when doctors advised removing Sun from a respirator. She said she did not believe in sickness or death.\n \n But on March 15, a Texas law signed by then-Gov. George W. Bush (search) in 1999 allowed the hospital to go ahead and take Sun off the respirator in defiance of Wanda Hudson's wishes.\n\n and true to Fox News style:\n \nBut some experts said the two cases are quite different.\n\n \n http://seattletimes.nwsource.com/html/nationworld/2002215324_texaslaw22.html\n \n In 1999, then-Gov. Bush signed the Advance Directives Act, which lets a patient's surrogate make life-ending decisions on his or her behalf. The measure also allows Texas hospitals to disconnect patients from life-sustaining systems if a physician, in consultation with a hospital bioethics committee, concludes that the patient's condition is hopeless.\n \n Bioethicists familiar with the Texas law said yesterday that if the Schiavo case had occurred in Texas, her husband would be the legal decision-maker and, because he and her doctors agreed that she had no hope of recovery, her feeding tube would be disconnected. \n\n I guess some other experts disagree. :)", 
   {}, 
   112283, 
   null, 
   1114481280.0
  ], 
  [
   112324, 
   null, 
   "fracas", 
   "as i see it there are two major difference between this baby and teri schiavo\n teri's was controversial because her desire to die instead of being fed was witnessed by her husband. meanwhile, her family wanted to assume her care and did not acknowledge such sentiment from her. who do you believe? husband or parents/siblings? the federal government intervened to allow the family legal recourse in federal courts. the government did not say to keep her alive indefinitely, only until legal options explored, and medical diagnoses reviewed. the fed decision actually empower individuals, in this case the parents, to have access to government/judicial recourses to settle differences when it comes to life and death.\n the baby case is different because the government has ruled the baby should not be kept alive. the government is allowing the doctors to let her die. this situation empowers the government because UK healthcare is nationalized/government run. ( not necessary in this case but if you don't think cost benefit analysis aren't done in the UK system you are ignorant of how things work there to maintain affordability.) most brits have little option in healthcare, and that option has more power over them as demonstrated by this case than health care in the US.\n \n btw, the texas law is a good one. no responsibility to render futile care. however, the patient and family still have the option of seeking alternative care providers. if the doctors you have said things are futile, you are not subjected by his opinion/recommendation and can find another doctor who will agree to provide the care sought. similar concept has been tested in court when terminal cancer patients have successfully sued their insurance/hmo for experimental phase 1 trials. phase 1 trials are not for therapy but are experiments to test toxicity. thus phase 1 trials are futile care meant to benefit the research, not the patient.\n \n the key difference is how much power you want the government to have over your health care: affordable rationed cared, or expensive freedom to be cared.", 
   {}, 
   112302, 
   null, 
   1114486860.0
  ], 
  [
   112431, 
   null, 
   "Jo Bennett", 
   "If you think cost was the overriding factor in this case I would ask you to present some evidence. Doctors here take a hippocratic oath the same as everywhere else. If you're going to impugn their characters then you'd better have some damn good proof.", 
   {}, 
   112324, 
   null, 
   1114513920.0
  ], 
  [
   112434, 
   null, 
   "Clive14", 
   "...the baby case is different because the government has ruled the baby should not be kept alive. the government is allowing the doctors to let her die. this situation empowers the government because UK healthcare is nationalized/government run.\nI fail to see how this \"empowers\" the government, nor how the government ruled on anything here.Perhaps you could explain?\n \n \n( not necessary in this case but if you don't think cost benefit analysis aren't done in the UK system you are ignorant of how things work there to maintain affordability.)\nWe Brits are very aware of this issue: it is known as the \"NHS lottery\": each area of the country chooses what treatments to spend it's NHS budget on, and which not to spend on. If you are unlucky enough to live in the wrong area with the wrong condition, you will get substandard treatment.\n \n \nmost brits have little option in healthcare, and that option has more power over them as demonstrated by this case than health care in the US.\nNot sure I'd agree with that. Everyone in Britain has the option of paying extra for private healthcare, or healthcare insurance if they want it and can afford it. We just have a minimum level of healthcare provided to everyone that is more than adequate for most people most of the time that few bother unless health insurance is offered as a job perk.\n \n \nbtw, the texas law is a good one. no responsibility to render futile care. however, the patient and family still have the option of seeking alternative care providers.\nAssuming they can afford it: the same applies here in the UK. Pay enough money and you will find some doctor willing to keep your relative alive by artificial means.\n \n \n...the key difference is how much power you want the government to have over your health care: affordable rationed cared, or expensive freedom to be cared.\nThis is a very American view. Many Americans seem unhealthily obsessed with how much power their government has for all the wrong reasons.", 
   {}, 
   112324, 
   null, 
   1114514700.0
  ], 
  [
   112438, 
   null, 
   "Jo Bennett", 
   "The postcode lottery is a myth to a great extent. You will get treatment for the vast majority of ilnesses everywhere. Things subject to discretion tend to be non-essentials like IVF treatment, the funding of which does vary. NHS trusts generally spend the money necessary to treat any medical condition. My dad suffers from a chronic motor-neurone condition treated by monthly doses of a large amount of immunoglobulin, which costs in the order of thousands every year, but while alternative treatments have been tried to see if the same effect can be achieved for less cost, which I would hope would happen whoever was paying, there has never been any suggestion that the NHS would not pay. My dad would certainly find it very difficult to get private health insurance.", 
   {}, 
   112434, 
   null, 
   1114516260.0
  ], 
  [
   112439, 
   null, 
   "Clive14", 
   "A point well made Jo. I have a friend with hypogammagobulin anemia (a genetic condition) and he too need regular injections of immunoglobulin that cost the NHS thousands a year to provide. For him too there has never been any question of the NHS not paying. He has had those injections for over thirty years now and hopefully will continue to receive them for many more years (unless some better method of treatment is found).\n \n Oh and thanks for correcting my \"NHS lottery\" gaff: it is of course the postcode lottery as you say.", 
   {}, 
   112438, 
   null, 
   1114516920.0
  ], 
  [
   112448, 
   null, 
   "fracas", 
   "If you think cost was the overriding factor in this case I would ask you to present some evidence. Doctors here take a hippocratic oath the same as everywhere else. If you're going to impugn their characters then you'd better have some damn good proof.\n\n strawman. \n \nthe baby case is different because the government has ruled the baby should not be kept alive. the government is allowing the doctors to let her die. this situation empowers the government because UK healthcare is nationalized/government run. ( not necessary in this case but if you don't think cost benefit analysis aren't done in the UK system you are ignorant of how things work there to maintain affordability.) most brits have little option in healthcare, and that option has more power over them as demonstrated by this case than health care in the US.\n\n i suggest you read what was posted rather than fabricating what was not. and as for rationing of healthcare in the UK system, that is obvious.\n \n \nI fail to see how this \"empowers\" the government, nor how the government ruled on anything here.Perhaps you could explain?\n\n governments already has power of punishment in crimes. this extend their power over the individual with regard to their health.\n \n \nWe Brits are very aware of this issue: it is known as the \"NHS lottery\": each area of the country chooses what treatments to spend it's NHS budget on, and which not to spend on. If you are unlucky enough to live in the wrong area with the wrong condition, you will get substandard treatment.\n \n Not sure I'd agree with that. Everyone in Britain has the option of paying extra for private healthcare, or healthcare insurance if they want it and can afford it. We just have a minimum level of healthcare provided to everyone that is more than adequate for most people most of the time that few bother unless health insurance is offered as a job perk.\n\n what percentage of brits seek private care?\n \n \nAssuming they can afford it: the same applies here in the UK. Pay enough money and you will find some doctor willing to keep your relative alive by artificial means.\n\n actually that is unlikely to happen here or there. \n \n \nThis is a very American view. Many Americans seem unhealthily obsessed with how much power their government has for all the wrong reasons.\n\n yes, this is true\n \n \nThe postcode lottery is a myth to a great extent. You will get treatment for the vast majority of ilnesses everywhere. Things subject to discretion tend to be non-essentials like IVF treatment, the funding of which does vary. NHS trusts generally spend the money necessary to treat any medical condition. My dad suffers from a chronic motor-neurone condition treated by monthly doses of a large amount of immunoglobulin, which costs in the order of thousands every year, but while alternative treatments have been tried to see if the same effect can be achieved for less cost, which I would hope would happen whoever was paying, there has never been any suggestion that the NHS would not pay. My dad would certainly find it very difficult to get private health insurance.\n\n \n never suggested that there was as limit placed on treatment of rare disease. but the issue with this baby is about one aspect of the healthcare system when it comes to \"futile\" care and who determines what can/should be done. is it right that a third party payor restrict this wheather it be the national health service or an HMO.", 
   {}, 
   112434, 
   null, 
   1114521540.0
  ], 
  [
   112622, 
   null, 
   "Diogenes99", 
   "as i see it there are two major difference between this baby and teri schiavo\n teri's was controversial because her desire to die instead of being fed was witnessed by her husband. meanwhile, her family wanted to assume her care and did not acknowledge such sentiment from her. who do you believe? husband or parents/siblings? the federal government intervened to allow the family legal recourse in federal courts. the government did not say to keep her alive indefinitely, only until legal options explored, and medical diagnoses reviewed. the fed decision actually empower individuals, in this case the parents, to have access to government/judicial recourses to settle differences when it comes to life and death.\nAgreed. I have several problems with the way the Terri Schiavo case was handled.\n \n 1. Michael should not have been her guardian. Normally the spouse is a good default option, but any sentient adult knows of cases where it would be a bad idea. Would he be the guardian if the couple had filed for divorce, even though the divorce was not yet final? I think not. Once Michael moved on with his life, moving in with his girlfriend and starting a family with her, there is not a court in the country that would deny Terri a divorce. But Judge Greer made sure there was no one to speak for her.\n \n 2. The question of Terri's wishes was decided on hearsay evidence so flimsy that it would not convict anyone of jaywalking, much less the death penalty. Michael and two of his family said Terri would wish to die under the circumstances; Terri's family produced sworn affadavits from friends of Terri that Michael had several times stated during the first few years (before the malpractice settlement money came through) that he (Michael) had no idea what Terri would have wanted.\n \n 3. Terri's execution was brutal, cruel, and inhumane. Her mother was denied any opportunity to comfort her dying daughter with water to wet her lips or provide a sliver of ice for her swollen tongue -- was the judge afraid Terri might choke to death? I certainly wouldn't want to be executed that way, and would much prefer the kinder and gentler hot shot.\n \n I agree with the sentiments of one of the disabled person groups: Don't pull the plug until I am (a) terminal, (b) in great pain, and (c) no one wants to come visit me.\n \n \nbtw, the texas law is a good one. no responsibility to render futile care. however, the patient and family still have the option of seeking alternative care providers. if the doctors you have said things are futile, you are not subjected by his opinion/recommendation and can find another doctor who will agree to provide the care sought. similar concept has been tested in court when terminal cancer patients have successfully sued their insurance/hmo for experimental phase 1 trials. phase 1 trials are not for therapy but are experiments to test toxicity. thus phase 1 trials are futile care meant to benefit the research, not the patient.\nAgreed again. In terminal cases heroic efforts do not extend life, they only extend the dying process. Moreover, public funds have to be expended to provide the greatest good for the greatest number. If it comes to a choice between providing a heart transplant for a convicted murderer serving life without parole and providing vaccinations for 10,000 children, I'll vote for the kids every time.", 
   {}, 
   112324, 
   null, 
   1114546680.0
  ], 
  [
   113179, 
   null, 
   "gnojek", 
   "\n This is a very American view. Many Americans seem unhealthily obsessed with how much power their government has for all the wrong reasons.\n\n Yeah, \"we\" don't seem to care so much about the government's power to invade and conquer at will, but god forbid the government tells you how much pollution you can release into the air and water.\n \n \"We\" don't seem to care how many foreign governments we covertly topple, but don't tell me that I can't shoot someone on the street just because I feel threatened (at least in Fla. now).\n \n Yeah, we don't like government involvement in our private lives, we like government involvement in other people's private lives.\n \n We wouldn't want the govt telling us that we had to live on a machine, but we'll gladly do it to someone else.\n \n We wouldn't want the govt telling us who we can and cant' marry, but we'll gladly vote in laws that do just that to others.\n \n In the immortal words of Yakoff Smirnoff \"What a country!!\"", 
   {}, 
   112434, 
   null, 
   1114646640.0
  ], 
  [
   130408, 
   null, 
   "Batman", 
   "A severely brain-damaged baby should be allowed to die if she stops breathing, a High Court judge has ruled.\n\n Difference:This judge ruled to let the baby die if nature took it's course.\n Greer ruled that Terri should starve to death.", 
   {}, 
   112622, 
   null, 
   1117482060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A new 'Terri Chiavo' case", 
  "url": "http://www.4forums.com/political/society-debates/4886-new-terri-chiavo-case.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 4886, 
  "discussion_files": [
   [
    "5855.html", 
    "http://www.4forums.com/political/society-debates/4886-new-terri-chiavo-case-print.html"
   ], 
   [
    "5856.html", 
    "http://www.4forums.com/political/society-debates/4886-new-terri-chiavo-case-2-print.html"
   ]
  ], 
  "identifier": 4886
 }
]