[
 [
  [
   110710, 
   null, 
   "Duo_Maxwell", 
   "MTBE, the ground water pollutant that is directly linked to more diseases then we can shake a stick to passed in the energy bill. Not to mention that the bill supports ethanol, one of the few energy deficient fuel sources on the planet. \n \n How exactly is using more energy to produce less energy going to help the US get out of our energy problem?  \n \n Hopefully the Senate will realize the sheer stupidity of this bill and kill specifically ethanol as well as MTBE. \n \n http://news.yahoo.com/news?tmpl=story&u=/ap/20050422/ap_on_go_co/energy_bill\n \n I'm blaming the republicans primarily for this.", 
   {
    "post_info": {
     "post_title": "Great, energy bill screws us"
    }
   }, 
   null, 
   null, 
   1114155000.0
  ], 
  [
   110727, 
   null, 
   "daewoo", 
   "Now that the bush administration has accepted and acknowledged the peak oil problem, they have to look like they are doing somethign about it. The problemis that when you take a hard look at the alternatives, it becomes quickly apparent that there ARE no real alternatives. So, we pretend. Keep the sheep heading in the right direction.", 
   {}, 
   110710, 
   null, 
   1114160700.0
  ], 
  [
   110729, 
   null, 
   "Duo_Maxwell", 
   "but at least we could stay away from energy deficient fuel sources, ethanol seems like a kickback rather then any way of producing energy. Apaprently there's a 55,400 btu loss for every gallon of ethanol produced.", 
   {}, 
   110727, 
   null, 
   1114161480.0
  ], 
  [
   110748, 
   null, 
   "daewoo", 
   "What out there is better?", 
   {}, 
   110729, 
   null, 
   1114165560.0
  ], 
  [
   110755, 
   null, 
   "Clive14", 
   "What out there is better?\nI think those clever people at Cern should accept that they have lost Higg Boson's particle and let him buy a new one rather than endless looking for it. They could then concentrate upon finding a way to make radioactive waste non radioactive. Then we could build lots and lots of nuclear power stations and everyone could have all the energy they wanted. Hurrah!\n \n (I'm off back to my cell now: it's all padded and warm)", 
   {}, 
   110748, 
   null, 
   1114166640.0
  ], 
  [
   110873, 
   null, 
   "Duo_Maxwell", 
   "What out there is better?\n\n \n There has to be something better then using a inefficent fuel source to produce a deficient fuel source which is just as inefficent in fuel to energy conversion. This is retarded. Minus well just burn the petro as gas instead of wasting in on ethanol.", 
   {}, 
   110748, 
   null, 
   1114196580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Great, energy bill screws us", 
  "url": "http://www.4forums.com/political/politics-debates/4897-great-energy-bill-screws-us.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4897, 
  "discussion_files": [
   [
    "31005.html", 
    "http://www.4forums.com/political/politics-debates/4897-great-energy-bill-screws-us-print.html"
   ]
  ], 
  "identifier": 4897
 }
]