[
 [
  [
   111068, 
   null, 
   "joebrummer", 
   "New Pope Launches Anti-Gay Salvo\n by Malcolm Thornberry 365Gay.com European Bureau Chief\n \n Posted: April 22, 2005 5:01 pm ET \n (Vatican City) Less than a week after becoming Pope, Benedict XVI has lashed out at Spain following the passage of a same-sex marriage bill in Parliament.\n \n Spain's lower house on Thursday approved legislation to legalize gay marriage. (story) It is expected to gain approval in the upper chamber and become law next month.\n \n On Friday, the Vatican shot back.\n \n The Pope, speaking through Cardinal Alfonso Lopes Trujill, head of the Pontifical Council on the Family, said Roman Catholics should be prepared to lose their jobs rather than co-operate with the law.\n \n Trujill, in an interview with Corriere della Sera newspaper said Spaniards in all walks of life - especially government officials - are duty bound by Catholicism to oppose accepting same-sex couples.\n \n \"We cannot impose the iniquitous on people,\" he told the paper.\n \n \"On the contrary, precisely because they are iniquitous the Church makes an urgent call for freedom of conscience and the duty to oppose.\n \n \"A law as profoundly iniquitous as this one is not an obligation, it cannot be an obligation. One cannot say that a law is right simply because it is law.\"\n \n When asked if this were not discrimination Trujill said no, adding that the Church does not discriminate against gays. He then told the paper that homosexuals need help.\n \n \"The Church does not accept homosexuals being the target of jokes, insults and inhumane expressions. They are people who deserve all our love, our support and our aid.\"\n \n The bill to allow gay marriage was relatively short, saying that \"Matrimony shall have the same requisites and effects regardless of whether the persons involved are of the same\n \n Same-sex marriage is legal in Holland and Belgium. Most other European Union countries have some provision for recognizing those in committed same-sex relationships. In December Britain will open its registry for Civil Unions. \n \n In North America most of Canada has legalized same-sex marriage and a bill to expand that throughout the country is currently before Parliament. Massachusetts is the only US state to legalize same-sex marriage, although Civil Unions are legal in Vermont and Connecticut, and several other states including California have domestic partner registries.", 
   {
    "post_info": {
     "post_title": "The New Pope makes his first moves on gays"
    }
   }, 
   null, 
   null, 
   1114223640.0
  ], 
  [
   111215, 
   null, 
   "wsm2506", 
   "New Pope Launches Anti-Gay Salvo\n by Malcolm Thornberry 365Gay.com European Bureau Chief\n \n Posted: April 22, 2005 5:01 pm ET \n (Vatican City) Less than a week after becoming Pope, Benedict XVI has lashed out at Spain following the passage of a same-sex marriage bill in Parliament.\n \n Spain's lower house on Thursday approved legislation to legalize gay marriage. (story) It is expected to gain approval in the upper chamber and become law next month.\n \n On Friday, the Vatican shot back.\n \n The Pope, speaking through Cardinal Alfonso Lopes Trujill, head of the Pontifical Council on the Family, said Roman Catholics should be prepared to lose their jobs rather than co-operate with the law.\n \n Trujill, in an interview with Corriere della Sera newspaper said Spaniards in all walks of life - especially government officials - are duty bound by Catholicism to oppose accepting same-sex couples.\n \n \"We cannot impose the iniquitous on people,\" he told the paper.\n \n \"On the contrary, precisely because they are iniquitous the Church makes an urgent call for freedom of conscience and the duty to oppose.\n \n \"A law as profoundly iniquitous as this one is not an obligation, it cannot be an obligation. One cannot say that a law is right simply because it is law.\"\n \n When asked if this were not discrimination Trujill said no, adding that the Church does not discriminate against gays. He then told the paper that homosexuals need help.\n \n \"The Church does not accept homosexuals being the target of jokes, insults and inhumane expressions. They are people who deserve all our love, our support and our aid.\"\n \n The bill to allow gay marriage was relatively short, saying that \"Matrimony shall have the same requisites and effects regardless of whether the persons involved are of the same\n \n Same-sex marriage is legal in Holland and Belgium. Most other European Union countries have some provision for recognizing those in committed same-sex relationships. In December Britain will open its registry for Civil Unions. \n \n In North America most of Canada has legalized same-sex marriage and a bill to expand that throughout the country is currently before Parliament. Massachusetts is the only US state to legalize same-sex marriage, although Civil Unions are legal in Vermont and Connecticut, and several other states including California have domestic partner registries.\n\n \n Yet another example of the Roman Catholic church attempting to control other sovereign nation. They have yet to understand that this is no longer medival Europe.", 
   {}, 
   111068, 
   null, 
   1114271040.0
  ], 
  [
   111226, 
   null, 
   "Voice Of Reason", 
   "Joe, this is no surprise....This Pope is a very conservative one and like it or not the Roman Catholic church and most churches believe the sexual act that gays commit a sin as they would any other sin.........The church believes love the sinner but hate the sin..........\n \n That will never change my friend", 
   {}, 
   111215, 
   null, 
   1114277880.0
  ], 
  [
   111244, 
   null, 
   "jitobear", 
   "Joe, this is no surprise....This Pope is a very conservative one and like it or not the Roman Catholic church and most churches believe the sexual act that gays commit a sin as they would any other sin.........The church believes love the sinner but hate the sin..........\n \n That will never change my friend\n\n \n They are still out of line to expect governments to impose their theology on population that is not all Catholic.", 
   {}, 
   111226, 
   null, 
   1114282800.0
  ], 
  [
   111285, 
   null, 
   "joebrummer", 
   "Joe, this is no surprise....This Pope is a very conservative one and like it or not the Roman Catholic church and most churches believe the sexual act that gays commit a sin as they would any other sin.........The church believes love the sinner but hate the sin..........\n \n That will never change my friend\n\n \n \n I wouldn't say most cjurches, because you cannot prove that. There is a long list of churches that are accepting of gay folks.", 
   {}, 
   111226, 
   null, 
   1114289880.0
  ], 
  [
   111403, 
   null, 
   "Voice Of Reason", 
   "I wouldn't say most cjurches, because you cannot prove that. There is a long list of churches that are accepting of gay folks.\n\n \n And so does the Catholic Church.........They accept the homosexual but still condemn the homosexual act as they would any other sin.......", 
   {}, 
   111285, 
   null, 
   1114306740.0
  ], 
  [
   111427, 
   null, 
   "Duo_Maxwell", 
   "And so does the Catholic Church.........They accept the homosexual but still condemn the homosexual act as they would any other sin.......\n\n \n Then why do some Catholic Church deny gays communion? \n \n HARD QUESTION ALERT: Vor, run to your bunker of mindless thinking! Be safe, Don't consider the actual facts! Argh! RUN! :p", 
   {}, 
   111403, 
   null, 
   1114312020.0
  ], 
  [
   111437, 
   null, 
   "Voice Of Reason", 
   "Then why do some Catholic Church deny gays communion? \n \n HARD QUESTION ALERT: Vor, run to your bunker of mindless thinking! Be safe, Don't consider the actual facts! Argh! RUN! :p\n\n \n I don't know why I am for responding to your tripe but they don't as long as they go to confession and confess their sins and the sin they commit is the gay sex act they participate in.................Its the same with any Catholic and any sin little man", 
   {}, 
   111427, 
   null, 
   1114313700.0
  ], 
  [
   111446, 
   null, 
   "Duo_Maxwell", 
   "I don't know why I am for responding to your tripe\n\n \n Well, you fled like a sad coward from threads you were refuted on. Now i'm just mocking you. Btw:, does your bunker have like 50 spare keyboards? After all, you must keep wearing out the period on your keyboards at a phenonal rate.\n \n \n\n but they don't as long as they go to confession and confess their sins and the sin they commit is the gay sex act they participate in\n\n \n WRONG.\n http://ncronline.org/NCR_Online/archives2/2004b/061804/061804m.htm\n http://www.gaywired.com/article.cfm?section=9&id=3309\n http://www.soulforce.org/dc1102/dc_detroitpress.shtml", 
   {}, 
   111437, 
   null, 
   1114314540.0
  ], 
  [
   111450, 
   null, 
   "daewoo", 
   "I don't know why I am for responding to your tripe but they don't as long as they go to confession and confess their sins and the sin they commit is the gay sex act they participate in.................Its the same with any Catholic and any sin little man\n\n \n No, it is not. There re several things in the catholic church that essentially get you excommunicated, at least in actions if not in words. Besides being gay, you can be denied communion fro being divorced, for disagreeing with the concept of infallibility of the church, for living with somebody you are not married to, etc...\n \n According to the church, confession only wipes away your sins if you stop committing that sin. If you go into confession and confess a sin, despite the fact that you plan to walk right out the door and continue doing it, the confession effectively does not count. If you confess a sin but are not truly repentant, the confession effectively does not count.\n \n In order to obtain absolution from the church, you have to be repentant, and you have to try not to do it again.", 
   {}, 
   111437, 
   null, 
   1114315080.0
  ], 
  [
   111465, 
   null, 
   "joebrummer", 
   "I don't know why I am for responding to your tripe but they don't as long as they go to confession and confess their sins and the sin they commit is the gay sex act they participate in.................Its the same with any Catholic and any sin little man\n\n \n Oh please I am gonna puke reading this yuck!", 
   {}, 
   111437, 
   null, 
   1114321860.0
  ], 
  [
   111466, 
   null, 
   "joebrummer", 
   "The catholic church sounds like Studio 69, to get past the red velvet rope you must be.......[fill in the blank here]", 
   {}, 
   111465, 
   null, 
   1114321980.0
  ], 
  [
   111468, 
   null, 
   "daewoo", 
   "The catholic church sounds like Studio 69, to get past the red velvet rope you must be.......[fill in the blank here]\n\n \n Yep, thats about it. Like so many other religons in history, the catholic church has done an excellent job convincing their followers that the price of disobediance is eternal damnation, since the church holds the keys to heaven.\n \n They used to be more practical about such things. If somebody did not wish to perform an act of contrition (the acts of contrition handed down by priests used to be barbaric), they could simply pay for absolution from their sins. In the event that you paid for absolution, it did not matter if you were repentent or not. Absolution bought with cash was always valid.", 
   {}, 
   111466, 
   null, 
   1114323480.0
  ], 
  [
   111476, 
   null, 
   "Voice Of Reason", 
   "No, it is not. There re several things in the catholic church that essentially get you excommunicated, at least in actions if not in words. Besides being gay, you can be denied communion fro being divorced, for disagreeing with the concept of infallibility of the church, for living with somebody you are not married to, etc...\n \n According to the church, confession only wipes away your sins if you stop committing that sin. If you go into confession and confess a sin, despite the fact that you plan to walk right out the door and continue doing it, the confession effectively does not count. If you confess a sin but are not truly repentant, the confession effectively does not count.\n \n In order to obtain absolution from the church, you have to be repentant, and you have to try not to do it again.\n\n \n Hey, I am a lifetime Catholic and went to Catholic school for 12 years so don't tell me about that.......\n \n If a Gay man goes to confession and tells the priest his sins and promises not to commit them again his sins are forgiven and he can receive the Communion..........", 
   {}, 
   111450, 
   null, 
   1114328340.0
  ], 
  [
   111477, 
   null, 
   "daewoo", 
   "Hey, I am a lifetime Catholic and went to Catholic school for 12 years so don't tell me about that.......\n \n If a Gay man goes to confession and tells the priest his sins and promises not to commit them again his sins are forgiven and he can receive the Communion..........\n\n \n asuming that you are truly repentent and MEAN IT when you promise not to do it again.\n \n So you are saying that a gay guy, married to another gay guy, is going to walk into church one day, repent, and mean it? \n \n Put down the crack pipe. It has destroyed your brain.", 
   {}, 
   111476, 
   null, 
   1114328760.0
  ], 
  [
   111519, 
   null, 
   "joebrummer", 
   "Hey, I am a lifetime Catholic and went to Catholic school for 12 years so don't tell me about that.......\n \n If a Gay man goes to confession and tells the priest his sins and promises not to commit them again his sins are forgiven and he can receive the Communion..........\n\n Funny, So am I. I went to Catholic grammar and high school and I disagree with you on this one. The Catholic churches stand on this is that gays should get \"treatment\". Sick stuff. I am gay, I don't need treatment for being my self.", 
   {}, 
   111476, 
   null, 
   1114361340.0
  ], 
  [
   111539, 
   null, 
   "Fishbulb", 
   "If a Gay man goes to confession and tells the priest his sins and promises not to commit them again his sins are forgiven and he can receive the Communion..........\n\n \n So you're saying the only way for a homosexual to be accepted into the Church is to not be homosexual?", 
   {}, 
   111519, 
   null, 
   1114366140.0
  ], 
  [
   111548, 
   null, 
   "Nurglitch", 
   "That's the problem: the Catholic Church makes its distinction between who you are and what you do according to an over-generalized set of premises, a mistake that those of us who are homosexual (or bisexual) or who understand the experience of being homosexual (or bisexual) cannot help but avoid.\n \n While it's nice that the Catholic Church realize people are homosexual (or heterosexual or bisexual or neuter) because of their sexuality, it's annoying that the Church regards us as disordered and worthy of pity rather than as different and worthy of the respect everyone is entitled to. \n \n Asking a homosexual to restrict themselves to heterosexual sex is like asking a heterosexual to restrict themselves to homosexual sex - demanding people act against their own nature.\n \n So it's basically a conflict of values - Because the Catholic Church regards non-heterosexualities as being deviations away from a norm, rather than as simple being variants of that form, the satisfaction of those sexualities is pathologized. \n \n The \"Love the sinner, hate the sin\" approach gets it wrong precisely because it starts from the assumption that sex for reproductive purposes is the only moral form of sex. \n \n This assumption ignores the multiple purposes of sex and the multiple expressions of those purposes. \n \n This assumption, interestingly, is a fallacy found throughout the work of the Catholic Churche's favourite philosopher: Aristotle (as channeled through Thomas Aquinas). \n \n Aristotle's biggest mistake, as it is commonly called by those in the know, is arguing that something is best when it serves only one purpose because its entire design is devoted to that single purpose.\n \n But, as common sense suggests in the adage \"Kill two birds with one stone\", the number of purposes to which something may be put is not necessarily related to how well those purposes are accomplished. \n \n When we recognize that sex has a variety of purposes as well as reproduction, and that those purposes are defined in relation to the particular sexuality of a person, we see that homosexuals committing homosexual acts is better than homosexuals committing heterosexual acts, just like heterosexuals committing heterosexual acts is better than heterosexuals committing homosexual acts. \n \n I put it down to the ancient doctrine that equality is sameness, which has since been recognized as ******** due to the fallacy of over-generalization. Equality, as moral equality, is better seen as equivalence. \n \n If we are to properly evaluate the morality of someone's actions, we must first recognize who it is that performs those actions rather than applying some over-generalized one-size-fits-heterosexuals moral code.\n \n Jesus fortunately recognized this, being a student of rabbinical thought. But Pauline Christians - thanks to their Greek and Roman influences - don't.", 
   {}, 
   111539, 
   null, 
   1114370220.0
  ], 
  [
   111582, 
   null, 
   "JustineCredible", 
   "Thankfully, I was raised by a Catholic mother who spared me the indignation of the Church. She was mindful to point out many if the Churches hypocracies. Let me do the same for you here.\n \n First off the RCC says that they welcome gays, but we all know that in fact that a homosexual who practices gay sex is most definitely NOT welcome in the RCC. \n Secondly, the RCC condemns such acts of violence and abuse towards children, except when it comes to those acts committed by their own priests. \n Thirdly, \"In October of 1986, John Paul II assembled 200 leaders of the world's great religions in Assisi, Italy ... `to be together and pray' on behalf of peace. ... On that fall day in the birthplace of St. Francis, John Paul joined a circle with the Dalai Lama, Orthodox bishops, Hindu swamis and a Crow Indian medicine man in full feathered headdress, saying little but offering a powerful symbol of solidarity. ... Cardinal Joseph Ratzinger, the pope's top doctrinal officer, told a German newspaper: `This cannot be the model!' John Paul, however, insisted on the propriety of the event: `Diversity is the nature of the human family. ... We must go beyond [Catholicism] to persons of goodwill who do not share our faith.' It was a striking overture, considering Catholicism declared in 1217 at the Fourth Lateran Council that `there is indeed one universal church of the faithful, outside of which no one at all is saved.'\" {reprinted from this mornings \"Meet the Press\" on NBC}\n \n In this we see the division of ideals between John Paul II and Benedict XVI. \n \n We must also remember that Benedict, before he was elected Pope, was the leader of the group formerly known as the Inquisition, now known as the Congregation of the Doctrine of the Faith. \n \n I predict only a more tightfisted Papacy with Benedict at the helm.", 
   {}, 
   111548, 
   null, 
   1114376820.0
  ], 
  [
   111865, 
   null, 
   "jyoshu", 
   "That's the problem: the Catholic Church makes its distinction between who you are and what you do according to an over-generalized set of premises, a mistake that those of us who are homosexual (or bisexual) or who understand the experience of being homosexual (or bisexual) cannot help but avoid.\n \n While it's nice that the Catholic Church realize people are homosexual (or heterosexual or bisexual or neuter) because of their sexuality, it's annoying that the Church regards us as disordered and worthy of pity rather than as different and worthy of the respect everyone is entitled to. \n \n Asking a homosexual to restrict themselves to heterosexual sex is like asking a heterosexual to restrict themselves to homosexual sex - demanding people act against their own nature.\n\n \n Your post here is very well-thought out. I have some issues with it however, that I'd like to point out.\n \n Catholic teaching, as well as much Christian teaching period, has to be understood in the context of belief in absolute and higher truth, and the understanding that morality comes from God, not human reason. That view is anathema to atheists, but nevertheless it is a very predomiment religious understanding of truth whether one agrees with it or not. I think many Catholics and protestants do indeed understand and know that 'being gay' is a matter of nature. The problem is that they are being expected by gay lobbyists to ignore or reinterpret 'absolute authority,' because to them, absolute authority is telling them that homosexual behavior is wrong. It's not the nature that religious people have an issue with; it's behavior. You're never going to be able to convince many religious people to give up on their view of absolute truth, which is exactly what is being expected of them in this debate. From their point of view, you might as well be asking them to turn their back on their belief that murder or child abuse is wrong. (No, I'm not saying homsexuality is like either of these issues; I'm simply saying that indeed many Catholics and the Catholic church leadership takes it just as seriously as what they consider to be sin).\n \n You say that asking a homosexual to restrict themselves to heterosexual sex is like asking a heterosexual to restrict themselves to homosexual sex, but there are two problems with this. \n \n First, it tries to put the two on the same playing field, which I don't agree with. Given that gay people comprise a small minority, probably no more than a few percent at most, it can be said that gay people aren't really all that common. I think it is just as legitimate to say that the typical sexually active person has heterosexual sex, and so heterosexual sex is the typical form. It is really the norm, and homosexual sex is the exception. It is just as legitimate to say that most people are heterosexual, and homosexual relationships fall outside of that norm, alongside other things like polygamous relationships, or inter-family relationships that are also not that common. So I don't think it's really accurate to put them side-by-side, as if homosexual relationships were alone as the only exception to the norm of heterosexual relationships.\n \n Second, I think that saying 'homosexuals restricting themselves to heterosexual sex is like asking heterosexuals to restrict themselves to homosexual sex' is to not realize how seriously Catholics take what they consider to be sin. If Catholics believed God (absolute truth, to them) held heterosexual relationships as sinful, I have no doubt that they would take a strong stance against heterosexual relationships. Remember, they DO take such a stance already when it comes to such relationships among the priesthood. \n \n So when it comes to the church taking a stand against homosexuality, or any issue for that matter, it is rarely a matter of political or prejudicial motivations. Rather it is simply a matter of them believing they are doing what is right, because to them, absolute truth holds heterosexual relationships as the only Godly standard. So I have to sort of take issue that this is a matter of the church considering gay people \"disordered.\" The issue really isn't even gay people at all. It's what they consider to be the right thing to do, and obeying God. You can of course, go against centuries of belief, as well as be in the minority world-wide and disagree with that interpretation, which is your right.\n \n \nSo it's basically a conflict of values - Because the Catholic Church regards non-heterosexualities as being deviations away from a norm, rather than as simple being variants of that form, the satisfaction of those sexualities is pathologized. \n\n \n Indeed they do consider non-heterosexualities as being deviations away from a norm, but I don't think they consider it so much of a 'pathology' as they do simply sinful simply because they view it as against God's will or outside His plan for the family structure. The mental state of gay people or anyone else isn't the issue at all for the RCC.\n \n \nThe \"Love the sinner, hate the sin\" approach gets it wrong precisely because it starts from the assumption that sex for reproductive purposes is the only moral form of sex. \n\n \n Not really. I don't think it's so much that the RCC views sex as only for reproduction (in times past they did), but rather it's a matter of homosexual sex deviating too much from what they consider the norm should be for a relationship and the family structure. Remember, there is no teaching (that I know of anyway) that forbids sex in Catholic households when reproduction isn't the intent. \n \n Again, like every other issue in regards to Catholic teaching, this has to be understood in the context of their obedience to absolute truth. To the Catholic, it's better to trust in God and let Him decide when children are conceived and born than take control of such matters. The ideal in Catholic thinking is to have sex whenever a couple wants, enjoying it, and let whatever happens happen. If children come along, great! (They are a blessing and wonderful, in Catholic thinking.) If they don't, they don't. This often seems strange to some in our post-sexual revolution culture, where pleasure has become the preferred purpose over reproduction, and sex has become such a big deal to so many people. But in the Catholic mindset, children are always considered a wonderful thing--one of the greatest blessings of life. (Hence their disdain for abortion.) So it's not a matter of sex being only for reproduction, but rather reproduction shouldn't be prevented, because it might be God's will. The RCC's stance against birth control seems extreme to it's critics, but it's really just another example of them wanting to let the will of God be. (One could argue that if God is truly all-powerful, He could over-ride birth control if He wants, but that doesn't allow for human freedom of choice, IMO.) \n \n \nThis assumption ignores the multiple purposes of sex\n\n \n In our time and culture there are only two possible \"purposes\" of sex, period: reproduction and pleasure. Can you think of any others? I doubt it. I think sexual pleasure is fine, but as a benefit it pales in comparison to the benefit and blessing of a child being born. Not even close. That's my opinion, though I think it is the more common opinion for most of the world, especially the billions of religious people world-wide. A gay couple can never achieve the first purpose (reporduction) in sexual acts with each other. They can only have the second purpose.\n \n \nWhen we recognize that sex has a variety of purposes as well as reproduction, and that those purposes are defined in relation to the particular sexuality of a person,\n\n \n Again, there aren't a 'variety' of purposes that sex has; it only has two possible ones: reproduction and pleasure. And the only way they are defined by one's 'sexuality' is that heterosexual couples are the only ones that can conceive a child with each other. Pleasure can be a purpose with any given sexuality.\n \n \nIf we are to properly evaluate the morality of someone's actions, we must first recognize who it is that performs those actions rather than applying some over-generalized one-size-fits-heterosexuals moral code.\n\n \n Then you are asking religious people to deny absolute truth and have a relative morality. 'Situational ethics.' In my opinion, it's asking too much.\n \n \nJesus fortunately recognized this, being a student of rabbinical thought. But Pauline Christians - thanks to their Greek and Roman influences - don't.\n\n \n Jesus' teachings never directly touched on homosexuality, just as it didn't on numerous things that that the church views as sinful. If we only took the red-letter record we have of His words as the only moral code (rather than other parts of the Bible as well), we could have no moral disapproval of such things as prostitution, slavery, child abuse, etc. Jesus never gave a comprehensive list of 'here's what's ok and what's not ok', because that was already in the scriptures, for all to read even in His time.", 
   {}, 
   111548, 
   null, 
   1114407360.0
  ], 
  [
   111924, 
   null, 
   "Voice Of Reason", 
   "Funny, So am I. I went to Catholic grammar and high school and I disagree with you on this one. The Catholic churches stand on this is that gays should get \"treatment\". Sick stuff. I am gay, I don't need treatment for being my self.\n\n \n Joe, can you cite a link where the Catholic Church said that? Thanks....\n \n In fact I was watching Meet the Press tonight and that very question came up and the response by the priest was to love the sinner and hate the sin like any other sin.........", 
   {}, 
   111519, 
   null, 
   1114416420.0
  ], 
  [
   111934, 
   null, 
   "Duo_Maxwell", 
   "http://www.theage.com.au/articles/2003/01/29/1043804407659.html", 
   {}, 
   111924, 
   null, 
   1114418100.0
  ], 
  [
   111942, 
   null, 
   "BobNelson2", 
   "In fact I was watching Meet the Press tonight and that very question came up and the response by the priest was to love the sinner and hate the sin like any other sin.........\n\n \n Well, I'm sure that from your years of Catholic schooling, you know that one anonymous priest on a TV show uttering a sound bite (and a Protestant one to boot) pretty much trumps anything the Catholic theologians have been saying for three decades now.\n \n Someone should tell Benedict.", 
   {}, 
   111924, 
   null, 
   1114422000.0
  ], 
  [
   112011, 
   null, 
   "JustineCredible", 
   "Well, I'm sure that from your years of Catholic schooling, you know that one anonymous priest on a TV show uttering a sound bite (and a Protestant one to boot) pretty much trumps anything the Catholic theologians have been saying for three decades now.\n \n Someone should tell Benedict.\n\n \n Um, the priest on Meet the Press yesterday morning (I get it in the am here) was Catholic, not Protestant. REV. THOMAS BOHLIN, U.S. Vicar, Opus Dei\n \n \"Opus Dei is a personal prelature of the Catholic Church. It was founded in Madrid on October 2, 1928, by St. Josemaría Escrivá.\" \n \n \n BUT To answer VOR's Challenge to Joe: http://www.cathmed.org/publications/homosexuality.html\n \n The Catholic Medical Association publishes it's statement on homosexuality and their belief that it is not only preventable but treatable.\n Granted, this goes against every secular accredited psychological and medical opinion.", 
   {}, 
   111942, 
   null, 
   1114450560.0
  ], 
  [
   112020, 
   null, 
   "Voice Of Reason", 
   "So you're saying the only way for a homosexual to be accepted into the Church is to not be homosexual?\n\n \n No Gays are not kicked out of the church for being gay, but just like any other sin committed by a catholic you have to confess it to receive holy communion...", 
   {}, 
   111539, 
   null, 
   1114451700.0
  ], 
  [
   112023, 
   null, 
   "Voice Of Reason", 
   "Well, I'm sure that from your years of Catholic schooling, you know that one anonymous priest on a TV show uttering a sound bite (and a Protestant one to boot) pretty much trumps anything the Catholic theologians have been saying for three decades now.\n \n Someone should tell Benedict.\n\n \n The priest that said it was a 33 year protege of Pope Benedict and was in Rome for the Mass yesterday........", 
   {}, 
   111942, 
   null, 
   1114451820.0
  ], 
  [
   112026, 
   null, 
   "Voice Of Reason", 
   "Um, the priest on Meet the Press yesterday morning (I get it in the am here) was Catholic, not Protestant. REV. THOMAS BOHLIN, U.S. Vicar, Opus Dei\n \n \"Opus Dei is a personal prelature of the Catholic Church. It was founded in Madrid on October 2, 1928, by St. Josemaría Escrivá.\" \n \n \n BUT To answer VOR's Challenge to Joe: http://www.cathmed.org/publications/homosexuality.html\n \n The Catholic Medical Association publishes it's statement on homosexuality and their belief that it is not only preventable but treatable.\n Granted, this goes against every secular accredited psychological and medical opinion.\n\n \n \n Thank you...............Well we are getting off the subject but there has been thousand of documented cases of gays converted to the straight life, but this is a whole other thread.........", 
   {}, 
   112011, 
   null, 
   1114452000.0
  ], 
  [
   112033, 
   null, 
   "Nurglitch", 
   "jyoshu:\n \n Obviously some things haven't been made clear. \n \n The first is that restricting homosexuals to heterosexual sex is an issue that would be wrong regardless of whose sexuality is in the majority. \n \n This restriction is wrong because sex has more purposes than reproduction than the purposes of reproduction and pleasure. \n \n Sex may also be an expression of love and affection, as a token of intimacy, as a bribe, as a commodity, as a healing process, as meditation, and as a stress reliever. \n \n All of these, including reproduction and pleasure, may be the only purpose an individual has for sex. Achieving most of these purposes, for some reason, requires a least one partner whose sexuality aligns with your own. Reproductive sex, like sex-as-bribe and sex-for-trade, doesn't even require that. \n \n Secondly majority status does not always signify a norm from which minorities deviate from. \n \n White americans, for example, are not the norm that black, latino, and asian americans deviate from. \n \n Likewise heterosexuality is not the norm that homosexuality, bisexuality, asexuality, and other minority types of sexuality deviate from. \n \n In order for minority sexualities to be deviations from heterosexuality, they would have to be derived from heterosexuality. Unfortunately us minority sexualities don't start off as heterosexuals and become corrupted, it's an innate thing that we're born with like handedness. \n \n Now it's interesting that you argue that asking Catholics to accept that people should cater to their own sexuality rather than trying to fit into a particular mold of heterosexuality is a denial of absolute truth.\n \n Of course, this absolute truth seems to have an awful lot of interpretations, as is obvious from the sheer number of christian churches, let alone the number of other religions claiming absolute truth. \n \n The problem with absolute truth, as recognized by wise men in the past few centuries, is that there is know way of being epistemically sure that what you think is absolute truth actually is absolute truth.\n \n Instead it is a matter of faith, and forgive me but since I do everything else in life according to objective (note not absolute) reason, I think I'll take the same approach to sexuality. \n \n I mean, the fact that some people can't be easily convinced that they're wrong, thanks to the special kinds of cognitive blocks they've contracted, is hardly reason to say they're right. \n \n By all means, stick with Catholic dogma. Just be aware that the rest of the world has advanced in knowledge and wisdom since then. \n \n Forgive me if a reject a set of sexual mores formulated by XXXXXX that couldn't see the holes in the ontological argument thanks to their primitive logic, didn't understand concepts such as zero, negative numbers, and the infinitessimal calculus in mathematics, and thought euclidian geometry was the be all and end all of geometry.\n \n My point is that technology has advanced since then. Mathematics, logic, science, language, ethics, gov't, medicine, and epistemology have all advanced in great strides since the 1st century AD.\n \n All power to the Catholics for holding fast to their beliefs, but the problem is that our technology hasn't advanced and improved by people regarding primitive iron-age tools (both physical and mental) as the last word in technology. \n \n Moreover I'm not asking that Catholics abandon an objective ethics (being an objectivist myself) in favour of a relativist ethics (a contradiction in terms) but rather that they accept that humans are fallible creatures that are occasionally wrong. To err, as they say, is human. In God we trust, and all others we subject to peer review. \n \n I trust God to know what is right. Unfortunately I don't trust people to know what God actually thinks, including myself. Given that I do not know for sure what God wants of me, but that She has given me the faculty of reason to figure out the options and the power to choose, I will choose according to the best reasoning I have so that I can justify the faith that God has put in me to do good.\n \n In this case Faith means rejecting the Biblical claim that homosexual acts are wrong because it stands in contradiction to my experience and to my reason, which God has given to me. Unfortunately most people don't have the experience of being non-heterosexual and misuse their faith such that they put it in worldly things such as books rather than in God-given reason. \n \n It could be that I'm wrong, but then I could also be wrong about the sun rising again tomorrow.\n \n [Note: Looking back this turned out to be quite the rant. Hopefully you see the points I'm getting at: majority/minority status does not imply norm/deviation, sex has more than two purposes, believing that you have absolute truth is a misuse of faith and will prevent you from finding Truth for yourself.]", 
   {}, 
   111942, 
   null, 
   1114452540.0
  ], 
  [
   112037, 
   null, 
   "wsm2506", 
   "Thank you...............Well we are getting off the subject but there has been thousand of documented cases of gays converted to the straight life, but this is a whole other thread.........\n\n \n That has been argued time and time again here. Simply put, no credible evidence exists to support such a claim.", 
   {}, 
   112026, 
   null, 
   1114453020.0
  ], 
  [
   112107, 
   null, 
   "BobNelson2", 
   "That has been argued time and time again here. Simply put, no credible evidence exists to support such a claim.\n\n \n I think the important point is that if thousands of gay people have been \"converted to the straight life, then tens of millions of straights have been \"converted\" to the gay life.\n \n It's no surprise, really, a toaster oven beats a lump of coal any day.", 
   {}, 
   112037, 
   null, 
   1114461960.0
  ], 
  [
   112202, 
   null, 
   "Voice Of Reason", 
   "That has been argued time and time again here. Simply put, no credible evidence exists to support such a claim.\n\n \n \n There are thousands that have converted.....just google on it and you will find many testimonials of people who were gay, converted and are now married with families leading straight lives................", 
   {}, 
   112037, 
   null, 
   1114470360.0
  ], 
  [
   112204, 
   null, 
   "Voice Of Reason", 
   "I think the important point is that if thousands of gay people have been \"converted to the straight life, then tens of millions of straights have been \"converted\" to the gay life.\n \n It's no surprise, really, a toaster oven beats a lump of coal any day.\n\n \n I believe the number of gays in the U.S. is about 1 or 2 percent of the population at best................", 
   {}, 
   112107, 
   null, 
   1114470420.0
  ], 
  [
   112207, 
   null, 
   "Duo_Maxwell", 
   "I believe the number of gays in the U.S. is about 1 or 2 percent of the population at best................\n\n \n UNFOUNDED CLAIM ALERT! \n \n Where's cone when you need him?", 
   {}, 
   112204, 
   null, 
   1114470480.0
  ], 
  [
   112219, 
   null, 
   "Jo Bennett", 
   "I believe the number of gays in the U.S. is about 1 or 2 percent of the population at best................\n\n \n The out population, possibly, given the discrimination and repression gays suffer in the US. The actual population, including those manipulated into supressing their sexuality, probably closer to human norms reckoned to be between 5 and 20% as I recall, though it does depend on whether you include bisexuals in that, and where you put asexuals.", 
   {}, 
   112204, 
   null, 
   1114471020.0
  ], 
  [
   112228, 
   null, 
   "BobNelson2", 
   "I believe the number of gays in the U.S. is about 1 or 2 percent of the population at best................\n\n \n Fine, have it your way. There are \"hundreds of thousands of us\" or \"there are millions of us\".\n \n Both absolutely trump your \"thousands\".", 
   {}, 
   112204, 
   null, 
   1114471620.0
  ], 
  [
   112230, 
   null, 
   "Jo Bennett", 
   "erm, 1-2% would be 3-6 million, still quite a lot though.", 
   {}, 
   112228, 
   null, 
   1114471680.0
  ], 
  [
   112232, 
   null, 
   "Duo_Maxwell", 
   "There are about 286 million Americans. \n \n 2% is 5.75 million Americans. \n 1% is 2.86 million\n \n That's a heft number.\n \n Personally I think the number has to be higher. There's no way 5.75 million gays could support such a large blooming gay industry of clubs and merchandise. It all comes down to numbers in the end.\n \n Let's consider the porn industry. It's $10 BILLION a year. Let's give a heft number of 180 million Americans supporting it. That's $55 per person. \n \n Doing the same math, that's about $316 million. That seems way to low. Or you guys just spend ALOT more then that $55 on gay merchandise and services individually, which I also find extremely hard to believe.", 
   {}, 
   112230, 
   null, 
   1114472100.0
  ], 
  [
   112254, 
   null, 
   "MrWriteLA", 
   "Funny how such a tiny percent of the population (of whom only a subset would even want  to get married if they could) could be capable of destroying the institution of marriage. What a threat! emoticon_frazzled", 
   {}, 
   112232, 
   null, 
   1114473840.0
  ], 
  [
   112270, 
   null, 
   "Voice Of Reason", 
   "The out population, possibly, given the discrimination and repression gays suffer in the US. The actual population, including those manipulated into supressing their sexuality, probably closer to human norms reckoned to be between 5 and 20% as I recall, though it does depend on whether you include bisexuals in that, and where you put asexuals.\n\n \n Your right Jo it is quite complicated but I don't believe bisexuals were used in the polls determining how many gays reside here.........A lot of women have had sexual encounters with women, Ann Heche comes to mind and have married men and have familites..........\n \n I am talking about strictly people that are attracted to the same sex and I think my estimate would be much closer...........", 
   {}, 
   112219, 
   null, 
   1114476000.0
  ], 
  [
   112272, 
   null, 
   "Voice Of Reason", 
   "erm, 1-2% would be 3-6 million, still quite a lot though.\n\n \n \n It is my sincere feeling that short of redifineing marriage that all gays should have the same benefits afforded married straight couples........\n \n I do believe by the active militancy of a few gays it is hurting the cause of all gays to receive these rights............", 
   {}, 
   112230, 
   null, 
   1114476300.0
  ], 
  [
   112273, 
   null, 
   "Jo Bennett", 
   "are you saying that bisexuals AREN'T attracted to people of the same sex? I would be interested to know on what you base your assessment of the propotion of gays. Given the number of gay people I know, and assuming the proportion of roughly the same across the world, which seems likely, you figure seems very low, there are probably that many out gays", 
   {}, 
   112270, 
   null, 
   1114476300.0
  ], 
  [
   112292, 
   null, 
   "georged", 
   "Here's a fairly recent (2003) demographic characteristics study of the US gay population including numbers:\n http://www1.law.ucla.edu/~erg/pubs/GD/GayDemographics.pdf#search='US%20gay%20population'\n \n Anyone care to extrapolate the military number from 1990?", 
   {}, 
   112273, 
   null, 
   1114479780.0
  ], 
  [
   112299, 
   null, 
   "Voice Of Reason", 
   "are you saying that bisexuals AREN'T attracted to people of the same sex? I would be interested to know on what you base your assessment of the propotion of gays. Given the number of gay people I know, and assuming the proportion of roughly the same across the world, which seems likely, you figure seems very low, there are probably that many out gays\n\n \n I just don't know what defines a bisexual...........If you have one sexual encounter with someone of the same sex are you bisexual? I think not.....", 
   {}, 
   112273, 
   null, 
   1114480800.0
  ], 
  [
   112301, 
   null, 
   "Duo_Maxwell", 
   "I just don't know what defines a bisexual...........If you have one sexual encounter with someone of the same sex are you bisexual? I think not.....\n\n \n Main Entry: bi·sex·u·al \n Pronunciation: (\")bI-'sek-sh(&-)w&l, -sh&l\n Function: adjective\n 1 a : possessing characters of both sexes : HERMAPHRODITIC b : sexually oriented toward both sexes\n 2 : of, relating to, or involving both sexes", 
   {}, 
   112299, 
   null, 
   1114481160.0
  ], 
  [
   112354, 
   null, 
   "BobNelson2", 
   "I just don't know what defines a bisexual...........If you have one sexual encounter with someone of the same sex are you bisexual? I think not.....\n\n \n If measuring sexual preference, you might not be. \n \n If measuring sexual history, you are.", 
   {}, 
   112299, 
   null, 
   1114493100.0
  ], 
  [
   112355, 
   null, 
   "Voice Of Reason", 
   "If measuring sexual preference, you might not be. \n \n If measuring sexual history, you are.\n\n \n well we are measuring sexual preference..........", 
   {}, 
   112354, 
   null, 
   1114493280.0
  ], 
  [
   112377, 
   null, 
   "BobNelson2", 
   "well we are measuring sexual preference..........\n\n \n I didn't know \"we\" were measuring anything, but if \"we\" are, I think \"we\" should use the term \"orientation\".\n \n \n Are we measuring actual sexual orientation or self-identified sexual orientation?", 
   {}, 
   112355, 
   null, 
   1114494480.0
  ], 
  [
   112423, 
   null, 
   "Jo Bennett", 
   "well we are measuring sexual preference..........\n\n \n I think the measure is of who you are sexually attracted to.\n \n That link suggests that 2% of the US population are out and gay, the upper end of VOR's figure, still leaving out closetted and repressed gays (of whom it is fair to say there are quite a lot in the US, given prevailing attitudes).", 
   {}, 
   112355, 
   null, 
   1114512600.0
  ], 
  [
   112456, 
   null, 
   "wsm2506", 
   "There are thousands that have converted.....just google on it and you will find many testimonials of people who were gay, converted and are now married with families leading straight lives................\n\n \n If you would bother to spend some time to read some of the other threads in this forum you would know that not a single argument you have brought forth has not already been discussed in this forum ad nauseum  before. You lack any originality whatever.", 
   {}, 
   112202, 
   null, 
   1114526640.0
  ], 
  [
   112463, 
   null, 
   "jyoshu", 
   "If you would bother to spend some time to read some of the other threads in this forum you would know that not a single argument you have brought forth has not already been discussed in this forum ad nauseum  before. You lack any originality whatever.\n\n \n That doesn't mean his statements are successfully refuted in those other threads. I don't know how many have claimed to have changed but it is obvious that some have. If taking you at your word on matters regarding your own feelings and sexuality is something you want people to do, then it seems to me it would be a good idea to do the same toward people who have claimed to make this change. Instead it seems that you and others here tend to pounce whenever this is brought up, as if you don't want it noted here, under any conditions, that some have claimed to have 'changed.' (or at least learned to live a heterosexual lifestyle contently.)", 
   {}, 
   112456, 
   null, 
   1114528680.0
  ], 
  [
   112464, 
   null, 
   "wsm2506", 
   "That doesn't mean his statements are successfully refuted in those other threads. I don't know how many have claimed to have changed but it is obvious that some have. If you taking you at your word on matters regarding your own feelings and sexuality is something you want people to do, then it seems to me it would be a good idea to do the same toward people who have claimed to make this change. Instead it seems that you and others here tend to pounce whenever this is brought up, as if you don't want it noted here, under any conditions, that some have claimed to have 'changed.' (or at least learned to live a heterosexual lifestyle contently.)\n\n \n This has all been argued before. Again, I state, there is no evidence, other than claims from questionable sources, that THOUSANDS have successfully changed their sexual orientation.", 
   {}, 
   112463, 
   null, 
   1114529160.0
  ], 
  [
   112471, 
   null, 
   "jyoshu", 
   "This has all been argued before. Again, I state, there is no evidence, other than claims from questionable sources, that THOUSANDS have successfully changed their sexual orientation.\n\n \n VOR didn't say they had \"changed their sexual orientation.' It is clear he meant they have stopped living the gay lifestyle (having gay relationships) and now have normal relationships and claim to be happy doing it. Marriage, kids, etc. He did use the term \"converted\" but I don't read that to mean they changed the \"orientation.\"\n \n The idea of 'sexual orientation' is overused, IMO anyway. Gay lobbyists use it as a sort of doctrine of human nature to try to portray people in gay relationships as being in the same playing field as straight ones--as if there aren't lots of other alternative types of arrangements to the normal man/woman relationship along with honsexual ones. 'Orientation' simply means someone is \"oriented\" toward something. I guess I have an 'ice cream orientation,' since I like to eat ice cream. I'm oriented toward it. Because of political goals the more activist gays will obviously push the idea that we are somehow slaves to our libido, and that we couldn't possibly learn to live differently, or without sex. And let's not dare actually do anything other than downplay any claims of people who say they have learned to live differently, huh?", 
   {}, 
   112464, 
   null, 
   1114530000.0
  ], 
  [
   112473, 
   null, 
   "Jaxian", 
   "The idea of 'sexual orientation' is overused, IMO anyway. Gay lobbyists use it as a sort of doctrine of human nature to try to portray people in gay relationships as being in the same playing field as straight ones--as if there aren't lots of other alternative types of arrangements to the normal man/woman relationship along with honsexual ones. 'Orientation' simply means someone is \"oriented\" toward something. I guess I have an 'ice cream orientation,' since I like to eat ice cream. I'm oriented toward it. Because of political goals the more activist gays will obviously push the idea that we are somehow slaves to our libido, and that we couldn't possibly learn to live differently, or without sex. And let's not dare actually do anything other than downplay any claims of people who say they have learned to live differently, huh?\n\n \n No one is assuming that people can't live without sex or live differently. But anti-gay lobbyists tend to believe that people should live without sex and live differently, because their own beliefs state that living that way is wrong. The gay person has no belief that what he does is wrong, and he has no reason to believe it, yet anti-gay lobbyists believe that he should go against what he believes and follow what someone else believes. Well that's wrong. I've said it before, and I continue to say it: it doesn't matter whether homosexuality is a choice or not. What matters is that one man should not be forced to follow the lifestyle, religion, or beliefs of another man without a very good reason to do so. And he should not be punished for living differently. Denying the same access to legal institutions is punishment.", 
   {}, 
   112471, 
   null, 
   1114530540.0
  ], 
  [
   112484, 
   null, 
   "wsm2506", 
   "VOR didn't say they had \"changed their sexual orientation.' It is clear he meant they have stopped living the gay lifestyle (having gay relationships) and now have normal relationships and claim to be happy doing it. Marriage, kids, etc. He did use the term \"converted\" but I don't read that to mean they changed the \"orientation.\"\n\n \n But what you fail to understand is that for gay people, gay relationships ARE NORMAL! A gay person in a heterosexual relationship is ABNORMAL.\n \n \nThe idea of 'sexual orientation' is overused, IMO anyway.\n\n \n \n OK. Then why use it as an excuse to deny civil rights?", 
   {}, 
   112471, 
   null, 
   1114532040.0
  ], 
  [
   112489, 
   null, 
   "jyoshu", 
   "No one is assuming that people can't live without sex or live differently. But anti-gay lobbyists tend to believe that people should live without sex and live differently, because their own beliefs state that living that way is wrong. The gay person has no belief that what he does is wrong, and he has no reason to believe it, \n\n \n Well, there probably are some 'gay' people who DO have that belief. But again, I'm just not one for trying to seamlessly catagorize people into neat little boxes (gay, straight, bi). The gay lobby has done a very successful job in the last few decades of defining the debate by overreaching with terms like \"gay\" and \"straight,\" and \"sexual orientation\" and using them to set up an argumentative system where those things are givens and shouldn't be (in their view) challenged in any way, lest we fall into the pit of being politically incorrect. Or worse, those \"givens\" are \"backed up\" with grand statements like 'every reputable medical association is on board' or 'the vast majority of the medical community agrees.' Well, no they don't--I know of plenty of doctors who do not agree. Claiming \"offensiveness\" and therefore making something politically incorrect can be a very effective way to stifle any opposition or even publications dissenting on an issue, and gay rights groups have pulled that off quite well.\n \n \nyet anti-gay lobbyists believe that he should go against what he believes and follow what someone else believes. Well that's wrong. \n\n \n Again, not everyone believe that certain way. There are gay people who certainly DO know that gay sex and relationships are wrong. It's probably a struggle for them at times, but we all have our weaknesses.\n \n \nBut what you fail to understand is that for gay people, gay relationships ARE NORMAL! A gay person in a heterosexual relationship is ABNORMAL.\n\n \n I DO understand that it probably FEELS normal. But morality is not based on feelings.", 
   {}, 
   112473, 
   null, 
   1114532880.0
  ], 
  [
   112497, 
   null, 
   "Jaxian", 
   "Well, there probably are some 'gay' people who DO have that belief. But again, I'm just not one for trying to seamlessly catagorize people into neat little boxes (gay, straight, bi). The gay lobby has done a very successful job in the last few decades of defining the debate by overreaching with terms like \"gay\" and \"straight,\" and \"sexual orientation\" and using them to set up an argumentative system where those things are givens and shouldn't be (in their view) challenged in any way, lest we fall into the pit of being politically incorrect. Or worse, those \"givens\" are \"backed up\" with grand statements like 'every reputable medical association is on board' or 'the vast majority of the medical community agrees.' Well, no they don't--I know of plenty of doctors who do not agree. Claiming \"offensiveness\" and therefore making something politically incorrect can be a very effective way to stifle any opposition or even publications dissenting on an issue, and gay rights groups have pulled that off quite well.\n\n \n I do not recall the gay rights movement ever claiming that any doctor or medical association states that people must be categorized into three special groups and they are unable to act outside of those. What they do say is that homosexuality is not harmful, is natural, and is not a disorder. What gay rights supporters call \"offensive\" is offensive, and there should be no doubt about that. Every time you claim that homosexuality is immoral, I am offended as much as you would be if I claimed that Christianity is immoral, or that your relationship with your loved one is immoral, and you should understand that, though the subject should not be taboo.\n \n \nAgain, not everyone believe that certain way.\n\n \n I know this. I used the term \"anti-gay lobbyists\" because you used the term \"gay lobbyists\".\n \n \nThere are gay people who certainly DO know that gay sex and relationships are wrong. It's probably a struggle for them at times, but we all have our weaknesses.\n\n \n But there are more straight people who DO know that gay sex and relationships are right.\n \n \nI DO understand that it probably FEELS normal. But morality is not based on feelings.\n\n \n Morality is also not based on hurting others. You cannot treat others differently than you would treat yourself and call that moral. It isn't. I understand that it feels moral for you to disapprove of homosexuality, but morality is not based on feelings.", 
   {}, 
   112489, 
   null, 
   1114533900.0
  ], 
  [
   112512, 
   null, 
   "wsm2506", 
   "I DO understand that it probably FEELS normal. But morality is not based on feelings.\n\n \n What \"FEELS\" normal? A gay person in a heterosexual relationship?", 
   {}, 
   112489, 
   null, 
   1114535640.0
  ], 
  [
   112516, 
   null, 
   "jyoshu", 
   "I do not recall the gay rights movement ever claiming that any doctor or medical association states that people must be categorized into three special groups and they are unable to act outside of those. What they do say is that homosexuality is not harmful, is natural, and is not a disorder.\n\n \n If so, then why do you use those catagories as a sort of debate-based 'doctrine?' Do you not realize that is exactly what you are doing when you or others claim 'gay people can't change'? \n \n \nWhat gay rights supporters call \"offensive\" is offensive, and there should be no doubt about that.\n\n \n Well, there you go. You've made my point. If simple disagreement is going to be deemed as 'offensive' and politically incorrect, you've succeeded in \"heading the debate off at the pass\", if you will. I would agree that calling gay people derogatory names is offensive, or making villainous associations (such as people saying 'Hitler was gay and that's why he killed people') but it seems that the line for what's deemed offensive has been moving more and more to include any discourse whatsoever on the issue of homosexuality for some time. You don't get to decide that there won't be a debate. There IS a debate, and that's the way it is. If that's offensive, then your standard of what's offensive is way too broad.\n \n \n. . . I am offended as much as you would be if I claimed that Christianity is immoral, or that your relationship with your loved one is immoral, and you should understand that, though the subject should not be taboo.\n\n \n Actually I would not consider that statement offensive at all on your part--I'd accept that as your opinion. I wouldn't agree of course, but I wouldn't take it as or claim it to be offensive. When our standard of what offensive is so broad, it only stifles discussion.\n \n \nMorality is also not based on hurting others. You cannot treat others differently than you would treat yourself and call that moral. \n\n \n Those are two different concepts, and therefore the \"hurting\" statement is a strawman. You haven't shown or proven that gay people will truly be 'harmed' if the govt. doesn't recognize their marriages but instead finds a way to give the same benefits to all regardless of marriage.", 
   {}, 
   112497, 
   null, 
   1114535700.0
  ], 
  [
   112533, 
   null, 
   "wsm2506", 
   "Those are two different concepts, and therefore the \"hurting\" statement is a strawman. You haven't shown or proven that gay people will truly be 'harmed' if the govt. doesn't recognize their marriages but instead finds a way to give the same benefits to all regardless of marriage.\n\n \n And you haven't shown or proven that heterosexual people will truly be 'harmed' (or in any tangible way even affected) if the govt. does recognize gay marriages.", 
   {}, 
   112516, 
   null, 
   1114536900.0
  ], 
  [
   112539, 
   null, 
   "jyoshu", 
   "And you haven't shown or proven that heterosexual people will truly be 'harmed' (or in any tangible way even affected) if the govt. does recognize gay marriages.\n\n \n I haven't claimed that heterosexual people would be harmed. Why should I need to prove a claim I haven't even made?", 
   {}, 
   112533, 
   null, 
   1114537440.0
  ], 
  [
   112541, 
   null, 
   "Voice Of Reason", 
   "As President Nixon use to say \"Let me make this perfectly clear\" I believe the jury is still out as to whether a person is born gay or is something in his environment when he is growing up causes him to choose the gay lifestyle..........There are studies on both sides of the issue.........\n \n I think no one knows for sure........", 
   {}, 
   112533, 
   null, 
   1114537620.0
  ], 
  [
   112544, 
   null, 
   "wsm2506", 
   "As President Nixon use to say \"Let me make this perfectly clear\" I believe the jury is still out as to whether a person is born gay or is something in his environment when he is growing up causes him to choose the gay lifestyle..........There are studies on both sides of the issue.........\n \n I think no one knows for sure........\n\n \n And it shouldn't make any difference either way.", 
   {}, 
   112541, 
   null, 
   1114537800.0
  ], 
  [
   112548, 
   null, 
   "jyoshu", 
   "And it shouldn't make any difference either way.\n\n \n For something that supposedly \"doesn't make any difference either way\" you all certainly spend an awful lot of effort defending and asserting that gay people are born that way.", 
   {}, 
   112544, 
   null, 
   1114538220.0
  ], 
  [
   112549, 
   null, 
   "Voice Of Reason", 
   "And it shouldn't make any difference either way.\n\n \n Sure it makes a difference if gays are not a a race but defined by a choice they make.........", 
   {}, 
   112544, 
   null, 
   1114538400.0
  ], 
  [
   112550, 
   null, 
   "Jo Bennett", 
   "The evidence is pretty clear cut that even if homosexuality is influenced by environmental factors, people do not choose to be gay.", 
   {}, 
   112549, 
   null, 
   1114538460.0
  ], 
  [
   112552, 
   null, 
   "wsm2506", 
   "Sure it makes a difference if gays are not a a race but defined by a choice they make.........\n\n \n And exactly what is that difference?", 
   {}, 
   112549, 
   null, 
   1114538640.0
  ], 
  [
   112554, 
   null, 
   "Voice Of Reason", 
   "The evidence is pretty clear cut that even if homosexuality is influenced by environmental factors, people do not choose to be gay.\n\n \n Then why do avowed gays choose to to become straight?", 
   {}, 
   112550, 
   null, 
   1114538880.0
  ], 
  [
   112556, 
   null, 
   "Voice Of Reason", 
   "And exactly what is that difference?\n\n \n Your born into a race..........If you African American or Hispanic you can't change that.........That is not the case with gays......", 
   {}, 
   112552, 
   null, 
   1114538940.0
  ], 
  [
   112560, 
   null, 
   "Jaxian", 
   "If so, then why do you use those catagories as a sort of debate-based 'doctrine?' Do you not realize that is exactly what you are doing when you or others claim 'gay people can't change'?\n\n \n Erm, do you mean the categories of harm, naturalness, and it not being a disorder? Well, I use the concept of harm to describe how beneficial or harmful same-sex marriage would be to our society. I only discuss how natural homosexuality is if someone else brings it up, because it isn't relevant, and the fact that homosexuality is not a disorder indicates that it does not need to be cured, which I find a useful fact, often. Of those, I really only use \"harm\" as part of my debate-based doctrine. I do believe that some gay people can change their sexual attraction, and I believe that most cannot. I'm sure any gay person can choose to live his or her life with someone other than the person he or she loves, but I see no reason to make them suffer so.\n \n \nWell, there you go. You've made my point. If simple disagreement is going to be deemed as 'offensive' and politically incorrect, you've succeeded in \"heading the debate off at the pass\", if you will. I would agree that calling gay people derogatory names is offensive, or making villainous associations (such as people saying 'Hitler was gay and that's why he killed people') but it seems that the line for what's deemed offensive has been moving more and more to include any discourse whatsoever on the issue of homosexuality for some time. You don't get to decide that there won't be a debate. There IS a debate, and that's the way it is. If that's offensive, then your standard of what's offensive is way too broad.\n\n \n It isn't too broad. To claim it to be fact that I or someone I believe to be moral lives in sin is offensive. I would be hard-pressed to understand how someone who calls me evil could manage to not offend me, and I wonder why you do not mind being called evil. I think perhaps it is because no one hurts you when they call you evil; you're in the majority. It isn't the same when one person to calls you evil as it is when hundreds of millions do it. Yet as I stated:\n \n \nthe subject should not be taboo.\n\n \n We cannot shut down the debate because people are offended, for that would accomplish nothing. But it should be expected that people will be offended, and as I said, you should understand that.\n \n \nActually I would not consider that statement offensive at all on your part--I'd accept that as your opinion. I wouldn't agree of course, but I wouldn't take it as or claim it to be offensive. When our standard of what offensive is so broad, it only stifles discussion.\n\n \n Being offended always stifles discussion no matter what context it is used in anywhere. Yet it exists, and we must both recognize and deal with it.\n \n \nThose are two different concepts, and therefore the \"hurting\" statement is a strawman. You haven't shown or proven that gay people will truly be 'harmed' if the govt. doesn't recognize their marriages but instead finds a way to give the same benefits to all regardless of marriage.\n\n \n This would not be the strawman fallacy. I would be guilty of the strawman fallacy if I found your weakest point, and singled that one out for attack, ignoring the strongest parts of your argument. What you claim I have done is failed to back my own statement. I have backed it, though.\n \n I have explained several times that by being denied marriage, same-sex couples are denied an equal opportunity to be accepted. I have said that if the name \"marriage\" meant nothing, you would have no reason to be so adamant about preventing same-sex couples from using it. It does mean something, and denying them access to marriage denies their lifestyle, religion, and beliefs an equal chance to be accepted in society. The only proof or evidence one might offer of this is the overwhelming number of people who believe that same-sex couples do not deserve equal rights, that they do not deserve to be treated the same as others treat themselves. Let's teach the next generation that everyone is worth helping.", 
   {}, 
   112516, 
   null, 
   1114539180.0
  ], 
  [
   112561, 
   null, 
   "Jo Bennett", 
   "Then why do avowed gays choose to to become straight?\n\n \n They don't \"become\" straight. They repress their feelings to conform to a socially acceptable lifestyle. There is a long history of people having to marry and have children because it was expected by society, Oscar Wilde being an obvious example.\n \n As for changing race, anyone taken a look at Michael Jackson recently?", 
   {}, 
   112554, 
   null, 
   1114539660.0
  ], 
  [
   112563, 
   null, 
   "wsm2506", 
   "Your born into a race..........If you African American or Hispanic you can't change that.........That is not the case with gays......\n\n \n That has nothing to do with equal protection under the law. emoticon_frazzled", 
   {}, 
   112556, 
   null, 
   1114540080.0
  ], 
  [
   112581, 
   null, 
   "Voice Of Reason", 
   "They don't \"become\" straight. They repress their feelings to conform to a socially acceptable lifestyle. There is a long history of people having to marry and have children because it was expected by society, Oscar Wilde being an obvious example.\n \n As for changing race, anyone taken a look at Michael Jackson recently?\n\n \n I am sorry Jo we don't know that for a fact...................You are taking the tact that once a gay person always a gay person........A lot of people including myself do not believe that........", 
   {}, 
   112561, 
   null, 
   1114541700.0
  ], 
  [
   112583, 
   null, 
   "Voice Of Reason", 
   "That has nothing to do with equal protection under the law. emoticon_frazzled\n\n \n Your right, that is why DOMAs can be overturned by a state constitutional amendment is another matter..........", 
   {}, 
   112563, 
   null, 
   1114541760.0
  ], 
  [
   112584, 
   null, 
   "wsm2506", 
   "I am sorry Jo we don't know that for a fact...................You are taking the tact that once a gay person always a gay person........A lot of people including myself do not believe that........\n\n \n OK. Let me ask you this, do you think it would be possinle for you to actually change YOUR sexual orientation?", 
   {}, 
   112581, 
   null, 
   1114541940.0
  ], 
  [
   112592, 
   null, 
   "MrWriteLA", 
   "Re: \"reparative therapy\":\n \n http://www.fair.org/extra/0109/gay-change.html\n http://www.religioustolerance.org/hom_exod.htm#know\n http://jgford.homestead.com/\n http://www.eurekalert.org/pub_releases/2000-02/APA-tdiw-0302100.php\n http://www.hrc.org/Template.cfm?Section=Get_Involved1&Template=/ContentManagement/ContentDisplay.cfm&ContentID=15255\n http://psychology.ucdavis.edu/rainbow/html/reptherapy.pdf\n http://www.apsa.org/ctf/cgli/reparative_therapy.htm", 
   {}, 
   112584, 
   null, 
   1114542900.0
  ], 
  [
   112595, 
   null, 
   "wsm2506", 
   "Your right, that is why DOMAs can be overturned by a state constitutional amendment is another matter..........\n\n \n I am not sure what your point is. Any state law can be overruled by that state's constitution. And state law or any state constitution can be overruled by the US Constitution. But none of that has anything to do with race, religion, or sexual orientation being inate or otherwise.", 
   {}, 
   112583, 
   null, 
   1114543260.0
  ], 
  [
   112659, 
   null, 
   "BobNelson2", 
   "The gay lobby has done a very successful job in the last few decades of defining the debate by overreaching with terms like \"gay\" and \"straight,\" and \"sexual orientation\" \n\n \n Uh... the medical and psychiatric communities came up with the concept of sexual orientation based on EVIDENCE.\n \n And, by the way, your side of the argument did a pretty fine job of defining the debate for the previous several centuries with words like pederast, pervert, XXXXX, XXXX, ***, sodomite, etc., etc.\n \n \n \nOr worse, those \"givens\" are \"backed up\" with grand statements like 'every reputable medical association is on board' or 'the vast majority of the medical community agrees.' \n\n \n That's right, try to dismiss the national medical, psychiatric, and psychological associations. Afterall, what the heck do they know about anything?\n \n \nWell, no they don't--I know of plenty of doctors who do not agree. \n\n \n Well, then they're incompetent to deal with patients regarding this issue.", 
   {}, 
   112489, 
   null, 
   1114552140.0
  ], 
  [
   112660, 
   null, 
   "BobNelson2", 
   "VOR didn't say they had \"changed their sexual orientation.' It is clear he meant they have stopped living the gay lifestyle (having gay relationships) and now have normal relationships and claim to be happy doing it. Marriage, kids, etc. He did use the term \"converted\" but I don't read that to mean they changed the \"orientation.\"\n\n \n I daresay that it's not \"normal\" for a man in a marriage with a women to have to fantasize about Tom Cruise to perform in bed. Nor is it typical for a heterosexual married couple to channel all their sexual energy into the garden (at least not for the first few years).\n \n You should watch your use of the word \"normal\". The sex lives of \"ex-gays\" are not \"normal\" heterosexual relationships.", 
   {}, 
   112471, 
   null, 
   1114552320.0
  ], 
  [
   112665, 
   null, 
   "jyoshu", 
   "I daresay that it's not \"normal\" for a man in a marriage with a women to have to fantasize about Tom Cruise to perform in bed. Nor is it typical for a heterosexual married couple to channel all their sexual energy into the garden (at least not for the first few years).\n\n \n If you think fantasizing about other people in a marriage is normal period, then I guess I'd just as soon not be normal. \n \n Half the problem with the whole gays-can't-change argument is that it assumes everyone is so sexually charged that it's always going to be an issue in the first place. Not everybody needs sex.\n \n \nYou should watch your use of the word \"normal\". The sex lives of \"ex-gays\" are not \"normal\" heterosexual relationships.\n\n \n If you aren't an \"ex-gay\" yourself (and I don't really like that term), how would you know? You're talking out of both sides of your mouth again--on one hand your carrying on about watching the use of the word \"normal,\" then in the same sentence you purport to know what is normal about people doing something you haven't done.", 
   {}, 
   112660, 
   null, 
   1114553100.0
  ], 
  [
   112671, 
   null, 
   "BobNelson2", 
   "If you think fantasizing about other people in a marriage is normal period, then I guess I'd just as soon not be normal. \n\n \n So you agree with me that it's ABNORMAL?\n \n \nHalf the problem with the whole gays-can't-change argument is that it assumes everyone is so sexually charged that it's always going to be an issue in the first place. Not everybody needs sex.\n\n \n If they want to produce offspring the way you say is God's plan and the way you say is the most \"rewarding\" part of these folks' marriages, they sure do.\n \n \nIf you aren't an \"ex-gay\" yourself (and I don't really like that term), how would you know? You're talking out of both sides of your mouth again--on one hand your carrying on about watching the use of the word \"normal,\" then in the same sentence you purport to know what is normal about people doing something you haven't done.\n\n \n It's not my term, it's theirs. In fact, I use it out of respect for their right to choose what to call themselves. I happen to think it's a poor descriptive term. Look at their literature if you don't think that's what they call themselves.\n \n You seem quite confused. All I'm saying is that the characteristics of many ex-gay marriages are NOT those of the \"normal\" heterosexual relationships that you assert they are. It may be perfectly \"normal\" for an ex-gay man to fantasize about men while having sex with his wife (or for an ex-lesbian woman to fantasize about women). From reports and testimonials, it certainly does happen a heck of a lot.", 
   {}, 
   112665, 
   null, 
   1114554000.0
  ], 
  [
   112680, 
   null, 
   "Voice Of Reason", 
   "I am not sure what your point is. Any state law can be overruled by that state's constitution. And state law or any state constitution can be overruled by the US Constitution. But none of that has anything to do with race, religion, or sexual orientation being inate or otherwise.\n\n \n \n The amendment that the states are passing becomes a part of the states constitution.........", 
   {}, 
   112595, 
   null, 
   1114554900.0
  ], 
  [
   112681, 
   null, 
   "tonybrown74", 
   "I am sorry Jo we don't know that for a fact...................You are taking the tact that once a gay person always a gay person........A lot of people including myself do not believe that........\n\n \n pshaw!\n \n You cannot even provide a link or cite a study that proves our claim that thousands of homosexuals have \"changed\". \n \n As a matter of fact, I haven't seen any ex-gay people posting anywhere in defense of reparative therapy. In the media, I have only seen two: Steve Bennet and John Paulk ... and Mr. Paulk was caught in a gay bar (Mr. P's in Dupont Circle) a couple of years ago, not too long after an expose in Time Magazine touting ex-gay ministries and whether gays can change.", 
   {}, 
   112581, 
   null, 
   1114554960.0
  ], 
  [
   112684, 
   null, 
   "Voice Of Reason", 
   "Well, then they're incompetent to deal with patients regarding this issue\n \n \n So because these people don't agree with you they are incompetent........Talk about a closed mind....... emoticon_rolleyes", 
   {}, 
   112680, 
   null, 
   1114555080.0
  ], 
  [
   112688, 
   null, 
   "jyoshu", 
   "pshaw!\n \n You cannot even provide a link or cite a study that proves our claim that thousands of homosexuals have \"changed\". \n \n In the media, I have only seen two: Steve Bennet and John Paulk ... and Mr. Paulk was caught in a gay bar (Mr. P's in Dupont Circle) a couple of years ago, not too long after an expose in Time Magazine touting ex-gay ministries and whether gays can change.\n\n \n Ooh, caught in a gay bar!! How horrific . . Let's not dare give him the benefit of the doubt, and assume he would ONLY be there to pick up sex partners or something, huh? emoticon_rolleyes Paulk hasn't hidden anything about this . . .\n \n From http://psychology.ucdavis.edu/rainbow/html/Paulk-Southern%20Voice.html: \n \n \"Paulk acknowledged in an interview with Southern Voice on Wednesday that he was present at Mr. P's on Tuesday night. \n \n \"I was walking around DuPont [Circle], and I needed to use the bathroom, so I walked in, but I did not know Mr. P's was a gay bar,\" Paulk said. \"Once I was inside, I thought, 'Oh, this is a gay bar, and I probably shouldn't be in here.'\" \n \n \"Mr. P's is well known to Washingtonians as the city's longest standing gay bar, operating in the same location since 1976 . . . . . With its dark exterior, including a small tinted window, Mr. Ps offers a foreboding appearance reminiscent of gay bars of the 1970s, compared to the brightly-lit hotels and restaurants that line P Street.\" \n \n Well gee, the article already made clear he was NOT a Washingtonian. Heck, a \"dark interior\" and \"small tinted window\" doesn't exactly set this bar apart from any other bar in the country, gay OR straight.\n \n \"I thought I'll go in and go to the bathroom,\" Paulk said. \"I wandered back, thinking it was weird to be in a gay bar again. I got a glass of water, sat down and chatted with patrons, including a gentleman who was married.\" Paulk said he had not been inside a gay bar since 1987.\" \n \n So he sat down and had a drink, and talked to someone. \n \n Good grief, call the ex-gay swat team, why don'tcha? emoticon_rolleyes", 
   {}, 
   112681, 
   null, 
   1114555860.0
  ], 
  [
   112689, 
   null, 
   "Duo_Maxwell", 
   "\"I asked him if he was gay,\" Herschaft recalled, \"and he said 'yes.'\" Herschaft then asked \"John\" his last name. \"He said his last name was 'Clint,' but he wanted to know why I was asking. He became evasive, but he was good at it, he was very calm.\" \n\n \n Do any of you actually read the links you post?", 
   {}, 
   112688, 
   null, 
   1114555980.0
  ], 
  [
   112691, 
   null, 
   "tonybrown74", 
   "\n \n So he sat down and had a drink, and talked to someone. \n \n Good grief, call the ex-gay swat team, why don'tcha? emoticon_rolleyes\n\n \n Have you ever been to Dupont Circle? I have, and I can tell you that his excuse that he needed to go to the restroom is extremely unbelievable.\n \n The street that Mr,. P's is on is wide and has several restaurants and hotels. I visited a few people (in DC) and the had to actually point out the entrance to Mr. P's since there is no sign and there is just a single door for its entrance.\n \n Also, if you read the story you just posted, he admited to being gay when someone asked him.\n \n Just becuase you cover your eyes doesn't mean that the truth isn't right in front of your face anymore.", 
   {}, 
   112688, 
   null, 
   1114556520.0
  ], 
  [
   112704, 
   null, 
   "jyoshu", 
   "Do any of you actually read the links you post?\n\n \n I always do. The problem is that you all have the wrong concept of \"ex-gay.\" In fact \"ex-gay\" is more than likely a way to refer to it by the gay lobby. I'm sure Paulk has struggled with this from time to time--it's matter of changing one's behavior.\n \n Besides, the person who stated that he said he was gay in that bar might flat out be lying.\n \n \nHave you ever been to Dupont Circle? I have, and I can tell you that his excuse that he needed to go to the restroom is extremely unbelievable.\n \n The street that Mr,. P's is on is wide and has several restaurants and hotels. I visited a few people (in DC) and the had to actually point out the entrance to Mr. P's since there is no sign and there is just a single door for its entrance.\n\n \n ??? So there's no sign there . . . wouldn't the fact that there is no sign make it all the more likely that he would not know it was a gay bar? I mean come on.", 
   {}, 
   112689, 
   null, 
   1114558920.0
  ], 
  [
   112705, 
   null, 
   "BobNelson2", 
   "So because these people don't agree with you they are incompetent........Talk about a closed mind....... emoticon_rolleyes\n\n \n Not because they don't agree with me, silly. Because they don't agree with the governing standards of their professions.\n \n Besides, jyoshu's \"authorities\" are probably dentists. He hasn't specified what kind of doctors he's asked. Podiatrists maybe?\n \n Ask him.", 
   {}, 
   112684, 
   null, 
   1114559100.0
  ], 
  [
   112707, 
   null, 
   "BobNelson2", 
   "Ooh, caught in a gay bar!! How horrific . . Let's not dare give him the benefit of the doubt, and assume he would ONLY be there to pick up sex partners or something, huh? emoticon_rolleyes Paulk hasn't hidden anything about this . . .\n\n \n You really should read a bit more about the incident before leaping to his defense. Within days, he was apologizing for \"backsliding\".\n \n I feel sorry for the guy. I just wish he'd find more rewarding employment. Ultimately, he'd be a lot better off.", 
   {}, 
   112688, 
   null, 
   1114559220.0
  ], 
  [
   112766, 
   null, 
   "jyoshu", 
   "You really should read a bit more about the incident before leaping to his defense. Within days, he was apologizing for \"backsliding\".\n\n \n Well I hope his apology was accepted fully by whomever he was apologizing to. Everyone makes mistakes from time to time. I commend him for trying to do what he feels is right, in the face of what was basically entrapment and a gay community that wished him failure from the beginning.\n \n \nI feel sorry for the guy. I just wish he'd find more rewarding employment. Ultimately, he'd be a lot better off.\n\n \n Yeah I can tell you just really have a heart full of concern for the guy . . . emoticon_rolleyes", 
   {}, 
   112707, 
   null, 
   1114571820.0
  ], 
  [
   112820, 
   null, 
   "BobNelson2", 
   "Well I hope his apology was accepted fully by whomever he was apologizing to. Everyone makes mistakes from time to time. I commend him for trying to do what he feels is right, in the face of what was basically entrapment and a gay community that wished him failure from the beginning.\n\n \n \"Entrapment\"? How so?\n \n \n \nYeah I can tell you just really have a heart full of concern for the guy . . . emoticon_rolleyes\n\n \n How can you tell what I think about him? I detest the organization he works for (who put him on probation for his \"backsliding\" by the way) but that has more to do with their using desperate, innocent people for monetary gain. If you don't believe me, check out their \"seminars\". Next time one is in town, maybe you can fork over enough cash to \"get help\".", 
   {}, 
   112766, 
   null, 
   1114585800.0
  ], 
  [
   112894, 
   null, 
   "wsm2506", 
   "\n [i]\"Mr. P's is well known to Washingtonians as the city's longest standing gay bar, operating in the same location since 1976 . . . . .\n\n \n An he didn't know that?? Geez!!!!!!!!!\n \n \nSo he sat down and had a drink, and talked to someone.\n\n \n Thought he said he had to take a leak, not sit down and have a drink and talk with someone AFTER he \"realized\" it was a gay bar. emoticon_rolleyes \n \n \nGood grief, call the ex-gay swat team, why don'tcha? emoticon_rolleyes\n\n \n How about calling the truth squad?", 
   {}, 
   112688, 
   null, 
   1114613400.0
  ], 
  [
   114419, 
   null, 
   "Duo_Maxwell", 
   "I always do. The problem is that you all have the wrong concept of \"ex-gay.\" In fact \"ex-gay\" is more than likely a way to refer to it by the gay lobby. I'm sure Paulk has struggled with this from time to time--it's matter of changing one's behavior.\n\n \n Right. Sounds like a cop out. \n \n \n\n Besides, the person who stated that he said he was gay in that bar might flat out be lying.\n\n \n I have to ask the obvious: WHY?", 
   {}, 
   112704, 
   null, 
   1114840860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The New Pope makes his first moves on gays", 
  "url": "http://www.4forums.com/political/gay-rights-debates/4908-new-pope-makes-his-first-moves-gays.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 4908, 
  "discussion_files": [
   [
    "11791.html", 
    "http://www.4forums.com/political/gay-rights-debates/4908-new-pope-makes-his-first-moves-gays-print.html"
   ], 
   [
    "11792.html", 
    "http://www.4forums.com/political/gay-rights-debates/4908-new-pope-makes-his-first-moves-gays-7-print.html"
   ], 
   [
    "11793.html", 
    "http://www.4forums.com/political/gay-rights-debates/4908-new-pope-makes-his-first-moves-gays-5-print.html"
   ], 
   [
    "11794.html", 
    "http://www.4forums.com/political/gay-rights-debates/4908-new-pope-makes-his-first-moves-gays-4-print.html"
   ], 
   [
    "11795.html", 
    "http://www.4forums.com/political/gay-rights-debates/4908-new-pope-makes-his-first-moves-gays-6-print.html"
   ], 
   [
    "11796.html", 
    "http://www.4forums.com/political/gay-rights-debates/4908-new-pope-makes-his-first-moves-gays-3-print.html"
   ], 
   [
    "11797.html", 
    "http://www.4forums.com/political/gay-rights-debates/4908-new-pope-makes-his-first-moves-gays-2-print.html"
   ]
  ], 
  "identifier": 4908
 }
]