[
 [
  [
   111356, 
   null, 
   "Duo_Maxwell", 
   "This is ridiculous. 200+ judges have been confirmed. Of the 40 as yet in question, a mere handful are objectable. The religious republican claim that the democrats are aganist them because of faith is not only a serious lie, but it's a disgusting tactic when they have confirmed the huge majority without problem. \n \n The sad thing is, most americans are either too stupid or too lazy to realize that.", 
   {
    "post_info": {
     "post_title": "&quot;Democrats aganist Judges of faith&quot;"
    }
   }, 
   null, 
   null, 
   1114298160.0
  ], 
  [
   111382, 
   null, 
   "fracas", 
   "regardless of how many judges of faith have been confirm, it remain disgusting even if one was refused a vote because of his/her faith.\n \n The sad thing is, most americans are either too stupid or too lazy to realize that.", 
   {}, 
   111356, 
   null, 
   1114303500.0
  ], 
  [
   111485, 
   null, 
   "Duo_Maxwell", 
   "regardless of how many judges of faith have been confirm, it remain disgusting even if one was refused a vote because of his/her faith.\n\n \n Then the same can be said about the republicans in the past. Faith is in everything.", 
   {}, 
   111382, 
   null, 
   1114333440.0
  ], 
  [
   111489, 
   null, 
   "fracas", 
   "Then the same can be said about the republicans in the past. Faith is in everything.\n\n \n faith is not everything\n but it should not be discriminated against", 
   {}, 
   111485, 
   null, 
   1114349100.0
  ], 
  [
   111510, 
   null, 
   "lord tammerlain", 
   "If your faith would prevail over the rule of law then yes it is objectionable. If the judges of concern would follow their faith more then laws of the nation he should not be confirmed. \n \n Would a strict muslim who would push Islamic beliefs into his judgements be allowed? Or a Hindu? Given that the answer is a no, neither should a strict christian.", 
   {}, 
   111489, 
   null, 
   1114359840.0
  ], 
  [
   111511, 
   null, 
   "Mach", 
   "This is ridiculous. 200+ judges have been confirmed. Of the 40 as yet in question, a mere handful are objectable. The religious republican claim that the democrats are aganist them because of faith is not only a serious lie, but it's a disgusting tactic when they have confirmed the huge majority without problem. \n \n The sad thing is, most americans are either too stupid or too lazy to realize that.\n\n \n Republicans are good at the game, no doubt, they can turn anything into the opposite in the public eye, it just takes a little hard work and $$. (I should note democracts can do the same, they just aren't as good at it).\n \n Judges that rule based on faith, rather than the law, should indeed be blocked, discriminated against, ridiculed, and the like. If they HAVE faith, but it's not the basis for their rulings, sure, then it makes little difference. \n \n Then again, if they have evidence these judges make decisions based on beliefs of faith (irrational reasons), they shouldn't still be judges anyway. That would be called, incompetence.\n \n I mean, we already have physicians and pharmacists that literally do not do their job, because of their faith (their ignorance). It's obviously not a foreign concept.\n \n -Mach", 
   {}, 
   111356, 
   null, 
   1114360020.0
  ], 
  [
   111514, 
   null, 
   "fracas", 
   "If your faith would prevail over the rule of law then yes it is objectionable. If the judges of concern would follow their faith more then laws of the nation he should not be confirmed. \n \n Would a strict muslim who would push Islamic beliefs into his judgements be allowed? Or a Hindu? Given that the answer is a no, neither should a strict christian.\n\n \n agree. key word there is \"If\". but \"If\" is not, then discrimination based on faith is wrong. as i said in post #2.", 
   {}, 
   111510, 
   null, 
   1114360680.0
  ], 
  [
   111518, 
   null, 
   "lord tammerlain", 
   "Given that most appointments have not been questioned or held up, and that most Judges in the US are at least nominally christian, I do not think that it is faith based discrimination. More likely a question of the nominees ability to be unbiased due to whatever reason.", 
   {}, 
   111514, 
   null, 
   1114361340.0
  ], 
  [
   111642, 
   null, 
   "fracas", 
   "Given that most appointments have not been questioned or held up, and that most Judges in the US are at least nominally christian, I do not think that it is faith based discrimination. More likely a question of the nominees ability to be unbiased due to whatever reason.\n\n it is folly to expect judges to be unbias. it is reasonable to expect them to uphold the constitution. there has been no indication thus that they would not.", 
   {}, 
   111518, 
   null, 
   1114383720.0
  ], 
  [
   112522, 
   null, 
   "wsm2506", 
   "agree. key word there is \"If\". but \"If\" is not, then discrimination based on faith is wrong. as i said in post #2.\n\n \n But do not these religious persons discriminate based on their particular faith? Did you not say: \"discrimination based on faith is wrong\"?", 
   {}, 
   111514, 
   null, 
   1114536000.0
  ], 
  [
   112527, 
   null, 
   "wsm2506", 
   "The Republicans are crying \"FOUL\" over the Democrats use of the filibuster. What a short memory they have.\n \n http://www.washingtonpost.com/wp-dyn/articles/A45149-2005Mar17.html", 
   {}, 
   112522, 
   null, 
   1114536360.0
  ], 
  [
   112531, 
   null, 
   "Voice Of Reason", 
   "So what I hear you liberals say is if your a man or woman of strong faith that disqualifies you from being a circuit court judge......... emoticon_confused", 
   {}, 
   112527, 
   null, 
   1114536780.0
  ], 
  [
   112538, 
   null, 
   "lord tammerlain", 
   "So what I hear you liberals say is if your a man or woman of strong faith that disqualifies you from being a circuit court judge......... emoticon_confused\n\n \n \n No liberals are against judges who would place personal beliefs above that of the laws of the country.", 
   {}, 
   112531, 
   null, 
   1114537380.0
  ], 
  [
   112540, 
   null, 
   "wsm2506", 
   "So what I hear you liberals say is if your a man or woman of strong faith that disqualifies you from being a circuit court judge......... emoticon_confused\n\n \n Many circuit court judges are elected in a popularity contest, not appointed. Whether I would vote for them or not would depend my belief in their ability to apply civil law even if it went against their religious beliefs.\n \n The Vatican recently issued a statement in which they called upon all Catholics in Spain to quit their jobs rather than enforce some Spanish laws. I guess it is better that they quit than have Spain ruled by the Vatican.", 
   {}, 
   112531, 
   null, 
   1114537620.0
  ], 
  [
   112572, 
   null, 
   "Voice Of Reason", 
   "Judge William Pryor from Alabama is a Catholic and a strong man in his faith...Democrats like Shumer in the Senate has said that disqualifies him from being a circuit judge..........\n \n Outrageous.......", 
   {}, 
   112540, 
   null, 
   1114541100.0
  ], 
  [
   112587, 
   null, 
   "REMF Hunter", 
   "We MUST NOT take God out of the Court House in America. It is imparative that the Moral Christian Values this country was established on, are maintained. I am sick of these Blue states like Illinois, whose Judges and Politicians are obviously Liberal and over the top. A moretorium on executions? What the hell were they thinking? So what if DNA proved a bunch of guys innocent? It is for these reasons alone we must keep God in the Court House.\n \n In states like Texas, where they have an express lane for executions----could you imagine a Judge during the sentencing phase of the trial when he gives the convicted his death sentence----you know, just in case they are wrong, not saying, \"And may GOD have mercy on your Soul\".?\n \n Right after that, the Judge jumps in his/her car, and drives over to the anti-abortion rally for a Christian Fellowship and protest, carrying mock Rock Slabs with the 10-Commandments carved in them.\n \n Gimmie a break, I have never seen a group of politicians from any Party in my lifetime that is as selfish and self-imposing as this current Republican Party and its followers.", 
   {}, 
   112572, 
   null, 
   1114542240.0
  ], 
  [
   112613, 
   null, 
   "gnojek", 
   "Huh?\n \n \n \n \nWe MUST NOT take God out of the Court House in America.\n\n God's house is down the street.\n \n \nIt is imparative that the Moral Christian Values this country was established on, are maintained.\n\n The country was founded on democratic values.\n Christianity was on the sidelines.\n \n \nI am sick of these Blue states like Illinois, whose Judges and Politicians are obviously Liberal and over the top.\n\n What about judges that enforce sodomy laws?\n Or the ones that sent the 18 yo to jail for 17 years for having oral sex with his 15 year old buddy?\n Is that over the top?\n \n \n \nA moretorium on executions?\n\n God forbid.\n \n \n What the hell were they thinking? \n\n That there is a possibility of sending an innocent man to his death.\n \n \nSo what if DNA proved a bunch of guys innocent? It is for these reasons alone we must keep God in the Court House.\n\n Yeah, kill'em all and let God sort 'em out.\n \n I understand you may not be exactly 'sincere' in your post, but I responded like you were anyway.", 
   {}, 
   112587, 
   null, 
   1114545360.0
  ], 
  [
   112619, 
   null, 
   "fracas", 
   "But do not these religious persons discriminate based on their particular faith? Did you not say: \"discrimination based on faith is wrong\"?\n\n \n \n if religious people discriminate, that makes it ok to discriminate against them?", 
   {}, 
   112522, 
   null, 
   1114546260.0
  ], 
  [
   112670, 
   null, 
   "Voice Of Reason", 
   "No liberals are against judges who would place personal beliefs above that of the laws of the country.\n\n \n How do you know a Catholic of faith like William Pryor of Alabama would do that?\n \n In the case of the 10 Commandment monument in Alabama although his faith told him to Rule for Judge Moore he went by law and ruled against him.........\n \n This is exactly the kind of judge you want on the appellate court......", 
   {}, 
   112538, 
   null, 
   1114553940.0
  ], 
  [
   112673, 
   null, 
   "Voice Of Reason", 
   "\n What about judges that enforce sodomy laws?\n Or the ones that sent the 18 yo to jail for 17 years for having oral sex with his 15 year old buddy?\n Is that over the top?\n \n \n You may not like that sentence but he did commit statuatory rape and when that is perpetrated on a minor by and adult it should be prosecuted to the full extent of the law..........", 
   {}, 
   112670, 
   null, 
   1114554120.0
  ], 
  [
   112693, 
   null, 
   "Duo_Maxwell", 
   "How do you know a Catholic of faith like William Pryor of Alabama would do that?\n \n In the case of the 10 Commandment monument in Alabama although his faith told him to Rule for Judge Moore he went by law and ruled against him.........\n \n This is exactly the kind of judge you want on the appellate court......\n\n \n Do you even know anything about Pryor? \n \n He defended a 1st ammendemnet violation because he said his religion dictated it\n \n Not to mention he says that states shouldn't be sued when the violate federal disabilitiy and civil right laws. \n \n Do you want a judge who has little respect for the consitution as a whole?\n \n Oh wait, you don't either so that's not a big suprrise.", 
   {}, 
   112670, 
   null, 
   1114557120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  \"Democrats aganist Judges of faith\"", 
  "url": "http://www.4forums.com/political/current-events-debates/4919-democrats-aganist-judges-faith.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 4919, 
  "discussion_files": [
   [
    "18813.html", 
    "http://www.4forums.com/political/current-events-debates/4919-democrats-aganist-judges-faith-print.html"
   ], 
   [
    "18814.html", 
    "http://www.4forums.com/political/current-events-debates/4919-democrats-aganist-judges-faith-2-print.html"
   ]
  ], 
  "identifier": 4919
 }
]