[
 [
  [
   111725, 
   null, 
   "zachvac", 
   "I have a question:\n \n What does it mean to exist? How do you know there aren't millions of invisible, unsensable little particles in the air? You may say because we can't detect them, so does that mean that something that can't be detected doesn't exist? I was thinking in relation to 1984 where people were killed and erased from all records. When a person is not recorded in records or memories did the person ever exist? How can we prove it? If we can't sense that person or have any evidence how can we say they existed? If I live on an island in the middle of nowhere I don't exist anywhere but in my own mind, since I'm the only one that knows I'm here. Other than in my mind do I exist if I'm a hermit on a deserted island and no one knows about me? Do I come into existence when someone discovers me?", 
   {
    "post_info": {
     "post_title": "Existence"
    }
   }, 
   null, 
   null, 
   1114392480.0
  ], 
  [
   112249, 
   null, 
   "gnojek", 
   "If a tree falls in the woods.....\n \n \n :)", 
   {}, 
   111725, 
   null, 
   1114473480.0
  ], 
  [
   112369, 
   null, 
   "The Barbarian", 
   "There was a young man who said \"God, \n I find it exceedingly odd, \n That the sycamore tree \n Continues to be \n When there's no one about in the Quad.\"\n \n \n \"Dear Sir, your astonishment's odd, \n For I'm always about in the Quad; \n The sycamore tree \n Continues to be,\" \n Observed by Yours faithfully, GOD.\" \n Ronald Knox", 
   {}, 
   112249, 
   null, 
   1114494000.0
  ], 
  [
   112409, 
   null, 
   "Alan Ryan", 
   "I have a question:\n \n What does it mean to exist? How do you know there aren't millions of invisible, unsensable little particles in the air? You may say because we can't detect them, so does that mean that something that can't be detected doesn't exist? \n\n \n The apparatus for detecting (whatever existence you have in mind) may be inadequate, undeveloped, etc. so the answer can only be - not necessarily.", 
   {}, 
   111725, 
   null, 
   1114505880.0
  ], 
  [
   115720, 
   null, 
   "canadianman76", 
   "to exist is to occupy space. all we are is hundreds of trillions of organized bundles of energy, swarming about one and other directed by some collective of information that tells the energy how to act in relation to other parts of itsself. always drawing on this vast storage of wisdom instantainously anywhere and anytime in the universe.", 
   {
    "post_info": {
     "post_title": "to exist"
    }
   }, 
   112409, 
   null, 
   1115120220.0
  ], 
  [
   115734, 
   null, 
   "wilted_laughter", 
   "If a tree falls in the woods.....\n \n \n :)\n\n \n sound is a force so...", 
   {}, 
   112249, 
   null, 
   1115124960.0
  ], 
  [
   117611, 
   null, 
   "zachvac", 
   "to exist is to occupy space. all we are is hundreds of trillions of organized bundles of energy, swarming about one and other directed by some collective of information that tells the energy how to act in relation to other parts of itsself. always drawing on this vast storage of wisdom instantainously anywhere and anytime in the universe.\n\n \n \n how do you define occupy space? How do you know we actually \"move\"? What is space? What if we are all still but our senses sense us moving. The only real way we define occupy a space is that we can detect it there. If there were such a thing as ghosts (can't rule it out) we don't know they exist even if they could very well be occupying space right next to you, you never know it so we can't say they exist. If no one can sense us here, are we really here except in our own minds?", 
   {}, 
   115720, 
   null, 
   1115350320.0
  ], 
  [
   117755, 
   null, 
   "canadianman76", 
   "any material object exists in an infinite number of forms at an infinite number of coordinates in the universe until there is an observer present to colapse its probability field into its material form. Could one person observe themself therefore collapsing there wave function into a material being? or is there a grand observer out there constantly observing us? I've gone crosseyed! emoticon_xdonno", 
   {
    "post_info": {
     "post_title": "to exist?"
    }
   }, 
   117611, 
   null, 
   1115387100.0
  ], 
  [
   151467, 
   null, 
   "jim's trucking", 
   "to exist is to occupy space. all we are is hundreds of trillions of organized bundles of energy, swarming about one and other directed by some collective of information that tells the energy how to act in relation to other parts of itsself. always drawing on this vast storage of wisdom instantainously anywhere and anytime in the universe.\nA flawed definition without clarification of the term \"exist\". To exist does not require occupation of space. Time exists. Cruelty exists. Apathy exists. None of these take up space.\n \n If you exclude intangibles such as I've mentioned, you still run into a problem with fields. An electro-magnetic field can permeate a vacuum without taking up any of the space within. The magnetic field of the earth permeates our bodies, but does not displace us from where we are. Radios waves do the same.\n \n I'm afraid the \"taking up space\" criterion is insufficient.", 
   {}, 
   115720, 
   null, 
   1122585060.0
  ], 
  [
   151478, 
   null, 
   "Pravda", 
   "I think that this is a philosophical question, particularly with regard to metaphysics (the logic of physics) and ontology. \n \n This link to the Stanford Encyclopedia of Philosophy's entry on \"existence\" should get you all started: http://plato.stanford.edu/entries/existence/", 
   {}, 
   151467, 
   null, 
   1122586680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Existence", 
  "url": "http://www.4forums.com/political/science-math-debates/4926-existence.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 4926, 
  "discussion_files": [
   [
    "10581.html", 
    "http://www.4forums.com/political/science-math-debates/4926-existence-print.html"
   ]
  ], 
  "identifier": 4926
 }
]