[
 [
  [
   6037, 
   null, 
   "lurch", 
   "Avian flu, a form of influenza A virus, made the jump from chickens to humans twice in recent years. The first time was in 1997 in Hong Kong when 18 people were infected with a strain of H5N1. Six people died as a result. In 1999 there were two confirmed cases of human infection with the H9N2 strain of avian flu.\n \n Earlier this year there was a report of 4 cases and two deaths from suspected avian influenza. That was not confirmed at the time. It seems now that it may have been some of the first cases of SARS.\n \n SARS is suspected to be a new strain of a coronavirus (CDC is 90% sure). The coronavirus normally cause about 1/3 of the common colds.\n \n Press Release", 
   {
    "post_info": {
     "post_title": "Evolution happens"
    }
   }, 
   null, 
   null, 
   1049302380.0
  ], 
  [
   6047, 
   null, 
   "thistownwilleat", 
   "Kind of off subject, but I read somewhere that if this SARS would have sprung up 200 years ago it would have rivaled the Bubonic Plague. The mortality rate is higher and they say its just as contagious. Scary stuff.", 
   {}, 
   6037, 
   null, 
   1049322960.0
  ], 
  [
   6051, 
   null, 
   "Tim", 
   "Evolution is still going on. We have observed it. In the 20th century mosquitos evolved so that they were immune to the pesticide DDT.", 
   {}, 
   6037, 
   null, 
   1049324340.0
  ], 
  [
   6088, 
   null, 
   "FreeThinker", 
   "\"Evolution is still going on. We have observed it. In the 20th century mosquitos evolved so that they were immune to the pesticide DDT.\"-Tim\n \n Tim, \n Mosquitos did not evolve. The ones that were not immune to DDT died, and the ones that were already immune to DDT lived and passed on their genes to more mosquitos. It is that simple.", 
   {}, 
   6037, 
   null, 
   1049406600.0
  ], 
  [
   6089, 
   null, 
   "thistownwilleat", 
   "And that, my friend, is evolution.", 
   {}, 
   6037, 
   null, 
   1049407140.0
  ], 
  [
   6101, 
   null, 
   "lurch", 
   "Mosquitos did not evolve. The ones that were not immune to DDT died, and the ones that were already immune to DDT lived and passed on their genes to more mosquitos. It is that simple.\n\n Not only is that evolution, it is evolution by means of natural selection.", 
   {}, 
   6037, 
   null, 
   1049415780.0
  ], 
  [
   6102, 
   null, 
   "FreeThinker", 
   "No, Lurch, it ISN'T evolution. It is natural selection, but not evolution. Some mosquitos already HAD a resistance to DDT. The ones that didn't died. Evolution would require the mosquitos to GAIN a resistance to DDT. In other words add information. That didn't happen.", 
   {}, 
   6037, 
   null, 
   1049420460.0
  ], 
  [
   6104, 
   null, 
   "Crim", 
   "Of course it's evolution. It's a change in allele frequencies.\n \n \nSome mosquitos already HAD a resistance to DDT. The ones that didn't died. Evolution would require the mosquitos to GAIN a resistance to DDT. In other words add information. That didn't happen.\n \n \n How do you know the immunity was not due to mutation?", 
   {}, 
   6037, 
   null, 
   1049421960.0
  ], 
  [
   6114, 
   null, 
   "lurch", 
   "No, Lurch, it ISN'T evolution. It is natural selection, but not evolution.\n\n Natural selection is a mechanism of evolution. When you observe natural selection, you are observing evolution. It is so by definition.\n \nSome mosquitos already HAD a resistance to DDT. The ones that didn't died. \n\n Where did it come from. Did they have it from all eternity or did you god create it with the first two little mosquitos especially because he knew that DDT would kill them off if he didn't? Why would mosquitos have resistance to DDT before DDT existed?\n \nEvolution would require the mosquitos to GAIN a resistance to DDT.\n\n Why? Since when did that become the definition of evolution?\n \nIn other words add information.\n\n Define information. Why is it necessary for evolution?\n \nThat didn't happen.\n\n How do you know?", 
   {}, 
   6037, 
   null, 
   1049427300.0
  ], 
  [
   6158, 
   null, 
   "Karl", 
   "Originally posted by Crim \n \n How do you know the immunity was not due to mutation? \n \n \n I saw a paper somewhere that the DDT resistance of the Culex mosquito was due to gene dupllication mutation. Several copies of the gene exiisted in non resistant strains, something like 250 were in the resistant varieties. Other species became resistant via point mutations. I'll try to dig up the papers later.", 
   {}, 
   6037, 
   null, 
   1049509980.0
  ], 
  [
   6162, 
   null, 
   "lurch", 
   "Thanks, Karl\n \n I suspected as much although I had no specific information. It is known that genetic variability arises through mutation.\n \n Another example in which creationists whine that it is \"natural selection\" but not evolution is that of industrial melanism in moths. The most famous is that of the peppered moth in Great Britain around 1850.\n \n Creationists claim that the dark morph already existed and only became numerous after 1850. If asked for the source of the gene that \"already existed,\" they have no answer. Gawd did it. The trouble is, the mutation that causes the two morphs is a single point mutation. It was first noticed in Biston betularia in 1849 I think. There is no record of it before that time.\n \n Creationists would like to claim that it always existed but that is highly unlikely. The same mutation has been observed to arise in other species of moths with the same result - a dark morph.", 
   {}, 
   6037, 
   null, 
   1049523360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evolution happens", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/493-evolution-happens.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 493, 
  "discussion_files": [
   [
    "25107.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/493-evolution-happens-print.html"
   ]
  ], 
  "identifier": 493
 }
]