[
 [
  [
   112712, 
   null, 
   "Close_slave_can", 
   "I never get any answers here, It does not matter if I ask, beg or demand creationists never answer my questions. What is up with that? Are they more talkative on pro creation forums?", 
   {
    "post_info": {
     "post_title": "Where can I go to ask creationists questions?"
    }
   }, 
   null, 
   null, 
   1114559400.0
  ], 
  [
   112714, 
   null, 
   "Waxy", 
   "South of the Mason-Dixon. ;)\n \n Waxy", 
   {}, 
   112712, 
   null, 
   1114559520.0
  ], 
  [
   112732, 
   null, 
   "Beowulf Lee", 
   "I believe you can talk to some representative of Hovinid on AOL instant message, by the screen name DrDino. I don't know the schedule though, so go check on his site if you're interested.\n \n Edit: Well, its 6:49 EST, and he's on.\n Edit 2: Oops, its Dr Dino Live.", 
   {}, 
   112714, 
   null, 
   1114562820.0
  ], 
  [
   112743, 
   null, 
   "Black Phoenix", 
   "Yea Close_slave_can honestly if you're looking for answers I would even go so far as to invest in Dr. Hovind's DvD collection, only like a $100, but it gives you the full side of the creationist perspective, there are 7 DvDs with like over 20 hours worth of studies and stuff.....I found it really interesting....that would be your best bet.....", 
   {}, 
   112732, 
   null, 
   1114566120.0
  ], 
  [
   112748, 
   null, 
   "Ray Martinez", 
   "I never get any answers here, It does not matter if I ask, beg or demand creationists never answer my questions. What is up with that? Are they more talkative on pro creation forums?\n\n \n Hi Slave:\n \n I am right here.\n \n Ray M.", 
   {}, 
   112712, 
   null, 
   1114568040.0
  ], 
  [
   112750, 
   null, 
   "Ray Martinez", 
   "Slave:\n \n Any SCIENTIST whether creationist or Darwinian cannot represent the ID/Creationist side.\n \n ONLY creationist theologians and philosophers can.\n \n Philosophy is king - not science.\n \n I happen to be a theology and philosophy major.\n \n Ray M.", 
   {}, 
   112748, 
   null, 
   1114568220.0
  ], 
  [
   112785, 
   null, 
   "gnojek", 
   "goto: \n http://evolutionfairytale.com/forum/index.php\n \n But watch out! \n You will get banned for the least little thing if you do not agree with the admins!\n \n It doesn't matter if you are totally civil.\n If you start making solid arguments for evolution or against creationism, you will be banned without notice or reply.", 
   {}, 
   112750, 
   null, 
   1114575480.0
  ], 
  [
   112789, 
   null, 
   "Ray Martinez", 
   "goto: \n http://evolutionfairytale.com/forum/index.php\n \n But watch out! \n You will get banned for the least little thing if you do not agree with the admins!\n \n It doesn't matter if you are totally civil.\n If you start making solid arguments for evolution or against creationism, you will be banned without notice or reply.\n\n \n You are absolutely correct !\n \n Ray M.", 
   {}, 
   112785, 
   null, 
   1114575840.0
  ], 
  [
   112831, 
   null, 
   "Clive14", 
   "Slave:\n \n Any SCIENTIST whether creationist or Darwinian cannot represent the ID/Creationist side.\n \n ONLY creationist theologians and philosophers can.\nWow a statement that is both honest and correct from a creationist! Will wonders never cease!\n \n \nPhilosophy is king - not science.\nOh, it was going so well too :(\n \n \nI happen to be a theology and philosophy major.\nThat figures emoticon_rolleyes", 
   {}, 
   112750, 
   null, 
   1114590960.0
  ], 
  [
   112832, 
   null, 
   "Clive14", 
   "You are absolutely correct !\n \n Ray M.\nAnd you think this a good thing? It just shows the weak cowardly position of the creationist.", 
   {}, 
   112789, 
   null, 
   1114591080.0
  ], 
  [
   112843, 
   null, 
   "Close_slave_can", 
   "Hi Slave:\n \n I am right here.\n \n Ray M.\n\n \n O.K. what is wrong with only restricting yourself to what you can measure when you talk about science. You should never do this all the time for example if deciding what is good and evil what would you \"measure\".", 
   {}, 
   112748, 
   null, 
   1114597140.0
  ], 
  [
   112904, 
   null, 
   "trebor", 
   "You are absolutely correct !\n \n Ray M.\n\n \n Yes, you do know all about being banned, don\\'t you.", 
   {}, 
   112789, 
   null, 
   1114614660.0
  ], 
  [
   112926, 
   null, 
   "unkerpaulie", 
   "ill be happy to answer any questions to the best of my knowledge and experience", 
   {}, 
   112712, 
   null, 
   1114619520.0
  ], 
  [
   112928, 
   null, 
   "unkerpaulie", 
   "O.K. what is wrong with only restricting yourself to what you can measure when you talk about science. You should never do this all the time for example if deciding what is good and evil what would you \"measure\".\n\n science can only talk about what is measureable. religion gets to take the rest. sometimes the domains overlap, and theres usually a conflict, but science wins ultimately. things like good, evil, the afterlife and the spiritual realm are trademarks of religion and cannot be used by science without written consent by the owner", 
   {}, 
   112843, 
   null, 
   1114619700.0
  ], 
  [
   112949, 
   null, 
   "Waxy", 
   "Slave:\n \n Any SCIENTIST whether creationist or Darwinian cannot represent the ID/Creationist side.\n \n ONLY creationist theologians and philosophers can.\n \n Philosophy is king - not science.\n \n I happen to be a theology and philosophy major.\n \n Ray M.\n\n \n Not to hard to figure that one out given your posts. :p \n \n Good luck with the philosophisizing, I hear you guys can name your price these days. :p \n \n Waxy", 
   {}, 
   112750, 
   null, 
   1114621380.0
  ], 
  [
   112959, 
   null, 
   "trebor", 
   "Not to hard to figure that one out given your posts. :p \n \n Good luck with the philosophisizing, I hear you guys can name your price these days. :p \n \n Waxy\n\n \n \n Particularly with the strong ability to have good two way communications. :p", 
   {}, 
   112949, 
   null, 
   1114622400.0
  ], 
  [
   112965, 
   null, 
   "pandion", 
   "I never get any answers here, It does not matter if I ask, beg or demand creationists never answer my questions. What is up with that? Are they more talkative on pro creation forums?\n\n Not really. What happens is that you have to lurk on most creationist forums and see if one of your questions is answered. As was pointed out, asking a specific question that the creationist moderators feel shows an anti-creation attitude can get you banned.\n \n Even if not, many of your questions are not answerable from a creationist perspective. For example, \"where did the water come from and where did it go\" never receives a rational reply. There will be lots of just-so stories about vapor canapies and fountains of the deep and the raising and lowering of continents and sea floors, and instantaneous mountain building and runaway plate tectonics and the like, but none of the answers will be satisfactory. When all is said and done, creationists will fall back on mythology and magic.\n \nAny SCIENTIST whether creationist or Darwinian cannot represent the ID/Creationist side.\n \n ONLY creationist theologians and philosophers can.\nWow a statement that is both honest and correct from a creationist! Will wonders never cease!\n\n Yes, but the statement directly contradicts proponents of \"creation science\" and of ID. Their claim is that they are doing science, even though they can't show how. Scientists have claimed all along that creationists/IDers are doing philosophy and religion, but not science. That is the problem. They never offer any evidence that supports their assertions, only mythology and superstition.\n \n But now we have Ray admitting that creationism and ID are not science and can't be included in science. They either philosophy or theology, but not science.\n \nI happen to be a theology and philosophy major.\n\n Well, that explains the scientific illiteracy but it doesn't explain the bizarre theology and the weak understanding of philosophy.", 
   {}, 
   112712, 
   null, 
   1114622820.0
  ], 
  [
   113125, 
   null, 
   "Herbalizer", 
   "Is this forum run by conservatives? I'm new here and I'd like to know what I'm dealing with before I get banned/censored. \n \n You can ask logical questions to creationists until you turn blue in the face. Every answer they give you always comes down to one thing, FAITH. That is the last word and always will be the last word.", 
   {}, 
   112965, 
   null, 
   1114639080.0
  ], 
  [
   113130, 
   null, 
   "Duo_Maxwell", 
   "Don't be stupid and you won't get mocked. \n \n Other then that the rules are actually not enforced very well.", 
   {}, 
   113125, 
   null, 
   1114639320.0
  ], 
  [
   113131, 
   null, 
   "Kronus", 
   "Is this forum run by conservatives? I'm new here and I'd like to know what I'm dealing with before I get banned/censored. \n \n You can ask logical questions to creationists until you turn blue in the face. Every answer they give you always comes down to one thing, FAITH. That is the last word and always will be the last word.\n\n \n Welcome!\n \n I don't know the politics of the people who run the forum, but the only things that will get you banned are bad language and personal attacks of an excessive nature. At least, as far as I know.", 
   {}, 
   113125, 
   null, 
   1114639380.0
  ], 
  [
   113182, 
   null, 
   "Ray Martinez", 
   "And you think this a good thing? It just shows the weak cowardly position of the creationist.\n\n \n No Clive it is not a good thing. It is a very bad thing.\n \n I argued against Calvinism as calm and politely as possible. In response, the resident Calvinian Admin threw a tantrum and pontificated that I was advocating heresy contrary to established Protestant Doctrine.\n \n But obviously this is all about debate.\n \n They censored me and penalized via my posts were submitted for Mod review before being posted.\n \n I resigned my membership.\n \n These particular YEC's have no sense of what a debate board is about - absolutely clueless.\n \n But if you go to IIDB they are just about the same - only atheists.\n \n Ray M.", 
   {}, 
   112832, 
   null, 
   1114647960.0
  ], 
  [
   113216, 
   null, 
   "Close_slave_can", 
   "Ray would you mind answering the question I asked before, repeated below for your convenience. \n \n What is wrong with only restricting yourself to what you can measure when you talk about science. You should never do this all the time for example if deciding what is good and evil what would you \"measure\".", 
   {}, 
   112843, 
   null, 
   1114650900.0
  ], 
  [
   113220, 
   null, 
   "Ray Martinez", 
   "O.K. what is wrong with only restricting yourself to what you can measure when you talk about science. You should never do this all the time for example if deciding what is good and evil what would you \"measure\".\n\n \n Hi Slave:\n \n There isn't a question mark in your comment.\n \n But I think you are conflating science and the age-old debate about good and evil.\n \n The Bible defines evil two ways: Lack of perfection = sin = evil.\n \n Or, not doing what God says = evil.\n \n I think you probably know this (I didn't say agree).\n \n Anyway,\n \n Ray M.", 
   {}, 
   112843, 
   null, 
   1114651200.0
  ], 
  [
   113227, 
   null, 
   "Close_slave_can", 
   "whoops I should have put in a question mark. \n \n I still don't understand the creationist position. Inbreeding contradicts the Bible so why don't creationists complain about that?", 
   {}, 
   113220, 
   null, 
   1114653360.0
  ], 
  [
   113327, 
   null, 
   "victorpride", 
   "Where did the water come from? \n \n It was already there you XXXXX.\n \n Can you say Ice Age?\n \n Where did it go? \n \n It's still here you XXXXX. Ever heard of ice caps? Aquifers? \n \n Why do you think that every major culture that existed from that period on has what is called a \"flood myth?\" For the love of sanity, learn some anthropology and STFU.\n \n Scientific evidence exists supporting a worldwide massive flood at or around the time defined biblically. That doesn't mean that it was a decision by a wrath-driven god to destroy the world, but it did happen.\n \n Also, only a misinformed imbecile or a damned liar would say that no scientist can be a creationist and no creationist can be a scientist.\n \n *wonders if he'll be banned for this haha :P*", 
   {}, 
   113227, 
   null, 
   1114675860.0
  ], 
  [
   113329, 
   null, 
   "Duo_Maxwell", 
   "actually, there's no evidence of a world wide flood.", 
   {}, 
   113327, 
   null, 
   1114676460.0
  ], 
  [
   113361, 
   null, 
   "trebor", 
   "Where did the water come from? \n \n It was already there you XXXXX.\n \n Can you say Ice Age?\n \n Where did it go? \n \n It's still here you XXXXX. Ever heard of ice caps? Aquifers? \n \n Why do you think that every major culture that existed from that period on has what is called a \"flood myth?\" For the love of sanity, learn some anthropology and STFU.\n \n Scientific evidence exists supporting a worldwide massive flood at or around the time defined biblically. That doesn't mean that it was a decision by a wrath-driven god to destroy the world, but it did happen.\n \n Also, only a misinformed imbecile or a damned liar would say that no scientist can be a creationist and no creationist can be a scientist.\n \n *wonders if he'll be banned for this haha :P*\n\n \n \n Of course, I would be vastly interested in scientific evidence that supports a world wide massive flood. I know there is evidence of massive local floods, including the flooding of the dead sea and the black sea, but that is hardly world wide.", 
   {}, 
   113327, 
   null, 
   1114697280.0
  ], 
  [
   113383, 
   null, 
   "Kronus", 
   "\n Why do you think that every major culture that existed from that period on has what is called a \"flood myth?\" For the love of sanity, learn some anthropology and STFU.\n \n\n \n Because every ancient culture has an end of the world story, and it's generally based on the most powerful natural force in the area. For the Norse it's a never ending winter. For the Arabs in the desert, it's an all encompassing fire. And for the earliest cultures, all of which started on rivers, it's a flood.\n \n And of course your claims that enough water to cover the worlds mountatins is contained in the ice caps and aquifers, as well as your claim that there's any evidence for a world wide flood, is simply hokum. People are always showing up here making those claims, and then disappearing when pressed for a single shred of evidence. Can we expect better from you?", 
   {}, 
   113327, 
   null, 
   1114700640.0
  ], 
  [
   113385, 
   null, 
   "unkerpaulie", 
   "whoops I should have put in a question mark. \n \n I still don't understand the creationist position. Inbreeding contradicts the Bible so why don't creationists complain about that?\n\n when does inbreedig contradict the bible? there are lots of cases of family relations, God sanctioning the marriage of men with their nieces, cousins and even sisters (i think, not sure about the sisters). the entire nation of israel is one family. the only case of God cursing an inbred offspring that i can think of is the children of the daughters of Lot (and that could also be a just-so made up story so that the israelites could justify why they were supposed to kill out the ammonites and moabites...)", 
   {}, 
   113227, 
   null, 
   1114700760.0
  ], 
  [
   113399, 
   null, 
   "unkerpaulie", 
   "Where did the water come from? \n \n It was already there you XXXXX.\n \n Can you say Ice Age?\n \n Where did it go? \n \n It's still here you XXXXX. Ever heard of ice caps? Aquifers? \n \n Why do you think that every major culture that existed from that period on has what is called a \"flood myth?\" For the love of sanity, learn some anthropology and STFU.\n \n Scientific evidence exists supporting a worldwide massive flood at or around the time defined biblically. That doesn't mean that it was a decision by a wrath-driven god to destroy the world, but it did happen.\n \n Also, only a misinformed imbecile or a damned liar would say that no scientist can be a creationist and no creationist can be a scientist.\n \n *wonders if he'll be banned for this haha :P*\n\n make the most of this screen name because it probably wont be around for long...\n \n anthropologists found the origin to the flood story. a massive flooding of the euphrates river in persia wiped out the entire area. one man named zuisudra who had packed up some of his farm animals on a little barge was saved along with his family. his survival was out of pure luck, he was a farmer and merchant that was about to sell his animals in a market across the river, and since his boat was ready just as the floods came, he managed to save himself and his animals (link)\n \n in reality, there was no world wide flood, and no need to justify any ice caps melting or aquifers erupting. in fact, the character noah was a hebrew adaptation of the original story, in which the event was glamorously exagerrated. the fact is, you wont find any ark remnants on mount ararat, nor evidence that the entire world was under water, because that never actually happened. the parts about God forwarning noah more than a century in advance, or giving him the specifications to build the ark, or adding 2 animals of every kind, was all included by the hebrew story-tellers to and flair and moral weight to the story, not because it was true\n \n you should take your own advice and do read up some anthropology", 
   {}, 
   113327, 
   null, 
   1114702320.0
  ], 
  [
   113424, 
   null, 
   "Waxy", 
   "Where did the water come from? \n \n It was already there you XXXXX.\n \n Can you say Ice Age?\n \n Where did it go? \n \n It's still here you XXXXX. Ever heard of ice caps? Aquifers? \n \n Why do you think that every major culture that existed from that period on has what is called a \"flood myth?\" For the love of sanity, learn some anthropology and STFU.\n \n Scientific evidence exists supporting a worldwide massive flood at or around the time defined biblically. That doesn't mean that it was a decision by a wrath-driven god to destroy the world, but it did happen.\n \n Also, only a misinformed imbecile or a damned liar would say that no scientist can be a creationist and no creationist can be a scientist.\n \n *wonders if he'll be banned for this haha :P*\n\n \n Thanks Vic!\n \n We need a little comic relief now and then, things were gettting pretty heavy around here. :p \n \n Waxy", 
   {}, 
   113327, 
   null, 
   1114705140.0
  ], 
  [
   113504, 
   null, 
   "pandion", 
   "Where did the water come from? \n \n It was already there you XXXXX.\n \n Can you say Ice Age?\n\n Nope. Still not enough water. We're in the end of an ice age now and even if all of the ice caps melted there wouldn't be enough water to flood the tops of the mountains. Aboout 2% of the total water on earth is tied up in ice.\n \nWhere did it go? \n \n It's still here you XXXXX. Ever heard of ice caps? Aquifers?\n\n Sorry. Still not enough water to cover the mountains. Like I said, 2% of the total water is in ice and about 1% is in fresh water - those aquifers that you mention would hold some of that.\n \n Let's do a little back of the envelope calculation. The earth has a diameter of about 12756 km or radius of 6378 km. That would make a volume of 1,086,781,292,543 cubic km (4/3&#960;r^3). Now if we increase the radius by 8.85 km (approx the height of Mt. Everest) we would get a volume of 1,091,311,568,365 cubic km. So the difference between the two would be the volume of water necessary to flood the entire earth and cover all the mountains. That would be about 4,530,275,822 cubic km of water. That's more than 4.5 billion cubic km. Now I ask again, where did all of that water come from and where did it go since the total amount of water on earth is about 1.4 billion cubic km.\n \nWhy do you think that every major culture that existed from that period on has what is called a \"flood myth?\" For the love of sanity, learn some anthropology and STFU.\n\n That's not very intelligent. I think that many civilizations arose along rivers where they built on flood plains. The concept isn't really hard for someone who has learned some anthroplolgy.\n \nScientific evidence exists supporting a worldwide massive flood at or around the time defined biblically. That doesn't mean that it was a decision by a wrath-driven god to destroy the world, but it did happen.\n\n Nonsense. There is no evidence that it happened. None. A couple hundred years ago some creationist scientists went looking for the evidence of that flood and pretty soon realized that it didn't exist. But if you think otherwise, why don't you present some of that evidence. So far all we can tell about you is that you aren't very bright and you talk a lot without learning what you are talking about.\n \nAlso, only a misinformed imbecile or a damned liar would say that no scientist can be a creationist and no creationist can be a scientist.\n\n Since you are the only one who has made such a statement, where does that place you? Do you have a reading problem?\n \n*wonders if he'll be banned for this haha :P*\n\n Possibly, but I won't report you. We needed more comic relief here. Now you and Ray make a matched set. But somewhere there is a village missing its idiot now that you are here.", 
   {}, 
   113424, 
   null, 
   1114711920.0
  ], 
  [
   113536, 
   null, 
   "sinjin", 
   "But somewhere there is a village missing its idiot now that you are here.\n\n \n By my count an entire village of, as you say, has been relocated to 4forums recently.", 
   {}, 
   113504, 
   null, 
   1114714200.0
  ], 
  [
   113557, 
   null, 
   "jim's trucking", 
   "By my count an entire village of, as you say, has been relocated to 4forums recently.\nCorrectomoondo! Gameboys at that!", 
   {}, 
   113536, 
   null, 
   1114715520.0
  ], 
  [
   113596, 
   null, 
   "Ray Martinez", 
   "whoops I should have put in a question mark. \n \n I still don't understand the creationist position. Inbreeding contradicts the Bible so why don't creationists complain about that?\n\n \n Slave:\n \n What is \"inbreeding\" ?\n \n Ray M.", 
   {}, 
   113227, 
   null, 
   1114721880.0
  ], 
  [
   113605, 
   null, 
   "trebor", 
   "Slave:\n \n What is \"inbreeding\" ?\n \n Ray M.\n\n \n \n It is when your family tree does not have any branches.", 
   {}, 
   113596, 
   null, 
   1114723860.0
  ], 
  [
   113687, 
   null, 
   "Close_slave_can", 
   "google search\n Endangered species inbreeding\n you will get 53000 hits. \n They all state how having very small populations is a tricky situation. I don't see how people can say evolution contradicts the stories adam and noah ark but not say inbreeding does.", 
   {}, 
   113605, 
   null, 
   1114729680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Where can I go to ask creationists questions?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4949-where-can-i-go-ask-creationists-questions.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 4949, 
  "discussion_files": [
   [
    "16507.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4949-where-can-i-go-ask-creationists-questions-print.html"
   ], 
   [
    "16508.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4949-where-can-i-go-ask-creationists-questions-3-print.html"
   ], 
   [
    "16509.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4949-where-can-i-go-ask-creationists-questions-2-print.html"
   ]
  ], 
  "identifier": 4949
 }
]