[
 [
  [
   112897, 
   null, 
   "joebrummer", 
   "Violence Against Gays On The Rise\n \n by 365Gay.com Newscenter Staff \n \n Posted: April 26, 2005 8:30 pm ET \n (New York City) The National Coalition of Anti-Violence Programs released its annual report Tuesday on violence against lesbians, gay men, bisexual people and transgender individuals.\n \n The report was compiled by NCAVP and fifteen of its members across the country.\n \n NCAVP's report is the most complete examination of such violence against LGBT people. Each year, the FBI publishes its own report on hate crimes, which includes anti-LGBT incidents, but it consistently contains information on far fewer cases than the NCAVP publication because it relies on law enforcement reports of such crimes rather than victim service organization data.\n \n The 90-page report examines data compiled from almost 2,000 hate-related incidents in eleven cities, states and regions across the country: the Chicago area, Cleveland and Columbus, Ohio, Colorado, Houston, Texas, Massachusetts, Michigan, Minnesota, the New York City area, Pennsylvania and the San Francisco Bay area. Additional information was included from Kansas City and St. Louis, Missouri, Tucson, Arizona and Vermont.\n \n Overall, NCAVP's report noted a 4% increase in reported incidents of anti-LGBT violence. Such incidents rose from 1,720 in 2003 to 1,792 in 2004. \n \n Included in rise in incidents for the year, was an 11% increase in anti-LGBT murders, which rose from 18 in 2003 to 20 in 2004. During 2004, the total number of victims rose 4%, from 2,042 in 2003 to 2,131 in 2004. \n \n Of the eleven locations included in the report, eight reported increases in incidents. According to the report, the number of anti-LGBT violence offenders rose also rose, by 7%, from 2,467 to 2,637.\n \n According to NCAVP representatives, the data collected in for 2004 confirms that a dramatic rise in anti-LGBT hate incidents noted by the organization in the second half of 2003 continued unabated, and perhaps even worsened in throughout 2004.\n \n \"This year's report has to be viewed as a follow-up to our report from a year ago,\" said Clarence Patton, NCAVP's Acting Executive Director.\n \n \"In the last edition of this report it became all too clear that with respect to violence, the nation's LGBT communities had entered a very new, and very dangerous era in which all of us were under attack at levels not seen in recent years,\" Patton. said.\n \n NCAVP's report on hate violence in 2003 detailed the rapid shift and 26% increase in anti-LGBT violence as the nation responded politically and violently such victories for the community as the striking down of sodomy laws across the country and the right for same-sex couples to marry in Massachusetts.\n \n The 2004 report looks at the continuation of that atmosphere, which lasted through numerous anti-lesbian and gay state ballot initiatives, a Presidential call for a constitutional amendment banning same-sex marriage, and the demonization of lesbians and gay men in particular in the 2004 election cycle.\n \n The National Gay and Lesbian Task Force says the blame lies with conservative religious groups.\n \n \"The literal blood of the thousands of gay people physically wounded by hate during 2004 is on the hands of Jerry Falwell, James Dobson, Tony Perkins, and so many others who spew hate for partisan gain and personal enrichment,\" said NGLTF Executive Director Mat Foreman.\n \n ©365Gay.com 2005", 
   {
    "post_info": {
     "post_title": "Violence Against Gays On The Rise"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1114614060.0
  ], 
  [
   112920, 
   null, 
   "jyoshu", 
   "Violence Against Gays On The Rise\n \n by 365Gay.com Newscenter Staff \n \n Posted: April 26, 2005 8:30 pm ET \n (New York City) The National Coalition of Anti-Violence Programs released its annual report Tuesday on violence against lesbians, gay men, bisexual people and transgender individuals.\n \n The report was compiled by NCAVP and fifteen of its members across the country.\n \n NCAVP's report is the most complete examination of such violence against LGBT people. Each year, the FBI publishes its own report on hate crimes, which includes anti-LGBT incidents, but it consistently contains information on far fewer cases than the NCAVP publication because it relies on law enforcement reports of such crimes rather than victim service organization data.\n \n The 90-page report examines data compiled from almost 2,000 hate-related incidents in eleven cities, states and regions across the country: the Chicago area, Cleveland and Columbus, Ohio, Colorado, Houston, Texas, Massachusetts, Michigan, Minnesota, the New York City area, Pennsylvania and the San Francisco Bay area. Additional information was included from Kansas City and St. Louis, Missouri, Tucson, Arizona and Vermont.\n \n Overall, NCAVP's report noted a 4% increase in reported incidents of anti-LGBT violence. Such incidents rose from 1,720 in 2003 to 1,792 in 2004. \n \n Included in rise in incidents for the year, was an 11% increase in anti-LGBT murders, which rose from 18 in 2003 to 20 in 2004. During 2004, the total number of victims rose 4%, from 2,042 in 2003 to 2,131 in 2004. \n\n \n Before we jump to any conclusions, this needs to be put in perspective. There were 1720 violent crimes against gay people in 2003, supposedly due to hate (though that's often hard to judge). But there were 1.4 million violent crimes committed period, in 2003 (http://www.cbsnews.com/stories/2004/10/25/national/main651164.shtml?cmp=EM8706). That's a percentage of 0.12%. What that means is that among violent crimes overall, violent hate crime against gay people is very rare. There's no reason to believe 2004 would be any different in that regard.\n \n Other interesting facts from http://www.fbi.gov/ucr/03hc.pdf:\n \n - There are more incidents of crimes of hate against religious people in the U.S. than gay people\n \n - By far most hate crimes are over race or single-bias incidents\n \n - Among the crimes against gay people specifically, only 6 out of the 1430 crimes noted were murders. Most were \"simple assaults\" and \"intimidation\" (which is very hard to judge by evidence). \n \n \n\"In the last edition of this report it became all too clear that with respect to violence, the nation's LGBT communities had entered a very new, and very dangerous era in which all of us were under attack at levels not seen in recent years,\" Patton. said.\n\n \n A \"very, very dangerous era?\" Of course any violent crime is too much, but let's be realistic--it wasn't THAT much of a jump in the overall scheme of things.\n \n \nThe National Gay and Lesbian Task Force says the blame lies with conservative religious groups.\n\n \n Well, that was predictable. They blame just about everything bad in the world on religious conservatives, don't they? They probably think religious conservatives should be blamed for world hunger, tornados, tsunamis and eathquakes too. emoticon_rolleyes It's sad that these gay-lobby groups would take something like this and use it as a chance to lash out at groups THEY hate. If they put nearly as much effort into combatting violence against gay people as they do lashing out at conservatives at any given opportunity, they might start seeing some effective change for once.", 
   {
    "unicode_changes_made": true
   }, 
   112897, 
   null, 
   1114618740.0
  ], 
  [
   112924, 
   null, 
   "wsm2506", 
   "Well, that was predictable. They blame just about everything bad in the world on religious conservatives, don't they? They probably think religious conservatives should be blamed for world hunger, tornados, tsunamis and eathquakes too. emoticon_rolleyes It's sad that these gay-lobby groups would take something like this and use it as a chance to lash out at groups THEY hate. If they put nearly as much effort into combatting violence against gay people as they do lashing out at conservatives at any given opportunity, they might start seeing some effective change for once.\n\n \n And just who are the major purveyors of homophobia and hate?", 
   {}, 
   112920, 
   null, 
   1114619520.0
  ], 
  [
   112938, 
   null, 
   "Jo Bennett", 
   "One reason (reported) violence against gays is not higher is likely to be that it's very difficult to spot a gay person just by looking, whereas racists can spot potential targets on sight. Plus only 11 areas were included in the report.", 
   {}, 
   112924, 
   null, 
   1114620120.0
  ], 
  [
   112945, 
   null, 
   "jyoshu", 
   "One reason (reported) violence against gays is not higher is likely to be that it's very difficult to spot a gay person just by looking, whereas racists can spot potential targets on sight. Plus only 11 areas were included in the report.\n\n \n True but the same can be said for religious people as well.\n \n And single-bias incidents which comprise the most could be anything.\n \n The bottom line is that hate crime reporting is always going to be somewhat suspect, no matter what the results are. It's a very subjective area.", 
   {}, 
   112938, 
   null, 
   1114620600.0
  ], 
  [
   112951, 
   null, 
   "wsm2506", 
   "True but the same can be said for religious people as well.\n \n And single-bias incidents which comprise the most could be anything.\n \n The bottom line is that hate crime reporting is always going to be somewhat suspect, no matter what the results are. It's a very subjective area.\n\n \n So you think violence against gay people should just be ignored?", 
   {}, 
   112945, 
   null, 
   1114621500.0
  ], 
  [
   112961, 
   null, 
   "joebrummer", 
   "\n \n Well, that was predictable. They blame just about everything bad in the world on religious conservatives, don't they? They probably think religious conservatives should be blamed for world hunger, tornados, tsunamis and eathquakes too. emoticon_rolleyes It's sad that these gay-lobby groups would take something like this and use it as a chance to lash out at groups THEY hate. If they put nearly as much effort into combatting violence against gay people as they do lashing out at conservatives at any given opportunity, they might start seeing some effective change for once.\n\n \n \n \n That's funny you should say this, the christian conservatives blame everything bad in the world on gays. We have been blamed for earthquakes, fires, Sept 11th, hurricanes in Florida. Pope John Paul the II even called us the axis of evil.", 
   {}, 
   112920, 
   null, 
   1114622520.0
  ], 
  [
   112990, 
   null, 
   "Voice Of Reason", 
   "I do not believe that any violence against gays has increased because of religeous groups.......That said I beleive that violence against anyone be they gay or straight should be prosecuted to the full extent of the law.........\n \n I do believe although I don't condone it that some gays bring violence upon themselves by flaunting their sexuality ib gay pride parades, etc.........I even had a couple of gay co workers that felt the same way.....\n \n That is my opinion........", 
   {}, 
   112961, 
   null, 
   1114624440.0
  ], 
  [
   112992, 
   null, 
   "wilted_laughter", 
   "\n I do believe although I don't condone it that some gays bring violence upon themselves by flaunting their sexuality ib gay pride parades, etc.........I even had a couple of gay co workers that felt the same way.....\n\n \n Give this man a prize for intolerance.", 
   {}, 
   112990, 
   null, 
   1114624620.0
  ], 
  [
   112997, 
   null, 
   "Jo Bennett", 
   "I do not believe that any violence against gays has increased because of religeous groups.......That said I beleive that violence against anyone be they gay or straight should be prosecuted to the full extent of the law.........\n \n I do believe although I don't condone it that some gays bring violence upon themselves by flaunting their sexuality ib gay pride parades, etc.........I even had a couple of gay co workers that felt the same way.....\n \n That is my opinion........\n\n \n I suppose you thought the black pride marchers in the 60s deserved to get beaten up. And that women who wear short skirts invite rapists. emoticon_rolleyes", 
   {}, 
   112990, 
   null, 
   1114624800.0
  ], 
  [
   112998, 
   null, 
   "joebrummer", 
   "I do not believe that any violence against gays has increased because of religeous groups.......That said I beleive that violence against anyone be they gay or straight should be prosecuted to the full extent of the law.........\n \n I do believe although I don't condone it that some gays bring violence upon themselves by flaunting their sexuality ib gay pride parades, etc.........I even had a couple of gay co workers that felt the same way.....\n \n That is my opinion........\n\n \n \n As the victim of two bashings in my life, one that almost killed me. I have to say no one brings violence on themself.\n \n Second as most importantly, many of the victims of hate crimes against gays are NOT GAY!!!!!! It is about what people percieve. If they THINK you are gay, if they THINK you are Jewish, if they THINK.........\n \n You yourself could be the victim of a gay hate crime if for any reason someone THINKS you are gay because of the way you walk, dress, talk, etc...\n \n The above statement is your ignorance of gay related thing, showing completely how uninformed you really are on these issues. Do you have any other stupid things to say!", 
   {}, 
   112990, 
   null, 
   1114624800.0
  ], 
  [
   112999, 
   null, 
   "Voice Of Reason", 
   "One reason (reported) violence against gays is not higher is likely to be that it's very difficult to spot a gay person just by looking, whereas racists can spot potential targets on sight. Plus only 11 areas were included in the report.\n\n \n Excellent points Jo but sometimes gay people flaunt their sexuality.......I am not saying that is and excuse for violence against them but it happens.......", 
   {}, 
   112938, 
   null, 
   1114625100.0
  ], 
  [
   113002, 
   null, 
   "Jo Bennett", 
   "Excellent points Jo but sometimes gay people flaunt their sexuality.......I am not saying that is and excuse for violence against them but it happens.......\n\n \n Gsys flaunt their sexuality like blacks flaunt their skin colour. The loud and proud movement is a response to homophobia and discrimination, not the cause of it.", 
   {}, 
   112999, 
   null, 
   1114625280.0
  ], 
  [
   113004, 
   null, 
   "Voice Of Reason", 
   "he above statement is your ignorance of gay related thing, showing completely how uninformed you really are on these issues. Do you have any other stupid things to say!\n[/QUOTE] \n \n I have no clue what your talking about..........Did you even read what I said before you attacked me?\n \n What am I and my gay co workers ignorant about? what stupid things did I say?", 
   {}, 
   112999, 
   null, 
   1114625340.0
  ], 
  [
   113009, 
   null, 
   "Voice Of Reason", 
   "Gsys flaunt their sexuality like blacks flaunt their skin colour. The loud and proud movement is a response to homophobia and discrimination, not the cause of it.\n\n \n African Americans don't have to flaunt the skin color......It is there to see.....They can't hide it..........In some cases like I said gays flaunt their sexuality........Don't get me wrong that is no excuse to perform violence against them.....Like I said in another post violence against anyone be they straight or gay should be prosectured to the full extent of the law.......", 
   {}, 
   113002, 
   null, 
   1114625580.0
  ], 
  [
   113021, 
   null, 
   "jitobear", 
   "Well, that was predictable. They blame just about everything bad in the world on religious conservatives, don't they? They probably think religious conservatives should be blamed for world hunger, tornados, tsunamis and eathquakes too. emoticon_rolleyesIt's sad that these gay-lobby groups would take something like this and use it as a chance to lash out at groups THEY hate. If they put nearly as much effort into combatting violence against gay people as they do lashing out at conservatives at any given opportunity, they might start seeing some effective change for once.\n\n \n \n Well - let's see. How about we let these religious conservatives speak for themselves?\n \n Please explain to me how the following misinformation and insults are anything but hate propganda?\n \n The accusations againts these folks by anyone who cherishes tolerance is absolutely justified. They preach hate. Period. \n \n Jerry Fallwell:\n \n Homosexuality is Satan's diabolical attack upon the family that will not only have a corrupting influence upon our next generation, but it will also bring down the wrath of God upon America.\n \n I really believe that the pagans, and the abortionists, and the feminists, and the gays and the lesbians who are actively trying to make that an alternative lifestyle, the ACLU, People for the American Way -- all of them who have tried to secularize America -- I point the finger in their face and say, \"You helped this happen.\" (regarding 9/11)\n \n AIDS is the wrath of a just God against homosexuals. To oppose it would be like an Israelite jumping in the Red Sea to save one of Pharoah's chariotters.\n \n I do not believe the homosexual community deserves minority status. One's misbehavior does not qualify him or her for minority status.\n \n Pat Robertson:\n \n \"[Homosexuals] want to come into churches and disrupt church services and throw blood all around and try to give people AIDS and spit in the face of ministers.\"\n \n \"Many of those people involved with Adolf Hitler were Satanists, many of them were homosexuals - the two things seem to go together.\"\n \n \"When you see the rise of blatant open homosexuality and lesbianism, what you also know is God has given a society up...and we're at the mercy of the elements, the mercy of war, the mercy of economic disaster.\"\n \n \"N.O.W. is saying that in order to be a woman, you've got to be a lesbian.\"\n \n Solid, irrefutable evidence proves that there are lethal consequences to engaging in the defining features of male homosexuality-that is, promiscuity.\n \n James Dobson:\n \n But we've already established that, in general, homosexuals are more promiscuous than heterosexuals. (although he listed stats on the # partners one study showed gay men had - it did not list the same stats for lesbians or heterosexuals).\n \n They have been wounded by rejection and, in general, seem to say whatever it takes to be considered \"normal.\"\n \n And Dobson's propagation of misinformation on AIDS was declared \"despicable\" by former Surgeon General Everett Koop\n \n Tony Perkins:\n \n Nor is it \"loving\" to suppress evidence that homosexual behavior is a \"death-style\" that is sending young people to an early grave.\"\n \n \"...one of the primary goals of the homosexual rights movement is to abolish all age of consent laws and to eventually recognize pedophiles as the 'prophets' of a new sexual order.\" --\"Homosexual Behavior & Pedophilia,\" a FRC publication, July 1999\n \n Children raised in homosexual households are more likely to experiment with homosexuality, to be sexually promiscuous, and to have behavioral and many other developmental problems\n \n Dr. Laura\n \n Sexual deviations are not culture. They're sexual deviations.\n \n It's dysfunctional, it's deviant. According to religion it is not moral. But biologically it is clearly an error.\n \n A huge portion of the male homosexual populace is predatory on young boys.\n \n If you're gay or lesbian it's a biological error.\n \n This is a travesty that these two lesbians were given two little children, intentionally depriving them of a father. It's despicable. It's unhealthy.", 
   {
    "unicode_changes_made": true
   }, 
   112920, 
   null, 
   1114626720.0
  ], 
  [
   113025, 
   null, 
   "joebrummer", 
   "\n \n \n I have no clue what your talking about..........Did you even read what I said before you attacked me?\n \n What am I and my gay co workers ignorant about? what stupid things did I say?[/QUOTE]\n \n \n You said:\n \nI do believe although I don't condone it that some gays bring violence upon themselves\n\n \n As I have pointed out many of the victims of gay hate crimes are not gay!!!\n \n What were the flaunting?", 
   {}, 
   113004, 
   null, 
   1114627140.0
  ], 
  [
   113051, 
   null, 
   "JustineCredible", 
   "I do not believe that any violence against gays has increased because of religeous groups.......That said I beleive that violence against anyone be they gay or straight should be prosecuted to the full extent of the law.........\n \n I do believe although I don't condone it that some gays bring violence upon themselves by flaunting their sexuality ib gay pride parades, etc.........I even had a couple of gay co workers that felt the same way.....\n \n That is my opinion........\n\n \n \n So are blacks bringing violence against them upon themselves for continueing to have dark skin? Are jews bringing violence upon themselves for wearing their skull caps? Are Muslims bringing violence upon themselves for wearing their head coverings (since there are more than one type)? Are women bringing violence upon themselves for having \"internal plumbing\" (to put it politely)? Do children bring violence upon themselves for being small? \n \n Your view is skewed. \n \n Irish have St. Patrick's Day Parades. Usually drunken displays of green everywhere.\n Mardi Gras is a sexually and alcoholic charged even, but it's RELIGIOUS, in nature! \n Are you saying that just because Gays have Pride parades that they \"ask for it\" in respect to violent acts? \n \n No, this is where your intollerence and hate really shows it's true colors.", 
   {}, 
   112990, 
   null, 
   1114630440.0
  ], 
  [
   113052, 
   null, 
   "JustineCredible", 
   "Excellent points Jo but sometimes gay people flaunt their sexuality.......I am not saying that is and excuse for violence against them but it happens.......\n\n \n So what? \n \n Blacks flaunt being black. Women Flaunt being women. Jews flaunt being jewish. \n It's called having pride in who you are, where you come from, your community, your history. \n If you don't like it, look the other way. It's really simple.", 
   {}, 
   112999, 
   null, 
   1114630620.0
  ], 
  [
   113055, 
   null, 
   "jyoshu", 
   "Well - let's see. How about we let these religious conservatives speak for themselves?\n \n Please explain to me how the following misinformation and insults are anything but hate propganda?\n \n The accusations againts these folks by anyone who cherishes tolerance is absolutely justified. They preach hate. Period.\n\n \n What does that have to do with blaming people for violence against gays? Some of them I agree with on some points (and disagree on others), but it doesn't make me want to go out and commit acts of violence. Just because someone speaks out on an issue, it doesn't mean they should be blamed for every act of violence that comes along pertaining to that issue. None of them told anyone they should go and kill gay people--for any of the 6 murders last year.", 
   {}, 
   113021, 
   null, 
   1114630800.0
  ], 
  [
   113056, 
   null, 
   "wsm2506", 
   "What does that have to do with blaming people for violence against gays? Some of them I agree with on some points (and disagree on others), but it doesn't make me want to go out and commit acts of violence. Just because someone speaks out on an issue, it doesn't mean they should be blamed for every act of violence that comes along pertaining to that issue. None of them told anyone they should go and kill gay people--for any of the 6 murders last year.\n\n \n It's called \"incitement\".", 
   {}, 
   113055, 
   null, 
   1114630920.0
  ], 
  [
   113059, 
   null, 
   "jyoshu", 
   "It's called \"incitement\".\n\n \n Oh please. I suppose next you'll be blaming the Manson murders on the Beetles instead of Manson . . . (http://www.law.umkc.edu/faculty/projects/ftrials/manson/mansonbeatles.html)", 
   {}, 
   113056, 
   null, 
   1114631520.0
  ], 
  [
   113067, 
   null, 
   "JustineCredible", 
   "Oh please. I suppose next you'll be blaming the Manson murders on the Beetles instead of Manson . . . (http://www.law.umkc.edu/faculty/projects/ftrials/manson/mansonbeatles.html)\n\n \n \n That's about as likely as the single shooter therory for the Kennedy Assassination.", 
   {}, 
   113059, 
   null, 
   1114632300.0
  ], 
  [
   113073, 
   null, 
   "Voice Of Reason", 
   "I suppose you thought the black pride marchers in the 60s deserved to get beaten up. And that women who wear short skirts invite rapists. emoticon_rolleyes\n\n \n Nope, neither, but the comparison to African Americans is interesting...........The African Americans I know are offended by Liberals and Gays comparing their fight for equal rights to theirs.........", 
   {}, 
   112997, 
   null, 
   1114632720.0
  ], 
  [
   113075, 
   null, 
   "Voice Of Reason", 
   "Give this man a prize for intolerance.\n\n \n With all due respect it sounds like me you are the intolerant one.........All I ask is when violence is committed against any person the punishment be the same......", 
   {}, 
   112992, 
   null, 
   1114632840.0
  ], 
  [
   113076, 
   null, 
   "Voice Of Reason", 
   "Gsys flaunt their sexuality like blacks flaunt their skin colour. The loud and proud movement is a response to homophobia and discrimination, not the cause of it.\n\n \n I guess you have never seen one of the gay rights parades in Seattle or Seattle..........If you did you might change your opinion.....", 
   {}, 
   113002, 
   null, 
   1114633020.0
  ], 
  [
   113077, 
   null, 
   "JakeCJB", 
   "I do not believe that any violence against gays has increased because of religeous groups.......That said I beleive that violence against anyone be they gay or straight should be prosecuted to the full extent of the law.........\n \n I do believe although I don't condone it that some gays bring violence upon themselves by flaunting their sexuality ib gay pride parades, etc.........I even had a couple of gay co workers that felt the same way.....\n \n That is my opinion........\n\n \n No, we who are gay do not bring violence on ourselves, because we do not capitulate to violent good 'ol boy bigots. You are saying if we knew \"our place\", which is way down there, as defined by the bigots, the bigots wouldn't have to comit acts of violence against us. All victims of violence are equal in your view, but some are more equal than others. The particular group of violence victims which are part of the group you are trying to oppress, are not equal violence victims in your view.", 
   {}, 
   112990, 
   null, 
   1114633020.0
  ], 
  [
   113078, 
   null, 
   "Voice Of Reason", 
   "I have no clue what your talking about..........Did you even read what I said before you attacked me?\n \n What am I and my gay co workers ignorant about? what stupid things did I say?\n\n \n \n You said:\n \n \n As I have pointed out many of the victims of gay hate crimes are not gay!!!\n \n What were the flaunting?[/QUOTE]\n \n If they are not gay then its not a gay hate crime and the perpetrators should be prosecuted to the full extent of the law....... emoticon_confused", 
   {}, 
   113025, 
   null, 
   1114633140.0
  ], 
  [
   113081, 
   null, 
   "tonybrown74", 
   "\n \n If they are not gay then its not a gay hate crime and the perpetrators should be prosecuted to the full extent of the law....... emoticon_confused\n\n \n Um, no ...\n \n If someone assaults a person because the perpetrator believes that s/he is gay, then it is a hate crime. Whether or not the vistim is gay, bi or transgendered is irrelevent.", 
   {}, 
   113078, 
   null, 
   1114633800.0
  ], 
  [
   113084, 
   null, 
   "Voice Of Reason", 
   "Um, no ...\n \n If someone assaults a person because the perpetrator believes that s/he is gay, then it is a hate crime. Whether or not the vistim is gay, bi or transgendered is irrelevent.\n\n \n \n Come on, using that logic you can call any crime committed a hate crime against gays......", 
   {}, 
   113081, 
   null, 
   1114633980.0
  ], 
  [
   113089, 
   null, 
   "jitobear", 
   "Come on, using that logic you can call any crime committed a hate crime against gays......\n\n \n I am pretty sure the motive has to be indentified and proven as such.", 
   {}, 
   113084, 
   null, 
   1114634580.0
  ], 
  [
   113091, 
   null, 
   "wsm2506", 
   "Nope, neither, but the comparison to African Americans is interesting...........The African Americans I know are offended by Liberals and Gays comparing their fight for equal rights to theirs.........\n\n \n We've been through that BS before too. You REALLY are NOT original.\n \n Try Corretta Scott King and Julian Bond.", 
   {}, 
   113073, 
   null, 
   1114635060.0
  ], 
  [
   113101, 
   null, 
   "tonybrown74", 
   "Nope, neither, but the comparison to African Americans is interesting...........The African Americans I know are offended by Liberals and Gays comparing their fight for equal rights to theirs.........\n\n \n This is the \"sorriest\" argument I have ever heard. As if somehow the fact that people who belong to another disenfranchised group disagrees with a comparison somehow makes the comparison go away.\n \n And since you want to go there, I personally know dozens of liberal (and even a couple of consevative) black people who would disagree with your assessment.", 
   {}, 
   113073, 
   null, 
   1114636860.0
  ], 
  [
   113116, 
   null, 
   "Jo Bennett", 
   "I'm really not sure how the fact that blacks can be homophobic as much as anyone else is supposed to have any bearing on the fight for gay rights.", 
   {}, 
   113101, 
   null, 
   1114638480.0
  ], 
  [
   113119, 
   null, 
   "joebrummer", 
   "Come on, using that logic you can call any crime committed a hate crime against gays......\n\n \n \n Statistics show that many victims of bias based crime are not gay, the assailant assumed they were gay. Gay ephitets were used! Houses were spary painted with gay slurs. The victims was not gay.\n \n It is no surprise you don't know how you offended anyone, and your lying about the gay co-worker, because most gay people \"get it\" where you don't.\n \n So here is the dumb down version of my post.\n \n Imagine a heterosexual man getting beatin because his assailant \"thinks\" he is a gay man. It is still a hate crime, why? because the victim was beatin because of his percieved sexual orientation regardless if it was true or not.\n \n Now, do you get it? So I will ask again. Was the straight guy, who was beatin up because some \"thought\" he was gay flaunting. How could he..he isn't gay. Do you see that your logic of \"gays are asking for it\" is offensive when even straight people are beatin up for being gay.", 
   {}, 
   113084, 
   null, 
   1114638660.0
  ], 
  [
   113120, 
   null, 
   "tonybrown74", 
   "Come on, using that logic you can call any crime committed a hate crime against gays......\n\n \n You have a serious problem with reading comprehension.\n \n In determining whether a crime is a hate crime, you have to determine MOTIVE. MOTIVE is something that the judicial system uses all the time to determine what crime to charge them with. If a person person atacks a victim because the perpetrator THINKS that the victim is gay, then it is a hate crime. The actual orientation of the victim does not matter because the prosecution is trying to determine the reason the perpetrator attacked the victim. That is what you call MOTIVE.", 
   {}, 
   113084, 
   null, 
   1114638720.0
  ], 
  [
   113122, 
   null, 
   "joebrummer", 
   "You have a serious problem with reading comprehension.\n \n In determining whether a crime is a hate crime, you have to determine MOTIVE. MOTIVE is something that the judicial system uses all the time to determine what crime to charge them with. If a person person atacks a victim because the perpetrator THINKS that the victim is gay, then it is a hate crime. The actual orientation of the victim does not matter because the prosecution is trying to determine the reason the perpetrator attacked the victim. That is what you call MOTIVE.\n\n \n \n Exactly, now tell us how gays are asking for violence when some of the people gay bashed were not gay!", 
   {}, 
   113120, 
   null, 
   1114638840.0
  ], 
  [
   113136, 
   null, 
   "BobNelson2", 
   "None of them told anyone they should go and kill gay people--for any of the 6 murders last year.\n\n \n Not six, twenty.\n \n <<Included in rise in incidents for the year, was an 11% increase in anti-LGBT murders, which rose from 18 in 2003 to 20 in 2004. During 2004, the total number of victims rose 4%, from 2,042 in 2003 to 2,131 in 2004.<<\n \n And that doesn't even account for the entire country.", 
   {}, 
   113055, 
   null, 
   1114639860.0
  ], 
  [
   113137, 
   null, 
   "BobNelson2", 
   "I haven't heard a single opponent of hate crime prosecution for anti-gay crimes volunteer that religion and race should be removed from hate-crime classifications...\n \n Odd that.", 
   {}, 
   113136, 
   null, 
   1114639920.0
  ], 
  [
   113150, 
   null, 
   "tonybrown74", 
   "I haven't heard a single opponent of hate crime prosecution for anti-gay crimes volunteer that religion and race should be removed from hate-crime classifications...\n \n Odd that.\n\n \n Just goes to show that these people are in serious need of a rectal douche ...", 
   {}, 
   113137, 
   null, 
   1114641480.0
  ], 
  [
   113155, 
   null, 
   "jyoshu", 
   "I haven't heard a single opponent of hate crime prosecution for anti-gay crimes volunteer that religion and race should be removed from hate-crime classifications...\n \n Odd that.\n\n \n So? I haven't heard a single person say that anti-gay hate crimes should be removed as classification!", 
   {}, 
   113137, 
   null, 
   1114642080.0
  ], 
  [
   113160, 
   null, 
   "tonybrown74", 
   "So? I haven't heard a single person say that anti-gay hate crimes should be removed as classification!\n\n \n They problem is, in many jurisdictions, anti-gay hate crime legislation does not exist.\n \n Your argument is a childish one.", 
   {}, 
   113155, 
   null, 
   1114642920.0
  ], 
  [
   113168, 
   null, 
   "MrWriteLA", 
   "Bill Would Strip 'Sexual Orientation' from PA's Hate Crimes Law\n http://headlines.agapepress.org/archive/2/72005b.asp \n \n Bill would remove lesbians and gays from civil rights law (St. Paul, MN)\n http://www.gaypeopleschronicle.com/stories03/03feb14.htm", 
   {}, 
   113160, 
   null, 
   1114644120.0
  ], 
  [
   113175, 
   null, 
   "BobNelson2", 
   "So? I haven't heard a single person say that anti-gay hate crimes should be removed as classification!\n\n \n Well, don't look at me! I support hate-crime laws, I just expect them to cover sexual orientation in addition to religion, race, disability, etc.", 
   {}, 
   113155, 
   null, 
   1114645920.0
  ], 
  [
   113193, 
   null, 
   "Voice Of Reason", 
   "No, we who are gay do not bring violence on ourselves, because we do not capitulate to violent good 'ol boy bigots. You are saying if we knew \"our place\", which is way down there, as defined by the bigots, the bigots wouldn't have to comit acts of violence against us. All victims of violence are equal in your view, but some are more equal than others. The particular group of violence victims which are part of the group you are trying to oppress, are not equal violence victims in your view.\n\n \n If someone murders a gay or a straight person it is exactly the same and should be prosecuted the same............", 
   {}, 
   113077, 
   null, 
   1114649580.0
  ], 
  [
   113195, 
   null, 
   "Voice Of Reason", 
   "We've been through that BS before too. You REALLY are NOT original.\n \n Try Corretta Scott King and Julian Bond.\n\n \n Julian Bond is a rascist hate monger himself and of course there are exceptions to every rule...........", 
   {}, 
   113091, 
   null, 
   1114649760.0
  ], 
  [
   113196, 
   null, 
   "Voice Of Reason", 
   "This is the \"sorriest\" argument I have ever heard. As if somehow the fact that people who belong to another disenfranchised group disagrees with a comparison somehow makes the comparison go away.\n \n And since you want to go there, I personally know dozens of liberal (and even a couple of consevative) black people who would disagree with your assessment.\n\n \n African Americans are a race...........Gays are a class of people defined by their sexual orientation......", 
   {}, 
   113101, 
   null, 
   1114649880.0
  ], 
  [
   113198, 
   null, 
   "Voice Of Reason", 
   "I'm really not sure how the fact that blacks can be homophobic as much as anyone else is supposed to have any bearing on the fight for gay rights.\n\n \n why is it that people have have a difference opinion then you have to be homophobic? You seem like a reasonable person......Why lower yourself to that level?", 
   {}, 
   113116, 
   null, 
   1114650000.0
  ], 
  [
   113203, 
   null, 
   "BobNelson2", 
   "African Americans are a race...........Gays are a class of people defined by their sexual orientation......\n\n \n And Southern Baptists are a class of people defined by their choice of religion.\n \n All three groups are potentially subject to discrimination and all three are entitled to constitutional protections.\n \n Do you have a point?", 
   {}, 
   113196, 
   null, 
   1114650240.0
  ], 
  [
   113204, 
   null, 
   "Voice Of Reason", 
   "And Southern Baptists are a class of people defined by their choice of religion.\n \n All three groups are potentially subject to discrimination and all three are entitled to constitutional protections.\n \n Do you have a point?\n\n \n and they are by the laws on the books..........", 
   {}, 
   113203, 
   null, 
   1114650300.0
  ], 
  [
   113209, 
   null, 
   "JakeCJB", 
   "why is it that people have have a difference opinion then you have to be homophobic? You seem like a reasonable person......Why lower yourself to that level?\n\n \n Prejudiced if you prefer.", 
   {}, 
   113198, 
   null, 
   1114650540.0
  ], 
  [
   113228, 
   null, 
   "joebrummer", 
   "If someone murders a gay or a straight person it is exactly the same and should be prosecuted the same............\n\n \n \n Your right, but if the killing was done as a hate baised crime there should be stiffer penalties. If the heterosexual was killed by a gay person, just for being heterosexual there should be a stiffer penalty. You see when a gay person is beaten to a pulp (like I was..baseball bats) it is only considered an assult. The penalty in most states is small. A few months in prison and probation. With a hate crime law in place that same assult would become a few years in prison. \n \n When teenagers are going arounf \"XXXXX bashing\" for kicks on Friday night (which yes, this really happens) there needs to be stiffer penalties to discourage this.\n \n It is the same thing as having stiffer penalties for killing a police officer.", 
   {}, 
   113193, 
   null, 
   1114653660.0
  ], 
  [
   113252, 
   null, 
   "Voice Of Reason", 
   "Prejudiced if you prefer.\n\n \n Why because I believe that marriage should remained defined as between a man and a woman?\n \n And that if the definition is changed it should be done through the legislature and not activist judges..........\n \n Does that make me prejudiced?", 
   {}, 
   113209, 
   null, 
   1114658280.0
  ], 
  [
   113253, 
   null, 
   "Voice Of Reason", 
   "\n Your right, but if the killing was done as a hate baised crime there should be stiffer penalties\n \n \n How can you get a stiff emoticon_confused er penalty then the death penalty?", 
   {}, 
   113252, 
   null, 
   1114658400.0
  ], 
  [
   113296, 
   null, 
   "JakeCJB", 
   "Why because I believe that marriage should remained defined as between a man and a woman?\n \n And that if the definition is changed it should be done through the legislature and not activist judges..........\n \n Does that make me prejudiced?\n\n \n Yes. Because you don't have any reason for this, other than the fact that someone is gay.", 
   {}, 
   113252, 
   null, 
   1114668600.0
  ], 
  [
   113318, 
   null, 
   "JustineCredible", 
   "How can you get a stiff emoticon_confused er penalty then the death penalty?\n\n \n \n Because not all states have the death penalty. emoticon_rolleyes", 
   {}, 
   113253, 
   null, 
   1114671480.0
  ], 
  [
   113371, 
   null, 
   "jyoshu", 
   "African Americans are a race...........Gays are a class of people defined by their sexual orientation......\n\n \n Actually, to most people they are defined by their sexual behavior, even though gays WANT to be defined by the concept of \"orientation\" because it takes the onus off of the behavior issue. To most people who feel that gay relationships are immoral, orientation is not the point.", 
   {}, 
   113196, 
   null, 
   1114699620.0
  ], 
  [
   113389, 
   null, 
   "joebrummer", 
   "Actually, to most people they are defined by their sexual behavior, even though gays WANT to be defined by the concept of \"orientation\" because it takes the onus off of the behavior issue. To most people who feel that gay relationships are immoral, orientation is not the point.\n\n OH please, we have been through this, I am gay. It has nothing to do with anything I do. It has to do with who I am attracted to. No action needed. When will you ever get this through your thick, closed minded brain? If I was on a derserted Island in the Pacific with no one around, I would still be attracted to men. No actions or sex invovled.", 
   {}, 
   113371, 
   null, 
   1114701120.0
  ], 
  [
   113398, 
   null, 
   "jyoshu", 
   "OH please, we have been through this, I am gay. It has nothing to do with anything I do. It has to do with who I am attracted to. No action needed. When will you ever get this through your thick, closed minded brain? If I was on a derserted Island in the Pacific with no one around, I would still be attracted to men. No actions or sex invovled.\n\n \n I'm not saying otherwise. What I AM saying is that it's the behavior that is opposed, not the nature.", 
   {}, 
   113389, 
   null, 
   1114702320.0
  ], 
  [
   113407, 
   null, 
   "Jo Bennett", 
   "Not true. Fundies in the Church of England obstructed the appointment of celibate (though living with his partner) gay priest Canon Jeffrey John because he was gay. He accepted the current teaching of the church on homosexuality, which is that lay people in committed same sex physical relationships are ok, just not clerics (I know it's confused, but that's what you get when you run an organisation by committee).", 
   {}, 
   113398, 
   null, 
   1114703160.0
  ], 
  [
   113410, 
   null, 
   "JakeCJB", 
   "Actually, to most people they are defined by their sexual behavior, even though gays WANT to be defined by the concept of \"orientation\" because it takes the onus off of the behavior issue. To most people who feel that gay relationships are immoral, orientation is not the point.\n\n \n You don't DEFINE a whole person, by behaviour alone. If you do, you have a very superficial understanding of what it means to be human.", 
   {}, 
   113371, 
   null, 
   1114703940.0
  ], 
  [
   113416, 
   null, 
   "wsm2506", 
   "why is it that people have have a difference opinion then you have to be homophobic? You seem like a reasonable person......Why lower yourself to that level?\n\n \n Why lower yourself to denying equal civil right for no rationally justifiable reason?", 
   {}, 
   113198, 
   null, 
   1114704300.0
  ], 
  [
   113417, 
   null, 
   "wsm2506", 
   "Actually, to most people they are defined by their sexual behavior, even though gays WANT to be defined by the concept of \"orientation\" because it takes the onus off of the behavior issue. To most people who feel that gay relationships are immoral, orientation is not the point.\n\n \n In that case, most people define me incorrectly. The cashier at 7/11 doesn't know what my sexual behavior is. Very few people do.", 
   {}, 
   113371, 
   null, 
   1114704540.0
  ], 
  [
   113434, 
   null, 
   "MrWriteLA", 
   "The word \"homosexuality\" was coined by behavioral scientists to describe an attraction  to one's own gender, and so it continues to be defined in all current dictionaries. (I believe I demonstrated this with many examples in a previous post on another thread.)\n \n If anti-gay internet activists intend to persist, despite having this pointed out to them repeatedly, in redefine  it as referring to sexual activities, it would be helpful to know what word they would prefer we use to refer to the aforementioned attraction.\n \n It would also be helpful to know precisely what these unspecified activities are that are exclusively performed by \"homosexuals\" that therefore defines us as such. After all, if you're defining the activity as homosexual, it can't be anything heterosexuals do. (A man and his wife can't engage in \"homosexual\" sex, right?)", 
   {}, 
   113417, 
   null, 
   1114706040.0
  ], 
  [
   113457, 
   null, 
   "jyoshu", 
   "You don't DEFINE a whole person, by behaviour alone. If you do, you have a very superficial understanding of what it means to be human.\n\n \n No one is defining the whole person here--you are the one trying to claim it defines the whole person, but that's rarely the intention. It's defining the behavior. The nature issue is beside the point when it comes to the morality of homosexuality. IOW, the idea that you as a person are being defined when someone opposes your behavior is you OWN construct.\n \n \nThe word \"homosexuality\" was coined by behavioral scientists to describe an attraction to one's own gender, and so it continues to be defined in all current dictionaries. (I believe I demonstrated this with many examples in a previous post on another thread.)\n\n \n Again this is beside the point. It may or may not be the case that the term \"homosexuality\" is used (sometimes it certainly is), but it's still the behavior, not the nature, that is usually considered immoral. Trying over and over to take the debate back to the nature issue does not change the fact that it's not really the nature that's opposed.", 
   {}, 
   113410, 
   null, 
   1114708140.0
  ], 
  [
   113461, 
   null, 
   "joebrummer", 
   "Statistics show that many victims of bias based crime are not gay, the assailant assumed they were gay. Gay ephitets were used! Houses were spary painted with gay slurs. The victims was not gay.\n \n It is no surprise you don't know how you offended anyone, and your lying about the gay co-worker, because most gay people \"get it\" where you don't.\n \n So here is the dumb down version of my post.\n \n Imagine a heterosexual man getting beatin because his assailant \"thinks\" he is a gay man. It is still a hate crime, why? because the victim was beatin because of his percieved sexual orientation regardless if it was true or not.\n \n Now, do you get it? So I will ask again. Was the straight guy, who was beatin up because some \"thought\" he was gay flaunting. How could he..he isn't gay. Do you see that your logic of \"gays are asking for it\" is offensive when even straight people are beatin up for being gay.\n\n \n \n Voice of Reason has yet to respond to this post. ...... Why is that?\n \n How are gays and lesbians asking for violence when many gay bashings happen to heterosexual people?", 
   {}, 
   113119, 
   null, 
   1114709160.0
  ], 
  [
   113474, 
   null, 
   "JakeCJB", 
   "No one is defining the whole person here--you are the one trying to claim it defines the whole person, but that's rarely the intention. It's defining the behavior. The nature issue is beside the point when it comes to the morality of homosexuality. IOW, the idea that you as a person are being defined when someone opposes your behavior is you OWN construct.\n\n \n Fine. Your intention is to only define behaviour(the actions), and to ignore the rest of the human being, the rest of sexuality. Does this apply to other behaviours you would consider \"sinful\"? Are the desires that lead to adultery beside the point when it comes to the morality of adultery, as well?\n \n If I am being defined by behaviour, there should be no problem. I do the same things straight people do. It is the same behaviour with someone of the same sex. Merely who it is with, doesn't define the behaviour. The same behaviour could also be between an overweight person and a skinny person, or between a 23 year old and a 44 year old, or between a black person and a white person. We are not looking at sexuality, remember, not at people at all, only at behaviour. Who are you to tell me WHO I can and cannot do the same sexual behaviour with?\n \n Also, there are no restrictions on the type of sexual behaviour married people can have. They don't look at that in deciding who can marry. So you should have no problem with two gay men marrying, since you don't know anything about that couple's behaviour.", 
   {}, 
   113457, 
   null, 
   1114710360.0
  ], 
  [
   113485, 
   null, 
   "jyoshu", 
   "Fine. Your intention is to only define behaviour, and to ignore the rest of the human being, the rest of sexuality. Does this apply to other behaviours you would consider \"sinful\"? Are the desires that lead to adultery beside the point when it comes to the morality of adultery, as well?\n\n \n There is probably not a post-puberty person alive who has not had a sexual attraction toward someone. I tend to feel that the actions are what really counts. So to answer your question, no it's not attraction that's sinful.\n \n \nIf I am being defined by behaviour, there should be no problem. I do the same things straight people do. It is the same behaviour with someone of the same sex. \n\n \n That's a contradiction--if you are with a same-sex partner romantically you are NOT doing the same thing a straight person does, instead you are doing something homosexual.", 
   {}, 
   113474, 
   null, 
   1114711140.0
  ], 
  [
   113499, 
   null, 
   "wsm2506", 
   "Jyoshu, if you \"define\" a person on that basis, you are indeed shallow. Is you life really so wrapped up in the sexual behavior of others?", 
   {}, 
   113485, 
   null, 
   1114711740.0
  ], 
  [
   113506, 
   null, 
   "JakeCJB", 
   "There is probably not a post-puberty person alive who has not had a sexual attraction toward someone. I tend to feel that the actions are what really counts. So to answer your question, no it's not attraction that's sinful.\n\n \n Isn't this hypocritical? I can fantasize all I want, but never act on it?\n \n \nThat's a contradiction--if you are with a same-sex partner romantically you are NOT doing the same thing a straight person does, instead you are doing something homosexual.\n\n \n You are defining the behaviour ONLY by WHO I am with. Therefore, you are directly discriminating against a person, and against people who are gay. It is also discrimination based on the sex of the partner.", 
   {}, 
   113485, 
   null, 
   1114712220.0
  ], 
  [
   113509, 
   null, 
   "jyoshu", 
   "Jyoshu, if you \"define\" a person on that basis, you are shallow indeed.\n\n \n I would think that judging people on their actions rather than what I think their feelings might be would be a good thing. Well, you can think what you want.", 
   {}, 
   113499, 
   null, 
   1114712460.0
  ], 
  [
   113512, 
   null, 
   "jyoshu", 
   "Isn't this hypocritical? I can fantasize all I want, but never act on it?\n\n \n If our premise is that gay sex is immoral, that's correct. Obviously you don't think it is, and that's where we disagree. :) We'll have to agree to disagree on this, I suppose.\n \n \nYou are defining the behaviour ONLY by WHO I am with.\n\n \n Again, you are assuming this is about nature. The defining is about WHAT you are doing: homosexual activity. It's not YOU that is being defined at all, it's the action. It's not a matter of \"who you are with,\" but the fact that it's gay romantic sex.", 
   {}, 
   113506, 
   null, 
   1114712640.0
  ], 
  [
   113513, 
   null, 
   "wsm2506", 
   "I would think that judging people on their actions rather than what I think their feelings might be would be a good thing. Well, you can think what you want.\n\n \n I think you concern yourself WAY TOO MUCH  with what consenting adults do in the privacy of their bedrooms that effects you not at all. Must be a fixation you have.", 
   {}, 
   113509, 
   null, 
   1114712700.0
  ], 
  [
   113526, 
   null, 
   "joebrummer", 
   "What he is saying is that we are good to go, as long as we never have sex with anyone we are attracted to!", 
   {}, 
   113513, 
   null, 
   1114713480.0
  ], 
  [
   113532, 
   null, 
   "jyoshu", 
   "I think you concern yourself WAY TOO MUCH  with what consenting adults do in the privacy of their bedrooms that effects you not at all. Must be a fixation you have.\n\n \n Right on schedule: the ad hominem.", 
   {}, 
   113513, 
   null, 
   1114713840.0
  ], 
  [
   113541, 
   null, 
   "JakeCJB", 
   "If our premise is that gay sex is immoral, that's correct. Obviously you don't think it is, and that's where we disagree. :) We'll have to agree to disagree on this, I suppose.\n\n \n The construction of morality goes deeper for me than actions alone. It's also not about saying an action is immoral, and giving no reason that it's immoral. \n \n \nAgain, you are assuming this is about nature. The defining is about WHAT you are doing: homosexual activity. It's not YOU that is being defined at all, it's the action. It's not a matter of \"who you are with,\" but the fact that it's gay romantic sex.\n\n \n The action is defined only by who I am with(a person of the same sex). The fact I am with this person, makes it a bad action in your opinion. There are no other reasons given why it is a bad action. Therefore a person is affected with discrimination for no reason other than the fact he or she is interacting with someone of the same sex. Yes, interacting with someone of the same sex is an action. However, a person is still being affected negatively, without a good reason. And you simply can't not look at the nature issue. We are discussing that person's inner hopes, desires and dreams. You use the term \"romantic\" more than once, to apply to homosexuality. Where do you think \"romantic\" comes from? Does it just happen from nothing in the form of actions? I should think not.", 
   {}, 
   113512, 
   null, 
   1114714440.0
  ], 
  [
   113542, 
   null, 
   "wsm2506", 
   " Where do you think \"romantic\" comes from? Does it just happen from nothing in the form of actions? I should think not.\n\n \n Perhaps he is basing that on his own experience in romance?", 
   {}, 
   113541, 
   null, 
   1114714680.0
  ], 
  [
   113543, 
   null, 
   "Voice Of Reason", 
   "Yes. Because you don't have any reason for this, other than the fact that someone is gay.\n\n \n You need to go back and read some of my posts on why I believe the definition of marriage should not change before you make such stupid statements................", 
   {}, 
   113296, 
   null, 
   1114714680.0
  ], 
  [
   113545, 
   null, 
   "Voice Of Reason", 
   "Because not all states have the death penalty. emoticon_rolleyes\n\n \n Well most of you liberals are against the death penalty anyhow so that should make you happy............\n \n Then if a person is convicted of a capital crime be he gay or straight he or she gets life in prison.....", 
   {}, 
   113318, 
   null, 
   1114714800.0
  ], 
  [
   113546, 
   null, 
   "Voice Of Reason", 
   "Not true. Fundies in the Church of England obstructed the appointment of celibate (though living with his partner) gay priest Canon Jeffrey John because he was gay. He accepted the current teaching of the church on homosexuality, which is that lay people in committed same sex physical relationships are ok, just not clerics (I know it's confused, but that's what you get when you run an organisation by committee).\n\n \n Jo, surely you see the contradiction there..........", 
   {}, 
   113407, 
   null, 
   1114714920.0
  ], 
  [
   113547, 
   null, 
   "Voice Of Reason", 
   "Why lower yourself to denying equal civil right for no rationally justifiable reason?\n\n \n That is your opinion becasue your either liberal or gay.........I have a different opinion..........I respect yours though I don't agree with it...........Why can't you respect mine?", 
   {}, 
   113416, 
   null, 
   1114714980.0
  ], 
  [
   113550, 
   null, 
   "tonybrown74", 
   "African Americans are a race...........Gays are a class of people defined by their sexual orientation......\n\n \n Race is a social construct defined by appearance. Scientifically, there is no difference between me and a white person.\n \n Sexual Orientation is a social construct based on attraction. Scientifically, there is no difference between me and a straight person.\n \n Get over it already", 
   {}, 
   113196, 
   null, 
   1114715160.0
  ], 
  [
   113556, 
   null, 
   "BobNelson2", 
   "Actually, to most people they are defined by their sexual behavior, even though gays WANT to be defined by the concept of \"orientation\" because it takes the onus off of the behavior issue. To most people who feel that gay relationships are immoral, orientation is not the point.\n\n \n If this is the case, then why do anti-gay groups fight things like laws banning discrimination at work? Why fight things like adoption?", 
   {}, 
   113371, 
   null, 
   1114715520.0
  ], 
  [
   113560, 
   null, 
   "joebrummer", 
   "That is your opinion becasue your either liberal or gay.........I have a different opinion..........I respect yours though I don't agree with it...........Why can't you respect mine?\n\n \n \n Because\n 1) you present your opinion in a demeaning and condecending manner\n \n 2) your opinion isn't based on fact. It is based clearly on sterotypes and misinformation. If you presented some facts or accurate information and still had this opinion then presented the opinion in an appropriate manner. We might respect your opinion.", 
   {}, 
   113547, 
   null, 
   1114715760.0
  ], 
  [
   113563, 
   null, 
   "Voice Of Reason", 
   "Voice of Reason has yet to respond to this post. ...... Why is that?\n \n How are gays and lesbians asking for violence when many gay bashings happen to heterosexual people?\n\n \n I don't believe in violence against anyone..........I don't know of all thse statistics you cite that say a lot of straights are victims of crimes because they are mistaken for gays.........\n \n I think one of the main reasons that some gays are victims on violence is maybe that they come on to straight guys and the straight guys take offense to that.....I know that happened to me although I just told the gay guy where to go when he made advancements to me.........I guess some guys go further........", 
   {}, 
   113461, 
   null, 
   1114716420.0
  ], 
  [
   113564, 
   null, 
   "Voice Of Reason", 
   "Race is a social construct defined by appearance. Scientifically, there is no difference between me and a white person.\n \n Sexual Orientation is a social construct based on attraction. Scientifically, there is no difference between me and a straight person.\n \n Get over it already\n\n \n \n There is a huge difference...........You are attracted to the same sex........I am attracted to the opposite sex..........We both can chose to change..........And African American does not have that choice.......", 
   {}, 
   113550, 
   null, 
   1114716720.0
  ], 
  [
   113566, 
   null, 
   "wsm2506", 
   "There is a huge difference...........You are attracted to the same sex........I am attracted to the opposite sex..........We both can chose to change..........And African American does not have that choice.......\n\n \n Do you really think YOU(personally) can chose change who you are attracted to?", 
   {}, 
   113564, 
   null, 
   1114717020.0
  ], 
  [
   113569, 
   null, 
   "BobNelson2", 
   "There is a huge difference...........You are attracted to the same sex........I am attracted to the opposite sex..........We both can chose to change.........\n\n \n You first. And make sure to let us know how that works out for ya.", 
   {}, 
   113564, 
   null, 
   1114717860.0
  ], 
  [
   113570, 
   null, 
   "joebrummer", 
   "There is a huge difference...........You are attracted to the same sex........I am attracted to the opposite sex..........We both can chose to change..........And African American does not have that choice.......\n\n \n Yes, and you can choose to stop smoking whatever it is your smoking. People cannot consciously change their sexuality. They can obstain from sex, but their sexuality will remain intact.", 
   {}, 
   113564, 
   null, 
   1114718220.0
  ], 
  [
   113573, 
   null, 
   "joebrummer", 
   "I don't believe in violence against anyone..........I don't know of all thse statistics you cite that say a lot of straights are victims of crimes because they are mistaken for gays.........\n \n I think one of the main reasons that some gays are victims on violence is maybe that they come on to straight guys and the straight guys take offense to that.....I know that happened to me although I just told the gay guy where to go when he made advancements to me.........I guess some guys go further........\n\n \n But the statistics about this are not with you. Most people are bashed on the streets. Little or no conversation invovled. Most bashing are donr as random acts by teens who see little or nothing wrong with what they have done. Most see that they have done some service to society. Gee wonder where they learned that. Go to the FBI's website and look at the statistics of who commits these crimes and why. Studies tell you why it happens.\n \n I myself was leaving a bar with a friend. Two kids running down the street, slamed me to the ground \"breaking a few bones\", yelled a gay slur or two and kept running. I ended up unconscious on the ground with a broken collar bone. How did I fluant myself to deserve that?\n \n You are the most offensive poster on this board. And I might add the stupists. You have jusitified anything you have posted. You have no knowledge of the facts, you back up nothing with links or fact. Why do you bother spreading the opinions you have when they are not based on facts!", 
   {}, 
   113563, 
   null, 
   1114718520.0
  ], 
  [
   113581, 
   null, 
   "JustineCredible", 
   "Well most of you liberals are against the death penalty anyhow so that should make you happy............\n \n Then if a person is convicted of a capital crime be he gay or straight he or she gets life in prison.....\n\n \n Is it at all possible for you to say anything that isn't directly insulting? \n I really hate to remind you but the RCC is anti-death penalty as well.", 
   {}, 
   113545, 
   null, 
   1114719660.0
  ], 
  [
   113590, 
   null, 
   "tonybrown74", 
   "There is a huge difference...........You are attracted to the same sex........I am attracted to the opposite sex..........We both can chose to change..........And African American does not have that choice.......\n\n \n \n Honey, you cannot change who you are attracted to. You might deny who you are attracted to, but you cannot change it.\n \n As for African Americans, look at Michael Jackson ... emoticon_xclown", 
   {}, 
   113564, 
   null, 
   1114721100.0
  ], 
  [
   113613, 
   null, 
   "Jo Bennett", 
   "Jo, surely you see the contradiction there..........\n\n \n In the church's policy, yes; but that's not really relevant, I was just pointing out that what he had agreed to uphold did not conflict with his actions. It is still a valid illustration that fundies are not concerned about actions but about orientation.", 
   {}, 
   113546, 
   null, 
   1114725060.0
  ], 
  [
   113632, 
   null, 
   "Voice Of Reason", 
   "Race is a social construct defined by appearance. Scientifically, there is no difference between me and a white person.\n \n Sexual Orientation is a social construct based on attraction. Scientifically, there is no difference between me and a straight person.\n \n Get over it already\n\n \n \n \n\n Race is a social construct defined by appearance. Scientifically, there is no difference between me and a white person.\n \n \n I agree but there is a major difference between a straight and gay person.......", 
   {}, 
   113550, 
   null, 
   1114725900.0
  ], 
  [
   113635, 
   null, 
   "Voice Of Reason", 
   "Do you really think YOU(personally) can chose change who you are attracted to?\n\n \n Its done every day............", 
   {}, 
   113566, 
   null, 
   1114726080.0
  ], 
  [
   113638, 
   null, 
   "Voice Of Reason", 
   "Yes, and you can choose to stop smoking whatever it is your smoking. People cannot consciously change their sexuality. They can obstain from sex, but their sexuality will remain intact.\n\n \n \n Come on Joe there are many documented cases of gay men and lesbian women changing their sexual orientation, getting married and raising a family...", 
   {}, 
   113570, 
   null, 
   1114726200.0
  ], 
  [
   113642, 
   null, 
   "Voice Of Reason", 
   "\n You are the most offensive poster on this board. And I might add the stupists. You have jusitified anything you have posted. You have no knowledge of the facts, you back up nothing with links or fact. Why do you bother spreading the opinions you have when they are not based on facts!\n \n \n Sad Joe, very sad.........you really lose any creditability with the other side when you attack the messenger...........", 
   {}, 
   113573, 
   null, 
   1114726440.0
  ], 
  [
   113643, 
   null, 
   "Voice Of Reason", 
   "Is it at all possible for you to say anything that isn't directly insulting? \n I really hate to remind you but the RCC is anti-death penalty as well.\n\n \n What is the RCC?", 
   {}, 
   113581, 
   null, 
   1114726560.0
  ], 
  [
   113644, 
   null, 
   "BobNelson2", 
   "I agree but there is a major difference between a straight and gay person.......\n\n \n Those rumors aren't true. Well, not completely...\n \n :p", 
   {}, 
   113632, 
   null, 
   1114726620.0
  ], 
  [
   113645, 
   null, 
   "Voice Of Reason", 
   "Honey, you cannot change who you are attracted to. You might deny who you are attracted to, but you cannot change it.\n \n As for African Americans, look at Michael Jackson ... emoticon_xclown\n\n \n You got a point on Michael Jackson :) but as I have said before tbere are documented cases of gays changing every day......", 
   {}, 
   113590, 
   null, 
   1114726620.0
  ], 
  [
   113646, 
   null, 
   "BobNelson2", 
   "In case anyone was under the misguided impression that VOR actually read anything on here...\n \n \nWhat is the RCC?\n", 
   {}, 
   113643, 
   null, 
   1114726680.0
  ], 
  [
   113649, 
   null, 
   "Voice Of Reason", 
   "In case anyone was under the misguided impression that VOR actually read anything on here...\n\n \n I am sure you will get the response you want from you liberal friends.....That should make you smile and feel good but it only make you lose creditability with the other side.........\n \n Another attack on the messenger.....sad............", 
   {}, 
   113646, 
   null, 
   1114727040.0
  ], 
  [
   113654, 
   null, 
   "jyoshu", 
   "I am sure you will get the response you want from you liberal friends.....That should make you smile and feel good but it only make you lose creditability with the other side.........\n \n Another attack on the messenger.....sad............\n\n \n It stands for \"Roman Catholic Church.\"\n \n Don't let BobNelson2 get to you; it's obvious he just can't pass up a chance to be insulting no matter how much (or how little) he tries.", 
   {}, 
   113649, 
   null, 
   1114727340.0
  ], 
  [
   113655, 
   null, 
   "BobNelson2", 
   "I am sure you will get the response you want from you liberal friends.....That should make you smile and feel good but it only make you lose creditability with the other side.........\n \n Another attack on the messenger.....sad............\n\n \n Both liberals and conservatives here, including you, have been discussing the theology, policies, and political activities of the Roman Catholic Church for weeks now. \n \n Roman Catholic Church\n \n R C C", 
   {}, 
   113649, 
   null, 
   1114727400.0
  ], 
  [
   113657, 
   null, 
   "joebrummer", 
   "You got a point on Michael Jackson :) but as I have said before tbere are documented cases of gays changing every day......\n\n \n \n Shows us the documentation...... Scientific evidence, perhaps....oops I forgot there isn't any!", 
   {}, 
   113645, 
   null, 
   1114727520.0
  ], 
  [
   113660, 
   null, 
   "Voice Of Reason", 
   "It stands for \"Roman Catholic Church.\"\n \n Don't let BobNelson2 get to you; it's obvious he just can't pass up a chance to be insulting no matter how much (or how little) he tries.\n\n \n Thank you...........I am a catholic and I never thought of that abbrev........\n \n He does not get to me, its just that comments like he usually makes adds nothing to the debate............", 
   {}, 
   113654, 
   null, 
   1114727580.0
  ], 
  [
   113663, 
   null, 
   "jyoshu", 
   "Thank you...........I am a catholic and I never thought of that abbrev........\n\n \n Well, that's understandable since most people in the states refer to it as the \"Catholic Church\" and not the \"Roman\" Catholic Church. I suspect if the abbreviation had been \"CC\" it would have been more apparent.", 
   {}, 
   113660, 
   null, 
   1114727700.0
  ], 
  [
   113664, 
   null, 
   "joebrummer", 
   "Thank you...........I am a catholic and I never thought of that abbrev........\n \n He does not get to me, its just that comments like he usually makes adds nothing to the debate............\n\n \n \n and what have you really added. Nothing but insults!\n \n You don't even answer the topics you start!", 
   {}, 
   113660, 
   null, 
   1114727700.0
  ], 
  [
   113665, 
   null, 
   "Voice Of Reason", 
   "Shows us the documentation...... Scientific evidence, perhaps....oops I forgot there isn't any!\n\n \n Joe, your and intelligent person...........just go to your google and search on it.......", 
   {}, 
   113657, 
   null, 
   1114727700.0
  ], 
  [
   113667, 
   null, 
   "joebrummer", 
   "Joe, your and intelligent person...........just go to your google and search on it.......\n\n \n \n Nope, you made the claim, you back it up! plus why would I google something I just said doesn't exist. Read before you post VOR!\n \n and for the record it is \"an\" intelligent person and yes I am.", 
   {}, 
   113665, 
   null, 
   1114727760.0
  ], 
  [
   113673, 
   null, 
   "Voice Of Reason", 
   "Nope, you made the claim, you back it up! plus why would I google something I just said doesn't exist. Read before you post VOR!\n \n and for the record it is \"an\" intelligent person and yes I am.\n\n \n Ann Heche comes to mind.........", 
   {}, 
   113667, 
   null, 
   1114728180.0
  ], 
  [
   113676, 
   null, 
   "BobNelson2", 
   "Ann Heche comes to mind.........\n\n \n She didn't \"choose\" to return to heterosexuality, silly. The aliens made her!", 
   {}, 
   113673, 
   null, 
   1114728480.0
  ], 
  [
   113677, 
   null, 
   "Duo_Maxwell", 
   "IF Vor cannot back his claim up when repetively challenged, his claim is voided. If you cannot even bother to do the effort of merely citing ONE source, you are inherently lazy. \n \n Btw: where did you get that stasistic? Off Hannity or Rush? emoticon_rolleyes", 
   {}, 
   113673, 
   null, 
   1114728540.0
  ], 
  [
   113679, 
   null, 
   "Voice Of Reason", 
   "She didn't \"choose\" to return to heterosexuality, silly. The aliens made her!\n\n \n That a boy joe, your usual input to the debate.......sad..........", 
   {}, 
   113676, 
   null, 
   1114728660.0
  ], 
  [
   113688, 
   null, 
   "JakeCJB", 
   "You need to go back and read some of my posts on why I believe the definition of marriage should not change before you make such stupid statements................\n\n \n I meant, logical, rational reasons, not fallacies and tired diversionary tactics.", 
   {}, 
   113543, 
   null, 
   1114729800.0
  ], 
  [
   113690, 
   null, 
   "Jo Bennett", 
   "Roman Catholic Church is more well defined. Catholic church can mean all Christian churches, particularly with reference to the Nicene creed \"one holy, catholic and apostolic church\".", 
   {}, 
   113688, 
   null, 
   1114729920.0
  ], 
  [
   113706, 
   null, 
   "MrWriteLA", 
   "More importantly, many various professional medical and psychological bodies condemn conversion therapies. Such bodies include: \n \n American Psychiatric Association (APA)\n American Academy of Pediatrics\n American Medical Association\n American Psychological Association\n American Counseling Association\n American Federation of Teachers\n National Association of School Psychologists\n National Association of Social Workers\n National Association of Secondary School Principals\n National Education Association\n Royal College of Nursing. \n \n On the question of whether therapy can change sexual orientation the APA answers: \"No. Even though most homosexuals live successful, happy lives, some homosexual or bisexual people may seek to change their sexual orientation through therapy, sometimes pressured by the influence of family members or religious groups to try and do so. The reality is that homosexuality is not an illness. It does not require treatment and is not changeable.\" \n http://www.apa.org/pubinfo/answers.html#cantherapychange\n \n Some religious organisations also oppose reparative therapies, including The Interfaith Alliance, New Ways Ministries and People for the American Way.\n \n The American Academy of Pediatrics, American Counseling Association, American Association of School Administrators, American Federation of Teachers, American Psychological Association, American School Health Association, Interfaith Alliance Foundation, National Association of School Psychologists, National Association of Social Workers, and National Education Association have developed and endorsed a statement in 1999 reading: \n \n The most important fact about 'reparative therapy,' also sometimes known as 'conversion' therapy, is that it is based on an understanding of homosexuality that has been rejected by all the major health and mental health professions. The American Academy of Pediatrics, the American Counseling Association, the American Psychiatric Association, the American Psychological Association, the National Association of School Psychologists, and the National Association of Social Workers, together representing more than 477,000 health and mental health professionals, have all taken the position that homosexuality is not a mental disorder and thus there is no need for a 'cure.' ...health and mental health professional organizations do not support efforts to change young people's sexual orientation through 'reparative therapy' and have raised serious concerns about its potential to do harm.  \n http://www.explore-sex.com/sex_and_romance/R/Reparative_therapy.html", 
   {
    "post_info": {
     "post_title": "Re: Reparative Therapy"
    }
   }, 
   113690, 
   null, 
   1114731120.0
  ], 
  [
   113748, 
   null, 
   "JustineCredible", 
   "Its done every day............\n\n \n \"Its\" Done? Really are you saying YOU change to whom you are attracted to, everyday? \n Really, everyday? \n You sure about that?", 
   {}, 
   113635, 
   null, 
   1114733940.0
  ], 
  [
   113750, 
   null, 
   "JustineCredible", 
   "Come on Joe there are many documented cases of gay men and lesbian women changing their sexual orientation, getting married and raising a family...\n\n \n Nope, not one shread of evidence showing that anyone actually changes their orientation. People lie, namely those who have been brainwashed by groups claiming they can change someone's orientation. Besides, why is it not one of those groups has any accountability for their supposed sucesses? Hmmm...could it be because they KNOW it's all a lie!? \n \n Getting married and having a family is NOT indicitive of someone changing their orientation. I should know, I was married to a man, but I knew in my heart and in my mind that I was only doing so in a lame attempt to \"fit in\" or even \"cure\" myself. \n Guess what? \n It didn't happen. I'm still a lesbian, I always have been and always will be. Living a lie to apease others doesn't change anything, it's still a LIE!", 
   {}, 
   113638, 
   null, 
   1114734180.0
  ], 
  [
   113752, 
   null, 
   "JustineCredible", 
   "Ann Heche comes to mind.........\n\n \n What you and Anne/traitor/liar, Heche fails to recognize is bisexuality. A natural state of being sexual attracted to either gender! \n UGh...\n Anne Heche is twisted. She manipulated Ellen, used her for her celebrity and when she realized she was becomming attracted to someone else, concocted this wild hair-brained idea that she was some alien princess. \n Anne Heche has a lot of OTHER problems.\n \n Granted, I wouldn't doubt a lot of them created by social stigma of gays and bisexuals which simply led to a psychotic break in her fragile mind.", 
   {}, 
   113673, 
   null, 
   1114734420.0
  ], 
  [
   113757, 
   null, 
   "JustineCredible", 
   "What is the RCC?\n\n \n \n Roman Catholic Church, what you claim to be a follower of. \n \n Now, as far as my assertation that the RCC also does not condone the death penalty...\n \n Can you stick to the subject at hand, for once? \n \n Or is that asking too much? emoticon_rolleyes", 
   {}, 
   113643, 
   null, 
   1114734600.0
  ], 
  [
   113758, 
   null, 
   "Voice Of Reason", 
   "I meant, logical, rational reasons, not fallacies and tired diversionary tactics.\n\n \n \n Just becasue you don't agree with them does not mean they are not true...", 
   {}, 
   113688, 
   null, 
   1114734660.0
  ], 
  [
   113759, 
   null, 
   "Voice Of Reason", 
   "Roman Catholic Church is more well defined. Catholic church can mean all Christian churches, particularly with reference to the Nicene creed \"one holy, catholic and apostolic church\".\n\n \n That is true...Thank you.........", 
   {}, 
   113690, 
   null, 
   1114734720.0
  ], 
  [
   113760, 
   null, 
   "JustineCredible", 
   "I am sure you will get the response you want from you liberal friends.....That should make you smile and feel good but it only make you lose creditability with the other side.........\n \n Another attack on the messenger.....sad............\n\n \n Oh get off your high horse. You're the one avoiding having to answer anything by deflecting direct questions and comming up with completely non-sensical ones of your own, then thinking no one will notice that you never actually answered the question in the first place. \n \n Now, who's loosing credibility? \n Not Bob, not me. \n Hmmm... must be YOU.", 
   {}, 
   113649, 
   null, 
   1114734720.0
  ], 
  [
   113761, 
   null, 
   "Voice Of Reason", 
   "\"Its\" Done? Really are you saying YOU change to whom you are attracted to, everyday? \n Really, everyday? \n You sure about that?\n\n \n No, I am saying that people change every day.....", 
   {}, 
   113748, 
   null, 
   1114734780.0
  ], 
  [
   113763, 
   null, 
   "JustineCredible", 
   "No, I am saying that people change every day.....\n\n \n \n But that wasn't the context of the question. You can't get out of answering it that easily.", 
   {}, 
   113761, 
   null, 
   1114734840.0
  ], 
  [
   113764, 
   null, 
   "Voice Of Reason", 
   "Roman Catholic Church, what you claim to be a follower of. \n \n Now, as far as my assertation that the RCC also does not condone the death penalty...\n \n Can you stick to the subject at hand, for once? \n \n Or is that asking too much? emoticon_rolleyes\n\n \n I believe I was answering a question from one of your friends.....", 
   {}, 
   113757, 
   null, 
   1114734840.0
  ], 
  [
   113767, 
   null, 
   "JustineCredible", 
   "I believe I was answering a question from one of your friends.....\n\n \n \n Uh, no. Let's try this again, from the top, shall we? \n \n \nwsm2506 \n Registered User Join Date: Nov 2004\n Posts: 747 \n \n \nQuote:\n Originally Posted by Voice Of Reason\n There is a huge difference...........You are attracted to the same sex........I am attracted to the opposite sex..........We both can chose to change..........And African American does not have that choice.......\n \n \n \n \n Do you really think YOU(personally) can chose change who you are attracted to? \n\n \n To which you replied: \n \n \n Voice Of Reason \n Navy Pride Join Date: Apr 2005\n Location: Pacific Northwest\n Posts: 557 \n \n \nQuote:\n Originally Posted by wsm2506\n Do you really think YOU(personally) can chose change who you are attracted to? \n\n \n \n \n Its done every day............ \n\n \n To which I would have to assume that the concept of emphasys is obviously lost on you. \n \n No, you didn't answer the question at hand. Your answer was more closely related to a politician avoiding realy issues.", 
   {}, 
   113764, 
   null, 
   1114735140.0
  ], 
  [
   113782, 
   null, 
   "Voice Of Reason", 
   "The point I am trying to make is that gay and lesbian people make a conversion to a straight life every day..........When they make the conversion they don't abstain from straight sex.........They marry and have children...Having sex to a gay person is suppose to be repulsive to a gay man or a lesbian woman but it happens all the time...........I would equate it to the reulsiveness that a straight man has when forced to have sex with a gay man.......", 
   {}, 
   113767, 
   null, 
   1114736520.0
  ], 
  [
   113786, 
   null, 
   "JustineCredible", 
   "The point I am trying to make is that gay and lesbian people make a conversion to a straight life every day..........When they make the conversion they don't abstain from straight sex.........They marry and have children...Having sex to a gay person is suppose to be repulsive to a gay man or a lesbian woman but it happens all the time...........I would equate it to the reulsiveness that a straight man has when forced to have sex with a gay man.......\n\n \n Show us the data.\n \n That's what joe and I have asked. You made the assertation, the onis is on you to back it up. \n \n Um, also, I don't see a lot of gay rape happening in civilian life. Prisons not included...that's a completely different subject all together, that I really don't care to get into. \n \n But still the fact remains, there is no data backing up the effacacy of \"conversion therapy\" whatsoever. None. Not one bit.\n There is PLENTY of data showing just the opposite, though.", 
   {}, 
   113782, 
   null, 
   1114736700.0
  ], 
  [
   113799, 
   null, 
   "JakeCJB", 
   "Just becasue you don't agree with them does not mean they are not true...\n\n \n Anything is possible. It's possible my claim that there is a tiny purple elephant wandering around my garden is also true.", 
   {}, 
   113758, 
   null, 
   1114738680.0
  ], 
  [
   113859, 
   null, 
   "Voice Of Reason", 
   "Show us the data.\n \n That's what joe and I have asked. You made the assertation, the onis is on you to back it up. \n \n Um, also, I don't see a lot of gay rape happening in civilian life. Prisons not included...that's a completely different subject all together, that I really don't care to get into. \n \n But still the fact remains, there is no data backing up the effacacy of \"conversion therapy\" whatsoever. None. Not one bit.\n There is PLENTY of data showing just the opposite, though.\n\n \n \n There are plenty that have converted and have families and are enjoying a straight life......You can't have that because that would prove that gays are not born that way and that if they are gay they can change.............", 
   {}, 
   113786, 
   null, 
   1114750920.0
  ], 
  [
   113860, 
   null, 
   "Voice Of Reason", 
   "Anything is possible. It's possible my claim that there is a tiny purple elephant wandering around my garden is also true.\n\n \n Your right anything is possible......", 
   {}, 
   113799, 
   null, 
   1114750980.0
  ], 
  [
   113887, 
   null, 
   "BobNelson2", 
   "There are plenty that have converted and have families and are enjoying a straight life......You can't have that because that would prove that gays are not born that way and that if they are gay they can change.............\n\n \n You assume we can \"change\" because someone else changed, as though all people were the same. \n \n If we're all the same, then you, too, can change. I (according to you) can go straight because someone else has. Well, far more straight people \"turn\" gay every year than the other way 'round, so obviously you can change, right?\n \n Do you think you could over your repulsion and settle down with another guy?", 
   {}, 
   113859, 
   null, 
   1114755420.0
  ], 
  [
   113912, 
   null, 
   "JustineCredible", 
   "There are plenty that have converted and have families and are enjoying a straight life......You can't have that because that would prove that gays are not born that way and that if they are gay they can change.............\n\n \n \n I can't have that? \n \n So, are you saying that you do not believe that I was once married to a man and had a child? Are you saying that I'm lying about knowing the entire time that I was infact gay and that I was simply attempting to 'fit-in'? \n \n That's a very big ASSUMPTION on your part. You cannot know what I was feeling, or thinking. \n \n I really hate to tell you but abstaining from gay sex and having a \"straight style\" marriage does not prove sexual orientation change. I just proves a change in a persons actions. Orientation isn't about the act, it's about attraction, desire, a feeling of completeness/bond. Simply living in direct opposition to one's natural orientation is in fact living a lie. \n \n Shall I direct your attentions to the Director of the Board for Exodus International, John Paulk? He supposedly \"converted\" to being straight, but later was found perusing a gay bar in the DuPont Circle area of Washing DC in 2000. He was later put on probation by Exodus and subsequently \"came back out\" admitting he had never actually been \"changed\" but only that he chose to live in opposition to his natural orientation.\n \n Or\n \n Seventh Day Adventist Colin Cook (who had been dismissed as a minister in 1974 for having sex with another man) founded the groups Quest Learning Center and Homosexuals Anonymous in 1979 and 1980 respectively; both are ex-gay organizations. In 1985, he wrote two books, Homosexuality, and Homosexuality: An Open Door. In 1986, he was discovered to be engaging in sexual acts with his Quest patients. He claimed that the nude massages of other men should desensitize them against homosexual desires.\n \n Not to mention the APA's stand on the issue: \n http://www.apa.org/pubinfo/answers.html\n \n \nNo, human beings can not choose to be either gay or straight. Sexual orientation emerges for most people in early adolescence without any prior sexual experience. Although we can choose whether to act on our feelings, psychologists do not consider sexual orientation to be a conscious choice that can be voluntarily changed. \n\n and...\n \nSome therapists who undertake so-called conversion therapy report that they have been able to change their clients' sexual orientation from homosexual to heterosexual. Close scrutiny of these reports however show several factors that cast doubt on their claims. For example, many of the claims come from organizations with an ideological perspective which condemns homosexuality. Furthermore, their claims are poorly documented. For example, treatment outcome is not followed and reported overtime as would be the standard to test the validity of any mental health intervention.\n \n The American Psychological Association is concerned about such therapies and their potential harm to patients. In 1997, the Association's Council of Representatives passed a resolution reaffirming psychology's opposition to homophobia in treatment and spelling out a client's right to unbiased treatment and self-determination. Any person who enters into therapy to deal with issues of sexual orientation has a right to expect that such therapy would take place in a professionally neutral environment absent of any social bias. \n", 
   {}, 
   113859, 
   null, 
   1114760520.0
  ], 
  [
   113913, 
   null, 
   "JustineCredible", 
   "You assume we can \"change\" because someone else changed, as though all people were the same. \n \n If we're all the same, then you, too, can change. I (according to you) can go straight because someone else has. Well, far more straight people \"turn\" gay every year than the other way 'round, so obviously you can change, right?\n \n Do you think you could over your repulsion and settle down with another guy?\n\n \n I'm still waiting for VOR to actually answer WMS's and my, questions regarding his personal orientation and his ability to change it at will. \n Notice how he deflects this question?", 
   {}, 
   113887, 
   null, 
   1114760580.0
  ], 
  [
   113926, 
   null, 
   "Duo_Maxwell", 
   "Vor doesn't answer hard questions. \n \n That requires usage of a brain. Obviously such behavior is beyond him.", 
   {}, 
   113913, 
   null, 
   1114764960.0
  ], 
  [
   113984, 
   null, 
   "jyoshu", 
   "If even one person claims to have learned to live a life free of homosexual actions and now lives a heterosexual life, is it not the right thing to do to take them at their word rather than trying to assume anything else BUT what they say they have done? Or wish them to fail from the get-go? After all, gay people who are part of their 'pride' movement sure do seem to want the world to to take gay people at their word. \n \n It seems to me that if 'sexual orientation' and the gay rights movement is as airtight and 'scientifically sound' as the gay pride movement seems to claim, then they would have nothing to worry about from these isolated cases of people claiming to have changed. Yet judging from the way they react to people who claim it (setting them up in bars and reporting it to the media, vilifying and demonizing ex-gay support groups, spending post after post in forums trying to argue it or even attacking the messenger, etc.), one might think that the scientifically airtight fortress of knowledge about sexual orientation--that huge body of evidence that the entire medical community is behind world-wide of which SO much is known about (AHEM!) was more a house of cards than anything. Why would the the gay pride movement need to be so defensive about this issue?", 
   {}, 
   113926, 
   null, 
   1114786560.0
  ], 
  [
   113999, 
   null, 
   "wsm2506", 
   "If even one person claims to have learned to live a life free of homosexual actions and now lives a heterosexual life, is it not the right thing to do to take them at their word rather than trying to assume anything else BUT what they say they have done? Or wish them to fail from the get-go? After all, gay people who are part of their 'pride' movement sure do seem to want the world to to take gay people at their word. \n \n It seems to me that if 'sexual orientation' and the gay rights movement is as airtight and 'scientifically sound' as the gay pride movement seems to claim, then they would have nothing to worry about from these isolated cases of people claiming to have changed. Yet judging from the way they react to people who claim it (setting them up in bars and reporting it to the media, vilifying and demonizing ex-gay support groups, spending post after post in forums trying to argue it or even attacking the messenger, etc.), one might think that the scientifically airtight fortress of knowledge about sexual orientation--that huge body of evidence that the entire medical community is behind world-wide of which SO much is known about (AHEM!) was more a house of cards than anything. Why would the the gay pride movement need to be so defensive about this issue?\n\n \n \"setting them up in bars\"\n \n Who set him up? Of all the brightly lit resturants and other public places in the immediate area, he chose to enter a dimly lit, well known gay bar to take a leak, sat down, and started chatting up someone. If all he wanted was to take a leak, then why did he order a drink AFTER he supposedly \"realized\" it was a gay bar? Get real!!!!!!! emoticon_rolleyes \n \n \n \nspending post after post in forums trying to argue it or even attacking the messenger, etc.),\n\n \n This comment from the most prolific anti-gay rights or ANY poster here on this forum? emoticon_rolleyes", 
   {}, 
   113984, 
   null, 
   1114787520.0
  ], 
  [
   114009, 
   null, 
   "jyoshu", 
   "\"setting them up in bars\"\n \n Who set him up? Of all the brightly lit resturants and other public places in the immediate area, he chose to enter a dimly lit, well known gay bar to take a leak, sat down, and started chatting up someone. If all he wanted was to take a leak, then why did he order a drink AFTER he supposedly \"realized\" it was a gay bar? Get real!!!!!!! emoticon_rolleyes \n\n \n Did you read the article the other day? When Paulk was spotted in the bar, the guy came up to him and started asking him questions without telling him he was part of a gay rights organization, to get information. Then he took the info to others where it got put out in news outlets. If that's not 'setting him up' I don't know what is. \n \n The point is though, if the gay rights movement is as right as they say they are, and the concept of sexual orientation is so air tight, you all sure seem awfully paranoid about these isolated cases of people claiming to be 'ex-gay.'", 
   {}, 
   113999, 
   null, 
   1114788360.0
  ], 
  [
   114016, 
   null, 
   "wsm2506", 
   "Did you read the article the other day?  When Paulk was spotted in the bar, the guy came up to him and started asking him questions without telling him he was part of a gay rights organization, to get information. Then he took the info to others where it got put out in news outlets. If that's not 'setting him up' I don't know what is. \n \n The point is though, if the gay rights movement is as right as they say they are, and the concept of sexual orientation is so air tight, you all sure seem awfully paranoid about these isolated cases of people claiming  to be 'ex-gay.'\n\n \n \" When Paulk was spotted in the bar\"\n \n He was not lured or enticed into the bar by anyone. He went there of his own volition.\n \n No, I do not call that a \"set-up\"\n \n \"isolated cases of people claiming \"\n \n Key words:\n \n \"isolated\"\n \n \"claiming\"", 
   {}, 
   114009, 
   null, 
   1114788660.0
  ], 
  [
   114088, 
   null, 
   "Voice Of Reason", 
   "You assume we can \"change\" because someone else changed, as though all people were the same. \n \n If we're all the same, then you, too, can change. I (according to you) can go straight because someone else has. Well, far more straight people \"turn\" gay every year than the other way 'round, so obviously you can change, right?\n \n Do you think you could over your repulsion and settle down with another guy?\n\n \n If one person can change I believe anyone can change......As for your statement about straights turning gay being straight I don't know why anyone would want to do that because to me the sex act gays engage in is repulsive...I just can't see any straight man doing that........", 
   {}, 
   113887, 
   null, 
   1114796820.0
  ], 
  [
   114092, 
   null, 
   "wsm2506", 
   "If one person can change I believe anyone can change......As for your statement about straights turning gay being straight I don't know why anyone would want to do that because to me the sex act gays engage in is repulsive...I just can't see any straight man doing that........\n\n \n I maybe can understand how you feel. To me the sex act straights engage in is repulsive. But I don't suggest you should be denied civil rights because of it, or subjected to hate crimes.", 
   {}, 
   114088, 
   null, 
   1114797180.0
  ], 
  [
   114093, 
   null, 
   "Voice Of Reason", 
   "If even one person claims to have learned to live a life free of homosexual actions and now lives a heterosexual life, is it not the right thing to do to take them at their word rather than trying to assume anything else BUT what they say they have done? Or wish them to fail from the get-go? After all, gay people who are part of their 'pride' movement sure do seem to want the world to to take gay people at their word. \n \n It seems to me that if 'sexual orientation' and the gay rights movement is as airtight and 'scientifically sound' as the gay pride movement seems to claim, then they would have nothing to worry about from these isolated cases of people claiming to have changed. Yet judging from the way they react to people who claim it (setting them up in bars and reporting it to the media, vilifying and demonizing ex-gay support groups, spending post after post in forums trying to argue it or even attacking the messenger, etc.), one might think that the scientifically airtight fortress of knowledge about sexual orientation--that huge body of evidence that the entire medical community is behind world-wide of which SO much is known about (AHEM!) was more a house of cards than anything. Why would the the gay pride movement need to be so defensive about this issue?\n\n \n That is just it.......The whole gay agenda is for society to accept gays as a minority like African Americans or Hispanics........That is why they can never admit that gays have sucessfully changed from gay to straight.......If they did that then they would have to admit they are not a minority at all but a class of people defined by what they do in bed..........", 
   {}, 
   113984, 
   null, 
   1114797240.0
  ], 
  [
   114099, 
   null, 
   "wsm2506", 
   "That is just it.......The whole gay agenda is for society to accept gays as a minority like African Americans or Hispanics........That is why they can never admit that gays have sucessfully changed from gay to straight.......If they did that then they would have to admit they are not a minority at all but a class of people defined by what they do in bed..........\n\n \n What an irrational way to define anyone.\n \n As far as believing a supposed ex-gay, get one here so we can see his point of view. Of all the THOUSAND you profess to be out there, surely you can find ONE willing to back you up here.", 
   {}, 
   114093, 
   null, 
   1114797540.0
  ], 
  [
   114101, 
   null, 
   "Voice Of Reason", 
   "I maybe can understand how you feel. To me the sex act straights engage in is repulsive. But I don't suggest you should be denied civil rights because of it, or subjected to hate crimes.\n\n \n I think all citizens should have the same civil rights and no one should have to be the victim of any crime whether they be straight or gay.......\n \n I think that if a person is murdered for what you call a hate crime or he is murdered becasue of a robbery its the same and the culprit should be prosecuted to the full extent of the law..........", 
   {}, 
   114092, 
   null, 
   1114797540.0
  ], 
  [
   114106, 
   null, 
   "wsm2506", 
   "I think all citizens should have the same civil rights and no one should have to be the victim of any crime whether they be straight or gay.......\n\n \n Is not marriage a civil right?\n \n \nI think that if a person is murdered for what you call a hate crime or he is murdered becasue of a robbery its the same and the culprit should be prosecuted to the full extent of the law..........\n\n \n Well, evidently the duly elected legislators in many locales disagree with you or there wouldn't be hate crimes on the books. They were not put there by the judiciary.", 
   {}, 
   114101, 
   null, 
   1114797780.0
  ], 
  [
   114107, 
   null, 
   "JustineCredible", 
   "If even one person claims to have learned to live a life free of homosexual actions and now lives a heterosexual life, is it not the right thing to do to take them at their word rather than trying to assume anything else BUT what they say they have done? Or wish them to fail from the get-go? After all, gay people who are part of their 'pride' movement sure do seem to want the world to to take gay people at their word. \n \n It seems to me that if 'sexual orientation' and the gay rights movement is as airtight and 'scientifically sound' as the gay pride movement seems to claim, then they would have nothing to worry about from these isolated cases of people claiming to have changed. Yet judging from the way they react to people who claim it (setting them up in bars and reporting it to the media, vilifying and demonizing ex-gay support groups, spending post after post in forums trying to argue it or even attacking the messenger, etc.), one might think that the scientifically airtight fortress of knowledge about sexual orientation--that huge body of evidence that the entire medical community is behind world-wide of which SO much is known about (AHEM!) was more a house of cards than anything. Why would the the gay pride movement need to be so defensive about this issue?\n\n \n Get real!!! Setting them up???\n \n What was he doing in DuPont Circle to begin with? Hmmm...\n It's the predominantly gay area of DC! \n He wasn't pushed into going, he wasn't coaxed or encouraged by anyone. He went there of his own accord, walked right into a well known gay hang out and really expected to not be noticed? \n Please! \n Besides, why would he then later admit to still being gay? He wasn't coerced into that either. He did that of his own free will. \n \n We're defencive because people like you keep spreading lies, keep encouraging hate, keep attempting to enact laws which are clearly descriminatory in nature.", 
   {}, 
   113984, 
   null, 
   1114797960.0
  ], 
  [
   114158, 
   null, 
   "BobNelson2", 
   "If even one person claims to have learned to live a life free of homosexual actions and now lives a heterosexual life, is it not the right thing to do to take them at their word rather than trying to assume anything else BUT what they say they have done? Or wish them to fail from the get-go? After all, gay people who are part of their 'pride' movement sure do seem to want the world to to take gay people at their word. \n\n \n I certainly don't want the rest of the world to take some gay people at their word. There are a few bi people who think everyone should engage in same-sex behavior. They insist it's the natural condition for EVERYONE. They're just as wrong as the ex-gay movement. Notice I said \"movement\". My beef isn't with people who choose to live a heterosexual life even if they don't feel the attraction. My beef is with those who try to turn that into a political movement against peole who choose not to do so. I hold in particular scorn those few who make a business out of feeding on people's misery. Paulk falls into that last category.\n \n \n\n It seems to me that if 'sexual orientation' and the gay rights movement is as airtight and 'scientifically sound' as the gay pride movement seems to claim, then they would have nothing to worry about from these isolated cases of people claiming to have changed. \n\n \n We don't. Don't you wonder why those isolated individuals set themselves up as examples for all of us? \n \n Afterall, I'm not setting up my choices as just what you need to live a fulfilling life. I don't go around telling straight people how much happier they'd be if they were gay.", 
   {}, 
   113984, 
   null, 
   1114801200.0
  ], 
  [
   114164, 
   null, 
   "Voice Of Reason", 
   "Is not marriage a civil right?\n \n \n Yes it is and like me you can marry anyone of the opposite sex........You want a special right............If you can have that then I should be able to marry 2 women, etc....\n \n \nWell, evidently the duly elected legislators in many locales disagree with you or there wouldn't be hate crimes on the books. They were not put there by the judiciary\n \n \n your right, there are liberal legislatures doing that..........Look at Mass. and SF......It alsmost happened here in Washington.........", 
   {}, 
   114158, 
   null, 
   1114801380.0
  ], 
  [
   114165, 
   null, 
   "Symbiote", 
   "Yes it is and like me you can marry anyone of the opposite sex\n\n \n Would you consider it an equal right if everyone was allowed to marry people only from the same sex?", 
   {}, 
   114164, 
   null, 
   1114801500.0
  ], 
  [
   114168, 
   null, 
   "MrWriteLA", 
   "It's staggering how often the ability to marry someone you don't love and aren't attracted to is presented here as something to be grateful for.\n \n \"Sanctity of marriage,\" indeed.", 
   {}, 
   114165, 
   null, 
   1114801620.0
  ], 
  [
   114172, 
   null, 
   "MrWriteLA", 
   "If \"romantic love\" is so unimportant a part of marriage -- which seems to be the case for these people -- then I'd say it's high time it was  re-defined.", 
   {}, 
   114168, 
   null, 
   1114801860.0
  ], 
  [
   114174, 
   null, 
   "JustineCredible", 
   "If one person can change I believe anyone can change......As for your statement about straights turning gay being straight I don't know why anyone would want to do that because to me the sex act gays engage in is repulsive...I just can't see any straight man doing that........\n\n \n \n No, of course you couldn't see that. You also cannot know the mind of a gay man who finds heterosexual sex acts repulcive. Just admit it, you have some real issues with accepting that there are other ways of being human than your way. \n Seemingly perfectly straight men in ancient Greece had homosexual lovers all the time. Seemingly perfectly straight men in ancient Rome had homosexual lovers all the time. Seemingly perfectly straight men during the time of Paul and Jesus were walking into temples and haveing sexual relations with boys as a form of idol worship. \n Perfectly straight men even TODAY commit henious acts of child molestation upon BOYS! \n Does Catholic Priests ring any bells for you?", 
   {}, 
   114088, 
   null, 
   1114802040.0
  ], 
  [
   114175, 
   null, 
   "wsm2506", 
   "Yes it is and like me you can marry anyone of the opposite sex........You want a special right............If you can have that then I should be able to marry 2 women, etc....\n\n \n Did you know that the anti gay groups held a meeting some years ago and decided to coin the term \"special rights\" in an effort to discredit gay rights? But also in that meeting, they specifically decided NOT to use that phrase in the wording of any voter initiatives on legislation, because they KNEW it would backlash on them?", 
   {}, 
   114164, 
   null, 
   1114802100.0
  ], 
  [
   114178, 
   null, 
   "JustineCredible", 
   "Yes it is and like me you can marry anyone of the opposite sex........You want a special right............If you can have that then I should be able to marry 2 women, etc....\n\n \n Warning!!!Slippery-slope falicy! Warning!!\n \n \n \n \nyour right, there are liberal legislatures doing that..........Look at Mass. and SF......It alsmost happened here in Washington.........\n\n \n \n You know I find your use of the word \"liberal\" ironic. You labeled those against the death penalty as \"liberal\", then I had to remind you that even your precious RCC is against it. \n You don't have the foggiest clue as to all the rights, priveledges and protections you enjoy wouldn't be there if it weren't for \"liberals.\" \n So, get over it.", 
   {}, 
   114164, 
   null, 
   1114802340.0
  ], 
  [
   114179, 
   null, 
   "tonybrown74", 
   "You got a point on Michael Jackson :) but as I have said before tbere are documented cases of gays changing every day......\n\n \n Please cite your evidence.", 
   {}, 
   113645, 
   null, 
   1114802400.0
  ], 
  [
   114189, 
   null, 
   "wsm2506", 
   "Please cite your evidence.\n\n \n WE are still waiting for him to bring one of those THOUSANDS of gays that change EVERY DAY   here to the forum to present their side.", 
   {}, 
   114179, 
   null, 
   1114802820.0
  ], 
  [
   114203, 
   null, 
   "JustineCredible", 
   "WE are still waiting for him to bring one of those THOUSANDS of gays that change EVERY DAY   here to the forum to present their side.\n\n \n \n Well, heck, at that rate all this is really moot, since THOUSANDS change their orientation EVERYDAY gays actually all converted decades, if not centuries ago. :)", 
   {}, 
   114189, 
   null, 
   1114803540.0
  ], 
  [
   114215, 
   null, 
   "tonybrown74", 
   "If even one person claims to have learned to live a life free of homosexual actions and now lives a heterosexual life, is it not the right thing to do to take them at their word rather than trying to assume anything else BUT what they say they have done? Or wish them to fail from the get-go? After all, gay people who are part of their 'pride' movement sure do seem to want the world to to take gay people at their word. \n \n\n \n Time Magazine took one person at his word and look what happened: he decided to go into a gay bar in the middle of the afternoon to \"use the bathroom\" even though there were several restaurants, bars and hotels on that same stretch of road. He sat down and had a drink. Someone asked him if he was gay and he replied yes. So why should I take him at his word?\n \n I know of one other \"ex-gay\" (Stephen somethingortheother, that conservativs like to pull out) and there has been no real scandal attached to his name, other than being a hack. And even if he really changed, why would it matter to me? You have no evidence to dictate that I can change. Why should I change? To conform to your beliefs? Please!", 
   {}, 
   113984, 
   null, 
   1114804140.0
  ], 
  [
   114217, 
   null, 
   "JustineCredible", 
   "Time Magazine took one person at his word and look what happened: he decided to go into a gay bar in the middle of the afternoon to \"use the bathroom\" even though there were several restaurants, bars and hotels on that same stretch of road. He sat down and had a drink. Someone asked him if he was gay and he replied yes. So why should I take him at his word?\n \n I know of one other \"ex-gay\" (Stephen somethingortheother, that conservativs like to pull out) and there has been no real scandal attached to his name, other than being a hack. And even if he really changed, why would it matter to me? You have no evidence to dictate that I can change. Why should I change? To conform to your beliefs? Please!\n\n \n \n Oh come on now. We really gotta give those Repukes credit. They're SOOOOOO pro-gay, just look at Jeff Gannon!", 
   {}, 
   114215, 
   null, 
   1114804500.0
  ], 
  [
   114220, 
   null, 
   "jyoshu", 
   " And even if he really changed, why would it matter to me? \n\n \n I don't know, you tell ME!! You're the ones who are always so defensive and \"up in arms\" (rhetorically) over this topic.", 
   {}, 
   114215, 
   null, 
   1114804740.0
  ], 
  [
   114221, 
   null, 
   "tonybrown74", 
   "If one person can change I believe anyone can change......As for your statement about straights turning gay being straight I don't know why anyone would want to do that because to me the sex act gays engage in is repulsive...I just can't see any straight man doing that........\n\n \n \n Honey, the straight men I've slept with don't seem repulsed by \"gay sex acts\"", 
   {}, 
   114088, 
   null, 
   1114804740.0
  ], 
  [
   114224, 
   null, 
   "wsm2506", 
   "Well, heck, at that rate all this is really moot, since THOUSANDS change their orientation EVERYDAY gays actually all converted decades, if not centuries ago. :)\n\n \n And yet, amazingly, I have never met a single one!!! Have you? I guess VOR and jyoshu have. They seem to be experts on all things having to do with homosexuality. emoticon_rolleyes", 
   {}, 
   114203, 
   null, 
   1114804920.0
  ], 
  [
   114237, 
   null, 
   "MrWriteLA", 
   "A closer look at these so-called \"ex-gay\" poster boys (written before the Paulk fiasco) : \n \n The Ex Files:\n Not Your Usual Gays\n http://www.indegayforum.org/authors/pietrzyk/pietrzyk1.html\n \n And another:\n \n Not Afraid to Change?\n http://www.indegayforum.org/authors/blair/blair1.html", 
   {}, 
   114224, 
   null, 
   1114805640.0
  ], 
  [
   114240, 
   null, 
   "wsm2506", 
   "\"PROOF\" that gays can change their orientation:\n \n http://www.libchrist.com/other/homosexual/cure.html\n \n \nOne Group that claims to be able to change homosexuals is Exodus Ministry. I wonder, why doesn't Exodus Ministry tell the public about its male co-founders. No, if they did that then everybody would know that those \"changed\" men fell in love with each other and renounced the organization! No, Exodus doesn't need to tell the public that, there are already plently of us who are not going to let that remain a secret (see the book \"One Nation Under God\"). Apparently, they were only fooling themselves as well as others by claiming to have changed. \n \n Kent Philpott led an \"ex-gay\" movement called \"Love in Action\" and wrote a book called \"The Third Sex?\"- In the book he claimed to have changed a group of homosexuals into heterosexuals. After the book was published, the alleged \"ex-homosexuals\", of whom the book discussed, SUED him publishing false information about them... Every one who was said to have changed, told the judge that they had never changed (they won the case by the way. The book cannot be published in the US. anymore. But sadly it is still being circulated in England, the public of whom is suprisingly unaware of these events.) \n \n Another \"ex-gay\", John Paulk, wrote articles for Focus on the Family. He wrote the usual garbage on how homosexuals not only can* change but ought to. But ya know what? He was caught in a gar bar in washington D.C., afterwards admited that he was still gay! He had been writing articles saying that homosexuals are not born that way, that they can and should change, and that he himself had changed and decided to choose heterosexuality- he did all of this and at the very same time remained gay! \n \n\n \n \n\"I know of nobody who has changed from homosexual to heterosexual. I know nobody else who knows anyone whose sexual orientation has been changed. I know many people who have been profoundly hurt and driven to self destructive behavior because of attempts, including electric shock therapy, to change their sexual orientation. The Ex-Gay Movement is a fraud without any credible scientific research to support claims to change homosexuals to heterosexuals.\" ~ Rembert Truluck, Doctor of Theology from Southern Baptist Theological Seminary, Louisville, KY. \n", 
   {}, 
   114224, 
   null, 
   1114805760.0
  ], 
  [
   114245, 
   null, 
   "Duo_Maxwell", 
   "Guys, by now you must learn that VOR cannot prove anything he says. Any ridiculous claim when challenged will never be proven by him. \n \n Even offering him MONEY doesn't get a single source of proof.\n \n VOR makes ridiculous claims and then cowardly ignores it when they are refuted and comes back with the same rehashed argument. He is very similar to a bad cd on repeat.", 
   {}, 
   114240, 
   null, 
   1114806000.0
  ], 
  [
   114250, 
   null, 
   "wsm2506", 
   "Guys, by now you must learn that VOR cannot prove anything he says. Any ridiculous claim when challenged will never be proven by him. \n \n Even offering him MONEY doesn't get a single source of proof.\n \n VOR makes ridiculous claims and then cowardly ignores it when they are refuted and comes back with the same rehashed argument. He is very similar to a bad cd on repeat.\n\n \n I could be wrong, but I don't think he has cited a source for ANYTHING yet.", 
   {}, 
   114245, 
   null, 
   1114806180.0
  ], 
  [
   114255, 
   null, 
   "joebrummer", 
   "And yet, amazingly, I have never met a single one!!! Have you? I guess VOR and jyoshu have. They seem to be experts on all things having to do with homosexuality. emoticon_rolleyes\n\n \n \n I really don't care if these xtain people want to try to change to straight for god. I am very opposed to these groups like Exodus and NARTH because in the quest to convince people to change, they paint homosexuality as this evil, unhealthy lifestyle. Some of us are happy being gay and don't live the lifesyle the discribe. It paints a picture to the general public of fear and stereotypes. They use study data known to be flawed and inaccurate like Bella and Wienberg's study of gay men. \n \n If these groups want to show that people can change, great but do it for religious reason and don't paint all gays as monsters.", 
   {}, 
   114224, 
   null, 
   1114806480.0
  ], 
  [
   114261, 
   null, 
   "MrWriteLA", 
   "In 1973 John Evans, who is gay, and Rev. Kent Philpott, who is heterosexual, co-founded the original \"ex-gay\" ministry, Love In Action on the outskirts of San Francisco. Philpott soon wrote The Third Sex?, the first ever \"ex-gay\" book which touted six people who supposedly converted to heterosexuality through prayer. \n \n Although time eventually revealed no one in his book actually had changed, the people reading it had no idea the stories were fallacious. As far as they knew, there was a magical place in California that had figured out the secret for making gays into straights. Inspired by his book, a few enthusiastic individuals spontaneously began their own \"ex-gay\" ministries. \n \n Evans, however, denounced the program he co-founded after his best friend Jack McIntyre committed suicide in despair over not being able to \"change\". Still, Love in Action survived because many people who read The Third Sex? came to California in hopes of changing. \n \n As a result of Philpott's book, within three years more than a dozen \"ex-gay\" ministries organically sprung up across America. As these ministries serendipitously became aware of each other, two leading \"ex-gay\" counselors at Melodyland Christian Center in Anaheim, California - Gary Cooper and Michael Bussee - decided to organize a conference where the \"ex-gays\" could meet each other and network. \n \n In September 1976, Cooper and Bussee's vision came to fruition as sixty-two \"ex-gays\" journeyed to Melodyland for the world's first \"ex-gay\" conference. The outcome of the retreat was the formation of Exodus International, an umbrella organization for \"ex-gay\" groups worldwide.\n \n The early Exodus meetings almost disintegrated the group because participants kept sleeping with each other. The group was rocked to its core a few years later when Bussee and Cooper acknowledged that they had not changed and were in love with each other. They soon divorced their wives, moved in together and eventually held a commitment ceremony.\n \n In 1979, Seventh Day Adventist minister Colin Cook founded Homosexuals Anonymous (HA). But Cook's \"ex-gay\" empire crumbled a few years later after he was scandalized for having phone sex and giving nude massages to those he was supposedly helping become heterosexual. \n \n As acceptance for homosexuality grew in the late 1970's, the \"ex-gay\" ministries had trouble attracting new recruits and growth of these programs stagnated. Then came AIDS. Unscrupulous ministry leaders were able to use the threat of AIDS to scare people into entering \"ex-gay\" ministries. \n \n However, even as the epidemic spurred new growth, the \"ex-gay\" ministries remained relatively obscure in mainstream society. This dramatically changed in 1998 when the politically motivated Religious Right jumped on the \"ex-gay\" bandwagon launching a multi-million dollar newspaper and television ad campaign. They featured groups like Exodus because the traditional fire and brimstone rhetoric of the far right political groups made them seem mean-spirited and intolerant. By embracing the \"ex-gays\", hateful men like Revs. D. James Kennedy, Jerry Falwell and Pat Robertson could claim they loved homosexuals and were just trying to help them. \n \n But the ad campaign soon backfired after University of Wyoming student Matthew Shepard was murdered because he was gay. The groups who sponsored the anti-gay ads were held largely responsible for creating a climate where hate crimes, such as the Shepard incident, could flourish. Although these groups denied a connection, because of the negative fallout they postponed their \"ex-gay\" television ads for several months and the campaign lost steam. \n \n Additionally, several of the \"ex-gays\" they paraded as proof of \"change\" were uncovered as frauds. The biggest example was \"ex-gay\" poster boy John Paulk who the ad campaign sponsors put on the cover of Newsweek with his \"ex-lesbian\" wife Anne under the large headline, \"Gay for Life?\" But in September 2000 Paulk was photographed cruising in a Washington, DC gay bar and was suspended as Chairman of Exodus and put on a temporary \"hiatus\" by Focus on the Family, where he ran their \"Love Won Out\" program.\n \n The \"ex-gay\" ministries are still growing today despite their history of scandals and failures. The sad truth is, as long as people are made to hate themselves for being gay, these groups will exist. The best way to counter their negative influence is by highlighting the truth and revealing the failed history that \"ex-gay\" groups represent. Showing an honest portrayal of gay life also greatly diminishes the effectiveness of these groups. When people learn that God loves them for who they are and that they can be gay and happy, the appeal of these dangerous groups invariably wanes. \n http://www.anythingbutstraight.com/learn/eghistory.html", 
   {
    "unicode_changes_made": true
   }, 
   112897, 
   null, 
   1114807320.0
  ], 
  [
   114279, 
   null, 
   "jyoshu", 
   "I guess I just don't get it--I mean again, even if one . . . just one person comes along in society and claims to have succeeded in living a successful and fulfilling straight life even though he or she says they used to be gay, what the heck is the big, awful deal????? \n \n So what? Is the whole argumentative and 'logical' structure of the gay rights movement so fragile or flawed that it is going to come crashing down like the Hindenberg if they give any response OTHER than complete derision and demonization of any person or group regarding this? Is the sky truly going to fall??? Is their political movement seriously so threatened by this, that they work to expose people who go to bars, reporting it to the media, and then take any given opportunity they can to vilify anyone who has claimed to change by such accsations as \"he's a hack\" or \"it's just for the money\"? For a group of people who demand so much that people take them at their word, why is taking one person at their word that they may have done it so god-awful???? I mean, one would think if their arguments are so airtight, it's just not going to matter much, let alone warrant the amount of efforts on their part to go after these few people. emoticon_frazzled", 
   {}, 
   114261, 
   null, 
   1114808940.0
  ], 
  [
   114287, 
   null, 
   "joebrummer", 
   "I guess I just don't get it--I mean again, even if one . . . just one person comes along in society and claims to have succeeded in living a successful and fulfilling straight life even though he or she says they used to be gay, what the heck is the big, awful deal????? \n \n So what? Is the whole argumentative and 'logical' structure of the gay rights movement so fragile or flawed that it is going to come crashing down like the Hindenberg if they give any response OTHER than complete derision and demonization of any person or group regarding this? Is the sky truly going to fall??? Is their political movement seriously so threatened by this, that they work to expose people who go to bars, reporting it to the media, and then take any given opportunity they can to vilify anyone who has claimed to change by such accsations as \"he's a hack\" or \"it's just for the money\"? For a group of people who demand so much that people take them at their word, why is taking one person at their word that they may have done it so god-awful???? I mean, one would think if their arguments are so airtight, it's just not going to matter much, let alone warrant the amount of efforts on their part to go after these few people. emoticon_frazzled\n\n \n \n \n The big deal is the message this send is inaccurate. The big deal is 1) was this person ever gay in the first place 2) They have more to gain by saying it, so of course it should be questioned. 3) are they just trying to sell books?\n \n It is too big of a claim to take at face value.", 
   {}, 
   114279, 
   null, 
   1114810440.0
  ], 
  [
   114313, 
   null, 
   "wsm2506", 
   "I guess I just don't get it--I mean again, even if one . . . just one person comes along in society and claims to have succeeded in living a successful and fulfilling straight life even though he or she says they used to be gay, what the heck is the big, awful deal????? \n \n So what? Is the whole argumentative and 'logical' structure of the gay rights movement so fragile or flawed that it is going to come crashing down like the Hindenberg if they give any response OTHER than complete derision and demonization of any person or group regarding this? Is the sky truly going to fall??? Is their political movement seriously so threatened by this, that they work to expose people who go to bars, reporting it to the media, and then take any given opportunity they can to vilify anyone who has claimed to change by such accsations as \"he's a hack\" or \"it's just for the money\"? For a group of people who demand so much that people take them at their word, why is taking one person at their word that they may have done it so god-awful???? I mean, one would think if their arguments are so airtight, it's just not going to matter much, let alone warrant the amount of efforts on their part to go after these few people. emoticon_frazzled\n\n \n What I don't get is why you think we should or would even WANT to change. emoticon_rolleyes", 
   {}, 
   114279, 
   null, 
   1114813380.0
  ], 
  [
   114324, 
   null, 
   "tonybrown74", 
   "I don't know, you tell ME!! You're the ones who are always so defensive and \"up in arms\" (rhetorically) over this topic.\n\n \n \n Hon ... you're the one who is telling us to take whooever at face value, even though you refuse to acknowledge parts of the story you yourself linked to that calls your \"we should take him (John Paulk) at face value\" defense into question.\n \n Don't get exasperated now because I am pointing out the error of your argument.", 
   {}, 
   114220, 
   null, 
   1114814700.0
  ], 
  [
   114327, 
   null, 
   "MrWriteLA", 
   "Hon ... you're the one who is telling us to take whooever at face value, even though you refuse to acknowledge parts of the story you yourself linked to that calls your \"we should take him (John Paulk) at face value\" defense into question.\n \n Don't get exasperated now because I am pointing out the error of your argument.\n Tony, you know we \"militant gay activists\" are always the ones who hysterically \"get in people's faces\" on all these topics. It's never that we're reacting  to the mere \"disagreements\" being expressed by these \"pro-gay\" straight posters who innocently sit here on Gay Rights boards from morn till midnight in search of \"honest debate\" on a topic that impacts their lives so much (though in what way escapes them at the moment).emoticon_rolleyes", 
   {}, 
   114324, 
   null, 
   1114815120.0
  ], 
  [
   114330, 
   null, 
   "melsucceeds", 
   "Some people are attacked for simply 'looking' gay.", 
   {
    "post_info": {
     "post_title": "Some Gays Can't Hide their orientation"
    }
   }, 
   114327, 
   null, 
   1114815780.0
  ], 
  [
   114347, 
   null, 
   "JakeCJB", 
   "The big deal is the message this send is inaccurate. The big deal is 1) was this person ever gay in the first place 2) They have more to gain by saying it, so of course it should be questioned. 3) are they just trying to sell books?\n \n It is too big of a claim to take at face value.\n\n \n And I would say it is also the way they go about it. If someone is really straight, that person will be straight. Why does anyone need to pour their money into a whole program, to be convinced they are either not really gay, or that they are gay, but can act straight. If sexual orientation is a simple, personal, conscious choice, what is the need for these programs.", 
   {}, 
   114287, 
   null, 
   1114818300.0
  ], 
  [
   114350, 
   null, 
   "MrWriteLA", 
   "If sexual orientation is a simple, personal, conscious choice, what is the need for these programs.\n Exactly. The mere existence of these \"reparative\" therapy scams knocks the whole \"choice\" lie into a cocked hat. What -- gays who are \"highly-motivated\" by their religion or whatever to be straight are gonna fork out 1000's of samoleans simply to un-choose  their deliberately sinful choice??? (Forgetting for a moment that they always fail.) \n \n Yeah, that really makes sense. Not.\n \n Yet it's amazing that so many praisers of these charlatan outfits (even on this very forum) are the first to give voice to the \"choice\" canard in their next breath. Of course, logical consistency is hardly the top priority of the every-anti-gay-argument-but-the-kitchen-sink set.\n \n (Not that it appears to bother them in the slightest.)", 
   {}, 
   114347, 
   null, 
   1114818840.0
  ], 
  [
   114351, 
   null, 
   "Voice Of Reason", 
   "Some people are attacked for simply 'looking' gay.\n\n \n Just curious...........How does one look gay?", 
   {}, 
   114330, 
   null, 
   1114818960.0
  ], 
  [
   114355, 
   null, 
   "onekgguy", 
   "Your right, but if the killing was done as a hate baised crime there should be stiffer penalties. If the heterosexual was killed by a gay person, just for being heterosexual there should be a stiffer penalty. You see when a gay person is beaten to a pulp (like I was..baseball bats) it is only considered an assult. The penalty in most states is small. A few months in prison and probation. With a hate crime law in place that same assult would become a few years in prison. \n \n When teenagers are going arounf \"XXXXX bashing\" for kicks on Friday night (which yes, this really happens) there needs to be stiffer penalties to discourage this.\n \n It is the same thing as having stiffer penalties for killing a police officer.\n\n \n Joe, I think what is needed are stiffer penalties for anybody who goes around bashing people with baseball bats. How is it that when anyone is beaten within inches of their lives, the person committing the crime is allowed to get off with a few months in jail? Isn't there something wrong with a justice system which would allow for that? \n \n I think hate crime legislation is unnecessary but what is necessary are punishments which fit the crime. I'm a bicyclist...I ride thousands of miles a year out on the highways. It's possible that one day somebody is going to come along and slam me into a ditch simply because they don't like or they 'hate' bicyclists. I don't expect any special punishment for them. I do expect that (if there is a witness) our justice system would come down hard on the person because of the way they endangered my life. Actually, in today's environment I would doubt the justice system would do much if anything. \n \n Our judiciary has become a joke in so many ways. I understand that the U.S. incarcerates a higher percentage of its population than most other developed countries...at least that's what I usually hear when I suggest that we don't incarcerate enough people. Build more prisons if that's what it takes to get the message across that violence of any kind won't be tolerated. I'd gladly pay more taxes to see that happen. Hate crime legislation isn't needed but tougher judges and tougher sentencing guidelines are.\n \n Joe, I like your music...I especially liked the song, Heaven Help Me...very nice\n \n Kevin g", 
   {}, 
   113228, 
   null, 
   1114821120.0
  ], 
  [
   114360, 
   null, 
   "tonybrown74", 
   "emoticon_confused \nTony, you know we \"militant gay activists\" are always the ones who hysterically \"get in people's faces\" on all these topics. It's never that we're reacting  to the mere \"disagreements\" being expressed by these \"pro-gay\" straight posters who innocently sit here on Gay Rights boards from morn till midnight in search of \"honest debate\" on a topic that impacts their lives so much (though in what way escapes them at the moment).emoticon_rolleyes\n\n \n Well, I will freely admit that I have met some people from other message forums in person. That said, this is not my life. I am not here all the time. There is a lot more going on in my life than whether I would be able to marry my hypothetical boyfriend this week. I worry about paying bills. I am concerned about what career path I am going to take in this questionable economy. I worry about getting sick without health insurance. I know I need to lose some weight. I want to take a trip to Montreal this year but can I afford it. My mother and Grandmother had a falling out and they are not speaking and I have to deal with that. I need to fix my car.\n \n But when I am here, this is the place that I come to (and is designated for) glbt issues. I find it beyond triflin' that someone who is not gay is criticizing me (or anyone else for that matter) for talking about any gay related issues. I find it ludicrous that the same person is here much more than most others, yet feels the need to criticize us foronly focusing on our gay lives.\n \n If it bothers them so much, why are they here?", 
   {}, 
   114327, 
   null, 
   1114822080.0
  ], 
  [
   114363, 
   null, 
   "tonybrown74", 
   "[COLOR=Navy]Joe, I think what is needed are stiffer penalties for anybody who goes around bashing people with baseball bats. How is it that when anyone is beaten within inches of their lives, the person committing the crime is allowed to get off with a few months in jail? Isn't there something wrong with a justice system which would allow for that? \n \n I think hate crime legislation is unnecessary but what is necessary are punishments which fit the crime. I'm a bicyclist...I ride thousands of miles a year out on the highways. It's possible that one day somebody is going to come along and slam me into a ditch simply because they don't like or they 'hate' bicyclists. I don't expect any special punishment for them. I do expect that (if there is a witness) our justice system would come down hard on the person because of the way they endangered my life. Actually, in today's environment I would doubt the justice system would do much if anything. \n\n \n Society punishes people based on intent all the time. Otherwise there would not be a difference between killing a cop and killing someone who ticked you off at a bar. Hate crimes penalties have more to do with a form of domestic terrorism thn actual 'hate'. To say that we should get rid of hate crimes is extremely shortsighted, in my view. It does not take into consideration that people do attack others based on real or perceived characteristics, and that these crimes are usually done to send a message to everyone with that real or perceived characteristic.", 
   {}, 
   114355, 
   null, 
   1114822560.0
  ], 
  [
   114365, 
   null, 
   "MrWriteLA", 
   "If it bothers them so much, why are they here?\n Indeed. It's like some non-athletic type who spends all day in the bleachers at a basketball court and gets annoyed that the people there seem to spend so much time bouncing a ball around.", 
   {}, 
   114360, 
   null, 
   1114822800.0
  ], 
  [
   114366, 
   null, 
   "tonybrown74", 
   "Indeed. It's like someone who spends all day at a basketball court and gets annoyed that the people there spend so much time bouncing a ball around.\n\n \n \n A more apt analogy: going to a basketball game and complaining about people's obsession with basketball.", 
   {}, 
   114365, 
   null, 
   1114823160.0
  ], 
  [
   114368, 
   null, 
   "MrWriteLA", 
   "A more apt analogy: going to a basketball game and complaining about people's obsession with basketball.\n You're right. Much better.\n \n I still like the analogy about the boy whacking a bee-hive with a baseball bat all day, who then not only complains about how hateful the bees are for stinging him, but demands they respect his difference of opinion about whether or not they should exist.", 
   {}, 
   114366, 
   null, 
   1114823340.0
  ], 
  [
   114396, 
   null, 
   "joebrummer", 
   "Originally Posted by onekgguy\n [COLOR=Navy]Joe, I think what is needed are stiffer penalties for anybody who goes around bashing people with baseball bats. How is it that when anyone is beaten within inches of their lives, the person committing the crime is allowed to get off with a few months in jail? Isn't there something wrong with a justice system which would allow for that?\n \n I think hate crime legislation is unnecessary but what is necessary are punishments which fit the crime. I'm a bicyclist...I ride thousands of miles a year out on the highways. It's possible that one day somebody is going to come along and slam me into a ditch simply because they don't like or they 'hate' bicyclists. I don't expect any special punishment for them. I do expect that (if there is a witness) our justice system would come down hard on the person because of the way they endangered my life. Actually, in today's environment I would doubt the justice system would do much if anything. \n\n \n \n \n Funny you should say this, my first gay bashing was five guys with baseball bats! I was beaten so badly my parents said they couldn't recognize me. The assailants of this crime were never caught. I still have many scars on my body as a result of this crime. I disagree with you on this one. I think they should have been punished as a hate crime. I was beaten to a pulp as a direct result of me, being gay. I would like to have seen then convicted on the basis. If the had been caught, they would have gotten assult chrages. A few months in jail. A hate crime law would have put them away for years!", 
   {}, 
   114368, 
   null, 
   1114830900.0
  ], 
  [
   114397, 
   null, 
   "Voice Of Reason", 
   "Since none of my gay friends answered the question I will ask it again.....\n \n How does one look gay? emoticon_confused", 
   {}, 
   114396, 
   null, 
   1114835040.0
  ], 
  [
   114445, 
   null, 
   "onekgguy", 
   "Funny you should say this, my first gay bashing was five guys with baseball bats! I was beaten so badly my parents said they couldn't recognize me. The assailants of this crime were never caught. I still have many scars on my body as a result of this crime. I disagree with you on this one. I think they should have been punished as a hate crime. I was beaten to a pulp as a direct result of me, being gay. I would like to have seen then convicted on the basis. If the had been caught, they would have gotten assult chrages. A few months in jail. A hate crime law would have put them away for years!\n\n \n Joe, I'd also love to have seen the people who beat you locked away for years but why should it take hate crime legislation to do that? What does it really matter what they were thinking when they beat you? Is there any way our judiciary could see it as anything other than hate? It certainly wasn't done to you out of love or caring. These were angry people who lashed out at you. \n \n What if I was walking along the street that night and this same gang approached me and beat me as they did you. To my knowledge their crimes against me wouldn't qualify for any enhanced punishment. Is that right? Is it right that my beating would be minimized when compared to yours because I'm not gay? I don't see any reason for a distinction between the two crimes. Beating someone or killing someone should carry the same puninshment regardless of why they did it. \n \n Kevin g", 
   {}, 
   114396, 
   null, 
   1114844160.0
  ], 
  [
   114495, 
   null, 
   "joebrummer", 
   "Joe, I'd also love to have seen the people who beat you locked away for years but why should it take hate crime legislation to do that? What does it really matter what they were thinking when they beat you? Is there any way our judiciary could see it as anything other than hate? It certainly wasn't done to you out of love or caring. These were angry people who lashed out at you. \n \n What if I was walking along the street that night and this same gang approached me and beat me as they did you. To my knowledge their crimes against me wouldn't qualify for any enhanced punishment. Is that right? Is it right that my beating would be minimized when compared to yours because I'm not gay? I don't see any reason for a distinction between the two crimes. Beating someone or killing someone should carry the same puninshment regardless of why they did it. \n \n Kevin g\n\n \n The distinction is that a hate crime attacks someone for a vital part od who they are. It is personal. It carries with it \"more\" psychological damage than a random act. Without hate crime legislation, both of these crimes are considered simple assault and would only carry a sentence of a few months. If someone is beaten for no other reason than who they are i.e., black, white, gay, straight, Jewish, christian.etc.... It really isn't the same crime. I would google hate crimes and look at all the different sites that come up that speak to the psychological damage and how it really is different. I cannot convince you of that, you would need to see it for yourself.", 
   {}, 
   114445, 
   null, 
   1114877760.0
  ], 
  [
   114496, 
   null, 
   "joebrummer", 
   "Since none of my gay friends answered the question I will ask it again.....\n \n How does one look gay? emoticon_confused\n\n \n \n That is an arbitrary question, someone may look butch to one person, and gay to another. The same way someone may seem like a thug to one and an angel to another. It is all about perception.", 
   {}, 
   114397, 
   null, 
   1114877880.0
  ], 
  [
   114510, 
   null, 
   "jyoshu", 
   "Hon ... you're the one who is telling us to take whooever at face value, even though you refuse to acknowledge parts of the story you yourself linked to that calls your \"we should take him (John Paulk) at face value\" defense into question. \n\n \n Hey, it's not my fault you seem so totally threatened by people like Paulk--one would think your movement hinged on the issue the way some of you attack these guys and put so much time and effort into trying to discredit them. Your's is a clasic case of hysteria over something that is only a big deal to you if you let it be.\n \n \nA more apt analogy: going to a basketball game and complaining about people's obsession with basketball.\n\n \n \nI still like the analogy about the boy whacking a bee-hive with a baseball bat all day, who then not only complains about how hateful the bees are for stinging him, but demands they respect his difference of opinion about whether or not they should exist.\n\n \n That's funny, because that very beehive analogy has been used here to describe you all more times than anyone else. Call me old fashioned, but I guess I'm still of the mindset that when something is called a \"forum,\" it actually does mean that there could be more than one opinion expresed there, not just the one sympathetic to \"gay rights.\" It's been pointed out to several of you more than once that it is in fact you who are doing the provoking, especially when you can't stand to let a disagreeable post go by without getting in some attack on the messenger--a knee-jerk reaction to gett that 'last word' in, or giving some accusation of '\"being obessed\" or \"being on here from morning till night (when it's amounted to a whopping 20-30 minutes of posting time at most a day!!! [GASP]). The gig is up--you don't get a pass to chain yank here all you want just because you side with the gay rights position. It's not an excuse for you to beat that beehive. It's so transparent.\n \n If you don't like reading disagreement, or more aptly, can't handle it, one can't help but wonder why you would want to be in a forum in the first place.", 
   {}, 
   114368, 
   null, 
   1114881060.0
  ], 
  [
   114514, 
   null, 
   "wsm2506", 
   "Since none of my gay friends answered the question I will ask it again.....\n \n How does one look gay? emoticon_confused\n\n \n Look in the mirror. They don't look any different than you do.", 
   {}, 
   114397, 
   null, 
   1114882020.0
  ], 
  [
   114540, 
   null, 
   "melsucceeds", 
   "I can sometimes tell if a person is homosexual just by their appearance. Although some are not easy to distinguish.", 
   {
    "post_info": {
     "post_title": "Voice of Reason"
    }
   }, 
   114514, 
   null, 
   1114884840.0
  ], 
  [
   114542, 
   null, 
   "melsucceeds", 
   "Facial appearance is evidence to distinguish SOME gay folks.", 
   {
    "post_info": {
     "post_title": "Cont:"
    }
   }, 
   114540, 
   null, 
   1114885020.0
  ], 
  [
   114547, 
   null, 
   "Voice Of Reason", 
   "That is an arbitrary question, someone may look butch to one person, and gay to another. The same way someone may seem like a thug to one and an angel to another. It is all about perception.\n\n \n Yeah Joe but someone said in a previous post that gays were attacked for how they look..........The Gay people I know you would never be able to tell........They look like anyone else..........", 
   {}, 
   114496, 
   null, 
   1114885500.0
  ], 
  [
   114548, 
   null, 
   "Voice Of Reason", 
   "Look in the mirror. They don't look any different than you do.\n\n \n I agree, so how does one know they are gay to attack them?", 
   {}, 
   114514, 
   null, 
   1114885560.0
  ], 
  [
   114550, 
   null, 
   "Jo Bennett", 
   "They don't, they just think they do. Which is why there are so many instances of non-gays being attacked by people who thought they were gay. That and if someone is walking down the road hand in hand with their partner then if they are of the same sex it can be an indicator, more so if they are kissing.", 
   {}, 
   114548, 
   null, 
   1114885920.0
  ], 
  [
   114557, 
   null, 
   "Voice Of Reason", 
   "They don't, they just think they do. Which is why there are so many instances of non-gays being attacked by people who thought they were gay. That and if someone is walking down the road hand in hand with their partner then if they are of the same sex it can be an indicator, more so if they are kissing.\n\n \n Well that may be a problem in UK Jo but it is not here...I am not saying it never happens but it is rare and I think the laws on the books are sufficient to punish anyone that perpetrates and attack on anyone, be they gay or straight.......They just need to be enforced..........", 
   {}, 
   114550, 
   null, 
   1114886760.0
  ], 
  [
   114569, 
   null, 
   "Jo Bennett", 
   "I'm not aware of it happening here, I was simply recalling what had been mentioned earlier in the thread with reference to hate crimes.", 
   {}, 
   114557, 
   null, 
   1114887720.0
  ], 
  [
   114597, 
   null, 
   "BobNelson2", 
   "Is their political movement seriously so threatened by this, that they work to expose people who go to bars, reporting it to the media, and then take any given opportunity they can to vilify anyone who has claimed to change by such accsations as \"he's a hack\" or \"it's just for the money\"? For a group of people who demand so much that people take them at their word, why is taking one person at their word that they may have done it so god-awful???? I mean, one would think if their arguments are so airtight, it's just not going to matter much, let alone warrant the amount of efforts on their part to go after these few people. emoticon_frazzled\n\n \n The two points you keep refusing to grasp are:\n \n The people we're calling hacks ARE hacks. They ARE in it for the money -- it's their fricken job to go around the country as poster boys and girls for heterosexual \"conversion\". These organizations make lots of money by taking advantage of families in crisis. Go to one of their seminars -- it'll cost you, of course.\n \n You won't find me criticizing the gay and bi people I know who've gone on to marry someone of the opposite sex. They did what's right for them (for a variety of reasons) and I'm glad they're happier. And the ones that weren't happy, I've stood by as they reversed their \"conversion\" (your side's term, not theirs). \n \n But NONE of these people would dream of saying \"gay people can change\" or \"YOU can change\". That's the second point. Gay people aren't going around saying \"hey, everybody, go gay!!! You'll love it!!!\" No one who has gone through the struggle of coming out, let alone someone who has gone through the additional struggle of \"going back in\", would advocate one solution for everyone. Well, no one who was truly at peace with his/her decision who wasn't drawing a paycheck based on his/her \"testimony\".", 
   {}, 
   114279, 
   null, 
   1114891500.0
  ], 
  [
   114617, 
   null, 
   "joebrummer", 
   "I agree, so how does one know they are gay to attack them?\n\n \n \n They don't...I said before it is all about perception. If someone, for whatever reason \"THINKS\" you are gay........", 
   {}, 
   114548, 
   null, 
   1114894680.0
  ], 
  [
   114650, 
   null, 
   "melsucceeds", 
   "SOME gay folks can be distingushed and it's not how they dress. For me, it's as easy as determining what ethnic group or area of the world someone may come from. Now, maybe some of you don't have those abilities, but I do and my opinion should not be dismissed.", 
   {
    "post_info": {
     "post_title": "It's only my opinion"
    }
   }, 
   114617, 
   null, 
   1114904400.0
  ], 
  [
   114653, 
   null, 
   "jyoshu", 
   "You won't find me criticizing the gay and bi people I know who've gone on to marry someone of the opposite sex. They did what's right for them (for a variety of reasons) and I'm glad they're happier. And the ones that weren't happy, I've stood by as they reversed their \"conversion\" (your side's term, not theirs).\n\n \n So you'd completely support a person who decides to marry a person of the opposite sex, after being gay, and who says \"I CAN live a fullfilling straight life? You'd put as much effort into supporting them and arguing in their favor as you do arguing in favor of gay people who live \"out?\"\n \n I'll believe it when I see it.", 
   {}, 
   114597, 
   null, 
   1114904700.0
  ], 
  [
   114660, 
   null, 
   "Voice Of Reason", 
   "They don't...I said before it is all about perception. If someone, for whatever reason \"THINKS\" you are gay........\n\n \n So if a person is attacked then how do you know its a hate crime?", 
   {}, 
   114617, 
   null, 
   1114905840.0
  ], 
  [
   114661, 
   null, 
   "Voice Of Reason", 
   "SOME gay folks can be distingushed and it's not how they dress. For me, it's as easy as determining what ethnic group or area of the world someone may come from. Now, maybe some of you don't have those abilities, but I do and my opinion should not be dismissed.\n\n \n I have seen men that were gay and they did not follow the usual stereotype......I play on a golf team and one of my team mates is gay and there is no way by looking at hom that you can tell......", 
   {}, 
   114650, 
   null, 
   1114906020.0
  ], 
  [
   114666, 
   null, 
   "joebrummer", 
   "A hate crime is a criminal act against a person or his/her property targeted because of that person's real or perceived race, color, religion, nationality, country of origin, disability, gender or sexual orientation. Under California law, for a crime to be considered a hate crime, a number of specific criteria must all be met as defined in the California code. Federal law differs in certain respects from state law. In California, for a crime to be considered a \"hate crime\" and for the penalty enhancement provisions of the law to take effect, a prosecutor must prove that the motivation of the perpetrator in committing the crime was bias against a person or persons in a protected category, and that this bias was a \"substantial factor\" (and not an incidental factor) in the crime. Hate incidents are considerably more common on college campuses than hate crimes. Unlike hate crimes, there is no formal legal definition for a hate incident. They are generally the same types of behaviors and crimes as described above except that one or more of the formal legal criteria described above are not met. Regardless, the victims tend to experience the same range of emotions and benefit from the same level of caring response. When you are aware that a student has experienced a hate incident or hate crime:\n http://www.sa.ucsb.edu/distressedstudentsguide/whosthevictim/hatecrimeorhate.asp", 
   {}, 
   114660, 
   null, 
   1114907580.0
  ], 
  [
   114669, 
   null, 
   "BobNelson2", 
   "So you'd completely support a person who decides to marry a person of the opposite sex, after being gay, and who says \"I CAN live a fullfilling straight life? You'd put as much effort into supporting them and arguing in their favor as you do arguing in favor of gay people who live \"out?\"\n\n \n What do you mean \"argue in their favor\"? With whom? Who is trying to stop them? Who tried to prevent them from getting married? Who goes around warning what cesspools of disease they are? Who tries to take away their children?\n \n Secondly, they didn't say \"I CAN live a fullfilling straight life\". They weren't doing it as some sort of project. \n \n \nI'll believe it when I see it.\n\n \n Well, you weren't invited to the wedding, so I guess you'll have to take my word.\n \n And one last thing, they fully, and I mean FULLY, support same-sex marriage.", 
   {}, 
   114653, 
   null, 
   1114908060.0
  ], 
  [
   114680, 
   null, 
   "melsucceeds", 
   "I have seen men that were gay and they did not follow the usual stereotype......I play on a golf team and one of my team mates is gay and there is no way by looking at hom that you can tell......\n\n \n \n What you are saying is correct. That's why I mentioned that SOME gays are easy to distinguish from others.", 
   {
    "post_info": {
     "post_title": "That's True"
    }
   }, 
   114661, 
   null, 
   1114910460.0
  ], 
  [
   114700, 
   null, 
   "jyoshu", 
   "What do you mean \"argue in their favor\"? With whom? Who is trying to stop them? Who tried to prevent them from getting married? Who goes around warning was cesspools of disease they are? Who tries to take away their children?\n\n \n But you don't just limit your rhetoric toward people trying to stop gay marriage, or calling them \"cesspools of disease\" (who the heck has said that anyway?), or those trying to take away their children. If you did, I could understand it. But you oppose even people who support gay adoption, civil unions, and full employment non-discrimination of gays without giving them the slightest credit for agreeing with your position.", 
   {}, 
   114669, 
   null, 
   1114915080.0
  ], 
  [
   114740, 
   null, 
   "JustineCredible", 
   "Since none of my gay friends answered the question I will ask it again.....\n \n How does one look gay? emoticon_confused\n\n \n You're kidding, right? \n I'm not buying the \"Mr. Innocent\" act.", 
   {}, 
   114397, 
   null, 
   1114930020.0
  ], 
  [
   114741, 
   null, 
   "JustineCredible", 
   "Facial appearance is evidence to distinguish SOME gay folks.\n\n \n \n \"Facial appearance\"? Give me a break, do gays have bigger noses or wider set eyes? \n Sorry, I'm not buying that one either.", 
   {}, 
   114542, 
   null, 
   1114930080.0
  ], 
  [
   114742, 
   null, 
   "JustineCredible", 
   "I agree, so how does one know they are gay to attack them?\n\n \n Gee, I don't know, maybe walking out of a \"Gay Bar\" would be a clue. emoticon_rolleyes", 
   {}, 
   114548, 
   null, 
   1114930140.0
  ], 
  [
   114743, 
   null, 
   "JustineCredible", 
   "Well that may be a problem in UK Jo but it is not here...I am not saying it never happens but it is rare and I think the laws on the books are sufficient to punish anyone that perpetrates and attack on anyone, be they gay or straight.......They just need to be enforced..........\n\n \n \n If you really think that, you are being contentedly naive'. emoticon_frazzled", 
   {}, 
   114557, 
   null, 
   1114930260.0
  ], 
  [
   114745, 
   null, 
   "JustineCredible", 
   "SOME gay folks can be distingushed and it's not how they dress. For me, it's as easy as determining what ethnic group or area of the world someone may come from. Now, maybe some of you don't have those abilities, but I do and my opinion should not be dismissed.\n\n \n Um, I really hate to tell you but distinguishing an ethnic group is completely different than being able to distinguish a gay person from all the straights. What you are discribing is more commonly called \"gay-dar.\" \n For a straight person to have this portion activated, in the hypothetical, one would need to be exposed to gays on a larger scale than the usual straight person. \n So, I will pose this to you, how is it you have this ability? \n \n Facial appearance just doesn't cut it darlin. Gays don't have hooked noses or recessed eyes or bigger hands than straights. They come in all colors, sizes, shapes and walks of life. They/ we, are you teachers, firefighters, soldiers, grocery store clerks, doctors, nurses, lawyers, administrative assistants, financial planners, cameramen (gender inspecific), police, office managers, records keepers...etc.\n There's no specific \"gay job\" or \"lesbian career\" path, there are no hight or weight requirements, fashion styles, pet ownership restrictions, cars, houses, apartments, or music styles. \n We are EVERYWHERE.\n We are EVERYONE.\n We are you brothers, sisters, Aunts, Uncles, mothers, fathers, cousins, grandparents, sons and daughters. \n \n Just as no one can tell what kind of ice cream a person likes just by looking at them, nor can someone tell if a person is gay or straight. At least not unless they are wearing a sign or a specific slogan. \n Heck even some drag queens are straight. (Although not many, but there are a few)\n \n Sure, it's probably a whole lot easier to distinguish a gay person from a straight person by the company he/she keeps or the places they may visit, or even the neighborhoods they live in. But on your typical day, on a busy downtown sidewalk, in the middle of the week, I seriously doubt anyone could pick ME out in the crowd. \n Let alone at the grocery store or doctor's office.", 
   {}, 
   114650, 
   null, 
   1114930980.0
  ], 
  [
   114751, 
   null, 
   "onekgguy", 
   "Help me to understand why it is that often times gay men for whatever reason come off as more feminine than women? I'm thinking of the show on CBS called, Amazing Race. There was a gay couple in the show and they both were way over the top in acting feminine. I don't get it. You would have to really try to come off that way. What's the game?\n \n Kevin g", 
   {}, 
   114745, 
   null, 
   1114932120.0
  ], 
  [
   114754, 
   null, 
   "JustineCredible", 
   "Help me to understand why it is that often times gay men for whatever reason come off as more feminine than women? I'm thinking of the show on CBS called, Amazing Race. There was a gay couple in the show and they both were way over the top in acting feminine. I don't get it. You would have to really try to come off that way. What's the game?\n \n Kevin g\n\n \n \n Lack of fear. Men are taught how to behave by society. They are taught that \"real men\" are strong, tough, never show emotion. I would have to believe that gay men who show their efeminate side simply don't have the fear of their emotions which are so heavily stressed in straight society. It's a way of acting out. \n Not all gay men do act efeminate though. \n Some men who do act efeminate are not gay.\n \n Case in point.\n I these two friends, both are male, one is gay and the other straight. The really funny part is that the gay one is very reserved emotionally. He displays no efeminate tendencies whatsoever. While the straight one does. My straight male friend is over the top in his display of emotion and drama. \n Both these men are involved in theatre, both men know each other and have worked with each other. \n Those of us who know both of them actually see it as amusing as well as refreshing. \n Both these men break the stereotypes of both sexual orientations. \n It's a beautiful thing.", 
   {}, 
   114751, 
   null, 
   1114933380.0
  ], 
  [
   114801, 
   null, 
   "Jo Bennett", 
   "Help me to understand why it is that often times gay men for whatever reason come off as more feminine than women? I'm thinking of the show on CBS called, Amazing Race. There was a gay couple in the show and they both were way over the top in acting feminine. I don't get it. You would have to really try to come off that way. What's the game?\n \n Kevin g\n\n \n It's worth noting that not all effeminate men are actually gay, there are quite a lot of straight men who are camp. It's just a question of being comfortable with your own sexuality.", 
   {}, 
   114751, 
   null, 
   1114940460.0
  ], 
  [
   114836, 
   null, 
   "joebrummer", 
   "Help me to understand why it is that often times gay men for whatever reason come off as more feminine than women? I'm thinking of the show on CBS called, Amazing Race. There was a gay couple in the show and they both were way over the top in acting feminine. I don't get it. You would have to really try to come off that way. What's the game?\n \n Kevin g\n\n \n \n I also think this comes down to role models. Gay youth have no idea how they are supposed to act. There are no role models for them excepot \"jack\" on Will and Grace. This causes young gay kids to follow sterotypes of the campy, fluffy guy. I could be wrong but I do think this is a contribution to the problem. On the other hand there are some pretty rough guys out there who are gay. Take the singer from \"Judiest Priest\" I am not thinking this guy is effeminte in anyway.", 
   {}, 
   114751, 
   null, 
   1114962300.0
  ], 
  [
   114876, 
   null, 
   "onekgguy", 
   "Thanks for the views. I appreciate them.\n \n Kevin g", 
   {}, 
   114836, 
   null, 
   1114968900.0
  ], 
  [
   114951, 
   null, 
   "BobNelson2", 
   "But you don't just limit your rhetoric toward people trying to stop gay marriage, or calling them \"cesspools of disease\" (who the heck has said that anyway?), or those trying to take away their children. If you did, I could understand it. But you oppose even people who support gay adoption, civil unions, and full employment non-discrimination of gays without giving them the slightest credit for agreeing with your position.\n\n \n I have no idea what you're talking about in this post. Are you changing the subject?\n \n YOU asked me :\n \n <<So you'd completely support a person who decides to marry a person of the opposite sex, after being gay, and who says \"I CAN live a fullfilling straight life? You'd put as much effort into supporting them and arguing in their favor as you do arguing in favor of gay people who live \"out?\"<<\n \n And I replied that there is no need to argue in favor of \"ex-gay\" people because NO ONE is trying to stop \"ex-gay\" people from enjoying the full rights and benefits of citizenship. There is no organized movement telling lies about them (the cesspools of disease bit) like there is against gay people.", 
   {}, 
   114700, 
   null, 
   1114980780.0
  ], 
  [
   115112, 
   null, 
   "melsucceeds", 
   "Um, I really hate to tell you but distinguishing an ethnic group is completely different than being able to distinguish a gay person from all the straights. What you are discribing is more commonly called \"gay-dar.\" \n For a straight person to have this portion activated, in the hypothetical, one would need to be exposed to gays on a larger scale than the usual straight person. \n So, I will pose this to you, how is it you have this ability? \n \n Facial appearance just doesn't cut it darlin. Gays don't have hooked noses or recessed eyes or bigger hands than straights. They come in all colors, sizes, shapes and walks of life. They/ we, are you teachers, firefighters, soldiers, grocery store clerks, doctors, nurses, lawyers, administrative assistants, financial planners, cameramen (gender inspecific), police, office managers, records keepers...etc.\n There's no specific \"gay job\" or \"lesbian career\" path, there are no hight or weight requirements, fashion styles, pet ownership restrictions, cars, houses, apartments, or music styles. \n We are EVERYWHERE.\n We are EVERYONE.\n We are you brothers, sisters, Aunts, Uncles, mothers, fathers, cousins, grandparents, sons and daughters. \n \n Just as no one can tell what kind of ice cream a person likes just by looking at them, nor can someone tell if a person is gay or straight. At least not unless they are wearing a sign or a specific slogan. \n Heck even some drag queens are straight. (Although not many, but there are a few)\n \n Sure, it's probably a whole lot easier to distinguish a gay person from a straight person by the company he/she keeps or the places they may visit, or even the neighborhoods they live in. But on your typical day, on a busy downtown sidewalk, in the middle of the week, I seriously doubt anyone could pick ME out in the crowd. \n Let alone at the grocery store or doctor's office.\n\n \n \n I live a half hour away from NYC. You know I encounter all different types of people. I'm not the only gay person who can distingush SOME gay folks. My friend also can distinguish some gay folks. A straight person once told me that he knew I was gay and he was not judging me by how I dress. Now, Justine, I usually agree with all your comments, but from my experiences, I believe that some folks really can tell if a person is gay, without a gay person ever informing an individual. This might be a silly comment, but some people look more gay than others. As a student in junior high, my friend was attacked by homophobes who assumed he was gay and he dressed just like the rest of the boys. Although, he really is gay.", 
   {
    "post_info": {
     "post_title": "True"
    }
   }, 
   114745, 
   null, 
   1115008680.0
  ], 
  [
   115115, 
   null, 
   "joebrummer", 
   "I live a half hour away from NYC. You know I encounter all different types of people. I'm not the only gay person who can distingush SOME gay folks. My friend also can distinguish some gay folks. A straight person once told me that he knew I was gay and he was not judging me by how I dress. Now, Justine, I usually agree with all your comments, but from my experiences, I believe that some folks really can tell if a person is gay, without a gay person ever informing an individual. This might be a silly comment, but some people look more gay than others. As a student in junior high, my friend was attacked by homophobes who assumed he was gay and he dressed just like the rest of the boys. Although, he really is gay.\n\n \n \n So does this beg a new thread on Gyadar!", 
   {}, 
   115112, 
   null, 
   1115009280.0
  ], 
  [
   115285, 
   null, 
   "tonybrown74", 
   "Hey, it's not my fault you seem so totally threatened by people like Paulk--one would think your movement hinged on the issue the way some of you attack these guys and put so much time and effort into trying to discredit them. Your's is a clasic case of hysteria over something that is only a big deal to you if you let it be. \n\n \n I don't feel threatened. What ticks me off is that these people are given a high profile to state that all gay people SHOULD change, because a person like him supposedly did. He talks about his life being such a mess and then wants to blame it on his being gay when the truth is he is just a big mess. Him going into Mr. P's just confirms that he's a mess.\n \n \n \nThat's funny, because that very beehive analogy has been used here to describe you all more times than anyone else. Call me old fashioned, but I guess I'm still of the mindset that when something is called a \"forum,\" it actually does mean that there could be more than one opinion expresed there, not just the one sympathetic to \"gay rights.\" It's been pointed out to several of you more than once that it is in fact you who are doing the provoking, especially when you can't stand to let a disagreeable post go by without getting in some attack on the messenger--a knee-jerk reaction to gett that 'last word' in, or giving some accusation of '\"being obessed\" or \"being on here from morning till night (when it's amounted to a whopping 20-30 minutes of posting time at most a day!!! [GASP]). The gig is up--you don't get a pass to chain yank here all you want just because you side with the gay rights position. It's not an excuse for you to beat that beehive. It's so transparent.\n \n If you don't like reading disagreement, or more aptly, can't handle it, one can't help but wonder why you would want to be in a forum in the first place.\n\n \n \n No one is arguing about you disagreeing with us. But you specifically have complained about us just talking so much about gay marriage ... on a thread specific to gay marriage ... started by YOU!\n \n How foolish did you think you looked? emoticon_rolleyes", 
   {}, 
   114510, 
   null, 
   1115054700.0
  ], 
  [
   116467, 
   null, 
   "wsm2506", 
   "Harvard U. Investigating Alleged Gay Beating.\n \n http://www.thebostonchannel.com/news/4442390/detail.html?subid=22100410&qs=1;bp=t", 
   {}, 
   115285, 
   null, 
   1115222460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Violence Against Gays On The Rise", 
  "url": "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 4957, 
  "discussion_files": [
   [
    "19092.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-print.html"
   ], 
   [
    "19093.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-15-print.html"
   ], 
   [
    "19094.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-13-print.html"
   ], 
   [
    "19095.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-12-print.html"
   ], 
   [
    "19096.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-10-print.html"
   ], 
   [
    "19097.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-8-print.html"
   ], 
   [
    "19098.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-6-print.html"
   ], 
   [
    "19099.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-4-print.html"
   ], 
   [
    "19100.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-7-print.html"
   ], 
   [
    "19101.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-9-print.html"
   ], 
   [
    "19102.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-5-print.html"
   ], 
   [
    "19103.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-14-print.html"
   ], 
   [
    "19104.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-11-print.html"
   ], 
   [
    "19105.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-3-print.html"
   ], 
   [
    "19106.html", 
    "http://www.4forums.com/political/gay-rights-debates/4957-violence-against-gays-rise-2-print.html"
   ]
  ], 
  "identifier": 4957
 }
]