[
 [
  [
   114028, 
   null, 
   "billsco", 
   "It has been asserted in this forum that a working definition of 'Christian' is one who follows the teachings of Jesus. I want to examine that claim closely in this thread. It is my contention that nearly no one follows his teachings and, as a whole, the morals and ethics attributed to him (as recorded in the Bible) are impractical and unworkable at best; immoral and unethical at worst. In this examination I will look at his words as preserved in the four gospels, along with his works and actions. \n \n We should assume in order to avoid foreseeable derailments that:\n \n 1.) Jesus was an actual historical character, and\n \n 2.) His words and deeds were faithfully preserved and recorded. \n \n I am willing to admit here at the outset that there are some instances of benevolence and charity in Jesus' teachings, but can we agree that there are probably timeless, sound precepts in a work such as Mein Kampf also? I think the question should be, why a half-God wasn't more beneficent, why not one original thought was ever expressed by him, and why serious societal issues weren't addressed. This should be the bare minimum of someone we look upon as an ethical teacher. \n \n With that said, and in no particular order, let's begin, piecemeal, with the Sermon on the Mount, considered his masterpiece:\n \n He begins with the Beatitudes (Blessed are the...). Is this not an endorsement of behavior? After reading it, is one not expected to strive to become whatever it is that was singled out to receive the blessing? For instance: Blessed are the meek. Should you work to become meek? Do you look for a doctor who practices meekness? Are you a practicing Christian when you seek out a meek airline pilot? Exactly how is meekness a good quality, and how does it make you a better, ethical person? Meekness is weakness, IMO. \n \n Enough said for now.", 
   {
    "post_info": {
     "post_title": "The Ethics of Jesus"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1114789320.0
  ], 
  [
   114035, 
   null, 
   "Alan Ryan", 
   "\n He begins with the Beatitudes (Blessed are the...). Is this not an endorsement of behavior? After reading it, is one not expected to strive to become whatever it is that was singled out to receive the blessing? For instance: Blessed are the meek. Should you work to become meek? Do you look for a doctor who practices meekness? Are you a practicing Christian when you seek out a meek airline pilot? Exactly how is meekness a good quality, and how does it make you a better, ethical person? Meekness is weakness, IMO. \n \n Enough said for now.\n\n \n The beatitude you choose to begin with says, Blessed are the meek, for they shall inherit the earth: isn't this consistent with Christ's philosophy of non-violence ? (Turning the other cheek etc. ?)\n \n Meekness is supposed to be a virtue because it means gentleness of temper - a meek person being someone who is willing to suffer violence, but not to offer it in return.", 
   {
    "unicode_changes_made": true
   }, 
   114028, 
   null, 
   1114789860.0
  ], 
  [
   114036, 
   null, 
   "trebor", 
   "The beatitude you choose to begin with says, Blessed are the meek, for they shall inherit the earth: isn't this consistent with Christ's philosophy of non-violence ? (Turning the other cheek etc. ?)\n \n Meekness is supposed to be a virtue because it means gentleness of temper - a meek person being someone who is willing to suffer violence, but not to offer it in return.\n\n \n And how does that contrast with the statement 'I come not for peace, but with a sword?'?", 
   {}, 
   114035, 
   null, 
   1114789920.0
  ], 
  [
   114039, 
   null, 
   "Jo Bennett", 
   "As far as my understanding goes \"I came not to bring peace, but a sword\", is a reference to the effect of Jesus on the life of a believer, reminding us that believing and trying to live as we should is not easy. It is also prophetic of the disruption to quiet lives that Jesus would bring, a nod to the future martyring of many of the apostles.", 
   {}, 
   114036, 
   null, 
   1114790280.0
  ], 
  [
   114041, 
   null, 
   "Alan Ryan", 
   "And how does that contrast with the statement 'I come not for peace, but with a sword?'?\n\n He said also: He that lives by the sword, shall die by the sword.\n \n It's not going to be profitable to simply exchange quotations from the gospels in this discussion.", 
   {}, 
   114036, 
   null, 
   1114790520.0
  ], 
  [
   114057, 
   null, 
   "trebor", 
   "As far as my understanding goes \"I came not to bring peace, but a sword\", is a reference to the effect of Jesus on the life of a believer, reminding us that believing and trying to live as we should is not easy. It is also prophetic of the disruption to quiet lives that Jesus would bring, a nod to the future martyring of many of the apostles.\n\n \n Ah yes, the 'it doesn't match my exact understanding of what the message should be, therefore it is an allegory'.", 
   {}, 
   114039, 
   null, 
   1114792740.0
  ], 
  [
   114065, 
   null, 
   "billsco", 
   "The beatitude you choose to begin with says, Blessed are the meek, for they shall inherit the earth: isn't this consistent with Christ's philosophy of non-violence ? (Turning the other cheek etc. ?)\n \n Meekness is supposed to be a virtue because it means gentleness of temper - a meek person being someone who is willing to suffer violence, but not to offer it in return.\n\n \n Well, let's look at your interpretation, at which angle I admit I didn't consider. If meekness means turning the other cheek, is this something we can subscribe to? Do we become better people by being meek? Is it workable? Did you teach your son to offer his other cheek when the school bully hit him?\n \n I think the philosophy of self-defense is much more practical. I would nod in agreement with a speaker who said, \"Blessed are the people who defend the meek among us.\"\n \n Jesus said later in the Sermon to \"resist not evil\". Edmund Burke said, \"The only thing needed for evil to triumph is for good men to do nothing.\" I believe Burke is correct, Jesus is wrong.", 
   {}, 
   114035, 
   null, 
   1114793880.0
  ], 
  [
   114097, 
   null, 
   "sinjin", 
   "It has been asserted in this forum that a working definition of 'Christian' is one who follows the teachings of Jesus. I want to examine that claim closely in this thread. It is my contention that nearly no one follows his teachings and, as a whole, the morals and ethics attributed to him (as recorded in the Bible) are impractical and unworkable at best; immoral and unethical at worst. In this examination I will look at his words as preserved in the four gospels, along with his works and actions. \n \n We should assume in order to avoid foreseeable derailments that:\n \n 1.) Jesus was an actual historical character, and\n \n 2.) His words and deeds were faithfully preserved and recorded. \n \n I am willing to admit here at the outset that there are some instances of benevolence and charity in Jesus' teachings, but can we agree that there are probably timeless, sound precepts in a work such as Mein Kampf also? I think the question should be, why a half-God wasn't more beneficent, why not one original thought was ever expressed by him, and why serious societal issues weren't addressed. This should be the bare minimum of someone we look upon as an ethical teacher. \n \n With that said, and in no particular order, let's begin, piecemeal, with the Sermon on the Mount, considered his masterpiece:\n \n He begins with the Beatitudes (Blessed are the...). Is this not an endorsement of behavior? After reading it, is one not expected to strive to become whatever it is that was singled out to receive the blessing? For instance: Blessed are the meek. Should you work to become meek? Do you look for a doctor who practices meekness? Are you a practicing Christian when you seek out a meek airline pilot? Exactly how is meekness a good quality, and how does it make you a better, ethical person? Meekness is weakness, IMO. \n \n Enough said for now.\n\n I do not equate meekness with weakness. \n Buddhists monks commonly practice an outward humility that could be characterized as \"meekness\" and yet many are accomplished martial artists and hardly weak. A wise man walks with his head bowed sort of thing. Ever met a humble a-hole?", 
   {
    "unicode_changes_made": true
   }, 
   114028, 
   null, 
   1114797480.0
  ], 
  [
   114112, 
   null, 
   "unkerpaulie", 
   "jesus summarizes all his teachings in 2 verses: love God with all your heart, mind and being; love your neighboor as yourself.\n \n if you take any one phrase or sentence from the gospel out of its context and focus only on that, then a misunderstanding of it is not surprising.", 
   {}, 
   114097, 
   null, 
   1114798200.0
  ], 
  [
   114116, 
   null, 
   "Alan Ryan", 
   "Well, let's look at your interpretation, at which angle I admit I didn't consider. If meekness means turning the other cheek, is this something we can subscribe to? Do we become better people by being meek? Is it workable? Did you teach your son to offer his other cheek when the school bully hit him?\n \n I think the philosophy of self-defense is much more practical. I would nod in agreement with a speaker who said, \"Blessed are the people who defend the meek among us.\"\n \n Jesus said later in the Sermon to \"resist not evil\". Edmund Burke said, \"The only thing needed for evil to triumph is for good men to do nothing.\" I believe Burke is correct, Jesus is wrong.\n\n \n I agree with your sentiments: I also believe in self-defense. As a matter of fact, I've never turned the other cheek. But our personal evaluations of \"meekness\" are contrary to the ethical principles of Jesus - as I understand them. He proclaimed a message of peace and love (of thy neighbor) which is totally impractical outside the hermetic society that he refers to as \"the kingdom of God\".", 
   {}, 
   114065, 
   null, 
   1114798440.0
  ], 
  [
   114123, 
   null, 
   "billsco", 
   "I do not equate meekness with weakness. \n Buddhists monks commonly practice an outward humility that could be characterized as \"meekness\" and yet many are accomplished martial artists and hardly weak. A wise man walks with his head bowed sort of thing. Ever met a humble a-hole?\n\n \n Are humility and meekness synonymous? I see them as two different things. I believe a humble man is good, a meek one is not. I might have to consult a dictionary.", 
   {}, 
   114097, 
   null, 
   1114799280.0
  ], 
  [
   114125, 
   null, 
   "billsco", 
   "jesus summarizes all his teachings in 2 verses: love God with all your heart, mind and being; love your neighboor as yourself.\n \n if you take any one phrase or sentence from the gospel out of its context and focus only on that, then a misunderstanding of it is not surprising.\n\n \n Unkerpaulie, you just did what you're accusing me of. What's with that?", 
   {}, 
   114112, 
   null, 
   1114799340.0
  ], 
  [
   114133, 
   null, 
   "billsco", 
   " He proclaimed a message of peace and love (of thy neighbor) which is totally impractical outside the hermetic society that he refers to as \"the kingdom of God\".\n\n \n We might be getting to the nub of this a lot quicker than I imagined. Are his teachings to be understood only in a heavenly context? Or only with other Jews? What do you mean by \"hermetic\"?", 
   {}, 
   114116, 
   null, 
   1114799940.0
  ], 
  [
   114169, 
   null, 
   "Alan Ryan", 
   "We might be getting to the nub of this a lot quicker than I imagined. Are his teachings to be understood only in a heavenly context? Or only with other Jews? What do you mean by \"hermetic\"?\n \n \n Many of Christ's teachings are so utterly contrary to human impulses that it's difficult to imagine a \"real\" world in which they could all be applied.\n \n Another instance - \"If someone should steal your tunic, give him your cloak also\". \n \n We could go on multiplying such instances - which is why I referred to a society in which they were adopted as \"hermetic\" - meaning a society completely closed and impervious to the slings and arrows of reality. \n \n Yes: I believe it boils down to a heavenly context - perhaps the \"heaven on earth\" that only saints inhabit. Christians, of course, vehemently deny that it's impossible to follow the way, the truth, and the life on this earth.", 
   {}, 
   114133, 
   null, 
   1114801800.0
  ], 
  [
   114186, 
   null, 
   "Jo Bennett", 
   "Ah yes, the 'it doesn't match my exact understanding of what the message should be, therefore it is an allegory'.\n\n \n That's a fair accusation, but I wonder, where is this sword that Jesus brought? Is there any record of anyone having seen it? In the absense of this I think it is fair to say it is a metaphorical sword. That leaves the question of a metaphor for what? I've given my thoughts, based on my beliefs. If you have a different interpretation, I'm all ears.", 
   {}, 
   114057, 
   null, 
   1114802700.0
  ], 
  [
   114192, 
   null, 
   "billsco", 
   "Many of Christ's teachings are so utterly contrary to human impulses that it's difficult to imagine a \"real\" world in which they could all be applied.\n \n Another instance - \"If someone should steal your tunic, give him your cloak also\". \n\n \n Yet the claim is still made, \"I'm a Christian because I follow his teachings.\" The above tunic example has never been practiced, at least not that I'm aware of. If someone slipped and fell on your property and claimed they were going to sue you, yet you gave them your car so they could visit their lawyer, I'd like to hear from you.", 
   {}, 
   114169, 
   null, 
   1114803060.0
  ], 
  [
   114198, 
   null, 
   "billsco", 
   "Blessed are the poor in spirit...for theirs is the kingdom of heaven.\n \n I can't help but pity all the countless people through the ages who heard or read that and felt justified to remain in squalor and poverty. I don't pretend to know what poor \"in spirit\" means, and neither did they. All they heard, I'm quite confident, is \"blessed are the poor\", and thus justified their hand-to-mouth existence, living in rat-infested hovels, all the while thinking this condition will reward them and their children and their children's children with great riches later. \n \n Poverty is not a virtue and should not be taught by people claiming to be ethical. Money is not the root of evil, it is the root of freedom. If riches are good in heaven, riches must be good here.\n \n I reject this teaching completely.", 
   {
    "unicode_changes_made": true
   }, 
   114192, 
   null, 
   1114803300.0
  ], 
  [
   114206, 
   null, 
   "trebor", 
   "That's a fair accusation, but I wonder, where is this sword that Jesus brought? Is there any record of anyone having seen it? In the absense of this I think it is fair to say it is a metaphorical sword. That leaves the question of a metaphor for what? I've given my thoughts, based on my beliefs. If you have a different interpretation, I'm all ears.\n\n \n \n Well, the different gospel writers had different concepts. I would say that if the \n concept of Jesus being the Jewish messiah was being followed, then, it would be quite a literal sword. The JEWISH expectation of the messiah at that time was a military person (Not god), who would be able to drive out the foreign invaders (i.e. Rome), reestablish a proper kingdom (i.e... a messiah is an annointed one), and bring the Torah and peace to the world. The main part is getting Rome out of Israel. In that context, someone who has some 'with a sword' is quite correct. \n \n The different writers of the differnt gospels had different adjendas, so they emphasised what they thought the message would be differently.", 
   {}, 
   114186, 
   null, 
   1114803600.0
  ], 
  [
   114229, 
   null, 
   "Alan Ryan", 
   "Blessed are the poor in spirit...for theirs is the kingdom of heaven.\n \n I reject this teaching completely.\n \n \n This beatitude is the classic justification for keeping the rich man in his castle and the poor man at his gate.\n \n Vows of poverty (taken by certain monks) were supposed to demonstrate contempt for the material benefits of this world which get in the way of achieving \"holiness\", and weaken confidence in the life to come. In the \"next life\" the poor who endured their earthly misery and better still, \"offered it up for God's glory\" would receive their eternal reward.", 
   {
    "unicode_changes_made": true
   }, 
   114198, 
   null, 
   1114805160.0
  ], 
  [
   114230, 
   null, 
   "sinjin", 
   "Are humility and meekness synonymous? I see them as two different things. I believe a humble man is good, a meek one is not. I might have to consult a dictionary.\n\n FWIW\n \n meek -\n \n 1. Showing patience and humility; gentle.\n \n 2. Easily imposed on; submissive.\n \n from Dictionary.com", 
   {}, 
   114123, 
   null, 
   1114805160.0
  ], 
  [
   114241, 
   null, 
   "Ray Martinez", 
   "It has been asserted in this forum that a working definition of 'Christian' is one who follows the teachings of Jesus.\n\n \n \"Christian\" should never be used as an adjective. \n \n Jesus only INTENDED His teachings about faith to be the only teaching to follow.\n \n \nI want to examine that claim closely in this thread. It is my contention that nearly no one follows his teachings\n\n \n True, if you are talking about His moral teachings. They were intended for an intelligent person to conclude that they cannot possibly attain in order that they might see their need for the only other option called the gospel/way of faith.\n \n \nand, as a whole, the morals and ethics attributed to him (as recorded in the Bible) are impractical and unworkable at best\n\n \n You got the message.\n \n They are unworkable. ONLY Jesus did them as the Law Incarnate, then God crucified Him thus ending the unworkable demands of O.T. Law and its final expression in substance called Jesus of Nazareth.\n \n Romans 10:4\n \n For Christ is the end of the law for righteousness to every one that believeth.\n \n In the Greek, \"believeth\" means \"faith which has no doubts or fear\".\n \n \nimmoral and unethical at worst.\n\n \n The ethics and morals and laws that Christ taught are not immoral or unethical. They represent a righteous standard of perfection. Unattainability should not be confused with the rightness of the principle or code.\n \n The purpose of the Law is to convict of sin and hopefully drive a person to the only other option God allows to relate to Him called the gospel.\n \n \nIn this examination I will look at his words as preserved in the four gospels, along with his works and actions. \n \n We should assume in order to avoid foreseeable derailments that:\n \n 1.) Jesus was an actual historical character, and\n \n 2.) His words and deeds were faithfully preserved and recorded. \n\n \n Agreed.\n \n \nwhy not one original thought was ever expressed by him, and why serious societal issues weren't addressed. This should be the bare minimum of someone we look upon as an ethical teacher. \n\n \n Who said Jesus was a good and wise teacher ?\n \n What is your source ?\n \n He cannot be both good and wise UNLESS He was Divine.\n \n Original thoughts ?\n \n Such as .......?\n \n I will wait for your response before I refute you. \n \n \nWith that said, and in no particular order, let's begin, piecemeal, with the Sermon on the Mount, considered his masterpiece:\n \n He begins with the Beatitudes (Blessed are the...). Is this not an endorsement of behavior? After reading it, is one not expected to strive to become whatever it is that was singled out to receive the blessing? For instance: Blessed are the meek. Should you work to become meek? Do you look for a doctor who practices meekness? Are you a practicing Christian when you seek out a meek airline pilot? Exactly how is meekness a good quality, and how does it make you a better, ethical person? Meekness is weakness, IMO.\n\n \n Meekness is not weakness. Only if stupid people mistake meekness for weakness.\n \n Jesus took a whip and cleared the Temple of the moneychangers because He was man enough to do so when He could of used His powers.\n \n \"Meekness\" is derived from horse training terminology. A person is meek in this context when they are \"controlled and trained by God\" as Moses was.\n \n Sermon of the Mount = impossible code of conduct intended to make one conclude that he cannot live up to its precepts, which leaves the only other option of the gospel/way of faith which is the context for the Sermon of the Mount.\n \n Only Jesus could fill the shoes of the Sermon of the Mount - the Law Incarnate. He taught the Sermon to show us that only God can be righteous -close doesn't count.\n \n The Sermon of the Mount was intended to make us see our need for the gospel/way of faith.\n \n Ray M.", 
   {
    "unicode_changes_made": true
   }, 
   114028, 
   null, 
   1114805760.0
  ], 
  [
   114252, 
   null, 
   "Jo Bennett", 
   "Ray, are you suggesting we shouldn't try to follow Christ's teachings?", 
   {}, 
   114241, 
   null, 
   1114806240.0
  ], 
  [
   114257, 
   null, 
   "Ray Martinez", 
   "Ray, are you suggesting we shouldn't try to follow Christ's teachings?\n\n \n Only the \"have faith\" teachings.\n \n The remainder is good and go ahead BUT DON'T THINK THE IMITATION OF MAKES YOU RIGHTEOUS.\n \n Jesus layed out TWO options:\n \n 1) Sermon of the Mount OR...\n \n 2) Gospel: good news of that God will accept faith (whatever that is) IN PLACE of the works of the Law/Sermon on the Mount.\n \n Number 2 is the only way to relate to God/Christ. People get saved by faith then make the terrible mistake of thinking that conforming to Law is NOW the object of their energy.\n \n Galatians says redundantly, that we continue (by faith) the same way we start (by faith).\n \n \n \n Ray M.", 
   {}, 
   114252, 
   null, 
   1114806840.0
  ], 
  [
   114265, 
   null, 
   "Jo Bennett", 
   "But surely a feature of our redemption is to act as Jesus taught us? I don't see anywhere in the New Testament that tells us to ignore Jesus' commands just because they are not the method of our salvation. Jesus taught us the right way to live. We are saved by the grace of God, but that does not mean we shouldn't aim to do as Jesus told us to do.", 
   {}, 
   114257, 
   null, 
   1114807740.0
  ], 
  [
   114272, 
   null, 
   "trebor", 
   "But surely a feature of our redemption is to act as Jesus taught us? I don't see anywhere in the New Testament that tells us to ignore Jesus' commands just because they are not the method of our salvation. Jesus taught us the right way to live. We are saved by the grace of God, but that does not mean we shouldn't aim to do as Jesus told us to do.\n\n \n If you can get a coherent answer out of him, I would say you would be a saint.", 
   {}, 
   114265, 
   null, 
   1114808340.0
  ], 
  [
   114273, 
   null, 
   "unkerpaulie", 
   "Unkerpaulie, you just did what you're accusing me of. What's with that?\n\n the accusation wasnt targeting you", 
   {}, 
   114125, 
   null, 
   1114808340.0
  ], 
  [
   114277, 
   null, 
   "Alan Ryan", 
   "Prediction: This thread will soon be annexed by testimony mongers.", 
   {}, 
   114273, 
   null, 
   1114808880.0
  ], 
  [
   114281, 
   null, 
   "Ray Martinez", 
   "But surely a feature of our redemption is to act as Jesus taught us?\n\n \n ONLY if the indwelt Spirit is doing it in us miraculously in response to our faith.\n \n \nI don't see anywhere in the New Testament that tells us to ignore Jesus' commands just because they are not the method of our salvation.\n\n \n Fine.\n \n But when you do them do not make the grave error in thinking that it preserves or maintains your standing with God. The preceding the Bible calls \"works\" and the Scriptures are clear: works do not save.\n \n \nJesus taught us the right way to live. We are saved by the grace of God, but that does not mean we shouldn't aim to do as Jesus told us to do.\n\n \n Imitating Jesus is heresy.\n \n What is the NEW Testament ?\n \n Well it sure aint the OLD (works) with a new suit and hair-do.\n \n The New Testament is the gospel/way of faith.\n \n We are supposed to seize the reality of Christ by faith and wait in this expectation for Him to change us.\n \n Christianity is about a NEW born-again nature that frees us from wanting to sin less because of the Spirit in us.\n \n The Spirit only comes and stays when we are acting in faith upon a promise of God to change us.\n \n Ray M.", 
   {}, 
   114265, 
   null, 
   1114809180.0
  ], 
  [
   114292, 
   null, 
   "billsco", 
   "FWIW\n \n meek -\n \n 1. Showing patience and humility; gentle.\n \n 2. Easily imposed on; submissive.\n \n from Dictionary.com\n\n \n Meek has different meaning in my Webster's: \n \n Humbly submissive, too mild, lacking spirit.\n \n I don't know anybody quite like that. I don't think I would want to.", 
   {}, 
   114230, 
   null, 
   1114811160.0
  ], 
  [
   115227, 
   null, 
   "billsco", 
   "\n Jesus only INTENDED His teachings about faith to be the only teaching to follow.\n \n\n \n Really all I have to say about this is perhaps it explains a lot of Christian behavior through the centuries. Freed from moral constraints, filled with the spirit, it became onward Christian soldiers.", 
   {}, 
   114241, 
   null, 
   1115046720.0
  ], 
  [
   115242, 
   null, 
   "Big Orn", 
   "Blessed are the poor in spirit...for theirs is the kingdom of heaven.\n \n I can't help but pity all the countless people through the ages who heard or read that and felt justified to remain in squalor and poverty. I don't pretend to know what poor \"in spirit\" means, and neither did they. All they heard, I'm quite confident, is \"blessed are the poor\", and thus justified their hand-to-mouth existence, living in rat-infested hovels, all the while thinking this condition will reward them and their children and their children's children with great riches later. \n \n Poverty is not a virtue and should not be taught by people claiming to be ethical. Money is not the root of evil, it is the root of freedom. If riches are good in heaven, riches must be good here.\n \n I reject this teaching completely.\n\n How's this: Those that constantly hunger for the Spirit of God are blessed because they will, no doubt, enter into the Kingdom of Heaven.\n \n Those that rightly divide the scriptures, which requires much study and constant prayer, can see that they all relate to each other in the same way.\n \n God is saying the same thing here as He did in the Old Testament - \"Seek my Face and you will find Me...\" All the rest comes after a person has found Him - i.e. - their poorness in spirit or their ability to see that their spirit is weak, but His is strong, has enabled them to become strong also through Him.", 
   {
    "unicode_changes_made": true
   }, 
   114198, 
   null, 
   1115050080.0
  ], 
  [
   115250, 
   null, 
   "billsco", 
   "Not a bad interpretation Big O, as far as interpretations go. But the immediate questions are what about the rich in spirit? No special blessings there? Perhaps God can't stand too-spiritual people either? \n \n And why do we need someone to interpret? A good moral teacher should be clear and precise. If he wishes to reward a wavering individual with a special blessing, he ought to find the words to express it, and the reasoning behind it.", 
   {}, 
   115242, 
   null, 
   1115051160.0
  ], 
  [
   115255, 
   null, 
   "jazyjason", 
   "Those who attempt to walk with God do not do so for blessings or incintives. They do it because thay see they cannot live without Christ so they try to follow His teachings as best they can. I do the same thing. The rich in spirit already know of the grace's of our Lord. Yet they still hunger and thirst for righteousness. Also they spread The Truth because of the inner dwelling of the Holy Spirit. I admit that I was never a devout Christian. I was always straying and was very weak in faith. After seeing the Passion God opened my eyes and instilled upon me a courage I cannot explain. Soon I was preaching the word and others were either amased at my change, or resented me for my faith. I sought no acalaides by God,I had no need to. For I am STILL a sinner and have sinned and will continue to sin. This is human nature, of our own choice. But I still know that Jesus continues to forgive me, and even when Im low and ashamed, He still loves me without question.", 
   {}, 
   115250, 
   null, 
   1115051580.0
  ], 
  [
   115260, 
   null, 
   "Big Orn", 
   "Not a bad interpretation Big O, as far as interpretations go. But the immediate questions are what about the rich in spirit? No special blessings there? Perhaps God can't stand too-spiritual people either? \n \n And why do we need someone to interpret? A good moral teacher should be clear and precise. If he wishes to reward a wavering individual with a special blessing, he ought to find the words to express it, and the reasoning behind it.\n\n I think the problem is (and was) with the original translation. I know folks ears get clogged with all the Christian Apologetics, but I honestly believe that's the problem here. It's not actually the translation via wording, but the numbers of words we need in order to say the same thing...know what I mean?", 
   {}, 
   115250, 
   null, 
   1115051700.0
  ], 
  [
   115262, 
   null, 
   "jazyjason", 
   "I seem a little misunderstood. Please clarify. lol", 
   {}, 
   115260, 
   null, 
   1115051940.0
  ], 
  [
   115300, 
   null, 
   "Alan Ryan", 
   "A problem with any discussion of the ethics attributed to Jesus Christ is that he did not justify or systematize them in a treatise (like say Aristotle did - at least in the form of lecture notes). So we are left with inferences from what he is supposed to have said, written down some years after his death. This is not a completely satisfactory basis on which to get to the heart of the matter - i.e. to the core of the \"thought\" of anyone. So we inevitably wind up with interpretations of the sayings of Jesus as they are recorded in the New Testament.\n \n At best, we can make generalisations such as \"Jesus had a philosophy of non-violence\" or \"Jesus believed in social justice\", etc. I don't think we can be sure how a particular question of moral philosophy might have been answered by Jesus himself: we don't have enough explicit information on his ethical principles to guide us.", 
   {}, 
   115262, 
   null, 
   1115056860.0
  ], 
  [
   115349, 
   null, 
   "billsco", 
   "A problem with any discussion of the ethics attributed to Jesus Christ is that he did not justify or systematize them in a treatise (like say Aristotle did - at least in the form of lecture notes). So we are left with inferences from what he is supposed to have said, written down some years after his death. This is not a completely satisfactory basis on which to get to the heart of the matter - i.e. to the core of the \"thought\" of anyone. So we inevitably wind up with interpretations of the sayings of Jesus as they are recorded in the New Testament.\n \n At best, we can make generalisations such as \"Jesus had a philosophy of non-violence\" or \"Jesus believed in social justice\", etc. I don't think we can be sure how a particular question of moral philosophy might have been answered by Jesus himself: we don't have enough explicit information on his ethical principles to guide us.\n\n \n \n Quite true. There is no framework in which one can logically follow his teachings. Instead we are left with a pastiche of disparate ideas, sometimes even contradictory.\n \n It makes me wonder: if it could be determined from examining his teachings closer that they are at times amoral and even worse, immoral, would people still be willing to call themselves Christian?", 
   {}, 
   115300, 
   null, 
   1115061480.0
  ], 
  [
   115362, 
   null, 
   "Alan Ryan", 
   "Quite true. There is no framework in which one can logically follow his teachings. Instead we are left with a pastiche of disparate ideas, sometimes even contradictory.\n \n It makes me wonder: if it could be determined from examining his teachings closer that they are at times amoral and even worse, immoral, would people still be willing to call themselves Christian?\n\n \n I think your point about the contradictions and disparate ideas in Jesus' teachings is an emphatic one: it directly leads to many sectarian differences and to the familiar phoney controversies in which one person quotes Jesus in support of a moral proposition and the next person finds another quotation from which an opposite inference can be drawn. Before you know it, the discussion is buried under citations, counter citations, \"testimony\", and tedium.", 
   {}, 
   115349, 
   null, 
   1115062800.0
  ], 
  [
   115462, 
   null, 
   "jazyjason", 
   "We can debate what Christ meant by His teachings all day. Parables were a form of speaking He was most attrributed to. If we truly wish to understand Christ we need to read the Bible and pray to God for wisdom and guidance.", 
   {}, 
   115362, 
   null, 
   1115069460.0
  ], 
  [
   116522, 
   null, 
   "billsco", 
   "After Jesus finishes with his Beatitudes, he throws out a real bombshell: He's not here to create a new direction in which our moral compass may point, he's not interested in adding any new understanding to our ethical dilemmas. Of the new social problems facing him and the myriad of new ones the future holds, he is as silent as a country graveyard after a snowfall. He tells us he's here to reinforce and uphold the old law as recorded in the Old Testament, right down to the last \"tittle\" (MT 5:17-20)\n \n A tittle can be understood as a mark over a particular letter, much like the letter 'i' in our language. Jesus' meaning is inescapable. If there is a better way to endorse something or to embrace it fully, I have not seen it. \n \n So he has no problem with various laws ascribing the death penalty for the most mundane offenses, such as collecting firewood to warm oneself on the Sabbath. Polygamy, as laid out in the OT, is fine with his ministry-every 't' has been crossed. Slavery is addressed quite fully and extensively in the OT and that \"peculiar institution\" is already well-regulated, according to Jesus. He can fully countenance every horrid injustice, every inhumane action against another human, right down to the last tittle. \n \n No longer are we merely arguing about which human characteristics are worthy of a blessing, as we were in the Beatitudes. We are talking about condoning some of the most vile behavior ever known to us in our sordid history.\n \n And yet, people want to be associated with this. They say, \"I am a Christian because I follow Christ's teachings.\" Someone please help me understand this.\n \n This has crossed the line into immorality.", 
   {
    "unicode_changes_made": true
   }, 
   115462, 
   null, 
   1115224380.0
  ], 
  [
   116643, 
   null, 
   "Big Orn", 
   "After Jesus finishes with his Beatitudes, he throws out a real bombshell: He's not here to create a new direction in which our moral compass may point, he's not interested in adding any new understanding to our ethical dilemmas. Of the new social problems facing him and the myriad of new ones the future holds, he is as silent as a country graveyard after a snowfall. He tells us he's here to reinforce and uphold the old law as recorded in the Old Testament, right down to the last \"tittle\" (MT 5:17-20)\n \n A tittle can be understood as a mark over a particular letter, much like the letter 'i' in our language. Jesus' meaning is inescapable. If there is a better way to endorse something or to embrace it fully, I have not seen it. \n \n So he has no problem with various laws ascribing the death penalty for the most mundane offenses, such as collecting firewood to warm oneself on the Sabbath. Polygamy, as laid out in the OT, is fine with his ministry-every 't' has been crossed. Slavery is addressed quite fully and extensively in the OT and that \"peculiar institution\" is already well-regulated, according to Jesus. He can fully countenance every horrid injustice, every inhumane action against another human, right down to the last tittle. \n \n No longer are we merely arguing about which human characteristics are worthy of a blessing, as we were in the Beatitudes. We are talking about condoning some of the most vile behavior ever known to us in our sordid history.\n \n And yet, people want to be associated with this. They say, \"I am a Christian because I follow Christ's teachings.\" Someone please help me understand this.\n \n This has crossed the line into immorality.\n\n The Law and the Prophets prophesied up until the time of John the Baptist. It was the Law that spoke of sin and was a means for atonement through blood. Christ came to fulfill that Law and make that atonement forever, not expelling the Law, but for believers, being the propitiation. When He spoke of the \"jot\" and \"tittle\" He as referring to the meaning and purpose of the Law never changing.\n A person is now, through Christ, justified by faith without the performance of the law due to the power of the Cross, which brought down sin to the point that sin no longer has dominion (or power) over us. Grace is now that which covers mankind, paid for with Christ's blood. \n The Law, which Christ fulfilled, is now spiritual - and those that believe and love one another also fulfill the law.\n \n The biggest mistake that we make by adhering to the Law of old is to remove Christ from the picture and paste in our own mugs. That mistake, by our own doing, places us under the curse of the Law. I wonder, sometimes, when religionists thump the Bible and preach of lust and murder, death and destruction, fire and brimstone, that they are actually circumventing the grace of God in order to have another audience for Scare Tactics? The law of the Old Testament was a reflection of the goodness of Christ, not a tool of fear - as so many deem it these days. And the Law of old is just as weak today as it was back them, but not because it was flawed, but because man was weak and could never adhere to it...and won't adhere to it today.", 
   {
    "unicode_changes_made": true
   }, 
   116522, 
   null, 
   1115230200.0
  ], 
  [
   118315, 
   null, 
   "billsco", 
   " Christ came to fulfill that Law and make that atonement forever, not expelling the Law, but for believers, being the propitiation.\n \n A person is now, through Christ, justified by faith without the performance of the law due to the power of the Cross, which brought down sin to the point that sin no longer has dominion (or power) over us. Grace is now that which covers mankind, paid for with Christ's blood. \n \n\n \n Let's examine grace.\n \n It probably can be called the cornerstone of the Christian faith, and springs from the resurrection of Christ, as you have commented on above. I have often heard that Jesus died for us all, but is that really true? In practice I would say most Christians do not believe so, only those who profess a belief in certain things, things which are neatly laid out for us in non-negotiable terms. Only they will receive any perceived benefit from the salvation scheme. One is theoretically able to sin with impunity, yet be assured of God's grace-the promise of immortality--simply because that particular belief is maintained.\n \n Meanwhile, a moral unbeliever finds no protection in this design. What Jesus did on the cross is beyond even the reach of the omnibenevolence of God. God's grace stops exactly where a honest man's questions begin. We are often told that God so loved the world, yet in Christian practice he has decreed that a man struggling to find truth no matter where it may be found is beyond contemptible, he is fit for eternal damnation. \n \n Grace is an odd concept. It makes us all worthless worms, ingrates, reprobates, and undeserving beggars. It is immoral in its composition, IMO.", 
   {
    "unicode_changes_made": true
   }, 
   116643, 
   null, 
   1115496840.0
  ], 
  [
   118329, 
   null, 
   "Jo Bennett", 
   "Most Christians may think that non-believers go to hell, but I believe that when the grace of God overcame sin, and death, it was for everyone. At death we come before God in our imperfection and are made perfect by his death and resurrection, and are raised to life eternal. Our prior beliefs will not withstand the truth, and hence we are all saved. This is a scarey concept for both believers and non-believers, because for believers it removes the assurance of divine punishment for those who tansgress, and for non-believers it removes the excuse that religion is a tool of social control, using the threat of damnation to keep people in line. I cannot support my belief directly with scripture, but the grace of Jesus as revealed in the gospels makes me think this is close to the truth. Even the Pauline scriptures lend some support \"faith, hope and love, and the greatest of these is love\". This suggests to me that the love of God overrides faith with truth, and supercedes hope with certainty, leaving only love, the greatest of the three.", 
   {}, 
   118315, 
   null, 
   1115498160.0
  ], 
  [
   118424, 
   null, 
   "zachvac", 
   "wow, a pleasent intelligent (except for a few posts up there) discussion with no name-calling and insults on the religion forum. Is this a record of some sort?", 
   {}, 
   118329, 
   null, 
   1115518500.0
  ], 
  [
   118496, 
   null, 
   "Hunter", 
   "Most Christians may think that non-believers go to hell, but I believe that when the grace of God overcame sin, and death, it was for everyone. At death we come before God in our imperfection and are made perfect by his death and resurrection, and are raised to life eternal. Our prior beliefs will not withstand the truth, and hence we are all saved. This is a scarey concept for both believers and non-believers, because for believers it removes the assurance of divine punishment for those who tansgress, and for non-believers it removes the excuse that religion is a tool of social control, using the threat of damnation to keep people in line. I cannot support my belief directly with scripture, but the grace of Jesus as revealed in the gospels makes me think this is close to the truth. Even the Pauline scriptures lend some support \"faith, hope and love, and the greatest of these is love\". This suggests to me that the love of God overrides faith with truth, and supercedes hope with certainty, leaving only love, the greatest of the three.\n\n \n There will be no Heaven for those who deny Jesus while they are alive on earth. My statement is scriptural. There is only one gate keeper and he has proclaimed that truth to the world. Jesus said, \" The Holy Spirit blows like the wind, and no man knows where it lands.\" Never apoligize for being a believer in Christ. Jesus is the way, the truth and the life and no man shall see the Father except by him.", 
   {}, 
   118329, 
   null, 
   1115531520.0
  ], 
  [
   118568, 
   null, 
   "Orion", 
   "There will be no Heaven for those who deny Jesus while they are alive on earth. My statement is scriptural.\n\n \n I humbly suggest to you that you broaden your scriptural perspective somewhat...\n \n So long as man remains free he strives for nothing so incessantly and so painfully as to find someone to worship. But man seeks to worship what is established beyond dispute, so that all men would agree at once to worship it. For these pitiful creatures are concerned not only to find what one or the other can worship but to find something that all would believe in and worship; what is essential is that all may be together in it. This craving for community of worship is the chief misery of every man individually and of all humanity from the beginning of time. For the sake of common worship they&#8217;ve slain each other with the sword. They have set up gods and challenged one another, &#8220;Put away your gods and come and worship ours, or we will kill you and your gods!&#8221; -- Dostoevsky, The Legend of the Grand Inquisitor\n \n or...\n \n As men approach me, so I receive them. All paths, Arjuna, lead to me. -- Hinduism, Bhagavad Gita, 4.11\n \n There are righteous men among the nations who have a share in the world to come. -- Judaism, Tosefta Sanhedrin 13.2\n \n Like the bee, gathering honey from different flowers, the wise man accepts the essence of different scriptures and sees only the good in all religions. -- Hinduism, Srimad Bhagavatam 11.3\n \n Truly thou art a God who hidest thyself. -- Isaiah 45.15\n \n And the divine fine-winged Garuda; They speak of Indra, Yama, Matrarisvan: the one being sages call by many names. -- Hinduism, Rig Veda 1.164.46\n \n Just as the sin-offering atones for Israel, so righteousness atones for the people of the world. -- Judaism, Talmud, Baba Batra 10b\n \n Truly I perceive that God shows no partiality, but in every nation any one who fears him and does what is right is acceptable to him. -- Christianity, Acts 10:34-35", 
   {}, 
   118496, 
   null, 
   1115537520.0
  ], 
  [
   118804, 
   null, 
   "billsco", 
   "Our prior beliefs will not withstand the truth, and hence we are all saved. This is a scarey concept for both believers and non-believers, because for believers it removes the assurance of divine punishment for those who tansgress, and for non-believers it removes the excuse that religion is a tool of social control, using the threat of damnation to keep people in line. \n\n \n This is a rather novel idea and a welcome one at that. I imagine it is yours personally and not that of the Church of England?\n \n But why is it still scary if we are all saved? Haven't you successfully stamped out all the fires of hell? Do you think believers draw comfort in believing eternal damnation awaits others?", 
   {}, 
   118329, 
   null, 
   1115582220.0
  ], 
  [
   118806, 
   null, 
   "billsco", 
   "wow, a pleasent intelligent (except for a few posts up there) discussion with no name-calling and insults on the religion forum. Is this a record of some sort?\n\n \n No, we'll be kicking butt and taking names here soon zachvac. :)", 
   {}, 
   118424, 
   null, 
   1115582400.0
  ], 
  [
   118812, 
   null, 
   "Jo Bennett", 
   "This is a rather novel idea and a welcome one at that. I imagine it is yours personally and not that of the Church of England?\n \n But why is it still scary if we are all saved? Haven't you successfully stamped out all the fires of hell? Do you think believers draw comfort in believing eternal damnation awaits others?\n\n \n Some do, I don't personally. It is my personal view, the Church of England probably hasn't decided. :p The church of England is very good at sitting on the fence.\n \n Everyone being saved is scary because of the personal responsibility placed on the individual not to sin. It is no longer a question of cost/benefit analysis, it has to be a conscious choice to do what is right.", 
   {}, 
   118804, 
   null, 
   1115582760.0
  ], 
  [
   119214, 
   null, 
   "billsco", 
   "Finishing up on the Sermon on the Mount, here are some other teachings I take exception to.\n \n Calling another person a fool can lead to being burned in hell. We turn a couple pages of scripture and find Jesus calling the Scribes and Pharisees \"fools\" (MT 23:17). Is it possible the same lips uttered that advice and ignored it at the greatest of peril? Do you personally agree with the punishment of that minor offense?\n \n Simply looking at another woman is committing adultery. Fair enough, though the word loses all practical meaning. But Jesus prescribes maiming oneself to avoid the problem. I know of no Christians who follow that advice. It goes without saying what horrid advice it is. \n \n (Parenthetically, the idea of a real, live, hot, fiery, eternal hell is fully developed for the first time by Jesus in this sermon. There is no mistaking his belief in such. That concept is beyond immoral. It is fiendishly barbaric.)\n \n Women can be divorced if they commit adultery. This is odd in that the OT prescribes stoning for the offense. Didn't Jesus just proclaim the tittle thing? Why is it so easy to spot the contradictions?\n \n One should not swear oaths. Here's a commandment a lot of Christians have adhered to, by Jove. Standing before the court awaiting to be sworn in, they righteously proclaim that it is against their belief to take an oath. Sit down and shut up.\n \n Love your enemies. Absurd. Unworkable. Impractical and inherently dangerous. I hate my enemies and that's that. Rather hypocritical too considering Jesus meant his message to be for Jews only, and gentiles were referred to as 'vipers'. And this hell that Jesus is so vociferously proclaiming, is it a place where love of his enemies is exercised?\n \n Take no thought for tomorrow. Is there worse advice than this? At least it's widely ignored. Luckily, when I ate my Cheerios this morning, some farmer had enough sense to think ahead and plant a crop of oats. This sermon should be retitled, \"How To Be Destitute.\"\n \n Do not judge. Again some self-righteous Christians single out this, ignoring all that preceded it, and loudly proclaim it is against their religion to judge. It occurs to me that God doesn't know much about his special creation and what it's like to live this life here on earth, how one makes countless judgments each and every day. He is also a master of vagary. \n \n Ask and it shall be given, seek and you shall find, knock and it shall be opened. I'm sorry that just is not true.\n \n And it came to pass when Jesus had finished these words, the crowd was astonished. Somehow, I can believe that. This is his masterpiece, the crowning achievement of his oral ministry. Allow me to pronounce it utter nonsense.", 
   {
    "unicode_changes_made": true
   }, 
   118812, 
   null, 
   1115659140.0
  ], 
  [
   119253, 
   null, 
   "Big Orn", 
   "Let's examine grace.\n \n It probably can be called the cornerstone of the Christian faith, and springs from the resurrection of Christ, as you have commented on above. I have often heard that Jesus died for us all, but is that really true? In practice I would say most Christians do not believe so, only those who profess a belief in certain things, things which are neatly laid out for us in non-negotiable terms. Only they will receive any perceived benefit from the salvation scheme. One is theoretically able to sin with impunity, yet be assured of God's grace-the promise of immortality--simply because that particular belief is maintained.\n\n I believe that grace is an imposable gift for all mankind despite their belief. In essence, its giving extends to the far reaches of earth, beyond common knowledge, and even into the realm of Evil where misguided souls languish in earthly bodies, unaware of God's existence. Grace, itself, cannot change a person, can't save a soul, nor can it even bring the Gospel to unyielding hearts. But, it is there when sin flourishes, when hatred controls feelings, when desires of the flesh rule supreme, willing and able to reveal God's mercy. When grace is realized no sin can flourish above it, and evil cannot comprehend it, nor remove it. I believe that a person can truly realize grace only when they have understood the slavery of sin. \n \nMeanwhile, a moral unbeliever finds no protection in this design. What Jesus did on the cross is beyond even the reach of the omnibenevolence of God. God's grace stops exactly where a honest man's questions begin. We are often told that God so loved the world, yet in Christian practice he has decreed that a man struggling to find truth no matter where it may be found is beyond contemptible, he is fit for eternal damnation.\n \n I don't think a human being can get beyond the reach of God's grace, no matter what the circumstances. As long as a person is living God will not withdraw His gift of grace. Grace, now, is like the air we breathe - it's there whether we acknowledge it or not. God's grace is given by Christ as a gift - and I'm not too sure many folks know that - but it cannot be revoked. No one can actually \"fall from grace\".\n \nGrace is an odd concept. It makes us all worthless worms, ingrates, reprobates, and undeserving beggars. It is immoral in its composition, IMO.\n\n Or, as it is written, grace is there for all of us worms, ingrates, reprobates, and undeserving beggars...and the faithful, the diligent, and the wise - all at the same time, for the same purpose: that we should live in love and truth and enjoy life to its fullest, utilizing the blessings of God to our advantage fulfilling the promise of Christ for an abundant life.", 
   {
    "unicode_changes_made": true
   }, 
   119214, 
   null, 
   1115662620.0
  ], 
  [
   120289, 
   null, 
   "Big Orn", 
   "Finishing up on the Sermon on the Mount, here are some other teachings I take exception to.\n \n Calling another person a fool can lead to being burned in hell. We turn a couple pages of scripture and find Jesus calling the Scribes and Pharisees \"fools\" (MT 23:17). Is it possible the same lips uttered that advice and ignored it at the greatest of peril? Do you personally agree with the punishment of that minor offense?\n\n There are fools in the world, billsco, you know that. As for the passage about burning in hell - Jesus was talking about unjustifiable hate for a brother. This goes back to the evil of the world, where evil is a contaminating spirit, one that takes the goodness of man and perverts all that he does...even to hating his own blood for no reason at all. This person, lead aimlessly by evil, will do nothing but evil even though his actions might lean toward good at times, and even if his actions affect no one but himself. In spite of everything, this person is a fool.\n \nSimply looking at another woman is committing adultery. Fair enough, though the word loses all practical meaning. But Jesus prescribes maiming oneself to avoid the problem. I know of no Christians who follow that advice. It goes without saying what horrid advice it is.\n\n I can't, off-hand, recall any scriptures where Jesus prescribed self-injury, but I'm not as good at recall as I once was. The prime objective Christ had here is to try to get folks to understand the union between husband and wife the way God intended it to be in the beginning. It was not just a \"thang\"; it was a covenant between a man and a woman, joined by the Word of God, becoming \"one person\" in Him.\n I still think adultery is the most broken law of them all - and the most \"overlooked\", diminished in meaning to that of \"tolerant infidelity\".\n \n(Parenthetically, the idea of a real, live, hot, fiery, eternal hell is fully developed for the first time by Jesus in this sermon. There is no mistaking his belief in such. That concept is beyond immoral. It is fiendishly barbaric.)\n\n I'll not devote too much to this part - just to say, we can't really comprehend what life (or afterlife) might be like out of the presence of God. We might not have the wording suitable to describe it other than that in which Christ used.\n \nWomen can be divorced if they commit adultery. This is odd in that the OT prescribes stoning for the offense. Didn't Jesus just proclaim the tittle thing? Why is it so easy to spot the contradictions?\n\n The same thing applies here, as do most all things according to The Law, where Christ came to fulfill it. Hate to sound like a broken record, but, here comes that amazing grace again... :)\n \nOne should not swear oaths. Here's a commandment a lot of Christians have adhered to, by Jove. Standing before the court awaiting to be sworn in, they righteously proclaim that it is against their belief to take an oath. Sit down and shut up.\n\n Yea - I can't see that either - unless you're going to scare somebody into believing that if they hold the Bible and lie that they might actually turn into a pillar of salt. A lie is a lie, whether you're holding the Bible or taking a bite of Jim's famous tamales.\n \nLove your enemies. Absurd. Unworkable. Impractical and inherently dangerous. I hate my enemies and that's that. Rather hypocritical too considering Jesus meant his message to be for Jews only, and gentiles were referred to as 'vipers'. And this hell that Jesus is so vociferously proclaiming, is it a place where love of his enemies is exercised?\n\n He wasn't talking about making love to them..., billsco. And His message was for all mankind, not just the Jews - remember, the \"...stone that the builders rejected...\" ?\n This type of love, and hate that He speaks of, concerns the Truth. It's not like the love you and your best friends have for one another, but caring enough to inform them of the Truth. That's why we get confused when Jesus called those evildoers \"vipers\" and \"fools\". They just didn't seem to find God's Truth when they stared it in the face, so Christ applied a little \"tough love\" to get them to understand. \n \nTake no thought for tomorrow. Is there worse advice than this? At least it's widely ignored. Luckily, when I ate my Cheerios this morning, some farmer had enough sense to think ahead and plant a crop of oats. This sermon should be retitled, \"How To Be Destitute.\"\n\n That was His way in telling us to trust Him. He promised that He would provide and has fulfilled that promise time and again for those that do trust Him.\n And what's wrong with taking one day at a time?\n \nDo not judge. Again some self-righteous Christians single out this, ignoring all that preceded it, and loudly proclaim it is against their religion to judge. It occurs to me that God doesn't know much about his special creation and what it's like to live this life here on earth, how one makes countless judgments each and every day. He is also a master of vagary. \n\n God knows us very well. And I agree that judgment is highly used and abused by religion, but God is by no means vagarious. It's not His fault we walk in our own little shining light most of the time.\n \nAsk and it shall be given, seek and you shall find, knock and it shall be opened. I'm sorry that just is not true.\n\n I disagree. BUT - neither you nor I will ever prove it either way.\n \nAnd it came to pass when Jesus had finished these words, the crowd was astonished. Somehow, I can believe that. This is his masterpiece, the crowning achievement of his oral ministry. Allow me to pronounce it utter nonsense.\n\n I guess you'd just have to be there.\n \n Although, keeping in line with the rest of it, I can see how they could be floored - it's a very, very powerful message - one not to be taken lightly, imho.", 
   {
    "unicode_changes_made": true
   }, 
   119253, 
   null, 
   1115766600.0
  ], 
  [
   120789, 
   null, 
   "billsco", 
   "There are fools in the world, billsco, you know that. As for the passage about burning in hell - Jesus was talking about unjustifiable hate for a brother. \n\n \n Yes, we agree there are fools and plenty of them. I don't need someone on a mountaintop telling me that fact. My question is whether you agree or not that calling someone a fool deserves to be fried.\n \n \n\n I can't, off-hand, recall any scriptures where Jesus prescribed self-injury, but I'm not as good at recall as I once was. The prime objective Christ had here is to try to get folks to understand the union between husband and wife the way God intended it to be in the beginning. It was not just a \"thang\"; it was a covenant between a man and a woman, joined by the Word of God, becoming \"one person\" in Him.\n I still think adultery is the most broken law of them all - and the most \"overlooked\", diminished in meaning to that of \"tolerant infidelity\". \n\n \n I agree adultery is bad for everyone involved and society as a whole so that laws proscribing it are necessary IMO. My problem is twofold: Jesus is moving it to a riduculous realm, and then prescribing a cure which is worse than the illness (MT 5: 29-30). \n \n \n\n I'll not devote too much to this part [hell] - just to say, we can't really comprehend what life (or afterlife) might be like out of the presence of God. We might not have the wording suitable to describe it other than that in which Christ used. \n\n \n He was very specific is his descriptions. It's hot, to paraphrase him. \n \n \n \n\n Yea - I can't see that either [oaths] - unless you're going to scare somebody into believing that if they hold the Bible and lie that they might actually turn into a pillar of salt. A lie is a lie, whether you're holding the Bible or taking a bite of Jim's famous tamales. \n\n \n Did he ever ship you any of those tamales and why wasn't I on the recipient list?\n \n \n\n He wasn't talking about making love to them..., billsco. And His message was for all mankind, not just the Jews - remember, the \"...stone that the builders rejected...\" ?\n This type of love, and hate that He speaks of, concerns the Truth. It's not like the love you and your best friends have for one another, but caring enough to inform them of the Truth. That's why we get confused when Jesus called those evildoers \"vipers\" and \"fools\". They just didn't seem to find God's Truth when they stared it in the face, so Christ applied a little \"tough love\" to get them to understand. \n\n \n \"Love you enemies\" is specific. I don't think it's healthy for anyone to labor under that kind of uncompromising yoke. Those who have claimed to love their enemies either don't know what an enemy is or are being disingenuous. I would probably have risen and clapped if he had said, \"Work diligently to keep your enemies as few as possible.\" \n \n \n\n That was His way in telling us to trust Him. He promised that He would provide and has fulfilled that promise time and again for those that do trust Him.\n And what's wrong with taking one day at a time? \n\n \n It's okay if you're an alchoholic. Otherwise planning is what leads to progress and civility. It keep us from becoming thieves.\n \n \n\n God knows us very well. And I agree that judgment is highly used and abused by religion, but God is by no means vagarious. It's not His fault we walk in our own little shining light most of the time. \n\n \n Why be concerned about us judging others? We have to in order to have a functioning society. No judging of offenses, no punishments.", 
   {
    "unicode_changes_made": true
   }, 
   120289, 
   null, 
   1115837640.0
  ], 
  [
   123990, 
   null, 
   "Big Orn", 
   "Yes, we agree there are fools and plenty of them. I don't need someone on a mountaintop telling me that fact. My question is whether you agree or not that calling someone a fool deserves to be fried.\n\n What it boils down to is this: Jesus was talking about the things man can do under the influence of evil that go against the Gospel. This pertains mainly to those that call the Gospel foolish as Paul explains in the 1st, 2nd, and 3rd chapters of 1 Corinthians. If it is so engrained in a person's mind that the Gospel is for fools, then they are indeed in danger of hell. This is not a commandment that if you call someone a fool that you'll \"fry\", but it is a warning that you are in danger of it.\n \nI agree adultery is bad for everyone involved and society as a whole so that laws proscribing it are necessary IMO. My problem is twofold: Jesus is moving it to a riduculous realm, and then prescribing a cure which is worse than the illness (MT 5: 29-30).\n\n This originates from the spiritual significance of the message. It deals entirely with what you hold on to in the flesh that makes you lust after \"other gods\". In doing so you are in danger of spending your whole life outside the will of God. Here Christ is saying, \"Let it go, cut it loose, because it offends you by taking your soul into the depths of darkness\".\n \nHe was very specific is his descriptions. It's hot, to paraphrase him. \n\n Again, my belief deals with the only thing that He could say that we could comprehend. Burning alive is a very bad thing...so is being cast into the \"outer darkness\".\n \nDid he ever ship you any of those tamales and why wasn't I on the recipient list?\n\n I've not asked him yet, but to hear tell, they'll get all off in your mouth... :)\n \n\"Love you enemies\" is specific. I don't think it's healthy for anyone to labor under that kind of uncompromising yoke. Those who have claimed to love their enemies either don't know what an enemy is or are being disingenuous. I would probably have risen and clapped if he had said, \"Work diligently to keep your enemies as few as possible.\" \n\n Here Christ was referring to those (all of us, indiscriminately) that He came to save by bearing the cross. It could be said that \"love your enemies\" is synonymous to \"you have no enemies, since I died for you all.\"\n \nWhy be concerned about us judging others? We have to in order to have a functioning society. No judging of offenses, no punishments.\n\n This is in reference to realizing our own faults, our own sins, before we accuse someone else of them. We are taught that we must remove the log from our own eye before we're able to recognize the speck in our neighbor's eye.\n To paraphrase the parable of the worker that owed his boss millions of dollars - he was forgiven of his debt, but went right away to a person that, in turn, owed him only few dollars and when the man couldn't pay had him thrown in jail.\n In 1 Corinthians 5:12,13, we read: Do you not judge those who are within the church?...Remove the wicked man from among yourselves. - operative words here are \"among yourselves\".\n I believe that in order to discern those things given us by the Holy Spirit that we must always apply critical thinking, and even judgment. In this way we are better equipped to \"seek and save\" - which is what Jesus did and so should we, knowing, however, that it is He that saves.", 
   {
    "unicode_changes_made": true
   }, 
   120789, 
   null, 
   1116345600.0
  ], 
  [
   124066, 
   null, 
   "trebor", 
   "What it boils down to is this: Jesus was talking about the things man can do under the influence of evil that go against the Gospel. \n\n \n Well , that is the problem now isn't it. Jesus died before the Gospels were written. The different gospels were written with different religious agendas, decades after the execution of Jesus.", 
   {}, 
   123990, 
   null, 
   1116357360.0
  ], 
  [
   124092, 
   null, 
   "Big Orn", 
   "Well , that is the problem now isn't it. Jesus died before the Gospels were written. The different gospels were written with different religious agendas, decades after the execution of Jesus.\n\n No, Jesus lived the Gospel.", 
   {}, 
   124066, 
   null, 
   1116358860.0
  ], 
  [
   124116, 
   null, 
   "CCR1994", 
   "No, Jesus lived the Gospel.\n\n \n I'm curious how one lives the gospel. The gospel is a message, specifically a message of good news. Messages are proclaimed or preached, not lived.", 
   {}, 
   124092, 
   null, 
   1116360840.0
  ], 
  [
   124125, 
   null, 
   "Big Orn", 
   "I'm curious how one lives the gospel. The gospel is a message, specifically a message of good news. Messages are proclaimed or preached, not lived.\n\n He was what the Gospel is - that's what I meant. As the Bible stated there are many things that Jesus did during his lifetime that was not written in the \"Four Gospels\", therefore, the entire New Testament was written according to the Life of Jesus Christ - and is the Gospel.", 
   {}, 
   124116, 
   null, 
   1116361560.0
  ], 
  [
   124129, 
   null, 
   "trebor", 
   "No, Jesus lived the Gospel.\n\n \n \n Really? And what is the evidence, outside of a set of religious books written decades after the fact? What did Jesus really do?", 
   {}, 
   124092, 
   null, 
   1116361740.0
  ], 
  [
   124134, 
   null, 
   "CCR1994", 
   "He was what the Gospel is - that's what I meant. As the Bible stated there are many things that Jesus did during his lifetime that was not written in the \"Four Gospels\", therefore, the entire New Testament was written according to the Life of Jesus Christ - and is the Gospel.\n\n \n The gospel for today is that Jesus was the son of God and that he died, was buried and raised on the third day and that our redemption is in his blood. One does not live a gospel message. One proclaims or preaches such a messages for the benefit of the person listening so that that person might believe it.", 
   {}, 
   124125, 
   null, 
   1116362160.0
  ], 
  [
   124140, 
   null, 
   "Big Orn", 
   "The gospel for today is that Jesus was the son of God and that he died, was buried and raised on the third day and that our redemption is in his blood. One does not live a gospel message. One proclaims or preaches such a messages for the benefit of the person listening so that that person might believe it.\n\n I think we're saying the same thing here, just from 2 different perspectives.\n \n Jesus - in His own words - talked about the Gospel and how it must be preached, so essentially He was the gospel at that time - the way that He was living, that is.", 
   {}, 
   124134, 
   null, 
   1116362700.0
  ], 
  [
   129291, 
   null, 
   "billsco", 
   "A disciple was ready to drop everything he had worked for his whole life, and give up everything he possessed to follow Jesus. All he needed to do was to first go home and bury his father who had just passed away. Jesus told him, \"Let the dead bury their own dead\" (MT 8:21-22). \n \n This from the man who had just uttered the Golden Rule on the mountain. What are we to make of that? Should they have left Jesus hanging on the cross?\n \n Why do we have to treat our loved ones with such contempt to follow Jesus? \n \n If he had said, \"Treat your family with love, here and now, and attend to their needs, large and small, and there I will be among you\" would we not consider him to be one of the greatest moral teachers of all time?", 
   {}, 
   124140, 
   null, 
   1117216920.0
  ], 
  [
   129418, 
   null, 
   "Jo Bennett", 
   "That particular passage has more than one interpretation. To bury one's father is a euphemism for waiting until after your father has died and you have inherited, it is not simply a case of burying an already dead person. Even if it is meant literally, an already dead man does not need caring for.", 
   {}, 
   129291, 
   null, 
   1117229580.0
  ], 
  [
   129436, 
   null, 
   "billsco", 
   " Even if it is meant literally, an already dead man does not need caring for.\n\n \n The dead man's family certainly does. It seems to me an able-bodied man would be of more use quietly attending to their needs than capering off to unknown parts with an unknown person.", 
   {}, 
   129418, 
   null, 
   1117232640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Ethics of Jesus", 
  "url": "http://www.4forums.com/political/religion-debates/4980-ethics-jesus.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4980, 
  "discussion_files": [
   [
    "13784.html", 
    "http://www.4forums.com/political/religion-debates/4980-ethics-jesus-print.html"
   ], 
   [
    "13785.html", 
    "http://www.4forums.com/political/religion-debates/4980-ethics-jesus-5-print.html"
   ], 
   [
    "13786.html", 
    "http://www.4forums.com/political/religion-debates/4980-ethics-jesus-4-print.html"
   ], 
   [
    "13787.html", 
    "http://www.4forums.com/political/religion-debates/4980-ethics-jesus-3-print.html"
   ], 
   [
    "13788.html", 
    "http://www.4forums.com/political/religion-debates/4980-ethics-jesus-2-print.html"
   ]
  ], 
  "identifier": 4980
 }
]