[
 [
  [
   114150, 
   null, 
   "jim's trucking", 
   "1.\n \n Only a Southerner knows the difference between a hissie fit and a\n \n conniption fit, and that you don't \"HAVE\" them, you \"PITCH\" them.\n \n \n \n 2.\n \n Only a Southerner knows how many fish, collard greens, turnip\n \n greens, peas, beans, etc., make up \"a mess.\"\n \n \n \n 3.\n \n Only a Southerner can show or point out to you the general\n \n direction of \"yonder.\"\n \n \n \n 4.\n \n Only a Southerner knows exactly how long \"directly\" is --\n \n as in: \"Going to town, be back directly.\"\n \n \n \n 5.\n \n Even Southern babies know that \"Gimme some sugar\" is not a\n \n request for the white, granular sweet substance that sits in\n \n a pretty little bowl in the middle of the table.\n \n \n \n 6.\n \n All Southerners know exactly when \"by and by\" is.\n \n They might not use the term, but they know the concept well.\n \n \n \n 7.\n \n Only a Southerner knows instinctively that the best gesture of\n \n solace for a neighbor who's got trouble is a plate of hot fried\n \n chicken and a big bowl of cold potato salad. If the neighbor's\n \n trouble is a real crisis, they also know to add a large banana puddin!\n \n \n \n 8.\n \n Only Southerners grow up knowing the difference between \"right near\"\n \n and \"a right far piece.\" They also know that \"just down the road\"\n \n can be 1 mile or 20.\n \n \n \n 9.\n \n Only a Southerner, both knows and understands, the difference\n \n between a redneck, a good ol' boy, and po' white trash.\n \n \n \n 10.\n \n No true Southerner would ever assume that the car with the\n \n flashing turn signal is actually going to make a turn.\n \n \n \n 11.\n \n A Southerner knows that \"fixin\" can be used as a noun, a verb,\n \n or an adverb.\n \n \n \n 12.\n \n Only Southerners make friends while standing in lines.\n \n We don't do \"queues,\" we do \"lines\"; and when we're \"in line,\"\n \n we talk to everybody!\n \n \n \n 13.\n \n Put 100 Southerners in a room and half of them will discover\n \n they're related, even if only by marriage.\n \n \n \n 14.\n \n Southerners never refer to one person as \"ya'll.\"\n \n \n \n 15.\n \n Southerners know grits come from corn and how to eat them.\n \n \n \n 16.\n \n Every Southerner knows tomatoes with eggs, bacon, grits, and coffee\n \n are perfectly wonderful; that red eye gravy is also a breakfast food;\n \n and that fried green tomatoes are not a breakfast food.\n \n \n \n 17.\n \n When you hear someone say, \"Well, I caught myself lookin',\"\n \n you know you are in the presence of a genuine Southerner!\n \n \n \n 18.\n \n Only true Southerners say \"sweet tea\" and \"sweet milk.\"\n \n Sweet tea indicates the need for sugar and lots of it --\n \n we do not like our tea unsweetened. \"Sweet milk\" means\n \n you don't want buttermilk.\n \n \n \n 19.\n \n And a true Southerner knows you don't scream obscenities at\n \n little old ladies who drive 30 MPH on the freeway. You just\n \n say, \"Bless her heart\" and go your own way.\n \n \n \n 20.\n \n To those of you who're still a little embarrassed by your\n \n Southerness, take two tent revivals and a dose of sausage\n \n gravy and call me in the morning. Bless your heart!\n \n \n \n 21.\n \n And to those of you who are still having a hard time\n \n understanding all this Southern stuff, bless your hearts,\n \n I hear they are fixin' to have classes on Southernese as\n \n a second language!\n \n \n \n 22.\n \n And for those that are not from the South, but have lived\n \n Here for a long time, ya'll need a sign to hang on ya'lls\n \n front porch that reads \"I aint from the South, but I got\n \n here as fast as I could.\"", 
   {
    "post_info": {
     "post_title": "Only a Southerner..."
    }
   }, 
   null, 
   null, 
   1114801020.0
  ], 
  [
   114183, 
   null, 
   "Dono", 
   "Great post, but ya'll are wrong with number 14.\n Dono", 
   {}, 
   114150, 
   null, 
   1114802580.0
  ], 
  [
   114195, 
   null, 
   "jim's trucking", 
   "Great post, but ya'll are wrong with number 14.\n Dono\nActually the Orthodox Southerners do pay attention to that rule of grammar. Y'all means \"two or more\". (...and I did spell y'all correctly!)\n \n A single person is addressed as you or you'ins.\n \n Possessive form is your, your'n (pronounced urine) or cha, as in betcha bottom dollar.", 
   {}, 
   114183, 
   null, 
   1114803180.0
  ], 
  [
   114316, 
   null, 
   "Dono", 
   "Actually the Orthodox Southerners do pay attention to that rule of grammar. Y'all means \"two or more\". (...and I did spell y'all correctly!)\n \n A single person is addressed as you or you'ins.\n \n Possessive form is your, your'n (pronounced urine) or cha, as in betcha bottom dollar.\n\n I'm about as \"Orthodox\" (?) as they come, and I can tell you from living it a long time that (1) there are no rules and (2) ya'll (spelled the same way you did in #14) is a universal term that can (and does) refer to one or many. \"Ya'll come, ya hear\" has ended many a one to one conversation in my experence and I still remember my grandmother saying, \"Ya'll look peaked\" when I was sick. How the hell do you classify one who is born, bred, and lived in the South as orthodox or not, is it their use of a word?\n Dono", 
   {}, 
   114195, 
   null, 
   1114813680.0
  ], 
  [
   114322, 
   null, 
   "billsco", 
   "What does \"by and by\" mean? I've heard a gospel song refer to the sweet by and by. Is it the same thing?", 
   {}, 
   114316, 
   null, 
   1114814700.0
  ], 
  [
   114688, 
   null, 
   "Dono", 
   "What does \"by and by\" mean? I've heard a gospel song refer to the sweet by and by. Is it the same thing?\n\n Yes, means future.\n Dono", 
   {}, 
   114322, 
   null, 
   1114911420.0
  ], 
  [
   114916, 
   null, 
   "jim's trucking", 
   "I'm about as \"Orthodox\" (?) as they come, and I can tell you from living it a long time that (1) there are no rules and (2) ya'll (spelled the same way you did in #14) is a universal term that can (and does) refer to one or many. \"Ya'll come, ya hear\" has ended many a one to one conversation in my experence and I still remember my grandmother saying, \"Ya'll look peaked\" when I was sick. How the hell do you classify one who is born, bred, and lived in the South as orthodox or not, is it their use of a word?\n Dono\nT'aint no need to git all knotted up. Fir a minute there I thought you's gonna go to ALL CAPS on me.\n \n Actually, the original post was a copy sent to me with an anonymous credit.\n \n Technically, we're both right. The apostrophe used in a contraction is normally placed where the left out letters would have been, such as:\n \n I'd for I had or I would\n You're for you are\n I'm for I am\n 'til for until\n Y'all for you all\n \n However, as you reminded me in your responce, sometimes we spell \"you\" as \"ya\", thus making ya'll stand for ya all.\n \n We also sometimes spell \"you\" as \"cha\".\n \n The use of \"ya\" and \"cha\" is a very conservative thing ,too, because ya can be possessive also (standing for your) as in: What cha got in ya pocket?\n \n However (squared), I notice that the Webster's New Collegiate Dictionary c1975 says y'all pron. chiefly South : YOU-ALL\n \n The Orthodox Southerner would be the one that makes an extra effort or naturally comes by the ability to preserve the Southern perculiarities by using them exclusively...sort of like an Orthodox Jew being the one who observes all the rules rather than just most of them. It would more like an untainted Southerner, a True Southerner...one of God's Favorite Children.\n \n It's not bad to be an Orthodox Southerner. Even an Orthodox Redneck can be fun sometimes.", 
   {}, 
   114316, 
   null, 
   1114974540.0
  ], 
  [
   115025, 
   null, 
   "Dono", 
   "T'aint no need to git all knotted up. Fir a minute there I thought you's gonna go to ALL CAPS on me.\n\n Didn't mean to come across as \"knotted up\". I took the post in good humor, enjoyed it and meant to respond in a friendly manner - one southern boy to another. No hissy intended.\n \n \nThe Orthodox Southerner would be the one that makes an extra effort or naturally comes by the ability to preserve the Southern perculiarities by using them exclusively...sort of like an Orthodox Jew being the one who observes all the rules rather than just most of them. It would more like an untainted Southerner, a True Southerner...one of God's Favorite Children.\n \n It's not bad to be an Orthodox Southerner. Even an Orthodox Redneck can be fun sometimes.\n\n No disagreement there. I grew up immersed in Southern language and it is as natural to me as breathing. Back in the day, I used to travel to different parts of the country making presentations to groups. I learned quickly that attempting to filter out my Southern heritage made me sound unnatural. Some one once told me that I did not write the same as I speak. I answered that it was because many of my words are not in any spell checker.\n Ya'll take care now.\n Dono", 
   {}, 
   114916, 
   null, 
   1114994340.0
  ], 
  [
   115131, 
   null, 
   "Hunter", 
   "American by chance, Southern by the grace of God.", 
   {}, 
   115025, 
   null, 
   1115011980.0
  ], 
  [
   115240, 
   null, 
   "georged", 
   "\n \n It's not bad to be an Orthodox Southerner. Even an Orthodox Redneck can be fun sometimes.\n\n \n You might want to use some discretion if in say Watts or several parts of NYC.", 
   {}, 
   114916, 
   null, 
   1115050020.0
  ], 
  [
   115354, 
   null, 
   "snakespit", 
   "So to sum this up...the typical southerner is a good hearted, directionally challenged, \"genetically similar\" person with poor eating habits, bad language skills, and probably high cholesterol. \n \n No thanks, proud to be a yankee. :p", 
   {}, 
   115240, 
   null, 
   1115061840.0
  ], 
  [
   115361, 
   null, 
   "jim's trucking", 
   "So to sum this up...the typical southerner is a good hearted, directionally challenged, \"genetically similar\" person with poor eating habits, bad language skills, and probably high cholesterol. \n \n No thanks, proud to be a yankee. :p\nFalse logic led you to that conclusion. The list of 22 things in the OP doesn't mean there aren't a million things that could be listed. The sampling is far too small to come up with a typical profile. We're lots more complicated than you might think.\n \n By the way, if you're truly a Yankee, you've never been in the South. You see, Yankees live up north, damn Yankees visit the South then go back home, but those gahdamn Yankees visit the South and STAY HERE!", 
   {}, 
   115354, 
   null, 
   1115062680.0
  ], 
  [
   115446, 
   null, 
   "snakespit", 
   "False logic led you to that conclusion. The list of 22 things in the OP doesn't mean there aren't a million things that could be listed. The sampling is far too small to come up with a typical profile. We're lots more complicated than you might think.\n \n By the way, if you're truly a Yankee, you've never been in the South. You see, Yankees live up north, damn Yankees visit the South then go back home, but those gahdamn Yankees visit the South and STAY HERE!\n\n \n Was just kidding with you Jim. But really, I lived in Ft. Lauderdale for 2 years, but I really don't consider that the south. More like the north...the north section of Cuba. I have been through the real south, and spent a little time just driving around the south, and found it to be a great place. Were all still Americans, and that to me is what is important in the long run.", 
   {}, 
   115361, 
   null, 
   1115068260.0
  ], 
  [
   115467, 
   null, 
   "jim's trucking", 
   "Was just kidding with you Jim. But really, I lived in Ft. Lauderdale for 2 years, but I really don't consider that the south. More like the north...the north section of Cuba. I have been through the real south, and spent a little time just driving around the south, and found it to be a great place. Were all still Americans, and that to me is what is important in the long run.\nI wus jes kiddin', too. I know at least one good gahdamn Yankee! emoticon_xclown", 
   {}, 
   115446, 
   null, 
   1115069700.0
  ], 
  [
   115555, 
   null, 
   "Dono", 
   "Was just kidding with you Jim. But really, I lived in Ft. Lauderdale for 2 years, but I really don't consider that the south. More like the north...the north section of Cuba. I have been through the real south, and spent a little time just driving around the south, and found it to be a great place. Were all still Americans, and that to me is what is important in the long run.\n\n I too lived in Ft. Lauderdale (Plantation actually) and never considered it the South. Re Cuba, one possible solution to the mess in Iraq might be to ship a few boatloads of Cubans there, they captured Miami without firing a shot.\n Dono", 
   {}, 
   115446, 
   null, 
   1115081400.0
  ], 
  [
   115568, 
   null, 
   "snakespit", 
   "I too lived in Ft. Lauderdale (Plantation actually) and never considered it the South. Re Cuba, one possible solution to the mess in Iraq might be to ship a few boatloads of Cubans there, they captured Miami without firing a shot.\n Dono\n\n \n Strangely enough, Plantation here as well. Loved it, but it is not the south. Agree on the Miami thing...too funny.", 
   {}, 
   115555, 
   null, 
   1115084460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Only a Southerner...", 
  "url": "http://www.4forums.com/political/fun-debates/4987-only-southerner.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 4987, 
  "discussion_files": [
   [
    "930.html", 
    "http://www.4forums.com/political/fun-debates/4987-only-southerner-print.html"
   ], 
   [
    "931.html", 
    "http://www.4forums.com/political/fun-debates/4987-only-southerner-2-print.html"
   ]
  ], 
  "identifier": 4987
 }
]