[
 [
  [
   114299, 
   null, 
   "samueltaylor88", 
   "In the world it is becoming a difficult venture indeed to instill a sense of responsibility and accountability in our youth. Persuading someone to do something they may not initially want to, and which they are not legally bound to do is very difficult. Unfortunately it is common place to compromise an intangible moral obligation to further one's own agenda or to appease one's wants. It would appear as though the admiration that would once adhere to the \"man for all seasons\" has turned to the attitude that the example of Sir Thomas More is outdated and impractical. Too many people have forgotten or simply neglect the implicit consequences associated with exercising freedom in making choices. I think it would be appropriate to apply the phrase and accompanying principle \"There's no such thing as a free lunch\" to the concept that \"there's no such thing as a free choice.\" \n \n The government is arranged such that it cannot through conventional means legislate morality. The idea of government mandating, or even promoting, the values it seems fit, as was done in ancient Rome and as the Puritans believed it should, has been proved not viable. The government may however pass laws with moral tones which are created to protect a person from abusing their liberty to the extent of negatively impacting another's. For example, there is no law that forbids taking the life of another individual simply because it is morally wrong to do so. There can and is, however, a law forbidding murder because to kill someone would be infringing on their right to live and enjoy their constituted freedoms. So we see that we have the right to establish and live by what ever principles we desire and deem fit so long as our actions do not restrict the liberties of someone else.\n \n Laws that deal with aspects of personal relationships are difficult to establish as well as enforce. Part of the reason this is true is because in a relationship both individuals involved allow one another to take part in personal areas of their lives. In such a situation the individual is willing to trade some of their privacy when entering into the relationship for the things that they want to get from it. In a relationship where intercourse mutually takes place couples may make whatever decision they would like without any legal ramification so long as their activities do not inhibit the freedoms of any others. When a couple engages in intercourse they must be accountable for the potential outcome of conception and pregnancy. If an adult were to drink and become angry to the point of abusing his child, would the child be held responsible for the abuse that took place? Of course not. If such a question is so absurd why is it that two adults, or minors behaving as adults, can end the development of a child to avoid the consequences of an action they willfully took part in? \n \n There are of course situations where the opinion of an accredited physician would expectedly be in favor of aborting a pregnancy. When I spoke of intercourse and accountability I used the word \"willfully\" because someone forced to have sex who becomes pregnant could not be expected to carry the child. Also, a baby incestuously conceived would fall under the same consideration. In addition, if the life and therefore liberty of the mother was threatened due to complications with the child a medical counsel would agree the mother would be justified in having an abortion. In cases such as these where the women has already had to endure much emotional and physical hardship the resolve of the ill fated pregnancy should be made to be as easy as possible. \n \n There are very few situations where there can be a predetermined solution to an issue that will justly contend with every case that faces it. It would not be right or appropriate to make laws forbidding abortion in every circumstance. It is wrong, not only morally but ethically, to evade the responsibilities that accompany the freedom our country affords us in terminating the development of a life that began with an action and a choice we made. If the mother so chooses, adoption is available and often auspicious to the child. The right to life of a developing infant is as deserved as any persons already born now, and though no amount of time in life is guaranteed, at the very least the opportunity to chance growing and living against the odds of miscarriage or involuntary abortion should be.", 
   {
    "post_info": {
     "post_title": "Aborting Accountability"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1114812000.0
  ], 
  [
   114314, 
   null, 
   "Sigma", 
   "You have identified the problems with banning abortion, but I was unable to discern what your proposed course of action would be. The banning of abortions on a case by case basis as the doctors determine?", 
   {}, 
   114299, 
   null, 
   1114813500.0
  ], 
  [
   125203, 
   null, 
   "johnson", 
   "termng the development of a life that began with an action and a choice we made.\n \n Some youngsters will tell you it wasn't a choice about an action... But the action of a youthful natural urge. They are not making a choice but acting on an urge. .. Now lets all be honest we\"ve all done that!! .. However I will not excuse responisibilty of giving in to natural urges, and I would submit that an abortion by someone who has been cought up in this situation would be doing the \" responsible \" thing by puting an end to it befor it begins.\n \n Of course you have a point we could just throw them in another home with the rest of the unwanted fetuses that reached full term and were shiped off to state run homes.", 
   {}, 
   114299, 
   null, 
   1116540720.0
  ], 
  [
   125215, 
   null, 
   "Voice Of Reason", 
   "termng the development of a life that began with an action and a choice we made.\n \n Some youngsters will tell you it wasn't a choice about an action... But the action of a youthful natural urge. They are not making a choice but acting on an urge. .. Now lets all be honest we\"ve all done that!! .. However I will not excuse responisibilty of giving in to natural urges, and I would submit that an abortion by someone who has been cought up in this situation would be doing the \" responsible \" thing by puting an end to it befor it begins.\n \n Of course you have a point we could just throw them in another home with the rest of the unwanted fetuses that reached full term and were shiped off to state run homes.\n\n \n People should be responsible for their actions be they man or woman.......Why does the innocent unborn baby in the womb after to pay for the mistakes of its parents?", 
   {}, 
   125203, 
   null, 
   1116541740.0
  ], 
  [
   125242, 
   null, 
   "Sigma", 
   "People should be responsible for their actions be they man or woman.......Why does the innocent unborn baby in the womb after to pay for the mistakes of its parents?\n\n \n Why should concern for the \"unborn baby\" come before the woman carrying it?", 
   {}, 
   125215, 
   null, 
   1116543480.0
  ], 
  [
   125248, 
   null, 
   "Nurglitch", 
   "It is wrong, not only morally but ethically, to evade the responsibilities that accompany the freedom our country affords us in terminating the development of a life that began with an action and a choice we made.\n Sorry, I'm confused. What's the difference between morality and ethics?\n \nIf an adult were to drink and become angry to the point of abusing his child, would the child be held responsible for the abuse that took place? Of course not. If such a question is so absurd why is it that two adults, or minors behaving as adults, can end the development of a child to avoid the consequences of an action they willfully took part in?\n I'm not sure I follow your reasoning here. Could you explain what the responsibility of the unborn child has to do with its parents aborting it?", 
   {}, 
   125215, 
   null, 
   1116543780.0
  ], 
  [
   125255, 
   null, 
   "Voice Of Reason", 
   "Why should concern for the \"unborn baby\" come before the woman carrying it?\n\n \n \n There should be concern for both........I have said that over and over again......\n \n Its like talking to a brick wall with some of you..........", 
   {}, 
   125242, 
   null, 
   1116543960.0
  ], 
  [
   125259, 
   null, 
   "Sigma", 
   "There should be concern for both........I have said that over and over again......\n \n Its like talking to a brick wall with some of you..........\n\n \n That's because you give irrational statements. If the fetus is given the right to live attached to the woman and the woman has no right to remove it, the fetus is given more consideration than the woman.\n \n It's impossible to have equal concern for both. If you did, why can she abort if her life is in danger but the fetus would survive?", 
   {}, 
   125255, 
   null, 
   1116544200.0
  ], 
  [
   125263, 
   null, 
   "johnson", 
   "People should be responsible for their actions be they man or woman.......Why does the innocent unborn baby in the womb after to pay for the mistakes of its parents?\n\n \n Tell that to a 17 year old kid!! Haven't you ever been a 17 yera old horny ****** befor?\n \n Wait I forgot who I was talking to,.. more than likely not.", 
   {}, 
   125215, 
   null, 
   1116544500.0
  ], 
  [
   125271, 
   null, 
   "Nurglitch", 
   "There should be concern for both........I have said that over and over again......\n Could you explain why there should be concern for both?\n \nIts like talking to a brick wall with some of you..........\n It might help communication if you gave reasons or explanations for some of the positions that you hold, rather than flatly asserting them. It's hard to agree with your position when you won't explain your grounds for holding it.", 
   {}, 
   125263, 
   null, 
   1116545040.0
  ], 
  [
   125274, 
   null, 
   "johnson", 
   "[QUOTE\n It might help communication if you gave reasons or explanations for some of the positions that you hold, rather than flatly asserting them. It's hard to agree with your position when you won't explain your grounds for holding it.[/QUOTE]\n \n Amen!!!! You treat everyone with anger rather than intrest!", 
   {}, 
   125271, 
   null, 
   1116545280.0
  ], 
  [
   125325, 
   null, 
   "Voice Of Reason", 
   "That's because you give irrational statements. If the fetus is given the right to live attached to the woman and the woman has no right to remove it, the fetus is given more consideration than the woman.\n \n It's impossible to have equal concern for both. If you did, why can she abort if her life is in danger but the fetus would survive?\n\n \n \n Why are you afraid to use the word baby? \n \n Obviously if the mother's life is endangered then and abortion is appropriate", 
   {}, 
   125259, 
   null, 
   1116549900.0
  ], 
  [
   125333, 
   null, 
   "Sigma", 
   "Why are you afraid to use the word baby?\n\n \n I'm not emoticon_confused I use the most appropriate word which is \"fetus\". \n \n \n\n Obviously if the mother's life is endangered then and abortion is appropriate\n\n \n Thus you dodge the question again :) The question was: Why are you able to choose the life of the mother over the life of the fetus if both are equally precious? Why are you able to choose the mother over the life of the fetus in the case of rape if both are equally precious? What is the criteria, and why is this criteria not valid for abortions for reasons of health?\n \n Doesn't the mother have to be more precious for her to be more important in those cases? Why is it so horrible to believe the mother is more important in all cases?", 
   {}, 
   125325, 
   null, 
   1116550560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Aborting Accountability", 
  "url": "http://www.4forums.com/political/abortion-debates/4990-aborting-accountability.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 4990, 
  "discussion_files": [
   [
    "15150.html", 
    "http://www.4forums.com/political/abortion-debates/4990-aborting-accountability-print.html"
   ]
  ], 
  "identifier": 4990
 }
]