[
 [
  [
   114384, 
   null, 
   "Duo_Maxwell", 
   "BAGHDAD, Iraq - Insurgents set off at least 17 bombs in Iraq on Friday, killing at least 50 people, including three U.S. soldiers, in a series of attacks aimed at shaking Iraq's newly formed government. An audio tape by one of America's most-wanted insurgents, Abu-Musab al-Zarqawi, warned President Bush there was more bloodshed to come.\n \n The well-coordinated attacks, which also wounded 114 Iraqis and seven Americans, came as political leaders are trying to curb the insurgency by including all of Iraq's main religious and ethnic groups into an uncertain new Shiite-dominated government that takes office Tuesday. Most of the bombing targets were Iraqi security forces and police, whom insurgents accuse of collaborating with the Americans.\n\n \n http://news.yahoo.com/s/ap/20050429/ap_on_re_mi_ea/iraq\n \n Didn't someone say the attacks are down and therefore is a sign of good thing? \n \n As I see it, the attacks are getting bigger and more damaging.", 
   {
    "post_info": {
     "post_title": "New string of attacks: 41 dead"
    }
   }, 
   null, 
   null, 
   1114827900.0
  ], 
  [
   116984, 
   null, 
   "SteveRogers", 
   "http://news.yahoo.com/s/ap/20050429/ap_on_re_mi_ea/iraq\n \n Didn't someone say the attacks are down and therefore is a sign of good thing? \n \n As I see it, the attacks are getting bigger and more damaging.\n\n \n \n Should have listened to the commanders on the ground who said there has always been a lull before the violence picks up again. So, the next time it lulls, remember that we've won, it's all over, no need to think again,\n \n emoticon_frazzled", 
   {}, 
   114384, 
   null, 
   1115267940.0
  ], 
  [
   116986, 
   null, 
   "Duo_Maxwell", 
   "Bomber Kills 60 at Iraq Police Center \n \n \nIRBIL, Iraq - A suicide attacker slipped into line at a police recruitment center in this usually tranquil northern Kurdish city and blew himself up Wednesday, leaving the streets slick with blood in the deadliest insurgent attack in more than two months, police said. Sixty Iraqis were killed and 150 wounded.\n\n \n http://news.yahoo.com/s/ap/20050505/ap_on_re_mi_ea/iraq;_ylt=ApxXcpOhPwzaQP8cZdK6Z2dvaA8F;_ylu=X3oDMTBiMW04NW9mBHNlYwMlJVRPUCUl\n \n btw, it was VOR who made the inane claim about the attacks.", 
   {}, 
   116984, 
   null, 
   1115268120.0
  ], 
  [
   118074, 
   null, 
   "Herbalizer", 
   "btw, it was VOR who made the inane claim about the attacks.\n\n \n Ya but he's a complete f-ing jackass. I mostly read his posts for entertainment value.", 
   {}, 
   116986, 
   null, 
   1115432220.0
  ], 
  [
   118298, 
   null, 
   "Desaix", 
   "Duo you should realise by now that(as any sane or objective person would)VOR is an unoriginal troll.Its better to completely ignore him until he buggers off like he did at WS.\n \n Iraq seems to be going down the gutter again,although its not quite as bad as a year ago.The nihilistic and new era Islamist's are suppling the Baathists and Sunni nationalists with hundreds of willing suicide bombers that care little about killing fellow Muslims.Thats worring because even the old Islamist vanguard cared about killing Muslims.The new Islamists,less idealogical and from lower class families led by Afghani veterans will murder indiscrimanately anybody,like they do in Iraq and like they did in Spain.Many are even moving away from the Al-Qaeda hardcore doctrine of using bombings only as martyrdom operations.The bombing in Kurdistan proves Ansar al-Sunna are ready to open up another Islamist front against the peshmerga and Kurdish 'collaberaters'.Maybe there was some truth in the idea that Saddam was the Tito of the Iraq?", 
   {}, 
   118074, 
   null, 
   1115490360.0
  ], 
  [
   118302, 
   null, 
   "Dono", 
   "Duo you should realise by now that(as any sane or objective person would)VOR is an unoriginal troll.Its better to completely ignore him until he buggers off like he did at WS.\n\n Yes, but you must admit he can be amusing and that when he is wrong (which is most of the time), he is consistently wrong and never swayed by logic or sound argument. You could send VOR a copy of Moby Dick and he would still claim it was a venereal disease.\n Dono", 
   {}, 
   118298, 
   null, 
   1115491560.0
  ], 
  [
   118307, 
   null, 
   "Desaix", 
   "Yes, but you must admit he can be amusing and that when he is wrong (which is most of the time), he is consistently wrong and never swayed by logic or sound argument. You could send VOR a copy of Moby Dick and he would still claim it was a venereal disease.\n Dono\n\n \n Lol...To be honest i have read too many of VOR's posts to find them amusing.More like its incredibly depressing to think that intelligent people actually take him seriously and praise him.\n \n Trust me soon enough you'll regret the day you encouraged him by replying to one of his posts. ;)", 
   {}, 
   118302, 
   null, 
   1115492640.0
  ], 
  [
   118322, 
   null, 
   "Duo_Maxwell", 
   "But Desaix, c'mon. \n \n Go look at the death penalty is too expensive in Crime debates. \n \n It's hysterical when VOR goes all angry when he's shown to be a complete flip flopping hypocrite. He goes completely flusttered and produces even less coherent responses then usual.\n \n the entertainment value of that is virtually priceless.", 
   {}, 
   118307, 
   null, 
   1115497560.0
  ], 
  [
   118405, 
   null, 
   "Desaix", 
   "Yeah well i think your just encouraging the poor fellow.He would be funny if you could actually make him mad but the guy never gets angry.Inhuman.Thats why he is so annoying. :xbanghead \n \n So is there like anyone worth debating here?Fracas and VoR aren't typical of the quality of debate around here are they?", 
   {}, 
   118322, 
   null, 
   1115516340.0
  ], 
  [
   118828, 
   null, 
   "Duo_Maxwell", 
   "Yeah well i think your just encouraging the poor fellow.He would be funny if you could actually make him mad but the guy never gets angry.Inhuman.Thats why he is so annoying. :xbanghead \n \n So is there like anyone worth debating here?Fracas and VoR aren't typical of the quality of debate around here are they?\n\n \n People of quality that would disagree with you? \n \n huh. ummmm. argh. Goodluck with that.", 
   {}, 
   118405, 
   null, 
   1115584860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  New string of attacks: 41 dead", 
  "url": "http://www.4forums.com/political/current-events-debates/4995-new-string-attacks-41-dead.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 4995, 
  "discussion_files": [
   [
    "15876.html", 
    "http://www.4forums.com/political/current-events-debates/4995-new-string-attacks-41-dead-print.html"
   ]
  ], 
  "identifier": 4995
 }
]