[
 [
  [
   114684, 
   null, 
   "Duo_Maxwell", 
   "is there any proof? \n \n It seems when that is brought up in other threads as a tangent, all calls for proof are ignored.\n \n Perhaps focusing the entire thread on such claim will show either proof or lackthereof of such claim.", 
   {
    "post_info": {
     "post_title": "Proof of actually being ex-gay"
    }
   }, 
   null, 
   null, 
   1114910880.0
  ], 
  [
   114701, 
   null, 
   "jyoshu", 
   "Why the heck should anyone need proof of whether or not they are gay? Wouldn't that just know based on their attractions?", 
   {}, 
   114684, 
   null, 
   1114915200.0
  ], 
  [
   114703, 
   null, 
   "Duo_Maxwell", 
   "well, there are arguments made that people have become \"ex-gay.\" \n \n Except no one has been able to provide such evidence of a occurance while many claim that it has happened thousands of times.", 
   {}, 
   114701, 
   null, 
   1114915860.0
  ], 
  [
   114708, 
   null, 
   "joebrummer", 
   "Some food for thought.....\n \n http://www.anythingbutstraight.com/index.html\n \n More food....\n \n What Does Ex-Gay Actually Mean?\n \n One of the most slippery and cruel things that Exodus and other \"change\" ministries do is play semantic games with the word \"ex-gay\". The word implies that a person has gone from gay to straight, with \"ex\" clearly meaning that one is no longer homosexual. The problem is, ex-gay leaders are wildly inconsistent on whether true heterosexuality is a real possibility, and they habitually offer conflicting comments on the matter.\n \n As you will see by the following quotes, sometimes the same individuals offer statements that are contradictory. One moment they say they have changed and that Exodus and other groups promote genuine heterosexuality. The next moment, leaders will say homosexual fantasies and attractions will continue indefinitely, and heterosexuality isn't really the goal.\n \n Change IS Definitely Possible\n \n Alan Chambers, Executive Director, Exodus North America\n \"I'm not gay anymore...I did change. I changed my sexual orientation and became heterosexual.\"\n \n Books Promoting Change\n Major publications sold by Exodus and other ministries have unambiguous titles that tout change such as \"Coming Out Straight\", \"Homosexual No More\" and \"You Don't Have to Be Gay.\"\n \n Richard Cohen, President, Parents and Friends of Ex-Gays\n \"For those who wish to make this transition from homosexual to heterosexual, I am certain that change is possible. I knew that God did not create me this way.\"\n \n Joe Dallas, Speaker, Focus on the Family's Love Won Out tour\n \"If someone as deluded as I was can be brought out of homosexuality then surely anyone can.\"\n \n Sy Rogers, Former Executive Director, Exodus North America\n \"The bottom line is, you have a choice to overcome it. You can change.\"\n \n Frank Worthen, New Hope Ministries\n \"I don't think there's anybody who can't change if they just relax and let God do what He wants.\"\n \n Change ISN\"T Necessarily Possible\n \n Alan Chambers\n \"I don't think change is going from gay to straight. Just saying that doesn't sound like an accurate representation of what Exodus facilitates or proclaims.\"\n \n \"To say that Exodus is a great healer and the place for people to become straight, I would think that is not right. If there are Exodus ministries that do that, we need to change that. We need to work on that.\"\n \n \"Put me in a bathhouse, would I find people attractive or would it stir me, it probably would. I'm not a raging heterosexual where I have to worry about if a lady walks in the room and I have to turn my head, while some guys are like that.\"\n \n Joe Dallas\n \"No one has ever left therapy saying, 'Wow, I have absolutely no homosexual thoughts.\n \n Jeff Konrad, Author, You Don't Have To Be Gay\n \"Now don't get me wrong, I don't lust for women as some men do; that is not healthy behavior either.\"\n \n Alan Medinger, Author, Growth Into Manhood\n \"If an attractive man and an attractive woman enter a room, it is the man I will look at first,\" Medinger told the Wall Street Journal.\n \n John Smid, Executive Director, Love in Action\n \"I am not totally healed from homosexuality. It is part of my emotional, physical and spiritual history. It will not be erased as if it did not exist. I still struggle at times...I will shut down with my wife at times. I periodically have thoughts regarding men,\" said on his website.\n \n Sillman Davis, Director, Overcomers ex-gay ministry\n \"Obviously, I've been with women, but that's not the point. My healing process is a journey; it's a walk with Christ.\"", 
   {
    "unicode_changes_made": true
   }, 
   114703, 
   null, 
   1114917600.0
  ], 
  [
   114709, 
   null, 
   "joebrummer", 
   "\"Ex-Gay\" Scandals and Defections\n \n From the very beginning, the \"ex-gay\" ministries have been enmeshed in a series of high profile, embarrassing follies and failures. These headline producing scandals and defections are perhaps the greatest evidence that efforts to change a person's sexual orientation do not work and can often be harmful. The following are the most well publicized defections and scandals in the colorful annals of \"ex-gay\" history:\n \n * In 1973 John Evans, who is gay, and Rev. Kent Phil, who is heterosexual, co-founded the world's first modern \"ex-gay\" ministry, Love In Action on the outskirts of San Francisco. However, after Evans' best friend Jack McIntyre committed suicide in despair over not being able to \"change\", Evans realized that the program was not working and denounced Love in Action. To this day, the co-founder of the world's original \"ex-gay\" ministry condemns the program as a dangerous - and sometimes fatal - fraud.\n \n * Love in Action co-founder Rev. Kent Philpott wrote The Third Sex?, which was the first ever \"ex-gay\" book touting six conversions to heterosexuality through prayer. The book was wildly influential and inspired the start of several \"ex-gay\" ministries. However, the truth is none of the six people featured had changed. From the beginning, the foundation of the \"ex-gay\" ministries was built on a lie. Although Philpott had no trouble condemning gay people, his own moral failures became evident after he was defrocked from his church for having an adulterous affair.\n \n * In the early 1970's Gary Cooper and Michael Bussee were counselors at an \"ex-gay\" ministry in Anaheim, Calif. In 1976, they organized the first national conference of \"ex-gay\" ministries. At this conference, Exodus International was formed and it is now the world's largest \"ex-gay\" organization. While traveling on behalf of Exodus, the two men acknowledged that they had not changed and were in love with each other. They soon divorced their wives, moved in together and eventually held a commitment ceremony.\n \n * In 1979, Seventh Day Adventist minister Colin Cook founded Homosexuals Anonymous (HA). Appearing twice on the Phil Donahue show, he solidified his reputation in the early 80's as the nation's premier \"ex-gay\" spokesperson. But Cook's efforts collapsed in 1986 after he was exposed for leading mutual masturbation sessions and giving clients nude massages. Cook moved to Colorado and made a comeback in 1992 by helping Colorado for Family Values and Focus on the Family promote their anti-gay agenda. But in 1995, Cook's efforts unraveled, once again, after several of Cook's clients accused him of phone sex, mutual masturbation and inappropriate hugs.\n \n * In 1987, Jeremy Marks founded Courage, London's first \"ex-gay\" ministry. In 2001, after nearly 15 years of watching people - including himself - struggle in vain to \"change\", he renounced Exodus's methods by saying that they were failing in their efforts to change peoples' sexual orientation.\n \n * In 2000, Wade Richard's appeared as a media spokesperson for a group called the Saviors Alliance for Lifting the Truth and gave his testimony of \"change\" at a major press conference sponsored by right-wing zealot Peter LaBarbera, who now works at Concerned Women for America. But a year later, Richards rebuked the \"ex-gay\" ministries when he came out in an interview with the Advocate magazine.\n \n * John Paulk was the most famous \"ex-gay\" in history having appeared on 60 Minutes, Oprah, and on the cover of Newsweek. But it was his appearance in a Washington, DC gay bar in September 2000 that got him in hot water. After he was photographed, he was suspended as Chairman of Exodus and put on a temporary \"hiatus\" by Focus on the Family.\n \n * Desert Stream ministries acknowledged in their Mid-Year 2001 Report that, \"At the end of 2000, we faced an unusual number of Desert-Stream-related leaders who fell into sexual sin, or who at least demonstrated a colossal lack of wisdom in their social choices...Several were placed on different plans of discipline and restoration.\" \n http://www.anythingbutstraight.com/learn/scandals.html", 
   {
    "unicode_changes_made": true
   }, 
   114708, 
   null, 
   1114917660.0
  ], 
  [
   114752, 
   null, 
   "JustineCredible", 
   "Here are some more sobering websites: \n \n http://www.oneby1.org/resources/top5myths.html\n \n http://www.outfront.org/library/exgay.html\n \n http://ralliance.org/DangerousCult.html\n \n http://www.truluck.com/html/the__ex-gay__fraud.html\n \n http://www.afsc-fan.org/dangers.htm\n \n http://www.skeptictank.org/hs/exgay2.htm?FACTNet\n \n http://www.whosoever.org/v6i3/grizzle.html\n \n http://members.freespeech.org/nd/exgay2.html\n \n http://members.aol.com/exgaynomad/\n \n http://www.hrc.org/Template.cfm?Section=Get_Involved1&Template=/ContentManagement/ContentDisplay.cfm&ContentID=15254\n \n http://www.voicesweb.org/voices/cu/exexgay799.html\n \n http://www.anythingbutstraight.com/reviews/leaders.html", 
   {}, 
   114709, 
   null, 
   1114933020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Proof of actually being ex-gay", 
  "url": "http://www.4forums.com/political/gay-rights-debates/5006-proof-actually-being-ex-gay.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 5006, 
  "discussion_files": [
   [
    "7881.html", 
    "http://www.4forums.com/political/gay-rights-debates/5006-proof-actually-being-ex-gay-print.html"
   ]
  ], 
  "identifier": 5006
 }
]