[
 [
  [
   115593, 
   null, 
   "Duo_Maxwell", 
   "TOPEKA, Kan (Reuters) - Evolution is going on trial in Kansas. \n \n Eighty years after a famed courtroom battle in Tennessee pitted religious beliefs about the origins of life against the theories of British scientist Charles Darwin, Kansas is holding its own hearings on what school children should be taught about how life on Earth began\n \n http://news.yahoo.com/s/nm/life_evolution_dc;_ylt=AihpO.TTt_tjtVvPkI5NWRms0NUE;_ylu=X3oDMTA2bm5xNHVjBHNlYwNtcA--\n \n You know, most states try not to make themselves look like complete XXXXXX. C'mon, what the hell is wrong with Kansas? \n \n \n\"If students... do not understand the weaknesses of evolutionary theory as well as the strengths, a grave injustice is being done to them,\" Abrams said.\n\n \n While that is true, teaching ID is just filling them with horrible thinking skills. ID in one sentence is \"we don't know how it was done, and it seems too complicated to explain now, therefore God did it.\" \n Do you really want kids to learn that kind of retarded thinking?", 
   {
    "post_info": {
     "post_title": "Evolution on trial as Kansas debates Adam vs Darwin"
    }
   }, 
   null, 
   null, 
   1115089080.0
  ], 
  [
   115622, 
   null, 
   "pandion", 
   "You know, most states try not to make themselves look like complete XXXXXX. C'mon, what the hell is wrong with Kansas?\n\n I guess most Kansans are ultimately stupid. I'm sorry if that offends the minority who successfully fought off the previous attack on the educational system of Kansas, but it must be true. The people of Kansas returned XXXXXX to the board of education (maybe because those who wanted to impose their religion were motivated to vote while those who opposed the imposition of a particular religion on school children were too stupid to go to the polls). It wasn't lesson enough that two major corporations that were in the final stages of establishing manufacturing facilities in Kansas went elsewhere as a result of the previous attempts to impose superstition in place of science. The result was a loss of thousands of potential jobs in Kansas. Those jobs are gone and now Kansas wants to discourage other companies that require scientific literacy in its employes from coming to Kansas.\n \n Pretty soon, the policy will be nationwide. Pretty soon, all highly technical jobs will be exported so that we can all praise the lord as we fall to third world status.", 
   {}, 
   115593, 
   null, 
   1115095680.0
  ], 
  [
   115626, 
   null, 
   "Beowulf Lee", 
   "I actually think that ID has a pretty good chance of winning. One reason being is that ID links with the idea of God was taught to them even before they understood it, so it holds a deep impression on many people there. Another reason I think is that most of them probably never took a decent bio class, so they would have no idea what the evolutionsist was talking about. Lastly, people hold God in a lot higher posistion in their minds then evolution, already giving evolution a bad reputation, because its \"competing\" with God.", 
   {}, 
   115593, 
   null, 
   1115095800.0
  ], 
  [
   115679, 
   null, 
   "pandion", 
   "I actually think that ID has a pretty good chance of winning. One reason being is that ID links with the idea of God was taught to them even before they understood it, so it holds a deep impression on many people there. Another reason I think is that most of them probably never took a decent bio class, so they would have no idea what the evolutionsist was talking about. Lastly, people hold God in a lot higher posistion in their minds then evolution, already giving evolution a bad reputation, because its \"competing\" with God.\n\n Sadly, you may be correct. The mindless majority of the American people have been duped to believe that science is somehow opposed to their religion. They know that the mythology of bronze age nomads is historically correct. Don't confuse them with facts - so what if grasshoppers don't have 4 legs, what if rabbits don't chew cud, and who cares it bats are not birds? The Bible is true without error.\n \n Certainly people who have bee indoctrinated to believe that \"GODDIDIT\" will believe that question. They have been taught that it is a sin to question revealed truth, and revealed truth is revealed by \"ministers\" who are scientifically illiterate.\n \n Why does creationism seem to be a matter of the views of those who are becoming rich from the stupidity of the Christins masses.\n \n In the mean time, the U.S. is now a second rate country, where our universities are manned by an increasing number of foreign professors. I don't have a problem with foreign professors except that there are no qualified U.S. citizens out there. It is becoming increasingly apparent that the leadership of U.S. universities is due to the influx of foreign professors. They get paid more here than in their own country, and of course, they are more qualified than U.S. applicants for their positions.\n \n I wonder if our universities will be able to maintain leadership in the world of academia when the entire upper echelon is overtaken by better educated and more qualified foreigners.\n \n In fact: Japan has about half the population of the U.S. and graduates about twice the number of students with degrees in science and engineering.\n \n Isn't it wonderful that we are debating the pseudoscience of creationism and ID in our school boards? It is the beginning of the end.", 
   {}, 
   115626, 
   null, 
   1115103060.0
  ], 
  [
   115708, 
   null, 
   "Big_Bear_Scot", 
   "As a complete outsider i.e not from the US, I find it strange that people actually believe in things like Youth Earth Creationism. I honestly think the US needs to go through another 'enlightenment' to get rid of silly notions like Intelligent Design and YEC, to replace Superstition and fear with Science.\n \n How wide spread is this movement to get Youth Earth Creationism taught as Science ?\n \n How likely is that Kansas will succeed and also is the teaching of YEC likely to spread to other states ?\n \n I am honestly glad we don't have the same problem here in the UK.", 
   {}, 
   115679, 
   null, 
   1115112480.0
  ], 
  [
   115730, 
   null, 
   "Tastyfish", 
   "I think the problem is that ID promotes itself as a 'compromise' between evolution and biblical creationism. It seems fair to a politician that there should be compromise in these debates, 'clearly' its just evolution being unreasonable.\n \n If it were a straight debate between biblical creationism and evolution there would be no choice which would come out on top. But seeing as one side is arguing for evolution to be taught, and the other to just not have it taught, rather than really offering another theory now chances are they'll side against evolution to try to make both sides happy", 
   {}, 
   115708, 
   null, 
   1115124300.0
  ], 
  [
   115899, 
   null, 
   "daewoo", 
   "I am in kansas, and on my local board of education. There are a few things you folks do not seem to understand.\n \n First, the local board of education is Ks is essentially all powerful. While it is theoretically possible that we could loose funding for failing to comply to state BOE mandates, it has never happened before, will likely never happen in the future.\n \n This is politics. The state board feels compelled to let the creationists have thier day in court. No idea what the outcome there will be. I do know what the total outcome will be. The sdtate board will come to a decision, and send a notice to local education boards. Some of us will read it, most will not bother, we will just toss it in the trash with all the other unread state BOA mandates and go on doing business as we always have.", 
   {}, 
   115730, 
   null, 
   1115145420.0
  ], 
  [
   116409, 
   null, 
   "Mucusaur", 
   "S'funny, the \"proud American\" folks who push creationism are actually doing their beloved country a diservice by regressing its intellectual level back to the middle ages. I'm not being alarmist - I really believe this. A society cannot progress without a firm founding in science.", 
   {}, 
   115899, 
   null, 
   1115209440.0
  ], 
  [
   116809, 
   null, 
   "daewoo", 
   "As a complete outsider i.e not from the US, I find it strange that people actually believe in things like Youth Earth Creationism. I honestly think the US needs to go through another 'enlightenment' to get rid of silly notions like Intelligent Design and YEC, to replace Superstition and fear with Science.\n \n How wide spread is this movement to get Youth Earth Creationism taught as Science ?\n\n \n Intellignet design seems to have a large following. The fact that somebody believes in intellient design does not necessarily mean that they disagree with evolution. A lot of folks (I would say the majority) view it as evolution used as a vehicle for intellient design (basically \"god planned it and made it all happen\").\n \n The movement to teach YEC is non existant. Creationism does not necessarily=YEC. The YEC crowd is their own little clique of scientific illiterates. I have been on the local board of education for 2 years now and have never heard the phrase \"Young Earth Creationists\" in any official capacity, nor has anybody ever suggested that it be taught. I had no idea what a \"young earth creationist\" was until I read it on this board, 6 months ago. It is simply not an issue, and I am right in the middle of Kansas.\n \n \n \nHow likely is that Kansas will succeed and also is the teaching of YEC likely to spread to other states ?\n\n \n YEC really sin't an issue here. \n \n Here is a link to what everybody is up in arms about, the proposed chanegs to the KS BOE science standards:\n \n http://www.kansasscience2005.com/Proposed%20Revision%20to%20Draft%202%20KS%20Sci%20Stds.pdf\n \n \n They are not talking about actually teaching creationism in the classroom, nor is there actually any discussion about not teaching evolution. What they want is to write into state guidelines requirements that kids have to be told that there are other theories out there, and there are holes in the theory of evolution.\n \n Personally, I see no problem with this, and it has more or less been our unofficial policy for years around here. There are holes in the theory of evolution, and there are segments of it that are mostly conjecture. It is in no way as foolish as the YEC theory, or even the strict creationist theory, but there are certianly hole in the theory. We may fill them in the future, but for now, we just have conjecture to fill those holes.\n \n All they are really pressing for is basically for kids parents to tell their kids AT HOME that god guided evolution without it contrasting directly with what the kids are being taught at school. Personally, I see no problem with this, as long as they stick to the facts in any case. Just glanmcing over the proposed changes, I am not seeing anything that is factually incorrect.\n \n The problem is that you have wack jobs and zealots on both sides of the issue. On the one hand, you have the YEC/creationist crowd. Some fo them go off the deep end when you suggest anything but a literal interpetationof Genisis. On the other side, you have the evolutionaist crowd, who predict gloom and doom and a return to the middle ages every time you suggest that we leave some opening for kids parents to attach religous connotation to the issue.\n \n The evolutionist zealots are essentially pushig to remove any possible religous connotation from evolutionary teaching. The YEC folks want to remove any reference to science from the debate.\n \n Normal folks, people who are not just trying to **** on somebody elses religon or force their religon down somebody elses throat seem to be pushing for a secular and neutral classroom. This is not an unobtainable goal.\n \n In truth, we could put everything we absolutly know about evolution (have physical proof for) in a box, and it would be a small one. A large part of th theory is conjecture. Teach the kids what is conjecture and what is not. This just makes good sense. Teach it how it is, not how you wish it was. How many hundreds of years have we lost in scientific development because people failed to experiment into areas that were believed to be known? How long idd the theory of spontaneus generation hold prevelance before somebody actually challenged it scientifically? \n \n Nobody is suggesting that creationism be pushed in our classrooms. Nobody is even suggesitng that evolution NOT be taught. They are suggesting that evolution be taught acuratly. They want the kids to understand that the theory of evolution certainly has a wide body of evidence behind it, but it also has a substantial amount of conjecture tacked on. While most of the commonly held conjecture certainly fits the evidence at hand, there may be other explanations, explanations we have not even thought of yet, that also fit the evidence. \n \n One example is the section about the primordial soup theory. Do we actually have any evidence for the existance of \"primordial soup\"? Have we found fossilized soup? Have we ever managed to create such a soup in a lab? Have we ever seen an example of life emerging from a sterile, lifeless environment? Is there really a difference between this and the theory of spontaneus generation? It is just as likely that an alien from uranus landed on premoridalearth, took a dump, and we are all decended from an intergallactic tapeworm. BUT, kansas BOA standards currently have people teaching the primordial soup theiry as if it was proven. It is not. It is baseless conjecture. In fact, it is in contrast to generally accepted biological rules (life does NOT come from nonliving matter). \n \n Persoanlly, I think both sides are wrong. I think that the evolutionists have fallen prey to the arrogance of the soft sciences. In striving to understand something, they have taken a relatively small body of evidence, made up a big story around it, and told themselves \"we know it all now\" rather than accepting that their explanation may not be entirely correct. the evolutionists ont he other hand (YECs anyway)....well, that one is a no brainer. I personally cannot find fault witht he intelligent design folks who feel that god guided evolution, since to disprove this you essentially have to disprove the existance of god, and nobody has ever managed to do so (though the concept of an invisible man in the sky is a little silly).", 
   {}, 
   115708, 
   null, 
   1115242380.0
  ], 
  [
   116815, 
   null, 
   "Clive14", 
   "...Personally, I see no problem with this, and it has more or less been our unofficial policy for years around here. There are holes in the theory of evolution, and there are segments of it that are mostly conjecture. It is in no way as foolish as the YEC theory, or even the strict creationist theory, but there are certianly hole in the theory. We may fill them in the future, but for now, we just have conjecture to fill those holes...\nThe problem lies in the choice of theory. Evolutionary theory is one of our strongest theories. It has bucket-loads of evidence to support it. It is very well understood. Gravitational theory however is a woefully weak theory. Beyond the facts that mass has no effect upon the rate of descent, we can send probes to Saturn's moons using our knowledge of gravity and gravity effects time, we know next to diddly squat about it. We do not know how it works. It doesn't even appear to work properly over large siatnces, the universe is expanding at the wrong rate according to our gravitational calculations, we invent dark matter and dark energy (neithe rof which has been detected) to explain gaping hole sin the theory and the entire theory is at odds with quantum theory. So why don't Kansas shcools teach about alternate theories in physics classes when covering gravity?\n \n The answer of course is simple: evolution is questioned to appease the religious fundamentalists that still hold your country to ransom by the balls. Don't give me this nonsense about \"evolutionist zealots\": they are simply scientists p***ed off with weak school boards cowering at the the first sign of the fundies getting upset over their kids being taught current scientific knowledge, rather than religious mythology, in science classes. ID is religious mythology. It has no evidence to support it. It isn't a scientific theory. It has no place in the science classroom.", 
   {}, 
   116809, 
   null, 
   1115243880.0
  ], 
  [
   116817, 
   null, 
   "sinjin", 
   "I had never heard the term \"evolutionist\" until I heard it here.", 
   {}, 
   116815, 
   null, 
   1115244120.0
  ], 
  [
   116823, 
   null, 
   "Beowulf Lee", 
   "One example is the section about the primordial soup theory. Do we actually have any evidence for the existance of \"primordial soup\"? Have we found fossilized soup? Have we ever managed to create such a soup in a lab?\n \n \n I think we do. In the 1950's, at the University of Chicago, Harlod Urey and Stanley Miller tried to set up an experiment where they tried to copy the known conditions of an early Earth, and as it turns out, amino acids formed.", 
   {}, 
   116815, 
   null, 
   1115244600.0
  ], 
  [
   116833, 
   null, 
   "Tastyfish", 
   "Though the counter argument is the conditions wern't quite the same - however research into ribozymes and mycelles (origin of compartmentalisation i.e cells) lends weight to the evolution of life from complex molecules - there are still gaps but its hardly just guessing anymore.", 
   {}, 
   116823, 
   null, 
   1115245440.0
  ], 
  [
   116834, 
   null, 
   "gnojek", 
   "The evolutionist zealots are essentially pushig to remove any possible religous connotation from evolutionary teaching. The YEC folks want to remove any reference to science from the debate.\n\n I think that scientists don't work with religion and religion has no place in science class. \n \n \n In fact, it is in contrast to generally accepted biological rules (life does NOT come from nonliving matter). \n\n Well, it HAD to. How else did it get here?\n Even in the genesis myth, life came from non-life.\n \n \nPersoanlly, I think both sides are wrong. I think that the evolutionists have fallen prey to the arrogance of the soft sciences. In striving to understand something, they have taken a relatively small body of evidence, made up a big story around it, and told themselves \"we know it all now\" rather than accepting that their explanation may not be entirely correct.\n\n No scientist I've ever known or ever heard of says \"we know it all now.\"\n I think there was this strange atmosphere in physics around the turn of the century. Some of them thought that they were close to having all of physics figured out and the rest was just filling in the details. How wrong were they? But this was not a mojority of physicists who thought this.\n \n Anyway, any person who says \"we know it all\" is not a good scientist.\n \n \n \n I personally cannot find fault witht he intelligent design folks who feel that god guided evolution\n\n Is there scientific evidence for this?\n \n \n since to disprove this you essentially have to disprove the existance of god\n\n But no one is trying to disprove it.\n \n But, the burden of any proof is on those making a positive claim.\n \n Unless there is a way to test for a designer, intellegent design is not science.\n \n \n \n \nand nobody has ever managed to do so (though the concept of an invisible man in the sky is a little silly).\n\n \n But it, along with the uranian tapeworm hypothesis, is just as valid as intellegent design as a hypothesis. Actually, the uranian tapeworm hypothesis,. as far fetched as it may be, is more testable than a supernatural designer.\n \n I think maybe the kids SHOULD be taught intellegent design as an example of pseudo-science. Hopefully they will see why it is not science and why evolutionary theory is.", 
   {}, 
   116809, 
   null, 
   1115245740.0
  ], 
  [
   116839, 
   null, 
   "sinjin", 
   "To allow any mention of ID in science class is acquiescence to superstition IMO. If you wish to study mythology, take an anthropology class.", 
   {}, 
   116834, 
   null, 
   1115246340.0
  ], 
  [
   116852, 
   null, 
   "Mucusaur", 
   "Teach the theory with the least holes.", 
   {}, 
   116839, 
   null, 
   1115247660.0
  ], 
  [
   116882, 
   null, 
   "daewoo", 
   "Teach the theory with the least holes.\n\n \n That is what both sides are proposing here. Nobody proposes that they stop teaching evolution, or that we start teaching creationism. The ID folks are merely advocating teaching that there ARE holes in the evolutionary theory that are filled with conjecture that are not entirely based on empirical evidence. \n \n Personally I think that this is the best policy for all science. I can certainly forsee, and find past cases, where new discoveries have esssentially been ignored because the sicentist at hand disregarded their own observations because it went against a \"fact\" that they knew that was actually well established conjecture.\n \n Much of this has to do with arrogance in the scientific community. Much of what we \"know\" we do not necessarily really \"know\", we just higly suspect beased on the evidence at hand. It has been this way for thousands of years. Old \"facts\" have been tossed out as new discovery replaces them. It seems that we should be doing our best to produce broad minded young scientists, not workign to protect the ego of the ones we already have.", 
   {}, 
   116852, 
   null, 
   1115251020.0
  ], 
  [
   116904, 
   null, 
   "Close_slave_can", 
   "I would find the following revision acceptable if you replaced word \"EVOLUTION\"\n with the phrase \"anything you are taught\" \n \n \n\n 2. Revisions to 7th Grade Standard 3, BM 5 (dealing with evolution) (page 8). A minor addition\n to a teachers note seeks to makes it clear that EVOLUTION is a theory and that the observed facts\n may not always be consistent with its explanations and predictions.\n \n\n \n \n \n \n \n And here is a revision I don't understand but I think it is rather suspect. Could someone explain it further?\n \n\n 4. 12th Grade, Standard 3, Benchmark 2, dealing with DNA and the genetic code (page 14).\n This suggestion will have students understand that the order of the nucleotide sequences within\n genes is not dictated by any known chemical or physical law, a fact critical to evolutionary theory\n and the origin of life.\n \n\n \n is it saying that evolution cannot expressed in the same way as newtons laws or laws of chemistry?", 
   {}, 
   116882, 
   null, 
   1115254260.0
  ], 
  [
   116960, 
   null, 
   "pandion", 
   "Intellignet design seems to have a large following. The fact that somebody believes in intellient design does not necessarily mean that they disagree with evolution. A lot of folks (I would say the majority) view it as evolution used as a vehicle for intellient design (basically \"god planned it and made it all happen\").\n\n Now you've ruined it! You're not supposed to mention god. That's the whole idea. ID is stealth creationism. XXXXXX pretend that there is some scientific basis for the assertion that there is some sort of magical designer that is responsible for everything, but they don't say it's god. If they did that, then ID would be religion and introducing it into schools would be unconstitutional.\n \nThe movement to teach YEC is non existant.\n\n Right. It was thrown out of schools back in the 1960s, and again in the 1980s when attempts were made to dress creationism up in the jargon of science and call it \"Creation science.\"\n \nCreationism does not necessarily=YEC. The YEC crowd is their own little clique of scientific illiterates.\n\n But most creationists are YECs. The word has taken on bad connotations so it sounds a bit sour to call a theistic evolutionist a \"creationist.\" The most usual use of the word is as the name of someone who believes that the Bible is literal, including creation in 6 days, Adam and Eve in a magic garden, and a global flood. Someone who relieves in God but recognizes that much of the Bible is composed of moral tales and the mythology of the ancient Hebrews isn't really a \"creationist.\" I guess we could run down the list of degrees of creationism from flat earth to theistic evolution if you want.\n \nI have been on the local board of education for 2 years now and have never heard the phrase \"Young Earth Creationists\" in any official capacity, nor has anybody ever suggested that it be taught.\n\n Of course not. That battle has already been lost. Creationism is religion and it cannot be taught in a science class, even when it is called \"creation science\" and the data is distorted and mininterpreted. The most recent attempt by creationists in Kansas on the State Board (and yes, they were YECs) was to eliminate all requirements to teach evolution, and all references to an old earth from all curriculum standards.\n \nI had no idea what a \"young earth creationist\" was until I read it on this board, 6 months ago. It is simply not an issue, and I am right in the middle of Kansas.\n\n But you have heard of ID, right? And you think that ID - pushed by the Discovery Institute - is somehow science?\n \nYEC really sin't an issue here.\n\n If anyone is pushing ID, YEC is an issue. ID as a \"foot in the door\" maneuver in an effort to teach science. The problem is that most school boards are made up of Christians who think that their religion is somehow supported by science, and they don't see the harm in teaching their idea of god as science. You seem to fit that picture pretty well.\n \nHere is a link to what everybody is up in arms about,...\n\n And justifiably. If you don't see the problem, then you are the problem. The proposed revisions is typical YEC banter about \"evolution is a theory\" - without making it clear what a theory is. \"Teach all sides of the question.\" That's code for teaching \"creation theory\" or ID. Does that mean that in geography class the teachers should present a flat earth as a reasonable alternative? How about the earth as the center of the universe? No? I am all for teaching well supported theories that are not in agreement with the mainstream, but ID or creationism aren't them.\n \nThey are not talking about actually teaching creationism in the classroom, nor is there actually any discussion about not teaching evolution.\n\n Not this time. That was the previous attempt by the good people of Kansas.\n \nWhat they want is to write into state guidelines requirements that kids have to be told that there are other theories out there, and there are holes in the theory of evolution.\n\n What other theories? Why mention them if you aren't going to explain them? You are actually on a board of education? I notice there was no mention of telling kids that there are other theories of gravity and that all of them have holes. Evolution is a more secure theory than gravity.\n \nPersonally, I see no problem with this, and it has more or less been our unofficial policy for years around here. There are holes in the theory of evolution, and there are segments of it that are mostly conjecture.\n\n Nonsense. Name the holes and what parts are conjecture? The parts that are conjecture are never, ever taught in a high school biology class. There isn't time. Only major points are covered about which there is no doubt.\n \nIt is in no way as foolish as the YEC theory, or even the strict creationist theory, but there are certianly hole in the theory. We may fill them in the future, but for now, we just have conjecture to fill those holes.\n\n Again, name one that is presented in high school. In fact, name several since you seem to think that there are several. And it really doesn't matter how many times you squeal about how you aren't talking about YEC, you are. You have been duped and you didn't even know it was going on. Why do the people of Kansas elect scientific illiterates to make decisions about science education. Why did they pay a panal of 27 scientists and science educators to write science standards, and then throw them out?\n \nAll they are really pressing for is basically for kids parents to tell their kids AT HOME that god guided evolution without it contrasting directly with what the kids are being taught at school. Personally, I see no problem with this, as long as they stick to the facts in any case. Just glanmcing over the proposed changes, I am not seeing anything that is factually incorrect.\n\n But that is how creationism works - half truth. Evolution is a theory but don't make it quite clear that in science the word theory doesn't mean half-assed guess, as it does in creationism. Check out that little piece of **** that was added to the bottom of the Patterns of Cumulative Change paragraph on page 7. That is pure YEC. And you aren't a YEC?\n \nThe problem is that you have wack jobs and zealots on both sides of the issue. On the one hand, you have the YEC/creationist crowd. Some fo them go off the deep end when you suggest anything but a literal interpetationof Genisis. On the other side, you have the evolutionaist crowd, who predict gloom and doom and a return to the middle ages every time you suggest that we leave some opening for kids parents to attach religous connotation to the issue.\n\n But religion is not a topic for science classes. Teach the science in class and if that presents a problem for your religion at home, perhaps you should think about your religion a bit more critically and realistically. What is being attempted is to cast doubt on well established scientific theory and pretend that magic is a viable alternative.\n \nThe evolutionist zealots are essentially pushig to remove any possible religous connotation from evolutionary teaching. The YEC folks want to remove any reference to science from the debate.\n\n Of course evolutionists want to remove any possible religious connotation from evolutionary teaching. Evolution isn't science and to introduce religion has been found unconstitutional several times. And you are actually on a school board making decisions about what children are taught? How sad.\n \nNormal folks, people who are not just trying to **** on somebody elses religon or force their religon down somebody elses throat seem to be pushing for a secular and neutral classroom. This is not an unobtainable goal.\n\n But it is OK to teach your religion in public school classrooms? Is that what you mean? What about my religion. Is it OK for me to teach it to your children against your will?\n \nIn truth, we could put everything we absolutly know about evolution (have physical proof for) in a box, and it would be a small one.\n\n Actually, we have museums full of evidence. Only a fool talks about scientific proof. On the other hand, we wouldn't need any box for the evidence of creation or ID that you think is OK to teach as science. It doesn't exist.\n \nA large part of th theory is conjecture.\n\n No its not.\n \nTeach the kids what is conjecture and what is not.\n\n We do. We don't even teach the conjecture. And we don't teach superstition. That's why creationism isn't taught.\n \nThis just makes good sense. Teach it how it is, not how you wish it was.\n\n We do. And you are on a school board and you spout creationist **** like that?\n \nHow many hundreds of years have we lost in scientific development because people failed to experiment into areas that were believed to be known?\n\n I don't know. But that was back in the days when science was controled by the churches.\n [\nHow long idd the theory of spontaneus generation hold prevelance before somebody actually challenged it scientifically?\n\n So what? How long did the idea of magical creation out of nothing in 6 days hold prevelance before somebody actually challenged it scientifically?\n \nNobody is suggesting that creationism be pushed in our classrooms. Nobody is even suggesitng that evolution NOT be taught.\n\n Yes they are. You just have. And dupes like you get elected to our school boards?\n \nThey are suggesting that evolution be taught acuratly.\n\n It is. What do you know about it?\n \nThey want the kids to understand that the theory of evolution certainly has a wide body of evidence behind it, but it also has a substantial amount of conjecture tacked on.\n\n Nope. Not the parts that are taught in high school. The conjecture is mostly at the molecular level these days.\n \nWhile most of the commonly held conjecture certainly fits the evidence at hand, there may be other explanations, explanations we have not even thought of yet, that also fit the evidence.\n\n And none of those explanations have anything to do with a magic being who made everything out of nothing. Science should teach currently held theory.\n \nOne example is the section about the primordial soup theory. Do we actually have any evidence for the existance of \"primordial soup\"?\n\n Yes.\n \nHave we found fossilized soup? Have we ever managed to create such a soup in a lab?\n\n Yes.\n \nHave we ever seen an example of life emerging from a sterile, lifeless environment?\n\n Replicating molecules and lipid membranes have arisen spontaneously in the lab. Functioning viruses have been created from the correct sequencing of nucleic acids. Besides, what are you talking about?\n \nIs there really a difference between this and the theory of spontaneus generation?\n\n Yes. Only the ignorant think not.\n \nIt is just as likely that an alien from uranus landed on premoridalearth, took a dump, and we are all decended from an intergallactic tapeworm.\n\n And that is more likely than a magical being who poofed everything from nothing, don't you agree?\n \nBUT, kansas BOA standards currently have people teaching the primordial soup theiry as if it was proven.\n\n No they don't. I've read them.\n \nIt is not. It is baseless conjecture. In fact, it is in contrast to generally accepted biological rules (life does NOT come from nonliving matter).\n\n Why are you dishonest enough to claim that you aren't trying to get YEC into the schools.\n \nPersoanlly, I think both sides are wrong. I think that the evolutionists have fallen prey to the arrogance of the soft sciences. In striving to understand something, they have taken a relatively small body of evidence, made up a big story around it, and told themselves \"we know it all now\" rather than accepting that their explanation may not be entirely correct.\n\n But then, you are obviously scientifically illiterate. Why don't you think that the panal of scientists who were hired to write the standards know better than you? It is, after all, their field.\n \nthe evolutionists ont he other hand (YECs anyway)....well, that one is a no brainer. I personally cannot find fault witht he intelligent design folks who feel that god guided evolution, since to disprove this you essentially have to disprove the existance of god, and nobody has ever managed to do so (though the concept of an invisible man in the sky is a little silly).\n\n Right. Spoken like a true YEC. In other words, you want the state to teach your religion in science class. Why the dishonest posing? Why don't you explain to us how your religious mythology is science? If you get to teach your religion, can I teach mine?", 
   {}, 
   116809, 
   null, 
   1115263200.0
  ], 
  [
   116961, 
   null, 
   "daewoo", 
   "I would find the following revision acceptable if you replaced word \"EVOLUTION\"\n with the phrase \"anything you are taught\" \n\n \n EVERYTHING else in there is worded as so already with the exception for mathematics and english. The soft sciences sections all have these little \"disclaimers\" in them. The section dealing with evolution did not because several years ago a bunch of folks threw a hissy fit (last time the guidelines were revised in their entirety) and basically got an exception for evolution. What they are proposing is removing that exceptions to bring the evolution curriculem in line with the academic standards of the other coursework. I see nothing wrong with this. The guidleines were revised last time because a bunch of the same folks in the scientific community who are now fighting to keep the exemption for evolution made the same argumetn I did above as far as what we really know and what we think we know. it ws an attempt to stop the \"everybody tastes like chicken\" phenomenon on our colleges where you end up with a bunch of intellectual inbreds running around. \n \n \nAnd here is a revision I don't understand but I think it is rather suspect. Could someone explain it further?\n \n is it saying that evolution cannot expressed in the same way as newtons laws or laws of chemistry?\n\n \n Don't really know. I am meeting with our science advisor on friday for clarification on a lof of this stuff.", 
   {}, 
   116904, 
   null, 
   1115263260.0
  ], 
  [
   117023, 
   null, 
   "pandion", 
   "And here is a revision I don't understand but I think it is rather suspect. Could someone explain it further?\n \n4. 12th Grade, Standard 3, Benchmark 2, dealing with DNA and the genetic code (page 14). This suggestion will have students understand that the order of the nucleotide sequences within genes is not dictated by any known chemical or physical law, a fact critical to evolutionary theory and the origin of life.\n\n is it saying that evolution cannot expressed in the same way as newtons laws or laws of chemistry?\n\n I saw that too. It is a blatant lie in an effort to make it seem reasonable that the nucleotide sequences are designed by some magical being. daewoo has claimed that he doesn't see anything that isn't true in the changes, but it is half truth.\n \n Here's the deal. It is true that the sequence of the nucleotides is not determined by any chemical or physical law. But that sequence determines what amino acids are sequenced into the structure of a protein. If you are interested, I can give you the specific protein encoded by all 64 possible codons formed by the nucleotides (4 bases combined in sequences of 3). I can also give you some information about histones, exons, introns, promoters, enhancers, transcriptase, tRNA, mRNA, RNA polymerase, nuclease, and so on. But none of that is taught in a high school biology course. And questions about \"laws\" that determine the sequence of bases aren't either. In the first case, it is because it is advanced information only covered in college courses on molecular biology. In the later, because there really isn't any evidence of such laws and it is an irrelevant question therefore.\n \n But the real lie is the statement that the absence of such laws is \"...a fact critical to evolutionary theory and the origin of life.\" Such deceit makes it seem that the absense of such laws somehow make evolutionary theory doubtful, when in fact, if the sequence were governed by \"laws\", then evolution would not occur.\n \n No deceit is too great if creationists can manage to get their religion into a science classroom. In a previous attempt, the Kansas Board deleted any mention of evolution from the biology standards, and any mention of an old earth from the earth science standards. Do you think that their objections were based on any rational science? Do you think that their objections were based on some noble desire that opposing \"theories\" be presented?\n \n I'm sure that you noticed that daewoo doesn't see a problem in presenting his religion in science classes. But does he have a problem with mine? Yours? How about Buddhism, Shintoism, Wicca? Don't these also need to be presented as \"alternative theories?\"\n \n My bet is that daewoo is lying to us. He states that he doesn't see a problem with tailoring science instruction so that it doesn't conflict with his religion. Is he also willing to tailor science or any other instruction so that it doesn't conflict with anyone's religion? I doubt it.\n \n daewoo is just pleading a variation of the \"equal time\" idea that was declared unconstitutional by the Supreme Court so many years ago. In my opinion, the best scientific theories should be taught in science classes. If daewoo has a problem with the scientific view of his god as presented in biology classes, then possibly he should look into one of the text books written by Miller and Levine. Dr. Miller is a professor of biology at Brown University and a Christian. Dr. Levine is a Jew with degrees in biology from Tufts University, Boston University, and Harvard. He is a marine biologist. He is also an advisor to NOVA, and has taught at Boston College and Boston University. Both of these men are \"creationists\" by daewoo's definition. They believe in God who created all things. Both of these men teach biology without any attempt to inject religion.", 
   {}, 
   116961, 
   null, 
   1115274180.0
  ], 
  [
   117033, 
   null, 
   "Belial51", 
   "\n \n Pretty soon, the policy will be nationwide. Pretty soon, all highly technical jobs will be exported so that we can all praise the lord as we fall to third world status.\n\n \n Don't count on it. The number of scientists in the American scientific community that subscribe to creationism is about %5, based upon a relatively recent poll. I will try to dig it up.\n \n Also, calling most Kansas residents stupid for voting in Christian Board of Education members is ridiculous. Religious views are almost never even mentioned in local politics. At the most, you see perhaps a flyer that says \"Vote ______\". The Christians who want to teach Intelligent Design in schools are an extreme minority that the media, in all its story-searching rating-mongering glory, is blowing out of proportion.", 
   {}, 
   115622, 
   null, 
   1115275560.0
  ], 
  [
   117096, 
   null, 
   "Close_slave_can", 
   "@daewoo\n If you have disclaimers about EVERYTHING except mathematics,english and \n evolution that is quite wrong and the disclaimer should be replaced with the \n following disclaimer not putting evolution on a pedestal. The vast majority \n of statements by humans cannot be proven to be 100% true and accurate with \n the exception of mathematical arguments which are true by definition but \n rarely perfectly model the real world. There are also subjects such as poetry \n which are not supposed to be judged as true or false. \n \n \n \n As a seperate issue why are you calling evolution a soft science? what does \n this mean and what is the criteria? Is quantum mechanics a soft science? \n Newtons laws are not totally true and you can use them to predict scenarios \n where objects end up going faster than the speed of light and nothing strange \n happens is this a soft science?", 
   {}, 
   117033, 
   null, 
   1115295180.0
  ], 
  [
   117102, 
   null, 
   "trebor", 
   "Don't count on it. The number of scientists in the American scientific community that subscribe to creationism is about %5, based upon a relatively recent poll. I will try to dig it up.\n \n Also, calling most Kansas residents stupid for voting in Christian Board of Education members is ridiculous. Religious views are almost never even mentioned in local politics. At the most, you see perhaps a flyer that says \"Vote ______\". The Christians who want to teach Intelligent Design in schools are an extreme minority that the media, in all its story-searching rating-mongering glory, is blowing out of proportion.\n\n \n \n And, what percentage is that? How was the poll conducted? Who conducted it? How was the determination made about who was a 'scientist'?", 
   {}, 
   117033, 
   null, 
   1115296680.0
  ], 
  [
   117295, 
   null, 
   "daewoo", 
   "I saw that too. It is a blatant lie in an effort to make it seem reasonable that the nucleotide sequences are designed by some magical being. daewoo has claimed that he doesn't see anything that isn't true in the changes, but it is half truth.\n\n \n Again, as I said before, I do not understand that part or the implications. I will probably not until friday, when we meet with our science guy.\n \n \nBut the real lie is the statement that the absence of such laws is \"...a fact critical to evolutionary theory and the origin of life.\" Such deceit makes it seem that the absense of such laws somehow make evolutionary theory doubtful, when in fact, if the sequence were governed by \"laws\", then evolution would not occur.\n\n \n Which is why I am meeting on friday for a better explanation. It seems to me that the statement can be viewed in two lights, but I am not sure which, if either, is correct. I spoke with out high school biology teacher, who said that WOULD impact curriculum, which implies to me that iot is being taught at some level.\n \n Pandion, you do realise that the kids never see the curricululm outline they are modifying here, right?\n \n \nNo deceit is too great if creationists can manage to get their religion into a science classroom. In a previous attempt, the Kansas Board deleted any mention of evolution from the biology standards, and any mention of an old earth from the earth science standards. Do you think that their objections were based on any rational science? Do you think that their objections were based on some noble desire that opposing \"theories\" be presented?\n\n \n When was this? IT NEVER HAPPENED. I assume you are talking about back in 1999, when they increased evolutionary curriculum five fold? What they did in '99 was remove the requirement that macro evolution be taught. They have never removed old earth (that just sounds stupid) from earth science standards,\n \n \nI'm sure that you noticed that daewoo doesn't see a problem in presenting his religion in science classes. But does he have a problem with mine? Yours? How about Buddhism, Shintoism, Wicca? Don't these also need to be presented as \"alternative theories?\"\n\n \n I have no religion.\n \n \nMy bet is that daewoo is lying to us. He states that he doesn't see a problem with tailoring science instruction so that it doesn't conflict with his religion. Is he also willing to tailor science or any other instruction so that it doesn't conflict with anyone's religion? I doubt it.\n\n \n Again, I have no religion. My primary concern is in ensuring that our kids are working form a factual curriculum.\n \n \ndaewoo is just pleading a variation of the \"equal time\" idea that was declared unconstitutional by the Supreme Court so many years ago. In my opinion, the best scientific theories should be taught in science classes. If daewoo has a problem with the scientific view of his god as presented in biology classes, then possibly he should look into one of the text books written by Miller and Levine. Dr. Miller is a professor of biology at Brown University and a Christian. Dr. Levine is a Jew with degrees in biology from Tufts University, Boston University, and Harvard. He is a marine biologist. He is also an advisor to NOVA, and has taught at Boston College and Boston University. Both of these men are \"creationists\" by daewoo's definition. They believe in God who created all things. Both of these men teach biology without any attempt to inject religion.\n\n \n Again, I have no religion.", 
   {}, 
   117023, 
   null, 
   1115318040.0
  ], 
  [
   117298, 
   null, 
   "daewoo", 
   "Don't count on it. The number of scientists in the American scientific community that subscribe to creationism is about %5, based upon a relatively recent poll. I will try to dig it up.\n \n Also, calling most Kansas residents stupid for voting in Christian Board of Education members is ridiculous. Religious views are almost never even mentioned in local politics. At the most, you see perhaps a flyer that says \"Vote ______\". The Christians who want to teach Intelligent Design in schools are an extreme minority that the media, in all its story-searching rating-mongering glory, is blowing out of proportion.\n\n \n \n EXTREME minority. Pandions ascertations are rediculous. \n \n In the end, the decision will be made based on the accuracy of the proposal, nothing else.\n \n Back in 1999 when they removed macro evolution from the curriculum requirements, they did so because their science advisory board, a board composed of college professors from our state colleges, including a couple of folks who are cinsidered some fo the top biologists in the world, told them unanimously that while macro evolution was the best theory we currently have, it may be wrong. Apparently while there is a huge amount of data and emprical evidence to support micro evolution, the same body of evidence does not necessarily prove macro evolution.\n \n \n Panion is simply a zealot on the other side of the issue from the YEC folks. He/She sees gloom and doom for anybody that dares approach the theory. This kind of thinking is what sets us back to the middle ages. If we do not present the holes and weak spots in the theory, how are they ever going to be filled?", 
   {}, 
   117033, 
   null, 
   1115318520.0
  ], 
  [
   117324, 
   null, 
   "trebor", 
   "EXTREME minority. Pandions ascertations are rediculous. \n \n In the end, the decision will be made based on the accuracy of the proposal, nothing else.\n \n Back in 1999 when they removed macro evolution from the curriculum requirements, they did so because their science advisory board, a board composed of college professors from our state colleges, including a couple of folks who are cinsidered some fo the top biologists in the world, told them unanimously that while macro evolution was the best theory we currently have, it may be wrong. Apparently while there is a huge amount of data and emprical evidence to support micro evolution, the same body of evidence does not necessarily prove macro evolution.\n \n \n Panion is simply a zealot on the other side of the issue from the YEC folks. He/She sees gloom and doom for anybody that dares approach the theory. This kind of thinking is what sets us back to the middle ages. If we do not present the holes and weak spots in the theory, how are they ever going to be filled?\n\n \n \n I would have to say that whoever told you about 'macro-evoution' from a science perspective obviously did not explain things properly. It sounds like your 'science advice' was either misunderstood or the advice was 'stacked'.", 
   {}, 
   117298, 
   null, 
   1115320320.0
  ], 
  [
   117331, 
   null, 
   "Master_Shake", 
   "Also, calling most Kansas residents stupid for voting in Christian Board of Education members is ridiculous.\n\n I am from Kansas and resent (pandion) being called stupid simply for living here.\n That being said, the people who voted for these school board folks do deserve to be called stupid. Well they would if they had much of a choice. I can't say this for sure, but knowing Kansas politics, I would say that, chances are, there was only one person on the ticket and if there were more, they probably all held the same views on evolution. That's most of Kansas for ya. As a Missourian once said about Kansans: You'd vote for a cupcake if it registered republican.\n There is an exception to this rule though. After the first evolution debacle back in '99, Kansans voted those dimwits out and put in a new board that changed what the previous board had done. It just seems that some people have a very short memory.\n Why must these XXXXXX stain Kansas again? :xcensored \n \n \nThe Christians who want to teach Intelligent Design in schools are an extreme minority that the media, in all its story-searching rating-mongering glory, is blowing out of proportion.\n\n \n I don't know that they are as small a minority as you are trying to say here, but even if they were, they are in a position of power. So the media isn't blowing this out of proportion. It doesn't matter if a group is a minority if they are in power. Should Iraq have not been in the news before the war because the minority was in power there? A crude anology I know, but you get the point.", 
   {}, 
   117033, 
   null, 
   1115320800.0
  ], 
  [
   117340, 
   null, 
   "gnojek", 
   "Here's the deal. It is true that the sequence of the nucleotides is not determined by any chemical or physical law. \n\n \n What do you mean by \"determined by\" ?\n \n The sequence of nucleotides in nucleic acids must have originated in physical laws. Everything does.\n \n \nI can also give you some information about histones, exons, introns, promoters, enhancers, transcriptase, tRNA, mRNA, RNA polymerase, nuclease, and so on. But none of that is taught in a high school biology course. \n\n It was in mine.\n \n \n \n \n if the sequence were governed by \"laws\", then evolution would not occur.\n\n \n Where do you get this?\n Everything that happend in the universe happens according to \"laws.\"\n \n\n \n daewoo is just pleading a variation of the \"equal time\" idea that was declared unconstitutional by the Supreme Court so many years ago. \n\n \n I'm starting to like the idea.\n If students are taught the basis of science first,\n they will see that ID and creationism aren't science.", 
   {}, 
   117023, 
   null, 
   1115321460.0
  ], 
  [
   117358, 
   null, 
   "pandion", 
   "When was this? IT NEVER HAPPENED. I assume you are talking about back in 1999, when they increased evolutionary curriculum five fold? What they did in '99 was remove the requirement that macro evolution be taught. They have never removed old earth (that just sounds stupid) from earth science standards,\n\n You're kidding, right? You actually live in Kansas and you actually got yourself elected to a school board and you are unfamiliar with the efforts of creationists on the Kansas Board of Education to remove the teaching of evolution from the science standards?\n \n You are telling a lie. Maybe you have been duped by creationists and don't know that you are. A committee of 27 scientists and science educators was hired to rewrite the science standards. There were several drafts that were all presented to the board. When the final draft was presented, it was rejected and replaced by a version that had been put together by a YEC (a geocentrist no less) from Missouri. The adopted standards did not increase the evolutionary curriculum. The standards very clearly touted YEC ideas, barely mentioned even macro-evolution, and removed all references to the age of the earth and the universe. I know that sounds stupid, but then I don't live in Kansas where school board members think that limiting mention of evolution to microevolution is smart.\n \n I read the proposed standards and the ones that were adopted. At the next election several creationists lost their seats, and the new school board threw out the \"new standards\" and adopted the version that had been written by the committee. Those standards probably actually did raise the levels of what was expected to be taught in Kansas schools from one of the worst in the nation to one of the best. You were aware that the Ford Foundation had funded a study of state science standards and Kansas had received an F. The creationist standards also received an F, and the standards written by the committee of scientists and educators received an A.\n \n You know, it almost would have been fun to be a biology teacher in Kansas when micro-evolution was OK and presentation of \"holes\" in the theory were required. I could have probably gone on for a week or two about the problems presented to the Biblical flood story from a biological standpoint. Noah's flood requires macro-evolution. Not only that, it requires macro-evolution at rates that make the heads of evolutionary biologists spin. Just think - about 6 different species of horse, unknown numbers of cattle species, 36 different species of cat, twenty some species of the wolf/dog \"kind\" and so forth. What fun to be required to teach \"alternative\" theories in that case.\n \n Scientific Community Unites Against Kansas Board of Education Evolution Decision\n \n Kansas Board Votes To Bar Evolution From Classroom", 
   {}, 
   117298, 
   null, 
   1115322300.0
  ], 
  [
   117361, 
   null, 
   "pandion", 
   "Everything that happend in the universe happens according to \"laws.\"\n\n Do you have to work at becoming so scientifically illiterate? What ever happened to the creationist chant about evolution being a product of pure chance? You seem to chant all of the other creationist tripe.", 
   {}, 
   117358, 
   null, 
   1115322540.0
  ], 
  [
   117428, 
   null, 
   "daewoo", 
   "I would have to say that whoever told you about 'macro-evoution' from a science perspective obviously did not explain things properly. It sounds like your 'science advice' was either misunderstood or the advice was 'stacked'.\n\n \n Actually what sank that debate was a bunch of paleontologists from K state who started arguing for punctuated equilibrium. That was pretty much the end. I remember one board member was quoted as saying \"These are public schools. We are luck if we can teach the kids to read\"", 
   {}, 
   117324, 
   null, 
   1115330220.0
  ], 
  [
   117430, 
   null, 
   "daewoo", 
   "Do you have to work at becoming so scientifically illiterate? What ever happened to the creationist chant about evolution being a product of pure chance? You seem to chant all of the other creationist tripe.\n\n \n You mis-cited me here. I didn't say that.....it was gnojek", 
   {}, 
   117361, 
   null, 
   1115330340.0
  ], 
  [
   117442, 
   null, 
   "gnojek", 
   "Do you have to work at becoming so scientifically illiterate? What ever happened to the creationist chant about evolution being a product of pure chance? You seem to chant all of the other creationist tripe.\n\n \n How did that happen? I think you quoted me and put daewoo's name on there.\n \n \n \n Please inform me of something in this universe that doesn't obey physical laws.", 
   {}, 
   117361, 
   null, 
   1115331240.0
  ], 
  [
   117444, 
   null, 
   "daewoo", 
   "I am from Kansas and resent (pandion) being called stupid simply for living here.\n That being said, the people who voted for these school board folks do deserve to be called stupid. Well they would if they had much of a choice. I can't say this for sure, but knowing Kansas politics, I would say that, chances are, there was only one person on the ticket and if there were more, they probably all held the same views on evolution. That's most of Kansas for ya. As a Missourian once said about Kansans: You'd vote for a cupcake if it registered republican.\n There is an exception to this rule though. After the first evolution debacle back in '99, Kansans voted those dimwits out and put in a new board that changed what the previous board had done. It just seems that some people have a very short memory.\n Why must these XXXXXX stain Kansas again? :xcensored \n\n \n I think what people fail to realise is that the state school board in kansas does nto have the same power as school boards in other states. In ks, our state schoolboard is a buch of twits who seem to want to make life difficult for local schoolbord memebrs who have to field calls from parents concerned about the action of the state board, and they have to be continually assured that it will not have any effect on their childs education at a local level.....nobody actually reads that **** anyway.\n \n You can point the following facts out to those who tell us we are XXXXXX in kansas who do not know how to run our schools:\n \n ACT Scores: Kansas has the 8th highest national scores; the highest combination of scores and percentage of students tested. (2000 scores)\n \n SAT Scores: Kansas has the 5th highest scores nationally. (1998 scores)\n \n NAEP Reading Scores: National Assessment of Education Progress. Only one state had a higher average score and percentage of students at or above proficient level than Kansas for fourth grade; only two states scored higher at eighth grade.\n \n \n There is a lot of stuff that pandion is saying \"you don't learn in high school\" that my teachers tell me they are teaching. Then again, we also rank first when it comes to introducing college level curriculum to in our high schools. \n \n Maybe that is another reason that this is an issue brought up in kansas. Besides the fact that it is incredibly easy to get somethign in front of the school borad, the fact that we are covering more adcvanced curriculum might make this an isse.\n \n Youw ne tot the shawnee mission school district, which was THE highest ranked distict int he coutnry for 18 years running. Maybe we should mirror the KCMO school district, then there would not be these debates in Ks. I know a teacher in kansas city missouri (a biology teacher no less) who essentially says the same thing that pandion does....that they do not teach these things in high school. \n \n If we turned out dumber kids, and wrenched control away fro local schoolboards and parents, we could probably turn out kids that are as dumbn as california kids, or illinois kids, or maybe, with the addition of mandatory labotomies, we could turn out kids as dumb as washington DC kids. THEN, we would not have such debates,. \n \n \n \n \n \n I don't know that they are as small a minority as you are trying to say here, but even if they were, they are in a position of power. So the media isn't blowing this out of proportion. It doesn't matter if a group is a minority if they are in power. Should Iraq have not been in the news before the war because the minority was in power there? A crude anology I know, but you get the point.[/QUOTE]", 
   {}, 
   117331, 
   null, 
   1115331420.0
  ], 
  [
   117497, 
   null, 
   "Close_slave_can", 
   "@pandion\n \n Although I really dislike the wording of the revisions to the Kansas curriculum I think evolution needs some disclaimers, something along the lines that there has been many individual studies suggesting some evolution happened and it is highly doubtful that every single one is wrong. Are you going to turn on me to and start calling me a creationist liar with a hidden agenda to make everyone stupid? \n \n @daewoo\n Did you explain what you mean by soft science, is quatum mechanics a soft science as well?", 
   {}, 
   117444, 
   null, 
   1115334900.0
  ], 
  [
   118248, 
   null, 
   "pandion", 
   "@daewoo\n \n Here's some information for you. You claimed nobody wanted to stop teaching evolution and replace it with creationism. It seems that you don't pay attention to what is going on in your own state. Actually, I think that you are fully aware of what is going on. Just like the other creationists you pretend that you are interested in the teaching of science when in fact you are interested in the teaching of religion as science.\n \n Here are some words by Kathy Martin, a member of the Kansas Board of Education and one of three members (all creationists) on the subcommittee that is about to hold \"hearings.\" (One star witness next week will be a Turkish Muslim creationist.)\n \nWe are not going to give up until the standards say what we want them to say. Evolution has been proven false. ID is science-based and strong in facts.\n\n I guess I missed where evolution has been proven false. Oh! Wait! That's what she wants the standards to say. She is not claiming it is true. And of course, if ID is strong on facts, why aren't they presented to the scientific community?\n \nMan has changed and evolved, but we are not going to change back into monkeys.\n\n Right. And this is somehow the evil evolution that she is combating? What kind of scientific illiterate would make such a stupid remark? I'll tell you what kind. A creationist who has been well indoctrinated by her creationist masters.\n \n And here's what she said in response to the direct question, \"Is ID a Christian agenda?\"\n \nOf course this is a Christian agenda. We are a Christian nation. Our country is made up of Christian conservatives. We don't often speak up, but we need to stand up and let our voices be heard.\n\n But wait? I thought ID wasn't religion. That's why the Kansas IDers want to call Muslims as witnesses. I guess they can't find qualified American scientists to offer the appropriate religious view.\n \nWhy shouldn't theology be taught in the classroom? Morality ought to be taught in every class. Prayer ought to be allowed. Whenever a child wanted to pray in class, I prayed with them. All children believe in God. Even little children whose parents don't take them to church believe in God.\n\n I wonder if she has actually read the 1st Amendment. At least there is no secret as to what is going on in Kansas. Even daewoo's pretense about listening to advisors before inserting religion into science classes is transparent.\n \n Of course Martin was informed that she has messed up. IDers aren't supposed to admit that it is religion. It isn't supposed to be a matter of Christian agenda (testified to by Muslims). It isn't supposed to be a means of inserting prayer in public school classrooms. Martin later pretended that she was talking about something else - church. I guess she meant church classrooms where prayer is unconstitutional.\n \n Once again the people of Kansas are being made to look like ignorant bufoons by their elected officials. But the people of Kansas elected them.", 
   {}, 
   117497, 
   null, 
   1115478240.0
  ], 
  [
   118265, 
   null, 
   "pandion", 
   "Alhough I really dislike the wording of the revisions to the Kansas curriculum I think evolution needs some disclaimers, something along the lines that there has been many individual studies suggesting some evolution happened and it is highly doubtful that every single one is wrong.\n\n Why is it that you want disclaimers in only one science? Why not disclaimers in physics? \"Individual studies suggest that not all theories of gravity are incorrect. Studies suggest that some gravity happens and it is highly doubtful that every single theory is wrong.\"\n \n How about chemistry? \"Individual studies suggest that not all theories of chemistry are wrong. Studies suggest that some chemical bonding happens and it is highly doubtful that every single theory is wrong.\"\n \n Health class? \"Individual studies suggest that not all theories if disease are wrong. Studies suggest that some diseases are caused by germs and other pathogens and it is highly doubtful that every single theory is wrong.\"\n \nAre you going to turn on me to and start calling me a creationist liar with a hidden agenda to make everyone stupid?\n\n No. You are just scientifically illiterate and rather than learn the basics of science you are allowing yourself to be duped. You are doing the work of the creationist liars who have the agenda to introduce religion into public schools.\n \n I am in favor of introducing any valid theory into science class. The problem is that there isn't much time and there is a lot of material to cover. I have been asking and the creationists and their dupes haven't answered. Generally, only the broadest concepts of evolution are presented in high school classes. None of it is controversial in scientific circles. There isn't time. The controversial stuff is on the leading edges of research. So name one of the theories presented in high school science that is controversial. The first day and frequently throughout the year most teachers that I knew presented the scientific definition of a theory. It worked along with the class material. One class had students try to devise their own explanations for observations that they made in class. The problem with you and daewoo is that you didn't pay attention enough. You came away from high school as scientific illiterates. Thus, you are the people who cause our country to rank at the bottom world wide in the understanding of science and math.\n \n I'm not sure if you are stupid or not. You seem to believe that your opinions merit that label. All I know is that you appear quite ignorant from what you post here.", 
   {}, 
   117497, 
   null, 
   1115483280.0
  ], 
  [
   118304, 
   null, 
   "Beowulf Lee", 
   "I also think we should waste ink by printing in front of every text book, \"Any material coverd in this book might only be a figment of your imagination\". Nothing is the \"absolute truth\". It's unreasonable to remind people that everytime they learn something.", 
   {}, 
   118265, 
   null, 
   1115492160.0
  ], 
  [
   118386, 
   null, 
   "daewoo", 
   "Again, you have read the proposed changes. What you are essentially arguing here is a \"slippery slope\" that you have no evidence for. All you have effectively proven is that there is a wack job on the board of education. So what? There is a wack job in the whitehouse, too. \n \n We met with our scince guy on friday, who reviewed the changes and said there were a couple of areas of concern, but that the proposed changes were by and large factually correct. He was concerned with the same section you expressed concern over, but that will almost certainly be edited anyway.\n \n I have also been told that even if everything passes as written, the curriculum will nto chage at all from a practical standpoint.\n \n Just saw this---\n \n \nI read the proposed standards and the ones that were adopted. At the next election several creationists lost their seats, and the new school board threw out the \"new standards\" and adopted the version that had been written by the committee. Those standards probably actually did raise the levels of what was expected to be taught in Kansas schools from one of the worst in the nation to one of the best. You were aware that the Ford Foundation had funded a study of state science standards and Kansas had received an F. The creationist standards also received an F, and the standards written by the committee of scientists and educators received an A.\n\n \n And yet we manage to score int he top 10 as far as standardized and college entry exams every year for the last 30. Amazing.", 
   {}, 
   118248, 
   null, 
   1115508300.0
  ], 
  [
   118392, 
   null, 
   "pandion", 
   "Except that you are probably unaware that admissions officers at many major universities actually considered refusing to recognize high school diplomas from Kansas high schools. I had breakfast with one during that time and we discussed the problem. The feeling was that Kansas high school students would lack minimum qualifications to pursue degrees at institutions of higher learning. They suggested requiring certain scores on standardized tests (that students from other states would not be required to take) to demonstrate an adequate understanding of science. There was a meeting of such admissions officers (as there is every year) and they were concerned. I don't blame them. Kansas continues to elect officials who attempt to inject their religion into the public schools and other officials who are duped by them and stand by and support it.\n \n ID is religion, just at that stupid Board of Education member admited. But she wasn't supposed to say so. But it seems that she didn't do too much damage to the cause. The dupes are still bamboozled into agreeing that it is only fair to present alternate theories of science without actually asking to see one of those theories presented. The dupes think that the \"theory of ID\" and the \"theory of creation\" have the same scientific status as the theory of gravity, the germ theory, the heliocentric theory, the big bang theory, or the theory of evolution. The dupes don't know that IDers and creationists mean \"theory\" to mean wild-ass-guess. In science the word means as sure as we can be, after lookinig at all of the available evidence, that we have the best explanation.\n \n What you are saying, in effect, is that it doesn't matter that some parts of the proposed standards are dishonest lies, they won't do much damage. You ignore the agenda. This is a foot in the door. \"See? We didn't do much damage. Let's say prayers before class. It won't do much damage.\" And the dupes agree.", 
   {}, 
   118386, 
   null, 
   1115510400.0
  ], 
  [
   118393, 
   null, 
   "Close_slave_can", 
   "Why is it that you want disclaimers in only one science? \n\n \n That is incorrect. In this very thread I said that all subjects should have disclaimers\n This is the third time the by the pandion/ungerdunn/lurch poster has falsely accused me. He called me a creationist liar and now he stops calling me a creationist liar. The fact that he changes his screen name and denies it makes him the liar. The second time pandion gave me a test to show that I was ignorant but one of his abusive comments about my answers was wrong ( I checked many other sources). He did not stay around and apologize he just ran away. \n \n padion your a liar and a coward and you will run.", 
   {}, 
   118265, 
   null, 
   1115511000.0
  ], 
  [
   118394, 
   null, 
   "pandion", 
   "That is incorrect. In this very thread I said that all subjects should have disclaimers\n This is the third time the by the pandion/ungerdunn/lurch poster has falsely accused me. He called me a creationist liar and now he stops calling me a creationist liar. The fact that he changes his screen name and denies it makes him the liar. The second time pandion gave me a test to show that I was ignorant but one of his abusive comments about my answers was wrong ( I checked many other sources). He did not stay around and apologize he just ran away. \n \n padion your a liar and a coward and you will run.\n\n All that was necessary was for you to give me the number of the post in which you suggested puting disclaimers in all subjects. Instead you got a rod up your but and launch into an ad hominem.\n \n You talk like a creationist, so I thought you were a creationist. When you spout creationism, how is is a lie to call you a creationist?\n \n My screen name is another issue that is none of your business.\n \n So you can continue to demonstrate your cowardice and pretend that you aren't a creationist, and you can continue to the ad hominem attacks. Perhaps it would be better if you actually learned what you are talking about in the first place. So I was wrong on one answer? But you still flunked the test and demonstrated your profound ignorance.\n \n You creationists are a mess.", 
   {}, 
   118393, 
   null, 
   1115512140.0
  ], 
  [
   118396, 
   null, 
   "Close_slave_can", 
   "So you admit you were wrong.", 
   {}, 
   118394, 
   null, 
   1115512500.0
  ], 
  [
   118397, 
   null, 
   "pandion", 
   "stickers suggested by Close_slave_can\n \n U.S. History\n \"The events retold in this book may not all be true. There are other opinions worthy of consideration as to who the leaders of our nation were, the events that led to independance, the causes of the civil war, our participation in foreign wars.\"\n \n Health\n \"Not everyone agrees that sanitation and cleanliness are effective in preventing disease. Other views about correct referigeration of foodstuffs are also worthy of equal consideration. The germ theory of disease is never been proven and no one has ever seen a virus cause a disease.\"\n \n Earth Science\n \"Ideas presented in this class are unproven theory only. The idea that the sun orbits the earth has never been proven wrong and careful observation still leads to the logical conclusion the earth is flat.\"\n \n Yeah - great. Rather than do the best job we can of teaching the current views of the best information we have, lets put disclaimers in all text books so that every off the wall opionin is give equal status with experts. That way we can set up our schools to be subject to law suits when their children are given bad grades. Good idea, Close_slave_can. You're so smart.", 
   {}, 
   118394, 
   null, 
   1115513040.0
  ], 
  [
   118398, 
   null, 
   "pandion", 
   "So you admit you were wrong.\n\n Don't remember the test. So you admit that you were so ignorant that you weren't able to answer a few simple questions?", 
   {}, 
   118396, 
   null, 
   1115513100.0
  ], 
  [
   118399, 
   null, 
   "Close_slave_can", 
   "\n So you can continue to demonstrate your cowardice and pretend that you aren't a creationist, and you can continue to the ad hominem attacks. \n\n Nonsense I have been seen to reject creationisim. I swear by all that I hold dear that I am not a creationist. I think god is a fairy tale. The attack was necessary because you were wrong and I you did not have the character to admit it.", 
   {}, 
   118394, 
   null, 
   1115513220.0
  ], 
  [
   118400, 
   null, 
   "Close_slave_can", 
   "Don't remember the test. So you admit that you were so ignorant that you weren't able to answer a few simple questions?\n\n \n You don't remember the test and you are willing to make speculations about it. If you don't remember something then you should not comment about it\n \n any way here is the test. You imply that baldness is a recessive gene exactly like haemophilia and you ignore my comments eigenvalue is which suggests you don't have the tools to give you a complete understanding of the Hardy Weinberg law\n \n Here is the test and my answers\n *************************************\n \n The assertions made about my ability to answer the questions that are clearly wrong\n \n \" you should have no problem in explaining any of the following\"\n \"I notice you cannot answer any of them\"\n \n \n \n ***************************************\n \n The questions asked \n \n ****************************************************\n then you should have no problem in explaining any of the following:\n \n 1) the Hardy-Weinberg Law\n \n 2)name six mechanisms of evolution, 3 that increase genetic diversity and 3 that decrease it\n \n 3)explain the founder effect\n \n 4)explain punctuated equilibria and why it is not the same as saltationism (hopeful monster)\n \n 5) If my wife's father was bald but my wife and her siblings show no signs of baldness, and if my father was not bald and neither of my siblings is but I am, what is the probability the my children will be bald. Please make sure that you address the issue of gender.\n \n 6)What is the funcion of a peacock's tail. The more beautiful the tail, the more difficult it is for the bird to fly and therefore the more difficult it is for it to escape predators (supported by observation and statistical studies). And yet, peacocks with the most beautiful tails produce more offspring (supported by observation, statistical studies and DNA analysis).\n \n 7)Explain the evolutionary principle that explains the extraordinary occurance of Ellis-van Creveld syndrome among the Amish. This syndrom causes dwarfism, polydactylism, and a hole between the two upper chambers of the heart in about 50% of the cases.\n \n *****************************************************\n \n \n My answers\n \n 1)I understand this much better than you do. \n Unless you can describe the necessity of an infinite population in\n terms of finite Markov chains, 1 eigenvalue being 0 and the rest being negative, \n so there is one constant stationary state and any other starting state decays towards\n it exponentially.\n \n 1)recominabation - increase in diversity\n 2)mutation -increase in diversity\n 3)genetic drift -loss of diversity. I can model it with Markov chains and use it to prove the requirement of infinite population for the Hardy weinberg law and I challenge you to do the same. \n 4)natural selection- Genes that reduce you chance of getting to mate do not get passed so in a single generation there is less diversity. \n 5)non-random mating-The same as natural selection for this argument\n 6)gene flow- new species migrate from elsewhere so I would say increase in diversiy\n \n As for the founder effect and the Amish, there were only a few Amish immigrants that migrated initially and they kept to themselves so they had an initial lack of genetic diversity. \n \n As for the peacocks tail I it is something I have thought of often and I used it to come up with my own theory. Consider the Blue whale. In many ways we have more intelligence and a more advanced language than them due to our different brains. However the blue whale never evolved some of our mental abilities even though with its massive size a bigger brain is not such a liability. We evolved a bigger brain even though with our smaller size it takes more of our daily energy intake to run. Now the fact we have hands and opposable thumbs makes our advanced intelligence worthwhile but what about speech? Could there be a peacock tail effect? If our ancestors prefered sexual partners with above average speech centres couldn't our speech centre grow just like the peacocks tail? Under my theory it was a happy coincidence that it kept growing until we got to the stage that we could explain things to our young. If you like this sort of discussion I would recommend Richard Dawkins books. \n \n \n \n As for your question about baldness it seems a bit tedious \n If your wifes father is not bald and none of the wife siblings are bald\n then I would lean towards the assumption that the father in law is XBYb\n and the mother in law is XbXb. However if the wife only has sisters then a possibility is father in law could be XbYB and the probability of a sister being bald is zero. Another possibility is the father in law is XBYb and the mother in law is XBXb because you could have sisters XbXB and brothers XbYb. Am I supposed to assign aribitary possibilities p, q and 1- p - q to each of the three possibilites. As for a man with that is bald who father is not bald then you the Father is XbYb and the existance of a non bald brother would mean the mother would have to be XBXb but again you said sibling and not brother so I would have to assign probabilities t and 1-t the XbYbXBXb and XbYbXBXB", 
   {}, 
   118398, 
   null, 
   1115514780.0
  ], 
  [
   118401, 
   null, 
   "Close_slave_can", 
   "Is pandion going to discuss the test and my answers or will he just say its wrong without explaining. I think he is just going to run.", 
   {}, 
   118400, 
   null, 
   1115515080.0
  ], 
  [
   118409, 
   null, 
   "daewoo", 
   "Except that you are probably unaware that admissions officers at many major universities actually considered refusing to recognize high school diplomas from Kansas high schools. I had breakfast with one during that time and we discussed the problem. The feeling was that Kansas high school students would lack minimum qualifications to pursue degrees at institutions of higher learning. They suggested requiring certain scores on standardized tests (that students from other states would not be required to take) to demonstrate an adequate understanding of science. There was a meeting of such admissions officers (as there is every year) and they were concerned. I don't blame them. Kansas continues to elect officials who attempt to inject their religion into the public schools and other officials who are duped by them and stand by and support it.\n\n \n \n I owuld say eitehr \n \n A- you are a liar or\n B- Your buddy is a reactionary idiot who is completely over-reacting to the situation, like you.\n \n Look into it. Whatever state you ware in, I will bet you that kansas kids consistently scor higher in scince tests than wherever you are. Our education system here is second to none. We keep getting all the flack becase of reactionary FOOLS who jump the gun on stuff like this.\n \n Bad new, 17 other states already include the chages that we are considerng makeing. the differnece is that in kansas, we put it to a public forum as opposed to just writing them in.\n \n I have noticed that no colleges have done as you have said here (nor will they ever, unless somethign drastic changes). At the end of the day, whichever way this goes,kids are probably getting a better education here in kansas than you are providing them.", 
   {}, 
   118392, 
   null, 
   1115516700.0
  ], 
  [
   118416, 
   null, 
   "Close_slave_can", 
   "daewoo \n Did you answer my question about what is a soft science? Is quantum mechanics a soft science?", 
   {}, 
   118409, 
   null, 
   1115517540.0
  ], 
  [
   118419, 
   null, 
   "pandion", 
   "I guess you didn't notice that it wasn't me. And from looking back at the test that you failed, it seems to me that at the time you failed to give an adequate answer to any of the questions. That you have at least made an effort to educate yourself in the time since is to your credit. For example, I notice that you correctly named 6 mechanisms of evolution (question 2) today - but of course, I believe that I have stated those very mechanisms on this board more than once.\n \n Of course, in question #1 you were asked to explain the Hardy-Weinberg Law and you failed to even address it.\n \n Question #3 was wrong because you weren't asked for an example of the founder effect but to explain it. There is more to it than that. It is impossible to discuss the founder effect without mentioning genetic drift, gene flow, and pure chance.\n \n Question #4 you skipped completely.\n \n Question #5 What a tedious answer. You went on and on about demonstrating that you have little idea of what is going on. I asked for a probability and you gave none. The answer should be quite easy since baldness is a sex linked recessive.\n \n Question #6 you babbled on about blue whales and speech. Sexual selection. I notice that your answer didn't even mention fitness.\n \n Question #7 you skipped. How strange that you didn't recognize an example of the founder effect that you couldn't adequately explain.\n \n Now why don't you give me the # of the post where the questions were asked and where you answered them in the first place - like I asked. Did you really give 6 mechanisms the 1st time?\n \n Again, it wasn't me, as any fool can see.\n \n You walk like a creationist and you squawk like a creationist. My guess is...", 
   {}, 
   118401, 
   null, 
   1115517840.0
  ], 
  [
   118437, 
   null, 
   "Close_slave_can", 
   "\n Of course, in question #1 you were asked to explain the Hardy-Weinberg Law and you failed to even address it.\n \n\n \n I said I could understand in terms in eigenvalues. That is the higher level mathematical tool you can use. You clearly don't even know what they are. \n So I do know more about it than you and anyone that google searches eigenvalues, Markov chains and the Hardy Weinberg will see that. \n \n \n\n Question #5 What a tedious answer. You went on and on about demonstrating that you have little idea of what is going on. I asked for a probability and you gave none. The answer should be quite easy since baldness is a sex linked recessive.\n \n \n I infered you question was suggesting baldness was like haemophilia. This makes no sense to me so I was really asking for clarification. Since if males had a probability of x of being bald then females would be bald with frequency (1 -sqrt(1 -x))^2/4 this is clearly not true. \n \n \n\n Question #6 you babbled on about blue whales and speech. Sexual selection. I notice that your answer didn't even mention fitness.\n \n\n Sorry. I proposed that human ancestors that had more developed speech centers were more likely to mate. \n \n \n \n \n\n Again, it wasn't me, as any fool can see.\n \n\n I said you were ungerdunn and you only deny it now because you are on the back foot.", 
   {}, 
   118419, 
   null, 
   1115521080.0
  ], 
  [
   118440, 
   null, 
   "Close_slave_can", 
   "One last thing to finish this debate. Explain the peacocks tail in your own words and I will show you the similar themes that were in my answer and yours. \n \n Tough luck buddy.", 
   {}, 
   118437, 
   null, 
   1115521380.0
  ], 
  [
   118448, 
   null, 
   "Close_slave_can", 
   "\n Question #3 was wrong because you weren't asked for an example of the founder effect but to explain it. There is more to it than that. It is impossible to discuss the founder effect without mentioning genetic drift, gene flow, and pure chance.\n \n\n I understand the \"pure chance\" better than you because you do not even know the connection between \"pure chance\", genes and eigenvalues. I urge people to google search \"eigenvalues genetic drift\" to see that I understand it mathematically much better than pandion. If you have any problems with the math I will explain it to you. Pandion won't be able to unless he spends a few days cramming so questions asked today would be appreciated.", 
   {}, 
   118419, 
   null, 
   1115522280.0
  ], 
  [
   118457, 
   null, 
   "Close_slave_can", 
   "I can't for the life of me work out what the problem is with the baldness thread. Does pandion not realise he should have said male and female siblings instead of just siblings? If you know the properties of both male and female siblings the question is more straight foward.", 
   {}, 
   118448, 
   null, 
   1115523660.0
  ], 
  [
   118466, 
   null, 
   "Close_slave_can", 
   "Whoops I had a formula containing a small mistake I should multiply a quantity by 2. Can pandion spot the mistake? There are actually 2 solutions but why am I only quoting one? \n \n \n Since if males had a probability of x of being bald then females would be bald with frequency (1 -sqrt(1 -x))^2/4 this is clearly not true. \n \n", 
   {}, 
   118437, 
   null, 
   1115525220.0
  ], 
  [
   118474, 
   null, 
   "Close_slave_can", 
   "I did sent pandion an email about this test a while ago and he conveniently did not find it interesting then. He was to cowardly to answer it and give anyone the idea he was ungerdunn. He should have kept those cowardly instincts and not answered this thread because anyone doing some digging can find out his true nature.", 
   {}, 
   118466, 
   null, 
   1115526840.0
  ], 
  [
   118483, 
   null, 
   "pandion", 
   "Boy! Close_slave_can. You've really lost it. Let me count Six posts in response to only one. I wonder why it is that if you actually understand better than I, or the original poster, you can't actually explain the questions? In most cases you didn't even address the questiion asked. So what if you thought that your inquisitor meant something different than a simple sex linked recessive gene. You failed to recognize it and failed to answer the question. That was the point, wasn't it?\n \n And I notice that you haven't shown where you answered the question about 6 mechanisms for evolution in the original exchange. I looked and have been able to find where you did so. Again, congratulations on your research or your reading of other posts on this board to find those.\n \n You missed the target in all other cases. If you were one of my students and answered as you did, you would flunk. Your answers were evasive and showed no understanding of the subject.\n \n So finally, you sent me an email about your exchanges with others, and because I didn't defend them I am a coward. Gosh. If it makes you feel adequate, then continue with your back-biting. So I'm a coward because I found your tantrums silly and had no interest. Well, if I'm a coward then you are a creationist. What a pathetic demonstration of childish whining you have given. I understand that you are embarrassed because you made yourself look like such a fool and you want to get even. So I guess you have selected me. Generally I find your comments without much interest because of the ignorance displayed. Sometimes your ignorance is actually on topic and in those cases I make comment. Otherwise you aren't actually worth the effort.\n \n Have a nice day.", 
   {}, 
   118474, 
   null, 
   1115529660.0
  ], 
  [
   118499, 
   null, 
   "Close_slave_can", 
   "I think the answer your baldness question is that not enough information was given. Give your answer and lets compare. I will never edit this statement so you have the opportunity to embarass me if you give a detailed correct answer with explanation.", 
   {}, 
   118483, 
   null, 
   1115531820.0
  ], 
  [
   118521, 
   null, 
   "pandion", 
   "I think the answer your baldness question is that not enough information was given. Give your answer and lets compare. I will never edit this statement so you have the opportunity to embarass me if you give a detailed correct answer with explanation.\n\n It wasn't my question. I just gave the answer that as I saw it. Honestly, a sex linked recessive gene explains it all. I won't bother to calculate the probabilities for you. The question was really quite elementry and not difficult to anyone who isn't ignorant of basic genetics. It's a question that is covered quite early on in a genetics course. There was quite enough information given unless one is ignorant of the topic.\n \n You're just out of control here. I'm not sure why you have decided to fixate on me in an effort to relieve your rage at being embarrassed because of your ignorance by another poster. I'm done with it. You are no longer discussing, you are in a rabid rage, spewing nonsense in post after post.\n \n I'm done with you. It seems to me that you made assertions and were unable to defend them by showing that you actually understood what you were talking about.\n \n For my part, I see you parrot creationist arguments and then claim that you aren't a creationist.\n \n Squawk on! I'm done with you.", 
   {}, 
   118499, 
   null, 
   1115533440.0
  ], 
  [
   118548, 
   null, 
   "Close_slave_can", 
   "Pandion clearly cannot calculate the probabilities.", 
   {}, 
   118521, 
   null, 
   1115535240.0
  ], 
  [
   118556, 
   null, 
   "pandion", 
   "Pandion clearly cannot calculate the probabilities.\n\n Since the challenge was presented to you and you failed to do so, it seems that you can't. Enough information was presented to make such a calculation. It is actually quite simple and something that is covered in the first week or so of a course in genetics. What a whiner! Since you can't do it you try to make believe that I can't. It is actually an easy question and you are too ignorant to figure it out.\n \n What a bufoon.\n \n More squawking from you and I didn't ignore it as I said I would. You aren't intelligent enough for me to bother with you. I guess I just respond to your pathetic squeeking when you have made yourself look like a fool.", 
   {}, 
   118548, 
   null, 
   1115535540.0
  ], 
  [
   118610, 
   null, 
   "Close_slave_can", 
   "You have made 2 posts stating that the answer is easy but you could not be bothered but they are longer than the answer would be. So it really does seem you cannot calculate the probabilities.", 
   {}, 
   118556, 
   null, 
   1115541120.0
  ], 
  [
   118791, 
   null, 
   "billsco", 
   "Why are scientists boycotting these hearings? It gives the impression they've left the arena unable to answer the ID advocates.", 
   {}, 
   118610, 
   null, 
   1115580180.0
  ], 
  [
   118844, 
   null, 
   "daewoo", 
   "daewoo \n Did you answer my question about what is a soft science? Is quantum mechanics a soft science?\n\n \n Sorry, I thought I had answered this. Looking back, I see I went off in another direction and forgot.\n \n Whether Quantum Mechanics is a soft science or not depends on what you are referring to. Portions of it would seem to be very solid, while there are some mushy theories out there. It is relatively young as far as as actual study goes, so I would say that for the most part, it is just too early to tell. Certain parts CAN be proven by empircal evidence.", 
   {}, 
   118416, 
   null, 
   1115586000.0
  ], 
  [
   118906, 
   null, 
   "Close_slave_can", 
   "If you define evolution as change in allele frequency over time then some changes in allelle frequency have undeniably been observed. Its when you claim eventually you get new alleles then you are entering the realm of the possibly unobserved but I don't think there were many antibiotic resistant bacteria floating around before antibiotics. Also is dealing with a \"soft science\" the same as dealing with history? If so do you give disclaimers about specific ideas such as \"they don't know if gladiators were executed if you saw the signal \"thumbs down\". Or do you give broad disclaimers such as \n \"the romans could have been mythical\".", 
   {}, 
   118844, 
   null, 
   1115596320.0
  ], 
  [
   118909, 
   null, 
   "daewoo", 
   "If you define evolution as change in allele frequency over time then some changes in allelle frequency have undeniably been observed. Its when you claim eventually you get new alleles then you are entering the realm of the possibly unobserved but I don't think there were many antibiotic resistant bacteria floating around before antibiotics. Also is dealing with a \"soft science\" the same as dealing with history? If so do you give disclaimers about specific ideas such as \"they don't know if gladiators were executed if you saw the signal \"thumbs down\". Or do you give broad disclaimers such as \n \"the romans could have been mythical\".\n\n \n \n More along the lines of \"Take nothing for granted\"", 
   {}, 
   118906, 
   null, 
   1115596560.0
  ], 
  [
   118911, 
   null, 
   "Close_slave_can", 
   "Then why does the legislation specifically single out evolution, why not single out the historians that claim rome exists?", 
   {}, 
   118909, 
   null, 
   1115596920.0
  ], 
  [
   118915, 
   null, 
   "daewoo", 
   "Why are scientists boycotting these hearings? It gives the impression they've left the arena unable to answer the ID advocates.\n\n \n They are not. There are a few hard core zealots out there in the scientific community (like pandion) who are boycotting them. For the most part, it looks like there is going to be some good dialog.\n \n Last time, the folks who argued for evolution failed to prepare properly and frankly made a poor showing. The folks this time around (and last time) actually have some big guns in thier corner arguning for these changes. Soem of them are not even creationists, they simply think (like me) that the theory of evolution should be taught, but htat problems, or holes in the thoery that are filled with conjecture should be exposed as such in order to better educate the kids.\n \n The oppostion in this is a group called \"kasas citizens for science\". They are an ad hoc group of mostly laymen. Their scientific staff is composed almost entirely of high school biology teachers. You put these teachers on the stand against real scinetists, and it is a slaughter. Hopefully this time aroun they have some new talent. Last time it was not pretty.\n \n The paleo guys are weighting in as well (yet again).", 
   {}, 
   118791, 
   null, 
   1115597280.0
  ], 
  [
   118923, 
   null, 
   "daewoo", 
   "Then why does the legislation specifically single out evolution, why not single out the historians that claim rome exists?\n\n \n Becuase there is absolutly no question that rome existed. You can go see the ruins. You can read first hand accounts of the existance of rome. the fact that rome existed is non debatable.\n \n What this round of hearings, and the wording changes that they are after, does not provide an exemption to evolution, it removes evolutions exemption. \n \n Wehn we teach gravity theory, the holes/problems associated with it are explained. When black hole thoery is taught, the fact that it is largely conjecture is explained. Evolutionary thoery has been held above such academic honesty requirements.", 
   {}, 
   118911, 
   null, 
   1115597820.0
  ], 
  [
   118927, 
   null, 
   "Close_slave_can", 
   "Becuase there is absolutly no question that rome existed. You can go see the ruins. You can read first hand accounts of the existance of rome. the fact that rome existed is non debatable.\n \n\n \n Sorry I am still unclear. \n Why can't you say that there is no question evolution happened. You can go see the skulls. You can read first hand accounts of scientists about the fact that evolution happened.", 
   {}, 
   118923, 
   null, 
   1115598480.0
  ], 
  [
   118952, 
   null, 
   "daewoo", 
   "Sorry I am still unclear. \n Why can't you say that there is no question evolution happened. You can go see the skulls. You can read first hand accounts of scientists about the fact that evolution happened.\n\n \n There is really no question that evolution happened. The debate is in HOW it happened, and to some extent, why it happened. This is the debate in kansas. Nobody is arguing or suggesting for the exclusion of the teachig that evolution occured. The debate is in the process of evolution. If it was as simple as going and looking at the skulls, there would be no debate. The fossil record is woefully lacking in transitional life form, though. This is why many palentologists argue for evolutionary leaps instead of the gradual evolutionary process that has been written into standard evolutionary theory.\n \n Biologists argue that the mechanisms that are responsible for microevolution can easily be extrapolated to explain macro evolution. Many palentologists argue that while the fossil record is incomplete, it IS complete enough that if small changes take place over thoiusands of years as biologists have suggested, we would have found transitional species, and the evolution of particular lines would be observable in the fossile record. This is not the case. While there is certian evidence in the fossil record that different species share similar traits, we are wholly lacking in actual transitional species. The fossil record shows species emerging fully formed and unchanging until extinction.\n \n This is what cost the evolutionists the last time in Kansas, and why the board decided to remove macro evolution from official curriculum. It was not the creationists that did it, it was the palentologists form KU, as well as several biologists who testified that macro evolution is largely conjecture, since it requires essentially extrapolating the data we have regarding small changes into entire jumps in species. According to the standard evolutionary model, this would have taked thousands of years to accomplish. Accroding to the palentology data we have, including the fact that there is plentiful data available from all ages, that this is not possible. It simply could not have happened the way the evolutionists claim.", 
   {}, 
   118927, 
   null, 
   1115601240.0
  ], 
  [
   118964, 
   null, 
   "fishpower", 
   "Wehn we teach gravity theory, the holes/problems associated with it are explained. When black hole thoery is taught, the fact that it is largely conjecture is explained. Evolutionary thoery has been held above such academic honesty requirements.\n\n \n This may be a bit off-topic, but since you brought it up... I wonder if you could point out which holes you're talking about in relation to gravity and black holes. When I took physics in high school, these holes certainly weren't brought to my attention. Upon further personal study I learned that there is still much we don't understand about how gravity works, but none of that would have affected what I needed to know about it as far as my basic education goes.\n \n Through a course of study, good students will always be able to ask questions. If the question is about gravity or evolution, teachers are always free to say \"We don't know right now. Maybe you can find the answer....\" The unspoken truth about \"pointing out the holes\" in this debate is that in doing so students will somehow gravitate towards \"intelligent design\" instead of evolution.\n \n Incidentally, I'm not sure where you get black holes being \"largely conjecture\" from. There is plenty of solid evidence for their existence. In fact just recently, it was determined that we have a super-massive one at the center of our galaxy. Pretty cool, eh?", 
   {}, 
   118923, 
   null, 
   1115603460.0
  ], 
  [
   118980, 
   null, 
   "Redratio1", 
   "Scientists snub Kansas evolution hearings\n Education hearings rigged, say science organizations\n Sunday, May 8, 2005 Posted: 2222 GMT (0622 HKT) \n \n TOPEKA, Kansas (AP) -- Scientists have refused to participate in state Board of Education hearings this past week on how the theory of evolution should be treated in public schools, but they haven't exactly been silent.\n \n About a dozen scientists, most from Kansas universities, spoke each day at news conferences after evolution critics testified before a board subcommittee. They expect to continue speaking out as the hearings wrap up on Thursday.\n \n \"They're in, they do their shtick, and they're out,\" said Keith Miller, a Kansas State University geologist. \"I'm going to be here, and I'm not going to be quiet. We'll have the rest of our lives to make our points.\"\n \n The scientists' boycott was led by the American Association for the Advancement of Science and Kansas Citizens for Science, which believe the hearings are rigged against the teaching of evolution.\n \n Scientists said they don't see the need to cram their arguments into a few days of testimony, like out-of-state witnesses who were called by advocates of the \"intelligent design\" theory.\n \n snip\n http://edition.cnn.com/2005/EDUCATION/05/08/kansas.evolution.ap/index.html\n \n I feel for these scientists. Trying to explain what science is to people who think they can define it anyway they want to. It is like arguing with someone that a car runs on gas, when they claim it runs on God.", 
   {}, 
   118964, 
   null, 
   1115605260.0
  ], 
  [
   118981, 
   null, 
   "Duo_Maxwell", 
   "I don't know what they are teaching in Kansas, but I recall that my biology classes stressed that evolution wasn't complete, in fact, my teacher had us physically mark to correct the book in several places due to new information. if that doesn't tell you that evolution is changing, i don't know what will.", 
   {}, 
   118980, 
   null, 
   1115605380.0
  ], 
  [
   118985, 
   null, 
   "Redratio1", 
   "Instead of debating whether or not to teach creationism the Kansas board should start teaching a class in philosophy where students can learn the difference between science and metaphysics. \n \n Perhaps then the next generation will have a clue.", 
   {}, 
   118981, 
   null, 
   1115606280.0
  ], 
  [
   118990, 
   null, 
   "daewoo", 
   "This may be a bit off-topic, but since you brought it up... I wonder if you could point out which holes you're talking about in relation to gravity and black holes. When I took physics in high school, these holes certainly weren't brought to my attention. Upon further personal study I learned that there is still much we don't understand about how gravity works, but none of that would have affected what I needed to know about it as far as my basic education goes.\n\n \n That depends on how basic your \"basic\" education was. Here in Ks, our advanced physics class at the high school level are college level classes. Black hole thoery and celestial physics is covered, as well as limited quantum physics.\n \n \nThrough a course of study, good students will always be able to ask questions. If the question is about gravity or evolution, teachers are always free to say \"We don't know right now. Maybe you can find the answer....\" The unspoken truth about \"pointing out the holes\" in this debate is that in doing so students will somehow gravitate towards \"intelligent design\" instead of evolution.\n\n \n ********. Intelligent design is never even to be mentioned. Just like pandion, you are jumping to rediculous conclusions that are wholly unsupprted by the evidence at hand. \n \n \nIncidentally, I'm not sure where you get black holes being \"largely conjecture\" from. There is plenty of solid evidence for their existence. In fact just recently, it was determined that we have a super-massive one at the center of our galaxy. Pretty cool, eh?\n\n \n Black hole theory does not stop with \"do they exist or not\". It extends far beyond that into internal mechanics, quesitons of relativity, etc...\n \n Since we cannot directly observe a black hole, much of this is conjecture. We are learning more as time passes though. Recently we got to \"witness\" the creation of a black hole. Pretty exciting stuff. Additionally, advances in particle accelerationa re answering some questions.", 
   {}, 
   118964, 
   null, 
   1115608620.0
  ], 
  [
   119006, 
   null, 
   "daewoo", 
   "I don't know what they are teaching in Kansas, but I recall that my biology classes stressed that evolution wasn't complete, in fact, my teacher had us physically mark to correct the book in several places due to new information. if that doesn't tell you that evolution is changing, i don't know what will.\n\n \n As did mine. Current state guidelines in kansas essentially prohibit teachers from doing this. What folks like pandion are arguing is essentially \"We know all we need to know....we have got it all figured out. Which is arrogant, rediculous, and childish. Then, these arrogant rediculous folks accuse us in kansas of pushing us into the dark ages by suggesting that holes in the theory that have been filled with conjecture be shown. \n \n I still have my high school biology texts. Our biology teacher took a little different approach and actually typed up and photocopied pages for us to staple into the textbooks (not just in portions regarding evolution). \n \n What the last hearigns boiled own to was the question, posed to the scientists who were pushing to exclude any possibility that current evolutionary theory was not entirely correct, \"is evolution worthy of further study\". They all answered \"yes\". The next question was \"If there are currently no flaws in the thoery, and no room for debate, that would imply that we already know all there is to know. why would we need to study it further?\" That was essentially the showstopper.\n \n What actually killed macro evolution was the fact that the guys they chose to testify were unable to show a single example where we can absolutly say it has happened. Then you got the paleo boys up there, argung for punctuated equilibrium who testified that there was absolutly no evidence in the fossil record to support the \"currently accepted\" (slow change over millions of years) theory of evolution, despite the fact that they believe the fossil record is about 80% complete.\n \n The bottom line is that there are a lot of ananswered questions in the realm of evolutionary theory. Those questions will NEVER find answers if people are unwilling to admit that they even exist.", 
   {}, 
   118981, 
   null, 
   1115610000.0
  ], 
  [
   119013, 
   null, 
   "peddler8111", 
   "As did mine. Current state guidelines in kansas essentially prohibit teachers from doing this. What folks like pandion are arguing is essentially \"We know all we need to know....we have got it all figured out. Which is arrogant, rediculous, and childish. Then, these arrogant rediculous folks accuse us in kansas of pushing us into the dark ages by suggesting that holes in the theory that have been filled with conjecture be shown. \n \n I still have my high school biology texts. Our biology teacher took a little different approach and actually typed up and photocopied pages for us to staple into the textbooks (not just in portions regarding evolution). \n \nGood teacher.\n\n What the last hearings boiled own to was the question, posed to the scientists who were pushing to exclude any possibility that current evolutionary theory was not entirely correct, \"is evolution worthy of further study\". They all answered \"yes\". The next question was \"If there are currently no flaws in the thoery, and no room for debate, that would imply that we already know all there is to know. why would we need to study it further?\" That was essentially the showstopper.\n \n What actually killed macro evolution was the fact that the guys they chose to testify were unable to show a single example where we can absolutly say it has happened. Then you got the paleo boys up there, argung for punctuated equilibrium who testified that there was absolutly no evidence in the fossil record to support the \"currently accepted\" (slow change over millions of years) theory of evolution, despite the fact that they believe the fossil record is about 80% complete.\n\n There is no example to show.\n \n\n The bottom line is that there are a lot of ananswered questions in the realm of evolutionary theory. Those questions will NEVER find answers if people are unwilling to admit that they even exist.\n\n True", 
   {}, 
   119006, 
   null, 
   1115610600.0
  ], 
  [
   119020, 
   null, 
   "peddler8111", 
   "If you define evolution as change in allele frequency over time then some changes in allelle frequency have undeniably been observed. Its when you claim eventually you get new alleles then you are entering the realm of the possibly unobserved but I don't think there were many antibiotic resistant bacteria floating around before antibiotics. Also is dealing with a \"soft science\" the same as dealing with history? If so do you give disclaimers about specific ideas such as \"they don't know if gladiators were executed if you saw the signal \"thumbs down\". Or do you give broad disclaimers such as \n \"the romans could have been mythical\".\n\n Actually there were antibiotic resistant bacteria floating around before anti-biotics. Students from the University of Alberta took samples from the perfectly preserved bodies of members of Captain Franklin's ill fated 1845 expedition to find the Northwest Passage.\n \n The samples proved not only to be resistant to pennicillin but several synthetic anti-biotics as well. They died 90 years before the advent of pennicillin.\n How could that be? Something to think about .", 
   {}, 
   118906, 
   null, 
   1115612280.0
  ], 
  [
   119023, 
   null, 
   "Redratio1", 
   "The samples proved not only to be resistant to pennicillin but several synthetic anti-biotics as well. They died 90 years before the advent of pennicillin.\n How could that be? Something to think about .\n\n \n Not really, it proves nothing. There are ancient bacteria that can withstand high acidity, high temps, high levels or radiation, etc...\n \n Anti-biotic resistant bacteria is to be expected in nature, because anti-biotics are just chemicals deruived from molds. Molds have been around forever.", 
   {}, 
   119020, 
   null, 
   1115612880.0
  ], 
  [
   119036, 
   null, 
   "fishpower", 
   "********. Intelligent design is never even to be mentioned. Just like pandion, you are jumping to rediculous conclusions that are wholly unsupprted by the evidence at hand.\n\n \n Trying to be open-minded here. Have some questions: \n 1) What is the \"evidence at hand\" of which you speak?\n 2) Who are the people/organizations which are trying to change the way evolution is taught? For instance, who represents the different sides of the current debate in Kansas?\n 3) Both you and Duo both seem to be pretty content that you got a balanced view of evolution in your schools. If you believe that your teachers are on par with the majority of biology teachers, then is there in fact a need for this debate at all? Isn't evolution already getting the critical examination it deserves?", 
   {}, 
   118990, 
   null, 
   1115615580.0
  ], 
  [
   119038, 
   null, 
   "Redratio1", 
   " Isn't evolution already getting the critical examination it deserves?\n\n \n The problem is that progress is being reversed. Teaching evolution as \"just a theory\" displays a deep lack of understanding of evolutionary sciences (with an \"S\"). Additionally, trying to pass off creationism as a scientific theory show a severe misunderstanding of what science is in the first place.\n \n So from start to finish the people who are pushing for creationism are wrong. Creationism is metaphysics or theology and best taught in a philosophy or religion class. It has no place next to science.", 
   {}, 
   119036, 
   null, 
   1115616060.0
  ], 
  [
   119045, 
   null, 
   "daewoo", 
   "Trying to be open-minded here. Have some questions: \n 1) What is the \"evidence at hand\" of which you speak?\n\n \n Eairlier in the thread I linked the EXACT changes that are being proposed to the kansas state curriculum. Even Pandion, who is paranoid as hell about such things, could only find one section upon which to comment. There is absolutly NO argument at these hearings about teaching creationism, or removing the teaching of evolution. The ONLY changes being proposed are the ones on the page I linked. There are NO MORE. That is IT.\n \n \n2) Who are the people/organizations which are trying to change the way evolution is taught? For instance, who represents the different sides of the current debate in Kansas?\n\n \n Currently, the \"Discovery institute\" is basivcally the big player on the side fo the revisionists. The other side is basically being presented by a single attornet, who does not plan to call any witnesses. Why? Becuae whenty he same issue was brought in '99, the scientists who testified on the side of the currently accepted theory of evolution, including the \"imporpreity\" of questionign it, were made fools of, much as they were in Ohio 3 years ago. Officially, they are \"boycotting\" the hearings. Unfortunatly, that is a small enough community that word gets around, and we all know why they are boycotting them. \n \n \n3) Both you and Duo both seem to be pretty content that you got a balanced view of evolution in your schools. If you believe that your teachers are on par with the majority of biology teachers, then is there in fact a need for this debate at all? Isn't evolution already getting the critical examination it deserves?\n\n \n I was in high school years ago, before this was ever an issue. In 2001, the liberals in this state put up a massive fight for the school board because they wanted to \"correct\" the \"mistake\" regarding evolution the year before. Under current state guidelines, a biology teacher can NOT do what mine did, or what duos did. What the changes to the guidelines will effectively do is give them back that option at the state level. \n \n From a practical standpoin, the hearings do not mean very much. Decisions like this are really made at the local level, not the state level. It is incredibly easy to get things to the Kansas board of education because they have no real power. They are a worthless, non functioning agency. Whatever decision they make will actually make not one wit of difference as far as what actually goes on in our classrooms. this is an idiotic, idealistic battle.", 
   {}, 
   119036, 
   null, 
   1115617920.0
  ], 
  [
   119106, 
   null, 
   "Clive14", 
   "...The bottom line is that there are a lot of ananswered questions in the realm of evolutionary theory. Those questions will NEVER find answers if people are unwilling to admit that they even exist.\nPerhaps I'm missing something here, or perhaps you are just ignoring a \"difficult question\". Has your school board insisted that students at your school are made aware that gravity is \"just a theory\" and are they made ware of all the holes in the theory of gravity?\n \n No sensible person (and this definitely includes pandion) would ever claim we know all the answers to the theory of evolution. What we do question is why there seems to be a need to single out one scientific theory for constant review and to insist children be taught that this one theory is incomplete. The only answer (assuming it is being singled out) is that the teaching of evolution, in what ought to be one of the most advanced and forward looking nations on Earth, is being hijacked by the fundamentalist nutters again.", 
   {}, 
   119006, 
   null, 
   1115644800.0
  ], 
  [
   119107, 
   null, 
   "Close_slave_can", 
   "This is what cost the evolutionists the last time in Kansas, and why the board decided to remove macro evolution from official curriculum. It was not the creationists that did it, it was the palentologists form KU, as well as several biologists who testified that macro evolution is largely conjecture, since it requires essentially extrapolating the data we have regarding small changes into entire jumps in species. According to the standard evolutionary model, this would have taked thousands of years to accomplish. Accroding to the palentology data we have, including the fact that there is plentiful data available from all ages, that this is not possible. It simply could not have happened the way the evolutionists claim.\n\n \n Exactly what could not have happened the way evolutionists claim?", 
   {}, 
   118952, 
   null, 
   1115644860.0
  ], 
  [
   119110, 
   null, 
   "Close_slave_can", 
   "Eairlier in the thread I linked the EXACT changes that are being proposed to the kansas state curriculum. Even Pandion, who is paranoid as hell about such things, could only find one section upon which to comment. There is absolutly NO argument at these hearings about teaching creationism, or removing the teaching of evolution. The ONLY changes being proposed are the ones on the page I linked. There are NO MORE. That is IT.\n \n\n \n The wording of that legistlation is appalling. Evolution is defined as any change in frequency of alleles not just Darwins theory or punctuated equilibrium. Its like modifying the history curriculum into to saying \"until you build a time machine all history is just conjecture\" or I suppose more accurately it would be like saying \"gravitons have not yet been discovered and these are essential for any theory of gravity no matter how simple. The earth gravity is 9.8 m per second per second? sorry that is just speculation.", 
   {}, 
   119045, 
   null, 
   1115645220.0
  ], 
  [
   119141, 
   null, 
   "daewoo", 
   "Perhaps I'm missing something here, or perhaps you are just ignoring a \"difficult question\". Has your school board insisted that students at your school are made aware that gravity is \"just a theory\" and are they made ware of all the holes in the theory of gravity?\n\n \n Yes. You are missing something. Current academic standards at the state level in kansas require that kids be taught that the theory of gravity has holes in it, and those holes are exposed as those portions are taught. this is one reason that ks high school seniors routinely outscore 2nd yr college students on tests. They are taught \"critical thinking\", which used to be encouraged in science. \n \n \nNo sensible person (and this definitely includes pandion) would ever claim we know all the answers to the theory of evolution. What we do question is why there seems to be a need to single out one scientific theory for constant review and to insist children be taught that this one theory is incomplete. The only answer (assuming it is being singled out) is that the teaching of evolution, in what ought to be one of the most advanced and forward looking nations on Earth, is being hijacked by the fundamentalist nutters again.\n\n \n It is not being singled out. It is being UN-singled out (yea, I know). All of our science curriculum requires that incomplete portions of any theory be taught, or portions composed mainly of conjecture. The standards as revised in 2001 removed this requirement ONLY for evolution. I can only assume that this was to ensure that the fundamentalist nutters diud not hijack it.", 
   {}, 
   119106, 
   null, 
   1115652480.0
  ], 
  [
   119145, 
   null, 
   "daewoo", 
   "Exactly what could not have happened the way evolutionists claim?\n\n \n At the time, the quesiton was whether macro evolution should be taught or not. the \"currently held\" theory of evolution as presented was essentially that different species evolved slowly over millions of years from a common ancestor. According to the palentologists that testified last time around, there is no evidence for this in the fossil record. Their argument was for puncuated equalibrium. Essentially what they claimed was that the story supported by the fossil record is one of long periods of stagnation followed by abrupt changes.", 
   {}, 
   119107, 
   null, 
   1115653440.0
  ], 
  [
   119147, 
   null, 
   "daewoo", 
   "The wording of that legistlation is appalling. Evolution is defined as any change in frequency of alleles not just Darwins theory or punctuated equilibrium. Its like modifying the history curriculum into to saying \"until you build a time machine all history is just conjecture\" or I suppose more accurately it would be like saying \"gravitons have not yet been discovered and these are essential for any theory of gravity no matter how simple. The earth gravity is 9.8 m per second per second? sorry that is just speculation.\n\n \n \n Maybe you could C&P the exact portions of the text you have a problem with.", 
   {}, 
   119110, 
   null, 
   1115653560.0
  ], 
  [
   119149, 
   null, 
   "Clive14", 
   "It is not being singled out.\nThank you for clearing that up.", 
   {}, 
   119141, 
   null, 
   1115653680.0
  ], 
  [
   119162, 
   null, 
   "trebor", 
   "Instead of debating whether or not to teach creationism the Kansas board should start teaching a class in philosophy where students can learn the difference between science and metaphysics. \n \n Perhaps then the next generation will have a clue.\n\n \n \n I think the Kanas board should TAKE a class so they understand the defintion of a scientific theory. It seems they are sadly lacking in the simple basics.", 
   {}, 
   118985, 
   null, 
   1115655300.0
  ], 
  [
   119232, 
   null, 
   "Redratio1", 
   "I think the Kanas board should TAKE a class so they understand the defintion of a scientific theory. It seems they are sadly lacking in the simple basics.\n\n \n I think it is too late for them.\n The creationist memes have done their damage.", 
   {}, 
   119162, 
   null, 
   1115661000.0
  ], 
  [
   119496, 
   null, 
   "Close_slave_can", 
   "Maybe you could C&P the exact portions of the text you have a problem with.\n\n \n \nThis suggestion will have students understand that the order of the nucleotide sequences within\n genes is not dictated by any known chemical or physical law, a fact critical to evolutionary theory and the origin of life\n \n\n it says evolutionary theory. This is not specific enough. I could come up with a \"theory\" If I kill all everyone with at least one white grandparent then you won't see many more white people in future generations. This has the frequency of alleles changing so I can call it evolutionary theory. \n \n It seems to be the same as having the broad restriction as soon as you mention anything to do with gravity at all (the sun pulls on the earth, g=9.8) that you have to point out that the gravitons have not been found yet and that is critical to those theories.", 
   {}, 
   119147, 
   null, 
   1115679060.0
  ], 
  [
   119518, 
   null, 
   "pandion", 
   "Intelligent design is never even to be mentioned. Just like pandion, you are jumping to rediculous conclusions that are wholly unsupprted by the evidence at hand.\n\n You would think that you would pay attention to what is going on in your own state.\n The Kansas Science Hearings Metastory", 
   {}, 
   119145, 
   null, 
   1115680620.0
  ], 
  [
   119530, 
   null, 
   "Close_slave_can", 
   "If you search the proposed revisions for the word design it does seem to have a lot of intelligent design type arguments they just don't call it \"intelligent design\" which is fishy. \n http://www.kansasscience2005.com/Proposed%20Revision%20to%20Draft%202%20KS%20Sci%20Stds.pdf\n \n Daewoo stated that it was about teaching the controversy about whether or not species always change very very slowly. Punctuated equilibrium proposes there are periods where there is not much speciation and periods were it happens quickly. However neither of the words punctuated or equilibrium appear in the revisions.", 
   {}, 
   119518, 
   null, 
   1115682180.0
  ], 
  [
   119759, 
   null, 
   "daewoo", 
   "it says evolutionary theory. This is not specific enough. I could come up with a \"theory\" If I kill all everyone with at least one white grandparent then you won't see many more white people in future generations. This has the frequency of alleles changing so I can call it evolutionary theory. \n \n It seems to be the same as having the broad restriction as soon as you mention anything to do with gravity at all (the sun pulls on the earth, g=9.8) that you have to point out that the gravitons have not been found yet and that is critical to those theories.\n\n \n \n Evolutionary thoery is the proper term for it, regardless of what side of the deabte you are on. Kind of like \"gravitational thoery\" or \"quantum theory\" or \"theory of relativity\"", 
   {}, 
   119496, 
   null, 
   1115699880.0
  ], 
  [
   119762, 
   null, 
   "daewoo", 
   "You would think that you would pay attention to what is going on in your own state.\n The Kansas Science Hearings Metastory\n\n \n I do pay attention to what is going on in my state. In fact, I have transcripts of the entire hearing to date sitting on the corner of my desk, and as a school board member, get twice daily updates via Email. \n \n This part is funny (though it is a lie):\n \n \nThe knockout punch came when Science Coalition attorney Pedro Irigonegaray compelled the intelligent design witnesses to confess, during a series of withering cross-examinations, that they hadn't bothered to read the science standards draft written by the majority on the curriculum committee before coming to Kansas at taxpayer expense.\n\n \n This was followed by admission of the school board members there, including the ones who were merely observing, admitting that they had not read it in its entirety either, just the portions that were proposed to be changed. THEN, the one fo the school board memebrs who was on the panel, asked the lawyer if he had read it. He had not either. That kind of took from the case. It appears that reading the entire curriculum is not really required to form an opinion, all you really need is to read the pertinent sections. The lawyers knock out blow ended up being a belly flop. \n \n \nThe false notion that scientists are divided is key to the intelligent design movement's strategy to convince school districts around the country to \"teach the controversy\" over evolution.\n\n \n And yet none of those scinetists who is opposed and stands around waiting for a media type to ask them to debunk testimony (which thus far has not happened) is willing to get upo there on the stand and testify. it is almost like they are afraid of another ohio, where they gave it their very best and were made to look like fools.\n \n \nCredit for this victory goes primarily to Kansas Citizens for Science, in particular Harry McDonald and the indefatigable Jack Krebs. Pedro Irigonegaray also played an enormously important part in exposing the feeble claims of the intelligent design witnesses, and the one-sidedness of the board. Science faculty from the University of Kansas and Kansas State University did not testify, but they monitored the hearings and made themselves available to the media to debunk the pseudoscience presented during testimony.\n\n \n Credit for this vicotry needs to go to the ID folks, since they ultimatly will be the victors. The problem with the opposing attorney strategy was that HE LED the discussion into the ID realm. The ID folks left it entirely out of their briefings and filings. Regardless of the personal belifs of the presented witnesses, the point has been made....the revisions suggested are proper and factual. Even if ID advocates do use them, that doe not necessarily make them false. \n \n Odds are the changes are going to be accepted. The word is that the school board is already preparing a publicity run to explain the changes, and explain the fact that they are proper according to the testimony at the hearing, they DO NOT bar the teaching of evolution (in fact, they will increase it), the teaching of creationism or intelligent design will stilll NOT be allowed, and that the folks claiming to the contrary have no evidence of this, it is not reflected in the changes, which are available for public view, and basically they are just a buch of blowhard XXXXXX who are looking to provoke a public reaction.\n \n And they are right. anybody who has claimed that evolution is on trial in Ks, or that the school board is considering not teaching evolution, or that they decided not to teach evolution in the past, is either an idiot, a liar, or they simply do not know what they are talking about.", 
   {
    "unicode_changes_made": true
   }, 
   119518, 
   null, 
   1115700780.0
  ], 
  [
   119783, 
   null, 
   "fishpower", 
   "Thanks for the link to the document, daewoo. After reading it, I can only stand by what I said earlier, which is that the purpose of these revisions is to silently open the back door for creationism/ID theory to be taught in schools. I know, it doesn't specifically say anywhere that those should be taught, but what else are we supposed to think when at least four times evolution is referred to as an \"unguided\" process. What theory can they possibly be suggesting to counter that but a \"guided\" process?\n \n On the surface, many of the wording changes seem harmless enough. But they continually introduce slippery language, such as replacing \"natural explanations\" - a perfectly reasonable statement - with \"explanations of natural phenomena\" - which can only open the door for \"super-natural\" explanations (this is on page 25). Pages 4, 18 and 22 again reword perfectly good statements to make room for the supernatural. \n \n If the wording of the changes is open to interpretation, their provided explanations speak volumes about their motives. Page 24: \"It is inappropriate to simply reduce all of science to matter and energy and physics and chemistry.\" That is all of science! Beyond that is philosphy and religion. \"To limit science to seeking explanations reducible only to the physical renders it close minded as to the non-physical aspects of the natural world.\" This can only be written by someone who wishes to see supernatural interpretations of evidence made valid.\n \n There is also a bias in the document against Naturalism, which is really all that proper science has to operate on. Page 7: \"Naturalism is the fundamental tenet of non-theistic religions and belief systems like Secular Humanism, atheism, agnosticism and scientism.\" First of all, it is a mark of ignorance to start throwing around a term like \"non-theistic religions.\" And oxymoron aside, if this sentence doesn't show the same prejudice that these people are accusing evolutionists of (and worse), then I don't know what does. \n \n There are many other little things that perturbed me about this document and I won't go into them all. I can say that there is a positive outcome of having read it, though, which is that I'm that much more inclined to get active in my own community to keep this garbage from happening near me.", 
   {}, 
   119762, 
   null, 
   1115703360.0
  ], 
  [
   119814, 
   null, 
   "daewoo", 
   "Thanks for the link to the document, daewoo. After reading it, I can only stand by what I said earlier, which is that the purpose of these revisions is to silently open the back door for creationism/ID theory to be taught in schools. I know, it doesn't specifically say anywhere that those should be taught, but what else are we supposed to think when at least four times evolution is referred to as an \"unguided\" process. What theory can they possibly be suggesting to counter that but a \"guided\" process?\n\n \n Current evolutionary theory depends on evolution essentially being an unguided process. The current standards use the word \"unguided\" all over the place. It is one of the basic tenents of evolutionary theory. You are nitpicking here. \n \n \nOn the surface, many of the wording changes seem harmless enough. But they continually introduce slippery language, such as replacing \"natural explanations\" - a perfectly reasonable statement - with \"explanations of natural phenomena\" - which can only open the door for \"super-natural\" explanations (this is on page 25). Pages 4, 18 and 22 again reword perfectly good statements to make room for the supernatural. \n \n \n Yes, they do make room for the supernatural. They also make room for my uranus XXX leach theory. So what? The sections of the text that have been presented for change are presented for change because they were technically inaccurate or badly phrased. Nobody has been able to point out a single section that is factually incorrect. if you word it specifically with the goal of removing the possiblity of intelligent design, you have introducd religon into the classroom. Teaching that any particular religon is wrong without empirical evide3nce to back that teaching up is still religon in school. Science should be entirely secular. The original draft was admittedly written specifically using wording to discount ID thoery. In cases where there is a factual basis for this, I am all for it. In cases where there is not, I am against it. I want secular classrooms. I fdo not care to see ID nutjobs taking over the classroom, nor do I wish to see people using iour classrooms to discredit or disprove any religion. Let the facts stand on their own. Arguing slippery slope on this is foolish since the federal supreme court has already outlawed the teaching of creationism, and th eKs supreme court has already outlawed the teaching of ID, unless we have irrefutable facts to back it (such as if the aline comes back looking for his XXX leach and says \"by the way, I designed all this\").\n \n \nIf the wording of the changes is open to interpretation, their provided explanations speak volumes about their motives. Page 24: \"It is inappropriate to simply reduce all of science to matter and energy and physics and chemistry.\" That is all of science! Beyond that is philosphy and religion. \"To limit science to seeking explanations reducible only to the physical renders it close minded as to the non-physical aspects of the natural world.\" This can only be written by someone who wishes to see supernatural interpretations of evidence made valid.\n\n \n But that is not part of the curriculum changes being proposed. I will certainlty agree that the ID folks who introduced this have an agenda. there can be no denying that. Regardless of their agenda, though, they are not proposing the teaching of ID, or the exclusion of evolution. They are asking that holes in current evolutionary theory be exposed as such. There is no harm in this, and to do otherwise would be not only dishonest, but if you do otherwise specifically in an attempt to discredit religon, it is bringing religon into our classrooms. \n \n \nThere is also a bias in the document against Naturalism, which is really all that proper science has to operate on. Page 7: \"Naturalism is the fundamental tenet of non-theistic religions and belief systems like Secular Humanism, atheism, agnosticism and scientism.\" First of all, it is a mark of ignorance to start throwing around a term like \"non-theistic religions.\" And oxymoron aside, if this sentence doesn't show the same prejudice that these people are accusing evolutionists of (and worse), then I don't know what does. \n \n \n Again, there is no doubt that there is a certain agenda by those proposing the changes. The changes themselves are harmless though. \n \n \nThere are many other little things that perturbed me about this document and I won't go into them all. I can say that there is a positive outcome of having read it, though, which is that I'm that much more inclined to get active in my own community to keep this garbage from happening near me.\n\n \n Again, could you please highlight the sections proposing changes that you find to be either factually inaccurate or otherwise unacceptable? That is my point here. Regardless of motive, waht is being proposed is far from the doom and gloom for science that folks are proposing.", 
   {}, 
   119783, 
   null, 
   1115705400.0
  ], 
  [
   119985, 
   null, 
   "Close_slave_can", 
   "Proposed revisions to Kansas Science is one big flaw there is no point in highlighting specific sections. It has got everything arse backwards. hundreds of years ago non-naturalists could attack naturalists with the idea that the world was full of apparently designed creatures so their must be a designer. Evolution can be used to partially counter this attack on naturalism. Evolution is not a proof naturalism can be right, Part of it can be used to in argument that relies on many other factors to counter an argument against naturalism. Equating teaching evolution to teaching that life arose from an unguided process. Evolutions needs no assumptions on how life arose, Naturalists make that assumption.", 
   {}, 
   119814, 
   null, 
   1115730300.0
  ], 
  [
   120117, 
   null, 
   "fishpower", 
   "Current evolutionary theory depends on evolution essentially being an unguided process. The current standards use the word \"unguided\" all over the place. It is one of the basic tenents of evolutionary theory. You are nitpicking here.\n\n \n You're playing right into the ID'ers arguments here. Evoltionary theory does not depend on or assume an unguided process. It has nothing to say on the matter. A guiding hand in evolution is simply a mechanism that has not yet needed to be postulated for the theory to work properly. In this document, at least, I only see the word \"unguided\" as part of additions and modifications to the standards, putting the theory into a misleading light. \n \n \nYes, they do make room for the supernatural. They also make room for my uranus XXX leach theory. So what?\n\n \n So what? Because by doing so they are devaluing Science. IMO, a student's scientific education can only be harmed by allowing the supernatural into discussion. A religious/spiritual explanation of a phenomenon is a scientific dead end and students will not learn to think critically if given those exaplanations as realities.\n \n \nThe sections of the text that have been presented for change are presented for change because they were technically inaccurate or badly phrased. Nobody has been able to point out a single section that is factually incorrect.\n\n \n Under \"Nature of Science\":Presented for removal - \"Science is the human activity of seeking natural explanations for what we observe in the world around us. Science does so through the use of observation, experimentation and logical argument....\"\n Presented to replace it - \"Science is a systematic method of continuing investigation, that uses observation, hypothesis testing, measurement, experimentation, logical argument and theory building, to lead to more adequate explanations of natural phenomena.\"\n How is the first statement technically inaccurate or badly phrased, and how does the replacement improve upon it? The only thing \"improved\" is opening up science to include the supernatural, as implied by the statement \"explanations of natural phenomena.\"\n \n As for the new information technically inaccurate, I have to say they've been careful enough with their wording to avoid completely putting their foot in their mouth. But that doesn't mean that their additions are entirely legitimate, either. What are we supposed to think of a statement like \"the sequence of the nucleotide bases within genes is not dictated by any known chemical or physical law\" (page 14)? That is a meaningless, misleading, negative statement, akin to my saying \"the sequence of nucleotide bases within genes is not dictated by my grocery list.\" It seeks only to implant doubt in the mind of the student.\n \n Page 17: \"Students will be able to explain propsed scientific explanations of the origin of life as well as scientific criticisms of those explanations.\" Reasonable enough, right? But multiple explanations are not given in the details to the right, only the \"primordial soup\" argument, along with three reasons why it could be wrong! Tell me again how is this about being fair and balanced?\n \n \nif you word it specifically with the goal of removing the possiblity of intelligent design, you have introducd religon into the classroom... The original draft was admittedly written specifically using wording to discount ID thoery.\n \n \n Looking through the paper, I see nothing that was worded to discount ID, only to give explanations of current scientific understandings of phenomena.\n \n \nArguing slippery slope on this is foolish since the federal supreme court has already outlawed the teaching of creationism, and th eKs supreme court has already outlawed the teaching of ID, unless we have irrefutable facts to back it (such as if the aline comes back looking for his XXX leach and says \"by the way, I designed all this\").\n\n \n Would an scientist walk into a Sunday school class and say, \"You know, there are an awful lot of contradictions in that book there. It really shouldn't be taught without pointing out each and every one of them\"? No, religion should be taught in a way that helps people best understand their particular system of beliefs. Science should similarly be taught in a way which best helps students learn about the principles and mechanisms of the world as we currently understand them. The science of the history of life has been growing strong and progressing steadily for over a hundred years without the need for special interest groups presiding over how it should be taught. [edited @ 12:26]", 
   {}, 
   119814, 
   null, 
   1115747520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evolution on trial as Kansas debates Adam vs Darwin", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5026-evolution-trial-kansas-debates-adam-vs-darwin.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 5026, 
  "discussion_files": [
   [
    "3294.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5026-evolution-trial-kansas-debates-adam-vs-darwin-print.html"
   ], 
   [
    "3295.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5026-evolution-trial-kansas-debates-adam-vs-darwin-7-print.html"
   ], 
   [
    "3296.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5026-evolution-trial-kansas-debates-adam-vs-darwin-5-print.html"
   ], 
   [
    "3297.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5026-evolution-trial-kansas-debates-adam-vs-darwin-4-print.html"
   ], 
   [
    "3298.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5026-evolution-trial-kansas-debates-adam-vs-darwin-6-print.html"
   ], 
   [
    "3299.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5026-evolution-trial-kansas-debates-adam-vs-darwin-3-print.html"
   ], 
   [
    "3300.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5026-evolution-trial-kansas-debates-adam-vs-darwin-2-print.html"
   ]
  ], 
  "identifier": 5026
 }
]