[
 [
  [
   116121, 
   null, 
   "GI Joe", 
   "When voters in Ohio passed a marriage amendment by a landslide last November, they cracked a wall in the foundation of national leftist politics that its leaders are frantically trying to seal.\n \n Ohio, of course, is the swing state that pushed President Bush over the top on election night. In the wake of the defeat, Democrats railed at Bush, the Republicans, the provisional ballots and even the number of voting machines, convinced that Bush had now stolen a second election from them.\n \n But they have reserved their harshest attacks for someone unknown to most Americans. He is Ohio's chief election official, the Republican Secretary of State, Kenneth Blackwell. Black leftists find Blackwell particularly dangerous because he's a socially conservative African American-an evangelical Christian-who is becoming ever more popular with voters.\n \n Typical of the tirades against him was this remarkable statement on the House floor by a black congresswoman, Maxine Waters. She said, \"I am ashamed to say [he is] an African-American man who has failed to follow Ohio's procedures...(O)ur ancestors who died for the right to vote must be turning over in their graves.\"\n \n Back in Ohio, Jesse Jackson was railing at Blackwell over the long lines of voters who had to wait at the polls in Columbus, a Democrat stronghold.\n \n What's so astonishing is the utter lack of evidence to support any of these charges. Ohio's elections are fully and fairly bipartisan affairs, and none of Michael Moore's 10 camera crews nor any of the 7,000 lawyers who crawled all over the state could find any scandal. Voting machines are parceled out precisely, one for every 117 registered voters. The local election board chairman in Columbus, the locus of Jackson's suspicion, is chairman of the county Democrat party. He also happens to be black.\n \n cont\n http://www.frontpagemag.com/Articles/ReadArticle.asp?ID=17925", 
   {
    "post_info": {
     "post_title": "Black Racists Single Out Conservative"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1115164080.0
  ], 
  [
   116177, 
   null, 
   "jazyjason", 
   "Sir I do agree with the harshness of the left. They will stop at nothing so secure their hidden agenda's toward the public. They don't care about the middle class at all. The mc is only a footstool for their power in votes and only care about themselves. However there are still some very reasonable democrats in office. I have to disagree with the title calling blacks racists. I got into some hot water myself trying to clareify myself on the agenda's of Jackson and other left winged crazies. Read it and it will make sense. However your stance is ever more empressive, few men would have the courage to say what you did and in that aspect, I am honored.", 
   {}, 
   116121, 
   null, 
   1115168160.0
  ], 
  [
   116217, 
   null, 
   "Voice Of Reason", 
   "Lets face the fact, the Rev. (and i use the term loosely) Jackson is a rascist and a rabble rouser.......He is only out to line his own pockets at the expense of African Americans........\n \n He is the biggest hypocrite of all times in that when he was counseling Clinton on his indiscretions with Monica he had a pregnant secretary girlfriend.......\n \n Yhe height of hypocrisy.....", 
   {}, 
   116177, 
   null, 
   1115172120.0
  ], 
  [
   116220, 
   null, 
   "jazyjason", 
   "I totally agree VOR. This nation is indeed on it's last leg as far as \"equality\" and \"tolerance\" is concerned.", 
   {}, 
   116217, 
   null, 
   1115172540.0
  ], 
  [
   116223, 
   null, 
   "johnson", 
   "I totally agree VOR. This nation is indeed on it's last leg as far as \"equality\" and \"tolerance\" is concerned.\n\n Well let's just hope god doesen't decied to deal with us the way god did in ... Hosea 9:16 or 13:16 or others if you want me to continue.", 
   {}, 
   116220, 
   null, 
   1115173560.0
  ], 
  [
   116229, 
   null, 
   "jazyjason", 
   "Yes please do. Maybe it will open the eyes of the closed minded. Indeed we Christians have an inate and difficult job to accomplish. But we can do all through Christ Jesus.", 
   {}, 
   116223, 
   null, 
   1115173860.0
  ], 
  [
   116236, 
   null, 
   "johnson", 
   "Yes please do. Maybe it will open the eyes of the closed minded. Indeed we Christians have an inate and difficult job to accomplish. But we can do all through Christ Jesus.\n\n Are you reading these verses god ordered these killings not jesus", 
   {}, 
   116229, 
   null, 
   1115174100.0
  ], 
  [
   116242, 
   null, 
   "jazyjason", 
   "So? Im only talking about what Christians have to do. I guess I switched gears too quick lol.", 
   {}, 
   116236, 
   null, 
   1115174520.0
  ], 
  [
   116247, 
   null, 
   "johnson", 
   "So? Im only talking about what Christians have to do. I guess I switched gears too quick lol.\n\n I thought christians were supposed to do the will of god? Do they only do the will of jesus and not the god of the old testament?", 
   {}, 
   116242, 
   null, 
   1115175360.0
  ], 
  [
   116248, 
   null, 
   "jazyjason", 
   "OH! No. I was just showing examples of men who did NOT follow Gods will. Men like Joshua and Eligah (spellcheck?), and job are just a few examples of men who followed God's will.", 
   {}, 
   116247, 
   null, 
   1115175480.0
  ], 
  [
   116249, 
   null, 
   "jazyjason", 
   "Also the God of the Old testament is the SAME God of the New Testament.", 
   {}, 
   116248, 
   null, 
   1115175540.0
  ], 
  [
   116253, 
   null, 
   "johnson", 
   "OH! No. I was just showing examples of men who did NOT follow Gods will. Men like Joshua and Eligah (spellcheck?), and job are just a few examples of men who followed God's will.\n\n sorry about the spelling I only have a high school education. Ok so johs, elig, and job followed and recieved gods grace.. right? .. why didnt he extened that same grace to the the babies he ordered soldiers to kill? I mean they didn\"t do any thing it was the adults who chose not to obey or whatever. right?", 
   {}, 
   116248, 
   null, 
   1115176020.0
  ], 
  [
   116254, 
   null, 
   "johnson", 
   "Also the God of the Old testament is the SAME God of the New Testament.\n\n I've heard that only I can't figure out why gods such a mass murder it the old testament and not the new?", 
   {}, 
   116249, 
   null, 
   1115176080.0
  ], 
  [
   116256, 
   null, 
   "jazyjason", 
   "Perhaps the reason is God had a DIRECT connection with the Isrealites. Such as the Ark Of The Covenant. He had direct influence over their affairs, and as a result was a constant force to be acknowledged. Also, many atrocious things were done by Isreal as well.", 
   {}, 
   116254, 
   null, 
   1115176260.0
  ], 
  [
   116262, 
   null, 
   "johnson", 
   "Perhaps the reason is God had a DIRECT connection with the Isrealites. Such as the Ark Of The Covenant. He had direct influence over their affairs, and as a result was a constant force to be acknowledged. Also, many atrocious things were done by Isreal as well.\n\n By direct do you mean god talked like face to face with them or somthing and that makes it ok to order soliders to kill babies in their mothers womb?", 
   {}, 
   116256, 
   null, 
   1115176620.0
  ], 
  [
   116265, 
   null, 
   "jazyjason", 
   "Sir look. To begin, the Isrealites were being attacked by the Samaritans. Raids that included rape, murder, torture ect. GOd ordered them to do this so that there would not be a hateful generation to return and pose a threat. Not until later would the generation emerge only to find Isreal as a dominant power. It was for Isreal's protection. And retribution. Remember before Christ the saying was \"love thy neighbor hate thine enemy.\"", 
   {}, 
   116262, 
   null, 
   1115176860.0
  ], 
  [
   116277, 
   null, 
   "johnson", 
   "Sir look. To begin, the Isrealites were being attacked by the Samaritans. Raids that included rape, murder, torture ect. GOd ordered them to do this so that there would not be a hateful generation to return and pose a threat. Not until later would the generation emerge only to find Isreal as a dominant power. It was for Isreal's protection. And retribution. Remember before Christ the saying was \"love thy neighbor hate thine enemy.\"\n\n But my question still remains why didn't god afford the samaritans the same saving grace that was given to the chosen people. If I remember right they disobeyed gods comandments but god didnt have an army come in and cut the babies from their wombs. Now you may think me insincere but that would be incorrect, my goal is not to mock you but to understand the reasoning behind all of this!", 
   {}, 
   116265, 
   null, 
   1115178000.0
  ], 
  [
   116281, 
   null, 
   "jazyjason", 
   "Ha ha same here. Same here", 
   {}, 
   116277, 
   null, 
   1115178300.0
  ], 
  [
   116302, 
   null, 
   "johnson", 
   "Ha ha same here. Same here\n\n Well it shouldn't be hard to figure out why i'm confused.. I mean this god is angry at for what it created, and clearly chooses sides in war issues,... if one is to take the bible for what it says. This is all just a little too hard to swallow and I need your guidance to help me make it make sense. Is this a god of war like mars or is this a god of peace and understanding and compasion? This is what I'm told but when I read the book it's not what I find. I'm open to a sensable explanation!", 
   {}, 
   116281, 
   null, 
   1115180160.0
  ], 
  [
   116307, 
   null, 
   "jazyjason", 
   "LOL. sor I am only 17 years old. I know little and have experienced little. But I believe He is both. Kind of ironic is it not? that we reflect our human nature upon both pivoting points? It seems as though we must disect each scripture concerning God's behaviour very carefully.", 
   {}, 
   116302, 
   null, 
   1115180640.0
  ], 
  [
   116318, 
   null, 
   "johnson", 
   "LOL. sor I am only 17 years old. I know little and have experienced little. But I believe He is both. Kind of ironic is it not? that we reflect our human nature upon both pivoting points? It seems as though we must disect each scripture concerning God's behaviour very carefully.\n\n You believe \" He is both \" Both what? What nature upon what pivot points? Please explane. And I'm not shure what you mean when you say \" disect each scripture \" Please help", 
   {}, 
   116307, 
   null, 
   1115181660.0
  ], 
  [
   116321, 
   null, 
   "jazyjason", 
   "Both a God of war and of love. we reflect that in our nature as humans as well. Look at Greece, Rome, etc.", 
   {}, 
   116318, 
   null, 
   1115181720.0
  ], 
  [
   116706, 
   null, 
   "johnson", 
   "Both a God of war and of love. we reflect that in our nature as humans as well. Look at Greece, Rome, etc.\n\n Ok a god of war and love. Now I hope we at least can agree that war is just plain bad, not good in any way for the innocent people cought in the middle. This is sin in my opinion when innocent people are hurt. So if gods a god of war ie.. a bad thing ( and in my opinion a sin ) Why is god so mad at us for being like god?", 
   {}, 
   116321, 
   null, 
   1115233320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Black Racists Single Out Conservative", 
  "url": "http://www.4forums.com/political/politics-debates/5040-black-racists-single-out-conservative.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 5040, 
  "discussion_files": [
   [
    "12166.html", 
    "http://www.4forums.com/political/politics-debates/5040-black-racists-single-out-conservative-print.html"
   ], 
   [
    "12167.html", 
    "http://www.4forums.com/political/politics-debates/5040-black-racists-single-out-conservative-2-print.html"
   ]
  ], 
  "identifier": 5040
 }
]