[
 [
  [
   116351, 
   null, 
   "Missouri Mule", 
   "I thought I had referenced this earlier but I can't find that thread if it exists at all. In any event I think this is interesting and appears to be a genuine account of what was actually said in the letter. One of Zarqawi's followers is lamenting the situation in Iraq. Our forces have been continually cutting down the playing field and this letter bears out the strategy that will eventually prevail in a free and democratic Iraq.\n =============================\n Translation of a letter from Abu Asim al-Qusaymi al Yemeni to \"the Sheik.\"\n Date: April 27, 2005\n \n In the name of God the most merciful, the most compassionate.\n \n A special message to the Sheik Abu Ahmad, may God protect and save him.\n \n Thank God, God of the Universe who stated in his generous book I assure the believers a guaranteed victory; he who honors those who obey him and he who disgraces those who disobey him until the judgment day; may peace be upon the messenger that was sent as a mercy to the world, the prophet who had submitted the message and had struggled for the sake of God until the last moment of his life. So may God bless him with peace on his family, friends and followers until the judgment day; thereafter.\n \n The Almighty God said \"those who are believers beware of God and do not die unless you are Moslem.\" And, the Prophet had stated \"the religion is an advice, we asked him, to how may it be? He replied, for the sake of God, the Prophet, the Holy Book, the Moslem Imams and the public.\" He said \"if you leave Jihad then God will take away the mercy from you.\"\n \n I advise myself firstly then I advise you [Sheik] to beware of God in secret and in the open. Do not be afraid of anybody. I advise you not to be stopped by anything from practicing Jihad for the sake of God and that is by depending absolutely on God. Whoever satisfies God rather than people, God will satisfy. All the Moslem nation is waiting to have an Islamic state implementing the rules of God, and are waiting for those men who are going to protect their dignity that are being abused everyday.\n \n What has happened between myself and my brothers is a crime that cannot be forgiven, but God will eventually punish the oppressor. I could swear by God that you are asking about us and our situation in here; the morale has weakened and lines of the Mujahidin have become separated due to some leaders' actions, God does not accept such actions, and that will delay the victory. We do have big mistakes where some of us have been discarded.\n \n To conclude what has happened with us, he said either you carry out a martyr operation or go back to your family. After, we were told this was an order from the Sheik. Indeed, some of the brothers had returned back, some were recorded as martyred and the rest were hanging around and did not know what to do, besides they were humiliated and immorally treated. Who is to blame, should it be the oppressor or the oppressed? We have brothers that were tortured and jailed. They are harmless and nobody is meeting with them or asks about them. It is unlike the case in Fallujah where you used to come and visit us, and we enjoyed your party. The situation has changed dramatically and that is not acceptable to God. The most important thing Sheik, is your existence is a thorn in the mouth of the Americans as well as the traitors, and may God protect you.\n \n The most important issue here is, do not hear from just one side, even if that person was close to you. But hear from all sides so the facts will become clear to you.\n \n We have leaders that are not capable of being good leaders. We are not accusing them without reason but we have tested them and found them incapable.\n \n Thank God, Sheik, please test those who are underneath you. Some of them are in a rush, some are unfair and some have other issues.\n \n My last request to you Sheik is that I need to meet with you to share a lot of unknown issues. And, to be honest with you, I really do not trust anyone anymore that says he is coming from your side. We have suffered a lot, but thank God. I ask the Great God to make the religion victorious and to bless the Mujahidin anywhere in the world and to disgrace the infidels, destroy America and its allies soon without any delay.\n \n May grace be upon Mohammed and his family and friends until the judgment day. I attest that there is one God and I ask for his forgiveness.\n \n Signed by\n Abu 'Asim al-Yamani, al Qusaymi\n Al-Qaida Organization, Iraq Division \n ==========================================\n May 3, 2005 Release Number: 05-05-02\n \n FOR IMMEDIATE RELEASE\n \n LETTER TO ZARQAWI SEIZED IN RAID\n \n BAGHDAD, Iraq - During an April 28 raid in Baghdad, forces from Multi-National Forces - Iraq seized a letter written by Abu Asim al-Qusaymi al-Yemeni, a member of Qa'idat al-Jihad Fi Bilad Al-Rafidayn, or QJBR, addressed to \"the Sheik.\" Analysts believe the letter, dated April 27, 2005, was meant for Abu Musab al-Zarqawi, because many of his close followers refer to him as \"the Sheik.\"\n \n While the letter advocates Jihad and praises \"the Sheik\" for being \"a thorn in the mouth of the Americans,\" the main purpose of the letter is to address low morale, weakening support for the Jihad, and the incompetence of many of the Mujahideen leaders. The author also admonishes the \"the Sheik\" for abandoning his followers since Fallujah. The letter written by Abu Asim al-Qusaymi al-Yemeni is attached.\n \n Along with the letter, an undated document was found listing targeting information and sketch maps for kidnappings and bombings.\n \n Due to the continuous pressure by Iraqi and Coalition forces, Zarqawi relies on his cell leaders to conduct operations while he is forced to evade being killed or captured.\n \n During the raid, MNF-I forces also killed five terrorists and captured three. Abu Rayyan, one of the five terrorists killed by Coalition forces, was the Saudi leader of a Baghdad-based vehicle borne improvised explosive device cell. Abu Rayyan also served as the lieutenant to the terrorist, Abu al Abbas, who is allegedly responsible for planning the attack on Abu Ghraib in early April.\n \n Documents, weapons, ammunition and fake identification cards were found in the possession of the cell members as well as inside the buildings in which the terrorists were operating. Those captured in this raid are providing information on the composition and intentions of a significant support and operations cell associated with Abu Musab al-Zarqawi.\n \n No Coalition forces were injured or killed during this raid.\n \n The English translation of this letter can be viewed at:\n \n http://www.centcom.mil\\CentcomNews\\Reports\\ZarqawiEnglishtranslation.doc\n \n The PDF of the letter in Arabic can be viewed at:\n \n http://www.centcom.mil\\CentcomNews\\Reports\\Zarqawi Arabic.pdf\n \n (Please cut and paste the e-mail links into your browser.)\n \n For further information, please contact Lt. Col. Michael Caldwell, MNF-I, at e-mail Michael.caldwell@iraq.centcom.mil or 703-343-8645.", 
   {
    "post_info": {
     "post_title": "Letter to Zarqawi"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1115187660.0
  ], 
  [
   116402, 
   null, 
   "Symbiote", 
   "I realise the Guardian ran this story, but something seems odd to me.\n \n \nA special message to the Sheik Abu Ahmad\n\n \n Why would a letter writer address Al-Zarqawi as Abu Ahmad? Does the name have any special significance, any special meaning, that would lead the US to believe it was Al-Zaqawi who was the intended recipient?\n \n The letter was found with a \"terrorist\" who was believed to have\n \n \nserved as the lieutenant to the terrorist, Abu al Abbas, who is allegedly responsible for planning the attack on Abu Ghraib in early April.\n\n \n I mean if we're talking about fake names here, isn't Abu al Abbas as likely, indeed more likely, the intended recipient than Al Zaqawi?\n \n It's even conceivable that the person writing the letter misaddressed \"Abu Abbas\" as \"Abu Ahmad\", similar names, no?\n \n It appears to me more plausible than an unsubstantiated claim Al-Zaqawi was the recipient.", 
   {}, 
   116351, 
   null, 
   1115201160.0
  ], 
  [
   116410, 
   null, 
   "daewoo", 
   "Why would a letter writer address Al-Zarqawi as Abu Ahmad? Does the name have any special significance, any special meaning, that would lead the US to believe it was Al-Zaqawi who was the intended recipient?\n \n I mean if we're talking about fake names here, isn't Abu al Abbas as likely, indeed more likely, the intended recipient than Al Zaqawi?\n\n \n Those are all fake names. Abu means \"father\". Al Zaqawi pretty much means \"from Zaqa\" (town in jordan. Al Zaqawis full name (at least the one he is using) Abu Msab Al Zaqai, which translates to father of Musab, from Zaqa. \n \n \n \nIt's even conceivable that the person writing the letter misaddressed \"Abu Abbas\" as \"Abu Ahmad\", similar names, no?\n\n \n Unlikely. That would be like misadressing a letter to \"john\" and accidentaly writign \"jim bob\". Abu Abbas is kind of a hillbilly arab name (beduin I think). \n \n More likely the letter was meant for Sheik Abu Ahmad Al-Kuwaiti, who is kind of a front man for Al Queda (but has a lot of money and influence, so we leave him alone). He is known to have contact with AQ operatives in Iraq.\n \n \nIt appears to me more plausible than an unsubstantiated claim Al-Zaqawi was the recipient.\n\n \n It does seem something of a leap to assume that the letter is meant for Zaqawi based on the fact that it is addressed to another man, one that we know would be likely to recieve such correspondance. \n \n It is kind of hard to tell, though, since as usual, they have posted a scan of the original letter in Arabic, but modified it so you cannot really read the text. Check it out yourself:\n \n http://www.centcom.mil/CentcomNews/Reports/Zarqawi%20Arabic.pdf\n \n See how badly it is pixelated around the words, but not at the edges of the paper? Sombody did this intentionally. They leave just enough so you can tell that it is arabic, and pick out some of the more obvious words, but not nearly enough to actually be able to read it. They have obviously modified the text (or had the worlds worst translator). The worst, and most obvious example, is in this paragraph:\n \n \nTo conclude what has happened with us, he said either you carry out a martyr operation or go back to your family. After, we were told this was an order from the Sheik. Indeed, some of the brothers had returned back, some were recorded as martyred and the rest were hanging around  and did not know what to do, besides they were humiliated and immorally treated. Who is to blame, should it be the oppressor or the oppressed? We have brothers that were tortured and jailed. They are harmless and nobody is meeting with them or asks about them. It is unlike the case in Fallujah where you used to come and visit us, and we enjoyed your party. The situation has changed dramatically and that is not acceptable to God. The most important thing Sheik, is your existence is a thorn in the mouth of the Americans as well as the traitors, and may God protect you.\n\n \n The first bold paragraph is not right. the syntax is wrong for an arabic speaker. Besides that, arabs do nto use the term \"hanging around\". If you are \"hanging around\", there is generally a rope involved. The second section, besides not making sense, also has incorrect syntax.", 
   {}, 
   116402, 
   null, 
   1115212680.0
  ], 
  [
   116578, 
   null, 
   "SteveRogers", 
   "As I understand the letter hasn't been independently verifed. I suspect this may be an effort at misinformation. And judging by the success the insurgency is having, killing about 50 today, I would hardly find this as a credible possibility.", 
   {}, 
   116410, 
   null, 
   1115227080.0
  ], 
  [
   116613, 
   null, 
   "Missouri Mule", 
   "I seriously doubt it is disinformation although anything is a possibility. This has been picked up by most of the new wires and reported widely. And now we have this top terrorist (Al-Libbi) in Pakistan having been caught recently; #3 on the list of top Al Queda terrorists. While we continue to have the senseless bombings, we also have very good news and the terrorist network is continuing to come unglued. We didn't get into the fix overnight that led to 9/11 and we won't unravel the problem overnight but we are making big progress. Bush may yet get his face on Mount Rushmore.", 
   {}, 
   116578, 
   null, 
   1115229060.0
  ], 
  [
   116619, 
   null, 
   "Symbiote", 
   "I seriously doubt it is disinformation although anything is a possibility. This has been picked up by most of the new wires and reported widely.\n\n \n That, if anything, makes it being misinformation more likely.\n \n Can you see in any report, anywhere, any reasonable explanation for the misaddressing of the letter or for the atrocious quality of the scan?\n \n \nWhile we continue to have the senseless bombings, we also have very good news\n\n \n Doesn't that suggest to you that the news is perhaps - being cooked? I know you're a big advocate of propaganda yourself, so the possibility you're being systematically deceived shouldn't really bother you.", 
   {}, 
   116613, 
   null, 
   1115229180.0
  ], 
  [
   116637, 
   null, 
   "SteveRogers", 
   "I seriously doubt it is disinformation although anything is a possibility. This has been picked up by most of the new wires and reported widely. And now we have this top terrorist (Al-Libbi) in Pakistan having been caught recently; #3 on the list of top Al Queda terrorists. While we continue to have the senseless bombings, we also have very good news and the terrorist network is continuing to come unglued. We didn't get into the fix overnight that led to 9/11 and we won't unravel the problem overnight but we are making big progress. Bush may yet get his face on Mount Rushmore.\n\n \n A couple of mistakes in your reasoning if don't mind.\n \n 1. The news wires will carry anything and they are also saying this has not been verified. I point you to the claim that 70% of Iraqi's voted and that Zarqawi was almost caught as either incorrect or pointless news reports carried by wires. Both, like this one, seem to real efforts at misinformation.\n \n 2. Al Qaeda as an enity is meaningless. We could capture 100% of them, including OBL himself, and it would be meaningless. We are experiencing a defensive Jihad, and there is not network or organization that can be dismantled. Differeing groups, sections, and individuals are working independently, much as they always have, and could care less who we capture or attack.\n \n BTW this announcement seems rather convienent as well. Didn't the wires just run a \"Where's OBL\" piece the other day? Pakistan was implicated? Now we have #3? \n \n Perhaps just another of many coincedences, but I am skeptical by nature.", 
   {}, 
   116613, 
   null, 
   1115229960.0
  ], 
  [
   116657, 
   null, 
   "Missouri Mule", 
   "A couple of mistakes in your reasoning if don't mind.\n \n 1. The news wires will carry anything and they are also saying this has not been verified. I point you to the claim that 70% of Iraqi's voted and that Zarqawi was almost caught as either incorrect or pointless news reports carried by wires. Both, like this one, seem to real efforts at misinformation.\n \n 2. Al Qaeda as an enity is meaningless. We could capture 100% of them, including OBL himself, and it would be meaningless. We are experiencing a defensive Jihad, and there is not network or organization that can be dismantled. Differeing groups, sections, and individuals are working independently, much as they always have, and could care less who we capture or attack.\n \n BTW this announcement seems rather convienent as well. Didn't the wires just run a \"Where's OBL\" piece the other day? Pakistan was implicated? Now we have #3? \n \n Perhaps just another of many coincedences, but I am skeptical by nature.\n\n \n As I said it may in fact be fabricated. I have no independent way of knowing one way or another. I do tend to rely on Centcom's news releases, however.\n \n I don't agree with you about the make-up of Al Queda. While there may be very many, perhaps millions of young Muslims who are attracted toward doing harm to western civilization without an effective command and control system are unlikely to be very effective. As we change the dynamic in Iraq and throughout the Middle East, as has been happening, these young men are less likely to be drawn into this dead end. That's the whole idea behind removing Saddam. So long as he was there sticking us in the eye, the Jihadists assumed we were easy picking for their generalized hatred of all things western that they had been led to believe were the cause of their problems. That's changing and that's a very good thing.", 
   {}, 
   116637, 
   null, 
   1115230620.0
  ], 
  [
   116684, 
   null, 
   "SteveRogers", 
   "As I said it may in fact be fabricated. I have no independent way of knowing one way or another. I do tend to rely on Centcom's news releases, however.\n \n I don't agree with you about the make-up of Al Queda. While there may be very many, perhaps millions of young Muslims who are attracted toward doing harm to western civilization without an effective command and control system are unlikely to be very effective. As we change the dynamic in Iraq and throughout the Middle East, as has been happening, these young men are less likely to be drawn into this dead end. That's the whole idea behind removing Saddam. So long as he was there sticking us in the eye, the Jihadists assumed we were easy picking for their generalized hatred of all things western that they had been led to believe were the cause of their problems. That's changing and that's a very good thing.\n\n \n \n They have been quite effective without any for sometime now. Early on the CIA was clear that these new groups are simply not working with larger groups. It was as much a surprise to OBL that 9/11 happened as anyone else. None of this is in anyway dependedent on leadership from a larger controlling organization.\n \n Nor is it dependent on any so called \"terror state.\" Such miscalulations are why we are losing any \"war on terrorism\" we think we are fighting.", 
   {}, 
   116657, 
   null, 
   1115232180.0
  ], 
  [
   116688, 
   null, 
   "Missouri Mule", 
   "They have been quite effective without any for sometime now. Early on the CIA was clear that these new groups are simply not working with larger groups. It was as much a surprise to OBL that 9/11 happened as anyone else. None of this is in anyway dependedent on leadership from a larger controlling organization.\n \n Nor is it dependent on any so called \"terror state.\" Such miscalulations are why we are losing any \"war on terrorism\" we think we are fighting.\n\n \n Are you quite serious?", 
   {}, 
   116684, 
   null, 
   1115232360.0
  ], 
  [
   116701, 
   null, 
   "SteveRogers", 
   "Are you quite serious?\n\n \n Very serious. The plan was divised by members of Al Qaeda, but it was carried out by an at large army who wasn't following any direct orders. This is what makes this small army dangerous. It has no head to cut off. All parts of the body function independently. OBL has only been an inspirational leader. Now we have the myth that is Zarqawi biding for equal time.\n \n Things are worse; not better.", 
   {}, 
   116688, 
   null, 
   1115232840.0
  ], 
  [
   116769, 
   null, 
   "daewoo", 
   "Very serious. The plan was divised by members of Al Qaeda, but it was carried out by an at large army who wasn't following any direct orders. This is what makes this small army dangerous. It has no head to cut off. All parts of the body function independently. OBL has only been an inspirational leader. Now we have the myth that is Zarqawi biding for equal time.\n \n Things are worse; not better.\n\n \n \n That is what makes AQ virtually unbeatable. They are using the cell structure developed byt he CIA in the 50's and 60's for insurgent groups. There is no head to cut off, there are no particularly important leaders, and nobody has any clue what is going on in other parts of the organization. Bin Laden is a figurehead who likely has no real idea what is going on futher down the line.", 
   {}, 
   116701, 
   null, 
   1115238060.0
  ], 
  [
   116845, 
   null, 
   "gnojek", 
   "Very serious. The plan was divised by members of Al Qaeda, but it was carried out by an at large army who wasn't following any direct orders. This is what makes this small army dangerous. It has no head to cut off. All parts of the body function independently. OBL has only been an inspirational leader. Now we have the myth that is Zarqawi biding for equal time.\n \n Things are worse; not better.\n\n \n No, OBL knew. Top AQ knew.\n \n The operation was called \"Big Wedding\" and there are tapes of OBL talking about the big wedding.", 
   {}, 
   116701, 
   null, 
   1115247180.0
  ], 
  [
   116923, 
   null, 
   "SteveRogers", 
   "No, OBL knew. Top AQ knew.\n \n The operation was called \"Big Wedding\" and there are tapes of OBL talking about the big wedding.\n\n \n You misunderstand. I said they came up with the plan. But they were not involved in assigning, or running the opperation. There is an important difference.\n \n Again, the leadership means nothing. Kill them all and the machine will continue without missing a beat.", 
   {}, 
   116845, 
   null, 
   1115257800.0
  ], 
  [
   117010, 
   null, 
   "Missouri Mule", 
   "I have never read such ridiculous nonsense in my lifetime as what has appeared in this thread. I guess it doesn't make any difference to someone who will just post pure crapola just to be noticed.", 
   {}, 
   116923, 
   null, 
   1115273340.0
  ], 
  [
   117044, 
   null, 
   "SteveRogers", 
   "I have never read such ridiculous nonsense in my lifetime as what has appeared in this thread. I guess it doesn't make any difference to someone who will just post pure crapola just to be noticed.\n\n \n Wicked. Harsh. And not true. The CIA has said as much. There was an MSNBC article back when Bush was touting how many heads had been cut off and the CIA said it didn't really matter. \n \n It is simply true. There is no chain or direct line between one and the other. That is why they are more dangereous. And why this approach means nothing in the end. \n \n A quick search:\n \n WASHINGTON - U.S. intelligence and law enforcement officials say al-Qaeda has become more difficult to stop as its terrorist cells have spread out.\n \n Disrupted by the U.S. military campaign in Afghanistan, al-Qaeda has shifted from a centralized organization to smaller, more localized terrorist cells. The cells' obscurity complicates efforts by U.S. intelligence and law enforcement to penetrate them.\n \n http://www.usatoday.com/news/nation/2002-10-31-investigationside-usat_x.htm\n \n Mr Tenet himself admitted so. He said the group, after the initial damage, has managed to reorganized itself into smaller cells with independence command to carry out terrorist attacks without either being consulted or directed by Osama bin Laden or his immediate advisors.\n \n http://www.observerindia.com/analysis/A129.htm\n \n \n Senior U.S. intelligence officials note that in fact, the frequency of terrorist attacks carried out by Muslim radicals is increasing, not decreasing. Moreover, they say the attacks carried out by what they now refer to as \"central al-Qaida\" are being dwarfed by those carried out by affiliates, such Ansar al Sunnah in Iraq, the Chechen rebels and even ad hoc groups like those who blew up the Madrid train stations.\n \n While there may be links to al-Qaida in terms of training and in some cases money, these groups operate independently of Osama bin Laden's command.\n \n The threat in fact is \"morphing,\" as one senior U.S. intelligence official put it.\n \n \"You're talking about an al-Qaida that's trying to regenerate, and you're also talking about a movement that has looked to al-Qaida for inspiration but is not really al-Qaida central,\" said another intelligence official. \n \n http://www.msnbc.msn.com/id/5889435/\n \n U.S. officials have said that the direct threat posed by al Qaeda's central leadership has diminished and that it has taken on a different role of providing encouragement, but little concrete assistance, to local cells or networks that plan attacks on their own. On Wednesday, in its annual report on global terrorism trends, the State Department said the shift illustrates \"what many analysts believe is a new phase of the global war on terrorism, one in which local groups inspired by al Qaeda organize and carry out attacks with little or no support or direction from al Qaeda itself.\"\n \n http://www.washingtonpost.com/wp-dyn/content/article/2005/05/01/AR2005050100947.html\n \n \n Point is. I am not posturing. The approach was wrong, the result worse.", 
   {
    "unicode_changes_made": true
   }, 
   117010, 
   null, 
   1115276640.0
  ], 
  [
   117220, 
   null, 
   "Missouri Mule", 
   "It's really quite absurd to believe that a lot of brain damaged XXXXXX blowing themselves up would be able to carry out a 9/11 type attack on the U.S. The downgrading of the sophistication of the terrorists is indisputable. The first thing we did in the two Iraq wars was to attack the command and control centers so that the military effectiveness would be so degraded as to be ineffective. The terrorists have been effective in the past because of the cell structure. Those cells are controlled by a higher authority and if it disrupted these cells are like the worker ants when the queen has been neutralized. The colony dies as will the terrorist network as we pick off their top and most capable leaders.", 
   {}, 
   117044, 
   null, 
   1115311140.0
  ], 
  [
   117244, 
   null, 
   "SteveRogers", 
   "It's really quite absurd to believe that a lot of brain damaged XXXXXX blowing themselves up would be able to carry out a 9/11 type attack on the U.S. The downgrading of the sophistication of the terrorists is indisputable. The first thing we did in the two Iraq wars was to attack the command and control centers so that the military effectiveness would be so degraded as to be ineffective. The terrorists have been effective in the past because of the cell structure. Those cells are controlled by a higher authority and if it disrupted these cells are like the worker ants when the queen has been neutralized. The colony dies as will the terrorist network as we pick off their top and most capable leaders.\n\n \n \n Your mistake is to think they are XXXXXX. They are most certainly misguided, wrong, and evil, but not XXXXXX. \n \n And since the attacks have tripled and are having decent success despite all those captures, the evidence simply doesn't support your claim. The head is meaningless. That is why we are still facing a threat; that is why the CIA says they are more dangerous.\n \n \n According to Michael Chandler, a security expert at the United Nations, attacks like the Riyadh bombings do not cost huge sums of money.\n \n \"They (militants) are able also, from cells that have been broken up, to survive on methods of self-funding that we have come across, with credit card fraud, petty crime, and drug money,\" Mr Chandler said.\n \n Another expert, Rohan Gunaratna Mr Gunaratna - author of Inside al Qaeda, Global Network of Terror - compared the group to a beehive that had been kicked.\n \n \"If you attack it what happens? The bees are dispersing and they are finding new queens,\" he told Reuters.\n \n Mr Gunaratna gave the example of South-East Asia's Jemaah Islamiah - the group blamed for last October's bombing in Bali.\n \n \"The politicised and radicalised segments of the Muslims are feeling the need to wage jihad [holy war] in support of their suffering brethren,\" he says. \n \n http://news.bbc.co.uk/1/hi/world/americas/3030607.stm\n \n \n CNN Fact Check: Bush incorrectly suggests that on his watch 75 percent of al Qaeda's leadership has been brought to justice. CIA officials have estimated that 75 percent of the two dozen or so known al Qaeda leaders as of September 11, 2001, have been either killed or captured.\n \n The estimate does not take into account post-September 11 activity, or new al Qaeda leaders who have taken the place of those killed or captured. The nonpartisan International Institute for Strategic Studies estimates that al Qaeda has about 18,000 potential operatives, but there is no official data on the size of al Qaeda's total membership, in part because it is difficult to track the number of new recruits since the Iraq war.\n \n http://www.cnn.com/2004/ALLPOLITICS/10/13/factcheck/", 
   {}, 
   117220, 
   null, 
   1115312280.0
  ], 
  [
   117258, 
   null, 
   "Missouri Mule", 
   "Your mistake is to think they are XXXXXX. They are most certainly misguided, wrong, and evil, but not XXXXXX. \n \n And since the attacks have tripled and are having decent success despite all those captures, the evidence simply doesn't support your claim. The head is meaningless. That is why we are still facing a threat; that is why the CIA says they are more dangerous.\n\n \n They may be more \"dangerous\" in the sense that they are unguided missiles but no way can they carry out a massive 9/11 type attack with the leadership decimated. \n \n Bush said from the get-go that this would take time; perhaps decades. Would seem that his plan is on target to accomplish the tasks at hand. The alternative would have been to just sit back and wait for more attacks on U.S. soil and they would surely have happened if Bush hadn't taken the fight to their back yard. 9/11 happened because we didn't do anything effective to fight back prior to 9/11. Bin Laden has said so.", 
   {}, 
   117244, 
   null, 
   1115313300.0
  ], 
  [
   117266, 
   null, 
   "SteveRogers", 
   "Never say never say never. All 9/11 took was 19 guys on a plane. It was financed by private individuals and illegal activities. any cell could do this without any leadership.\n \n More support btw:\n \n Al-Qaeda's leadership oversees a loosely organized network of cells. It can recruit members from thousands of \"Arab Afghan\" veterans and radicals around the world. Its infrastructure is small, mobile, and decentralized-each cell operates independently with its members not knowing the identity of other cells. Local operatives rarely know anyone higher up in the organization's hierarchy.\n \n Al-Qaeda differs significantly from more traditional terrorist organizations. It does not depend on the sponsorship of a political state, and, unlike the PLO or the IRA, it is not defined by a particular conflict. Instead, al-Qaeda operates as a franchise. It provides financial and logistical support, as well as name recognition, to terrorist groups operating in such diverse places as the Philippines, Algeria, Eritrea, Afghanistan, Chechnya, Tajikistan, Somalia, Yemen, and Kashmir. Furthermore, local groups may act in the name of al-Qaeda in order to bolster their own reputation-even if they are not receiving support from the organization. \n \n http://www.infoplease.com/spot/terror-qaeda.html\n \n \n Essentially, Islamist militant cells are adapting an age-old activist slogan: Act locally, think globally. These \"franchise fees\" allow the group to use al Qaeda's name for their own benefit at no cost to al Qaeda's core leadership. In fact, the work of these so-called \"al Qaeda-linked groups\" turns into free advertising for the network when splashed across front pages and television screens.\n \n Beyond the franchise analogy, this system of remittance from Islamist militant cells is also similar to colonialism. Al Qaeda develops cells in different parts of the world, leaves them to function essentially on their own, and then sits back and reaps the financial rewards of their more profitable \"colonies.\"\n \n Unfortunately for counterterrorism authorities around the world, this method of funding sheds little light on the obscure underbelly of al Qaeda financing. The hawala system, the distribution of money through unofficial and hard-to-trace channels, and the millions of South Asian expatriates who collectively send enormous sums back home, mostly for legitimate, family reasons, are serious impediments. Combing through the flood of transactions to find the money going to al Qaeda is like finding the proverbial needle in a haystack.\n \n Furthermore, as there is no such thing as the \"Central Bank of al Qaeda,\" that can eventually be stormed, cleared out and boarded up, tracking and intercepting this money poses a serious challenge. In fact, it is unlikely the central funds are even hidden under one mattress. Although the al Qaeda network was designed as a loose affiliation from its inception, the war on terrorism since Sept. 11 has forced it to become even more diffuse. Because the affiliated cells must maintain a degree of self-sufficiency and cannot rely on the home office for logistics and support, attempting to track them back to \"headquarters\" has become virtually impossible. \n \n http://www.stratfor.com/seo/Story.neo?storyId=239604", 
   {
    "unicode_changes_made": true
   }, 
   117258, 
   null, 
   1115314680.0
  ], 
  [
   117365, 
   null, 
   "SteveRogers", 
   "I was looking for this one and just found it:\n \n White House and U.S. intelligence officials declined to provide any back-up data for how they developed the new number-or even to explain the methodology that was used, which they said was classified. The absence of any explanation, as well as the timing, prompted some counterterrorism experts to deride the figure as \"meaningless\" and predict the revision could fuel allegations that the administration is massaging terrorism data for political purposes. \n \n \"It's like a shell game,\" said Vince Cannistraro, a former top CIA counterterrorism official. \"This kind of thing is susceptible to all kinds of manipulation.\"\n \n An official with the recently disbanded 9/11 commission also dismissed the new number, noting that it was impossible to get a firm handle on precisely the number of Al Qaeda \"leaders\" that were in place at the time of the September 11 attacks-the definition that the CIA says it used as its baseline for the estimate.\n \n \"It was meaningless when they said two thirds and it's meaningless when they said three fourths,\" said the official, who asked not to be identified. \"This sounds like it was pulled out of somebody's orifice.\"\n \n Intelligence sources said that the CIA assessment of how much of the Al Qaeda leadership was out of commission included not only Al Qaeda operatives who were directly killed or captured by U.S. forces operating around the world, but also included those captured by authorities in Pakistan, Britain and Saudi Arabia.\n \n The CIA also did not make any change in the methodology which would have led to the recent upward revision of the figure, an official said. But the president's explanation in his speeches of what he is describing has changed: When Bush first used the \"nearly two thirds\" estimate in a nationally televised speech on Sept. 7, 2003 and again during his Jan. 20, 2004, State of the Union, he referred to Al Qaeda's \"known leaders.\" In his speech to the convention last week, he referred to Al Qaeda's \"key members and associates\"-a seemingly much larger number.\n \n Indeed, the \"known leaders\" of Al Qaeda prior to September 11 probably refers to a group that is no larger than about 20 to 25, according to Cannistraro. But the \"key members and associates\" formulation that Bush used in his convention speech could be a number that ranks in the hundreds if not thousands, depending on how \"associates\" is defined.\n \n A U.S. intelligence official pointed to one explanation for the increase-a number of highly publicized recent arrests of Al Qaeda operatives in Pakistan, including Mohammed Neem Noor Khan, a computer and communications specialists who is believed to have been a conduit for messages from Osama bin Laden to operatives in the West, and Ahmed Khalfan Ghailani, a Tanzanian national who had been wanted by the FBI for participation in the 1998 bombings of U.S. embassies in Africa. Another significant development was the arrest last month in Britain of Dhiren Barot, an Al Qaeda facilitator who is believed to have conducted surveillance on possible terror targets in New York, Washington and New Jersey.\n \n But it's far from clear that any of these figures would qualify as \"known leaders\" of Al Qaeda, the formulation that was used by the president to measure progress prior to last week's convention speech. Cannistraro noted that the term \"leaders\" generally implies an ability to exercise \"command and control\" over an organization. While the U.S. counterterrorism effort has unquestionably netted major \"leaders\" of Al Qaeda-such as Khalid Shaikh Mohammed, the mastermind of the 9/11 attacks, and Abu Zubaydah, the operational commander of the group-it has not yielded anybody of a comparable leadership level for some time. In any case, Cannistraro noted, \"when you say three fourths have been caught,\" it leaves out an important point that wasn't addressed by the president: \"Every one of these people have been replaced.\" \n \n http://msnbc.msn.com/id/5945061/site/newsweek/", 
   {
    "unicode_changes_made": true
   }, 
   117266, 
   null, 
   1115322900.0
  ], 
  [
   118309, 
   null, 
   "Desaix", 
   "I have never read such ridiculous nonsense in my lifetime as what has appeared in this thread. I guess it doesn't make any difference to someone who will just post pure crapola just to be noticed.\n\n \n Your mistaken.What SteveRogers is describing is the true nature of Islamic militancy.9/11 was a well planned operation by religious zealots that was funded by Osama and his associates(but not planned).Those 'brain damaged XXXXXX' were usually well educated and successfully pulled off a operation that could have went wrong in a million ways.To say there 'brain damaged XXXXXX' is not only wrong but it is dangerously close to underestmating and misunderstanding the enemy the US is fighting.More importantly,while the Al-Qaeda hardcore has been dispersed,the Islamic militant scene has grown in potency,support,range and pure mercilessness since 9/11 as Madrid,Bali and the continous bombings in Iraq prove.All those bombings occured without the support of the Al-Qaeda hardcore.The cells strategy that the Afghani veterans have used is almost perfect and doesn't need support from Osama and his cronies to operate.", 
   {}, 
   117010, 
   null, 
   1115493840.0
  ], 
  [
   118765, 
   null, 
   "Missouri Mule", 
   "Your mistaken.What SteveRogers is describing is the true nature of Islamic militancy.9/11 was a well planned operation by religious zealots that was funded by Osama and his associates(but not planned).Those 'brain damaged XXXXXX' were usually well educated and successfully pulled off a operation that could have went wrong in a million ways.To say there 'brain damaged XXXXXX' is not only wrong but it is dangerously close to underestmating and misunderstanding the enemy the US is fighting.More importantly,while the Al-Qaeda hardcore has been dispersed,the Islamic militant scene has grown in potency,support,range and pure mercilessness since 9/11 as Madrid,Bali and the continous bombings in Iraq prove.All those bombings occured without the support of the Al-Qaeda hardcore.The cells strategy that the Afghani veterans have used is almost perfect and doesn't need support from Osama and his cronies to operate.\n\n \n I don't know where you are getting your information but Khalid Sheikh Mohammad was the mastermind of 9/11 and he was #3 in bin Laden's hierarchy. He was captured about a year and half ago in Pakistan and this al-Libbi character was his successor. \n \n http://www.worldhistory.com/khalid-shaikh-mohammed.htm", 
   {}, 
   118309, 
   null, 
   1115575800.0
  ], 
  [
   118924, 
   null, 
   "SteveRogers", 
   "I don't know where you are getting your information but Khalid Sheikh Mohammad was the mastermind of 9/11 and he was #3 in bin Laden's hierarchy. He was captured about a year and half ago in Pakistan and this al-Libbi character was his successor. \n \n http://www.worldhistory.com/khalid-shaikh-mohammed.htm\n\n \n Meaningless. \n \n And Desaix is correct.", 
   {}, 
   118765, 
   null, 
   1115597940.0
  ], 
  [
   118940, 
   null, 
   "Desaix", 
   "I don't know where you are getting your information but Khalid Sheikh Mohammad was the mastermind of 9/11 and he was #3 in bin Laden's hierarchy. He was captured about a year and half ago in Pakistan and this al-Libbi character was his successor. \n \n http://www.worldhistory.com/khalid-shaikh-mohammed.htm\n\n \n Again there was no 'mastermind'.Osama and Zawahiri's involvement was no more than funding the operation and making the decision 2 years beforehand to strike America.Shaikh can be credited with helping the Hamburg cell in getting into America but also can the likes of Atef and other members of the Al-Qaeda hardcore.Also the idea of using bombs strapped to planes had already been thought up by the hamburg cell and other militants years before.\n \n What Shaikh and al-Libi have to do with my post exactly i don't know.The nature of Islamic militancy still stands.To say that the Al-Qaeda hardcore are still major players in the Islamic militant sceneis contradicting the belief that Bush has been successful in curtailing the Al-Qaeda hardcores ability to strike.\n \n I strongly suggest you read Jason Burke's Al-Qaeda=The True Story Of Radical Islam.\n \n http://www.amazon.com/exec/obidos/tg/detail/-/1850436665/104-6842804-6254311?v=glance", 
   {}, 
   118765, 
   null, 
   1115599920.0
  ], 
  [
   118942, 
   null, 
   "Missouri Mule", 
   "Meaningless. \n \n And Desaix is correct.\n\n \n You're just a fountain of knowledge and detail. Thanks for clearing that up.", 
   {}, 
   118924, 
   null, 
   1115599980.0
  ], 
  [
   118994, 
   null, 
   "SteveRogers", 
   "You're just a fountain of knowledge and detail. Thanks for clearing that up.\n\n \n Anytime. \n \n But I have given you information. You've given opinion and speculation. You tell me who has given more. emoticon_rolleyes \n \n BTW, Desaix was correct again. You should read his stuff. ;) emoticon_cool", 
   {}, 
   118942, 
   null, 
   1115608920.0
  ], 
  [
   119050, 
   null, 
   "Missouri Mule", 
   "Anytime. \n \n But I have given you information. You've given opinion and speculation. You tell me who has given more. emoticon_rolleyes \n \n BTW, Desaix was correct again. You should read his stuff. ;) emoticon_cool\n\n \n I'd rather get it straight. Like the official \"9/11 Commission Report\" for example. But if you really want to get your head out of the sand, try reading George Friedman's book; \"America's Secret War.\"\n \n BTW, I did read the reviews of your suggested book and it was the typical left wing propaganda. Basically made up stuff.", 
   {}, 
   118994, 
   null, 
   1115618580.0
  ], 
  [
   119116, 
   null, 
   "Desaix", 
   "I have read Friedmans America's secret wars,i found it excellent and very informative but i see little in it that disagred with what i said about islamic militancy.\n \n Paul Burke's book is the best book you could read on Al-Qaeda.Its impossible to tell,until you get to the conclusion just like America's secrets wars,what Burkes feelings on the war of Iraq are.And they don't change the facts.\n \n BTW,your final sentence is the sign of incredible ignorance and of a uncritical unobjective debater.Try and think outside of the usual left wing/right wing **** and you might learn something.", 
   {}, 
   119050, 
   null, 
   1115649180.0
  ], 
  [
   119216, 
   null, 
   "Missouri Mule", 
   "I have read Friedmans America's secret wars,i found it excellent and very informative but i see little in it that disagred with what i said about islamic militancy.\n \n Paul Burke's book is the best book you could read on Al-Qaeda.Its impossible to tell,until you get to the conclusion just like America's secrets wars,what Burkes feelings on the war of Iraq are.And they don't change the facts.\n \n BTW,your final sentence is the sign of incredible ignorance and of a uncritical unobjective debater.Try and think outside of the usual left wing/right wing **** and you might learn something.\n\n \n The argument you put forth is (as I understand it) is that Muslims are this mass blob of humanity that have all of this unfocused hatred toward the west and America in particular and that they do not require a leadership such as Al Queda to pose the threat that they do. \n \n I would argue that the war in Iraq is designed to change the dynamic in the Middle East to change their way of thinking and to marginalize the Al Queda types.\n \n I remember in the early days after 9/11 that the left said we would be ground up in Afghanistan and suffer the same fate as the Soviets who lost 14,000 dead and eventually led to the break-up of the Soviet Union. We have lost about 150 dead thus far and have ejected Al Queda and the Taliban. \n \n Now we are in Iraq and have kicked Saddam out of power and killed his two psycho sons. The left tells us that we have no hope of winning the war because all of this Muslim hatred toward the U.S. and we will eventually be driven out and told that we will lose the war as we allegedly lost in Vietnam. (We didn't.) \n \n It is my deeply held view that what is driving all of this is the left's insane hatred of the United States. The left would be extremely upset if the U.S. prevailed in Iraq because it would once again prove they are wrong and that appeasement and pacifism never won any wars. And be assured that we are very much in a war of civilizations. The Islamofacists are the natural heirs of Hitler's Nazis of WWII. Just as it was necessary to fight for an unconditional surrender in WWII, it is also necessary to do nothing less with the current threat. Iraq offers us a means to do what is required in the Middle East to fix this long festering problem; namely Iran and Pakistan. Libya has thrown in the towel. Syria has been effectively neutralized. Saudi Arabia has finally gotten their act together. We are killing off the terrorists in Iraq. We have had no further attacks on the U.S. and the left just can't stand it.", 
   {}, 
   119116, 
   null, 
   1115659500.0
  ], 
  [
   119219, 
   null, 
   "Diogenes99", 
   "Quite right, MM. The predictions that we will fail in Iraq and the rest of the war on terror are merely wishful thinking on the part of those who wish to see the western world fail. The internal dynamic of the Middle East is changing for the better as the people take control of their own lives and fortunes.", 
   {}, 
   119216, 
   null, 
   1115659980.0
  ], 
  [
   119757, 
   null, 
   "SteveRogers", 
   "I'd rather get it straight. Like the official \"9/11 Commission Report\" for example. But if you really want to get your head out of the sand, try reading George Friedman's book; \"America's Secret War.\"\n \n BTW, I did read the reviews of your suggested book and it was the typical left wing propaganda. Basically made up stuff.\n\n \n You need to actually read that report with unbaised eyes and you will know it supports me and not you. \n \n I have, and it is mistaken, but you might read Scheuer's book \"Imperial Hubris.\" Much more to the point. And as I assess you, you are afraid of actual assessment. You fear much, but mostly you fear the truth. :(", 
   {}, 
   119050, 
   null, 
   1115699820.0
  ], 
  [
   119758, 
   null, 
   "SteveRogers", 
   "Quite right, MM. The predictions that we will fail in Iraq and the rest of the war on terror are merely wishful thinking on the part of those who wish to see the western world fail. The internal dynamic of the Middle East is changing for the better as the people take control of their own lives and fortunes.\n\n \n \n You don\\'t really believe this do you? I hope you don\\'t vote. :xcensored", 
   {}, 
   119219, 
   null, 
   1115699880.0
  ], 
  [
   119768, 
   null, 
   "Missouri Mule", 
   "You need to actually read that report with unbaised eyes and you will know it supports me and not you. \n \n I have, and it is mistaken, but you might read Scheuer\\'s book \"Imperial Hubris.\" Much more to the point. And as I assess you, you are afraid of actual assessment. You fear much, but mostly you fear the truth. :(\n\n \n Scheuer is a little full of himself, doncha think?", 
   {}, 
   119757, 
   null, 
   1115702400.0
  ], 
  [
   119771, 
   null, 
   "SteveRogers", 
   "Scheuer is a little full of himself, doncha think?\n\n \n No, he makes a lot of sense to me.", 
   {}, 
   119768, 
   null, 
   1115702520.0
  ], 
  [
   119781, 
   null, 
   "Missouri Mule", 
   "No, he makes a lot of sense to me.\n\n \n Not everyone thinks so. I\\'ve listened to him. I\\'ve also listened to others, one of which spent some 27 years in the intelligence field. He didn\\'t seem to think much of Scheuer. I\\'ll bet the farm that James Woolsey could cut Scheuer a new bunghole in about five minutes. Now there is someone I would trust implicitly as having full knowledge and understanding of terrorism and exactly what we are facing today. Clinton would have done himself a world of good if he had had the good sense to have permitted Woolsey to brief him each day. But he didn\\'t. He had plenty of time to great and visit with Monica. But I\\'m not going to blame Clinton for 9/11. I do blame everyone who had other items on their agenda besides the protection of the citizens of the United States. Bush also shares in that blame but at least he hasn\\'t sit on his hands since 9/11. He\\'s been active and thus far we haven\\'t had a single attack on U.S. soil since 9/11.", 
   {}, 
   119771, 
   null, 
   1115703240.0
  ], 
  [
   119797, 
   null, 
   "SteveRogers", 
   "Not everyone thinks so. I\\'ve listened to him. I\\'ve also listened to others, one of which spent some 27 years in the intelligence field. He didn\\'t seem to think much of Scheuer. I\\'ll bet the farm that James Woolsey could cut Scheuer a new bunghole in about five minutes. Now there is someone I would trust implicitly as having full knowledge and understanding of terrorism and exactly what we are facing today. Clinton would have done himself a world of good if he had had the good sense to have permitted Woolsey to brief him each day. But he didn\\'t. He had plenty of time to great and visit with Monica. But I\\'m not going to blame Clinton for 9/11. I do blame everyone who had other items on their agenda besides the protection of the citizens of the United States. Bush also shares in that blame but at least he hasn\\'t sit on his hands since 9/11. He\\'s been active and thus far we haven\\'t had a single attack on U.S. soil since 9/11.\n\n \n Wow, an orginal tactic, blaming Clinton. And that is what you are trying to do.\n \n Bush isn\\'t doing anything in Iraq to protect us. He didn\\'t go after the enemy when he went there. Instead, he made new enemies and has new people killing us. Right now we are at 1600. Now that is 1600 people who wouldn\\'t be dead if we hadn\\'t went in, not counting Iraqi civilians. And for our efforts? Terrorism tripled. Terrorist groups growing. Now that\\'s what I call a great trade off. :xcensored", 
   {}, 
   119781, 
   null, 
   1115704200.0
  ], 
  [
   119829, 
   null, 
   "Missouri Mule", 
   "Wow, an orginal tactic, blaming Clinton. And that is what you are trying to do.\n \n Bush isn\\'t doing anything in Iraq to protect us. He didn\\'t go after the enemy when he went there. Instead, he made new enemies and has new people killing us. Right now we are at 1600. Now that is 1600 people who wouldn\\'t be dead if we hadn\\'t went in, not counting Iraqi civilians. And for our efforts? Terrorism tripled. Terrorist groups growing. Now that\\'s what I call a great trade off. :xcensored\n\n \n Can you read? I specifically said I wasn\\'t blaming Clinton. \"But I\\'m not going to blame Clinton for 9/11.\"  I said that Clinton would have done himself a world of good had he taken the time to visit with Woolsey once or twice during his term. My point was that Woolsey isn\\'t one of these guys who thinks he knows something. Woolsey is one of those guys who actually does know something. He knows a lot; a whole lot about terrorism and isn\\'t writing gibberish like Scheuer is. \n \n You think 1600 deaths are bad. Think about 500,000 or 1 million if the terrorists get a nuclear weapon. Then the American people won\\'t care if we lose 100,000 men if that is what it takes to stop terrorism. We didn\\'t get all self-righteous in WWII when we were attacked at Pearl Harbor. We knew then and there we either got busy and won the war or we would be living under Nazi tyranny sooner or later. Hitler, if you will recall, damn near won that war. We\\'d better get serious about terror or we can kiss our rear ends goodbye. Bin Laden is counting on the weak sisters like yourself who are good at hand wringing but not so good at doing what is required to beat his XXX.", 
   {}, 
   119797, 
   null, 
   1115706240.0
  ], 
  [
   119845, 
   null, 
   "SteveRogers", 
   "Can you read? I specifically said I wasn\\'t blaming Clinton. \"But I\\'m not going to blame Clinton for 9/11.\"  I said that Clinton would have done himself a world of good had he taken the time to visit with Woolsey once or twice during his term. My point was that Woolsey isn\\'t one of these guys who thinks he knows something. Woolsey is one of those guys who actually does know something. He knows a lot; a whole lot about terrorism and isn\\'t writing gibberish like Scheuer is. \n \n You think 1600 deaths are bad. Think about 500,000 or 1 million if the terrorists get a nuclear weapon. Then the American people won\\'t care if we lose 100,000 men if that is what it takes to stop terrorism. We didn\\'t get all self-righteous in WWII when we were attacked at Pearl Harbor. We knew then and there we either got busy and won the war or we would be living under Nazi tyranny sooner or later. Hitler, if you will recall, damn near won that war. We\\'d better get serious about terror or we can kiss our rear ends goodbye. Bin Laden is counting on the weak sisters like yourself who are good at hand wringing but not so good at doing what is required to beat his XXX.\n\n \n \n Yes, I read that, which is why I said you were doing it anyway, and you were.\n \n And another nice try to avoid the truth by creating a false dilema. You can\\'t defend the actions so you throw up a hypothetical in an effort to blind reason with fear. And no matter how often you do that, attacking the wrong people won\\'t make that better. It is illogical to pretend otherwise. \n \n I promote going after the actually bad guys and you just mindlessly think hitting anyone is the same thing. And Hitler, unlike Saddam, actually was a threat. \n \n Seriously, you need to start being honest about this.", 
   {}, 
   119829, 
   null, 
   1115706900.0
  ], 
  [
   119863, 
   null, 
   "Missouri Mule", 
   "Yes, I read that, which is why I said you were doing it anyway, and you were.\n \n And another nice try to avoid the truth by creating a false dilema. You can\\'t defend the actions so you throw up a hypothetical in an effort to blind reason with fear. And no matter how often you do that, attacking the wrong people won\\'t make that better. It is illogical to pretend otherwise. \n \n I promote going after the actually bad guys and you just mindlessly think hitting anyone is the same thing. And Hitler, unlike Saddam, actually was a threat. \n \n Seriously, you need to start being honest about this.\n\n \n Bullcrap. I was providing a history lesson to you since you obviously haven\\'t a clue about what you are talking about. What I said about Clinton was spot on accurate. If you do not believe that Saddam was a threat then you don\\'t have any idea of what you are talking about. The sanctions could not have been kept on forever. We were forever being reminded of the 500,000 Iraqi children who had starved under the sanctions. We had flown some 150,000 sorties to keep Saddam from murdering his citizens en masse. Had the sanctions been lifted, then there was nothing to have prevented him from reconstituing his armed forces which were at the time of the first Gulf War the fourth largest standing army in the world behind the U.S., Soviet Union, and China. With all of his oil money he could have bought whatever he wanted and we would have been back to square one and if he decided to do what he did in 1990 then we would have had to go to war once again to ensure he didn\\'t invade Kuwait and Saudi Arabia to control their oil reserves. Our national interests were at stake in 1991. Had Saddam succeeded in throwing out the sanctions he would most certainly have been a \"threat.\"", 
   {}, 
   119845, 
   null, 
   1115708040.0
  ], 
  [
   119868, 
   null, 
   "SteveRogers", 
   "Bullcrap. I was providing a history lesson to you since you obviously haven\\'t a clue about what you are talking about. What I said about Clinton was spot on accurate. If you do not believe that Saddam was a threat then you don\\'t have any idea of what you are talking about. The sanctions could not have been kept on forever. We were forever being reminded of the 500,000 Iraqi children who had starved under the sanctions. We had flown some 150,000 sorties to keep Saddam from murdering his citizens en masse. Had the sanctions been lifted, then there was nothing to have prevented him from reconstituing his armed forces which were at the time of the first Gulf War the fourth largest standing army in the world behind the U.S., Soviet Union, and China. With all of his oil money he could have bought whatever he wanted and we would have been back to square one and if he decided to do what he did in 1990 then we would have had to go to war once again to ensure he didn\\'t invade Kuwait and Saudi Arabia to control their oil reserves. Our national interests were at stake in 1991. Had Saddam succeeded in throwing out the sanctions he would most certainly have been a \"threat.\"\n\n \n \n No, Saddam wasn\\'t a threat. How fast did we take Iraq? Twice? No, only in the the delusions of those with the fever was Saddam a threat. \n \n And frankly, you have no idea what you are talking about. Saddam couldn\\'t take anyone we didn\\'t want him to. Or that we want him too. As I recall Iran kicked him fairly well.", 
   {}, 
   119863, 
   null, 
   1115708280.0
  ], 
  [
   119887, 
   null, 
   "Missouri Mule", 
   "No, Saddam wasn\\'t a threat. How fast did we take Iraq? Twice? No, only in the the delusions of those with the fever was Saddam a threat. \n \n And frankly, you have no idea what you are talking about. Saddam couldn\\'t take anyone we didn\\'t want him to. Or that we want him too. As I recall Iran kicked him fairly well.\n\n \n We \"took\" Saddam. How well would Saudi Arabia and Kuwait fare? Iran \"kicked him\" with the lives of about 1,000,000 young Iranian boys who were cannon fodder. Iran, if I recall correctly has about three times the population.\n \n Frankly, your arguments leave me cold. Your argument boils down to a purely defensive posture and I know of no wars that have ever been won using such a strategy.", 
   {}, 
   119868, 
   null, 
   1115709120.0
  ], 
  [
   119899, 
   null, 
   "SteveRogers", 
   "We \"took\" Saddam. How well would Saudi Arabia and Kuwait fare? Iran \"kicked him\" with the lives of about 1,000,000 young Iranian boys who were cannon fodder. Iran, if I recall correctly has about three times the population.\n \n Frankly, your arguments leave me cold. Your argument boils down to a purely defensive posture and I know of no wars that have ever been won using such a strategy.\n\n \n Before we went in this time, SA and Kuwait both were ready to make nice with Saddam. As were we for that matter.\n \n And I have said nothing defensive posture. Say we have a serious organized drug cartel problem in your home town. Killing kids left and right who get caught in the cross fire or from the drugs. Serious stuff. \n \n Now you police chief says he is tough. He is going to end pornography and that will spread morals which will lead to no more crime. Now, the numbers tell us more people are dying and nothing is being done. You would argue that to actually deal with the drug cartel would be appeasement of hookers. And that surely the police know more than I. \n \n Sorry, that is just nonsense and you just don\\'t know much about this. You certainly aren\\'t thinking it through.", 
   {}, 
   119887, 
   null, 
   1115709780.0
  ], 
  [
   120058, 
   null, 
   "Missouri Mule", 
   "Before we went in this time, SA and Kuwait both were ready to make nice with Saddam. As were we for that matter.\n \n And I have said nothing defensive posture. Say we have a serious organized drug cartel problem in your home town. Killing kids left and right who get caught in the cross fire or from the drugs. Serious stuff. \n \n Now you police chief says he is tough. He is going to end pornography and that will spread morals which will lead to no more crime. Now, the numbers tell us more people are dying and nothing is being done. You would argue that to actually deal with the drug cartel would be appeasement of hookers. And that surely the police know more than I. \n \n Sorry, that is just nonsense and you just don\\'t know much about this. You certainly aren\\'t thinking it through.\n\n \n They also told us to get on with it or just leave. That would have brought about another Gulf war with all the attendent troop build up that we had to go through to conduct the first war. We can\\'t just keep going back to the same failed act every decade. Sooner or later he was going to get WMD, if he didn\\'t already have them, use them and set off WWIV with the loss of millions if not billions of lives.", 
   {}, 
   119899, 
   null, 
   1115743380.0
  ], 
  [
   120082, 
   null, 
   "SteveRogers", 
   "They also told us to get on with it or just leave. That would have brought about another Gulf war with all the attendent troop build up that we had to go through to conduct the first war. We can\\'t just keep going back to the same failed act every decade. Sooner or later he was going to get WMD, if he didn\\'t already have them, use them and set off WWIV with the loss of millions if not billions of lives.\n\n \n Sooner or later everyone is going to get wmd. emoticon_rolleyes Pay attention.\n \n Now, while no one wants anyone having wmds, you make a lot of assumptions. You assume we couldn\\'t stop him without invasion. I don\\'t believe that is so. Nor do I believe he would use them if he had them. Outside of self defense, he had not used them before, and he certainly never used them against anyone who would kill him.\n \n How, Pakistan has passed on secrets. The former Soviet Union is still a threat. I suggest you rethink this. You really don\\'t seem to unbderstand that greed and fear of American aggression are greater risks to our security than some p**ant like Saddam.", 
   {}, 
   120058, 
   null, 
   1115744820.0
  ], 
  [
   120107, 
   null, 
   "Diogenes99", 
   "You really don't seem to unbderstand that greed and fear of American aggression are greater risks to our security than some p**ant like Saddam.\nWishful thinking.", 
   {}, 
   120082, 
   null, 
   1115746680.0
  ], 
  [
   120130, 
   null, 
   "SteveRogers", 
   "Wishful thinking.\n\n \n Well, it explains a lot. :xcensored", 
   {}, 
   120107, 
   null, 
   1115748120.0
  ], 
  [
   120265, 
   null, 
   "Missouri Mule", 
   "Sooner or later everyone is going to get wmd. emoticon_rolleyes Pay attention.\n \n Now, while no one wants anyone having wmds, you make a lot of assumptions. You assume we couldn't stop him without invasion. I don't believe that is so. Nor do I believe he would use them if he had them. Outside of self defense, he had not used them before, and he certainly never used them against anyone who would kill him.\n \n How, Pakistan has passed on secrets. The former Soviet Union is still a threat. I suggest you rethink this. You really don't seem to unbderstand that greed and fear of American aggression are greater risks to our security than some p**ant like Saddam.\n\n \n Let me remind you that Saddam fired about 40 Scud missiles at Israel during the first Gulf War. (And they had nothing to do with the war.) Suppose the Scuds had been nuclear tipped. You think he was so harmless; put that in your pipe and smoke it.", 
   {}, 
   120082, 
   null, 
   1115765820.0
  ], 
  [
   120425, 
   null, 
   "SteveRogers", 
   "Let me remind you that Saddam fired about 40 Scud missiles at Israel during the first Gulf War. (And they had nothing to do with the war.) Suppose the Scuds had been nuclear tipped. You think he was so harmless; put that in your pipe and smoke it.\n\n \n Are you seriously trying to use that as justifcation? emoticon_wow Just when I think you can't get wilder.\n \n Meaningless. That was during the gulf war and there was a reason. It's not like he was sitting there saying, \"Gee, it's a slow day. I know, let's fire on Israel.\" No, he was already under attack and about to be whupped. \n \n So, it you have nothing better than that, you lose.", 
   {}, 
   120265, 
   null, 
   1115787060.0
  ], 
  [
   120443, 
   null, 
   "Missouri Mule", 
   "Are you seriously trying to use that as justifcation? emoticon_wow Just when I think you can't get wilder.\n \n Meaningless. That was during the gulf war and there was a reason. It's not like he was sitting there saying, \"Gee, it's a slow day. I know, let's fire on Israel.\" No, he was already under attack and about to be whupped. \n \n So, it you have nothing better than that, you lose.\n\n \n No, you lose. You lose any respect as someone who has an iota of common sense and decency as an American. He was under attack because he had invaded Kuwait and we were in the process of throwing him out of Kuwait. There was no justification to be firing scuds at innocent Israelis who were not a part of that war. \n \n You don't have a clue; not a single clue about Saddam. You just parrot the typical left-wing crapola. And it's doubly sickening coming from an American.", 
   {}, 
   120425, 
   null, 
   1115791020.0
  ], 
  [
   120449, 
   null, 
   "SteveRogers", 
   "No, you lose. You lose any respect as someone who has an iota of common sense and decency as an American. He was under attack because he had invaded Kuwait and we were in the process of throwing him out of Kuwait. There was no justification to be firing scuds at innocent Israelis who were not a part of that war. \n \n You don't have a clue; not a single clue about Saddam. You just parrot the typical left-wing crapola. And it's doubly sickening coming from an American.\n\n \n Again he was under attack. Listen to yourself. And talk about a parrot? \n \n \n No one is arguing Saddam was a saint. But he wasn't and threat and he wasn't insane enough to commit sucide. You are too busy being a lemming and being led over the cliff with president Shrub (Molly Irvins -- GW is to small to be a Bush). ;)", 
   {}, 
   120443, 
   null, 
   1115791920.0
  ], 
  [
   120781, 
   null, 
   "Diogenes99", 
   "Meaningless. That was during the gulf war and there was a reason. It's not like he was sitting there saying, \"Gee, it's a slow day. I know, let's fire on Israel.\" No, he was already under attack and about to be whupped.\nIt is hardly meaningless. Israel was not part of the coalition fighting against Iraq, and the missiles were simply an act of terrorism to provoke Israel.\n \n Maybe it's genetic, or something in the water over there, but Arab tyrants seem to tend toward being blowhards and whenever their impotence against an armed enemy is demonstrated, they turn to attacking soft targets to re-affirm their sorry excuse for manhood. And that is why the civilized world can never allow them to have serious weapons.\n \n Appeasement - the irresistible need to legitimize the grievances of a thug - is the hallmark of left wing crapola.", 
   {}, 
   120449, 
   null, 
   1115837400.0
  ], 
  [
   120812, 
   null, 
   "Missouri Mule", 
   "It is hardly meaningless. Israel was not part of the coalition fighting against Iraq, and the missiles were simply an act of terrorism to provoke Israel.\n \n Maybe it's genetic, or something in the water over there, but Arab tyrants seem to tend toward being blowhards and whenever their impotence against an armed enemy is demonstrated, they turn to attacking soft targets to re-affirm their sorry excuse for manhood. And that is why the civilized world can never allow them to have serious weapons.\n \n Appeasement - the irresistible need to legitimize the grievances of a thug - is the hallmark of left wing crapola.\n\n \n I couldn't have said it better. But don't expect the bone headed left to understand reality. They have their heads planted firmly up their tailpipes.", 
   {}, 
   120781, 
   null, 
   1115838960.0
  ], 
  [
   120923, 
   null, 
   "SteveRogers", 
   "It is hardly meaningless. Israel was not part of the coalition fighting against Iraq, and the missiles were simply an act of terrorism to provoke Israel.\n \n Maybe it's genetic, or something in the water over there, but Arab tyrants seem to tend toward being blowhards and whenever their impotence against an armed enemy is demonstrated, they turn to attacking soft targets to re-affirm their sorry excuse for manhood. And that is why the civilized world can never allow them to have serious weapons.\n \n Appeasement - the irresistible need to legitimize the grievances of a thug - is the hallmark of left wing crapola.\n\n \n \n First, I wasn't justifying anything, only pointing out the truth. Only someone dishonest spins the truth that way.\n \n Second, define thug. Would you agree a thug picks an easy target, justifies his actions with shallow and clearly inaccurate reasoning? That a thug has trouble taking criticism or admitting error? That a thug blames others for his own problems? A thug never listens to decenting views and always maintains he is right no matter what the evidence says? And would you agree that to support such is to appease?\n \n Hummmm? What was that about wmds and how was desent handled? \n \n No, it was meaningless. Doesn't justify our actions. And I really think you need to quit being an appeaser.", 
   {}, 
   120781, 
   null, 
   1115848800.0
  ], 
  [
   121016, 
   null, 
   "Diogenes99", 
   "First, I wasn't justifying anything, only pointing out the truth. Only someone dishonest spins the truth that way.\nWeak. Very weak. What you said was \"Meaningless. That was during the gulf war and there was a reason\" which is obiously nonsense.\n \n \nSecond, define thug. Would you agree a thug picks an easy target, justifies his actions with shallow and clearly inaccurate reasoning? That a thug has trouble taking criticism or admitting error? That a thug blames others for his own problems? A thug never listens to decenting views and always maintains he is right no matter what the evidence says? And would you agree that to support such is to appease?\nSometimes the targets are not as easy as the thug might think, or - in the case of a superb political infighter and moronic strategist such as Saddam - he might misread the likely response of his neighbors. Otherwise, I'm inclined to agree with the rest of your descriptions.\n \n It also occurs to me that much of your description - shallow thinking, reluctance to hear dissent, disregard of evidence, blaming others for self-created problems - are also characteristics of the left, those who blame America first and claim we are losing the war on terror. Perhaps it is a need to validate your own thinking that leads to the ridiculous claim that somehow Saddam, bin Laden, FARC, and other assorted thugs actually have legitimate political aspirations?", 
   {}, 
   120923, 
   null, 
   1115858160.0
  ], 
  [
   121237, 
   null, 
   "SteveRogers", 
   "The argument was meaningless and there was something going on and a context. Only weak thinking pretends otherwise.\n \n And blame as well as credit goes where it is earned and deserved. ;)", 
   {}, 
   121016, 
   null, 
   1115882640.0
  ], 
  [
   121578, 
   null, 
   "Diogenes99", 
   "I accept your surrender on the issues. ;)", 
   {}, 
   121237, 
   null, 
   1115925240.0
  ], 
  [
   121695, 
   null, 
   "SteveRogers", 
   "I accept your surrender on the issues. ;)\n\n \n \n \n emoticon_xdonno :xbanghead emoticon_xkill emoticon_xbouncer \n \n \n BAd news. No one has surrendered. My point is made.", 
   {}, 
   121578, 
   null, 
   1115934240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Letter to Zarqawi", 
  "url": "http://www.4forums.com/political/peace-middle-east/5046-letter-zarqawi.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5046, 
  "discussion_files": [
   [
    "16919.html", 
    "http://www.4forums.com/political/peace-middle-east/5046-letter-zarqawi-print.html"
   ], 
   [
    "16920.html", 
    "http://www.4forums.com/political/peace-middle-east/5046-letter-zarqawi-4-print.html"
   ], 
   [
    "16921.html", 
    "http://www.4forums.com/political/peace-middle-east/5046-letter-zarqawi-3-print.html"
   ], 
   [
    "16922.html", 
    "http://www.4forums.com/political/peace-middle-east/5046-letter-zarqawi-2-print.html"
   ]
  ], 
  "identifier": 5046
 }
]