[
 [
  [
   6337, 
   null, 
   "lurch", 
   "Army chaplain offers baptisms, baths \n \n One of us doesn't understand christianity.", 
   {
    "post_info": {
     "post_title": "Proud to be a christian?"
    }
   }, 
   null, 
   null, 
   1049907480.0
  ], 
  [
   6338, 
   null, 
   "thistownwilleat", 
   "Pathetic.", 
   {}, 
   6337, 
   null, 
   1049908620.0
  ], 
  [
   6339, 
   null, 
   "Crim", 
   "'Regardless of their motives,'' Llano said, ``I get the chance to take them closer to the Lord.'\n \n \n Hey XXXXX.\n They just want the water. Taking a bath doesn't get you closer to a sky fairy.", 
   {}, 
   6337, 
   null, 
   1049909580.0
  ], 
  [
   6350, 
   null, 
   "gilligan8503", 
   "it looks like something www.theonion.com would publish.", 
   {}, 
   6337, 
   null, 
   1049925720.0
  ], 
  [
   6370, 
   null, 
   "thistownwilleat", 
   "Oh dear Lord...the onion is why I wake up in the mornings. They're talking about making it a pay site though. My world would just crumble.", 
   {}, 
   6337, 
   null, 
   1049940360.0
  ], 
  [
   6391, 
   null, 
   "gilligan8503", 
   "bullsh*t! i wouldn't support it.", 
   {}, 
   6337, 
   null, 
   1049947800.0
  ], 
  [
   6699, 
   null, 
   "Cuchulainn", 
   "Chaplains are unconstitutional but they may serve a purpose in giving support to theistic troops in stressful situations. I don't like it but if it helps the troops, I support it.\n \n But it needs to be fair. We Atheist pay taxes. We pay the salaries of Military, Congressional, and White House chaplains. That is not right.\n \n If they now have Christian Caplains (Catholic, Protestant, Ortho, and Fundamentalist), Rabbis, and one Muslim as far as I know.\n \n I would insist on two conditions if I had the power to make it fair. First they must abide by a \"No proselytising\" regulation for which the penalty can be courts martial. There should be Buddhist Monks, Brahaman priests, Wiccan clergy (whatever they are called), Pagan priests (i.e. Druids, Native American Medicine Men/shamans), Satanist priests, and most importantly Atheist Counsellors given the status of Chaplains to help deal with the stresses of the 10% Atheists in the military.\n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "Chaplains in the Army"
    }
   }, 
   6337, 
   null, 
   1050458760.0
  ], 
  [
   6753, 
   null, 
   "lurch", 
   "Actually, I found military chaplains to be honest and sincere men. The guy mentioned in the article, if it is true, seems to be a new breed of fundy christian for a military chaplain. He seems to have fallen out of the stupid tree and hit every branch on the way down. Most were very careful about their role and about how they conducted themselves. Their services, whether actual religious services, counseling, or even just a willing ear, were available to all just by asking. \"I want to see the chaplain,\" is one of the few requests by a soldier that cannot be denied under any circumstances. They frequently acted as a go between who took the side of the enlisted men when there were issues with NCOs or officers. They did so with no strings attached - never was I aware of any chaplain proselytizing. They were always available but they never imposed themselves or their beliefs - at least not to my knowledge.\n \n At one duty station my best friend was the chaplain. We spent hours talking about all manner of things, including religion, politics and evolution. Once at a commander's staff meeting, when the subject of the quality of food in the enlisted mess hall came up, the commander commented that he didn't understand the complaints since the food quality there was the same as in the officer's mess. The chaplain (a captain) stood and stated, \"That's XXXXXXXX, colonel. I eat in the enilsted mess 4 or 5 times a week and I can guarantee you that the quality isn't the same. Maybe if you actually had to eat there it would improve.\" To the colonel's credit, he did and it did.", 
   {}, 
   6337, 
   null, 
   1050527580.0
  ], 
  [
   6757, 
   null, 
   "Cuchulainn", 
   "Originally posted by lurch \n Actually, I found military chaplains to be honest and sincere men. The guy mentioned in the article, if it is true, seems to be a new breed of fundy christian for a military chaplain. He seems to have fallen out of the stupid tree and hit every branch on the way down. Most were very careful about their role and about how they conducted themselves. Their services, whether actual religious services, counseling, or even just a willing ear, were available to all just by asking. \"I want to see the chaplain,\" is one of the few requests by a soldier that cannot be denied under any circumstances. They frequently acted as a go between who took the side of the enlisted men when there were issues with NCOs or officers. They did so with no strings attached - never was I aware of any chaplain proselytizing. They were always available but they never imposed themselves or their beliefs - at least not to my knowledge.\n \n At one duty station my best friend was the chaplain. We spent hours talking about all manner of things, including religion, politics and evolution. Once at a commander's staff meeting, when the subject of the quality of food in the enlisted mess hall came up, the commander commented that he didn't understand the complaints since the food quality there was the same as in the officer's mess. The chaplain (a captain) stood and stated, \"That's XXXXXXXX, colonel. I eat in the enilsted mess 4 or 5 times a week and I can guarantee you that the quality isn't the same. Maybe if you actually had to eat there it would improve.\" To the colonel's credit, he did and it did. \n \n \n I was also in the Army, as a physician. I found the chaplains very helpful in wounded or sick soldiers or dependents. They would make the contacts to help bring family, or arrange compassionate transfers to the home areas. At one pst, a major medical centre, we formed an odd group of friends. We ate at the mess hall and discussed god, evolution, etc. as you did. I was one of the Atheists along with the Neuropsychologist. another physician and close friend was a Baptist, the senior chaplain was a Baptist and friend, and the third was a Nuclear Medicine specialist, and Christian. We met at lunch almost every day. And once per week I made hospital rounds on the neurology patients with the other physician, the Neuropsychologist, and often the Chaplain. We discussed each case and gave our specific inputs and observations. I found it quite helpful.\n \n The Chaplain died a few years ago, and I was very saddened by his loss.\n \n I know the system works rather well. My point in the prior post is that \"in principle\" there should be tax supported chaplans of multiple religions and atheist counsellors that could serve similar functions.\n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "I had similar experiences."
    }
   }, 
   6337, 
   null, 
   1050538920.0
  ], 
  [
   6786, 
   null, 
   "Habbit", 
   "Cuchulainn-\n \n \nBut it needs to be fair. We Atheist pay taxes. We pay the salaries of Military, Congressional, and White House chaplains. That is not right.\n\n \n Oh my God! Atheists pay taxes! So do Christians! So do Muslims! So do Jews! etc. etc. etc. Religious people have to pay for the religion of atheists to be spread in public schools. The door opens both ways, if you're going to be against one, you should also be against the other.", 
   {}, 
   6337, 
   null, 
   1050601560.0
  ], 
  [
   6791, 
   null, 
   "Crim", 
   "Religious people have to pay for the religion of atheists to be spread in public schools.\n \n \n What religion would that be?\n Atheists are almost all nonreligious and I don't see much Buddhism being taught in schools.", 
   {}, 
   6337, 
   null, 
   1050601920.0
  ], 
  [
   6797, 
   null, 
   "lurch", 
   "So Habbit supports the use of taxes to support his religion. Why am I not surprised?", 
   {}, 
   6337, 
   null, 
   1050611760.0
  ], 
  [
   6802, 
   null, 
   "Habbit", 
   "idiot-\n \n \nSo Habbit supports the use of taxes to support his religion. Why am I not surprised?\n\n \n So Idiot is twisting my words yet again. Why am I not surprised? \n \n Crim-\n \n \nWhat religion would that be?\n\n \n The religion of atheism and of evolution (completely different topic).", 
   {}, 
   6337, 
   null, 
   1050616200.0
  ], 
  [
   6803, 
   null, 
   "Crim", 
   "Atheism is a religion like bald is a hair color.\n You confuse secular with atheist. \n \n ...And apparently you don't want biology taught in classrooms.", 
   {}, 
   6337, 
   null, 
   1050616320.0
  ], 
  [
   6813, 
   null, 
   "Cuchulainn", 
   "Originally posted by Habbit \n [B]Cuchulainn-\n \n \n \n Oh my God! Atheists pay taxes! So do Christians! So do Muslims! So do Jews! etc. etc. etc. \n \n But Jews and Atheists are in higher tax brackets because our superior education, overrepresentation in professions, and overall greater rational skills. We are 10% of the population but I guarantee you that we pay a higher percentage of taxes.\n \n Religious people have to pay for the religion of atheists to be spread in public schools.\n \n That is an ignorant comment. There is no religion of Atheists. That is rubbish. Name the Gods, name the dogma, name the churches. Your ignorance and stupidity are shameful. I suspect that what you call Atheist religion is science, algebra, trigonometry, geometry, geology (spherical Earth with tectonic plates and continental drift-earthquakes-volcanoes), evolution, heliocentric solar system, billions of galaxies with billions of stars. None of that is found in the Black Book of Superstition and Ignorance (Bible). You want them to limit science. They already do. That is why Americans are the most scientifically illiterate people in the industrialised world. Because of people like you, America is headed toward third world status. You are more anti-American than Osama Bin Laden, whose beliefs you share.\n \n  The door opens both ways, if you're going to be against one, you should also be against the other. \n\n \n I am against them all. I would oppose chaplains of any kind in congress, and the Fundamentalist President's White House. In the Army the chaplains do much good. I agree on their being paid. However if paid by Taxes, I object to Christians only being chaplains. I know there are token Jews and maybe a Muslim. There should be Buddhist chaplains, Hindu Chaplains, American Indian Chaplains, and while Atheists cannot be clergymen they can be counsellors (social workers perhaps) to perform the same social functions of religious chaplains. That would be fair and I would not object to my taxes being used if they are being used fairly. I resent in principle that my taxes (on a physician's income) pay for mostly Christian chaplains who preach what I consider to be lies and rubbish, superstition and mythology.\n \n Cuchulainn", 
   {
    "post_info": {
     "attachments": 1, 
     "post_title": "We do pay taxes."
    }
   }, 
   6337, 
   null, 
   1050636180.0
  ], 
  [
   6814, 
   null, 
   "Cuchulainn", 
   "Originally posted by Crim \n Atheism is a religion like bald is a hair color.\n You confuse secular with atheist. \n \n There are Catholic \"secular priests.\" But I doubt very much that there are Atheist Pentacostal Ministers.\n \n ...And apparently you don't want biology taught in classrooms. \n \n \n \n \n If Atheism is a religon, then health is a type of disease.\n \n If Atheism is a religion, then sanity is a mental illness.\n \n If Atheism is a religion, then abstinence is a form of sex.\n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "Atheism a religion?"
    }
   }, 
   6337, 
   null, 
   1050637020.0
  ], 
  [
   6919, 
   null, 
   "Habbit", 
   "I was half-finished typing a reply and I opened another window, but it was \"restored down\" (the little windows on the top right of the screen, next to the minimize and close buttons) and I tried to click the maximize button (what the button changes to when you click restore down) and I accidently hit close on the reply window, so that really sucks. Fortunately for you, Cuchulainn, I missed another chance to make you look stupid, but maybe if I ever get really bored, I'll come and type another reply.", 
   {}, 
   6337, 
   null, 
   1050891120.0
  ], 
  [
   6920, 
   null, 
   "gilligan8503", 
   "does anyone else find habbit's reply hilarious... i am laughing out loud.", 
   {}, 
   6337, 
   null, 
   1050891420.0
  ], 
  [
   6930, 
   null, 
   "lurch", 
   "Leave poor hobble - the mental cripple - alone. He can't help it. He thinks that it is only a matter of opinion that circles can't be squares. He is now reduced to nothing more than name calling and insults. No substance. He shot his wad and now he's done. Nothing left but babble.", 
   {}, 
   6337, 
   null, 
   1050899640.0
  ], 
  [
   6969, 
   null, 
   "Habbit", 
   "idiot-\n \n \nHe thinks that it is only a matter of opinion that circles can't be squares. \n\n \n Not really. My opinion is that you're an idiot, especially for twisting my words yet again.\n \n \nHe is now reduced to nothing more than name calling and insults. No substance. \n\n \n No different from what you and your friends would do before I got here. \n \n \nHe shot his wad and now he's done. Nothing left but babble.\n\n \n I agree. This XXXXXXX match you've created has gotten kinda boring.", 
   {}, 
   6337, 
   null, 
   1050963960.0
  ], 
  [
   7124, 
   null, 
   "debategirl88", 
   "All i have to say about this is I am VERY TRUELY proud to be a Christian, and a Christian Conservsative.", 
   {}, 
   6337, 
   null, 
   1051160820.0
  ], 
  [
   7128, 
   null, 
   "gilligan8503", 
   "i respect that and anyone else's belief. but you have to admit... habbit is putting your 'side' to shame.", 
   {}, 
   6337, 
   null, 
   1051190820.0
  ], 
  [
   7141, 
   null, 
   "debategirl88", 
   "What are you talkin about?", 
   {}, 
   6337, 
   null, 
   1051225740.0
  ], 
  [
   7202, 
   null, 
   "Cuchulainn", 
   "Originally posted by Habbit \n I was half-finished typing a reply and I opened another window, but it was \"restored down\" (the little windows on the top right of the screen, next to the minimize and close buttons) and I tried to click the maximize button (what the button changes to when you click restore down) and I accidently hit close on the reply window, so that really sucks. Fortunately for you, Cuchulainn, I missed another chance to make you look stupid, but maybe if I ever get really bored, I'll come and type another reply. \n \n \n look brilliant. Please go ahead and post your bollocks. All you do is reveal yourself as a gobshite and myself and several others like Lurch, to be extraordinary geniuses. You have apparently given up on the topic at hand. You know your limits.\n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "Hobbit, you  make everyone else"
    }
   }, 
   6337, 
   null, 
   1051316340.0
  ], 
  [
   7312, 
   null, 
   "Habbit", 
   "gilligan-\n \n \ni respect that and anyone else's belief. but you have to admit... habbit is putting your 'side' to shame.\n\n \n That'd be cool if it were actually cool. I mean, an atheist who doesn't make sarcastic remarks about people who's beliefs are different than his? Unheard of.\n \n Cuchulainn-\n \n \nAll you do is reveal yourself as a gobshite and myself and several others like Lurch, to be extraordinary geniuses.\n\n \n An extraodinary genuis who can't even get my name right... that's so... extraordinarily stupid. \n \n \nYou have apparently given up on the topic at hand. You know your limits.\n\n \n Thank you for speaking for me. You seem to be good at manipulating people's words for your own good.", 
   {}, 
   6337, 
   null, 
   1051628580.0
  ], 
  [
   7345, 
   null, 
   "Cuchulainn", 
   "I have been responding to him/her but I really don't know what he/she believes or doesn't believe. Habbit spends his time in posts just insulting everyone but I fail to see any ideas, and philosophy or Theological rhetoric.\n \n I think that rational and mentally healthy people here should ignore Habbit's posts completely. There is no reason for rational people to get into mud slinging with an individual so seething with hate. This is my last comment, no matter what names or insults he throws at me in future. It is a waste of my time to respond.\n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "I really don't know this Habbit fellow"
    }
   }, 
   6337, 
   null, 
   1051660500.0
  ], 
  [
   7351, 
   null, 
   "gilligan8503", 
   "i was thinking the very same thing; i'm following cuchulainn.", 
   {}, 
   6337, 
   null, 
   1051668420.0
  ], 
  [
   7355, 
   null, 
   "lurch", 
   "Me too.\n \n I do have to mention that I fell out of my chair laughing at the borderline literacy demonstrated by hobble's use of \"In concludence...\" in another thread. It wouldn't be so bad if the word \"concludence\" actually existed but was incorrectly used. But that is not the case. To use illiterate English, no - non-existent English - in an attempt to instruct others who are obviously more intelligent and better educated is a real hoot.\n \n So I agree. I'll not respond or mention hobble - the mental cripple - again. I will just watch, knowing that Jesus is so proud of his use of venom and insult in His name. He is an example of how a true christian conducts himself.", 
   {}, 
   6337, 
   null, 
   1051671240.0
  ], 
  [
   7954, 
   null, 
   "Habbit", 
   "Cuchulainn-\n \n \nI have been responding to him/her but I really don't know what he/she believes or doesn't believe. Habbit spends his time in posts just insulting everyone but I fail to see any ideas, and philosophy or Theological rhetoric.\n\n \n I've been responding to you (he/she/it) and I do know what you believe. You believe that anyone who believes in any form of religion is an idiot and that you are a superior creature than they. \n \n \nI think that rational and mentally healthy people here should ignore Habbit's posts completely. There is no reason for rational people to get into mud slinging with an individual so seething with hate. This is my last comment, no matter what names or insults he throws at me in future. It is a waste of my time to respond.\n \n\n \n 1) There are no rational or mentally healthy people on this board. Anyone arguing that religious people are XXXXXX and that the intelligence of an atheist is superior to that of a non-atheist is far from rational or mentally healthy.\n 2) There's no reason for a lot of things that happen in the world today. There's also no reason that you and your atheistic clique should be allowed to make sarcastic and insulting remarks about people who believe in the Christian God, and then complain when someone uses the same type of insulting and sarcastic remarks on said complainer. \n 3) Good. One less pompous bastard I have to type a reply to.\n \n gilligan-\n \n \ni was thinking the very same thing; i'm following cuchulainn.\n\n \n Make that two pompous bastards.\n \n idiot-\n \n \nMe too.\n\n \n Three now, anymore want to quit?\n \n \nI do have to mention that I fell out of my chair laughing at the borderline literacy demonstrated by hobble's use of \"In concludence...\" in another thread. It wouldn't be so bad if the word \"concludence\" actually existed but was incorrectly used. But that is not the case.\n\n \n Oh silly me. I made a frickin' mistake. There's worth laughing at... a human who makes mistakes, haha, so terribly amusing. Anyway. Stick to the original subject instead of inspecting my grammar, pls thks. \n \n \nTo use illiterate English, no - non-existent English - in an attempt to instruct others who are obviously more intelligent and better educated is a real hoot.\n\n \n You keep telling yourself that and maybe it'll come true.\n \n \nSo I agree. I'll not respond or mention hobble - the mental cripple - again.\n\n \n Good. Responding to your constant bitching and moaning was getting terribly boring anyway. \n \n \nI will just watch, knowing that Jesus is so proud of his use of venom and insult in His name. He is an example of how a true christian conducts himself.\n\n \n Who is a true Christian? Jesus, or me? Uh oh, you're not using stuck-up grammar. Also, you forgot to capitalize the 'C' in Christian. Another thing, in illiterate English (or non-existent English) my screen name may be hobble (another word you seem to have forgot to capitalize, as you are refering to a person) but anyone with any amount of literacy can easily see my screen name is Habbit (capitalize the h) not hobble, or Hobble (in illiterate English.) Tsk, tsk. Shame on you.", 
   {}, 
   6337, 
   null, 
   1052627700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Proud to be a christian?", 
  "url": "http://www.4forums.com/political/religion-debates/509-proud-christian.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 509, 
  "discussion_files": [
   [
    "30299.html", 
    "http://www.4forums.com/political/religion-debates/509-proud-christian-print.html"
   ], 
   [
    "30300.html", 
    "http://www.4forums.com/political/religion-debates/509-proud-christian-2-print.html"
   ]
  ], 
  "identifier": 509
 }
]