[
 [
  [
   118000, 
   null, 
   "Dzeron", 
   "Fundies say that a free society will lead to a firey apocalypse with flying horsemen and anti-christs.\n \n Greens say that a free economy will lead to a firey apocalypse with global warming and melting ice and massive hurricanes.\n \n \n Fundies say that since humans are too stupid to make moral decisions, some stupid humans should tell other stupid humans how to make moral decisions.\n \n Greens say that since humans are too stupid to take care of the planet, some stupid humans should tell other stupid humans how to take care of the planet.\n \n \n Fundies defy evolution by saying that the world was created by God in seven days.\n \n Greens defy evolution by saying that no species should ever become extinct.\n \n \n Fundies say that culture should be frozen in time.\n \n Greens say that nature should be frozen in time.\n \n \n Fundies view the world as haunted by evil spirits that are always trying to tempt them.\n \n Greens view the world as haunted by pollutants that are always trying to poison them.\n \n \n Fundies blame all evil on atheists.\n \n Greens blame all evil on businessmen and workers.\n \n \n Fundies support legislation to prevent people from angering God, at the expense of human liberty.\n \n Greens support legislation to prevent people from endangering animals, at the expense of human liberty.\n \n \n I'm sure there are more parallels between these two groups of anti-humanist extremists. These greens are the new theocrats, trying to use the government to avert some abstract future apocalypse that nobody cares about and probably won't happen.", 
   {
    "post_info": {
     "post_title": "Greens vs. Fundies"
    }
   }, 
   null, 
   null, 
   1115420400.0
  ], 
  [
   118001, 
   null, 
   "sinjin", 
   "These greens are the new theocrats, trying to use the government to avert some abstract future apocalypse that nobody cares about and probably won't happen.\n\n \n You're entitled to your opinion but where's your evidence that \"nobody cares\" and \"probably won't happen\".", 
   {}, 
   118000, 
   null, 
   1115420760.0
  ], 
  [
   118028, 
   null, 
   "Dzeron", 
   "You're entitled to your opinion but where's your evidence that \"nobody cares\" and \"probably won't happen\".\n\n \n Do you really think that global warming, if it exists, will lead to the end of the world? Do you think that all of humanity - the most adaptible species in the world - will die off? Global warming may cause problems, but it will not cause an Apocalypse.\n \n Environmentalists like to look at graphs of rising global temperatures and see that the temperature is rising now, and jump to the conclusion \"Humans are causing it all!\" But the simple fact is that the temperature of the planet fluctuates naturally, and we happen to live in a period of rising temperatures. Correlation does not imply causation.\n \n And even still, none of this will cause an apocalypse. The demented \"prophecies\" the greens forward, such as \"The Day after Tomorrow\" are extremely scientifically inaccurate - even the director of the green propaganda film admitted it.", 
   {}, 
   118001, 
   null, 
   1115423580.0
  ], 
  [
   118036, 
   null, 
   "gnojek", 
   "Atmospheric CO2 level are continually rising.\n This is almost certainly due to burning of fossil fuels.\n \n There are various consequences to this: more IR light is trapped around the surface, the ph of the oceans goes down (killing the very plankton that convert the CO2 to oxygen), and some others.\n \n Even if rising CO2 level don't cause global warming, shouldn't we at least try to stop changing the atmosphere before we understand what the consequences are?\n \n Do you agree that we should try to limit our usage of fossil fuels?", 
   {}, 
   118028, 
   null, 
   1115424540.0
  ], 
  [
   118041, 
   null, 
   "sinjin", 
   "Do you really think that global warming, if it exists, will lead to the end of the world? Do you think that all of humanity - the most adaptible species in the world - will die off? Global warming may cause problems, but it will not cause an Apocalypse.\n\n So if humans survive but everything else dies, no problem?\n \nEnvironmentalists like to look at graphs of rising global temperatures and see that the temperature is rising now, and jump to the conclusion \"Humans are causing it all!\" But the simple fact is that the temperature of the planet fluctuates naturally, and we happen to live in a period of rising temperatures. Correlation does not imply causation.\n\n Is contributing causing? Do you doubt we are contributing? I don't know any evironmentalists that claim we are \"causing it all\".\n \nAnd even still, none of this will cause an apocalypse. The demented \"prophecies\" the greens forward, such as \"The Day after Tomorrow\" are extremely scientifically inaccurate - even the director of the green propaganda film admitted it.\n\n Green propaganda film? It's a movie. \n \n I happen to like biodiversity and think our stewardship leaves much to be desired. \n \n Why the axe to grind? Did someone interrupt your destructive hobby?", 
   {}, 
   118028, 
   null, 
   1115425560.0
  ], 
  [
   118048, 
   null, 
   "Dzeron", 
   "Do you agree that we should try to limit our usage of fossil fuels?\n\n \n I am not the kind of extremist who says the government should beat down the use of fossil fuels. If it is a problem, the government should stop subsidising gasoline.", 
   {}, 
   118036, 
   null, 
   1115426820.0
  ], 
  [
   118052, 
   null, 
   "Dzeron", 
   "So if humans survive but everything else dies, no problem?\n \n\n \n For one thing, it is hardly likely that such would happen. However, if there are any environmental regulations, they should be created to protect human rights, not the \"rights of nature.\"\n \n \n \n\n I happen to like biodiversity and think our stewardship leaves much to be desired. \n\n \n I do not think biodiversity should be placed before the right of individuals to control their own lives. It is unethical to value animals before humans, and EXTREMELY unethical to value plants before humans.\n \n \n\n Why the axe to grind? Did someone interrupt your destructive hobby?\n\n \n I am not grinding an axe - I am merely pointing out the similarities between greens and fundies. They are sworn enemies, and yet they are so similar. Like commies and fascists.", 
   {}, 
   118041, 
   null, 
   1115427180.0
  ], 
  [
   118187, 
   null, 
   "Clive14", 
   "I'm sure there are more parallels between these two groups of anti-humanist extremists.\nI'm sure you could think up some more environmentalist strawman if you wanted to. It simply would demonstrate your complete lack of understanding of the environment and the \"green\" cause even more.\n \n You may not care if your selfish desires cause mass extinction and the collapse of modern society, many do though. Your position, of putting your individual personal freedom above everything else in the world, is the morally repulsive one.", 
   {}, 
   118000, 
   null, 
   1115456760.0
  ], 
  [
   118379, 
   null, 
   "Dzeron", 
   "I'm sure you could think up some more environmentalist strawman if you wanted to. It simply would demonstrate your complete lack of understanding of the environment and the \"green\" cause even more.\n\n \n I understand that there are some sensible greens. They are the ones who want regulations against pollution to protect human health. I agree with these greens. There are, however, the more extreme, irrational greens who want to impose regulations for the sake of animals and plants, and advocate a \"look but don't touch\" attitude towards nature.\n \n Of course, this contrasts with the opposite extreme view, the rightist view, that Man owns Nature. I reject this extremism as well. The ownership of nature (particulalry land) is not justified by the principle that individuals have the right to control their own lives. The onwership of unoccupied land is an unjust aristocratic privilege created by the state, not an individual right to control his own enterprise.\n \n What is my position? I say that man does not own nature, but he may touch it. No one deserves concentrated power over the use of natural resources - that is equivalent to gambling the planet away - but rather, all individuals have the equal right to use natural resources. Only artificial things, harvested resources, and in-use land should be owned. This prevents a concentration of power over nature in the hands of any elite few, and the less concentrated this power is, the safer the environment is.\n \n \n\n You may not care if your selfish desires cause mass extinction and the collapse of modern society, many do though. Your position, of putting your individual personal freedom above everything else in the world, is the morally repulsive one.\n\n \n How will egalitarian individualism cause mass extinctions and the collapse of modern society? That seems like a problem that can only be made worse by giving a few people concentrated power over the use of natural resources, as both capitalism and environmental statism inevitably do. Capitalism leads to a concentration of land in the hands of the wealthy - in this country, 3% of the population controls 95% of the land. Environmental statism leads to a concentration of land in the hands of the government. Now, if you are willing to trust a few people to control the management of the planet, you are gambling the planet. There is no guarantee that the environmental elites will always have benevolent environmental interests in mind.\n \n The government mismanages nature. Here is just one example:http://www.azcentral.com/news/articles/0425forestpesticides-ON.html \n \n We cannot trust the planet in the hands of a few elites. Humans may be too stupid to take care of the planet, but there is little, if any, reason to believe that elitist arrangements would make the situation any better.\n \n And, of course, fundamentalism has absolutely no merit whatsoever. It is neither practical nor ethical nor ideal. It does not have any utilitarian end goals - it is mere insecurity of self-denialists wishing to gain happiness by ruining the happiness of others.", 
   {}, 
   118187, 
   null, 
   1115506260.0
  ], 
  [
   118511, 
   null, 
   "Redratio1", 
   "I've always wondered why conservatives seem to generally be against conservation.", 
   {}, 
   118379, 
   null, 
   1115533080.0
  ], 
  [
   118733, 
   null, 
   "lord tammerlain", 
   "I've always wondered why conservatives seem to generally be against conservation.\n\n \n \n Money, and the repubican party.\n \n Conservation usually means that a business is not going to make as much money as they could and money is one of two main policies of the old republican party (small government being the other).\n \n So when conservation like preserving wetlands comes up you would normally find republican politicians pushing for draining it as the developer of the property would traditionally be a campaign contributor. \n \n This of course excludes self interest conservationists like Duck's Unlimited, who I believe have a large number of central USA republicans as members ( lots of hunters).", 
   {}, 
   118511, 
   null, 
   1115570760.0
  ], 
  [
   119101, 
   null, 
   "Clive14", 
   "I understand that there are some sensible greens. They are the ones who want regulations against pollution to protect human health. I agree with these greens.\nMy guess is you only agree with them to an extent. CO2 is a pollutant. If some of the prediction models for global warming, caused at least in part by CO2 pollution by humans, are correct, then it will cause huge scale starvation. Death seems pretty detrimental to human health to me. What do you reckon?\n \n \nThere are, however, the more extreme, irrational greens who want to impose regulations for the sake of animals and plants, and advocate a \"look but don't touch\" attitude towards nature.\nThey aren't the xtreme ones. The extreme ones are the sort that \"drop out\" of society and go and live in their teepees (until their weekly benefit cheque is due for collection, or they get ill and need a doctor etc of course). You describe fairly sensible and moderate greens by comparison.\n \n \nHow will egalitarian individualism cause mass extinctions and the collapse of modern society?\nGlobal warming has the potential to disrupt rainful and temperatures enough to cause a rapid and catastrophic failure of indigenous plant species in many parts of the world. This will very likely lead to mass extinction. \"egalitarian individualism\" risks causing the collapse of society partly through the same means (if there is a large enough impact on agriculture). In addition the \"I'll use as much as I want and sod future generations\" attitude of \"egalitarian individualism\" (or stupid selfishness as I prefer to more accurately call it) is driving us to consume oil at a rate that cannot be sustained. Our entire society is based upon oil. Without it, and without sufficient time to find alternatives for everything it's used for, modern society cannot survive.", 
   {}, 
   118379, 
   null, 
   1115643420.0
  ], 
  [
   120907, 
   null, 
   "Dzeron", 
   "My guess is you only agree with them to an extent. CO2 is a pollutant. If some of the prediction models for global warming, caused at least in part by CO2 pollution by humans, are correct, then it will cause huge scale starvation. Death seems pretty detrimental to human health to me. What do you reckon?\n\n \n You assume what you are trying to prove.\n \n \n\n They aren't the xtreme ones. The extreme ones are the sort that \"drop out\" of society and go and live in their teepees (until their weekly benefit cheque is due for collection, or they get ill and need a doctor etc of course). You describe fairly sensible and moderate greens by comparison.\n\n \n These people actually seem sensible when compared to the anti-every-human-economic-activity greens which I described. At least they leave others alone.\n \n \n\n Global warming has the potential to disrupt rainful and temperatures enough to cause a rapid and catastrophic failure of indigenous plant species in many parts of the world. This will very likely lead to mass extinction. \"egalitarian individualism\" risks causing the collapse of society partly through the same means (if there is a large enough impact on agriculture). In addition the \"I'll use as much as I want and sod future generations\" attitude of \"egalitarian individualism\" (or stupid selfishness as I prefer to more accurately call it) is driving us to consume oil at a rate that cannot be sustained. Our entire society is based upon oil. Without it, and without sufficient time to find alternatives for everything it's used for, modern society cannot survive.\n\n \n Reality check - the government heavily subsidizes the oil industry, artificially lowering the price of oil and thereby increasing consumption. In a free market, there would be less oil consumption than there is now in this Mussolini-esque corporatist \"mixed economy.\" You cannot accuse egalitarian individualism for our environmental problems because egalitarian individualism has never existed.\n \n The #1 source of enviromental problems is the growing human population. The liberal and libertarian positions on social issues actually stabilize the human population. Women's rights, legal birth control, and legal abortions lead to lower birth rates. By contrast, conservatism creates a system where women have almost no say in reproductive issues, giving males all the control, and that leads to incredibly high birth rates. And we all know that the murderous tendencies of totalitarians will lead to higher death rates.\n \n Individualism may not be ultra-sustainable, but it is sustainable. The real anti-environmental \"browns\" are not the individualists, but the corporatist-theocratic bloc (a.k.a. the Republican Party) and they are not individualist by any stretch of the imagination.", 
   {}, 
   119101, 
   null, 
   1115846280.0
  ], 
  [
   122561, 
   null, 
   "Comrade Brian", 
   "Remember you can have an environment with an economy, but you can't have any economy without an environment, greens all the way! plus when its a controlled econmy its easier for environmental laws than a capitalist one. also environmental laws still favor rich<workers, command economy always puts workers first, so better environment, workers are healthier. also the rich can move where they feel like, such as environmentally isolated areas where pollution is less rampant, workers hardly ever have that coice, so workers are in worse conditions.", 
   {}, 
   120907, 
   null, 
   1116069600.0
  ], 
  [
   123576, 
   null, 
   "Clive14", 
   "You assume what you are trying to prove.\nI wasn't aware I was assuming anything. The phrase \"prediction models\" means what it says. It's a prediction. It could be wrong.\n \n \nThese people actually seem sensible when compared to the anti-every-human-economic-activity greens which I described. At least they leave others alone.\nThe problem is, you don't describe \"anti-every-human-economic-activity greens\". You describe ordinary greens that take the view that the environment must be seriously considered when constructing economic policy.\n \n \nReality check - the government heavily subsidizes the oil industry...\nYours might. My government taxes the oil industry to the hilt. The free market isn't enough. Oil pollutes, therefore it should be taxed to contain its use.\n \n \nThe #1 source of enviromental problems is the growing human population. The liberal and libertarian positions on social issues actually stabilize the human population. Women's rights, legal birth control, and legal abortions lead to lower birth rates. By contrast, conservatism creates a system where women have almost no say in reproductive issues, giving males all the control, and that leads to incredibly high birth rates. And we all know that the murderous tendencies of totalitarians will lead to higher death rates.\nI'm not sure I agree that the growing human population is the #1 problem, but it's pretty high up the list. I'd agree with the rest though.\n \n \nIndividualism may not be ultra-sustainable, but it is sustainable. The real anti-environmental \"browns\" are not the individualists, but the corporatist-theocratic bloc (a.k.a. the Republican Party) and they are not individualist by any stretch of the imagination.\nYou seem to be offering \"individualism\" and \"totalitarianism\" as the only two options. What is really required for a decent society that balances individual needs, societies needs and the needs of the environment is a mixture of the two.", 
   {}, 
   120907, 
   null, 
   1116266220.0
  ], 
  [
   124499, 
   null, 
   "Wez", 
   "There's a huge difference between using and abusing nature.\n \n Using nature for wood could be done sustainable and relatively easily. We're using nature for our own means without causing long-term damage to the environment.\n \n Abusing nature for wood could be done by felling a rainforest. We're abusing nature here (as well as shooting ourselves in the foot by getting rid of a huge source of possible new medicines).\n \n If the savoir of a rainforest means that 50 people are unemployed by slightly higher costs of wood, then personally, I don't mind. Does that mean I put plant/animal life before human life? No. However when minor damage is done to humans, which has a massive impact on preserving the environment, then chances are I'd support it.\n \n Another example is whaling. I believe that some types of whales shouldn't be killed, seeing as I think that the species should be able to recover fully before they're hunted again. That may mean that some people become unemployed, but being honest, that's a small price to pay for preserving a species. Yes again, does that mean I put animal/plan t life before human life? No. It means that a small amount of damage done to humans has a huge impact in preserving a whole set of species.\n \n That's not \"anti-every-human-economic-activity greens\". That's wanting to preserve the environment.\n \n An example of where I don't support greens is those who destroy lobster cages/ restaurants. That is and example of \"anti-every-human economic-activity greens\", seeing as lobsters (afaik) don't actually feel pain and as such trying to \"save\" them from non-existent pain seems retarded to me.\n \n Also, as Clive said, you describe the actions of moderate greens as those who are \"anti-every-human-economic-activity greens\".\n \n -Wez", 
   {
    "unicode_changes_made": true
   }, 
   123576, 
   null, 
   1116414180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Greens vs. Fundies", 
  "url": "http://www.4forums.com/political/politics-debates/5094-greens-vs-fundies.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 5094, 
  "discussion_files": [
   [
    "12079.html", 
    "http://www.4forums.com/political/politics-debates/5094-greens-vs-fundies-print.html"
   ], 
   [
    "12080.html", 
    "http://www.4forums.com/political/politics-debates/5094-greens-vs-fundies-2-print.html"
   ]
  ], 
  "identifier": 5094
 }
]