[
 [
  [
   118250, 
   null, 
   "lord tammerlain", 
   "The parallel explanations represent a curious twist in one of modern Iran's most visible social trends. The streets of Tehran abound with young people - mostly, but not exclusively, women - with their noses in plaster from the effects of surgery. \n \n The phenomenon reflects a competitive urge among fashion-conscious Iranians to put their cosmetic handiwork on display. According to doctors, some even wear nose plasters as a status symbol without actually having had the operation\n \n \n snip\n \n The Islamic republic has the highest rate of nose surgery in the world, although precise figures are hard to establish. In recent years other forms of cosmetic enhancement, including chin operations, finger nail implants, embedding fake diamonds in the gums and tattooed eyebrows, have also become popular, but the nose job remains the most in-demand. \n \n Iranians refer to the perfectly formed button nose it is meant to achieve as the \"one million toman (£590) nose\". In fact, the going rate ranges from much less than that to about £2,600. \n \n One prominent Tehran plastic surgeon says his patients include the daughters of senior Islamic clerics. \n \n Its use in the Islamic republic was officially sanctioned by Ayatollah Khomeini, Iran's late leader and father of the Islamic revolution. He gave the go-ahead after being consulted by a religious figure whose daughter was due to be operated on by Iran's leading plastic surgeon, Mohammed Abidipour\n \n\n \n http://www.guardian.co.uk/iran/story/0,12858,1478562,00.html\n \n Funny for an evil totatitarian regime to have such a high rate of plastic surgery", 
   {
    "post_info": {
     "post_title": "Vanity and boredom fuel Iran's nose job boom"
    }
   }, 
   null, 
   null, 
   1115478420.0
  ], 
  [
   118252, 
   null, 
   "wilted_laughter", 
   "This confirms my suspicisions: plastic surgery is the tool of the devil!", 
   {}, 
   118250, 
   null, 
   1115479020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Vanity and boredom fuel Iran's nose job boom", 
  "url": "http://www.4forums.com/political/peace-middle-east/5103-vanity-boredom-fuel-irans-nose-job-boom.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5103, 
  "discussion_files": [
   [
    "11076.html", 
    "http://www.4forums.com/political/peace-middle-east/5103-vanity-boredom-fuel-irans-nose-job-boom-print.html"
   ]
  ], 
  "identifier": 5103
 }
]