[
 [
  [
   118490, 
   null, 
   "zenodotus", 
   "(Caveat: When I use the word liberal or conservative here I'm referring to the very generalized ideals each party holds with respect to gay marriage. Also, I am registered, but as neither Republican nor Democrat.)\n \n Conservatives cannot claim that two members of the same sex getting married is wrong without being called \"bigots.\" The argument that says they are bigots is pretty much irrefutable from a totally non-religious standpoint. What liberals want is a sound argument that proves to them that straight people's rights are being infringed upon.\n \n There are many arguments out there about the degradation of our society, about the correlation of changing moral values and a state's eventual destruction, about animal marriages, about God's intent, and on and on. The problem with these arguments (aside from the animal marriage argument, which uses the slippery slope fallacy) is that they are based entirely on speculation. Some may be written by a clever hand, or as a very educated hypothesis, but this does not make them anything more than intelligent speculation at best. If we can agree that the purpose of debate is to convince the other side that one's views are correct, and that liberals want a reason that straight's rights are being infringed upon (this is how liberal's judge morality) then we can agree that non of these speculative arguments will ever complete the debate's objective.\n \n However, there is one argument that is not speculative. I came across a post by a widow who had been married to a man for thirty years (different website). I was moved by her post. She did not care what legal rights gay couples won, she did not care about the morality of \"gay acts\" or about taxes or money. She cared about what she had with her husband for thirty years and her knowledge and memory of it as a wonderful marriage. She lamented that if the definition of marriage is changed to include gays, then the thing she had cherished as marriage for so long would lose much of its meaning for her. She did not say it would lose much of its meaning to her friends, to her family, or to the general public, but to HER. In her eyes, marriage is a very delicate, natural thing and its (I dare say) sanctity would be destroyed by labeling two gays as \"married.\" To change the definition of marriage now is to change the self-perception, indeed the self-perceived value of many current marriages.\n \n However, we do run into a dilemma here. Liberals want to know what it is that the creation of same-sex marriage does that hurts straight marriages. I have said what this is. But, a liberal will say that the lowered value of a marriage is not real, it is only perceived due to the bigoted minds of the conservatives themselves. If they weren't bigots, there wouldn't be a problem. Well, the moral relativistic nature of liberal doctrine flies in the face of this argument. The fact is that if it cannot be proven that gay sex is immoral because all of the arguments that say so are based on religion or social norms, then it cannot be proven that being bigoted is in any way immoral either. From a liberal morally relativistic standpoint, there are no concrete morals, just the relative feelings of each individual member of a society (at best). Well then, the hurt feelings of the widow described above matter no less than anyone else's, even if she is some kind of \"bigot.\" Her feelings do not cease to exist.\n \n The answer to the problem, then, is not to scrap the whole idea of gay marriage. It's only to change the word \"marriage.\" This is the only aspect of the entire debate that can ever hold any merit in the eyes of an atheistic liberal, and thus ever hope to achieve the objective of the debate. The debate WILL be won that every gay in America should enjoy every right that every straight has -- totally equal legal protections. The only difference is that the label might be something other than \"married.\" Now, liberals will scream that separate but equal is inherently unequal. It sounds catchy, so it must be true, right? Well in this instance it has no merit. For one thing, under what this post proposes there is no separation. All legal rights are equal under the law and every person has the ability to obtain either type of marriage. So what is it that gay's are afraid of? They will tell you that society will not treat them the same because the name of their union is not the same. Well, simply put, society as a whole will feel however it wants, and attempting to trick it with its own labels is clearly no answer. Even from a standpoint of pure utility, it would seem equally likely that changing the definition of marriage would anger more straight citizens and result in a larger backlash against the gay society than simply letting the two different labels exist (that's assuming changing the definition was moral, even from a liberal idyllic standpoint, as I argued against earlier). The fact is that straight couples DID build up the current concept of the love inherent in the word marriage for thousands of years. Even from a liberal perspective, gays have no right to take this concept and alter it to their meaning and concept of love against the will of the straight populace. If gay couples want the idyllic concept of love that goes along with the word \"marriage,\" they will have to take their own label and build it up themselves by proving to society what they have been preaching all along: that their version of love is comparable or equal to that of straight couples. This is the only road to their total acceptance, if they are up to the task and if what they preach of their love is in fact true, and is the only option that does not infringe on the collective concept of the word marriage as the straight community has worked (and loved) for so long to have it understood.\n \n (The meat of my argument is over. I simply want to address one more argument that may be made against what I have said. That is, basically, that marriage, even among straight couples, has gone to Hell anyways, what with high divorce rates and what-not. However, the widow I described above does not care, she feels her marriage was a reflection of what a marriage ought to be, and high divorce rates or not she wants to keep that perception of the inherent meaning of the word as best she can. Furthermore, in many people's eyes, divorce has no real basis, because either the divorce never really happens because of \"until death do you part\" or the marriage never happened because total love is required for a real marriage. Hence the only REAL marriages are those similar to the lifelong commitment mentioned above. I should also point out that the whole divorce-rate argument has no bearing on what I'm saying because it simply does not change the fact that the collective concept of the word marriage is being altered and this is an infringement of rights as argued above. Even if it was pertinent to this argument, it would be foolish to pull the divorce-rate card because this merely suggests that gays should be jumping at the opportunity to select a different label for their unions and prove that they are MORE dedicated than the straight society. Keep in mind this last paragraph is NOT the meat of my argument, or even a very important aspect.)", 
   {
    "post_info": {
     "post_title": "Answer"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1115530500.0
  ], 
  [
   118507, 
   null, 
   "BobNelson2", 
   "The meat of my argument is over. \n\n \n The meat of your argument is overcoooked.", 
   {}, 
   118490, 
   null, 
   1115533020.0
  ], 
  [
   118523, 
   null, 
   "zenodotus", 
   "The meat of your argument is overcoooked.\n\n \n I prefer to ensure that all harmful substances have been sterilized.", 
   {}, 
   118507, 
   null, 
   1115533560.0
  ], 
  [
   118625, 
   null, 
   "JustineCredible", 
   "I prefer to ensure that all harmful substances have been sterilized.\n\n \n \n Ah, yes, sterile as a hospital ward for the mentally insane. We've covered this stuff a hundred times or more.", 
   {}, 
   118523, 
   null, 
   1115542980.0
  ], 
  [
   118719, 
   null, 
   "wsm2506", 
   " I came across a post by a widow who had been married to a man for thirty years (different website). I was moved by her post. She did not care what legal rights gay couples won, she did not care about the morality of \"gay acts\" or about taxes or money. She cared about what she had with her husband for thirty years and her knowledge and memory of it as a wonderful marriage. She lamented that if the definition of marriage is changed to include gays, then the thing she had cherished as marriage for so long would lose much of its meaning for her. \n\n \n 30 years. Did her marriage \"lose much of its meaning for her\" when interracial marriage was allowed?\n \n Did her education \"lose much of its meaning for her\" when blacks were allowed equal access?\n \n Did her children (if she had any) \"lose much of its meaning for her\" after Roe vs Wade?\n \n Sorry, that argument just doesn't hold water.", 
   {}, 
   118490, 
   null, 
   1115568600.0
  ], 
  [
   118748, 
   null, 
   "zenodotus", 
   "30 years. Did her marriage \"lose much of its meaning for her\" when interracial marriage was allowed?\n \n Did her education \"lose much of its meaning for her\" when blacks were allowed equal access?\n \n Did her children (if she had any) \"lose much of its meaning for her\" after Roe vs Wade?\n \n Sorry, that argument just doesn't hold water.\n\n \n I'm sure that it didn't in any of those cases. Why? Because there was nothing fundamental about those institution's definitions that was changed in the course of the law's changing. In the case of gay marriage, a basic part of the definition (between man and wife) as it has been understood for many years is being challenged. None of your comparisons are really analogous. \n \n Furthermore you would present a better argument if you were to refute this particular instance instead of attempting to draw up metaphors/analogies, you could even try to refute it based on the same principles that you believe those analogies were refuted (if you still believe they apply). Life is ambiguous and attempting to sort it out based on analogies and metaphors is the work of a fool (and I know you're no fool).\n \n As for JustineCredible, I find the way you ignored my post and instead took a jab at my playful response regarding meat to be childish and in very poor taste. It also shows that you are actually incapable of rebutting my real argument.", 
   {}, 
   118719, 
   null, 
   1115574120.0
  ], 
  [
   118751, 
   null, 
   "joebrummer", 
   "\n As for JustineCredible, I find the way you ignored my post and instead took a jab at my playful response regarding meat to be childish and in very poor taste. It also shows that you are actually incapable of rebutting my real argument.\n\n \n \n But you didn't make an argument. You didn't explain in anyway HOW same sex marriage hurts heteroseuxla marriage in you post. Honestly I think you orginal posts babbles a lot, so it is hard to pick out your real argument. \n \n Please explain how hetero marriage is hurt by other committed couples getting married.", 
   {}, 
   118748, 
   null, 
   1115574360.0
  ], 
  [
   118758, 
   null, 
   "JustineCredible", 
   "I'm sure that it didn't in any of those cases. Why? Because there was nothing fundamental about those institution's definitions that was changed in the course of the law's changing.\n\n \n Tell that to those who opposed those law changes. Bible quotes and fundamentalism was rampently against interracial marriage, desegragation, Roe vs. Wade and even with women's sufferage. So don't tell me there was nothing fundamental about them, only if you will back down and agree there is nothing fundamental about gays having access to marriage. \n \n \n In the case of gay marriage, a basic part of the definition (between man and wife) as it has been understood for many years is being challenged. None of your comparisons are really analogous.\n\n \n Actually every one of those analogies are quite ligitimate. The definition (as everyone is so fond of calling it) of marriage didn't even exist in federal laws until 1996 when DOMA was signed! \n It's actually a very new legal concept. \n \n \n \nFurthermore you would present a better argument if you were to refute this particular instance instead of attempting to draw up metaphors/analogies, you could even try to refute it based on the same principles that you believe those analogies were refuted (if you still believe they apply). Life is ambiguous and attempting to sort it out based on analogies and metaphors is the work of a fool (and I know you're no fool).\n\n \n No more foolish work than of the religious fundamentals attempting to desecularize our American government. \n \n \n \nAs for JustineCredible, I find the way you ignored my post and instead took a jab at my playful response regarding meat to be childish and in very poor taste. It also shows that you are actually incapable of rebutting my real argument.\n\n \n I found no \"real argument\" incapsulated within your post. Only regurgitated diatrible which has been refuted and rebutted ad infanitumn. \n I cannot help the fact that you lack a sence of humor, but keep in mind that I was not the instigator of the humorous track. Just because you pointed to me only shows you personal contempt.", 
   {}, 
   118748, 
   null, 
   1115575140.0
  ], 
  [
   118773, 
   null, 
   "zenodotus", 
   "Bible quotes and fundamentalism was rampently against interracial marriage, desegragation, Roe vs. Wade and even with women's sufferage. So don't tell me there was nothing fundamental about them, only if you will back down and agree there is nothing fundamental about gays having access to marriage. \n\n \n Are you being serious? Don't you realise that your entire argument here is simply that, because people with fundamental religious beliefs opposed interracial marriage, desegregation, etc., then fundamental parts of the way they were defined MUST have been challenged? This is completely backwards in every sense of it's logic. I'm talking about the way a word is defined. The way marriage is defined has nothing to do with \"fundamentalists\" at all. It is a definition, regardless of your beliefs.\n \n Maybe you believe that this definition should encompass gays as well. Marriage is the love between the opposite sexes, under current definitions, and the connotations behind it have been established under that guise. The fact is that a gay marriage IS different than a straight one. If you think they are the same thing, we've got problems. Even on a purely physical level, two penises is not the same thing as a penis and a vagina. Hence the definition has been established around the latter, and gays want to change it to encompass the former. Its the gay community who wants to say that marriage has only to do with love and nothing to do with the physical nature of the two parties (two penises or not). However marriage has never been thought of this way and, honestly, who are they to alter its meaning? It comes down to a simple reality: that gay marriages are different, and thus a different label is warranted. It has nothing to do with equal rights or equal protection (they should have that), but simply that there IS this basic difference between them. \n \n \n\n No more foolish work than of the religious fundamentals attempting to desecularize our American government. \n \n\n \n This statement makes absolutley no sense, so I won't bother.\n \n \n\n I found no \"real argument\" incapsulated within your post. Only regurgitated diatrible which has been refuted and rebutted ad infanitumn. \n I cannot help the fact that you lack a sence of humor, but keep in mind that I was not the instigator of the humorous track. Just because you pointed to me only shows you personal contempt.\n\n \n Please direct me to one of these numerous times during which my exact argument has been refutted and hopelessly knocked down. I would greatly love to see it.\n \n And then you say I lack a sense of humor. Learn to read. My original post about meat was in jest; it was meant to be humorous. You attacked it. That last blurb on contempt...I'm just going to assume other people who read this will laugh at it.", 
   {}, 
   118758, 
   null, 
   1115577540.0
  ], 
  [
   118780, 
   null, 
   "zenodotus", 
   "Please explain how hetero marriage is hurt by other committed couples getting married.\n\n \n From my original post:\n \n \nTo change the definition of marriage now is to change the self-perception, indeed the self-perceived value of many current marriages.\n", 
   {}, 
   118751, 
   null, 
   1115578800.0
  ], 
  [
   118805, 
   null, 
   "joebrummer", 
   "If my marriage, changes the perception of what their marriage is, it must be a pretty weak marriage to start with, dont ya think? If their marriage is so influenced by who lese is married than they should seek personal counseling.", 
   {}, 
   118780, 
   null, 
   1115582340.0
  ], 
  [
   118811, 
   null, 
   "BobNelson2", 
   "From my original post:[br]\n To change the definition of marriage now is to change the self-perception, indeed the self-perceived value of many current marriages.\n\n \n To prevent the inclusion of same-sex couples under marriage is to insult the self-perception, indeed the self-perceived value of many relationships. Furthermore, it is to insult the self-perception, indeed the self-perceived value of tens of millions of citizens. And, more importantly, it is to materially damage, not the feelings, but the actual lives of these couples and these individuals, to say nothing of how it assaults the Constitution.", 
   {}, 
   118780, 
   null, 
   1115582760.0
  ], 
  [
   118830, 
   null, 
   "JustineCredible", 
   "From my original post:\n\n \n \n You answered your own question: \"self perceived.\" Not governmentally sanctioned, not religiously backed, totally a matter of perception. \n \n Sorry, but if it is this old woman's perseption that her marriage will somehow lack it's magic, I suspect there is probably some underlying problem in her marriage to begin with. Especially if it's to be so easily damaged by others who have absolutely nothing to do with her or her marriage.", 
   {}, 
   118780, 
   null, 
   1115584980.0
  ], 
  [
   118886, 
   null, 
   "wsm2506", 
   "I'm sure that it didn't in any of those cases. Why? Because there was nothing fundamental about those institution's definitions that was changed in the course of the law's changing. In the case of gay marriage, a basic part of the definition (between man and wife) as it has been understood for many years is being challenged. None of your comparisons are really analogous. \n \n Furthermore you would present a better argument if you were to refute this particular instance instead of attempting to draw up metaphors/analogies, you could even try to refute it based on the same principles that you believe those analogies were refuted (if you still believe they apply). Life is ambiguous and attempting to sort it out based on analogies and metaphors is the work of a fool (and I know you're no fool).\n \n As for JustineCredible, I find the way you ignored my post and instead took a jab at my playful response regarding meat to be childish and in very poor taste. It also shows that you are actually incapable of rebutting my real argument.\n\n \n This individual's perception of the value of her marriage does her nothing but perceptual harm, if even that. It has very little (if anything at all) to do with justification of actual harm done by denying civil rights to others.", 
   {}, 
   118748, 
   null, 
   1115593920.0
  ], 
  [
   118894, 
   null, 
   "JakeCJB", 
   "I'm sure that it didn't in any of those cases. Why? Because there was nothing fundamental about those institution's definitions that was changed in the course of the law's changing. In the case of gay marriage, a basic part of the definition (between man and wife) as it has been understood for many years is being challenged. None of your comparisons are really analogous.\n\n \n And what was considered a \"traditional\" general understanding of marriage was being challenged with inter-racial marriage. No, between a man and a woman was not being challenged, but a basic understanding of what marriage was, was being challenged. Previously, it had been understood to be the same race only. In the case of sex, it has previously been understood to be different sex only. Now that is being challenged too.", 
   {}, 
   118748, 
   null, 
   1115594940.0
  ], 
  [
   118903, 
   null, 
   "JakeCJB", 
   "Randy White (Abbotsford, Conservative): \"My dear Aunt Frances from Lakeside, Nova Scotia, who is watching this with bated breath, is trying to understand why we in the House Of Commons are changing something that has been near and dear to her heart for 80-some years. I think a lot of people are thinking about that.\" \n \n A Conservative Member of Parliament(Canada). Somehow these aren't compelling reasons to deny equal rights, unless it's denying the rights of a group you are personally prejudiced against of course.", 
   {
    "unicode_changes_made": true
   }, 
   118894, 
   null, 
   1115596140.0
  ], 
  [
   118913, 
   null, 
   "Duo_Maxwell", 
   "To change the definition of marriage now is to change the self-perception, indeed the self-perceived value of many current marriages.\n\n \n So you're saying that to change marriage would be to maintain the status quo of what marriage maens. \n \n Marriage is what you make of it, not what society tells you. Marriage is cheapened because you make it so, not because of other people's marriages. How does Jlo's marriages make someone else's any less valuable? It does if that person wants or allows their marriage to be changed by someone else. \n \n Your claim is quite insane as it forces people to accept what they may or may not on their own, and catergorizes everyone who is married as unable to find value in their own marriage independent of what others do.", 
   {}, 
   118780, 
   null, 
   1115597040.0
  ], 
  [
   118929, 
   null, 
   "JakeCJB", 
   "Tell that to those who opposed those law changes. Bible quotes and fundamentalism was rampently against interracial marriage, desegragation, Roe vs. Wade and even with women's sufferage. So don't tell me there was nothing fundamental about them, only if you will back down and agree there is nothing fundamental about gays having access to marriage.\n\n \n Yes. It was about cowardly hiding behind mantras of God and tradition, so one can avoid confronting one's own ugly bigoted defense mechanisms, just like with same-sex marriage.", 
   {}, 
   118758, 
   null, 
   1115598780.0
  ], 
  [
   119057, 
   null, 
   "JustineCredible", 
   "Yes. It was about cowardly hiding behind mantras of God and tradition, so one can avoid confronting one's own ugly bigoted defense mechanisms, just like with same-sex marriage.\n\n \n What bothers me is the blatent denial of the similarities between the fights of old and of now. Indeed reglious factors were brought up as supposed \"reasoning\" behind continued descrimination. For anyone to deny such is flat out lying.", 
   {}, 
   118929, 
   null, 
   1115620860.0
  ], 
  [
   119150, 
   null, 
   "tonybrown74", 
   " I'm sure that it didn't in any of those cases. Why? Because there was nothing fundamental about those institution's definitions that was changed in the course of the law's changing. In the case of gay marriage, a basic part of the definition (between man and wife) as it has been understood for many years is being challenged. None of your comparisons are really analogous. \n\n \n Ain't hindsight a bit of an itch that way? \n \n I wonder if the people who were most passionate about that \"debate\" 40 years ago would agree with this statement back then? emoticon_rolleyes", 
   {}, 
   118894, 
   null, 
   1115653800.0
  ], 
  [
   119170, 
   null, 
   "tonybrown74", 
   "\n However, there is one argument that is not speculative. I came across a post by a widow who had been married to a man for thirty years (different website). I was moved by her post. She did not care what legal rights gay couples won, she did not care about the morality of \"gay acts\" or about taxes or money. She cared about what she had with her husband for thirty years and her knowledge and memory of it as a wonderful marriage. She lamented that if the definition of marriage is changed to include gays, then the thing she had cherished as marriage for so long would lose much of its meaning for her. She did not say it would lose much of its meaning to her friends, to her family, or to the general public, but to HER. In her eyes, marriage is a very delicate, natural thing and its (I dare say) sanctity would be destroyed by labeling two gays as \"married.\" To change the definition of marriage now is to change the self-perception, indeed the self-perceived value of many current marriages. \n\n \n So, we deny rights and privileges to a class of people based on the feelings of one person? We're supposed to give up our insistence on marriage because we shoudn't want to hurt the feelings of people like this woman. She states -in flowery terms - that equating our relationships to hers demeans her relationship and we're NOT supposed to call her the \"elitist\" that she is? We're supposed to excuse and condone her bigotry because she states that it would demean her relationship without even specifying how or why?\n \n \n YYYYYAAAAAAAWWWWWWWWNNNNNNNN!!!!!!\n \n This argument is T I R E D!\n \n \n However, we do run into a dilemma here. Liberals want to know what it is that the creation of same-sex marriage does that hurts straight marriages. I have said what this is. But, a liberal will say that the lowered value of a marriage is not real, it is only perceived due to the bigoted minds of the conservatives themselves. If they weren't bigots, there wouldn't be a problem. Well, the moral relativistic nature of liberal doctrine flies in the face of this argument. The fact is that if it cannot be proven that gay sex is immoral because all of the arguments that say so are based on religion or social norms, then it cannot be proven that being bigoted is in any way immoral either. From a liberal morally relativistic standpoint, there are no concrete morals, just the relative feelings of each individual member of a society (at best). Well then, the hurt feelings of the widow described above matter no less than anyone else's, even if she is some kind of \"bigot.\" Her feelings do not cease to exist.\n \n\n \n You contradict yourself (in the same sentense no less). You accuse liberals of moral relativism and then accuse them of having no concrete morals? Truth of the matter is, this woman has an issue with gay marriage because if some unseen, un-measurable harm in her own head. Since people cannot come up with any tangible reason for denying same-sex couples marriage - and same-sex couple can at least quantify the harm of denying them marriage, who do you think wins the argument?", 
   {
    "unicode_changes_made": true
   }, 
   118490, 
   null, 
   1115655900.0
  ], 
  [
   119223, 
   null, 
   "Jaxian", 
   "Being bigoted is not immoral. Harming other people who do not seek to harm you is immoral. The woman who suggested that her marriage would lose meaning because someone else is allowed to get married too is bigoted, but she is not immoral, for she said that she does not care what rights gay people win. If this changed, if she indeed went out and voted against same-sex marriage or made an attempt to deny marriage to gay people, then she has moved from being bigoted to harming other people. In doing this, she would have become immoral.\n \n In the same light, it is not necessarily those who think less of their own marriage because a same-sex couple is allowed to marry who are immoral, it is those who would use such stories to oppose same-sex marriage, to harm other people, who are immoral.\n \n Regarding the harm described, I cannot agree that one woman thinking less of her marriage because same-sex marriage is legalized constitutes a harm caused by same-sex marriage. I cannot agree that 10 billion people thinking less of their marriage is a harm caused by same-sex marriage. That harm is caused not by legalizing same-sex marriage but by the intolerance of people who are unwilling to accept anything but elevation over people different than themselves. It is a harm caused by the woman upon herself. It would be absurd for any homosexual to speak of the harms of his or her marriage by describing the equality of heterosexual marriage as a making him feel like his marriage wasn't as special. Our law does not exist to make one man's relationship more special than the next. Our law exists to treat everyone equally and grant them freedom. \n \n Using a woman who claims that granting everyone else the same benefits she has makes her feel worse about her marriage really boils down to a desire for superiority over others. I care that denying people benefits or rights under the law will make that woman feel better, but I will not harm others to make her feel better, and there is no morality which can justify that harm.", 
   {}, 
   119170, 
   null, 
   1115660340.0
  ], 
  [
   119301, 
   null, 
   "zenodotus", 
   "Unfortunately I haven't had time to respond to all this. And I still don't. I'll do what I can and keep it short, then.\n \n Most of the responses thus far boil down to the same thing: that the pain or suffering or whatever you want to call it is being done to the woman because of her own bigoted ideals. She should not allow other people's opinions to change her view of her marriage because, ultimately, it is her marriage and all judgement towards it that matters springs from her thoughts.\n \n Now lets turn this around.\n \n If gay marriage is legalized, only under the name \"civil union\" instead of marriage, the argument goes that civil unions will be considered second class, even if they have all the same rights and protections under the law. However, using the argument you use, the civil union should not be second class because no matter how other people view it, their civil union is what they make of it and the opinions of others have no bearing.\n \n See the problem?", 
   {}, 
   119223, 
   null, 
   1115666160.0
  ], 
  [
   119306, 
   null, 
   "tonybrown74", 
   "Unfortunately I haven't had time to respond to all this. And I still don't. I'll do what I can and keep it short, then.\n \n Most of the responses thus far boil down to the same thing: that the pain or suffering or whatever you want to call it is being done to the woman because of her own bigoted ideals. She should not allow other people's opinions to change her view of her marriage because, ultimately, it is her marriage and all judgement towards it that matters springs from her thoughts.\n \n Now lets turn this around.\n \n If gay marriage is legalized, only under the name \"civil union\" instead of marriage, the argument goes that civil unions will be considered second class, even if they have all the same rights and protections under the law. However, using the argument you use, the civil union should not be second class because no matter how other people view it, their civil union is what they make of it and the opinions of others have no bearing.\n \n See the problem?\n\n \n I don't see THE problem. But I do see YOUR problem.\n \n If civil unions are supposed to have all the rights and privileges of marriage, why are we calling them civil unions instead of marriages? It amazes me that you cannot see the \"elitism\" of your position. And let's not forget that federal law excludes the recognition of civil unions. Also, the Supreme Court has ruled that separate but equal institutions are inherently unequal , and hence unconstitutional.\n \n Your position is not a logical one.", 
   {}, 
   119301, 
   null, 
   1115666880.0
  ], 
  [
   119333, 
   null, 
   "Jaxian", 
   "Zenodotus, yes, I definitely see what you're saying, but I also disagree with it. First I should mention that civil unions are not intended as the name of same-sex marriage. They are intended as an institution for everyone, while marriage will remain a special institution for same-sex couples.\n \n More importantly, let me discuss what you've said:\n \n \nMost of the responses thus far boil down to the same thing: that the pain or suffering or whatever you want to call it is being done to the woman because of her own bigoted ideals. She should not allow other people's opinions to change her view of her marriage because, ultimately, it is her marriage and all judgement towards it that matters springs from her thoughts.\n\n \n This is certainly not what I said. The woman is indeed suffering because of her own bigoted ideals, but I never said that she should not allow this to happen. She can allow other people's opinions to change her views of marriage as she chooses or does not choose. As I said, it is not immoral to be a bigot. In a sense, any one of us would feel more special if the law said our own relationship was superior to everyone else's. It is only human to feel that relationship is less than it once was when our law suddenly decides that this once-superior relationship is just as good as anyone else's. \n \n But if my marriage were elevated above everyone else's, and I had the opportunity to elevate everyone else's marriage to the same level as mine, I would be morally evil for denying them that equality, those benefits, or anything else simply because I feel bad that my own marriage is no longer superior. I am evil when I hurt others simply to retain my own superiority, and opponents of same-sex marriage who support this woman seek to hurt gay people in order to retain this woman's superiority. That is wrong. The problem has nothing to do with the woman's view of her own marriage.\n \n The real problem is that retaining one's own superiority is not enough reason to deny equality. So I don't care whether gay people see their own relationships as inferior because they're called civil unions. They can do that or not do that as they please. What I care about is equality. \n \n Civil unions are not equality. First and foremost, few civil unions actually hold all the same rights as marriage. In these cases, there can be no doubt that equality simply does not exist, and evil remains, though in a lesser form. Also, civil unions are a seperate institution under the law. This means that even if they begin with the same benefits and rights, any politician is free to draft a law that only applies to one institution or the other. Also, the state legislature could pass a law which applies to both marriage and civil unions, but the governor could line-item-veto the benefits to civil unions.\n \n Yet even if the benefits of civil unions always remained exactly the same as the benefits of marriage, the institutions would still be unequal simply in the minds of the people. Marriage means something to everyone in our society, it is a spiritual bond, it is commitment, it is something more than \"bound by nothing but law\", which is exactly what the term \"civil union\" implies. By granting heterosexuals marriage and homosexuals civil unions, our laws are teaching people that homosexual relationships are not spiritually sanctioned, that they are not really committed, and that they are simply inferior. The law teaches people that the religion held by homosexuals is invalid, it teaches people that God does not sanction their relationship, and it teaches people to disapprove of them. But all people in our society deserve an equal chance to proove and promote their own religion, their own lifestyle, their own beliefs, their own commitment, and their own kindness. The law has no place making that judgement, and in doing so, it teaches a religion and a set of beliefs that it has no place teaching. It perpetuates inequality.\n \n And that's what really matters: civil unions are not equal.", 
   {}, 
   119301, 
   null, 
   1115668020.0
  ], 
  [
   119340, 
   null, 
   "zenodotus", 
   "Why call them civil unions instead of marriage?\n \n We are doing it because doing otherwise would devalue the institution in many people's eyes, much the same way as calling a gay marriage a civil union would devalue gay marriages in many people's eyes.\n \n And don't put forth govt. rulings as if they are infallible truths. The whole reason we are debating this in the first place is because (presumably) you believe the govt's current condition is flawed.", 
   {}, 
   119306, 
   null, 
   1115668260.0
  ], 
  [
   119353, 
   null, 
   "zenodotus", 
   "My former post was for tonybrown74.\n \n Jaxian:\n \n Let me apologize for using the term \"civil union.\" It has current meanings under the law and that wasn't my intent. My intent was to provide any name for gay marriage besides marriage, and obviously civil union was a poor choice. I'm not going to try to invent a name for it right now, but I didn't mean for the misunderstanding, which is much of what you address. So forget the words \"civil union\" in my posts and replace it with a word of your choice (I'll call it \"soul-bound\" from here on out) other than marriage, and you will get my intended meaning. Secondly, it may not have been what you said, but many of the posts did convey the idea I was trying to rebut.\n \n My problem with the rest of your argument is that it assumes you have already proven to me that \"soul-bound\" people are somehow inferior to \"married\" people. The mere use of the name does not by its nature make it inferior. Please succinctly explain to me why verbiage results in automatic inferiority, keeping in mind what I have said about the wording of the term \"marriage\" in terms of its hurting either party. And please don't quote snazzy sounding court rulings like they are irrefutable physical laws.", 
   {}, 
   119340, 
   null, 
   1115669100.0
  ], 
  [
   119357, 
   null, 
   "tonybrown74", 
   "Why call them civil unions instead of marriage?\n \n We are doing it because doing otherwise would devalue the institution in many people's eyes, much the same way as calling a gay marriage a civil union would devalue gay marriages in many people's eyes. \n\n \n Huh? who has ever said that calling a gay marriage a civil union would de-value gay marriages?? You are really reaching for some legitimacy for your bigotry, huh?\n \n \nAnd don't put forth govt. rulings as if they are infallible truths. The whole reason we are debating this in the first place is because (presumably) you believe the govt's current condition is flawed.\n\n \n Didn't say they were infallible truths. However, they are the REALITY of what we live with today. What is also a reality is that those governmental rulings are unconstitutional. That is why some people are pushing for a constitutional amendment. They want to pre-empt courts from ruling in our favor.", 
   {}, 
   119340, 
   null, 
   1115669340.0
  ], 
  [
   119358, 
   null, 
   "wsm2506", 
   " The mere use of the name does not by its nature make it inferior. \n\n \n Exactly. So why not use the name it is already known by: \"marriage\".\n \n You just succeded in refuting your own arguement!!!!!!!!!!!!!!!!!!", 
   {}, 
   119353, 
   null, 
   1115669400.0
  ], 
  [
   119360, 
   null, 
   "joebrummer", 
   "My former post was for tonybrown74.\n \n Jaxian:\n \n Let me apologize for using the term \"civil union.\" It has current meanings under the law and that wasn't my intent. My intent was to provide any name for gay marriage besides marriage, and obviously civil union was a poor choice. I'm not going to try to invent a name for it right now, but I didn't mean for the misunderstanding, which is much of what you address. So forget the words \"civil union\" in my posts and replace it with a word of your choice (I'll call it \"soul-bound\" from here on out) other than marriage, and you will get my intended meaning. Secondly, it may not have been what you said, but many of the posts did convey the idea I was trying to rebut.\n \n My problem with the rest of your argument is that it assumes you have already proven to me that \"soul-bound\" people are somehow inferior to \"married\" people. The mere use of the name does not by its nature make it inferior. Please succinctly explain to me why verbiage results in automatic inferiority, keeping in mind what I have said about the wording of the term \"marriage\" in terms of its hurting either party. And please don't quote snazzy sounding court rulings like they are irrefutable physical laws.\n\n \n \n I can sympathize with your feelings here, but regardless of what you call it, your are still saying that gays and lesbians were not good enough for \"marriage\". Call it something else because it isn't a marriage. \n \n Then ask, why isn't it a marriage? You answer here needs to be something mroe than one man, one women because that isn't a reason. That is a cop out. It is the same as saying a cell phone isn't a phone because it doesn't hang on the kitchen wall.", 
   {}, 
   119353, 
   null, 
   1115669580.0
  ], 
  [
   119366, 
   null, 
   "zenodotus", 
   "Tonybrown: Wow. If you don't know who all that has posted on this thread \"has ever said that,\" you have not been reading any of this.\n \n wsm: An explanation as to how that line refutes my entire argument would be nice.\n \n joebrummer: No, I'm not saying they \"aren't good enough for marriage.\" That is how you are interpreting it. I'm simply saying what they are doing isn't getting married in the first place. Any man can get married to any woman, there is no person who is \"not good enough\" for it.", 
   {}, 
   119360, 
   null, 
   1115670780.0
  ], 
  [
   119370, 
   null, 
   "Redratio1", 
   "Government should have nothing to do with marriage. It is a strictly religious institution.", 
   {}, 
   119366, 
   null, 
   1115671020.0
  ], 
  [
   119372, 
   null, 
   "joebrummer", 
   "joebrummer: No, I'm not saying they \"aren't good enough for marriage.\" That is how you are interpreting it. I'm simply saying what they are doing isn't getting married in the first place. Any man can get married to any woman, there is no person who is \"not good enough\" for it.\n\n \n But what you are saying (and clearly) is that my relationship with another man isn't a marriage. What I am telling you (clearly I hope) is that my 5 year relationship is every bit a marriage. I just don't get the rights, benefits and protections that a heterosexual couple would get.\n \n You are using the same ole argument with fancy words.", 
   {}, 
   119366, 
   null, 
   1115671200.0
  ], 
  [
   119375, 
   null, 
   "wsm2506", 
   "wsm: An explanation as to how that line refutes my entire argument would be nice.\n\n \n \nShe lamented that if the definition of marriage is changed to include gays, then the thing she had cherished as marriage for so long would lose much of its meaning for her.\n\n \n \n \n The mere use of the name does not by its nature make it inferior.\n\n \n Now do you get it?", 
   {}, 
   119366, 
   null, 
   1115671440.0
  ], 
  [
   119399, 
   null, 
   "joebrummer", 
   "Government should have nothing to do with marriage. It is a strictly religious institution.\n\n \n \n That has 1400 other rights the government gives to those with that religious institution.", 
   {}, 
   119370, 
   null, 
   1115673360.0
  ], 
  [
   119409, 
   null, 
   "Redratio1", 
   "That has 1400 other rights the government gives to those with that religious institution.\n\n \n Yup, most of those 1400 should be removed.\n \n If you are married long enough, you can get those rights, just like common law spouses do.", 
   {}, 
   119399, 
   null, 
   1115673900.0
  ], 
  [
   119448, 
   null, 
   "joebrummer", 
   "Yup, most of those 1400 should be removed.\n \n If you are married long enough, you can get those rights, just like common law spouses do.\n\n What are you saying? If you are married you get those rights. Period. If you are a gay couple you are out of luck. YOu are strangers in the eyes of the law, regardless how long and happy you were together. A small percetage of those right can be obtained with a lawyer, but it does nothing for the Feds or state taxes if one or the other should pass on. As a living breathing couple, you are still strangers in the eyes of the law.\n \n Gay couple are not afford \"common law\", and in some states they don't even have common law marriage for straights.\n \n Do you really know much about what marriage entails in the eyes of the law? Do you know about the privledges and benefits? or are you making this stuff up as you go along. I commonly see heterosexuals who are married that take most of what marriage means for granted. They don't even know what being married means, yet they are fighting to stop gays from having it. You appear to be one of those people.", 
   {}, 
   119409, 
   null, 
   1115676660.0
  ], 
  [
   119451, 
   null, 
   "Jaxian", 
   "Jaxian:\n \n Let me apologize for using the term \"civil union.\" It has current meanings under the law and that wasn't my intent. My intent was to provide any name for gay marriage besides marriage, and obviously civil union was a poor choice. I'm not going to try to invent a name for it right now, but I didn't mean for the misunderstanding, which is much of what you address. So forget the words \"civil union\" in my posts and replace it with a word of your choice (I'll call it \"soul-bound\" from here on out) other than marriage, and you will get my intended meaning. Secondly, it may not have been what you said, but many of the posts did convey the idea I was trying to rebut.\n \n My problem with the rest of your argument is that it assumes you have already proven to me that \"soul-bound\" people are somehow inferior to \"married\" people. The mere use of the name does not by its nature make it inferior. Please succinctly explain to me why verbiage results in automatic inferiority, keeping in mind what I have said about the wording of the term \"marriage\" in terms of its hurting either party.\n\n \n Well, to be honest, \"soul-bound\" is not nearly as offensive as \"civil union\", and I do not mind the name at all. Yet even if we could get our opponents to agree to \"soul-bound\" (which I don't think we could), it would still be a seperate institution which could be treated differently under the law. So at the minimum, if we did this, we'd need a federal constitutional amendment assuring that \"soul-bound\" people cannot be treated differently in any way, shape or form married people under the law.\n \n And still, although the meanings of the terms \"soul-bound\" and \"married\" are similar, people would assign different meanings to them over time and they'd be interpreted differently, and our law would still in essence teaching people that there is some fundamental difference between same-sex couples and opposite-sex couples, and eventually their meanings would come to be different. I could probably live with \"soul-bound\" vs. \"married\", except that there just isn't any reason to create a new institution for same-sex couples. If we want to distinguish between same-sex marriage and opposite-sex marriage, we can simply say, \"same-sex marriage\" or \"opposite-sex marriage\". There isn't any logical reason to deny same-sex couples access to the institution of marriage, and there isn't any logical reason to deny opposite-sex coupes access to the institution of \"soul-bound\". We don't have \"freedom of speech\" for men and \"liberty of talking\" for women. Everyone gets the same access to the same rights, and it really doesn't make sense to arbitrarily grant different access to rights which accomplish the same thing unless we're trying to teach people that one group is superior to another.\n \n \nAnd please don't quote snazzy sounding court rulings like they are irrefutable physical laws.\n\n \n Hah, I never do that! It is as possible that court rulings are wrong as it is that they are right. It is as possible that the Constitution is wrong as it is that it is right. Quoting someone else's decision doesn't make that decision reasonable or moral.", 
   {}, 
   119353, 
   null, 
   1115676780.0
  ], 
  [
   119452, 
   null, 
   "Redratio1", 
   "What are you saying? \n\n \n I think you misunderstand me. Hetero and homosexual couples should have equal protection under the law. Marriages should be treated no different than common-law marriages, or civil unions, whatever you call it.", 
   {}, 
   119448, 
   null, 
   1115676780.0
  ], 
  [
   119454, 
   null, 
   "joebrummer", 
   "I think you misunderstand me. Hetero and homosexual couples should have equal protection under the law. Marriages should be treated no different than common-law marriages, or civil unions, whatever you call it.\n\n \n \n I agree with that. what many of the nati-marriage crew tries so hard to get us to beleive is that gays can get all the rights at the lawyer. That is simply not the case. They also think that civil unions are marriage with another name..that is also simply not the case.", 
   {}, 
   119452, 
   null, 
   1115676900.0
  ], 
  [
   119490, 
   null, 
   "MrWriteLA", 
   "Interesting thought... what if, instead of \"civil unions\"--I'm talking here about some future kind that carries the exact same benefits, etc., of marriage--they were  called something cool and committed-sounding like \"soul-bound\"?\n \n It's kind of like imagining what would have happened if those \"separate\" drinking fountains for blacks had been gold-plated instead of porcelain like the ones for whites.", 
   {}, 
   119454, 
   null, 
   1115678820.0
  ], 
  [
   119500, 
   null, 
   "zenodotus", 
   "Honestly, Jaxian is the only person on this thread that continues to post logically sound arguments.\n \n wsm: You don't understand my argument, which is painful, considering I put quite a bit of effort into explaining it. If you really believe that those quotes refute my argument, then by all means you are free by me to be blissfully ignorant of this debate. In order to sway you otherwise I would have to address yet again several very fundamental parts of my argument and I simply am not going to do that. I don't debate to run around in circles. You can reread my posts on this thread, in full, if you want to understand.\n \n (This and the following paragraphs are in response to) Jaxian: I would certainly support that constitutional amendment, and I believe the vast majority of America would as well. \n \n I think at least a major part of our disagreement comes down to this: I believe that there is some difference between \"regular\" marriage, and gay marriage. You believe that the two are essentially the same thing, with no \"fundamental difference,\" as you say. It could, fairly rationally, be argued that same-sex marriage is in fact fundamentally different from marriage, and not necessarily in the amount of love each person has for the other. One could argue that the fact that the genders are opposite in one, and the same in the other, does in fact make them fundamentally different, and, quite frankly, fundamentally opposite.\n \n Don't get me wrong. I am not looking to have gays persecuted in any way. I am trying to look after the \"meaning coming to be different\" (as you say) of the term marriage. You fear that the term \"soul-bound\" (or whatever) would come to be different, and I fear the same thing with \"marriage.\"\n \n When you say we can define them as \"same-sex marriage,\" realize that what I am saying is that this is a logical impossibility, and that \"opposite-sex marriage\" is redundant. I don't want to deny anyone access to anything. Everyone has the opportunity to get married to a woman if they are a man and a man if they are a woman, and, assuming it were legal, everyone would have the opportunity to be \"soul-bound\" to a man if they were a man and \"soul-bound\" to a woman if they were a woman.", 
   {}, 
   119366, 
   null, 
   1115679420.0
  ], 
  [
   120078, 
   null, 
   "Jaxian", 
   "Honestly, Jaxian is the only person on this thread that continues to post logically sound arguments.\n\n \n Thank you for such a compliment, though everyone posts illogical things sometimes, even me. I will continue to do my best to be logically sound.\n \n \nJaxian: I would certainly support that constitutional amendment, and I believe the vast majority of America would as well.\n\n \n I do not believe that the vast majority of America would support this. Polls do indicate that a slight majority would favor giving civil unions to same-sex couples, but changing the term to something which might imply that gay people are religious or that their religion is recognized under the law would give people the impression that the law is recognizing same-sex marriages as religiously significant, and they would oppose the change.\n \n \nI think at least a major part of our disagreement comes down to this: I believe that there is some difference between \"regular\" marriage, and gay marriage. You believe that the two are essentially the same thing, with no \"fundamental difference,\" as you say. It could, fairly rationally, be argued that same-sex marriage is in fact fundamentally different from marriage, and not necessarily in the amount of love each person has for the other. One could argue that the fact that the genders are opposite in one, and the same in the other, does in fact make them fundamentally different, and, quite frankly, fundamentally opposite.\n\n \n As you can imagine, I have considered the differences between same-sex and opposite-sex marriage. I do acknowledge that, as you say, the genders of those involved are different, though not opposite. A homosexual female couple has genders opposite to a homosexual male couple. I do acknowledge the difference between having one member of each gender versus having two members of the same gneder. But I do not consider this a fundamental difference. \n \n I could certainly point out one family whose members all have white hair, and a similar family whose members all have black hair. I could say \"These families have opposite hair colors, and they are fundamentally different.\" Yet they might not be fundamentally different. Both might be families with two parents, three kids, one boy, two girls. Both might be families where one parent works and the other stays at home to take care of the kids. Hair color really is not a fundamental difference at all.\n \n So is gender a fundamental difference? What if one of those families had two male parents while the other had one male parent and one female parent? Does that truly make the families fundamentally different any more than hair color does? What is the difference? I do not believe that gender is of any greater significance than hair color.\n \n But if gender were of greater significance than hair color, would it be appropriate then to say that a family with three male children is fundamentally different than a family with three female children? Should we create seperate legal institutions and give those families seperate rights under the law? What makes the gender of the parents important but not the gender of anyone else in the family? I can only come up with the conclusion that same-sex parents have been singled out as fundamentally different not because they actually are fundamentally different, but because the majority is just looking for any reason to treat them differently.\n \n I suspect that you will move into a discussion of how child-production makes them fundamentally different. I have not yet heard any explanation which indicates to me that ability to reproduce via sex with the other member of one's relationship makes that relationship fundamentally different. I would welcome your opinion and logic on the issue.\n \n \nDon't get me wrong. I am not looking to have gays persecuted in any way. I am trying to look after the \"meaning coming to be different\" (as you say) of the term marriage. You fear that the term \"soul-bound\" (or whatever) would come to be different, and I fear the same thing with \"marriage.\"\n\n \n Marriage would indeed come to be different, but I do not fear that. Legalizing same-sex marriage would not make it come to be seen differently in a bad way. Those who see marriage today as a legal right would continue to see it as such. Those who see marriage today as a union between people who love each other would continue to see it that way. Those who see marriage as an institution to help raise children would continue to see it that way. Those who see marriage as an institution to help all members of the family would continue to see it that way. Those who see marriage as a union between a man and a woman would change. They would most likely become people who see marriage as a legal contract, but this would not destroy their religious beliefs as to what makes a good marriage.\n \n There is no indication nor reason to believe that same-sex marriage would make people feel that it is now acceptable to cheat on one's spouse or act outside of the marital values that we currently accept. Some people might think that marital values have declined, but those people would still not feel it right to act outside of our current marital values, just as no one else actually would. Same-sex marriage might, on the other hand, promote the idea that it is love and commitment to one's family which makes the marriage, not the gender of the people involved.\n \n The most important part of giving same-sex and opposite-sex couples access to the same legal institution is that it supports the idea that we're all part of the same group of people. We're all families, and we're all trying to support those families and to be good people in general. Again, the law should not teach that homosexual relationships are fundamentally different than heterosexual relationships.\n \n \nWhen you say we can define them as \"same-sex marriage,\" realize that what I am saying is that this is a logical impossibility, and that \"opposite-sex marriage\" is redundant. I don't want to deny anyone access to anything. Everyone has the opportunity to get married to a woman if they are a man and a man if they are a woman, and, assuming it were legal, everyone would have the opportunity to be \"soul-bound\" to a man if they were a man and \"soul-bound\" to a woman if they were a woman.\n\n \n Yet you are denying people access to an institution, for each person will find one other that he or she loves. Those people are denied access to one of the institutions unless they change who they love. But it isn't the government's place to disperse rights based on lifestyle, love, or beliefs. Granting people access to an institution if they change their lives, love, or beliefs is still denying them access to that institution if they don't.\n \n But the more important part, I suppose, is still that the law should not be granting rights to opposite-sex couples than it grants to same-sex couples any more than it grants males \"freedom of speech\" and females \"liberty of talking\". Even if there were a fundamental difference in content between male and female speech, there is no reason for the law to create a name for the right of freedom of speech which is different for males than it is for females. \n \n One might say that we do not want the idea of \"male speech\" to be changed by including \"female speech\" in the same group of rights. But this change could occur only in the minds of the people; it would result in the government's failure to teach the people something. What is that something? Surely the people would not suddenly stop understanding the difference between a male speaking and a female speaking if both were given the same legal rights. So what we would be teaching people is not \"remember that males speaking involves males and females speaking involves females\" it is \"remember that male speaking has different values and a different worth than female speaking\". The reason for granting the same right under a different name is to teach that speech by males has different values and worth than speech by females, or in the case of marriage, that relationships between two members of the same sex have different values and different worth than do relationships between two members of the opposite sex.", 
   {}, 
   119500, 
   null, 
   1115744520.0
  ], 
  [
   120084, 
   null, 
   "jyoshu", 
   "Honestly, Jaxian is the only person on this thread that continues to post logically sound arguments.\n \n wsm: You don't understand my argument, which is painful, considering I put quite a bit of effort into explaining it. If you really believe that those quotes refute my argument, then by all means you are free by me to be blissfully ignorant of this debate. In order to sway you otherwise I would have to address yet again several very fundamental parts of my argument and I simply am not going to do that. I don't debate to run around in circles. You can reread my posts on this thread, in full, if you want to understand.\n\n \n You're wating your time with WSM. \n \n I second your thoughts about Jaxian--it's his willingness to actually listen and know that dicussion can't take place by flying off the handle that I credit to dialog that has led to some changes in the way I think about some matters related to gay rights.\n \n \nI think at least a major part of our disagreement comes down to this: I believe that there is some difference between \"regular\" marriage, and gay marriage. You believe that the two are essentially the same thing, with no \"fundamental difference,\" as you say. It could, fairly rationally, be argued that same-sex marriage is in fact fundamentally different from marriage, and not necessarily in the amount of love each person has for the other. One could argue that the fact that the genders are opposite in one, and the same in the other, does in fact make them fundamentally different, and, quite frankly, fundamentally opposite.\n\n \n This IS the gist of the issue. And it's the point that several here refuse to try and see no matter what.\n \n It's not a matter of two different water fountains; it's a matter of the one water fountain being redefined because one group wants to drink from it a different way.", 
   {}, 
   119500, 
   null, 
   1115745120.0
  ], 
  [
   120100, 
   null, 
   "wsm2506", 
   "You're wating your time with WSM. \n\n \n Thank you! The feeling is mutual. :) \n \n \nIt's not a matter of two different water fountains; it's a matter of the one water fountain being redefined because one group wants to drink from it a different way.\n\n \n It is still a water fountain, no matter how you drink from it. Would you prefer to limit \"water fountain\" for heterosexuals and come up with a new definition (water dispenser?) for homosexuals?", 
   {}, 
   120084, 
   null, 
   1115746380.0
  ], 
  [
   120169, 
   null, 
   "zenodotus", 
   "The primary reason I was posting here was to prepare for a debate I had late yesterday. I was on the pro-gay-marriage side. I wanted to hear some good arguments that I could use in the debate, so I posted here with the arguments they were likely to use against me. Needless to say my team won the debate.\n \n So, my drive to continue this debate has withered up for two reasons. The first being that my formal debate is over, and we won. Secondly, I feel like we aren't making much if any progress any longer in this thread. The issue seems to inevitably hit a wall when the two sides reach the point where, essentially, one side believes marriage is fundamentally different than gay marriage, and the other side does not. The reasons behind these beliefs contain no absolutely solid reasoning on either side, and the disagreement grinds to a halt.\n \n Anyhow, I could type up a response to that last, Jaxian, but as I said I don't see it going anywhere. Thanks for the valuable input nonetheless.", 
   {}, 
   120100, 
   null, 
   1115753400.0
  ], 
  [
   120176, 
   null, 
   "JustineCredible", 
   "The primary reason I was posting here was to prepare for a debate I had late yesterday. I was on the pro-gay-marriage side. I wanted to hear some good arguments that I could use in the debate, so I posted here with the arguments they were likely to use against me. Needless to say my team won the debate.\n \n So, my drive to continue this debate has withered up for two reasons. The first being that my formal debate is over, and we won. Secondly, I feel like we aren't making much if any progress any longer in this thread. The issue seems to inevitably hit a wall when the two sides reach the point where, essentially, one side believes marriage is fundamentally different than gay marriage, and the other side does not. The reasons behind these beliefs contain no absolutely solid reasoning on either side, and the disagreement grinds to a halt.\n \n Anyhow, I could type up a response to that last, Jaxian, but as I said I don't see it going anywhere. Thanks for the valuable input nonetheless.\n\n \n \n No thanks to you, but I believe I would not be alone to say that your posting here under such false pretences was inexusable.", 
   {}, 
   120169, 
   null, 
   1115754780.0
  ], 
  [
   120196, 
   null, 
   "Jaxian", 
   "The primary reason I was posting here was to prepare for a debate I had late yesterday. I was on the pro-gay-marriage side. I wanted to hear some good arguments that I could use in the debate, so I posted here with the arguments they were likely to use against me. Needless to say my team won the debate.\n\n \n Glad we could be of some assistance.\n \n \nSo, my drive to continue this debate has withered up for two reasons. The first being that my formal debate is over, and we won. Secondly, I feel like we aren't making much if any progress any longer in this thread. The issue seems to inevitably hit a wall when the two sides reach the point where, essentially, one side believes marriage is fundamentally different than gay marriage, and the other side does not. The reasons behind these beliefs contain no absolutely solid reasoning on either side, and the disagreement grinds to a halt.\n\n \n Well, I cannot agree less. Although I believe that same-sex marriage and opposite-sex marriage are not fundamentally different, the point of the last couple paragraphs of my most recent post is that it does not matter whether they are fundamentally different. We do not create seperate sets of rights under the law for people or groups of people who are fundamentally different. We give everyone the same rights as much as possible. The only possible thing that having two seperate sets of rights with the same benefits would do is teach people that one group of people is worth more than the other. To put such teaching into law is morally wrong.\n \n \nAnyhow, I could type up a response to that last, Jaxian, but as I said I don't see it going anywhere. Thanks for the valuable input nonetheless.\n\n \n I'm glad you think my input is valuable. I debate same-sex marriage as much and as often as possible (as you can see from me debating your above paragraph); I somehow never feel like I can't convince my opponent if I just keep on explaining my position. So if you ever feel the desire to add more to this discussion or to have my opinion on some other gay rights issue, I'll be ready!", 
   {}, 
   120169, 
   null, 
   1115759040.0
  ], 
  [
   120295, 
   null, 
   "Duo_Maxwell", 
   "I must say, that is a good way to prepare.", 
   {}, 
   120196, 
   null, 
   1115767140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Answer", 
  "url": "http://www.4forums.com/political/gay-rights-debates/5109-answer.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 5109, 
  "discussion_files": [
   [
    "18462.html", 
    "http://www.4forums.com/political/gay-rights-debates/5109-answer-print.html"
   ], 
   [
    "18463.html", 
    "http://www.4forums.com/political/gay-rights-debates/5109-answer-4-print.html"
   ], 
   [
    "18464.html", 
    "http://www.4forums.com/political/gay-rights-debates/5109-answer-3-print.html"
   ], 
   [
    "18465.html", 
    "http://www.4forums.com/political/gay-rights-debates/5109-answer-2-print.html"
   ]
  ], 
  "identifier": 5109
 }
]