[
 [
  [
   118609, 
   null, 
   "viva", 
   "Should the Chinese react vociferously about the downgrade of the Nanjing massacre to the Nanjing incident, and the total disappearing of Unit 731 and \"comfort women\"? Or should they just \"get over it\" and have the Japanese tell them to be thankful for the war that was waged to \"liberate the Asian countries from the western imperialists\"?", 
   {
    "post_info": {
     "post_title": "Never Forget the History!"
    }
   }, 
   null, 
   null, 
   1115541120.0
  ], 
  [
   118611, 
   null, 
   "viva", 
   "The Japanese should, NEVERTHELESS, properly deal with their war time past. The thing is, its not about who is to blame for what, its about facing up to your own guilty as a nation for your own good. Its not about satisfying China, its about being true to yourself; which can only strengthen and make yourself a better person or a better nation.", 
   {
    "post_info": {
     "post_title": "deal with their war time past"
    }
   }, 
   118609, 
   null, 
   1115541180.0
  ], 
  [
   118614, 
   null, 
   "viva", 
   "The risk of discussing atrocities in the past is that people try to minimize the damages. To have a healthy discussion, I suggest we should start from Japan's aggression history 101. At least from Meiji Restoration. Then, people like Ossan, a Japanese expert, will understand why tens of millions of people in Asia and other parts of the world reacted in the way they could not comprehended.", 
   {
    "post_info": {
     "post_title": "To have a healthy discussion"
    }
   }, 
   118611, 
   null, 
   1115541240.0
  ], 
  [
   118691, 
   null, 
   "Alan Ryan", 
   "Why have you split your post about the same matter into three sections ? Best to state your point(s) in one simple message. What is your salient point ?", 
   {}, 
   118614, 
   null, 
   1115559720.0
  ], 
  [
   118738, 
   null, 
   "Diogenes99", 
   "The Japanese should, NEVERTHELESS, properly deal with their war time past. The thing is, its not about who is to blame for what, its about facing up to your own guilty as a nation for your own good.\nWhen will China own up to its guilt for its invasion of Tibet? When will Russia atone for its occupation of eastern Europe and the Baltic states?", 
   {}, 
   118611, 
   null, 
   1115572440.0
  ], 
  [
   118755, 
   null, 
   "georged", 
   "When will China own up to its guilt for its invasion of Tibet? When will Russia atone for its occupation of eastern Europe and the Baltic states?\n\n \n And the US on Iraq?", 
   {}, 
   118738, 
   null, 
   1115574840.0
  ], 
  [
   118877, 
   null, 
   "Diogenes99", 
   "That was self-defense for the US, and liberation for the Iraqis. No apology is necessary.", 
   {}, 
   118755, 
   null, 
   1115592960.0
  ], 
  [
   118887, 
   null, 
   "Big_Bear_Scot", 
   "That was self-defense for the US, and liberation for the Iraqis. No apology is necessary.\n \n \n How it was self defence Saddam had no WMD.\n \n It was an illegal War of aggression the sooner the Pro-War crowd admit it we can move on, after that has happened we can discus if it was the moral thing to do.", 
   {}, 
   118877, 
   null, 
   1115593980.0
  ], 
  [
   118925, 
   null, 
   "georged", 
   "That was self-defense for the US, and liberation for the Iraqis. No apology is necessary.\n\n \n Self defense? Iraq did not attack the US. It was purely an unprovoked invasion and occupation of another sovereign nation. Even the flimsy WMD excuse has been dismissed by the US.", 
   {}, 
   118877, 
   null, 
   1115598000.0
  ], 
  [
   118934, 
   null, 
   "Big_Bear_Scot", 
   "Self defense? Iraq did not attack the US. It was purely an unprovoked invasion and occupation of another sovereign nation. Even the flimsy WMD excuse has been dismissed by the US.\n \n \n Even the UK Attorney General said that an Invasion Iraq could be illegal without a 2nd UN resolution that authorised the Use of force. \n \n So what are the reasons for the War in the absence of WMD and no legal basis for war ?\n \n here is the Attorney General advice to Tony Blair -\n \n http://www.number-10.gov.uk/files/pdf/Iraq%20Resolution%201441.pdf\n \n and here is the news story that concerns the AG advice-\n \n http://news.bbc.co.uk/1/hi/uk_politics/vote_2005/frontpage/4482029.stm", 
   {}, 
   118925, 
   null, 
   1115599260.0
  ], 
  [
   119127, 
   null, 
   "georged", 
   "Even the UK Attorney General said that an Invasion Iraq could be illegal without a 2nd UN resolution that authorised the Use of force. \n \n So what are the reasons for the War in the absence of WMD and no legal basis for war ?\n \n\n \n The US public has accepted government refocus that 'Saddam was a bad man' and 'freeing the Iraqi people from a bad man' as justification for invading and occupying a sovereign nation. Pretty pathetic.", 
   {}, 
   118934, 
   null, 
   1115651220.0
  ], 
  [
   119180, 
   null, 
   "fracas", 
   "as we all know iraq under saddam was literally Eden\n sun shine and lollipops\n pop music and lovely ladies\n kites and flowers\n laughing children and obedient dogs\n \n damn the US to hell for ending that.\n \n \n as regard to national apologies for graves crimes against people, it should be done once in a lasting way, reflected upon but not dwelt on.\n \n \n i think we should ressurect Saddam's statue in Bagdhad with the inscription\n \"so sorry for the liberation in 03\"", 
   {}, 
   119127, 
   null, 
   1115656560.0
  ], 
  [
   242051, 
   null, 
   "gman", 
   "This thread began as a reminder of some atrocities commited by the Japanese. Someone added atrocities by Russians and Chinese.\n All appropriate, as people should be reminded of the great disasters \n inflicted upon others.\n Then, the lame left began their spin, Their typical lies with which to denegrate an honorable effort. But alas, their lies shall be challenged.\n The invasion of Iraq was actually in response to Iraq disregarding sanctions placed upon it by the \"U.N.\". \n The U.N. had inspectors attempting to inspect. Iraq moved materials and harrassed the inspectors. Hussien played games with the inspectors. \n The U.N. was asked to take the reigns of the removal of the tyrant.\n They were preoccupied counting money from the oil for food scandal. \n Democrats supported the action until it became politically expedient to change their minds. All of this was of course unnecessary but the gentleman could not post a reminder to us of atrocities commited in history without the left seeing an opening to attack a great nation. \n They are a pitiful lot.", 
   {}, 
   119180, 
   null, 
   1165196580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Never Forget the History!", 
  "url": "http://www.4forums.com/political/society-debates/5115-never-forget-history.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 5115, 
  "discussion_files": [
   [
    "4002.html", 
    "http://www.4forums.com/political/society-debates/5115-never-forget-history-print.html"
   ]
  ], 
  "identifier": 5115
 }
]