[
 [
  [
   119142, 
   null, 
   "simone", 
   "1601 U.S. Military Personnel Have Died in Iraq as of Today\n \n An uncountable number of innocent Iraqis have died.\n \n There are no WMDs.\n \n There was no connection between Iraq and the September 11, 2001 attack on my nation.\n \n There was no connection between Iraq and Al-Qaeda.\n \n And in America?\n \n Just lie after lie after lie.\n \n \n 2006: Prelude to an Impeachment.", 
   {
    "post_info": {
     "post_title": "1601 U.S. Soldiers Have Died in Iraq"
    }
   }, 
   null, 
   null, 
   1115652660.0
  ], 
  [
   119171, 
   null, 
   "Alan Ryan", 
   "\n \n And in America?\n \n Just lie after lie after lie.\n \n \n 2006: Prelude to an Impeachment.\n\n \n It's exactly the same in Britain: and we have just re-elected the man who was so economical with the truth.", 
   {}, 
   119142, 
   null, 
   1115655960.0
  ], 
  [
   119177, 
   null, 
   "fracas", 
   "i remain content with the progress thus.", 
   {}, 
   119171, 
   null, 
   1115656320.0
  ], 
  [
   119188, 
   null, 
   "Missouri Mule", 
   "1601 U.S. Military Personnel Have Died in Iraq as of Today\n \n An uncountable number of innocent Iraqis have died.\n \n There are no WMDs.\n \n There was no connection between Iraq and the September 11, 2001 attack on my nation.\n \n There was no connection between Iraq and Al-Qaeda.\n \n And in America?\n \n Just lie after lie after lie.\n \n \n 2006: Prelude to an Impeachment.\n\n \n \n And I'll bet you are just jumping up with glee with reports of each new death. Would I be wrong?", 
   {}, 
   119142, 
   null, 
   1115657160.0
  ], 
  [
   119191, 
   null, 
   "Alan Ryan", 
   "i remain content with the progress thus.\n\n \n A few questions for you to answer:\n \n Content with the lies ? Is the \"progress\" thus, \"worth\" 1600+ deaths ? Progress towards what ? At what point, if any, will further casualties become \"unacceptable\" ?", 
   {}, 
   119177, 
   null, 
   1115657640.0
  ], 
  [
   119197, 
   null, 
   "fracas", 
   "A few questions for you to answer:\n \n [1]Content with the lies ? [2]Is the \"progress\" thus, \"worth\" 1600+ deaths ? [3]Progress towards what ?[4] At what point, if any, will further casualties become \"unacceptable\" ?\n\n 1. what lies?\n 2. yes.\n 3. a better middle east\n 4. when iraqi are not willing to fight and die for their own democracy", 
   {}, 
   119191, 
   null, 
   1115657760.0
  ], 
  [
   119205, 
   null, 
   "Alan Ryan", 
   "1. what lies?\n 2. yes.\n 3. a better middle east\n 4. when iraqi are not willing to fight and die for their own democracy\n\n \n Very slick answers to complicated questions: you can do better, No ?", 
   {}, 
   119197, 
   null, 
   1115658300.0
  ], 
  [
   119255, 
   null, 
   "Zardoz", 
   "It's exactly the same in Britain: and we have just re-elected the man who was so economical with the truth.\n\n \n Yep. That just baffles my mind.\n How can the liberal anti-war crowd yell so loudly and declare the wrongs done, the lies told...over...and over...and over.\n And, somehow, their declarations of truth...fall of the deaf ears of the majority. To the point that we re-elect these dispicable liars and war mongers!\n \n Australia\n The US\n Britian...\n \n It MUST be a conspiracy.\n \n Lies. Lies. Lies.\n \n Impotent. Impotent. Stupid.\n \n Next time, tell your listeners to VOTE...twice.", 
   {}, 
   119171, 
   null, 
   1115662680.0
  ], 
  [
   119279, 
   null, 
   "Jo Bennett", 
   "Well, in the UK the reason Blair got reelected was because the opposition supported the war, and would have invaded even if they had known beforehand that there were no WMDs (ie completely illegally). The alternative, exercised by roughly 1/3 of the population, was to vote for a party which was against the war, the lib dems, greens, SNP, SSP, Plaid Cymru etc. And there were a large number of people who voted labour as the lesser of two evils.", 
   {}, 
   119255, 
   null, 
   1115664180.0
  ], 
  [
   119285, 
   null, 
   "wilted_laughter", 
   "It seems to me that persistance in Iraq and the achievement of Iraqi democracy is owed to the dead.\n \n Might as well finished what was started.", 
   {}, 
   119279, 
   null, 
   1115664720.0
  ], 
  [
   119341, 
   null, 
   "Alan Ryan", 
   "@zardoz\n I'm baffled by what point you're making ? Is there an irony that I've missed in your post ?\n \n \n @jo bennet\n The election result demonstrates that many people in Britain know that politicians lie, but they do not mind. They elect them anyway.", 
   {}, 
   119285, 
   null, 
   1115668320.0
  ], 
  [
   119369, 
   null, 
   "Desaix", 
   "\n @jo bennet\n The election result demonstrates that many people in Britain know that politicians lie, but they do not mind. They elect them anyway.\n\n \n No the election demonstrates that thousands of nameless dead Iraqi's are of less importance to the majority of the British people then a prosperous economy.\n \n I can't say i blame the majority.I would have voted Blair even though i am against the war.", 
   {}, 
   119341, 
   null, 
   1115671020.0
  ], 
  [
   119371, 
   null, 
   "Jo Bennett", 
   "I'm slightly more optimistic, I think that they know politicians lie, but would rather have liars than b@stards in office, and don't see how with the current electoral system they can get rid of the liars and the b@stards.", 
   {}, 
   119341, 
   null, 
   1115671020.0
  ], 
  [
   119389, 
   null, 
   "fracas", 
   "Very slick answers to complicated questions: you can do better, No ?\n\n \n \n no sense in weaving complications where simple and direct answers speak true", 
   {}, 
   119205, 
   null, 
   1115672640.0
  ], 
  [
   119395, 
   null, 
   "Alan Ryan", 
   "no sense in weaving complications where simple and direct answers speak true\n\n \n I admire your brevity: a short answer is often best. Unfortunately, you have overlooked the matter of justification. Since the US (assisted by the \"coalition of the willing\") invaded a foreign country where no vital American interests were at stake, and at a cost of billions of dollars, thousands of lives etc., you should give reasons why this policy was adopted.", 
   {}, 
   119389, 
   null, 
   1115673240.0
  ], 
  [
   119404, 
   null, 
   "wilted_laughter", 
   "Invasion and occupation (if thats what you want to call it at this stage) are seperate issues in my mind. \n \n I was against the invasion, but thats in the past now, and I support the efforts to stablise Iraq.", 
   {}, 
   119395, 
   null, 
   1115673720.0
  ], 
  [
   119422, 
   null, 
   "fracas", 
   "I admire your brevity: a short answer is often best. Unfortunately, you have overlooked the matter of justification. Since the US (assisted by the \"coalition of the willing\") invaded a foreign country where no vital American interests were at stake, and at a cost of billions of dollars, thousands of lives etc., you should give reasons why this policy was adopted.\n\n you did not ask for justifications in post #5 now did you?\n \nA few questions for you to answer:\n \n Content with the lies ? Is the \"progress\" thus, \"worth\" 1600+ deaths ? Progress towards what ? At what point, if any, will further casualties become \"unacceptable\" ?\n\n \n so ok, \"justifications\" given\n 1. legal \"justification \"was violation of a ceasefire.\n 2. humantitarian \"justification\" was liberation\n 3. political \"justification\" was wmd\n 4. economic \"justification\" was a secure ME for oil delivery\n \n i fine with all these \"justifications\"", 
   {}, 
   119395, 
   null, 
   1115674860.0
  ], 
  [
   119513, 
   null, 
   "simone", 
   "And I'll bet you are just jumping up with glee with reports of each new death. Would I be wrong?\nAre you nuts?\n \n 2006: Prelude to an Impeachment.", 
   {}, 
   119188, 
   null, 
   1115680200.0
  ], 
  [
   119516, 
   null, 
   "simone", 
   "I admire your brevity: a short answer is often best. Unfortunately, you have overlooked the matter of justification. Since the US (assisted by the \"coalition of the willing\") invaded a foreign country where no vital American interests were at stake, and at a cost of billions of dollars, thousands of lives etc., you should give reasons why this policy was adopted.\nUm, there is a goodly amount of oil under the ground in Iraq. Also, it will serve the Neo-Cons very well as a region for quite a number of U.S. military bases to keep a large presence in the Middle East.\n \n \n 2006: Prelude to an Impeachment.", 
   {}, 
   119395, 
   null, 
   1115680440.0
  ], 
  [
   119522, 
   null, 
   "Missouri Mule", 
   "Are you nuts?\n \n 2006: Prelude to an Impeachment.\n\n \n You could have fooled me.", 
   {}, 
   119513, 
   null, 
   1115680980.0
  ], 
  [
   119524, 
   null, 
   "Missouri Mule", 
   "Um, there is a goodly amount of oil under the ground in Iraq. Also, it will serve the Neo-Cons very well as a region for quite a number of U.S. military bases to keep a large presence in the Middle East.\n \n 2006: Prelude to an Impeachment.\n\n \n This is by far the silliest and most lame brained argument of the left regarding the Iraq war. If we wanted the oil we could simply have lifted the sanctions. That would have been far cheaper both in terms of cost and lives. \n \n The more I read from the left the more I am becoming convinced there is a pathological brain disorder existing in their ranks. Logic, common sense; any sense of proportion all goes out the window when they come up with this sheer nonsense.", 
   {}, 
   119516, 
   null, 
   1115681220.0
  ], 
  [
   119556, 
   null, 
   "Redratio1", 
   "I don't think the oil was MERELY about oil, however oil had to be taken into th strategic calculations as all things in the ME have something to do with oil. GW1 was clearly about oil, we could not allow Saddam to have control over such a large percentage of the worlds reserves.\n \n So likewise, when I hear those on right say it has nothing to do with oil, I have to wonder if they are lying to themselves, or are ill informed.", 
   {}, 
   119524, 
   null, 
   1115684100.0
  ], 
  [
   119558, 
   null, 
   "Duo_Maxwell", 
   "Tell you the truth, I would have supported the war if it was solely to break OPEC apart. It's not my fault, I'n a product of a capitalist society. \n \n We went there for land. Pretty simple after all. \n \n Where else would we go? Turkey didn't even let us use their airspace for billions of dollars. Kuwait is starting to kick us out, we're almost completely out of Saudi Arabia, Iran's not going to let us have a base until God comes down here and makes dinosaurs arise and do stupid pet tricks for our amusement, Egypt is not going to with current popular hate at 80% and rising, Jordan won't either for many of Egypt's reasons, Syria has been alientated after Sanctions (which we were actually having a trade surplus with, and they easily found new buyers of their fossil fuels) and being labled a terrorist country, Bharain simply doesn't have the land, UAE possibly as the only country in the area that is remotely viable, but much of it is on the other side of the strait of hormuz, so, frankly, we're quickly running out of options like a Hummer powers through a tank of gasoline. Iraq seemed the only real option. It made sense, but well...the invasion was great, the occupation is horrible.", 
   {}, 
   119556, 
   null, 
   1115684280.0
  ], 
  [
   119562, 
   null, 
   "Redratio1", 
   "I don't think base space is too much of a problem right now. Kuwait really kicking us out?\n \n Anyway, I thought it was kind of funny that the military is currently has a major energy efficiency program to make all their vehicles either hybrid or somehow highly efficient (so they have less logistics).\n \n Meanwhile in the civilian arena...................", 
   {}, 
   119558, 
   null, 
   1115684520.0
  ], 
  [
   119569, 
   null, 
   "Duo_Maxwell", 
   "Well, we need a land for major bases. Army bases are huge tracts of land. considering how we're getting kicked out Saudi Arabia and soon to be Kuwait, and the rest of the other countires either were hosting US naval or airforce units it seems logical to take iraq. Of the countries friendly to US bases, none of them have the space. Bharain is a bunch of islands. The largest is smaller then Okinawa!", 
   {}, 
   119562, 
   null, 
   1115685180.0
  ], 
  [
   119573, 
   null, 
   "Redratio1", 
   "Well, we need a land for major bases. Army bases are huge tracts of land. considering how we're getting kicked out Saudi Arabia and soon to be Kuwait, and the rest of the other countires either were hosting US naval or airforce units it seems logical to take iraq. Of the countries friendly to US bases, none of them have the space. Bharain is a bunch of islands. The largest is smaller then Okinawa!\n\n \n I hadn't heard anything about Kuwait kicking us out though. Most Kuwaitis love us (in medium doses).", 
   {}, 
   119569, 
   null, 
   1115685360.0
  ], 
  [
   119589, 
   null, 
   "Duo_Maxwell", 
   "It's not really a actual kicking out. It's more of a Kuwaiti leaderships only letting us do it if the UN approves, sure they fudged it this time, but who wouldn't considering where they are, as well as turning attitudes towards US military presence. \n \n The US needs bases it can use regardless of international attitudes. Such as why Kuwait is becomming less and less attractive. \n \n The times are changing. We must change with them.\n \n \nOrdinary Kuwaitis are also beginning to see through the US intentions in liberating Kuwait. They now believe that the 1991 Gulf War was not fought simply to liberate Kuwait, but with a plan to establish a more permanent strategic presence in the region to tap oil wealth. \n \n Likewise, they believe that this time, too, Washington's focus on Baghdad has little to do with weapons of mass destruction and disarmament. Overthrowing Saddam is widely seen as a mere excuse to install a US-friendly regime that will meet US oil needs, especially when its ties with Saudi Arabia appear strained like never before.\n\n \n http://www.atimes.com/atimes/Middle_East/EA29Ak04.html\n http://english.aljazeera.net/NR/exeres/014F65FF-6D77-4F79-991C-3FC680A757FF.htm\n http://news.bbc.co.uk/2/low/middle_east/2679597.stm", 
   {}, 
   119573, 
   null, 
   1115686140.0
  ], 
  [
   119793, 
   null, 
   "Missouri Mule", 
   "I don't think the oil was MERELY about oil, however oil had to be taken into th strategic calculations as all things in the ME have something to do with oil. GW1 was clearly about oil, we could not allow Saddam to have control over such a large percentage of the worlds reserves.\n \n So likewise, when I hear those on right say it has nothing to do with oil, I have to wonder if they are lying to themselves, or are ill informed.\n\n \n Well, certainly oil is a consideration but no one can make a logical case that we went into Iraq because of oil. Even if we had to pay $200 a barrel for crude it would have been cheaper than going to war over oil. What was Saddam going to do with his oil anyway? Drink it? Besides oil is a fungible commodity and he couldn't have controlled it entirely even if he had it in his mind to bring down the U.S. There is simply no logic for anyone to claim that we went into Iraq because of our desire to control Iraq's oil reserves. Besides Saudi Arabia probably has about 200 years oil supply left themselves. There is no shortage of oil around the world. Saddam wouldn't have lived forever and sooner or later Iraq would have very likely moderated its form of governance. Therefore why did we go in? IMO, two reasons -- Iran and Pakistan. Iran is a terrorist state. Pakistan is full of terrorists but not a terrorist state. However, removing both as sources of terrorism effectively breaks the back of terrorism.", 
   {}, 
   119556, 
   null, 
   1115703780.0
  ], 
  [
   119809, 
   null, 
   "Redratio1", 
   "Well, certainly oil is a consideration but no one can make a logical case that we went into Iraq because of oil. Even if we had to pay $200 a barrel for crude it would have been cheaper than going to war over oil. \n\n \n Nonsense, GW1 we paid so little for that war, some experts think we actually made money on that war. All allied industrialized countries that used oil pitched in large sums of money specifically because we were doing the job of protecting their vital resources. If Kuwait was in the center of Africa no one would have cared one iota.", 
   {}, 
   119793, 
   null, 
   1115705100.0
  ], 
  [
   119820, 
   null, 
   "Missouri Mule", 
   "Nonsense, GW1 we paid so little for that war, some experts think we actually made money on that war. All allied industrialized countries that used oil pitched in large sums of money specifically because we were doing the job of protecting their vital resources. If Kuwait was in the center of Africa no one would have cared one iota.\n\n \n Strawman argument. This is not about Gulf War I.", 
   {}, 
   119809, 
   null, 
   1115705760.0
  ], 
  [
   119825, 
   null, 
   "Redratio1", 
   "I thought we were talking about our involvement in the gulf in general, and replied to the question of not going to war just because the price of gas would go up.\n \n Sheesh.", 
   {}, 
   119820, 
   null, 
   1115706060.0
  ], 
  [
   119839, 
   null, 
   "Missouri Mule", 
   "I thought we were talking about our involvement in the gulf in general, and replied to the question of not going to war just because the price of gas would go up.\n \n Sheesh.\n\n \n Why would you think that? The title of the thread is 1600 soldiers dead in Iraq. That would refer directly to this current war.", 
   {}, 
   119825, 
   null, 
   1115706660.0
  ], 
  [
   119842, 
   null, 
   "Redratio1", 
   "Because I started that ball rolling on post #22.", 
   {}, 
   119839, 
   null, 
   1115706780.0
  ], 
  [
   119865, 
   null, 
   "Missouri Mule", 
   "Because I started that ball rolling on post #22.\n\n \n That's the problem with these long threads. Unless someone takes the time to read and reread every post something will be missed.\n \n I have reread the posts in question and I was responding to the statement by somebody here that we went to war (this time) over oil. I said that was nonsense then and I'll say it again. It's nonsense.", 
   {}, 
   119842, 
   null, 
   1115708160.0
  ], 
  [
   119976, 
   null, 
   "Alan Ryan", 
   "you did not ask for justifications in post #5 now did you?\n \n \n so ok, \"justifications\" given\n 1. legal \"justification \"was violation of a ceasefire.\n 2. humantitarian \"justification\" was liberation\n 3. political \"justification\" was wmd\n 4. economic \"justification\" was a secure ME for oil delivery\n \n i fine with all these \"justifications\"\n\n \n When someone makes assertions as you did in post #6, justifications (no irony \"quotes\" are necessary) are always expected: you know that.\n \n N.B. I'm not ideologically opposed to your point of view on this matter (but I guess you have already concluded that I am) - in which case I should never agree with your justifications for the Iraq expedition, no matter what they were. I would describe myself as a \"neutral\" here and I should be content therefore, to acknowledge the justice in your view, if there is any. \n \n In order to make the case, you must show what \"violation of ceasefire\" took place and why this should require an invasion of Iraq by American forces.\n \n Your humanitarian justification is highly selective - a point I'll come back to, if you wish; but I don't think you will.\n \n Your political justification of WMDs has already been exposed as a hoax: there were no WMDs.\n \n Your economic justification might be true: oil is a scarce commodity - and in the case we are talking about, it belongs to certain countries in the Middle East. By what authority does the US \"secure\" it, and for whom ?\n \n I know you think that exceedingly brief answers are adequate to my enquiries - but try not to let yourself be carried away by my naivety.", 
   {}, 
   119422, 
   null, 
   1115716440.0
  ], 
  [
   119981, 
   null, 
   "GOPPhil", 
   "You know what, I'm a Republican and a loyal Bush fan. However, I recognize that the Iraq war wasn't a stellar idea. Pre-war intelligence was crappy, long-term planning kinda fell by the wayside, resistence was underestimated, and nobody - repeat nobody - knows all the motives that were behind it. Were there outright lies involved? Nobody knows except the people at the top, and all the \"quest for truth\" liberals don't fall into that category.\n \n That said, it doesn't change the fact that were in it right now. We're committed to it, and we have to see it through. This is no longer a fru fru liberal coffee shop debate about the perils of war and government conspiracy. Our dads, moms, brothers, sisters, etc. are over there fighting. So, instead of crying about decisions that were made two years ago, people need to move on, keep troops and thier families in mind, and pray that it'll all be over soon. \n \n On a side note, I'm glad that I haven't read anything on this thread about Iraq being \"another Vietnam.\" While all life is precious, in terms of military history, 1,600 is nothing compared to 50,000. Bottom line: Iraq is no fun and games, but it could be worse. Trust me, I know.", 
   {
    "post_info": {
     "post_title": "Move on..."
    }
   }, 
   119395, 
   null, 
   1115717640.0
  ], 
  [
   119987, 
   null, 
   "fracas", 
   "When someone makes assertions as you did in post #6, justifications (no irony \"quotes\" are necessary) are always expected: you know that.\n \n N.B. I'm not ideologically opposed to your point of view on this matter (but I guess you have already concluded that I am) - in which case I should never agree with your justifications for the Iraq expedition, no matter what they were. I would describe myself as a \"neutral\" here and I should be content therefore, to acknowledge the justice in your view, if there is any. \n \n In order to make the case, you must show what \"violation of ceasefire\" took place and why this should require an invasion of Iraq by American forces.\n \n Your humanitarian justification is highly selective - a point I'll come back to, if you wish; but I don't think you will.\n \n Your political justification of WMDs has already been exposed as a hoax: there were no WMDs.\n \n Your economic justification might be true: oil is a scarce commodity - and in the case we are talking about, it belongs to certain countries in the Middle East. By what authority does the US \"secure\" it, and for whom ?\n \n I know you think that exceedingly brief answers are adequate to my enquiries - but try not to let yourself be carried away by my naivety.\n\n listen. you asked me a few questions, and i answered them. my brevity is because i do not want to get into another discourse about the merit of the iraq war. but not because i can't. and you also did not ask me to make the case for war in iraq did you? i stated that i was satisfied with the progress of the war in iraq, you asked me why, and i answered. you ask me for justifications given, i listed them. you haven't asked about the merit of the justifications, are you asking me that now?\n 1. ceasefire was contingent on full cooperation and disclosure by iraq of the wmd program, this they did not do. and when caught with incriminating weapons, like missiles exceeding agreed to limits, first they denied them, then they admitted to them. the key here is \"absence of full cooperation and disclosure\". cease fire violated.\n 2. humanitarian reasons were selective. ofcourse. how much whining would there be for the US to liberate all the oppressed. and also not praactical. because you cannot liberate all you should liberate none? faulty reasoning. so yes, it was selective, and this was both the right and the smart thing to do. you go where the opportunity is best, and given the need for ME reform, iraq was a humanitarian opportunity that was taken.\n 3. wmd a hoax. don't be silly, there is a huge difference between a lie and being wrong, a hoax and being mistaken. otherwise everytime you are wrong you are also a liar. adults understand this. there were never any proof a lie on wmd was given, that a hoax was advanced for war. \n 4. western europe relies more on ME oil than does the US.\n \n you are asking the wrong questions.\n your question should have been: what was the goal for invading iraq and what were the justifications. that seems to be what you really want to know.", 
   {}, 
   119976, 
   null, 
   1115730840.0
  ], 
  [
   119993, 
   null, 
   "Alan Ryan", 
   "listen. you asked me a few questions, and i answered them. my brevity is because i do not want to get into another discourse about the merit of the iraq war. \n you are asking the wrong questions.\n your question should have been: what was the goal for invading iraq and what were the justifications. that seems to be what you really want to know.\n\n \n OK:\n \n Thanks for telling me what I ought to think: when someone tells you that you're asking the \"wrong questions\", it's evident they want to answer questions of their choice, rather than the ones that were asked.", 
   {}, 
   119987, 
   null, 
   1115733120.0
  ], 
  [
   120000, 
   null, 
   "fracas", 
   "OK:\n \n Thanks for telling me what I ought to think: when someone tells you that you're asking the \"wrong questions\", it's evident they want to answer questions of their choice, rather than the ones that were asked.\n\n still wrong\n you were unstatisfied with my answers not for the answers given but because you wanted to know more than what you asked. that is why i suggested you were asking the wrong questions.\n \n i did answered all your questions, brief as they were.\n my brevity actually speaks volume as to whether i \"want to answer questions of my choice rather than the ones asked\"", 
   {}, 
   119993, 
   null, 
   1115735100.0
  ], 
  [
   120005, 
   null, 
   "Alan Ryan", 
   "still wrong\n you were unstatisfied with my answers not for the answers given but because you wanted to know more than what you asked. that is why i suggested you were asking the wrong questions.\n \n i did answered all your questions, brief as they were.\n my brevity actually speaks volume as to whether i \"want to answer questions of my choice rather than the ones asked\"\n\n \n \n Really ? You say (in post #37) you don't want to get into another discussion about the Iraq war - so why bother joining this thread ?\n \n When I asked for your justifications, I made clear that I had no ideological axe to grind. But you merely repeat what's been said many, many times before - without a single original idea that could damage my skepticism or take the discussion in a new direction.\n \n I could examine your \"justifications\", which I almost know off by heart, but which I mistakenly thought might be news to me. There is no point in doing so: I should not want to lure you into another discourse on the \"merits\" (a curious choice of word) of the Iraq war.", 
   {}, 
   120000, 
   null, 
   1115736540.0
  ], 
  [
   120024, 
   null, 
   "georged", 
   "Many posters are forgetting the primary reason the current administration became upset with Iraq. Saddam was tolerated until Iraq became the first OPEC member to begin accepting Euros instead of USD for oil. With the world's 2nd largest reserves, that presented a potential problem in the form of decreased demand for US securities at a time when the US was entering a recession from the dot.com disaster. The desirability of bases to replace facilities lost in Saudi Arabia were then put into play by the Pentagon, as was the knowledge Saddam's military being third rate it would be a quick invasion of little resistance, read low casualties, with the Iraqi people supposedly welcoming Americans with open arms and last but not least, war is a quick, short-term economic fix for the then falling numbers game. None of those factors alone or as a whole were enough to build public support for such an action, so enter the WMD deception from stage right. \n \n To assume any developed nation invades another sovereign nation solely for purposes of ideology or humanitarianism is ridiculous. Check your history. And the US certainly wasn't and isn't threatened by Iraq, Iran or Pakistan. To claim fear of those counties is as deceptive as the US using McCarthy era fear for building public support with the Indochina domino theory. But I do keep neglecting how gullible the uneducated general public and their government manufactured patriotism actually is, don't I?", 
   {}, 
   119820, 
   null, 
   1115740200.0
  ], 
  [
   120073, 
   null, 
   "simone", 
   "To add to Georged's comments, one must never forget that the United States was a primary agent in the installation of Saddam Hussein, murderous thug that he might be, as the supreme leader of Iraq.\n \n The CIA was in contact with Saddam during his exile in Egypt (exiled from Iraq for being a murderous thug), the CIA tried a number of hair-brained schemes to eliminate Saddam's opponent in Iraq, Abdul Karim Qassem, not to mention being so kind as to give Saddam, upon his return to Iraq, a handy dandy list of opponents for him to hunt down and assassinate.", 
   {}, 
   120024, 
   null, 
   1115744340.0
  ], 
  [
   120143, 
   null, 
   "SteveRogers", 
   "Many posters are forgetting the primary reason the current administration became upset with Iraq. Saddam was tolerated until Iraq became the first OPEC member to begin accepting Euros instead of USD for oil. With the world's 2nd largest reserves, that presented a potential problem in the form of decreased demand for US securities at a time when the US was entering a recession from the dot.com disaster. The desirability of bases to replace facilities lost in Saudi Arabia were then put into play by the Pentagon, as was the knowledge Saddam's military being third rate it would be a quick invasion of little resistance, read low casualties, with the Iraqi people supposedly welcoming Americans with open arms and last but not least, war is a quick, short-term economic fix for the then falling numbers game. None of those factors alone or as a whole were enough to build public support for such an action, so enter the WMD deception from stage right. \n \n To assume any developed nation invades another sovereign nation solely for purposes of ideology or humanitarianism is ridiculous. Check your history. And the US certainly wasn't and isn't threatened by Iraq, Iran or Pakistan. To claim fear of those counties is as deceptive as the US using McCarthy era fear for building public support with the Indochina domino theory. But I do keep neglecting how gullible the uneducated general public and their government manufactured patriotism actually is, don't I?\n\n \n \n Very good. \n \n I still can't believe some are so willing to lose so many for so little. Nor can I get over the acceptance of the ever changing rationales being thrown out by the adminstration. Sooner or later, people have to honestly evaluate the war and this presidents performance.", 
   {}, 
   120024, 
   null, 
   1115749500.0
  ], 
  [
   120147, 
   null, 
   "Alan Ryan", 
   "Very good. \n \n I still can't believe some are so willing to lose so many for so little. Nor can I get over the acceptance of the ever changing rationales being thrown out by the adminstration. Sooner or later, people have to honestly evaluate the war and this presidents performance.\n\n \n People are attempting such honest evaluation - as some of the contributions to this thread (and several others) confirm. \n \n But by \"people\" here we really mean the minority who can think for themselves - and there aren't enough of them to influence the outcomes of elections. (Bush last November: Blair this month).", 
   {}, 
   120143, 
   null, 
   1115750100.0
  ], 
  [
   120149, 
   null, 
   "SteveRogers", 
   "People are attempting such honest evaluation - as some of the contributions to this thread (and several others) confirm. \n \n But by \"people\" here we really mean the minority who can think for themselves - and there aren't enough of them to influence the outcomes of elections. (Bush last November: Blair this month).\n\n \n Sadly. :( :xcensored", 
   {}, 
   120147, 
   null, 
   1115750280.0
  ], 
  [
   120160, 
   null, 
   "georged", 
   "I still can't believe some are so willing to lose so many for so little. Nor can I get over the acceptance of the ever changing rationales being thrown out by the adminstration. Sooner or later, people have to honestly evaluate the war and this presidents performance.\n\n \n I don't believe that will happen until fiscal matters, probably in the form of inflation, begin to grind down the general US standard of living. This administration is maintaining the current level of prosperity through national debt and fear, with the facade of protecting the nation as a rationale for aggressive foreign policy to use that debt to generate GDP and other well-cooked numbers. As long as their bellies are full, they're mindlessly entertained and have a few toys, apathy is the normal mode of the general public.", 
   {}, 
   120143, 
   null, 
   1115751480.0
  ], 
  [
   120173, 
   null, 
   "fracas", 
   "Really ? You say (in post #37) you don't want to get into another discussion about the Iraq war - so why bother joining this thread ?\n\n i gave my opinion for balance\n \n \nWhen I asked for your justifications, I made clear that I had no ideological axe to grind. But you merely repeat what's been said many, many times before - without a single original idea that could damage my skepticism or take the discussion in a new direction.\n \n I could examine your \"justifications\", which I almost know off by heart, but which I mistakenly thought might be news to me. There is no point in doing so: I should not want to lure you into another discourse on the \"merits\" (a curious choice of word) of the Iraq war.\n\n thing is alan i answered the questions you posed, then you asked for more stating i should have justified my response\n \n as to originality that was exactly my point. we have all been through this before. why go through the same exercise again? while stating you are neutral on the topic without an axe to grind, i feel i have no axe to grind either. so if you ask me why i posted in this thread, i'll ask you the same, why you asked for my justifications if you already know it?\n i think you have been dishonest actually, that you are looking for an argument to argue, hoping i'd provide you an opportunity. this is not \"no ideological axe to grind\". this is debate subterfuge poorly constructed and seems quite disengenuous.\n and now you are upset that i've have not provided fo you a subject to grind on.\n had you been interested in a discussion of the \"merits\" of the iraq war, or the case for it, whatever else you wanted to know but didn't know the right question to pose, you could have stated so. when you ask directed question, you will get directed response. had you asked open ended questions, you would have gotten more.\n and yet i did give you the opportunity to do so by asking what was it you really wanted to know. (an open ended format)\n your lack of sincerity was why i did not want to engage in a debate yet i still allowed you the opportunity for discourse.\n even the brevity of my answers were for you to think about how that might be, rather than be told how it is\n \n i guess in this day an age spoon feeding is preferred.\n \n and its not because we disagree. there are plenty i've disagreed with regarding the merits of iraq and we have been able to debate. but i guess it doesn't really matter, if you haven't understood the reasons for iraq after 2 years you either refuse to, or incapable of it.", 
   {}, 
   120005, 
   null, 
   1115754120.0
  ], 
  [
   120187, 
   null, 
   "Alan Ryan", 
   "@fracas:\n \n I don't think I've been \"dishonest\": It was possible that you might come up with an argument justifying the Iraq adventure that I had not heard before - which was why I pressed you for \"justifications\". This argument, had you been able to make it, might have caused me to modify my opinion: this is why I emphasised that I was not ideologically committed on an opposing side to the point where whatever you said, I would disagree with it.\n \n It's not that I think what you have said in this thread (and others on the same topic) is specious or an untenable point of view - it's just that I've noticed it's not a new \"take\" on the Iraq issue. Now that the main points have been recited so frequently, isn't it reasonable to hope someone might have something fresh to say on the matter ? Had this been the case, another discussion would have taken place and my skepticism about the \"received wisdom\" might have been countered. \n \n Your conclusions that I'm incapable of understanding your reasons for supporting American involvement in Iraq or that I need \"spoon feeding\" are absurd.", 
   {}, 
   120173, 
   null, 
   1115757720.0
  ], 
  [
   120221, 
   null, 
   "fracas", 
   "think about it alan\n all the reasons for or against the war have already been given. \n and after 2 years they remain the same suggest that\n 1. there were no subterfuge\n 2. sides are set\n \n thus at this point it really no matter \"what\" reasons were given.\n the more important or at least more interesting question would have been \"why\" you accepted reasons X and rejected reasons Y. why you are pro or anti iraq war.", 
   {}, 
   120187, 
   null, 
   1115761920.0
  ], 
  [
   120225, 
   null, 
   "SteveRogers", 
   "think about it alan\n all the reasons for or against the war have already been given. \n and after 2 years they remain the same suggest that\n 1. there were no subterfuge\n 2. sides are set\n \n thus at this point it really no matter \"what\" reasons were given.\n the more important or at least more interesting question would have been \"why\" you accepted reasons X and rejected reasons Y. why you are pro or anti iraq war.\n\n \n The sides may be set. And the question you ask is one I'd like to know. But there was a lot of subterfuge in Bush's reasoning. Still is.", 
   {}, 
   120221, 
   null, 
   1115762460.0
  ], 
  [
   120232, 
   null, 
   "Voice Of Reason", 
   "It is sad that 1 american has lost his life in Iraq but some things are worth fighting and dying for and a democracy in Iraq is one of them.........", 
   {}, 
   120225, 
   null, 
   1115763360.0
  ], 
  [
   120243, 
   null, 
   "SteveRogers", 
   "It is sad that 1 american has lost his life in Iraq but some things are worth fighting and dying for and a democracy in Iraq is one of them.........\n\n \n Nonsense. Not why we went and not what we have done.", 
   {}, 
   120232, 
   null, 
   1115763960.0
  ], 
  [
   120332, 
   null, 
   "Voice Of Reason", 
   "Nonsense. Not why we went and not what we have done.\n\n \n Actually when you compare the casualties in Iraq to other wars they pale........For example in Viet Nam we were averaging losing over 100 men a day and in some weeks we lost more men in a week then we have lost in the whole Iraq war......................", 
   {}, 
   120243, 
   null, 
   1115771880.0
  ], 
  [
   120337, 
   null, 
   "Truthsayer", 
   "It is sad that 1 american has lost his life in Iraq but some things are worth fighting and dying for and a democracy in Iraq is one of them.........\n\n \n That sounds all nice and good but America couldn't have given two hoots about democracy in Iraq three years ago. That's so...so...Fox news-ish....ya know what I mean?\n \n It's just my opinion but I think it just gives the people who like a good war the warm fuzzies to say that. It sounds so rightous and all. I mean no offense to you Mr. Reason. I respect your right to your opinion. Nothing personal sir. :) (I find that I actually agree with you on a lot of topics, have you noticed? But I call's 'em as I see's 'em.)\n \n OK...say you're right. :p \n \n So...who's next? Since it is now our obligation to liberate the world and spread good ol' American democracy, where is the next war gonna be held?\n \n American Democracy....coming to a war theatre near you.", 
   {}, 
   120232, 
   null, 
   1115772600.0
  ], 
  [
   120426, 
   null, 
   "SteveRogers", 
   "Actually when you compare the casualties in Iraq to other wars they pale........For example in Viet Nam we were averaging losing over 100 men a day and in some weeks we lost more men in a week then we have lost in the whole Iraq war......................\n\n \n Another meaningless point. 1st we are early here. Check out the first years in VN. 2nd, one unnessary death is one too many. Say I come over to your house and say you are only going to lose two loved ones. There won't be any real reason for it, but hey, Manson took out more. Don't worry about it.\n \n The argument you make is lame at best.", 
   {}, 
   120332, 
   null, 
   1115787300.0
  ], 
  [
   120433, 
   null, 
   "Duo_Maxwell", 
   "Actually when you compare the casualties in Iraq to other wars they pale. For example in Viet Nam we were averaging losing over 100 men a day and in some weeks we lost more men in a week then we have lost in the whole Iraq war.\n\n \n For obvious reasons. For someone who says they were in that war, you sure don't seem to understand much about it and how it applies today, but then again, you were never in the war. :) \n \n Of course we are having fewer casulities. The troops in Iraq are comparatively better trained, better armed, and have much, much, much better access to medical care then the conscripts of Vietnam. Not to mention that the terrain is much different. We aren't fighting for a tiny plot of land, giving it up, only to fight for it the next week. That was incredbility stupid and waste of lives. \n \n You're also ignoring that US troops have withdrawn to forteified poisitions while the Iraqi police and army are getting butchered in the streets.", 
   {}, 
   120332, 
   null, 
   1115789100.0
  ], 
  [
   120442, 
   null, 
   "Missouri Mule", 
   "For obvious reasons. For someone who says they were in that war, you sure don't seem to understand much about it and how it applies today, but then again, you were never in the war. :) \n \n Of course we are having fewer casulities. The troops in Iraq are comparatively better trained, better armed, and have much, much, much better access to medical care then the conscripts of Vietnam. Not to mention that the terrain is much different. We aren't fighting for a tiny plot of land, giving it up, only to fight for it the next week. That was incredbility stupid and waste of lives. \n \n You're also ignoring that US troops have withdrawn to forteified poisitions while the Iraqi police and army are getting butchered in the streets.\n\n -------------------------------------------------------------\n Like these \"fortified positions.\" Have you no shame? Do you even have a scintilla of patriotism for our brave soldiers while you sit home fat in happy in front of your computer screen?\n =================================\n May 10, 11:00 PM (ET)\n \n By ANTONIO CASTANEDA\n \n BAGHDAD, Iraq (AP) - Capitalizing on a lull in fighting Tuesday, hundreds of U.S. Marines pushed through a lawless region on the Syrian frontier after intense battles along the Euphrates River with well-armed militants fighting from basements, rooftops and sandbag bunkers.\n \n Insurgents kidnapped the provincial governor as a bargaining chip.\n \n Iraq's foreign minister, meanwhile, told the Associated Press that some of Iraq's neighbors have become unnerved by the American-backed attempt to establish a robust democratic government in Baghdad and still are not doing enough to stop militants from trying to undermine the newly elected government.\n \n As many as 100 insurgents were killed in the first 48 hours of Operation Matador, as American troops cleared villages along the meandering Euphrates then crossed in rafts and on a pontoon bridge, the U.S. command said. Many of the dead remained trapped under rubble after attack planes and helicopter gunships pounded their hideouts.\n \n At least three Marines were reported killed and 20 wounded during the first three days of the offensive - the biggest U.S. operation since Fallujah was taken from extremists six months ago.\n \n The operation was launched after U.S. intelligence showed followers of Iraq's most wanted terrorist, Abu Musab al-Zarqawi, took refuge in the remote desert region - a haven for smugglers and insurgent suppliers. The fighters were believed to have fled to Anbar Province after losses in Iraqi cities.\n \n After intense fighting with militants entrenched on the south bank of the Euphrates River early in the operation, Marines saw only light resistance Tuesday and advanced through sparsely populated settlements along a 12-mile stretch to the border with Syria, according to a Chicago Tribune reporter embedded with the assault, James Janega.\n \n Residents reached by telephone in the area reported some fighting Tuesday in Obeidi and the two nearby towns of Rommana and Karabilah. They said frightened residents were taking advantage of the relative lull to flee the Qaim area.\n \n Adel Izzedine left on foot with his wife and three children, walking six miles through farm fields to reach a village where the family caught a taxi and drove 43 miles to Rawa, east of the fighting.\n \n \"There are gunmen in the city, but there are also a lot of innocent civilians,\" said Izzedine, who was looking for a mosque or a school in which to spend the night. \"We are living the same misery that Fallujah lived some time ago.\"\n \n Gunmen kidnapped Anbar's governor Tuesday morning and told his family he would be released only when U.S. forces withdrew from Qaim, the town 200 miles west of Baghdad where the offensive began late Saturday. Gov. Raja Nawaf Farhan al-Mahalawi was seized as he drove from Qaim to the provincial capital of Ramadi, his brother, Hammad, told The Associated Press.\n \n Lt. Col. Steven Boylan, a spokesman for U.S. forces in Iraq, said: \"We don't respond to insurgent or terrorist demands.\"\n \n Hoshyar Zebari, the Iraqi foreign minister, said Syria, Saudi Arabia, Kuwait, Jordan and Turkey all could do more to keep foreign fighters from entering Iraq or to prevent the insurgents from obtaining funding.\n \n \"Generally, they (Iraq's neighbors) don't like what we are doing to build democracy in that part of the world,\" Zebari said on the sidelines of the first Summit of Southern American-Arab countries in Brasilia, Brazil. \"There is some tolerance for these terror networks on the part of the neighboring countries.\"\n \n At the Pentagon, Marine Lt. Gen. James T. Conway, director of operations for the Joint Chiefs of Staff, told reporters Tuesday that the assault in the northern Jazirah Desert had run into well-equipped and trained fighters.\n \n \"There are reports that these people are in uniforms, in some cases are wearing protective vests, and there's some suspicion that their training exceeds what we have seen with other engagements further east,\" he said...\n \n (Snip)\n \n http://apnews.myway.com//article/20050511/D8A0NAR80.html", 
   {}, 
   120433, 
   null, 
   1115790720.0
  ], 
  [
   120445, 
   null, 
   "Hunter", 
   "God bless America and God bless our troops fighting for freedom in far off places.", 
   {}, 
   120442, 
   null, 
   1115791440.0
  ], 
  [
   120446, 
   null, 
   "Duo_Maxwell", 
   "*sigh*\n \n More stupidity. US forces come out only for special operations. Meanwhile they sit back in forts letting the Iraqis do the patrol work. While a relative few Us troops are out three, the majority aren't. Look at the loss rate for that operation, a mere 3 troops. We were losing that many a day when Us troops actively ran patrols. My point still stands. \n \n However, I will jab you back. You seem inclined to attack this claim but you are very skitterish as to posts detailing your fraudulent behavior Why is that mule?", 
   {}, 
   120442, 
   null, 
   1115791440.0
  ], 
  [
   120453, 
   null, 
   "Missouri Mule", 
   "*sigh*\n \n More stupidity. US forces come out only for special operations. Meanwhile they sit back in forts letting the Iraqis do the patrol work. While a relative few Us troops are out three, the majority aren't. Look at the loss rate for that operation, a mere 3 troops. We were losing that many a day when Us troops actively ran patrols. My point still stands. \n \n However, I will jab you back. You seem inclined to attack this claim but you are very skitterish as to posts detailing your fraudulent behavior Why is that mule?\n\n \n \"Fraudulent?\" Do you even know the definition? You denigrate the sacrifice of our troops and you have the audicity to label me as \"fraudulent.\" Talk about the pot calling the kettle black; you take the cake. You really ought to hang your head in shame as an American. I'd like to see you explain the \"mere loss of three troops\" to their parents, wives and children. But you'll never do that. You'll sit in front of your computer screen and blabber on with nonsense. That's a hell of a lot easier than actually defending this country than like these \"mere three soldiers\" that paid the supreme price so you have the freedom to say the things you do.", 
   {}, 
   120446, 
   null, 
   1115792640.0
  ], 
  [
   120468, 
   null, 
   "SteveRogers", 
   "\"Fraudulent?\" Do you even know the definition? You denigrate the sacrifice of our troops and you have the audicity to label me as \"fraudulent.\" Talk about the pot calling the kettle black; you take the cake. You really ought to hang your head in shame as an American. I'd like to see you explain the \"mere loss of three troops\" to their parents, wives and children. But you'll never do that. You'll sit in front of your computer screen and blabber on with nonsense. That's a hell of a lot easier than actually defending this country than like these \"mere three soldiers\" that paid the supreme price so you have the freedom to say the things you do.\n\n \n Yet, you have no problem tossing their lives on fraudulent rationales. No matter how unbelieveable the claim, you say let them die and don't buck YOUR president because you'll support him no matter what. Lies, mistakes, foolishness? None of it matters, so long as we kill someone.\n \n Sorry, but by simply supporting a president so incompetent and dishonest you are more dishonorable and you need to explain to the parents and loved ones why you are so free with their lives. :xcensored emoticon_mad", 
   {}, 
   120453, 
   null, 
   1115795220.0
  ], 
  [
   120555, 
   null, 
   "georged", 
   "\"Fraudulent?\" Do you even know the definition? You denigrate the sacrifice of our troops and you have the audicity to label me as \"fraudulent.\" Talk about the pot calling the kettle black; you take the cake. You really ought to hang your head in shame as an American. I'd like to see you explain the \"mere loss of three troops\" to their parents, wives and children. But you'll never do that. You'll sit in front of your computer screen and blabber on with nonsense. That's a hell of a lot easier than actually defending this country than like these \"mere three soldiers\" that paid the supreme price so you have the freedom to say the things you do.\n\n \n Defending this country? If you actually believe US troops in Iraq are defending the USA, your logic is so twisted for whatever reasons that I find it difficult to comprehend patriotism could actually be that distorted and blind. \n \n While everyone in this country is allowed their own opinion on any subject, for you to personally slur others for displaying the intelligence of understanding that we as a nation have committed the gravest of errors in invading and occupying another sovereign nation without provocation displays shallow ignorance and a lack of compassion for any lives lost in Iraq including those of US troops. For any individual to voice support for such a fraudulent action and then rationalize the useless death of US troops as defending their country puts that person in the position of being either really stupid or grossly misinformed about the actual definition of defense.", 
   {}, 
   120453, 
   null, 
   1115825400.0
  ], 
  [
   120614, 
   null, 
   "Missouri Mule", 
   "Defending this country? If you actually believe US troops in Iraq are defending the USA, your logic is so twisted for whatever reasons that I find it difficult to comprehend patriotism could actually be that distorted and blind. \n \n While everyone in this country is allowed their own opinion on any subject, for you to personally slur others for displaying the intelligence of understanding that we as a nation have committed the gravest of errors in invading and occupying another sovereign nation without provocation displays shallow ignorance and a lack of compassion for any lives lost in Iraq including those of US troops. For any individual to voice support for such a fraudulent action and then rationalize the useless death of US troops as defending their country puts that person in the position of being either really stupid or grossly misinformed about the actual definition of defense.\n\n \n You can believe what you want to believe but you will one day have to eat crow when the truth of everything regarding the Iraq war comes out. You can chew on this for a while.\n \n Connect the Dots . . .\n Saddam Hussein and Osama bin Laden...\n \n (Snip)\n \n http://www.archive-news.net/Articles/SH040923.html", 
   {}, 
   120555, 
   null, 
   1115830200.0
  ], 
  [
   120640, 
   null, 
   "Redratio1", 
   "You're one of those 70% Fox news watchers that think Saddam and OBL were in league?\n \n D'Oh!\n \n It's a fantasy MM, give it up.", 
   {}, 
   120614, 
   null, 
   1115832240.0
  ], 
  [
   120646, 
   null, 
   "georged", 
   "You can believe what you want to believe but you will one day have to eat crow when the truth of everything regarding the Iraq war comes out. You can chew on this for a while.\n \n Connect the Dots . . .\n Saddam Hussein and Osama bin Laden...\n \n (Snip)\n \n http://www.archive-news.net/Articles/SH040923.html\n\n \n Even the administration long ago dropped that facade. You're sounding like some civil service lifer who didn't get the latest official memo.", 
   {}, 
   120614, 
   null, 
   1115832420.0
  ], 
  [
   120846, 
   null, 
   "Truthsayer", 
   "Don't get flustered Mr. Rogers. It's a lovely day in the neighborhood. It is a common right-wing tactic to accuse anyone that takes issue with the Iraqi situation of being \"anti-troops\" as they plaster the flag decal on their forehead, totally diverting the focal topic of conversation. As they say, \"The best defense is a good offence\" and I suspect you will get this 99% of the time when they have no other recourse in logical debate. Outshout and insult. Oh, how many times have we seen it before? emoticon_rolleyes \n \n Of course, realizing this, after observing it over and over, I have become somewhat immune to their diversion tactics and these days I intrepret them as a sign of defeat on their behalf. An \"uncle\" if you will. \"I can't argue that point so I will just insult you or shout you down and change the subject.\"\n \n In my opinion, if they truly cared for our troops, they would want them home safe and sound rather than in Iraq serving the Bush agenda. \n \n But some folks just can't resist a good, bloody war. You would not BELIEVE some of the absurd justifications I have heard for this war, from them. Heck, some of our best movies are war movies. History buffs love a good war too I have noticed. My observations suggest that either old farts or young XXXXXX seem to back this thing. The folks in between are mixed and hardly any of them don't have at least some reservations about it.\n \n More times than not, I have noticed, these war mongers are beyond the age of fighting the war themselves and have no personal close family interests on the battleground. But that does not hold true in all cases. I have met some \"gung-ho\" parents who support this attrocity that actually have children serving on the ground over there but they are far and few between. They come across more as if they were cheering for their football team, moreso, than rooting for the war itself. \"Go Marines!\" \"My son/daughter is in the Marine Corp.\" \"Two bits, four bits, six bits, a dollar, all for the 442nd, stand up and holler!\"\n \n The safety and welfare of our children means a lot more to me that shoving democracy down the throats of a culture that really has little to do with ours.", 
   {}, 
   120646, 
   null, 
   1115841600.0
  ], 
  [
   120880, 
   null, 
   "simone", 
   "It is sad that 1 american has lost his life in Iraq but some things are worth fighting and dying for and a democracy in Iraq is one of them.........\nOh, right.\n \n Fighting and dying over WMDs that weren't there.\n \n Fighting and dying over a link between Iraq and the September 11, 2001 attack on my nation that didn't exist.\n \n Fighting and dying over a connection between Iraq and Al-Qaeda that was a phantom in George Bush's twisted little mind.", 
   {}, 
   120232, 
   null, 
   1115844060.0
  ], 
  [
   120883, 
   null, 
   "simone", 
   "Come to think of it, there was more of a link between that traitor George Bush and Al-Qaeda than between Iraq and Al-Qaeda.", 
   {}, 
   120880, 
   null, 
   1115844120.0
  ], 
  [
   120894, 
   null, 
   "Truthsayer", 
   "Even the administration long ago dropped that facade. You're sounding like some civil service lifer who didn't get the latest official memo.\n\n \n :p :p :p", 
   {}, 
   120646, 
   null, 
   1115844840.0
  ], 
  [
   120908, 
   null, 
   "gnojek", 
   "Well, in the UK the reason Blair got reelected was because the opposition supported the war, and would have invaded even if they had known beforehand that there were no WMDs (ie completely illegally). The alternative, exercised by roughly 1/3 of the population, was to vote for a party which was against the war, the lib dems, greens, SNP, SSP, Plaid Cymru etc. And there were a large number of people who voted labour as the lesser of two evils.\n\n I'm afraid this is the same case in the US.\n The opposition party, no matter what they said, fully supported the war.\n Otherwise they would never have given Bush a blank check.\n They were trying to capitalize on the anti-war sentiment and it didn't play out.", 
   {}, 
   119279, 
   null, 
   1115846340.0
  ], 
  [
   120940, 
   null, 
   "Duo_Maxwell", 
   "\"Fraudulent?\" Do you even know the definition?\n\n \n Yes. Behavior that is intensionally dishonest as a means to prove a point or get what you want. You have clearly acted in such a way. \n \n \nYou denigrate the sacrifice of our troops and you have the audicity to label me as \"fraudulent.\"\n\n \n More fraud. Changing the subject. My highlighting was on your tactics. Specifically how you ignore things, make things up and generally resort to known fallacies. Interesting how you trying to deflect how you act in fradulent ways with more fraud. It's merely a sign you do not understand how you are acting, and how such behavior merely provides more evidence you have no intention of acting in a honest manner. You are a fradulent debater. \n \n \nTalk about the pot calling the kettle black; you take the cake.\n\n \n How? Please, show me where i have used fallacies. \n \n \nYou really ought to hang your head in shame as an American. I'd like to see you explain the \"mere loss of three troops\" to their parents, wives and children.\n\n \n Do you even understand what a fallacy is and how you are using them? My comments upon your behavior are indepent of the sacrifices of the troops. Your use of them is merely to distract the argument away from how you aren't acting in a proper manner. \n \n Apparently you suffer from the same brain wasting disease as many. \n \n Make up what you think they said and then comment upon it. The problem is you don't actually address the real points, you merely attack the fabrications of your own design.", 
   {}, 
   120453, 
   null, 
   1115850360.0
  ], 
  [
   121003, 
   null, 
   "Missouri Mule", 
   "You're one of those 70% Fox news watchers that think Saddam and OBL were in league?\n \n D'Oh!\n \n It's a fantasy MM, give it up.\n\n \n 1) I seldom watch Fox news and seldom listen to Rush Limbaugh.\n \n 2) I don't know if Saddam and OBL were in league. I believe the jury is still out. I take seriously what James Woolsey has to say about the investigators who do see a connection. I do believe that Bush was operating off of information not widely known by most people. I do believe that Bush was advised by a number of far seeing and strategic thinkers who came to the conclusion that the course he has embarked on what the correct course of action. I do not believe the war was about oil (although it is a consideration being a strategic mineral for our economy.) I do believe that our military has done a damn fine job. I do support the troops. I do not believe that the left wishes for the United States to prevail in Iraq. I think that a number would welcome us leaving with our tails between our legs because in their heart of hearts, they truly detest the United States. That's what I believe.", 
   {}, 
   120640, 
   null, 
   1115857440.0
  ], 
  [
   121005, 
   null, 
   "Missouri Mule", 
   "Yes. Behavior that is intensionally dishonest as a means to prove a point or get what you want. You have clearly acted in such a way. \n \n \n \n More fraud. Changing the subject. My highlighting was on your tactics. Specifically how you ignore things, make things up and generally resort to known fallacies. Interesting how you trying to deflect how you act in fradulent ways with more fraud. It's merely a sign you do not understand how you are acting, and how such behavior merely provides more evidence you have no intention of acting in a honest manner. You are a fradulent debater. \n \n \n \n How? Please, show me where i have used fallacies. \n \n \n \n Do you even understand what a fallacy is and how you are using them? My comments upon your behavior are indepent of the sacrifices of the troops. Your use of them is merely to distract the argument away from how you aren't acting in a proper manner. \n \n Apparently you suffer from the same brain wasting disease as many. \n \n Make up what you think they said and then comment upon it. The problem is you don't actually address the real points, you merely attack the fabrications of your own design.\n\n \n Duo, frankly I don't even know what you are talking about any more and frankly, my dear, I don't give a damn. I've got better things to do than wade through your gibberish and respond to your posts. You're a one note Charley who always says the same thing over and over. You have no analytical ability nor insight into the big picture. It's just the same old bulloney and I'm not playing your game.", 
   {}, 
   120940, 
   null, 
   1115857500.0
  ], 
  [
   121015, 
   null, 
   "Duo_Maxwell", 
   "That's not my problem. I'll be pointing out your fraudlent behavior as long as you use it. I also find it amusing that you can't back your claims up. The most amusing part is that you deny you use fraud with fraud. \n \n lol.", 
   {}, 
   121005, 
   null, 
   1115858160.0
  ], 
  [
   121020, 
   null, 
   "georged", 
   "That's not my problem. I'll be pointing out your fraudlent behavior as long as you use it. I also find it amusing that you can't back your claims up. The most amusing part is that you deny you use fraud with fraud. \n \n lol.\n\n \n You'll become very busy with financial posts.", 
   {}, 
   121015, 
   null, 
   1115858640.0
  ], 
  [
   121231, 
   null, 
   "Duo_Maxwell", 
   "You'll become very busy with financial posts.\n\n \n I'm not sure I want to deal with those. They are so wrong that merely pointing out the fraud distracts from serious incompetence in finance presented by Mule.", 
   {}, 
   121020, 
   null, 
   1115881500.0
  ], 
  [
   121413, 
   null, 
   "SteveRogers", 
   "1) I seldom watch Fox news and seldom listen to Rush Limbaugh.\n \n 2) I don't know if Saddam and OBL were in league. I believe the jury is still out. I take seriously what James Woolsey has to say about the investigators who do see a connection. I do believe that Bush was operating off of information not widely known by most people. I do believe that Bush was advised by a number of far seeing and strategic thinkers who came to the conclusion that the course he has embarked on what the correct course of action. I do not believe the war was about oil (although it is a consideration being a strategic mineral for our economy.) I do believe that our military has done a damn fine job. I do support the troops. I do not believe that the left wishes for the United States to prevail in Iraq. I think that a number would welcome us leaving with our tails between our legs because in their heart of hearts, they truly detest the United States. That's what I believe.\n\n \n \n The Jury is not still out about Saddam and AL Qaeda. They were not in league. That is the evidence.\n \n And assessing progress and being honest cannot be dismissed by silliness like the left wants us to fail. Failure was assured the second we became the aggressors. No matter what happens in Iraq, no matter how free or blissful they become, we already lost. Look at the cost and what can be gained now. By any analysis, this comes up a negative.", 
   {}, 
   121003, 
   null, 
   1115916720.0
  ], 
  [
   121588, 
   null, 
   "plotter", 
   "1601 U.S. Military Personnel Have Died in Iraq as of Today\n \n An uncountable number of innocent Iraqis have died.\n \n There are no WMDs.\n \n There was no connection between Iraq and the September 11, 2001 attack on my nation.\n \n There was no connection between Iraq and Al-Qaeda.\n \n And in America?\n \n Just lie after lie after lie.\n \n \n 2006: Prelude to an Impeachment.\n\n Yes, a lot of deaths indeed.\n And yes, a lot of lies too.\n \n But try to look on the bright side, a lot of american companies, (mostly owned by Bush and rumsfeld and their friends), are making a hell of a lot of money, oil is forthcoming, iran and syria are very quiet, israel is happy, so a few soldiers died and a few lies were told, hey it doesnt matter, at least some people are happy.", 
   {}, 
   119142, 
   null, 
   1115925600.0
  ], 
  [
   121699, 
   null, 
   "SteveRogers", 
   "Yes, a lot of deaths indeed.\n And yes, a lot of lies too.\n \n But try to look on the bright side, a lot of american companies, (mostly owned by Bush and rumsfeld and their friends), are making a hell of a lot of money, oil is forthcoming, iran and syria are very quiet, israel is happy, so a few soldiers died and a few lies were told, hey it doesnt matter, at least some people are happy.\n\n \n yes, the good news. :(", 
   {}, 
   121588, 
   null, 
   1115934540.0
  ], 
  [
   122168, 
   null, 
   "jyoshu", 
   "Good grief, another thread bemoaning the conflict in Iraq. \n \n For me, the fact that these insurgents kidnapp and behead any westerner they can get their hands on is all the reason I need to support military action against them. They should have been overthrown along time ago, and U.N. should have made good on it's threats, or none of this would be happening the way it is. \n \n We need to keep this in perspective. People are all the time making parallels to Vietnam, yet we've lost just over 1600 troops in Iraq. In Vietnam we were losing 1000 soldiers a week in 1968, and we lost around 58,000 troops altogether.\n \n These two conflicts aren't even comparable.", 
   {}, 
   121699, 
   null, 
   1116009540.0
  ], 
  [
   122416, 
   null, 
   "THEL", 
   "Good grief, another thread bemoaning the conflict in Iraq. \n \n For me, the fact that these insurgents kidnapp and behead any westerner they can get their hands on is all the reason I need to support military action against them. They should have been overthrown along time ago, and U.N. should have made good on it's threats, or none of this would be happening the way it is. \n \n We need to keep this in perspective. People are all the time making parallels to Vietnam, yet we've lost just over 1600 troops in Iraq. In Vietnam we were losing 1000 soldiers a week in 1968, and we lost around 58,000 troops altogether.\n \n These two conflicts aren't even comparable.\n\n \n Good point. \n I also find it ridiculous to compare Iraq with Vietnam.\n And quite frankly I don't understand how people judge the success of a war by the number of losses. If you use that scale than the Korean war was also a catastrophic failure. Yet half that peninsula is still free. And let's not even mention WW2. A terrible failure as the allies lost thousands of times what the coalition in Iraq has lost so far. \n But the continents of Europe and Asia are free.\n \n The war shouldn't be judged on how many soldiers are killed, it should be judged by what is accomplished. The removal of the Saddam regime, the democratic election of a new government are just a couple of achievements. And the only way to judge whether the war was a success should be when Iraq is finally truly free, democratic, and peaceful.", 
   {}, 
   122168, 
   null, 
   1116029580.0
  ], 
  [
   122475, 
   null, 
   "SteveRogers", 
   "Yet, you both miss the point. NO one there was beheading westerners before we came. There was no threat from Iraq. Al Qaeda was limited and like any insect, capable of stinging, but little more. \n \n Today, terrorist acts have tripled. Recruitment for the bad guys is good. IN Afganistan people are dying during protests against us. Around the world more and more things are being blown up.\n \n At some point even the die-hard faithful have to realize we took the wrong track. Certainly party loyality can't be that strong. :xbanghead :(", 
   {}, 
   122416, 
   null, 
   1116047580.0
  ], 
  [
   122525, 
   null, 
   "Voice Of Reason", 
   "There is no comparison between Nam and Iraq.....To compare the two is ridiculous...\n \n Did you see the brave Iraqis going to the polls to vote? Even under threat of losing their lives they had a bigger turnout there percentage wise then we do here............Seeing those people raise their finger in the air with the ink on it to prove they voted was so heart warming.........Who ever thought there would be a democracy in the middle east..........It was unheard of........\n \n Make no mistake about it my friends...........this is about hatred for President Bush and his administration......There are those on the left, some in this very forum that hope and pray we fail in Iraq, pull up stakes and cut and run so it will make the President look bad.....I hate to say there are Americans like that but its true........Just read some of the hate filled posts from the left if you don't believe me............I was no fan of Clinton but I would never hope that our troops failed in battle to make him look bad........\n \n Thank God we have a President that stands by his decisions.......I am so proud to be a supporter of him and our braves troops fighting for Iraqi freedom.......\n \n God Bless them all and keep them safe...........", 
   {}, 
   122475, 
   null, 
   1116056640.0
  ], 
  [
   122526, 
   null, 
   "Voice Of Reason", 
   "Yet, you both miss the point. NO one there was beheading westerners before we came. There was no threat from Iraq. Al Qaeda was limited and like any insect, capable of stinging, but little more. \n \n Today, terrorist acts have tripled. Recruitment for the bad guys is good. IN Afganistan people are dying during protests against us. Around the world more and more things are being blown up.\n \n At some point even the die-hard faithful have to realize we took the wrong track. Certainly party loyality can't be that strong. :xbanghead :(\n\n \n Yeah we could pull out and make it a police action like your boys Clinton and Kerry wanted to do and sit back and wait for another 9/11/01.........\n \n No thanks Steve.........", 
   {}, 
   122475, 
   null, 
   1116056820.0
  ], 
  [
   122554, 
   null, 
   "THEL", 
   "Yet, you both miss the point. NO one there was beheading westerners before we came. There was no threat from Iraq. Al Qaeda was limited and like any insect, capable of stinging, but little more. \n \n Today, terrorist acts have tripled. Recruitment for the bad guys is good. IN Afganistan people are dying during protests against us. Around the world more and more things are being blown up.\n \n At some point even the die-hard faithful have to realize we took the wrong track. Certainly party loyality can't be that strong. :xbanghead :(\n\n \n \n Yeah right!\n Saddam was contained, right??? Man the oil for food program was full of holes and it was being exploited by Saddam, the international sanctions were falling apart, and after 9/11 no sane president could allow his nation to look the other way while the only dictator who actually used chemical weapons in the last 30 years remains in power. Does anyone remember why there were sanctions on Iraq? Could it be that besides having a tendency to gas Kurds that Saddam also had a tendency to support terror (see money sent to finance suicide bombers etc.) and of invading his neighbors...\n \n Forget it! Any serious war on terror had to go through Baghdad.\n Saddam couldn't be left in power. While North Korea and Iran both are dangerous regimes, neither of them had the history of Saddam Husein. And since the U.S and its allies have already toppled Saddam, why don't you guys stop whining about it and move on. \n \n The stakes are even higher now. Iraq will either turn into a democracy or into a terrorist state. Of course terror attacks are on the rise, terrorists from all over that region are converging on Iraq to fight the U.S and its allies. They understand that it's the central front in the war on terror, and that a free, peaceful, and democratic Iraq will be a huge blow to their cause.", 
   {}, 
   122475, 
   null, 
   1116067440.0
  ], 
  [
   122555, 
   null, 
   "gamehuis", 
   "Yeah right!\n Saddam was contained, right??? Man the oil for food program was full of holes and it was being exploited by Saddam, the international sanctions were falling apart, and after 9/11 no sane president could allow his nation to look the other way while the only dictator who actually used chemical weapons in the last 30 years remains in power. Does anyone remember why there were sanctions on Iraq? Could it be that besides having a tendency to gas Kurds that Saddam also had a tendency to support terror (see money sent to finance suicide bombers etc.) and of invading his neighbors...\n\n Funny how the US and the rest of the West didn't say a damn thing when Saddam gassed the Kurds (and the Iranians). emoticon_rolleyes", 
   {}, 
   122554, 
   null, 
   1116067680.0
  ], 
  [
   122565, 
   null, 
   "THEL", 
   "Funny how the US and the rest of the West didn't say a damn thing when Saddam gassed the Kurds (and the Iranians). emoticon_rolleyes\n\n \n Are you going to blame Bush for what other presidents and what other countries did or didn't do??? Are you going to also blame Bush for Clinton's and the U.N's impotence in the face of a genocide in Rwanda?\n \n I agree, Saddam should've been toppled already in 1991. I guess it took 9/11 for people to see that they can't ignore growing threats.", 
   {}, 
   122555, 
   null, 
   1116070920.0
  ], 
  [
   122604, 
   null, 
   "georged", 
   "Funny how the US and the rest of the West didn't say a damn thing when Saddam gassed the Kurds (and the Iranians). emoticon_rolleyes\n\n \n You're wasting your time discussing US foreign policy with VOR. He's retired military, enlisted support ranks, been under orders on the public teat all of his adult life and has no conception of anything else.", 
   {}, 
   122555, 
   null, 
   1116084240.0
  ], 
  [
   122611, 
   null, 
   "Missouri Mule", 
   "Funny how the US and the rest of the West didn't say a damn thing when Saddam gassed the Kurds (and the Iranians). emoticon_rolleyes\n\n \n I don't know what's in your newspapers but I read about it here in America. At the same time I viewed the Iranians as being worse.", 
   {}, 
   122555, 
   null, 
   1116087000.0
  ], 
  [
   122612, 
   null, 
   "Missouri Mule", 
   "Yes, a lot of deaths indeed.\n And yes, a lot of lies too.\n \n But try to look on the bright side, a lot of american companies, (mostly owned by Bush and rumsfeld and their friends), are making a hell of a lot of money, oil is forthcoming, iran and syria are very quiet, israel is happy, so a few soldiers died and a few lies were told, hey it doesnt matter, at least some people are happy.\n\n \n That is so stupid and simple minded. This is why I have come to believe that the left is really brain damaged. They just can't help themselves.", 
   {}, 
   121588, 
   null, 
   1116087180.0
  ], 
  [
   122613, 
   null, 
   "Missouri Mule", 
   "You're wasting your time discussing US foreign policy with VOR. He's retired military, enlisted support ranks, been under orders on the public teat all of his adult life and has no conception of anything else.\n\n \n Any damn fool can resort to name calling. Now what do you actually know and what is your argument?", 
   {}, 
   122604, 
   null, 
   1116087240.0
  ], 
  [
   122615, 
   null, 
   "Symbiote", 
   "the left is really brain damaged.\n\n \nAny damn fool can resort to name calling.\n\n \n Certainly looks like it.", 
   {}, 
   122613, 
   null, 
   1116087480.0
  ], 
  [
   122802, 
   null, 
   "Duo_Maxwell", 
   "Symbiote, do you think MM notices the fact that he's a flaming hypocrite?", 
   {}, 
   122615, 
   null, 
   1116110340.0
  ], 
  [
   122826, 
   null, 
   "jyoshu", 
   "Yet, you both miss the point. NO one there was beheading westerners before we came.\n\n \n Ha! You apparently don't know much about the Islamic fundamentalist culture.\n \n \nThere was no threat from Iraq. Al Qaeda was limited and like any insect, capable of stinging, but little more. Today, terrorist acts have tripled. Recruitment for the bad guys is good. IN Afganistan people are dying during protests against us. Around the world more and more things are being blown up.\n\n \n No, you just hear about it more because the press reports on every single event like that now and you are letting the press determine your outlook on the Iraq war like a good little news watcher, being spoonfed and having the talking pundits doing your thinking for you; what they don't report are the successes--the roads that get opened, water restored to areas, numbers of poople joining as police (rather than just the incidents of police recruits hit by a bomb), the progress of police training, etc. We've only been getting mostly a view of reporting through an anti-war bias on the Iraqi conflict from day one--if they were really out to give the whole story, they would report the good things and successes as well. The haven't. \n \n Some of us just have enough sense to know that there is another side to it.", 
   {}, 
   122475, 
   null, 
   1116114660.0
  ], 
  [
   122848, 
   null, 
   "Missouri Mule", 
   "Symbiote, do you think MM notices the fact that he's a flaming hypocrite?\n\n \n No, I really do think that much of the left (not you, of course) has a brain disorder. That's not name calling; that's just my opinion and I believe there is much truth that that. You're mainly just a minor irratant. (not that there is anything wrong with that.)", 
   {}, 
   122802, 
   null, 
   1116117600.0
  ], 
  [
   122893, 
   null, 
   "SteveRogers", 
   "Ha! You apparently don't know much about the Islamic fundamentalist culture.\n \n \n \n No, you just hear about it more because the press reports on every single event like that now and you are letting the press determine your outlook on the Iraq war like a good little news watcher, being spoonfed and having the talking pundits doing your thinking for you; what they don't report are the successes--the roads that get opened, water restored to areas, numbers of poople joining as police (rather than just the incidents of police recruits hit by a bomb), the progress of police training, etc. We've only been getting mostly a view of reporting through an anti-war bias on the Iraqi conflict from day one--if they were really out to give the whole story, they would report the good things and successes as well. The haven't. \n \n Some of us just have enough sense to know that there is another side to it.\n\n \n \n You haven't demonstrated to me that you know anything. But no, there isn't a hiding of the good news. There is simply more bad news. Even the adminstration knows they are in trouble. Only the mindless still think this was a good thing. :xcensored", 
   {}, 
   122826, 
   null, 
   1116127620.0
  ], 
  [
   122898, 
   null, 
   "Duo_Maxwell", 
   "No, I really do think that much of the left (not you, of course) has a brain disorder. That's not name calling; that's just my opinion and I believe there is much truth that that. You're mainly just a minor irratant. (not that there is anything wrong with that.)\n\n \n That's amusing. Have you considered that perhaps you are wrong? Your comment while a opinion is a attack. \n \n To derile such attacks while using them is hypocritical.", 
   {}, 
   122848, 
   null, 
   1116132300.0
  ], 
  [
   122901, 
   null, 
   "jyoshu", 
   "You haven't demonstrated to me that you know anything. \n\n \n I don't have to demonstrate anything to you, nor do I care what you think about me.\n \n \nBut no, there isn't a hiding of the good news. There is simply more bad news. Even the adminstration knows they are in trouble.\n\n \n It's sad how many Americans out there let the media or special interest groups do their thinking for them. Most people who are adamant about opposing the war in Iraq were just knee-jerk anti-war buffs from the beginning, with their minds made up the minute they heard the \"w\" word (\"war\"). The fact that anyone would actually think the portrayal of this war with all the bad news played up and no reporting of the sucesses or good things is accurate only goes to show that a lot of people in this country can't think for themselves.", 
   {}, 
   122893, 
   null, 
   1116133200.0
  ], 
  [
   122909, 
   null, 
   "SteveRogers", 
   "I don't have to demonstrate anything to you, nor do I care what you think about me.\n \n \n \n It's sad how many Americans out there let the media or special interest groups do their thinking for them. Most people who are adamant about opposing the war in Iraq were just knee-jerk anti-war buffs from the beginning, with their minds made up the minute they heard the \"w\" word (\"war\"). The fact that anyone would actually think the portrayal of this war with all the bad news played up and no reporting of the sucesses or good things is accurate only goes to show that a lot of people in this country can't think for themselves.\n\n \n Quite the opposite. I do my own thinking. Unlike the unthinking majority who didn't question what they were seeing, I knew early on what a mistake this war was. \n \n I can also count. I count the daily death. I count the continuing power poblems, the health problems, and malnutrition problems, all still worse than before we went in. \n \n I count the growing acts of terrorism. I count the growing recruitment. I count more likely to die in Iraq if we are there 24 years than Saddam killed during his tenure.\n \n I have provided evidence on this forum. You just insult. emoticon_rolleyes", 
   {}, 
   122901, 
   null, 
   1116134100.0
  ], 
  [
   122940, 
   null, 
   "jyoshu", 
   "I count the growing acts of terrorism. I count the growing recruitment. I count more likely to die in Iraq if we are there 24 years than Saddam killed during his tenure.\n\n \n There's no way to prove it's more than what was happening under Saddam. You just hear about them more now because the media has an interest in reporting it right now. \n \n \nI can also count. I count the daily death. I count the continuing power poblems, the health problems, and malnutrition problems, all still worse than before we went in. I have provided evidence on this forum. You just insult. emoticon_rolleyes\n\n \n You haven't provided anything that one couldn't provide for any war--the things you just said are costs in every war that's ever been fought.", 
   {}, 
   122909, 
   null, 
   1116137280.0
  ], 
  [
   122950, 
   null, 
   "SteveRogers", 
   "There's no way to prove it's more than what was happening under Saddam. You just hear about them more now because the media has an interest in reporting it right now. \n\n \n Not true. You can count. The National Review estimates Saddam killed between 100,000 and 500,000 people in 24 years. Most civilian deaths aren't counted. But a running tally of daily deaths on another board shows an average of somewhere above 20 a day. That's 600 a month, 7200 a year, 21,600 so far. 172,800 in 24 years. Add to it, 1,600 American troops, 12,800 over 24 years. And uncounted deaths, and we are in the ball park. \n \n if this esculates at all, we may well be worse. Add to it the deaths due to malnutrition, disease, and crime, and there is no doubt things are worse. \n \n Again, it only takes caring enough to add things up.\n \n \nYou haven't provided anything that one couldn't provide for any war--the things you just said are costs in every war that's ever been fought.\n\n \n Not so. Most wars pit one country against another. Trouble is, Iraq didn't go to war against us. We just invaded. Much like Germany in the 40's, we created a pretext and forced our will on another country. No one we are fighting is wearing any uniform. And by and large civilians, people who didn't sign on for war are paying the price. To compare it to other, nobler efforts is dishonest. And you should be ashamed for dirtying righeous efforts with this blight. \n \n All we have accomplished is to turn a small group of terrorist whose best effort was accoplished with box cutters, something fairly easy to defend against in the big picture, and turn that tragedy into an international insurgency with unneeded deaths piling up. \n \n All you have to do is honestly evaluate.", 
   {}, 
   122940, 
   null, 
   1116138540.0
  ], 
  [
   122977, 
   null, 
   "jyoshu", 
   "Not true. You can count. The National Review estimates Saddam killed between 100,000 and 500,000 people in 24 years. Most civilian deaths aren't counted. But a running tally of daily deaths on another board shows an average of somewhere above 20 a day. That's 600 a month, 7200 a year, 21,600 so far. 172,800 in 24 years. Add to it, 1,600 American troops, 12,800 over 24 years. And uncounted deaths, and we are in the ball park.\n\n \n 21,600 deaths so far in Iraq? There's no way anyone can know that. Sorry, I don't trust the numbers from \"another board\" as a source. You say you can't count, and no doubt you can. But anyone can count as high as they want if they're pulling the numbers out of their ***.\n \n \nTrouble is, Iraq didn't go to war against us. We just invaded. Much like Germany in the 40's, we created a pretext and forced our will on another country. \n\n \n Indeed, Iraq didn't go to war with us. It's ironic you used 1940s Germany as an example, because we invaded THEM even though they didn't invade us as well! That should be reason enough to know that a country invading us doesn't have to be only pretext for war.\n \n And we didn't create the pretext--ironically the U.N. created it. They created by making a lot of threats and not following through with them as they should have. And now it turns out that the U.N., along with France and even Britain, were in bed with Saddam in the oil-for-food scandal. Funny how things turn out when the truth comes out, huh?\n \n \nNo one we are fighting is wearing any uniform.\n\n \n So?? If they are carrying an AK47 and shooting it at our troops, I don't think we need to see a uniform to know they are the enemy.\n \n \nAnd by and large civilians, people who didn't sign on for war are paying the price. To compare it to other, nobler efforts is dishonest.\n\n \n Then why did you compare it to WWII with your Germany example?\n \n \nAll we have accomplished is to turn a small group of terrorist whose best effort was accoplished with box cutters, something fairly easy to defend against in the big picture,\n\n \n Not so, considering many more died at the hands of those few men with boxcutters than we've lost in Iraq.", 
   {}, 
   122950, 
   null, 
   1116141480.0
  ], 
  [
   123100, 
   null, 
   "georged", 
   "\n Indeed, Iraq didn't go to war with us. It's ironic you used 1940s Germany as an example, because we invaded THEM even though they didn't invade us as well! That should be reason enough to know that a country invading us doesn't have to be only pretext for war.\n \n\n \n On 12-11-41 Germany and Italy formally declared war on the US. I don't recall Iraq declaring war on the US, nor did Poland declare war on Germany. Perhaps those facts will enhance your knowledge of history and understanding of parallel cause and effect.", 
   {}, 
   122977, 
   null, 
   1116179520.0
  ], 
  [
   123117, 
   null, 
   "plotter", 
   "That is so stupid and simple minded. \n\n But its the truth, wether you accept it or believe it, its true, you call it stupid and simple minded, maybe thats how you are, but its true all the same.\n \nThis is why I have come to believe that the left is really brain damaged. They just can't help themselves.\n\n Why do you assume im left wing? Just because i dont accept or agree with someone does not meke me or anyone left wing, maybe you should have a brain scan to make sure your ok, because i think there might be something wrong with the way you think.", 
   {}, 
   122612, 
   null, 
   1116181560.0
  ], 
  [
   123120, 
   null, 
   "plotter", 
   "Yeah we could pull out and make it a police action like your boys Clinton and Kerry wanted to do and sit back and wait for another 9/11/01.........\n \n No thanks Steve.........\n\n NEWSFLASH.....Iraq had nothing to do with 9/11.", 
   {}, 
   122526, 
   null, 
   1116181860.0
  ], 
  [
   123136, 
   null, 
   "Missouri Mule", 
   "But its the truth, wether you accept it or believe it, its true, you call it stupid and simple minded, maybe thats how you are, but its true all the same.\n \n Why do you assume im left wing? Just because i dont accept or agree with someone does not meke me or anyone left wing, maybe you should have a brain scan to make sure your ok, because i think there might be something wrong with the way you think.\n\n \n I forget. What is it that you have said that was stupid and simple minded?\n \n I assume (assuming that you said something both stupid and/or simpled minded) you are left-wing because most left-wingers have an inability to see the world as it exists. It is just a fact of life. Real Americans can always spot a left-winger by what comes out of their mouths or what they write. It really isn't at all difficult.", 
   {}, 
   123117, 
   null, 
   1116182760.0
  ], 
  [
   123149, 
   null, 
   "SteveRogers", 
   "21,600 deaths so far in Iraq? There's no way anyone can know that. \n\n \n Sure you can. Keep the daily totals reported in all news reports. You will find they under report, so the number is most likely much larger. But you get a count. Take the daily count and create an average and you can make a real good estimate. \n \n Now, to the other issues. Germany was actively invading and declared war on us. MUCH different than Iraq. Irq was a nonplayer with no real reason for us to invade. So, these are deaths by choice and not need. \n \n And keep in mind, the soilders we have lost so far, are ones lost so far. It isn't over yet.\n \n But, box cutters are still just box cutters and not wmds. Note that no one has used any wmds anywhere. At least not the kind we spread so much fear about. \n \n So, to recap, needless deaths without a reason. And you support that?", 
   {}, 
   122977, 
   null, 
   1116183840.0
  ], 
  [
   123302, 
   null, 
   "plotter", 
   "I forget. What is it that you have said that was stupid and simple minded?\n\n I didnt, it was you, i just pointed that out to you.\n \n \nI assume (assuming that you said something both stupid and/or simpled minded) you are left-wing because most left-wingers have an inability to see the world as it exists. It is just a fact of life. Real Americans can always spot a left-winger by what comes out of their mouths or what they write. It really isn't at all difficult.\n\n Interesting comment, so you think im a left winger? Tell me what did i say that tells you that?\n \n I dont believe the invasion of iraq was right, that does not make me or anyone who disagrees with that invasion left wingers, its like me saying your a fascist because you agree with something that i dont, judging by some of your comments you probably are a fascist, as fascists talk like you do, then you must be a fascist, because fascist can never accept the truth even when its staring them straight in the face, the truth is right in front of you, its staring at you, why dont you see it? Or maybe you dont want to see it, as your a fascist.", 
   {}, 
   123136, 
   null, 
   1116212280.0
  ], 
  [
   123325, 
   null, 
   "WhiteFalcon", 
   "I assume (assuming that you said something both stupid and/or simpled minded) you are left-wing because most left-wingers have an inability to see the world as it exists. It is just a fact of life. Real Americans can always spot a left-winger by what comes out of their mouths or what they write. It really isn't at all difficult.\n\n \n You are rediculous.", 
   {}, 
   123136, 
   null, 
   1116218820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  1601 U.S. Soldiers Have Died in Iraq", 
  "url": "http://www.4forums.com/political/politics-debates/5128-1601-u-s-soldiers-have-died-iraq.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 5128, 
  "discussion_files": [
   [
    "5478.html", 
    "http://www.4forums.com/political/politics-debates/5128-1601-u-s-soldiers-have-died-iraq-print.html"
   ], 
   [
    "5479.html", 
    "http://www.4forums.com/political/politics-debates/5128-1601-u-s-soldiers-have-died-iraq-8-print.html"
   ], 
   [
    "5480.html", 
    "http://www.4forums.com/political/politics-debates/5128-1601-u-s-soldiers-have-died-iraq-6-print.html"
   ], 
   [
    "5481.html", 
    "http://www.4forums.com/political/politics-debates/5128-1601-u-s-soldiers-have-died-iraq-4-print.html"
   ], 
   [
    "5482.html", 
    "http://www.4forums.com/political/politics-debates/5128-1601-u-s-soldiers-have-died-iraq-5-print.html"
   ], 
   [
    "5483.html", 
    "http://www.4forums.com/political/politics-debates/5128-1601-u-s-soldiers-have-died-iraq-7-print.html"
   ], 
   [
    "5484.html", 
    "http://www.4forums.com/political/politics-debates/5128-1601-u-s-soldiers-have-died-iraq-3-print.html"
   ], 
   [
    "5485.html", 
    "http://www.4forums.com/political/politics-debates/5128-1601-u-s-soldiers-have-died-iraq-2-print.html"
   ]
  ], 
  "identifier": 5128
 }
]