[
 [
  [
   119165, 
   null, 
   "Missouri Mule", 
   "Isn't this really what is going on here? The hatred for America and Bush trumps everything else. Am I wrong?\n ===========================\n \n Rooting Against America\n \n by Pat Sajak\n Posted May 9, 2005 \n \n A distasteful glee emanates from the Left upon the arrival of any bad news from the Middle East. It's as if they are saying, \"So, W, where is all the Democracy we're supposed to be spreading through the area? See, we were right, and you were wrong. And deceitful. And dumb.\" And as bad news is welcomed as an indictment of the President and his policies, good news (and there has been plenty) must be minimized or ignored.\n \n It's one thing to oppose an Administration's foreign policy, but it's another to publicly gloat over and appear to smugly enjoy any of its setbacks. The long tradition of a Loyal Opposition in this country now appears to be an old-fashioned notion. There may have been widespread resistance to America's entry into World War II, but once we were in it, there wasn't much doubt about whom Americans were pulling for...\n \n (Snip)\n \n http://www.humaneventsonline.com/article.php?id=7389", 
   {
    "post_info": {
     "post_title": "Rooting Against America"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1115655600.0
  ], 
  [
   119217, 
   null, 
   "lord tammerlain", 
   "The main question that should be asked\n \n Should the american people support bad policy no matter what? Just to be patriotic and all?", 
   {}, 
   119165, 
   null, 
   1115659800.0
  ], 
  [
   119230, 
   null, 
   "Missouri Mule", 
   "The main question that should be asked\n \n Should the american people support bad policy no matter what? Just to be patriotic and all?\n\n \n I have argued that the underlying strategy behind the Iraq policy cannot be revealed for obvious reasons. It is really impossible for anyone to know if it is bad policy unless they are privy to the plans and strategy that went into the Iraq policy. What we do know is that the U.S. policy prior to 9/11; namely waiting for the terrorists to strike us again and again was not working. \n \n The same argument could have been made for the Allied fighting the Nazis in North Africa during WWII. There was little or no threat to the Allies there but it was necessary to fight the Nazis where we could find them. As to Iraq we could hardly have parachuted troops into Iran (the foremost state sponsor of terrorism) but we could get rid of a troublesome dictator and murderous thug and have a base of operations to take down the terrorist network in the Middle East. The alternative might have been to operate off the decks of aircraft carriers or firing expensive cruise missiles \"up some camel's butt.\" \n \n The bottom line question here for the left to answer is this. Is Al Queda a stronger or weaker force than they were prior to 9/11? Is America safer than it was prior to 9/11? I would argue that the answer to those questions are self-evident. Therefore I would also argue that we are engaged in a correct policy in Iraq. But I, like you and everyone else, have not seen the strategic plan nor been engaged in the reasons for our policy. We can speculate but we can't know for sure. Since we cannot know, I am inclined to give the benefit of the doubt to our president who is provided with the most relevant and secret of information. No one should think this decision to invade Iraq was taken lightely.", 
   {}, 
   119217, 
   null, 
   1115660880.0
  ], 
  [
   119242, 
   null, 
   "Truthsayer", 
   "I don't know if it's so much anti-America as it is anti-rightwing extremism. As you may or may not recall, depending on your selective memory, the right came down pretty hard on the left some time back as the left protested the rightwing agenda. They were called \"traitor\" \"whacko\" amongst a plethra of other insulting arrogant accusations.\n \n I think that recent revelations, (that seem to surface more and more each day,) that allow these people on the left to finally say \"I told ya so\" coupled their pleasure of rightfully being able to say \"I told ya so\" is not so much a jab on America as it is a jab on those who insulted them, some time back.\n \n Rather than eating crow, or having to say \"I was wrong\" some on the right seems to prefer to stay in denial, and spin it to appear that the left is joyous over the failures of the right. I don't think that's the case. I think it is just a simple, \"I told ya so\" and the right can't handle it or assume their responsibility. Spin, divide and conquer. That's the right's modus operandi. How many times have we seen it before? How many times will we see it again?", 
   {}, 
   119230, 
   null, 
   1115661900.0
  ], 
  [
   119280, 
   null, 
   "Diogenes99", 
   "Rather than eating crow, or having to say \"I was wrong\" some on the right seems to prefer to stay in denial, ...\nIt seems to me that some on the left prefer to stay in denial rather than admit that Bush has adopted the effective course of action.", 
   {}, 
   119242, 
   null, 
   1115664480.0
  ], 
  [
   119300, 
   null, 
   "Truthsayer", 
   "It seems to me that some on the left prefer to stay in denial rather than admit that Bush has adopted the effective course of action.\n\n \n See what I mean? Who, in the light of reality, could possibly still believe Bush has adopted an effective course of action? \n \n To admit that the Bush fiasco is not the sucess that his supporters claim it to be, one would have to put politics aside. Also, to do that one would have to put aside their pride and deal with the bitter reality. It's much easier to spin for them, or so it appears. But then again, reality is perception. If you percieve that Bush is doing right by the US, then that is your reality. It is not my reality however. I have a problem with being unable to step outside of the facts. Real reality is all I can work with. But your loyalty is admirable none the less. Like him or not, he is still our president. He's all we got right now.\n \n They say when you get lemons, make lemonade. It would be much easier if I could get in line with the fallacy, I just can't seem to make myself fall for it though. But that is not the fault of my country. Our hearts are in the right place. I just feel that some have been disillusioned, but they feel the same about me so perhaps we all could be a little misguided. Who's to say? Even with our faults and the powers that be, America is STILL number one in my book. Never take my criticisms of the Bush administration as a knock against my nation. The beauty of our nation is that you can believe your reality and I can believe mine and we can still be Americans together.", 
   {}, 
   119280, 
   null, 
   1115666160.0
  ], 
  [
   119355, 
   null, 
   "notdakuningist", 
   "\"U.S. policy prior to 9/11; namely waiting for the terrorists to strike us again and again was not working.\"\n \n Actually early u.s. policy after 9/11 was a handover from the clinton administration that was not implemented by Bush and his cabinet until after 9/11. Afghanistan was being planned after the attack on the uss cole.\n \n Though I believe that we still can pull through in Iraq and have a great chance to prove that democracy can be molded into any culture I don't believe that the situation over there will be getting better overnight and now that the die has been cast we as a country have a long hard road ahead of us if we want to make the situation better.", 
   {}, 
   119300, 
   null, 
   1115669340.0
  ], 
  [
   119363, 
   null, 
   "Desaix", 
   "Excellent posts Truthsayer. ;) \n \n \nIt seems to me that some on the left prefer to stay in denial rather than admit that Bush has adopted the effective course of action.\n\n \n For the short term the invasion of Iraq would have seemed like the right idea but in the long term invading and bombing sacred muslim lands does not help.It didn't help in Iran or Afghanistan to infringe in Muslim affairs.The long term backlash led to 9/11 and a generation of militant Islamists.Osama wanted the US to invade Muslim land.Remember that.\n \n Either way,to say the Iraq invasion has been a short term success would be a lie.", 
   {}, 
   119280, 
   null, 
   1115670420.0
  ], 
  [
   119381, 
   null, 
   "Truthsayer", 
   "\"U.S. policy prior to 9/11; namely waiting for the terrorists to strike us again and again was not working.\"\n \n Actually early u.s. policy after 9/11 was a handover from the clinton administration that was not implemented by Bush and his cabinet until after 9/11. Afghanistan was being planned after the attack on the uss cole.\n \n Though I believe that we still can pull through in Iraq and have a great chance to prove that democracy can be molded into any culture I don't believe that the situation over there will be getting better overnight and now that the die has been cast we as a country have a long hard road ahead of us if we want to make the situation better.\n\n \n It's coming out in the press lately what many of us already knew, (and just as many refused to believe.) Mr. Bush was dead set on attacking Iraq pre 9/11 and that he would only consider the \"intelligence\" post 9/11 (or lack thereof) that would link his agenda to the war on terror. Another \"I told ya so\" scenario is in order I suppose. God forbid that we let the \"War on Terror\" get in the way of his and Halliburton's....er....Cheney's....middle east agenda.\n \n When you write:\nThough I believe that we still can pull through in Iraq and have a great chance to prove that democracy can be molded into any culture \n Are you suggesting, that in your opinion, it is our obligation to the world to \"liberate\" any nation that does not enjoy democracy as we know it? That's a common \"neocon\" philosophy but I am unclear if you are stating that's your opinion as well. \n \n One world order....our way or the highway. You know, I have big problems with that kind of idealism that has swept the rightwing following. I do feel, however, that countries around the world would do well to adopt some of our principles and procedures. It has certainly proven well for the US. But to go and force our ideals upon soverign nations, especially by the use of force, seems very un-American to me.", 
   {}, 
   119355, 
   null, 
   1115672220.0
  ], 
  [
   119506, 
   null, 
   "Missouri Mule", 
   "I don't know if it's so much anti-America as it is anti-rightwing extremism. As you may or may not recall, depending on your selective memory, the right came down pretty hard on the left some time back as the left protested the rightwing agenda. They were called \"traitor\" \"whacko\" amongst a plethra of other insulting arrogant accusations.\n \n I think that recent revelations, (that seem to surface more and more each day,) that allow these people on the left to finally say \"I told ya so\" coupled their pleasure of rightfully being able to say \"I told ya so\" is not so much a jab on America as it is a jab on those who insulted them, some time back.\n \n Rather than eating crow, or having to say \"I was wrong\" some on the right seems to prefer to stay in denial, and spin it to appear that the left is joyous over the failures of the right. I don't think that's the case. I think it is just a simple, \"I told ya so\" and the right can't handle it or assume their responsibility. Spin, divide and conquer. That's the right's modus operandi. How many times have we seen it before? How many times will we see it again?\n\n \n The point is that Bush is not wrong. How many attacks have occurred on U.S. soil since 9/11? If we had all of this hand wringing in WWII we would now be speaking German.", 
   {}, 
   119242, 
   null, 
   1115679780.0
  ], 
  [
   119510, 
   null, 
   "Missouri Mule", 
   "It's coming out in the press lately what many of us already knew, (and just as many refused to believe.) Mr. Bush was dead set on attacking Iraq pre 9/11 and that he would only consider the \"intelligence\" post 9/11 (or lack thereof) that would link his agenda to the war on terror. Another \"I told ya so\" scenario is in order I suppose. God forbid that we let the \"War on Terror\" get in the way of his and Halliburton's....er....Cheney's....middle east agenda.\n \n When you write: Are you suggesting, that in your opinion, it is our obligation to the world to \"liberate\" any nation that does not enjoy democracy as we know it? That's a common \"neocon\" philosophy but I am unclear if you are stating that's your opinion as well. \n \n One world order....our way or the highway. You know, I have big problems with that kind of idealism that has swept the rightwing following. I do feel, however, that countries around the world would do well to adopt some of our principles and procedures. It has certainly proven well for the US. But to go and force our ideals upon soverign nations, especially by the use of force, seems very un-American to me.\n\n \n This Halliburton nonsense is really simple minded to even bring up. To think that Bush and Cheney would want go to go war on behalf of Halliburton strikes me as logic that only the left could possibly concoct. It is really downright infantile to believe such things.", 
   {}, 
   119381, 
   null, 
   1115679960.0
  ], 
  [
   119529, 
   null, 
   "Redratio1", 
   "Well one thing is certain, Georgians LOVE Americans. You see the reception GWB got?\n \n Those who were most oppressed during the Cold War under the Soviets love us the most. Those we protected against the Soviets dislike us the most.\n \n Whats wrong with this picture?", 
   {}, 
   119510, 
   null, 
   1115681880.0
  ], 
  [
   119531, 
   null, 
   "Missouri Mule", 
   "Well one thing is certain, Georgians LOVE Americans. You see the reception GWB got?\n \n Those who were most oppressed during the Cold War under the Soviets love us the most. Those we protected against the Soviets dislike us the most.\n \n Whats wrong with this picture?\n\n \n Indeed. This goes to my theory that the left and the pampered are essentially brain damaged. One could extrapolate from this that had western Europe gone the way of eastern Europe that they would be singing a far different tune than they are now. However, I suspect once the historical revisionists on the left massage the history books it will be shown that as always the real evil in the world is the United States. It'll be the same with the children in eastern Europe as it is in the west. Just like so many American kids who believe the worst about America. The older generations are dying off and the ignorant, the lazy and the stupid will inherit the nation we once were proud to call the home of land of the free and the home of the brave.", 
   {}, 
   119529, 
   null, 
   1115682240.0
  ], 
  [
   119533, 
   null, 
   "Redratio1", 
   "I'd think I'd be more specific than just say \"the left\". Tony Blair is on the \"left\" and he loves the US. Remember, the left is everyone just off center (and not on right).\n Those who just protest the USA because it is fashionable or are poorly educated on what was going on for the last 50 years during the Cold War in the wake of Stalin and Mao.\n \n Though I agree most of them are on the left............unfortunately.", 
   {}, 
   119531, 
   null, 
   1115682660.0
  ], 
  [
   119539, 
   null, 
   "Missouri Mule", 
   "I'd think I'd be more specific than just say \"the left\". Tony Blair is on the \"left\" and he loves the US. Remember, the left is everyone just off center (and not on right).\n Those who just protest the USA because it is fashionable or are poorly educated on what was going on for the last 50 years during the Cold War in the wake of Stalin and Mao.\n \n Though I agree most of them are on the left............unfortunately.\n\n \n \"The Looney Left?\" \"The Hard Left?\" In any event, as you agree, they are on the left.", 
   {}, 
   119533, 
   null, 
   1115683080.0
  ], 
  [
   119544, 
   null, 
   "Redratio1", 
   "\"The Looney Left?\" \"The Hard Left?\" In any event, as you agree, they are on the left.\n\n \n *sigh*\n \n Yes.\n \n Though I have to say I find the CCs in this country far more irritating.", 
   {}, 
   119539, 
   null, 
   1115683320.0
  ], 
  [
   119564, 
   null, 
   "Duo_Maxwell", 
   "The point is that Bush is not wrong. How many attacks have occurred on U.S. soil since 9/11? If we had all of this hand wringing in WWII we would now be speaking German.\n\n \n ah, the fraud comes out. \n \n Confusing Correlation And Causation: \n \n earthquakes in the Andes were correlated with the closest approaches of the planet Uranus. Therefore, Uranus must have caused them. (But Jupiter is nearer than Uranus, and more massive too.) \n When sales of hot chocolate go up, street crime drops. Does this correlation mean that hot chocolate prevents crime? No, it means that fewer people are on the streets when the weather is cold. \n \n The bigger a child's shoe size, the better the child's handwriting. Does having big feet make it easier to write? No, it means the child is older. \n \n Since Bush has been elected, how many times has the sun failed to set? I Guess he's the reason!\n Since Bush has been elected, how many Russian near-attacks have occured? I Guess he's the reason!\n Since Bush has been elected, how many Communist regimes have risen to power?\n I Guess he's the reason!\n Since Bush has been elected, how many subs from Quiznos have I not eaten?\n I Guess he's the reason!", 
   {}, 
   119506, 
   null, 
   1115684700.0
  ], 
  [
   119689, 
   null, 
   "daewoo", 
   "I would argue that it is the far right that is rooting for the destruction of America. \n \n You can call it however you like, but 9/11 was caused by our foreign policy. Now, we have increased global agression, added more gunboat diplomacy to the agenda, and driven international opinion further against the US. The number of terrorists ou there is on the rise, and the new terrorists are more sophisticated than the old ones. our enhanced foreign policy is even heavier on the very things that caused 9/11 to begin with.\n \n The bush administration has gotten up on several occasions and warned us about a mushroom cloud over an American city, and then gone out and done everything they could to ensure it happens. They have failed to secure our borders, they have failed to secure our ports. Their multi billion dollar department of homelad security is such a mess that they are considering scrapping the whole thing and starting over fresh.", 
   {}, 
   119564, 
   null, 
   1115693040.0
  ], 
  [
   119699, 
   null, 
   "Redratio1", 
   "I would argue that it is the far right that is rooting for the destruction of America. \n\n \n More like leading us to destruction.", 
   {}, 
   119689, 
   null, 
   1115693640.0
  ], 
  [
   119748, 
   null, 
   "SteveRogers", 
   "Isn't this really what is going on here? The hatred for America and Bush trumps everything else. Am I wrong?\n ===========================\n \n Rooting Against America\n \n by Pat Sajak\n Posted May 9, 2005 \n \n A distasteful glee emanates from the Left upon the arrival of any bad news from the Middle East. It's as if they are saying, \"So, W, where is all the Democracy we're supposed to be spreading through the area? See, we were right, and you were wrong. And deceitful. And dumb.\" And as bad news is welcomed as an indictment of the President and his policies, good news (and there has been plenty) must be minimized or ignored.\n \n It's one thing to oppose an Administration's foreign policy, but it's another to publicly gloat over and appear to smugly enjoy any of its setbacks. The long tradition of a Loyal Opposition in this country now appears to be an old-fashioned notion. There may have been widespread resistance to America's entry into World War II, but once we were in it, there wasn't much doubt about whom Americans were pulling for...\n \n (Snip)\n \n http://www.humaneventsonline.com/article.php?id=7389\n\n \n \n Yes, you are wrong. Foolishly and childlishly wrong. I have seen this before and it has always been off the mark. The people who are really against America are those who mindless accept every rediculeous policy that goes out of Washington.\n \n Bush is a mental midget and his policies have harmed this country. That's the bottom line. And if your need, anyone's need, to feel good at the exspense of sound policy and human lives is sad. \n \n So, maybe I push too much here. Maybe. But I have heard too much of this cowardly nonsense. :xcensored :xcensored :xcensored", 
   {
    "unicode_changes_made": true
   }, 
   119165, 
   null, 
   1115699340.0
  ], 
  [
   119756, 
   null, 
   "daewoo", 
   "More like leading us to destruction.\n\n \n I think it may be intentional. Nobody can POSSIBLY be as stupid as bush seems to be in this regard, and surely you could not find 2 such fools. BUT, you turn on the TV, and the governmetn seems to be run by such XXXXXX. It cannot possibly be anything but a conspiracy. I just cannot fathom that there are that many people with so little common sense.", 
   {}, 
   119699, 
   null, 
   1115699760.0
  ], 
  [
   119770, 
   null, 
   "Missouri Mule", 
   "Yes, you are wrong. Foolishly and childlishly wrong. I have seen this before and it has always been off the mark. The people who are really against America are those who mindless accept every rediculeous policy that goes out of Washington.\n \n Bush is a mental midget and his policies have harmed this country. That's the bottom line. And if your need, anyone's need, to feel good at the exspense of sound policy and human lives is sad. \n \n So, maybe I push too much here. Maybe. But I have heard too much of this cowardly nonsense. :xcensored :xcensored :xcensored\n\n \n Says who? Are you some kind of intellectual giant?", 
   {}, 
   119748, 
   null, 
   1115702520.0
  ], 
  [
   119773, 
   null, 
   "SteveRogers", 
   "Says who? Are you some kind of intellectual giant?\n\n \n Top of my class. Graduate Student of the year. Not a giant, but good. ;)", 
   {}, 
   119770, 
   null, 
   1115702640.0
  ], 
  [
   119774, 
   null, 
   "Missouri Mule", 
   "I would argue that it is the far right that is rooting for the destruction of America. \n \n You can call it however you like, but 9/11 was caused by our foreign policy. Now, we have increased global agression, added more gunboat diplomacy to the agenda, and driven international opinion further against the US. The number of terrorists ou there is on the rise, and the new terrorists are more sophisticated than the old ones. our enhanced foreign policy is even heavier on the very things that caused 9/11 to begin with.\n \n The bush administration has gotten up on several occasions and warned us about a mushroom cloud over an American city, and then gone out and done everything they could to ensure it happens. They have failed to secure our borders, they have failed to secure our ports. Their multi billion dollar department of homelad security is such a mess that they are considering scrapping the whole thing and starting over fresh.\n\n \n What a load of bilge. You don't have any more information than anyone else here and that equals 0. Unless you are in on the planning and intelligence gathering that goes on in the highest levels of government you don't know what you are talking about. \n \n Have you seen any mushroom clouds over an American city?", 
   {}, 
   119689, 
   null, 
   1115702700.0
  ], 
  [
   119775, 
   null, 
   "Missouri Mule", 
   "Top of my class. Graduate Student of the year. Not a giant, but good. ;)\n\n \n Did you ever hear of \"educated XXXXXX?\" Now I'm not saying you are an \"idiot\" but the standards of American education have declined so markedly since the time I went to school it is truly a national scandal.\n \n But assuming for the moment that you are the most intelligent person in the United States, what did you find in Bush's latest press conference that you can use to justify that he is a \"mental midget?\" Please be specific.", 
   {}, 
   119773, 
   null, 
   1115702820.0
  ], 
  [
   119796, 
   null, 
   "SteveRogers", 
   "Did you ever hear of \"educated XXXXXX?\" Now I'm not saying you are an \"idiot\" but the standards of American education have declined so markedly since the time I went to school it is truly a national scandal.\n \n But assuming for the moment that you are the most intelligent person in the United States, what did you find in Bush's latest press conference that you can use to justify that he is a \"mental midget?\" Please be specific.\n\n \n Don't believe everything you read. We can read and do. \n \n I find his policies lacking. Not a deep thinker. Doesn't understand what we are actually doing. Makes him a mental midget.", 
   {}, 
   119775, 
   null, 
   1115704020.0
  ], 
  [
   119833, 
   null, 
   "Missouri Mule", 
   "Don't believe everything you read. We can read and do. \n \n I find his policies lacking. Not a deep thinker. Doesn't understand what we are actually doing. Makes him a mental midget.\n\n \n Typical left wing bilge. You didn't present even one statement that he made in his press conference and proceed to knock his arguments down. Why am I not surprised? So you pound on the table or more correctly throw a tantrum and insult his intelligence.", 
   {}, 
   119796, 
   null, 
   1115706420.0
  ], 
  [
   119838, 
   null, 
   "SteveRogers", 
   "Typical left wing bilge. You didn't present even one statement that he made in his press conference and proceed to knock his arguments down. Why am I not surprised? So you pound on the table or more correctly throw a tantrum and insult his intelligence.\n\n \n You're right. You said most recent one, and I haven't assessed that one yet. But I did tell you why I said he was a mental midget. If you have a specific point in mind, by all means, share.\n \n But his policies and his lack of understanding label him for me.", 
   {}, 
   119833, 
   null, 
   1115706660.0
  ], 
  [
   119852, 
   null, 
   "Missouri Mule", 
   "You're right. You said most recent one, and I haven't assessed that one yet. But I did tell you why I said he was a mental midget. If you have a specific point in mind, by all means, share.\n \n But his policies and his lack of understanding label him for me.\n\n \n Were you in on the strategic planning and discussion? (That's a rhetorical question for the \"mental midgets\" here.) Neither was I. Until all the memoirs and history is written we won't know what decisions were made and what for and who or who didn't have a good understanding of why we went into Iraq. \n \n I'd post a link to Victor Davis Hanson's article today in the WSJ if I could find it. I read it three times it was so good. You really ought to learn more about history before you judge Bush.\n \n Specifically as to Bush's last press conference, he was well briefed and he responded to every question with knowledge and understanding seldom seen before. I listened carefully and I haven't heard any columnist/opiner or whoever find anything to fault. He knew what he was talking about and did a fine job. This business about Bush's mental ability is a cheap shot by those without an effective argument. They don't like his Texas twang and his enunciation of words, etc., and that somehow makes him stupid. \n \n I remember Harry Truman and I can tell you that Truman was about as coarse and non-intellectual a politician as you would find anywhere. He was in fact the only president in the 20th century who was not a college graduate. However he was a quick learner and made wise decisions as history has borne out. He is now considered by most historians to be a \"near great\" president and some have even gone so far as to label him a \"great\" president. The jury is still out on Bush 43 but one thing for sure, he will be no inconsequential president. Love him or hate him, he is making history and as I believe making the decisions that will keep this country safe from the barbarians who would destroy our civilization.", 
   {}, 
   119838, 
   null, 
   1115707200.0
  ], 
  [
   119870, 
   null, 
   "SteveRogers", 
   "You don't have to be in the room to know stupidity when you see it. And again, the evidence speaks for itself. Terrorist acts tripled. Terrorist recruitment up. More people dying. Only a mental midget sees that as a positive. ;)", 
   {}, 
   119852, 
   null, 
   1115708400.0
  ], 
  [
   119877, 
   null, 
   "daewoo", 
   "Were you in on the strategic planning and discussion? (That's a rhetorical question for the \"mental midgets\" here.) Neither was I. Until all the memoirs and history is written we won't know what decisions were made and what for and who or who didn't have a good understanding of why we went into Iraq. \n \n\n \n \n So we should blindly follow whatever leader happens to be in power, because there may be some secret plan in the works that we do not know about, one that completely invalidates the first hand observations we can make?\n \n I think the \"mental midget\" label has been mis applied.", 
   {}, 
   119852, 
   null, 
   1115708640.0
  ], 
  [
   119881, 
   null, 
   "Duo_Maxwell", 
   "Have you seen any mushroom clouds over an American city?\n\n \n Well, I guess we can attribute that to every American president in history. emoticon_rolleyes \n \n Do you see why you're confusing causation with corralation? \n \n The fact that we haven't gotten nuked is the #1 reason I believe in a God. The amount of weapons out there as wel as people actively trying to get them is amazing. What is worse is that Bush hasn't done squat to prevent such a attack. Ports aren't even scanning 15% of all of the shipments. The borders are still extremely pours. Agreements with other gov'ts to scan shipments on their ends are not even near finalization, much less implemtation.\n \n All it would take is one nuke encased in a thin layer of lead on a cargo ship to explode as it pulls into port to kill millions. \n \n What has Bush done to stop this?\n \n NOTHING", 
   {}, 
   119774, 
   null, 
   1115708880.0
  ], 
  [
   119882, 
   null, 
   "Missouri Mule", 
   "So we should blindly follow whatever leader happens to be in power, because there may be some secret plan in the works that we do not know about, one that completely invalidates the first hand observations we can make?\n \n I think the \"mental midget\" label has been mis applied.\n\n \n No. I never said that. However, I have NEVER heard a single argument made by the appeasers of the world that would address terrorism. To extend their argument is to put a sign on our back that says \"kick me.\" I'm not in a \"kick-me\" mood. I'm glad that we finally have a president who will stand on his own two hind legs and do something affirmative for a change. All real Americans feel this way.", 
   {}, 
   119877, 
   null, 
   1115708880.0
  ], 
  [
   119889, 
   null, 
   "SteveRogers", 
   "Attacking the real enemy, international terrorist isn't appeasement. And attacking a no body like Saddam isn't doing anything positive.\n \n And that's the bottom line.", 
   {}, 
   119882, 
   null, 
   1115709240.0
  ], 
  [
   119893, 
   null, 
   "Redratio1", 
   "\n What has Bush done to stop this?\n \n NOTHING\n\n \n Or the borders....what about the borders Mr. Bush?\n Seriously, its like sitting on your front porch with gun and having your back door wide open. It makes no sense.", 
   {}, 
   119881, 
   null, 
   1115709600.0
  ], 
  [
   119894, 
   null, 
   "daewoo", 
   "No. I never said that. However, I have NEVER heard a single argument made by the appeasers of the world that would address terrorism. To extend their argument is to put a sign on our back that says \"kick me.\" I'm not in a \"kick-me\" mood. I'm glad that we finally have a president who will stand on his own two hind legs and do something affirmative for a change. All real Americans feel this way.\n\\\n \n So the only real americans are XXXXXX? \n \n Affirmative? Again, terrorism is not just up, it has risen exponentially, as has the number of terrorists out there, and the amount of money they have available to them. Bin Laden could not have asked for a better ally than George Bush. BL claims theri goal is to bankrupt the united states, and we have a president that is willing to blow hundreds of billions, or even trillions, on a policy that creates more terrorists and more terrorism, and sinks world opinion of the Us to the point that we can not get even friendly Belguim to hold know Al Queda memebrs so the FBI can interrogate them. \n \n Bin ladens stated cuase for attacking us is our militant foreign policy and the fact that we put US financial concerns above foreign lives. Bush was good enough to go out and presnet an excellent, contemporary example of this.\n \n BL said we were cruel......we gave him abu ghraib\n BL said we killed children....we gave him 20,000 dead Iraqi children \n BL said we were imperialist.....we illegally invaded Iraq.\n \n Whewn the terrorist is looking like the honest good guy, and the US is looking like the despodic thug, somethign is wrong.", 
   {}, 
   119882, 
   null, 
   1115709660.0
  ], 
  [
   119897, 
   null, 
   "Redratio1", 
   " All real Americans feel this way.\n\n \n All real Americans??? You mean 59,000,000 people who didn't vote for GWB are not real Americans?\n \n Sounds like the Frist arguement.", 
   {}, 
   119882, 
   null, 
   1115709780.0
  ], 
  [
   119902, 
   null, 
   "SteveRogers", 
   "All real Americans??? You mean 59,000,000 people who didn't vote for GWB are not real Americans?\n \n Sounds like the Frist arguement.\n\n \n you're right. Every bit as foolish and dishonest.", 
   {}, 
   119897, 
   null, 
   1115709840.0
  ], 
  [
   119903, 
   null, 
   "daewoo", 
   "\n The fact that we haven't gotten nuked is the #1 reason I believe in a God. The amount of weapons out there as wel as people actively trying to get them is amazing. What is worse is that Bush hasn't done squat to prevent such a attack. Ports aren't even scanning 15% of all of the shipments. The borders are still extremely pours. Agreements with other gov'ts to scan shipments on their ends are not even near finalization, much less implemtation.\n \n\n \n Just look at our southern border. I am sure we have all seen the video of Sean Hannity stepping back and forth across the border (yes, the one that the wackos said he should be arrested for.....don't fix the problem, pick on the news anchor who reports it). Not only is the border an unpatrolled barbed wire fence, it has stepthroughs in it. What, we could not spring the 40 cents each for wire gappers?", 
   {}, 
   119881, 
   null, 
   1115709840.0
  ], 
  [
   119926, 
   null, 
   "Duo_Maxwell", 
   "that's not the real problem I'm worried about. That can be solved by merely hiring a bunch of border patrol agents. \n \n The senario I'm worried about doesn't even require a weapon to touch Us soil to kill millions.", 
   {}, 
   119903, 
   null, 
   1115711160.0
  ], 
  [
   119928, 
   null, 
   "Redratio1", 
   " That can be solved by merely hiring a bunch of border patrol agents. \n\n \n And yet...................................they don't.", 
   {}, 
   119926, 
   null, 
   1115711220.0
  ], 
  [
   119929, 
   null, 
   "Duo_Maxwell", 
   "All real Americans??? You mean 59,000,000 people who didn't vote for GWB are not real Americans?\n \n Sounds like the Frist arguement.\n\n \n actually it's much higher. If you didn't vote for Bush, apparently you're not included in Mule's \"Real Americans.\" \n \n I guess that means 75% of the country aren't \"real Americans.\"\n \n I now see that Mule is relying more and more upon fraud.\n \n His latest claim is the fallacy of the True Scotsman.", 
   {}, 
   119897, 
   null, 
   1115711280.0
  ], 
  [
   119984, 
   null, 
   "Big_Bear_Scot", 
   "I really don't understand this blind obedience some Americans have towards their President(a politician I may add) even if he is doing a bad job, or makes some decisions that not quite right, some people still support him no matter what. For example I don't support my First Minister in Scotland, does that make me less Scottish than the person who voted him into power ?\n \n I bet the same people who say that you should always support your commander in chief, did not support Clinton when he was in office or Jimmy Carter or anybody who had different political beliefs than themselves.", 
   {}, 
   119929, 
   null, 
   1115726580.0
  ], 
  [
   120166, 
   null, 
   "notdakuningist", 
   "\"Are you suggesting, that in your opinion, it is our obligation to the world to \"liberate\" any nation that does not enjoy democracy as we know it? That's a common \"neocon\" philosophy but I am unclear if you are stating that's your opinion as well.\"\n \n Not necessarily democracy as we know it but a rule of the people. Iraq was not ruled by the majority of those living in Iraq, many had no say in government at all. If democracy were adopted they would at least have a choice in what direction their country would take. This is one of only a few even close to redeeming things about going into Iraq.\n \n If you're saying that it's not ok for us to \"force\" our way of life upon them why is it alright for someone or a few individuals in their own country to force them to live a certain way?", 
   {}, 
   119984, 
   null, 
   1115752260.0
  ], 
  [
   120184, 
   null, 
   "Truthsayer", 
   "I suppose we are all entitled to our opinions but I cannot fathom how any \"real American\" could possibly support George W. Bush. The damage he has already done, and is doing to, our nation is immeasurable. We might as well have The Aytollah Khomeini in the Oval Office as far as anyone being in there that actually cares about the American people.\n \n Bush supporters should hang their head in shame. Countless men and women have died for this country throughout our history for our freedom and prosperity just to see Bushism wipe it all away. And anyone who thinks Bush went to Iraq to \"fight terrorism\" is just a plain fool. He was going into Iraq terrorism or not. I wish that only Bush supporters had to send THEIR children to die for him and his reich.\n \n I have found that most war mongering type people really do love this guy but I submit that they would love ANYONE who could provide them with a war.", 
   {}, 
   120166, 
   null, 
   1115757540.0
  ], 
  [
   120248, 
   null, 
   "Clive14", 
   "Well one thing is certain, Georgians LOVE Americans. You see the reception GWB got?\n \n Those who were most oppressed during the Cold War under the Soviets love us the most. Those we protected against the Soviets dislike us the most.\n \n Whats wrong with this picture?\nWhat's wrong with the picture is the \"Those we protected against the Soviets\" mentality. North America and western Europe presented a united front to Soviet fascism. Collectively we made it clear that, unlike with the Nazis and their picking off one country at a time, an attack against any member of NATO would be an attack upon all of NATO and all of NATO would respond. It was a partnership and it worked.\n \n Some within the USA though have got into their heads that it was big boy USA protecting his little mates in Europe and that these little friends now owe him some loyality. The simply answer from those \"little friends\" is a clear \"**** you!\". When the right wing of America learn humility and wake up to the fact that Europe owes them nothing and starts to talk in the language of equals, then we might start to \"love\" you again. Until then, your actions and words cause the level of contempt toward you to grow daily.", 
   {}, 
   119529, 
   null, 
   1115764560.0
  ], 
  [
   120251, 
   null, 
   "Missouri Mule", 
   "What's wrong with the picture is the \"Those we protected against the Soviets\" mentality. North America and western Europe presented a united front to Soviet fascism. Collectively we made it clear that, unlike with the Nazis and their picking off one country at a time, an attack against any member of NATO would be an attack upon all of NATO and all of NATO would respond. It was a partnership and it worked.\n \n Some within the USA though have got into their heads that it was big boy USA protecting his little mates in Europe and that these little friends now owe him some loyality. The simply answer from those \"little friends\" is a clear \"**** you!\". When the right wing of America learn humility and wake up to the fact that Europe owes them nothing and starts to talk in the language of equals, then we might start to \"love\" you again. Until then, your actions and words cause the level of contempt toward you to grow daily.\n\n \n Equal?? What a laugh. Europe has been an albatross around America's necks for a century with two world wars because we always had to clean up your messes. Don't give me this crapola. You can take your arrogant pomposity and put it where the sun doesn't shine. \n \n Europe never paid its fair share of the expense during the Cold War. It was always playing Uncle Sam for Uncle Sap and we are fed up with your know it all bulloney. The next time (and there will be a next time), don't call us, our phone will be off the hook. Your're on your own buddy.", 
   {}, 
   120248, 
   null, 
   1115765100.0
  ], 
  [
   120254, 
   null, 
   "Missouri Mule", 
   "I really don't understand this blind obedience some Americans have towards their President(a politician I may add) even if he is doing a bad job, or makes some decisions that not quite right, some people still support him no matter what. For example I don't support my First Minister in Scotland, does that make me less Scottish than the person who voted him into power ?\n \n I bet the same people who say that you should always support your commander in chief, did not support Clinton when he was in office or Jimmy Carter or anybody who had different political beliefs than themselves.\n\n \n Clinton was a womanizer who disgraced his office. Carter was a wuss who was afraid of his own shadow. Neither one showed a backbone to protect the country when they were presidents. Neither one could hold a candle to FDR, Truman and JFK. Those were true patriots. The last two Democrats couldn't fight their way out of a paper bag.", 
   {}, 
   119984, 
   null, 
   1115765280.0
  ], 
  [
   120255, 
   null, 
   "Clive14", 
   "Equal?? What a laugh...\nI rest my case. emoticon_rolleyes", 
   {}, 
   120251, 
   null, 
   1115765340.0
  ], 
  [
   120256, 
   null, 
   "Missouri Mule", 
   "All real Americans??? You mean 59,000,000 people who didn't vote for GWB are not real Americans?\n \n Sounds like the Frist arguement.\n\n \n Real Americans don't vote for appeasers and pacifists. We vote for leaders who believe it is their duty to lead.", 
   {}, 
   119897, 
   null, 
   1115765340.0
  ], 
  [
   120257, 
   null, 
   "Redratio1", 
   "What's wrong with the picture is the \"Those we protected against the Soviets\" mentality. North America and western Europe presented a united front to Soviet fascism. Collectively we made it clear that, unlike with the Nazis and their picking off one country at a time, an attack against any member of NATO would be an attack upon all of NATO and all of NATO would respond. It was a partnership and it worked.\n\n \n \n It was a highly unequal partnership. We put our nation on the line to protect Eurpoeans an ocean away, and they couldn't even keep up.", 
   {}, 
   120248, 
   null, 
   1115765400.0
  ], 
  [
   120259, 
   null, 
   "Redratio1", 
   "Real Americans don't vote for appeasers and pacifists. We vote for leaders who believe it is their duty to lead.\n\n \n What BULLSH1T MM.", 
   {}, 
   120256, 
   null, 
   1115765400.0
  ], 
  [
   120271, 
   null, 
   "Big_Bear_Scot", 
   "Clinton was a womanizer who disgraced his office. Carter was a wuss who was afraid of his own shadow. Neither one showed a backbone to protect the country when they were presidents. Neither one could hold a candle to FDR, Truman and JFK. Those were true patriots. The last two Democrats couldn't fight their way out of a paper bag.\n \n \n But he was your commander-in-chief you should support him no matter what, after all Real Americans support their president.", 
   {}, 
   120259, 
   null, 
   1115765940.0
  ], 
  [
   120274, 
   null, 
   "Duo_Maxwell", 
   "MM, why do you support fraud?", 
   {}, 
   120259, 
   null, 
   1115766000.0
  ], 
  [
   120276, 
   null, 
   "Truthsayer", 
   "It was a highly unequal partnership. We put our nation on the line to protect Eurpoeans an ocean away, and they couldn't even keep up.\n\n \n Whereas I don't think Missouri could have possibly stated his opinion any more arrogantly, I do have to agree with him. I don't understand why the US continually bails out Europe and Isreal just to be looked down upon and insulted as they do. I think next time, they should go it on their own. Sink or swim. I do wish them luck however.", 
   {}, 
   120257, 
   null, 
   1115766120.0
  ], 
  [
   120280, 
   null, 
   "Big_Bear_Scot", 
   "It was a highly unequal partnership. We put our nation on the line to protect Eurpoeans an ocean away, and they couldn't even keep up.\n \n \n What do you mean by couldn't keep up ?", 
   {}, 
   120276, 
   null, 
   1115766240.0
  ], 
  [
   120281, 
   null, 
   "Truthsayer", 
   "MM, why do you support fraud?\n\n \n Obviously he does. He comes across to me as a Bush cultist but I could be wrong.", 
   {}, 
   120274, 
   null, 
   1115766240.0
  ], 
  [
   120283, 
   null, 
   "Clive14", 
   "It was a highly unequal partnership...\nAs I said, that's what is wrong with the picture. You (as in a significant portion of the US population) see it as having been an unequal partnership, we (as in a significant portion of the European population) see it as having been an equal partnership. That difference of view is what causes a lot of the problems between the USA and western European nations these days.", 
   {}, 
   120257, 
   null, 
   1115766300.0
  ], 
  [
   120285, 
   null, 
   "Duo_Maxwell", 
   "Obviously he does. He comes across to me as a Bush cultist but I could be wrong.\n\n \n his posts are increasingly relying upon fraud and he doesn't seem to care. Apparently promoting the stereotype that Bush supporters are lying, fradulent, dishonest and all together dubius characters is a good thing to him.", 
   {}, 
   120281, 
   null, 
   1115766360.0
  ], 
  [
   120292, 
   null, 
   "Clive14", 
   "Whereas I don't think Missouri could have possibly stated his opinion any more arrogantly, I do have to agree with him. I don't understand why the US continually bails out Europe and Isreal just to be looked down upon and insulted as they do. I think next time, they should go it on their own. Sink or swim. I do wish them luck however.\nAgain this is the problem: many American people have a very strange view of history in which they \"continually bail[ed] out Europe\". You stuck your noses into WW1, in which there was no \"right\" side, just a bunch of imperial powers having a pointless war, and you joined a large alliance of nations (late) to help beat the Nazis, Italian fascists and Japanese in WW2. Both of these wars were between European Imperial powers, so it was not possible to \"bail Europe out\" in either case. Then there was the Cold War, in which western Europe and North America stood together to face down a common enemy. Again you didn't \"bail us out\" there; you were an ally.\n \n As the Missouri Jackass and others have said, there does appear to be a problem with the quality of education in the USA. History seems to be one of those problem areas.", 
   {}, 
   120276, 
   null, 
   1115766900.0
  ], 
  [
   120296, 
   null, 
   "Missouri Mule", 
   "But he was your commander-in-chief you should support him no matter what, after all Real Americans support their president.\n\n \n Actually, I almost always support the president no matter what party. I take it as a given that they are working with the best and most reliable information and their pay grade requires them to make some very tough decisions. I voted for Carter in 1976 and supported him throughout his presidency. Where I take strong issue with him now is that he cozies up to the likes of Castro and Chavez. I also supported Clinton when he took decisive action in Kosovo. My problem with Clinton was that he could never accept personal responsibility. \n \n The reason that I support Bush as much as I do is that if 9/11 was not the time to do something about terrorism, then we would never have the time. Incidentally, I also believe that Clinton or Carter would also have taken a much more hard line and even a President Gore would have done the same. Presidents have to do what they have to do and as often as not it will not pass muster with European pacifism. To that I say tough ****.", 
   {}, 
   120271, 
   null, 
   1115767320.0
  ], 
  [
   120299, 
   null, 
   "Redratio1", 
   "As I said, that's what is wrong with the picture. You (as in a significant portion of the US population) see it as having been an unequal partnership, we (as in a significant portion of the European population) see it as having been an equal partnership. That difference of view is what causes a lot of the problems between the USA and western European nations these days.\n\n \n I'm talking capabilities and expense, not the \"feeling\" equality.", 
   {}, 
   120283, 
   null, 
   1115767620.0
  ], 
  [
   120300, 
   null, 
   "Missouri Mule", 
   "Obviously he does. He comes across to me as a Bush cultist but I could be wrong.\n\n \n That's nonsense. I didn't even vote for him in 2004. I voted for the Libertarian candidate. And in 2000 I was a McCain supporter and contributed to his campaign. \n \n Whoever is the new president in 2008 I will support him or her as fervently so long as they take strong and decisive action to protect this nation against terrorism. We can't play kissy face with bin Laden and expect him to clean up his act. It would only embolden him. Bush has taken the fight to the terrorists and to his I say \"Bravo.\" We must do whatever is required even if the weak sisters among us are a bawling and a squawling. We didn't win WWII by making nice with Hitler.", 
   {}, 
   120281, 
   null, 
   1115767620.0
  ], 
  [
   120301, 
   null, 
   "Truthsayer", 
   "Again this is the problem: many American people have a very strange view of history in which they \"continually bail[ed] out Europe\". You stuck your noses into WW1, in which there was no \"right\" side, just a bunch of imperial powers having a pointless war, and you joined a large alliance of nations (late) to help beat the Nazis, Italian fascists and Japanese in WW2. Both of these wars were between European Imperial powers, so it was not possible to \"bail Europe out\" in either case. Then there was the Cold War, in which western Europe and North America stood together to face down a common enemy. Again you didn't \"bail us out\" there; you were an ally.\n \n As the Missouri Jackass and others have said, there does appear to be a problem with the quality of education in the USA. History seems to be one of those problem areas.\n\n \n You do raise some good points and we must all admit that the history taught us, ALL OF US, is written by the people who want to sell the books. We tend to read and believe what we are more comfortable believing. That being said, I wouldn't put any more faith into European \"history\" they taught you anymore than I would the American history they taught me. They say that the victor gets to write the history. Look at the Japanese version of WW2 history emoticon_rolleyes for example.\n \n But try as I may, I cannot come up with one graveyard here in America that is full of dead Europeans defending OUR soil.\n \n But I do agree with the part that we we're all allies paddling the same canoe. But who can deny that America had more than it's share of paddles in our collective ocean of wars.\n \n But that is no reason to arrogantly minimalize the efforts of the Europeans during those times as some of my fellow Americans have a tendancy to do.\n \n United, we will all stand a better chance against tyranny. But to come to the defense of an ally, only to be belittled by them, is motivating our national attitude to let them go it on their own from now on. I have no doubt they would suffer a lot more under that type of arrangement that the US would.\n \n But, for what it's worth, contrary to neocon opinion, France was right in not invading Iraq. Defying Bush does NOT equate to defying America. An idea that the neocons can't seem to wrap their minds around.", 
   {}, 
   120292, 
   null, 
   1115767680.0
  ], 
  [
   120304, 
   null, 
   "Big_Bear_Scot", 
   "Actually, I almost always support the president no matter what party. I take it as a given that they are working with the best and most reliable information and their pay grade requires them to make some very tough decisions. I voted for Carter in 1976 and supported him throughout his presidency. Where I take strong issue with him now is that he cozies up to the likes of Castro and Chavez. I also supported Clinton when he took decisive action in Kosovo. My problem with Clinton was that he could never accept personal responsibility.\n \n \n See you disagreed with Clinton on fact that he could not accept person responsibility, some people disagree with Bush because of his policies. Does that make them less American ?\n \n I have not read anything about Carter cosing up to Castro, but I have heard Carter's foundation(or group) oversees elections, which you have to say is in support of democracy.\n \n Also what is wrong the Chavez, he is the Democratically elected leader of Venezuela after all ? I would not put him in same bracket as Castro.\n \n \nBut try as I may, I cannot come up with one graveyard here in America that is full of dead Europeans defending OUR soil.\n \n \n That is because the graves are all in Europe do you think Hitler would have stopped with just Europe, in World War 2 we where all fighting to defend all our respective Countries soil.", 
   {}, 
   120296, 
   null, 
   1115767860.0
  ], 
  [
   120305, 
   null, 
   "Missouri Mule", 
   "Again this is the problem: many American people have a very strange view of history in which they \"continually bail[ed] out Europe\". You stuck your noses into WW1, in which there was no \"right\" side, just a bunch of imperial powers having a pointless war, and you joined a large alliance of nations (late) to help beat the Nazis, Italian fascists and Japanese in WW2. Both of these wars were between European Imperial powers, so it was not possible to \"bail Europe out\" in either case. Then there was the Cold War, in which western Europe and North America stood together to face down a common enemy. Again you didn't \"bail us out\" there; you were an ally.\n \n As the Missouri Jackass and others have said, there does appear to be a problem with the quality of education in the USA. History seems to be one of those problem areas.\n\n \n You have to be kidding. We got into WWII and especially in the European theater after Churchill convinced FDR that we had to do so or Britain would be bankrupted and Hitler would have effectively won WWII. \n \n The trouble with your kind is that you have for a very long time been revising the history books to coincide with your left-wing views. And God Forbid that the United States should be given any credit.", 
   {}, 
   120292, 
   null, 
   1115767860.0
  ], 
  [
   120306, 
   null, 
   "Missouri Mule", 
   "See you disagreed with Clinton on fact that he could not accept person responsibilty, some people disagree with Bush becasue of his policies. Does that make them less American ?\n \n I have not read anything about Carter cosying up to Castro, but I have heard Carter's foundation(or group) oversees elections, which you have to say is in support of democrary.\n \n Also what is wrong the Chavez, he is the Deomocraticaly elected leader of Venuzuala after all ? I would not put him in same bracket as Castro.\n\n \n Think of Chavez as Castro with oil. \n \n As to Clinton, I got behind him when he went to war because I believed then and believe now he did the right thing. A lot of my right wing friends disagreed with me on this issue. I once said on a right wing web site that I was \"proud\" of Clinton and I was nearly banned for saying it. \n \n By and large the U.S. Congress are bought and paid for by special interest money. They'll say most anything but they don't have to put the rubber where it meets the road. Only the president has to do that.", 
   {}, 
   120304, 
   null, 
   1115768040.0
  ], 
  [
   120309, 
   null, 
   "Redratio1", 
   "Think of Chavez as Castro with oil.\n\n \n Big deal. I'm not losing any sleep over it.\n \n btw, news flash, they already have oil.", 
   {}, 
   120306, 
   null, 
   1115768280.0
  ], 
  [
   120310, 
   null, 
   "Truthsayer", 
   "That's nonsense. I didn't even vote for him in 2004. I voted for the Libertarian candidate. And in 2000 I was a McCain supporter and contributed to his campaign. \n \n Pardon me. I stand corrected. \n \n Whoever is the new president in 2008 I will support him or her as fervently so long as they take strong and decisive action to protect this nation against terrorism. \n \n As long as his name isn't Clinton or he is getting his Johnson blown in the Whitehouse like JFK, Clinton, and probably a host of others? \n \n \n We can't play kissy face with bin Laden and expect him to clean up his act. It would only embolden him. Bush has taken the fight to the terrorists and to his I say \"Bravo.\" \n Correction sir....Bush took the fight to Iraq. Which it has been recently revealed by British intelligence and NOT denied yet by Washington, that he intended to go to war with Iraq pre 9/11, terrorism or not. He only manipulated you into supporting his agenda by playing upon your emotions, post 9/11, by twisting it to appear as the war on terrorism. Of course, if you are one who subscribes to the idealogy that all Middle Easterners are terrorists, and those fighting our troops on their soil are terrorists then perhaps you are right....but that's a stretch good sir. \n \n We must do whatever is required even if the weak sisters among us are a bawling and a squawling. We didn't win WWII by making nice with Hitler.\n\n \n Hitler and Saddam are apples and oranges. Saddam is a bad guy, for sure, but there are worse than him out there so why Saddam?", 
   {}, 
   120300, 
   null, 
   1115768340.0
  ], 
  [
   120314, 
   null, 
   "Big_Bear_Scot", 
   "You have to be kidding. We got into WWII and especially in the European theater after Churchill convinced FDR that we had to do so or Britain would be bankrupted and Hitler would have effectively won WWII.\n \n The trouble with your kind is that you have for a very long time been revising the history books to coincide with your left-wing views. And God Forbid that the United States should be given any credit..\n \n \n I would have a better time debating with you MM if you did not fall back to the predictable left wing bash. Just a friendly suggestion MM.What makes you think he is left wing ?\n \n If you remember Britain still had a support of her Commonwealth, our merchant fleet was running the gauntlet of German Subs to keep the UK going, also you underestimate the UK's manufacturing capabilities at the time the UK was pumping out a tremendous amount of Aircraft at time. The Germans could not compete with the amount of Aircraft that we could pump out the factories.\n \n Also the German Fighter Aircraft could not make it very far into the UK, and the bombers had to fly without an escort, how do you think a German Invasion of British Isles would have faired without Air cover ?", 
   {}, 
   120306, 
   null, 
   1115768940.0
  ], 
  [
   120315, 
   null, 
   "Clive14", 
   "You do raise some good points and we must all admit that the history taught us, ALL OF US, is written by the people who want to sell the books. We tend to read and believe what we are more comfortable believing. That being said, I wouldn't put any more faith into European \"history\" they taught you anymore than I would the American history they taught me. They say that the victor gets to write the history. Look at the Japanese version of WW2 history emoticon_rolleyes for example.\nA very valid point. \n \n \nBut try as I may, I cannot come up with one graveyard here in America that is full of dead Europeans defending OUR soil.\nThe nearest to this would be the graves of French (and other anti-English - at the time - European nationals who died helping Americans beat the English to gain their independence. As far as can remember, the USA has fought all of its wars, save its war of independence and civil war, on foreign soil.\n \n \nBut I do agree with the part that we we're all allies paddling the same canoe. But who can deny that America had more than it's share of paddles in our collective ocean of wars.\nYou and Redratio1 may well be right on this point. I'd prefer not to start comparing gross and per capita statistics to demonstrate it one way or the other. Please remember thought that you may have supplied more paddles, but we supplied the canoe. By that I mean that if the Cold War had become a real war, it was European, not American or Russian, soil that would have been the battleground.", 
   {}, 
   120301, 
   null, 
   1115769060.0
  ], 
  [
   120316, 
   null, 
   "Clive14", 
   "...The trouble with your kind...\nAh, you are a stereotyping bigot too. What a surprise emoticon_rolleyes", 
   {}, 
   120305, 
   null, 
   1115769120.0
  ], 
  [
   120317, 
   null, 
   "Truthsayer", 
   "Many points are valid on both sides but at the end of the day all I can come up with is \"United we stand, divided we fall.\" Neocons from either side of the ocean should not be allowed to drive a wedge between our unity. After all, the only thing really dividing us is the ocean. European blood runs in my veins as well as most of my fellow Americans. I can think of no worthier (sp?) ally to keep. It is time to pull us all back together, not drive us further apart. But some people, on both sides, just \"don't get it.\" emoticon_rolleyes", 
   {}, 
   120315, 
   null, 
   1115769360.0
  ], 
  [
   120319, 
   null, 
   "Clive14", 
   "You have to be kidding. We got into WWII and especially in the European theater after Churchill convinced FDR that we had to do so or Britain would be bankrupted and Hitler would have effectively won WWII. \nTHis of course ignores the Soviet efforts of WW2. It is debatable whether Hilter could have beaten the Soviets even if Britian and its commonwealth and empire allies (let alone the USA) hadn't joined the war. \n \n Without US aid, Britain quite possibly would have been invaded by German forces. It is highly debatable though as to whether that occupation would have been long term, or whether we would have been \"liberated\" (in the way eastern Europe was) by the Soviets upon their possible defeat of Hitler.\n \n Such speculation is ultimately pointless. The combined efforts of the allies beat the axis forces in WW2. Speculate upon one part of that alliance being missing ans one gets into a complete \"what if?\" guessing game. To expect part of that alliance to be eternally grateful to another part based on such a guessing game is, quite frankly, childishly pathetic.", 
   {}, 
   120305, 
   null, 
   1115769720.0
  ], 
  [
   120424, 
   null, 
   "SteveRogers", 
   "You work with people with poor self esteem? Well, they tend to take any criticism as picking on them. They want much more credit then they deserve. And they often appear arrogant and childish.\n \n when a segment of a country sufers from poor selfesteem, well, I think we see what we get.", 
   {}, 
   120319, 
   null, 
   1115786820.0
  ], 
  [
   120447, 
   null, 
   "Missouri Mule", 
   "THis of course ignores the Soviet efforts of WW2. It is debatable whether Hilter could have beaten the Soviets even if Britian and its commonwealth and empire allies (let alone the USA) hadn't joined the war. \n \n Without US aid, Britain quite possibly would have been invaded by German forces. It is highly debatable though as to whether that occupation would have been long term, or whether we would have been \"liberated\" (in the way eastern Europe was) by the Soviets upon their possible defeat of Hitler.\n \n Such speculation is ultimately pointless. The combined efforts of the allies beat the axis forces in WW2. Speculate upon one part of that alliance being missing ans one gets into a complete \"what if?\" guessing game. To expect part of that alliance to be eternally grateful to another part based on such a guessing game is, quite frankly, childishly pathetic.\n\n \n Let me just cut to the chase here. There's no \"possible\" about it. Without American Lend Lease Britain was doomed and would have had to reach accomodation with Hitler and there would have been Nazi troops stationed on British soil. There is no question about it. And had we not also assisted the Soviet Union, there is likewise no doubt that the Soviets would have fallen. Hitler didn't follow his general's advice. But in the end it was ONLY because America came to the rescue of Britain and the Soviet Union that Hitler didn't win the war. \n \n Now we are expendable and get kicked in the teeth when we need Europe's support. Why am I not surprised? What has Europe done for America in the last 50 years except to be a thorn in our sides? It was that way when I was stationed in France for three years and DeGaull was running the show. It hasn't changed a bit.", 
   {}, 
   120319, 
   null, 
   1115791740.0
  ], 
  [
   120448, 
   null, 
   "Missouri Mule", 
   "Big deal. I'm not losing any sleep over it.\n \n btw, news flash, they already have oil.\n\n \n That's what I said and that makes him doubly dangerous especially if he gets involved with the terrorists of the world. That makes him even more dangerous than Castro.", 
   {}, 
   120309, 
   null, 
   1115791800.0
  ], 
  [
   120450, 
   null, 
   "Missouri Mule", 
   "I would have a better time debating with you MM if you did not fall back to the predictable left wing bash. Just a friendly suggestion MM.What makes you think he is left wing ?\n \n If you remember Britain still had a support of her Commonwealth, our merchant fleet was running the gauntlet of German Subs to keep the UK going, also you underestimate the UK's manufacturing capabilities at the time the UK was pumping out a tremendous amount of Aircraft at time. The Germans could not compete with the amount of Aircraft that we could pump out the factories.\n \n Also the German Fighter Aircraft could not make it very far into the UK, and the bombers had to fly without an escort, how do you think a German Invasion of British Isles would have faired without Air cover ?\n\n \n Bottom line: Britain was bankrupt when he went with hat in hand to FDR and gave him a 17 page summary of the facts. FDR studied it closely and came to the conclusion we had no choice but to get into the war in spite of the fact that 85% of the American people wanted no part of another European war where American blood would be spilled for yet another generation of ungrateful and obstinate Europeans.\n \n There is no question - none, that Britain could have survived without our assistance. None whatsoever.", 
   {}, 
   120314, 
   null, 
   1115792100.0
  ], 
  [
   120451, 
   null, 
   "Missouri Mule", 
   "Ah, you are a stereotyping bigot too. What a surprise emoticon_rolleyes\n\n \n I just calls 'em like I sees 'em.", 
   {}, 
   120316, 
   null, 
   1115792220.0
  ], 
  [
   120503, 
   null, 
   "Redratio1", 
   "That's what I said and that makes him doubly dangerous especially if he gets involved with the terrorists of the world. That makes him even more dangerous than Castro.\n\n \n ???\n \n Why would he get involved with terrorists? \n \n ???\n \n Is this one of those extended flights of imagination of a series of events constructed to create a viable threat?\n \n Sort of like Saddam and al-Qaeda working together?", 
   {}, 
   120448, 
   null, 
   1115810160.0
  ], 
  [
   120510, 
   null, 
   "Clive14", 
   "Bottom line...\nYou are entitled to your opinion. And I am entitled to consider your opinion to be next to worthless. :p", 
   {}, 
   120450, 
   null, 
   1115812320.0
  ], 
  [
   120529, 
   null, 
   "Eddie", 
   "Let me just cut to the chase here. There's no \"possible\" about it. Without American Lend Lease Britain was doomed and would have had to reach accomodation with Hitler and there would have been Nazi troops stationed on British soil. \n\n \n In the long run, perhaps. But in the same vein, one could claim that US would have been \"doomed\". Hitler actually wanted the britts out of the conflict. If the britts had wanted, they could probably had signed a peace treaty at any point during the war.", 
   {}, 
   120447, 
   null, 
   1115821680.0
  ], 
  [
   120629, 
   null, 
   "Missouri Mule", 
   "In the long run, perhaps. But in the same vein, one could claim that US would have been \"doomed\". Hitler actually wanted the britts out of the conflict. If the britts had wanted, they could probably had signed a peace treaty at any point during the war.\n\n \n Actually, we can agree on this. The U.S. was endangered and would have been completely isolated had Hitler prevailed. No question about that and FDR made that very clear himself to the American people. Hitler's u-boats were regularly seen on the eastern seaboards of the U.S. We would have been a real pickle; no doubt about it.\n \n But I wanted to pin down this argument to one issue and that was this. Britain could not possibly have survived short of U.S. help. \n \n You might want to avail yourself of Hitler's sequel to \"Mein Kampf\" where he makes it clear that the U.S. was his ultimate aim and for reasons not readily apparent.", 
   {}, 
   120529, 
   null, 
   1115831520.0
  ], 
  [
   120632, 
   null, 
   "Redratio1", 
   "Side bar, I wonder who gets money from the sale of Hitler's writings?", 
   {}, 
   120629, 
   null, 
   1115831760.0
  ], 
  [
   120638, 
   null, 
   "Eddie", 
   "@ MM \n \n Do you mean the second part of \"Mein Kampf\"? Or what is this sequel you`ve been talking about?\n \n Edit: I found it on the web. I`ll look into it.", 
   {}, 
   120632, 
   null, 
   1115832120.0
  ], 
  [
   120641, 
   null, 
   "Redratio1", 
   "\n \n Edit: I found it on the web. I`ll look into it.\n\n \n What's it called?", 
   {}, 
   120638, 
   null, 
   1115832300.0
  ], 
  [
   120665, 
   null, 
   "Missouri Mule", 
   "@ MM \n \n Do you mean the second part of \"Mein Kampf\"? Or what is this sequel you`ve been talking about?\n \n Edit: I found it on the web. I`ll look into it.\n\n \n I don't believe it is identified as such and Hitler hid the book away because he didn't want to reveal his true intentions. It has recently come to light and I found it to be most fascinating. There was some question as to its authenticity but that has now been cleared up.", 
   {}, 
   120638, 
   null, 
   1115833140.0
  ], 
  [
   120666, 
   null, 
   "Clive14", 
   "What's it called?\nMein anderes Kampf?", 
   {}, 
   120641, 
   null, 
   1115833140.0
  ], 
  [
   120671, 
   null, 
   "Missouri Mule", 
   "Try this.\n \n DID HITLERISM DIE WITH HITLER? He Meant What He Said by Omer Bartov\n \n Post date 01.23.04 | Issue date 02.02.04\n \n Hitler's Second Book: The Unpublished Sequel to Mein Kampf By Adolf Hitler Edited by Gerhard L. Weinberg (Enigma Books, 293 pp., $32) \n \n Adolf Hitler's so-called second book was not published in his lifetime. Written, as Gerhard Weinberg convincingly speculates, in late June and early July 1928, the book's publication was postponed because Mein Kampf, Hitler's first massive text, was selling very badly and could hardly stand competition with another publication by the same author. Later, after Hitler was appointed chancellor and Mein Kampf became one of the greatest (and allegedly most unread) best-sellers of all times, the second book was apparently seen as disclosing his foreign policy plans too explicitly to allow publication. It was locked away, only to be discovered by Weinberg in 1958. Published in German three years later, the second book came out in a pirated and unreliable English edition in 1962. It is only now that the public can read this text in an authoritative translation, accompanied by extensive and updated notes by Weinberg.\n \n Must we read another ranting book by Hitler? This book is certainly as close to the heart of darkness as a book can be. But it should have been read in its time, and it should be read now. It was an explicit warning to the world of what could be expected from the Führer of what was to become for twelve terrible years the Third Reich. When Hitler wrote it, no one could tell whether his plans and fantasies would ever be transformed into reality. Much of what Hitler put together in this book could already be found in Mein Kampf, if anyone had bothered to read it, and other ideas were expressed unambiguously in his speeches. Yet it was difficult to believe that anyone in his right mind would try to translate such rhetoric into policy. It was generally thought that in power Hitler would be constrained by the realities of diplomacy, the limits of Germany's power, the national interests of the Reich, and the military, economic, and political partners with whom he had to make policy.\n \n Today we know that this was a fatal misunderstanding, rooted more in wishful thinking than in the kind of realism on which contemporary observers prided themselves and expected would eventually keep Hitler, too, in his place. Today we know that Hitler said precisely what he meant to say. We can also note, with the benefit of hindsight, that Hitler was neither insane, nor irrational, nor a fool. Several decades ago A.J.P. Taylor wrote that Hitler may have been mad or criminal as far as his plans and policies for world conquest and genocide were concerned, but in the conduct of his diplomacy in the 1930s he acted very much like everyone else, seizing opportunities and moving gradually toward the goals he had set himself. Reading this second book, I tend to agree. Hitler's rhetoric here is not more empty-headed than that of many of his contemporaries; his use of clichés hardly exceeds what one encountered in the newspapers; his knowledge of history, his psychological observations, his criticism of his rivals, are in many respects typical of his place and time.\n \n But of course Hitler was about much more than this. He was also a pathological mass murderer who caused the death of millions and the destruction of Europe, and so it is important to know that he did precisely what he promised to do. For we still do not seem to have learned a simple crucial lesson that Hitler taught us more definitively than anyone else in history: some people, some regimes, some ideologies, some political programs, and, yes, some religious groups, must be taken at their word. Some people mean what they say, and say what they will do, and do what they said.\n \n Most liberal-minded, optimistic, well-meaning people are loath to believe this. They would rather think that fanaticism is merely an \"epiphenomenal\" façade for politics, that opinions can be changed, that everyone can be corrected and improved. In many cases, this is true--but not in all cases, and not in the most dangerous ones. There are those who practice what they preach and are proud of it. They view those who act otherwise, who compromise and pull back from ultimate conclusions, as opportunists, as weaklings, as targets to be easily conquered and subdued by their own greater determination, hardness, and ruthlessness. When they say they will kill you, they will kill you--if you do not kill them first.\n \n Reading Hitler's second book is useful, of course, for students of Nazism. But they will have already read it in part or in whole, and nothing that Hitler says here will come to them as much of a surprise. This is a book that should be read, rather, by contemporary journalists, political observers, and all concerned people who have the stomach to recognize evil..\n \n (snip)\n \n http://www.freerepublic.com/focus/f-news/1064474/posts\n \n https://ssl.tnr.com/p/docsub.mhtml?i=20040202&s=bartov020204", 
   {}, 
   120666, 
   null, 
   1115833260.0
  ], 
  [
   120678, 
   null, 
   "Eddie", 
   "Mein anderes Kampf?\n\n \n :p Wouldn`t that be Eva Braun`s struggle? :p", 
   {}, 
   120666, 
   null, 
   1115833620.0
  ], 
  [
   120679, 
   null, 
   "Missouri Mule", 
   ":p Wouldn`t that be Eva Braun`s struggle? :p\n\n \n Hardly. Eva Braun was an idiot. I'm surprised she could find her way to the crapper.", 
   {}, 
   120678, 
   null, 
   1115833680.0
  ], 
  [
   120687, 
   null, 
   "Eddie", 
   "Hardly. Eva Braun was an idiot. I'm surprised she could find her way to the crapper.\n\n \n I was refering to the proposed title \"Mein anderes Kampf\", which to me sounds like it would translate to \"The struggle of my significant other\". But my german is not what it used to be :p\n \n And it was all in jest.", 
   {}, 
   120679, 
   null, 
   1115834040.0
  ], 
  [
   120706, 
   null, 
   "Missouri Mule", 
   "I was refering to the proposed title \"Mein anderes Kampf\", which to me sounds like it would translate to \"The struggle of my significant other\". But my german is not what it used to be :p\n \n And it was all in jest.\n\n \n I can't speak German at all, although I am of German ancestry. I'm just a dum 'ol 'merican. \n \n I became acquainted with this book with a recent episode on the History Channel. It detailed the time it was dictated (Hitler couldn't type) and the paper was authenticated and the typewriter that was used for Mein Kampf was the identical one. So there can be little question as to its genuiness.", 
   {}, 
   120687, 
   null, 
   1115834700.0
  ], 
  [
   120709, 
   null, 
   "Eddie", 
   "@ MM\n \n I don`t doubt its authenticity. Me and Clive where just being silly.", 
   {}, 
   120706, 
   null, 
   1115834760.0
  ], 
  [
   120757, 
   null, 
   "Diogenes99", 
   "Bottom line: Britain was bankrupt when he went with hat in hand to FDR and gave him a 17 page summary of the facts. FDR studied it closely and came to the conclusion we had no choice but to get into the war in spite of the fact that 85% of the American people wanted no part of another European war where American blood would be spilled for yet another generation of ungrateful and obstinate Europeans.\n \n There is no question - none, that Britain could have survived without our assistance. None whatsoever.\nThat's what Joe Kennedy (JFK's father, ambassador to Britain up through the beginning of the war) said. Joe came back and reported that the US should forget about doomed Britain, they didn't have a chance. FDR disagreed, and the rest is history.\n \n SOME Europeans fought bravely, others became collaborators. It is the collaborators who seem to have dominated European politics (especially the French) since WWII. In particular, the French have been excluded from NATO military councils since 1966.\n \n \nWhy would he [Chavez] get involved with terrorists?\nBecause he sees himself as a successor to Castro, and more successful.\n \n \nIf the britts had wanted, they could probably had signed a peace treaty at any point during the war.\nVichy Britain? :p", 
   {}, 
   120709, 
   null, 
   1115836560.0
  ], 
  [
   120818, 
   null, 
   "Big_Bear_Scot", 
   "SOME Europeans fought bravely, others became collaborators. It is the collaborators who seem to have dominated European politics (especially the French) since WWII. In particular, the French have been excluded from NATO military councils since 1966.\n \n \n Did France not withdraw from NATO councils, I am sure it was when DeGaulle became the President for the 2nd time because he wanted to preserve French Military Identity not because they where excluded. \n \n So you would disregard the sacrifice of the French resistance and the free French Army(led by DeGualle) ?\n \n \nVichy Britain\n \n \n It could have happened. \n If I remember correctly some of the Royal Family favoured suing for peace with Germany, also we had a lot of problems with fascist political parties such Mosleys Black Shirts and also Hitler seen us as Ayran brothers who he could deal with.\n \n He didn't count on the leadership of Churchill and fact the British people did not want to live under fascist rule.", 
   {}, 
   120757, 
   null, 
   1115839500.0
  ], 
  [
   121023, 
   null, 
   "Diogenes99", 
   "Did France not withdraw from NATO councils, I am sure it was when DeGaulle became the President for the 2nd time because he wanted to preserve French Military Identity not because they where excluded.\nIt was because NATO secrets were falling into Soviet hands as soon as they fell into French hands. A little experiment showed that when the French didn't get the secrets, the Soviets didn't get them either. The conclusion was obvious.\n \n \nSo you would disregard the sacrifice of the French resistance and the free French Army(led by DeGualle) ?\nI do not disregard the courage of the French resistance. DeGaulle had such a colossal ego he could not distinguish himself from France and, being badly in need of a hero, the French accepted his seriously overestimated self-importance. DeGaulle was even able to con Churchill into pretending that the French had participated in the war, and he got a seat on the UN Security Council as a result. In retrospect, that was a big mistake.\n \n \nIf I remember correctly some of the Royal Family favoured suing for peace with Germany, also we had a lot of problems with fascist political parties such Mosleys Black Shirts and also Hitler seen us as Ayran brothers who he could deal with.\nAgreed. Every country has citizens with the souls of slaves.\n \n \nHe didn't count on the leadership of Churchill and fact the British people did not want to live under fascist rule.\nAgreed again. Fortunately, most countries have more citizens who prefer to live free.", 
   {}, 
   120818, 
   null, 
   1115858880.0
  ], 
  [
   121025, 
   null, 
   "Redratio1", 
   "It was because NATO secrets were falling into Soviet hands as soon as they fell into French hands. A little experiment showed that when the French didn't get the secrets, the Soviets didn't get them either. The conclusion was obvious.\n\n \n LOL, Ah the reliable French.", 
   {}, 
   121023, 
   null, 
   1115859000.0
  ], 
  [
   121034, 
   null, 
   "Big_Bear_Scot", 
   "It was because NATO secrets were falling into Soviet hands as soon as they fell into French hands. A little experiment showed that when the French didn't get the secrets, the Soviets didn't get them either. The conclusion was obvious.\n \n \n I haven't heard that story, you have to remember that during the Cold War even the US had double agents, where US secrets would fall into Soviet hands. I wouldn't say that that the US was working with Soviets during the Cold War , would I ?\n \n Also De Gaulle was very anti-communist, he was a nationalist who hated foreign involvement in France. In fact I am pretty much sure he carried out a McCarthy style witch hunt of Communists in the French Government. \n \n It wasn't until De Gaulle left power in the late 60s(after the French left the NATO council) that they had closer link with the USSR when the Socialist came to power. The Socialist where walking a tight rope between the East and West trying to remain neutral, but the French at the time had better relations with USSR than any other time in its history.\n \n \nLOL, Ah the reliable French.\n \n \n I really don't understand this hostility to France, is it because of the Iraq War or something ?", 
   {}, 
   121025, 
   null, 
   1115860020.0
  ], 
  [
   121040, 
   null, 
   "Redratio1", 
   "\n I really don't understand this hostility to France, is it because of the Iraq War or something ?\n\n \n Starts at WW2, through DeGaull, to my personal dislike for Chirac personally.\n \n The French have continually been a wrench in trans-Atlantic ties. From the start to this very day. Their hostility toward the USA and their contempt for other Europeans ticks me off.", 
   {}, 
   121034, 
   null, 
   1115860740.0
  ], 
  [
   121048, 
   null, 
   "Big_Bear_Scot", 
   "Starts at WW2, through DeGaull, to my personal dislike for Chirac personally.\n \n The French have continually been a wrench in trans-Atlantic ties. From the start to this very day. Their hostility toward the USA and their contempt for other Europeans ticks me off.\n \n \n But is that a reason to hate a whole nation ? I hate Chirac as much as the next person, but I will not hate a whole nation because of their choice of President or their foreign policies. If that was the case I would probably hate every nation on Earth even my own :)", 
   {}, 
   121040, 
   null, 
   1115860980.0
  ], 
  [
   121084, 
   null, 
   "gnojek", 
   "Did no one notice that the article was written by Pat Sajak of all people.\n \n Come on, seven pages arguing an article written by the host of Wheel of Fortune.\n \n Give me a break!", 
   {}, 
   120679, 
   null, 
   1115864640.0
  ], 
  [
   121092, 
   null, 
   "Redratio1", 
   "Did no one notice that the article was written by Pat Sajak of all people.\n \n Come on, seven pages arguing an article written by the host of Wheel of Fortune.\n \n Give me a break!\n\n \n I know, I'd rather hear from Vanna White.", 
   {}, 
   121084, 
   null, 
   1115866200.0
  ], 
  [
   121123, 
   null, 
   "daewoo", 
   "Did no one notice that the article was written by Pat Sajak of all people.\n \n Come on, seven pages arguing an article written by the host of Wheel of Fortune.\n \n Give me a break!\n\n \n Its Humaneventsonline. Look through some of their other authors. Pat Sajak is one of their better ones. Sure, he is a college dropout with no real qualifications to comment on anything, but he is famous and was on TV, which obviously means his opinion should count, right (end sarcasm).", 
   {}, 
   121084, 
   null, 
   1115871480.0
  ], 
  [
   121139, 
   null, 
   "Voice Of Reason", 
   "Isn't this really what is going on here? The hatred for America and Bush trumps everything else. Am I wrong?\n ===========================\n \n Rooting Against America\n \n by Pat Sajak\n Posted May 9, 2005 \n \n A distasteful glee emanates from the Left upon the arrival of any bad news from the Middle East. It's as if they are saying, \"So, W, where is all the Democracy we're supposed to be spreading through the area? See, we were right, and you were wrong. And deceitful. And dumb.\" And as bad news is welcomed as an indictment of the President and his policies, good news (and there has been plenty) must be minimized or ignored.\n \n It's one thing to oppose an Administration's foreign policy, but it's another to publicly gloat over and appear to smugly enjoy any of its setbacks. The long tradition of a Loyal Opposition in this country now appears to be an old-fashioned notion. There may have been widespread resistance to America's entry into World War II, but once we were in it, there wasn't much doubt about whom Americans were pulling for...\n \n (Snip)\n \n http://www.humaneventsonline.com/article.php?id=7389\n\n \n I apologize for getting in so late on this one.............that said\n \n \n MM, the irony of the situation is the left and the Bush haters have to hope that things go bad in Iraq and the middle east even if it means that our brave men in combat have to die and take casualties........I was never a big fan of Clinton but I could never take that tact no matter how I thought he disgraced this country and the offfice of the presidency.......", 
   {
    "unicode_changes_made": true
   }, 
   119165, 
   null, 
   1115872440.0
  ], 
  [
   121142, 
   null, 
   "Redratio1", 
   "But is that a reason to hate a whole nation ? I hate Chirac as much as the next person, but I will not hate a whole nation because of their choice of President or their foreign policies. If that was the case I would probably hate every nation on Earth even my own :)\n\n \n I don't hate the whole country. Even though I found Parisians some of the rudest people I've ever met. LOL! Beautiful city though.", 
   {}, 
   121048, 
   null, 
   1115873040.0
  ], 
  [
   121193, 
   null, 
   "Missouri Mule", 
   "I don't hate the whole country. Even though I found Parisians some of the rudest people I've ever met. LOL! Beautiful city though.\n\n \n I couldn't agree more. The French are the rudest people in the world, hands down. They hate everyone, including themselves. I spent three years there. Paris in indeed a beautiful city but the French are in a class by themselves. And I don't know why. I guess it must be in the water. I didn't find it anywhere else in Europe. Beats the hell out of me. They say that France would be wonderful if not for the French. So true. So true.\n \n And I'm one of the biggest fans in the world of the Tour de France. I wish we had something approaching it.", 
   {}, 
   121142, 
   null, 
   1115877300.0
  ], 
  [
   121195, 
   null, 
   "Missouri Mule", 
   "I apologize for getting in so late on this one.............that said\n \n \n MM, the irony of the situation is the left and the Bush haters have to hope that things go bad in Iraq and the middle east even if it means that our brave men in combat have to die and take casualties........I was never a big fan of Clinton but I could never take that tact no matter how I thought he disgraced this country and the offfice of the presidency.......\n\n \n I felt the same way about Clinton. The economic times were good and he was a great communicator. I always gave him the benefit of the doubt on foreign policy and believed him for the most part. With Monicagate it was a downhill road although I always hung tough with him on foreign policy. I was nearly thrown off the Free Republic site when I said I was proud of Clinton for his Kosovo policy.", 
   {}, 
   121139, 
   null, 
   1115877480.0
  ], 
  [
   121200, 
   null, 
   "Redratio1", 
   "I couldn't agree more. The French are the rudest people in the world, hands down. They hate everyone, including themselves. I spent three years there. Paris in indeed a beautiful city but the French are in a class by themselves. And I don't know why. I guess it must be in the water. I didn't find it anywhere else in Europe. Beats the hell out of me. They say that France would be wonderful if not for the French. So true. So true.\n \n\n \n LOL, so it wasn't just my family that got the Royal Paris treatment! emoticon_frazzled \n \n As soon as we went into Germany everyone was friendly again...go figure.", 
   {}, 
   121193, 
   null, 
   1115878020.0
  ], 
  [
   121225, 
   null, 
   "Missouri Mule", 
   "LOL, so it wasn't just my family that got the Royal Paris treatment! emoticon_frazzled \n \n As soon as we went into Germany everyone was friendly again...go figure.\n\n \n I think it is a classic case of projection. They failed in two world wars and especially in WWII by being such cowards that they are ashamed of themselves. But being unwilling to look in the mirror they blame America. I experienced this in 1962-65 only 17 years after WWII. I wondered at the time what was going on. But I have heard it from everyone else who has visited there. So it is not us. It's the French.", 
   {}, 
   121200, 
   null, 
   1115880960.0
  ], 
  [
   121593, 
   null, 
   "Diogenes99", 
   "Our Oldest Enemy : A History of America's Disastrous Relationship with France.\n \n As a sideshow to their own war with Britain, monarchist France helped the US win independence. Ever since the French Revolution, France has often been a foe and - at best - an uncertain ally, faithfully by our side every time they need us.", 
   {}, 
   121225, 
   null, 
   1115925720.0
  ], 
  [
   121694, 
   null, 
   "SteveRogers", 
   "I felt the same way about Clinton. The economic times were good and he was a great communicator. I always gave him the benefit of the doubt on foreign policy and believed him for the most part. With Monicagate it was a downhill road although I always hung tough with him on foreign policy. I was nearly thrown off the Free Republic site when I said I was proud of Clinton for his Kosovo policy.\n\n \n You sound like a good little communist. Nationalism, for the mother land, must run deep in you. Sorry to hear that.", 
   {}, 
   121195, 
   null, 
   1115934120.0
  ], 
  [
   122442, 
   null, 
   "gnojek", 
   "LOL, so it wasn't just my family that got the Royal Paris treatment! emoticon_frazzled \n \n As soon as we went into Germany everyone was friendly again...go figure.\n\n Hmm. I had a friend go to Dusseldorf and she said that most people were stuck up. Not rude, just \"better\" than you.", 
   {}, 
   121200, 
   null, 
   1116034800.0
  ], 
  [
   122443, 
   null, 
   "Eddie", 
   "Hmm. I had a friend go to Dusseldorf and she said that most people were stuck up. Not rude, just \"better\" than you.\n\n \n I don`t know. I`ve lived there for a short while (Dusseldorf). I found people quite friendly... Perhaps it`s americans who get looked down on.. Or perhaps she had bad luck/me had good luck...", 
   {}, 
   122442, 
   null, 
   1116035040.0
  ], 
  [
   124676, 
   null, 
   "Clive14", 
   "LOL, so it wasn't just my family that got the Royal Paris treatment! emoticon_frazzled \n \n As soon as we went into Germany everyone was friendly again...go figure.\nI suspect a lot of the feelings of rudeness are due to differences in culture. I have a friend from Spain who thought people were making fun of her in shops when she came to England due to the amount of pleases and thankyous involved in even a simple transaction. I felt the Spanish were rude in shops for the opposite reason as they never seem to use por favor or gracias. I worked for a time in Bremen in Germany and found the older people there downright hostile and the younger ones friendly. In France, the key is to attempt to speak French. The Frence people are proud of their language. If you do not bother, they will not bother with you and will be rude. If you do try, they will normally be friendly (and will hurredly remember how to speak English themselves in order to avoid hearing an Englishman ruin their beautiful language with his awful accent ;)).\n \n Having said all that, Paris stands out as an oddity. They really do seem to be rude to everyone, including themselves. Again it's likely a culture thing: non Parisians (whether French or foreign) simply miss the subtleties of their politeness. Or they might just be very rude people :)", 
   {}, 
   121200, 
   null, 
   1116448680.0
  ], 
  [
   124710, 
   null, 
   "Missouri Mule", 
   "You sound like a good little communist. Nationalism, for the mother land, must run deep in you. Sorry to hear that.\n\n \n I have no clue what on earth you are talking about.", 
   {}, 
   121694, 
   null, 
   1116454380.0
  ], 
  [
   124906, 
   null, 
   "SteveRogers", 
   "I have no clue what on earth you are talking about.\n\n \n I know you don't. But when you espouse supporting my president no matter what and going with this war and the torture no matter what, and rant against self assessment and blame everyone but the US, well, you sound just like those good little communists I was taught to dislike as a child. You are simply repeating the motherland propaganda without any critical thought.\n \n In essence, you really are what you dislike -- a little communist. Not in a political way, but in the mentality needed to be a communist. In order words, you think like one. \n \n I draw your attention to so that you might see how you and Bush supporters really look like and what you are really doing. But don't worry, I won't send a bill for the insight.", 
   {}, 
   124710, 
   null, 
   1116477480.0
  ], 
  [
   124982, 
   null, 
   "georged", 
   "I know you don't. But when you espouse supporting my president no matter what and going with this war and the torture no matter what, and rant against self assessment and blame everyone but the US, well, you sound just like those good little communists I was taught to dislike as a child. You are simply repeating the motherland propaganda without any critical thought.\n \n In essence, you really are what you dislike -- a little communist. Not in a political way, but in the mentality needed to be a communist. In order words, you think like one. \n \n I draw your attention to so that you might see how you and Bush supporters really look like and what you are really doing. But don't worry, I won't send a bill for the insight.\n\n \n Individual, rational thinking doesn't mix with this administration's supporters. Propaganda using fear stirred into some cooked numbers covered with patriotic slogans is apparently all they require for their marching orders.", 
   {}, 
   124906, 
   null, 
   1116519060.0
  ], 
  [
   125001, 
   null, 
   "daewoo", 
   "Individual, rational thinking doesn't mix with this administration's supporters. Propaganda using fear stirred into some cooked numbers covered with patriotic slogans is apparently all they require for their marching orders.\n\n \n Isn't neo fascim ugly?", 
   {}, 
   124982, 
   null, 
   1116521520.0
  ], 
  [
   125024, 
   null, 
   "georged", 
   "Isn't neo fascim ugly?\n\n \n But easy to govern using simple, deceptive formulas.", 
   {}, 
   125001, 
   null, 
   1116523800.0
  ], 
  [
   125035, 
   null, 
   "daewoo", 
   "But easy to govern using simple, deceptive formulas.\n\n \n Turn off brain...wave flag...repeat", 
   {}, 
   125024, 
   null, 
   1116525060.0
  ], 
  [
   125243, 
   null, 
   "Diogenes99", 
   "But easy to govern using simple, deceptive formulas.\n ...\n Turn off brain...wave flag...repeat\nYou're talking about Clinton's adventure into Kosovo, right?", 
   {}, 
   125024, 
   null, 
   1116543480.0
  ], 
  [
   125283, 
   null, 
   "SteveRogers", 
   "You're talking about Clinton's adventure into Kosovo, right?\n\n \n Good effort at diversion, but no. Clinton actually made a case and republicans opposed it as I recall. \n \n SO, can Bush's argument stand on it's own, or should we call Clinton back to be president?", 
   {}, 
   125243, 
   null, 
   1116545940.0
  ], 
  [
   125365, 
   null, 
   "gnojek", 
   "I don`t know. I`ve lived there for a short while (Dusseldorf). I found people quite friendly... Perhaps it`s americans who get looked down on.. Or perhaps she had bad luck/me had good luck...\n\n Well, she went to meet some family, so maybe it was just her family looking down on the american kin. every german I've ever met was really nice. every french person I've met was nice, so...whatever...", 
   {}, 
   122443, 
   null, 
   1116554460.0
  ], 
  [
   125381, 
   null, 
   "Voice Of Reason", 
   "Here is the irony for our left wing liberal friends.........In the U.S. although they insist everything in this country is going to hell in a handbasket, Conservatives control the presidency, both houses of Congress, most governorships and arguebly the U.S. Supreme Court.....\n \n The liberal press kept coming out prior to the 2004 elections with polls saying how bad things were with the economy and everything else in this country as well as how bad things were in Iraq.........Results are this President was elected by a margin of over 3,000,000 votes..........\n \n The left wing liberals just do not get it that the silent majority in this country are moderates and consevatives........That is why they hate to be addressed as liberals even though they know that is what they are..........\n \n There only hope is to be negative about everything........They have to hope the economy tanks and everything else goes bad in this country.......They have to hope that things go bad in Iraq, even if it means more U.S. casualties.........\n \n In all my 67 years I have never seen it like this..........The hate for this president........I was no Clinton fan.I thought by his actions he disgraced the office of the presidency, but i did not hate the man.........Even supported him in Bosnia..........\n \n The Liberals keep crying and the Conservatives keep winning elections and widening their lead in the House and Senate..........\n \n The Liberals have no answer except to hate President Bush.............\n \n Its a great time to be a Conservative.............. emoticon_xhoho", 
   {}, 
   125365, 
   null, 
   1116557760.0
  ], 
  [
   125384, 
   null, 
   "SteveRogers", 
   "VoR, when was your last drug test? emoticon_wow", 
   {}, 
   125381, 
   null, 
   1116558600.0
  ], 
  [
   125392, 
   null, 
   "Voice Of Reason", 
   "VoR, when was your last drug test? emoticon_wow\n\n \n The truth hurts doesn't it Steve........... :)", 
   {}, 
   125384, 
   null, 
   1116559440.0
  ], 
  [
   125393, 
   null, 
   "georged", 
   "\n \n Its a great time to be a Conservative.............. emoticon_xhoho\n\n \n Or retired military lifer snapping to attention because the military is now engaged? You might consider taking a close look at your hindered definition of patriot.", 
   {}, 
   125381, 
   null, 
   1116559440.0
  ], 
  [
   125411, 
   null, 
   "Voice Of Reason", 
   "Or retired military lifer snapping to attention because the military is now engaged? You might consider taking a close look at your hindered definition of patriot.\n\n \n Hey I know what a patriot is, make no mistake about that......Yeah I was a lifer or a career navy man and very proud of my service to my country..............You got something against the U.S. Military?", 
   {}, 
   125393, 
   null, 
   1116562560.0
  ], 
  [
   125418, 
   null, 
   "Duo_Maxwell", 
   "First of all, you're not conservative VOR, in fact you have supported a number of blnatantly anti-conservative measures and supporting a party that has virtually gone out of its way to ensure conservatism is removed from the political structure.", 
   {}, 
   125411, 
   null, 
   1116563700.0
  ], 
  [
   125430, 
   null, 
   "SteveRogers", 
   "The truth hurts doesn't it Steve........... :)\n\n \n ABout you and drugs? emoticon_confused Can't say it hurts me at all. How about you? emoticon_xdonno", 
   {}, 
   125392, 
   null, 
   1116566340.0
  ], 
  [
   142879, 
   null, 
   "PoohBear", 
   "The point is that Bush is not wrong. How many attacks have occurred on U.S. soil since 9/11? If we had all of this hand wringing in WWII we would now be speaking German.\n\n \n i totally agree. ush made the righ decision its jst that the media is telling us all the bad things that are happeneing. poeple are too ignorant to go find out if its true or not! emoticon_idea", 
   {
    "post_info": {
     "post_title": "Go Bush!"
    }
   }, 
   119506, 
   null, 
   1120110360.0
  ], 
  [
   143005, 
   null, 
   "Alan Ryan", 
   "Only a fool or a thug could support absolutely everything in a party political program. Total commitment to a cause is usually a death warrant for the possibility of common sense.", 
   {}, 
   142879, 
   null, 
   1120145400.0
  ], 
  [
   143007, 
   null, 
   "georged", 
   "Only a fool or a thug could support absolutely everything in a party political program. Total commitment to a cause is usually a death warrant for the possibility of common sense.\n\n \n Common sense is often a missing factor in public political support, emotion being much easier to manipulate.", 
   {}, 
   143005, 
   null, 
   1120145700.0
  ], 
  [
   143012, 
   null, 
   "Alan Ryan", 
   "Common sense is often a missing factor in public political support, emotion being much easier to manipulate.\n\n \n What some people fail to understand is that it is often necessary to \"root against\" the perceived \"national interest\" (in a principled attack) if the ideals of democracy are to be protected.", 
   {}, 
   143007, 
   null, 
   1120146480.0
  ], 
  [
   143037, 
   null, 
   "georged", 
   "What some people fail to understand is that it is often necessary to \"root against\" the perceived \"national interest\" (in a principled attack) if the ideals of democracy are to be protected.\n\n \n Using the USA as an example, I feel the fear factor (terrorism) currently being used as a primary political platform generates enough blind nationalism (emotion) to act as a siege mentality in allowing the mistakes of Iraq, fiscal irresponsibility and belief system morality within government to be politically exploited at an almost unlimited pace.\n \n When I read posts by those supporting current US leadership, their comments are a 'package' deal; full, unquestioned support of all US policies with a trickle of 'we are spending too much money' but with end justifying the means rationale. Those posting questions and disagreement with current US policy direction, loss of civil rights, fiscal irresponsibility, trade isolationism and imposing our ideology on another sovereign nation using force are instantly labeled un-American, unpatriotic and dismissed as unjustified dissenters. Hermann Goering's post-WW2 comments regarding leadership immediately come to mind. \n \n I view most of those reactions as not only a lack of common sense, but a strong indication that our educational system is failing to educate our populace in the principles of democracy. Or is that intentional?", 
   {}, 
   143012, 
   null, 
   1120150080.0
  ], 
  [
   143047, 
   null, 
   "Alan Ryan", 
   "\n When I read posts by those supporting current US leadership, their comments are a 'package' deal; full, unquestioned support of all US policies with a trickle of 'we are spending too much money' but with end justifying the means rationale. Those posting questions and disagreement with current US policy direction, loss of civil rights, fiscal irresponsibility, trade isolationism and imposing our ideology on another sovereign nation using force are instantly labeled un-American, unpatriotic and dismissed as unjustified dissenters. Hermann Goering's post-WW2 comments regarding leadership immediately come to mind. \n\n \n I believe you refer to Goering's cynical observations on how easy it is to convince people of the need for war; and how (most) people can be brought to do the bidding of leaders - at the same time denouncing dissenters as feeble pacifists who lack patriotism ?\n \n \nI view most of those reactions as not only a lack of common sense, but a strong indication that our educational system is failing to educate our populace in the principles of democracy. Or is that intentional?\n\n \n I would not quarrel with your general criticisms of the \"package deal\", bogus opinions, and lack of common sense that some posters bring to the forum: but I think there are a few mavericks who have views that cannot be predicted in advance.", 
   {}, 
   143037, 
   null, 
   1120151340.0
  ], 
  [
   143052, 
   null, 
   "georged", 
   "I believe you refer to Goering's cynical observations on how easy it is to convince people of the need for war; and how (most) people can be brought to do the bidding of leaders - at the same time denouncing dissenters as feeble pacifists who lack patriotism ?\n \n\n \n Yes. Considering how he lived the later part of his life, I also find it ironic that particular statement will probably be his epitaph.", 
   {}, 
   143047, 
   null, 
   1120152120.0
  ], 
  [
   143359, 
   null, 
   "PoohBear", 
   "emoticon_idea \nThat's nonsense. I didn't even vote for him in 2004. I voted for the Libertarian candidate. And in 2000 I was a McCain supporter and contributed to his campaign. \n \n Whoever is the new president in 2008 I will support him or her as fervently so long as they take strong and decisive action to protect this nation against ism. We can't play kissy face with bin Laden and expect him to clean up his act. It would only embolden him. Bush has taken the fight to the ists and to his I say \"Bravo.\" We must do whatever is required even if the weak sisters among us are a bawling and a squawling. We didn't win WWII by making nice with .\n\n \n i totally agree with you. even if its a ranting lunatic i will support him if i can walk down the street and not have the fear of being blown up. now who wants to vote in some insane guy who will put our country in dager?? only some mentally disturbed midget.", 
   {
    "post_info": {
     "post_title": "lunatic supporter"
    }
   }, 
   120300, 
   null, 
   1120188960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Rooting Against America", 
  "url": "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5129, 
  "discussion_files": [
   [
    "25794.html", 
    "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america-print.html"
   ], 
   [
    "25795.html", 
    "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america-10-print.html"
   ], 
   [
    "25796.html", 
    "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america-8-print.html"
   ], 
   [
    "25797.html", 
    "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america-6-print.html"
   ], 
   [
    "25798.html", 
    "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america-4-print.html"
   ], 
   [
    "25799.html", 
    "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america-5-print.html"
   ], 
   [
    "25800.html", 
    "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america-7-print.html"
   ], 
   [
    "25801.html", 
    "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america-9-print.html"
   ], 
   [
    "25802.html", 
    "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america-3-print.html"
   ], 
   [
    "25803.html", 
    "http://www.4forums.com/political/peace-middle-east/5129-rooting-against-america-2-print.html"
   ]
  ], 
  "identifier": 5129
 }
]