[
 [
  [
   120029, 
   null, 
   "inmyopinion", 
   "I find Social Security to be a truly different \"ball game\". \n \n Of my 3 kids, all 3 (in their 20's) want the privitization. Why? because out of 4 grandparents, only one grandfather lived to 62 to collect. Great grandparents were never covered: 4 self-emolyed, 2 housewives and, 1 died and the last wasn't entitled on his job Add in my Soninlaw, and his Dad died at 45.( His mother collects widow's; she never worked) So, of 6 grandparents, 4 never collected. These kids want to know they can control their money, somewhat. All are very conservative and frugal. They want to be able to \"rtake it with them\" . I want to know where their money paid in by my family went.....\n \n I became disabled in my mid 50's. [Don't want to be home, have to be home. Don't want to collect, but I lost 20% of my pension ( which is decent) on \"early retirement\". I can't collect anything off 401k's until I am 59 1/2 ( a few years), or I will pay penalty taxes.]\n \n Everything is relative to your situation.", 
   {
    "post_info": {
     "post_title": "And, What if no one ever collects who is in your family?"
    }
   }, 
   null, 
   null, 
   1115741400.0
  ], 
  [
   120291, 
   null, 
   "Duo_Maxwell", 
   "Is it really going to matter? If your kids want to privatize tell them to open a 401k. At least that will be free from Gov't taxation better then other sources of capital and savings. \n \n If the privaization plan goes through, one, we'll either have a huge debt three times or more what we have now, or we'll have huge taxes. I'm not sure which is worse. A huge debt and deficit will lead to crowding out and other economic problems. If that occurs, it's like the dollar will devalue. At least in 401ks the money is safer then in a gov't private account. I'm sure you can figure out what high taxes will do. If they were really smart, they would open a account in a foregin nation and exchange money into a more stable, less debt ratio backed currency.\n \n I see a bailout comming, and soon if the private accounts go through. \n Private or not, the whole thing is a giant scam. \n \n Your kids should want to kill it rather then support a ponzi scheme.", 
   {}, 
   120029, 
   null, 
   1115766780.0
  ], 
  [
   120953, 
   null, 
   "inmyopinion", 
   "Just for curiosity, where do you 2 ( or is it one brain?_ put your $$$$?", 
   {}, 
   120291, 
   null, 
   1115851260.0
  ], 
  [
   120954, 
   null, 
   "inmyopinion", 
   "Just for the record, where do you 2 (or one brain?) save your millions?", 
   {}, 
   120291, 
   null, 
   1115851320.0
  ], 
  [
   120960, 
   null, 
   "Duo_Maxwell", 
   "Well, i'm not in the position where I have alot (or any) money to put away. But if I did, I wouldn't put the money away in a fund. I'd invest. Buy land. Land has almost always since the dawn of time been a wise and lucrative investment. \n \n Also, if I had guts I would prepare to short sell Google. That company has no business at the stock price it's at now. It's so incredibly overvalued. All Google is is a bunch of servers. When that stock falls, it's going to fall like a tank dropped from a aircraft with no parachute. I wish I could have done that with Enron or Worldcom. Then I could retire at my age. \n \n Still though, everyone who can should open a 401k. At least you have control over it rather then the gov't and if SS does collapse, your funds are relatively safe (assuming the stock market doesn't tank as well). The amount of consumer confidance that would be lost from the SS tanking is something I really don't want to think about. The pension fund of millions of Americans suddenly disappearing. emoticon_wow Foreign stock exchanges wouldn't be safe either as such a ripple in the American stock system would invariabally hurt them as well. This interconnected global economy is a blessing and a curse. \n \n I understand finance decently, I'm just not in the position to utilize most of it. That will change soon though. :)", 
   {}, 
   120954, 
   null, 
   1115852040.0
  ], 
  [
   121495, 
   null, 
   "inmyopinion", 
   "You missed, in my first post, that I do have 401K's (you just don't access until at least 59 1/2 so as to not pay penalties). Also, my pension is a public one, and held separate from others in my state (a good thing and excellently invested), so I doubt it will go anywhere soon.", 
   {}, 
   120960, 
   null, 
   1115921400.0
  ], 
  [
   121772, 
   null, 
   "Duo_Maxwell", 
   "Do you have another source of income? \n As I recall you can withdraw from the 401k without penalities if it is a \"hardship withdraw\"\n \n Anyways, your kids should either open a 401k or a account in a less debt backed nation and transfer money over also they should file the forms to opt-out of SS.", 
   {}, 
   121495, 
   null, 
   1115944020.0
  ], 
  [
   259168, 
   null, 
   "BeHereNow", 
   "OASDI. \n That is the original name of \"Social Security\".\n Old Age, Survivors, and Disability Insurance. Please notice that last word.\n \n Can I assume your children will not want to buy fire insurance, if none of their relatives collected?\n \n Would they rather do without FDIC, since none of their relative have benefited from FDIC?\n \n Insurance is mostly money down a rat hole, until you need it. \n Then you collect from the payments made by others.\n Social Security was not meant to be a retirement system, regardless of the actions of some persons.", 
   {
    "unicode_changes_made": true
   }, 
   121772, 
   null, 
   1176842940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  And, What if no one ever collects who is in your family?", 
  "url": "http://www.4forums.com/political/social-security-debates/5144-what-if-no-one-ever-collects-who-your-family.html", 
  "breadcrumbs": [
   "Social Security"
  ], 
  "id_number": 5144, 
  "discussion_files": [
   [
    "23898.html", 
    "http://www.4forums.com/political/social-security-debates/5144-what-if-no-one-ever-collects-who-your-family-print.html"
   ]
  ], 
  "identifier": 5144
 }
]