[
 [
  [
   120181, 
   null, 
   "Truthsayer", 
   "Can anyone name the first diety that had the following myths attributed to him/her?\n \n Virgin birth\n Twelve followers\n Killing and resurrection\n Miracles\n Birthdate on December 25\n Morality\n Mankind's savior\n Known as the Light of the world\n \n If you said Jesus..... you haven't been paying attention and will believe anything anyone tells you.\n \n The answer is Mithra. A Roman religion that predates christianity by centuries. In other words, Christianity was a knock off religion. A religion invented on the foundation of other mythical religions. So when the religious nuts try to validate their superstitions by the authority of the bible and all that Jesus smack, I am quick to remember that their basis of knowlege is built on a false, second hand foundation that is no more legitimate than the Mithra religion was, 600-1200 BC.\n \n PS....there are a lot more \"gods\" that also claim virgin birth. Curious minds should look it up. Look at all the \"borrowed\" myths that some of today's religious people swear by. You'd be amazed how unoriginal the christian religion really is. (Lazy minds, just keep up what you are already doing zzzzzzzzzzzzzzzzzzzzzzzz.......)\n \n If it weren't for the Emperor Constantine and his mother, you Jesus freaks would have a \"Mithra is my co-pilot\" bumper sticker on your car and no one would have ever heard of Jesus Christ. :p :p \n \n But I do admit it's kinda nice having a Santa Claus for adults. Of course, it's harder to believe in Santa Claus the older one gets. Except for some.", 
   {
    "post_info": {
     "post_title": "Name that God...."
    }
   }, 
   null, 
   null, 
   1115756700.0
  ], 
  [
   120194, 
   null, 
   "unkerpaulie", 
   "im very interested in this kind of information. do you have any links that show more on the crossover traditions of ancient religions into modern ones?", 
   {}, 
   120181, 
   null, 
   1115758560.0
  ], 
  [
   120198, 
   null, 
   "Truthsayer", 
   "im very interested in this kind of information. do you have any links that show more on the crossover traditions of ancient religions into modern ones?\n\n \n This information is all out there but be forewarned, education is a bad thing in matters of faith. What kid enjoys realizing there is no Santa? People with blinders on never bother to even look.\n \n Just hit Google. Type in \"Mithra.\" Type in \"religious myths\" and superstitions....there will be plenty of info pop up. But don't just assume all of it is accurate. Anything that involves your spiritualy deserves research, unless you are one of the lazy ones who have the \"God said it, I believe it, that settles it!\" bumper sticker on their foreheads.\n \n I recommend reading \"The Hiram Key.\" It's a book of research so it can be rather boring but it's chock full of facts that might interest you. \n \n Also, I suggest you get to know someone who is a Freemason. There's one in every family almost. However, you may not have much luck getting any information out of them. They hold their knowlege pretty close to their breasts. Their knowlege has had them murdered, ostrasized, oppressed and physically assaulted in the past as much of it goes against the teachings of the RCC and there was a time that anyone holding any kind of knowlege that would damage the mythical and supertitious teaching of the church was put to death. (In the name of Jesus, of course. :p )\n \n Also, get into The Dead Sea Scrolls or the Gnostic Scrolls. There is much knowlege there as well.", 
   {}, 
   120194, 
   null, 
   1115759280.0
  ], 
  [
   120199, 
   null, 
   "Big Orn", 
   "...you Jesus freaks...\n\n That would be me.\n \n ...and, you really don't know what you're missing, Truthsayer.", 
   {}, 
   120181, 
   null, 
   1115759400.0
  ], 
  [
   120200, 
   null, 
   "Truthsayer", 
   "That would be me.\n \n ...and, you really don't know what you're missing, Truthsayer.\n\n \n Oh, yes I do...been there, done that. Even got a T-shirt at the Bible Book Store.\n \n But thank you for your concern just the same.\n Peace.", 
   {}, 
   120199, 
   null, 
   1115759580.0
  ], 
  [
   120203, 
   null, 
   "Big Orn", 
   "Oh, yes I do...been there, done that. Even got a T-shirt at the Bible Book Store.\n\n LOL! I have an Atlanta Braves t-shirt and cap. Can't touch me on the mound or 3rd base!\n \nBut thank you for your concern just the same.\n Peace.\n\n Mighty welcome.", 
   {}, 
   120200, 
   null, 
   1115759940.0
  ], 
  [
   120213, 
   null, 
   "Truthsayer", 
   "Here's some more religous trivia for you spiritual fans...\n \n Q. Who declared, \"'It has served us well, this myth of Christ'?\n \n <Jeopardy theme song plays in the background<\n \n \n \n \n \n \n \n A. <drum roll please< Pope Leo X emoticon_xangel", 
   {
    "unicode_changes_made": true
   }, 
   120203, 
   null, 
   1115761200.0
  ], 
  [
   120214, 
   null, 
   "Redratio1", 
   "Interesting thread!\n \n Having a God come down and have sex with a moral to produce a demi-god is so mythologically greek.", 
   {}, 
   120203, 
   null, 
   1115761260.0
  ], 
  [
   120217, 
   null, 
   "Truthsayer", 
   "When even the \"Holy See\" conceeds that Christ was a myth that has made the church prosperous, I don't know what else I can say!\n \n Wanna hear something even funnier? Many of the christian followers I have talked to think that \"Jesus Christ\" is the name of of their god. They have no clue that it is a title and not his \"real\" name. Wanna talk about lazy? emoticon_rolleyes", 
   {}, 
   120214, 
   null, 
   1115761620.0
  ], 
  [
   120244, 
   null, 
   "Big Orn", 
   "Here's some more religous trivia for you spiritual fans...\n \n Q. Who declared, \"'It has served us well, this myth of Christ'?\n \n <Jeopardy theme song plays in the background<\n \n A. <drum roll please< Pope Leo X emoticon_xangel\n\n Be careful not to sell your integrity so quickly, Truthsayer. From what I understand, most sources that quote Pope Leo X as saying that also state that the ancient Egyptians really wrote the Bible in the first place. Or, is one of those that claim it was written as truth \"...according to a satirical play aimed against the papal,\" by a playwright named John Bale, who thought that the RCC was the Great Whore and Pope Leo X was the antichrist. But, he's a playwright, or thereabouts, and what can one expect?\n \n In other words it just hearsay...gossip.\n \n I'm not taking up for Pope Leo, just making an observation that the wrong kind of knowledge could come back and bite you.", 
   {
    "unicode_changes_made": true
   }, 
   120213, 
   null, 
   1115764020.0
  ], 
  [
   120250, 
   null, 
   "Truthsayer", 
   "Point taken and well heeded. Truth is, none of us was around back then and we only go on what we have come to learn. Whether or not this knowlege is factual or not is only speculative. That goes for just about any side of the debate. The best we can do is assume and speculate since no one really knows for sure the \"real deal.\" Some call it \"faith.\" And I do conceed that I don't have much faith in what has been passed down to us over the centuries.\n \n But, being one proned to logic and reason, it is far more difficult for me to take on faith things are are clearly myth and superstition and it is much easier for me to believe Pope Leo X said that than, say, the oceans parting or water turning into wine or virgin conception. \n \n Truthfully, what makes more sense to you? Which is easier for you to believe? Pope Leo or the founders of the Roman Church that invented the early form of christianity with all of it's miracles and absurdities?\n \n Since neither one of us were there..........\n \n I am more inclined to follow the principle of \"If it looks like a duck and quacks like a duck.....\"\n \n But I must admit, you do carry yourself well as a christian and do not display the signs of a hater like some other people on this site who profess to be christian. I think I am going to enjoy our dialog.\n \n Regardless of what I think, know that I respect you and your faith as long as you can keep the conversations civil.\n \n You might be surprised to know that I am very spiritual and I do pray a lot. I just can't place a name of face to whatever supreme being I am praying to. Further, I think it would be rather arrogant on my part to assume that I do, all things considered.\n \n Thank you for your time and consideration. Have a great day.", 
   {}, 
   120244, 
   null, 
   1115765040.0
  ], 
  [
   120284, 
   null, 
   "Big Orn", 
   "Point taken and well heeded. Truth is, none of us was around back then and we only go on what we have come to learn. Whether or not this knowlege is factual or not is only speculative. That goes for just about any side of the debate. The best we can do is assume and speculate since no one really knows for sure the \"real deal.\" Some call it \"faith.\" And I do conceed that I don't have much faith in what has been passed down to us over the centuries.\n \n But, being one proned to logic and reason, it is far more difficult for me to take on faith things are are clearly myth and superstition and it is much easier for me to believe Pope Leo X said that than, say, the oceans parting or water turning into wine or virgin conception. \n \n Truthfully, what makes more sense to you? Which is easier for you to believe? Pope Leo or the founders of the Roman Church that invented the early form of christianity with all of it's miracles and absurdities?\n \n Since neither one of us were there..........\n \n I am more inclined to follow the principle of \"If it looks like a duck and quacks like a duck.....\"\n \n But I must admit, you do carry yourself well as a christian and do not display the signs of a hater like some other people on this site who profess to be christian. I think I am going to enjoy our dialog.\n \n Regardless of what I think, know that I respect you and your faith as long as you can keep the conversations civil.\n \n You might be surprised to know that I am very spiritual and I do pray a lot. I just can't place a name of face to whatever supreme being I am praying to. Further, I think it would be rather arrogant on my part to assume that I do, all things considered.\n \n Thank you for your time and consideration. Have a great day.\n\n I love a heated debate, but hate it when emotions take over and crybabies begin their spiel.\n \n Thanks for the comment and back at ya.", 
   {}, 
   120250, 
   null, 
   1115766360.0
  ], 
  [
   120714, 
   null, 
   "billsco", 
   "Can anyone name the first diety that had the following myths attributed to him/her?\n \n Virgin birth\n Twelve followers\n Killing and resurrection\n Miracles\n Birthdate on December 25\n Morality\n Mankind's savior\n Known as the Light of the world\n \n If you said Jesus..... you haven't been paying attention and will believe anything anyone tells you.\n \n\n \n Mithra, along with Osiris, Bacchus, Hermes, Quelzacoatle, Prometheus, Zoroaster, Perseus, Horus, and Ramses, to name just a few. \n \n The list of similarities above could be added to also. All had a god for a father. Nearly all their births were announced by heavenly events such as a star, wise men paid most of them a visit, a despised ruler tried to kill all of them as infants, all experienced a forty day fast, and all died a violent death and were resurrected.", 
   {}, 
   120181, 
   null, 
   1115834940.0
  ], 
  [
   120792, 
   null, 
   "Eddie", 
   "Damn... none of our gods qualify. They where all born from the death of a giant and none had any real \"followers\" or morality for that matter... I guess that`s what you get for mixing mead and mushrooms...", 
   {}, 
   120714, 
   null, 
   1115837760.0
  ], 
  [
   120830, 
   null, 
   "Redratio1", 
   "Damn... none of our gods qualify. They where all born from the death of a giant and none had any real \"followers\" or morality for that matter... I guess that`s what you get for mixing mead and mushrooms...\n\n \n Yeah but you have Thor!", 
   {}, 
   120792, 
   null, 
   1115840460.0
  ], 
  [
   120847, 
   null, 
   "Eddie", 
   "Yeah but you have Thor!\n\n \n Hehe... that`s true... \n \n A curius fact: When christianity finally came to Scandinavia, several failed attempts to convert the heathens where made. In order to appeal to the Scandinavian culture, the monks had to display Christ as a warior god. Not pained upon a cross, but triumphantly wielding a weapon. Not dead for our sins, but victorious against his enemies (and thus removing our sin, etc, etc.", 
   {}, 
   120830, 
   null, 
   1115841660.0
  ], 
  [
   120853, 
   null, 
   "Truthsayer", 
   "Mithra, along with Osiris, Bacchus, Hermes, Quelzacoatle, Prometheus, Zoroaster, Perseus, Horus, and Ramses, to name just a few. \n \n The list of similarities above could be added to also. All had a god for a father. Nearly all their births were announced by heavenly events such as a star, wise men paid most of them a visit, a despised ruler tried to kill all of them as infants, all experienced a forty day fast, and all died a violent death and were resurrected.\n\n \n Somebody's been doing their homework. And right you are sir. Having been educated, isn't it kinda hard not to laugh at some of the people who try to speak with authority using their religion or the bible as their \"indisputable source?\" Their very foundation is shifting sand. Smoke and mirrors. Santa Claus. If they do ever educate themselves, they will be in a long term state of embarassment. I know that it takes all I can do to keep from laughing at them. But I don't want to be rude.", 
   {}, 
   120714, 
   null, 
   1115842140.0
  ], 
  [
   120906, 
   null, 
   "gnojek", 
   "Somebody's been doing their homework. And right you are sir. Having been educated, isn't it kinda hard not to laugh at some of the people who try to speak with authority using their religion or the bible as their \"indisputable source?\" Their very foundation is shifting sand. Smoke and mirrors. Santa Claus. If they do ever educate themselves, they will be in a long term state of embarassment. I know that it takes all I can do to keep from laughing at them. But I don't want to be rude.\n\n Surely you, as we all do, have your mental shortcomings.\n Maybe you'd like someone to laugh at you and show you where your ignorance lies. Ridicule is not the first step in education.", 
   {}, 
   120853, 
   null, 
   1115846220.0
  ], 
  [
   121434, 
   null, 
   "Truthsayer", 
   "Surely you, as we all do, have your mental shortcomings.\n Maybe you'd like someone to laugh at you and show you where your ignorance lies. Ridicule is not the first step in education.\n\n \n Ahhh, yes sir. That, we do. And I suppose all humans take comfort anyway they can to compensate for these mental shortcomings. Crutches like drugs/alcohol, tobacco, religion, gambling, sex, debate forums..... just to name a few.\n \n And laughed at me, they have. :p More times than I care to remember.\n \n I was speaking towards the, all too often, scenerios where one individual might be debating another over any particular topic and when arriving at a pivotal \"put up or shut up\" point in the debate, one or the other of the debaters would quote some religious book scripture as if it was the \"end all, indisputable source.\" emoticon_xangel \n \n Then they have the audacity to expect the other poster to conceed the debate to the other's infinite wisdom. :p \"The bible says it, I believe it, that settles it\" attitude. You know the type?\n \n That particular tactic is a wasted effort on people like me who have taken the time to educate theirselves in regard to the teachings of many religous doctrines and beliefs, understand their inceptions (how they actually came about/were invented) and recognize many of the \"copy cat\" myths and legends commonly shared between various religions. As I mentioned in an earlier post, I have debated people who swear by their religious beliefs but do not even realize that \"Jesus Christ\" is actually the title and not the actual name of the individual. How difficult is it having an intelligent conversation with ignorant people without pointing out their ignorance? (I would like to point out that there is a difference between ignorant and stupid. But online, it's sometimes hard to tell the difference.) Certainly, when this occurs, they become offended and start with the hateful insults. That's only human I suppose. People do become offended when their lack of intelligence is pointed out. Happens all the time. I find no real pleasure in it. But what should we do? Dumb ourselves down to that level as to not offend? (That's dishonest debate in my opinion.) Or just fall back on the \"Let's just agree to disagree\" line, perhaps? That just means that I think the other person is just too ignorant to advance the debate any further and leaves one looking for a polite way to say \"You're dumber than a box of rocks. :xbanghead \" \n \n I mean, one really doesn't have to be that educated when you think about it. Anytime somebody goes into la-la land speaking about things like virgin conception, water miraculously turning to wine, people who are actually dead for days suddenly coming back to life, the ocean parting at the rise of a staff (stick,) and other impossible myths, a red flag should go off in their head, educated or not. If it doesn't, they truly have some mental issues they need to personally address. Although, I personally do find these people to be rather humorous on occassion, I try my best not to show my amusement as some people do take offense to that and they just can't understand why I can't believe in such poppycock myself. emoticon_rolleyes Even in elementry school, when I came to learn that Santa Clause was a fairy-tale, I never told my under classmen and found humor in their beliefs. I knew something they didn't know. emoticon_idea Neener, neener. :p \n \n But when this becomes MY problem is usually when someone, in debate, throws out these absurdities as if I was supposed to conceed to the infoulability of their religious text without question. They think they have the trump card. The Ace of Spades. That's when I get somewhat offended. It is rather insulting, in my opinion, for someone to expect me to follow or conceed to such nonsense as an authoritive source. We are not children anymore. By now, you should ALL know there is no Santa. Please don't call me crazy for not believeing in Santa. No one likes their intelligence insulted like that. If it looks like a duck, and quacks like a duck, please don't tell me it's a rabbit. That offends me. I don't do well with \"make believe.\" I am much too old for that.\n \n Pardon me if I don't review my posts for spell check and grammar errors. Frankly, that does not really concern me. I am just trying to get my point across, not move to the front of the class.\n \n Have a nice day all. :)", 
   {}, 
   120906, 
   null, 
   1115918280.0
  ], 
  [
   121505, 
   null, 
   "notdakuningist", 
   "Excuse my ignorance but I thought that the story of Jesus had some actual historic verification. Or am I on teh crack? Also you might want to try reading American Gods by Neil Gaiman a really interesting look at all religion.\n As far as a creator goes, if he's an infinate being he can have as many faces as he wants or as people want to see. May I even go so far to say that he/it/the creator may appear to them as they would imagine?\n That's the problem with infinite beings, we as humans can only have an extremely limited understanding of them and as such underestimate what being infinite truly means.", 
   {}, 
   121434, 
   null, 
   1115921880.0
  ], 
  [
   121550, 
   null, 
   "Truthsayer", 
   "Excuse my ignorance but I thought that the story of Jesus had some actual historic verification. Or am I on teh crack? Also you might want to try reading American Gods by Neil Gaiman a really interesting look at all religion.\n As far as a creator goes, if he's an infinate being he can have as many faces as he wants or as people want to see. May I even go so far to say that he/it/the creator may appear to them as they would imagine?\n That's the problem with infinite beings, we as humans can only have an extremely limited understanding of them and as such underestimate what being infinite truly means.\n\n \n I am certain it does. The question comes into play, however, who's version of Jesus you wish to believe.\n \n If my memory serves me correctly (it's been a long time since college emoticon_rolleyes ) the Talmud records him as Y'shua (early form of Joshua) ben Panthera. The child of Mary, fathered by Panthera, a Roman soldier.\n \n The Qumran's (the first original messianic sect) record him as Y'shua ben Yehweh. The son of Mary and a brother to James the Just, (aka Barabbas...translation \"Son of the Father\"). Remember him? The \"murderer\" set free when Jesus was sentenced to die on the cross?) This first \"christian sect\" if you will, believed that James (Barabbas,) rather than Jesus was the true Messiah (thus the crowds appeal to have him set free.) Several centuries later, Constitine and his \"religious scholors\" determined that it was Jesus, rather than James, that was the Messiah.\n \n The Quran even mentions Jesus. It speaks of Mary and the belief that Jesus spoke in the cradle.\n \n I am sure that some very powerful and charismatic religious teacher named Y'shua (Jesus) actually existed in history. And later he was titled Jesus the Christ, the son of God, Messiah, God in the flesh, by the early Roman Church, which evolved into what we now call the Roman Catholic Church.\n \n But, as I said, it has been a while since I covered these points in my studies. Their accuracy may not be 100%. The older I get, the more brain cells I lose... emoticon_frazzled", 
   {}, 
   121505, 
   null, 
   1115923740.0
  ], 
  [
   121587, 
   null, 
   "trebor", 
   "Excuse my ignorance but I thought that the story of Jesus had some actual historic verification. Or am I on teh crack? Also you might want to try reading American Gods by Neil Gaiman a really interesting look at all religion.\n As far as a creator goes, if he's an infinate being he can have as many faces as he wants or as people want to see. May I even go so far to say that he/it/the creator may appear to them as they would imagine?\n That's the problem with infinite beings, we as humans can only have an extremely limited understanding of them and as such underestimate what being infinite truly means.\n\n \n Well, actually, no there isn't. THere are no independant secular sources for Jesus. There are secular sources about Christians, but there is no idenpendant verification of the stories of the Gospels from the first century. The earliest possible secular reference Might be antiquities 20 in antiquites, written in 93 C.E..although the other reference (antiquites 18) appears to have been added in later, in the 4th century. All the other secular references were written after 109 C.E. (tacitus, pliny the younger), and it is very probably that they got their information from Christians.", 
   {}, 
   121505, 
   null, 
   1115925540.0
  ], 
  [
   121589, 
   null, 
   "trebor", 
   "I am certain it does. The question comes into play, however, who's version of Jesus you wish to believe.\n \n If my memory serves me correctly (it's been a long time since college emoticon_rolleyes ) the Talmud records him as Y'shua (early form of Joshua) ben Panthera. The child of Mary, fathered by Panthera, a Roman soldier.\n \n The Qumran's (the first original messianic sect) record him as Y'shua ben Yehweh. The son of Mary and a brother to James the Just, (aka Barabbas...translation \"Son of the Father\"). Remember him? The \"murderer\" set free when Jesus was sentenced to die on the cross?) This first \"christian sect\" if you will, believed that James (Barabbas,) rather than Jesus was the true Messiah (thus the crowds appeal to have him set free.) Several centuries later, Constitine and his \"religious scholors\" determined that it was Jesus, rather than James, that was the Messiah.\n \n The Quran even mentions Jesus. It speaks of Mary and the belief that Jesus spoke in the cradle.\n \n I am sure that some very powerful and charismatic religious teacher named Y'shua (Jesus) actually existed in history. And later he was titled Jesus the Christ, the son of God, Messiah, God in the flesh, by the early Roman Church, which evolved into what we now call the Roman Catholic Church.\n \n But, as I said, it has been a while since I covered these points in my studies. Their accuracy may not be 100%. The older I get, the more brain cells I lose... emoticon_frazzled\n\n \n Several points. First of all, the 'pandara' mentioned was from the first century b.c... and second of all, the talmud was written down between 150 and 400 c.e... long after the abilty to be a primary source.", 
   {}, 
   121550, 
   null, 
   1115925660.0
  ], 
  [
   121599, 
   null, 
   "Truthsayer", 
   "Several points. First of all, the 'pandara' mentioned was from the first century b.c... and second of all, the talmud was written down between 150 and 400 c.e... long after the abilty to be a primary source.\n\n \n Alas, old age is hell. :p However, I do remember in my studies that some Jewish documentation exists in this regard. I was thinking the Talmud but obviously I was mistaken. You wouldn't happen to recall which documentation it was that records this would you?\n \n What I do remember is that it said that Panthera (The Panther) a Roman soldier, had his way with Mary, as Roman soldiers often did with conquered peasantry, and as a result the child Y'shua (aka Jesus) was conceived.\n \n As I said, earlier, it depends on which history one chooses to believe. Having not been there in person, myself, I am skeptical regarding any recorded history from that era.\n \n I do remember that the claim of Jesus being the bastard child of the Roman Centurian was highly disputed. The people of the jewish faith certainly were not proponents of the Christian faith so wherever it was written, it must be questioned.\n \n <Edit< Just did some Google.... curiosity killed the cat they say. emoticon_rolleyes \n \n \"But let us now return to where the Jew is introduced [Celsus], speaking of the mother of Jesus, and saying that \"when she was pregnant she was turned out of doors by the carpenter to whom she had been betrothed, as having been guilty of adultery, and that she bore a child to a certain soldier named Panthera; \"and let us see whether those who have blindly concocted these fables about the adultery of the Virgin with Panthera, and her rejection by the carpenter, did not invent these stories to overturn His miraculous conception by the Holy Ghost: for they could have falsified the history in a different manner, on account of its extremely miraculous character, and not have admitted, as it were against their will, that Jesus was born of no ordinary human marriage.\" - Origen Against Celsus 1:Chapter XXXII \n \n Celsus is generally regarded to have taken his story from Jewish tradition which supposedly survives today in the Talmud's \"Sepher Toldoth Jeshu\".", 
   {}, 
   121589, 
   null, 
   1115926020.0
  ], 
  [
   121610, 
   null, 
   "trebor", 
   "Alas, old age is hell. :p However, I do remember in my studies that some Jewish documentation exists in this regard. I was thinking the Talmud but obviously I was mistaken. You wouldn't happen to recall which documentation it was that records this would you?\n \n What I do remember is that it said that Panthera (The Panther) a Roman soldier, had his way with Mary, as Roman soldiers often did with conquered peasantry, and as a result the child Y'shua (aka Jesus) was conceived.\n \n As I said, earlier, it depends on which history one chooses to believe. Having not been there in person, myself, I am skeptical regarding any recorded history from that era.\n\n \n \n There is none about Jesus. Many of the references that Christians claim are about Jesus in the Talmud are taken out of context. Some Christian groups use this particular Y'shua (there are over 20 mentioned in the Talmud, it is a common name) to say \"see, they are insulting CHrist\". While it might be (it was written during a time there was probalby conflict between the Christians and the Jews), the text shows a different time frame, and apparently a different Jesus.", 
   {}, 
   121599, 
   null, 
   1115926560.0
  ], 
  [
   121642, 
   null, 
   "Truthsayer", 
   "There is none about Jesus. Many of the references that Christians claim are about Jesus in the Talmud are taken out of context. Some Christian groups use this particular Y'shua (there are over 20 mentioned in the Talmud, it is a common name) to say \"see, they are insulting CHrist\". While it might be (it was written during a time there was probalby conflict between the Christians and the Jews), the text shows a different time frame, and apparently a different Jesus.\n\n \n Most excellent point. There are probably over 30 Jesus's mentioned in the Talmud if memory serves me correctly. The probability of confusion is enormous.\n \n I believe there is also confusion regarding Mary Magdelene in this respect as well. Often she is confused with Mary the Virgin and also insinuated as a prostitute in the RCC versions.\n \n The \"Di Vinci Codes\" suggest that she was actually the wife of Jesus.\n \n But now that you mention it, as many references to Jesus as there are, regardless of the historic intrepretation, all come years \"after the fact\" and I do not know of any \"actual\" evidence, by today's standards, that can prove the actual existance of such a person.\n \n Finally, some intelligent dialog on this site.... emoticon_xbouncer \n \n I may have found myself a new home. :)", 
   {}, 
   121610, 
   null, 
   1115929140.0
  ], 
  [
   121677, 
   null, 
   "trebor", 
   "Most excellent point. There are probably over 30 Jesus's mentioned in the Talmud if memory serves me correctly. The probability of confusion is enormous.\n \n I believe there is also confusion regarding Mary Magdelene in this respect as well. Often she is confused with Mary the Virgin and also insinuated as a prostitute in the RCC versions.\n \n The \"Di Vinci Codes\" suggest that she was actually the wife of Jesus.\n \n But now that you mention it, as many references to Jesus as there are, regardless of the historic intrepretation, all come years \"after the fact\" and I do not know of any \"actual\" evidence, by today's standards, that can prove the actual existance of such a person.\n \n Finally, some intelligent dialog on this site.... emoticon_xbouncer \n \n I may have found myself a new home. :)\n\n \n \n I will also point out that the concept that Mary Magdalene was a prostitute is not really biblical. It was probably pushed by Pope Gregory the Great. It seems that Mary of Bethany and the sinner who annointed Jesus feet in Luke (and was assumed to be a prostitute) got mixed up with MM.\n \n My personal opinion about Jesus is that the Jesus that is mentioned in the Gospels is probably a conglomeration of several preachers, with some myth and legends thrown in. There might have been a 'Proto-jesus', but that person would probably be so different that the description in the gospels as to be unreconisedable.", 
   {}, 
   121642, 
   null, 
   1115932920.0
  ], 
  [
   121690, 
   null, 
   "Truthsayer", 
   "\n My personal opinion about Jesus is that the Jesus that is mentioned in the Gospels is probably a conglomeration of several preachers, with some myth and legends thrown in. There might have been a 'Proto-jesus', but that person would probably be so different that the description in the gospels as to be unreconisedable.\n\n \n I must agree, sir. The bible is full of \"proto\" miracles, myths and other superstitions. It is a compilation of many different religions. It is rather ingenious actually, if you think of it.\n \n Constitine, realizing that he could enslave, tax and even kill his subjects also knew that he could not get a grip on the sweeping spiritualism of the times and the many different cults that were popping up. So, they say, if you can't beat them, join them. Just create a state sponsored religion for the subjects. There truly is no difference between a tithe and a tax as a shekel is shekel, after all. But how could he achieve this with so many religions and beliefs abounding?\n \n It was a series of negotiations and compromises. I can imagine how it went as the \"pegans\" gathered around the bargaining table to establish one central religion they could all live with.\n \n Mithrans: \"OK, we'll compromise but the god has to be born of a virgin on Dec 25th! No exceptions!\"\n \n Wiccans (or some other old religion:) \"We'll take the virgin birth in trade for one great flood and a water into wine miracle.\"\n \n SOLD! :p \n \n Then, anyone who didn't get on the bandwagon were killed by the Romans. How easy was that?", 
   {}, 
   121677, 
   null, 
   1115933820.0
  ], 
  [
   121704, 
   null, 
   "Big Orn", 
   "I must agree, sir. The bible is full of \"proto\" miracles, myths and other superstitions. It is a compilation of many different religions. It is rather ingenious actually, if you think of it.\n \n Constitine, realizing that he could enslave, tax and even kill his subjects also knew that he could not get a grip on the sweeping spiritualism of the times and the many different cults that were popping up. So, they say, if you can't beat them, join them. Just create a state sponsored religion for the subjects. There truly is no difference between a tithe and a tax as a shekel is shekel, after all. But how could he achieve this with so many religions and beliefs abounding?\n \n It was a series of negotiations and compromises. I can imagine how it went as the \"pegans\" gathered around the bargaining table to establish one central religion they could all live with.\n \n Mithrans: \"OK, we'll compromise but the god has to be born of a virgin on Dec 25th! No exceptions!\"\n \n Wiccans (or some other old religion:) \"We'll take the virgin birth in trade for one great flood and a water into wine miracle.\"\n \n SOLD! :p \n \n Then, anyone who didn't get on the bandwagon were killed by the Romans. How easy was that?\n\n What the...?\n What can I say...except, if you're gonna be ignorant, you better be tough! :p", 
   {}, 
   121690, 
   null, 
   1115934840.0
  ], 
  [
   121705, 
   null, 
   "Truthsayer", 
   "What the...?\n What can I say...except, if you're gonna be ignorant, you better be tough! :p\n\n \n Amen.... \n \n \n (No wait! Did I just say that? :p )", 
   {}, 
   121704, 
   null, 
   1115934960.0
  ], 
  [
   121913, 
   null, 
   "notdakuningist", 
   "Wow, pretty articulate discussion. I hate to be a pusher but I really have to mention american gods by neil gaiman again, fictional (mostly) but still a really good read talking about alot of the stuff covered here.", 
   {}, 
   121705, 
   null, 
   1115964300.0
  ], 
  [
   121920, 
   null, 
   "Duo_Maxwell", 
   "Virgin birth\n Killing and resurrection\n Miracles\n Morality\n Mankind's savior\n Known as the Light of the world\n :\n \n The Dark Sith Lord, Darth Vader \n \n :p", 
   {}, 
   120181, 
   null, 
   1115964960.0
  ], 
  [
   121956, 
   null, 
   "sanguinekane", 
   "I must agree, sir. The bible is full of \"proto\" miracles, myths and other superstitions. It is a compilation of many different religions. It is rather ingenious actually, if you think of it.\n \n Constitine, realizing that he could enslave, tax and even kill his subjects also knew that he could not get a grip on the sweeping spiritualism of the times and the many different cults that were popping up. So, they say, if you can't beat them, join them. Just create a state sponsored religion for the subjects. There truly is no difference between a tithe and a tax as a shekel is shekel, after all. But how could he achieve this with so many religions and beliefs abounding?\n \n It was a series of negotiations and compromises. I can imagine how it went as the \"pegans\" gathered around the bargaining table to establish one central religion they could all live with.\n \n Mithrans: \"OK, we'll compromise but the god has to be born of a virgin on Dec 25th! No exceptions!\"\n \n Wiccans (or some other old religion:) \"We'll take the virgin birth in trade for one great flood and a water into wine miracle.\"\n \n SOLD! :p \n \n Then, anyone who didn't get on the bandwagon were killed by the Romans. How easy was that?\n\n \n I wouldn't be surprised if this is actually something close to the truth. The amount of politics involved in the creation of Christianity is one of the reasons it astounds me why people can follow it as a religion. But then again, just about every religion, from the oldest to the newest, has involved politics in some way, so in the end, I guess it doesn't really matter.", 
   {}, 
   121690, 
   null, 
   1115969880.0
  ], 
  [
   122461, 
   null, 
   "Dzeron", 
   "Virgin birth\n Killing and resurrection\n Miracles\n Morality\n Mankind's savior\n Known as the Light of the world\n :\n \n The Dark Sith Lord, Darth Vader \n \n :p\n\n \n Now it's time to praise the Lord, but first let's all take a deep mechanical breath.", 
   {}, 
   121920, 
   null, 
   1116043020.0
  ], 
  [
   122464, 
   null, 
   "Duo_Maxwell", 
   "It does fit rather nicely\n \n Virgin birth, no father. \n \n Killing and resurrection, \"died\" and was reborn\n \n Miracles, force anyone?\n \n Morality, the prinicipals for which the Empire governered.\n \n Mankind's savior, he was the chosen one\n \n Known as the Light of the world, see above.", 
   {}, 
   122461, 
   null, 
   1116045060.0
  ], 
  [
   122895, 
   null, 
   "Easyrider", 
   "THere are no independant secular sources for Jesus. There are secular sources about Christians, but there is no idenpendant verification of the stories of the Gospels from the first century.\n \n \n Need some historical, early references for Christ, and even some first-century evidence chisseled in stone there, Trebor? \n \n Just review the following links:\n \n Historical Jesus: http://www.sundayschoolcourses.com/...su/histjesu.htm\n \n Ancient Ossuaries bear witness too:\n http://www.leaderu.com/theology/burialcave.html\n \n Then you shall know the truth, and the truth shall set you free!", 
   {}, 
   122464, 
   null, 
   1116129600.0
  ], 
  [
   122900, 
   null, 
   "thebootfitter", 
   "Need some historical, early references for Christ, and even some first-century evidence chisseled in stone there, Trebor? \n \n Just review the following links:\n \n Historical Jesus: http://www.sundayschoolcourses.com/...su/histjesu.htm\n \n Ancient Ossuaries bear witness too:\n http://www.leaderu.com/theology/burialcave.html\n \n Then you shall know the truth, and the truth shall set you free!\n\n C'mon, Easyrider... The first site you post uses Jerry Vardaman's 'Magic Coin' as part of it's evidence. How much trust can you place in a source that uses an obvious fraud as evidence? And that's just pin-pointing one particular topic. You'll have to do better than that to convince a rational thinker of your story.\n \n Peace,\n The Bootfitter", 
   {}, 
   122895, 
   null, 
   1116132780.0
  ], 
  [
   123027, 
   null, 
   "Easyrider", 
   "Hey Bootfitter - \n \n Christ is Risen. The Word of God declares it repeatedly by numerous authors and eyewitnesses. Awake from your stupor and get real.", 
   {}, 
   122900, 
   null, 
   1116162180.0
  ], 
  [
   123195, 
   null, 
   "Duo_Maxwell", 
   "Hey Bootfitter - \n \n Christ is Risen. The Word of God declares it repeatedly by numerous authors and eyewitnesses. Awake from your stupor and get real.\n\n \n lol. Right. The word of a opium smoking hippie. \n \n Do you really think anyone even remotely considers what you say anymore?", 
   {}, 
   123027, 
   null, 
   1116190860.0
  ], 
  [
   123327, 
   null, 
   "thebootfitter", 
   " Christ is Risen. The Word of God declares it repeatedly by numerous authors and eyewitnesses.\n\n That is beside the point. My point is that ASSUMING what you say is true, then you should be able to provide references that do not rely on fraud for evidence.", 
   {}, 
   123027, 
   null, 
   1116218940.0
  ], 
  [
   123481, 
   null, 
   "trebor", 
   "Need some historical, early references for Christ, and even some first-century evidence chisseled in stone there, Trebor? \n \n Just review the following links:\n \n Historical Jesus: http://www.sundayschoolcourses.com/...su/histjesu.htm\n \n Ancient Ossuaries bear witness too:\n http://www.leaderu.com/theology/burialcave.html\n \n Then you shall know the truth, and the truth shall set you free!\n\n \n Let's see, one broken link, and one link to a misinterpretation. The fact that \n early Chrisitans defaced 1st century ossuraries is hardly evidence of a first century Jesus. This woman's interpretation of a late 19th century article is\n strange to say the least. But, then again, the Crusaders of Christ, who wrote this claim, are not noted for honesty , or intellectual integrety, are they?", 
   {}, 
   122895, 
   null, 
   1116255720.0
  ], 
  [
   123825, 
   null, 
   "Easyrider", 
   "You're too stupid to get saved.", 
   {}, 
   123481, 
   null, 
   1116292500.0
  ], 
  [
   123828, 
   null, 
   "Easyrider", 
   "God can save even you, Trebor, assuming you learn how to repent of your worthless arguments against Christ.", 
   {}, 
   123481, 
   null, 
   1116292620.0
  ], 
  [
   123848, 
   null, 
   "trebor", 
   "God can save even you, Trebor, assuming you learn how to repent of your worthless arguments against Christ.\n\n \n Well, can you show me an article about this 'tomb' that says this is evidence of Jesus in the first century from a peer reviewed archelogical magazine? No?? I thought not. Instead, rather than deal with the evidence, you flaunt a relgiously motivated article that takes the facts out of context and flagrently ignores other facts to try to prove something that frankly it doesn't. \n \n The fact that the evangalistic Christainity has to resort to such underhanded dishonest tactics to try to 'prove' themselves right certainly convinces me the error of their ways.", 
   {}, 
   123828, 
   null, 
   1116294360.0
  ], 
  [
   123857, 
   null, 
   "Orion", 
   "You're too stupid to get saved.\n\n \n That's a mighty fine 'witness', EZ. Mighty fine. I'm sure that Jesus is proud of you. Throw in a dose of hellfire&brimstone, and I'll bet you'll wow 'em. Anyway, while we're on the subject of 'stupid', how many people do you think you've alienated from your Christianity across these fora over the last seven years or so? Ya know, EZ, when I first encountered you at a forum circa 1998, I was convinced that you were an anti-Christian troll.", 
   {}, 
   123825, 
   null, 
   1116294960.0
  ], 
  [
   123858, 
   null, 
   "Truthsayer", 
   "You're too stupid to get saved.\n\n \n This gives me the prime oppertunity to point out what I was saying in post 19, of this thread, when I wrote:\n \n \nI was speaking towards the, all too often, scenerios where one individual might be debating another over any particular topic and when arriving at a pivotal \"put up or shut up\" point in the debate, one or the other of the debaters would quote some religious book scripture as if it was the \"end all, indisputable source.\" \n \n Then they have the audacity to expect the other poster to conceed the debate to the other's infinite wisdom. \"The bible says it, I believe it, that settles it\" attitude. You know the type?\n \n \n \n \n Carry on............... :)", 
   {}, 
   123825, 
   null, 
   1116295200.0
  ], 
  [
   123905, 
   null, 
   "Duo_Maxwell", 
   "You're too stupid to get saved.\n\n \n ah yes, repalce stupid with \"much of believer in honesty and intergrity and will not abandon his beliefs in the face of fire and brimestone talk.\"\n \n I think EZ is a anti-christian troll and a very good one at that.", 
   {}, 
   123825, 
   null, 
   1116302520.0
  ], 
  [
   123961, 
   null, 
   "greg 79 f150", 
   "Point taken and well heeded. Truth is, none of us was around back then and we only go on what we have come to learn. Whether or not this knowlege is factual or not is only speculative. That goes for just about any side of the debate. The best we can do is assume and speculate since no one really knows for sure the \"real deal.\" Some call it \"faith.\" And I do conceed that I don't have much faith in what has been passed down to us over the centuries.\n \n But, being one proned to logic and reason, it is far more difficult for me to take on faith things are are clearly myth and superstition and it is much easier for me to believe Pope Leo X said that than, say, the oceans parting or water turning into wine or virgin conception. \n \n Truthfully, what makes more sense to you? Which is easier for you to believe? Pope Leo or the founders of the Roman Church that invented the early form of christianity with all of it's miracles and absurdities?\n \n Since neither one of us were there..........\n \n I am more inclined to follow the principle of \"If it looks like a duck and quacks like a duck.....\"\n \n But I must admit, you do carry yourself well as a christian and do not display the signs of a hater like some other people on this site who profess to be christian. I think I am going to enjoy our dialog.\n \n Regardless of what I think, know that I respect you and your faith as long as you can keep the conversations civil.\n \n You might be surprised to know that I am very spiritual and I do pray a lot. I just can't place a name of face to whatever supreme being I am praying to. Further, I think it would be rather arrogant on my part to assume that I do, all things considered.\n \n Thank you for your time and consideration. Have a great day.\n\n \n \n First , let me point out that I am one of the ignorant, uneducated beings that you have spoken of already. I randomly take place in discussions on here, and as most do, will post my biased viewpoints and opinions , based on my life experiences/education. You stated above that you are spiritual and pray a lot. How does that work out for you, when it seems you do not believe in the words of Christ, nor have a name or face to whom you are praying to /for ? Taking your statement in to account, then your form of prayer would equate to merely talking to ones self, would it not ? This is a new concept for me, so if you dont mind , would you please enlighten me as to how this works for you ?", 
   {}, 
   120250, 
   null, 
   1116332520.0
  ], 
  [
   123977, 
   null, 
   "thebootfitter", 
   "First , let me point out that I am one of the ignorant, uneducated beings that you have spoken of already. I randomly take place in discussions on here, and as most do, will post my biased viewpoints and opinions , based on my life experiences/education. You stated above that you are spiritual and pray a lot. How does that work out for you, when it seems you do not believe in the words of Christ, nor have a name or face to whom you are praying to /for ? Taking your statement in to account, then your form of prayer would equate to merely talking to ones self, would it not ? This is a new concept for me, so if you dont mind , would you please enlighten me as to how this works for you ?\n\n Greg -- \n Would you feel that someone praying to Zeus equates to merely talking to oneself? How about Mithra? Or Krishna?\n \n Do you pray to Christ? I'm sure you are aware that 'Christ' is not a name, but rather a generic title, applied to many people and characters throughout history. If you pray to Jesus, do you have a face to whom you are praying? Is it accurate? Or is it a bastardized European version of what some artist thinks Jesus should look like? Do you sometimes pray directly to the Father? Do you have a name or a face for that which you are praying?\n \n My essential point is that there are a lot of different forms of 'prayer.' Your concept of prayer is not the only one that is valid. Some people pray to 'Spirit,' or 'Essence' -- a nameless, faceless force behind everything in the universe. Some people believe that sending thoughts into the collective concsciousness of all creation will be recognized by other living organisms -- even if not on a conscious level -- and that they world will respond to those thoughts (thus 'answering' the prayer).\n \n Open thou thine eyes, that thee may behold wondrous things!\n \n Peace,\n The Bootfitter", 
   {}, 
   123961, 
   null, 
   1116342240.0
  ], 
  [
   124055, 
   null, 
   "Truthsayer", 
   "Greg -- \n Would you feel that someone praying to Zeus equates to merely talking to oneself? How about Mithra? Or Krishna?\n \n Do you pray to Christ? I'm sure you are aware that 'Christ' is not a name, but rather a generic title, applied to many people and characters throughout history. If you pray to Jesus, do you have a face to whom you are praying? Is it accurate? Or is it a bastardized European version of what some artist thinks Jesus should look like? Do you sometimes pray directly to the Father? Do you have a name or a face for that which you are praying?\n \n My essential point is that there are a lot of different forms of 'prayer.' Your concept of prayer is not the only one that is valid. Some people pray to 'Spirit,' or 'Essence' -- a nameless, faceless force behind everything in the universe. Some people believe that sending thoughts into the collective concsciousness of all creation will be recognized by other living organisms -- even if not on a conscious level -- and that they world will respond to those thoughts (thus 'answering' the prayer).\n \n Open thou thine eyes, that thee may behold wondrous things!\n \n Peace,\n The Bootfitter\n\n \n Thanks Bootfitter. You saved me a lot of typing.\n \n \nFirst , let me point out that I am one of the ignorant, uneducated beings that you have spoken of already.\n \n \n There's no shame in that. The first step to correcting a mistake is to realize it. Now that you realize it, go educate yourself. There is plenty of knowlege out there to be had for he who has eyes, ears, and an open mind. Just remember...if it looks like a duck........and so forth.", 
   {}, 
   123977, 
   null, 
   1116356340.0
  ], 
  [
   124071, 
   null, 
   "trebor", 
   "\n \n There's no shame in that. The first step to correcting a mistake is to realize it. Now that you realize it, go educate yourself. There is plenty of knowlege out there to be had for he who has eyes, ears, and an open mind. Just remember...if it looks like a duck........and so forth.\n\n \n \n Ignorance is cureable, Stupidty is forever.", 
   {}, 
   124055, 
   null, 
   1116357540.0
  ], 
  [
   124075, 
   null, 
   "Truthsayer", 
   "Ignorance is cureable, Stupidty is forever.\n\n \n Exactamundo. That is why there is no point trying to talk to a religious zealot.", 
   {}, 
   124071, 
   null, 
   1116357660.0
  ], 
  [
   124097, 
   null, 
   "Big Orn", 
   "There is plenty of knowlege out there to be had for he who has eyes, ears, and an open mind.\n\n I think you do yourself and those around you a serious injustice by closing your mind. However, if you leave your mind open to the trash of the world you better be careful what others place in it.\n \nJust remember...if it looks like a duck........and so forth.\n\n An old man once lost his plow mule (it was actually a donkey) and came by the house looking for him. He said it was down in my pasture and he wanted to know if he could drive his trailer in and get him. I said I hadn't seen him and that my cattle and horses had all been up the night before and that no \"plow mule\" was in the bunch. He said - \"I'd know that bray anywhere. He's down in the bottoms alright.\" \n I let him through the gate and rode with him. At the edge of the woods and creek bottom he pulled over and whistled. After a few seconds there came a bellow from my bull. He smiled, clapped his hands and said - \"That's him alright!\" I watched as the old man stood staring in the direction of the sound. Soon my old bull wobbled out of the bottoms and bellowed again.\n The old man pushed hid hat back on his head and said, \"Well, I'll be...I woulda bet the farm that was my mule.\"\n So if it quacks like a duck it might be raccoon with a deep voice... :p", 
   {}, 
   124055, 
   null, 
   1116359520.0
  ], 
  [
   124101, 
   null, 
   "Truthsayer", 
   "Two horses were in a tavern having a conversation. A dog walks past them and says, \"Hi Guys. How's it going?\" One horse looks at the other and says, \"Can you believe that? A talking dog!\" :p :p", 
   {}, 
   124097, 
   null, 
   1116359760.0
  ], 
  [
   124102, 
   null, 
   "Big Orn", 
   "Two horses were in a tavern having a conversation. A dog walks past them and says, \"Hi Guys. How's it going?\" One horse looks at the other and says, \"Can you believe that? A talking dog!\" :p :p\n\n I've heard dogs talk... emoticon_rolleyes ...on America's Funniest Home Videos\n \n But, did you hear about the sheepdogs that walked into the bar?\n \n \n I guess it was all that hair in their eyes....", 
   {}, 
   124101, 
   null, 
   1116360000.0
  ], 
  [
   124201, 
   null, 
   "Duo_Maxwell", 
   "Ignorance is cureable, Stupidty is forever.\n\n \n Not quite. Ignorance of personal ignorance is incurable.", 
   {}, 
   124071, 
   null, 
   1116370020.0
  ], 
  [
   124276, 
   null, 
   "Easyrider", 
   "It's fairly obvious that Orion, Duo Maxwell and Trebor are anti-Christian trolls - and not very good ones at that. Too bad.... maybe they will wise up in time to get saved before they die.", 
   {}, 
   124201, 
   null, 
   1116376560.0
  ], 
  [
   124298, 
   null, 
   "trebor", 
   "Not quite. Ignorance of personal ignorance is incurable.\n\n \n Personal ignorance (such as from Easyrider) is stupidty.", 
   {}, 
   124201, 
   null, 
   1116379920.0
  ], 
  [
   124299, 
   null, 
   "greg 79 f150", 
   "Greg -- \n Would you feel that someone praying to Zeus equates to merely talking to oneself? How about Mithra? Or Krishna?\n \n Do you pray to Christ? I'm sure you are aware that 'Christ' is not a name, but rather a generic title, applied to many people and characters throughout history. If you pray to Jesus, do you have a face to whom you are praying? Is it accurate? Or is it a bastardized European version of what some artist thinks Jesus should look like? Do you sometimes pray directly to the Father? Do you have a name or a face for that which you are praying?\n \n My essential point is that there are a lot of different forms of 'prayer.' Your concept of prayer is not the only one that is valid. Some people pray to 'Spirit,' or 'Essence' -- a nameless, faceless force behind everything in the universe. Some people believe that sending thoughts into the collective concsciousness of all creation will be recognized by other living organisms -- even if not on a conscious level -- and that they world will respond to those thoughts (thus 'answering' the prayer).\n \n Open thou thine eyes, that thee may behold wondrous things!\n \n Peace,\n The Bootfitter\n\n \n \n Let me see now, Truthsayer, Bootfitter, hmm, I can see how one may get those two names mixed up. But maybe Boot and Truth are the same person ???", 
   {}, 
   123977, 
   null, 
   1116380040.0
  ], 
  [
   124303, 
   null, 
   "Dzeron", 
   "It's fairly obvious that Orion, Duo Maxwell and Trebor are anti-Christian trolls - and not very good ones at that. Too bad.... maybe they will wise up in time to get saved before they die.\n\n \n Let's see where you end up by following a sorcerer, shall we? I bet it won't lead to \"salvation.\"", 
   {}, 
   124276, 
   null, 
   1116380640.0
  ], 
  [
   124325, 
   null, 
   "trebor", 
   "It's fairly obvious that Orion, Duo Maxwell and Trebor are anti-Christian trolls - and not very good ones at that. Too bad.... maybe they will wise up in time to get saved before they die.\n\n \n How ironic that you should bring that up. It was being specularted about you just recently too. I mean, just because people react badly to meaningless threats about 'turn or burn' doesn't mean that they are anti-christian. They just might be reacting to the person spewing hate at them.", 
   {}, 
   124276, 
   null, 
   1116384000.0
  ], 
  [
   124333, 
   null, 
   "Orion", 
   "It's fairly obvious that Orion, Duo Maxwell and Trebor are anti-Christian trolls - and not very good ones at that. Too bad.... maybe they will wise up in time to get saved before they die.\n\n \n Well, EZ, I'm glad you edited your post to include me - I was beginning to feel snubbed. \"Anti-Christian trolls\"? I don't think so, EZ. Personally, I have nothing against Christianity. If you choose to believe that your Bible is the 'Word of God', when that very same Bible suggests a flat earth which supports a solid dome of 'firmament', that heaven exists in the sky whereas hell exists in the centre of the earth, or that certain diseases (epilepsy?) are caused by demons, or that a bunch of dead folks paraded into Jerusalem at the time of Jesus' death, or that true Christians can drink poison without fear of harm, so be it. I accept such sentiments for what they are: the musings of an ancient people, and I find them to be of historical interest. \n \n That said, I take exception to your exclusivist Christian fundamentalist evangelism as well as your attempts to twist and otherwise misinterpret scripture to have it fit your particular theology. I also have little tolerance for anti-intellectualism or what I consider to be outright intellectual dishonesty. \n \n Finally, I'll remind you of what you posted earlier...\n \n You're too stupid to get saved.\n \n ...yet another EZ gem.", 
   {}, 
   124276, 
   null, 
   1116384840.0
  ], 
  [
   124337, 
   null, 
   "Duo_Maxwell", 
   "tell me, can a so called christian who uses lies, fraud, dishonest behavior, truckloads of threats (bodily and other) and all other things jesus would not do, yet refuses to repent be admitted to heaven? \n \n IMO, Ez is going straight to hell.", 
   {}, 
   124333, 
   null, 
   1116385020.0
  ], 
  [
   124344, 
   null, 
   "trebor", 
   "tell me, can a so called christian who uses lies, fraud, dishonest behavior, truckloads of threats (bodily and other) and all other things jesus would not do, yet refuses to repent be admitted to heaven? \n \n IMO, Ez is going straight to hell.\n\n \n IMO, he will not. But that is only because there is no hell.", 
   {}, 
   124337, 
   null, 
   1116386100.0
  ], 
  [
   124345, 
   null, 
   "thebootfitter", 
   "Let me see now, Truthsayer, Bootfitter, hmm, I can see how one may get those two names mixed up. But maybe Boot and Truth are the same person ???\n\n Not that I am aware of... but I guess it's conceivable that I could have a split personality disorder and not be aware of it.\n \n I am still interested in your thoughts to my questions and comments above, though.", 
   {}, 
   124299, 
   null, 
   1116386100.0
  ], 
  [
   124347, 
   null, 
   "Easyrider", 
   "Well, EZ, I'm glad you edited your post to include me - I was beginning to feel snubbed. \"Anti-Christian trolls\"? I don't think so, EZ. Personally, I have nothing against Christianity. If you choose to believe that your Bible is the 'Word of God', when that very same Bible suggests a flat earth which supports a solid dome of 'firmament', that heaven exists in the sky whereas hell exists in the centre of the earth...(and yada, yada, yada...)\n\n \n Your vile attacks against Jesus ('gay jesus', etc.), against the Bible, and against Biblical Christianity are well documented, Orion.\n \n And for the record, you are STILL unable or unwilling to tell us who your so-called \"god\" is, where the slug lives, or anything else about it. That's pretty lame of you, Orion. But then, you were never able to substantiate your own beliefs - you simply love to bash someone else's.", 
   {}, 
   124337, 
   null, 
   1116386220.0
  ], 
  [
   124351, 
   null, 
   "Easyrider", 
   "tell me, can a so called christian who uses lies, fraud, dishonest behavior, truckloads of threats (bodily and other) and all other things jesus would not do, yet refuses to repent be admitted to heaven? IMO, Ez is going straight to hell.\n\n \n Who is the liar? It is the man who denies that Jesus is the Christ. Such a man is the antichrist...\" I John 2:22\n \n Reckon that is you and yours there, Maxwell. Don't forget your asbestos suit, as if it will help you.\n \n Better yet, repent of your follies!", 
   {}, 
   124347, 
   null, 
   1116386400.0
  ], 
  [
   124358, 
   null, 
   "trebor", 
   "Who is the liar? It is the man who denies that Jesus is the Christ. Such a man is the antichrist...\" I John 2:22\n \n Reckon that is you and yours there, Maxwell. Don't forget your asbestos suit, as if it will help you.\n \n Better yet, repent of your follies!\n\n \n \n Of course, that is the opinion of the person who wrote 1 John. However, that does not mean his opinion is true. He seems to have convinced you on it though. \n You should look at the follies you have before telling others to repent of theirs.\n \n Driving people away from respecting Christianity is a big folly that you continue to do. You really should repent for that.", 
   {}, 
   124351, 
   null, 
   1116386820.0
  ], 
  [
   124366, 
   null, 
   "Duo_Maxwell", 
   "Who is the liar?\n\n \n You cited a source that was known to be a liar. \n \n So you therefore admit to using fraud, dishonest behavior, truckloads of threats (bodily and other)?", 
   {}, 
   124351, 
   null, 
   1116387900.0
  ], 
  [
   124367, 
   null, 
   "Easyrider", 
   "Trebor, we'll keep praying for your salvation. Because as of right now you are in serious danger of winding up in the Pit, based on your rejection of Jesus Christ (note John 3:36 and John 8:24, etc.). \n \n Now your like-minded, Christ-denying buddies are too steeped in lies and deception at the current time to reveal the truth to you - that you need Christ for salvation. You have bought into the devil's lies (as they have), and it will eventually come back to haunt you all. No doubt about it. However, there is one here who is telling you to come to Christ, and you seek to crucify him. Not good, Trebor. That isn't a very good plan for you.", 
   {}, 
   124358, 
   null, 
   1116388080.0
  ], 
  [
   124370, 
   null, 
   "Easyrider", 
   "You cited a source that was known to be a liar. So you therefore admit to using fraud, dishonest behavior, truckloads of threats (bodily and other)?\n\n \n <flush<\n \n Your lips are moving again, Duo. \n \n Remember, only a liar and an antichrist denies that Jesus is the Christ (I John 2:22), so we know who your father is (John 8:44).", 
   {}, 
   124367, 
   null, 
   1116388260.0
  ], 
  [
   124382, 
   null, 
   "Orion", 
   "Your vile attacks against Jesus ('gay jesus', etc.), against the Bible, and against Biblical Christianity are well documented, Orion.\n\n \n EZ, I raised the issue of the possibility of a gay Jesus in an attempt to get you to think. Clearly, I fell short of my mark. The very fact that you consider even the possibility of a gay Jesus to be an insult says a lot about your prejudices. Never mind the fact that there exists scriptural evidence to suggest that Jesus may have been of illegitimate birth. Another of your prejudices? \n \n \nAnd for the record, you are STILL unable or unwilling to tell us who your so-called \"god\" is, where the slug lives, or anything else about it. That's pretty lame of you, Orion. But then, you were never able to substantiate your own beliefs - you simply love to bash someone else's.\n\n \n \"Slug\"? Did you say \"Slug\"? LOL!\n \n I've already explained this to you, EZ. Please pay attention. First, unlike you, I'm not an evangelist. I'm not here to proselytize. Second, for the record, I enjoy watching you stew in your frustration.", 
   {}, 
   124347, 
   null, 
   1116389160.0
  ], 
  [
   124396, 
   null, 
   "greg 79 f150", 
   "Greg -- \n Would you feel that someone praying to Zeus equates to merely talking to oneself? How about Mithra? Or Krishna?\n \n Do you pray to Christ? I'm sure you are aware that 'Christ' is not a name, but rather a generic title, applied to many people and characters throughout history. If you pray to Jesus, do you have a face to whom you are praying? Is it accurate? Or is it a bastardized European version of what some artist thinks Jesus should look like? Do you sometimes pray directly to the Father? Do you have a name or a face for that which you are praying?\n \n My essential point is that there are a lot of different forms of 'prayer.' Your concept of prayer is not the only one that is valid. Some people pray to 'Spirit,' or 'Essence' -- a nameless, faceless force behind everything in the universe. Some people believe that sending thoughts into the collective concsciousness of all creation will be recognized by other living organisms -- even if not on a conscious level -- and that they world will respond to those thoughts (thus 'answering' the prayer).\n \n Open thou thine eyes, that thee may behold wondrous things!\n \n Peace,\n The Bootfitter\n\n \n \n Well, first of all, I do not pray, and I do not see how you would just assume that I did, because my post does not reflect that notion. Second, you are not the person to whom I addressed my question to . If you will note the quote, I was addressing Truthsayer. Truthsayer posted that he/she , did not pray to a name or a face. I would like to know to what or to whom, are the prayers of TS directed. Simple question,", 
   {}, 
   123977, 
   null, 
   1116389940.0
  ], 
  [
   124400, 
   null, 
   "Duo_Maxwell", 
   "<flush<\n \n Your lips are moving again, Duo. \n \n Remember, only a liar and an antichrist denies that Jesus is the Christ (I John 2:22), so we know who your father is (John 8:44).\n\n \n http://4forums.com/political/showthread.php?p=106580#post106580\n \n Hmm. Looks like a lie. Dzeron did what you claimed no on did.", 
   {}, 
   124370, 
   null, 
   1116390060.0
  ], 
  [
   124404, 
   null, 
   "Orion", 
   "Who is the liar? It is the man who denies that Jesus is the Christ. Such a man is the antichrist...\" I John 2:22\n\n \n Translation: believe as I do, accept what I say, or else you're a liar or worse. You're going to have to do better than this type of sophomoric argument, EZ.", 
   {}, 
   124351, 
   null, 
   1116390360.0
  ], 
  [
   124414, 
   null, 
   "thebootfitter", 
   "Well, first of all, I do not pray, and I do not see how you would just assume that I did, because my post does not reflect that notion.\n\n I assumed nothing. In fact, I asked you a simple question, too: \"Do you pray to Christ?\" This initial question was followed by other conditional questions.\n \n \nSecond, you are not the person to whom I addressed my question to . If you will note the quote, I was addressing Truthsayer. Truthsayer posted that he/she , did not pray to a name or a face. I would like to know to what or to whom, are the prayers of TS directed.\n\n I did, in fact, note that you were addressing the question to Truthsayer. You made some comments on a public forum, and I (being part of the 'public') had a response to your comments. Truthsayer is welcome to respond to your questions/comments in anyway s/he wishes. You are welcome to respond to my questions/comments in anyway you wish. Just as you're curious about TS's responses... I'm curious about your responses.\n \n I noted that you already answered one of the questions when you indicated that you do not pray. If you are so inclined to respond again, here was my other question: \"Would you feel that someone praying to Zeus equates to merely talking to oneself? How about Mithra? Or Krishna?\"\n \n Peace,\n The Bootfitter", 
   {}, 
   124396, 
   null, 
   1116390900.0
  ], 
  [
   124463, 
   null, 
   "maximus", 
   "What is one to say about this great orb of knowledge, Truthsayer, who seems to possess all of the answers? How are we to respond to this immense intellect? How do we articulate a rebuttal to his eloquent diatribes and respectful insults? Has the helpless, feeble, Christian any hope in the face of this overwhelming scholar?\n \n Should we embrace his endearing appellations and accept our destiny as \"religious nuts, Lazy minds, Jesus freaks, and the lazy ones\" with jokes, and compliments and friendly banter? (All the while watching silently as Easyrider is chastised for a belligerence seemingly not much worse?)\n \n Have we any recourse when we see that he cites the well respected, scholarly work of The DaVinci Code  as a source for one of his assertions. \n \n Maybe his reliance on the Masons will assure us:\n \n \nAlso, I suggest you get to know someone who is a Freemason. There's one in every family almost. However, you may not have much luck getting any information out of them. They hold their knowlege pretty close to their breasts. Their knowlege has had them murdered, ostrasized, oppressed and physically assaulted in the past as much of it goes against the teachings of the RCC and there was a time that anyone holding any kind of knowlege that would damage the mythical and supertitious teaching of the church was put to death. \n \n They have a lot of knowledge but you won't be able to learn any of it because they hold it close to their breasts. This knowledge that they won't reveal has somehow become known to the Church which murdered and persecuted them. I wonder what he will cite for this one? Will it be the great DaVinci Code  again?\n \n Or shall we appreciate his scholarly work by this fine quote:\n \n \nHere's some more religous trivia for you spiritual fans...\n \n Q. Who declared, \"'It has served us well, this myth of Christ'?\n \n <Jeopardy theme song plays in the background<\n \n A. <drum roll please< Pope Leo X\n\n He seems to present this as fact. Yet he does not cite a source. Even that's excusable because none of us always do that. But to do that and at the same time accuse Christians of being lazy and uneducated in their investigations seems a bit ODD. (Again, we sit silently as Easyrider is decried for citing falsehoods but not much is said to reprimand Truthsayer). \n \n When confronted by Big Orn with the point that this quote probably comes from a play written by an ex-priest who pushed other falsehoods concerning religion as well, Truthsayer calmly shrugs it off. His response is even more impressive:\n \n \nPoint taken and well heeded. Truth is, none of us was around back then and we only go on what we have come to learn. Whether or not this knowlege is factual or not is only speculative. That goes for just about any side of the debate. The best we can do is assume and speculate since no one really knows for sure the \"real deal.\" Some call it \"faith.\" And I do conceed that I don't have much faith in what has been passed down to us over the centuries.\n \n But, being one proned to logic and reason, it is far more difficult for me to take on faith things are are clearly myth and superstition and it is much easier for me to believe Pope Leo X said that than, say, the oceans parting or water turning into wine or virgin conception. \n \n Truthfully, what makes more sense to you? Which is easier for you to believe? Pope Leo or the founders of the Roman Church that invented the early form of christianity with all of it's miracles and absurdities?\n \n Since neither one of us were there..........\n\n \"None of us there, we can only go on what we have come to learn, whether or not this knowledge is factual or only speculative...that goes for just about any side of the debate.\" He seems to admit that any side of the debate is somewhat factual and somewhat speculative. I wonder if he remembers to include his side of the debate in that caveat. Or can he see past his own dogma that overpowers that of the Catholic Church? \"No one really knows the real deal,\" except perhaps the Great Truthsayer, with his dismissal of all things Christian. \n \n What does this mean? If one cannot substantiate Jesus existed or who the true version of Jesus was then how does one substantiate that this very same Jesus of Christianity has been amalgamated from all the other religions and Gods? If there is no proof of or knowledge of who Jesus really was then how does one know that he was a melting pot of other religions? How does one assert that this Jesus is actually Mithras, etc. If there is no proof of Jesus then it seems that there is no proof of Mithras. (Interestingly enough, the Jewish religion was the one religion that insisted on its followers not worshipping other gods or incorporating them into their own religion--Baal, the golden calf, etc. I also find it very odd that Jesus looked just like a human (except at the Transfiguration), and acted for the most part like a human. He was not a bull man or serpent head or combination of various gods. Why is this odd? If the writers of the Bible wanted to surpass the other religions or mimic them then why would they not portray that visibly in their own god? Why make him seem so human? Why not give him outrageously dazzling powers--even when he performed miracles he told the witnesses not to tell others). \n \n I am glad though, that he is prone to logic and reason. I must assume that his logic and reason includes attributing quotes to people falsely. He trades a myth of false quotation  for the supposed myth of Christianity. He trades the invention of a Pope's words  for the supposed invention of the Christian religion by the early Church. Interesting logic and reason. \n \n \"Neither of us were there\" but his position seems so much more lofty, educated, and worthwhile.\n \n He goes further:\n \nBut I must admit, you do carry yourself well as a christian and do not display the signs of a hater like some other people on this site who profess to be christian. I think I am going to enjoy our dialog.\n \n Regardless of what I think, know that I respect you and your faith as long as you can keep the conversations civil.\n \n You might be surprised to know that I am very spiritual and I do pray a lot. I just can't place a name of face to whatever supreme being I am praying to. Further, I think it would be rather arrogant on my part to assume that I do, all things considered.\n\n So civil in his debate, he carries himself so well, what great respect he has shown for our faith thus far. As long as one is not a hater and is respectful he will interact. He warns Big Orn to stay civil but it seems that he forgot most of the above admonitions in his very first post of the thread. He is very spiritual and prays a lot but those who pray to a revealed God are ignorant and uneducated--what must our prayer be like in our demented state??!!\n \n Perhaps his humor will console us. We listen to him tell something funny:\n \n \nWanna hear something even funnier? Many of the christian followers I have talked to think that \"Jesus Christ\" is the name of of their god. They have no clue that it is a title and not his \"real\" name. Wanna talk about lazy?\n\n But does he consider that we call Jesus--\"Christ\"--as we might respectfully and sentimentally call our father, who is named Bob, \"Dad?\" So that we hardly ever end up calling our father \"Bob\" and almost always call him \"Dad.\" So that a title then becomes a name--one of many names--Lord of Lords and King of Kings, The Word of God, The Son of God, The Son of Man, prophet, priest, etc. \n \n Again we see such great respect from him. He compliments us as travelers of la-la land and mental patients:\n \n \nI mean, one really doesn't have to be that educated when you think about it. Anytime somebody goes into la-la land speaking about things like virgin conception, water miraculously turning to wine, people who are actually dead for days suddenly coming back to life, the ocean parting at the rise of a staff (stick,) and other impossible myths, a red flag should go off in their head, educated or not. If it doesn't, they truly have some mental issues they need to personally address. Although, I personally do find these people to be rather humorous on occassion, I try my best not to show my amusement as some people do take offense to that and they just can't understand why I can't believe in such poppycock myself. Even in elementry school, when I came to learn that Santa Clause was a fairy-tale, I never told my under classmen and found humor in their beliefs. I knew something they didn't know. Neener, neener. \n \n \n \nSomebody's been doing their homework. And right you are sir. Having been educated, isn't it kinda hard not to laugh at some of the people who try to speak with authority using their religion or the bible as their \"indisputable source?\" Their very foundation is shifting sand. Smoke and mirrors. Santa Claus. If they do ever educate themselves, they will be in a long term state of embarassment. I know that it takes all I can do to keep from laughing at them. But I don't want to be rude.\n\n He has been educated. And it seems that no Christians have. There is no biblical scholarship, no archaeology, no history, no hagiography, no linguistics. Christianity is a barren, destitute, contriving enterprise. All it can lead to is embarrassment. Furthermore, Constantine is solely responsible for the Christian faith and the 400 years until his reign were fruitless times dripped in the blood of martyrs. Now I must crawl back into my hole with my Bible and hover in the darkness away from the real world of knowledge, common sense, worth, and sensibility.", 
   {
    "unicode_changes_made": true
   }, 
   124414, 
   null, 
   1116400140.0
  ], 
  [
   124464, 
   null, 
   "maximus", 
   "Can anyone name the first diety that had the following myths attributed to him/her?\n \n Virgin birth\n Twelve followers\n Killing and resurrection\n Miracles\n Birthdate on December 25\n Morality\n Mankind's savior\n Known as the Light of the world\n \n If you said Jesus..... you haven't been paying attention and will believe anything anyone tells you.\n \n The answer is Mithra. A Roman religion that predates christianity by centuries. In other words, Christianity was a knock off religion. A religion invented on the foundation of other mythical religions. So when the religious nuts try to validate their superstitions by the authority of the bible and all that Jesus smack, I am quick to remember that their basis of knowlege is built on a false, second hand foundation that is no more legitimate than the Mithra religion was, 600-1200 BC.\n\n \n http://tektonics.org/copycat/mithra.html\n Scroll down to the section titled, \"Priming the Pump with Parallels?\"", 
   {}, 
   124414, 
   null, 
   1116400260.0
  ], 
  [
   124507, 
   null, 
   "greg 79 f150", 
   "I assumed nothing. In fact, I asked you a simple question, too: \"Do you pray to Christ?\" This initial question was followed by other conditional questions.\n \n \n I did, in fact, note that you were addressing the question to Truthsayer. You made some comments on a public forum, and I (being part of the 'public') had a response to your comments. Truthsayer is welcome to respond to your questions/comments in anyway s/he wishes. You are welcome to respond to my questions/comments in anyway you wish. Just as you're curious about TS's responses... I'm curious about your responses.\n \n I noted that you already answered one of the questions when you indicated that you do not pray. If you are so inclined to respond again, here was my other question: \"Would you feel that someone praying to Zeus equates to merely talking to oneself? How about Mithra? Or Krishna?\"\n \n Peace,\n The Bootfitter\n\n \n \n \n No , I would not. Because as you say, they ARE praying to Mithra, Zeus, or Krishna. Therefore they are praying to some diety, spirit, etc. TS said he/she prays to NO name or face. Do you now see the crux of my question to TS ? I am not trying to derail the topic to question the validity of prayer, that is a very personal issue to those that practice it . Once again simple question, from a simple person... \n \n On a side note, it is a unwritten simple courtesy to the poster, to give the the person being asked the question , the opportunity to answer FIRST. That way the question can be answered without dilution from others. After the question is answered by the OT poster, then other posters are free to ask/post what they may in reference to that answer. That is why posters will put a post in quote, to get the original poster to reply to that post. But as we can see, people will do freely as they want, :)", 
   {}, 
   124414, 
   null, 
   1116419520.0
  ], 
  [
   124548, 
   null, 
   "Truthsayer", 
   "Well, I suppose I should should answer the question posed to me before our honorable Christian brethren break out their M-16's. :p (just a little humor there...) Actually, I thought my opinion was clear but obviously I am mistaken so I will try again. \n \n In a nutshell.....\n \n I acknowlege something inside me that points my thoughts, for lack of a better word, to the heavens, or that is to say, something bigger and better than myself. What I might call a prayer, someone else might call a meditation. I do not pretend to know the source of this inspiration. I do not visualize a lily-white face of a long haired man in a flowing robe when I do find myself in this odd form of communication. I only hope my thoughts and desires are heard. I cannot prove that he/she/it/they/them/?/ exists nor would I be so nieve to assume I could. Therefore, you will not see me knocking on your door, passing out tracts, preaching in an airport, on a soapbox, or anywhere else for that matter trying to convince you of my personal, spiritual experiences. I find people that ascribe to the ideology that \"There is no way to the father except through the son\" rather boring actually. Just as I find the RCC ideology that non-Catholics are doomed to a fiery eternity to be arrogant. The same with Jehovah's Witnesses or anyone for that matter who are arrogant enough to make such absurd proclaimations. When I see these type people, I cross the street to avoid them. They have nothing, in my humble opinion, to offer me that is of any substance or value. (Thus my refusal to jump in the hateful t1t-for tat dialog that ensues when their views are challenged.....(see above/past posts on this thread.)\n \n I cannot engage in serious dialog, nor trade un-needed personal insults with anyone who who is angered at me for pointing out what I consider to be poppy-XXXX myth and legend especially when they start posting \"Mark-this\" or \"Luke-that\" or \"Matthew-the other\" references as if they were to be taken as a reliable source. As much as I enjoyed reading the Holy Bible several times, I cannot seriously consider taking it for anything concrete, anymore than I can take anyone who believes in the infoulability of it seriously.\n \n If you want to get mad at me for not buying the story about the ocean dividing in two as \"God's Chosen\" people walked across the ocean floor to escape Egypt, so be it. If you want to get mad at me because I don't swallow the myth of jugs of water miracoulsly turning into fine vintage wedding wine, so be it. If you want to get pissy with me because I giggle inside when people start talking about people who have been dead for days suddenly coming back to life and ascending into a cloud while trumpets blaze and demon infested pigs run over a cliff as an Ark with two of each kind of animals floats by....so be it.\n \n If you want to get mad at me for pointing out historical religions that share common myths with many of today's religions because it dilutes the myths and legends you have chosen to believe, so be it. \n \n If you are one of those third-graders that I told \"There is no Santa Claus\" to, and I scarred you for life, my apologies. Further, my apologies to anyone else I have offended with my opinions and thoughts.\n \n There....get as mad as you want. emoticon_mad I am nothing more than the simple child that shouted, \"Look! The Emperor has no clothes!!\" If you are one of those that get angry about that, what can I say? The dude's naked. See what you want to see. Believe what you want to believe. It's no hair off my butt. It's kinda funny actually. I try to find humor anywhere I can.", 
   {}, 
   124507, 
   null, 
   1116434220.0
  ], 
  [
   124615, 
   null, 
   "thebootfitter", 
   " ...Just as I find the RCC ideology that non-Catholics are doomed to a fiery eternity to be arrogant.\n\n I'm not certain from where you pulled this bit of mis-information, but the RCC does not profess that non-Catholics are doomed to a fiery eternity. That is one of the common misperceptions of the RCC.", 
   {}, 
   124548, 
   null, 
   1116440580.0
  ], 
  [
   124618, 
   null, 
   "Truthsayer", 
   "I'm not certain from where you pulled this bit of mis-information, but the RCC does not profess that non-Catholics are doomed to a fiery eternity. That is one of the common misperceptions of the RCC.\n\n \n Perhaps. I am not Catholic. But I can tell you for sure that two gentlemen, one a financial consultant (Matt) and one, a Urologist (Thomas) sat at my dinner table and stated exactly that to me. They are both HARD CORE Catholics and the stated matter-of-factly that the RCC was the true church of Jesus Christ and no others would be allowed into heaven.\n \n It was then that I realized that I had my money in one man's hand and my :xcensored in the other's and they were both dillusional. Needless to say, I don't work with them anymore.", 
   {}, 
   124615, 
   null, 
   1116441180.0
  ], 
  [
   124635, 
   null, 
   "notdakuningist", 
   "@Maximus\n That was a pretty good response to the idea of a mithrian connection, but the paper does seem to only focus on the \"apostolic\" church. What about later church traditions such as the celebration dates for both Easter and Christmas as well as the \"quote\" from pope Leo?", 
   {}, 
   124618, 
   null, 
   1116444000.0
  ], 
  [
   124697, 
   null, 
   "Truthsayer", 
   "I had read somewhere that the early church claimed that Satan, \"The Great Deceiver\" went back in time and created the Mithra Religion to debunk or to cast doubt on Christianity, centuries down the road. I am not certain how accurate that claim is however, I merely read it somewhere.\n \n But I suppose to someone who has no problem believing the other Christian myths and superstitions, that particular myth probably isn't that hard for them to believe either.", 
   {}, 
   124635, 
   null, 
   1116453060.0
  ], 
  [
   124881, 
   null, 
   "greg 79 f150", 
   "[/QUOTE]Well, I suppose I should should answer the question posed to me before our honorable Christian brethren break out their M-16's. (just a little humor there...) Actually, I thought my opinion was clear but obviously I am mistaken so I will try again. \n \n In a nutshell.....\n \n I acknowlege something inside me that points my thoughts, for lack of a better word, to the heavens, or that is to say, something bigger and better than myself. What I might call a prayer, someone else might call a meditation. I do not pretend to know the source of this inspiration. I do not visualize a lily-white face of a long haired man in a flowing robe when I do find myself in this odd form of communication. I only hope my thoughts and desires are heard. I cannot prove that he/she/it/they/them/?/ exists nor would I be so nieve to assume I could. \n \n \n Well all right now, the guru from the Mount of Illusions of Granduer, finally answers ! And besides that, TS just gave me a warm and fuzzy by talking down to me , and making me feel honored at the same time, by replying at all ! Gosh, I have known of people having to pay 200 a dollars a hour to a professional shrink , to get this kind of treatment, and shucks, I received it for FREE ! Datgone I's a datburn lucky fellar to git dat , me bein' iggot an awl, :) ....<<\n \n \n With your description given as it is, I think with you stating in the OT that you \"pray \" often, sets a misleading tone , a tone that does not match the message you are giving here. Your message and belief being , ( my read on it anyway) is that the diety of Christ has never been real, or at best , His personification is just a clone of many ancient mythology gods. I believe that when you state above that your \"prayer\", is more like a \"self meditation\", this description in itself is more accurate . I will not speak for all here, but my interpretation of prayer usually denotes one making a mental \"connection\" with the Christ spirit , the deity of God, or is actually directing their prayers to the diety of their choice, be it Christ, Krishna, Zeus, Santa Claus, etc. jmo", 
   {}, 
   124548, 
   null, 
   1116472680.0
  ], 
  [
   124899, 
   null, 
   "Easyrider", 
   "QUOTE: Can anyone name the first diety that had the following myths attributed to him/her?\n \n Virgin birth\n Twelve followers\n Killing and resurrection\n Miracles\n Birthdate on December 25\n Morality\n Mankind's savior\n Known as the Light of the world\n \n If you said Jesus..... you haven't been paying attention and will believe anything anyone tells you.\n \n The answer is Mithra. A Roman religion that predates christianity by centuries.\n \n Wrong!!\n \n How did the comparison with Mithra start? Did it start by the Jewish scholars who lived at the same time and would have known about these religions and were themselves trying to discredit Jesus? No, it started with an Islamic writer named Yousuf Saleem Chishti, in his book, What is Christianity. This book is available by the way in a classics edition from Islamic booksellers. He wrote in this book on pages 87-88, \"Mithra was considered the son of God, he was a savior, he was born of a virgin, he had twelve disciples, he was crucified, he rose from the grave the third day, he atoned for the sins of humankind, and he returned to his father in heaven.\" \n \n Where did he get this information? No one knows, he listed no sources, and none have been found. However that didn't stop a writer in the late 1800s and early 1900s named Gerald Massey from using Chishti as his source for the same information.\n \n What is interesting is the way that others have built on Chishti's initial claims. The really bizarre claim added to Chishti's by later writers is that of Mithra supposedly being born on December 25. You see this is mentioned nowhere in the bible about Christ, but was chosen by the early church with no claims to being Jesus' actual birth date. \n \n What do we know about the Mithra cult? I quote from Ronald Nash in Christianity and the Hellenistic World, \" We do know that Mithraism, like its mystery competitors, had a basic myth. Mithra was supposedly born when he emerged from a rock; he was carrying a knife and torch and wearing a Phrygian cap. He battled first with the sun and then with a primeval bull, thought to be the first act of creation. Mithra slew the bull, which then became the ground of life for the human race.\" Nash and other scholars are unanimous in their conclusions that the so-called \"simularities\" between Mithra and Christ are not found prior to the advent of Christianity and the birth of Jesus. It was only after Christianity became established that pagan influences merged with and borrowed from Christianity to come up with the alleged simularities previously mentioned in this post.  (members.aol.com) \n \n Conclusion: The so-called Mithra simularities are bogus and have no basis in fact. \n \n Christ is the real thing.", 
   {
    "unicode_changes_made": true
   }, 
   124881, 
   null, 
   1116476340.0
  ], 
  [
   124943, 
   null, 
   "canadianman76", 
   "But, being one proned to logic and reason, it is far more difficult for me to take on faith things are are clearly myth and superstition and it is much easier for me to believe Pope Leo X said that than, say, the oceans parting or water turning into wine or virgin conception.\n\n \n They proved that the parting of the sea was true, but it wasnt the red sea, if you translate it properly, it was \"the sea of reeds\" and they found a relativley shallow inlet that they may have crossed when a tsunami that happened very close to the same time came across the ocean.\n when the wave came in the water would have receded long enough for them to make it across, and then the wave would have came in and devastated anything still in the area.\n this may sound far out, but it could have happened and there is strong evidence that it did.", 
   {}, 
   120250, 
   null, 
   1116503460.0
  ], 
  [
   124944, 
   null, 
   "Eddie", 
   "They proved that the parting of the sea was true, but it wasnt the red sea, if you translate it properly, it was \"the sea of reeds\" and they found a relativley shallow inlet that they may have crossed when a tsunami that happened very close to the same time came across the ocean. \n\n \n You mean that they proved that the parting of the sea was possible? I have a hard time elieving anyone could prove that it actually did happen.", 
   {}, 
   124943, 
   null, 
   1116504720.0
  ], 
  [
   124991, 
   null, 
   "unkerpaulie", 
   "Wrong!!\n \n Christ is the real thing.\n\n dont you realise that all the \"facts\" we have about christ are replicas of the myths about mithra, and other mythical deities? how could jesus have an arbitrary birth date, or none at all so that he had to borrow his from someone else? \n \n there are many other cults whose deity was born of a virgin, celebrate communion, and was crucified and resurrected, just as the gospels say jesus was. why such a strong resemblance to cult beliefs if jesus was the real thing?", 
   {}, 
   124899, 
   null, 
   1116520740.0
  ], 
  [
   125060, 
   null, 
   "trebor", 
   "dont you realise that all the \"facts\" we have about christ are replicas of the myths about mithra, and other mythical deities? how could jesus have an arbitrary birth date, or none at all so that he had to borrow his from someone else? \n \n there are many other cults whose deity was born of a virgin, celebrate communion, and was crucified and resurrected, just as the gospels say jesus was. why such a strong resemblance to cult beliefs if jesus was the real thing?\n\n \n \n Don't you know that Satan made those other stories up to confuse people about Jesus. Never MIND that those other stories predates Jesus, because satan knew what was going to happen.", 
   {}, 
   124991, 
   null, 
   1116526620.0
  ], 
  [
   125272, 
   null, 
   "Easyrider", 
   "QUOTE: there are many other cults whose deity was born of a virgin, celebrate communion, and was crucified and resurrected, just as the gospels say jesus was. why such a strong resemblance to cult beliefs if jesus was the real thing?\n \n I've never seen one stand up to scrutiny that parallels Jesus to any real extent. Here's an article for you on that.\n \n http://www.crosswalk.com/faith/ministry_articles/1321410.html", 
   {}, 
   125060, 
   null, 
   1116545100.0
  ], 
  [
   125277, 
   null, 
   "Easyrider", 
   "Orion's Follies: Translation: believe as I do, accept what I say, or else you're a liar or worse. You're going to have to do better than this type of sophomoric argument, EZ.\n \n Go tell it to Spong or Ted (belch) Kennedy, or John Kerry, or one of your other whining, liberal bedwetters. Your \"feel-good, anything goes (gay sex, fornication, lying for Spong, etc.)\" theology has been refuted and repudiated, Orion. \n \n Jesus Reigns!", 
   {}, 
   124404, 
   null, 
   1116545580.0
  ], 
  [
   125364, 
   null, 
   "Orion", 
   "Re: Who is the liar? It is the man who denies that Jesus is the Christ. Such a man is the antichrist...\" I John 2:22\n \n \nOrion's Follies: \"Translation: believe as I do, accept what I say, or else you're a liar or worse. You're going to have to do better than this type of sophomoric argument, EZ.\"\n\n \n \nGo tell it to Spong or Ted (belch) Kennedy, or John Kerry, or one of your other whining, liberal bedwetters.\n\n \n Sorry, EZ, I can't make any sense of this remark. Or are you simply lashing out?\n \n \nYour \"feel-good, anything goes (gay sex, fornication, lying for Spong, etc.)\" theology has been refuted and repudiated, Orion.\n\n \n This, from someone who constantly demands of me that I explain my theology to him. Way to go, EZ.", 
   {}, 
   125277, 
   null, 
   1116554160.0
  ], 
  [
   125371, 
   null, 
   "Dzeron", 
   "Orion's Follies: Translation: believe as I do, accept what I say, or else you're a liar or worse. You're going to have to do better than this type of sophomoric argument, EZ.\n \n Go tell it to Spong or Ted (belch) Kennedy, or John Kerry, or one of your other whining, liberal bedwetters. Your \"feel-good, anything goes (gay sex, fornication, lying for Spong, etc.)\" theology has been refuted and repudiated, Orion. \n \n Jesus Reigns!\n\n \n Easyrider's Modus Operandi:\n \n 1) Assuming what he is trying to prove\n \n 2) Assuming he has won the argument\n \n 3) Associating everyone who disagrees with such fallacies with belching liberals and \"anything goes theology\"\n \n 4) Calling every refutation of his arguments \"follies\"\n \n 5) Saying the most stupid things in the most condescending manner\n \n 6) If all else fails, inserting a threat of hell at the end always does the trick\n \n I believe the technical term is rantum fanaticalius post forgetere medicationis", 
   {}, 
   125277, 
   null, 
   1116554820.0
  ], 
  [
   125390, 
   null, 
   "Easyrider", 
   "Dzeron must have missed his cat-nap today.\n \n Hey Dzeron - get Christ before you perish!", 
   {}, 
   125371, 
   null, 
   1116559320.0
  ], 
  [
   125409, 
   null, 
   "trebor", 
   "Dzeron must have missed his cat-nap today.\n \n Hey Dzeron - get Christ before you perish!\n\n \n \n Actually, he summed you up quite accurately. You should start to live Christ's message before it's crispy critters for you. It's not enough to proclaim faith with your lips, you have to live it. So far, you are failing miserably.\n \n What horrible , evil thing did you do that made you so unforgiving and rigid about \n faith? It must have been a doozy.", 
   {}, 
   125390, 
   null, 
   1116561960.0
  ], 
  [
   125433, 
   null, 
   "johnson", 
   "Dzeron must have missed his cat-nap today.\n \n Hey Dzeron - get Christ before you perish!\n\n \n This seems a little cruel to me. Shouldn't you be speaking with compassion and respect , or have I misinterpeted the bible??", 
   {}, 
   125390, 
   null, 
   1116566580.0
  ], 
  [
   125438, 
   null, 
   "johnson", 
   "[QUOTE=trebor You should start to live Christ's message before it's crispy critters for you. It's not enough to proclaim faith with your lips, you have to live it. So far, you are failing miserably.\n \n This also seems a little cruel!\n \n Is this what this forum has become ?, \n \n Or just this thread ?", 
   {}, 
   125409, 
   null, 
   1116567660.0
  ], 
  [
   125453, 
   null, 
   "Redratio1", 
   "This seems a little cruel to me. Shouldn't you be speaking with compassion and respect , or have I misinterpeted the bible??\n\n \n Hellfire and brimestone has always been the tool of choice for organized Christianity. Nothing indoctrinates behavior better than a little fear of eternal suffering.", 
   {}, 
   125433, 
   null, 
   1116570840.0
  ], 
  [
   125460, 
   null, 
   "maximus", 
   "@Maximus\n That was a pretty good response to the idea of a mithrian connection, but the paper does seem to only focus on the \"apostolic\" church. What about later church traditions such as the celebration dates for both Easter and Christmas as well as the \"quote\" from pope Leo?\n\n Notdakuningist,\n The Catholic Church remains an apostolic church to this day. The current bishops can be traced back in an unbroken line to the apostles (so too in the Orthodox Church).\n \n Catholics, and Christians in general, do not hold that December 25th is the actual birthdate of Christ. It is a day of commemoration. Christmas was not a feast day in the Church until about the 200s. And even then it was not a set day and different areas celebrated it at different times. But this does nothing to diminish the value of celebrating the Lord's birth and reflecting on the nativity of the Gospel of Luke.\n \n What specific questions do you have about Easter? I will try to do my best to answer.\n \n As far as the Pope Leo quote, I did address that in my first post (Big Orn also addressed it before that). It is attributed to an ex-Catholic priest playwright who had an animosity to the papacy. See this link:\n \n http://www.tektonics.org/lp/popeleox.html", 
   {}, 
   124635, 
   null, 
   1116571560.0
  ], 
  [
   125463, 
   null, 
   "johnson", 
   "Hellfire and brimestone has always been the tool of choice for organized Christianity. Nothing indoctrinates behavior better than a little fear of eternal suffering.\n\n \n Too bad I'm not motivated by fear.", 
   {}, 
   125453, 
   null, 
   1116571860.0
  ], 
  [
   125464, 
   null, 
   "johnson", 
   "Or should I say I'm glad I'm not motivated by fear??", 
   {}, 
   125463, 
   null, 
   1116571920.0
  ], 
  [
   125476, 
   null, 
   "maximus", 
   "Well, I suppose I should should answer the question posed to me before our honorable Christian brethren break out their M-16's. :p (just a little humor there...) Actually, I thought my opinion was clear but obviously I am mistaken so I will try again. \n \n In a nutshell.....\n \n I acknowlege something inside me that points my thoughts, for lack of a better word, to the heavens, or that is to say, something bigger and better than myself. What I might call a prayer, someone else might call a meditation. I do not pretend to know the source of this inspiration. I do not visualize a lily-white face of a long haired man in a flowing robe when I do find myself in this odd form of communication. I only hope my thoughts and desires are heard. I cannot prove that he/she/it/they/them/?/ exists nor would I be so nieve to assume I could. Therefore, you will not see me knocking on your door, passing out tracts, preaching in an airport, on a soapbox, or anywhere else for that matter trying to convince you of my personal, spiritual experiences. I find people that ascribe to the ideology that \"There is no way to the father except through the son\" rather boring actually. Just as I find the RCC ideology that non-Catholics are doomed to a fiery eternity to be arrogant. The same with Jehovah's Witnesses or anyone for that matter who are arrogant enough to make such absurd proclaimations. When I see these type people, I cross the street to avoid them. They have nothing, in my humble opinion, to offer me that is of any substance or value. (Thus my refusal to jump in the hateful t1t-for tat dialog that ensues when their views are challenged.....(see above/past posts on this thread.)\n \n I cannot engage in serious dialog, nor trade un-needed personal insults with anyone who who is angered at me for pointing out what I consider to be poppy-XXXX myth and legend especially when they start posting \"Mark-this\" or \"Luke-that\" or \"Matthew-the other\" references as if they were to be taken as a reliable source. As much as I enjoyed reading the Holy Bible several times, I cannot seriously consider taking it for anything concrete, anymore than I can take anyone who believes in the infoulability of it seriously.\n \n If you want to get mad at me for not buying the story about the ocean dividing in two as \"God's Chosen\" people walked across the ocean floor to escape Egypt, so be it. If you want to get mad at me because I don't swallow the myth of jugs of water miracoulsly turning into fine vintage wedding wine, so be it. If you want to get pissy with me because I giggle inside when people start talking about people who have been dead for days suddenly coming back to life and ascending into a cloud while trumpets blaze and demon infested pigs run over a cliff as an Ark with two of each kind of animals floats by....so be it.\n \n If you want to get mad at me for pointing out historical religions that share common myths with many of today's religions because it dilutes the myths and legends you have chosen to believe, so be it. \n \n If you are one of those third-graders that I told \"There is no Santa Claus\" to, and I scarred you for life, my apologies. Further, my apologies to anyone else I have offended with my opinions and thoughts.\n \n There....get as mad as you want. emoticon_mad I am nothing more than the simple child that shouted, \"Look! The Emperor has no clothes!!\" If you are one of those that get angry about that, what can I say? The dude's naked. See what you want to see. Believe what you want to believe. It's no hair off my butt. It's kinda funny actually. I try to find humor anywhere I can.\n\n Truthsayer,\n It sounds like you pray a lot like Christians do. I don't know any Christians that pray to a lily-white faced, white-haired man. But what's wrong if they do? You are all inclusive and accepting right? \n \n You wouldn't attempt to offer your beliefs to someone else like a Jehovah but you very comfortably disparage others beliefs. And I am not talking about good sound debate because that is not what you have offered thus far. There's nothing wrong with good, strong-worded, educated debate. \n \n You seem like you do avoid tit-for-tat conflicts though. You simply do your name calling and bow out.\n \n What puzzles me is your uproar over the ignorance and lack of education of Christians but when called on your posting of inaccurate and even false assertions you have no response. You attempt to show the ignorant and uneducated Christian the error of his ways by displaying the same traits you abhor. Instead of responding, you resort to a testimony of your own idealogy-that's similar to saying it's in the Bible, it's true, that's it--the response which you so vehemently detest.\n \n You distance yourself from those who offer the Gospel to others. Even if the Jehovah's do offer an off-beat version of the Word of God, I've always known them to offer it peacefully and politely. One thing we may agree upon--we should not \"push\" the gospel on anyone. But this is something different than willful discussion or debate or even sharing information. On the surface, the description of your idealogy seems so clean, pure, cordial, fluffy, and especially tolerant and inclusive. But there is something underneath all that that has come to the surface on this thread. \n \n In my humble opinion, the Jehovah's do have you beat on politeness and diplomacy. I've never had them come to my door and begin by calling me a lazy, uneducated, freaky, nut, mental case in la-la land. Condescension is so much more noble than than the traits you despise in Christians and other theists.", 
   {
    "unicode_changes_made": true
   }, 
   124548, 
   null, 
   1116573420.0
  ], 
  [
   125479, 
   null, 
   "maximus", 
   "Perhaps. I am not Catholic. But I can tell you for sure that two gentlemen, one a financial consultant (Matt) and one, a Urologist (Thomas) sat at my dinner table and stated exactly that to me. They are both HARD CORE Catholics and the stated matter-of-factly that the RCC was the true church of Jesus Christ and no others would be allowed into heaven.\n \n It was then that I realized that I had my money in one man's hand and my in the other's and they were both dillusional. Needless to say, I don't work with them anymore.\n\n Truthsayer,\n You may want to contact your acquaintances and tell them to read the official teaching of the Church. They were referring to paragraph 846 in The Catechism of the Catholic Church:\n \n 846 How are we to understand this affirmation, often repeated by the Church Fathers? Re-formulated positively, it means that all salvation comes from Christ the Head through the Church which is his Body: \n \n Basing itself on Scripture and Tradition, the Council teaches that the Church, a pilgrim now on earth, is necessary for salvation: the one Christ is the mediator and the way of salvation; he is present to us in his body which is the Church. He himself explicitly asserted the necessity of faith and Baptism, and thereby affirmed at the same time the necessity of the Church which men enter through Baptism as through a door. Hence they could not be saved who, knowing that the Catholic Church was founded as necessary by God through Christ, would refuse either to enter it or to remain in it.\n \n But they might not have read this one right after it:\n \n 847 This affirmation is not aimed at those who, through no fault of their own, do not know Christ and his Church: \n \n Those who, through no fault of their own, do not know the Gospel of Christ or his Church, but who nevertheless seek God with a sincere heart, and, moved by grace, try in their actions to do his will as they know it through the dictates of their conscience - those too may achieve eternal salvation.\n (emphasis mine)\n \n A foundation for the teaching of paragraph 847 may be found all the way back in scripture.\n \n 2 Peter 3:9: 9The Lord is not slow in keeping his promise, as some understand slowness. He is patient with you, not wanting anyone to perish, but everyone to come to repentance.\n \n Romans 2:13-16: 13For it is not those who hear the law who are righteous in God's sight, but it is those who obey the law who will be declared righteous. 14(Indeed, when Gentiles, who do not have the law, do by nature things required by the law, they are a law for themselves, even though they do not have the law, 15since they show that the requirements of the law are written on their hearts, their consciences also bearing witness, and their thoughts now accusing, now even defending them.) 16This will take place on the day when God will judge men's secrets through Jesus Christ, as my gospel declares.\n \n This scripture makes clear the teaching of the Church in the above 2 paragraphs of the Catechism: Jesus Christ is the source of all salvation (whether one knows it or not). The Church he established, The Catholic Church, is the most appropriate means of achieving that salvation--the means he ordained on earth  to achieve the end  of heaven. But, although God binds the Church, he is not bound by the Church.\n \n If you want to ensure the accuracy of my quotes from the Catechism then you can click here for an on-line version:\n \n http://www.scborromeo.org/ccc.htm \n \n (You may also find paragraphs 839-845 interesting as they discuss the Church's relationship with other religions and those religions participation in the plan of salvation).", 
   {}, 
   125476, 
   null, 
   1116574560.0
  ], 
  [
   125489, 
   null, 
   "canadianman76", 
   "You mean that they proved that the parting of the sea was possible? I have a hard time elieving anyone could prove that it actually did happen.\n\n Yeah, its a stretch, but it all happend around the same time, and that makes somethihg that used to seem rediculous, now seem as you say possible. I used to think that the flood was preposterous.\n Where did all the water go!!!!! Then the scientists started yammering about how if the ice caps melted that the coastlines and most of florida would be under water. More if they completely melted.\n I still thought that it was ludicrous, there isnt even close to the amount of water needed to flood the entire earths surface, even if all the caps melted. Then it was brought to my attention how many hundreds of tons of water were contained in an average sized cloud, let alone something as massive as a supercell.\n And the clouds we can see are only a fraction of the moisture in the air.\n Scientists have calculated that if the entire atmospheres humidity were as dry as the dryest desert air, there is easily enough water to cover even the highest mountain on the planet.\n \n Personally, I think the big guy is up there and he doesnt work through miracles, he uses the mechanics of his universe to perform the seemingly miraculous feats we have heard about. And I'm not trying to be disrespectfull either. The (science and technology if you will) that he uses would probably be impossible for us to understand. I think that he exists as a being in more dimensions than us. (Like us compared to a cartoon on a piece of paper. try to explain to the cartoon what depth is.) As for the devil, he threw a big hissy fit when the new kid showed up (mankind) and he didnt have dad all to himself. It would make things way easier for all of us if he would stop acting up and trying to make baby brother stick a preverbial fork in the toaster!!!", 
   {}, 
   124944, 
   null, 
   1116582600.0
  ], 
  [
   125496, 
   null, 
   "greg 79 f150", 
   "Truthsayer,\n It sounds like you pray a lot like Christians do. I don't know any Christians that pray to a lily-white faced, white-haired man. But what's wrong if they do? You are all inclusive and accepting right? \n \n You wouldn't attempt to offer your beliefs to someone else like a Jehovah but you very comfortably disparage others beliefs. And I am not talking about good sound debate because that is not what you have offered thus far. There's nothing wrong with good, strong-worded, educated debate. \n \n You seem like you do avoid tit-for-tat conflicts though. You simply do your name calling and bow out.\n \n What puzzles me is your uproar over the ignorance and lack of education of Christians but when called on your posting of inaccurate and even false assertions you have no response. You attempt to show the ignorant and uneducated Christian the error of his ways by displaying the same traits you abhor. Instead of responding, you resort to a testimony of your own idealogy&#8212;that&#8217;s similar to saying it&#8217;s in the Bible, it&#8217;s true, that&#8217;s it--the response which you so vehemently detest.\n \n You distance yourself from those who offer the Gospel to others. Even if the Jehovah's do offer an off-beat version of the Word of God, I've always known them to offer it peacefully and politely. One thing we may agree upon--we should not \"push\" the gospel on anyone. But this is something different than willful discussion or debate or even sharing information. On the surface, the description of your idealogy seems so clean, pure, cordial, fluffy, and especially tolerant and inclusive. But there is something underneath all that that has come to the surface on this thread. \n \n In my humble opinion, the Jehovah's do have you beat on politeness and diplomacy. I've never had them come to my door and begin by calling me a lazy, uneducated, freaky, nut, mental case in la-la land. Condescension is so much more noble than than the traits you despise in Christians and other theists.\n\n \n \n \n Excellent post Max, \n \n I guess my replies were too ignorant for TS to respond too, but that is fine, I am not sure I care to continue anyway. I have always had a problem with people claiming they are 100% RIGHT about any subject. Especially when they give credit for their incredulous ackowledge ,via links and reading other peoples take on history ( yes, not ALL history books are 100% accurate ) . I say that when people preach they KNOW something for 100% accuracy , they need to give their OWN experiences for factual evidence, not someone elses. ...\n \n As I have said on here many times, if Christianity is such a lie, why do so many pursue it ? I have never known any person to pursue a lie except for a short time, ( and for over 2000 years ??? geez ) especially when it harms them. And many people on here say that Christianity does that by being a lie to mankind. Yes, there are wrongs done when any belief is taken to extremes by a person, but if one guages Christianity as to the overall effect it has on mankind , I think it is a positve one. jmo tho", 
   {}, 
   125476, 
   null, 
   1116591540.0
  ], 
  [
   125506, 
   null, 
   "trebor", 
   "[QUOTE=trebor You should start to live Christ's message before it's crispy critters for you. It's not enough to proclaim faith with your lips, you have to live it. So far, you are failing miserably.\n \n This also seems a little cruel!\n \n Is this what this forum has become ?, \n \n Or just this thread ?\n\n \n No, it is mainly Ezrider. You can only take so much of turn/burn and crispy critter talk without returning it. If you read what Ezrider has written in the past, I am only throwing out to him what he routinely throws out to everyone else.", 
   {}, 
   125438, 
   null, 
   1116598500.0
  ], 
  [
   125525, 
   null, 
   "Truthsayer", 
   "Made it back....\n \n Greetings all.\n \n Look, I don't wanna get into the usual shouting match with the religious. That is so cliche'. Generally speaking, it seems that I cannot voice my beliefs, which may differ from theirs, without them launching into whatever that thing they do is called. John this, Peter that, blah, blah...... Again, cliche.\n \n I have said all I know to say. You can believe what you wanna believe. And I can giggle about it if I want. That's the real deal. When it's all said and done, I will still not go for the La-La land fairy tales religions have to offer me and I will still not understand how a normally intelligent, clear thinking person could. That's the real mystery I suppose.\n \n In previous posts, I merely commented regarding things I have come across in my readings. They may be factual , they may be BS. I don't know. I didn't author it. I merely read it and commented on it. You can prove those writings wrong if you desire. It offends me not. They are just writings in a book I picked up somewhere that made sense to me. But remember when you are offering your pouty rebuttal, YOU (some of you) are the ones who believe in the, what I consider to be the, quack quack of the RCC church. emoticon_rolleyes YOU are the one telling me of your faith in what I see as obvious myth and superstition. So, that being said, you can't understand why I don't give your arguments very much credibility? For heavens sake, emoticon_xangel , step outside of the conversation and take an objective look at what people are telling me..\n \n Here's some of you guys, on one hand, talking about some guy in the sky, dead people coming back alive, oceans parting, sticks turning into snakes, bush's burning, virgin births, angelic conception, Noah's ark, and the fantasies just seem to go on and on. Where did you get YOUR information? You either read it somewhere or someone taught it to you. (I wouldn't be surprised if some of you tried to convince me you were actually there 2000 years ago. But you can't so don't try. I wouldn't believe that either emoticon_rolleyes .) The facts, the way I see them, you don't have a clue as to what you talking about. This is just some more of the religious mumbo jumbo I have heard all my life. I know it word for word or \"cover to cover\" so to speak. This is nothing new to me.\n \n Then there's me. The evil blaspheming heretic emoticon_rolleyes . The one you guys forgot to burn at the stake. emoticon_wow I am simply saying that if it looks like a duck and quacks like a duck, it's a duck. emoticon_xchicken I am saying the naked emperor is wearing no clothes. emoticon_idea I am saying that I don't believe in Santa. And you guys are jumping down my throat for telling the truth. I was not around 2000 years ago. I admit that I do not have a clue who did and who did not walk on the earth then but neither do you. But I can be reasonably sure that whoever did, the laws of physics and nature were observed and nobody instantly turned a big jug of water into a cask of wine or that somebody smeared mud in a blind person's eyes and they suddenly could see again.\n \n So, who here is making any real sense? The religious and their \"magical mystery tour\" beliefs? Or me, simply getting by with logic and the dictates of reason on the side of my posts? I am a \"Popular Mechanics\" kinda guy and the religious are \"Grimm's Fairy Tales\" kinda people. It's that simple really.\n \n I am the logical Mr. Spock, 2+2=4, kinda guy and the religious come across to me like hippies on LSD. No offense. I can't help it. (I know that angers them and for that I sincerely apologize. That's not my intention. ) \n \n Further, they (some) act EXACTLY like the second graders did, when I told them I didn't believe in Santa Claus and why....(see above posts and responses to my posts.) Some things never change. emoticon_rolleyes \n \n OK...I'm done. Wail away. Crucify me. Just remember how much worth I put into the words of someone who is over 21 years of age and still believes in Santa Claus or any other fairy tales for that matter. I doubt you will offend me. But you can keep trying if you like.", 
   {}, 
   125506, 
   null, 
   1116604440.0
  ], 
  [
   125544, 
   null, 
   "unkerpaulie", 
   "I've never seen one stand up to scrutiny that parallels Jesus to any real extent. Here's an article for you on that.\n\n jesus isnt doing to great himself. another similarity\n \n \nhttp://www.crosswalk.com/faith/ministry_articles/1321410.html\n\n in the article, hank makes 5 points in a clever presentation to demonstrate his argument. however, i must say his arguments are all essentially beating strawmen, and he doesnt nearly address the issue thoroughly\n \n 'F' - hank waves away the striking resemblances between christianity and the other myths as \"coincidences\". come on...\n \n 'A' - the isis myth resembles christianity more for its communion concept (body of christ broken and restored) than the resurrection. and the isis myth is only one of the many ancient myths in which resurrection is centralized. pointing out the difference in only this myth and not addressing the others is a pretty poor job\n \n 'L' - hank gives a very superficial view about the beliefs of mithras. he dates the spread of mithraism after the establishment of christianity, pointing out that mithraism could not have influenced christian beliefs. yet we know for a fact that christmas day, for instance, was definitely originally mithras' birthday, not christ's. hank ignores the fact that christianity was indeed influenced by this and many other cults\n \n 'S' - the point i made above, we know that there are more christian traditions of pagan tradition today than vice versa, so this argument flies directly in the face of reality\n \n 'E' - esotericism is the m.o. of christianity. i mean come on! christianity is nothing more than emotional frenzy sessions and logical depravation. any church-attending christian will attest to this. this argument supports the similarity of christianity and the myths, not vice versa", 
   {}, 
   125272, 
   null, 
   1116606960.0
  ], 
  [
   125787, 
   null, 
   "greg 79 f150", 
   "Made it back....\n \n Greetings all.\n \n Look, I don't wanna get into the usual shouting match with the religious. That is so cliche'. Generally speaking, it seems that I cannot voice my beliefs, which may differ from theirs, without them launching into whatever that thing they do is called. John this, Peter that, blah, blah...... Again, cliche.\n \n I have said all I know to say. You can believe what you wanna believe. And I can giggle about it if I want. That's the real deal. When it's all said and done, I will still not go for the La-La land fairy tales religions have to offer me and I will still not understand how a normally intelligent, clear thinking person could. That's the real mystery I suppose.\n \n In previous posts, I merely commented regarding things I have come across in my readings. They may be factual , they may be BS. I don't know. I didn't author it. I merely read it and commented on it. You can prove those writings wrong if you desire. It offends me not. They are just writings in a book I picked up somewhere that made sense to me. But remember when you are offering your pouty rebuttal, YOU (some of you) are the ones who believe in the, what I consider to be the, quack quack of the RCC church. emoticon_rolleyes YOU are the one telling me of your faith in what I see as obvious myth and superstition. So, that being said, you can't understand why I don't give your arguments very much credibility? For heavens sake, emoticon_xangel , step outside of the conversation and take an objective look at what people are telling me..\n \n Here's some of you guys, on one hand, talking about some guy in the sky, dead people coming back alive, oceans parting, sticks turning into snakes, bush's burning, virgin births, angelic conception, Noah's ark, and the fantasies just seem to go on and on. Where did you get YOUR information? You either read it somewhere or someone taught it to you. (I wouldn't be surprised if some of you tried to convince me you were actually there 2000 years ago. But you can't so don't try. I wouldn't believe that either emoticon_rolleyes .) The facts, the way I see them, you don't have a clue as to what you talking about. This is just some more of the religious mumbo jumbo I have heard all my life. I know it word for word or \"cover to cover\" so to speak. This is nothing new to me.\n \n Then there's me. The evil blaspheming heretic emoticon_rolleyes . The one you guys forgot to burn at the stake. emoticon_wow I am simply saying that if it looks like a duck and quacks like a duck, it's a duck. emoticon_xchicken I am saying the naked emperor is wearing no clothes. emoticon_idea I am saying that I don't believe in Santa. And you guys are jumping down my throat for telling the truth. I was not around 2000 years ago. I admit that I do not have a clue who did and who did not walk on the earth then but neither do you. But I can be reasonably sure that whoever did, the laws of physics and nature were observed and nobody instantly turned a big jug of water into a cask of wine or that somebody smeared mud in a blind person's eyes and they suddenly could see again.\n \n So, who here is making any real sense? The religious and their \"magical mystery tour\" beliefs? Or me, simply getting by with logic and the dictates of reason on the side of my posts? I am a \"Popular Mechanics\" kinda guy and the religious are \"Grimm's Fairy Tales\" kinda people. It's that simple really.\n \n I am the logical Mr. Spock, 2+2=4, kinda guy and the religious come across to me like hippies on LSD. No offense. I can't help it. (I know that angers them and for that I sincerely apologize. That's not my intention. ) \n \n Further, they (some) act EXACTLY like the second graders did, when I told them I didn't believe in Santa Claus and why....(see above posts and responses to my posts.) Some things never change. emoticon_rolleyes \n \n OK...I'm done. Wail away. Crucify me. Just remember how much worth I put into the words of someone who is over 21 years of age and still believes in Santa Claus or any other fairy tales for that matter. I doubt you will offend me. But you can keep trying if you like.\n\n \n \n \n \n \n Further, they (some) act EXACTLY like the second graders did, when I told them I didn't believe in Santa Claus and why....(see above posts and responses to my posts.) Some things never change. \n \n Now that is cold. What did a second grade kid ever do to you that you had to take away that little piece of \"fantasy world \" from their life as a child ? Did you think they werent going to grow up fast enough and learn about your youthful wisdom soon enough? Or maybe, you were so miserable as a kid, that you made yourself feel better by taking away other peoples happiness ? Which was it ?", 
   {}, 
   125525, 
   null, 
   1116638520.0
  ], 
  [
   125841, 
   null, 
   "Easyrider", 
   "To Unkerpaulie - \n \n Sorry, but none of your pagan savior claims holds water, though you're free to pick your best one and present the \"pre-Christ\" evidence (sources and dates) that you think make them \"Christ-like\". Pick your BEST ONE and present your evidence, and be prepared for a snappy rebuttal. In the meantime.....\n \n PAGAN RUSURRECTION / SAVIOR CLAIMS REFUTED\n \n http://www.iclnet.org/pub/resources/text/cri/cri-jrnl/web/crj0169a.html\n \n The Death of the Mystery Gods and the Death of Jesus: \n \n The best way to evaluate the alleged dependence of early Christian beliefs about Christ's death and resurrection on the pagan myths of a dying and rising savior-god is to examine carefully the supposed parallels. The death of Jesus differs from the deaths of the pagan gods in at least six ways: \n \n (1) None of the so-called savior-gods died for someone else. The notion of the Son of God dying in place of His creatures is unique to Christianity.[13] \n \n (2) Only Jesus died for sin. As Gunter Wagner observes, to none of the pagan gods \"has the intention of helping men been attributed. The sort of death that they died is quite different (hunting accident, self-emasculation, etc.).\"[14] \n \n (3) Jesus died once and for all (Heb. 7:27; 9:25-28; 10:10-14). In contrast, the mystery gods were vegetation deities whose repeated deaths and resuscitations depict the annual cycle of nature. \n \n (4) Jesus' death was an actual event in history. The death of the mystery god appears in a mythical drama with no historical ties; its continued rehearsal celebrates the recurring death and rebirth of nature. The incontestable fact that the early church believed that its proclamation of Jesus' death and resurrection was grounded in an actual historical event makes absurd any attempt to derive this belief from the mythical, nonhistorical stories of the pagan cults.[15] \n \n (5) Unlike the mystery gods, Jesus died voluntarily. Nothing like this appears even implicitly in the mysteries. \n \n (6) And finally, Jesus' death was not a defeat but a triumph. Christianity stands entirely apart from the pagan mysteries in that its report of Jesus' death is a message of triumph. Even as Jesus was experiencing the pain and humiliation of the cross, He was the victor. The New Testament's mood of exultation contrasts sharply with that of the mystery religions, whose followers wept and mourned for the terrible fate that overtook their gods.[16]", 
   {}, 
   125787, 
   null, 
   1116647400.0
  ], 
  [
   125854, 
   null, 
   "Orion", 
   "To Unkerpaulie - (6) And finally, Jesus' death was not a defeat but a triumph. Christianity stands entirely apart from the pagan mysteries in that its report of Jesus' death is a message of triumph. Even as Jesus was experiencing the pain and humiliation of the cross, He was the victor. The New Testament's mood of exultation contrasts sharply with that of the mystery religions, whose followers wept and mourned for the terrible fate that overtook their gods.[16]\n\n \n Jesus died an untimely death as a result of the fact that both he and his followers appear to have overplayed their hand with respect to the Romans. Jesus' disruption of the temple on the eve of Passover as well as the fact that at least some of his followers referred to him as 'king of the Jews' was probably enough to seal his fate. The disruption in the temple came at a time when Jerusalem was packed with Jews from everywhere, and the Romans were already nervous. The last thing they needed was for someone to disrupt temple activities. Furthermore, a 'king of the Jews' would be expected to liberate his people from foreign occupation, a fact which apparently did not escape the attention of the Romans. \n \n Was there a trial? Probably not. Was the body buried in a tomb? Probably not. Most likely it was tossed into a garbage dump, as was the custom. Why? Because Jesus was seen as a nobody. He had neither power, money, or influence. If he had any of the above, he probably wouldn't have been crucified in the first place. Joseph of Arimathaea? Almost certainly a fictional character whose gradual evolution one can trace through the gospels. \n \n The bodily resurrection of Jesus? Fictional. Jesus' followers apparently tried to make sense of his untimely death, and as the decades rolled on, the Jesus story evolved. And in an attempt to woo Greek and other pagans, the Jesus story no doubt incorporated pagan myths.", 
   {}, 
   125841, 
   null, 
   1116650880.0
  ], 
  [
   125855, 
   null, 
   "Redratio1", 
   "The best way to evaluate the alleged dependence of early Christian beliefs about Christ's death and resurrection on the pagan myths of a dying and rising savior-god is to examine carefully the supposed parallels. The death of Jesus differs from the deaths of the pagan gods in at least six ways: \n\n \n How does a single difference negate all of the other points?\n It doesn't. Face it, the only way Christianity spread was because it was changed to be more compatable to Roman pagan citizens. this is a matter of fact.\n \n \n(6) And finally, Jesus' death was not a defeat but a triumph. Christianity stands entirely apart from the pagan mysteries in that its report of Jesus' death is a message of triumph. Even as Jesus was experiencing the pain and humiliation of the cross, He was the victor. The New Testament's mood of exultation contrasts sharply with that of the mystery religions, whose followers wept and mourned for the terrible fate that overtook their gods.[16]\n\n \n Wouldn't be much of a martyred messiah if he didn't die in triumph. That is what being a martyr is all about.", 
   {}, 
   125841, 
   null, 
   1116650880.0
  ], 
  [
   125947, 
   null, 
   "Easyrider", 
   ": \"The best way to evaluate the alleged dependence of early Christian beliefs about Christ's death and resurrection on the pagan myths of a dying and rising savior-god is to examine carefully the supposed parallels. The death of Jesus differs from the deaths of the pagan gods in at least six ways...\"\n\n \n \n: How does a single difference negate all of the other points? It doesn't.\n\n \n I believe there were at least six differences noted, not one. Add to that all the Old Testament prophecies fulfilled by Jesus and you've got quite a bit of difference.\n \n \n: Face it, the only way Christianity spread was because it was changed to be more compatable to Roman pagan citizens. this is a matter of fact.\n\n \n The \"only way\"?  I don't think so.\n \n Point # 1: Biblical Christianity today is the same as it was when it started 2,000 years ago, and people today don't seem to care one iota what the bloody Romans or pagans thought then or now.\n \n Point # 2: There were no Roman or pagan \"changes\" the day 3,000 new converts were added at Pentecost (Acts 2:41), or when several thousand more were added shortly thereafter (Acts 4:4). Christianity was growing strong by itself even then. In fact, even when the Gospel was preached to the Romans, there was no early reliance on pagan myths or pagan practices (note the book of Romans, etc.), nor were pagan practicies necessary for Christianity to grow there. \n \n The fact is that Christianity thrived on its own apart from any pagan beliefs that might have been blended in later among various sects.", 
   {}, 
   125855, 
   null, 
   1116679380.0
  ], 
  [
   125950, 
   null, 
   "Easyrider", 
   "Orion's Hysteria\n \n \nWas there a trial? Probably not. Was the body buried in a tomb? Probably not. Most likely it was tossed into a garbage dump, as was the custom. Why? Because Jesus was seen as a nobody. He had neither power, money, or influence. If he had any of the above, he probably wouldn't have been crucified in the first place. Joseph of Arimathaea? Almost certainly a fictional character whose gradual evolution one can trace through the gospels. The bodily resurrection of Jesus? Fictional. Jesus' followers apparently tried to make sense of his untimely death, and as the decades rolled on, the Jesus story evolved.\n\n \n ROTFLOL!\n \n Typical demented, liberal logic. Throw anything and everything against the wall and see what sticks. Don't bother trying to back up all this revisionist hysteria with any facts or anything. Just pee and go #2 gicky big-boy all over the board and waltz off like nothing happened. LOL! \n \n Using your own brand of twisted logic, your god \"probably\" gets it on with Zeus and Metratron every night and twice on Sundays. It \"probably\" loves the blood of aborted fetuses, is fond of race-baiting, and is raising up the liberal bed-wetter and whining extremist Barbara Boxer for a run at the presidency on '08. LOL!", 
   {}, 
   125947, 
   null, 
   1116680760.0
  ], 
  [
   125978, 
   null, 
   "Redratio1", 
   "I believe there were at least six differences noted, not one. Add to that all the Old Testament prophecies fulfilled by Jesus and you've got quite a bit of difference.\n\n \n Those were all the same thing, his death.\n \n \n \n \nThe \"only way\"?  I don't think so.\n \n Point # 1: Biblical Christianity today is the same as it was when it started 2,000 years ago, and people today don't seem to care one iota what the bloody Romans or pagans thought then or now.\n\n \n No its not, not even remotely.", 
   {}, 
   125947, 
   null, 
   1116690300.0
  ], 
  [
   126022, 
   null, 
   "Easyrider", 
   "Quote by Easyrider: Point # 1: Biblical Christianity today is the same as it was when it started 2,000 years ago, and people today don't seem to care one iota what the bloody Romans or pagans thought then or now. \n \n QUOTE from Redration1: No its not, not even remotely.\n \n Yes it is. Depending on where one goes to church, that is.\n \n Jesus Reigns!!\n \n \"The highest glory won from the American Revolution was this: it connected, in one indissoluble bond, the principles of civil governmentwith the principles of Christianity.\" - John QuincyAdams", 
   {}, 
   125978, 
   null, 
   1116697080.0
  ], 
  [
   126026, 
   null, 
   "Redratio1", 
   "\n \n Yes it is. Depending on where one goes to church, that is.\n \n\n \n Which church is that?", 
   {}, 
   126022, 
   null, 
   1116697380.0
  ], 
  [
   126027, 
   null, 
   "Easyrider", 
   "A Biblically-based Church.", 
   {}, 
   126026, 
   null, 
   1116697440.0
  ], 
  [
   126068, 
   null, 
   "Redratio1", 
   "A Biblically-based Church.\n\n That would have to be Old testiment mainly, because the new testiment is full of pagan ideas.", 
   {}, 
   126027, 
   null, 
   1116702360.0
  ], 
  [
   126075, 
   null, 
   "Truthsayer", 
   "Further, they (some) act EXACTLY like the second graders did, when I told them I didn't believe in Santa Claus and why....(see above posts and responses to my posts.) Some things never change. \n \n Now that is cold. What did a second grade kid ever do to you that you had to take away that little piece of \"fantasy world \" from their life as a child ? Did you think they werent going to grow up fast enough and learn about your youthful wisdom soon enough? Or maybe, you were so miserable as a kid, that you made yourself feel better by taking away other peoples happiness ? Which was it ?\n\n \n If I may borrow a quote, \"When I was a child, I spake as a child. But now I am no longer a child so I have put away childish things.\"\n \n I did a lot of things as a child that I look back upon and cringe. Telling little Ricky next door there was no Santa was not one of them. I remember as a kid being very happy though. Perhaps too happy. Somethings never change! :) \n \n Have a great weekend all.", 
   {}, 
   125787, 
   null, 
   1116702840.0
  ], 
  [
   126076, 
   null, 
   "Easyrider", 
   "That would have to be Old testiment mainly, because the new testiment is full of pagan ideas.\n\n \n Nope, that's the allegation, but I haven't seen anyone back that up with anything except wild conjecture.\n \n The New Testament is based largely on the Old Testament, which also prophesies about the New Covenant (Jeremiah 31:31-34).\n \n Need a sin / savior? Isaiah 53\n \n The divine Son? Jeremiah 23:5-6, Isaiah 9:6-7, etc.\n \n Where will the Messiah be born? Micah 5:2\n \n When will the Messiah come? Daniel 9:24-27\n \n It's all there....and it's been there all along. These phony pagan claims are a charade.", 
   {}, 
   126068, 
   null, 
   1116703140.0
  ], 
  [
   126083, 
   null, 
   "Redratio1", 
   "It's all there....and it's been there all along. These phony pagan claims are a charade.\n\n \n Not really, Paul paganized Christianity to successfully allow gentiles to practice it in the Roman empire.\n \n As for other stuff, well you just have to be a history buff to know it. Post#1 is quite accurate.", 
   {}, 
   126076, 
   null, 
   1116703680.0
  ], 
  [
   126249, 
   null, 
   "Orion", 
   "Jesus died an untimely death as a result of the fact that both he and his followers appear to have overplayed their hand with respect to the Romans. Jesus' disruption of the temple on the eve of Passover as well as the fact that at least some of his followers referred to him as 'king of the Jews' was probably enough to seal his fate. The disruption in the temple came at a time when Jerusalem was packed with Jews from everywhere, and the Romans were already nervous. The last thing they needed was for someone to disrupt temple activities. Furthermore, a 'king of the Jews' would be expected to liberate his people from foreign occupation, a fact which apparently did not escape the attention of the Romans. \n \n Was there a trial? Probably not. Was the body buried in a tomb? Probably not. Most likely it was tossed into a garbage dump, as was the custom. Why? Because Jesus was seen as a nobody. He had neither power, money, or influence. If he had any of the above, he probably wouldn't have been crucified in the first place. Joseph of Arimathaea? Almost certainly a fictional character whose gradual evolution one can trace through the gospels. \n \n The bodily resurrection of Jesus? Fictional. Jesus' followers apparently tried to make sense of his untimely death, and as the decades rolled on, the Jesus story evolved. And in an attempt to woo Greek and other pagans, the Jesus story no doubt incorporated pagan myths.\n\n \n \nOrion's Hysteria\n\n \n Hysteria? Did you say \"hysteria\"?\n \n \nTypical demented, liberal logic. Throw anything and everything against the wall and see what sticks. Don't bother trying to back up all this revisionist hysteria with any facts or anything. Just pee and go #2 gicky big-boy all over the board and waltz off like nothing happened. LOL! Using your own brand of twisted logic, your god \"probably\" gets it on with Zeus and Metratron every night and twice on Sundays. It \"probably\" loves the blood of aborted fetuses, is fond of race-baiting, and is raising up the liberal bed-wetter and whining extremist Barbara Boxer for a run at the presidency on '08. LOL!\n\n \n Thanks for the incoherent rant, EZ. I'm sure there's a point somewhere in there that you were attempting to make.", 
   {}, 
   125950, 
   null, 
   1116722880.0
  ], 
  [
   126302, 
   null, 
   "Truthsayer", 
   "Originally Posted by Easyrider\n Typical demented, liberal logic. Throw anything and everything against the wall and see what sticks. Don't bother trying to back up all this revisionist hysteria with any facts or anything. Just pee and go #2 gicky big-boy all over the board and waltz off like nothing happened. LOL! Using your own brand of twisted logic, your god \"probably\" gets it on with Zeus and Metratron every night and twice on Sundays. It \"probably\" loves the blood of aborted fetuses, is fond of race-baiting, and is raising up the liberal bed-wetter and whining extremist Barbara Boxer for a run at the presidency on '08. LOL!\n\n \n There. You see what religion can do to a fellow? emoticon_wow", 
   {}, 
   126249, 
   null, 
   1116726720.0
  ], 
  [
   126487, 
   null, 
   "Easyrider", 
   "Where are you going when you die?", 
   {}, 
   126302, 
   null, 
   1116770400.0
  ], 
  [
   126515, 
   null, 
   "Easyrider", 
   "\"The parokhet in the Temple\":  r.e. Matthew 27:51\n \n Exodus 26:31-35 describes this curtain as it existed in the desert Tabernacle in the Old Testament. It separated the Holy Place from the Holy of Holies. Only the cohen hagadol (High Priest) was allowed to pass through it into the Holy of Holies; and that he could do only once a year, on Yom-Kippur, to make an atonement sacrifice for his sins and for the sins of the Jewish people. When it was ripped in two from top to bottom during the crucifixion of Jesus Christ, it symbolized the fact that God was giving everyone access to the most holy place of all in heaven, as taught explicitly in Hebrews 10:19-20.\n \n The Jewish Talmud bears an amazing, unwitting witness to the work of Jesus in altering the system of atonement. The background is that on Yom-Kippur, when the cohen hagadol sacrificed a bull (Leviticus 16), a piece of scarlet cloth was tied between its horns. If it later turned white, it meant that God had forgiven Israel's sin in accordance with Isaiah 1:18, \"Though your sins beas scarlet, they will be white as snow.\"\n \n The Talmud provides some insightful evidence of what transpired during the time of Christ and the next forty years after his crucifixion:\n \n \"Our Rabbis taught that throughout the forty years that Shim'on the Tzaddik served,... the scarlet cloth would become white. From then on it would sometimes become white and sometimes not.... Throughout the last forty years before the Temple was destroyed (in 70 A.D.)... the scarlet cloth never turned white.\" (Jewish Talmud - Yoma 39a-39b)\n \n Thus in the days of Shim'on Tzaddik the sacrificial system established by God in the Tanakh was observed, and it was effective. But afterwards Israel's spirituality declined, so that the sacrificial system was effective only sometimes. Finally, after Jesus' death, forty years before the destruction of the Temple, it was never effective. The Talmud does not sayit, but what had become effective for forgiving Israel's sin was thesacrificial death of Jesus the Messiah.\"  \n \n http://www.christian-thinktank.com/dveil.html", 
   {
    "unicode_changes_made": true
   }, 
   126487, 
   null, 
   1116773520.0
  ], 
  [
   126554, 
   null, 
   "Dzeron", 
   "Where are you going when you die?\n\n \n Where are you going when you die?", 
   {}, 
   126487, 
   null, 
   1116781380.0
  ], 
  [
   126649, 
   null, 
   "johnson", 
   "Where are you going when you die?\n\n \n Hopefully some where where easyrider won't be", 
   {}, 
   126554, 
   null, 
   1116789000.0
  ], 
  [
   126668, 
   null, 
   "Steeeeve", 
   "http://www.carm.org/evidence/mithra.htm\n \n That is a good link to show how this first post is a bunch of garbage.\n \n In short it says that it would be more probable that \"mithra\" was borrowed from Christianity (or rather the Jews). However, looking things at \"face value\" is much easier now isnt it.", 
   {}, 
   126649, 
   null, 
   1116790560.0
  ], 
  [
   126689, 
   null, 
   "johnson", 
   "http://www.carm.org/evidence/mithra.htm\n \n That is a good link to show how this first post is a bunch of garbage.\n \n In short it says that it would be more probable that \"mithra\" was borrowed from Christianity (or rather the Jews). However, looking things at \"face value\" is much easier now isnt it.\n\n \n Read it, it basically says christianity is correct because we Interpet the old \n testament to foretell that jesus was coming. I wonder if the jews who follow jewish religion interpet these same verses to point to jesus. If not I'm inclined to agree with them,.. I mean it was their book first wasn't it? Shouldnt those who originaly wrote it have a better interpitation of it then those who adopted it later?", 
   {}, 
   126668, 
   null, 
   1116791880.0
  ], 
  [
   126738, 
   null, 
   "Easyrider", 
   "Read it, it basically says christianity is correct because we Interpet the old testament to foretell that jesus was coming. I wonder if the jews who follow jewish religion interpet these same verses to point to jesus. If not I'm inclined to agree with them,.. I mean it was their book first wasn't it? Shouldnt those who originaly wrote it have a better interpitation of it then those who adopted it later?\n\n \n You would think so, but the Old Testament Jews were also the ones who often rebelled against God and persecuted and killed their own prophets, so why should we think they'd treat another prophet (Jesus) any different? Jesus said the Law and the Prophets spoke about him, and I think that's pretty clear after reading the New Testament.", 
   {}, 
   126689, 
   null, 
   1116795060.0
  ], 
  [
   126741, 
   null, 
   "Redratio1", 
   "\"First of all, Christianity does not need any outside influence to derive any of its doctrines.\"\n \n That was a funny article. It says that they have eyewitness evidence of his virgin birth. I think Jesus needs a blood test. \n \n Anyway, the article refutes nothing.", 
   {}, 
   126738, 
   null, 
   1116795300.0
  ], 
  [
   126745, 
   null, 
   "Easyrider", 
   "Not really, Paul paganized Christianity to successfully allow gentiles to practice it in the Roman empire.\n\n \n If that were true then we'd probably have seen a pagan \"god\" in Paul's writings who gave salvation. But Paul focused on Christ as Lord and Savior instead. Nice try....\n \n Paul taught that salvation is by faith in Jesus / God (Ephesians 2:8-9) just like it was in the Old Testament (Genesis 15:6, etc.).", 
   {}, 
   126738, 
   null, 
   1116795540.0
  ], 
  [
   126750, 
   null, 
   "Redratio1", 
   "If that were true then we'd probably have seen a pagan \"god\" in Paul's writings who gave salvation. But Paul focused on Christ as Lord and Savior instead. Nice try....\n \n Paul taught that salvation is by faith in Jesus / God (Ephesians 2:8-9) just like it was in the Old Testament (Genesis 15:6, etc.).\n\n \n Jesus is that pagan God.", 
   {}, 
   126745, 
   null, 
   1116795900.0
  ], 
  [
   126752, 
   null, 
   "johnson", 
   "You would think so, but the Old Testament Jews were also the ones who often rebelled against God and persecuted and killed their own prophets, so why should we think they'd treat another prophet (Jesus) any different? Jesus said the Law and the Prophets spoke about him, and I think that's pretty clear after reading the New Testament.\n\n \n \n Well why didn't god choose a new people and order them to kill all the jews, including the unborn of the womb, like god ordered the jews to do? Why is it the jews get to break gods law and live when god made the jews kill others for breaking the laws?", 
   {}, 
   126738, 
   null, 
   1116796140.0
  ], 
  [
   126818, 
   null, 
   "johnson", 
   "And while we're at it what do you think made god change it's mind about killing those who bork it's law? What could have possibly happen that after a few thousand years god desides that jusk killing it's own son would make up for everything?", 
   {}, 
   126752, 
   null, 
   1116804000.0
  ], 
  [
   126872, 
   null, 
   "Tastyfish", 
   "Midlife crisis?", 
   {}, 
   126818, 
   null, 
   1116809760.0
  ], 
  [
   126877, 
   null, 
   "Orion", 
   "Where are you going when you die?\n\n \n I intend to live my life to the fullest. As to what happens to me once I die, I'll cross that particular bridge when I come to it. I don't fear death nor do I have any reason to fear what happens to me after my death. Perhaps I'll cease to exist. Perhaps I'll come around again as Orion II. Perhaps I'll enter some new and different realm of existence. Whatever. But I cannot accept the Christian fundamentalist concept of the possibility of eternal torture in hell. I cannot accept it because it makes no sense - it is illogical and, so, I don't even consider it as a possibility.\n \n Learn to enjoy life, EZ. You come across as sooo dour and ill-tempered. Find a woman (or a man) and see if you can enter into a loving, sharing relationship. Sexual intimacy is a gift meant to be experienced and shared, as is good food, good wine, and good conversation.", 
   {}, 
   126487, 
   null, 
   1116810300.0
  ], 
  [
   126878, 
   null, 
   "Truthsayer", 
   "I think that after I am dead, it will be just like before I was born.", 
   {}, 
   126877, 
   null, 
   1116810360.0
  ], 
  [
   126885, 
   null, 
   "johnson", 
   "I think that after I am dead, it will be just like before I was born.\n\n \n Couldn't agree with you more!!", 
   {}, 
   126878, 
   null, 
   1116811800.0
  ], 
  [
   126907, 
   null, 
   "jitobear", 
   "I intend to live my life to the fullest. As to what happens to me once I die, I'll cross that particular bridge when I come to it. I don't fear death nor do I have any reason to fear what happens to me after my death. Perhaps I'll cease to exist. Perhaps I'll come around again as Orion II. Perhaps I'll enter some new and different realm of existence. Whatever. But I cannot accept the Christian fundamentalist concept of the possibility of eternal torture in hell. I cannot accept it because it makes no sense - it is illogical and, so, I don't even consider it as a possibility.\n \n Learn to enjoy life, EZ. You come across as sooo dour and ill-tempered. Find a woman (or a man) and see if you can enter into a loving, sharing relationship. Sexual intimacy is a gift meant to be experienced and shared, as is good food, good wine, and good conversation.\n\n \n here here!! emoticon_xgood", 
   {}, 
   126877, 
   null, 
   1116814200.0
  ], 
  [
   126918, 
   null, 
   "Easyrider", 
   "Orion,\n \n You won't get any second chances to go around again, Frank. As it is written, \"It is appointed for man to die once, then the Judgment\" (Hebrews 9:27). So, you need to get it right this time. You can make all the plans you want, but reality is reality, and Jesus is reality. He can't be swept away or remade into some politically correct philosopher. He is who he claimed to be, and he's coming again to set things straight. Fanciful thinking won't change your appointment at the Judgment Seat. But you don't have to perish. Jesus is the Way and the Truth and the Life, and he can save you even now. Rejoice in the Good News! \n \n Now go and do the right thing.", 
   {}, 
   126907, 
   null, 
   1116817800.0
  ], 
  [
   126924, 
   null, 
   "Dzeron", 
   "Orion,\n \n You won't get any second chances to go around again, Frank. As it is written, \"It is appointed for man to die once, then the Judgment\" (Hebrews 9:27). So, you need to get it right this time. You can make all the plans you want, but reality is reality, and Jesus is reality. He can't be swept away or remade into some politically correct philosopher. He is who he claimed to be, and he's coming again to set things straight. Fanciful thinking won't change your appointment at the Judgment Seat. But you don't have to perish. Jesus is the Way and the Truth and the Life, and he can save you even now. Rejoice in the Good News! \n \n Now go and do the right thing.\n\n \n EZ, please accept the fact that we cannot know anything about the afterlife. By its very nature, the realm of the afterlife is unobservable by beings in this life. Religion is nothing but guesswork as to what the afterlife is like, and frankly, it is ridiculous to not live life to the fullest just because you are afraid of consequences in the afterlife. To sacrifice happiness in this life for a supposed reward in the afterlife amounts to nothing more than gambling.", 
   {}, 
   126918, 
   null, 
   1116818400.0
  ], 
  [
   126957, 
   null, 
   "trebor", 
   "Where are you going when you die?\n\n \n Same place you are.", 
   {}, 
   126487, 
   null, 
   1116823500.0
  ], 
  [
   126959, 
   null, 
   "trebor", 
   "Read it, it basically says christianity is correct because we Interpet the old \n testament to foretell that jesus was coming. I wonder if the jews who follow jewish religion interpet these same verses to point to jesus. If not I'm inclined to agree with them,.. I mean it was their book first wasn't it? Shouldnt those who originaly wrote it have a better interpitation of it then those who adopted it later?\n\n \n \n When it comes to the Jewish faith, you won't find any Jew that says any of those passages lead to Jesus.", 
   {}, 
   126689, 
   null, 
   1116823620.0
  ], 
  [
   126974, 
   null, 
   "johnson", 
   "When it comes to the Jewish faith, you won't find any Jew that says any of those passages lead to Jesus.\n\n \n And that is my point ... it was their book of faith befor christians took it over and added a few more chapters.", 
   {}, 
   126959, 
   null, 
   1116824760.0
  ], 
  [
   127112, 
   null, 
   "Steeeeve", 
   "\"First of all, Christianity does not need any outside influence to derive any of its doctrines.\"\n \n That was a funny article. It says that they have eyewitness evidence of his virgin birth. I think Jesus needs a blood test. \n \n Anyway, the article refutes nothing.\n\n It makes a good point in that the old testament was written long before the others that are \"similiar\". However, you probably already had that post typed out before you even read the article. emoticon_rolleyes", 
   {}, 
   126741, 
   null, 
   1116855540.0
  ], 
  [
   127131, 
   null, 
   "unkerpaulie", 
   "To Unkerpaulie - \n \n Sorry, but none of your pagan savior claims holds water, though you're free to pick your best one and present the \"pre-Christ\" evidence (sources and dates) that you think make them \"Christ-like\". Pick your BEST ONE and present your evidence, and be prepared for a snappy rebuttal. In the meantime.....\n \n PAGAN RUSURRECTION / SAVIOR CLAIMS REFUTED\n \n http://www.iclnet.org/pub/resources/text/cri/cri-jrnl/web/crj0169a.html\n \n The Death of the Mystery Gods and the Death of Jesus: \n \n The best way to evaluate the alleged dependence of early Christian beliefs about Christ's death and resurrection on the pagan myths of a dying and rising savior-god is to examine carefully the supposed parallels. The death of Jesus differs from the deaths of the pagan gods in at least six ways: \n \n (1) None of the so-called savior-gods died for someone else. The notion of the Son of God dying in place of His creatures is unique to Christianity.[13] \n \n (2) Only Jesus died for sin. As Gunter Wagner observes, to none of the pagan gods \"has the intention of helping men been attributed. The sort of death that they died is quite different (hunting accident, self-emasculation, etc.).\"[14] \n \n (3) Jesus died once and for all (Heb. 7:27; 9:25-28; 10:10-14). In contrast, the mystery gods were vegetation deities whose repeated deaths and resuscitations depict the annual cycle of nature. \n \n (4) Jesus' death was an actual event in history. The death of the mystery god appears in a mythical drama with no historical ties; its continued rehearsal celebrates the recurring death and rebirth of nature. The incontestable fact that the early church believed that its proclamation of Jesus' death and resurrection was grounded in an actual historical event makes absurd any attempt to derive this belief from the mythical, nonhistorical stories of the pagan cults.[15] \n \n (5) Unlike the mystery gods, Jesus died voluntarily. Nothing like this appears even implicitly in the mysteries. \n \n (6) And finally, Jesus' death was not a defeat but a triumph. Christianity stands entirely apart from the pagan mysteries in that its report of Jesus' death is a message of triumph. Even as Jesus was experiencing the pain and humiliation of the cross, He was the victor. The New Testament's mood of exultation contrasts sharply with that of the mystery religions, whose followers wept and mourned for the terrible fate that overtook their gods.[16]\n\n we know jesus' death and resurrection is unique in terms of the significance and symbolisation given to it. i'm not in any way disputing that. but your list is just that, a set of religious symobizations and attributes given to jesus' death and resurrection. the point is that death and resurrection itself is an old idea, existing in many myths long before christianity appeared. giving a new significance to an old idea does not make the idea original", 
   {}, 
   125841, 
   null, 
   1116861120.0
  ], 
  [
   127153, 
   null, 
   "Truthsayer", 
   "You can make all the plans you want, but reality is reality, and Jesus is reality. \n \n \n Get a load on who's preaching about reality.... :p :p :p \n \n It just gets crazier and crazier....got to love it! emoticon_rolleyes", 
   {}, 
   127131, 
   null, 
   1116863400.0
  ], 
  [
   127469, 
   null, 
   "Easyrider", 
   "Well why didn't god choose a new people and order them to kill all the jews, including the unborn of the womb, like god ordered the jews to do?\n\n \n Have you ever read Deuteronomy chapter 28 (the \"curses of disobedience\") to see what God had in mind for the Jews when they were doing evil? Most of it came to pass too, when the Jews were sacked by King Nebuchadnezzar, the Assyrians, and by the 12th Roman Legion in 70 AD. \n \n You might want to read the book of Lamentations also.\n \n But God would never let all the Jews be killed because he made promises to Adam (Genesis 3:15) and to Abraham (Genesis 12) etc., and so he always kept a remnant of Jews alive to complete his plan of the ages.", 
   {}, 
   127153, 
   null, 
   1116892200.0
  ], 
  [
   127476, 
   null, 
   "Easyrider", 
   "Get a load on who's preaching about reality....It just gets crazier and crazier....got to love it!\n\n \n Look who's laughing like a jackal. When you get serious about your eternal future be sure to pray to Jesus for some salvation. Don't leave earth without him now....", 
   {}, 
   127469, 
   null, 
   1116892440.0
  ], 
  [
   127480, 
   null, 
   "Easyrider", 
   "When it comes to the Jewish faith, you won't find any Jew that says any of those passages lead to Jesus.\n\n \n Christianity IS the real Jewish faith, Trebor.\n \n Apart from that which Jewish beliefs are you espousing? The ones that say two Messiahs will come (Messiah ben David and Messiah ben Joseph), or the one that says he will only come once, or the one that says he already came in the person of a New York Rabbi? Which Judaism do you want to push around here - the Orthodox beliefs that teach gay sex is a sin or the Reform Jewish beliefs that teach gay sex is okay? Do you want the Jews who say there's no need to believe in a Jewish Messiah or do you want the Jews like the Great Maimonedes who says believing in the Messiah is one of the pillars of the Jewish faith?\n \n You see there, Trebor, you will need to study up and define which Jewish beliefs you want to push around here before you start telling us what is right and what's not.", 
   {}, 
   127476, 
   null, 
   1116892920.0
  ], 
  [
   127483, 
   null, 
   "johnson", 
   "Have you ever read Deuteronomy chapter 28 (the \"curses of disobedience\") to see what God had in mind for the Jews when they were doing evil? Most of it came to pass too, when the Jews were sacked by King Nebuchadnezzar, the Assyrians, and by the 12th Roman Legion in 70 AD. \n \n You might want to read the book of Lamentations also.\n \n But God would never let all the Jews be killed because he made promises to Adam (Genesis 3:15) and to Abraham (Genesis 12) etc., and so he always kept a remnant of Jews alive to complete his plan of the ages.\n\n \n Why yes i've read the bible , .. more than most christians. It is a book that can only be defended by it's self. Thanks for asking.\n \n And now back to the simple questions ... what gives god the right to order jews to kill the the unborn? Don't you think god could have found compassion for their souls and sent missionarys to convert them.", 
   {}, 
   127469, 
   null, 
   1116893280.0
  ], 
  [
   127509, 
   null, 
   "Easyrider", 
   "what gives god the right to order jews to kill the the unborn? Don't you think god could have found compassion for their souls and sent missionarys to convert them.\n\n \n God does grant mercy, but there comes a point in Scripture where it says that people harden their hearts against the Lord, and that's when he gives them over to judgment and / or destruction. Case in point - Genesis 15:16 - God tells Abraham that in 4 generations he will return to the land, for the sins of the Amorites has not yet reached its full measure. The Bible also says that Noah was a preacher of righteousness, but only 8 people got on that Ark. So God did send the preacher and they didn't listen. Jesus said the same thing in the parable of the Rich Man and Lazarus. So God has to be the judge of when enough's enough.\n \n In the long run, fewer people wind up in the Pit if you deal severely with them at one point in time, rather than let them raise up countless future generations of infidels who sacrifice their children on altars, etc.", 
   {}, 
   127483, 
   null, 
   1116897120.0
  ], 
  [
   127566, 
   null, 
   "Orion", 
   "Christianity IS the real Jewish faith, Trebor.\n\n \n You know, EZ, it wouldn't kill you to familiarize yourself with whatever subject you choose to discuss, and doing so would probably save you a considerable degree of embarrassment. I won't even bother to address this little gem of yours since it's obvious that you know next to nothing of Judaism with the possible exception of whatever it is you glean from Christian fundamentalist websites.", 
   {}, 
   127480, 
   null, 
   1116901320.0
  ], 
  [
   127578, 
   null, 
   "johnson", 
   "God does grant mercy, but there comes a point in Scripture where it says that people harden their hearts against the Lord, and that's when he gives them over to judgment and / or destruction. Case in point - Genesis 15:16 - God tells Abraham that in 4 generations he will return to the land, for the sins of the Amorites has not yet reached its full measure. The Bible also says that Noah was a preacher of righteousness, but only 8 people got on that Ark. So God did send the preacher and they didn't listen. Jesus said the same thing in the parable of the Rich Man and Lazarus. So God has to be the judge of when enough's enough.\n \n In the long run, fewer people wind up in the Pit if you deal severely with them at one point in time, rather than let them raise up countless future generations of infidels who sacrifice their children on altars, etc.\n\n \n \n And if i remember correctly it was god who \" hardened pharos heart \" each time moses pronounced gods plauge to come on Egypt. This god it plainly states did the hardening of the hearts. WHY ?? To me it seems if god had just left Pharo alone he might have done what god asked. But thats not what happened god hardened his heart each time god made something bad happen to Egypt. One can only hope it wasn't to just get to the killing of the first born. This god kills innocent children and there is no way I would want to spend eternity with it.", 
   {}, 
   127509, 
   null, 
   1116902640.0
  ], 
  [
   127605, 
   null, 
   "Easyrider", 
   "And if i remember correctly it was god who \" hardened pharos heart \" each time moses pronounced gods plauge to come on Egypt. This god it plainly states did the hardening of the hearts.\n\n \n Word has it that Pharoah hardened his own heart first (Exodus 8:15, etc.), and God finished the job for him. \n \n \nBut thats not what happened god hardened his heart each time god made something bad happen to Egypt. One can only hope it wasn't to just get to the killing of the first born. This god kills innocent children and there is no way I would want to spend eternity with it.\n\n \n Part of God's plan was to show the Egyptians that their \"gods\" couldn't help them. Each of the plagues dealt with a different Egyptian \"god\" (i.e. the blood in the Nile showed that Hapi, the \"god\" of the Nile, was impotent in stopping it). God wanted to show the Egyptians he alone was the sovereign God, and he did.", 
   {}, 
   127578, 
   null, 
   1116906120.0
  ], 
  [
   127607, 
   null, 
   "Tastyfish", 
   "How the hell is that fair though - 2hey, you want to release the , I'll try and convince you if you don't...no..sorry despite my many threat that I'll now carry out that was your last chance. Suppose I could have shown you were wrong but whats the point of doing it if you are allowed to repent?\"\n \n Sorry Easyrider, there is no doubt here. Your god is being evil here, utterly and hopelessly evil.", 
   {}, 
   127605, 
   null, 
   1116906720.0
  ], 
  [
   127608, 
   null, 
   "Easyrider", 
   "This god kills innocent children and there is no way I would want to spend eternity with it.\n\n \n You really don't have a very big selection there, Johnson. God is the only real game in town. It's either heaven or hell - your choice. As much as you might like, you don't get another option. \n \n As for God killing the innocent children, the innocent go to heaven, so don't worry about them. Since God brought capital judgment on the wicked parents of many of the children, it doesn't make much sense to let the kids wander around until they find another set of adults who will only educate them in the same evil ways as their previous parents, does it? Then they wind up going to hell instead of heaven. And this AFTER they themselves turn into butchers and kill other people. The only other option is to let the kids' murderous parents live to kill more people, so the kids can be like them. Wrong! It has to stop sometimes.", 
   {}, 
   127605, 
   null, 
   1116906720.0
  ], 
  [
   127611, 
   null, 
   "Easyrider", 
   "Tastyfish,\n \n You say my God is evil? You sound like the liberals who say America is evil. Meanwhile you conveniently overlook the real evil people who God / America is bringing judgment against. Not good.\n \n Why doesn't god play nice like a good little liberal wants (so Osama and his henchmen can waltz into your neighborhood and start butchering innocent people).", 
   {}, 
   127608, 
   null, 
   1116907020.0
  ], 
  [
   127612, 
   null, 
   "Tastyfish", 
   "Hey - I'm not the one butchering the firstborn, this isn't children but just an abiterary section of the population. Just because you never told their parents that you were the real god in any conclusive way...and still haven't.\n \n As for Bin Laden, he serves your god as much as Muslims share your old testament and which probably also explains why we've not seen any miracles to stop them. I would love a socialist deity, least then people would be looked after rather than having all the horrors of the world afflicted upon them for its own amusement.\n \n You're just so scared of the bully you can't think straight enough to see that its just a reflection of the worst side of humanity from a darker time.\n \n You think Bin Laden is stronger than your God? No wonder the world's so messed up", 
   {}, 
   127611, 
   null, 
   1116907260.0
  ], 
  [
   127617, 
   null, 
   "Easyrider", 
   "Tastyfish: As for Bin Laden, he serves your god as much as Muslims share your old testament and which probably also explains why we've not seen any miracles to stop them.  \n \n Bin Laden doesn't serve my God. He serves Allah, who is a different \"god\" than the Biblical God. Allah doesn't even recognize Jesus as the divine Son and Savior. The real Biblical God isn't that schizophrenic.\n \n Tastyfish: You're just so scared of the bully you can't think straight enough to see that its just a reflection of the worst side of humanity from a darker time.\n \n I'm not scared of anyone, except God. What can Osama do to me. If he gets close enough to kill me then he's close enough for me to kill him too.\n \n Tastyfish: You think Bin Laden is stronger than your God? No wonder the world's so messed up\n \n I never said that. My God is an awesome God.", 
   {}, 
   127612, 
   null, 
   1116907680.0
  ], 
  [
   127624, 
   null, 
   "Tastyfish", 
   "You claim that if God followed 'liberal' ideas then he would allow various terrorist atrocities whilst the opposite is true. A libertarian god would do this as it really doesn't care - a socialist one would never even let the events begin to happen.\n \n Talking about schizophrenic the old and new testament - slaughter the unbeleivers, rape their women and shatter their infants against the stones vs love thy neighbour?\n Bin Laden is far closer to the original biblical god than Jesus was - hence why I respect Jesus yet cast a dubious eye over the rest of the abrahamic religions. Its a brave man who tries to change something that imbedded and bloody.", 
   {}, 
   127617, 
   null, 
   1116907920.0
  ], 
  [
   127627, 
   null, 
   "Easyrider", 
   "Tastyfish:  You claim that if God followed 'liberal' ideas then he would allow various terrorist atrocities whilst the opposite is true. A libertarian god would do this as it really doesn't care - a socialist one would never even let the events begin to happen.\n \n You confuse liberal with libertarian. One believes in personal responsibility for one's own actions and the other one doesnt.\n \n Tastyfish: Talking about schizophrenic the old and new testament - slaughter the unbeleivers, rape their women and shatter their infants against the stones vs love thy neighbour?\n \n Why don't you list for us here all the horrible sins that the people God brought judgment against? The murders, the rapes, the slaughtered infants sacrificed to pagan gods, the muggings, the beatings, the blasphemies against God, etc. Then you might begin to understand why God brought judgment against them. \n \n You're doing what the liberals do - whine for the criminals when they get punished.\n \n Tastyfish: Bin Laden is far closer to the original biblical god than Jesus was - hence why I respect Jesus yet cast a dubious eye over the rest of the abrahamic religions. Its a brave man who tries to change something that imbedded and bloody.\n \n See above. Jesus does his own judgments on evil men in the Book of Revelation. Those will make the Old Testament judgments pale in comparison.", 
   {}, 
   127624, 
   null, 
   1116908340.0
  ], 
  [
   127633, 
   null, 
   "Tastyfish", 
   "You confuse liberal with libertarian. One believes in personal responsibility for one's own actions and the other one doesnt. \n if he were libereal he would recognise that its His fault for a lot of the actions and would at least try to prevent the consequences to innocents while punishing those involved. Not to mention trying to change the causes for the crimes in the first place. Hmm - still seems poverty and hunger in the world, not to mention mental disease.\n \n \n\n Why don't you list for us here all the horrible sins that the people God brought judgment against? The murders, the rapes, the slaughtered infants sacrificed to pagan gods, the muggings, the beatings, the blasphemies against God, etc. Then you might begin to understand why God brought judgment against them. \n You are saying that the best way to convert someone is through genocide? Seems god only directly intervenes for religious crimes. Muggings and murders we have to sort out ourselves - surely this the point of the 10 commandments.\n \n\n You're doing what the liberals do - whine for the criminals when they get punished.\n Actually I thought I was protesting against mind control to cause a crime but hey...still there is reason why criminals commit crimes. Its not just because some people are evil, society and genetics do have an effect. \n \n\n See above. Jesus does his own judgments on evil men in the Book of Revelation. Those will make the Old Testament judgments pale in comparison.\n Pretty sure he said turn the other cheek and love thy neighbour - the genocides of the OT seem to conflict with this quite a bit. Jesus didn't write John, the apostle John didn't write John as he was likely dead by then anyway. Still even then its the same, ignore them, love them and let God deal with them - rather than wholesale slaughter in God's name", 
   {}, 
   127627, 
   null, 
   1116908880.0
  ], 
  [
   127638, 
   null, 
   "Orion", 
   "You really don't have a very big selection there, Johnson. God is the only real game in town. It's either heaven or hell - your choice. As much as you might like, you don't get another option.\n\n \n Unless you happen not to be a Christian fundamentalist. \n \n \nAs for God killing the innocent children, the innocent go to heaven, so don't worry about them.\n\n \n A great argument in favour of abortion, or the murder of children, wouldn't you say? \n \n How many innocent infants, children, and unborn perished in Noah's flood, EZ? But, hey, they're in heaven, right? Never mind that they drowned in terror. \n \n One of my favourites along these lines...\n \n Num 31:17-18 Now therefore kill every male among the little ones, and kill every woman that hath known man by lying with him. But all the women children, that have not known a man by lying with him, keep alive for yourselves. \n \n ...a tribal deity encouraging both genocide and sexual servitude.\n \n Bonus question: How did the Hebrews determine which of those Midianite girls were virgins?", 
   {}, 
   127608, 
   null, 
   1116909120.0
  ], 
  [
   127643, 
   null, 
   "Tastyfish", 
   "I thought the purely innocent went to Limbo, as they has not received the path through Jesus. Not sure what to say about a plane of pure 'meh'.\n That's not taking into account original sin preached by some denominations as well.", 
   {}, 
   127638, 
   null, 
   1116909360.0
  ], 
  [
   127655, 
   null, 
   "trebor", 
   "Tastyfish,\n \n You say my God is evil? You sound like the liberals who say America is evil. Meanwhile you conveniently overlook the real evil people who God / America is bringing judgment against. Not good.\n \n Why doesn't god play nice like a good little liberal wants (so Osama and his henchmen can waltz into your neighborhood and start butchering innocent people).\n\n \n And what does liberals and american have to do with your god? Are you trying to \n CHANGE THE SUBJECT because you give a valid answer? The actions described that god took in both the tanakh, and the New testament is abhorent by modern standards. The fact you promote them tells a lot about you.", 
   {}, 
   127611, 
   null, 
   1116910260.0
  ], 
  [
   127707, 
   null, 
   "johnson", 
   "Word has it that Pharoah hardened his own heart first (Exodus 8:15, etc.), and God finished the job for him. \n \n \n \n Part of God's plan was to show the Egyptians that their \"gods\" couldn't help them. Each of the plagues dealt with a different Egyptian \"god\" (i.e. the blood in the Nile showed that Hapi, the \"god\" of the Nile, was impotent in stopping it). God wanted to show the Egyptians he alone was the sovereign God, and he did.\n\n \n Exodus 7:3 \"And I will harden Pharaoh's heart...\"\n \n Exodus 7:13 \" And he hardened Pharaoh's heart...\"\n \n Should I continue? theres more !!", 
   {}, 
   127605, 
   null, 
   1116917400.0
  ], 
  [
   127742, 
   null, 
   "Easyrider", 
   "Exodus 7:3 \"And I will harden Pharaoh's heart...\" Exodus 7:13 \" And he hardened Pharaoh's heart...\" Should I continue? theres more !!\n\n \n Pharaoh's heart became hard (Ex 7:13, 23) \n Pharaoh hardened his heart (Ex 8:15, 32) \n God hardened Pharaoh's heart (Ex 9:7, 10:20) \n \n However, when the Bible says Pharaoh hardens his heart, it also says that this happened \"just as the Lord had said\" (Ex 8:15). In particular, consider Exodus 9:34-10:2: \n \n When Pharaoh saw that the rain and hail and thunder had stopped, he sinned again: He and his officials hardened their hearts. So Pharaoh's heart was hard and he would not let the Israelites go, just as the LORD had said through Moses.  (rationalchristianity.net)", 
   {}, 
   127707, 
   null, 
   1116928620.0
  ], 
  [
   128030, 
   null, 
   "johnson", 
   "Exodus 10:16 - 20\n \n \" Then Pharaoh called for Moses and Aaron in haste; and he said, I have sinned against the Lord your God, and against you.\"\n \" Now therefore forgive, I pray thee my sin only this once, and intreat the Lord your God, that he may take away from me this death only.\"\n \" And he went out from Pharaoh, and intreated the Lord.\"\n \" And the Lord turned a mighty strong west wind, which took away the locusts, and cast them into the Red sea; there remained not one locust in all the coasts of Egypt.\"\n \" But the Lord hardened Pharaoh's heart, so that he would not let the children of Israel go.\"\n \n Exodus 11:10\n \n \" And Moses and Aaron did all these wonders before Pharaoh; and the Lord hardened Pharaoh's heart, so that he would not let the children of Israel go out of his land.\"\n \n \n Now verse 3 in the book of Exodus chapter 7 is the first mention of god going to harden Pharaoh's heart ... BEFORE god even sent Moses to Pharaoh.\n Exodus 7:3-4\n \" And I will harden Pharaoh's heart, and multiply my signs and my wonders in the land of Egypt.\"\n \" But Pharaoh shall not hearken unto unto you, that I may lay my hand upon Egypt...\"\n \n This sounds like gods planning to harden his heart so god can demonstrate it's power, which begs the question .. Why didn't god just not harden his heart and perhaps Pharaoh would have let them go? \n \n Now when we get to the end of the story Exodus 11:10 ( see above ) it states that god hardened Pharaoh's heart.\n \n So from beginning to end god does the hardening of Pharaoh's heart.", 
   {}, 
   127742, 
   null, 
   1116970740.0
  ], 
  [
   128085, 
   null, 
   "Easyrider", 
   "And who is hardening your heart towards salvation in Jesus Christ?", 
   {}, 
   128030, 
   null, 
   1116977280.0
  ], 
  [
   128157, 
   null, 
   "trebor", 
   "And who is hardening your heart towards salvation in Jesus Christ?\n\n \n \n That should be obvious. You are, and people like you.", 
   {}, 
   128085, 
   null, 
   1116988440.0
  ], 
  [
   128178, 
   null, 
   "Easyrider", 
   "Trebor, if you go down to the Pit it won't be my fault. I told you to repent and receive Jesus Christ as your Lord and Savior for the remission of your sins.", 
   {}, 
   128157, 
   null, 
   1116992820.0
  ], 
  [
   128181, 
   null, 
   "Dzeron", 
   "Trebor, if you go down to the Pit it won't be my fault. I told you to repent and receive Jesus Christ as your Lord and Savior for the remission of your sins.\n\n \n Easyrider, how do you know that Jesus Christ is not leading you to damnation? How do you know he really was the son of God, and not some deceptive sorcerer? Just because he did a few magic tricks doesn't mean he is all he says he is, you know.", 
   {}, 
   128178, 
   null, 
   1116993300.0
  ], 
  [
   128188, 
   null, 
   "johnson", 
   "And who is hardening your heart towards salvation in Jesus Christ?\n\n \n God it's self is .\n \n The bible is as it stands full of contridictions, this makes it impossible to believe the story. And to make it worse,... outside of some book written by someone that applies their own interpitation to ithe bible there is no other source to support it,... or should I say your interpitation of it.", 
   {}, 
   128085, 
   null, 
   1116994140.0
  ], 
  [
   128192, 
   null, 
   "Orion", 
   "Trebor, if you go down to the Pit it won't be my fault. I told you to repent and receive Jesus Christ as your Lord and Savior for the remission of your sins.\n\n \n You apparently have no idea whatsoever as to how much damage you're doing to your own cause or as to how many people you've alienated from your version of Christianity. People keep telling you this, at forum after forum. You know, EZ, if you implement a procedure in an attempt to reach some goal, and you eventually discover that, not only is the procedure not working, but that it is actually counter-productive to your goal, common sense would suggest that you re-evaluate the procedure. Hello? Anyone home?\n \n Fear is not a good motivator, EZ, especially with regard to religion. This should, by now, be obvious to you. I say \"should\", in an attempt to give you the benefit of doubt.", 
   {}, 
   128178, 
   null, 
   1116994740.0
  ], 
  [
   128238, 
   null, 
   "johnson", 
   "You apparently have no idea whatsoever as to how much damage you're doing to your own cause or as to how many people you've alienated from your version of Christianity. People keep telling you this, at forum after forum. You know, EZ, if you implement a procedure in an attempt to reach some goal, and you eventually discover that, not only is the procedure not working, but that it is actually counter-productive to your goal, common sense would suggest that you re-evaluate the procedure. Hello? Anyone home?\n \n Fear is not a good motivator, EZ, especially with regard to religion. This should, by now, be obvious to you. I say \"should\", in an attempt to give you the benefit of doubt.\n\n \n Good point Orion!!\n \n EZ You have made it abundantly clear that I can look forward to the following...\n \n An eternity traped in a burning pit of fire... seperated from god ... enduring the daily pain of my flesh as it sizzles from the unrelenting flames that encompass my mutilated body. The flames never ending , always present,... There as a constant reminder ... JOHNSON!! JOHNSON!!... Why didn't you just believe my book of contradictions. Why did you think it was not .. OK .. for me to have innocent babies slaughtered in their mothers wombs ? ... Why didn't you just listen to Easy Rider????????\n \n \n \n I will have only the lame excuse... It didn't make sense to me.\n \n \n PLEASE don't bring it up again as I'm clear on it. Lets just address each others comments with an answer that is pertinent to the question posed.", 
   {}, 
   128192, 
   null, 
   1117001220.0
  ], 
  [
   128536, 
   null, 
   "Easyrider", 
   "Why didn't you just believe my book of contradictions.\n\n \n Why don't you document one of your fabled \"contradictions\" for us so I can share in your stupor? \n \n \nOK .. for me to have innocent babies slaughtered in their mothers wombs ?\n\n \n You mean abortion? God doesn't like that (note Psalm 139:13). If you're referring to Judgment, I guess you, in your limited awareness of things, knows better than God? What audacity..... \n \n \nI will have only the lame excuse... It didn't make sense to me.\n\n \n The Bible is spiritually discerned, Johnson. You can't understand spiritual things with a worldly mindset. Ask Jesus to reveal his truths to you. Then you will begin to see the truth.", 
   {}, 
   128238, 
   null, 
   1117068600.0
  ], 
  [
   128551, 
   null, 
   "johnson", 
   "Why don't you document one of your fabled \"contradictions\" for us so I can share in your stupor? \n \n \n \n You mean abortion? God doesn't like that (note Psalm 139:13). If you're referring to Judgment, I guess you, in your limited awareness of things, knows better than God? What audacity..... \n \n \n \n The Bible is spiritually discerned, Johnson. You can't understand spiritual things with a worldly mindset. Ask Jesus to reveal his truths to you. Then you will begin to see the truth.\n\n \n \n \n Prov. 12:22 .. \" Lying lips are abomination to the Lord \"\n \n 1 Kings 22:23 .. \" The Lord hath put a lying spirit into the mouth of all these thy prophets. \"\n \n If god finds lying an abomination ... Why would it cause , of all people, prophets to lie? Shouldn't you be concerned that god my be doing that to the prophets that you follow today?\n \n \n \n No I don't mean abortion I mean \n \n Hosea 13:16\n \n Isaiah 13:18\n \n Numbers 31:17\n \n Hosea 9:16 \n \n Please go read them and then tell me god doesen't kill or have babies killed ...even in the womb.\n \n \n \n Pointing out that god murders unborn children is not a spiritual issue ... It's a moral issue.", 
   {}, 
   128536, 
   null, 
   1117072980.0
  ], 
  [
   128583, 
   null, 
   "Easyrider", 
   "Prov. 12:22 .. \" Lying lips are abomination to the Lord \"; 1 Kings 22:23 .. \" The Lord hath put a lying spirit into the mouth of all these thy prophets. \" If god finds lying an abomination ... Why would it cause , of all people, prophets to lie?\n\n \n The context of 1 Kings speaks of false prophets, not prophets of God. As the study note in the NIV Study Bible states, \"The Lord has given the 400 'prophets' over to the power of the lie because they did not love the truth and had chosen to speak out of their own hearts (see Jeremiah 14:14; 23:16, 26; Ezekiel 13:2-3, 17, etc....). \n \n \nShouldn't you be concerned that god my be doing that to the prophets that you follow today?\n\n \n See above. Your question is now a moot point.\n \n \nNo I don't mean abortion I mean Hosea 13:16; Isaiah 13:18; etc. Please go read them and then tell me god doesen't kill or have babies killed ...even in the womb.\n\n \n Let's see...Hosea 13:16 - Samaria is guilty, for she has rebelled against her God. First, Johnson, recite for us all the sins and atrocities the Samarians did before you call them innocent and start whining for them. Then we'll talk further.\n \n Still awaiting your fabled \"contradiction\"!", 
   {}, 
   128551, 
   null, 
   1117078080.0
  ], 
  [
   128589, 
   null, 
   "Orion", 
   "Why don't you document one of your fabled \"contradictions\" for us so I can share in your stupor?\n\n \n \"Stupor\"? Bravo, EZ. That's bound to win Johnson over to your side. No doubt about it. LOL!\n \n Contradictions? Way too many - but I'll provide two... \n \n How many animals on the ark?\n \n Gen 7:2 Of every clean beast thou shalt take to thee by sevens, the male and his female: and of beasts that are not clean by two, the male and his female.\n \n Gen 7:8-9 Of clean beasts, and of beasts that are not clean, and of fowls, and of every thing that creepeth upon the earth, There went in two and two unto Noah into the ark, the male and the female, as God had commanded Noah.\n \n These and other such Torah contradictions (creation, the flood, Abraham, Joseph to Egypt, the death and burial of Moses) make sense only if you recognize that these accounts are a combination and compilation of separate sources. Best guess is that one set came from the northern kingdom of Israel while another set came from the southern kingdom of Judah. Two kingdoms, two sets of priests/scribes, two texts. Later, someone (perhaps Ezra) attempted to merge them into a single text. You demand 'evidence' of this, do you? No problem. Bone up on the Documentary Hypothesis of the Torah. \n \n The nature of Jesus...\n \n John 10:30 I and my Father are one.\n \n Fair enough. But then we have...\n \n John 14:28 If ye loved me, ye would rejoice, because I said, I go unto the Father: for my Father is greater than I.\n \n John 20:17 but go to my brethren, and say unto them, I ascend unto my Father, and your Father; and to my God, and your God. \n \n \nYou mean abortion? God doesn't like that (note Psalm 139:13).\n\n \n You know, EZ, the Bible is filled with explicit prohibitions. Can you direct me to an explicit biblical prohibition against abortion? I've never been able to find one. \n \n \nIf you're referring to Judgment, I guess you, in your limited awareness of things, knows better than God? What audacity.....\n \n \n I realize, EZ, that you worship a book. However, many of us do not.\n \n \nThe Bible is spiritually discerned, Johnson. You can't understand spiritual things with a worldly mindset.\n\n \n Nonsense. The Bible can be read and studied as one might read and study any other ancient text.", 
   {}, 
   128583, 
   null, 
   1117079400.0
  ], 
  [
   128613, 
   null, 
   "johnson", 
   "The context of 1 Kings speaks of false prophets, not prophets of God. As the study note in the NIV Study Bible states, \"The Lord has given the 400 'prophets' over to the power of the lie because they did not love the truth and had chosen to speak out of their own hearts (see Jeremiah 14:14; 23:16, 26; Ezekiel 13:2-3, 17, etc....). \n \n \n \n See above. Your question is now a moot point.\n \n \n \n Let's see...Hosea 13:16 - Samaria is guilty, for she has rebelled against her God. First, Johnson, recite for us all the sins and atrocities the Samarians did before you call them innocent and start whining for them. Then we'll talk further.\n \n Still awaiting your fabled \"contradiction\"!\n\n \n \n \n #1\n Does it really matter if they are gods phrophets or not? this god says ... thou shalt not lie. Then it goes around putting .. lying spirits .. in the mouths of people.\n \n Didn't it have the option to put .. truthful spirits.. in their mouths so that perhaps those people listening to them could hear the truth .. instead of a lie??? Maybe they could have become faithful followers like you.... if god had put truth in their prophets mouths ..... instead of lies.\n \n \n #2 \n How would you know for shure someone was a prophet of \" God \"? Perhaps all the people listening to those prophets, filled with gods lying spirit , never questioned their prophets.\n \n \n #3\n You know .. .. I doubt very seriously that 100% of the people rebelled there. We sit on oppisite sides of the issue and I think we are both from the same people. Should god send an army to slaughter us because I and many others, in this same group, reject god?\n Couldn't god have sent in some phrophets that god didn't first fill ..\" with a lying spirt \".. to convert them? \n This doesn't make sense... god is willing to send lying prophets... and then slaughter unborn babies in their mothers womb , because they didn't see the truth? I would suggest god never provided it.\n \n #4\n Lets us use the verse you provided.. \" The Lord has given the 400 'prophets over to the power of the lie...\" You didn't tell me what verse this is, but I will trust you when you infer it's in support of 1 Kings 22:23. And that is the contridiction.\n \n Your verse says.. \" given over to the power of the lie \"\n Kings says .. \" The Lord hath put a lying spirit into the mouth of all these thy priests\"\n \n Which is it?", 
   {}, 
   128583, 
   null, 
   1117085580.0
  ], 
  [
   128614, 
   null, 
   "johnson", 
   "The context of 1 Kings speaks of false prophets, not prophets of God. As the study note in the NIV Study Bible states, \"The Lord has given the 400 'prophets' over to the power of the lie because they did not love the truth and had chosen to speak out of their own hearts (see Jeremiah 14:14; 23:16, 26; Ezekiel 13:2-3, 17, etc....). \n \n \n \n See above. Your question is now a moot point.\n \n \n \n Let's see...Hosea 13:16 - Samaria is guilty, for she has rebelled against her God. First, Johnson, recite for us all the sins and atrocities the Samarians did before you call them innocent and start whining for them. Then we'll talk further.\n \n Still awaiting your fabled \"contradiction\"!\n\n \n \n \n #1\n Does it really matter if they are gods phrophets or not? this god says ... thou shalt not lie. Then it goes around putting .. lying spirits .. in the mouths of people.\n Didn't it have the option to put .. truthful spirits.. in their mouths so that perhaps those people listening to them could hear the truth .. instead of a lie??? Maybe they could have become faithful followers like you.... if god had put truth in their prophets mouths ..... instead of lies.\n \n \n #2 \n How would you know for shure someone was a prophet of \" God \"? Perhaps all the people listening to those prophets, filled with gods lying spirit , never questioned their prophets.\n \n \n #3\n You know .. .. I doubt very seriously that 100% of the people rebelled there. We sit on oppisite sides of the issue and I think we are both from the same people. Should god send an army to slaughter us because I and many others, in this same group, reject god?\n Couldn't god have sent in some phrophets that god didn't first fill ..\" with a lying spirt \".. to convert them? \n This doesn't make sense... god is willing to send lying prophets... and then slaughter unborn babies in their mothers womb , because they didn't see the truth? I would suggest god never provided it.\n \n #4\n Lets us use the verse you provided.. \" The Lord has given the 400 'prophets over to the power of the lie...\" You didn't tell me what verse this is, but I will trust you when you infer it's in support of 1 Kings 22:23. And that is the contridiction.\n \n Your verse says.. \" given over to the power of the lie \"\n Kings says .. \" The Lord hath put a lying spirit into the mouth of all these thy priests\"\n \n Which is it?", 
   {}, 
   128583, 
   null, 
   1117085640.0
  ], 
  [
   128759, 
   null, 
   "notdakuningist", 
   "\"Notdakuningist,\n The Catholic Church remains an apostolic church to this day. The current bishops can be traced back in an unbroken line to the apostles (so too in the Orthodox Church).\n \n Catholics, and Christians in general, do not hold that December 25th is the actual birthdate of Christ. It is a day of commemoration. Christmas was not a feast day in the Church until about the 200s. And even then it was not a set day and different areas celebrated it at different times. But this does nothing to diminish the value of celebrating the Lord's birth and reflecting on the nativity of the Gospel of Luke.\n \n What specific questions do you have about Easter? I will try to do my best to answer.\n \n As far as the Pope Leo quote, I did address that in my first post (Big Orn also addressed it before that). It is attributed to an ex-Catholic priest playwright who had an animosity to the papacy. See this link:\n \n http://www.tektonics.org/lp/popeleox.html\"\n \n \n Wasn't it celebrated as a pagan holiday before a Chrisitan one, or is that just because it was a common holiday date?\n Supposing the story of Jesus as put in the Bible is at least part true and not derived as metaphor for other \"proto Jesus\" characters the biggest problem I have with Church doctrine is that there are so many different ways it is interpreted. On one hand you have the church of god apostolics who follow a strict set of guidelines but still only follow what they want to out of the Bible, and on the other you have more liberal protestant groups. Both pick and choose what to follow muddling the rules and guidelines set in the Bible.\n (Technically aren't women supposed to wear a shroud when they pray according to the old testament?) This is why I take a more personal interpretation of faith, as I would rather follow my own interpretation of the creator and use my own good judgement with regards to morality. Some say I'm an agnostic and going to hell, well then so be it. They probably are as well if the rules are that strict.", 
   {}, 
   128614, 
   null, 
   1117125900.0
  ], 
  [
   129058, 
   null, 
   "Easyrider", 
   "Orion,\n \n I see you've come out of the closet again to bash Christ and the Bible, just as you've been doing unsuccessfully for the 6 years I've been watching you. \n \n You've never been balsy enough to tell people who your so-called \"god\" is, or where that ficticious slug lives. Is it a cave-dweller? City-dweller? Lives in the sky? On Bourbon Street? Or in the bath houses of San Francisco, perhaps....hmmm. No doubt you don't have a clue. Which is why you can only bash other people's religions, especially Christianity, because you're unable to defend your own beliefs. \n \n Now let's see...your so-called god says gay sex hedonism, abortion (infanticide), fornication, Christ-bashing, and other such things are morally okay. I don't know any \"god\" I've ever heard about that buys into all that madness. Closest thing I've seen to that is Satan. Are you a Satanist, Orion? You certainly have the spirit of antichrist, calling Jesus \"gay jesus\" as you often have. Not real good there, Orion. You're as lost as you can be.\n \n Anyway, when you get the moxy to tell us who your so-called \"god\" is then you will start to gain some credibility around here. Otherwise you're just another in a long and sorry line of loser Christ-bashers.", 
   {}, 
   128759, 
   null, 
   1117161360.0
  ], 
  [
   129063, 
   null, 
   "Tastyfish", 
   "I've only ever seen you talk about gay jesus Easyrider, when attacking Orion who you seem to hate with a passion (how unchristian of you, tsk, tsk.)\n \n Where does you God live Easyrider, I don't think I've heard you say where exactly, and if we are going for other planes of reality, then why is it so hard to imagine that Orion's god (if he has one) lives in one of his own too?", 
   {}, 
   129058, 
   null, 
   1117161960.0
  ], 
  [
   129065, 
   null, 
   "Easyrider", 
   "Johnson,\n \n Sorry but I really don't have time to answer all your anti-Biblical arguments. I've answered thousands upon thousands over the years so I don't want you to think I am unable to. There's a couple dozen websites available (and dozens of books) that explain or refute the kinds of issues you are raising. Just go to Yahoo and type in \"Did God create evil\", etc. You can look them up to suit yourself. All day long. I can also recommend some good study bibles that will help you understand the things of God better: The NIV Study Bible; The Life Application Study Bible; The MacArthur Study Bible, are three. All have hundreds of notes and cross-references to help you out. I do recommend you get some formal education on all this if you're going to pursue it, as I hate to see you guys keep making these same, tired arguments. \n \n Jeremiah 23:5-6", 
   {}, 
   129058, 
   null, 
   1117162080.0
  ], 
  [
   129067, 
   null, 
   "Easyrider", 
   "I've only ever seen you talk about gay jesus Easyrider, when attacking Orion who you seem to hate with a passion (how unchristian of you, tsk, tsk.)\n\n \n You haven't been around him for six years like I have. He's a Bible-bashing loser who hates the Biblical Jesus Christ. After 6 years of his Christ-bashing follies I just call a spade a spade. If you don't like it that's too bad too.", 
   {}, 
   129065, 
   null, 
   1117162320.0
  ], 
  [
   129068, 
   null, 
   "Tastyfish", 
   "Not even one chance of a freebie? Given that you know the answer anyway whats wrong with just posting the argument against the lying one. Saying just get a bible and look up for yourself is not helpful as clearly they have looked up and found this contradiction. Seeing as you have read them yet seem unwilling to answer does not bode well for your recomendations (seeing as they might not be able to answer the question we actually want answered)", 
   {}, 
   129065, 
   null, 
   1117162320.0
  ], 
  [
   129090, 
   null, 
   "johnson", 
   "Johnson,\n \n Sorry but I really don't have time to answer all your anti-Biblical arguments. I've answered thousands upon thousands over the years so I don't want you to think I am unable to. There's a couple dozen websites available (and dozens of books) that explain or refute the kinds of issues you are raising. Just go to Yahoo and type in \"Did God create evil\", etc. You can look them up to suit yourself. All day long. I can also recommend some good study bibles that will help you understand the things of God better: The NIV Study Bible; The Life Application Study Bible; The MacArthur Study Bible, are three. All have hundreds of notes and cross-references to help you out. I do recommend you get some formal education on all this if you're going to pursue it, as I hate to see you guys keep making these same, tired arguments. \n \n Jeremiah 23:5-6\n\n \n \n If I did this, I would be denied the stimulating and enriching aspects of YOUR personal opinion.", 
   {}, 
   129065, 
   null, 
   1117165920.0
  ], 
  [
   129155, 
   null, 
   "Orion", 
   "Orion, I see you've come out of the closet again to bash Christ and the Bible,\n\n \n Nope, I don't do that. You're not a scholar and your interpretation of the Bible is not the final word. Sorry. If you come here to evangelize, which you obviously do, you had better be prepared to defend your positions. If you claim, as you do, that Christianity in general and your particular version of Christianity in particular, constitutes the only troo religion, you can expect some opposition. I realize that 'religious tolerance' is not part of your vocabulary, but that's your problem. \n \n \nYou've never been balsy enough to tell people who your so-called \"god\" is, or where that ficticious slug lives.\n \n \n Well now, what a gracious invitation! LOL! How many times must I explain it to you, EZ? I'm not here to evangelize, whereas you are here to do just that. And when, in your zeal to evangelize, you attack the religious beliefs of others (Judaism, Islam, Hinduism, Wicca, etc.), you invite response from folks such as myself who actually know what they're talking about. Besides, I enjoy watching you stew in your frustration. \n \n \nAnyway, when you get the moxy to tell us who your so-called \"god\" is then you will start to gain some credibility around here.\n \n \n Credibility is earned, EZ. And once trashed, it's difficult to gain back. You might wanna think about that. \n \n \nYou haven't been around him for six years like I have. He's a Bible-bashing loser who hates the Biblical Jesus Christ. After 6 years of his Christ-bashing follies I just call a spade a spade. If you don't like it that's too bad too.\n\n \n Lashing out again, EZ? So much venom, so much bile. Learn to defend your arguments, my friend, and learn to accept (when necessary) defeat with grace and dignity. Above all else, learn to be both scholarly and objective. If you can master these, then your evangelism will become more credible.", 
   {}, 
   129067, 
   null, 
   1117174140.0
  ], 
  [
   129164, 
   null, 
   "johnson", 
   "You haven't been around him for six years like I have. He's a Bible-bashing loser who hates the Biblical Jesus Christ. After 6 years of his Christ-bashing follies I just call a spade a spade. If you don't like it that's too bad too.\n \n \n \n Orion doesn't seem like a looser to me, and I'm supprised you didn't list me as the number one bible basher ( I'll have to work harder ).\n \n Ez there is a difference as to how Orion and I have adressed you in comparision as to how you have adressed us. We both have adressed the issues, not attacked the person.\n \n We are already treating you this way, Why not give us the same courtesy?", 
   {}, 
   129067, 
   null, 
   1117175400.0
  ], 
  [
   129204, 
   null, 
   "trebor", 
   "You haven't been around him for six years like I have. He's a Bible-bashing loser who hates the Biblical Jesus Christ. After 6 years of his Christ-bashing follies I just call a spade a spade. If you don't like it that's too bad too.\n\n \n \n Oh, I like Orion. It is you that is the loser. I have very rarely seen such a hate driven personality type fuming at the gates, preaching damnation to everyone that does not fit your very narrow and bigoted view of God. \n \n I bet you hate gay people too.", 
   {}, 
   129067, 
   null, 
   1117200000.0
  ], 
  [
   129639, 
   null, 
   "Easyrider", 
   "Trebor, Jesus himself tells you in the Bible his plan for salvation, and you don't believe him either - that he's the resurrection and the life, and the way and the truth and the life. Fact is, right now you hate the Word of God, don't you, just like Orion. That's why you like Orion, because you are both Christ-deniers. You both have the same unbelieving mentality that the Jews in John chapter 10:\n \n 24 The Jews gathered around him, saying, \"How long will you keep us in suspense? If you are the Christ, tell us plainly.\" \n \n 25 Jesus answered, \"I did tell you, but you do not believe. The miracles I do in my Father's name speak for me, 26 but you do not believe because you are not my sheep. 27 My sheep listen to my voice; I know them, and they follow me. 28 I give them eternal life, and they shall never perish; no one can snatch them out of my hand. 29 My Father, who has given them to me, is greater than all; no one can snatch them out of my Father's hand. 30 I and the Father are one.\" \n \n 31 Again the Jews picked up stones to stone him...\n \n Now go, receive Christ, before it's too late for you.", 
   {}, 
   129204, 
   null, 
   1117289160.0
  ], 
  [
   129641, 
   null, 
   "Symbiote", 
   "I'm not sure if you realise, Easyrider, but your sermonizing is entirely unconvincing. It appears to us \"Christ deniers\" that your intention is not to convert, but to condemn, it looks to use like you use the Bible as a pulpit to stand on and declare everyone else evil. Consequently, it makes Christianity look like a terrible religion - between people like yourself and the already associated \"Creationists\" who appear entirely insane - it would seem the followers Christianity attracts are to a large extent not very savoury characters.", 
   {}, 
   129639, 
   null, 
   1117289760.0
  ], 
  [
   129820, 
   null, 
   "Orion", 
   "Fact is, right now you hate the Word of God, don't you, just like Orion. That's why you like Orion, because you are both Christ-deniers.\n\n \n Lashing out again, EZ? Spewing more of that venom, are you? You had earlier characterized me as being a \"loser\"... \n \n \nYou haven't been around him for six years like I have. He's a Bible-bashing loser who hates the Biblical Jesus Christ.\n\n \n However, given the nature of your desperate attacks against those who disagree with your theology, I'll let folks here decide as to which of us is the \"loser\". If your and my performance at prior discussion fora is any indication, then I already know the outcome of that decision. \n \n Learn to discuss, EZ. After all, this is a discussion forum. Learn to share as well as to consider the opinions and contributions of others. Try not to be quite so combative. Learn the value of studying religious beliefs other than your own. Were you to pick up on these humble suggestions, I've no doubt that you could become an interesting conversationalist and valued contributor to these discussions.", 
   {}, 
   129641, 
   null, 
   1117344780.0
  ], 
  [
   129868, 
   null, 
   "Easyrider", 
   "I'm not sure if you realise, Easyrider, but your sermonizing is entirely unconvincing. It appears to us \"Christ deniers\" that your intention is not to convert, but to condemn, it looks to use like you use the Bible as a pulpit to stand on and declare everyone else evil.\n\n \n Hardly. I'm telling you just like it is. Jesus is the only way to salvation (John 14:6). Salvation is found in no one else, for there is no other name under heaven given to men by which we must be saved (Acts 4:12). If you ever are condemned to hell it won't be by my hand. It will be of your own doing for denying Jesus Christ as your Lord and Savior for the remission of your sins.\n \n p.s. Jesus is the True Light (John 1:9) of the World.", 
   {}, 
   129820, 
   null, 
   1117368540.0
  ], 
  [
   129871, 
   null, 
   "Easyrider", 
   "However, given the nature of your desperate attacks against those who disagree with your theology, I'll let folks here decide as to which of us is the \"loser\". If your and my performance at prior discussion fora is any indication, then I already know the outcome of that decision.\n\n \n Before you get too self-righteous, Orion, let's look at some ot the topics you considered \"funny\" in a link you gave us over at the USAT Creation / Evolution Forum: \n \n Christian Crimes - Pastor Molests Widow's Boys - Pastor Molests Adopted Daughters - Priest Molests Altar Boys - Late for Church - Christian Racist Kidnapper - Music Pastor Molests - Bush's Faith-based Failure - Pastor Molest, Guns, Drugs - $400,000 Missing - Priest Molests - Church Youth Coach Molests - Bush Suppresses Student Prayer - Sen Byrd's 'White (\"N\" word)'.\n \n This was all part and parcel of your continued Bible and Christ-bashing enterprise, which has gone on for the six years I have known you.\n \n Is this funny? It's was apparently real funny to you, Orion. Your link also had a pornographic sub-link on the Virgin Mary, describing her private parts in graphic, profane language. \n \n As for theology, you've got squat. All you have is an invented \"all paths (EXCEPT BIBLICAL CHRISTIANITY) lead to God theory\". LOL! You can't back it up with any credible evidence and you centrainly are still scratching your head trying to figure out where your so-called \"god\" lives. If he's not in the sky then he must be a cave dweller perhaps? Why don't you let us know on that (if you can).", 
   {}, 
   129868, 
   null, 
   1117369200.0
  ], 
  [
   130136, 
   null, 
   "Orion", 
   "Lashing out again, EZ? Spewing more of that venom, are you? You had earlier characterized me as being a \"loser\". However, given the nature of your desperate attacks against those who disagree with your theology, I'll let folks here decide as to which of us is the \"loser\". If your and my performance at prior discussion fora is any indication, then I already know the outcome of that decision.\n\n \n \nBefore you get too self-righteous, Orion, let's look at some ot the topics you considered \"funny\" in a link you gave us over at the USAT Creation / Evolution Forum:\n\n \n EZ, in my above post, I was attempting to be both subtle as well as kind to you, without having to actually get into the messy details. Apparently, my attempt went right over your head. I'm not going to take your bait, EZ. However, I will point out to you that whereas I've never been banned from an Internet discussion forum, you've not been quite so fortunate, have you?", 
   {}, 
   129871, 
   null, 
   1117419840.0
  ], 
  [
   130169, 
   null, 
   "Easyrider", 
   "Would you consider abortion in the following cases?\n \n 1. There's a preacher and wife who are very, very, poor. They already have 14 kids. Now she finds out she's pregnant with her 15th. They're living in tremendous poverty. Considering their poverty and the excessive world population, would you consider recommending she get an abortion? \n \n 2. The father is sick with sniffles, the mother has TB. They have 4 children. the 1st is blind, the 2nd is dead, the 3rd is deaf and the 4th has TB. she finds she's pregnant again. Given the extreme situation, would you consider recommending abortion? \n \n 3. A white man raped a 13 year old black girl and she got pregnant. If you were her parents, would you consider recommending abortion? \n \n 4. A teenage girl is pregnant. She's not married. Here fiancee is not the father of the baby, and he's very upset. Would you consider recommending abortion? \n \n Answers: \n \n If you have answered \"yes\" in any of these situations: \n \n In the first case, you have just killed John Wesley. One of the great evangelists of the 19th century. \n \n In the second case, you have killed Beethoven. \n \n In the third case, you have killed Ethel Waters, the great black gospel singer. \n \n If you said yes to the fourth case, you have just declared the murder of Jesus Christ!  \n \n Something to think about and pass along.\n \n Psalm 139:13", 
   {}, 
   130136, 
   null, 
   1117426500.0
  ], 
  [
   130170, 
   null, 
   "trebor", 
   "Would you consider abortion in the following cases?\n \n 1. There's a preacher and wife who are very, very, poor. They already have 14 kids. Now she finds out she's pregnant with her 15th. They're living in tremendous poverty. Considering their poverty and the excessive world population, would you consider recommending she get an abortion? \n \n 2. The father is sick with sniffles, the mother has TB. They have 4 children. the 1st is blind, the 2nd is dead, the 3rd is deaf and the 4th has TB. she finds she's pregnant again. Given the extreme situation, would you consider recommending abortion? \n \n 3. A white man raped a 13 year old black girl and she got pregnant. If you were her parents, would you consider recommending abortion? \n \n 4. A teenage girl is pregnant. She's not married. Here fiancee is not the father of the baby, and he's very upset. Would you consider recommending abortion? \n \n Answers: \n \n If you have answered \"yes\" in any of these situations: \n \n In the first case, you have just killed John Wesley. One of the great evangelists of the 19th century. \n \n In the second case, you have killed Beethoven. \n \n In the third case, you have killed Ethel Waters, the great black gospel singer. \n \n If you said yes to the fourth case, you have just declared the murder of Jesus Christ!  \n \n Something to think about and pass along.\n \n Psalm 139:13\n\n \n The forth case would have stopped millions of people from being murdered. Sounds good to me.", 
   {}, 
   130169, 
   null, 
   1117426920.0
  ], 
  [
   130174, 
   null, 
   "Orion", 
   "Would you consider abortion in the following cases?\n \n\n \n EZ, when you cut&paste from a source, it's important that you give attribution to that source. Otherwise, you are engaging in what we refer to as plagiarism, otherwise known as intellectual dishonesty. Just another suggestion, EZ.\n \n http://www.clean-funnies.com/html/f364.htm", 
   {}, 
   130169, 
   null, 
   1117428300.0
  ], 
  [
   130243, 
   null, 
   "Easyrider", 
   "Orion,\n \n I got it in an e-mail, thank you very much. Go report it to the police if it really bothers you. \n \n In the meantime, do tell us who your \"god' is and where it lives?", 
   {}, 
   130174, 
   null, 
   1117458120.0
  ], 
  [
   130348, 
   null, 
   "Tastyfish", 
   "Easyrider - where is your god then and what exactly is it?\n You've not answered this to any real degree ever.", 
   {}, 
   130243, 
   null, 
   1117476600.0
  ], 
  [
   130575, 
   null, 
   "maximus", 
   "EZ Rider,\n What is a bible based church?", 
   {}, 
   130348, 
   null, 
   1117504620.0
  ], 
  [
   130577, 
   null, 
   "maximus", 
   "Made it back....\n \n Greetings all.\n \n Look, I don't wanna get into the usual shouting match with the religious. That is so cliche'. Generally speaking, it seems that I cannot voice my beliefs, which may differ from theirs, without them launching into whatever that thing they do is called. John this, Peter that, blah, blah...... Again, cliche.\n \n I have said all I know to say. You can believe what you wanna believe. And I can giggle about it if I want. That's the real deal. When it's all said and done, I will still not go for the La-La land fairy tales religions have to offer me and I will still not understand how a normally intelligent, clear thinking person could. That's the real mystery I suppose.\n \n In previous posts, I merely commented regarding things I have come across in my readings. They may be factual , they may be BS. I don't know. I didn't author it. I merely read it and commented on it. You can prove those writings wrong if you desire. It offends me not. They are just writings in a book I picked up somewhere that made sense to me. But remember when you are offering your pouty rebuttal, YOU (some of you) are the ones who believe in the, what I consider to be the, quack quack of the RCC church. emoticon_rolleyes YOU are the one telling me of your faith in what I see as obvious myth and superstition. So, that being said, you can't understand why I don't give your arguments very much credibility? For heavens sake, emoticon_xangel , step outside of the conversation and take an objective look at what people are telling me..\n \n Here's some of you guys, on one hand, talking about some guy in the sky, dead people coming back alive, oceans parting, sticks turning into snakes, bush's burning, virgin births, angelic conception, Noah's ark, and the fantasies just seem to go on and on. Where did you get YOUR information? You either read it somewhere or someone taught it to you. (I wouldn't be surprised if some of you tried to convince me you were actually there 2000 years ago. But you can't so don't try. I wouldn't believe that either emoticon_rolleyes .) The facts, the way I see them, you don't have a clue as to what you talking about. This is just some more of the religious mumbo jumbo I have heard all my life. I know it word for word or \"cover to cover\" so to speak. This is nothing new to me.\n \n Then there's me. The evil blaspheming heretic emoticon_rolleyes . The one you guys forgot to burn at the stake. emoticon_wow I am simply saying that if it looks like a duck and quacks like a duck, it's a duck. emoticon_xchicken I am saying the naked emperor is wearing no clothes. emoticon_idea I am saying that I don't believe in Santa. And you guys are jumping down my throat for telling the truth. I was not around 2000 years ago. I admit that I do not have a clue who did and who did not walk on the earth then but neither do you. But I can be reasonably sure that whoever did, the laws of physics and nature were observed and nobody instantly turned a big jug of water into a cask of wine or that somebody smeared mud in a blind person's eyes and they suddenly could see again.\n \n So, who here is making any real sense? The religious and their \"magical mystery tour\" beliefs? Or me, simply getting by with logic and the dictates of reason on the side of my posts? I am a \"Popular Mechanics\" kinda guy and the religious are \"Grimm's Fairy Tales\" kinda people. It's that simple really.\n \n I am the logical Mr. Spock, 2+2=4, kinda guy and the religious come across to me like hippies on LSD. No offense. I can't help it. (I know that angers them and for that I sincerely apologize. That's not my intention. ) \n \n Further, they (some) act EXACTLY like the second graders did, when I told them I didn't believe in Santa Claus and why....(see above posts and responses to my posts.) Some things never change. emoticon_rolleyes \n \n OK...I'm done. Wail away. Crucify me. Just remember how much worth I put into the words of someone who is over 21 years of age and still believes in Santa Claus or any other fairy tales for that matter. I doubt you will offend me. But you can keep trying if you like.\n\n Truthsayer,\n I'll be your Huckleberry.\n \n I will concede three points to you. There are lazy Christians, there are ignorant Christians, and there are those who randomly quote scripture that is irrelevant to the subject at hand. But that does not mar the entire Christian faith as you propose. Let's make one thing crystal clear, religion is not required for ignorance to flourish. Ignorance abounds in all forms and fashions, in all areas and belief systems. The example of Jesus was never like that. He was both lucid and appropriate in the defense of his beliefs even though, at the same time, he might say what was never expected. But your generalization is way off. Your statements were not simply about being answered with scripture when scripture was not relevant, or about lazy Christians. A statement against that can be made in a logical, straight-forward way without ad hominem. You profess to be a logic and reason man but that is not what I saw in your early posts. \n \n You started off so confident, so committed to your cause in the first post, now you are dwindling. You started the shouting match shouting so loudly with your chest puffed out but now I hear only whispers of retreat and avoidance. Let's not get into the usual shouting match. Let's make it unusual. I am really curious to know from whom you received your great education responsible for enlightening you away from Christianity; this great educational experience you so proudly profess in superiority to that of Christendom. It wasn't at one of the numerous Catholic institutions of higher education was it? But no, I doubt you are speaking of a formal education. Perhaps, a great education comes from reading a lot of things, as you say you do. You read a lot of things, some of which may be BS, some of which may be factual. Then you say you throw everything out there-great modus operandi. You tell us this shortly before you ask us to step outside and assess our own objectivity and credibility. These things are \"writings in a book you picked up somewhere that made sense.\" It seems in your opinion that the only book one is not allowed to pick up anything from is the Bible. This book is, of course, off limits. I suppose it does not meet the high standards that are required when one is disseminating important BS like you are. We gain another point of agreement in this. You are throwing out some BS. The difficulty I am having is determining why your BS is on a higher plane than scripture.\n \n How is your putting out what you read whether it's factual or not helping your cause to advance facts and not fiction, reality and not myth? How is that any different than a Christian spouting Bible verses at any chance he gets no matter how irrelevant they might be to the subject at hand? It sounds like your irrelevance battling their irrelevance. But who will educate the poor Catholic/Christian if you do not?\n \n But I also have 3 other points to make in response to your post that I would like you to consider. \n \n 1. There is a difference between myth and religion.\"[There is] a disproportion and even disruption between the very ideas of mythology and religion; the chasm between the two categories. It is really the collapse of comparative religion that there is no comparison between God and the gods.   There is no more comparison than there is between a man and the men who walked about in his dreams.\n \n The contrast of monotheism and polytheism is [not simply] a matter of some people having one god and others a few more. \n \n He who has the most sympathy with myths will most fully realise that they are not and never were a religion, in the sense that Christianity or even Islam is a religion. They satisfy some of the needs satisfied by a religion; and notably the need for doing certain things at certain dates; the need of the twin ideas of festivity and formality. But though they provide a man with a calendar they do not provide him with a creed. A man did not stand up and say 'I believe in Jupiter and Juno and Neptune,' etc., as he stands up and says 'I believe in God the Father Almighty' and the rest of the Apostles Creed. Many believed in some and not in others, or more in some and less in others, or only in a very vague poetical sense in any. There was no moment when they were all collected into an orthodox order which men would fight and be tortured to keep intact.\" \n \n I confess I doubt the whole theory of the dissemination of myths or (as it commonly is) of one myth. It is true that something in our nature and conditions make many stories similar; but each of them may be original. One man does not borrow the story from the other man, though he may tell it from the same motive as the other man. It would be easy to apply the whole argument about legend to literature; and turn it into a vulgar monomania of plagiarism. G.K. Chesterton The Everlasting Man\n \n \n 2. You profess adherence to logic and reason yet your logic and reason are fraught with contradiction. You decry the supposed myth of Christianity yet you have your own personal myth of a supreme being. \n \n \nPost 80\n \"I acknowlege something inside me that points my thoughts, for lack of a better word, to the heavens, or that is to say, something bigger and better than myself. What I might call a prayer, someone else might call a meditation. I do not pretend to know the source of this inspiration. I do not visualize a lily-white face of a long haired man in a flowing robe when I do find myself in this odd form of communication. I only hope my thoughts and desires are heard. I cannot prove that he/she/it/they/them/?/ exists nor would I be so nieve to assume I could.\"\n\n You have an interesting explanation of how you know there is a God. It isn't with education, citing research articles, and studying history? Your explanation of God seemed to have nothing to do with education or sound history. I doubt you can do any better than the Christian in that regard-actually you probably do worse because your God has no identity, no history, no story, no venture into the flesh. You can't understand how we can believe that this unseen presence has made himself seen on earth...how he has chosen to demonstrate the union of the natural and supernatural-but yet that union is present in all of us in the union of the spiritual and physical. At least Christianity has a history, an encounter with mankind, a communion between man and God, a face of God, an entrance into the flesh joining divine and man. But if we can't rely on the history of Christianity (although I propose we can) then why can't we as Christians just have this feeling of something bigger and better than ourselves-why can't we have the feeling that God has revealed himself to the world? If God is found by only a feeling (sounds like faith) and our feelings lead us to believe in the Christian view of God then why do you contest us?\n \n You say you live your life by logic and reason. But yet you don't see the illogic in believing in a supernatural deity and at the same time denying that deity the power of miracles in the natural world (those that have been documented in Christianity). If one can believe in this \"something bigger and better\" than one's self in the \"heavens\" worthy of prayer and meditation then why would he not be able to believe in \"some guy in the sky, dead people coming back alive, oceans parting, sticks turning into snakes, bush's burning, virgin births, angelic conception, Noah's ark?\" If one can believe in a supernatural presence that has created and wields control over things \"so that you hope your thoughts and desires are heard\" then why would this presence not have control over the material world in the form of miracles? Why would this supernatural being be unable to control the natural world he created? Why would he not be able to part the Red Sea, flood the entire earth, raise the dead? Why would he be unable to create a child in a virgin's womb when he created all of mankind in the first place? The second miracle is no more than the first is it? Why would he not be able to assume human form if he created the human form?  Why would he not choose to commune with man in the most logical, straight forward way-as one with him in humanity?\n \n You demand objectivity in the Christian in sound history and reason yet you allow subjectivity in your position by the invention of your own god.\n \n You allow a god who reveals himself to you but you discount a God who has revealed himself to the world. You allow a religion of one's self but deny the common sense logic of Jesus starting a church. If one looks at your myth and our myth then who truly has the broader view? Our myth is universal and united. Yours is personal and subjective. Our myth is objective in the sense that there was one Jesus of history who started one church. But your myth can be created each day by any person having any framework of a god in his own mind. \n \n You cannot envision a personal God in your logic. But you can personally come up with a God. You can envision only a massive, ethereal, unseen, immensity without intimacy or interest in the physical world. Yet I believe it more logical to think that a God who has created so many unique personalities and individuals be personal in the sense that he knows us by name and in the sense that he can be known. You can't understand how a normally intelligent, clear thinking person could continue to believe in the myths of Christianity. Yet it has persisted in the minds and hearts of many great minds for 2,000 years. You can't comprehend how a normally intelligent, clear thinking person has the same feelings that you do about an unseen presence but adds illumination to those feelings by the experience of history on earth. I will take the concrete nature of the Christian religion to complement the spiritual nature of the Christian faith any day versus your void, your absence, your negation. \n \n Evil blaspheming heretic? No, you are not even that. You don't have the substance of a heretic. They believed in something whereas you believe in nothing. They kept the tradition of their forefathers and distorted it but you throw everything to Hell in a handbasket. You deconstruct all and do not construct any. You don't even maintain. Although you do you have touch of Gnosticism, if you were a Gnostic you would have to be one without gnosis. If you were a Cathar, then one lacking conviction. If a Protestant, then one lacking sufficient Protest.\n \n You do remind me of an agnostic though. Even though you profess to be a theist. In fact, you remind me of a certain kind of agnostic-one who used to be an ill-educated Christian. Chesterton explains it nicely in The Everlasting Man:\n \n But that marks their mood about the whole religious tradition: they are in a state of reaction against it...They cannot be Christians and they cannot leave off being Anti-Christians. Their whole atmosphere is the atmosphere of reaction: sulks, perversity, petty criticism. They still live in the shadow of the faith and have lost the light of the faith. Now the best relation to our spiritual home is to be near enough to love it. But the next best is to be far enough away not to hate it. It is the contention of these pages that while the best judge of Christianity is a Christian, the next best judge would be something more like a Confucian. The worst judge of all is the man now most ready with his judgments; the ill-educated Christian turning gradually into the ill-tempered agnostic, entangled in the end of a feud of which he never understood the beginning, blighted with a sort of hereditary boredom with he knows not what, and already weary of hearing what he has never heard. He does not judge Christianity calmly as a Confucian would; he does not judge it as he would judge Confucianism. He cannot by an effort of fancy set the Catholic Church thousands of miles away in strange skies of morning and judge it as impartially as a Chinese pagoda. \n \n 3. But if you must persist that Christianity is a myth/a fairy tale then I must finally concede. I must tell you that I love fairy tales. Everyone that I know does. Those who don't are quite dull. I think it may be human nature or perhaps it is actually human supernature stemming from our origin in God.\n \n A fairy tale? Dream world? Fantasy? That's the world where I want to live. I love fairy tales. I am currently reading a series of fictional books with wizardry as its theme. I also love the Westmark Trilogy, Lord of the Rings, The Prydain Chronicles, Star Wars, westerns, and romances. Humans are built for fantasy. And we are the only ones that fantasize. The apes and chickens and antelopes don't have it in them. They are a bit close-minded. \n \n Most of all, I love the fairy tale of Christianity. A fairy tale that seems \"too good to be true, except that it is.\" A fairy tale whose author is God. The greatest of all fairy tales. \n \n You were right to end your last post by saying \"I'm done.\" I believe you are, and probably have been since your first post. After all, has the thought occurred to you that the second grade reaction you received in some cases was in response to your second grade instigation? And no more soliloquy, please. Only impressive debate (including any questions or attacks on the despised inventions and mythology of the Roman Catholic Church) or an apology will be sufficient to uphold your name. Sayers of truth do not throw out BS (your terms) and falsehood as much as you do. \n \n Have you met any Christians yet that pray to Gandalf yet?", 
   {
    "unicode_changes_made": true
   }, 
   125525, 
   null, 
   1117505280.0
  ], 
  [
   130626, 
   null, 
   "Orion", 
   "EZ, when you cut&paste from a source, it's important that you give attribution to that source. Otherwise, you are engaging in what we refer to as plagiarism, otherwise known as intellectual dishonesty. Just another suggestion, EZ.\n \n http://www.clean-funnies.com/html/f364.htm\n\n \n \nOrion, I got it in an e-mail, thank you very much. Go report it to the police if it really bothers you.\n\n \n That's mighty fine, EZ. Only, you didn't indicate as such in your original cut&paste. Instead, you left us with the impression that these were your words. How could we think otherwise, given that you did not give attribution, if even to an email sent to you? \n \n Now, I suspect that you lack an academic background, so I further suspect that little of this means anything to you. However, those of us who have attained at least a high school education understand the importance of intellectual honesty, and that such importance gains significance as one passes through undergraduate and graduate studies, and eventually into the workplace. \n \n I admit that I've probably done this very thing myself. It's easy to do, especially in the heat of argument (or in your case, evangelism). But I try and catch myself whilst remembering that it's the wrong thing to do. The theft of words, whether intentional or not, regardless of intent, is not a good thing, EZ.", 
   {}, 
   130577, 
   null, 
   1117523820.0
  ], 
  [
   130767, 
   null, 
   "maximus", 
   "Notdakuningist,\n \nWasn't it celebrated as a pagan holiday before a Chrisitan one, or is that just because it was a common holiday date?\n\n Yes, there was a pagan holiday on December 25th prior to Christmas being celebrated on that date. But one must distinguish between the two. It is true that many Christians opposed (and some still do) the celebration of Christmas and of birthdays in general. They favored celebrating one's baptism or death (the birth into eternal life). The adopted day to celebrate this was on the pagan holiday of the Sun God but pagan practices were never followed. The day was not picked to embrace pagans for their paganism but to draw them out of their paganism to the true Sun, the light of the world, as John says. And Christianity prevailed for Christmas is still celebrated but you rarely hear of any of the pagan holidays. Christmas grew out of a sincere and pious desire to celebrate the nativity of the Lord. Christians merely celebrate the events described IN SCRIPTURE in the Gospel of Luke. These are not trivial events and they are worthy of commemoration. (based on Why Is That in Tradition by Pat Madrid).\n \n For the basics, simply look at the name of the holiday--CHRISTmas. No Christian has any pagan intention or inkling of pagan ideas during the observance of Christmas. If CHRISTmas is not CHRISTian then I don't know what it is.\n \n To say that the birthdate of Christ is not really known is true. To say that Christmas supplanted and overtook Pagan celebrations may also be true. But that is the key. Christmas overtook and outlasted. I don't know any pagans celebrating on the 25th. Perhaps there are some and I just don't know them. But I do know that there are a lot more Christians celebrating than pagans.\n \n Christmas is a Christian celebration (with a dash of capitalism/commercialism I admit). But you will find no Christians, wherever you might look in the entire world, commemorating the sun god or any other god on this holiday because they know that it is a day for the Son of God.\n \n \nI originally posted on this topic on the thread entitled \"is x-mas a pagan holiday?\" if you would like to look it up. \n Supposing the story of Jesus as put in the Bible is at least part true and not derived as metaphor for other \"proto Jesus\" characters the biggest problem I have with Church doctrine is that there are so many different ways it is interpreted. On one hand you have the church of god apostolics who follow a strict set of guidelines but still only follow what they want to out of the Bible, and on the other you have more liberal protestant groups. Both pick and choose what to follow muddling the rules and guidelines set in the Bible.\n (Technically aren't women supposed to wear a shroud when they pray according to the old testament?) This is why I take a more personal interpretation of faith, as I would rather follow my own interpretation of the creator and use my own good judgement with regards to morality. Some say I'm an agnostic and going to hell, well then so be it. They probably are as well if the rules are that strict.\n\n The first step in taking on a Christian faith is belief in a historical Jesus. I do not believe the Gospels sound like an amalgamation of proto Jesus figures. They seem like intimate accounts written by those who personally knew Jesus (Matthew and John) or had similar information from living with those who knew Jesus (Mark and Luke). They do not appear on the surface to be attempts at fabrication.\n \n If one does accept a historical Jesus then the history is plain-he started a Church founded on the apostles to whom he gave all power that had been given him. This tells us that there is one true Church founded by Jesus. Although there are many interpretations one must work and labor to sift through those and come to the truth. There are many churches that possess elements of the truth but only one founded by Jesus that possesses the fullness of truth. Using one's own judgment lends to many interpretations and ideas of truth. I personally believe in an objective standard of truth. Catholics have the free will to choose the Creed or not, but once chosen, one must follow it. The Creed is not a personal picking and choosing but a set, objective, standard of beliefs derived from history and Tradition passed on to us from the earliest Christians. \n \n Peace.", 
   {
    "unicode_changes_made": true
   }, 
   130626, 
   null, 
   1117568640.0
  ], 
  [
   130771, 
   null, 
   "Truthsayer", 
   "Sayers of truth do not throw out BS (your terms) and falsehood as much as you do. \n \n \n This coming from the one who professes to believe in miraculous virgin births, parting of the seas, the ark, amongst a plethra of other non-rational BS? You say that I am the one throwing out BS here? I think not sir. emoticon_rolleyes \n \n Although, I do appreciate your long, well thought out and eloquent rebuttal, (to which I am honored that you took that much time to dialog with me) at the end of the day, it's still you holding true to myth and superstition and it's still me holding to reason and logic. What more can I say?\n \n Peace.", 
   {}, 
   130767, 
   null, 
   1117569900.0
  ], 
  [
   130976, 
   null, 
   "Easyrider", 
   "Orion's Stupor\n \n \nNow, I suspect that you lack an academic background, so I further suspect that little of this means anything to you. However, those of us who have attained at least a high school education understand the importance of intellectual honesty, and that such importance gains significance as one passes through undergraduate and graduate studies, and eventually into the workplace.\n\n \n <Flush<\n \n Liberals like you are so lost you wouldn't recognize the truth if it bit you. \n \n Tell us how you got your \"ministerial\" credentials off the internet, Frank. You do remember that folly, don't you? Because we sure do.", 
   {}, 
   130767, 
   null, 
   1117598400.0
  ], 
  [
   130986, 
   null, 
   "trebor", 
   "Orion's Stupor\n \n \n \n <Flush<\n \n Liberals like you are so lost you wouldn't recognize the truth if it bit you. \n \n Tell us how you got your \"ministerial\" credentials off the internet, Frank. You do remember that folly, don't you? Because we sure do.\n\n \n \n I suspect that he did so to make a point, that minister credentials are basically worthless.", 
   {}, 
   130976, 
   null, 
   1117599000.0
  ], 
  [
   131030, 
   null, 
   "Orion", 
   "Orion's Stupor\n\n \n \"Folly-Stupor\", \"Stupor-Folly\". Make up your mind, EZ.\n \n \n<Flush<\n\n \n No problem. We'll wait for you to tidy up.\n \n \nLiberals like you are so lost you wouldn't recognize the truth if it bit you.\n\n \n And what exactly does this have to do with anything, or are you simply lashing out again? \n \n \nTell us how you got your \"ministerial\" credentials off the internet, Frank. You do remember that folly, don't you? Because we sure do.\n\n \n EZ, you are soooo serious. I don't think there exists a spark of humour within you. Yes, EZ, I am an ordained minister with the Universal Life Church (www.ulc.org), a non-denominational internet ministry. I obtained my ordination in about 30 seconds, free of charge. Anyone can do so, EZ - that was my point. And apparently, everyone over at the Atlantic Monthly forum got the point with the exception of you. Now, don't you feel silly?\n \n Sincerely,\n \n Rev. Orion", 
   {}, 
   130976, 
   null, 
   1117606080.0
  ], 
  [
   131056, 
   null, 
   "Orion", 
   "1) Holey, holey, holey am I. Lo, verily, I need a new sole.\n \n 2) Flea from the coming wrath! Flea from Sodom, Flea from Gomorrah!\n \n 3) Ewe, I have loved.\n \n Rev. Orion", 
   {}, 
   131030, 
   null, 
   1117611060.0
  ], 
  [
   131130, 
   null, 
   "zenodotus", 
   "Truthsayer, for a person attempting to wear a benevolent hat, you carry a lot of open anger. I wonder what the cause is?\n \n You have basically allowed that all historical sources are so susceptible to error that we can't go on any of them.\n \n If you believe that the intent of the bible is for you to take with you things like: a sea was parted, two of every animal was put on a big boat, a tower was built and no one could speak the same language anymore, etc etc, you are missing the point. Christianity, including Catholicism, teaches religious tolerance in terms of specific historical and deitic details, but is keen on seeking and teaching moral truth. \n \n You appear to want to lambaste the faith, but, although you may disagree, the way in which you are doing so is not striking any of its core teachings.", 
   {}, 
   120250, 
   null, 
   1117645800.0
  ], 
  [
   131157, 
   null, 
   "Truthsayer", 
   "Truthsayer, for a person attempting to wear a benevolent hat, you carry a lot of open anger. I wonder what the cause is?\n \n You have basically allowed that all historical sources are so susceptible to error that we can't go on any of them.\n \n If you believe that the intent of the bible is for you to take with you things like: a sea was parted, two of every animal was put on a big boat, a tower was built and no one could speak the same language anymore, etc etc, you are missing the point. Christianity, including Catholicism, teaches religious tolerance in terms of specific historical and deitic details, but is keen on seeking and teaching moral truth. \n \n You appear to want to lambaste the faith, but, although you may disagree, the way in which you are doing so is not striking any of its core teachings.\n\n \n I assure you sir that I harbor no anger or ill will towards anyone in the forum. But I would be less than honest to say that I don't sometimes get frustrated with people who try to pee-pee on my head and tell me it's raining.\n \n \nChristianity, including Catholicism, teaches religious tolerance in terms of specific historical and deitic details,\n \n \n By my personal observations, I would have to respectfully disagree. Lack of tolerance is one of the issues I have with religions. It is beyond me how anyone can think otherwise. But this is merely my opinion. My opinions are often not tolerated by the reliigious as evidenced by past posts on this thread as well as other posts throughout the forum.\n \n Thank you for your input. Have a great day. :)", 
   {}, 
   131130, 
   null, 
   1117648620.0
  ], 
  [
   131571, 
   null, 
   "Easyrider", 
   "Quote: Lack of tolerance is one of the issues I have with religions. \n \n Is tolerance for sin and evil something that godly people should strive after?", 
   {}, 
   131157, 
   null, 
   1117682820.0
  ], 
  [
   131572, 
   null, 
   "Tastyfish", 
   "Yes, if the laws don't deal with it.\n \n Isn't this covered by give unto Caeser? Surely its not just tax but recongising that you have to obey the law of the land. Don't have to like sin, but live with it if you have to as long as you don't do it yourself.", 
   {}, 
   131571, 
   null, 
   1117682940.0
  ], 
  [
   131573, 
   null, 
   "Easyrider", 
   "In the case of the Bible, continued sin has brought to ruin many nations. It's not something that is good for a country and its people.", 
   {}, 
   131572, 
   null, 
   1117683120.0
  ], 
  [
   131575, 
   null, 
   "Tastyfish", 
   "Depends what you mean by sin - what nations have survived in their original form over the past 2000 years, surely its easy to see that other factors have played a big role, most often some other nation sinning and invading them.", 
   {}, 
   131573, 
   null, 
   1117683240.0
  ], 
  [
   131600, 
   null, 
   "maximus", 
   "This coming from the one who professes to believe in miraculous virgin births, parting of the seas, the ark, amongst a plethra of other non-rational BS? You say that I am the one throwing out BS here? I think not sir. emoticon_rolleyes \n \n Although, I do appreciate your long, well thought out and eloquent rebuttal, (to which I am honored that you took that much time to dialog with me) at the end of the day, it's still you holding true to myth and superstition and it's still me holding to reason and logic. What more can I say?\n \n Peace.\n\n I did not say that you threw out BS. You said that some of what you read is BS yet you still throw it out there with the rest of the ideas that you read. I am only repeating what you said. However, you didn't make the BS disclaimers when you actually disseminated the BS. You did that after you were called on it. \n \n At the end of the day I have, I think, demonstrated contradictions in your logic. Furthermore, I have shown that you are using no more logic than a Christian uses. Have you no defense? Is the above all you can muster? Does a myth worshipping Christian so easily silence you?\n \n Peace.", 
   {}, 
   130771, 
   null, 
   1117686780.0
  ], 
  [
   131618, 
   null, 
   "Dzeron", 
   "Quote: Lack of tolerance is one of the issues I have with religions. \n \n Is tolerance for sin and evil something that godly people should strive after?\n\n \n No one who views the world in black and white ever sees his own side as the black one.", 
   {}, 
   131571, 
   null, 
   1117690080.0
  ], 
  [
   131738, 
   null, 
   "Truthsayer", 
   "Have you no defense? Is the above all you can muster? Does a myth worshipping Christian so easily silence you?\n \n \n Is this the equivalent to the proverbial \"knock this block off my shoulder\" challenge?\n \n As much as I have enjoyed your well thought out, intelligent dialog, sir, you would be well advised to know that I make an honest effort to not be so easily baited.\n \n I have said all I know to say. I have made my position clear, as have you. I see no point in peeing up a rope. You may call it what you like. I call it mature reasoning. Our viewpoints differ greatly on this topic. I have been given no logical rebuttal to date that should make me want to reconsider my position. And from your standpoint, neither have you. Does that about cover it?\n \n \nNo one who views the world in black and white ever sees his own side as the black one.\n \n \n I have considered that very possibility myself. But usually if it quacked like a duck, it was a duck regardless of what spin I attempted to color it with. I try to put myself in the other's shoes and consider all possible sides before I reach conclusions and I try to challenge my own conclusions as well.\n \n But I hear what you're saying. I imagine it would have been hard to tell the Jim Jone's congegration that their ways would end up in destruction. But that can go both ways I must admit.", 
   {}, 
   131618, 
   null, 
   1117718280.0
  ], 
  [
   132158, 
   null, 
   "maximus", 
   "Truthsayer,\n \nIs this the equivalent to the proverbial \"knock this block off my shoulder\" challenge?\n \n As much as I have enjoyed your well thought out, intelligent dialog, sir, you would be well advised to know that I make an honest effort to not be so easily baited.\n \n I have said all I know to say. I have made my position clear, as have you. I see no point in peeing up a rope. You may call it what you like. I call it mature reasoning. Our viewpoints differ greatly on this topic. I have been given no logical rebuttal to date that should make me want to reconsider my position. And from your standpoint, neither have you. Does that about cover it?\n\n I harbor no ill will toward you. I was only offering a defense and looking for debate. Perhaps we will meet again on another thread sometime. Until then, peace. If you ever have the inclination, check out Chesterton's The Everlasting Man. He was an agnostic convert. It is perhaps the best explanation of Christianity outside of scripture that I have encountered. The first half of the book is worth the read, although a bit tedious. The second half dealing specifically with Christianity is an interesting perspective on the Christian faith and a much easier read.", 
   {}, 
   131738, 
   null, 
   1117768980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Name that God....", 
  "url": "http://www.4forums.com/political/religion-debates/5148-name-god.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 5148, 
  "discussion_files": [
   [
    "32644.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-print.html"
   ], 
   [
    "32645.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-15-print.html"
   ], 
   [
    "32646.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-13-print.html"
   ], 
   [
    "32647.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-12-print.html"
   ], 
   [
    "32648.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-10-print.html"
   ], 
   [
    "32649.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-8-print.html"
   ], 
   [
    "32650.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-6-print.html"
   ], 
   [
    "32651.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-4-print.html"
   ], 
   [
    "32652.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-7-print.html"
   ], 
   [
    "32653.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-9-print.html"
   ], 
   [
    "32654.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-5-print.html"
   ], 
   [
    "32655.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-14-print.html"
   ], 
   [
    "32656.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-11-print.html"
   ], 
   [
    "32657.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-3-print.html"
   ], 
   [
    "32658.html", 
    "http://www.4forums.com/political/religion-debates/5148-name-god-2-print.html"
   ]
  ], 
  "identifier": 5148
 }
]