[
 [
  [
   120216, 
   null, 
   "Big Orn", 
   "I see it all the time - boys mostly - that can't, or won't, respect their parents. It's unacceptable behavior, imo. The other night at a ballgame, half of my boys (11 & 12 yr old) were throwing paper cups and shooting spitballs at one another. I went over and told them to pay attention to the game. They ignored me. I told them again to no avail. We were at bat at the time so after our 3rd out I walked over to the stands and addressed the parents, asking which parent would agree to me spanking their child...and, of course, the parents of the misbehaving 6 boys looked puzzled, went mute, and one woman finally asked why. I told her and she immediately went to the dugout and began making deals with the boy. This child, who no doubt gets to make deals all the time, blatantly replied with a, \"Who cares!\" and a, \"So what!\" while laughing and jabbing his friends. The mother hung her head and walked back to the stands as the boy pulled on his glove to get back in the field. I stopped him at the dugout door and sent in a sub. He threw a fit, throwing his glove into the dugout, knocking over the bats and scattering baseballs. I went in, took his glove, placed in on the bench and told him give me 15 pushups. He just crossed his arms and sat there. I then went back to the stands, told his parent to get him and take him home. The other 5 boys got the message and settled down, but were more afraid of being taken from the game than doing pushups, and were not all worried about getting disciplined properly.\n \n Why is this \"deal-making\", \"time-out\", \"taking-away-privileges\" approach still being used today when it has been shown time and again that it just don't work?\n \n When I send my kids anywhere with persons who I know to be good parents, I always tell them, \"Spank my boys just as you would your own whenever they deserve it\".\n \n I can brag a little here - my children are very well mannered...all the way from 10 yrs old to 28 yrs old and has never had a \"Let's Make a Deal\" option given them, just a good spanking with great explanations before and afterwards. It's a job, but well worth the extra effort.\n \n What say ye?", 
   {
    "post_info": {
     "post_title": "Spank my children, please!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1115761560.0
  ], 
  [
   120219, 
   null, 
   "Truthsayer", 
   "I hear ya. I can't complain though. My kids turned out a lot better than I did. I must have done something right.\n \n If I were a very religious person I would advise you to follow the \"word of God\" when it comes to raising those kids. But that might get you into a bit of trouble.\n \n \"Happy shall he be, that taketh and dasheth thy little ones against the stones\" (Psalms 137:9)? \n \n According to Deuteronomy, if a child is unruly and disobedient, we not only have the option of killing him, but it is mandatory that he be stoned to death (Deuteronomy 21:18-21). \n \n The same is true for a child who speaks to us with foul language (Exodus 21:17). Or a child who hits us (Exodus 21:15). \n \n Isn't god just wonderful? emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   120216, 
   null, 
   1115761860.0
  ], 
  [
   120246, 
   null, 
   "Big Orn", 
   "I hear ya. I can't complain though. My kids turned out a lot better than I did. I must have done something right.\n \n If I were a very religious person I would advise you to follow the \"word of God\" when it comes to raising those kids. But that might get you into a bit of trouble.\n \n \"Happy shall he be, that taketh and dasheth thy little ones against the stones\" (Psalms 137:9)? \n \n According to Deuteronomy, if a child is unruly and disobedient, we not only have the option of killing him, but it is mandatory that he be stoned to death (Deuteronomy 21:18-21). \n \n The same is true for a child who speaks to us with foul language (Exodus 21:17). Or a child who hits us (Exodus 21:15). \n \n Isn't god just wonderful? emoticon_rolleyes\n\n I can't say what your relationship with deity might do for you pertaining to your methods of discipline, but there comes a time when each parent must \"read\" each individual child and apply the appropriate measures of discipline. I didn't think that was the case a few years ago, but have learned that all children are not the same...even if they do have the same bloodline.\n \n Funny how being a parent actually means, \"being\" a parent, huh?", 
   {
    "unicode_changes_made": true
   }, 
   120219, 
   null, 
   1115764320.0
  ], 
  [
   120328, 
   null, 
   "Truthsayer", 
   "If only they came with individualized instruction booklets! :p \n \n As much of a challenge as they can be, I must admit, I'd give just about anything to go back there again. I am currently going through the \"empty nest\" syndrome. emoticon_cry", 
   {}, 
   120246, 
   null, 
   1115771460.0
  ], 
  [
   120333, 
   null, 
   "sinjin", 
   "Beat'em senseful.", 
   {}, 
   120328, 
   null, 
   1115771880.0
  ], 
  [
   120377, 
   null, 
   "tiggeroo2005", 
   "My mom and dad spanked me when I was naughty when I was a little girl. I deserved it everytime and usually learned my lessons well. I think spanking on the butt is a good discipline for young children. However, spanking with a belt or hitting a child is abuse. Spanking is not hitting.", 
   {}, 
   120333, 
   null, 
   1115778660.0
  ], 
  [
   120380, 
   null, 
   "Symbiote", 
   "Punishment is a poor method for learning;\n 1) It tends to produce obedience only while in the presence of the punisher\n 2) Although it usually gets the intended effect, it also produces weird psychological side effects.\n \n It's ok to use in moderation, accompanying a rational explanation for why what the child did was wrong. Lacking the explanation however, the smack is quite a weak tool, which is why some parents end up smacking their kids all the time, or frustrated at their inability to get a result, move on to belts to try and really teach them a lesson.", 
   {}, 
   120377, 
   null, 
   1115779200.0
  ], 
  [
   120381, 
   null, 
   "tiggeroo2005", 
   "Punishment is a poor method for learning;\n 1) It tends to produce obedience only while in the presence of the punisher\n 2) Although it usually gets the intended effect, it also produces weird psychological side effects.\n \n It's ok to use in moderation, accompanying a rational explanation for why what the child did was wrong. Lacking the explanation however, the smack is quite a weak tool, which is why some parents end up smacking their kids all the time, or frustrated at their inability to get a result, move on to belts to try and really teach them a lesson.\n\n \n That is totally agreeable....The part about using in moderation and accompanying with an explanation. Belts are a different matter. I would never put a belt to anyone butt!", 
   {}, 
   120380, 
   null, 
   1115779440.0
  ], 
  [
   120382, 
   null, 
   "tiggeroo2005", 
   "Here: http://4forums.com/political/showthread.php?t=5158\n \n Take the survey on it!", 
   {}, 
   120381, 
   null, 
   1115779500.0
  ], 
  [
   120428, 
   null, 
   "Adept", 
   "Like Symbiote said, punishment should only be used sparingly and should be accompanied by other teaching methods, otherwise it is really just counter-productive.\n \n Something like explaining carefully to the child that if they continue to do something (hit their sibling or something) they will get a smack. And if they do it, then smack them and explain why.", 
   {}, 
   120382, 
   null, 
   1115788320.0
  ], 
  [
   120525, 
   null, 
   "Big Orn", 
   "This thread is mainly about other parents or responsible adults spanking your children and you spanking children that are not your own.\n \n I think we all know that a spanking is not a beating.", 
   {}, 
   120428, 
   null, 
   1115821080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Spank my children, please!", 
  "url": "http://www.4forums.com/political/parenting/5150-spank-my-children-please.html", 
  "breadcrumbs": [
   "Parenting"
  ], 
  "id_number": 5150, 
  "discussion_files": [
   [
    "23326.html", 
    "http://www.4forums.com/political/parenting/5150-spank-my-children-please-print.html"
   ]
  ], 
  "identifier": 5150
 }
]