[
 [
  [
   120438, 
   null, 
   "canadianman76", 
   "does time have a beginning?\n does it have an end?\n if time slows down as you approach the speed of light, what does time mean to a particle such as a photon that is traveling at the speed of light?", 
   {
    "post_info": {
     "post_title": "what is time?"
    }
   }, 
   null, 
   null, 
   1115789700.0
  ], 
  [
   120502, 
   null, 
   "Jo Bennett", 
   "First thing to say is that time is not an absolute, there is no fixed clock against which one can say time slows down and time speeds up. There is only what different observers see. It is generally thought that time is a dimension of our universe and hence originates in the big bang with the spacial dimensions, however many of them there are. Beyond that I'm not really sure, I haven't studied much relativity.", 
   {}, 
   120438, 
   null, 
   1115810040.0
  ], 
  [
   120897, 
   null, 
   "canadianman76", 
   "if a spacecraft travels at just under the speed of light awayfrom the earth for two minutes, then heads back towards the earth at the same velocity, only four minutes will have passed for the observer in the spacecraft. On earth however many years will have passed. If the spacecraft were to theoretically do the speed of light even for an instant, i wonder how much time would pass? When they put on the brakes would they be at the end of time? My question of does time have meaning to a photon still makes me wonder.", 
   {}, 
   120502, 
   null, 
   1115845500.0
  ], 
  [
   121315, 
   null, 
   "Jo Bennett", 
   "If I understand the time dilation equations correctly it one were able to travel at the speed of light then no time would pass for you compared to any observer on the earth. I think that is a rather irrelevant question, however, as you can't travel at LS if you have mass. If you were able to travel at 0.9c then for every minute you experience earth would have about 2 minutes 20secs.\n \n You can't really say \"just under\" the speed of light, it requires a specific fraction of LS for the calculation, and the closer you get to c the more difference it makes.", 
   {}, 
   120897, 
   null, 
   1115888940.0
  ], 
  [
   121323, 
   null, 
   "canadianman76", 
   "I meant that when u came back out of light speed, would the universe be at its end? Would there be another big bang and a new set of fundemental forces reborn as the new universe re emerged with completely new rules for the energy fields to follow as they created the subatomic particles wich make up matter as we know it? (cube shaped probability clouds for the electrons? joke)\n As for light not having mass, how come large gravitational fields affect it? A large star can skew the direction light travels, and a black hole draws light in. if it passes the event horizon, is the photon obliterated into even smaller as of yet unknown particles and ejected as an exotic matter that is unaffected by the forces we know? (dark matter)? Or is it merely compressed into a 0 dimensional \"force\" that affects the space time fabric around it?", 
   {}, 
   121315, 
   null, 
   1115892060.0
  ], 
  [
   121328, 
   null, 
   "Redratio1", 
   "I meant that when u came back out of light speed, would the universe be at its end? Would there be another big bang and a new set of fundemental forces reborn as the new universe re emerged with completely new rules for the energy fields to follow as they created the subatomic particles wich make up matter as we know it? (cube shaped probability clouds for the electrons? joke)\n\n \n I don't think anyone knows the answer to that. The light barriar is something fundamental to this universe's spacetime line.\n \n \nAs for light not having mass, how come large gravitational fields affect it? A large star can skew the direction light travels, and a black hole draws light in. if it passes the event horizon, is the photon obliterated into even smaller as of yet unknown particles and ejected as an exotic matter that is unaffected by the forces we know? (dark matter)? Or is it merely compressed into a 0 dimensional \"force\" that affects the space time fabric around it?\n\n \n Gravity doesn't just attract massive objects, it bends spacetime. All particles, massive and massless travel in spacetime therefore any particle moving in spacetime is subject to its laws. This is why and how a massless particle can be bent by gravitation.\n \n Gravitational acceleration and inertial acceleration (like a rocket) are indistingushable form each other. This gives a clue to the nature of spacetime. The energy a particle possesses directly effects how it behaves in spacetime. So, a particle in a heavy gravitational well will experience a slowing of time relative to a particle farther away from a gravitational well. Identically a particle with high kinetic energy (velocity) will experience a slowing of time relative to a particle at a lower velocity. This difference in energy and time diation depends on the acceleration or energy change of a particle. There is something fundamental about the energy states of a particle and its experience of time relative to the external universe.", 
   {}, 
   121323, 
   null, 
   1115893860.0
  ], 
  [
   121332, 
   null, 
   "canadianman76", 
   "so as a particle travels closer to the singularity at the centre of the well time slows relative to the particle wich would mean time would be moving faster for matter around the particle. Is this an asemtope wich the particle will never reach the top of? Does this mean that the life of the universe will pass before the particle reaches the center of the well? I've gone crosseyed! lmao", 
   {}, 
   121328, 
   null, 
   1115894460.0
  ], 
  [
   121333, 
   null, 
   "Redratio1", 
   "so as a particle travels closer to the singularity at the centre of the well time slows relative to the particle wich would mean time would be moving faster for matter around the particle. Is this an asemtope wich the particle will never reach the top of? Does this mean that the life of the universe will pass before the particle reaches the center of the well? I've gone crosseyed! lmao\n\n \n LOL I went crosseye when I first learned this stuff.\n \n Yes, imagine a person falling into a blackhole. As he gets closer to the event horizon his time slows down relative to an observer far away from the blackhole. In fact any signals he sends out gets redshifted as if he is accelerating away from the observer outside. As he approaches the event horizon his time slows down further relative to the outside observer, as he reaches the event horizen it actually looks like to the outside observer that the guy is frozen in time, however for the guy falling in he observes himself ripped apart in a nanosecond.\n \n Spacetime is the very fabrice of the universe. Our specific spaceime has its origin at the Big Bang.", 
   {}, 
   121332, 
   null, 
   1115895360.0
  ], 
  [
   121334, 
   null, 
   "canadianman76", 
   "What im getting at, is if the particle at the event horizon seems to be frozen in time to the outside observer, then the outside observer would seem to be frozen in time to the particle at the event horizon. So for the particle that is in the gravity well an instant would pass, but 4 the outside observer an eternity would pass. Does time have any meaning to a particle traveling at the speed of light (photons)? the beginning of the big bang, or when the energy first condensed into the fundimental particles due to the four forces, and the end of it all, whenever that may be. This leads me to another question, when did the four forces take form? what caused them to unravel as they did?", 
   {}, 
   121333, 
   null, 
   1115896260.0
  ], 
  [
   121335, 
   null, 
   "Redratio1", 
   "What im getting at, is if the particle at the event horizon seems to be frozen in time to the outside observer, then the outside observer would seem to be frozen in time to the particle at the event horizon. So for the particle that is in the gravity well an instant would pass, but 4 the outside observer an eternity would pass. Does time have any meaning to a particle traveling at the speed of light (photons)? the beginning of the big bang, or when the energy first condensed into the fundimental particles due to the four forces, and the end of it all, whenever that may be. This leads me to another question, when did the four forces take form? what caused them to unravel as they did?\n\n \n \n All of those are questions physics has yet to answer. One of the great goals of physics is to unify the forces. It has already been done with electro-magnetism with the nuclear weak force, the electroweak force. And then the strong nuclear force with the electroweak force. The current goal is gravity with the other three, however gravity seems to have a more fundamental role in the fabric of our universe. \n \n One of the more mind boggling proven ideas about the big bang is that it started spacetime. What I mean by that is that time and space began with the big bang. Therefore there is no center to the bigbang as everywhere was created at the same time, and the universe did not expand into empty space because space was created at the same time as the big bang. Likewise our timeline was created at the big bang.", 
   {}, 
   121334, 
   null, 
   1115896860.0
  ], 
  [
   121337, 
   null, 
   "canadianman76", 
   "does that mean u believe there was a creation event?\n What about what matter is made of? We keep discovering that particles we think are solid are in fact smaller particles that are held together by the four forces and there is a vast amount of empty space between them. if the nucleus of an atom were 2 cm in diameter, then the nearest electron orbit or probability cloud would be about 9 km away wich means that if the electrons, nutrons and protons were solid then even the densest materials (gold, lead, uranium) would still be 99.9999999999% empty space. and as we have discovered with the research done with supercoliders, even these three fundimental particles arent fundimental. How do these particles or bundles of energy \"know\" to stay in proxcimity to each other and differentiate between each other. An electron orbits the nucleus at a tenth of the speed of light, something must travel from the nucleus to relay the nucleuses position to the electron intercepting a grain of sand sized particle traveling a tenth of the speed of light and tell the electron to turn so it will remain in orbit over and over again. it must do this for every electron millions and millions of times for the life of the atom.", 
   {}, 
   121335, 
   null, 
   1115898240.0
  ], 
  [
   121574, 
   null, 
   "Diogenes99", 
   "what is time?\nTime is nature's way of keeping everything from happening at once. (Credit to Robin Williams, I think.) :p", 
   {}, 
   121337, 
   null, 
   1115925060.0
  ], 
  [
   121877, 
   null, 
   "zachvac", 
   "So if time can change (you go near the speed of light time slows down) then you are going at 2 different speeds as well (speed=distance/time)", 
   {}, 
   121574, 
   null, 
   1115959200.0
  ], 
  [
   121959, 
   null, 
   "canadianman76", 
   "to zacvac. this is a quantum theory thread, not a famous quotes thread. if u feel that u are slower than most, take some remedial classes, dont hack on us who are trying to find the truth.\n and by the way, two observers are going two different speeds so wich one is the constant?", 
   {}, 
   121877, 
   null, 
   1115970780.0
  ], 
  [
   121982, 
   null, 
   "StrategosFF", 
   "does time have a beginning?\n does it have an end?\n if time slows down as you approach the speed of light, what does time mean to a particle such as a photon that is traveling at the speed of light?\n\n \n What if science can't answer fully what time is? What if it can't be proven nor disproven, so therefore can only ever be theorized?\n \n Human beings like to place a label on everything, and limit ourselves within the confines of those labels, the better our labels the more advanced we think we've become. What if in order to understand time we have to shed those labels and see it as what it is? That we must first recognize we view it from an imperfect point of view, and then understand how it must be seen to be properly observed.", 
   {}, 
   120438, 
   null, 
   1115984100.0
  ], 
  [
   122141, 
   null, 
   "Jo Bennett", 
   "to zacvac. this is a quantum theory thread, not a famous quotes thread. if u feel that u are slower than most, take some remedial classes, dont hack on us who are trying to find the truth.\n and by the way, two observers are going two different speeds so wich one is the constant?\n\n \n Neither, there is no universal stationary point. You can only measure things \"relative\" (hence relativity) to each other.", 
   {}, 
   121959, 
   null, 
   1116008280.0
  ], 
  [
   122533, 
   null, 
   "Redratio1", 
   "So if time can change (you go near the speed of light time slows down) then you are going at 2 different speeds as well (speed=distance/time)\n\n No because space and time are liked....spacetime.", 
   {}, 
   121877, 
   null, 
   1116058620.0
  ], 
  [
   123409, 
   null, 
   "canadianman76", 
   "the absolute motion of our galaxy is 600km/s with respect to the cosmological frame. I got that out of the 1994 guinness book of records. so if the eggheads figured that one out i guess there is a stationary point somewhere. P.S. thats pretty damn fast. does anyone know the mass of the milky way? i wonder what the kinetic energy of our galaxy is? Ek=1/2m*v SQUARED", 
   {}, 
   122533, 
   null, 
   1116226500.0
  ], 
  [
   123826, 
   null, 
   "Redratio1", 
   "The only cosmological frame is the aggregate average of the motion of all observable mass in the observable universe. All motion is relative.", 
   {}, 
   123409, 
   null, 
   1116292500.0
  ], 
  [
   123940, 
   null, 
   "canadianman76", 
   "So that could be a reference point could it not?", 
   {}, 
   123826, 
   null, 
   1116312060.0
  ], 
  [
   124013, 
   null, 
   "Kronus", 
   "So that could be a reference point could it not?\n\n \n I think you're a little confused on how frames of reference work. This isn't relativity, it's just basic mechanics. Whenever you talk about motion, or lack thereof, it always has to be relative to a given frame of reference. For example, if I'm walking towards the front of a moving train then I'm going 3 mph relative to the frame that's set in the train, but 63 mph relative to a frame set in the ground. You can define anything you like as a frame of reference, it all depends on what makes sense based on what you're trying to measure.\n \n The reason people sometimes have a problem getting this at first is that we have this great frame of reference all set for us, the earth. To all casual observations it really seems stationary, and so we get this \"common sense\" feeling that such a thing as a stationary, absolute frame of reference exists. Of course in this case common sense is wrong, since the earth is spinning around it's axis, and going around the sun, and all that other stuff. \n \n So the point is that it makes no sense to just say that a point is stationary, you have to say it's stationary relative to some other point. Likewise you can't just say that something has a certain speed, you have to say that it has that speed in a given frame of reference.", 
   {}, 
   123940, 
   null, 
   1116348660.0
  ], 
  [
   124063, 
   null, 
   "canadianman76", 
   "the cosmological frame is the observable universe. so relative to everything that exists we are traveling at 600km/s. does that not make sense?", 
   {}, 
   124013, 
   null, 
   1116357240.0
  ], 
  [
   124106, 
   null, 
   "Redratio1", 
   "the cosmological frame is the observable universe. so relative to everything that exists we are traveling at 600km/s. does that not make sense?\n\n \n It makes little difference if you are talking spacetime. Everything is relative. When you are closer to a mass your time slows relative to an observer farther away. Likewise, when you accelerate to increase your velocity relative to any other inertial frame your time slows down relative to that other inertial frame. All motion and spacetime is relative, you can't get around it.", 
   {}, 
   124063, 
   null, 
   1116360300.0
  ], 
  [
   124121, 
   null, 
   "Kronus", 
   "the cosmological frame is the observable universe. so relative to everything that exists we are traveling at 600km/s. does that not make sense?\n\n \n Nope, not really. Everything we can see out there is moving relative to everything else. We can take any point we like and define everything else's motion relative to that point, but there is no single point in the universe which can be said to be stationary in any sort of absolute sense. \n \n To use your example, we may be moving 600 km/s relative to our neighboring galaxy, but our galactic cluster is moving (i'm making numbers up here ) 10,000 km/s relative to our nieghboring cluster, and our super cluster (cluster of clusters) is moving even faster than that relative to some other super cluster. All motion is relative to some frame, and any frame will do. They are all equally valid.", 
   {}, 
   124063, 
   null, 
   1116361320.0
  ], 
  [
   124137, 
   null, 
   "canadianman76", 
   "I GOT IT!!!!! To get your absolute velocity you would have to measure the average motion of the universe relative to itsself. this would mean thatyou would have to measure every piece of matters velocity relitave to every other piece of matters velocity. I see the word googlplex popping up a fair amount in this equation. But this would give you your stationary point of reference relative to all existence.emoticon_frazzled", 
   {}, 
   124121, 
   null, 
   1116362400.0
  ], 
  [
   124148, 
   null, 
   "Kronus", 
   "I GOT IT!!!!! To get your absolute velocity you would have to measure the average motion of the universe relative to itsself. this would mean thatyou would have to measure every piece of matters velocity relitave to every other piece of matters velocity. I see the word googlplex popping up a fair amount in this equation. But this would give you your stationary point of reference relative to all existence.emoticon_frazzled\n\n \n An interesting idea, but still not quite right.\n \n Let's simplify the universe a bit. Let's say that all that exists is you and me. We're both travelling in straight lines which are at right angles and would never intersect. From one point of view you could say that I was moving to the right on the X axis, and you were moving up from the point x=2, y=2. An equally good way of framing it would be to say you're moving straight up the Z axis, and I'm moving along the line y = -2. From my point of view (that is, relative to me) I'm holding still and you're moving up and to the left. For you, I'm moving down and to the right, while you're stationary. All of these are equally valid frames, there's no way to average them out and come up with an absolute one.", 
   {}, 
   124137, 
   null, 
   1116363960.0
  ], 
  [
   124155, 
   null, 
   "canadianman76", 
   "Nope, not really. Everything we can see out there is moving relative to everything else. We can take any point we like and define everything else's motion relative to that point, but there is no single point in the universe which can be said to be stationary in any sort of absolute sense. \n \n To use your example, we may be moving 600 km/s relative to our neighboring galaxy, but our galactic cluster is moving (i'm making numbers up here ) 10,000 km/s relative to our nieghboring cluster, and our super cluster (cluster of clusters) is moving even faster than that relative to some other super cluster. All motion is relative to some frame, and any frame will do. They are all equally valid.\n\n Our cosmological frame contains our neighbouring galaxys wich is the local supercluster wich is dominated by the virgo cluster of galixies. This is being drawn towards the even more massive Hydra Centaurus supercluster and both are being drawn towards a vast concentration of galixies known as \"the great attractor\".", 
   {}, 
   124121, 
   null, 
   1116365400.0
  ], 
  [
   124156, 
   null, 
   "Redratio1", 
   "I don't think that simplified it, lol.\n \n Think of two objects in space. When object A accelerates relative to the object B, object A's spacetime slows down relative to the unaccelerated object. Thus when the accelerated object A slows back down to its inital velociy relative to object B less time has passed. So one cannot say there is a universal inertial frame other than that frame you carry with relative to every other particle individually in the universe. Massive objects also bend spacetime around themselves so that any observer has a different time dialation relative to the position of every other object.", 
   {}, 
   124148, 
   null, 
   1116365760.0
  ], 
  [
   124157, 
   null, 
   "Redratio1", 
   "Our cosmological frame contains our neighbouring galaxys wich is the local supercluster wich is dominated by the virgo cluster of galixies. This is being drawn towards the even more massive Hydra Centaurus supercluster and both are being drawn towards a vast concentration of galixies known as \"the great attractor\".\n\n \n If you move a couple of billion light years in any direction you will have a visible different observable universe. Where every you go there you are.", 
   {}, 
   124155, 
   null, 
   1116365880.0
  ], 
  [
   124161, 
   null, 
   "canadianman76", 
   "An interesting idea, but still not quite right.\n \n Let's simplify the universe a bit. Let's say that all that exists is you and me. We're both travelling in straight lines which are at right angles and would never intersect. From one point of view you could say that I was moving to the right on the X axis, and you were moving up from the point x=2, y=2. An equally good way of framing it would be to say you're moving straight up the Z axis, and I'm moving along the line y = -2. From my point of view (that is, relative to me) I'm holding still and you're moving up and to the left. For you, I'm moving down and to the right, while you're stationary. All of these are equally valid frames, there's no way to average them out and come up with an absolute one.\n\n Would you take these axis relative to me or relative to you?\n Or would you take the rate at wich the gap is expanding between us both, divide it by two, and use that as your stationary point of reference?\n Cause we wouldnt be moving at a tangent to each other if we were the only two things in existence, we would either be moving directly awayfrom each other, or directly towards each other because a fixed set of x,y,z coordinates would require a 0 dimensional single point wich would be a third object that existed in our universe. I,ve gone crosseyed!!!", 
   {}, 
   124148, 
   null, 
   1116366780.0
  ], 
  [
   124166, 
   null, 
   "Kronus", 
   "Would you take these axis relative to me or relative to you?\n\n Exactly my point! In the first two cases I gave the zero point of the axis is just some random point in space. The third case has the zero point on me, the last it's on you. I happened to have the axis for all 4 cases be parallel and pointing in the same direction, but I could have had them pointing in any which way.\n \n \n\n Or would you take the rate at wich the gap is expanding between us both, divide it by two, and use that as your stationary point of reference?\n Cause we wouldnt be moving at a tangent to each other if we were the only two things in existence, we would either be moving directly awayfrom each other, or directly towards each other because a fixed set of x,y,z coordinates would require a 0 dimensional single point wich would be a third object that existed in our universe. I,ve gone crosseyed!!!\n\n \n If you've gone crosseyed then you're almost there! \n \n I wouldn't have to be moving directly towards you. I could be moving in your general direction, but miss, right? And a reference frame doesn't require something solid to be attached to. You could make the zero point anywhere in space. We just tend to put zero points on objects because it's easier to visualize. But if you want to you can define any point anywhere as being the zero point, and define motions relative to it. Any point at all, they're all equally valid.", 
   {}, 
   124161, 
   null, 
   1116367440.0
  ], 
  [
   124178, 
   null, 
   "canadianman76", 
   "Exactly my point! In the first two cases I gave the zero point of the axis is just some random point in space. The third case has the zero point on me, the last it's on you. I happened to have the axis for all 4 cases be parallel and pointing in the same direction, but I could have had them pointing in any which way.\n \n \n \n If you've gone crosseyed then you're almost there! \n \n I wouldn't have to be moving directly towards you. I could be moving in your general direction, but miss, right? And a reference frame doesn't require something solid to be attached to. You could make the zero point anywhere in space. We just tend to put zero points on objects because it's easier to visualize. But if you want to you can define any point anywhere as being the zero point, and define motions relative to it. Any point at all, they're all equally valid.\n\n if we were the only two masses of matter in space. we could not move past each other, we could only move towards, or away from each other. there would be no reference point for us to tell that we were moving at an angle relative to each other. \n If we were moving awayfrom each other at 2 m/s and then we referenced our movement from a point that was moving awayfrom each of us at the same velocity of 10 m/s, then relitave to the reference point we would be moving awayfrom it at 11 m/s each, but still only 2m/s awayfrom each other.\n There may be a point at wich our velocity would slow down and then change direction then speed up again. That would be the only way we would know that we passed each other, but that would only happen if one of us was travelling towards the reference point, and the other was traveling awayfrom it at a tangent to each other.", 
   {}, 
   124166, 
   null, 
   1116368640.0
  ], 
  [
   124231, 
   null, 
   "Kronus", 
   "if we were the only two masses of matter in space. we could not move past each other, we could only move towards, or away from each other. there would be no reference point for us to tell that we were moving at an angle relative to each other. \n\n Sure we could move past each other. Hold two pencils near each other, but not touching. Imagine those pencils are the paths we're moving on. We'd pass, but never touch. And it would be easy to tell if we're going to hit or not. All I have to do is look right at you. If I have to turn to keep looking at you, we'll miss. If I don't have to turn, we'll hit.\n \n \n \n\n If we were moving awayfrom each other at 2 m/s and then we referenced our movement from a point that was moving awayfrom each of us at the same velocity of 10 m/s, then relitave to the reference point we would be moving awayfrom it at 11 m/s each, but still only 2m/s awayfrom each other.\n\n I'm afraid that doesn't actually make sense. You can't just say \"moving awayfrom each other at 2 m/s\". You must reference the movement to some reference point to start with. Am I stationary, and you're moving at 2 m/s, or the other way around? Is there a point between the two of us that I'm moving away from at 1.5 m/s, and you're moving away at .5 m/s? Or are you moving towards the point at .5 m/s, while I move away from it at 2.5 m/s? These will all look exactly the same. This is an important point. In each of these cases the distance between us is increasing by 2 m/s, but our velocities vary depending on what reference point you use.", 
   {}, 
   124178, 
   null, 
   1116372000.0
  ], 
  [
   124320, 
   null, 
   "canadianman76", 
   "[QUOTE=Kronus]Sure we could move past each other. Hold two pencils near each other, but not touching. Imagine those pencils are the paths we're moving on. We'd pass, but never touch. And it would be easy to tell if we're going to hit or not. All I have to do is look right at you. If I have to turn to keep looking at you, we'll miss. If I don't have to turn, we'll hit.\n \n \n \n QUOTE]\n O.K. ya got me on that one, but if we were the only two things in existence, then it would be way easier to find a common reference point in space. you would just take the change in distance between us over a certain time period, and divide it by two. that would be the central reference point of our universe.\n Now how would you do that with 3 objects moving in 3 different directions?", 
   {}, 
   124231, 
   null, 
   1116383760.0
  ], 
  [
   124335, 
   null, 
   "Redratio1", 
   "\n O.K. ya got me on that one, but if we were the only two things in existence, then it would be way easier to find a common reference point in space. you would just take the change in distance between us over a certain time period, and divide it by two. that would be the central reference point of our universe.\n Now how would you do that with 3 objects moving in 3 different directions?\n\n \n You're just taking the center of mass between two objects, or rather the center of motion. If you try to take the observable universe as your ultimate reference point you run into a problem. The observable universe is isotrophic as far as we can tell. So no matter where you are it looks pretty much the same on the large scale, and the Big Bang had no center because the big bang created spacetime. All of spacetime was compressed together, but not centered anywhere. Therefore any center of motion calculation involving the universe will ultimately bring your zero point to your own location. So each observer has their unique zero point.", 
   {}, 
   124320, 
   null, 
   1116384960.0
  ], 
  [
   124354, 
   null, 
   "canadianman76", 
   "You're just taking the center of mass between two objects, or rather the center of motion. If you try to take the observable universe as your ultimate reference point you run into a problem. The observable universe is isotrophic as far as we can tell. So no matter where you are it looks pretty much the same on the large scale, and the Big Bang had no center because the big bang created spacetime. All of spacetime was compressed together, but not centered anywhere. Therefore any center of motion calculation involving the universe will ultimately bring your zero point to your own location. So each observer has their unique zero point.\n\n So youre saying that the universe is infinite?\n And the universe revolves around me, sweet!!!!! emoticon_rolleyes \n What is isotrophic?\n Also, what is entropy\n If the fabric of spacetime expanded out from the big bang, did it do so faster than the speed of light? Or is spacetime only out as far as the farthest photon has reached since the event?\n Do space and time have a terminal velocity at wich they can travel?", 
   {}, 
   124335, 
   null, 
   1116386520.0
  ], 
  [
   124383, 
   null, 
   "Kronus", 
   "\n O.K. ya got me on that one, but if we were the only two things in existence, then it would be way easier to find a common reference point in space. you would just take the change in distance between us over a certain time period, and divide it by two. that would be the central reference point of our universe.\n Now how would you do that with 3 objects moving in 3 different directions?\n\n \n Yes, you could define the reference point that way. Or you could define the reference point as being where you are, or 27 light years over your left shoulder. None of these are any better than the other. You can define a reference point absolutely anywhere you want, they're all equally as good.", 
   {}, 
   124320, 
   null, 
   1116389220.0
  ], 
  [
   124405, 
   null, 
   "Kronus", 
   "So youre saying that the universe is infinite?\n\n Infinity hurts my brain, I'll let Red field that one if he wants.\n \n \nAnd the universe revolves around me, sweet!!!!! emoticon_rolleyes \n\n Sure, you're as good a reference point as any other.\n \n \nWhat is isotrophic?\n\n I think he meant isotropic. It means the same in every direction.\n \n \nAlso, what is entropy\n\n You're jumping all over here, aren't you? Entropy is a measure of the molecular disorder of a system. An interesting entropic tidbit: the entropy of an isolated system never decreases. So, if you want to, say, cool down an area, like the inside of your fridge, the only way to do that is to increase the entropy somewhere else by at least as much.\n \n \nIf the fabric of spacetime expanded out from the big bang, did it do so faster than the speed of light? Or is spacetime only out as far as the farthest photon has reached since the event?\n\n Excellent question, if you find out let me know!\n \n \nDo space and time have a terminal velocity at wich they can travel?\n\n Space doesn't travel; what would it travel through? And if time does travel it isn't through space, so speed as we know it doesn't apply.\n \n Actually, research does show that sufficiently massive bodies can \"drag\" space along with them as they move, so I guess space can travel. If it's getting dragged along with a physical body, then its velocity would match the body's, and it's top speed would be the speed of light.", 
   {}, 
   124354, 
   null, 
   1116390420.0
  ], 
  [
   124411, 
   null, 
   "canadianman76", 
   "Yes, you could define the reference point that way. Or you could define the reference point as being where you are, or 27 light years over your left shoulder. None of these are any better than the other. You can define a reference point absolutely anywhere you want, they're all equally as good.\n\n Yes, but to find a reference point that has a net velocity of 0, you would have to calculate the net velocity of the entire universe (the two of us) and divide it by the number of objects factored in (2) and then multiply it by the amount of time since creation, or the big bang that has passed. \n This would give you a central point in the universe wich would have a net energy of zero and a net velocity of zero.", 
   {}, 
   124383, 
   null, 
   1116390780.0
  ], 
  [
   124436, 
   null, 
   "Kronus", 
   "Yes, but to find a reference point that has a net velocity of 0, \n\n \n You're doing it again. Velocity of 0 relative to what? You can't just say that a point isn't moving, you have to say what it isn't moving relative to. It's the same as if I told you something was 10 miles away, without telling you if I meant 10 miles from me, from you, or from the center of the sun.\n \n You can define every single point in the universe as being the point that you'll measure velocities relative to, and all of those points will be moving relative to some other point. And all of them are equally valid. \n \n Or are you just trying to find the center of the universe by figuring it must be the point from which everything expanded? Everything started by moving away from there so if you back track you'll find it. Is that what you're getting at?", 
   {}, 
   124411, 
   null, 
   1116392700.0
  ], 
  [
   124478, 
   null, 
   "Jo Bennett", 
   "The universe is indeed infinite. The visible universe, which is different, is finite. At the big bang the universe was still infinite, only every distance within it was zero (you think you went cross-eyed before?).", 
   {}, 
   124436, 
   null, 
   1116404040.0
  ], 
  [
   124487, 
   null, 
   "canadianman76", 
   "You're doing it again. Velocity of 0 relative to what? You can't just say that a point isn't moving, you have to say what it isn't moving relative to. It's the same as if I told you something was 10 miles away, without telling you if I meant 10 miles from me, from you, or from the center of the sun.\n \n You can define every single point in the universe as being the point that you'll measure velocities relative to, and all of those points will be moving relative to some other point. And all of them are equally valid. \n \n Or are you just trying to find the center of the universe by figuring it must be the point from which everything expanded? Everything started by moving away from there so if you back track you'll find it. Is that what you're getting at?\n\n Velocity of zero relative to the entire mass of the universe.\n Or in the case of our thought experiment you and me, the only two objects in existence. the velocity at wich we are traveling awayfrom each other divided by two relative to either of us this point would have the same velocity and direction. \n If I were moving in one direction on the x axis and you were moving in the opposite direction the zero point would be smack dab in the middle of us. the zero point would be moving awayfrom the both of us at an equal velocity. unless we were heading towards each other, then the 0 point would be heading towards both of us at an equal velocity.\n If we were to pass each other the 0 point wouldnt change and when we were beside each other the 0 point would still be an equal distance from the both of us (P.S. there would also be an acceleration asemtope in the equation but that would give me a headache to figure out cause I'm not that learnded) emoticon_smile \n If we were to place a beakon (GPS) at this stationary reference point we could reference other points anywhere in the universe and find the velocity of ourselves in reference to the universe. Even if the other person wasnt present.\n So if i farted I could check my GPS and see how much velocity i gained. lmao", 
   {}, 
   124436, 
   null, 
   1116406920.0
  ], 
  [
   124488, 
   null, 
   "canadianman76", 
   "The universe is indeed infinite. The visible universe, which is different, is finite. At the big bang the universe was still infinite, only every distance within it was zero (you think you went cross-eyed before?).\n\n So u are saying that the four dimensions that we interact with (height,width,depth, and time) expanded at the moment of the big bang?\n I believe this too. I wonder what was in the area that the fabric of spacetime now occupies?\n I think a lot of people just find it easier to believe that spacetime has allways been there.\n Its like trying to understand the probability cloud of an electron. Quantum ambiguity causes migranes.", 
   {}, 
   124478, 
   null, 
   1116407460.0
  ], 
  [
   124496, 
   null, 
   "Jo Bennett", 
   "The dimensions of the universe are, as far as we understand it, inherent to the universe, hence it makes no sense to talk in physical terms about an area into which the universe expanded, especially as there is no before the universe either as time is part of the universe. As for reality that is not contained within the universe, could be almost anything. Personally I believe God is there, for a start. It is possible that there are dimensions outside the universe, but it really is a metaphysical, rather than a physical debate. It has been hypothecated that God is a higher dimensional being, and his apparent omniscience is the equivalent of us playing a game on a 2D map, with the addition of being able to see time as one of the dimensions.", 
   {}, 
   124488, 
   null, 
   1116410880.0
  ], 
  [
   124497, 
   null, 
   "canadianman76", 
   "The dimensions of the universe are, as far as we understand it, inherent to the universe, hence it makes no sense to talk in physical terms about an area into which the universe expanded, especially as there is no before the universe either as time is part of the universe. As for reality that is not contained within the universe, could be almost anything. Personally I believe God is there, for a start. It is possible that there are dimensions outside the universe, but it really is a metaphysical, rather than a physical debate. It has been hypothecated that God is a higher dimensional being, and his apparent omniscience is the equivalent of us playing a game on a 2D map, with the addition of being able to see time as one of the dimensions.\n\n \n Yeah, Gods the shiznit!\n I asked this in another forum, what do you think about god not being restricted by our timeline? Maybe thats y he prevades all of existence.\n He could hop back and forth through time and change things till he gets his machine (the universe) tweaked right out and runnin like a top.\n \n \n Maybe as our universe is expanding, an other one is shrinking into oblivion!!!?\n emoticon_wow", 
   {}, 
   124496, 
   null, 
   1116411480.0
  ], 
  [
   124531, 
   null, 
   "Kronus", 
   "Velocity of zero relative to the entire mass of the universe.\n\n \n Let's be precise. You want to find the center of mass of the universe and use that as your reference point for defining other velocities? Is that it?\n \n And I forget, why do we want this point to start with. :)", 
   {}, 
   124487, 
   null, 
   1116429900.0
  ], 
  [
   124643, 
   null, 
   "Jo Bennett", 
   "It's worth remembering that you can't find the centre of mass of something with no centre. An infinite universe cannot have a centre of mass, unless every point is the centre of mass, as in an infinite, isotropic, homogenous universe, such as ours appears to be, there is the same amount of mass in every direction.", 
   {}, 
   124531, 
   null, 
   1116445020.0
  ], 
  [
   124939, 
   null, 
   "canadianman76", 
   "Let's be precise. You want to find the center of mass of the universe and use that as your reference point for defining other velocities? Is that it?\n \n And I forget, why do we want this point to start with. :)\n\n \n Yes the center of the mass, but not the center of the universe.\n The universe isnt spread out evenly so there may be more mass on one side of the center of the universe than the other. (Like a foam ball that has hollow spots in one area and dense chunks of rock or metal in other areas.\n The center of the ball would not be the center of the mass of the ball.\n \n We want this point so we could reference the absolute motion of any given particle in the universe. Not relative to anything else like a planet or a galaxy.", 
   {}, 
   124531, 
   null, 
   1116500700.0
  ], 
  [
   124940, 
   null, 
   "canadianman76", 
   "It's worth remembering that you can't find the centre of mass of something with no centre. An infinite universe cannot have a centre of mass, unless every point is the centre of mass, as in an infinite, isotropic, homogenous universe, such as ours appears to be, there is the same amount of mass in every direction.\n\n The universe may be infinite, but i dont think it is homogenous.\n Homogenous means that it doesnt separate doesnt it? (I dont have a dictionary nearby and im not sure.) but if that is the meaning, then that would be a bad discription of the universe, cause the universe is clumping together into galaxys and stars. (mayabe the universe has expired and its curdling!!!) lmao emoticon_rolleyes", 
   {}, 
   124643, 
   null, 
   1116501180.0
  ], 
  [
   124946, 
   null, 
   "Jo Bennett", 
   "It is homogenous on the large scale, the scale of the \"bubbles and voids\". Sorry, I should have mentioned that bit. That scale is pretty much unimaginably large, and we're pretty sure there cannot be any larger structure because of the age of the universe.", 
   {}, 
   124940, 
   null, 
   1116508260.0
  ], 
  [
   125054, 
   null, 
   "Kronus", 
   "Yes the center of the mass, but not the center of the universe.\n The universe isnt spread out evenly so there may be more mass on one side of the center of the universe than the other. (Like a foam ball that has hollow spots in one area and dense chunks of rock or metal in other areas.\n The center of the ball would not be the center of the mass of the ball.\n \n We want this point so we could reference the absolute motion of any given particle in the universe. Not relative to anything else like a planet or a galaxy.\n\n \n Right, now I remember. :)\n \n Ok, as Jo says I don't think you can actually find the center of mass of the universe, but just for the sake of argument suppose you could. That still doesn't give you \"absolute motion\". All that gives you is motion relative to that point. You can do that with any point in the universe. And the point doesn't have to be tied to a planet, galaxy, or anything. It could just as easily be floating in space.\n \n Let me reiterate this point, because it's really key here. There is no such thing as absolute motion. Not even a little bit. All motion must be relative to a frame of reference, and all frames of reference are equally valid. You could pick absoluely any body in the universe, and I could define a frame of reference where that body isn't moving, and one where it's travelling at almost the speed of light, and both of those would be equally valid. Your body would really, actually be holding still relative to the first frame, and would really be travelling at almost the speed of light relative to the other frame.\n \n I think the reason you're having trouble here is that you've spent your whole life in the Earth's frame of reference. All the stuff sitting around you isn't moving relative to the Earth, and so it's really easy to believe that it isn't moving at all. And when things do move, they move relative to the earth. We know intellectually that the earth's frame of reference isn't absolute, but instinctively we treat it that way, unless we're doing astronomy or space flight. But it does get us used to wanting an absolute frame to measure everything against, even though no such thing exists.", 
   {}, 
   124939, 
   null, 
   1116526080.0
  ], 
  [
   125482, 
   null, 
   "canadianman76", 
   "Right, now I remember. :)\n \n Ok, as Jo says I don't think you can actually find the center of mass of the universe, but just for the sake of argument suppose you could. That still doesn't give you \"absolute motion\". All that gives you is motion relative to that point. You can do that with any point in the universe. And the point doesn't have to be tied to a planet, galaxy, or anything. It could just as easily be floating in space.\n\n \n \n For this thought experiment, think of the universe as a baloon filled with water.\n Water is evenly distributed, so it is fairly homogenous.\n If the baloon is all of existence, then picking one of the molecules of the water swirling around inside as a reference point to map out the rest of the water molecules (stars, planets, and galaxys) would be kind of silly. The rest of the baloon would revolve around the single molecule that you picked.\n As time went on your reference point would change, and your map would go to ****, and nobody would buy it.\n If you could use the surface of the baloon as a reference point that would be ideal, it is the inside of the baloons absolute motion 0. Anywhere in the baloon could be referenced to the baloons surface to tell you the absolute motion of that mollecule of water (Planet, star, galaxy) within the universe.\n But seeing as how the universe does not have an outer membrane (at least that we know of), you would have to take the average motion of all matter and use that as your reference point. And Yes it would probably be a point in space that would seem to be buzzing past us at 600 km/s but you could take that reference anywhere you wanted once you knew what direction and velocity we were traveling with respect to the origional point that you found. Then you would have a sweet map and everyone would buy one. emoticon_xagree", 
   {}, 
   125054, 
   null, 
   1116579180.0
  ], 
  [
   125483, 
   null, 
   "canadianman76", 
   "Right, now I remember. :)\n Let me reiterate this point, because it's really key here. There is no such thing as absolute motion. Not even a little bit. All motion must be relative to a frame of reference, and all frames of reference are equally valid. You could pick absoluely any body in the universe, and I could define a frame of reference where that body isn't moving, and one where it's travelling at almost the speed of light, and both of those would be equally valid. Your body would really, actually be holding still relative to the first frame, and would really be travelling at almost the speed of light relative to the other frame.\n\n The frame of reference for absolute motion (when i win the nobel prize and am crowned king of the universe for discovering it emoticon_cool ) would be the average velocity of every particle in the universe taking into account both magnitude and direction of the particles.\n Our galaxy may be traveling many thousands or even millions of m/s relative to this frame of reference, but there may be particles that are standing still relative to the absolute motions frame of reference.", 
   {}, 
   125054, 
   null, 
   1116579900.0
  ], 
  [
   125485, 
   null, 
   "canadianman76", 
   "Right, now I remember. :)\n I think the reason you're having trouble here is that you've spent your whole life in the Earth's frame of reference. All the stuff sitting around you isn't moving relative to the Earth, and so it's really easy to believe that it isn't moving at all. And when things do move, they move relative to the earth. We know intellectually that the earth's frame of reference isn't absolute, but instinctively we treat it that way, unless we're doing astronomy or space flight. But it does get us used to wanting an absolute frame to measure everything against, even though no such thing exists.\n\n \n I do understand that at least for now the universe is infinite, and there isnt anything absolute to measure against.\n Scientists are trying to calculate the age, and mass of the universe to see if it is going to expand forever, or colapse back in on itsself. So that tells ma that they dont think the universe is infinite.\n If this is true, then when they calculate the mass, we can find the absolute motion of the universe, and volia!!! I will be king! emoticon_hb", 
   {}, 
   125054, 
   null, 
   1116580740.0
  ], 
  [
   125490, 
   null, 
   "Jo Bennett", 
   "No, it is still infinite whether it continues to expand or collapses back. The expansion and contraction refers to distances inside the universe. You may recall I previously mentioned that the big bang was the point at which internal distances are all zero, but the universe itself was still infinite. Consequently even if that arbitrary internal distance starts shrinking again, the universe will still be infinite. There can be magnitudes of infinity. The dirac delta function illustrates this to some extent.", 
   {}, 
   125485, 
   null, 
   1116583920.0
  ], 
  [
   125513, 
   null, 
   "Kronus", 
   "The frame of reference for absolute motion (when i win the nobel prize and am crowned king of the universe for discovering it emoticon_cool ) would be the average velocity of every particle in the universe taking into account both magnitude and direction of the particles.\n Our galaxy may be traveling many thousands or even millions of m/s relative to this frame of reference, but there may be particles that are standing still relative to the absolute motions frame of reference.\n\n \n I'm sorry, I've tried every way I can think of to explain why what you're saying simply makes no sense. Good luck on the Nobel pize.", 
   {}, 
   125483, 
   null, 
   1116602640.0
  ], 
  [
   125595, 
   null, 
   "canadianman76", 
   "Are either of you a professor of theoretical physics, or something of the sort?", 
   {}, 
   125513, 
   null, 
   1116613620.0
  ], 
  [
   125600, 
   null, 
   "canadianman76", 
   "No, it is still infinite whether it continues to expand or collapses back. The expansion and contraction refers to distances inside the universe. You may recall I previously mentioned that the big bang was the point at which internal distances are all zero, but the universe itself was still infinite. Consequently even if that arbitrary internal distance starts shrinking again, the universe will still be infinite. There can be magnitudes of infinity. The dirac delta function illustrates this to some extent.\n\n \n You Said \"inside the universe\". If there is an inside, then there would be an outside, wouldnt there. If the dimensions still hadnt taken form, then what was there before empty space?\n What is the dirac delta function?\n I can understand if you guys are getting sick of this conversation.", 
   {}, 
   125490, 
   null, 
   1116614040.0
  ], 
  [
   125603, 
   null, 
   "Kronus", 
   "Are either of you a professor of theoretical physics, or something of the sort?\n\n \n Mechanical engineer and computer geek. I have taken grad school level courses in modern physics.", 
   {}, 
   125595, 
   null, 
   1116614640.0
  ], 
  [
   125605, 
   null, 
   "canadianman76", 
   "Mechanical engineer and computer geek. I have taken grad school level courses in modern physics.\n\n Well at least one of us knows what he,s talking about then. lol\n What is the dirac delta function?", 
   {}, 
   125603, 
   null, 
   1116615540.0
  ], 
  [
   125622, 
   null, 
   "Kronus", 
   "Well at least one of us knows what he,s talking about then. lol\n What is the dirac delta function?\n\n \n It's a function, or more accurately a distribution, which is infinite at t=0 and 0 for all t not equal to zero. I'm not sure how Jo meant it to be relevant.", 
   {}, 
   125605, 
   null, 
   1116617880.0
  ], 
  [
   125648, 
   null, 
   "Jo Bennett", 
   "You Said \"inside the universe\". If there is an inside, then there would be an outside, wouldnt there. If the dimensions still hadnt taken form, then what was there before empty space?\n What is the dirac delta function?\n I can understand if you guys are getting sick of this conversation.\n\n \n Nobody knows what is \"outside\" the universe. Inside and outside are pretty imprecise terms, but when you have a language designed to describe physical space then what can you do? Not only do we not know what is \"outside\", the nature of the universe, as far as we understand it, means that we cannot know.\n \n The dirac delta function is the second order derivative of the modulus function. Basically it is infinitely valued at x=0 and zero valued elsewhere - it is a great big, infinitely tall, infinitely thin spike. The key thing is that when integrated over symmetric limits, the area of this spike is 1; and it is possible to have numerical factors in front of the delta function so that it takes that value when integrated, though the spike is still infinitely tall and infinitely thin. This gives functions that are clearly of different sizes, yet are still infinite in height. This allows the concept of different magintudes of infinity. I mentioned it to demonstrate that different things can be infinite while one is still clearly larger than the other.\n \n I'm a 3rd year theoretical physics and maths joint major, I've just been taking a course in cosmology.", 
   {}, 
   125600, 
   null, 
   1116621120.0
  ], 
  [
   125726, 
   null, 
   "canadianman76", 
   "Nobody knows what is \"outside\" the universe. Inside and outside are pretty imprecise terms, but when you have a language designed to describe physical space then what can you do? Not only do we not know what is \"outside\", the nature of the universe, as far as we understand it, means that we cannot know.\n \n The dirac delta function is the second order derivative of the modulus function. Basically it is infinitely valued at x=0 and zero valued elsewhere - it is a great big, infinitely tall, infinitely thin spike. The key thing is that when integrated over symmetric limits, the area of this spike is 1; and it is possible to have numerical factors in front of the delta function so that it takes that value when integrated, though the spike is still infinitely tall and infinitely thin. This gives functions that are clearly of different sizes, yet are still infinite in height. This allows the concept of different magintudes of infinity. I mentioned it to demonstrate that different things can be infinite while one is still clearly larger than the other.\n \n I'm a 3rd year theoretical physics and maths joint major, I've just been taking a course in cosmology.\n\n \n I get it! something that is infinitley long, can have a finite width or depth to it.\n Or do you mean it can have different lengths of infinity?\n What is the modulus function?", 
   {}, 
   125648, 
   null, 
   1116631800.0
  ], 
  [
   125730, 
   null, 
   "Jo Bennett", 
   "I mean you have have different sizes of infinity. I'll try a different example. There are an infinite number of positive integers, yes? There are also an infinite number of even positive integers, yes? But there are twice as many integers as their are positive integers. So you have two infinite quantities, one of which is larger than the other. The point here is that the universe can be larger at one point in time than at another, but it will still be infinite at both times (yes I know I'm implying an absolute time but that's not really a problem in this instance).\n \n The modulus function is the function which has y=x for x<0 and y=-x for x<0. It is roughly v-shaped, with two lines symmetric about the y-axis at 90 degrees to each other. If you differentiate this with respect to x you get the sign function, which is 1 for x<0 and -1 for x<0. Differentiate again and you get the dirac delta function.", 
   {}, 
   125726, 
   null, 
   1116632340.0
  ], 
  [
   125732, 
   null, 
   "canadianman76", 
   "I mean you have have different sizes of infinity. I'll try a different example. There are an infinite number of positive integers, yes? There are also an infinite number of even positive integers, yes? But there are twice as many integers as their are positive integers. So you have two infinite quantities, one of which is larger than the other. The point here is that the universe can be larger at one point in time than at another, but it will still be infinite at both times (yes I know I'm implying an absolute time but that's not really a problem in this instance).\n\n \n So does this mean that space is expanding at the speed of time? I've gone crosseyed again!!! emoticon_frazzled", 
   {}, 
   125730, 
   null, 
   1116632700.0
  ], 
  [
   125736, 
   null, 
   "Jo Bennett", 
   "The rate of expansion is only defined in terms of time, so you can't really talk about the speed of time. The expansion of the universe is parameterised by the scale factor, a(t), and da/d=a'(t). a'/a is the hubble parameter, which gives the rate of expansion (pretty much). Please keep asking questions as I have an exam on this next week so it's good revision. :p", 
   {}, 
   125732, 
   null, 
   1116633000.0
  ], 
  [
   125741, 
   null, 
   "canadianman76", 
   "\n The modulus function is the function which has y=x for x<0 and y=-x for x<0. It is roughly v-shaped, with two lines symmetric about the y-axis at 90 degrees to each other. If you differentiate this with respect to x you get the sign function, which is 1 for x<0 and -1 for x<0. Differentiate again and you get the dirac delta function.\n\n What is the modulus function used for?", 
   {}, 
   125730, 
   null, 
   1116633240.0
  ], 
  [
   125746, 
   null, 
   "Jo Bennett", 
   "Well, in general a lot of things use the modulus function, it's a fairly standard mathematical tool. You'll find it used in quantum mechanics, for example, where caclulating the probability of a particle being in a given range of positions is done by taking the integral of the square of the modulus of the wavefunction, with some extra factors. In the simple form I described, however, the main use I can think of is the one I have been talkng about, deriving the dirac delta function.", 
   {}, 
   125741, 
   null, 
   1116633660.0
  ], 
  [
   125875, 
   null, 
   "canadianman76", 
   "The rate of expansion is only defined in terms of time, so you can't really talk about the speed of time. The expansion of the universe is parameterised by the scale factor, a(t), and da/d=a'(t). a'/a is the hubble parameter, which gives the rate of expansion (pretty much). Please keep asking questions as I have an exam on this next week so it's good revision. :p\n\n the rate of expansion of what?", 
   {}, 
   125736, 
   null, 
   1116652920.0
  ], 
  [
   125877, 
   null, 
   "Redratio1", 
   "the rate of expansion of what?\n\n \n Of the universe.\n The observable universe is limited by the redshift/expansion of the universe.", 
   {}, 
   125875, 
   null, 
   1116653040.0
  ], 
  [
   125928, 
   null, 
   "Jo Bennett", 
   "The visible universe is limited by the speed of light and the age of the universe. The expansion I was talking about refers to the whole universe.", 
   {}, 
   125877, 
   null, 
   1116665580.0
  ], 
  [
   125929, 
   null, 
   "canadianman76", 
   "The visible universe is limited by the speed of light and the age of the universe. The expansion I was talking about refers to the whole universe.\n\n So you mean the expansion of the spacetime continuum as well?\n That would give time a change in magnitude, and a direction, wouldnt it?", 
   {}, 
   125928, 
   null, 
   1116665940.0
  ], 
  [
   125932, 
   null, 
   "Jo Bennett", 
   "I think it generally refers to the spacial dimensions. I'm not sure because I've not done a lot of relativity.", 
   {}, 
   125929, 
   null, 
   1116669240.0
  ], 
  [
   125993, 
   null, 
   "Kronus", 
   "I mean you have have different sizes of infinity. I'll try a different example. There are an infinite number of positive integers, yes? There are also an infinite number of even positive integers, yes? But there are twice as many integers as their are positive integers. So you have two infinite quantities, one of which is larger than the other. \n \n\n \n I realize that this is a total aside, but that isn't quite right. Infinity does come in various sizes, or as the mathematicans would put it, orders. However, the integers and the even integers are of the same order. There aren't more of one than the other.\n \n Two infinite sets are of the same order if you can make a one to one mapping between them, with nothing left over on either side. To map the integers to the even integers all you would need to do is multiply the integer by two, and you'll get a unique mapping to an even integer, so they're of the same order.\n \n If you feel like discussing this more, we should probably start a new thread, this one is bouncing around enough as it is. :)", 
   {}, 
   125730, 
   null, 
   1116692700.0
  ], 
  [
   126008, 
   null, 
   "Jo Bennett", 
   "Sorry, my mistake.", 
   {}, 
   125993, 
   null, 
   1116695040.0
  ], 
  [
   126035, 
   null, 
   "Redratio1", 
   "The visible universe is limited by the speed of light and the age of the universe. The expansion I was talking about refers to the whole universe.\n\n \n The expansion of the universe is the limiting factor. The real volume of the universe is greater than the observed.", 
   {}, 
   125928, 
   null, 
   1116698160.0
  ], 
  [
   126039, 
   null, 
   "Jo Bennett", 
   "Yes, the whole universe if much greater than the observable universe, but it is the whole universe that has its expansion subject to the hubble parameter. The expansion of the observable universe is simply determined by the speed of light - the observable universe at present is those parts of the universe within 15 billion light years of us (approx).", 
   {}, 
   126035, 
   null, 
   1116698520.0
  ], 
  [
   126149, 
   null, 
   "canadianman76", 
   "I realize that this is a total aside, but that isn't quite right. Infinity does come in various sizes, or as the mathematicans would put it, orders. However, the integers and the even integers are of the same order. There aren't more of one than the other.\n \n Two infinite sets are of the same order if you can make a one to one mapping between them, with nothing left over on either side. To map the integers to the even integers all you would need to do is multiply the integer by two, and you'll get a unique mapping to an even integer, so they're of the same order.\n \n If you feel like discussing this more, we should probably start a new thread, this one is bouncing around enough as it is. :)\n\n There still would be twice as many integers as even or odd integers in any order of infinity wouldnt there?", 
   {}, 
   125993, 
   null, 
   1116710700.0
  ], 
  [
   126327, 
   null, 
   "Kronus", 
   "There still would be twice as many integers as even or odd integers in any order of infinity wouldnt there?\n\n \n I'll start a new thread. :)", 
   {}, 
   126149, 
   null, 
   1116728400.0
  ], 
  [
   126384, 
   null, 
   "Redratio1", 
   "Wrote this on time travel on another forum.....\n \n Causal paradoxes are not really paradoxes at all. When someone goes back in time, what they are really doing is going back to a state where the universe has the same arrangement of causality.\n \n Making it more simple:\n It is like a chemical reaction that starts with a molecule, and finishes with a different molecule. Now recreate exactly the reaction so that nothing at all looks different, including the starting molecule. Then in the middle of the process drop end product of the first reaction in. According to that end product molecule, it has just been dropped into a reaction that happened in the past. Nothing is different, however the reaction progresses and that end product is brought into a different future because he has be inserted into the flow of the reaction; perhaps a different byproduct was produced in the reaction.\n \n The universe is a continum of quantum states of all particles in the universe. But at the basic level elementary particles are indistinguishable; two electrons in the same state for example. \n \n When a person goes back in time they are just moving to a state identical to their own, and can interact with it. You can kill your father or hang out with your twin. After that time would continue into a different future as causality continued. The problem is, that the universe's quantum state in always changing causally. Travelling into the future is no problem because as long as you approach the speed of light, you are allowing the universe to move through its states naturally while the pace of your own slows. However moving back in time requires you to recreate the quantum conditions in the universe exactly how it was in the past. I don't see anyway around that fact because I don't see time as a thing independent of the structure of the universe. There is no independent 'time'. More like spacetime, or space-energy-quantumstate-time.", 
   {}, 
   126327, 
   null, 
   1116732720.0
  ], 
  [
   126493, 
   null, 
   "canadianman76", 
   "Wrote this on time travel on another forum.....\n \n Causal paradoxes are not really paradoxes at all. When someone goes back in time, what they are really doing is going back to a state where the universe has the same arrangement of causality.\n \n Making it more simple:\n It is like a chemical reaction that starts with a molecule, and finishes with a different molecule. Now recreate exactly the reaction so that nothing at all looks different, including the starting molecule. Then in the middle of the process drop end product of the first reaction in. According to that end product molecule, it has just been dropped into a reaction that happened in the past. Nothing is different, however the reaction progresses and that end product is brought into a different future because he has be inserted into the flow of the reaction; perhaps a different byproduct was produced in the reaction.\n \n The universe is a continum of quantum states of all particles in the universe. But at the basic level elementary particles are indistinguishable; two electrons in the same state for example. \n \n When a person goes back in time they are just moving to a state identical to their own, and can interact with it. You can kill your father or hang out with your twin. After that time would continue into a different future as causality continued. The problem is, that the universe's quantum state in always changing causally. Travelling into the future is no problem because as long as you approach the speed of light, you are allowing the universe to move through its states naturally while the pace of your own slows. However moving back in time requires you to recreate the quantum conditions in the universe exactly how it was in the past. I don't see anyway around that fact because I don't see time as a thing independent of the structure of the universe. There is no independent 'time'. More like spacetime, or space-energy-quantumstate-time.\n\n Moving back in time doesnt mean you have to recreate the universe! that would be way less possible then finding a wormhole in the space/time continumn, and finding a way to wiggle through it without having the smack layed down on you by gravity and any other forces that may want to bitch slap you when you try!\n At least thats what I think, but im ****** drunk, and I didnt get to take home any drunk chicks, so I'm also sexually frustrated right now!!!!! emoticon_frazzled", 
   {}, 
   126384, 
   null, 
   1116771360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  what is time?", 
  "url": "http://www.4forums.com/political/science-math-debates/5162-what-time.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 5162, 
  "discussion_files": [
   [
    "11896.html", 
    "http://www.4forums.com/political/science-math-debates/5162-what-time-print.html"
   ], 
   [
    "11897.html", 
    "http://www.4forums.com/political/science-math-debates/5162-what-time-6-print.html"
   ], 
   [
    "11898.html", 
    "http://www.4forums.com/political/science-math-debates/5162-what-time-4-print.html"
   ], 
   [
    "11899.html", 
    "http://www.4forums.com/political/science-math-debates/5162-what-time-5-print.html"
   ], 
   [
    "11900.html", 
    "http://www.4forums.com/political/science-math-debates/5162-what-time-3-print.html"
   ], 
   [
    "11901.html", 
    "http://www.4forums.com/political/science-math-debates/5162-what-time-2-print.html"
   ]
  ], 
  "identifier": 5162
 }
]