[
 [
  [
   120584, 
   null, 
   "Missouri Mule", 
   "The author goes on to claim that Zarqawi was in Oklahoma City during the time of the Murrah Building bombing that killed 160 people including little children. I can't speak to that but it can't be ruled out as the investigation into that bombing has been reopened. The second man convicted now seems to be coming clean with new information. \n \n However, she is wrong about one thing. From NYT's Jayna Davis's account, the terrorist in Oklahoma City in 1995 was none other than the second in command, Ayman Al-Zawahiri.\n \n \"Clarke writes that Al-Qaeda operatives attended conventions in Oklahoma City in the early 1990's. According to Davis ' startling new research, Bin Laden's No. 2 man, the notorious Dr. Ayman Al-Zawahiri, personally visited Islamic demolitions experts residing in OKC in the spring of 1995 to insure the smooth execution of the pending terrorist strike against the Murrah federal complex.\" \n \n http://www.amazon.com/exec/obidos/ASIN/0785261036/102-7878068-6732163\n \n ==========================\n \n The Power of Islam\n \n War on Terror/Barbara Stock\n \n May 10, 2005 - People may wonder why I write so often about the War with Islam. There is no \"War on Terror.\" Our war is with the violent ideology of Islam and those that follow that doctrine and there are millions of such followers. Americans need to understand the seriousness of the situation in which we find ourselves. Islam is in full jihad mode and Islamic leaders know that to succeed, they must destroy the United States.\n \n On one hand, we have moderate Muslims denying that Muslims kill and behead innocent people. When they are forced to admit the truth, the argument switches to, \"They are not following true Islam.\" The problem is this: The terrorists are following true Islam because Islam is founded on fear and violence.\n \n Do all Muslims believe in the true teachings of Islam? No, but they believe they do. There are many Muslims who truly believe that Islam is a peaceful religion whose followers would never harm a fly. These Muslims probably wouldn't harm a fly until they are exposed to Muslims who do follow true Islam.\n \n Perhaps an example would be appropriate. A perfectly normal British Muslim man went to Saudi Arabia to make his required pilgrimage, called the Hajj. This normal father of a teenaged daughter returned to London a full-fledged Muslim. Just that brief encounter with Arab Muslims turned this man into a killer.\n \n While in Saudi Arabia, this man was convinced by the true Arab Muslims that his daughter was no longer \"pure.\" He was ordered to kill her to restore his \"honor.\" So, this man returned to London and slit his daughter's throat in front of his other children. The two younger children ran screaming from the house covered with their sister's blood. Their father was convinced their sister was no longer a virgin. The autopsy proved him wrong.\n \n A young, innocent girl is dead. Her younger siblings are forever traumatized and their father is now in prison for life. An entire family was destroyed because of a few fateful days the father spent with Arab Muslims. That is the power of true Islam... \n \n (Snip)\n \n http://therant.us/staff/guest/stock/the_power_of_islam.htm", 
   {
    "post_info": {
     "post_title": "The Power of Islam"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1115827920.0
  ], 
  [
   120597, 
   null, 
   "Waxy", 
   "Timothy McVeigh Oklahoma City?\n \n Are you (in a roundabout way of course) suggesting that McVeigh is either innocent or a pawn of islamic extremists, ie Zarqawi?\n \n That would be a whole new level of irrational paranoia, even for you.\n \n Waxy", 
   {}, 
   120584, 
   null, 
   1115829000.0
  ], 
  [
   120602, 
   null, 
   "Missouri Mule", 
   "Timothy McVeigh Oklahoma City?\n \n Are you (in a roundabout way of course) suggesting that McVeigh is either innocent or a pawn of islamic extremists, ie Zarqawi?\n \n That would be a whole new level of irrational paranoia, even for you.\n \n Waxy\n\n \n Not at all. He did the evil deed but I am becoming more inclined to think that there may be something to the theory that there was some middle east connection. I ran across this when I was looking into the history of this writer and Jayna Davis who has also investigated the terrorist connections. You might want to look at it and look at some of the links. Very interesting.\n \n http://www.archive-news.net/Articles/SH040923.html", 
   {}, 
   120597, 
   null, 
   1115829300.0
  ], 
  [
   120655, 
   null, 
   "SteveRogers", 
   "Timothy McVeigh Oklahoma City?\n \n Are you (in a roundabout way of course) suggesting that McVeigh is either innocent or a pawn of islamic extremists, ie Zarqawi?\n \n That would be a whole new level of irrational paranoia, even for you.\n \n Waxy\n\n \n I agree. I have heard this theory before and find it quite laughable. But some have to work to justify just about anything.", 
   {}, 
   120597, 
   null, 
   1115832600.0
  ], 
  [
   120658, 
   null, 
   "Redratio1", 
   "Its Zawahiri MM. Zarqawi is the Jordanian in Iraq. Zawahiri is the al Qaeda mastermind.", 
   {}, 
   120655, 
   null, 
   1115832840.0
  ], 
  [
   120668, 
   null, 
   "lord tammerlain", 
   "I also believe that Zarqawi was in a Jordanian prison during the time of the Oklahoma city bombing.", 
   {}, 
   120655, 
   null, 
   1115833200.0
  ], 
  [
   120672, 
   null, 
   "Redratio1", 
   "The book is on Zawahiri anyway.", 
   {}, 
   120668, 
   null, 
   1115833320.0
  ], 
  [
   120688, 
   null, 
   "Missouri Mule", 
   "Its Zawahiri MM. Zarqawi is the Jordanian in Iraq. Zawahiri is the al Qaeda mastermind.\n\n \n Yes, you are correct. I found that discrepancy and corrected my earlier post. I had not read far enough down in the original site to have seen it when I originally posted it. That's when I also was reading the other information that I linked. It gets curiorsor and curiosor. Just a week or so ago FBI revealed that they had found more undiscovered explosives in the basement of McVeigh's accomplice. It's like a replay of the Keystone Cops. \n \n I can't prove this but I suspect it is a lot of this information that is not widely shared and talked about that drove Bush's decision to remove Saddam. If in fact Saddam were implicated in the earlier WTC bombing and of course he tried to murder Bush #41, then Bush had all the justification in the world to remove Saddam.", 
   {}, 
   120658, 
   null, 
   1115834100.0
  ], 
  [
   120707, 
   null, 
   "SteveRogers", 
   "If cows fly. Seriously, there was no justifcation and just looking for some is silly. Either you have evidence or you don't. Please present some if you have it.", 
   {}, 
   120688, 
   null, 
   1115834700.0
  ], 
  [
   120710, 
   null, 
   "Missouri Mule", 
   "If cows fly. Seriously, there was no justifcation and just looking for some is silly. Either you have evidence or you don't. Please present some if you have it.\n\n \n Other than saying nothing which is your normal method of discourse here what do you say to the very real fact that Saddam attempted to assassinate Bush #41? Is that also a figment of my imagination?", 
   {}, 
   120707, 
   null, 
   1115834820.0
  ], 
  [
   120716, 
   null, 
   "lord tammerlain", 
   "Other than saying nothing which is your normal method of discourse here what do you say to the very real fact that Saddam attempted to assassinate Bush #41? Is that also a figment of my imagination?\n\n \n \n So is an assassination attempt a legitamate reason to invade a country (regardless of political system)?", 
   {}, 
   120710, 
   null, 
   1115834940.0
  ], 
  [
   120717, 
   null, 
   "Missouri Mule", 
   "So is an assassination attempt a legitamate reason to invade a country (regardless of political system)?\n\n \n Hell yes! But that is hardly the only reason.\n \n Why do you think there was so much hand wringing over the assasination of JFK? The belief on many people was that the Soviets had done this and they wanted to get on record immediately that they had nothing to do with it. A lot of people were afraid we were about to go into WWIII with all of the bombs going off. I should know. I was in the military during that time and things got very dicey. \n \n BTW, the news is now reporting an evacuation of the WH and capitol building because an airplane has entered restricted air place, within three miles of the capitol. Fighter planes were sent to intercept. News just now coming in. Probably nothing serious.", 
   {}, 
   120716, 
   null, 
   1115835000.0
  ], 
  [
   120720, 
   null, 
   "Eddie", 
   "Hell yes! But that is hardly the only reason.\n\n \n So Cuba would be legitimate in invading the US in your oppinion then? (never mind that they would get their bottoms handed to them in 20 seconds... but that`s another issue)", 
   {}, 
   120717, 
   null, 
   1115835180.0
  ], 
  [
   120725, 
   null, 
   "Missouri Mule", 
   "So Cuba would be legitimate in invading the US in your oppinion then? (never mind that they would get their bottoms handed to them in 20 seconds... but that`s another issue)\n\n \n I don't know quite how to respond to your post. Cuba is not a great power and never will be. To attempt to assassinate a major leader of a major power (now the only superpower) would be tantamount to a declaration of war.", 
   {}, 
   120720, 
   null, 
   1115835420.0
  ], 
  [
   120728, 
   null, 
   "Eddie", 
   "I don't know quite how to respond to your post. Cuba is not a great power and never will be. To attempt to assassinate a major leader of a major power (now the only superpower) would be tantamount to a declaration of war.\n\n \n It would be tantamount to suicide perhaps. But I don`t see how the size of the country matters in the case of justification and legitimacy...", 
   {}, 
   120725, 
   null, 
   1115835540.0
  ], 
  [
   120732, 
   null, 
   "Redratio1", 
   "Might makes right I suppose.\n \n I always considered international law a bit of a facade. It takes enforcement by a great power to keep it going, however it is those great powers who must violate it to preserve it. Not to mention the double standards that great powers get by virtue of their power.", 
   {}, 
   120728, 
   null, 
   1115835840.0
  ], 
  [
   120734, 
   null, 
   "Eddie", 
   "Then I don`t see why an attempted assasination would be required at all. If might makes right, US wouldn`t need any rationalisations or excuses to invade virtually any country (with the possible exeption of perhaps China, Russia and possibly an EU member)", 
   {}, 
   120732, 
   null, 
   1115835960.0
  ], 
  [
   120735, 
   null, 
   "Missouri Mule", 
   "It would be tantamount to suicide perhaps. But I don`t see how the size of the country matters in the case of justification and legitimacy...\n\n \n Theoretically you are correct but \"real politic\" dictates a different course of action; especially a small country in the western hemisphere where America holds most of the cards. That's just the way it is. \n \n Personally, I believe in Teddy Roosevelt's view of world politics which was to talk softly but carry a big stick. We have vital and strategic interests throughout the world and a great power does not shirk its responsibilities. Castro made a choice to be a thorn in America's side and we have responded in kind.", 
   {}, 
   120728, 
   null, 
   1115835960.0
  ], 
  [
   120736, 
   null, 
   "Missouri Mule", 
   "Then I don`t see why an attempted assasination would be required at all. If might makes right, US wouldn`t need any rationalisations or excuses to invade virtually any country (with the possible exeption of perhaps China, Russia and possibly an EU member)\n\n \n What possible reason would we have to invade Sweden?", 
   {}, 
   120734, 
   null, 
   1115836020.0
  ], 
  [
   120741, 
   null, 
   "Eddie", 
   "Theoretically you are correct but \"real politic\" dictates a different course of action; especially a small country in the western hemisphere where America holds most of the cards. That's just the way it is. \n\n \n Realpolitik certainly explains why national leaders do what they do. But it offers no justification for their actions at all. As I posted above, if one believes might makes right, you don`t need to talk about assasinations or anything else in order to justify an invasion.", 
   {}, 
   120735, 
   null, 
   1115836140.0
  ], 
  [
   120745, 
   null, 
   "Redratio1", 
   "What possible reason would we have to invade Sweden?\n\n \n To steal their hot women.", 
   {}, 
   120736, 
   null, 
   1115836260.0
  ], 
  [
   120748, 
   null, 
   "Missouri Mule", 
   "Realpolitik certainly explains why national leaders do what they do. But it offers no justification for their actions at all. As I posted above, if one believes might makes right, you don`t need to talk about assasinations or anything else in order to justify an invasion.\n\n \n I think you have misunderstood what I have said. Being a great power does not confer on it the right to do whatever it wants to do. But it does confer responsibility to do what is right. For example, we should have stepped in and stopped the genocide in Rwanda. Instead we took the easy way out and left it to the feckless U.N. and 1,000,000 dead human beings resulted. Fortunately, we stepped up to the plate in Kosovo when Milosevic was running wild in the Balkans.", 
   {}, 
   120741, 
   null, 
   1115836320.0
  ], 
  [
   120754, 
   null, 
   "Redratio1", 
   "I think you have misunderstood what I have said. Being a great power does not confer on it the right to do whatever it wants to do. But it does confer responsibility to do what is right. For example, we should have stepped in and stopped the genocide in Rwanda. Instead we took the easy way out and left it to the feckless U.N. and 1,000,000 dead human beings resulted. Fortunately, we stepped up to the plate in Kosovo when Milosovik was running wild in the Balkans.\n\n \n Being a Clinton fan it pains me to say that I blame him for not doing more to prevent Rwanda, or at least limit its scale. There should be a plaque at the UN on the security Council table to remind the members everyday of their inhuman failure.", 
   {}, 
   120748, 
   null, 
   1115836500.0
  ], 
  [
   120763, 
   null, 
   "Eddie", 
   "I think you have misunderstood what I have said. Being a great power does not confer on it the right to do whatever it wants to do. \n\n \n Ok. But you said that an assasination attempt on Bush snr would have given legitimacy enough to invade Iraq. I then asked wether you think Cuba would be legitimate to invade the US based on the numerous(?) assasination attempts on Castro.\n \n \n \n But it does confer responsibility to do what is right. \n\n \n It sure does (to a certain extent). \n \n \nI For example, we should have stepped in and stopped the genocide in Rwanda. Instead we took the easy way out and left it to the feckless U.N. and 1,000,000 dead human beings resulted. Fortunately, we stepped up to the plate in Kosovo when Milosovik was running wild in the Balkans.\n\n \n Hehe... Kosovo was perhaps one of the greatest display of Realpolitik of the west since the end of the cold war... Antyhing to stump russian influence in the european theatre...", 
   {}, 
   120748, 
   null, 
   1115836680.0
  ], 
  [
   120765, 
   null, 
   "lord tammerlain", 
   "Hell yes! But that is hardly the only reason.\n \n \n\n \n So Fidel Castro would be justified in destroying the US government?\n \n So Hugo Chavez would be justified in doing the same?", 
   {}, 
   120717, 
   null, 
   1115836800.0
  ], 
  [
   120766, 
   null, 
   "Redratio1", 
   "\n Hehe... Kosovo was perhaps one of the greatest display of Realpolitik of the west since the end of the cold war... Antyhing to stump russian influence in the european theatre...\n\n \n We did run circles around Yeltsin thats for sure. The diplomacy of that war is fascinating. The Discovery-Times Channel had a 4 part indepth series on it, talking to all the major players.", 
   {}, 
   120763, 
   null, 
   1115836860.0
  ], 
  [
   120767, 
   null, 
   "Missouri Mule", 
   "Being a Clinton fan it pains me to say that I blame him for not doing more to prevent Rwanda, or at least limit its scale. There should be a plaque at the UN on the security Council table to remind the members everyday of their inhuman failure.\n\n \n That was something that need not have happened. And it could have been stopped almost immediately with the introduction of 2-3 C-130s with trained commandos. They could have readily stopped the mobs that were rampaging through the streets hacking people to death. Seeing the recent movies \"Hotel Rwanda\" and \"Sometime in April\" on HBO infuriated me.", 
   {}, 
   120754, 
   null, 
   1115836860.0
  ], 
  [
   120768, 
   null, 
   "Waxy", 
   "\n I can't prove this but I suspect it is a lot of this information that is not widely shared and talked about that drove Bush's decision to remove Saddam. If in fact Saddam were implicated in the earlier WTC bombing and of course he tried to murder Bush #41, then Bush had all the justification in the world to remove Saddam.\n\n \n I can't prove this, but I suspect that GWB personally paid Monica Lewinsky vast sums of money so she would \"cozy up\" to Clinton and produce a scandal that he could use to regain power for himself and the Republicans.\n \n I also can't prove this because there are only a few rare examples and the media won't broadcast it, but I suspect that anyone from Missouri is likely a paranoid delusional conspiracy theorist.\n \n Oh yeah, and the US gov't has proof of aliens and bigfoot, in fact, GWB has lunch with them every day. I just can't prove it.\n \n Waxy\n \n P.S. I'm not denying the assassination attempt, just the other ridiculous accusations.", 
   {}, 
   120688, 
   null, 
   1115836920.0
  ], 
  [
   120769, 
   null, 
   "Missouri Mule", 
   "Ok. But you said that an assasination attempt on Bush snr would have given legitimacy enough to invade Iraq. I then asked wether you think Cuba would be legitimate to invade the US based on the numerous(?) assasination attempts on Castro.\n \n It sure does (to a certain extent). \n \n Hehe... Kosovo was perhaps one of the greatest display of Realpolitik of the west since the end of the cold war... Antyhing to stump russian influence in the european theatre...\n\n \n Didn't we make specific promises to Khruschev and the Soviet Union we would make no more attempts on Castro's life after the Cuban Missile Crisis? I thought that was part of the deal and we have kept our promises. But that didn't mean we had to make nice with him and not use economic sanctions to destabalize his regime.", 
   {}, 
   120763, 
   null, 
   1115836980.0
  ], 
  [
   120771, 
   null, 
   "Eddie", 
   "Didn't we make specific promises to Khruschev and the Soviet Union we would make no more attempts on Castro's life after the Cuban Missile Crisis? I thought that was part of the deal and we have kept our promises. But that didn't mean we had to make nice with him and use economic sanctions.\n\n \n You probably did. It doesn`t mean that no attempt was made prior to that promise though. The bay of pigs comes to mind as the most obvious", 
   {}, 
   120769, 
   null, 
   1115837100.0
  ], 
  [
   120774, 
   null, 
   "Redratio1", 
   "That was something that need not have happened. And it could have been stopped almost immediately with the introduction of 2-3 C-130s with trained commandos. They could have readily stopped the mobs that were rampaging through the streets hacking people to death. Seeing the recent movies \"Hotel Rwanda\" and \"Sometime in April\" on HBO infuriated me.\n\n \n Read Shaking hands with the Devil and you will really puke.\n \n btw no one responsed to my post #21.", 
   {}, 
   120767, 
   null, 
   1115837160.0
  ], 
  [
   120779, 
   null, 
   "Eddie", 
   "To steal their hot women.\n\n \n Hehe... bastard... It`s funny because it`s so true...", 
   {}, 
   120745, 
   null, 
   1115837340.0
  ], 
  [
   120780, 
   null, 
   "SteveRogers", 
   "To steal their hot women.\n\n \n You were expecting a response? emoticon_rolleyes emoticon_xangel", 
   {}, 
   120745, 
   null, 
   1115837400.0
  ], 
  [
   120782, 
   null, 
   "Redratio1", 
   "You were expecting a response? emoticon_rolleyes emoticon_xangel\n\n emoticon_xclown emoticon_xclown emoticon_xclown \n Heh.", 
   {}, 
   120780, 
   null, 
   1115837460.0
  ], 
  [
   120793, 
   null, 
   "Missouri Mule", 
   "You probably did. It doesn`t mean that no attempt was made prior to that promise though. The bay of pigs comes to mind as the most obvious\n\n \n That was in March, 1961 just after JFK took office. As a result he had a housecleaning of the CIA and fired Allen Dulles, the CIA head. But JFK took responsibility for the debacle. And remember that we in full near war footing with the Soviet Union at that time and the idea of having a communist beachhead in the western hemisphere was considered untenable.", 
   {}, 
   120771, 
   null, 
   1115837820.0
  ], 
  [
   120800, 
   null, 
   "Eddie", 
   "You where not in \"full near war footing\" with Iraq when Saddam tried to assasinate Bush snr?", 
   {}, 
   120793, 
   null, 
   1115838000.0
  ], 
  [
   120802, 
   null, 
   "Truthsayer", 
   "It would be tantamount to suicide perhaps. But I don`t see how the size of the country matters in the case of justification and legitimacy...\n\n \n Truly, neither does anyone else but in a pinch I am SURE that our friends on the far-right side of the aisle, with the help of Limbaugh and Hannity, will come up with some sort of lop-sided spin explaining how a US attempt on the life of a foreign official does not to equate to war like an attempt on a US official would.\n \n Common logic might tell you they are the same in principle but it's somehow different because WE are the US and they ARE NOT. WE can attempt assassinations because WE are who we are but they cannot because THEY are not us. Make sense? Not really? Bet you a dime that some people will swallow it though, if it is endorsed by the right people.\n \n So when Eddie writes:\n \nOk. But you said that an assasination attempt on Bush snr would have given legitimacy enough to invade Iraq. I then asked wether you think Cuba would be legitimate to invade the US based on the numerous(?) assasination attempts on Castro.\n \n \n And Mr. Missouri responds:\n \nI think you have misunderstood what I have said. Being a great power does not confer on it the right to do whatever it wants to do. But it does confer responsibility to do what is right.\n \n \n We can all see the wheels of spin beginning to turn. We should take advantage of noticing the \"nova\" of spin so we can recoginize it's beginnings in the future as to not be fooled by it repetitively.\n \n But he clearly said that Sadaams attempt on Bush Sr., in and of itself, was an act of war. But when questioned about US attempts on foreighn officials, we get the old Homer Simpson \"Doh!!\" \n \n No, I don't think I misunderstood what Mr. Missouri said initially. It's still there. In black and white. Go read for yourself. Perhaps he didn't mean what he said initially, or it came out wrong. That happens to the best of us. Just admitting that is more admirable than back peddling or insulting the forums intelligence by trying to sell a spin.", 
   {}, 
   120728, 
   null, 
   1115838180.0
  ], 
  [
   120807, 
   null, 
   "Missouri Mule", 
   "Truly, neither does anyone else but in a pinch I am SURE that our friends on the far-right side of the aisle, with the help of Limbaugh and Hannity, will come up with some sort of lop-sided spin explaining how a US attempt on the life of a foreign official does not to equate to war like an attempt on a US official would.\n \n Common logic might tell you they are the same in principle but it's somehow different because WE are the US and they ARE NOT. WE can attempt assassinations because WE are who we are but they cannot because THEY are not us. Make sense? Not really? Bet you a dime that some people will swallow it though, if it is endorsed by the right people.\n \n So when Eddie writes:\n \n \n And Mr. Missouri responds:\n \n \n We can all see the wheels of spin beginning to turn. We should take advantage of noticing the \"nova\" of spin so we can recoginize it's beginnings in the future as to not be fooled by it repetitively.\n \n But he clearly said that Sadaams attempt on Bush Sr., in and of itself, was an act of war. But when questioned about US attempts on foreighn officials, we get the old Homer Simpson \"Doh!!\" \n \n No, I don't think I misunderstood what Mr. Missouri said initially. It's still there. In black and white. Go read for yourself. Perhaps he didn't mean what he said initially, or it came out wrong. That happens to the best of us. Just admitting that is more admirable than back peddling or insulting the forums intelligence by trying to sell a spin.\n\n \n I'm not spinning anything. Certainly Castro could have declared war on America and it would have been an act of suicide. We, however, don't have to put up with it. That's the way the world works. The assasination of an American president would be an earth shaking event. The event of a peon like Castro's assasination would be forgotten inside of a 24 hour news cycle. \n \n What do you suppose the Soviet Union would have done if the Mossad had attempted to assassinate Breshnev? Even though we are joined at the hip with Israel we couldn't have saved them from the Soviet's response, nor should have.", 
   {}, 
   120802, 
   null, 
   1115838660.0
  ], 
  [
   120813, 
   null, 
   "Truthsayer", 
   "I'm not spinning anything. Certainly Castro could have declared war on America and it would have been an act of suicide. We, however, don't have to put up with it. That's the way the world works. The assasination of an American president would be an earth shaking event. \n\n \n Well, going on the logic of \"Where does a 500 pound gorilla sit?\" I suppose you are right, sir. However, that attitude has gotten us into a LOT of trouble lately and understandably so. It is the height of arrogance.", 
   {}, 
   120807, 
   null, 
   1115839080.0
  ], 
  [
   120826, 
   null, 
   "Missouri Mule", 
   "Well, going on the logic of \"Where does a 500 pound gorilla sit?\" I suppose you are right, sir. However, that attitude has gotten us into a LOT of trouble lately and understandably so. It is the height of arrogance.\n\n \n Well, speaking for myself, I would much rather be considered to be arrogant and alive than dead and getting along with our pacifist \"allies.\" \n \n If one bothers to read bin Laden's writings it is abundantly clear that his orgnization attacked America on 9/11 because he correctly perceived us as indecisve and unwilling to bear casualties in a prolonged war against terror. He didn't count on Bush as one who would react differently than his predecessors. Many Americans are unwilling to bear the cost and believe that if we make nice with terrorists that we will be OK. It is as false a choice as it was to believe we could get along with Hitler in WWII. There is only one response in any war and that is to wage absolute and total war on the enemy. To do less is merely to invite further war. In many ways this is much more difficult that WWII because the weapons now include nuclear, biological and chemical weapons that could result in the loss of millions of lives here in America and a total destruction of ours and the world economic system.", 
   {}, 
   120813, 
   null, 
   1115840040.0
  ], 
  [
   120926, 
   null, 
   "SteveRogers", 
   "I'd rather be correct and doing the right thing to make the world safer. :xcensored", 
   {}, 
   120826, 
   null, 
   1115848980.0
  ], 
  [
   120959, 
   null, 
   "Desaix", 
   "I If in fact Saddam were implicated in the earlier WTC bombing \n\n \n Dear god.You really haven't a clue about what your talking about.Away with the birdies i think.Yousef was responsible for the 93 bombing,and he himself had very broad associations with some of the Al-Qaeda hardcore(Osama said he didn't know him and was in Sudan while Yousef stayed in Peshewer).Osama wasn't responsible for the 93 bombing,he wasn't responsible for Bali and Madrid and i don't care what the world media tells you.But by all means keep spouting your misinformation,i for one find it hilarious.\n \n The Yousef-Osama-Saddam link is a conspiracy theory.", 
   {}, 
   120688, 
   null, 
   1115851920.0
  ], 
  [
   120975, 
   null, 
   "Duo_Maxwell", 
   "Christ sakes Mule, that is a big stretch. \n \n Under your use of \"implicated\" the little old muslim lady who donated money is therefore implicated in the first bombing. \n \n Desaix, how much do you want to bet that Mule hasn't read the 9/11 commission report?", 
   {}, 
   120959, 
   null, 
   1115853600.0
  ], 
  [
   120996, 
   null, 
   "Missouri Mule", 
   "Christ sakes Mule, that is a big stretch. \n \n Under your use of \"implicated\" the little old muslim lady who donated money is therefore implicated in the first bombing. \n \n Desaix, how much do you want to bet that Mule hasn't read the 9/11 commission report?\n\n \n I've read part of it. I've read all of Woodward's \"Plan of attack.\"", 
   {}, 
   120975, 
   null, 
   1115856720.0
  ], 
  [
   120999, 
   null, 
   "Missouri Mule", 
   "I'd rather be correct and doing the right thing to make the world safer. :xcensored\n\n \n In other words you would wait until we were attacked again before doing what is required. If we vacillate and wait for the nuclear cloud it will be too late. It amazes me; utterly amazes me, at how strongly felt the left believes in the good will of bin Laden and the terrorists to clean up their act. Just amazing. But with Bush? Noooooooo. He's ALWAYS wrong and never right. Isn't that about it?", 
   {}, 
   120926, 
   null, 
   1115856960.0
  ], 
  [
   121013, 
   null, 
   "Duo_Maxwell", 
   "I've read part of it. I've read all of Woodward's \"Plan of attack.\"\n\n \n please, tell me the pages where it says Saddam helped or had a connection. I have the book. Don't attempt to pull a fast one. In fact I even marked the pages where the report refuts such claims.", 
   {}, 
   120996, 
   null, 
   1115858040.0
  ], 
  [
   121916, 
   null, 
   "Duo_Maxwell", 
   "I see a pattern. When asked for cite from the report, no one who supports can do so. \n \n Frankly I think those who justify their arguments on the report haven't read any of it.", 
   {}, 
   121013, 
   null, 
   1115964660.0
  ], 
  [
   121922, 
   null, 
   "Missouri Mule", 
   "please, tell me the pages where it says Saddam helped or had a connection. I have the book. Don't attempt to pull a fast one. In fact I even marked the pages where the report refuts such claims.\n\n \n I don't recall that I ever said that. The facts, so far as I know, are that Saddam was in no way involved with the planning of 9/11. But that doesn't mean that I know all the facts. Nor do you. As to his involvement with Al Queda, I think that is a bit more murky.", 
   {}, 
   121013, 
   null, 
   1115965140.0
  ], 
  [
   121928, 
   null, 
   "Duo_Maxwell", 
   "I don't see why he would. After all, Bin landen has wanted Saddam's head on a platter since the early 90s. Sure it's murky, but such claims that there was a working (or real) connection are ignorant.", 
   {}, 
   121922, 
   null, 
   1115965620.0
  ], 
  [
   121938, 
   null, 
   "lord tammerlain", 
   "Quite right, Ossama wanted to bring the Afgan Arabs from Afghanistan and fight Saddam when Iraq invaded Kuwait. That the Saudi government refused him and let an infidel army onto Muslim holy ground is one of his complaints.", 
   {}, 
   121928, 
   null, 
   1115966280.0
  ], 
  [
   121940, 
   null, 
   "Missouri Mule", 
   "I don't see why he would. After all, Bin landen has wanted Saddam's head on a platter since the early 90s. Sure it's murky, but such claims that there was a working (or real) connection are ignorant.\n\n \n Not so. You need to do some homework.", 
   {}, 
   121928, 
   null, 
   1115966460.0
  ], 
  [
   121942, 
   null, 
   "Duo_Maxwell", 
   "Not so. You need to do some homework.\n\n \n LOL. That's pretty funny. Considering how the main reason for Bin Laden's hate is that the US did what he was offering to do: take out Saddam. \n \n You need to do some homework", 
   {}, 
   121940, 
   null, 
   1115966520.0
  ], 
  [
   121960, 
   null, 
   "daewoo", 
   "I don't see why he would. After all, Bin landen has wanted Saddam's head on a platter since the early 90s. Sure it's murky, but such claims that there was a working (or real) connection are ignorant.\n\n \n Head on a platter? The \"camps\" Hussein bombed in the north (which Bush re-labeled \"refugee camps\" leading up to the Iraq war) were Al Queda staging and training camps, being protected by our no fly zone. \n \n If you step into thte wayback machine and go back to when BL first spoke about militant agression as the head of the newly formed Al Queda, getting Saddam out of power was the second thing on the list. It was even before removing the United states from the ME.\n \n I am sure he is grateful that Bush stepepd in, removed saddam, and installed a fundamentalist government. BL could not have hoped to do it in a million yers. With Bush as his ally, though, they simply used US troops and the job was done relatively quickly.", 
   {}, 
   121928, 
   null, 
   1115971560.0
  ], 
  [
   121965, 
   null, 
   "Duo_Maxwell", 
   "wait, why did BL bomb his own camps?", 
   {}, 
   121960, 
   null, 
   1115973660.0
  ], 
  [
   121968, 
   null, 
   "daewoo", 
   "Huh? emoticon_xangel \n \n The stupidity is rubbing off. I have read to many posts by the neo-fascists (which are nothing but fascist liberals, lets face it). It is making me dumberer. Fighting the urge to call bush a conservative......", 
   {}, 
   121965, 
   null, 
   1115974440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Power of Islam", 
  "url": "http://www.4forums.com/political/peace-middle-east/5168-power-islam.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5168, 
  "discussion_files": [
   [
    "23482.html", 
    "http://www.4forums.com/political/peace-middle-east/5168-power-islam-print.html"
   ], 
   [
    "23483.html", 
    "http://www.4forums.com/political/peace-middle-east/5168-power-islam-4-print.html"
   ], 
   [
    "23484.html", 
    "http://www.4forums.com/political/peace-middle-east/5168-power-islam-3-print.html"
   ], 
   [
    "23485.html", 
    "http://www.4forums.com/political/peace-middle-east/5168-power-islam-2-print.html"
   ]
  ], 
  "identifier": 5168
 }
]