[
 [
  [
   120850, 
   null, 
   "lord tammerlain", 
   "http://www.informationclearinghouse.info/article8802.htm\n \n \n Not saying it is true, but in thier shoes if I believed I could maintain control of the trigger, I would most definately do it\n \n \nAccording to the book, which will be released to the public on May 17, based on National Security Agency electronic intercepts, the Saudi Arabian government has in place a nationwide, self-destruction explosive system composed of conventional explosives and dirty bombs strategically placed at the Kingdom's key oil ports, pipelines, pumping stations, storage tanks, offshore platforms, and backup facilities. If activated, the bombs would destroy the infrastructure of the world's largest oil supplier, and leave the country a contaminated nuclear wasteland ensuring that the Kingdom's oil would be unusable to anyone. The NSA file is dubbed internally Petro SE, for petroleum scorched earth.\n \n To make certain that the damaged facilities cannot be rebuilt, the Saudis have deployed crude Radioactive Dispersal Devices (RDDs) throughout the Kingdom. Built covertly over several years, these dirty bombs are in place at -- among other locations -- all eight of the Kingdom's refineries, sections of the world's largest oil field at Ghawar, and at three of the ten indispensable processing towers at the largest-ever processing complex at Abqaiq.\n \n According to the NSA intercepts, Petro SE was devised by the Saudis because of their overriding fear that if an internal revolt or external attack threatened the survival of the House of Saud, the U.S. and other Western powers might abandon them as the Shah of Iran was abandoned in 1979. Only by having in place a system that threatened to create crippling oil price increases, political instability and economic recessions did the royal family believe it could coerce Western military powers to keep them in power.\n \n", 
   {
    "post_info": {
     "post_title": "Embargoed Book Claims Saudi Oil Infrastructure Rigged For Catastrophic Self Destructi"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1115841840.0
  ], 
  [
   120870, 
   null, 
   "wilted_laughter", 
   "Smart move if its true. \n \n But doesn't it make these facilities vulnerable to terrorist attack?\n \n Where would they get dirty bombs?", 
   {}, 
   120850, 
   null, 
   1115843580.0
  ], 
  [
   120881, 
   null, 
   "lord tammerlain", 
   "Finding sources of radiation is not that hard if you have the money, even easier if you have a mine that has uranium. From the looks of the article this has been an ongoing program and Saudi Arabia would have had an easy time of getting radioactive material a decade or more ago", 
   {}, 
   120870, 
   null, 
   1115844120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Embargoed Book Claims Saudi Oil Infrastructure Rigged For Catastrophic Self Destructi", 
  "url": "http://www.4forums.com/political/peace-middle-east/5170-embargoed-book-claims-saudi-oil-infrastructure-rigged-catastrophic-self-destructi.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5170, 
  "discussion_files": [
   [
    "24470.html", 
    "http://www.4forums.com/political/peace-middle-east/5170-embargoed-book-claims-saudi-oil-infrastructure-rigged-catastrophic-self-destructi-print.html"
   ]
  ], 
  "identifier": 5170
 }
]