[
 [
  [
   120980, 
   null, 
   "gnojek", 
   "The motto of the French Republic is \"Liberté, Égalité, Fraternité\" but where is the liberty if you can't speak your mind, even in jest?\n \n Most recently a TV channel in France was threatened with huge fines for airing a spoof on the new pope, whom they called \"Adolf II.\" \n \n http://www.cnn.com/2005/WORLD/europe/05/11/france.pope.reut/index.html\n \n There have been other instances where people have been prosecuted for what they say.\n \n http://www.findarticles.com/p/articles/mi_m1568/is_7_34/ai_94775353\n \n \"THE DUMBEST RELIGION, after all, is Islam.\"\n \n\n So spoke best-selling French author and provocateur Michel Houellebecq just days before September 11, 2001, in an interview with the magazine Lire. He also called the Koran \"mediocre\" and said he considers the scriptures of Christianity, Judaism, and Islam all to be \"texts of hate.\" His statements, not surprisingly, infuriated Muslim organizations. Here's what is surprising: In September 2002, Houellebecq was brought before a criminal court for uttering those words. He faced up to a year in prison or a $51,000 fine.\n\n \n So there is a 1970's law against \"hate speech\" that outlaws any speech deemed as such. \n \n http://en.wikipedia.org/wiki/Freedom_of_speech#France\n \n This says that one can criticize leaders all day long, but anything showing racist or religious hatred is not allowed. \n \n Also, there is no \"hate speech\" allowed against people because of their sexual orientation.\n \n\n The right to criticize politicians and the government is cherished and taken for granted by the French population. France has a tradition of political lampooning and satirical writing. Examples of this tendency include the frequent depiction in a popular television program of president Jacques Chirac as a beer-guzzling incompetent, thief and liar.\n \n French law prohibits public speech or writings that incite to racial or religious hatred, as well as those that deny the Jewish Holocaust. Proponents and supporters of these measures allege that they fight against the spread of neo-nazi ideas and a climate of racism; opponents contend that these laws stifle the freedom of speech in France, and make it difficult to engage in the criticism of the practices of some religions, or in the discussion of immigration. The only major party opposed to those laws are the National Front whose leader, Jean-Marie Le Pen, has been a target of them.\n \n In December 2004, a controversial addition was made to the law, criminalizing the prohibition to hatred or violence against people because of their sexual orientation.\n\n \n I guess Rev. Fred Phelps would be in jail in France.\n \n So what do you think?\n \n Should so-called \"hate speech\" be outlawed in general or is France devoid of true Liberté?\n \n \n Oh, my opinion is that people should be able to hate whoever they want, and spout hate speech all they want. If this incites violence it wasn't their fault since they weren't directly inciting it and directly inciting violence is not even protected in the US, the country with by far the most freedom, of course. If the pope or muslims or homosexuals are offended then that's their problem. They need to get over it and maybe spout their own hate speech if they want to stoop that low.", 
   {
    "post_info": {
     "post_title": "No free speech in France?"
    }
   }, 
   null, 
   null, 
   1115854740.0
  ], 
  [
   121721, 
   null, 
   "Dzeron", 
   "Hate speech laws are total bullschit. If some idiot is ranting about how he hates some culture, let everyone see what an idiot he is. Arresting him for it is the worst thing one can do. It makes it seem as if the idiot's rants have legitimacy and the state is out to cover it up. It turns the hateful lunatic into a martyr.\n \n The laws in France are particularly stifling because they make it difficult to criticize religion.", 
   {}, 
   120980, 
   null, 
   1115936700.0
  ], 
  [
   121740, 
   null, 
   "Truthsayer", 
   "Watch as it spreads across the United States. First we will be given free speech zones as compromise...then the zones will taken away. We can thank our rightwing's agenda for this.", 
   {}, 
   121721, 
   null, 
   1115939100.0
  ], 
  [
   121778, 
   null, 
   "JPSartre12", 
   "Watch as it spreads across the United States. First we will be given free speech zones as compromise...then the zones will taken away. We can thank our rightwing's agenda for this.\n\n \n Too late. Have you stepped foot on a politically correct college campus recently?\n The former bastions of free speech are worse than almost anywhere else in the US now. emoticon_mad", 
   {}, 
   121740, 
   null, 
   1115944620.0
  ], 
  [
   123162, 
   null, 
   "Wez", 
   "If this incites violence it wasn't their fault since they weren't directly inciting it and directly inciting violence is not even protected in the US, the country with by far the most freedom, of course. \n\n Before you get too comfy with your moral high-ground (assuming the above isn't sarcasm), do you remember a certain nipple on TV that angered people (I thought this one was particularly amusing, what with the US having the world's largest porn industry:)) What about being a communist party member? Or how about being gay in Texas? What if you started burning American flags?\n \n France is not alone in this issue.\n \n Personally I'm undecided. On the one hand giving racist XXXXXX publicity and a fake sense of legitimacy is a very bad thing, but on the other I don't really want to see some guy outside a Church calling its clergy a bunch of child-raping paedos.\n \n -Wez", 
   {}, 
   120980, 
   null, 
   1116185880.0
  ], 
  [
   123903, 
   null, 
   "zachvac", 
   "Before you get too comfy with your moral high-ground (assuming the above isn't sarcasm), do you remember a certain nipple on TV that angered people (I thought this one was particularly amusing, what with the US having the world's largest porn industry:)) What about being a communist party member? Or how about being gay in Texas? What if you started burning American flags?\n \n France is not alone in this issue.\n \n Personally I'm undecided. On the one hand giving racist XXXXXX publicity and a fake sense of legitimacy is a very bad thing, but on the other I don't really want to see some guy outside a Church calling its clergy a bunch of child-raping paedos.\n \n -Wez\n\n \n I agree. We should give all free speech unless it actually endangers someone. Obviously I can't use my free speech to plan a murder. I don't see the purpose of such cencorship, even on this forum any curse word comes up starred. What's the point? But that's different from the free speech being discussed. We are discussing the statement of my opinion. Your last statement would actually be slander under current US laws because it is clearly false and it hurts the person's image. If I want to call him a jerk or idiot for something he did or just in general, I can do that. We should be able to:\n \n 1. burn the flag\n 2. Sit for the anthem, the pledge, or any other patriotic speech or event\n 3. Curse anywhere we dammn well feel like it\n 4. promote any opinion by saying anything as long as it is not a lie\n \n \n Obviously the main problem is the cursing. They are just words which do not hurt anybody.", 
   {}, 
   123162, 
   null, 
   1116302220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  No free speech in France?", 
  "url": "http://www.4forums.com/political/entertainment-debates/5172-no-free-speech-france.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 5172, 
  "discussion_files": [
   [
    "32179.html", 
    "http://www.4forums.com/political/entertainment-debates/5172-no-free-speech-france-print.html"
   ]
  ], 
  "identifier": 5172
 }
]