[
 [
  [
   121038, 
   null, 
   "gnojek", 
   "This in a piece in the \"Perspectives\" section of Science.\n It's obviously just an essay and not a research article.\n \n http://www.sciencemag.org/cgi/content/full/308/5718/59\n \n \nGEOLOGY:\n The Calibration of Ediacaran Time\n Alan J. Kaufman*\n \n More than a century ago, the last great geological period was formally ratified by an international committee. This was the final rocky step in the subdivision of deep time based on the evolutionary progression of animal fossils. However, recent years have seen the identification of an older and tumultuous new interval, the Ediacaran Period, during which Earth's earliest soft-bodied organisms emerged in the oceans. This interval was recently ratified (1), underscoring advances in the absolute dating (2-6) and worldwide correlation of geological strata that were deposited in isolated basins before true animals exploded onto the scene in the succeeding Cambrian Period.\n \n On page 95 of this issue, Condon et al. (7) present precise age constraints for the Ediacaran Period. The authors have analyzed volcanic dust in two key depositional layers in the Doushantuo Formation of southern China. Their radiometric dates provide important insights into the rates of geological and evolutionary processes. The first layer, with an age of about 635 million years, is at the base of the new interval, whereas the second, at about 550 million years, may constrain the age of an environmental disaster (8-10) that is closely associated with the rapid diversification of the Ediacara biota (see the figure) that lend their name to the new Period.\n \n http://www.sciencemag.org/content/vol308/issue5718/images/medium/59-1-med.gif\n \n Figure 1 Early animals? A pile of three-dimensionally preserved casts of the soft-bodied Ediacaran organism Ernietta from ~545 million-year-old sediments in the Nama Group of southern Namibia. The scale bar corresponds to 15 cm.\n \n \n Convention previously focused on the evolutionary first appearance of a specific fossil or assemblage to define the beginning of new geological periods. In contrast, the beginning of the Ediacaran period is defined by the base of a marine carbonate rock, which formed in southern Australia in the aftermath of a distinctive and potentially global ice age (11, 12). Equivalent glacial rocks occur immediately beneath similar carbonates at the base of the Doushantuo Formation.\n \n In the area studied by Condon et al., the new ages constrain the Doushantuo Formation, which represents most of the Ediacaran Period, to some 85 million years--a remarkably long interval for only about 100 m of rock. This observation begs the question: How much time may be missing in Ediacaran strata from southern China?\n \n In the absence of dates between the two radiometric tie points, one must consider two possibilities: Either the sediments accumulated continuously, albeit slowly (some two orders of magnitude more slowly than in similar environments of the same age), or there are breaks in time (hiatuses or unconformities) hidden within the poorly exposed layers. On the basis of limited physical data, Condon et al. suggest the presence of two such unconformities in their study area near the Yangtze Gorges. The duration of these stratigraphic breaks with respect to the environmental anomaly--reflecting a dramatic change in the cycling of carbon on Earth's surface--and subsequent biological innovations form the cornerstone of their conclusions, and deserve closer examination.\n \n Spectacular fossil animal embryos (13, 14) of great evolutionary importance are found at Weng'an (some 375 km to the southwest of the authors' study area), where the Doushantuo Formation accumulated closer to the shoreline and records only a single surface of unconformity. In such nearshore environments, oceanic sediments are often exposed above sea level, resulting in the removal of underlying sediments and hence the erasure of some fraction of geological time. Which of the two hiatal surfaces from the deeper-water sections at the Yangtze Gorges correlates to the single unconformity at Weng'an? The data are more equivocal than presented by Condon et al., and the choice carries important evolutionary consequences.\n \n At the Yangtze Gorges, the extraordinary carbon cycle anomaly recorded in marine carbonates near the top of the Doushanto Formation is truncated by the uppermost unconformity. Condon et al. suggest that there is little time missing across the surface, thereby preserving a causal relation between the environmental perturbation and the rapid diversification of Ediacara organisms and associated faunas around 550 million years ago. However, correlation of this surface and the intervening sediments back to Weng'an tells another story. At Weng'an, both the carbon cycle anomaly and the sediments typical of the uppermost Doushantuo Formation at the Yangtze Gorges are missing, implying a substantial hiatus.\n \n Comparison of broadly equivalent strata in southern Australia and the western United States suggests a stratigraphic architecture similar to that in southern China, where similar carbon cycle anomalies are truncated by unconformities (15). In the western United States, the post-anomaly unconformity removes a minimum of 130 m of section, more than the entire thickness of the Doushantuo Formation. These observations suggest that the unconformity separating the Ediacaran faunas and the carbon cycle anomaly in southern China may, in fact, hide a lot of time, thereby decoupling the environmental and biological events that the authors wish to connect. This is not meant to detract from the important radiometric calibration that Condon et al. provide, but rather to note that the stratigraphic relations between these dates, and therefore their connection to evolutionary events, are far from straightforward.\n \n According to Condon et al., the rapid diversification of complex multicellular organisms in Ediacaran oceans forced the carbon cycle anomaly seen worldwide, but this seems possible only if there is no real time missing across the upper Doushantuo unconformity. If this is not the case, then this interpretation may be placing the cart before the horse. Alternative models suggest that environmental changes may have driven evolutionary transformations. In particular, atmospheric oxygen--long believed to be an external forcing factor to evolution--appears to have built up rapidly during the Ediacaran Period, not because of a discrete biological event but as a result of the tectonic forces that lift and erode mountain ranges (16).\n \n Through precise radiometric clocks and clever stratigraphic connections, geoscientists can increasingly correlate Ediacaran sediments that are separated widely in space and time. These tools allow us to piece together a complex puzzle of unforgettable biological events against a background of repetitive climatic and environmental perturbations. However, even with exact dates, the cyclicity of these events and the specter of a fragmentary rock record add uncertainty to our picture of Ediacaran Earth history.\n \n References\n \n 1. A. H. Knoll et al., Science 305, [621] (2004).\n 2. J. P. Grotzinger et al., Science 270, [598] (1995).\n 3. M. W. Martin et al., Science 288, [841] (2000).\n 4. J. E. Amthor et al., Geology 31, 431 (2003) [Abstract].\n 5. K.-H. Hoffmann et al., Geology 32, 817 (2004) [Abstract].\n 6. C. R. Zhou et al., Geology 32, 437 (2004) [Abstract].\n 7. D. Condon et al., Science 308, 95 (2005); published online 24 February 2005 (10.1126/science.1107765).\n 8. S. J. Burns, A. Matter, Eclogae Geol. Helv. 86, 595 (1993).\n 9. C. R. Calver, Precambrian Res. 100, 121 (2000) [Abstract].\n 10. F. A. Corsetti, A. J. Kaufman, Geol. Soc. Am. Bull. 115, 916 (2003) [Abstract].\n 11. P. F. Hoffman et al., Science 281, [1342] (1998).\n 12. P. F. Hoffman, D. P. Schrag, Terra Nova 14, 129 (2002) [Abstract].\n 13. S. H. Xiao et al., Nature 391, 553 (1998) [Abstract].\n 14. J. Y. Chen et al., Science 305, [218] (2004).\n 15. N. Christie-Blick et al., Am. J. Sci. 290A, 295 (1990).\n 16. A. J. Kaufman, F. A. Corsetti, EOS Trans. AGU 85, Fall Meet. Suppl. Abstr. PP41A-0575 (2004). \n\n \n \n So, any creationist want to tell us why these people are so wrong?\n Is the international committee a sign of a conspiracy?\n Are they trying to hide the fact that radiometric dating techniques don't work?\n Is there really a strong causal relationship between the environmental changes recorded in the rocks and the fossils found there?\n Is there really \"missing time\" or was the 85 million years of the Ediacaran Period really contained in 100m of rock?\n Is atmospheric oxygen a result of tectonic forces?\n Well, what part of this article do creationist object to?", 
   {
    "post_info": {
     "attachments": 1, 
     "post_title": "What is the creationist's opinion of this article?"
    }
   }, 
   null, 
   null, 
   1115860680.0
  ], 
  [
   121056, 
   null, 
   "Redratio1", 
   "Given that the Earth is only 6000 years old, the laws of physics must have been different back then.\n \n :p", 
   {}, 
   121038, 
   null, 
   1115861220.0
  ], 
  [
   121837, 
   null, 
   "Box of Fox", 
   "Explain what you mean by the laws of physics. :)", 
   {
    "post_info": {
     "post_title": "Explain"
    }
   }, 
   121056, 
   null, 
   1115953320.0
  ], 
  [
   121840, 
   null, 
   "pandion", 
   "Explain what you mean by the laws of physics. :)\nThe laws of physics are short, descriptive statements that describe the operation of certain natural phenomena that always seem to occur in the same way. Many times the \"laws of physics\" have been amended by further information, causing the law to be restated.\n \n Actually, I think he meant the way that we have observed the universe and all of nature to operate.", 
   {}, 
   121837, 
   null, 
   1115954100.0
  ], 
  [
   121849, 
   null, 
   "peddler8111", 
   "\" More than a century ago, the last great geological period was formally ratified by an international committee\"\n Most Scientist agree? Trying to recall where I heard that before.\n Why experiment and observe when a simple vote will do?\n \n \"Through precise radiometric clocks and clever stratigraphic connections\"\n \n If you have precise radiometric {clocks} why would you need {clever} stratigraphic connections? \n I want one of them radiometric clocks! ROFL!\n This is best described by the phrase. If you can't dazzle 'em with brilliance , baffle them with bs.\n They used to say we date the rocks by the fossils and the fossils by the rocks but this sounds better. At least to you it seems.\n \n This will go down as one more of the endless chain of missing links that are still missing.\n \n There are numreous problems with this latest chapter in Darwin's Fairy Tales for growups series.\n \n First of all any idiot who has hung out on the beach knows jellyfish [and similiar creatures] are not real prone to fossilization in the first place. Leave one on the beach for a couple hours and observe, I mean vote, on what happens to it.\n This to an intelligent person would make it very plain the fossils had to form during some sort os watery catastrophic event.\n \n Then the real killer is that a full-fledged vertebrate animal was found among them.\n \n This is just more sensationalism. It reminds me of what happened when they found the 70ma old extinct coelacanth alive.[I was not alive then for the sa 's here] What was once a \"clever stratigraphic connection\" that dated rocks and proved lobe-finned fish walked out of the sea and became amphibians was no longer extinct.\n Was this proof of a fallacy in Darwins Fairy Tale? Of course not it proved some lobe-finned fish became amphibians and some did not.\n \n Long ago and far far away.", 
   {}, 
   121837, 
   null, 
   1115956260.0
  ], 
  [
   121993, 
   null, 
   "Mucusaur", 
   "So what's your alternative theory, peddler? \n \n You do have one, right?", 
   {}, 
   121849, 
   null, 
   1115991420.0
  ], 
  [
   122013, 
   null, 
   "peddler8111", 
   "So what's your alternative theory, peddler? \n \n You do have one, right?\n\n First of all why would you want to know if I have an alternative theory to one that is known to be false ? Are you found of false theories?\n A true theory would be a replacement not an alternative.\n The Wrong Answer Will Always Be The Wrong Answer! \n \n If evolution was true there would be overwhelming , uncontestable evidence, there is no uncontestable evidence. Little that is any more than pure imagination.\n \n Theories start out as hypothesis and are then subject to experimentation and observation. When they fail they are discarded. For instance spontaneous generation was disproved by Pasteur and discarded as a theory.\n \n Evolution which is not a theory ,although it is called one ,has been falsified nine ways to Sunday. Two of Darwin's own falsifications have come to pass and ignored. The Galopagos Finches have proven to interbreed which destoys a great deal of the so called basis of his theory. \"Extinct\" animals and plants are found alive and ignored as evidence against evolution. Theories are made to be challenged but evidence against evolution is suppressed.\n \n \n Evolutionist had to revive spontaneous generation although it is scientifically impossible because without it atheism is impossible. The atheist must have a story no matter how bizzare to justify his faith . Science suffers because of this.\n \n My theory is that this planet is exactly what Einstein said it was , a place designed by a Supreme Being to be inhabited by people.\n The evidence is creation itself. If there is a creation there must be a Creator. \n Nothing has ever been observed to self assemble and there is no known process that could accomplish that.\n Animals and plants just like the ones alive today have always existed. Many have gone extinct but death is not evidence of evolution.\n Human beings are incapable of creating a grain of sand from nothing.\n There are grains of sand so there is an intelligence greator than ours that did.\n The perfect balance seen in the anthropic principle tells of a Creator.\n The unbelievable complexity of the human body makes evolution impossible.\n DNA can not exist without proteins. Proteins are coded by the information in the DNA molecule. They had to come into being simultaneously.\n Pre-biotic natural selection is impossible , there is no process to affect the evolution of DNA outside of a living organism.\n \n To look at a building is to have absolute empirical proof there was a builder.\n To look at creation and say there was no Creator is to enter an intellectually free zone.", 
   {}, 
   121993, 
   null, 
   1115996580.0
  ], 
  [
   122091, 
   null, 
   "Fishbulb", 
   "First of all why would you want to know if I have an alternative theory to one that is known to be false ? Are you found of false theories?\n A true theory would be a replacement not an alternative.\n The Wrong Answer Will Always Be The Wrong Answer! \n\n You still haven't convinced anyone that evolution is the wrong answer.\n \n \nIf evolution was true there would be overwhelming , uncontestable evidence, there is no uncontestable evidence. Little that is any more than pure imagination.\n\n \n There is uncontestable evidence, you just keep failing to acknowledge it.\n \n \nTheories start out as hypothesis and are then subject to experimentation and observation. When they fail they are discarded. For instance spontaneous generation was disproved by Pasteur and discarded as a theory.\n \n Evolution which is not a theory ,although it is called one ,has been falsified nine ways to Sunday. Two of Darwin's own falsifications have come to pass and ignored. The Galopagos Finches have proven to interbreed which destoys a great deal of the so called basis of his theory. \"Extinct\" animals and plants are found alive and ignored as evidence against evolution. Theories are made to be challenged but evidence against evolution is suppressed.\n\n Right. The last 150 years of biology have been a giant conspiracy. emoticon_rolleyes \n \n \n \nEvolutionist had to revive spontaneous generation although it is scientifically impossible because without it atheism is impossible. The atheist must have a story no matter how bizzare to justify his faith . Science suffers because of this.\n\n Nobody's revived spontaneous generation. This has been explained to you before.\n \n \nMy theory is that this planet is exactly what Einstein said it was , a place designed by a Supreme Being to be inhabited by people.\n The evidence is creation itself. If there is a creation there must be a Creator.\n\n Now who's using circular logic? \n \nNothing has ever been observed to self assemble and there is no known process that could accomplish that.\n\n Please read:\n Self Assembly Systems. Lots of things can be observed to self assemble.\n \nAnimals and plants just like the ones alive today have always existed. Many have gone extinct but death is not evidence of evolution.\n Human beings are incapable of creating a grain of sand from nothing.\n There are grains of sand so there is an intelligence greator than ours that did.\n The perfect balance seen in the anthropic principle tells of a Creator.\n The unbelievable complexity of the human body makes evolution impossible.\n DNA can not exist without proteins. Proteins are coded by the information in the DNA molecule. They had to come into being simultaneously.\n Pre-biotic natural selection is impossible , there is no process to affect the evolution of DNA outside of a living organism.\n\n Do you have any evidence that all the species alive today were alive 100 million years ago? How would so many temperate species survive at a time when the earth was much warmer?\n \n \nTo look at a building is to have absolute empirical proof there was a builder.\n To look at creation and say there was no Creator is to enter an intellectually free zone.\n\n Okay, let me see if I can figure our your logic. You claim:\n Creation is the evidence for a creator.\n Since there must be a creator, creation cannot possibly be falsified.\n Therefore, evolution is untrue.\n BS\n \n One last question for you, peddler. If there is a significant catastrophic event (such as a meteor strike) that alters the environment, how does a population continue to survive?", 
   {}, 
   122013, 
   null, 
   1116005820.0
  ], 
  [
   122182, 
   null, 
   "Mucusaur", 
   " My theory is that this planet is exactly what Einstein said it was , a place designed by a Supreme Being to be inhabited by people.\n \n\n \n Regarding belief in God, Einstein said: \"I believe in Spinoza's God who reveals himself in the harmony of all being, not in a God who concerns himself with the fate and activities of men.\"\n \n http://www.einsteinyear.org/facts/timeline/document_view\n \n \nExtinct\" animals and plants are found alive and ignored as evidence against evolution\n\n I fail to see how this falsifies evolution.\n \n Of course your not even above the use of conspiracy theories\n \n \nTheories are made to be challenged but evidence against evolution is suppressed.\n \n \n Examples please? oh yes, they have been suppressed. The public effusions of biologists about wanting to understand the natural world must be bogus, they are clearly in league with the devil himself. Do you have any reason, any reason at all to assume there is a darkside conspiracy going on here?\n A few slashes of Occams cautionary razor removes creators, conspiracies and two faced \"evolutionists\" from the picture.", 
   {
    "unicode_changes_made": true
   }, 
   122013, 
   null, 
   1116010320.0
  ], 
  [
   122296, 
   null, 
   "gnojek", 
   "BTW - did anyone watch Lou Dobbs last night?\n He had on 3 guests discussing creationism/evolution.\n It was really dissapointing but what can 3 people argue about in 15 minutes?\n Anyway, hope you caught it.\n Oh also, Lou Dobbs implied that evolution requires faith.\n \n \n \n \n\" More than a century ago, the last great geological period was formally ratified by an international committee\"\n Most Scientist agree? Trying to recall where I heard that before.\n Why experiment and observe when a simple vote will do?\n\n I think they voted on a convention to be used by scientists.\n They didn't vote on the data, but they voted on what the name of the period in geologic time would be. \n I also suppose that they decided on which data was best at the time and what the time boundaries of the period were. \n It was sort of a collective peer review process, if you will.\n \n\n \"Through precise radiometric clocks and clever stratigraphic connections\"\n \n If you have precise radiometric {clocks} why would you need {clever} stratigraphic connections? \n I want one of them radiometric clocks! ROFL!\n This is best described by the phrase. If you can't dazzle 'em with brilliance , baffle them with bs.\n They used to say we date the rocks by the fossils and the fossils by the rocks but this sounds better. At least to you it seems.\n\n \n Any geologists want to help me out here?\n What they mean by this is that there are sediments in one place and sediments in another place. They can date them radiometrically to determine that they are both from the Edicarian period (even though they may be seperated by millions of years). They then verify that they are Edicarian by looking at the layering to determine if the two pieces were at one point connected, but are now seperated due to tectonics.\n I'm sure I'm not entirely correct about these methods.\n I think I'd better study up on some of these qeustions HERE.\n Maybe you should too.\n \n \nThis will go down as one more of the endless chain of missing links that are still missing.\n\n I guess I missed which missing link they talked about.\n Maybe you mean the \"missing link\" in the stratigraphic record?\n \n \n\n There are numreous problems with this latest chapter in Darwin's Fairy Tales for growups series.\n\n I don't know if I'd call one essay on someone else's work a chapter in any series.\n By the way there was another essay in the same article about genetics dealing with evolution. \n And in the previous one there was something about evolution. \n These are just magazine articles explaining research articles in lay terms.\n I wouldn't call them chapters in anything.\n \n\n First of all any idiot who has hung out on the beach knows jellyfish [and similiar creatures] are not real prone to fossilization in the first place. Leave one on the beach for a couple hours and observe, I mean vote, on what happens to it.\n This to an intelligent person would make it very plain the fossils had to form during some sort os watery catastrophic event.\n \n\n So all jellyfish die on the beach?\n Hardly.\n Let's use this same type of logic though.\n A jellyfish is pretty fragile, as you pointed out.\n Wouldn't a jellyfish that was very rapidly covered in sediment be broken into many pieces, if not ground to a paste?\n Wouldn't this entirely rule out the possibilty of preservation in this manner?\n \n \nThen the real killer is that a full-fledged vertebrate animal was found among them.\n\n I don't see in the article where they discuss this.\n Please eleborate.\n Also, speaking of vertebrates:\n http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/V/Vertebrates.html\n \nDuring their embryonic development, all chordates pass through a stage called the pharyngula [View] with these features:\n\n Click on \"View.\"\n Why the hell would fish, chicken, and human embryos look the same?\n \n \nThis is just more sensationalism. It reminds me of what happened when they found the 70ma old extinct coelacanth alive.[I was not alive then for the sa 's here] What was once a \"clever stratigraphic connection\" that dated rocks and proved lobe-finned fish walked out of the sea and became amphibians was no longer extinct.\n Was this proof of a fallacy in Darwins Fairy Tale? Of course not it proved some lobe-finned fish became amphibians and some did not.\n\n Well, at least you realize that.\n Just the way some apes became humans and some became chimps.", 
   {}, 
   121849, 
   null, 
   1116016380.0
  ], 
  [
   122323, 
   null, 
   "unkerpaulie", 
   "My theory is that this planet is exactly what Einstein said it was , a place designed by a Supreme Being to be inhabited by people.\n The evidence is creation itself. If there is a creation there must be a Creator. \n Nothing has ever been observed to self assemble and there is no known process that could accomplish that.\n Animals and plants just like the ones alive today have always existed. Many have gone extinct but death is not evidence of evolution.\n\n therefore we assume that God has been observed to assemble these things that have been assembled?\n \n \nHuman beings are incapable of creating a grain of sand from nothing.\n There are grains of sand so there is an intelligence greator than ours that did.\n\n this is some priceless logic here. your assumption is that grains of sand require an intelligent mind to initiate their existence. i suppose the fact that grains of sand are nothing more than chemical elements bonded together doesnt change your view. i suppose iron in moisture wouldnt rust with an intelligent mind initiating the rust, and i suppose creating every chemical bond by hand as well. so can chemical reactions occur without a Creator causing it?\n \nThe perfect balance seen in the anthropic principle tells of a Creator.\n The unbelievable complexity of the human body makes evolution impossible.\n DNA can not exist without proteins. Proteins are coded by the information in the DNA molecule. They had to come into being simultaneously.\n Pre-biotic natural selection is impossible , there is no process to affect the evolution of DNA outside of a living organism.\n\n again, and as always, whatever we dont understand must be without doubt the work of God. that is why thism thrives on ignorance. its why christians are rluctant to let their children go to college.\n \n \nTo look at a building is to have absolute empirical proof there was a builder.\n To look at creation and say there was no Creator is to enter an intellectually free zone.\n\n and to look at destruction is to have empirical proof of the existence of a destroyer.\n similarly, to look at a chemical reaction is to have proof that a molecular bonder exists\n things dont just occur on their own. there must be something greator that mankind that does these things that mankind cannot do. like cast lightening and cause earthquakes. it is empirical evidence. to think otherwise is absurd", 
   {}, 
   122013, 
   null, 
   1116019680.0
  ], 
  [
   122332, 
   null, 
   "peddler8111", 
   "You still haven't convinced anyone that evolution is the wrong answer.[/b]\n\n You can lead a horse to water but you can't make him eat the fish.\n I have convinced many people it was not true. They thought it was science , it is your religion so observation takes a back seat to imagination.\n \n \n\n There is uncontestable evidence, you just keep failing to acknowledge it.\nGive me an example of unconrested evidence.\n \n \n\n Right. The last 150 years of biology have been a giant conspiracy. emoticon_rolleyes \n \nBiology is what Pasteur started , not Darwin.\n \n \n\n Nobody's revived spontaneous generation. This has been explained to you before.\nIt has been denied before but it is the only possible senario for evolution to be true. If life just happened then it spontaneously generated. Give me an alternative.\n \n \n\n Now who's using circular logic? \nYou are , it's the only logic you possess. Is it circular logic to know if you see a building there l]Self Assembly Systems[/url]. Lots of things can be observed to self assemble.[/QUOTE]Where does Life come from?\n \n The origin of life or prebiotic evolution means the spontaneous generation of life in a 'primordial soup' containing small organic molecules in salt water. Such a process is generally believed not to be possible (or successful) in today's ecosystems, unless undertaken in controlled laboratory settings. The latter awaits experimental proof. In order to understand the spontaneous formation of life an appropriate definition of life must be at hand. Derived from an analysis of today's organisms life is usually defined at the cellular level. In this definition, the smallest or simplest forms of life are single cell organisms which include bacteria, archaea (halophiles and thermophiles; live in extreme environments), and protozoans (eukaryotic single celled microorganisms, e.g. baker's yeast, paramecium, or amoebae). All modern life forms share fundamental molecular mechanisms, most notably protein biosynthesis and the use of DNA and RNA for reproduction and energy metabolism. Based on these observations, theories on the origin of life attempt to find a mechanism explaining the formation of a primordial single cell organism from which all modern life originates. The primordial cell is thought to form itself through beneficial packaging of self-replicating units in lipid particles (liposomes or vesicles resembling modern cell membranes). The most pressing question is how closely modern organisms resemble a primordial cell. Evidence of prebiotic evolution is obtained through simulating and replicating such an event that happened about 3.5 billion years ago. Although biochemical evidence first obtained in the 1950s showed the spontaneous generation of amino acids in a replica of the 'primordial soup', most biologist now believe that amino acids which are the building blocks of proteins and peptides, today's essential tools in all life forms, were not important at this earliest stage and that proteins and enzymes were indeed preceded by RNA type molecules which still plays an essential role in modern metabolism including energy metabolism, enzymatic catalysis (e.g. protein biosynthesis), and processing and storage of genetic information. DNA, this modern molecular marvel and blueprint of life, may indeed have come into existence after the evolution of proteins as enzymes. \n \n This is an example of Darwin's disease , conjuctevitus. It may , we think,it could be, we believe, it's the bestest materialistic answer we can fabricate right now.\n \n It has all the intellecual depth of the question.\n What if Superman would have been on Germany's side during the war?\n \n\n \n \n Do you have any evidence that all the species alive today were alive 100 million years ago? How would so many temperate species survive at a time when the earth was much warmer?\n\n That's a stupid question since we all know there were many animals and plants that went extinct. Living organisms adapt to changing climates quite often, quite often they don't.\n \n \n\n Okay, let me see if I can figure our your logic. You claim:\n Creation is the evidence for a creator.\n Since there must be a creator, creation cannot possibly be falsified.\n Therefore, evolution is untrue.\n BS\n That is correct unless you can demonstrate matter creating intelligence.\n \n\n One last question for you, peddler. If there is a significant catastrophic event (such as a meteor strike) that alters the environment, how does a population continue to survive?\n\n Depends on how significant. A better question would be how could an event that has been deemed insufficient to wipe out species millions of years after it happened wipe out species millions of years before it did happen.\n Long ago and far far away.", 
   {}, 
   122091, 
   null, 
   1116020400.0
  ], 
  [
   122333, 
   null, 
   "gnojek", 
   "First of all why would you want to know if I have an alternative theory to one that is known to be false ? Are you found of false theories?\n A true theory would be a replacement not an alternative.\n The Wrong Answer Will Always Be The Wrong Answer! \n\n But no one will know it's wrong until they see the right answer.\n So, to you, what is the right answer?\n How can we verify that it is indeed right?\n \n \nIf evolution was true there would be overwhelming , uncontestable evidence, there is no uncontestable evidence. Little that is any more than pure imagination.\n\n Anything is contestable.\n So, are you saying that if Christianity were true it couldn't be contested?\n Well, it's contested all the time.\n It must be totally false.\n \n\n Theories start out as hypothesis and are then subject to experimentation and observation. When they fail they are discarded. For instance spontaneous generation was disproved by Pasteur and discarded as a theory.\n\n Right.\n And they said you were dumb.\n \n Pasteur showed that within a short period of time, organic material will not spring forth life. That hypothesis was discarded.\n \n Pasteur did in no way demonstrate the impossibility of organic material eventually organizing and replicating given no competetion over millions of years. That hypothesis has not been discarded.\n \n\n Evolution which is not a theory ,although it is called one ,has been falsified nine ways to Sunday. Two of Darwin's own falsifications have come to pass and ignored. The Galopagos Finches have proven to interbreed which destoys a great deal of the so called basis of his theory. \"Extinct\" animals and plants are found alive and ignored as evidence against evolution. Theories are made to be challenged but evidence against evolution is suppressed.\n\n If the evidence was supressed then how do you know about it?\n What evidence are you talking about being suppressed?\n Please elaborate on how the entire theory of evolution has been falsified.\n There are various hypotheses and theories within the evolutionary framework that have been shown to be false. This does not falsify the fact that species change over time.\n \n Yeah, and cats in what we call 2 species interbreed. Dogs too.\n There are all kinds of \"hybrids\" and these are really only possible because of our definition of species. The whole concept of a species is flawed anyway. But it's damned usefull when it comes to keeping track and categorizing stuff.\n So the fact that 2 finch species interbreed just means that they haven't fully speciated. Under the creationist framework they shouldn't be able to breed at all. They would be separate kinds.\n \n \nEvolutionist had to revive spontaneous generation although it is scientifically impossible because without it atheism is impossible. The atheist must have a story no matter how bizzare to justify his faith . Science suffers because of this.\n\n I honestly don't know what you are talking about here.\n How do you know that spontaneous generation (aka - abiogenesis) is never possible?\n What experiment have you or anyone done to demonstrate this as fact?\n Also, we have to watch what we call spontaneous generation.\n If life came from what we consider was previously not living, then this is the spontaneous generation of what we call life.\n But when people usually say \"spontaneous generation\" they mean within a short period of time on the Earth of today.\n \n \nMy theory is that this planet is exactly what Einstein said it was , a place designed by a Supreme Being to be inhabited by people.\n\n First off, that's a baseless opinion and not a theory.\n Second, Einstein said absolutely no such thing.\n I'm very confident that he accepted the Big Bang theory.\n At first he didn't, but then he did in a major way (remember his \"greatest blunder\"?)\n \n \nThe evidence is creation itself. If there is a creation there must be a Creator.\n\n And if there is a creator then there muct be a creator machine molding and baking creators in the great big creator oven. \n The evidence is the existence of a creator.\n Since it's so obvious that since a creator exists, something must have created the creator.\n It's so self-evident.\n \n \n \nNothing has ever been observed to self assemble and there is no known process that could accomplish that.\n\n Excuse me?\n Here you are totally and completely mistaken.\n Just google \"self assembly\" in quotes.\n \n Anyway, keeping it out of a chemistry and engineering context and in a biological context some simple questions arise.\n \n If there is no such thing as self-assembly how did you grow?\n Did God make you grow because he liked that you ate your veggies?\n Or did the veggies get broken down into bits that later self-assembled into a bigger you?\n \n But maybe the simlest example of self-assembly I can think of is water freezing into ice crystals. There is definitley a structure to the crystal due largley to hydrogen bonding. Every crystal of any sort has a crystal structure and is very ordered, that's what makes it a crystal. The water molecules assemble themselves according to this bonding. They go from wizzing around in a liquid (where they are also assembled but in chunks of a few molecules) to a regular pattern of orientation.\n \n \nAnimals and plants just like the ones alive today have always existed. Many have gone extinct but death is not evidence of evolution.\n\n The fact that they could never fit in a 450 foot wooden boat is evidence that that the flood story cannot be true (among many other things).\n \n \nHuman beings are incapable of creating a grain of sand from nothing.\n\n Uh huh. ok.\n \n \nThere are grains of sand so there is an intelligence greater than ours that did.\n\n So when you look at a bacterial flagellum, you say \"It's so complex it had to be designed\" but when you look at a grain of sand you say \"Humans aren't intellegent enough to make something that doesn't look designed, such as a grain of sand, so there must be something more intellegent that designed it.\"\n That really is truly poor logic, I'm afraid.\n \n You say the sculpture on Mt. Rushmore must be designed because it looked designed, but the sculpture-free back of Mt. Rushmore is also designed because it doesn't look designed, therefore it must have been a more intellegent designer than humans. Hmmmm.\n \n \nThe perfect balance seen in the anthropic principle tells of a Creator.\n\n Or a result of cosmological natural selection. ;)\n One hypothesis says that black holes in some way cause a rip in spacetime that allows a \"singularity\" to form in other dimensions. This gives rise to a \"big bang\" for another universe. In this way, there is selection pressure to form universes where black holes are formed. This happens to be the type of universe we live in. A universe that forms black holes has matter, a gravitational force that's just right, a charge on the electron/proton that's just right, that leads to long lived stars, which leads to all sorts of things like life, etc.\n \n http://www.arxiv.org/abs/hep-th/0407213\n http://www.arxiv.org/abs/hep-th/0407266\n http://www.math.columbia.edu/~woit/blog/archives/000063.html\n \n These aren't peer reviewed or anything. Just letters for the arXiv.\n \n \n \nThe unbelievable complexity of the human body makes evolution impossible.\n\n Why is the complexity unbelievable?\n I believe that it's complex.\n Maybe not as complex as an electric eel or a bat, but pretty complex.\n \n \nDNA can not exist without proteins. Proteins are coded by the information in the DNA molecule. They had to come into being simultaneously.\n\n Is this another baseless opinion?\n What experiment was done to verify that they appeared simultaneously?\n RNA can exist without proteins. \n It can spontaneously self-assemble on certain minerals. \n This has been demonstrated.\n You don't need pre-existing DNA or proteins to form oligopeptides, oiligonucleotides, certain sugars, etc. \n This has been demonstrated (Remember the Urey-Miller experiment?)\n These form spontaneously and do not require each other to form.\n \n \nPre-biotic natural selection is impossible , there is no process to affect the evolution of DNA outside of a living organism.\n\n And I suppose you know this because...?\n You really like to just proclaim your opinions to be fact.\n \n \nTo look at a building is to have absolute empirical proof there was a builder.\n\n Um, not really. That is, if you know what \"absolute emperical proof\" means.\n \n \nTo look at creation and say there was no Creator is to enter an intellectually free zone.\n\n Yes, of course, it all makes sense now.", 
   {}, 
   122013, 
   null, 
   1116020460.0
  ], 
  [
   122342, 
   null, 
   "gnojek", 
   "\n The origin of life or prebiotic evolution means the spontaneous generation of life in a 'primordial soup' containing small organic molecules in salt water.\n\n Right.\n \nSuch a process is generally believed not to be possible (or successful) in today's ecosystems, unless undertaken in controlled laboratory settings.\n\n Right, because there is existing life that is refined to a point that it is WAY more efficient at using organic molecules as structural and metabolic components. The process of \"spontaneous generation\" is in competition with existing life and has no chance.\n \n \nThis is an example of Darwin's disease , conjuctevitus. It may , we think,it could be, we believe, it's the bestest materialistic answer we can fabricate right now.\n\n That's all science ever does.\n This is the best explanation we have.\n We suppose, it's likely. This explanation is more likely than that one.\n Darwin had nothing to do with this. This is how science is carried out.\n \n\n It has all the intellecual depth of the question.\n What if Superman would have been on Germany's side during the war?\n\n It's better than asking which side Yahweh was on during the Exodus.", 
   {}, 
   122332, 
   null, 
   1116021000.0
  ], 
  [
   122374, 
   null, 
   "peddler8111", 
   "Right.\n \n Right, because there is existing life that is refined to a point that it is WAY more efficient at using organic molecules as structural and metabolic components. The process of \"spontaneous generation\" is in competition with existing life and has no chance.\nThere are only 2 possibilities for the generation of life. Genesis or spontaneous generation[abiogenesis]. To deny that is denying evolution.\n \n\n \n That's all science ever does.\n This is the best explanation we have.\n We suppose, it's likely. This explanation is more likely than that one.\n Darwin had nothing to do with this. This is how science is carried out.\nScience means to know not to imagine. \n \n\n It's better than asking which side Yahweh was on during the Exodus.\n\n We know the answer to that question so it is not hypothetical.", 
   {}, 
   122342, 
   null, 
   1116024420.0
  ], 
  [
   122400, 
   null, 
   "peddler8111", 
   "But no one will know it's wrong until they see the right answer.\n So, to you, what is the right answer?\n How can we verify that it is indeed right?\n\n That is a fallacy that any idea no matter how absurd and totally false it is has to be accepted because the only alternative is distasteful to you.\n The only conclusion based on the evidence is that the life on this planet was created to exist on this planet. There is no evidence of anything creating itself. How would it know to stop?\n \n\n \n Anything is contestable.\n So, are you saying that if Christianity were true it couldn't be contested?\n Well, it's contested all the time.\n It must be totally false.\n\n If there was empirical evidence of evolution it would so overwhelming it could not be challenged. Evolutionist will not debate Creationist because they cannot support there beliefs. It is a fairy tale.\n \n \n\n Pasteur showed that within a short period of time, organic material will not spring forth life. That hypothesis was discarded.\nSo by adding the god of time , the almighty IT to the equation the impossible becomes possible?\n Long ago and far far away it is the only proof you have. It must have happened because I don't believe in God. That is not science it is stupidity.\n \n\n Pasteur did in no way demonstrate the impossibility of organic material eventually organizing and replicating given no competetion over millions of years. That hypothesis has not been discarded.\nAgain you are invoking IT and saying IT must be true because IT happened so slowly there is no evidence for IT. IT DID IT!\n The hypothesis was discarded by science but atheism hangs it's existence on it. So they added millions of years they made up out of thin air to explain how the impossible is possible.\n Long ago and far far away ! It is all you have to base your worldview on.\n \n\n If the evidence was supressed then how do you know about it?\n What evidence are you talking about being suppressed?\n Please elaborate on how the entire theory of evolution has been falsified.\n There are various hypotheses and theories within the evolutionary framework that have been shown to be false. This does not falsify the fact that species change over time.\nThis is just more atheistic babble. Animals change over time so given enough time rocks will evolve into all living things . People use to believe that machines could just happen as well , it is actually more likely that they would.\n \n\n Yeah, and cats in what we call 2 species interbreed. Dogs too.\n There are all kinds of \"hybrids\" and these are really only possible because of our definition of species. The whole concept of a species is flawed anyway. But it's damned usefull when it comes to keeping track and categorizing stuff.\n So the fact that 2 finch species interbreed just means that they haven't fully speciated. Under the creationist framework they shouldn't be able to breed at all. They would be separate kinds.\n\n You keep saying I am unaware of how evolution is suppose to happen and you have no clue whatsoever how creationist think. Finches are birds , birds are a kind of animal. They may have all had a common ancestor, it would have been a bird.\n \n\n \n I honestly don't know what you are talking about here.\n How do you know that spontaneous generation (aka - abiogenesis) is never possible?\nThe same way I know that horses cannot fly. It has never been observed and there is no known way it could happen.\n As the great evolutionist Dr. Crick said:\n \n \"An honest man, armed with all the knowledge available to us now, could only state that in some sense, the origin life appears at the moment to be almost a miracle, so many are the conditions which would have had to have been satisfied to get it going.\" (Crick, Francis H.C. [Co- discoverer of the structure of DNA, Nobel laureate 1962, Professor at the Salk Institute, USA], \"Life Itself: Its Origin and Nature,\" Simon & Schuster: New York NY, 1981, p.88).\n \n \n \n What experiment have you or anyone done to demonstrate this as fact?\n Also, we have to watch what we call spontaneous generation.\n\n Watch ? Watch what ? Are you awake? All you can do is imagine it. It does not exist and therefore cannot be watched.\n [/QUOTE]\n If life came from what we consider was previously not living, then this is the spontaneous generation of what we call life.\n But when people usually say \"spontaneous generation\" they mean within a short period of time on the Earth of today.[/QUOTE]That is impossible , it is absurd. There is life and there is death. There is no in between. It starts instantaneouly and it ends instantaneously.\n \n \n \n\n First off, that's a baseless opinion and not a theory.\n Second, Einstein said absolutely no such thing.\n I'm very confident that he accepted the Big Bang theory.\n At first he didn't, but then he did in a major way (remember his \"greatest blunder\"?)\nI didn't say he was a Christian I said he said the world had to be created for people like us to live on it. To think otherwise is to believe in fairy tales. Order is proof of design. The order of the Universe down to the balance in sub-atomic particles is without question a product of intelligent design. To think it was a random event is to hear an echo when you think.\n \n \n\n And if there is a creator then there muct be a creator machine molding and baking creators in the great big creator oven. \n The evidence is the existence of a creator.\n Since it's so obvious that since a creator exists, something must have created the creator.\n It's so self-evident.\nWell you can believe that as there is no way to scientifically prove there is only one God and who he is. Of course it seems a bit of a stretch to believe something as perfect as the Universe and the anthropic principle was designed by commitee but again that is your right .\n \n \n\n If there is no such thing as self-assembly how did you grow?\n Did God make you grow because he liked that you ate your veggies?\n Or did the veggies get broken down into bits that later self-assembled into a bigger you?\nAre you just trying to prove the depth of your ignorance as you seem convinced I am unaware of it. \n I did not start out as some chemicals that created themselves . It is a stupid analogy.\n \n\n But maybe the simlest example of self-assembly I can think of is water freezing into ice crystals. There is definitley a structure to the crystal due largley to hydrogen bonding. Every crystal of any sort has a crystal structure and is very ordered, that's what makes it a crystal. The water molecules assemble themselves according to this bonding. They go from wizzing around in a liquid (where they are also assembled but in chunks of a few molecules) to a regular pattern of orientation.\n\n You described a liquid turning into a solid not a rock turning into a human being. Please use your brain . Is the ice alive , is there an echo when you think?\n \n\n The fact that they could never fit in a 450 foot wooden boat is evidence that that the flood story cannot be true (among many other things).\n\n It is obvious you are clueless what a kind is so how would you presume to know?\n \n\n So when you look at a bacterial flagellum, you say \"It's so complex it had to be designed\" but when you look at a grain of sand you say \"Humans aren't intellegent enough to make something that doesn't look designed, such as a grain of sand, so there must be something more intellegent that designed it.\"\n That really is truly poor logic, I'm afraid.\nThat begs the question , how would you know?\n \n\n You say the sculpture on Mt. Rushmore must be designed because it looked designed, but the sculpture-free back of Mt. Rushmore is also designed because it doesn't look designed, therefore it must have been a more intellegent designer than humans. Hmmmm.\nAre you really as stupid as you sound? \n \n\n \n Or a result of cosmological natural selection. ;)\n One hypothesis says that black holes in some way cause a rip in spacetime that allows a \"singularity\" to form in other dimensions. This gives rise to a \"big bang\" for another universe. In this way, there is selection pressure to form universes where black holes are formed. This happens to be the type of universe we live in. A universe that forms black holes has matter, a gravitational force that's just right, a charge on the electron/proton that's just right, that leads to long lived stars, which leads to all sorts of things like life, etc.\nI think you are as stupid as you sound after that remark. Cosmological natural selection? Did you make that up yourself ? Do certain stars life to the age of sexual maturity and reproduce? ROFL!\n \n\n http://www.arxiv.org/abs/hep-th/0407213\n http://www.arxiv.org/abs/hep-th/0407266\n [url]http://www.math.columbia.edu/~woit/blog/archives/000063.html[/url\n \n These aren't peer reviewed or anything. Just letters for the arXiv. \n\n \"They do not actually logically depend on any assumption about life or intelligence, but instead depend only on arguments from observed facts \"\n \n And this is your argument. Assumption is superior to observation? \n \n \n\n \n Why is the complexity unbelievable?\n I believe that it's complex.\n Maybe not as complex as an electric eel or a bat, but pretty complex.\nA single cell is more complicated than the space shuttle and there are trillions of them in the human body. \n \n\n \n Is this another baseless opinion?\n What experiment was done to verify that they appeared simultaneously?\n RNA can exist without proteins. \n It can spontaneously self-assemble on certain minerals. \n This has been demonstrated.\n You don't need pre-existing DNA or proteins to form oligopeptides, oiligonucleotides, certain sugars, etc. \n This has been demonstrated (Remember the Urey-Miller experiment?)\n These form spontaneously and do not require each other to form.\n \nThe Miller Rey experiment failed . It produced racemetric amino acids , useless . The conditions could never exist outside the lab. It is stupid to cite that as proof.\n \n\n Um, not really. That is, if you know what \"absolute emperical proof\" means.\n \n \n Yes, of course, it all makes sense now.\n\n Relying on or derived from observation or experiment: empirical results that supported the hypothesis. \n Verifiable or provable by means of observation or experiment: empirical laws. \n Guided by practical experience and not theory, especially in medicine. \n \n Unless you believe buildings self assemble.\n Do I hear an echo in here?", 
   {}, 
   122333, 
   null, 
   1116028440.0
  ], 
  [
   122408, 
   null, 
   "gnojek", 
   "There are only 2 possibilities for the generation of life. Genesis or spontaneous generation[abiogenesis]. To deny that is denying evolution.\n\n Sorry, but this is not a response to:\n \nbecause there is existing life that is refined to a point that it is WAY more efficient at using organic molecules as structural and metabolic components. The process of \"spontaneous generation\" is in competition with existing life and has no chance.\n\n You could have just ignored it.\n \n \n \nScience means to know not to imagine.\n\n Maybe the etymology of the word = knowledge, but in order to \"know\" you have to be able to imagine possibilities.\n So science involves loads of imagination.\n \n \nWe know to the answer to that question so it is not hypothetical.\n\n Brilliant!\n I also know why Superman fights for the American way and not the Nazi way.\n It's because his colors are red and blue and he is white.\n It's self-evident, we know it, and it's not hypothetical.", 
   {}, 
   122374, 
   null, 
   1116028920.0
  ], 
  [
   122426, 
   null, 
   "Mucusaur", 
   "[QUOTE]The only conclusion based on the evidence is that the life on this planet was created to exist on this planet. There is no evidence of anything creating itself. How would it know to stop?[QUOTE/]\n \n I've had 2 months of active posting here. In that time we have had Hunter, Ray martinez and peddler all active in the ID front\n \n In 2 months not a single testable hypotheses for creation put forward,no theory, not a single divine nut or bolt presented for us all to gaze at. Peddler, please show us the evidence which supports your outrageous claims.", 
   {}, 
   122408, 
   null, 
   1116031920.0
  ], 
  [
   122430, 
   null, 
   "Hunter", 
   "[QUOTE=Mucusaur]\nThe only conclusion based on the evidence is that the life on this planet was created to exist on this planet. There is no evidence of anything creating itself. How would it know to stop?[QUOTE/]\n \n I've had 2 months of active posting here. In that time we have had Hunter, Ray martinez and peddler all active in the ID front\n \n In 2 months not a single testable hypotheses for creation put forward,no theory, not a single divine nut or bolt presented for us all to gaze at. Peddler, please show us the evidence which supports your outrageous claims.\n\n \n After you die, God will explain all you need to know about his creation. Then you may be cast into the lake of fire to ponder your evolution theory. Evolution: ride a monkey into Hell.", 
   {}, 
   122426, 
   null, 
   1116032520.0
  ], 
  [
   122435, 
   null, 
   "gnojek", 
   "That is a fallacy that any idea no matter how absurd and totally false it is has to be accepted because the only alternative is distasteful to you.\n\n I didn't say that.\n I said the way science works.\n We use the best explanation until a better one comes along.\n You need to provide a better explanation since you think the other one is wrong.\n \n\n The only conclusion based on the evidence is that the life on this planet was created to exist on this planet. There is no evidence of anything creating itself. How would it know to stop?\n\n First, this is far from the only conclusion.\n Second, when did life stop? I wasn't aware of this happening.\n \n\n If there was empirical evidence of evolution it would so overwhelming it could not be challenged. Evolutionist will not debate Creationist because they cannot support there beliefs. It is a fairy tale.\n\n If you want to talk about fallacies then here's one.\n First, there is empirical evidence for evolution. \n I'm sure you've been shown examples many times.\n Second, I am debating you right now.\n Third, a fairy tale is usually found in a book with a happy ending for the heros.\n I think the Bible has a happy ending for Christians and Christ, the heroes.\n \n \nSo by adding the god of time , the almighty IT to the equation the impossible becomes possible?\n\n Time is a god? Hmm. Never heard that one before.\n But no, I merely said that the possible occured.\n \n \nLong ago and far far away it is the only proof you have.\n\n That's no proof.\n And I don't personally have any evidence in my desk drawer, but I do have references to scientific literature where various components nessecary for life spontaneously synthesize from simpler compounds.\n \n \n It must have happened because I don't believe in God. That is not science it is stupidity.\n\n You're right. It is stupidity.\n \n \nAgain you are invoking IT and saying IT must be true because IT happened so slowly there is no evidence for IT. IT DID IT!\n\n No, I only said what Pasteur did and what he didn't do.\n I never said that anything MUST be true.\n \n \nThe hypothesis was discarded by science but atheism hangs it's existence on it.\n\n A, as in ONE, hypothesis was discarded. \n It's a hypothesis that has nothing to do with the ultimate origins of life.\n \n \nSo they added millions of years they made up out of thin air to explain how the impossible is possible.\n\n Well, \"they\" being eighteenth century geologists, they realized that all the geological formations they saw could be explained by weathering, erosion and \n other natural processes, but 6000 years wasn't enough time. \n So they inferred that the 6000 year old earth hypothesis must be wrong.\n \n \nThis is just more atheistic babble. Animals change over time so given enough time rocks will evolve into all living things . People use to believe that machines could just happen as well , it is actually more likely that they would.\n\n Yeah, point me to the part of evolutionary theory that says all living things evolved from rocks?\n But actually, rocks played a huge role.\n \n \n \nYou keep saying I am unaware of how evolution is suppose to happen and you have no clue whatsoever how creationist think. Finches are birds , birds are a kind of animal. They may have all had a common ancestor, it would have been a bird.\n\n Ah! So this original species of bird evolved into more than one species?\n Nice. \n \n \nThe same way I know that horses cannot fly. It has never been observed and there is no known way it could happen.\n\n I've seen a horse fly into a swimming pool from a high platform.\n There's a way it could happen.\n \n \n \nAs the great evolutionist Dr. Crick said:\n \n \"An honest man, armed with all the knowledge available to us now, could only state that in some sense, the origin life appears at the moment to be almost a miracle, so many are the conditions which would have had to have been satisfied to get it going.\" (Crick, Francis H.C. [Co- discoverer of the structure of DNA, Nobel laureate 1962, Professor at the Salk Institute, USA], \"Life Itself: Its Origin and Nature,\" Simon & Schuster: New York NY, 1981, p.88).\n\n Yes, \"almost miracles\" happen to me all the time.\n I almost healed this guy with my hands, and I almost rose the dead.\n At the moment these things seemed to be almost miracles.\n \n \nWatch ? Watch what ? Are you awake? All you can do is imagine it. It does not exist and therefore cannot be watched.\n\n Watch, watch your usage of the phrase \"spontaneous generation.\"\n \n \nThat is impossible , it is absurd. There is life and there is death. There is no in between. It starts instantaneouly and it ends instantaneously.\n\n Is a virus alive?\n Instataneously?\n Life began when it began, whether it was instantaneous or not does not matter to the fact that each individual is only a part of the continuum all the way back to the \"beginning\" (which was likely not instantaneous).\n But the end of life doesn't happen instantaneously either.\n The machinery has to shut down gradually.\n If I cut off your head it would take a while for the brain to die.\n It would take longer for the body to die.\n It would lie there trying to breath through your severred windpipe.\n Then eventually it would gradually die as organs failed one by one.\n Then cells would have to die as their machinery winds down from lack of energy.\n \n Just cut your grass and tell me how long it takes the blades to turn brown.\n Instantaneous. Give me a break.\n \n \n \n\n I didn't say he was a Christian I said he said the world had to be created for people like us to live on it. To think otherwise is to believe in fairy tales. Order is proof of design. The order of the Universe down to the balance in sub-atomic particles is without question a product of intelligent design. To think it was a random event is to hear an echo when you think.\n\n \n And I didn't say that you said he was a Christian.\n I said that he never believed that the earth was created for people to live on it.\n If he believed the big bang, then he believed that the earth was formed as part of the evolution of the solar system from clouds of dust and gas.\n Order is merely proof of existence.\n But to you existence is proof of a creator, so...\n \n\n Well you can believe that as there is no way to scientifically prove there is only one God and who he is. Of course it seems a bit of a stretch to believe something as perfect as the Universe and the anthropic principle was designed by commitee but again that is your right .\n\n Universe is perfect? By whose standard?\n And if you're going to harp on the anthropic principle you should familiarize yourself with various fallacies associated with it.\n Start at: http://www.anthropic-principle.com/\n \n You'll find that it mostly comes from sampling selection effects.\n \n Read this:\n http://www.physics.sfsu.edu/~lwilliam/sota/anth/anthropic_principle_index.html\n \n Or maybe you did actually realize that the anthropic principle in no way implies a god or gods, or whether that god is the christian god, or that the earth was formed 6000 years ago. It RELIES on big bang theory and evolution.\n \n \n\n Are you just trying to prove the depth of your ignorance as you seem convinced I am unaware of it. \n I did not start out as some chemicals that created themselves . It is a stupid analogy.\n\n It's not even an analogy.\n You said that self assembly doesn't exist.\n But it happens all the time.\n Unless you think God personally puts every molecule into place everytime there is a chemical reaction, then how do we tell the difference?\n \n I merely pointed out the fact that when you eat something and break it down. What got broken down SELF ASSEMBLES into YOU.\n \n YOU ARE A COLLECTION OF SELF ASSEMBLED MOLECULES\n \n Unless, of course, God directs every molecule according to thermodynamic laws, then again what would be the difference to us as observers?\n \n \n \nYou described a liquid turning into a solid not a rock turning into a human being. Please use your brain . Is the ice alive , is there an echo when you think?\n\n I'm describing an obvious example of self assembly, which you said doesn't exist. You were woefully mistaken.\n \n\n It is obvious you are clueless what a kind is so how would you presume to know?\n\n Ok, what is a \"kind.\"\n It's a primeval species of animals that EVOLVES into many other species, right?\n How could I be so dumb as to not see that creationism is actually evolutionism in fast forward?\n \n\n That begs the question , how would you know?\n\n Are YOU asking ME how would I know if something was designed just by looking at it?\n Dude, I'm not the ID creationist here.\n I don't look at rocks and wonder how god designed them.\n \n\n Are you really as stupid as you sound? \n\n Yes, when I talk in ID terms it does sound pretty stupid.\n \n\n I think you are as stupid as you sound after that remark. Cosmological natural selection? Did you make that up yourself ? Do certain stars life to the age of sexual maturity and reproduce? ROFL!\n\n Sorry dude, I wish I had made it up, then I'd be a tenured physics professor.\n No, but universes reproduce through black holes.\n \n \n\"They do not actually logically depend on any assumption about life or intelligence, but instead depend only on arguments from observed facts \"\n \n And this is your argument. Assumption is superior to observation?\n\n I'm lost. Where did I say this?\n \n But observation is always superior to assumption.\n That's why I would never assume a god unless I observed it.\n I would never assume a heaven or hell for the same reasons.\n I wouldn't rely on assumptions that some book was scientifically accurate, especially when I observe so many errors in it.\n \n \n\n A single cell is more complicated than the space shuttle and there are trillions of them in the human body. \n\n So?\n \n \nThe Miller Rey experiment failed . It produced racemetric amino acids , useless . The conditions could never exist outside the lab. It is stupid to cite that as proof.\n\n The word is RACEMIC.\n But you're still learning.\n You said that DNA and proteins couldn't be formed without each other.\n All I said was oligonucleotides and oligopeptides do form without each other as had been demonstrated.\n There are various projects trying to figure out the origins of homochirality seen in life. \n It's more physics than chemistry though.\n Have a look at some stuff:\n http://ourworld.compuserve.com/homepages/rossuk/question.htm\n http://www.isis.rl.ac.uk/isis2002/reports/12809.PDF\n http://www.springerlink.com/media/NGDAVVRYVG2M6334GT7R/Contributions/V/0/Q/6/V0Q6V20716021070_html/fulltext.html\n \n [btw - a SQUID is a superconducting magnetometer, Raman spectroscopy analyzes certain molecular vibrations, DSC is Differential Scanning Calorimetry and is used to analyze phase changes in crystals, liquid crystals, and polymers, Just to show you that they aren't trying to dazzle anyone with BS]\n \n\n Relying on or derived from observation or experiment: empirical results that supported the hypothesis. \n\n And where does faith in God play into this?\n I suppose you have some \"absolute emprical proof\" that God exists and that the Bible is accurate, then using your own standards I must say that they are totally fairy tales.\n \n\n Verifiable or provable by means of observation or experiment: empirical laws. \n Guided by practical experience and not theory, especially in medicine.\n\n Ok, and so you are skeptical about the Bible then? \n \n \nUnless you believe buildings self assemble.\n Do I hear an echo in here?\n\n Huh?\n \n \n \n \n Huh?\n \n Yep, there it is.", 
   {}, 
   122400, 
   null, 
   1116033420.0
  ], 
  [
   122467, 
   null, 
   "Hunter", 
   "If man evolved from Apes, why do we still have Apes? emoticon_wow", 
   {}, 
   122435, 
   null, 
   1116045600.0
  ], 
  [
   122468, 
   null, 
   "Duo_Maxwell", 
   "If man evolved from Apes, why do we still have Apes? emoticon_wow\n\n \n because you're ignorant. We didn't evolve from apes. \n \n lol. thank you, you just proved that creationists know nothing about evolution.", 
   {}, 
   122467, 
   null, 
   1116046080.0
  ], 
  [
   122471, 
   null, 
   "peddler8111", 
   "Sorry, but this is not a response to:\n \n You could have just ignored it.\n\n Life does not evolve. Only a living organism can evolve through natural selection. Life happens and ends instantaneously . It is either through genesis or spontaneous generation [abiogenesis], there are no other possibilities.\n Either intelligence created matter or matter created intelligence.\n \n \n\n \n Maybe the etymology of the word = knowledge, but in order to \"know\" you have to be able to imagine possibilities.\n So science involves loads of imagination.\nThat is true ,but when the evidence does not support the hypothesis you start over.\n \n\n I also know why Superman fights for the American way and not the Nazi way.\n It's because his colors are red and blue and he is white.\n It's self-evident, we know it, and it's not hypothetical.\n\n Do you believe in wonderdog too.?", 
   {}, 
   122408, 
   null, 
   1116046380.0
  ], 
  [
   122479, 
   null, 
   "Hunter", 
   "because you're ignorant. We didn't evolve from apes. \n \n lol. thank you, you just proved that creationists know nothing about evolution.\n\n \n Okay then wise guy, I posted that as humour only. Here is another one, If man evolved from Apes, why do we still have liberals? emoticon_cool", 
   {}, 
   122468, 
   null, 
   1116048120.0
  ], 
  [
   122488, 
   null, 
   "peddler8111", 
   "I didn't say that.\n I said the way science works.\n We use the best explanation until a better one comes along.\n You need to provide a better explanation since you think the other one is wrong.\n \nThere is not another one an atheist can except .\n \n\n First, this is far from the only conclusion.\n Second, when did life stop? I wasn't aware of this happening.\nSpontaneous generation had to occur for evolution/atheism to be true. Why does it no longer occur? \n \n\n If you want to talk about fallacies then here's one.\n First, there is empirical evidence for evolution. \n I'm sure you've been shown examples many times.\n Second, I am debating you right now.\n Third, a fairy tale is usually found in a book with a happy ending for the heros.\n I think the Bible has a happy ending for Christians and Christ, the heroes.\n \nThere is no empirical proof for evolution all you have provided is what if senarios. This is not exactly a high level debate but technically you are correct. This should be on TV every week. The creationist are willing.\n The last is your personal choice.\n \n\n Time is a god? Hmm. Never heard that one before.\n But no, I merely said that the possible occured.\nTime and chance is the atheist god. The almighty IT. Without IT evolution cannot be . It is your god!\n \n \n\n \n That's no proof.\n And I don't personally have any evidence in my desk drawer, but I do have references to scientific literature where various components nessecary for life spontaneously synthesize from simpler compounds.\nYou have references to what if senarios.\n \n \n\n No, I only said what Pasteur did and what he didn't do.\n I never said that anything MUST be true.\nDo you believe truth exists?\n \n \n\n A, as in ONE, hypothesis was discarded. \n It's a hypothesis that has nothing to do with the ultimate origins of life.\n It is the only hypothesis. Life has to start instantly ! \n \n \n\n Well, \"they\" being eighteenth century geologists, they realized that all the geological formations they saw could be explained by weathering, erosion and \n other natural processes, but 6000 years wasn't enough time. \n So they inferred that the 6000 year old earth hypothesis must be wrong.\nDo you realize how completely gradualism has been debunked in the last 30 years? Lyell was a lawyer , not a geologist. You are living in a world of illusion.\n \n In fact, the catastrophists were much more empirically minded than Lyell. The geologic record does seem to record catastrophes: rocks are fractured and contorted; whole faunas are wiped out (see my column of October, 1974). To circumvent this literal appearance, Lyell imposed his imagination upon the evidence. The geologic record, he argued, is extremely imperfect and we must interpolate into it what we can reasonably infer but cannot see. The catastrophists were the hardnosed empiricists of their day, not the blinded theological apologists. Natural History February 1975 pp.16-17\n \n \n \n \"I regard the failure to find a clear 'vector of progress' in life's history as the most puzzling fact of the fossil record... We have sought to impose a pattern that we hoped to find on a world that does not really display it.\" \"Everybody knows the fossil record doesn't provide much evidence for gradualism; it is full of gaps and discontinuities. These gaps are all attributed to the notorious imperfection of the record, but this not an adequate explanation...This remarkable stasis [steadiness] has generally been ignored. If it doesn't agree with your ideas [talking to evolutionists] you don't talk about it.\" \"The evolutionary trees that adorn our textbooks have data only at the tips and nodes of their branches: the rest is inference, however reasonable, not the evidence of the fossils.\" \"Can a reasonable story of continuous change be constructed for all macroevolutionary events [i.e., hopeful monster theory]? My answer shall be no.\"\n Dr. Steven Jay Gould\n \n\n \n Yeah, point me to the part of evolutionary theory that says all living things evolved from rocks?\n But actually, rocks played a huge role.\n Where did the soup come from, it rained on a rock. \n \n \n\n \n Ah! So this original species of bird evolved into more than one species?\n Nice. \n That would be correct. There may have been more than one original kind. No one was there to record it. \n \n \n\n I've seen a horse fly into a swimming pool from a high platform.\n There's a way it could happen.\nFlying would be the other way around. I hope you don't inend to learn to fly , at least not in a heavier than air craft. you seem confused about gravity .\n [/QUOTE]\n \n Yes, \"almost miracles\" happen to me all the time.\n I almost healed this guy with my hands, and I almost rose the dead.\n At the moment these things seemed to be almost miracles.[/QUOTE] \n Frick said if one was honest, obviously not referring to you.\n \n \n\n Watch, watch your usage of the phrase \"spontaneous generation.\"\n\n Why I know what it means.\n \n\n Is a virus alive?\n Instataneously?\n Life began when it began, whether it was instantaneous or not does not matter to the fact that each individual is only a part of the continuum all the way back to the \"beginning\" (which was likely not instantaneous).\n \nOn what do you base that statement? Imagination?\n \n\n But the end of life doesn't happen instantaneously either.\nYes it is.\n \n\n The machinery has to shut down gradually.\nTry standing infront of th express train professor or try flying like your horse example off a 50 story building. \n\n If I cut off your head it would take a while for the brain to die.\n It would take longer for the body to die.\n It would lie there trying to breath through your severred windpipe.\n Then eventually it would gradually die as organs failed one by one.\n Then cells would have to die as their machinery winds down from lack of energy.\nFascinating . I guess it could take millions of years. emoticon_wow \n No professor when life ceases it ceases instantaneously. You are alive or your are dead. You may suffer for years but death is instantaneous.\n \n\n Just cut your grass and tell me how long it takes the blades to turn brown.\n Instantaneous. Give me a break.\nthat's deep!\n Can grass continue to live after brain death? emoticon_wow \n \n\n Or maybe you did actually realize that the anthropic principle in no way implies a god or gods, or whether that god is the christian god, or that the earth was formed 6000 years ago. It RELIES on big bang theory and evolution.\n \nThe big band caused the perfect balance of the nuclear forces etc.?\n You are funny.\n \n\n It's not even an analogy.\n You said that self assembly doesn't exist.\n But it happens all the time.\n Unless you think God personally puts every molecule into place everytime there is a chemical reaction, then how do we tell the difference?\nActually I do but that is beside the point. Dirt does not turn in to living things.\n Seeds grow into plants , humans come from other humans. You may have noticed this.\n \n\n I merely pointed out the fact that when you eat something and break it down. What got broken down SELF ASSEMBLES into YOU.\n\n \n I won't waste my time with this nonsense any longer. I am going to throw up and wait for the food I broke down to self assemble. Film at 11!", 
   {
    "unicode_changes_made": true
   }, 
   122435, 
   null, 
   1116050460.0
  ], 
  [
   122507, 
   null, 
   "Duo_Maxwell", 
   "Okay then wise guy, I posted that as humour only. Here is another one, If man evolved from Apes, why do we still have liberals? emoticon_cool\n\n \n No, if man evolved from mindless primative primates, why do we still have republicans?", 
   {}, 
   122479, 
   null, 
   1116053520.0
  ], 
  [
   122576, 
   null, 
   "Mucusaur", 
   "After you die, God will explain all you need to know about his creation. Then you may be cast into the lake of fire to ponder your evolution theory. Evolution: ride a monkey into Hell.\n\n \n The newly added seventh and a half level of hell no doubt, for the evolutionists and Liberals \n \n Hunter, you really are the height of just too muchery.", 
   {}, 
   122430, 
   null, 
   1116073680.0
  ], 
  [
   122886, 
   null, 
   "gnojek", 
   "There is not another one an atheist can except .\n Spontaneous generation had to occur for evolution/atheism to be true. Why does it no longer occur? \n\n \n Hmm, spontaneous generation has to be true for athiesm to be true.\n That's a new one.\n \n Didn't I already answer that?\n \n \n We can't observe something like that happening today for a few reasons.\n It surely takes too long and would be very gradual.\n Second, it happened during a period in earth's history where there was no competition from other life forms. \n That's why we don't see it around us on Earth today.\n Present life forms eat up the bulk of whatever organic material is lying around.\n \n \n \nThere is no empirical proof for evolution all you have provided is what if senarios. \n\n Well, there is most definitely tons of emprical proof for evolution.\n You are wrong about that one for sure.\n There is no and never will be emperical evidence for abiogensis or spontaneous generation. There will only be theory, like the big bang.\n We can't go back in time to see God speaking light, abiogenesis or any of it.\n \n But since we are looking for emperical evidence, why don't you show us some evidence that Jesus was a man who existed or that we all descended from incestuous relations between Adam & Eve's children.\n \n How bout some evidence that there was a global flood and that Noah survived it.\n \n \nThis is not exactly a high level debate but technically you are correct. This should be on TV every week. The creationist are willing.\n The last is your personal choice.\n\n What are you talking about?\n Is this even on point?\n \n \nTime and chance is the atheist god. The almighty IT. Without IT evolution cannot be . It is your god!\n\n Uh huh. ok.\n \n \n \nYou have references to what if senarios.\n\n Maybe so maybe not, but you have no references to anything you claim.\n \n\n Do you believe truth exists?\n\n What is it? Answer that and I'll tell you if it exists.\n \n\n It is the only hypothesis. Life has to start instantly !\n\n The one hypothesis was \"Life can spring from organic material in short amount of time in a jar on a desk.\" \n This was discarded and you are telling me that it is the only hypothesis and that it must be true?\n \n \n \nDo you realize how completely gradualism has been debunked in the last 30 years? Lyell was a lawyer , not a geologist. You are living in a world of illusion.\n \n\n Gradualism? You mean erosion and tectonics, thing like that?\n None of this has been debunked. They are cornerstones of Geology.\n \n \n \nIn fact, the catastrophists were much more empirically minded than Lyell. The geologic record does seem to record catastrophes: rocks are fractured and contorted; whole faunas are wiped out (see my column of October, 1974). To circumvent this literal appearance, Lyell imposed his imagination upon the evidence. The geologic record, he argued, is extremely imperfect and we must interpolate into it what we can reasonably infer but cannot see. The catastrophists were the hardnosed empiricists of their day, not the blinded theological apologists. Natural History February 1975 pp.16-17\n\n \n I had to look up this one.\n It's just a magazine, like Scientific American I think.\n This sounds like it might be a letter from a subscriber due to the page numbers.\n \n If you can provide the whole article and its context, that would be better.\n \n \n\n \n \"I regard the failure to find a clear 'vector of progress' in life's history as the most puzzling fact of the fossil record... We have sought to impose a pattern that we hoped to find on a world that does not really display it.\" \"Everybody knows the fossil record doesn't provide much evidence for gradualism; it is full of gaps and discontinuities. These gaps are all attributed to the notorious imperfection of the record, but this not an adequate explanation...This remarkable stasis [steadiness] has generally been ignored. If it doesn't agree with your ideas [talking to evolutionists] you don't talk about it.\" \"The evolutionary trees that adorn our textbooks have data only at the tips and nodes of their branches: the rest is inference, however reasonable, not the evidence of the fossils.\" \"Can a reasonable story of continuous change be constructed for all macroevolutionary events [i.e., hopeful monster theory]? My answer shall be no.\"\n Dr. Steven Jay Gould\n\n What's the point of posting this?\n It has nothing to do with erosion or plate tectonics.\n Things that are definitely gradual and the only things that this is a response to.\n \n \n \n Where did the soup come from, it rained on a rock.\n\n Maybe. But that's not the same as the rock evolving.\n It was just there to help the organic stuff out.\n \n \n \n\n That would be correct. There may have been more than one original kind. No one was there to record it. \n\n So you believe in evolution?\n Are you a Young Earth Evolutionist?\n Since you are saying that there were some original types of animals and plants (or maybe just animals) and what we see today is the result of descent with modification right?\n That sound exactly like evolution to me.\n The only difference is the time frame.\n \n \nFrick said if one was honest, obviously not referring to you.\n\n Crick was a XXXXX.\n \n \nOn what do you base that statement? Imagination?\n\n You're sitting here tellimg me in one breath that life can only come from life.\n That means that you and I are part of a continuum passing through our parents all the way back to the beginning. \n Whether the beginning was Adam & Eve (my brother) or slime life began at some point in the past and has not stopped.\n How much imagination does it take to realize that?\n \n \nYes it is.\n Try standing infront of th express train professor or try flying like your horse example off a 50 story building.\n\n Yep, even in these situations life takes time to wind down.\n Not a long time, but far from \"instantaneous.\"\n When I use that word I mean \" Present or occurring at a specific instant: instantaneous velocity; instantaneous pressure.\" (C&P)\n and instant = A particular or precise time.\n \n An instant has no duration. It lasts zero seconds.\n \n \n \n\n Fascinating . I guess it could take millions of years. emoticon_wow \n No professor when life ceases it ceases instantaneously.\n\n Who said millions of years? It could take seconds, which is far from instantantous. \n \n \nYou are alive or your are dead. You may suffer for years but death is instantaneous.\n\n You could not suffer at all for a few seconds, but when are \"you\" dead?\n When the brain dies? When the heart stops? When the last cell finally gives out? These things don't happen all at one instant.\n \n\n that's deep!\n Can grass continue to live after brain death? emoticon_wow \n\n You don't think grass is alive?\n I think Mr. Kent Hovind agrees with you.\n He's a XXXXX.\n \n \n \nThe big band caused the perfect balance of the nuclear forces etc.?\n You are funny.\n\n Yup, it was Benny Goodman. That's why.\n \n \nActually I do but that is beside the point. Dirt does not turn in to living things.\n Seeds grow into plants , humans come from other humans. You may have noticed this.\n\n Ah, here we go. It is at the heart of the point.\n You believe that when I am in my lab doing chemical reactions, that God is personally directing ever atom and molecule (nay, keeping every electron around every nucleus and holding nuclei together) then directing all the electrons in all their trajectories.\n \n Then I could do the reaction again, maybe at a different tempreature.\n I could even predict the rate of the reaction for that temperature.\n \n Anyway, the point is that chemistry happens according to very predictable laws.\n \n If the behavior of matter is God's personal doing, there is no way to tell the difference as an observer.\n \n Even if this is the case, we still figure out the laws and write them down and give them names.\n \n We give types of predictable reactions names as well as general types of reactions (like self assembly) so whether god is personally guiding every subatomic particle or not makes no difference to what happens.\n \n Self-assembly happens.\n \n Whether god did or not makes no difference as to the results.\n \n \nI won't waste my time with this nonsense any longer. I am going to throw up and wait for the food I broke down to self assemble. Film at 11!\n\n If it dries out and certain parts of it crystalize then it self assembled.\n But really this is a more general usage of the term than is typical.\n Here, you really should learn more about self assembly.\n You might be surprised what it may strike in your imagination.\n \n http://www.newscientist.com/article.ns?id=dn4406\n (btw- that's god making those DNA transistors, but since not all of them worked, he must be getting rusty.)", 
   {
    "unicode_changes_made": true
   }, 
   122488, 
   null, 
   1116124860.0
  ], 
  [
   122903, 
   null, 
   "Hunter", 
   "No, if man evolved from mindless primative primates, why do we still have republicans?\n\n \n Q.If you try to breed a liberal with a pig, what do you get?\n \n A. Nothing, there are some things not even a pig will do.", 
   {}, 
   122507, 
   null, 
   1116133620.0
  ], 
  [
   122905, 
   null, 
   "Hunter", 
   "The newly added seventh and a half level of hell no doubt, for the evolutionists and Liberals \n \n Hunter, you really are the height of just too muchery.\n\n \n You seem a tad excessive yourself.", 
   {}, 
   122576, 
   null, 
   1116133680.0
  ], 
  [
   122906, 
   null, 
   "Duo_Maxwell", 
   "Q.If you try to breed a liberal with a pig, what do you get?\n \n A. Nothing, there are some things not even a pig will do.\n\n \n Q:What happens when you breed a republican with a fundementalist?\n \n A: Either Ayatollah Khomeini or Hitler. :p", 
   {}, 
   122903, 
   null, 
   1116133800.0
  ], 
  [
   123032, 
   null, 
   "Mucusaur", 
   "You seem a tad excessive yourself.\n\n \n BOY HOWDY! Give me my ten gallon hat! I have to pistol whip some liberals!", 
   {}, 
   122905, 
   null, 
   1116165600.0
  ], 
  [
   123091, 
   null, 
   "Clive14", 
   "If man evolved from Apes, why do we still have Apes? emoticon_wow\nIf intelligent people evolved from less intelligent ones, why is the world still full of evolution-doubting, god-fearing stupid people?", 
   {}, 
   122467, 
   null, 
   1116176340.0
  ], 
  [
   123142, 
   null, 
   "gnojek", 
   "Dig it,\n \n I just wanted to post another Science column sure to fume up some Young Earth evolutionists.\n \n It deals with the Snowball Earth theory, maybe you've heard of it.\n \n \n http://www.sciencemag.org/cgi/content/full/308/5719/181\n \n \n \nPALEOCLIMATOLOGY:\n Cosmic Dust Supports a Snowball Earth\n Richard A. Kerr\n Answering questions about Earth's climate of more than half a billion years ago can be a challenge--even questions as stark as whether land and sea were completely coated by ice from pole to pole. Indeed, the revival of the Snowball Earth hypothesis almost 7 years ago has bogged down of late, as paleoclimatologists have failed to turn up unequivocal evidence that ice enrobed our planet.\n \n But on page 239 of this issue, a group of geochemists offers a new snowball marker: the element iridium, which continually rains down on us from space. They say they found so much iridium deposited at the end of a glaciation 635 million years ago that the planet must have been frozen pretty much solid for 12 million years straight. \"I think this is a very exciting discovery,\" says geochemist Frank Kyte of the University of California, Los Angeles. Like any new tool, iridium needs some more work, but \"I'm sure it will invoke a lot of discussion.\"\n \n http://www.sciencemag.org/cgi/content/full/308/5719/181/F1\n No accident. The discovery of a spike of cosmic iridium (green line) at the end of an ancient ice age (top of blue glacial sediments) suggests that ice covered the planet. \n CREDIT: ADAPTED FROM BERND BODISELITSCH ET AL.\n This isn't iridium's first appearance as a timekeeper. But geochemists Bernd Bodiselitsch and Christian Koeberl of the University of Vienna, Austria, and their colleagues took a new tack when they analyzed 44 elements including iridium along three cores drilled by copper miners in Zambia and the Democratic Republic of the Congo. Bodiselitsch and his colleagues figured that on an iced-over world, the iridium-rich meteoritic dust that rains onto Earth would accumulate until the snowball ended in a sudden meltdown, as climate modelers believe would happen. All the iridium accumulated in the ice would then be deposited in a single, thin layer of marine sediment. The more iridium deposited at the end of a snowball, the longer the snowball had gone on.\n In the first few centimeters of sediment laid down on top of glacial sediments, Bodiselitsch and colleagues indeed found sharp spikes in the abundance of iridium. A spike showed up in all three cores at the end of the Marinoan glaciation about 635 million years ago and in two cores at the end of the earlier Sturtian glaciation about 710 million years ago. The iridium could conceivably have been homegrown--from a volcanic eruption or concentrated from crustal rock by some geochemical process--but several other elements were present in proportions typical of meteorites, not the crust. And the proportion of iridium to some other elements suggested that geochemical processing had not concentrated the iridium, they concluded. If meteoritic material was falling to Earth 635 million years ago at anything like the rate it has during the past 80 million years, the group calculates, the Marinoan glaciation lasted 12 million years, give or take 3 million years.\n \n The ice was all around? A true Snowball Earth would have coated the globe with ice. \n CREDIT: PHOTOS.COM\n \n If the Marinoan ice age managed to save up 12 million years' worth of extraterrestrial iridium, it must have iced over the entire planet, researchers agree. The alternative to Snowball Earth has been Slushball Earth (Science, 26 May 2000, p. 1316). Rather than pole-to-pole ice, some paleoclimate modelers have suggested that Marinoan glaciation might have left tropical oceans ice-free and still produced glacial deposits near equatorial continents. But a slushball would have melted down within something like a million years as volcanoes belching carbon dioxide fueled a growing greenhouse. \"It's hard to see what would keep a slushball around for 10 [million] or 20 million years,\" says climate modeler Raymond Pierrehumbert of the University of Chicago. And even if a slushball did last, its glaciers--unlike those of a snowball--would continually flow down to the sea, steadily depositing iridium, not producing a spike of it.\n Geochemists are excited but naturally cautious. \"Iridium is a strong indicator of extraterrestrial material,\" says Bernhard Peucker-Ehrenbrink of the Woods Hole Oceanographic Institution in Massachusetts. \"However, it is just one of a series of useful tracers.\" He and others, he expects, will be pursuing other extraterrestrial tracers such as isotopes of helium and of osmium to test the claim of a Snowball Earth. Prompting such testing \"is what good, interesting, provocative papers should do,\" he says.\n \n \n \n Come on! Don't these fools realize that it wasn't a global ice age lasting millions of years but a global flood lasting 150 days or so?\n \n Maybe they read this edtorial in the same issue.\n \n \nTwilight for the Enlightenment?\n For much of their existence over the past two centuries, Europe and United States have been societies of questioners: nations in which skepticism has been accepted and even welcomed, and where the culture has been characterized by confidence in science and in rational methods of thought. We owe this tradition in part to the birth of the Scottish Enlightenment of the early 18th century, when the practice of executing religious heretics ended, to be gradually replaced by a developing conviction that substituted faith in\n experiment for reliance on inherited dogma.\n \n That new tradition, prominently represented by the Scottish philosopher David Hume, supplied important roots for the growth of modernity, and it has served U.S. society well, as it has Europe's. The results of serious, careful experimentation and analysis became a standard for the entry of a discovery or theory into the common culture of citizens and the policies of their governments. Thus, scientific determinations of the age of Earth and the theories of gravity, biological evolution, and the conservation of matter and\n energy became meaningful scientific anchors of our common understanding.\n \n In the United States, that understanding is now undergoing some dissolution, as some school boards eliminate the teaching of evolution or require that religious versions of creation be represented as \"scientific\" alternatives. \"Intelligent design,\" a recent replacement for straight-up creationism, essentially asserts that a sufficient quantity of complexity and beauty is by itself evidence of divine origin-a retrogression to the pre-Darwinian zoologist William Paley, who saw in the elegant construction of a beetle's antenna the work of a Creator.\n \n In 1998, I helped the National Academies produce a book entitled Teaching About Evolution and the Nature of Science. At the press conference announcing its publication, I was asked if I knew that most U.S. citizens did not believe that humans descended from other forms. I said I did, but expressed a hope that things might change. Well, things changed in the wrong direction: Alternatives to the teaching of biological evolution are\n now being debated in no fewer than 40 states. Worse, evolution is not the only science under such challenge. In several school districts, geology materials are being rewritten because their dates for Earth's age are inconsistent with scripture (too old).\n \n Meanwhile, President Bush's Emergency Plan for AIDS Relief policies recommend\n \"evidence-based\" risk-reduction strategies: abstinence for youth, fidelity for married couples, and condoms recommended only for infected or high-risk individuals, such as sex workers. Failure rates for condoms are commonly quoted, apparently to discourage their use by young people for risk prevention. Mysteriously, the policy doesn't seem able to cite a failure rate for abstinence.\n \n Finally, certain kinds of science are now proscribed on what amount to religious grounds. Stem cell research is said by its opponents to pose a \"moral dilemma.\" Yet this well-advertised dilemma does not arise from a confrontation\n between science and ethical universals. Instead, the objections arise from a particular belief about what constitutes a human life: a belief held by certain religions but not by others. Some researchers, eager to resolve the problem, seek to derive stem cells by techniques that might finesse the controversy. But the claim that the stem cell \"dilemma\" rests on universal values is a false claim, and for society to accept it to obtain transitory political relief would bring church and state another step closer.\n \n The present wave of evangelical Christianity, uniquely American in its level of participation, would be nothing to worry about were it a matter restricted to individual conviction and to the expressions of groups gathering to worship.\n It's all right that in the best-selling novels about the \"rapture,\" the true believers ascend and the rest of us perish painfully. But U.S. society is now experiencing a convergence between religious conviction and partisan loyalty, readily detectable in the statistics of the 2004 election. Some of us who worry about the separation of church and state will accept tablets that display the Ten Commandments on state premises, because they fail to cross a threshold of urgency. But when the religious/political convergence leads to managing the nation's research agenda, its foreign assistance\n programs, or the high-school curriculum, that marks a really important change in our national life. Twilight for the Enlightenment? Not yet. But as its beneficiaries, we should also be its stewards.\n Donald Kennedy\n Editor-in-Chief\n\n \n \n They should have read this book instead (a book review from the same issue).\n \n \nSCIENCE AND RELIGION:\n The Blind Godmaker\n A review by Michael Shermer*\n \n Dawkins' God Genes, Memes, and the Meaning of Life\n by Alister McGrath\n Blackwell, Oxford, 2004. 208 pp. $54.95, £45. ISBN 1-4051-2539-X. Paper, $18.95, £9.99. ISBN 1-4051-2538-1.\n In 1999, Frank J. Sulloway and I conducted a study on religious attitudes that included a question asking survey takers to explain in their own words why they believe in God. The most popular reason given was: \"Good design, natural beauty, perfection, and complexity of the world or universe\" (1). As pattern-seeking primates, we have a natural tendency to look for and find design in nature. Before 1859 the default explanation for that design was a top-down designer, God. This was most forcefully argued by the 18th-century English theologian William Paley: If one stumbled upon a watch on a heath, one would not assume it had always been there, as one might with a stone (2). A watch implies a watchmaker. Design implies a designer.\n In 1859, Charles Darwin provided a scientific explanation of design from the bottom up: natural selection (3). Since then, arguably no one has done more to make the case for bottom-up design than the Oxford University evolutionary biologist Richard Dawkins in a series of books that includes the aptly titled The Blind Watchmaker (4), a direct challenge to Paley. But if design comes naturally from the bottom up and not supernaturally from the top down, what does that imply about the existence of God? Although most scientists avoid the question altogether or take a conciliatory stance along the lines of Stephen Jay Gould's non-overlapping magisteria (NOMA) (5), Dawkins unequivocally concludes: \"Darwin made it possible to be an intellectually fulfilled atheist\" (4).\n \n Dawkins has generated controversy within the ranks of evolutionary theorists for his strict adherence to Darwinian natural selection  (\"random mutation plus non- random cumulative selection\" in his succinct description) as the only mechanism of evolutionary change worth bothering about--Gould called him a \"Darwinian fundamentalist\" (6)--but it is his statements about religion that have drawn attention to him from outside the scientific community. Now, in Dawkins' God, we have a book-length analysis by Alister McGrath, professor of historical theology at Oxford. With professional training in the sciences as well as theology (he earned a doctorate in molecular biophysics), McGrath is well qualified to assess Dawkins's literary corpus.\n The book begins with an engaging first-person account of McGrath's own journey from atheist to theist, emphasizing the shortcomings of the former and the strengths of the latter (7). During his time as a graduate student at Oxford, McGrath began to explore the relation between science and religion, which led him to realize that Christianity was more sophisticated than his atheism allowed him to appreciate. \"While I had been severely critical of Christianity as a young man, I had never extended that same critical evaluation to atheism.\" When he did, he discovered \"that the intellectual case for atheism was rather less substantial than I had supposed.\" At the same time, he was reading Dawkins, whose conclusions were just the opposite; thus was born this book, decades in the making.\n \n After a brief tour of the life and science of both Darwin and Dawkins, McGrath addresses Dawkins's vision of evolutionary theory as a complete worldview. \"I'm a Darwinist because I believe the only alternatives are Lamarckism or God,\" Dawkins explains, \"neither of which does the job as an explanatory principle\" (8). Because science supports Darwinism, the implications are broad and deep. \"The universe we observe has precisely the properties we should expect if there is, at bottom, no design, no purpose, no evil and no good, nothing but blind pitiless indifference\" (9). What place, then, for God?\n \n The remainder of Dawkins' God consists primarily of a point-by-point critique of Dawkins's writings on religion, which McGrath sees as too simplistic and full of easy-to-topple straw men. McGrath summarizes his position thusly: (i) \"The scientific method is incapable of adjudicating the God hypothesis, either positively or negatively.\" (ii) \"God need not be invoked as an explanatory agent within the evolutionary process\" (to be subsequently dismissed). (iii) \"The concept of God as 'watchmaker,' which Dawkins spends so much time demolishing, emerged as significant in the eighteenth century, and is not typical of the Christian tradition.\" This is, in essence, Gould's NOMA--science and religion serve different purposes using different methods, and attempts to bring them into harmony or conflict cannot be logically justified.\n Then how do we know there is a God? Faith. According to Dawkins, faith \"means blind trust, in the absence of evidence, even in the teeth of evidence\" (10). This, says McGrath, \"bears little relation to any religious (or any other) sense of the word.\" In its stead McGrath presents the definition of faith by the Anglican theologian W. H. Griffith-Thomas: \"It commences with the conviction of the mind based on adequate evidence; it continues in the confidence of the heart or emotions based on conviction, and it is crowned in the consent of the will, by means of which the conviction and confidence are expressed in conduct.\" Such a definition--which McGrath describes as \"typical of any Christian writer\"--is an example of what Dawkins, in reference to French postmodernists, calls \"continental obscurantism.\" Most of it describes the psychology of belief. The only clause of relevance to a scientist is \"adequate evidence,\" which raises the follow-up question, \"Is there?\"\n \n Obviously McGrath must think there is, but he never says. On this point I found the book frustrating. As McGrath's relentless deconstruction of Dawkins unfolds, he repeats, over and over, that religion offers a worldview every bit as sophisticated and worthy of respect as science. His defense of religious faith is a passionate and honorable one, and he demonstrates that some of Dawkins's characterizations of religion are indeed overly simplistic or selective, but he never delivers an answer to the God question. The closest thing to an argument for God's existence I could find in the book is this: \"Why should God require an explanation at all? He might just be an 'ultimate,'...one of those things we have to accept as given, and is thus amenable to description, rather than explanation.\" That may be, but like all other arguments made in favor of God's existence, this only works as a reason to believe if you already believe. If you do not already believe, science cannot help you.\n \n I was eager to read Dawkins' God because of the gladiatorial weight of the contestants and what they represent. And although McGrath presents many side issues in a pleasantly readable fashion (e.g., Darwin's religiosity, the historiography of science and religion, and how and where religion embraces science), he dodges the biggest question of all, the question at the heart of Dawkins's writings: Is there a God? Whether Dawkins is simplistic or sarcastic or sardonic is a secondary issue. By elevating it to the primary focus of the book, McGrath missed an opportunity to make his case, pace Dawkins, and give us the very best arguments in his arsenal. With McGrath, I still do not know why he believes in God. With Dawkins, there is no doubt about where he stands.\n \n References and Notes\n \n \n The results are reported in M. Shermer, How We Believe: The Search for God in an Age of Science (Freeman, New York, 2000). \n W. Paley, Natural Theology: Or, Evidence of the Existence and Attributes of the Deity (London, 1802). \n C. Darwin, On the Origin of Species (John Murray, London, 1859). \n R. Dawkins, The Blind Watchmaker: Why the Evidence of Evolution Reveals a Universe Without Design (Norton, New York, 1986). \n S. J. Gould, Rocks of Ages: Science and Religion in the Fullness of Life (Ballantine, New York, 1999). \n S. J. Gould, N. Y. Rev. Books 44, 34 (12 June 1997). \n See also: A. McGrath, The Twilight of Atheism: The Rise and Fall of Disbelief in the Modern World (Rider, London, 2004). \n R. Dawkins, in The Third Culture, J. Brockman, Ed. (Simon and Schuster, New York, 1995), pp. 75-95. \n R. Dawkins, River Out of Eden: A Darwinian View of Life (Weidenfeld and Nicolson, London, 1995). \n R. Dawkins, The Selfish Gene (Oxford Univ. Press, Oxford, 1976). \n", 
   {
    "post_info": {
     "attachments": 1
    }, 
    "unicode_changes_made": true
   }, 
   123091, 
   null, 
   1116183360.0
  ], 
  [
   123144, 
   null, 
   "gnojek", 
   "A. Nothing, there are some things not even a pig will do.\n\n \n I suppose you are speaking from experience, Mississippi man?\n ;) :p", 
   {}, 
   122903, 
   null, 
   1116183540.0
  ], 
  [
   123175, 
   null, 
   "trebor", 
   "If man evolved from Apes, why do we still have Apes? emoticon_wow\n\n \n If god made man from dirt, why do we still have dirt?\n \n If Christians came from the Jewish faith, why are there still Jewish people?", 
   {}, 
   122467, 
   null, 
   1116187620.0
  ], 
  [
   123176, 
   null, 
   "trebor", 
   "Q:What happens when you breed a republican with a fundementalist?\n \n A: Either Ayatollah Khomeini or Hitler. :p\n\n \n \n \n You should consider a knuckle dragging, knuckle dragging red necked idiot.", 
   {}, 
   122906, 
   null, 
   1116187800.0
  ], 
  [
   123180, 
   null, 
   "Mucusaur", 
   "Good article Gnojek. People like Hunter and Peddler will bring America down. They can debate the bible amidst the ruins of their god loving but technologically backward society.", 
   {}, 
   123176, 
   null, 
   1116188520.0
  ], 
  [
   123410, 
   null, 
   "gnojek", 
   "I thought that editorial was nice too.\n \n Here's a couple more things....\n \n \n \n http://www.colorado.edu/news/releases/2005/156.html\n \n\n A new University of Colorado at Boulder study indicates Earth in its infancy probably had substantial quantities of hydrogen in its atmosphere, a surprising finding that may alter the way many scientists think about how life began on the planet. \n \n \n http://www.spacedaily.com/news/early-earth-01g.html\n \n \nNASA scientists recently proposed a new explanation for the rise of oxygen in Earth's early atmosphere -- an event that may have jumpstarted the evolution of complex life.\n Catling's team argues that oxygen increased in Earth's atmosphere more than 2 billion years ago because hydrogen atoms from water hitched a one-way ride into space inside methane gas produced by primitive microbes. This irreversible loss of hydrogen, they say, left behind an excess of oxygen, which gradually filled the Earth's crust and then flooded Earth's atmosphere.\n \n \"Without oxygen, the most sophisticated life on Earth would have been green microbial scum,\" said Catling. \"Fortunately, some bacteria in the early oceans were able to separate water into hydrogen and oxygen. The hydrogen was lost to space, leaving the oxygen behind.\"\n \n Questions of how and why oxygen built up in the Earth's atmosphere have been controversial for decades. Although scientists have ample evidence that oxygen first appeared in the atmosphere a little more than 2 billion years ago, why this happened has long been the subject of speculation. Fundamentally, the oxygen in the air is a byproduct of photosynthesis.\n \n In photosynthesis, plants and microbes use sunlight to steal hydrogen from water. The hydrogen is mostly used to make organic matter from carbon dioxide and the unwanted oxygen is released. But microbes that make oxygen in photosynthesis were living on Earth at least a half- billion years before oxygen first flooded the atmosphere.\n \n \"Three billion years ago, the sun was only 4/5ths as bright as it is now. The Earth should have frozen over,\" he said. But methane, a powerful greenhouse gas, would have kept the Earth warm.\n", 
   {}, 
   123180, 
   null, 
   1116227100.0
  ], 
  [
   124644, 
   null, 
   "gnojek", 
   "http://www.sciencemag.org/cgi/content/full/307/5716/1728\n \n \nEVOLUTION:\n Fossil Horses--Evidence for Evolution\n Bruce J. MacFadden*\n \n Thomas Huxley, an early advocate of Darwinian evolution, visited the United States in 1876 on a lecture tour. Huxley had planned to talk about evidence for evolution based on a fragmentary sequence of fossil horses from Europe. One of Huxley's first stops was at Yale, where he studied the fossil horse collection assembled by the paleontologist O. C. Marsh during expeditions to the western territories. Huxley was so taken with the definitive evidence provided by Marsh's fossil horse collection that he used this evolutionary sequence as the focal point for his subsequent talk to the New York Academy of Sciences (1).\n \n Since the late 19th century, the 55-million-year (My) phylogeny of horses (Family Equidae)--particularly from North America--has been cited as definitive evidence of long-term \"quantum\" evolution (2), now called macroevolution. Macroevolution is the study of higher level (species, genera, and above) evolutionary patterns that occur on time scales ranging from thousands to millions of years. The speciation, diversification, adaptations, rates of change, trends, and extinction evidenced by fossil horses exemplify macroevolution.\n \n The sequence from the Eocene \"dawn horse\" eohippus to modern-day Equus has been depicted in innumerable textbooks and natural history museum exhibits. In Marsh's time, horse phylogeny was thought to be linear (orthogenetic), implying a teleological destiny for descendant species to progressively improve, culminating in modern-day Equus. Since the early 20th century, however, paleontologists have understood that the pattern of horse evolution is a more complex tree with numerous \"side branches,\" some leading to extinct species and others leading to species closely related to Equus. This branched family tree (see the figure) is no longer explained in terms of predestined improvements, but rather in terms of random genomic variations, natural selection, and long-term phenotypic changes (3).\n \n Figure 1 Adaptive radiation of a beloved icon. Phylogeny, geographic distribution, diet, and body sizes of the Family Equidae over the past 55 My. The vertical lines represent the actual time ranges of equid genera or clades. The first ~35 My (Eocene to early Miocene) of horse phylogeny are characterized by browsing species of relatively small body size. The remaining ~20 My (middle Miocene until the present day) are characterized by genera that are either primarily browsing/grazing or are mixed feeders, exhibiting a large diversification in body size. Horses became extinct in North America about 10,000 years ago, and were subsequently reintroduced by humans during the 16th century. Yet the principal diversification of this family occurred in North America. Although the phylogenetic tree of the Equidae has retained its \"bushy\" form since the 19th century [for example, see (2, 3)], advances in knowledge from fossils have refined the taxonomy, phylogenetic interrelationships, chronology, and interpretations of the ancient ecology of fossil horses.\n \n CREDIT: PRESTON HUEY/SCIENCE\n \n The Equidae, a family within the odd-toed ungulate Order Perissodactyla (which includes rhinoceroses, tapirs, and other closely related extinct groups), consists of the single extant genus Equus. Depending upon interpretation, it also includes several subgenera, 8 to 10 species, and numerous subspecies (4). On the basis of morphological differences, Equus is separated into two or three deep clades within the genus. These include caballines (domesticated horse, E. caballus); zebras (three species recognized); and asses, donkeys, and related species. Recent studies of mitochondrial DNA indicate two deep clades within Equus, namely, the caballines and the zebras/asses (5). These deep clades split ~3 million years ago (Ma) in North America and subsequently dispersed into the Old World. Equus became extinct in the New World ~10,000 years ago, probably as a result of multiple factors including climate change and hunting by early humans. In the Old World, although its range contracted, Equus persisted and was then domesticated in central Asia about 6000 years ago from a stock similar to Przewalski's wild horse, E. caballus (sometimes considered its own species, E. przewalskii) (4).\n \n The single modern genus Equus stands in marked contrast to a highly diverse adaptive radiation of the Family Equidae over the past 55 My that resulted in some three dozen extinct genera and a few hundred extinct species (3). Although the overall branched pattern of horse phylogeny (see the figure) has remained similar for almost a century, new discoveries and reinterpretation of existing museum fossil horse collections have added to the known diversity of extinct forms. Recent work reveals that Eocene \"hyracothere\" horses, previously known as \"eohippus\" or Hyracotherium, include an early diversification of a half- dozen genera that existed between 55 and 52 Ma in North America and Europe (6). New genera have recently been proposed for the complex middle Miocene radiation (7), although the validity of these genera is still debated.\n \n Horse teeth frequently preserve as fossils and are readily identifiable taxonomically. They serve as objective evidence of the macroevolution of the Equidae. Horse teeth have undergone considerable changes over the past 55 My. The tempo of this morphological evolution has sometimes been slow and at other times rapid (2, 3). Primitive Eocene through early Miocene (between 55 and 20 My) horses had short-crowned teeth adapted for browsing on soft, leafy vegetation. During the later Miocene (between 20 and 15 Ma), horses underwent explosive adaptive diversification in tooth morphology. Shorter crowned browsers, which inhabited forests and open-country woodlands, declined in diversity during this time (8). In contrast, many other clades of horses evolved high-crowned teeth adapted for grazing on the extensive grasslands of more open-country biomes, which spread during the Miocene (25 to 15 Ma). Once high-crowned teeth evolved, some clades underwent a secondary adaptation, that is, they went from being grazers to being mixed feeders with diets consisting of grass and some leafy plants (9). Studies of carbon isotopes preserved in fossil horse teeth indicate that before ~7 Ma, early tropical and temperate grasslands of the world consisted primarily of grasses that used the C3 photosynthetic pathway, whereas today these grasslands consist mostly of C4 grasses (10).\n \n In many fossil groups, the trend toward larger body size in ancestral-descendent sequences has been termed \"Cope's rule.\" Early Eocene hyracothere horses classically have been compared in size to a small dog (~10 to 20 kg), although house-cat-sized species have been discovered more recently. At the other end of the evolutionary spectrum, wild modern Equus attains a body size of ~500 kg (3, 4). Although the 55-My-old fossil horse sequence has been used as a classic example of Cope's rule, this notion is now known to be incorrect. Rather than a linear progression toward larger body size, fossil horse macroevolution is characterized by two distinctly different phases. From 55 to 20 Ma, primitive horses had estimated body sizes between ~10 and 50 kg. In contrast, from 20 Ma until the present, fossil horses were more diverse in their body sizes. Some clades became larger (like those that gave rise to Equus), others remained relatively static in body size, and others became smaller over time (3).\n \n Fossil horses have held the limelight as evidence for evolution for several reasons. First, the familiar modern Equus is a beloved icon that provides a model for understanding its extinct relatives. Second, horses are represented by a relatively continuous and widespread 55-My evolutionary sequence. And third, important fossils continue to be discovered and new techniques developed that advance our knowledge of the Family Equidae. The fossil horse sequence is likely to remain a popular example of a phylogenetic pattern resulting from the evolutionary process.\n \n References\n \n 1. C. Schuchert, C. M. LeVene, O. C. Marsh Pioneer in Paleontology (Yale Univ. Press, New Haven, CT, 1940).\n 2. G. G. Simpson, Major Features of Evolution (Columbia Univ. Press, New York, 1953).\n 3. B. J. MacFadden, Fossil Horses: Systematics, Paleobiology, and Evolution of the Family Equidae (Cambridge Univ. Press, New York, 1992) [publisher's information].\n 4. R. M. Nowak, Walker's Mammals of the World, 5.1 Online (Johns Hopkins Univ. Press, Baltimore, 1997) [publisher's information].\n 5. E. A. Oakenfull, H. N. Lim, O. A. Ryder, Conserv. Genet. 1, 341 (2000) [Abstract].\n 6. D. J. Froehlich, Zool. J. Linn. Soc. 134, 141 (2002) [Abstract].\n 7. T. S. Kelly, Contrib. Sci. Nat. Hist. Mus. Los Ang. Cty. 455, 1 (1995).\n 8. C. M. Janis, J. Damuth, J. M. Theodor, Proc. Natl. Acad. Sci. U.S.A. 97, 7899 (2000) [Medline].\n 9. B. J. MacFadden, N. Solounias, T. E. Cerling, Science 283, [824] (1999).\n 10. T. E. Cerling et al., Nature 389, 153 (1997) [Abstract]. \n\n \n Image is attached.", 
   {
    "post_info": {
     "attachments": 1
    }
   }, 
   123410, 
   null, 
   1116445140.0
  ], 
  [
   124647, 
   null, 
   "gnojek", 
   "http://www.sciencemag.org/cgi/content/full/308/5724/962\n \n \nATMOSPHERIC SCIENCE:\n Rethinking Earth's Early Atmosphere\n Christopher F. Chyba*\n \n In 1952, Stanley Miller, working with Harold Urey, simulated the atmosphere of early Earth with a gas mixture of methane (CH4), ammonia (NH3), molecular hydrogen (H2), and water. When he introduced an electrical spark to represent lightning, he observed the formation of amino acids, the building blocks of proteins (1). Miller later showed that the amino acids were the result of reactions in liquid water (representing Earth's ocean) of simple organic molecules such as hydrogen cyanide (HCN) and formaldehyde (H2CO) formed in the gas mixture (2). His experiment turned the study of the origin of life into an experimental science.\n \n However, by the 1960s, the validity of hydrogen-rich (and hence reducing) model atmospheres for early Earth, such as the CH4-NH3 atmosphere used by Miller and Urey, was under attack (3). Since the 1970s, carbon dioxide (CO2)-rich atmospheres have been favored (4). Miller has shown that the production of amino acids and other organic molecules is orders of magnitude less efficient in such atmospheres (5). For this and other reasons, the Miller-Urey approach to the origin of life has fallen out of favor with many researchers. But on page 1014 of this issue, Tian et al. (6) argue that the early-Earth atmosphere might have been hydrogen-rich after all.\n \n In early models of Earth's evolution, the planet's iron-rich core was assumed to have formed slowly over hundreds of millions of years. Prior to core formation, metallic iron would have been abundant in Earth's mantle, in effect providing a huge oxygen sink. As a result, carbon and nitrogen compounds emitted (\"outgassed\") into the atmosphere--for example, in volcanic eruptions--would have been saturated with hydrogen (CH4 and NH3). Early life would have used the abundant organic molecules produced by Miller-Urey synthesis for energy and raw materials. Core formation would have freed the oxygen, leading to outgassing of CO2 rather than CH4 (7). Abiotic organic production would have plummeted, whereupon life would have evolved to cope with this change. It was an elegant picture--but probably largely wrong.\n \n Figure 1 Hydrogen lends a helping hand. Yields (in moles produced per joule of input spark discharge energy) of organic molecules thought to be key for the origin of life are lower in CO2-rich atmospheres than in CH4-rich ones, although H2/C ratios <1 maximize organic production in the former case. [Adapted from (5)] \n \n It now appears that Earth was hot at the time of its formation, because it accreted from fast-colliding planetesimals. It seems unavoidable that the core formed virtually simultaneously with Earth itself. If the iron was largely sequestered in the core from the start, then there never was a Miller-Urey atmosphere. Even if there ever had been such an atmosphere, modeling suggested that it would be quickly destroyed by solar ultraviolet light. However, this problem would be circumvented by the formation of a high-altitude organic haze, similar to that in the atmosphere of Saturn's moon Titan (8). Thus, if Earth ever had a Miller-Urey atmosphere, it could be sustained. But it remains unclear how to form such an atmosphere to begin with.\n \n Tian et al. (6) may have found a way to sidestep these problems. In their model, the atmosphere is CO2-rich, not CH4-rich, but contains as much as 30% H2. The model uses the current hydrogen outgassing rate, increased by at most a small factor to account for the geologically more active early Earth. What is new is their transonic hydrodynamic escape model: For an atmosphere rich in H2, the escape of hydrogen to space is hydrodynamic and limited by the availability of extreme ultraviolet light from the Sun. The model yields an escape rate that is much lower than previously found. Because less H2 escapes, if Earth ever had an H2-rich atmosphere, it could be sustained.\n \n The figure shows why this matters for the origin of life. HCN and H2CO are produced at much lower yields in CO2-rich atmospheres than in CH4-rich ones, but production is particularly low in CO2-rich atmospheres when H2/C ratios fall below 1 or rise above 5 to 10 (5). Tian et al. (6) suggest that they can keep H2/C < 1 in their model, although this also depends on the poorly known CO2 abundance. Their H2-CO2 atmosphere is less favorable for organic production than a Miller-Urey one, but far better than previously preferred model atmospheres with H2/C ~ 0.001.\n \n Many uncertainties and problems remain. Tian et al. focus on the oceans as the \"birthplace of life,\" but polymerization of amino acids into proteins (or nucleotides into RNA) is thermodynamically unfavorable in liquid water. Furthermore, in an early ocean as saline as that of today, the salt inhibits key prebiotic reactions (9). The bulk ocean may thus have been one of the worst places to try to originate life. After making life's building blocks in the ocean, one needs to look elsewhere to carry the chemistry further. Some authors have abandoned this heterotrophic picture of the origin of life in favor of an autotrophic model, in which metabolic reactions that can fix their own carbon are the first steps on the road to life (10).\n \n How does prebiotic organic production in the atmosphere of Tian et al. compare to other sources of organic molecules on early Earth? Because of uncertainties in the hydrogen content of the early atmosphere, examinations of this question have considered a range of H2/C ratios (11). As model atmospheres become more hydrogen-rich, production of organic molecules through electrical discharges or ultraviolet light becomes increasingly important relative to delivery of organic molecules by meteorites or comets. Yet shock-tube experiments suggest that in Miller-Urey atmospheres, atmospheric shocks from meteors and impacts could be a dominant energy source for organic synthesis (11). Impactors may also have been a major driver of organic production in an early H2-rich atmosphere.\n \n These are tumultuous times in the study of the origin of life. The early ocean may have been even less hospitable for prebiotic chemistry than previously thought (9), and claimed evidence for the earliest signatures of life on Earth is being strongly challenged (12). Now a 30-year, albeit shaky, consensus on the nature of the early atmosphere may have to be reexamined, and the geochemical implications of an H2-rich early atmosphere will need to be scrutinized. This turmoil makes it a great time for young scientists to enter the field, but it also reminds us that some humility regarding our favorite models is in order. As Jacob Bronowski noted, \"Science is a tribute to what we can know although we are fallible\" (13).\n \n References\n \n 1. S. L. Miller, Science 117, 528 (1953) [JSTOR].\n 2. S. L. Miller, Ann. N.Y. Acad. Sci. 69, 260 (1957).\n 3. P. H. Abelson, Proc. Natl. Acad. Sci. U.S.A. 55, 1365 (1966).\n 4. J. C. G. Walker, Evolution of the Atmosphere (Macmillan, New York, 1977).\n 5. R. Stribling, S. L. Miller, Origins Life 17, 261 (1987) [Medline].\n 6. F. Tian, O. B. Toon, A. A. Pavlov, H. De Sterck, Science 308, 1014 (2005); published online 7 April 2005 (10.1126/science.1106983).\n 7. H. D. Holland, in Petrologic Studies: A Volume to Honor A. F. Buddington, A. E. J. Engel et al., Eds. (Geological Society of America, Washington, DC, 1962), pp. 447-477.\n 8. C. Sagan, C. Chyba, Science 276, [1217] (1997).\n 9. P.-A. Monnard et al., Astrobiology 2, 139 (2002) [Medline].\n 10. G. Wächtershäuser, Microbiol. Rev. 52, 452 (1988) [Medline].\n 11. C. Chyba, C. Sagan, Nature 355, 125 (1992) [Medline].\n 12. S. Moorbath, Nature 434, 155 (2005) [Medline].\n 13. J. Bronowski, The Ascent of Man (Little Brown, Boston, 1973), p. 374. \n\n \n Image is attached.", 
   {
    "post_info": {
     "attachments": 1
    }
   }, 
   124644, 
   null, 
   1116445440.0
  ], 
  [
   124677, 
   null, 
   "gnojek", 
   "http://www.sciencemag.org/cgi/content/full/307/5711/861\n \n\n PALEONTOLOGY:\n Homoplasy in the Mammalian Ear\n Thomas Martin and Zhe-Xi Luo*\n \n The similarity among structures that arose through independent evolution instead of descent from a common ancestor is termed homoplasy and is a major feature of evolutionary morphology. A fascinating but very difficult question facing evolutionary biologists is whether a complex structure would be less likely than a simple structure to undergo independent homoplastic evolution (1). On page 910 of this issue, Rich et al. (2) partially answer this question with their analysis of the dentary bone from the lower jaw of an Early Cretaceous fossil monotreme called Teinolophos, an extinct relative of Australia's modern platypus and echidna. The new fossil find offers fresh anatomical evidence to support the hypothesis that a key evolutionary innovation among modern mammals--the separation of the middle ear bones from the mandible--must have evolved independently among the monotreme mammals and the therians (marsupials and placentals).\n \n The tiny bones of the middle ear that are used for hearing render modern mammals--including placentals, pouched marsupials, and egg-laying monotremes--unique among vertebrates (2). The middle ear bones are the malleus, incus, and stapes, and in addition there is the tympanic bone, which supports the tympanic membrane, enabling it to receive sound. The tympanic, malleus, and incus are homologous to bones in the mandible and jaw hinge (the angular, articular, and quadrate, respectively), which are required for feeding in nonmammalian vertebrates (3-5). There is also extensive evidence from fossils of extinct cynodont and mammaliaform relatives of modern mammals suggesting that the angular, articular, and quadrate bones in these creatures were used for hearing while still attached to the mandible and jaw hinge (6, 7). Evolution of the mammalian jaw joint and middle ear represents a classic example of the phylogenetic transformation of a complex functional structure that can be read directly from fossil evidence.\n \n However, alternative interpretations have waxed and waned about how these middle ear bones got separated from the mandible during early mammalian evolution. The structure of the middle ear is so complex and unique that some researchers consider the separation of the middle ear bones from the mandible to be the strongest synapomorphic (shared derived) characteristic of living mammals (7, 8). They also propose that the monotreme, marsupial, and placental lineages split after their common ancestor had acquired this key feature. This view has been contested by others who favor multiple and independent acquisitions of the mammalian middle ear bones after the divergence of monotremes, marsupials, and placentals (6, 9).\n \n Figure 1 From feeding to hearing. Convergent separation of the middle ear bones from the mandible in the monotreme and therian (marsupial and placental) mammalian lineages. Convergent separation is inferred from the independent loss of the mandibular structures for the attachment of the middle ear bones. Primitive mammalian lineages (gray; blue lines) have a plesiomorphic mandibular trough for full accommodation and attachment of the middle ear bones to the mandible. The internal mandibular (\"postdentary\") trough is shown in brown. Derived lineages (cream; yellow lines) have lost the mandibular trough and show final separation of the middle ear bones from the mandible. Middle ear bones that are no longer accommodated by the mandibular trough but are still linked by the Meckel's cartilage to the middle of the mandible are indicated by the yellow and blue dashed line (11). [Tree topology is based on (12-14, 16); figure is not to scale.]\n \n CREDIT: EMESE KAZÁR\n \n In premammalian cynodonts and such primitive mammaliaforms as Morganucodon (see the figure), the middle ear bones were accommodated within an internal trough in the mandible [see (2)]. From dental evidence, Teinolophos is unequivocally placed in the monotreme lineage (2, 10). But like Morganucodon and very much unlike living monotremes, Teinolophos exhibits a well-developed internal mandibular trough, suggesting that the angular (tympanic), the articular (malleus), and other \"reptilian\" jaw bones remained attached to the mandible through ligaments long after Teinolophos and living monotremes split from the common ancestor of marsupials and placentals. Another recent study shows that the middle ear bones were no longer accommodated by the internal mandibular trough but were still linked via the ossified Meckel's cartilage to the mandible in some triconodont mammals. These mammals evolved after the divergence of the monotreme and therian (marsupial and placental) lineages (11). The oldest fossil lacking an internal mandibular trough is the Early Jurassic mammaliaform Hadrocodium (see the figure) (12), which suggests that detachment of the middle ear bones from the mandible occurred among extinct mammaliaforms during the Early Jurassic and before the diversification of modern mammalian clades in the Middle Jurassic (13, 14). No matter how complex the modern mammalian middle ear seems to be, when its distribution is mapped onto the latest mammalian family tree, the middle ear bones appear to have evolved at least three times (see the figure).\n \n This revelation about the convergent evolution of middle ear bones is certainly exciting enough for most evolutionary morphologists. But even more dramatic is the fact that the new Teinolophos fossil bears an uncanny resemblance to the australosphenidan mammals of Australia (15) and South America (16, 17). These creatures also possess a very similar internal mandibular trough, indicating that the persisting attachment of the middle ear bones to the mandible is a common feature of both the monotremes and the australosphenidan mammals with tribosphenic molars from Gondwanaland (southern continents) from the Middle Jurassic to the Early Cretaceous, which contrasts sharply with their highly advanced molars. Given current morphological evidence, parsimony predicts the odds in favor of the homoplastic evolution of both the middle ear bones and derived molar features of the australosphenidan mammals (thought by some to include monotremes) (13, 16).\n \n Recent discoveries of Mesozoic mammals from Gondwanaland, including the toothed monotreme Teinolophos, have already changed our perspective of early mammalian evolution (2, 10, 13-17). Teeth and jaws of Teinolophos and its relatives offer a mere hint of how little we know about the diversity of the endemic Mesozoic mammals of Gondwanaland. The new fossil find described by Rich and colleagues sheds light on the great complexity of mammalian genealogical history. It also requires us to accommodate the homoplastic evolution of many complex mammalian cranial and dental structures that would have been unthinkable when we had only the fossil record of Laurasia to consider.\n \n References\n \n 1. G. Wesley-Hunt, J. Vertebr. Paleontol. 24 (suppl. 3), 128A (2004).\n 2. T. H. Rich, J. A. Hopson, A. M. Musser, T. F. Flannery, P. Vickers-Rich, Science 307, 910 (2005).\n 3. C. Reichert, Müllers Arch. Anat. Physiol. Wiss. Med. 1837, 120 (1837).\n 4. E. Gaupp, Archiv Anat. Entwickl. 1912, 1 (1913).\n 5. M. Sánchez-Villagra, S. Gemballa, S. Nummela, K. K. Smith, W. Maier, J. Morphol. 251, 219 (2002). [Medline]\n 6. E. F. Allin, J. A. Hopson, in Evolutionary Biology of Hearing, D. G. Webster, R. R. Fay, A. N. Popper, Eds. (Springer-Verlag, New York, 1992), pp. 587-614.\n 7. T. Rowe, Science 273, [651] (1996).\n 8. T. S. Kemp, Zool. J. Linn. Soc. 77, 353 (1983).\n 9. G. Fleischer, Adv. Anat. Embryol. Cell Biol. 55, 3 (1978). [Medline]\n 10. T. Rich et al., Acta Palaeo. Pol. 46, 113 (2001).\n 11. Y.-Q. Wang, Y.-M. Hu, J. Meng, C.-K. Li, Science 294, [357] (2001).\n 12. Z.-X. Luo, A. W. Crompton, A.-L. Sun, Science 292, [1535] (2001).\n 13. Z.-X. Luo, R. Cifelli, Z. Kielan-Jaworowska, Nature 409, 53 (2001). [Medline]\n 14. Z. Kielan-Jaworowska, R. Cifelli, Z.-X. Luo, Mammals from the Age of Dinosaurs, Origins, Evolution and Structure (Columbia Univ. Press, New York, 2004). [publisher's information]\n 15. T. H. Rich et al., Science 278, [1438] (1997).\n 16. O. W. M. Rauhut, T. Martin, E. Ortiz-Jaureguizar, P. Puerta, Nature 416, 165 (2002). [Medline]\n 17. A. Forasiepi, G. Rougier, A. Martinelli, J. Vertebr. Paleontol. 24 (suppl. 3), 59A (2004). \n\n \n Image is attached.", 
   {
    "post_info": {
     "attachments": 1
    }
   }, 
   124647, 
   null, 
   1116449520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is the creationist's opinion of this article?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5173-what-creationists-opinion-article.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 5173, 
  "discussion_files": [
   [
    "27067.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5173-what-creationists-opinion-article-print.html"
   ], 
   [
    "27068.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5173-what-creationists-opinion-article-3-print.html"
   ], 
   [
    "27069.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5173-what-creationists-opinion-article-2-print.html"
   ]
  ], 
  "identifier": 5173
 }
]