[
 [
  [
   6496, 
   null, 
   "Viking", 
   "All the laws in the world won't work, criminals will always be able to get guns. If they can't buy them, smuggle them in or steal them, they will make them. Criminals have even made guns inside maximum security prisons.\n Follow the link.\n GUN-MAKING AS A COTTAGE INDUSTRY ", 
   {
    "post_info": {
     "post_title": "Why gun control won't work"
    }
   }, 
   null, 
   null, 
   1050059820.0
  ], 
  [
   6507, 
   null, 
   "kelvin90701", 
   "Oh my God. We need to ban brains. It only requires half a brain the be able to build a homemade firearm. Thus people who have a full brain are 2X as dangerous.", 
   {}, 
   6496, 
   null, 
   1050076560.0
  ], 
  [
   6527, 
   null, 
   "Viking", 
   "It has already begun, this clipping is from a local newspaper.\n Paper clipping", 
   {}, 
   6496, 
   null, 
   1050096540.0
  ], 
  [
   6538, 
   null, 
   "voiceofreason", 
   "You must be joking. I'm sure that making a gun is quite a bit more complicated than making a paper airplane.\n \n \nAll the laws in the world won't work, criminals will always be able to get guns.\n Then why do nations which ban guns have a much lower gun crime rate than the US? If what you say is true then we would expect to see the same amount of gun crime in nations which ban guns as in the US, but we don't.", 
   {}, 
   6496, 
   null, 
   1050104760.0
  ], 
  [
   6553, 
   null, 
   "kelvin90701", 
   "With no effort and a credit card:\n \n Home Depot: Metal Pipe closed at one end $10\n \n Drill to make hole touch hole in pipe $40\n \n Charcoal from the supper market $4\n \n Sulphur and potasium Nitrate from the internet $20\n \n A clothes pin and rubber band for a lock, $2\n \n In five minutes I have a soothbore musket, priceless.\n \n The Colt 45 Automatic was first developed in 1903. The metal shop in a high school has tools more advanced that the first gun smiths who built the first Colt 45 Automatic in 1903.", 
   {}, 
   6496, 
   null, 
   1050112140.0
  ], 
  [
   6554, 
   null, 
   "Pie", 
   "\"Then why do nations which ban guns have a much lower gun crime rate than the US?\"\n \n It is not reasonable to compare different countries of different cultures in this sort of thing. Besides, Swisserland has an assualt rifle in every house, and a bitchin'ly low crime rate.", 
   {}, 
   6496, 
   null, 
   1050129360.0
  ], 
  [
   6571, 
   null, 
   "voiceofreason", 
   "That's not true. Only 27.2% of Switzerland's households have guns in them. \n http://www.handgunfree.org/HFAMain/research/abroad/comparison.htm", 
   {}, 
   6496, 
   null, 
   1050193200.0
  ], 
  [
   6573, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n That's not true. Only 27.2% of Switzerland's households have guns in them. \n http://www.handgunfree.org/HFAMain/research/abroad/comparison.htm \n \n \n Another example of misinformation from the VOR. Your tabel counts the private ownership of firearms. The assault rifles kept by militia members are not private firearms.\n \n \"Special Regulations for Military Firearms, Sporting and Hunting Guns\n \n Due to the long tradition and the special organization of the Swiss armed forces as a militia army, special rules are applicable for army weapons. Between their regular annual service of two or three weeks per year, Swiss soldiers and officers keep their personal weapons at home. After they have left the army, they may keep those arms in order to continue practicing at rifle or pistol ranges managed by local communities. Special rules also govern hunting or sporting rifles.\"\n \n http://www.eda.admin.ch/washington_emb/e/home/legaff/Fact/gunown.html\n \n This Swiss are armed to the teeth!", 
   {}, 
   6496, 
   null, 
   1050195300.0
  ], 
  [
   6581, 
   null, 
   "voiceofreason", 
   "Armed to the teeth? If only you had actually looked at the statistics you could have prevented presenting misinformation. Let's see what Lambert, a person who has actually done the research, has to say about this:\n \n \nAll male Swiss citizens between 20 and 50 who are in the army are issued rifles. Roughly 15% of Swiss residents are not citizens, and 20% of the citizens called up do not serve in the army. So, very roughly, that's (50-20)/70*.8*.85 = 15% of the population....In the Encyclopedia of the First World, I found the following\n information:\n \n Pop of Switzerland: 6,800,000\n Average household size: 2.5\n Size of Swiss army: 625,000\n \n There are therefore 6,800,000/2.5=2,700,000 households in Switzerland. The percentage of households containing a soldier is at most 625,000/2,700,000=23%. (Possibly less if some households have more than one soldier.)\n \n\n \n http://www.cse.unsw.edu.au/~lambert/guns/archive/international/msg00003.html", 
   {}, 
   6496, 
   null, 
   1050200760.0
  ], 
  [
   6582, 
   null, 
   "voiceofreason", 
   "Originally posted by kelvin90701 \n Your tabel counts the private ownership of firearms. The assault rifles kept by militia members are not private firearms.\n \n \"....Swiss soldiers and officers keep their personal weapons at home...\"\n This Swiss are armed to the teeth! \n\n \n Your own quote contradicts you. It refers to the weapons that soldiers keep at home as personal weapons. And anyway only 15% of residents of Switzerland serve in the Swiss Army.", 
   {}, 
   6496, 
   null, 
   1050201480.0
  ], 
  [
   6583, 
   null, 
   "kelvin90701", 
   "Cool. If the United States just gets rid of 1 of every 5 guns, then upgrades the remaining guns to assault rifles we will be like the Swiss.\n \n You have my vote.", 
   {}, 
   6496, 
   null, 
   1050202080.0
  ], 
  [
   6584, 
   null, 
   "voiceofreason", 
   "Cool. If the United States just gets rid of 1 of every 5 guns, then upgrades the remaining guns to assault rifles we will be like the Swiss.\n\n \n \n Hey, I can do math. According http://www.handgunfree.org/HFAMain/research/abroad/comparison.htm 41% of US households have guns in them. According to Lambert at most 23% of households have assault rifles in them in Switzerland.\n \n 1/5 of 41% is 8.2%\n \n So if we take away 8.2% from 41% we get 32.8%. Let's turn all the guns into assault rifles. So 32.8% of American homes would have assault rifles- more than 23% of households in Switzerland having assault rifle. \n \n You'd have to take away close to 1/2 of American guns. You certainly have my vote.", 
   {}, 
   6496, 
   null, 
   1050203280.0
  ], 
  [
   6585, 
   null, 
   "wjim1269", 
   "Who cares about Switzerland or any other country? We have to do what is best for the US, which is not necessarily what is best for ANY other country. Look at what Bush did for Texas when he legalized concealed carry. Crime rates went DOWN.\n \n I posted this on another thread, but I will post it again: Rent two apartments in the ghetto area of any nearby city. Place a sign on one that says, \"This home will never contain a gun.\" Place a sign on the other that lists three guns that are inside the house. Wait and see which one gets robbed first.", 
   {}, 
   6496, 
   null, 
   1050210240.0
  ], 
  [
   6595, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n Hey, I can do math. According http://www.handgunfree.org/HFAMain/research/abroad/comparison.htm 41% of US households have guns in them. According to Lambert at most 23% of households have assault rifles in them in Switzerland.\n \n 1/5 of 41% is 8.2%\n \n So if we take away 8.2% from 41% we get 32.8%. Let's turn all the guns into assault rifles. So 32.8% of American homes would have assault rifles- more than 23% of households in Switzerland having assault rifle. \n \n You'd have to take away close to 1/2 of American guns. You certainly have my vote. \n \n \n Then what good is an assault weapons ban? You just voted to repeal the assault weapons ban.", 
   {}, 
   6496, 
   null, 
   1050230700.0
  ], 
  [
   6597, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n That's not true. Only 27.2% of Switzerland's households have guns in them. \n http://www.handgunfree.org/HFAMain/research/abroad/comparison.htm \n \n \n \n Hey, I can do math. According http://www.handgunfree.org/HFAMain/.../comparison.htm 41% of US households have guns in them. According to Lambert at most 23% of households have assault rifles in them in Switzerland. -VOR\n \n Which one is it? 23% or 27%.", 
   {}, 
   6496, 
   null, 
   1050252900.0
  ], 
  [
   6653, 
   null, 
   "JFriday", 
   "VOR name one case that banning guns has lowered crime. And GO READ THE U.K. REPORT THAT I HAVE POSTED COUNTLESS TIMES!!!", 
   {}, 
   6496, 
   null, 
   1050347460.0
  ], 
  [
   7007, 
   null, 
   "Viking", 
   "Let's just face it, the availability of guns has nothing to do with the crime rate. You can quote statistics 'til your faces turn blue and the other side will still have a statistic that says the opposite.\n The reason they have high crime rates in the US is because their culture and media glorifies violence and makes criminals public figures. If you want to be famous in the US the easiest way is to kill a lot of people, you don't even have to use a gun, most serial killers use other methods. \n Crime is a cultural problem but politicians don't like solutions that require insight, long-term planning and expert knowledge. Politicians are just interested in what will help them get reelected, quick fixes that look like they help even if they do nothing in the long run. \n Making another anti-gun law is like spitting in the faces of the victims of crime, \"We could'nt protect you last time but we're gonna make sure you can't protect yourself next time\" That's what they are really saying. \n \n If guns become outlawed, then I guess I'd like it better as an outlaw than a victim of stupid politics. And guns, well they are not hard to make at all, there are lots of plans and blueprints available on the internet so that any normal handyman can make a gun in only a few days.\n In fact I'm making my own blueprints for a 45 calibre submachine gun that will take less than 24 hours to make using only welding equipment and simple handtools you could find in any garage. Even the materials can be found at the local junkyard. \n Now tell me, how is gun control going to stop people from making their own? Are they going to outlaw hacksaws, files and drills next?", 
   {}, 
   6496, 
   null, 
   1051015080.0
  ], 
  [
   7049, 
   null, 
   "voiceofreason", 
   "Originally posted by Viking \n  You can quote statistics 'til your faces turn blue and the other side will still have a statistic that says the opposite.\n \n \n \n I bet you think that statistics is just a game. Pro-gunners say that statistics is just a game because they know the statistics prove them wrong. It didn't take me very long to figure that out. \n \n I found this article about the gun ban in Washington DC.\n \n Possession of a handgun or a loaded firearm in one's home has been illegal in the District since 1976...\n \"The mayor's policy is very clear,\" Mrs. Kellems said. \"He does not support abolition of our very strict gun-control laws. Gun ownership is not a means to control crime, and it's not a good thing for the city and its social structure.\"\n Ownership or possession of a handgun is a misdemeanor. It carries a penalty of a year in prison and a $1,000 fine. On a second offense, it is a felony, punishable by five years in prison and a $5,000 fine....\n \"I think it's a real myth that people would be able to arm themselves and avoid being shot,\" he said. \"Chances are very good that they would accidentally shoot themselves or that the gun would find its way into the hands of a child, which is not what we want.\"\n http://www.washtimes.com/metro/20030212-71671916.htm\n\n \n That just shows the problems with letting people own guns. Washington DC has set a good example for the nation. I think I read somewhere that after the gun ban was passed in DC the crime rate went down.", 
   {}, 
   6496, 
   null, 
   1051047840.0
  ], 
  [
   7054, 
   null, 
   "voiceofreason", 
   "Yes, I was right. This was published in The New England Journal of Medicine.\n \n \nRestrictive licensing of handguns was associated with a prompt decline in homicides and suicides by firearms in the District of Columbia. No such decline was observed for homicides or suicides in which guns were not used, and no decline was seen in adjacent metropolitan areas where restrictive licensing did not apply. Our data suggest that restrictions on access to guns in the District of Columbia prevented an average of 47 deaths each year after the law was implemented. \n http://content.nejm.org/cgi/content/abstract/325/23/1615\n\n \n Think of all the lives that gun-control saved in Washington DC.", 
   {}, 
   6496, 
   null, 
   1051051140.0
  ], 
  [
   7064, 
   null, 
   "kelvin90701", 
   "Dude:\n \n I can not believe it. I can understand a newbie, but YOU? The FBI report on some other thread here clearly states that crime (murder and firearms inclusive) is related to unemployment, poverty, and education. \n \n You don't solve any of those by gun control.", 
   {}, 
   6496, 
   null, 
   1051065240.0
  ], 
  [
   7081, 
   null, 
   "wjim1269", 
   "Think of all the lives that gun-control saved in Washington DC.\n \n \n Think of all the people who were killed or robbed or injured because they didn't have a gun to protect themselves.", 
   {}, 
   6496, 
   null, 
   1051118880.0
  ], 
  [
   7099, 
   null, 
   "voiceofreason", 
   "Kelvin,\n Your post defies logic. Okay, so there is no connection between a gun and shooting someone. There is also no connection between airplanes and flying. And 2+2=5. (lots of sarcasm)\n \n Of course poverty, unemployment, and lack of education are part of the problem but so are firearms.\n \n -Voice of Reason", 
   {}, 
   6496, 
   null, 
   1051130460.0
  ], 
  [
   7115, 
   null, 
   "kelvin90701", 
   "Your NEJM article clearly says that the reduction of firearms will reduce firearm sucide and murder. No argument against that. You do not need gun control to reduce firearm sucide and murder. \n \n Sucide is a mental health issue. Gun control fails to address ALL the sucides. You can address ALL the sucides with mental health. Gun control excludes all the people who will kill themselves without firearms. Mental health will help both people who want to kill themselves with firearms and those who do not want to kill themselves with firearms.\n \n This country has a probelm with violence. Address violence and you begin to address all murders with knives, bats, crowbars, bare hands, and guns. Gun control will only solve the problem with murder with guns.\n \n Gun control will do a good job of \"helping\" people who don't need it, don't want it, and don't care for it.", 
   {}, 
   6496, 
   null, 
   1051152240.0
  ], 
  [
   7127, 
   null, 
   "Viking", 
   "First of all, I don't trust statistics and the reason is very simple. You can get exactly the answers you want by asking the right question. The questions are multi-choice which is a system that is notoriously easy to bias through the wording of the question and the possible answers.\n \n Example:\n What do you think would be the most effective way to keep guns out of our schools?\n A) Impose stricter gun laws.\n B) Ban all guns.\n C) Teach small children to handle assualt rifles in a responsible manner.\n D) Close your eyes and pretend the problem dosn't excist.\n \n Conclusion: 92% of the people questioned thought that imposing stricter gun laws would reduce the number of guns in the schools.\n 8% favored banning all guns.\n \n \n \nOriginally posted by voiceofreason \n Restrictive licensing of handguns was associated with a prompt decline in homicides and suicides by firearms in the District of Columbia. No such decline was observed for homicides or suicides in which guns were not used, and no decline was seen in adjacent metropolitan areas where restrictive licensing did not apply. Our data suggest that restrictions on access to guns in the District of Columbia prevented an average of 47 deaths each year after the law was implemented. \n http://content.nejm.org/cgi/content...act/325/23/1615 \n Don't you see the deliberatly missleading sentence here? Homicide and suicides without guns did not decline? Okay, were they unchanged or did they increase? I'm only hearing half the truth here and I'm expected to fill in the blanks myself? I think the decline in gun-related deaths was because people killed themselves and others by other methods/weapons. This is typical anti-gun tactics. It's not a blatant lie but it's not the whole truth either.\n \n Voiceofreason, please let me explain some things to you as logic is not your strongest trait. Of course there is a connection between guns and shooting someone, no one is denying that. But there is no cause-effect relationship between guns ownership and murder or any other crime for that matter. \n Besides, there is no connection between having a brain and being able to think logically.\n Poverty, unemployment, lack of education, social injustice and Hollywood-violence-worshipping-movies are the problem, but these are social and cultural problems that are harder to do something with. It costs loads of money to solve these problems.\n \n But gun control is fairly cheap, has good PR value, it dosn't do anything about crime but what the heck, I only have to look like I'm doing something about crime, the only issue I care about is getting reelected.\n That's politician logic!!", 
   {}, 
   6496, 
   null, 
   1051178400.0
  ], 
  [
   7183, 
   null, 
   "JFriday", 
   "Here is a stat for you,\n Indianapolis has a murder rate of 9 per 100,000\n Your beloved gun free safe Washinton DC has one of 69 per 100,000\n \n Do you have blinders on or something? Can you not see the truth, look at Britian, guncrime is up 47% since 1997 when they banned guns, so where are these amazing stats that prove that guncontrol works, I have never seen any.", 
   {}, 
   6496, 
   null, 
   1051291980.0
  ], 
  [
   7187, 
   null, 
   "voiceofreason", 
   "According to my article, gun control has saved 47 lives each year in Washington D.C. That's something you can't ignore. Gun-control is like first-aid. It saves lives.\n http://content.nejm.org/cgi/content/abstract/325/23/1615\n \n \n....Ownership or possession of a handgun [in Washington D.C.] is a misdemeanor. It carries a penalty of a year in prison and a $1,000 fine. On a second offense, it is a felony, punishable by five years in prison and a $5,000 fine....\n http://www.washtimes.com/metro/20030212-71671916.htm\n\n That's an effective way to deter people from owning guns and make the public safer. The capital of our nation has set a good example for the rest of our nation.", 
   {
    "post_info": {
     "post_title": "Gun-control is like First-Aid"
    }
   }, 
   6496, 
   null, 
   1051293600.0
  ], 
  [
   7196, 
   null, 
   "kelvin90701", 
   "OK who are you? I am convinced you are a pro-gun person playing stupid. I think you really Stormin Normin. Come on SN joke is over.\n \n If not did you read your own Washington Times article? Dude you crack me up. All the people inteviewed, WHAT A GUN to protect themselves.", 
   {
    "post_info": {
     "post_title": "Re: Gun-control is like First-Aid"
    }
   }, 
   6496, 
   null, 
   1051306440.0
  ], 
  [
   7198, 
   null, 
   "kelvin90701", 
   "\"We're not bad or dangerous people,\" said plaintiff Tom G. Palmer, who lives in the Dupont Circle neighborhood. \"We just want to be able to defend ourselves against an intruder, \" -VOR source\n \n \"Mr. Palmer, 46, a political-science researcher, said that several years ago he and a friend were chased by a group of some 20 young men at night.\n The men threatened to kill Mr. Palmer and his friend, telling them that their bodies would not be found. Mr. Palmer said he stymied his assailants by pulling out a 9 mm handgun.\" -VOR source\n \n Who are you trying to fool?\n \n \"Chances are very good that they would accidentally shoot themselves or that the gun would find its way into the hands of a child, which is not what we want.\" -VOR source\n \n More children die in a bathtub and swiming pool than from accidental discharge. Chances are very low that they would shoot themselves. You source is speaking out of his *ss\".\n \n 3,300 or 49.3% due to Motor-Vehicle accidents\n 1,000 or 14.9% due to drowning\n 660 or 9.9% due to fires, burns and deaths associated with fire\n 250 or 3.7% due to suffocation by ingested object\n 240 or 3.6% due to firearms\n 190 or 2.8% due to falls\n 100 or 1.5% due to poisoning by solids or liquids\n 60 or 0.9% due to poisoning by gases or vapor\n 900 or 13.4% due to all other types\n \n http://www.allegromedia.com/sugi/cablequit.html\n http://www.cdc.gov/ncipc/duip/duip.htm", 
   {}, 
   6496, 
   null, 
   1051308240.0
  ], 
  [
   7201, 
   null, 
   "JFriday", 
   "And not to forget the depressingly low amount of criminals in D.C. who shoot themselves. How many lives a year do guns save, it was estimated at 2.5 million last I checked. I will go look again.", 
   {}, 
   6496, 
   null, 
   1051312080.0
  ], 
  [
   7208, 
   null, 
   "wjim1269", 
   "The capital of our nation has set a good example for the rest of our nation.\n \n \n Yes, with a crime rate larger than New York City, Chicago, Philadelphia, San Francisco, Los Angeles, Indianapolis, and Las Vegas, they're a wonderful example to follow, aren't they?", 
   {}, 
   6496, 
   null, 
   1051323240.0
  ], 
  [
   7209, 
   null, 
   "wjim1269", 
   "Outlawing alcohol didn't keep people from buying or consuming it, and outlawing guns won't keep people from buying or using them either. If I want a gun, I will get a gun regardless of what the law says. Gun control will only take guns out of the hands of law-abiding citizens.", 
   {}, 
   6496, 
   null, 
   1051323360.0
  ], 
  [
   7234, 
   null, 
   "voiceofreason", 
   "*sigh* Problem is the statistics don't support what you say. Why is the gun crime rate so low in some nations compared to the US? It's because in those nations strict gun-control laws have prevented most criminals from obtaining guns. You can't continue to ignore the statistics.", 
   {}, 
   6496, 
   null, 
   1051408440.0
  ], 
  [
   7241, 
   null, 
   "Viking", 
   "The problem is that neither the statistics or logic supports what you say voiceofreason.\n You can't prevent criminals from getting guns.\n Using anti gun logic we should be preventing drunk driving by banning cars.", 
   {}, 
   6496, 
   null, 
   1051442880.0
  ], 
  [
   7243, 
   null, 
   "Crim", 
   "Wouldn't it be banning alcohol to prevent drunk driving?", 
   {}, 
   6496, 
   null, 
   1051464720.0
  ], 
  [
   7267, 
   null, 
   "Viking", 
   "I was talking about anti gun logic, not normal logic. You can twist it anyway you want but it still won't make sense.\n Anyway, they tried to ban alcohol, see how much that helped.\n Banning guns to combat crime is like banning cars to stop drunk driving.", 
   {}, 
   6496, 
   null, 
   1051519500.0
  ], 
  [
   7287, 
   null, 
   "kelvin90701", 
   "Originally posted by Crim \n Wouldn't it be banning alcohol to prevent drunk driving? \n \n \n It is called pro-hibition. It did not work and was repealed.", 
   {}, 
   6496, 
   null, 
   1051587840.0
  ], 
  [
   7302, 
   null, 
   "voiceofreason", 
   "I don't think that you're making a valid comparison. Alcohol and guns are two different things. The US repealed prohibition (the 18th amendment) after only 13 years. \n \n Are nations that ban guns thinking of repealing their laws? I don't think so. They know that they have a much lower gun death rate than the US. They look at the US as an example of what happens when you don't have enough gun-control. It might be hard for someone to understand that who has been brainwashed by so much pro-gun propaganda.\n \n As for cars, banning cars would certainly lower the drunk driving rate, but we obviously need cars for transportation. Consequently, nobody is suggesting banning cars.\n \n Cars, guns, and alcohol are all differents things. Viking is just introducing a bunch of irrelevant arguments and trying to confuse people about the issue so that he can advance his own agenda.", 
   {}, 
   6496, 
   null, 
   1051598880.0
  ], 
  [
   7306, 
   null, 
   "kelvin90701", 
   "quote:\n --------------------------------------------------------------------------------\n Originally posted by voiceofreason \n They've already banned handguns in some areas of the US and the US crime rate has been going down over the last few years. \n --------------------------------------------------------------------------------\n \n What he fails to tell you that crime has been in decline everywhere with or without new gun control laws. Crime has been in decline for 30 years. Serious gun bans have only been around for 10.", 
   {
    "post_info": {
     "post_title": "Deliberate mis-direction to advance his agenda."
    }
   }, 
   6496, 
   null, 
   1051626420.0
  ], 
  [
   7308, 
   null, 
   "JFriday", 
   "Hey VOR go to the Uniform Crime Statistics report and see where the US stands, we are not even in the top ten any more except for Burglary in which we are number 8, go to www.unicri.it and look for yourself.", 
   {}, 
   6496, 
   null, 
   1051627200.0
  ], 
  [
   7323, 
   null, 
   "Viking", 
   "I was not comparing guns and alcohol, it is your brand of logic that would make such a comparison possible. There is no proven connection between the number of guns and the amount of crime and no logical reason why there should be any.\n You twist peoples words like you twist statistics, logic and reason.\n It must be intentional, cause nobody can be that stupid (or can they?).emoticon_confused \n I am using valid arguments while you are just trying to win an argument. If anyone is brainwashed here, it must be you, you're just repeating what you've heard from people who have their own hidden agenda. Grow up and think for yourself, logical reasoning can be really satisfying once you get used to using your own brain.emoticon_xdonno\n \n I see you always use gun crime rates as an argument, are you totally uninterested in other types of violent crimes, what happens when all guns are banned and we only have knife crimes? Are you going to suggest banning knives? Have you really solved any problems when the increase in knife crimes totals the decrease in gun crimes?\n \n As I've said many times before, crime is a cultural problem and can only be solved by changing society. The reason why the US has so much crime is that US society is f :xcensored ked up. Get to grips with the social problems and the crime rate will decrease.\n \n When someone who is honestly mistaken heres the truth, he either ceases to be mistaken or ceases to be honest.", 
   {}, 
   6496, 
   null, 
   1051639740.0
  ], 
  [
   7361, 
   null, 
   "voiceofreason", 
   "Yeah, whatever. Problem is that you can't back up your statements.\n \n \nOriginally posted by Viking \n \n I see you always use gun crime rates as an argument, are you totally uninterested in other types of violent crimes, what happens when all guns are banned and we only have knife crimes? Are you going to suggest banning knives? Have you really solved any problems when the increase in knife crimes totals the decrease in gun crimes?\n \n \n In Washington DC the decrease in gun deaths did not lead to an increase in knife deaths.\n \nThere were also no increases in homicides or suicides by other methods, as would be expected if equally lethal means were substituted for handguns. CONCLUSIONS. Restrictive licensing of handguns was associated with a prompt decline in homicides and suicides by firearms in the District of Columbia. No such decline was observed for homicides or suicides in which guns were not used, and no decline was seen in adjacent metropolitan areas where restrictive licensing did not apply. Our data suggest that restrictions on access to guns in the District of Columbia prevented an average of 47 deaths each year after the law was implemented. \n http://content.nejm.org/cgi/content/abstract/325/23/1615\n", 
   {}, 
   6496, 
   null, 
   1051681680.0
  ], 
  [
   7364, 
   null, 
   "Viking", 
   "Oh my God, the thick-headedness of a brainwashed zealot is amazing emoticon_xbangheadxbanghead:xbanghead\n \n If Tarzan not win argument, Tarzan just say: \"Yeah whatever\".emoticon_xdonno\n \n I think I'll just go and talk to a rock.\n \n If you can't back up your statments with logic, then quoting biased research won't make you look any smarter.\n \"Yes master, tell me what I should think\".emoticon_xclown", 
   {}, 
   6496, 
   null, 
   1051687080.0
  ], 
  [
   7365, 
   null, 
   "Maynard", 
   "how come the anit-gunners are only concerned with gun crime rate? Why do they not care about the violent crime rate? Yes Washington DC may have lower gun crime, but if I am not mistaken, it is probably one of the most dangerous cities in the USA. My sister-in-law lived there for a while, she loves it, but said you don't want to be going anywhere by yourself. \n \n So it seems to the ant-gunners that as long as we dont have guns its good, even if more people are being rape, beat and murdered, right? If I am wrong then someone please explain to me the resoning behind it all. \n \n Here is an example of how guns protect people. I grew up in the supposedly worst, and most feared part of Ogden. Where most the gang members lived. I lived there 19 years, you know how many gun deaths there was? 5, yes I said 5 in 19 years, and do you know why? Everybody had guns. all the gang members went into the more posh areas of town to commit their crimes. I actually feel more safe out in little Mexico as it is called, then up on the east bench where me and my wife live now. So please explain to me how guns hurt more people in that instance?", 
   {}, 
   6496, 
   null, 
   1051715880.0
  ], 
  [
   7377, 
   null, 
   "voiceofreason", 
   "Viking,\n Can't you back up any of your statements with statistics? You haven't done that yet. You just dismiss my statistics because they don't fit your own biased agenda.", 
   {}, 
   6496, 
   null, 
   1051737300.0
  ], 
  [
   7382, 
   null, 
   "wjim1269", 
   "Texas's crime rate went down while Bush was governor. Why? Because Bush got a concealed carry law passed. Now the criminals knew that anyone, anywhere could have a gun, and they thought twice about committing a crime in public.\n \n Also, name one major city that has a crime rate higher than Washington DC's. And before you try, don't say NYC or LA or Chicago or SF, because those will be wrong answers.", 
   {}, 
   6496, 
   null, 
   1051742760.0
  ], 
  [
   7387, 
   null, 
   "voiceofreason", 
   "Originally posted by wjim1269 \n Texas's crime rate went down while Bush was governor. Why? Because Bush got a concealed carry law passed. Now the criminals knew that anyone, anywhere could have a gun, and they thought twice about committing a crime in public.\n \n Also, name one major city that has a crime rate higher than Washington DC's. And before you try, don't say NYC or LA or Chicago or SF, because those will be wrong answers. \n \n \n It's all very nice that you can say that crime rate in Texas has decreased because of more concealed guns and that the crime rate Washington DC is the highest. However, until you can cite specific statistics and studies that support your point of view and tell me the source for information it really amounts to nothing. I can't just take your word for it.\n \n Both you and Viking have been unable to back up your claims.", 
   {}, 
   6496, 
   null, 
   1051746300.0
  ], 
  [
   7388, 
   null, 
   "voiceofreason", 
   "In 1995 there were 12,173.5 crimes per 100,000 in DC\n (page 65) http://www.fbi.gov/ucr/Cius_97/95CRIME/95crime2.pdf\n \n \n In 2001 there were 7,709.6 crimes per 100,000 in DC \n (page 77) http://www.fbi.gov/ucr/cius_01/01crime2.pdf\n \n That's a big drop in crime.", 
   {}, 
   6496, 
   null, 
   1051748940.0
  ], 
  [
   7390, 
   null, 
   "wjim1269", 
   "Crime Rates \n \n Texas Concealed Carry Law Works", 
   {}, 
   6496, 
   null, 
   1051752180.0
  ], 
  [
   7423, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n In 1995 there were 12,173.5 crimes per 100,000 in DC\n (page 65) http://www.fbi.gov/ucr/Cius_97/95CRIME/95crime2.pdf\n \n \n In 2001 there were 7,709.6 crimes per 100,000 in DC \n (page 77) http://www.fbi.gov/ucr/cius_01/01crime2.pdf\n \n That's a big drop in crime. \n \n \n That's nice. A drop in crime due to what? I don't know and I can't tell from your numbers. Your statistics don't know and you don't too. No where in your fbi crime reports gives credit to the drop in crime is due to gun control.\n \n I am absolutely sure you don't read your own sources. Examples:\n \n 1) Department of Justice Assault rifle study\n \n 2) Washington Times law suit for DC gun ban\n \n 3) and now the FBI crime report.", 
   {}, 
   6496, 
   null, 
   1051774440.0
  ], 
  [
   7432, 
   null, 
   "JFriday", 
   "He has to be a pro gun person in disguise almost all of his sources are progun, really, are you just doing this to make people mad? It might be SN there just trying to play a joke on us and getting a kick out of all this. Whats next? He might list the U.K. report that I always use and say that it shows a drop in crime\n hehehe.", 
   {}, 
   6496, 
   null, 
   1051805580.0
  ], 
  [
   7439, 
   null, 
   "voiceofreason", 
   "Kelvin,\n Apparently, you don't read my posts very carefully. Nowhere did I say that the drop of the general crime rate in DC in the FBI Uniform Crime Report was due to the gun ban. But my New England Journal of Medicine article concluded that the gun ban led to a drop in the homicide rate. \n \n And you should be fair. It doesn't say the drop in the overall crime rate in DC was due to the gun ban in the FBI report, but where in the UK report does it say that the rise in gun crime is due to the gun ban? \n \n -Voice of Reason", 
   {}, 
   6496, 
   null, 
   1051815660.0
  ], 
  [
   7484, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n \n quote:\n --------------------------------------------------------------------------------\n Originally posted by voiceofreason \n In 1995 there were 12,173.5 crimes per 100,000 in DC\n (page 65) http://www.fbi.gov/ucr/Cius_97/95CRIME/95crime2.pdf\n \n \n In 2001 there were 7,709.6 crimes per 100,000 in DC \n (page 77) http://www.fbi.gov/ucr/cius_01/01crime2.pdf\n \n That's a big drop in crime. \n --------------------------------------------------------------------------------\n \n And you should be fair. \n -Voice of Reason \n \n \n Sorry I did jump to conclusions, but that post was also very vague.\n \n You are right that gun bans do reduce homicide rates, but it does not protect people who are not killed by guns. They still get killed anyhow. \n \n Murder is a violence problem. Cure violence and you cure both forms of murder: firearm and non-firearms murder; and you do it without punishing law abiding citizens. Gun control will not help people who are killed with a knife, but it will surely disarm people who need to protect themselves. \n \n I think you need to read your own post carefully. Historically you have shown a very gross ineptitude of posting pro-gun articles.", 
   {}, 
   6496, 
   null, 
   1051844100.0
  ], 
  [
   7725, 
   null, 
   "JFriday", 
   "Those reports point out a crime rate that was already declining, there is nothing to indicate that the gun bans had anything to do with crime at all in those, go look at the average persons income in state and compare it to the crime rate there, you will find almost predictable outcome. And the UK report was not supposed to find the cause of the rising crime rate, it was just supposed to point it out, I do find it strange though that the Crime rate (which was declining) started to go up in the same year as guns were banned. The same thing happened in Australia as well.", 
   {}, 
   6496, 
   null, 
   1052198820.0
  ], 
  [
   7775, 
   null, 
   "voiceofreason", 
   "The overall crime rate in the UK has been going down since the gun ban. As for Australia, well I bet you read that on some pro-gun website.", 
   {}, 
   6496, 
   null, 
   1052281620.0
  ], 
  [
   7882, 
   null, 
   "kelvin90701", 
   "From cbs.com and the 60 minutes website, I learned something new today.\n \n The single most common form of firearm death broken down by race and gender, is:\n \n White men by sucide.\n \n Not crime and not by accident. \n \n Take the deaths by crime for white women and black men and women (6897), and you will almost total deaths by white men by sucide (13,214).\n \n So if you want to stop gun deaths, then you focus your effort on white men who want to kill themselves. Interesting.", 
   {}, 
   6496, 
   null, 
   1052520540.0
  ], 
  [
   10627, 
   null, 
   "Alfaholic", 
   "The crime-rate went up in England because of gun control. Take a look.\n \n http://reason.com/0211/fe.jm.gun.shtml\n \n http://www.foxnews.com/story/0,2933,59866,00.html\n \n http://www.car-crime.com/crime_rate.htm\n \n http://www.ncpa.org/pi/crime/oct98a.html\n \n http://www.ojp.usdoj.gov/bjs/pub/html/cjusew96/crvs.htm\n (that ones good, has charts)\n \n It is now a fact that gun control doesn't work. Thank you for leading the way England for showing this. By the way, I'm picking up an AR-15 Thursday. It's gonna be sweet. Can't wait.", 
   {}, 
   6496, 
   null, 
   1056327720.0
  ], 
  [
   10628, 
   null, 
   "Alfaholic", 
   "Originally posted by kelvin90701 \n From cbs.com and the 60 minutes website, I learned something new today.\n \n The single most common form of firearm death broken down by race and gender, is:\n \n White men by sucide.\n \n Not crime and not by accident. \n \n Take the deaths by crime for white women and black men and women (6897), and you will almost total deaths by white men by sucide (13,214).\n \n So if you want to stop gun deaths, then you focus your effort on white men who want to kill themselves. Interesting. \n \n \n My statistics show something different. This one says blacks commit more violent crime than whites.\n http://www.ojp.usdoj.gov/bjs/glance/race.htm\n \n This one says that males are getting closer to females in committing violent crimes.\n http://www.ojp.usdoj.gov/bjs/glance/vsx2.htm", 
   {}, 
   6496, 
   null, 
   1056329220.0
  ], 
  [
   10635, 
   null, 
   "kelvin90701", 
   "Originally posted by Alfaholic \n My statistics show something different. This one says blacks commit more violent crime than whites.\n http://www.ojp.usdoj.gov/bjs/glance/race.htm\n \n This one says that males are getting closer to females in committing violent crimes.\n http://www.ojp.usdoj.gov/bjs/glance/vsx2.htm \n \n \n Uh?\n \n \n This is about all froms of criminal victimizatlion:\n http://www.ojp.usdoj.gov/bjs/glance/race.htm\n \n This is about perps broken down by gender for all crimes:\n http://www.ojp.usdoj.gov/bjs/glance/vsx2.htm\n \n This is about death from fireamrs both murder and sucide:\n *****************************\n \"The single most common form of firearm death broken down by race and gender, is:\n \n White men by sucide.\n \n Not crime and not by accident. \"\n *****************************\n \n Please explain \"my statistic show something different\"?", 
   {}, 
   6496, 
   null, 
   1056336000.0
  ], 
  [
   10716, 
   null, 
   "voiceofreason", 
   "Originally posted by Alfaholic \n The crime-rate went up in England because of gun control. Take a look.\n \n http://reason.com/0211/fe.jm.gun.shtml\n \n http://www.foxnews.com/story/0,2933,59866,00.html\n \n http://www.car-crime.com/crime_rate.htm\n \n http://www.ncpa.org/pi/crime/oct98a.html\n \n http://www.ojp.usdoj.gov/bjs/pub/html/cjusew96/crvs.htm\n (that ones good, has charts)\n \n It is now a fact that gun control doesn't work. Thank you for leading the way England for showing this. By the way, I'm picking up an AR-15 Thursday. It's gonna be sweet. Can't wait. \n \n That Department of Justice study doesn't support your opinion since it doesn't examine crime statistics after the UK gun ban. \n \n \nBritish Crime Survey trends since 1997 indicate:\n \n All crime down 27 per cent \n \n Burglary down 39 per cent \n \n Vehicle thefts down 32 per cent \n \n Violence crime down 26 per cent \n http://www.policesupers.com/scripts/currentnews.ASP?news_id=314\n\n Sounds like the UK crime rate has been going down to me. Alfaholic is jumping to conclusions.", 
   {}, 
   6496, 
   null, 
   1056457140.0
  ], 
  [
   10829, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n That Department of Justice study doesn't support your opinion since it doesn't examine crime statistics after the UK gun ban. \n \n \n Sounds like the UK crime rate has been going down to me. Alfaholic is jumping to conclusions. \n \n \n That was in 1997.\n \n Did you forget that the UK was recently slammed in Jan 2003 for:\n \n Counting multiple attackers as a single attack.\n (In the USA multiple attackers are counted each as separate attack.)\n \n A crime is not counted unless there is a conviction in the UK.\n (In the USA a crime is counted, even when no gulty party is found. In other words in the UK a dead body is not a murder until they convict the murderer. No conviction, no murder, eventhough there is a dead body.)\n \n A string of crimes committed by the same party is counted as 1 crime.\n \n I am suprised you forgot all about that. We had a very lengthy posting session regarding the false reporting of UK statistics in another thread. Sorry for pointing the finger, I myself am guilty of selective memory.", 
   {}, 
   6496, 
   null, 
   1056512460.0
  ], 
  [
   11213, 
   null, 
   "Alfaholic", 
   "That Department of Justice study doesn't support your opinion since it doesn't examine crime statistics after the UK gun ban. \n \n \n Sounds like the UK crime rate has been going down to me. Alfaholic is jumping to conclusions.\n\n \n I guess you failed to look at these two. \n \n http://reason.com/0211/fe.jm.gun.shtml\n \n http://www.foxnews.com/story/0,2933,59866,00.html\n \n Here's a little question.... If you were a criminal.... would you rather rob from a house where you knew the owner didn't have a gun or would you rob someone you knew had a gun?", 
   {}, 
   10716, 
   null, 
   1056866880.0
  ], 
  [
   11335, 
   null, 
   "DHard3006", 
   "You must be joking. I'm sure that making a gun is quite a bit more complicated than making a paper airplane.\n \n Then why do nations which ban guns have a much lower gun crime rate than the US? If what you say is true then we would expect to see the same amount of gun crime in nations which ban guns as in the US, but we don't.\n\n \n \n If guns are banned in these nations why do they still have crimes with guns? \n \n Plus the nations that ban guns do not have a right like the 2nd amend protecting these nations citizens right to bear arms.\n \n Gun haters think banning guns will make criminals stop being criminals. Any time a person defends no limits on a right, the gun hater accuse that person of being unreasonable. \n \n Which is more reasonable? \n \n People that defend the right to bear arms that demand laws that punish criminals by keeping them in prison thus keeping guns away from them.\n \n Gun haters a hate group that attacks rights, then demands that guns be banned and dangerous criminals be allowed out of prison.\n \n Why do I say this about gun haters? \n Simple not one of the gun control laws the gun haters demand will punish criminals. Not one of the gun control laws the gun haters demand will keep dangerous criminals in prison. \n \n What do gun haters want to do? \n Simple gun haters want to allow dangerous criminals out of prison onto the streets of America. Then gun haters want to ban a right in an attempt at keeping gun away from these dangerous criminals.\n \n Just who obeys the gun control laws? Law abiding citizens! \n \n It would appear the only goal of the gun haters is to take the right to bear arms away from the law abiding citizen!", 
   {}, 
   6538, 
   null, 
   1057074600.0
  ], 
  [
   11378, 
   null, 
   "voiceofreason", 
   "If guns are banned in these nations why do they still have crimes with guns?\n\n They have very few gun crimes relative to the US. So it appears that the laws are working for the most part. \n \n \nIf guns are banned in these nations why do they still have crimes with guns? Gun haters think banning guns will make criminals stop being criminals. Any time a person defends no limits on a right, the gun hater accuse that person of being unreasonable. \n\n Who is saying that taking away guns will make people stop being criminals? Only the extremists say that there should be no limits for gun ownership. \n \n \nGun haters a hate group that attacks rights, then demands that guns be banned and dangerous criminals be allowed out of prison.\n\n Who is demanding that dangerous criminals be let out of prison? \n \n \nWhat do gun haters want to do? \n Simple gun haters want to allow dangerous criminals out of prison onto!\n\n Again, who is saying that? You distort what your opponents say because it makes it easier for you to win the argument.", 
   {}, 
   11335, 
   null, 
   1057231980.0
  ], 
  [
   11395, 
   null, 
   "DHard3006", 
   "Gun haters claim banning guns will stop gun deaths. Countries with gun bans still have gun deaths. It appears gun haters use the lie that gun bans will stop gun deaths to justify gun bans. Then gun haters chant countries with gun bans have fewer deaths. This only make it clear that gun bans do not stop gun deaths. Gun bans simple ban law abiding citizens from having guns. After all that is the goal of the gun haters. Gun haters could careless about keeping guns from criminals. Criminals do not obey gun ban laws!\n \n Extremist are the gun haters that want to limit the rights of law abiding Americans to prevent criminals from getting guns. Once again criminals will not obey gun ban laws! \n \n Not one law the gun haters demand deals with keeping dangerous criminals in prison. If people are to dangerous to have guns, then why do the gun haters want these people out of prison? People that defend the right to bear arms demand that dangerous criminals be retained in prison. This way you keep guns away from dangerous criminals. And you do not infringe on the rights of the law abiding citizen!\n \n Please show one law where the gun haters demand that dangerous criminals be keep in prison. Instead the gun haters use the lie of keeping guns from dangerous criminals to push for gun bans!\n \n As for you remark about keeping guns from kids. Do you have any documented incidents of a kid walking into a gun store and buying a gun from the gun dealer? Was there a rash of kids doing this to prompt the age laws?\n \n As for your militia remark. There is no requirement in the 2nd amend to be in a militia to bear arms. It does say militias may be regulated. If you are not in militia then you would not fall under this regulation. The 2nd amend does say \"the right of the people to keep and bears arms shall not be infringed!\"", 
   {
    "post_info": {
     "post_title": "Criminals do not obey gun bans!"
    }
   }, 
   11378, 
   null, 
   1057262040.0
  ], 
  [
   11397, 
   null, 
   "voiceofreason", 
   "According to data collected from each nation's embassy- \"In 1996, handguns were used to murder 2 people in New Zealand, 15 in Japan, 30 in Great Britain, 106 in Canada and 9,390 in the United States.\"\n \n Would you rather have a lot of gun deaths or only a few? And tell me of a law that is 100% effective. There are traffic laws, but there are still car accidents. Does that mean we shouldn't have any traffic laws? No, not if those traffic laws lead to a reduction in car accidents which they do. \n \n As for the second amendment and whether gun ownership is a right or a priviledge we can discuss later.", 
   {}, 
   11395, 
   null, 
   1057284540.0
  ], 
  [
   11400, 
   null, 
   "kelvin90701", 
   "According to data collected from each nation's embassy- \"In 1996, handguns were used to murder 2 people in New Zealand, 15 in Japan, 30 in Great Britain, 106 in Canada and 9,390 in the United States.\"\n \n Would you rather have a lot of gun deaths or only a few? And tell me of a law that is 100% effective. There are traffic laws, but there are still car accidents. Does that mean we shouldn't have any traffic laws? No, not if those traffic laws lead to a reduction in car accidents which they do. \n \n As for the second amendment and whether gun ownership is a right or a priviledge we can discuss later.\n\n \n Regarding your signature. The militia is NOT the National Guard.", 
   {}, 
   11397, 
   null, 
   1057290180.0
  ], 
  [
   11760, 
   null, 
   "DHard3006", 
   "According to data collected from each nation's embassy- \"In 1996, handguns were used to murder 2 people in New Zealand, 15 in Japan, 30 in Great Britain, 106 in Canada and 9,390 in the United States.\"\n \n Would you rather have a lot of gun deaths or only a few? And tell me of a law that is 100% effective. There are traffic laws, but there are still car accidents. Does that mean we shouldn't have any traffic laws? No, not if those traffic laws lead to a reduction in car accidents which they do. \n \n As for the second amendment and whether gun ownership is a right or a priviledge we can discuss later.\n\n \n Laws that pertain to cars do not ban cars. Laws that pertain to cars hold the person accountable for the misuse of cars. \n \n Gun bans are only obeyed by the law abiding citizen. Gun bans have no affect on criminals. The gun deaths in countries that have banned guns proves this argument.\n \n The 2nd amend is an individual right! Why because the very same words are used to describe it. The same words are used to describe our other rights. \"The right of the people\" are these words. Now gun haters are you going to start chanting that all rights are collective rights?", 
   {}, 
   11397, 
   null, 
   1057817640.0
  ], 
  [
   11768, 
   null, 
   "wjim1269", 
   "Even though your car analogy has already been shown to be wrong, I would like to use it to prove a separate point.\n \n I will admit, I drive over the speed limit all the time. Do I know that I am breaking the law? Yes. Do I know that I can get in trouble for doing it? Yes. Do I know that it could increase my chances of having an accident? Yes. Do I drive slower despite the fact that I know all these? No.\n \n If you institute gun-control, criminals also won't care that they are breaking the law by having a gun. Just like I still drive over the speed limit despite all the reasons I posted why I should not do so, criminals will still use guns even if you make it illegal.", 
   {}, 
   11760, 
   null, 
   1057819560.0
  ], 
  [
   11770, 
   null, 
   "kelvin90701", 
   "Even though your car analogy has already been shown to be wrong, I would like to use it to prove a separate point.\n \n I will admit, I drive over the speed limit all the time. Do I know that I am breaking the law? Yes. Do I know that I can get in trouble for doing it? Yes. Do I know that it could increase my chances of having an accident? Yes. Do I drive slower despite the fact that I know all these? No.\n \n If you institute gun-control, criminals also won't care that they are breaking the law by having a gun. Just like I still drive over the speed limit despite all the reasons I posted why I should not do so, criminals will still use guns even if you make it illegal.\n\n \n I have another point for you. I keep a .45 by the bed because a gun-hater is not going to be at my home to protect me when I have to use a .45.", 
   {}, 
   11768, 
   null, 
   1057820520.0
  ], 
  [
   11781, 
   null, 
   "voiceofreason", 
   "Even though your car analogy has already been shown to be wrong, I would like to use it to prove a separate point.\n\n If that analogy is wrong then why are you using it?", 
   {}, 
   11770, 
   null, 
   1057829100.0
  ], 
  [
   11805, 
   null, 
   "kelvin90701", 
   "If that analogy is wrong then why are you using it?\n\n \n The car analogy has not been proven. It is merely a statement of his opinion. \n \n There is no proof in any post of the analogy proven wrong from the time Dhard made the analogy to the time WJIM decleared it to be wrong. He was only stating his opinion.", 
   {}, 
   11781, 
   null, 
   1057884780.0
  ], 
  [
   11806, 
   null, 
   "kelvin90701", 
   "According to data collected from each nation's embassy- \"In 1996, handguns were used to murder 2 people in New Zealand, 15 in Japan, 30 in Great Britain, 106 in Canada and 9,390 in the United States.\"\n \n Would you rather have a lot of gun deaths or only a few? And tell me of a law that is 100% effective. There are traffic laws, but there are still car accidents. Does that mean we shouldn't have any traffic laws? No, not if those traffic laws lead to a reduction in car accidents which they do. \n \n As for the second amendment and whether gun ownership is a right or a priviledge we can discuss later.\n\n \n Gun owernship is most definatley a right. You don't need a license to buy a firearm.\n \n A drivers license is a priviledge. You must ask permission from the state to drive a car. You don't need a licesne to buy a car, but you most definately need to ask permission from the government before you drive.\n \n I don't have to ask permission to exercise rights. Priviledges are granted by the state.\n \n Please please please don't ever forget the difference between the two. Many many many men/women have died and are burried overseas and at home to secure your rights. I for one would be very sad to think that the men who died in combat died to secure my \"priviledges\".", 
   {}, 
   11397, 
   null, 
   1057885260.0
  ], 
  [
   11817, 
   null, 
   "wjim1269", 
   "VOR, I have pointed out the error in your analogy numerous times. Also, I believe that DHard3006 restated what I have said every time you have posted that analogy.\n \n Regardless, I used the analogy not to prove any point of mine, but to show a further error in your thinking.", 
   {}, 
   11806, 
   null, 
   1057892400.0
  ], 
  [
   11820, 
   null, 
   "voiceofreason", 
   "\n Regardless, I used the analogy not to prove any point of mine, but to show a further error in your thinking.\n\n Then why did you say, \"I would like to use it to prove a separate point.\"\n At that time you said you were using it to prove a point.\n \n If you can use the analogy to prove a point then why can't I?", 
   {}, 
   11817, 
   null, 
   1057896900.0
  ], 
  [
   11861, 
   null, 
   "SilentPoet", 
   "voiceofreason,\n \n \n Please stay on topic of \"why gun control won't work\"", 
   {}, 
   11820, 
   null, 
   1057949460.0
  ], 
  [
   11969, 
   null, 
   "wjim1269", 
   "VOR,\n \n You selectively edited my statement. I said that I did not use it to prove any point of mine. I never said that I wasn't going to use it to prove a point.\n \n As I mentioned, I used it to show a further error in your analogy. That was my point.\n \n SilentPoet,\n \n This is not off-topic. It is a mini-debate over a statement I made in the debate.", 
   {}, 
   11861, 
   null, 
   1058158080.0
  ], 
  [
   34664, 
   null, 
   "Countryboy", 
   "Gun control won't work at all this is why-<\n Crime by definition is\n \n crime: \n 1. An act committed or omitted in violation of a law forbidding or commanding it and for which punishment is imposed upon conviction. \n 2. Unlawful activity: statistics relating to violent crime. \n 3. A serious offense, especially one in violation of morality. \n 4. An unjust, senseless, or disgraceful act or condition: It's a crime to squander our country's natural resources. \n \n and who commits crimes, Criminals, so if you take guns away from law abiding citizens insuring that criminals will still be able to get weapons will have more targets to attack because people don't have any defense against criminals.", 
   {
    "post_info": {
     "post_title": "Gun Control Will NOT work"
    }
   }, 
   6597, 
   null, 
   1076645220.0
  ], 
  [
   34666, 
   null, 
   "JustAnotherGuy", 
   "Talking about the right to bear arms with anti-gun/gun control advocates is like talking about civil rights with racist. It does nothing but fall on deaf ears! \n \n Anti-gun/gun control advocates are not worried about keeping guns away from criminals! \n \n Anti-gun/gun control advocates want one thing and that is to ban the right to bear arms!\n \n On the news program 20/20 a group of criminals were asked do they obey gun control laws, this group of criminals replied NO!", 
   {}, 
   34664, 
   null, 
   1076647200.0
  ], 
  [
   34672, 
   null, 
   "kelvin90701", 
   "Gun control won't work at all this is why-<\n Crime by definition is\n \n crime: \n 1. An act committed or omitted in violation of a law forbidding or commanding it and for which punishment is imposed upon conviction. \n 2. Unlawful activity: statistics relating to violent crime. \n 3. A serious offense, especially one in violation of morality. \n 4. An unjust, senseless, or disgraceful act or condition: It's a crime to squander our country's natural resources. \n \n and who commits crimes, Criminals, so if you take guns away from law abiding citizens insuring that criminals will still be able to get weapons will have more targets to attack because people don't have any defense against criminals.\n\n \n Sound great to me. \n \n You know what? The anti-gunners don't care what you think.\n \n I don't know what legal doctrine they use to justify keeping guns away from good people, but the concept of a blanket to restrict the rights of both guilty and innocent together is fundamentally wrong. It violates all notions of personal responsibility. Punishment is the restriction of rights. Gun control is fundamentally wrong when it restricts both guilty and innocent together.", 
   {}, 
   34664, 
   null, 
   1076653620.0
  ], 
  [
   34678, 
   null, 
   "daewoo", 
   "With no effort and a credit card:\n \n Home Depot: Metal Pipe closed at one end $10\n \n Drill to make hole touch hole in pipe $40\n \n Charcoal from the supper market $4\n \n Sulphur and potasium Nitrate from the internet $20\n \n A clothes pin and rubber band for a lock, $2\n \n In five minutes I have a soothbore musket, priceless.\n \n The Colt 45 Automatic was first developed in 1903. The metal shop in a high school has tools more advanced that the first gun smiths who built the first Colt 45 Automatic in 1903.\n\n \n I know this is an old posting, but I thought I would add to it. I have built several 1911 clones. Press forge the frame (and slide, sometimes), then mill the parts. I use a CNC mill (about $750,000). A lot fo guys, though, use a $300 minimill from harbor freight. A setup for press forging the parts (press forging is the better modern alternative to drop forging) will set you back less than $200, if you are a good scrounger.\n \n Gun building is probably a more common hobby than you might think. It is hard to tell exactly how many people are doing it, because a homebuilt gun requires no registration, permit to build, or any of that other XXXX (unless you are building an NFA firearm, which is a machine gun). There is even a yahoo group about building your own gun. Fro the faint of heart (those who don't want to forge or cast theri own reciver/frame) there are a bunch of places that will sell you an 80% finished reciever, which doesn't count as a firearm from a legal viewpoint. \n \n I always buy my barrels since it is too much work to do the rifling. In a pinch, it could be done, it just wouldn't be a competition grade barrel. Of course, most firearms you buy don't come with a stock competition grade barrel.", 
   {}, 
   6553, 
   null, 
   1076656500.0
  ], 
  [
   34680, 
   null, 
   "kelvin90701", 
   "I know this is an old posting, but I thought I would add to it. I have built several 1911 clones. Press forge the frame (and slide, sometimes), then mill the parts. I use a CNC mill (about $750,000). A lot fo guys, though, use a $300 minimill from harbor freight. A setup for press forging the parts (press forging is the better modern alternative to drop forging) will set you back less than $200, if you are a good scrounger.\n \n Gun building is probably a more common hobby than you might think. It is hard to tell exactly how many people are doing it, because a homebuilt gun requires no registration, permit to build, or any of that other XXXX (unless you are building an NFA firearm, which is a machine gun). There is even a yahoo group about building your own gun. Fro the faint of heart (those who don't want to forge or cast theri own reciver/frame) there are a bunch of places that will sell you an 80% finished reciever, which doesn't count as a firearm from a legal viewpoint. \n \n I always buy my barrels since it is too much work to do the rifling. In a pinch, it could be done, it just wouldn't be a competition grade barrel. Of course, most firearms you buy don't come with a stock competition grade barrel.\n\n \n Interesting.\n \n I got a point to hash out?\n \n If the anti-gunners ban buying guns? Then can we just make our own?", 
   {}, 
   34678, 
   null, 
   1076657400.0
  ], 
  [
   34689, 
   null, 
   "daewoo", 
   "Interesting.\n \n I got a point to hash out?\n \n If the anti-gunners ban buying guns? Then can we just make our own?\n\n \n I don't know about you, but I know I could, and I will assume that you could, also. \n \n It really a very simple thing to do. Plans, scaled blueprints and a couple of good books on metlaworking would get you right in business. I think that a realistic number for seting up a shop to turn out your own guns is probably about $1000. This would include a milling machine, a hydraulic press (actually, a 25,000 ton bottle and some steel beams, you would have to put the thig together yourself......it is good practice). This would prety much give you the ability to build your own forged frames and slides. Everything else on most guns can bemilled (hammers, slide locks, safeties, etc...)\n \n I started building my own because I wanted some stuff included that wasn't offered from a manufaturer. I wrtoe a letter to the ATF asking about the legality of building your own gun. They said you can build your own gun, as long as you are not building it for resale, you don't need a permit, serial numbers, or any of that other XXXX. I have sold a couple of guns I have built. According to the ATF, as long as the primary consideration of building the gun is NOT to sell it, you are OK doing this.\n \n I have several dozen handguns I have built myself. It is not worth doing if you are just going to build a 1911 clone or a p228 (these are my 2 favorite guns) to factory specs. If you want to build something \"special\" though, it is the only way to go. An example:\n \n I just finished a p228 today with a blasted stainless frame. The slide rails (both on the frame and the slide) are graphite imprgnated so you never have to worry about lubrication. Trigger, slide, and hammer are damascus consisting of 1045 steel and nickle sheet. When you etch this, you end up with a dark grey \"background\" with silver inlays (I prefer either a ladder pattern or amiden hair pattern).\n \n You can't pick something like that up down at your local Gun Den. \n \n People don't think about this kind of thing. They go \"that would be far too complicated\". This is a load of XXXX. You could set up an operation that turned out 75-100 guns a day for probably 10 grand, and you would only need about 5 guys to staff it. \n \n Just one more reason that gun control won't work........", 
   {}, 
   34680, 
   null, 
   1076661720.0
  ], 
  [
   34975, 
   null, 
   "voiceofreason", 
   "I don't know about you, but I know I could, and I will assume that you could, also. \n \n It really a very simple thing to do. Plans, scaled blueprints and a couple of good books on metlaworking would get you right in business. I think that a realistic number for seting up a shop to turn out your own guns is probably about $1000. This would include a milling machine, a hydraulic press (actually, a 25,000 ton bottle and some steel beams, you would have to put the thig together yourself......it is good practice). This would prety much give you the ability to build your own forged frames and slides. Everything else on most guns can bemilled (hammers, slide locks, safeties, etc...)\n \n I started building my own because I wanted some stuff included that wasn't offered from a manufaturer. I wrtoe a letter to the ATF asking about the legality of building your own gun. They said you can build your own gun, as long as you are not building it for resale, you don't need a permit, serial numbers, or any of that other XXXX. I have sold a couple of guns I have built. According to the ATF, as long as the primary consideration of building the gun is NOT to sell it, you are OK doing this.\n \n I have several dozen handguns I have built myself. It is not worth doing if you are just going to build a 1911 clone or a p228 (these are my 2 favorite guns) to factory specs. If you want to build something \"special\" though, it is the only way to go. An example:\n \n I just finished a p228 today with a blasted stainless frame. The slide rails (both on the frame and the slide) are graphite imprgnated so you never have to worry about lubrication. Trigger, slide, and hammer are damascus consisting of 1045 steel and nickle sheet. When you etch this, you end up with a dark grey \"background\" with silver inlays (I prefer either a ladder pattern or amiden hair pattern).\n \n You can't pick something like that up down at your local Gun Den. \n \n People don't think about this kind of thing. They go \"that would be far too complicated\". This is a load of XXXX. You could set up an operation that turned out 75-100 guns a day for probably 10 grand, and you would only need about 5 guys to staff it. \n \n Just one more reason that gun control won't work........\n\n A very weak argument against gun control. According to that logic the UK should have about as many gun deaths as the US because you say that if people can't legally access guns then they will just make their own guns. But wait a minute, the gun death rate in the UK is much lower.", 
   {}, 
   34689, 
   null, 
   1077018000.0
  ], 
  [
   34983, 
   null, 
   "JustAnotherGuy", 
   "A very weak argument against gun control. According to that logic the UK should have about as many gun deaths as the US because you say that if people can't legally access guns then they will just make their own guns. But wait a minute, the gun death rate in the UK is much lower.\n\n \n \n First off are you an American or British? \n \n If you are claiming gun control works in the UK because of fewer gun deaths you are wrong. Which citizens in the UK are obeying the gun bans there? Are the criminals obeying the gun bans? Are law-abiding citizens obeying the gun bans? It is clear all the gun bans did in the UK was to prevent law-abiding citizens from having guns!\n \n Another reason for not comparing the US to the UK on the 2nd amend is that the UK does not have a right like the 2nd amend. So there is nothing to compare. This is also why the UK can ban guns and the US cannot.", 
   {}, 
   34975, 
   null, 
   1077029580.0
  ], 
  [
   35014, 
   null, 
   "daewoo", 
   "Having been to the UK, and having a couple of associates there who are somewhat less than reputable, I happen to know that you don't need to make your own. They are not THAT hard to come by. Of course, I have also been told \"you don't really need a gun over here. The people are such a bunch of babies that theres really no point to it.\"\n \n Making weapons is a last resort. We would most likely never have to build our own. They already import drugs by the ton into the US, and I am told that smuggling guns is even easier becasue they don't have gun sniffing dogs.", 
   {}, 
   34983, 
   null, 
   1077046680.0
  ], 
  [
   35256, 
   null, 
   "Countryboy", 
   "I have also been told \"you don't really need a gun over here. The people are such a bunch of babies that theres really no point to it.\n\n \n i agree with that, they are, i have met someone who is a friend of my grandma's that lives there and me and my dad are hunters, and when we mentioned that we go hunting, he asked if we had are weapons with us and of course we did at that time, we just got bac from hunting, and he completly fliped, he wouldn't talk to us if it was just my father, him, and me, but if my grandma was in the room than he was ok, i know that you might say that he thinks gunowner's are bad, but my grandma says that guns scare anyone that comes from that area where he lives.", 
   {}, 
   35014, 
   null, 
   1077235860.0
  ], 
  [
   35260, 
   null, 
   "daewoo", 
   "I had a british guy and his family (wife, 2 kids) move in down the road from me (about 1/2 mile). I have a pretty decent firing range set up behind the house, and have people over pretty often to do some shooting. Drove the poor guy nuts. They moved after only 3 months. Every time anybody would be out there shooting, they would call the sheriffs department. Sheriffs department finally charged the guy with false police reports or false 911 calls or something. \n \n He came down right before he moved to tell me that he was moving somehere \"safer\". I hope he moves somewhere really safe where guns are illegal. I am thinking he would enjoy New York, or Compton.", 
   {}, 
   35256, 
   null, 
   1077237300.0
  ], 
  [
   35266, 
   null, 
   "Countryboy", 
   "daewoo....do you think this is why there is a lower death rate in the UK than in the US? Because of how chicken all the UK people are (No offense meant to any) or is there another reason?", 
   {}, 
   35260, 
   null, 
   1077242520.0
  ], 
  [
   35287, 
   null, 
   "daewoo", 
   "I personally don't know enough folks from the UK to say. When I said they were big babies, I was quoting some friends who have lived there for quite a while. The guy up the road, well, I don't consider him a wimp, just an idiot who has been brainwashed by the socialists.\n \n When you say the death rate is lower, do you mean death due to crime? If that is the case, I think the death rate is lower because of the lower rates of violent crime. I think the \"gun\" problem in America is really a sociological problem that has nothing at all to do with guns.", 
   {}, 
   35266, 
   null, 
   1077265380.0
  ], 
  [
   35404, 
   null, 
   "Countryboy", 
   "When you say the death rate is lower, do you mean death due to crime? If that is the case, I think the death rate is lower because of the lower rates of violent crime. I think the \"gun\" problem in America is really a sociological problem that has nothing at all to do with guns.\n\n \n Death Rate due to guns, and i agree with you on the Sociological part in the \"gun\" problem in america.", 
   {}, 
   35287, 
   null, 
   1077322860.0
  ], 
  [
   35517, 
   null, 
   "Countryboy", 
   "Yeah, you can argue that it's a violation of the second amendment as the BATF leaves your home with your firearms in hand until you're blue in the face. You'll be right, of course. And yet, still disarmed. The day is coming.\n\n \"FROM MY COLD, DEAD HANDS!!!!!!\"", 
   {}, 
   34983, 
   null, 
   1077442380.0
  ], 
  [
   36037, 
   null, 
   "Countryboy", 
   "Clickhere to see some stuff on why gun control won't work.\n \n \n\"That the more helpless you are, the safer you are from criminals.\"\n\n \n \nThat guns should be banned because of the danger involved, and live reporting from the battlefield, which can keep the enemy informed of troop deployments, getting thousands of troops killed and perhaps losing a war, is a protected act that CANNOT be compromised on.\n\n \n \nThat people are too stupid to handle guns, but are intelligent enough to vote.\n\n \n \nThat one should judge all gun owners by the acts of a few criminals, just like one should judge all blacks by the acts of a few inner-city crack dealers.\n\n \n \nThat if an a group of anti-gun protesters feels threatened, they should ask police with guns to protect them while they tell everyone how worthless guns are for protection.\n", 
   {}, 
   35517, 
   null, 
   1077670200.0
  ], 
  [
   36058, 
   null, 
   "daewoo", 
   "\"FROM MY COLD, DEAD HANDS!!!!!!\"\n\n \n Good theory, rarely practiced. Personally, I am pretty sure that if they passed a law tommorow banning all guns, the majority of gun owners would be standing in line by 5:00 PM to turn in their guns. There would be some holdouts, but not as many as we would like to think.", 
   {}, 
   35517, 
   null, 
   1077673920.0
  ], 
  [
   36059, 
   null, 
   "Countryboy", 
   "Good theory, rarely practiced. Personally, I am pretty sure that if they passed a law tommorow banning all guns, the majority of gun owners would be standing in line by 5:00 PM to turn in their guns. There would be some holdouts, but not as many as we would like to think.\n\n \n if it all came down, i bet that some gun owner's would turn in just their registered guns, and keep the guns that aren't registered, and bought through a private sale.", 
   {}, 
   36058, 
   null, 
   1077674160.0
  ], 
  [
   36125, 
   null, 
   "Rev. HellH0und", 
   "Good theory, rarely practiced. Personally, I am pretty sure that if they passed a law tommorow banning all guns, the majority of gun owners would be standing in line by 5:00 PM to turn in their guns. There would be some holdouts, but not as many as we would like to think.\n\n \n \n Well I say less than half.. Even the spineless canadians are refusing...\n \n http://proliberty.com/observer/20010115.htm\n \n \n lets say for arguments sake that 50% of the people have guns in the us... Out of that 50% just 1% decide to resist.... How many is that?", 
   {}, 
   36058, 
   null, 
   1077722400.0
  ], 
  [
   36324, 
   null, 
   "Patrick Henry", 
   "Good theory, rarely practiced. Personally, I am pretty sure that if they passed a law tommorow banning all guns, the majority of gun owners would be standing in line by 5:00 PM to turn in their guns. There would be some holdouts, but not as many as we would like to think.\n\n \n \n More liberal claptrap? Sorry, Charlie.. if that were to happen, the MAJORITY would be those NOT turning them in! You obviously don't know what you're talking about. Like the other poster stated, even the majority of Canadian gun-owners are refusing to comply with their Nazi-like confiscation program that has already cost their tax-payers something like $1 billion.", 
   {}, 
   36058, 
   null, 
   1077761340.0
  ], 
  [
   36366, 
   null, 
   "daewoo", 
   "More liberal claptrap? Sorry, Charlie.. if that were to happen, the MAJORITY would be those NOT turning them in! You obviously don't know what you're talking about. Like the other poster stated, even the majority of Canadian gun-owners are refusing to comply with their Nazi-like confiscation program that has already cost their tax-payers something like $1 billion.\n\n \n Patrick Henry, first of all, you have taken the name of a great man. Frankly, you barely deserve the right to speak the name, much less use it to identify yourself. Patrick Henry was a thoughful man who spoke rarely, but when he did, every word was carefully chosen. He once said \"I prefer the written word, as it leaves no doubts as to intention.....\". I seriously doubt that he would appreciate his name being used to identify somebody who shoots their mouth off without forethought or reason.\n \n This is the second time you have spewed off about what a liberal I am. First, you obviously have not read many of the older messages, or you would know better. \n \n When it comes to people being good little subjects and doing what they are told, based on what we have seen in califonia, the number of folks who are more than willing to turn in their guns for $50 and a slice of pizza at the gun buyback programs, and the estimates of gun ownership in cities where they are heavily regulated, I feel comletely confident in saying that the majority of gun owners would fall ito line like the good little subjects they are.\n \n I spoke today with a friend of mine who is a congressional aide. We were specifically talking about the riders that have been attached to the bill which would protect gunmakers from frivilous lawsuits. The riders in question would essentially close down gun shows and extend the assault weapons ban indefinatly. This has been a fairly hot topic in gun groups lately. Do you know how many letters that congressman has recieved from his constituents about the issue? TWO. Mine was one of them. The other was a letter supporting re-enactment of the ban. People aren't willing to get up off their butts and write a letter, but they are more than happy to complain when the ban passes. Do you really think that these same folks, who can't be bothered to write a letter to defend their rights are going to be willing to commit a felony by keeping their guns?\n \n Another thing comes to mind on this issue. It was a study conducted at (I believe) Harvard. They pulled 20 people off the street and put them in front of a panel fo buttons that were numbered between 1 and 10. The 11th button said \"DANGER....LETHAL\". They were told that they were going to be administering electrical shocks to a person in the next room as part of a study in pain.\n \n They pushed the buttons one at a time, starting at 1. When thay got to button number five, a person in the other room began to moan (nobody was hooked up, of course, the box was a fake). By button number 9, the person in the other room was screaming their head off and begging for it to stop. After button number 10, the participants were told to push the button marked as lethal.\n \n Do you know how many of those good, upstanding americans refused? Not a damn one of them. Not a single person refused to go any further when the guy was screaming, and not a single one of them refused to send the \"lethal\" shock. \n \n At this point in the experiment, somebody came in from the other room an pronounced the \"subject\" dead and the real subjects reaction was observed. Of the 20, only 2 showed any visible signs of remorse. The most prevelant reaction wa something along the lines of \"I did do it right didn't I?\"\n \n Interestingly enough, this study has been repeated multiple times, in multiple countries now. After multiple repititions, we have found that less than 1% of Americans refused to deliver the lethal shock. In mexico, less than half the people were willing. In Denmark, NOBODY was willing. In London, 100% of the people were willing. NOBODY in Canada was willing.\n \n Do you really think that the same brainwashed CATTLE (americans) who are willing to deliver a lethal shock to somebody on the say so of some guy they have never met before, but that they percieve to be in a position of authority, are going to refuse to turn in their guns?\n \n I think the bigger problem would be staffing the turn in points adequetly to handle the rush to get them turned in. \n \n Americans are taught form an early age to respect authority, real or percieved. Americans don't question, we follow orders. \n \n As sickening as it is, there are not enough independant thinkers left in the whole country to really make a difference. We have 2 political parties. On the one side, you have the socialists, on the other, the fascists, and we are fine with this. Political activism anymore means siting at home on your couch and complaining about how things are done, or logging onto the internet and whining in a chat room.\n \n DO you know what most congressional offices consider an \"large influx\" of letters on an issue? TEN. If ten original letters on a single issue arrive in the same week, the issue is flagged as important to the constituency. \n \n Do you know what happens to E-mails that get sent to congreesman? A constituent rep reads them, sends a canned reply, and deletes it. Same thing goes for form letters (the ones that end with \"cut and past this then print it and mail it\"). They figure that if a person can't take the time to sit down and write an actual letter, they don't care that much. Personally, I agree with them. Do you really expect them to believe that you are going to vote for someone else because of an issue that you can't be bothered to spend 10 minutes on?\n \n Besides, who else are you going to vote for? We have a two party system.", 
   {}, 
   36324, 
   null, 
   1077785100.0
  ], 
  [
   36741, 
   null, 
   "Patrick Henry", 
   "Patrick Henry, first of all, you have taken the name of a great man. Frankly, you barely deserve the right to speak the name, much less use it to identify yourself. Patrick Henry was a thoughful man who spoke rarely, but when he did, every word was carefully chosen. He once said \"I prefer the written word, as it leaves no doubts as to intention.....\". I seriously doubt that he would appreciate his name being used to identify somebody who shoots their mouth off without forethought or reason.\n Quit your whining, punk. I'll take whatever name I choose. Just like a liberal to try and dictate who can do what. The only one here shootin' off at the mouth is YOU. So, save your sanctimonious blather, liberal. \n This is the second time you have spewed off about what a liberal I am. First, you obviously have not read many of the older messages, or you would know better. \n I've read your other claptrap. You're a confused liberal. I have a friend who's 'for guns' and yet votes democRAT every election and is pretty much in favor of the liberal agenda with exception to 'guns'. Just like you.\n When it comes to people being good little subjects and doing what they are told, based on what we have seen in califonia, the number of folks who are more than willing to turn in their guns for $50 and a slice of pizza at the gun buyback programs, and the estimates of gun ownership in cities where they are heavily regulated, I feel comletely confident in saying that the majority of gun owners would fall ito line like the good little subjects they are.\n Again, you're full of XXXX. I have a friend who works for a company that deals with military and law enforcement. His company receives those 'turned-in' guns and he tells me that they're mostly XXXX. About 1 out of 100 might be of some worth, but mostly junk. Sure, I'd turn in a gun I either STOLE or used in a CRIME for $50, no questions asked. Good little subjects? Will I see you at the front of the line? I welcome you to come get mine when you're done there.\n I spoke today with a friend of mine who is a congressional aide. We were specifically talking about the riders that have been attached to the bill which would protect gunmakers from frivilous lawsuits. The riders in question would essentially close down gun shows and extend the assault weapons ban indefinatly. This has been a fairly hot topic in gun groups lately. Do you know how many letters that congressman has recieved from his constituents about the issue? TWO. Mine was one of them. The other was a letter supporting re-enactment of the ban. People aren't willing to get up off their butts and write a letter, but they are more than happy to complain when the ban passes. Do you really think that these same folks, who can't be bothered to write a letter to defend their rights are going to be willing to commit a felony by keeping their guns?\n \n Another thing comes to mind on this issue. It was a study conducted at (I believe) Harvard. They pulled 20 people off the street and put them in front of a panel fo buttons that were numbered between 1 and 10. The 11th button said \"DANGER....LETHAL\". They were told that they were going to be administering electrical shocks to a person in the next room as part of a study in pain.\n \n They pushed the buttons one at a time, starting at 1. When thay got to button number five, a person in the other room began to moan (nobody was hooked up, of course, the box was a fake). By button number 9, the person in the other room was screaming their head off and begging for it to stop. After button number 10, the participants were told to push the button marked as lethal.\n \n Do you know how many of those good, upstanding americans refused? Not a damn one of them. Not a single person refused to go any further when the guy was screaming, and not a single one of them refused to send the \"lethal\" shock. \n \n At this point in the experiment, somebody came in from the other room an pronounced the \"subject\" dead and the real subjects reaction was observed. Of the 20, only 2 showed any visible signs of remorse. The most prevelant reaction wa something along the lines of \"I did do it right didn't I?\"\n \n Interestingly enough, this study has been repeated multiple times, in multiple countries now. After multiple repititions, we have found that less than 1% of Americans refused to deliver the lethal shock. In mexico, less than half the people were willing. In Denmark, NOBODY was willing. In London, 100% of the people were willing. NOBODY in Canada was willing.\n More liberal psycho-babble? *yawn*\n Do you really think that the same brainwashed CATTLE (americans) who are willing to deliver a lethal shock to somebody on the say so of some guy they have never met before, but that they percieve to be in a position of authority, are going to refuse to turn in their guns?\n \n I think the bigger problem would be staffing the turn in points adequetly to handle the rush to get them turned in. \n Yeah, I know we can count on you to help with the staffing.\n Americans are taught form an early age to respect authority, real or percieved. Americans don't question, we follow orders. \n If that were true, then our government would've already been traded in for the dicatorship that you're hoping for a long time ago. Just like a liberal to bash America and Americans.\n As sickening as it is, there are not enough independant thinkers left in the whole country to really make a difference. We have 2 political parties. On the one side, you have the socialists, on the other, the fascists, and we are fine with this. Political activism anymore means siting at home on your couch and complaining about how things are done, or logging onto the internet and whining in a chat room.\n Socialists and fascists? I guess you're claiming to be a 'moderate'? A moderate is simply someone that doesn't have the guts to take a side on an issue. Actually, socialists and fascists have more in common with each other than either do with conservatism. Hence, why liberals are much more akin to either of them.\n DO you know what most congressional offices consider an \"large influx\" of letters on an issue? TEN. If ten original letters on a single issue arrive in the same week, the issue is flagged as important to the constituency. \n \n Do you know what happens to E-mails that get sent to congreesman? A constituent rep reads them, sends a canned reply, and deletes it. Same thing goes for form letters (the ones that end with \"cut and past this then print it and mail it\"). They figure that if a person can't take the time to sit down and write an actual letter, they don't care that much. Personally, I agree with them. Do you really expect them to believe that you are going to vote for someone else because of an issue that you can't be bothered to spend 10 minutes on?\n I've written letters to my representatives that were personally responded to, not a 'canned response' (I only got those from democRATS). I recall one bill that I questioned my representative about that involved Federal agencies here hiring ex-Hong Kong policemen after the British turned over the city to the Red Chinese. I only found out about this obscure measure because a guy at a gun show was handing out flyers about it. I inquired about it and found it from my congressman that it was indeed true. He was assured me that it wouldn't be passed and it wasn't, thanks to him and other conservatives. Another defeat was handed to the socialist/fascist democRATS.\n \n Sorry, bud.. evidently I just don't hate America and Americans as rabidly as you do.\n Besides, who else are you going to vote for? We have a two party system.\n I voted for Alan Keyes the last two GOP primaries. Against your friend Bill Klinton I voted for Bob Dole and against Algore I voted for Bush. Neither Dole or Bush were my favorites. I am seriously thinking about changing my party affiliation to the Constitution Party unless conservatives can take control of the GOP and oust the RINOs (Republican In Name Only, I.E. Sen. John McInsane). And who did you vote for? Nader? Are you voting for him again? Or will you stick to the Socialist Party candidate?\n \n\n \n Feel free to argue semantics and what IS is...", 
   {}, 
   36366, 
   null, 
   1077985560.0
  ], 
  [
   36774, 
   null, 
   "daewoo", 
   "Feel free to argue semantics and what IS is...\n\n \n I can't decide if you are kidding, if you are a a lunatic, or if you are just not bright enough to follow the debates here. I do see that you are apparently not bright enough to QUOTE messages so they are easily read/followed, although the 16 yr old kids here don't seem to have any trouble with it. \n \n I also notice that your post is big on name calling and inuendo, but very light on content.\n \n \nQuit your whining, punk. I'll take whatever name I choose. Just like a liberal to try and dictate who can do what. The only one here shootin' off at the mouth is YOU. So, save your sanctimonious blather, liberal. \n \n I've read your other claptrap. You're a confused liberal. I have a friend who's 'for guns' and yet votes democRAT every election and is pretty much in favor of the liberal agenda with exception to 'guns'. Just like you.\n\n \n \n There is one line in all that XXXX that was probably worth typeing, the one about voing democrat at every election. The rest is just raving by somebody who can't come up with a decent point. I haven't voted democrat yet. You might also do a \"view source\" to see how the whole quoting thing is done.\n \n \nAgain, you're full of XXXX. I have a friend who works for a company that deals with military and law enforcement. His company receives those 'turned-in' guns and he tells me that they're mostly XXXX. About 1 out of 100 might be of some worth, but mostly junk. Sure, I'd turn in a gun I either STOLE or used in a CRIME for $50, no questions asked. Good little subjects? Will I see you at the front of the line? I welcome you to come get mine when you're done there.\n\n \n According to department of justice \"Gun buyback program summary, 2001\", the majority of guns turned in at gun buyback programs are not stolen, and the average value of the weapons is $320. They don't list how they get the estimated value. \n \n Personally, I doubt the truthfullness of your assertation. The guns that are purchased in buyback programs are generally turned over to either the ATF or the FBI (when there is not an ATF office available locally). They are diassembeled and sold to Temp and Company steel and melted down for scrap under a service contract awarded to them in 2000, and renewed every year since. A copy of the service contract is posted annually, including contact information, through just about any federal publication listing federal bid packages.\n \n \n \nMore liberal psycho-babble? *yawn*\n Yeah, I know we can count on you to help with the staffing.\n If that were true, then our government would've already been traded in for the dicatorship that you're hoping for a long time ago. Just like a liberal to bash America and Americans\n\n \n Hmmm...Again, no point, babbling and name calling because you can't refute. Are you sure you are not a liberal? \n \n You don't find it even the slightest bit disturbing that 100% of Americans tested were willing to kill a stranger because somebody else told them to?\n \n \nSocialists and fascists? I guess you're claiming to be a 'moderate'? A moderate is simply someone that doesn't have the guts to take a side on an issue. Actually, socialists and fascists have more in common with each other than either do with conservatism. Hence, why liberals are much more akin to either of them.\n\n \n \n You need to do a LOT more research on socialism and fascism. They are entirely different. Thee is a thread on one of the other forums where I lay down a brief compare and contrast between democracy, socialism, communism. Read that, then look up fascism.\n \n I am not a moderate, either. If anything, I would have to say I am a borderline anarchist. I want as little government and as few laws as we can get. \n \n \nI've written letters to my representatives that were personally responded to, not a 'canned response' (I only got those from democRATS). I recall one bill that I questioned my representative about that involved Federal agencies here hiring ex-Hong Kong policemen after the British turned over the city to the Red Chinese. I only found out about this obscure measure because a guy at a gun show was handing out flyers about it. I inquired about it and found it from my congressman that it was indeed true. He was assured me that it wouldn't be passed and it wasn't, thanks to him and other conservatives. Another defeat was handed to the socialist/fascist democRATS.\n \n Sorry, bud.. evidently I just don't hate America and Americans as rabidly as you do.\n\n \n Your representative never saw your letter. It went to a constituent rep, who researched it and wrote you a reply. What, in a paragraph where I encourage people to write their congressman in order to ensure that their voice is heard, leads you to believe I hate America? You are not making sense (of course, this seems to be the norm). Of course, you did just prove my point about the effectiveness of writing a letter. Agin, though, you need to go back to political science 101 and take a look at socialism and fascism. They are mutually exclusive.\n \n \nI voted for Alan Keyes the last two GOP primaries. Against your friend Bill Klinton I voted for Bob Dole and against Algore I voted for Bush. Neither Dole or Bush were my favorites. I am seriously thinking about changing my party affiliation to the Constitution Party unless conservatives can take control of the GOP and oust the RINOs (Republican In Name Only, I.E. Sen. John McInsane). And who did you vote for? Nader? Are you voting for him again? Or will you stick to the Socialist Party candidate?\n\n \n \n Actually, last time around I supported Buchanan. I just couldn't bring myself to be a bush supporter. \n \n People like you are why we have gun control. If we could present a logical argument/debate to the antigunners there would not be such a problem. Instead, yu can debate gun control and they go home and go \"I met this drooling lunatic tonight who was pro gun. We should DEFINATLY pass laws to keep people like that from having firearms.\" You need to CALM DOWN just a bit. Back your arguments up with logic, anecdotal evidence and research, and you get a lot better reception. Your views will be held in much higher regard. The only people who base a debate on name calling and innuendo are little kids and hard core liberals. This is why they are not taken seriously.\n \n Of course, as it stands now, I have interesing messages to print out and pass around at lunch for a little levity.", 
   {}, 
   36741, 
   null, 
   1078001100.0
  ], 
  [
   37242, 
   null, 
   "Countryboy", 
   "Take a look at this link Here", 
   {}, 
   36774, 
   null, 
   1078186320.0
  ], 
  [
   37247, 
   null, 
   "JustAnotherGuy", 
   "Gun control will not work because criminals do not obey gun control laws.", 
   {}, 
   37242, 
   null, 
   1078187100.0
  ], 
  [
   37328, 
   null, 
   "JustAnotherGuy", 
   "Gun control laws will not work because criminals do not obey gun control laws! \n \n Gun control will only affect law-abiding citizens!\n \n Criminals that do not obey gun control laws will be able to obtain guns and use them on the unarmed law-abiding citizens.", 
   {}, 
   36774, 
   null, 
   1078202460.0
  ], 
  [
   37339, 
   null, 
   "daewoo", 
   "More personal attacks from sombody with no case to make.\n \n \nLOL! Not stolen? Post that info, I don't believe a liar like you. $320? LOL! Yeah, right. Keep lying, liberal\n\n \n \nAccording to department of justice \"Gun buyback program summary, 2001\", the majority of guns turned in at gun buyback programs are not stolen, and the average value of the weapons is $320. They don't list how they get the estimated value. \n \n \n This is what is called a \"source\" it is what those of us who actually do research use to prove our point. If you would like a copy of the source, all you have to do is contact the department of justice. Send them a letter with 35 cents (they charge a nickle a page for photocopies, front and back, and the report is 7 pages). It is a very simple matter. Alterantively, you coud subscribe to some of their newsletters. They print results of reports like that in their newsletters as soon as they are completed, and they send them to you for free. \n \n A \"source\" is where research has been done, or a study has been done, and they publish the results. There are a lot of differnet places out there that you can pick up materials.\n \n \nAgain, you have your head firmly placed in your a**. The weapons they receive are 'marked for destruction' by the BATF and yet, there they are in their place of business. Sorry.. it's a fact that these weapons are NOT being destroyed like your 'talking points' handout states, they are being sold to companies like the one I know the details. I have first-hand proof and you have zero. You'll just have to get over it.\n\n \n Where is your first hand proof? What we have is your word in a rave, and all you have is your buddy saying \"this is how it is\". HEre is where I tell you how to check my source if you so desire:\n \n \nA copy of the service contract is posted annually, including contact information, through just about any federal publication listing federal bid packages\n\n \n The only place I know of that lists about every government contract that goes out is the congressional register. YOu can obtain copies by contacting the government printing office. There is a small charge for having a printed copy delivered. I think it is available online as well, but can't say for certain because I get a copy in the mail so I have never bothered to look. This is another one of those pesky \"sources\".\n \n \nCan't refute? Boy, you think mighty highly of yourself don't you? You haven't proven anything other than your propensity for posting mere 'opinion' and claiming it to be fact without one iota of documented evidence to back it up. Liberal? No, that's you. I don't support liberal programs like 'buy-backs', unlike you the liberal\n\n \n By my count, I have listed at least 2 sources that are verifiable and publicly available, and you have listed exactly 0. I did not say I supported gun buy back programs. I don't, I think they are a terrible idea. I used them as an example of the fact that people do not cling tot heir guns as tightly as you have asserted. Do you even understand what we are debating?\n \n \n \nThis is another example of you embracing liberal pyscho-babble and further evidence that you're no friend of the 'second amendment'. In fact, let's call your support, 'luke-warm'.\n\n \n While a do realise that you most likely are not intelligent enough to understand the experiment I explained, suffice it to say that it was a scientific experiment based entirely on documentable, observable action carried out by a test subject. Usually when people refer to \"psycho babble\" they are talking about soft science type experiments with non observable results that require a certain amount of theoretical interpetation. THis is not the case with the study I cited. The study I cited involved measuring a physical reaction (pushing a button) in response to a verbal stimuli (being told to push the button). Results, Americans pushed the button every time. \n \n As far as \"luke warm\" support for the second amendment goes, I have one of only 97 concealed carry permits in my sate that have been issued to private citizens. I also hold the ONLY class 2 license. I currently posess a collection of 314 guns, 27 of which I have built from scratch. How about you, bucko?\n \n \n'I want as little government and as few laws as we can get.' LOL! And here you are campaigning for GOVERNMENT run 'gun buy back' programs, among other things?? You don't have your head screwed on straight. Anarchist..LOL!\n\n \n AS I said before, I do not support gun buy back programs. The postings where I refered to gun buyback programs indicated no support whatsoever for them. Again, you are aparrently too ignorant to not only remeber what we were debating, you also cannot read a simple statement and understand the context in which it is made. I have seen you reference hitler several times in some of your posts. Does this mean you are a nazi or support hitler? of course not, you were attempting (however unsucessfuly) to use historical precendence to make your case.\n \n \n \nWOW! You're in my Congressman's office too! Is there no end to your awesome power? More, unsubstantiated blather. \n \n \n Nope, just telling you how things are done. I own a company that does quite a bit of work for the federal government (including the DOD). I have gotten to know a lot of congressmen, I know how they do things. \n \n \nHave you ever heard of National Socialist? Sounds like you're trying to seperate the two, of course with you being in favor of socialism.\n\n \n Even NAtional Socialism is incompatible with fascism. Did you look up a decent definition of fascism? There is an excelent book called \"Political systems: A difinitive comparison\" By a guy named Roscheck. I would suggest you take a look at it. It is kind of long (roughly 1500 pages) but worth the read. There are about 300 pages on fascism. I am certain you would find it informative.\n \n \nNope. It's cowards like you that cave to liberal nonsense like 'gun buy-back' programs. Your arguments are that of a liberal. You are ready to compromise at every turn, hence your support of such idiotic nonsense as 'gun buy-back' programs. Evidence? I have yet to see you provide any. So, you go ahead and keep attacking those that support the second amendment so as to continue making an a** of yourself while embracing such liberal nonsense as GOVERNMENT RUN GUN BUY-BACK PROGRAMS!\n\n \n Nope, I am absolutly against gun buyback programs, and have never said anything to the contrary. I fully support the second amendment (especially since I have one hell of a lot of money wrapped up in a large gun collection.\n \n You seem to have trouble remeberign what we are debating. What we were debating was the number of gun owners likely to turn in their weapons should a full ban eer be instituted. My position was that I believe the majority of gun owners would probably turn in their guns, then I presented my logic, cited a couple of sources, and provided some anecdotal evidence to support my theory. Your response was:\n \n \nMore liberal claptrap? Sorry, Charlie.. if that were to happen, the MAJORITY would be those NOT turning them in! You obviously don't know what you're talking about. Like the other poster stated, even the majority of Canadian gun-owners are refusing to comply with their Nazi-like confiscation program that has already cost their tax-payers something like $1 billion.\n\n \n \n Since then, you have not cited a single source besides your unnamed buddy who works for an unnamed company. Name the company and we can lay that particular issue to rest. \n \n You closing:\n \n \nSo, save your sanctimonious blather for those kids you like to impress.\n\n \n I can only assume refers to my statement\n \n \nI do see that you are apparently not bright enough to QUOTE messages so they are easily read/followed, although the 16 yr old kids here don't seem to have any trouble with it. \n \n \n I see you still have not figured it out. Ok, the easiest way to do it is to c&p the portions you want to quote, highlight them, then push the little button at the top of the message frame. It is under the box that says \"color\" (the color picker box) on the far right, and it looks like a little cartoon talk bubble. Alternatively, anything that is between a [quote] flag (at the end of the quote you have to put [/quote} will show up as a quote. \n \n Now you know.\n \n I was wondering, could you tell me how you percieve yourself? I have 2 theories, the first is that you see yourself as a no BS guy who speaks his mind. The second is that you see yourself as an incredibly bright person. In either case you are, of course, wrong. You come across as a jackass. YOu, of course, don't have to answer the question. I am just tryint to understand the logic of somebody who jumps my butt for only supplying 2 sources, when they have provided none at all in this debate. I am one of thos folks that is driven by logic, as opposed to knee jerk emotional responses. You are apparently the opposite. I find it interesting that you come down on the side of the gun control debate that you do. I have found that in general, it is the people who are rooted in facts and logic that opposed gun control, and the emotional types that are anti gun. In your case, it seems to be the exact opposite. You apparently know no facts, and are incapable of making arguments based in logic, but you are a pro gunner. Interesting.", 
   {}, 
   36774, 
   null, 
   1078206180.0
  ], 
  [
   40237, 
   null, 
   "Ender Wiggin", 
   "I would have agree with JustAnotherGuy and not just cause I'm a conservitive bush supporter. But because the facts do seem support him. Lets look at some places with stringent gun laws.\n \n National Center for Policy Analysis 2001 said:\n If gun control laws have any effect, it may be to increase crime. For instance: \n \n New Jersey adopted what sponsors described as \"the most stringent gun law\" in the nation in 1966; two years later, the murder rate was up 46 percent and the reported robbery rate had nearly doubled.\n \n In 1968, Hawaii imposed a series of increasingly harsh measures and its murder rate, then a low 2.4 per 100,000 per year, tripled to 7.2 by 1977.\n \n In 1976, Washington, D.C., enacted one of the most restrictive gun control laws in the nation. Since then, the city's murder rate has risen 134 percent while the national murder rate has dropped 2 percent.\n \n British crime\n BBC News Online (July 16, 2001)\n handgun crime in the United Kingdom rose by 40% in the two years after it passed its draconian gun ban in 1997.\n \n Australian crime.\n USA Today (May 9, 2002)\n \"Since Australia's 1996 laws banning most guns and making it a crime to use a gun defensively, armed robberies rose by 51%, unarmed robberies by 37%, assaults by 24% and kidnappings by 43%.\"\n \n Canadian crime.\n The Fraser Institute, November 2003 \n After enacting stringent gun control laws in 1991 and 1995, Canada has not made its citizens any safer. \"The contrast between the criminal violence rates in the United States and in Canada is dramatic,\" says Canadian criminologist Gary Mauser. \"Over the past decade, the rate of violent crime in Canada has increased while in the United States the violent crime rate has plummeted.\"\n \n Now lets look at some places with lax gun laws.\n \n The Washington Times (March 28, 2000).\n the media highly publicized a safety course which taught Orlando women how to use guns. The result: Orlando's rape rate dropped 88% in 1967, whereas the rape rate remained constant in the rest of Florida and the nation.\n \n FBI Uniform Crime Reports, (1988)\n Vermont: is one of the five safest states in the country. In Vermont, citizens can carry a firearm without getting permission . . . without paying a fee . . . or without going through any kind of government-imposed waiting period. And yet for ten years in a row, Vermont has remained one of the top-five, safest states in the union having three times received the \"Safest State Award.\"\n \n FBI Uniform Crime Reports, (1988)\n Florida: concealed carry helps slash the murder rate in the state. In the fifteen years following the passage of Florida's concealed carry law in 1987, over 800,000 permits to carry firearms were issued to people in the state. FBI reports show that the homicide rate in Florida, which in 1987 was much higher than the national average, fell 52% during that 15-year period thus putting the Florida rate below the national average.\n \n FBI Uniform Crime Reports, (1988)\n Kennesaw, GA. In 1982, this suburb of Atlanta passed a law requiring heads of households to keep at least one firearm in the house. The residential burglary rate subsequently dropped 89% in Kennesaw, compared to the modest 10.4% drop in Georgia as a whole.\n \n So you see, if you want reduce crime, (which would resul in safer places to live)\n then what you need is less gun controll laws. Rather than folowing down the faulty path of gun bans and ending up like:\n \n New Jersey\n Hawaii\n Washington, D.C.\n Britin \n Australia and,\n canada\n \n I hope you see my point.\n (I can bring up further evidence if needed),\n and please excuse my awfull spelling.", 
   {
    "post_info": {
     "post_title": "Gun control doesn't work!"
    }
   }, 
   37339, 
   null, 
   1079807040.0
  ], 
  [
   41628, 
   null, 
   "JordanF", 
   "All the laws in the world won't work, criminals will always be able to get guns. If they can't buy them, smuggle them in or steal them, they will make them. Criminals have even made guns inside maximum security prisons.\n Follow the link.\n GUN-MAKING AS A COTTAGE INDUSTRY \n\n \n You are absolutely correct!\n \n Why should criminals care if guns are illegal -- especially if they are already outlaws?! :P\n \n US States that concealed weapons actually have lower crime rates. Do you know why? It's because the criminals know that their \"victim\" could potentially defend him/herself.", 
   {}, 
   6496, 
   null, 
   1080668820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why gun control won't work", 
  "url": "http://www.4forums.com/political/gun-control-debates/518-why-gun-control-wont-work.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 518, 
  "discussion_files": [
   [
    "30772.html", 
    "http://www.4forums.com/political/gun-control-debates/518-why-gun-control-wont-work-print.html"
   ], 
   [
    "30773.html", 
    "http://www.4forums.com/political/gun-control-debates/518-why-gun-control-wont-work-7-print.html"
   ], 
   [
    "30774.html", 
    "http://www.4forums.com/political/gun-control-debates/518-why-gun-control-wont-work-5-print.html"
   ], 
   [
    "30775.html", 
    "http://www.4forums.com/political/gun-control-debates/518-why-gun-control-wont-work-4-print.html"
   ], 
   [
    "30776.html", 
    "http://www.4forums.com/political/gun-control-debates/518-why-gun-control-wont-work-6-print.html"
   ], 
   [
    "30777.html", 
    "http://www.4forums.com/political/gun-control-debates/518-why-gun-control-wont-work-3-print.html"
   ], 
   [
    "30778.html", 
    "http://www.4forums.com/political/gun-control-debates/518-why-gun-control-wont-work-2-print.html"
   ]
  ], 
  "identifier": 518
 }
]