[
 [
  [
   121713, 
   null, 
   "daewoo", 
   "THIS IS A PUBLIC SERVICE ANNOUNCEMENT\n \n I ran a med call this morning on a 1.5 yr old who had ingested an entire tube of desitin. Desitin will not harm you (though it may cause constipation), so the kid was in no danger. I asked the mother if she had called poison control or administered ipecac. She had no idea what either of those things was.\n \n Just in case anybody else out there does not know what poison control is, it is a nationwide program to provide immediate access to information regarding poisonous compounds. The toll free number is 1-800-222-1222.\n \n You just call and tell them what the problem is and they will tell you what to do. It is that simple. There is absolutly no reason not to call when you rkid eats or drinks something that may be hazardous. There is no need to be embarrased...believe me, they have heard it all. No matter how much dog poop your kid ate, or how much bleach they drank, they have heard it before. \n \n Ipecac is a syrup that induces vomiting. EVERY PARENT SHOULD HAVE IT. you can get it at ANY supermarket or drug store. It costs $3.29 at my local Dillons. If you cannot afford it (money is tight for a lot of people right now....no shame in that), go by your local fire department and explain your situation and I will almost gaurantee that they will give you a bottle for free. OR, PM me an address and I will send you a bottle courtesy of the Lion County Fire Department, absolutly free of charge. \n \n Here is the nationwide, toll free number again 1-800-222-1222 PRINT IT OUT. WRITE IT DOWN. TAPE IT TO THE BACK OF YOUR PHONE. For most things, a few minutes of digging through a phone book does not matter. For some poisingongs, SECONDS COUNT, and you do NOT want your kid to end up mentally retarded for the rest of their life because it took you a few extra minutes to find out that you needed to force them to drink salt water in order to help couteract the effects of drinking brake fluid.", 
   {
    "post_info": {
     "post_title": "Poison control"
    }
   }, 
   null, 
   null, 
   1115935740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Poison control", 
  "url": "http://www.4forums.com/political/parenting/5181-poison-control.html", 
  "breadcrumbs": [
   "Parenting"
  ], 
  "id_number": 5181, 
  "discussion_files": [
   [
    "17755.html", 
    "http://www.4forums.com/political/parenting/5181-poison-control-print.html"
   ]
  ], 
  "identifier": 5181
 }
]