[
 [
  [
   121941, 
   null, 
   "JustineCredible", 
   "Date: Thu, 12 May 2005 17:00:56 GMT \n From: \"Human Rights Campaign\" <membership@hrc.org< Add to Address Book \n To: <just_ine_credible@yahoo.com< \n Subject: FW:Anti-gay groups are exploiting my story \n \n \n Dear Justine,\n \n I just received the following e-mail message from Gary Wright, a Human Rights Campaign supporter and activist. It made me angry -- and it made me realize that Gary's story is just one example of the increasingly organized and harmful attacks extremist groups are waging in America's workplaces. They are making gains, and we must stop them. \n \n Please, read Gary's e-mail. And then, click here to help:\n https://secure.ga3.org/03/donate_workplace/nG11gTGM1VmNx??source=W06BGEAG1\n \n Sincerely,\n \n Joe Solmonese\n HRC President\n \n \n-----Original Message-----\n <From: Gary Wright \n <Sent: Tuesday, May 03, 2005 4:35 PM\n <To: Joe Solmonese\n <Subject: RE: Anti-gay groups are exploiting my story\n \n <Hi Joe -\n <\n <I just found out that the anti-gay group \"American \n <Family Association\" is spreading lies about me, \n <lies that can hurt thousands of people in our \n <community. They had been boycotting Procter and \n <Gamble (P&G) because they had helped repeal a \n <hateful anti-gay law in Cincinnati. Now they are \n <falsely claiming that I was forced out of the company \n <for standing up for our rights. Here's what they \n <are saying:\n <\n <\"In so far as we can tell by our monitoring, P&G has \n <stopped their sponsorship of TV programs promoting \n <the homosexual lifestyle, such as '[Will] & Grace.' \n <And, as far as we can tell, they have stopped their \n <sponsorship of homosexual Internet sites. Also, the \n <P&G executive who was given a leave of absence to \n <lead the effort of special rights for homosexuals \n <in a Cincinnati election -- and who was a force for \n <pushing the homosexual agenda inside the company -- \n <is no longer with the company.\"\n <\n <Joe, that P&G executive they mention is ME!!! I left \n <the company to become a full-time activist, and \n <they're citing my departure as an indication that \n <their boycott was successful! We won at the polls \n <in Cincinnati with P&G's help, and now they are \n <trying to turn that victory into defeat.\n <\n <It infuriates me to know that my personal decision \n <has been twisted like this by this hateful group! \n <And, I'm afraid that the anti-GLBT groups are making \n <serious and hurtful inroads into corporations all \n <over the country -- look at what happened with \n <Microsoft! \n <\n <So, here's what I think: I want to support the work \n <that YOU'RE doing to make workplaces fair. There \n <are millions of GLBT employees and supporters at P&G\n <and other companies who need to know that we won't \n <stand still while we are attacked. What can we do? \n <How can I help get HRC members to help fight these \n <awful groups? \n <\n <Thanks,\n <Gary Wright\n ----- end original message -----\n\n \n Gary's e-mail to me was a wake-up call. We've been making amazing gains in workplaces for years. In fact, it's among the work we are most proud to have accomplished. But now, the anti-GLBT groups have noticed and they're fighting back. \n \n In 1999, ExxonMobil was the first company EVER to revoke a non-discrimination policy and domestic partner benefits (and they are still one of our biggest corporate targets). Since then, pressure to reconsider established pro-equality policies is growing. Just last month Microsoft -- long a staunch supporter of equality -- was reported to have caved to extremists' pressure and pulled their support of a Washington state anti-discrimination bill (they've since switched positions, thanks to GLBT outcry). The message is loud and clear: we need to increase our corporate efforts, and we need to do it now. We've come too far to let our hard work be undone.\n \n Over the past 20 years, HRC's workplace project has worked with companies across America to successfully change their policies and culture. It is crucial that this important work continue in order to ensure that ALL Americans are protected in the workplace.\n \n Please, I hope you'll help. Make a contribution to our campaign to stop workplace discrimination today. Click here:\n https://secure.ga3.org/03/donate_workplace/nG11gTGM1VmNx??source=W06BGEAG1\n \n I can't wait to tell Gary how HRC members like you are supporting him and fighting these awful groups. Thank you, thank you for your support.\n \n Joe Solmonese\n HRC President\n \n\n P.S. Don't let this campaign stop with you! Forward this e-mail to a friend!", 
   {
    "post_info": {
     "post_title": "American Family Association attack of ex Proctor &amp; Gamble executive..."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1115966520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  American Family Association attack of ex Proctor & Gamble executive...", 
  "url": "http://www.4forums.com/political/gay-rights-debates/5186-american-family-association-attack-ex-proctor-gamble-executive.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 5186, 
  "discussion_files": [
   [
    "23217.html", 
    "http://www.4forums.com/political/gay-rights-debates/5186-american-family-association-attack-ex-proctor-gamble-executive-print.html"
   ]
  ], 
  "identifier": 5186
 }
]