[
 [
  [
   122037, 
   null, 
   "Wez", 
   "Could someone explain to me what's good about being patriotic?\n \n I'm genuinely interested.\n \n -Wez", 
   {
    "post_info": {
     "post_title": "Patriotism"
    }
   }, 
   null, 
   null, 
   1116000060.0
  ], 
  [
   122051, 
   null, 
   "georged", 
   "Could someone explain to me what's good about being patriotic?\n \n I'm genuinely interested.\n \n -Wez\n\n \n Being in a position of achieving substantial, personal, material gain from the policies of your particular government. There are also a large group of people, commonly known as followers, sheep, cannon fodder, etc., who feel emotional pride is the key benefit.", 
   {}, 
   122037, 
   null, 
   1116001740.0
  ], 
  [
   122071, 
   null, 
   "Alan Ryan", 
   "Could someone explain to me what's good about being patriotic?\n \n I'm genuinely interested.\n \n -Wez\n \n Perhaps patriotism is the last refuge of a scoundrel ?", 
   {}, 
   122037, 
   null, 
   1116003660.0
  ], 
  [
   122078, 
   null, 
   "Kronus", 
   "A common problem in morality is getting people to apply their moral code to a large group of people. Correct moral behavior generally calls for making some sacrifice, or not doing something that you might like to do. People tend to define a small group of people for whom they are more willing to apply a stricter moral code. This could be family members, frat brothers, a gang, whatever. People are more willing to make sacrifices for members of that group than they are for people outside that group.\n \n The idea behind patriotism, then, is to try to elevate, in people's minds, the concept of country to the level of \"something for which you would sacrifice more.\" It's taking the idea of \"family loyalty\", or \"school spirit\" and expanding it to apply to an entire country. Those who are more patriotic are more willing to sacrifice for their countries.\n \n Of course, as georged points out, there are those who are quite willing to exploit this for their own gain.", 
   {}, 
   122051, 
   null, 
   1116004260.0
  ], 
  [
   122093, 
   null, 
   "Alan Ryan", 
   "\n \n Of course, as georged points out, there are those who are quite willing to exploit this for their own gain.\n\n \n That is the crucial point: emotional appeals to \"patriotism\" can (and do) destroy, or at least diminish, rational evaluation of supposed \"threats\" that a country may face.\n \n This is why Sam Johnson said it was the last refuge of a scoundrel.", 
   {}, 
   122078, 
   null, 
   1116005880.0
  ], 
  [
   122104, 
   null, 
   "Kronus", 
   "That is the crucial point: emotional appeals to \"patriotism\" can (and do) destroy, or at least diminish, rational evaluation of supposed \"threats\" that a country may face.\n \n\n \n I think I'll need you to be plainer here. Are saying that patriotism is always bad? Or just that it's sometimes misused? Clearly it can and is often misused, but that doesn't make it a bad thing. People have used \"schools spirit\" as an excuse to cover up drug problems on the school's sports teams, or \"family loyalty\" as a reason not to do something about an abusive parent, but that doesn't make those concepts bad, it just means that they were being misused. The problem lies not in the concept, but in the people who are deliberately misusing it.", 
   {}, 
   122093, 
   null, 
   1116006360.0
  ], 
  [
   122108, 
   null, 
   "Missouri Mule", 
   "If you have to ask, you'll never understand it.", 
   {}, 
   122104, 
   null, 
   1116006540.0
  ], 
  [
   122111, 
   null, 
   "Alan Ryan", 
   "I think I'll need you to be plainer here. Are saying that patriotism is always bad? Or just that it's sometimes misused? Clearly it can and is often misused, but that doesn't make it a bad thing. People have used \"schools spirit\" as an excuse to cover up drug problems on the school's sports teams, or \"family loyalty\" as a reason not to do something about an abusive parent, but that doesn't make those concepts bad, it just means that they were being misused. The problem lies not in the concept, but in the people who are deliberately misusing it.\n \n \n No, Kronus, it would be crazy to maintain that patriotism is always bad. There are circumstances when it is absolutely vital to the continued existence of a nation.\n \n I think what georged was drawing attention to (and I chimed in here with my Sam Johnson quote) is the need for skepticism when the invocation of patriotism is used to \"guide\" public opinion rather than give information that would inform it.", 
   {}, 
   122104, 
   null, 
   1116006780.0
  ], 
  [
   122113, 
   null, 
   "wilted_laughter", 
   "If you have to ask, you'll never understand it.\n\n \n Really? I would think that if you didn't ask you'd never understand it. I was under the impression that's how learning worked.", 
   {}, 
   122108, 
   null, 
   1116006780.0
  ], 
  [
   122132, 
   null, 
   "Wez", 
   "If you have to ask, you'll never understand it.\n\n Traditionally people learn by asking. \n \n Bar that responce, the responces have all been pretty informative. Cheers.\n \n Obviously I have my own view of what patriotism is, but I'm not going to voice it at the start of the thread, seeing as that'll just lead to the degredation of the thread as opposed to relatively open discussion.\n \n -Wez", 
   {
    "unicode_changes_made": true
   }, 
   122108, 
   null, 
   1116007740.0
  ], 
  [
   122143, 
   null, 
   "Kronus", 
   "\n I think what georged was drawing attention to (and I chimed in here with my Sam Johnson quote) is the need for skepticism when the invocation of patriotism is used to \"guide\" public opinion rather than give information that would inform it.\n\n \n Ok, thanks for clearing that up. I'm pretty much always in favor of skepticism. :)", 
   {}, 
   122111, 
   null, 
   1116008340.0
  ], 
  [
   122155, 
   null, 
   "georged", 
   "No, Kronus, it would be crazy to maintain that patriotism is always bad. There are circumstances when it is absolutely vital to the continued existence of a nation.\n \n I think what georged was drawing attention to (and I chimed in here with my Sam Johnson quote) is the need for skepticism when the invocation of patriotism is used to \"guide\" public opinion rather than give information that would inform it.\n\n \n I was just 'Instant Winner' in another thread, the topic being indicative of manipulation used to guide emotional patriotism:\n \n http://www.4forums.com/political/showthread.php?t=5198", 
   {}, 
   122111, 
   null, 
   1116009060.0
  ], 
  [
   122164, 
   null, 
   "Missouri Mule", 
   "Really? I would think that if you didn't ask you'd never understand it. I was under the impression that's how learning worked.\n\n \n Let me give you a personal observation. I attended a NASCAR event in Alabama shortly after the first Gulf War ended. These events are always highly charged with patriotism, prayers and aircraft and such flying overhead. But it was when I heard the national anthem played and the military members on parade that tears welled up in my eyes. I was proud of my country; what we had accomplished and I cannot imagine how anyone could feel otherwise. Recently, I ran into a uniformed member of the military at a local restaurant. I felt compelled to go to him and thank him for his service. I know that he is willing to put his life on the line to protect me and my family. I don't intend to forget that so long as I draw breath.\n \n To my point, I feel my patriotism inside. I don't have to intellectualize about patriotism. One knows inside whether he or she is patriotic. If there is a numbness or unknowing understanding of patriotism, it is highly likely he or she will be enticed by the propagandists who denigrate our nation. No real American will have difficulty in knowing where they stand.", 
   {}, 
   122113, 
   null, 
   1116009360.0
  ], 
  [
   122206, 
   null, 
   "Kronus", 
   "Thank you, Mule, for so perfectly illustrating both sides of patriotism. The good: risking your life in the military, and the bad: \" No real American...\"\n \n Patriotism can either be a motivation for self-sacrifice, or a tool to try to try to impose an agenda on people.", 
   {}, 
   122164, 
   null, 
   1116011340.0
  ], 
  [
   122234, 
   null, 
   "Duo_Maxwell", 
   "Hey Guess what, No Real American would support putting US troops in unnecessary danger.\n \n Guess that makes Mule not a real American!\n \n lol. Seeing how rational arguments are clearly lost on Mule, let's comence with the outright mocking.", 
   {}, 
   122206, 
   null, 
   1116012720.0
  ], 
  [
   122241, 
   null, 
   "Wez", 
   "Let me give you a personal observation. I attended a NASCAR event in Alabama shortly after the first Gulf War ended. These events are always highly charged with patriotism, prayers and aircraft and such flying overhead. But it was when I heard the national anthem played and the military members on parade that tears welled up in my eyes. I was proud of my country; what we had accomplished and I cannot imagine how anyone could feel otherwise. Recently, I ran into a uniformed member of the military at a local restaurant. I felt compelled to go to him and thank him for his service. I know that he is willing to put his life on the line to protect me and my family. I don't intend to forget that so long as I draw breath.\n\n \n That's fair enough, that seems to be a plus side of patriotism: being nice to others, even if they may have done nothing to deserve it (and he hadn't, seeing as you don't know if he's just joining up for the benefits and if he would 'chicken-out' in an emergency).\n \n \nIf there is a numbness or unknowing understanding of patriotism, it is highly likely he or she will be enticed by the propagandists who denigrate our nation.\n\n The 'nation' can make mistakes (or do you disagree?) When these mistakes are made, there will be consequences, like it or not. D\n \n \nNo real American will have difficulty in knowing where they stand.\n\n Denigrating the nation isn't ok, but denigrating its citizens is ok? Seems like a classic example of: 'disagree with me and you are wrong'. Just because someone isn't strongly patriotic doesn't make them any less of an \"American\". \n \n What's the difference between being American and being of a different nationality? Is either better? If not, why do people feel pride, if they know their nation is no better than others? I can understand that people do feel pride, I just can't see why people look down on those that don't.\n \n Drawing a parallel to love: Should those that are in love (something completely irrational) look down on those that aren't? The answer is of course no.\n \n Slightly off topic: What is a nation? A set of geographical borders? A culture/mix of cultures? A set of ideals/beliefs? A mass of people? A bit of all of the above I guess, but even so I don't see how any nation can be fundamentally better than any other nation.\n \n -Wez", 
   {
    "unicode_changes_made": true
   }, 
   122164, 
   null, 
   1116013080.0
  ], 
  [
   122286, 
   null, 
   "wilted_laughter", 
   "\n \n Slightly off topic: What is a nation? A set of geographical borders? A culture/mix of cultures? A set of ideals/beliefs? A mass of people? A bit of all of the above I guess, but even so I don't see how any nation can be fundamentally better than any other nation.\n \n -Wez\n\n \n A nation is a cultural/community idea that a certain group of people buy into.\n \n By geographical borders I assume you mean political borders, this is the boundry between states. A state is a real political entity, and is a different thing than a nation.\n \n Of course, many modern states are nation-states, where the cultural/community boundry coincidences with the political one, but many states are not.\n \n For example, the island of Ireland could be called a nation, but it is in fact divided between two states.\n \n Re: Patriotism: Pride is one thing, but blind pride and arrogance are another. A certain degree of nationalism can be a good thing (certaintly in the certain forms of 'civic nationalism' or \"patriotism\" that one sees in the United States) but as we all know too much nationalism is a very, very bad thing. In my opinion nationalism may become of decreasing significance in certain parts of the world as it becomes more globalised and regionalised in response to globalisation, (or at least it will have to if states want to protect their interests) however nationalism will probably remain significant in large states which can stand on their own two feet more readily (China and India I suppose are examples).\n \n EDIT: Globalisation and regionalisation could cause a nationalism backlash as well though...\n \n Re: Learnig: One wouldn't be a patriot/nationalist if one hadn't been exposed to various cultural influences particular to ones own brand of nationalism, so it is something you \"learn\".", 
   {}, 
   122241, 
   null, 
   1116015360.0
  ], 
  [
   122384, 
   null, 
   "Missouri Mule", 
   "That's fair enough, that seems to be a plus side of patriotism: being nice to others, even if they may have done nothing to deserve it (and he hadn't, seeing as you don't know if he's just joining up for the benefits and if he would 'chicken-out' in an emergency).\n \n The 'nation' can make mistakes (or do you disagree?) When these mistakes are made, there will be consequences, like it or not. D\n \n Denigrating the nation isn't ok, but denigrating its citizens is ok? Seems like a classic example of: 'disagree with me and you are wrong'. Just because someone isn't strongly patriotic doesn't make them any less of an \"American\". \n \n What's the difference between being American and being of a different nationality? Is either better? If not, why do people feel pride, if they know their nation is no better than others? I can understand that people do feel pride, I just can't see why people look down on those that don't.\n \n Drawing a parallel to love: Should those that are in love (something completely irrational) look down on those that aren't? The answer is of course no.\n \n Slightly off topic: What is a nation? A set of geographical borders? A culture/mix of cultures? A set of ideals/beliefs? A mass of people? A bit of all of the above I guess, but even so I don't see how any nation can be fundamentally better than any other nation.\n \n -Wez\n\n \n As I said earlier, if one has to ask, they aren't. \n \n There was a time in our history in which it was respectable to be patriotic. Now with the left-wing culture, it is passe' and not popular among the limonsene liberal set. By definition those who believe in American ideals and adherence to freedom are not to be believed; are \"imperalists\" and all of the rest of the rot that comprises the diseased minds of the left.", 
   {
    "unicode_changes_made": true
   }, 
   122241, 
   null, 
   1116026040.0
  ], 
  [
   122388, 
   null, 
   "Missouri Mule", 
   "That's fair enough, that seems to be a plus side of patriotism: being nice to others, even if they may have done nothing to deserve it (and he hadn't, seeing as you don't know if he's just joining up for the benefits and if he would 'chicken-out' in an emergency).\n -Wez\n\n \n The individual in question was an E-7 and had served in wartime. He was a career soldier who had served proudly; you know the kind who gave their limbs and sometimes lives to keep Europe free from the Nazi hoards. That kind of guy.", 
   {}, 
   122241, 
   null, 
   1116026220.0
  ], 
  [
   122396, 
   null, 
   "Wez", 
   "As I said earlier, if one has to ask, they aren't. \n \n There was a time in our history in which it was respectable to be patriotic. Now with the left-wing culture, it is passe' and not popular among the limonsene liberal set. \n\n \n There was a time in your history in which it was respectable to have black slaves. Now with the left-wing culture, it is passe' and not popular among the limonsene liberal set.\n \n Damn them liberals.\n \n Still, do you see America as better than any nation? If not why are you proud to be American?\n \n -Wez", 
   {}, 
   122384, 
   null, 
   1116027420.0
  ], 
  [
   122397, 
   null, 
   "Eddie", 
   "The individual in question was an E-7 and had served in wartime. He was a career soldier who had served proudly; you know the kind who gave their limbs and sometimes lives to keep Europe free from the Nazi hoards. That kind of guy.\n\n \n You said you met him recently... Is it custommary to wear ones military uniform when retired in the US?", 
   {}, 
   122388, 
   null, 
   1116027720.0
  ], 
  [
   122403, 
   null, 
   "Missouri Mule", 
   "You said you met him recently... Is it custommary to wear ones military uniform when retired in the US?\n\n \n He's active duty.", 
   {}, 
   122397, 
   null, 
   1116028680.0
  ], 
  [
   122405, 
   null, 
   "Missouri Mule", 
   "There was a time in your history in which it was respectable to have black slaves. Now with the left-wing culture, it is passe' and not popular among the limonsene liberal set.\n \n Damn them liberals.\n \n Still, do you see America as better than any nation? If not why are you proud to be American?\n \n -Wez\n\n \n We're not talking about slavery. Better than any other nation? Not necessarily. But I believe we are the most consequential.", 
   {}, 
   122396, 
   null, 
   1116028740.0
  ], 
  [
   122410, 
   null, 
   "Eddie", 
   "He's active duty.\n\n \n How old was he when he was \"keeping europe free from Nazi hoards\"? emoticon_confused", 
   {}, 
   122403, 
   null, 
   1116028980.0
  ], 
  [
   122421, 
   null, 
   "Wez", 
   "We're not talking about slavery. Better than any other nation? Not necessarily. But I believe we are the most consequential.\n\n \n What does that mean? Does it mean it's the most important, the one whose actions have the greatest effect etc.?\n \n Also, are any of them necessarily a good thing?\n \n -Wez", 
   {}, 
   122405, 
   null, 
   1116030960.0
  ], 
  [
   122500, 
   null, 
   "Missouri Mule", 
   "How old was he when he was \"keeping europe free from Nazi hoards\"? emoticon_confused\n\n \n I don't know. I doubt I will see him again. I don't really understand what your point is with this particular soldier. The American soldier (generically) is ultimately the one who did free Europe from the Nazi hoards.", 
   {}, 
   122410, 
   null, 
   1116052380.0
  ], 
  [
   122501, 
   null, 
   "Missouri Mule", 
   "What does that mean? Does it mean it's the most important, the one whose actions have the greatest effect etc.?\n \n Also, are any of them necessarily a good thing?\n \n -Wez\n\n \n It means what it says. America is the most consequential nation in the history of the world for any number of reasons; most notably because it is a beacon of light in a sea of darkness.", 
   {}, 
   122421, 
   null, 
   1116052440.0
  ], 
  [
   122508, 
   null, 
   "SteveRogers", 
   "Hey Guess what, No Real American would support putting US troops in unnecessary danger.\n\n \n \n Right. This is right. The Patriots ave been the people trying to bring reason and truth to the country and not the communist like acceptence of every utterence of the \"Motherland\" adminstration.", 
   {}, 
   122234, 
   null, 
   1116053760.0
  ], 
  [
   122517, 
   null, 
   "Missouri Mule", 
   "Right. This is right. The Patriots ave been the people trying to bring reason and truth to the country and not the communist like acceptence of every utterence of the \"Motherland\" adminstration.\n\n \n Troops get put into a lot of dangerous situations over the years. When we get to the point where we are paralyzed with indecision we will cease to exist as a free nation.", 
   {}, 
   122508, 
   null, 
   1116054780.0
  ], 
  [
   122557, 
   null, 
   "Wez", 
   "It means what it says. America is the most consequential nation in the history of the world for any number of reasons; most notably because it is a beacon of light in a sea of darkness.\n\n Consequential has a lot of different meanings (look it up in a dictionary if you don't believe me...).\n \n What makes it a \"beacon of light in a sea of darkness\"?\n \n \nThe American soldier (generically) is ultimately the one who did free Europe from the Nazi hoards.\n\n Along with the Russian soldier and the European soldier.\n \n -Wez", 
   {}, 
   122501, 
   null, 
   1116068640.0
  ], 
  [
   122558, 
   null, 
   "Eddie", 
   "I don't know. I doubt I will see him again. I don't really understand what your point is with this particular soldier. The American soldier (generically) is ultimately the one who did free Europe from the Nazi hoards.\n\n \n No real point. Just bickering...", 
   {}, 
   122500, 
   null, 
   1116068880.0
  ], 
  [
   122625, 
   null, 
   "Missouri Mule", 
   "No real point. Just bickering...\n\n \n If I run into him again I'll let him know you are interested and will get more details about his service.", 
   {}, 
   122558, 
   null, 
   1116088020.0
  ], 
  [
   122627, 
   null, 
   "Missouri Mule", 
   "Consequential has a lot of different meanings (look it up in a dictionary if you don't believe me...).\n \n What makes it a \"beacon of light in a sea of darkness\"?\n \n \n Along with the Russian soldier and the European soldier.\n \n -Wez\n\n \n We've plowed this ground before but let me do it one more time. The United States is the one power that sees more clearly what is at stake regarding terrorism. Europe doesn't. And much of the rest of the world is blinded by religious fanaticism and ignorance.\n \n The Nazis would not have been defeated without American military power and sacrifice. One doesn't judge success by the size of the body count. The Soviets and especially Stalin and his generals didn't give a damn about how many of their own troops got killed. We do.", 
   {}, 
   122557, 
   null, 
   1116088200.0
  ], 
  [
   122637, 
   null, 
   "Symbiote", 
   "The US was one of the most significant powers in the history of the world. It is no longer. It has become like every other power throughout history, like the Roman, British, Spanish, Austrian, German, French, Dutch, Argentinian, Russian or Greek powers. There is nothing more mundane than the US's power right now. It is what all powers have been throughout history. If there is anything significant about it, it is in its demonstration that even the most exceptional of beginnings of a state will lead to an ignanimous end.\n \n That you have fallen for the myth of American exceptionalism is of course unsurprising.", 
   {}, 
   122627, 
   null, 
   1116088620.0
  ], 
  [
   122652, 
   null, 
   "Jo Bennett", 
   "We've plowed this ground before but let me do it one more time. The United States is the one power that sees more clearly what is at stake regarding terrorism. Europe doesn't. And much of the rest of the world is blinded by religious fanaticism and ignorance.\n \n The Nazis would not have been defeated without American military power and sacrifice. One doesn't judge success by the size of the body count. The Soviets and especially Stalin and his generals didn't give a damn about how many of their own troops got killed. We do.\n\n \n Just not all that much about how many foreign civilians are killed in the process. US \"morality\" ends at its own citizens. Religious fanaticism and ignorance eh? This coming from someone who loves a country currently trying to have religious dogma replace science in schools, and which is renowned the world over for having little to no knowledge of the world beyond its borders.\n \n Europe see very well what is at stake in the supposed \"war on terror\". It is the lives of hundreds of thousands of civilians, it is the essential liberty given up for temporary security, it is the long slow surrender of everything we hold dear to those who claim to be keeping us safe.", 
   {}, 
   122627, 
   null, 
   1116090480.0
  ], 
  [
   122658, 
   null, 
   "georged", 
   "The US was one of the most significant powers in the history of the world. It is no longer. It has become like every other power throughout history, like the Roman, British, Spanish, Austrian, German, French, Dutch, Argentinian, Russian or Greek powers. There is nothing more mundane than the US's power right now. It is what all powers have been throughout history. If there is anything significant about it, it is in its demonstration that even the most exceptional of beginnings of a state will lead to an ignanimous end.\n \n That you have fallen for the myth of American exceptionalism is of course unsurprising.\n\n \n And like all past empirical powers, we'll continue to mentally feed on past glory while exhausting our remaining wealth on a show of military prowess.", 
   {}, 
   122637, 
   null, 
   1116091620.0
  ], 
  [
   122730, 
   null, 
   "Wez", 
   "We've plowed this ground before but let me do it one more time. The United States is the one power that sees more clearly what is at stake regarding terrorism. Europe doesn't. And much of the rest of the world is blinded by religious fanaticism and ignorance.\n\n \n America is considerably more religious than your average European country. It's not renowned for the intelligence f its citizens concerning the rest of the world either.\n \n Everyone can see what is at stake with terrorism (although imo it's over-blown in most media), just there are different approaches to tackling it. \n \n \n The Nazis would not have been defeated without American military power and sacrifice.\n\n You're entitled to that opinion, suffice to say I disagree, but I don't want to topic to change to WW2.\n \n -Wez", 
   {
    "unicode_changes_made": true
   }, 
   122627, 
   null, 
   1116102360.0
  ], 
  [
   122824, 
   null, 
   "Kronus", 
   "Mule, you obviously consider yourself a patriot. So, as a patriot, I have two questions for you. Has the current administration made any mistakes, and if so what? And is there anything the current administration could be doing better? (ok, maybe that's two and a half questions.)", 
   {}, 
   122730, 
   null, 
   1116113820.0
  ], 
  [
   122850, 
   null, 
   "Missouri Mule", 
   "Mule, you obviously consider yourself a patriot. So, as a patriot, I have two questions for you. Has the current administration made any mistakes, and if so what? And is there anything the current administration could be doing better? (ok, maybe that's two and a half questions.)\n\n \n I'm sure they have. With respect to Iraq I would have put in more troops after the initial hostilities but the biggest blunder in my opinion has been the way propaganda has been handled. And I mean that in the truest sense. We should have blanked the whole country with what we wanted to get out and not have allowed those forces opposed to democracy to set the agenda. I would also have been more mindful of potential prison abuses.\n \n But hindsight is always 100%. It may turn out that this has been one of the best plans ever implemented. It is said that WWII was a series of disasters leading to final victory. By this measure we have done exceedingly well.", 
   {}, 
   122824, 
   null, 
   1116117840.0
  ], 
  [
   122854, 
   null, 
   "Missouri Mule", 
   "Just not all that much about how many foreign civilians are killed in the process. US \"morality\" ends at its own citizens. Religious fanaticism and ignorance eh? This coming from someone who loves a country currently trying to have religious dogma replace science in schools, and which is renowned the world over for having little to no knowledge of the world beyond its borders.\n \n Europe see very well what is at stake in the supposed \"war on terror\". It is the lives of hundreds of thousands of civilians, it is the essential liberty given up for temporary security, it is the long slow surrender of everything we hold dear to those who claim to be keeping us safe.\n\n \n I think the \"religious dogma\" fear is vastly overblown\n regarding the U.S. In my opinion that is a manufactured controversey by the left-wing media. And I say this as one who is not religious himself.\n \n We have not even begun to do what was done in our Civil War, WWI and WWII with respect to \"essential liberties.\" Not even a close call.", 
   {}, 
   122652, 
   null, 
   1116118080.0
  ], 
  [
   122858, 
   null, 
   "Wez", 
   "We have not even begun to do what was done in our Civil War, WWI and WWII with respect to \"essential liberties.\" Not even a close call.\n\n \n Does this justify actions?\n \n Saddam wasn't as bad as Hitler. Does that make him ok? No...\n \n -Wez", 
   {}, 
   122854, 
   null, 
   1116118320.0
  ], 
  [
   122861, 
   null, 
   "Missouri Mule", 
   "Does this justify actions?\n \n Saddam wasn't as bad as Hitler. Does that make him ok? No...\n \n -Wez\n\n \n I'll merely say that our Constitution is not a suicide pact. We cannot be oblivious to those who would do great damage to our foreign policy. I've seen nothing this time that would even begin to cross the line.", 
   {}, 
   122858, 
   null, 
   1116118740.0
  ], 
  [
   122955, 
   null, 
   "SteveRogers", 
   "Troops get put into a lot of dangerous situations over the years. When we get to the point where we are paralyzed with indecision we will cease to exist as a free nation.\n\n \n More dishonesty. No one said anything about anyone being paralyzed. You can have good decisive leadership that actually does the right thing. \n \n And there is nothing free about accepting a direction without question, especially when it is obviously wrong headed. So, focus, and be honest.\n \n \n \nI'll merely say that our Constitution is not a suicide pact. We cannot be oblivious to those who would do great damage to our foreign policy. I've seen nothing this time that would even begin to cross the line.\n\n \n BTW, that was dishonest again and the ogic is really extremely faulty. Nothing about not invading a paper tiger like Saddam relates to a suicide pack. You should be ashamed for trying such obviously dishonest tricks. How old are you anyway? I suppose if you are a kid I can overlook it.", 
   {}, 
   122517, 
   null, 
   1116139380.0
  ], 
  [
   122976, 
   null, 
   "Missouri Mule", 
   "More dishonesty. No one said anything about anyone being paralyzed. You can have good decisive leadership that actually does the right thing. \n \n And there is nothing free about accepting a direction without question, especially when it is obviously wrong headed. So, focus, and be honest.\n \n BTW, that was dishonest again and the ogic is really extremely faulty. Nothing about not invading a paper tiger like Saddam relates to a suicide pack. You should be ashamed for trying such obviously dishonest tricks. How old are you anyway? I suppose if you are a kid I can overlook it.\n\n \n Well, I'm 61 years old if that is relevant. I was reading about this alleged Koran business in GitMo and it appears likely the story is bogus. Yet several Muslims have been killed over the riots and this is going to take a lot of time to calm down and will likely cost American lives. The reporter didn't check his facts and this is the result. In previous patriotic wars (before the left took over the media) this would have been unthinkable. \n \n It is said that a person's freedom to speak ends with shouting fire in a crowded theater. This is tantamount to shouting fire in a crowded theater. No real patriotic American would put other American lives at risk by publishing a bogus story, but this is the sad state of American journalism today. Most don't give a damn about America or our freedom. They may as well be on the payroll of bin Laden himself.\n \n BTW, you can stick your allegations of \"dishonesty\" where the sun doesn't shine. Capiche?", 
   {}, 
   122955, 
   null, 
   1116141300.0
  ], 
  [
   122979, 
   null, 
   "SteveRogers", 
   "Again a diversionary tactic. Certainly if a reporter lies, deserves what he gets. But that hasn't been proven yet either.\n \n But that wasn't what we were talking about and since you look like you are responding to me, since you have me in quotes there, how about being honest and address the issue. If Bush suppoters had been real patriots, they'd have asked questions and made sure this was righeous before going in. They'd have thought this through and listened to all sides with an open mind before running with the fever.\n \n They were not patriots.", 
   {}, 
   122976, 
   null, 
   1116141720.0
  ], 
  [
   123008, 
   null, 
   "Duo_Maxwell", 
   "Does this justify actions?\n \n Saddam wasn't as bad as Hitler. Does that make him ok? No...\n \n -Wez\n\n \n It did when we supported Saddam!\n \n Notice that the Us doesn't mind when a leader starts killing off his citizens if he supports the US. Also notice that the US doesn't mind if the incident isn't of use or importance to the US. We only act if there is some direct benefit to the Us.", 
   {}, 
   122858, 
   null, 
   1116148500.0
  ], 
  [
   123017, 
   null, 
   "Big_Bear_Scot", 
   "\n The reporter didn't check his facts and this is the result. In previous patriotic wars (before the left took over the media) this would have been unthinkable.\n \n \n Didn't Stalin call the Russian defence of the Motherland from the Nazi's, the Great Patriotic War ?\n \n I was just wondering would you condone the printing of a true news story that could endanger the lives of American's ? lets say for example what another incident like what happened in Abu Grahib ?", 
   {}, 
   123008, 
   null, 
   1116156840.0
  ], 
  [
   123062, 
   null, 
   "Missouri Mule", 
   "Didn't Stalin call the Russian defence of the Motherland from the Nazi's, the Great Patriotic War ?\n \n I was just wondering would you condone the printing of a true news story that could endanger the lives of American's ? lets say for example what another incident like what happened in Abu Grahib ?\n\n \n Absolutely not. Just like we suppressed the true nature of the Katyn Forrest Massacre that we now know was the work of Stalin and his henchmen. It was considered much more important to keep the Allies on the same side. This would have driven a wedge right down the middle of American society that has a lot of Polish descendents.\n \n This is not to say that it ought not to be handled by our government. It should and it should be corrected. But if anyone believes that our soldiers were innocent of atrocities in WWII are smoking something. We did and especially in the battlefields of the Pacific theater. \n \n Everything in WWII was censored heavily. Even to the point that letters from employees working on the Mahattan Project (the atom bomb) could not be mailed from regular postal facilities. They were picked up in a \"mail drop\" where they were examined and then remailed from other states so as to not connect the two facilities working on the bomb. Victory was all that counted.", 
   {}, 
   123017, 
   null, 
   1116173340.0
  ], 
  [
   123488, 
   null, 
   "SteveRogers", 
   "Sensorship is patriotism? Wow. Youngman and youngwoman, I want you to die for the lie of the week, but don't worry, it's for the motherland. No matter how obscure or evil the reason, that's just not your concern. What ever the governement says, the patriot buys, even when it is a poor lie and will cost many lives, patriots pretend it is true.\n \n Lord Mule, sign me up. :xcensored", 
   {}, 
   123062, 
   null, 
   1116257340.0
  ], 
  [
   123495, 
   null, 
   "Eddie", 
   "What I find particulary interesting (read: disturbing, troubling) is that this censorship is based on the notion of a state of war against a concept. A war where victory cannot be defined, but can be waged forever...", 
   {}, 
   123488, 
   null, 
   1116258600.0
  ], 
  [
   123496, 
   null, 
   "georged", 
   "It did when we supported Saddam!\n \n Notice that the Us doesn't mind when a leader starts killing off his citizens if he supports the US. Also notice that the US doesn't mind if the incident isn't of use or importance to the US. We only act if there is some direct benefit to the Us.\n\n \n Every country makes decisions based on self-serving interest, nothing else. Iran was, to the US and our leaders, a great country when the Shah was oppressing it under our direction. Saddam was considered as an ally when he warred with Iraq. Saudi Arabia, as oppressive as a monarchy gets, is our staunch ally. Tiny Kuwait, with 10% of the public allowed to vote in a constitutional monarchy, is our kind of ally. Few S. American countries escaped direct US influence at one time or another. Tell the public what they want to hear, pick any subject, and blind patriotism will follow without question or guilt while labeling those who question government actions as unpatriotic.", 
   {}, 
   123008, 
   null, 
   1116258840.0
  ], 
  [
   123497, 
   null, 
   "Symbiote", 
   "A man only wishes for others to lie, when he himself is afraid of hearing the truth.", 
   {}, 
   123496, 
   null, 
   1116259140.0
  ], 
  [
   123499, 
   null, 
   "Missouri Mule", 
   "I noticed that no one addressed the historical facts I presented in my last post. Why am I not surprised?\n \n It has been obvious to real Americans for a very long time that the left has no interest in maintaining freedom if it interferes with their unstated goal of destroying America. One has only to look at the Newsweek fiasco to see further proof of this fact. The ends always justify the means. America is bad. America is bad. Keep saying it over and over and the gullible and downright stupid will lap it up like the imbeciles they are.", 
   {}, 
   123497, 
   null, 
   1116259680.0
  ], 
  [
   123502, 
   null, 
   "Symbiote", 
   "You are correct that America committed atrocities during World War 2, though most of them were against the Japanese, and you are correct that Roosevelt was a tyrant.\n \n You are correct that you are opposed to the American constitution and the values embodied within it.\n \n These facts don't need to be \"addressed\", they speak for themselves. \n \n It speaks for itself that you idolise a radically left wing president, despite your continual tirades against \"liberals\", because you don't especially care what policies are pursued, as long as you get your fix of brutal warfare, atrocities and propaganda, in the name of America.", 
   {}, 
   123499, 
   null, 
   1116259980.0
  ], 
  [
   123504, 
   null, 
   "georged", 
   "What I find particulary interesting (read: disturbing, troubling) is that this censorship is based on the notion of a state of war against a concept. A war where victory cannot be defined, but can be waged forever...\n\n \n In a democracy where leaders are positioned on a basis of popular representation and face a declining industrial economy with loss of prosperity, any methodology that adequately pumps the GDP is considered astute government. If it can go on forever, or at least through your term, very astute government.", 
   {}, 
   123495, 
   null, 
   1116260100.0
  ], 
  [
   123509, 
   null, 
   "georged", 
   "\n It speaks for itself that you idolise a radically left wing president, despite your continual tirades against \"liberals\", because you don't especially care what policies are pursued, as long as you get your fix of brutal warfare, atrocities and propaganda, in the name of America.\n\n \n You've just described what were labeled Southern Democrats before Thurmond's convenient conversion and the subsequent conversions of those following his adjusted ideology for the money right up to the present day. All that's missing is deep-seated racial discrimination for purposes of governing by fear, but Muslims seem to be filling that requirement.", 
   {}, 
   123502, 
   null, 
   1116261120.0
  ], 
  [
   123515, 
   null, 
   "SteveRogers", 
   "You are correct that America committed atrocities during World War 2, though most of them were against the Japanese, and you are correct that Roosevelt was a tyrant.\n \n You are correct that you are opposed to the American constitution and the values embodied within it.\n \n These facts don't need to be \"addressed\", they speak for themselves. \n \n It speaks for itself that you idolise a radically left wing president, despite your continual tirades against \"liberals\", because you don't especially care what policies are pursued, as long as you get your fix of brutal warfare, atrocities and propaganda, in the name of America.\n\n \n This is how I read Mule as well. He seems to NEED to see people dead and to FEEL the deaths are justified and to be REASSURED that America is good or at least great. Which leads me to think he protests too much.", 
   {}, 
   123502, 
   null, 
   1116262080.0
  ], 
  [
   123547, 
   null, 
   "Missouri Mule", 
   "You are correct that America committed atrocities during World War 2, though most of them were against the Japanese, and you are correct that Roosevelt was a tyrant.\n \n You are correct that you are opposed to the American constitution and the values embodied within it.\n \n These facts don't need to be \"addressed\", they speak for themselves. \n \n It speaks for itself that you idolise a radically left wing president, despite your continual tirades against \"liberals\", because you don't especially care what policies are pursued, as long as you get your fix of brutal warfare, atrocities and propaganda, in the name of America.\n\n \n You're talking nonsense. I have the highest respect for the Constitution but do not believe it requires us to commit mass suicide by appeasing terrorism. You need to read up on history; specifically our Civil War, WWI and WWII. \n \n I never said Roosevelt was a \"tyrant.\" He was a beloved president who did what he had to do to win the war and address the Great Depression. His declining physical and mental abilities at the close of his life have clouded his legacy but on balance is is rightly considered to be one of our greatest presidents. He is in fact considered the greatest president of the 20th century and I concur.", 
   {}, 
   123502, 
   null, 
   1116263580.0
  ], 
  [
   123569, 
   null, 
   "Truthsayer", 
   "You are correct that America committed atrocities during World War 2, though most of them were against the Japanese,\n \n \n It is written that \"War is Hell.\" (I would have written it, \"War is Stupid.\") An attrocity is an attrocity regardless of who commits it but considering the Japanese mentality and their barbarian tactics of warfare back then, I doubt I will lose any sleep over any of our attrocities commited upon them during WW2. I prefer to look at it as Kharma.", 
   {}, 
   123547, 
   null, 
   1116265680.0
  ], 
  [
   123573, 
   null, 
   "Eddie", 
   "It is written that \"War is Hell.\" (I would have written it, \"War is Stupid.\") An attrocity is an attrocity regardless of who commits it but considering the Japanese mentality and their barbarian tactics of warfare back then, I doubt I will lose any sleep over any of our attrocities commited upon them during WW2. I prefer to look at it as Kharma.\n\n \n Collective racial responsibility in this day and age? That`s pretty scary...", 
   {}, 
   123569, 
   null, 
   1116266040.0
  ], 
  [
   123580, 
   null, 
   "georged", 
   "Collective racial responsibility in this day and age? That`s pretty scary...\n\n \n Shouldn't surprise you when combined with an opinion of ME ideological differences being purely a conflict of Christian and Islamic fundamentalists.", 
   {}, 
   123573, 
   null, 
   1116266700.0
  ], 
  [
   123763, 
   null, 
   "Wez", 
   "Collective racial responsibility in this day and age? That`s pretty scary...\n\n \n Combined with the wide sweepng statements such as \"the left\". Creepy.\n \n -Wez", 
   {}, 
   123573, 
   null, 
   1116286020.0
  ], 
  [
   123806, 
   null, 
   "Duo_Maxwell", 
   "Complications and generally complexity is much easier to ignore when one can demonize their alleged enemy with mindless comments like \"the left.\"\n \n What is amusing is that term is now being used to describe actual conservatives that disagree with republicans. It's becomming similar to activist judge.", 
   {}, 
   123763, 
   null, 
   1116290400.0
  ], 
  [
   123948, 
   null, 
   "Missouri Mule", 
   "Collective racial responsibility in this day and age? That`s pretty scary...\n\n \n Let there be no mistake about it. If we have another 9/11 or worse on American soil, the racism that was rampant during WWII will seem like a walk in the park. One only has to see some of the archival footage of American's feelings against the Japanese during that war to know that virtually all Americans believed that strongly. And 99% of Americans at time wanted only one thing and that was to end the war and as one woman put it, she didn't care if it resulted in the death of all Japanese. I would never have said that but that was all too common back in those days. The feelings for Germans was also quite hostile. I went to school with two young German boys in the early '50s and those poor boys were tormented by their classmates. Let a nuclear bomb go off in America and it will be Katy bar the door.\n \n This is why the war on terror as conducted by Bush is the right war. It is far, far better that we fight them over there than on the streets of America.", 
   {}, 
   123573, 
   null, 
   1116313140.0
  ], 
  [
   124117, 
   null, 
   "SteveRogers", 
   "So, this is the land of the semi-free and the home of the frighten? Mule, if the world ends, it ends. Reasonable efforts and protections are fine. Being so scared you lose all sense of ehtics, morals, or right and wrong is not. I don't think I am the only one who feels you are a little too scared and a little too willing to kill and ignore evidence.", 
   {}, 
   123948, 
   null, 
   1116361020.0
  ], 
  [
   124193, 
   null, 
   "Missouri Mule", 
   "So, this is the land of the semi-free and the home of the frighten? Mule, if the world ends, it ends. Reasonable efforts and protections are fine. Being so scared you lose all sense of ehtics, morals, or right and wrong is not. I don't think I am the only one who feels you are a little too scared and a little too willing to kill and ignore evidence.\n\n \n I'm not frightened at all. I just sounding the clarion call for the ostriches here and elsewhere to get off their butts, stand on their own two hind legs and do something about terrorism before it is too late. Wouldn't you have rather had someone like me making news before 9/11?", 
   {}, 
   124117, 
   null, 
   1116369540.0
  ], 
  [
   124295, 
   null, 
   "Eddie", 
   "@ MM\n \n Hardly an excuse for assigning collective racial responsibility yourself. I`m not saying that you do it, but \"Truthsayer\" sure did...", 
   {}, 
   124193, 
   null, 
   1116379500.0
  ], 
  [
   124419, 
   null, 
   "SteveRogers", 
   "I'm not frightened at all. I just sounding the clarion call for the ostriches here and elsewhere to get off their butts, stand on their own two hind legs and do something about terrorism before it is too late. Wouldn't you have rather had someone like me making news before 9/11?\n\n \n \n Do what? Shoot my neighbor maybe? I mean you have used it to justify invading another country not party to 9/11. Doesn't this mean that I can simply invoke 9/11 to justify any atrocity I desire?\n \n I question whether someone not frightened would be so willing to be so reckless with the lives of other human beings.", 
   {}, 
   124193, 
   null, 
   1116391140.0
  ], 
  [
   129788, 
   null, 
   "jskufan", 
   "To my point, I feel my patriotism inside. I don't have to intellectualize about patriotism. One knows inside whether he or she is patriotic. If there is a numbness or unknowing understanding of patriotism, it is highly likely he or she will be enticed by the propagandists who denigrate our nation. No real American will have difficulty in knowing where they stand.\n\n \n It seems to me in reading your other posts, your defining \"Patriotism\" as support for the Bush Administration and their foreign policy as it relates to the Middle East. Therefore, if someone had opposing views on spreading freedom and fighting terrorism in the Middle East, you would consider them unpatriotic. The United States military is an institution whose actions and missions are directed by elected officials. That said, the credibility of any mission is Dependant on the legitimacy of the rationale behind it. I think most every American is capable of respecting the men and women of the armed forces for their sacrifice while holding their superiors to the highest level of scrutiny when it comes to their deployment. It's possible to love your country while acknowledging the politicians that run it can make mistakes.", 
   {}, 
   122164, 
   null, 
   1117331640.0
  ], 
  [
   130160, 
   null, 
   "fracas", 
   "Hey Guess what, No Real American would support putting US troops in unnecessary danger.\n \n Guess that makes Mule not a real American!\n \n lol. Seeing how rational arguments are clearly lost on Mule, let's comence with the outright mocking.\n\n \n lame\n Real American would support US troops because they face dangers so others would not.", 
   {}, 
   122234, 
   null, 
   1117424040.0
  ], 
  [
   130162, 
   null, 
   "fracas", 
   "@Wez\n \n \n Patriotism is a commitment to the nation-state of which you are a member of, to continue the works others have done to create and improve it. This sometimes means dying to preserve it. This sometime means criticizing it. There is an order of priority: firstly preservation, secondly improvement. As it entails both commitment and contribution/work toward a better state, it would be a wasted effort if you do not feel proud of your commitment and work. And as a correlary, be appreciative of the work done by others toward the same goal.\n \n \n btw, \n Nation \n Nation State", 
   {}, 
   130160, 
   null, 
   1117424400.0
  ], 
  [
   130187, 
   null, 
   "Heads_On_Pikes", 
   "@Wez\n \n \n Patriotism is a commitment to the nation-state of which you are a member of, to continue the works others have done to create and improve it. This sometimes means dying to preserve it. This sometime means criticizing it. There is an order of priority: firstly preservation, secondly improvement. As it entails both commitment and contribution/work toward a better state, it would be a wasted effort if you do not feel proud of your commitment and work. And as a correlary, be appreciative of the work done by others toward the same goal.\n\n \n Damn, that is very, very good! Worth repeating.", 
   {}, 
   130162, 
   null, 
   1117431600.0
  ], 
  [
   130191, 
   null, 
   "zachvac", 
   "@Wez\n \n \n Patriotism is a commitment to the nation-state of which you are a member of, to continue the works others have done to create and improve it. This sometimes means dying to preserve it. This sometime means criticizing it. There is an order of priority: firstly preservation, secondly improvement. As it entails both commitment and contribution/work toward a better state, it would be a wasted effort if you do not feel proud of your commitment and work. And as a correlary, be appreciative of the work done by others toward the same goal.\n \n \n btw, \n Nation \n Nation State\n\n \n \n \n this is a very good definition.", 
   {}, 
   130162, 
   null, 
   1117432140.0
  ], 
  [
   130245, 
   null, 
   "Phunting", 
   "@Wez\n \n \n Patriotism is a commitment to the nation-state of which you are a member of, to continue the works others have done to create and improve it. This sometimes means dying to preserve it. This sometime means criticizing it. There is an order of priority: firstly preservation, secondly improvement. As it entails both commitment and contribution/work toward a better state, it would be a wasted effort if you do not feel proud of your commitment and work. And as a correlary, be appreciative of the work done by others toward the same goal.\n \n \n btw, \n Nation \n Nation State\nI agree, good definition. Though it would imply that us Brits can't be patiotic, not having a nation-state as we do.", 
   {}, 
   130162, 
   null, 
   1117458360.0
  ], 
  [
   130274, 
   null, 
   "Wez", 
   "Patriotism is a commitment to the nation-state of which you are a member of, to continue the works others have done to create and improve it. This sometimes means dying to preserve it. This sometime means criticizing it. There is an order of priority: firstly preservation, secondly improvement. As it entails both commitment and contribution/work toward a better state, it would be a wasted effort if you do not feel proud of your commitment and work. And as a correlary, be appreciative of the work done by others toward the same goal.\n\n Interesting. I can see what you mean by wanting to preserve/improve a nation-state, however I do not see why one nation state is better, or can be viewed as better than another nation-state. I don't view my nation as better or worse than any other. As such, I don't really feel any sense of patriotism.\n \n Then again, it also depends on what form patriotism takes. It can be good (helping others who are less fortunate for example), or bad (violence at sports events for example). I'd be in support of the actions patriotism induces, in some cases, and as such might be seen as patriotic, while I'd disagree with other actions caused by patriotism.\n \n Certainly, I don't feel any more associated with those in 'my' country than I do with those at the other end of the world. I either know a person, know of a person or I don't know/know of a person. If someone falls into the third category their nationality/ race/ religion don't bother me; they're all the same to me in terms of their well-being/worth.\n \n -Wez", 
   {}, 
   130162, 
   null, 
   1117464840.0
  ], 
  [
   130275, 
   null, 
   "fracas", 
   "a nation-state is better because you choose to make it better.", 
   {}, 
   130274, 
   null, 
   1117465980.0
  ], 
  [
   130283, 
   null, 
   "Wez", 
   "a nation-state is better because you choose to make it better.\n\n If I view them as equal however, is there any reason to choose to make 'my' nation-state better as opposed to others (other than for possible personal benifits, which would be minor I expect)?\n \n -Wez", 
   {}, 
   130275, 
   null, 
   1117467780.0
  ], 
  [
   130286, 
   null, 
   "fracas", 
   "If I view them as equal however, is there any reason to choose to make 'my' nation-state better as opposed to others (other than for possible personal benifits, which would be minor I expect)?\n \n -Wez\n\n \n some people emigrate from one state to another\n and give their patriotism to their new state\n \n your initial question wasn't about \"why you should feel patriotic to the state in which you live\" now was it? ;)", 
   {}, 
   130283, 
   null, 
   1117468140.0
  ], 
  [
   130299, 
   null, 
   "Wez", 
   "Going by definitions, you can only be patriotic to 'your' state. I'm not sure what you can consider as 'your' state however.\n \n http://dictionary.reference.com/search?q=patriotic\n \n I'm not really disagreeing with anything you say however, although we have different opinions on the matter.\n \n -Wez", 
   {}, 
   130286, 
   null, 
   1117470900.0
  ], 
  [
   130352, 
   null, 
   "fracas", 
   "what i meant is to move to another state, and be patriotic to that new home state.\n \n i think the key concepts are\n 1. choice\n 2. commitment\n 3. improvement\n \n you choose to make the commitment to make your life and another's life better\n \n kinda like why marry when you can sleep around?", 
   {}, 
   130299, 
   null, 
   1117477140.0
  ], 
  [
   130371, 
   null, 
   "georged", 
   "what i meant is to move to another state, and be patriotic to that new home state.\n \n i think the key concepts are\n 1. choice\n 2. commitment\n 3. improvement\n \n you choose to make the commitment to make your life and another's life better\n \n kinda like why marry when you can sleep around?\n\n \n What about people who don't particularly care about making life better for others, desiring climatic conditions, scenic beauty and reasonable domestic labor costs while still remaining in the US? While tax contributions certainly prove commitment, the choice has been made, but improvement desires are limited to infrastructure and education to retain civil order, not life style enhancements to other parties or expansion of government services. Selfish or democratic live and let live? \n \n Personally, I have no loyalty to any state other than what it can offer me. Isn't that the base attitude for any residence, be it someone needing work or any other purpose?", 
   {}, 
   130352, 
   null, 
   1117478880.0
  ], 
  [
   130419, 
   null, 
   "fracas", 
   "its your perogative to not be patriotic, if you so choose\n and it is also patriots' perogative, if they so choose, to berate the unpatriotic for receiving the fruits of the patriots labor without either commitment or contribution back.", 
   {}, 
   130371, 
   null, 
   1117483260.0
  ], 
  [
   130427, 
   null, 
   "georged", 
   "its your perogative to not be patriotic, if you so choose\n and it is also patriots' perogative, if they so choose, to berate the unpatriotic for receiving the fruits of the patriots labor without either commitment or contribution back.\n\n \n ~I know that theater people often have very simplistic view of politics and tend to express very black and white patriotic sentiments but perhaps that is because we know the value of illusion, how it can help strengthen the weak, and stimulate the weary.~\n Franco Zeffirelli", 
   {}, 
   130419, 
   null, 
   1117484640.0
  ], 
  [
   130649, 
   null, 
   "Phunting", 
   "Interesting. I can see what you mean by wanting to preserve/improve a nation-state, however I do not see why one nation state is better, or can be viewed as better than another nation-state. I don't view my nation as better or worse than any other. As such, I don't really feel any sense of patriotism.\nI consider myself quite patriotic. But that is not to say I consider my country to be 'better' than any others as such. I do feel proud of Britain's achievements and I must say I feel more of a bond with my fellow Brits than those of other nationalities, due to a similar upbringing and experiences.\n \n But like I say, I don't really consider Britain to be any better than anywhere else, not really. I find it quite similar to my Rugby team. I support them, am proud of their achievements even though I did not actually contribute towards them, but I know they are not intrinsically 'better' than any other (err especially as I support Harlequins, it would be hard to justify any claims on their behalf at the moment!).\n \n Of course this all ignores the fact that I was born in New York and hence have US nationality. But as I moved back to the UK when I was 2 and both my parents are British, I don't feel any patriotism for the US at all. I voted last year, but only because removing that idiot from the White House is in Britain's interests as much as it is in America's (I know, I know, another topic for another time...). So I guess in that sense I am not patriotic at all, at least not to my country of birth.", 
   {
    "unicode_changes_made": true
   }, 
   130274, 
   null, 
   1117547220.0
  ], 
  [
   130650, 
   null, 
   "Phunting", 
   "its your perogative to not be patriotic, if you so choose\n and it is also patriots' perogative, if they so choose, to berate the unpatriotic for receiving the fruits of the patriots labor without either commitment or contribution back.\nReminds me of a cartoon I once saw in 'The Age' newspaper back when I lived in Oz. A protestor holds up a placard at a demonstration and is approached by a man who says:\n \n \"Don't you know that our ancestors died so you could have the freedom to hold that placard...\n \n \"... how dare you exercise that freedom!\"", 
   {}, 
   130419, 
   null, 
   1117547460.0
  ], 
  [
   130779, 
   null, 
   "Hydra", 
   "Dissent, and the willingness to express such, is the highest form of patriotism.", 
   {}, 
   130650, 
   null, 
   1117571220.0
  ], 
  [
   130866, 
   null, 
   "notdakuningist", 
   "Patriotism involves bettering the lot of those within your country.\n Notdakuningist's ammendment: As long as your not worsening the lot of the whole world in expense.\n \n As with anything there are shades of grey and times when you have to let your morality decide what is better for your country, and what is good or bad for the world as a whole.", 
   {}, 
   130779, 
   null, 
   1117583220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Patriotism", 
  "url": "http://www.4forums.com/political/society-debates/5191-patriotism.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 5191, 
  "discussion_files": [
   [
    "27218.html", 
    "http://www.4forums.com/political/society-debates/5191-patriotism-print.html"
   ], 
   [
    "27219.html", 
    "http://www.4forums.com/political/society-debates/5191-patriotism-6-print.html"
   ], 
   [
    "27220.html", 
    "http://www.4forums.com/political/society-debates/5191-patriotism-4-print.html"
   ], 
   [
    "27221.html", 
    "http://www.4forums.com/political/society-debates/5191-patriotism-5-print.html"
   ], 
   [
    "27222.html", 
    "http://www.4forums.com/political/society-debates/5191-patriotism-3-print.html"
   ], 
   [
    "27223.html", 
    "http://www.4forums.com/political/society-debates/5191-patriotism-2-print.html"
   ]
  ], 
  "identifier": 5191
 }
]