[
 [
  [
   122053, 
   null, 
   "Missouri Mule", 
   "This is a very interesting take and thought provoking opinion piece. It also explains something that I have puzzled over for the past four years and that is why we haven't been able to locate the whereabouts of bin Laden. This may very well be the answer. I would say the odds that bin Laden are in Pakistan would be about 99%.\n \n I can recall an e-mail from a friend in India who told me long ago never to trust the leader of Pakistan. I discounted it at the time but this leads me to believe he knew exactly what he was talking about.\n =======================\n \n COMMENTARY\n Pakistan's Chips in a Shady Game\n By Bernard-Henri Levy\n \n Let's recap: The Pakistani special forces squad arrested Khalid Shaikh Mohammed, Al Qaeda's third in command, on March 1, 2003, a few hours before informing the Americans that Pakistan would not back a resolution in favor of the war in Iraq.\n \n They arrested Yasser Jazeeri, another key Al Qaeda operative, in March 2003, a few months before Pakistani President Pervez Musharraf visited Camp David, where he was promised foreign aid to the unprecedented tune of $3 billion.\n \n In March 2002, they collared Abu Zubeida, Al Qaeda operations chief, and they did this during a big U.S. congressional debate on the question of foreign aid to Pakistan, as well as on delivering the F-16 fighter jets that had been held back by the Pentagon because of Pakistan's nuclear ambitions. (The delivery of the jets was even more hotly debated because it was at the top of the list of demands made by Daniel Pearl's kidnappers.)\n \n Months later, on Sept. 11, the Pakistanis chose the first anniversary of the destruction of the twin towers in Manhattan to announce the arrest of Ramzi Binalshib - one of the conceivers and coordinators of the 9/11 attacks - in a residential neighborhood in Karachi where he had been living almost openly.\n \n And now it's Abu Faraj Farj, also known as Abu Faraj Libbi, another high Al Qaeda commander. He was captured under mysterious circumstances, but at a time charged with meaning. It is the moment, according to the Pakistani media, when the Americans have decided to make delivery of the F-16s contingent on American agents getting the right to interrogate Abdul Qadeer Khan, father of the Islamist bomb and godfather of a whole network of nuclear weapons trafficking that involves Iran, North Korea and, perhaps, Al Qaeda's laboratories near Kandahar, Afghanistan. But Musharraf stubbornly continues to deny the U.S. the right to take over the investigation into what is becoming the most enormous nuclear terrorism affair of this era. Pakistan instead hands over another Al Qaeda operative.\n \n So, we can look at the timing in these instances several ways.\n ..\n \n (Snip)\n \n It is as if the Pakistani powers that be have had, ever since Al Qaeda's retreat from Afghanistan and their withdrawal into Karachi, Lahore and Rawalpindi, a precise idea of where the chiefs of Al Qaeda could be found. It is as if Pakistan's formidable intelligence service, the ISI, had not only localized but kept these public enemies of the U.S. - and theoretically of Pakistan - under observation, handy for periodic culling.\n \n It is as if these people were bargaining chips, with the Pakistanis drawing from their reserves of terrorists and cashing them in one by one, depending on the needs of their relationship with the great American \"friend.\"\n \n Optimists will be delighted to learn that there is a country where people know a little about the hiding places of Osama bin Laden's lieutenants, as well as about Bin Laden himself, perhaps...\n \n (Snip)\n \n http://www.latimes.com/news/opinion/commentary/la-oe-levy13may13,0,4714339.story?coll=la-news-comment-opinions", 
   {
    "post_info": {
     "post_title": "Pakistan's Chips in a Shady Game"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1116001980.0
  ], 
  [
   122222, 
   null, 
   "lord tammerlain", 
   "There is a strong history between Pakistan and AQ, the Taliban and Islamic fundamentalism. Much of the Pakistani army and intelligence service have people sympathetic to Islamic militants, and Musharraf has had at least two assasination attempts with one being helped from people within the Pakistani military.", 
   {}, 
   122053, 
   null, 
   1116012300.0
  ], 
  [
   122392, 
   null, 
   "Missouri Mule", 
   "There is a strong history between Pakistan and AQ, the Taliban and Islamic fundamentalism. Much of the Pakistani army and intelligence service have people sympathetic to Islamic militants, and Musharraf has had at least two assasination attempts with one being helped from people within the Pakistani military.\n\n \n Yes, and one of the very first things that the Bush administration was to go to Pakistan and explain the rules of the war to them. On balance it was a very productive meeting but as this article bears out they are using the war to their benefit. So one might view this relationship as a symbiotic affair.", 
   {}, 
   122222, 
   null, 
   1116027120.0
  ], 
  [
   122551, 
   null, 
   "gamehuis", 
   "Before Afghanistan was invaded by the US, Pakistan was one of only two (I believe) countries that officially recognised the Taliban regime. Draw your conclusions from there.", 
   {}, 
   122392, 
   null, 
   1116061380.0
  ], 
  [
   122560, 
   null, 
   "Eddie", 
   "I guess this is what you get for not having any allies anymore... :p \n \n To be honest, you still have allies, no matter what certain conservatives tries to tell you. But you need to treat them (us?) with a little more respect... :)", 
   {}, 
   122551, 
   null, 
   1116069000.0
  ], 
  [
   122620, 
   null, 
   "Missouri Mule", 
   "Before Afghanistan was invaded by the US, Pakistan was one of only two (I believe) countries that officially recognised the Taliban regime. Draw your conclusions from there.\n\n \n And what are YOUR conclusions?", 
   {}, 
   122551, 
   null, 
   1116087780.0
  ], 
  [
   122623, 
   null, 
   "Missouri Mule", 
   "I guess this is what you get for not having any allies anymore... :p \n \n To be honest, you still have allies, no matter what certain conservatives tries to tell you. But you need to treat them (us?) with a little more respect... :)\n\n \n If our erstwhlle allies would merely begin to see the world as it truly is with evil unimagined since the Nazis nearly overran all of Europe, I would be a happy man.", 
   {}, 
   122560, 
   null, 
   1116087960.0
  ], 
  [
   123423, 
   null, 
   "Agnostic", 
   "And Bush knows it. emoticon_cool", 
   {
    "post_info": {
     "post_title": "Bin Laden is in Pakistan"
    }
   }, 
   122053, 
   null, 
   1116229860.0
  ], 
  [
   123536, 
   null, 
   "Missouri Mule", 
   "And Bush knows it. emoticon_cool\n\n \n I think he does too and I would appreciate your further thinking on this subject.", 
   {}, 
   123423, 
   null, 
   1116263160.0
  ], 
  [
   123590, 
   null, 
   "Truthsayer", 
   "Not only do I not trust Pakistan, I do not trust anyone, politically, beyond our own shores (and only half (or less) of those within.)\n \n It's too complex for any one individual to reasonably think they can truly understand it all. I would not be arrogant enough to assume that I do, Therefore, I will, for self preservation, avoid things that allude me.\n \n If I had it my way, we'd build a 20 foot tall razor wire fence around our country and shoot anyone trying to scale it (coming in.) I would polygraph any foreigner that is legally living here to make sure of their intentions and I would throw any foreigner here illegally, head first, over that same 20 foot fence.\n \n But that's just my right-of-center side coming out in me. It happens from time to time.", 
   {}, 
   123536, 
   null, 
   1116267600.0
  ], 
  [
   123819, 
   null, 
   "Missouri Mule", 
   "Not only do I not trust Pakistan, I do not trust anyone, politically, beyond our own shores (and only half (or less) of those within.)\n \n It's too complex for any one individual to reasonably think they can truly understand it all. I would not be arrogant enough to assume that I do, Therefore, I will, for self preservation, avoid things that allude me.\n \n If I had it my way, we'd build a 20 foot tall razor wire fence around our country and shoot anyone trying to scale it (coming in.) I would polygraph any foreigner that is legally living here to make sure of their intentions and I would throw any foreigner here illegally, head first, over that same 20 foot fence.\n \n But that's just my right-of-center side coming out in me. It happens from time to time.\n\n \n You find many Americans who would agree with you.", 
   {}, 
   123590, 
   null, 
   1116291660.0
  ], 
  [
   123838, 
   null, 
   "Dono", 
   "You find many Americans who would agree with you.\n\n If that were done as described, where would we get the $2 billion a day of foreign capital we need to prop up our economy?\n Dono", 
   {}, 
   123819, 
   null, 
   1116293580.0
  ], 
  [
   123865, 
   null, 
   "Missouri Mule", 
   "If that were done as described, where would we get the $2 billion a day of foreign capital we need to prop up our economy?\n Dono\n\n \n One could argue that we would have to employ great old American knowhow and do what is required to fix this problem. We could also employ more native born Americans.", 
   {}, 
   123838, 
   null, 
   1116296760.0
  ], 
  [
   123885, 
   null, 
   "Truthsayer", 
   "You find many Americans who would agree with you.\n\n \n Well, that don't always count I suppose. There have been many times in history where the decisions of the higher powers have been against the majority will of the people. Sometimes rightfully and sometimes wrongfully I would suffice to say. It would depend on who you asked I would imagine.\n \n But, if you have noticed in recent days, there has been orchestrated \"open honest effort\" to address this codlock in our government. Ie: Newt/Hillery and Bill Clinton openly criticizing the dems for the roadblock. A democrat even came forth with an idea for the SS issue. It's one thing to disagree with the way the president wants to get it done, but to intentionally shut it down without offering any alternative solutions is downright shameful. I see progress ahead. The dems are acting like they might get off their useless behinds and get some work done and the republicans have given the signal that they, too, might pull their heads out of their butts. \n \n An honest gesture on republican side would be to disassociate themselves from that shyster, Delay. If, for no other reason, than to put their money where their mouth is. Delay has been a shining example of someone who takes advantage of government perks, the same questionable ethic's that he campaigned against before his rise to power. That, and consider that Bolton might be received more as a sign of contempt, by the UN, than a sign of progressive repair. (If I was angry at the UN, I might send them my mother-in-law. :p ) As much as I might personally enjoy flipping off the UN, common sense tells me it is not a wise thing to do.\n \n I am hoping that the sensible people, on both sides, that hover in the moderate zones can pull us all back together. We have soldiers fighting and dying overseas. It's the least those lazy bums could do.\n \n President Bush may have a scary remedy for SS but he is dead center on the facts that it needs to be fixed. The dems need to quit their pouting and do what they are getting paid to do. \n \n There has to be an end to this \"us and them.\" It's unpatriotic. It's counter productive. I am sure that the people that would love to see our nation crumble beneath us are eating this up.", 
   {}, 
   123819, 
   null, 
   1116299580.0
  ], 
  [
   124011, 
   null, 
   "georged", 
   "If that were done as described, where would we get the $2 billion a day of foreign capital we need to prop up our economy?\n Dono\n\n \n Dono, you well know the general public isn't concerned with reality.", 
   {}, 
   123838, 
   null, 
   1116348480.0
  ], 
  [
   127246, 
   null, 
   "gamehuis", 
   "And what are YOUR conclusions?\n\n Pakistan isn't your ally. They only act like that to avoid meeting the same fate as the Taliban. Meanwhile they do a dog and pony show once in a while to show that they're with you in the War on Terror(tm) and also to get some additional funding.\n \n And selling them those F16's (which are capable of carrying nukes) was a bad move, it ****** off the Indians.", 
   {}, 
   122620, 
   null, 
   1116869580.0
  ], 
  [
   127289, 
   null, 
   "georged", 
   "Pakistan isn't your ally. They only act like that to avoid meeting the same fate as the Taliban. Meanwhile they do a dog and pony show once in a while to show that they're with you in the War on Terror(tm) and also to get some additional funding.\n \n And selling them those F16's (which are capable of carrying nukes) was a bad move, it ****** off the Indians.\n\n \n And now we'll sell India F16s. Both nations have nukes, and delivery capability. But we're spreading democracy at the point of a gun, so beware those who don't have nukes is the message. And we wonder why Iran and N. Korea don't tow our line?", 
   {}, 
   127246, 
   null, 
   1116871620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Pakistan's Chips in a Shady Game", 
  "url": "http://www.4forums.com/political/peace-middle-east/5194-pakistans-chips-shady-game.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5194, 
  "discussion_files": [
   [
    "31461.html", 
    "http://www.4forums.com/political/peace-middle-east/5194-pakistans-chips-shady-game-print.html"
   ], 
   [
    "31462.html", 
    "http://www.4forums.com/political/peace-middle-east/5194-pakistans-chips-shady-game-2-print.html"
   ]
  ], 
  "identifier": 5194
 }
]