[
 [
  [
   123901, 
   null, 
   "GRINGO", 
   "\"The American Southwest seems to be slowly returning to the jurisdiction of Mexico without firing a single shot.\" July 20, 1982, Carlos Loret de Mola, The Great Invasion: Mexico Recovers Its Own, Excelsior [newspaper], Mexico City.\n \n There is a plan, called The Plan Of Atzlan, that's been in effect for about four decades. The goal, being pursued vigorously by radical, racist Chicano (Mexican-American) groups and the Mexican government, is to reconquer (Reconquista) land lost to America in the Mexican-American War that ended in 1848 with the Treaty of Guadalupe-Hidalgo.\n \n Mexicans and many Mexican-Americans have never accepted the loss of their land, inhabited long before the gringos (white Europeans) arrived.Chicano groups like MEchA (Chicano Student Movement of Atzlan) want to reconquer seven states in the Southwestern United States called Atzlan, the mythical home of the Aztecs. They include: California, Arizona, Texas, New Mexico, plus parts of Colorado, Nevada and Utah.\n \n The road to success is based on infiltration (illegal aliens from Mexico) and demographic dominance (like-minded Chicanos being elected to political office by a region overwhelmingly of Mexican origin). What would exist is a de facto alien nation, with loyalty to the Mexican homeland. Efforts would be made to establish a separate government or to rejoin Mexico. Note that Mexico has granted dual citizenship to Mexican immigrants with U.S. citizenship as well as to their children. Kind of speeds the process along. No repatriation needed.\n \n Chicano Studies programs in many colleges advance the cause by indoctrinating young Chicano students to hate white America and to participate in their eventual removal from the Southwestern U.S., all paid for by the American taxpayer. These students then go on to win political office (examples - Cruz Bustamante, Lt Governor of California and Antonio Villaraigosa, former Speaker of the California State Assembly and soon-to-be Mayor of Los Angeles- both former members of the radical MEchA. And the momentum builds.\n \n Anything to achieve the goal is utilized. Non-assimilation is preached. Keep your \"Mexicaness\". And the new immigrants are doing just that. Bi-lingual education is demanded. Demonstrations, intimidation of officeholders and lawsuits are filed to defeat proposed laws like Proposition 187 (denies public benefits to illegal aliens).\n \n Vincente Fox, President of Mexico, is a major participant in Reconquista, the invasion of America. His efforts toward making the dream a reality includes dual citizenship for Mexican-Americans, guidelines to illegals heading for America, a new temporary worker program, drivers' licenses for illegals and the legalization of millions of undocumented Mexican workers in America. He also supports a European Union type of arrangement for Canada, the U.S. and Mexico, with open borders. That would be a definite plus for Mexico and what will be a predominately Mexican Southwestern U.S. Yes, Spanish would be the primary language and support for Mexico (remember dual citizenship) would make that area, at the least, an autonomous region, uncooperative with the U.S. national government.\n \n Fox, while speaking in Chicago on June 16, 2004, revealed his vision of the territorial boundaries of Mexico when he said: \"We are Mexicans that live in our territories and we are Mexicans that live in other territories (America - primarily the Southwestern United States). In reality, we are 120 million people (100 million in Mexico and the rest in America) that live together and are working to construct a nation. [1]\n \n Fox's predecessor, Ernesto Zedillo, proclaimed on July 27, 1997 that: \"I have proudly affirmed that the Mexican nation extends beyond the territory enclosed by its borders (again the Southwestern U.S.) and that Mexican immigrants are an important - a very important - part of it.\" [2]\n \n There are enough quotes and enough documentation on this topic to fill a very large library. Here are a few words from the invaders.\n \n Mario Obledo, co-founder of MALDEF (American Legal Defense and Education Fund) and former Secretary of Health and Welfare for California, offered this: \"We're going to take over all the political institutions in California. In five years the Hispanics are going to be the majority population of this state.\" It would be a Hispanic state and anyone who didn't like it \"...ought to go back to Europe.\" [3]\n \n This from Jose Angel Gutierrez, Professor of Political Science, University of Texas, Arlington, and founder of La Raza Unida Party: \"This (Southwest U.S.) is our homeland. We cannot - we will not - we must not be made to be illegal in our own homeland. We are not immigrants that came from another country to another country. We are migrants, free to travel the length and breadth of the Americas because we belong here. We are millions. We just have to survive. We have an aging white America. They are not making babies. They are dying. It's a matter of time. The explosion is in our population.\" [4]\n \n Another declaration from Professor Gutierrez: \"We have got to eliminate the gringo (white American), and what I mean by that is that if the worst comes to the worst, we have got to kill him.\" [5] \n \n Now for a scholarly look at Reconquista, there is Harvard Profeesor Samuel P. Huntington, Chairman of the Harvard Academy for International and Area Studies, who wrote \"The Hispanic Challenge\" in Public Policy Magazine, April, 2004. Briefly, he said: \"The persistent inflow of Hispanic immigrants threatens to divide the United States into two peoples, two cultures, and two languages. \"... The United States ignores this challenge at its peril.\" ... \"Demographically, socially, and culturally, the reconquista (reconquest) of the Southwest United States by Mexican immigrants is well underway.\"\n \n The immigration catastrophe could have been prevented but our \"leaders\" in the White House and congress (both parties) seem more intent on collecting new voters than protecting America from being dismantled plus the drugs, crime, and potential terrorists coming across our southern border.. In fact, Bush recently cut back on the 2000 border agents scheduled for the Mexican border in 2006. It's now down to 200.\n \n So what we have is a people, united by hatred, supported by their government, with a plan to reconquer a large part of America, facing virtually no opposition from those with the power to stop it.\n \n And Mexico, confronting the most powerful nation on earth, could be victorious, \"... without firing a shot.\"\n \n 1.Mexican Immigration and its Potential Impact on the Political Future of the United States, Yeh Ling-Ling, The Journal of Social, Political, and Economic Studies, Winter 2004, Volume 29, Number 4\n 2. ibid\n 3. ibid\n 4.vdare.com http://www.vdare.com/awall/gutierrez.htm\n 5. ibid\n \n thelastgringo.com", 
   {
    "post_info": {
     "post_title": "Reconquista: The Invasion Of America"
    }
   }, 
   null, 
   null, 
   1116301920.0
  ], 
  [
   124040, 
   null, 
   "Diogenes99", 
   "Mexicans and many Mexican-Americans have never accepted the loss of their land, inhabited long before the gringos (white Europeans) arrived.\nIt wasn't really all that long. As I recall, the first missions in California were established about 1770 and the Spanish pastoral period ended with the war of 1848. Since Mexico didn't become independent until 1820 or so, Mexican sovereignty in California lasted only about one generation.\n \n A better argument could made for New Mexico, but the settlements were thin and pretty much restricted to the Rio Grande valley. North of Las Cruces and east of the valley, the maps are still marked \"Jornada Del Muerto.\" In 1980 I stopped by Pecos National Monument, and they were commemorating the tricentennial of the first American revolution when the Spaniards were kicked out of the area for twenty years.\n \n The Americans who moved to Texas during the Spanish/Mexican period had largely become Mexican citizens by the time they revolted and became an independent nation in 1836.\n \n So Mexican sovereignty \"long before\" has to depend on Mexicans being the legitimate heirs of the Spanish posessions, and aren't Spaniards considered to be white Europeans? In the US Government civil service regulations, Spaniards are not considered Hispanic for purposes of racial preference (euphemistically called affirmative action).", 
   {}, 
   123901, 
   null, 
   1116354420.0
  ], 
  [
   124145, 
   null, 
   "GRINGO", 
   "The Chicanos are referring to the indigenous people, their ancestors- the \"Aztecs\", or the indians that were there before the Spanish arrived.", 
   {
    "post_info": {
     "post_title": "Mexicans in the Southwestern U.S."
    }
   }, 
   124040, 
   null, 
   1116363540.0
  ], 
  [
   124288, 
   null, 
   "Diogenes99", 
   "Do you mean that the Chicanos actually consider themselves the legitimate heirs of the Navajo, Hopi, Apache, Pima, Anasazi, and other bands of stone age nomads that roamed the area before the Spaniards came? Would that also give the Olmec descendants the right to reclaim their ancestral lands from the Aztec descendants?\n \n IMO the whole idea of reclaiming ancestral lands is a waste of time. I very much doubt that there is anyone, anywhere in the world, whose ancestors did not gain the \"ancestral lands\" by killing or driving off the original occupants.", 
   {}, 
   124145, 
   null, 
   1116378300.0
  ], 
  [
   124681, 
   null, 
   "GRINGO", 
   "Please check El Plan De Aztlan and groups like MEchA and La Raza Unida Party. That should clear up any questions you may have.", 
   {
    "post_info": {
     "post_title": "Chicano claims"
    }
   }, 
   124288, 
   null, 
   1116449940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Reconquista: The Invasion Of America", 
  "url": "http://www.4forums.com/political/current-events-debates/5266-reconquista-invasion-america.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 5266, 
  "discussion_files": [
   [
    "9066.html", 
    "http://www.4forums.com/political/current-events-debates/5266-reconquista-invasion-america-print.html"
   ]
  ], 
  "identifier": 5266
 }
]