[
 [
  [
   123909, 
   null, 
   "mjy", 
   "As theorized, the concept of evolution is analogous to slow morphing, rather than quick abrupt changes in a species. MORPHING!, as can be done with computer graphics programs designed by intelligent beings. Evolution implies species go through a process of advantagous and purposful change -- but morphing is accomplished by unintelligent random processes, or at least that's how the story goes -- the created universe and life were random events. \n \n I have been patiently waiting for many years but to date have never seen or heard of any species morphing into another species. I am aware of genetic defects that limit species but unaware of mutations that perpetuate new species. Clearly variation within species is possible and has been observed, such as poodles and great danes, but they remain members of the same species.\n \n Mankind has thousands of years of written history and I am unaware of anyone observing species morphation(Is that a word?). Although it is approaching 200 years after Darwin hypothesised how species might have originated, we are no closer to observing a species morphing than Darwin. Humans attempt to create new species, such as breeding donkey with horses to get mules and lions with tigers to get ligers, but these \"NEW\" species are almost always born sterile and unable to perpetuate themselves. \n \n Besides observing it, the way to demonstrate evolution is to manipulate a species until it developes into a new species, but alas, then all you will have proven is directed efforts of intelligent beings create species. Hmm, wonder what intelligent being(s) created us?", 
   {
    "post_info": {
     "post_title": "What evidence?"
    }
   }, 
   null, 
   null, 
   1116303300.0
  ], 
  [
   123910, 
   null, 
   "sinjin", 
   "You haven't paid very close attention then. New viruses evolve all the time. You do understand that HIV did not exist only a few decades ago?", 
   {}, 
   123909, 
   null, 
   1116304020.0
  ], 
  [
   123914, 
   null, 
   "trebor", 
   "As theorized, the concept of evolution is analogous to slow morphing, rather than quick abrupt changes in a species. MORPHING!, as can be done with computer graphics programs designed by intelligent beings. Evolution implies species go through a process of advantagous and purposful change -- but morphing is accomplished by unintelligent random processes, or at least that's how the story goes -- the created universe and life were random events. \n \n I have been patiently waiting for many years but to date have never seen or heard of any species morphing into another species. I am aware of genetic defects that limit species but unaware of mutations that perpetuate new species. Clearly variation within species is possible and has been observed, such as poodles and great danes, but they remain members of the same species.\n \n Mankind has thousands of years of written history and I am unaware of anyone observing species morphation(Is that a word?). Although it is approaching 200 years after Darwin hypothesised how species might have originated, we are no closer to observing a species morphing than Darwin. Humans attempt to create new species, such as breeding donkey with horses to get mules and lions with tigers to get ligers, but these \"NEW\" species are almost always born sterile and unable to perpetuate themselves. \n \n Besides observing it, the way to demonstrate evolution is to manipulate a species until it developes into a new species, but alas, then all you will have proven is directed efforts of intelligent beings create species. Hmm, wonder what intelligent being(s) created us?\n\n \n \n I would suggest you look at the faero island mouse then. That is a new species, and it is not man doing it, but rather nature itself.", 
   {}, 
   123909, 
   null, 
   1116305280.0
  ], 
  [
   123934, 
   null, 
   "pandion", 
   "As theorized, the concept of evolution is analogous to slow morphing, rather than quick abrupt changes in a species.\nQuite a bad analogy, though.\n \nEvolution implies species go through a process of advantagous and purposful change\nNo it doesn't. First, the changes may not be neutral. I will presume that you are intelligent enough to grasp that idea the mutations in and of themselves are neither advantagous nor disadvantageous, and the they have no purpose. Evolution happens when the mutations (and other mechanisms that increase genetic diversity) are acted upon by other mechanisms of evolution. Even in natural selection there is no purpose. Natural selection is differential reproductive success. Some organisms tend to produce more offspring because they have characteristics that give them an advantage in a particular environment.\n \n-- but morphing is accomplished by unintelligent random processes, or at least that's how the story goes --\nBut you just said that the program was designed. You seem to be having trouble making up your mind.\n \nthe created universe and life were random events.\nAnd you know this how?\n \nI have been patiently waiting for many years but to date have never seen or heard of any species morphing into another species.\nCould it be because they don't really morph? Define species for us so that we can tell if one species has evolved into another.\n \nI am aware of genetic defects that limit species but unaware of mutations that perpetuate new species.\nPossibly you should try to educate yourself, then. How about the mutations that made a polar bear white, with webbed feet, smaller head, longer back legs, and other clear changes in physiology from ancestral bears that are genetic in nature?\n \nClearly variation within species is possible and has been observed, such as poodles and great danes, but they remain members of the same species.\nAnd what would make them separate species? How about wolves and dogs, separate species? How about Great Danes and Chihuahuas? They cannot interbreed under any circumstances (even artificially - the fetus isn't viable).\n \nMankind has thousands of years of written history and I am unaware of anyone observing species morphation(Is that a word?).\nWow! I'm impressed. You read it all? In every language?\n \nAlthough it is approaching 200 years after Darwin hypothesised how species might have originated, we are no closer to observing a species morphing than Darwin.\nBecause they don't morph. But on the other hand, speciation has been observed. We have seen hawthorn maggot flies speciate several times as additional suitable plants have been introduced to the U.S. We have seen strains of laboratory flies speciate several times such that none are able to interbreed with the parent species anymore. We have observed two species of gulls that share a common range and do not interbreed, except that they are the extreme ends of a single population the encircles the world.\n \nHumans attempt to create new species, such as breeding donkey with horses to get mules and lions with tigers to get ligers, but these \"NEW\" species are almost always born sterile and unable to perpetuate themselves.\nActually, breeding horses and donkeys isn't an effort to create a new species. Where did you get such a thoughtless idea. And neither is interbreeding lions and tigers. However, you don't seem to be aware that neither ligers or tigons are sterile. They are capable of breeding with each other or with either of the parent species. And then there are polar bears and brown bears, which can and will interbreed if given the opportunity. And the offspring are perfectly fertile.\n \nBesides observing it, the way to demonstrate evolution is to manipulate a species until it developes into a new species, but alas, then all you will have proven is directed efforts of intelligent beings create species.\nNope. Evolution is demonstrated by observations of evolution in nature. There is actually no doubt that evolution happens. Even creationists who have realized that they can't get the millions of species on the ark have proposed a few thousand \"kinds\" followed by hyperevolution of the millions of species. In answer to evolution, creationists have proposed evolution at rates that no self respecting evolutionary biologist would ever claim.\n \nHmm, wonder what intelligent being(s) created us?\nZeus?", 
   {}, 
   123909, 
   null, 
   1116310980.0
  ], 
  [
   123938, 
   null, 
   "sanguinekane", 
   " Hmm, wonder what intelligent being(s) created us? \n\n \n Perhaps the gods just created the most basic of life forms billions of years ago, and let them evolve from there. \n \n Well, that's my theory anyway. :) \n \n Anyway, humanity has not been recording history long enough to witness any dramatic evolution in a species, such as apes evolving into humans. Such things take millions of years.", 
   {}, 
   123934, 
   null, 
   1116311760.0
  ], 
  [
   123985, 
   null, 
   "unkerpaulie", 
   " Evolution implies species go through a process of advantagous and purposful change -- but morphing is accomplished by unintelligent random processes, or at least that's how the story goes -- the created universe and life were random events. \n\n evolution does not imply advantageous and purposeful changes. any mutation that gives rise to any type of change in a species from generation to generation is evolution. however, once the change arises, whether it gives the species a survival advantage is what makes it a dominant feature in that species in that environment\n \n \nI have been patiently waiting for many years but to date have never seen or heard of any species morphing into another species. I am aware of genetic defects that limit species but unaware of mutations that perpetuate new species. Clearly variation within species is possible and has been observed, such as poodles and great danes, but they remain members of the same species.\n\n how may years? you wont see a species morph into another species in 10 or 20 years, you know\n \n \nMankind has thousands of years of written history and I am unaware of anyone observing species morphation(Is that a word?). Although it is approaching 200 years after Darwin hypothesised how species might have originated, we are no closer to observing a species morphing than Darwin. Humans attempt to create new species, such as breeding donkey with horses to get mules and lions with tigers to get ligers, but these \"NEW\" species are almost always born sterile and unable to perpetuate themselves. \n\n see above. you wont see evolution of a species in one generation or one lifetime (except maybe fruitflies and viruses, which have been observed to evolve)\n \n \nBesides observing it, the way to demonstrate evolution is to manipulate a species until it developes into a new species, but alas, then all you will have proven is directed efforts of intelligent beings create species. Hmm, wonder what intelligent being(s) created us?\n\n specialized breeding and genetic splicing is not evolution. noone made such a claim", 
   {}, 
   123909, 
   null, 
   1116344460.0
  ], 
  [
   124073, 
   null, 
   "Mucusaur", 
   "Who owns this clone account do you think?", 
   {}, 
   123985, 
   null, 
   1116357600.0
  ], 
  [
   124183, 
   null, 
   "Duo_Maxwell", 
   "probably peddler. He's failed to even prove he understands the basics of evolution, we've seen Tomharrybill do the same thing when he was taking fire for his ignorance.", 
   {}, 
   124073, 
   null, 
   1116368940.0
  ], 
  [
   124543, 
   null, 
   "Tastyfish", 
   "Well, we do see species change into others instantly fairly often in the plant world. The end up douobling their chromosomes and becoming a much larger organism that can no longer breed with its parents.\n Throw in the same thing where infertile hybrids do the same and you then have a larger organism that doesn't even nessarily look like just a larger version of its parents and can't interbreed with either.", 
   {}, 
   124183, 
   null, 
   1116433080.0
  ], 
  [
   124565, 
   null, 
   "pandion", 
   "Just a point: doubling of the genome and hybridization do not necessarily produce a \"larger\" organism. Is that what you really meant?", 
   {}, 
   124543, 
   null, 
   1116436380.0
  ], 
  [
   124567, 
   null, 
   "Tastyfish", 
   "In plants, it often does - a lot of comercial fruits (well bananas for sure, think strawberries and a few others) are larger because the plant has doubled its genome. Animals, its screws up, but with plants having twice the DNA tends to make the plant twice as big (or at least potentially twice as big, or just bigger anyway)", 
   {}, 
   124565, 
   null, 
   1116436560.0
  ], 
  [
   124577, 
   null, 
   "Clive14", 
   "In plants, it often does - a lot of comercial fruits (well bananas for sure, think strawberries and a few others) are larger because the plant has doubled its genome. Animals, its screws up, but with plants having twice the DNA tends to make the plant twice as big (or at least potentially twice as big, or just bigger anyway)\nIt doesn't always screw up in animals. There are a fair few amphibian polyploid species and it can occur in fish too (I think salmon are an example). It has even been found to occur in one species of mammal (the red vizcacha rat, Tympanoctomy barrerae)", 
   {}, 
   124567, 
   null, 
   1116437640.0
  ], 
  [
   152742, 
   null, 
   "PoohBear", 
   "You haven't paid very close attention then. New viruses evolve all the time. You do understand that HIV did not exist only a few decades ago?\n\n \n \n or maybe it did we just didnt know it was there! i mean come on diseases could have been there 100 years ago and we just discovered it cuz we just got the technology.", 
   {}, 
   123910, 
   null, 
   1123109160.0
  ], 
  [
   152753, 
   null, 
   "Tastyfish", 
   "We knew about diseases 100 years ago, and its the symptons that clue you in to whats going on rather than actually looking at it.\n \n Besides we have a pretty good idea where HIV came from and how it spread (down to the first carrier in the case of infecting the US I think)", 
   {}, 
   152742, 
   null, 
   1123110180.0
  ], 
  [
   152810, 
   null, 
   "Kronus", 
   "or maybe it did we just didnt know it was there! i mean come on diseases could have been there 100 years ago and we just discovered it cuz we just got the technology.\n\n \n Had to dig kinda far back for that quote, didn't you. :)\n \n Yes, sinjin wasn't completly accurate. We did have the AIDS virus a couple of decades ago. In fact, we have no idea how long the virus lived among the monkeys before it crossed into the human population.\n \n What we do know, with our modern technology, and what sinjin was actually trying to say, is that the AIDS virus we have now is genetically very different from the AIDS virus of a couple of decades ago. The virus was exposed to modern drugs, and the strains that were most able to resist them survived. The result is a strain of virus which is much hardier than the original strain. Evolution in action. This has been absolutely established, and if you knew enough genetics you could read the papers and see the proof for yourself. Since you are lacking in genetics knowledge you'll have to take my word for it; the AIDS virus, in response to the drugs that its been exposed to, has evolved into a hardier virus. It is genetically quite different from the virus of just a couple of decades ago.", 
   {}, 
   152742, 
   null, 
   1123126140.0
  ], 
  [
   153989, 
   null, 
   "The Skeptic", 
   "The virus was exposed to modern drugs, and the strains that were most able to resist them survived. The result is a strain of virus which is much hardier than the original strain. Evolution in action. This has been absolutely established, and if you knew enough genetics you could read the papers and see the proof for yourself. Since you are lacking in genetics knowledge you'll have to take my word for it; the AIDS virus, in response to the drugs that its been exposed to, has evolved into a hardier virus. It is genetically quite different from the virus of just a couple of decades ago.\n\n \n Do you claim this happened by mutation? If so, what sort of mutation?", 
   {}, 
   152810, 
   null, 
   1123646820.0
  ], 
  [
   154001, 
   null, 
   "trebor", 
   "Do you claim this happened by mutation? If so, what sort of mutation?\n\n \n \n It is a mutation that was promoted due to the stress of the aids medicines...", 
   {}, 
   153989, 
   null, 
   1123649640.0
  ], 
  [
   154004, 
   null, 
   "Kronus", 
   "Do you claim this happened by mutation? If so, what sort of mutation?\n\n \n Yes, it happened through mutation. What do you mean by \"what sort\"? I assume you're looking for something more in depth than \"the genetic sort\". I'm afraid I can't rattle off the difference in the sequences if that's what you want. If that's not what you want than you'll have to ask a more specific question.", 
   {}, 
   153989, 
   null, 
   1123650240.0
  ], 
  [
   154021, 
   null, 
   "DamEtel", 
   "If the question is general - as in do beneficial mutations occur? - then we can switch to looking at yeast and bacteria.\n \n \n\"4.) Adaptation to a Low Phosphate Chemostat Environment by a Clonal Line of Yeast \n \n P.E. Hansche and J.C. Francis set up chemosats to allow evolution of a single clonal line of beer yeast in a phosphate limited (due to high pH) environment. (A chemostat is a device that allows the propagation of microorganisms in an extremely constant environment.) The yeast clones grew slowly for about the first 180 generations when there was an abrupt increase in population density. This was later shown to be due to better assimilation of the phosphate, presumably due to an improvement in the permease molecule. (Permease is an enzyme that controls what is allowed to come into the cell through the yeast's cell membrane.) After about 400 generations, a second improvement in cell growth rates occurred because of a mutation to the yeast's phosphatase (an enzyme that improves the cells ability to use phosphate). The phosphatase became more active overall, and its optimal pH (the pH where it is most active) was raised. Finally, a third mutant appeared after 800 generations that caused the yeast cells to clump. This raised the population density in the chemostat because individual cells were no longer being washed out of chemostat (which is one of the methods that the chemostat uses to maintain very uniform conditions) as quickly as they had prior to the mutation. (This is just speculation on my part, but I wonder if it wasn't under some similar conditions that multi-cellularity became favored over unicellularity - perhaps on a sea bed or river bottom.) \n \n This experiment was repeated, and the same mutations occurred, but in different orders. Also, in one replication, the processing of phosphate was improved by a duplication of the gene that produces phosphatase. This is experimental evidence of an extremely important mechanism in evolutionary history! It is also a particularly elegant experiment because not only was all of this adaptation shown to occur in clonal lines (descended from a single individual), but the authors also determined the exact mutations that caused the improved adaptations by sequencing the genes and proteins involved.\" (http://www.gate.net/~rwms/EvoMutations.html) \n\n \n \n \n \n\"Evolution of New Metabolic Pathways \n \n ...\n \n Xylitol is also not normally metabolized, but Mortlock and his colleagues were able to develop strains (generally through spontaneous mutations, but sometimes with u.v. ray or chemical induced mutations) that could use it because ribitol dehydrogenase (which is usually present in the cells to convert ribitol to D-ribulose) was able to slightly speed up the conversion of xylitol to D-xylulose, for which metabolic pathways already exist. The ability of the strains to utilize xylitol was increased as much as 20 fold when first production of ribitol dehydrogenase was deregulated (the enzyme was produced all the time, not just when ribitol was present), then duplication of the ribitol dehydrogenase genes occurred, then the structure of the enzyme was changed such that its efficiency at working with xylitol was improved, and finally, in at least one case, a line regained control of the modified ribitol dehydrogenase gene so that the enzyme was only produced in the presence of xylitol. Here we have a complete example of a new metabolic pathway being developed through duplication and modification of an existing pathway. \" (http://www.gate.net/~rwms/EvoMutations.html) \n\n \n \n Here's a breakdown.\n \n 1) ribitol deyhydrogenase, an enzyme whose primary substrate is ribitol, can slightly accelerate the rate of conversion of non-usable xylitol into a usable sugar, D-xylulose. \n \n Note that one enzyme being able to catalyze several related reactions is not unusual (despite what some anti-evolutionists would have us believe).\n \n \n 2) then one or more mutations in the gene(s) that control the expression of ribitol dehydrogenase cause it to begin being expressed continuously (not just in response to the presence of ribitol). This increased the cells' ability to utilize xylitol 20 fold\n \n 3) then a mutation caused the genes coding for the enzyme ribitol dehydrogenase to be duplicated\n \n A common mechanism evolution employs is duplicate-and-diverge. After a gene duplication, having two copies of the gene allows one of them to accept mutations without harming fitness (the other one remains the same and continues to carry out its function). This way, the gene/protein can search through similar sequences and possibly find a new function, or, in this case, improve an existing function.\n \n \n 4) then one or more mutations in the genes coding for ribitol dehydrogenase increased it's ability to catalyze the xylitol-to-D-xylulose conversion \n \n 5) then one or more mutations linked expression of one of the ribitol dehydrogenase genes to the presence of xylitol\n \n \n Thus, a new, regulated metabolic pathway arising via a chain of beneficial mutations.", 
   {
    "unicode_changes_made": true
   }, 
   154004, 
   null, 
   1123652460.0
  ], 
  [
   154067, 
   null, 
   "Clive14", 
   "Do you claim this happened by mutation? If so, what sort of mutation?\nIt is not necessary to \"claim\" it happened through mutation: it is a known, observed, fact that the AIDS virus mutates. Try visiting http://www.aidsonline.com/pt/re/aids/search.htm and search for papers that discuss the observed mutations in the AIDS virus.\n \n As to the type, it is genetic mutations of course.", 
   {}, 
   153989, 
   null, 
   1123676220.0
  ], 
  [
   154141, 
   null, 
   "gnojek", 
   "Yes, it happened through mutation. What do you mean by \"what sort\"? I assume you're looking for something more in depth than \"the genetic sort\". I'm afraid I can't rattle off the difference in the sequences if that's what you want. If that's not what you want than you'll have to ask a more specific question.\n\n Maybe he is asking whether it was a frame shift, point mutation, deletion, insertion, etc. \n \n I actually don't know, but maybe just maybe...{shrug}", 
   {}, 
   154004, 
   null, 
   1123711080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What evidence?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5268-what-evidence.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 5268, 
  "discussion_files": [
   [
    "2375.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5268-what-evidence-print.html"
   ], 
   [
    "2376.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5268-what-evidence-2-print.html"
   ]
  ], 
  "identifier": 5268
 }
]