[
 [
  [
   123992, 
   null, 
   "Missouri Mule", 
   "Perhaps this article offers an explanation why Europeans seem so willing to make peace with terrorists. It's so \"sophisticated.\"\n ============================\n \n Europatsies\n May 17th, 2005\n \n Americans like to think that Europeans are sophisticated, and no doubt some of them are. But not in politics. Politically, the peoples of Europe regularly head for the very worst ideas on the horizon. \n \n It is a kind of neurotic compulsion that has haunted them for centuries. When it comes to politics, they are patsies for grand promises. From Napoleon's time onward, all political movements in Europe have been driven by mass delusions. Napoleon was going to conquer Russia. Lenin was going to destroy capitalism. Hitler was going to purify the Aryan race. And now the European Union will Save the Planet and bring permanent Peace on Earth.\n \n Americans are notoriously vulnerable to get-rich-quick schemes, but we have a lot better resistance to peddlers of political paradise. In comparison, in just the last hundred years Europe has managed to kill off entire categories of its own people while chasing after fantasies of national glory, socialist glory and racial glory.\n \n It doesn't seem to occur to Europe that the answer to wild political schemes is a good, solid grasp of everyday reality. Today, Europeans still fall for political hogwash. A decade ago the Socialist Party of France passed a strict 35-hour work week, with punishments for anybody who worked longer, based on the flat-earth fantasy that if everybody worked less it would actually increase the number of jobs. The famously skeptical French simply fell in love with the prospect of a free lunch.\n \n British Labour is even now surrendering national sovereignty, piece by piece, based on the cockeyed idea that Brussels will govern better than Parliament. And rather than millions of citizens marching in the streets to protest this outright robbery, Europeans are just bored with it all, suffering from very sophisticated weltschmertz...\n \n (Snip)\n \n Take the Netherlands. Once upon a time the Dutch took pride in their sober common sense. That reputation hase taken a beating in recent years, as they went straight for free pot, free love, and, at the end of life's long celebration, free euthanasia. But Holland has now stubbed its toe on free immigration. It's not that the Dutch are racist. They would just rather not live under Islamic Shari'a law. Multiculturalism is grand, but when it comes to genital mutilation of young girls, dropping concrete walls on gay men, honor killing of women for dating infidels, gang rapes of girls for dressing immodestly, and chopping off the hands of thieves, the romance does begin to fade.\n \n So the Netherlands may be sobering up. Polls show that a majority plans to vote against the EU Constitution, the lifetime career plan for Europe's ruling class. Now the politicians are in a snit about possible Dutch rejection, but ordinary people have not yet lost their minds. Once the Constitution goes into force they will lose their borders, and their country will cease to exist. Welcome to the Islamic Republic of the Europe!...\n \n (Snip)\n http://www.americanthinker.com/articles.php?article_id=4501", 
   {
    "post_info": {
     "post_title": "Europatsies"
    }
   }, 
   null, 
   null, 
   1116345660.0
  ], 
  [
   124023, 
   null, 
   "Diogenes99", 
   "Great article! And a gloomy prediction for the future of western Europe. I wonder what Nostradamus had to say on the subject...", 
   {}, 
   123992, 
   null, 
   1116352320.0
  ], 
  [
   124027, 
   null, 
   "Wraith", 
   "That article is hilarious, I'm no fan of the EU but it seems like all of the USA's fears about Europe rolled into one article -- fears that the EU might be succesful, fear of Islam, basically fear of anything that isn't 'American'.\n \n What with the USA's gradual decline I expect to see many more articles like this in the future...", 
   {}, 
   124023, 
   null, 
   1116353160.0
  ], 
  [
   124044, 
   null, 
   "Diogenes99", 
   "...fears that the EU might be succesful...\nThat's number 23 on my list of things to fear, right between fear of college professors and fear of being abducted by aliens. :p", 
   {}, 
   124027, 
   null, 
   1116354660.0
  ], 
  [
   124049, 
   null, 
   "Missouri Mule", 
   "That article is hilarious, I'm no fan of the EU but it seems like all of the USA's fears about Europe rolled into one article -- fears that the EU might be succesful, fear of Islam, basically fear of anything that isn't 'American'.\n \n What with the USA's gradual decline I expect to see many more articles like this in the future...\n\n \n What's the basis of the USA's \"gradual decline?\" The numbers don't support your conclusion.", 
   {}, 
   124027, 
   null, 
   1116355380.0
  ], 
  [
   124076, 
   null, 
   "Wraith", 
   "That's number 23 on my list of things to fear, right between fear of college professors and fear of being abducted by aliens.\n\n \n Well, that's why as a euro-skeptic myself the fear I see from such articles is so amusing to me.", 
   {}, 
   124049, 
   null, 
   1116357780.0
  ], 
  [
   124245, 
   null, 
   "Eddie", 
   "@ MM\n \n Yea, that was alot of bullcrap. It offered no new facts, just stating an oppinion (and like everyone should now by now, oppinions are just like arseholes... everyone has one). If there is something in particular you would like to debate MM, please say so. When you post articles like this, it`s hard to take anything seriously. I mean, this is not your oppinion, right? why even bother to challenge it?\n \n \nGreat article! And a gloomy prediction for the future of western Europe. I wonder what Nostradamus had to say on the subject...\n\n \n What did you find great? Please highlight the parts, and we can discuss the accuracy of it.", 
   {}, 
   124076, 
   null, 
   1116373200.0
  ], 
  [
   124339, 
   null, 
   "Missouri Mule", 
   "@ MM\n \n Yea, that was alot of bullcrap. It offered no new facts, just stating an oppinion (and like everyone should now by now, oppinions are just like arseholes... everyone has one). If there is something in particular you would like to debate MM, please say so. When you post articles like this, it`s hard to take anything seriously. I mean, this is not your oppinion, right? why even bother to challenge it?\n \n What did you find great? Please highlight the parts, and we can discuss the accuracy of it.\n\n \n \n I can't imagine how you could argue with the article. It is based on historical facts. One only has to look at the events throughout the 20th century to see how prone Europeans are to socialist panaceas and that Americans are prone to get rich quick schemes. Both are demonstrably true. \n \n What's to argue with this?\n \n From Napoleon's time onward, all political movements in Europe have been driven by mass delusions. Napoleon was going to conquer Russia. Lenin was going to destroy capitalism. Hitler was going to purify the Aryan race. And now the European Union will Save the Planet and bring permanent Peace on Earth.\n \n Americans are notoriously vulnerable to get-rich-quick schemes, but we have a lot better resistance to peddlers of political paradise. In comparison, in just the last hundred years Europe has managed to kill off entire categories of its own people while chasing after fantasies of national glory, socialist glory and racial glory.", 
   {}, 
   124245, 
   null, 
   1116385500.0
  ], 
  [
   124346, 
   null, 
   "Eddie", 
   "I can't imagine how you could argue with the article. It is based on historical facts. One only has to look at the events throughout the 20th century to see how prone Europeans are to socialist panaceas and that Americans are prone to get rich quick schemes. Both are demonstrably true. \n \n What's to argue with this?\n \n From Napoleon's time onward, all political movements in Europe have been driven by mass delusions. Napoleon was going to conquer Russia. Lenin was going to destroy capitalism. Hitler was going to purify the Aryan race. And now the European Union will Save the Planet and bring permanent Peace on Earth.\n \n Americans are notoriously vulnerable to get-rich-quick schemes, but we have a lot better resistance to peddlers of political paradise. In comparison, in just the last hundred years Europe has managed to kill off entire categories of its own people while chasing after fantasies of national glory, socialist glory and racial glory.\n\n \n Nobody has ever been under the illusion that EU will save the planet or bring permanent peace on earth. That`s just nonsense. EU has been argued to be a peace project, but it only refers to peace on the continent of europe. To some extent, this argument is correct, but I don`t think a major european war\n would be plausible even without the EU... \n \n Wether we are more vulnerable to political peddling is rather hard to say. Certain countries have made certain errors under ceratin conditions. Other countries have not made these errors... I hardly think it`s a european trait...", 
   {}, 
   124339, 
   null, 
   1116386160.0
  ], 
  [
   124448, 
   null, 
   "Diogenes99", 
   "...but I don`t think a major european war would be plausible even without the EU...\nWhat has changed to break the pattern of the last 2000 years?", 
   {}, 
   124346, 
   null, 
   1116396240.0
  ], 
  [
   124454, 
   null, 
   "Missouri Mule", 
   "Nobody has ever been under the illusion that EU will save the planet or bring permanent peace on earth. That`s just nonsense. EU has been argued to be a peace project, but it only refers to peace on the continent of europe. To some extent, this argument is correct, but I don`t think a major european war would be plausible even without the EU... \n \n Wether we are more vulnerable to political peddling is rather hard to say. Certain countries have made certain errors under ceratin conditions. Other countries have not made these errors... I hardly think it`s a european trait...\n\n \n Actually I agree with you. I, too, do not believe that there will ever again be a major European war. Another Hitler is unthinkable.\n \n However, I do believe that Europe is playing with fire by ignoring its immigration problem. I believe you'll look back in 10 years and remember that old Muley told you right here what was facing you. You all had better rein it in before it is too late. And you don't need to restrict immigration necessarily but you damn sure better get these people with the program. Either join the European union in spirit as well as in words or leave. No ifs, ands, or buts.", 
   {}, 
   124346, 
   null, 
   1116398160.0
  ], 
  [
   124502, 
   null, 
   "Eddie", 
   "What has changed to break the pattern of the last 2000 years?\n\n \n Quite a few things. \n \n * Europe is no longer home of \"the giants\" of the world, making competition less natural.\n \n * Democracy. Almost every single country in Europe is currently a well functioning democracy. Democracies tend to be reluctant to wage war against one-another (has never happened) \n \n * Increased trade and interdependance has made a war between major european countries virtually impossible.\n \n * Nuclear weapons\n \n * Many european countries belong to NATO. Only an absolute madman would declare war on a NATO member...\n \n @ MM\n \n I don`t really see the immigration problem. I see a problem with lack of integration for certain groups. We need the immigrants.", 
   {}, 
   124448, 
   null, 
   1116415860.0
  ], 
  [
   124586, 
   null, 
   "Missouri Mule", 
   "Quite a few things. \n \n * Europe is no longer home of \"the giants\" of the world, making competition less natural.\n \n * Democracy. Almost every single country in Europe is currently a well functioning democracy. Democracies tend to be reluctant to wage war against one-another (has never happened) \n \n * Increased trade and interdependance has made a war between major european countries virtually impossible.\n \n * Nuclear weapons\n \n * Many european countries belong to NATO. Only an absolute madman would declare war on a NATO member...\n \n @ MM\n \n I don`t really see the immigration problem. I see a problem with lack of integration for certain groups. We need the immigrants.\n\n \n You've stumbled into the truth which incidentally is (one of ) the basis for the war in Iraq. Democracies do not war on one another.\n \n But you had better watch those immigrants -- very closely. You must demand of them that they integrate into European society completely. Not doing so will be disastrous.", 
   {}, 
   124502, 
   null, 
   1116438120.0
  ], 
  [
   124652, 
   null, 
   "Diogenes99", 
   "I don`t really see the immigration problem. I see a problem with lack of integration for certain groups. We need the immigrants.\nI agree with MM that you've got it right on European warfare, but I don't completely discount the possibility of another Hitler when socialist economic policies come home to roost.\n \n In a way I agree with you about immigration: the problem isn't the immigrants, it's the way they behave. Integration is THE problem, especially when a relatively large colony of them tries to hang on to the \"old ways\" in a society where those customs are no longer acceptable.", 
   {}, 
   124502, 
   null, 
   1116445560.0
  ], 
  [
   124658, 
   null, 
   "Tastyfish", 
   "Demanding they asimilate is not a good idea, just promotes bad feelings and will cause them to become even more focused on their own culture. Just have to make sure that there is plnety of opertunity for them to assimilate themselves into your culture, and be prepared to make some sacrafices yourself (i.e building mosques if need be). Its less of a problem if you don't force a massive number of them onto a local councils lap but spread them out throughout the country, or settle them into communities from their original home that have already intergrated into your culture.", 
   {}, 
   124652, 
   null, 
   1116446040.0
  ], 
  [
   124721, 
   null, 
   "Missouri Mule", 
   "Demanding they asimilate is not a good idea, just promotes bad feelings and will cause them to become even more focused on their own culture. Just have to make sure that there is plnety of opertunity for them to assimilate themselves into your culture, and be prepared to make some sacrafices yourself (i.e building mosques if need be). Its less of a problem if you don't force a massive number of them onto a local councils lap but spread them out throughout the country, or settle them into communities from their original home that have already intergrated into your culture.\n\n \n Not a good idea? Well, when you have to bow toward Mecca or have your head sawed off you might begin to change your tune. It'll be too late then. But you'll remember what old Muley told you in the year 2005.", 
   {}, 
   124658, 
   null, 
   1116455160.0
  ], 
  [
   124727, 
   null, 
   "lord tammerlain", 
   "It takes at least TWO generations for immigrants to assimilate within society, depending on cultural differences. The Italians that I knew when I was younger were generally second or third generation Italian, their parents had thick accents and still maintained most Italian cultural ideas.\n \n We have a Chinese community that has not assimilated to any degree, but we have Hindu and Muslims communities that you would be hard pressed to say their childern have not assimilated. All it takes is time and of course non religous schools.", 
   {}, 
   124721, 
   null, 
   1116455580.0
  ], 
  [
   124746, 
   null, 
   "Duo_Maxwell", 
   "Not a good idea? Well, when you have to bow toward Mecca or have your head sawed off you might begin to change your tune. It'll be too late then. But you'll remember what old Muley told you in the year 2005.\n\n \n That's a good one. Now you're using threats when your arguments fail. Every day you're becomming more and more of a fire and brimestone fundementalist. \n \n Why would he have to bow to Mecca? As I recall the UK doesn't legislate religion into law and hasn't for quite some time and if the influx of Indians since the 1700s says anything, they won't. As for sawing the heads off, it's our best buddy saudi arabia that's state religion teaches that. Oh wait, they are our allies, therefore they cannot do anything bad right? emoticon_rolleyes", 
   {}, 
   124721, 
   null, 
   1116456420.0
  ], 
  [
   124780, 
   null, 
   "Eddie", 
   "I agree with MM that you've got it right on European warfare, but I don't completely discount the possibility of another Hitler when socialist economic policies come home to roost.\n\n \n Okey. Allthough, I wouldn`t be surprised if the more market oriented economy of the United States crack long before the more durable wellfare economies in Europe do so... It is also interesting to note that chrsitian fundamentalism seems to be on the rise in USA, while religous fundamentalism is still an uncommon occurance in europe...\n '\n \n \nIn a way I agree with you about immigration: the problem isn't the immigrants, it's the way they behave. Integration is THE problem, especially when a relatively large colony of them tries to hang on to the \"old ways\" in a society where those customs are no longer acceptable.\n\n \n Do you live in europe? Have you seen the \"problem\" up close? The problem is nopt as large as certain people and groups paint them to be (mostly neo-nazis and fascists). They push an agenda. Funny that many US proffesional-thinkers and citizens seem so quick to accept their **** as the TRUTH...\n \n \nNot a good idea? Well, when you have to bow toward Mecca or have your head sawed off you might begin to change your tune. It'll be too late then. But you'll remember what old Muley told you in the year 2005.\n\n \n Yeah, but tis is not as scary as the magical pink unicorn that threaten the US unless you sacrifice all of your babies to the allmighty Unicron Rasta... But you'll remember what eddie told you in the year 2005", 
   {}, 
   124652, 
   null, 
   1116458820.0
  ], 
  [
   124815, 
   null, 
   "Missouri Mule", 
   "It takes at least TWO generations for immigrants to assimilate within society, depending on cultural differences. The Italians that I knew when I was younger were generally second or third generation Italian, their parents had thick accents and still maintained most Italian cultural ideas.\n \n We have a Chinese community that has not assimilated to any degree, but we have Hindu and Muslims communities that you would be hard pressed to say their childern have not assimilated. All it takes is time and of course non religous schools.\n\n \n But the point is that only Muslim fanatics are sawing heads off. None of these other groups matter because they aren't doing that. Islam specifically instructs its followers to \"strike the heads\" of infidels. Infidels are defined as those who refuse to follow their \"faith.\" Do you know of any other culture or religion that teaches this? I can think of none.\n \n \"an unbeliever with respect to a particular religion\" Merriam-Webster", 
   {}, 
   124727, 
   null, 
   1116462420.0
  ], 
  [
   124819, 
   null, 
   "Missouri Mule", 
   "Okey. Allthough, I wouldn`t be surprised if the more market oriented economy of the United States crack long before the more durable wellfare economies in Europe do so... It is also interesting to note that chrsitian fundamentalism seems to be on the rise in USA, while religous fundamentalism is still an uncommon occurance in europe...\n \n Do you live in europe? Have you seen the \"problem\" up close? The problem is nopt as large as certain people and groups paint them to be (mostly neo-nazis and fascists). They push an agenda. Funny that many US proffesional-thinkers and citizens seem so quick to accept their **** as the TRUTH...\n \n Yeah, but tis is not as scary as the magical pink unicorn that threaten the US unless you sacrifice all of your babies to the allmighty Unicron Rasta... But you'll remember what eddie told you in the year 2005\n\n \n I live in a religious area of the country. Offhand I can't think of any of these folks who are threatening me or my family. It is true that religious fundamentalism is rare in Europe EXCEPT rising Islamic fanaticism. You can't possibly deny that fact. Several commentators have expressed the strong view that Europe will become almost completely Islamic by the end of this century. Offhand I think they are being conservative in their estimations.", 
   {}, 
   124780, 
   null, 
   1116462780.0
  ], 
  [
   124821, 
   null, 
   "Truthsayer", 
   "But the point is that only Muslim fanatics are sawing heads off. None of these other groups matter because they aren't doing that. Islam specifically instructs its followers to \"strike the heads\" of infidels. Infidels are defined as those who refuse to follow their \"faith.\" Do you know of any other culture or religion that teaches this?  I can think of none.\n \n \"an unbeliever with respect to a particular religion\" Merriam-Webster\n\n \n Actually Mr. Missouri, yes. If a twisted zealot that was from a Judeo/Christian background took a mind to it, they would find countless ways to twist and distort the Holy Bible to justify their barbarism. In fact, history is littered with Christian cruelties. Crusades, Inquisition, Witch Trials, K.K.K., etc.......\n \n Granted the Islam Terrorists take it to a whole new level.", 
   {}, 
   124815, 
   null, 
   1116462960.0
  ], 
  [
   124824, 
   null, 
   "Missouri Mule", 
   "Actually Mr. Missouri, yes. If a twisted zealot that was from a Judeo/Christian background took a mind to it, they would find countless ways to twist and distort the Holy Bible to justify their barbarism. In fact, history is littered with Christian cruelties. Crusades, Inquisition, Witch Trials, K.K.K., etc.......\n \n Granted the Islam Terrorists take it to a whole new level.\n\n \n Several centuries ago that may have been true. Other than something on the order of the Branch Dividians (which didn't saw off any heads) I'm unaware of any Christian groups who would do this. There are individual nutballs like Rudolph but they are individuals and not part of a group or movement.", 
   {}, 
   124821, 
   null, 
   1116463260.0
  ], 
  [
   124829, 
   null, 
   "Truthsayer", 
   "Well, \"christian nations\" we have been able to co-exist somewhat peacefully with the followers of this Muslim religion for decades if not centuries. This new sickness spreading amongst their masses in the name of their religion is just another wave in history that has been seen before, as you pointed out, and will be seen again. Some things are just doomed to repeat.", 
   {}, 
   124824, 
   null, 
   1116463620.0
  ], 
  [
   124838, 
   null, 
   "Dzeron", 
   "Not a good idea? Well, when you have to bow toward Mecca or have your head sawed off you might begin to change your tune. It'll be too late then. But you'll remember what old Muley told you in the year 2005.\n\n \n Don't you think that the Muslims who immigrate to liberal democracies tend to believe in religious tolerance more than those who stay in the theocracies? Islamic fundamentalists would sooner stay in their totalitarian paradises than move to an \"infidel materialist culture.\" It is the more tolerant ones who move.", 
   {}, 
   124721, 
   null, 
   1116464580.0
  ], 
  [
   124842, 
   null, 
   "daewoo", 
   "Well, \"christian nations\" we have been able to co-exist somewhat peacefully with the followers of this Muslim religion for decades if not centuries. This new sickness spreading amongst their masses in the name of their religion is just another wave in history that has been seen before, as you pointed out, and will be seen again. Some things are just doomed to repeat.\n\n \n That is because the current problem has nothign at all to do with muslim vs christian. Religion is being used as a pawn by both sides to drive peoples actions.", 
   {}, 
   124829, 
   null, 
   1116464940.0
  ], 
  [
   124848, 
   null, 
   "lord tammerlain", 
   "But the point is that only Muslim fanatics are sawing heads off. None of these other groups matter because they aren't doing that. Islam specifically instructs its followers to \"strike the heads\" of infidels. Infidels are defined as those who refuse to follow their \"faith.\" Do you know of any other culture or religion that teaches this? I can think of none.\n \n \"an unbeliever with respect to a particular religion\" Merriam-Webster\n\n \n I dont seem to recall any severed heads in Europe. Only in the warzone of Iraq. As for other cultures or religions that have taught this in the past yes quite a few actually. Today, not so much but then the christian world has become alot more secular and has stopped in general persecuting people over difering faith.", 
   {}, 
   124815, 
   null, 
   1116465660.0
  ], 
  [
   124850, 
   null, 
   "Truthsayer", 
   "That is because the current problem has nothign at all to do with muslim vs christian. Religion is being used as a pawn by both sides to drive peoples actions.\n\n \n Absolutely. Religion is merely the vehicle. Social/economic/class difficulty/power struggles amongst a host of other possible reasons is what fuels the vehicle.", 
   {}, 
   124842, 
   null, 
   1116466020.0
  ], 
  [
   124859, 
   null, 
   "Diogenes99", 
   "It is also interesting to note that chrsitian fundamentalism seems to be on the rise in USA, while religous fundamentalism is still an uncommon occurance in europe...\nChristian religious fundamentalism in Europe doesn't make our newspapers, and may not even exist. We do hear occasionally of assassinations in Europe carried out by Islamic fundamentalists, though.", 
   {}, 
   124850, 
   null, 
   1116467760.0
  ], 
  [
   124890, 
   null, 
   "Tastyfish", 
   "Not a good idea? Well, when you have to bow toward Mecca or have your head sawed off you might begin to change your tune. It'll be too late then. But you'll remember what old Muley told you in the year 2005.\n\n Forced assimilation is just not worth it, it doesn't work and backfires far worse than what you started with. I beleive that our society is superior to immigrating ones and is appealing enough that assimilation is inevitable. They get the NHS, democracy, and internet porn - we get Indian take aways and banghra rap. Your right in that this is a war of culture, but completely wrong if you think there is anything you can do about it - best thing is to practice what you preach and be tolerant of other cultures (and before you bring up the killing of the dutch artist - you would be persuing him if it were a dutchman anyway and whilst bombings of abortion clinics happen there is really nothing you can say about it other than condemn fanatics of all kinds).\n \n If anything its in Europe's interest to oppose the 'US's war on Islam' seeing as with Turkey in the EU Iraq is actually our neighbour. By being apparently on the side of Islam (or in actual fact, just not caring) we make the EU seem more reasonable than hardline US and more attractive to moderate muslims and arabs who will eventually be the ones who defeat Islamic fundamentalism rather than any outside power.\n Despite what you may want to believe Islam is no more violent than Judaism far as stict interpretation goes. Its only that they actually won enough of the crusades that its even an issue today (compared to the Hebrews who after a violent and bloody reign got beaten down by the romans, but til then where happily butchering all those who got in the way of the holyland, or wanted to become allies or other such foolery)", 
   {}, 
   124721, 
   null, 
   1116475260.0
  ], 
  [
   124911, 
   null, 
   "Diogenes99", 
   "If anything its in Europe's interest to oppose the 'US's war on Islam' seeing as with Turkey in the EU Iraq is actually our neighbour. By being apparently on the side of Islam (or in actual fact, just not caring) we make the EU seem more reasonable than hardline US and more attractive to moderate muslims and arabs who will eventually be the ones who defeat Islamic fundamentalism rather than any outside power.\nAnd if you are wrong, as you so often have been in the last century, will you expect us to pull your chestnuts out of the fire again?", 
   {}, 
   124890, 
   null, 
   1116481680.0
  ], 
  [
   124936, 
   null, 
   "Eddie", 
   "I live in a religious area of the country. Offhand I can't think of any of these folks who are threatening me or my family. It is true that religious fundamentalism is rare in Europe EXCEPT rising Islamic fanaticism. You can't possibly deny that fact. Several commentators have expressed the strong view that Europe will become almost completely Islamic by the end of this century. Offhand I think they are being conservative in their estimations.\n\n \n Yeah, we have talked about this before. You failed to substantiate this claim. And I didn`t know muslim extremism was rising in europe...\n \n \nChristian religious fundamentalism in Europe doesn't make our newspapers, and may not even exist. We do hear occasionally of assassinations in Europe carried out by Islamic fundamentalists, though.\n\n \n I guess that would be due to selective reporting...\n \n \nAnd if you are wrong, as you so often have been in the last century, will you expect us to pull your chestnuts out of the fire again?\n\n \n Of course we do. That`s what america is for, right?", 
   {}, 
   124859, 
   null, 
   1116496620.0
  ], 
  [
   124947, 
   null, 
   "Tastyfish", 
   "And if you are wrong, as you so often have been in the last century, will you expect us to pull your chestnuts out of the fire again?\n\n If we're wrong, you're screwed anyway. America can't compete with Europe and the middle east and the same thing that converted Europe to whatever Islamic based society its become will do exactly the same thing in the US, because thats why it happened in Europe - our society couldn't compete. \n The US has hardly been a bastion of goodness and light over the 20th century - far from it.", 
   {}, 
   124911, 
   null, 
   1116510420.0
  ], 
  [
   124971, 
   null, 
   "georged", 
   "\n The US has hardly been a bastion of goodness and light over the 20th century - far from it.\n\n \n No, but we were rich and bought our way into acceptance. Since becoming a debtor nation and losing our manufacturing sector our aggressive actions and arrogance don't seem to play as well as when we were rich.", 
   {}, 
   124947, 
   null, 
   1116516360.0
  ], 
  [
   125048, 
   null, 
   "Missouri Mule", 
   "Don't you think that the Muslims who immigrate to liberal democracies tend to believe in religious tolerance more than those who stay in the theocracies? Islamic fundamentalists would sooner stay in their totalitarian paradises than move to an \"infidel materialist culture.\" It is the more tolerant ones who move.\n\n \n I'd like to believe that but the news reports that I read say otherwise. Just today I posted an article from Germany where several Muslim women have been murdered for \"family honor.\"\n \n What I would like to see is a national law in each nation that takes in these people to mandatorially execute anyone who would kill family members. If they don't like the law, then get out of the country and go back to where they came from. None of us would let a mad dog into our homes to run amuck. We would call the humane society or shoot it on the spot.", 
   {}, 
   124838, 
   null, 
   1116525660.0
  ], 
  [
   125051, 
   null, 
   "Missouri Mule", 
   "Forced assimilation is just not worth it, it doesn't work and backfires far worse than what you started with. I beleive that our society is superior to immigrating ones and is appealing enough that assimilation is inevitable. They get the NHS, democracy, and internet porn - we get Indian take aways and banghra rap. Your right in that this is a war of culture, but completely wrong if you think there is anything you can do about it - best thing is to practice what you preach and be tolerant of other cultures (and before you bring up the killing of the dutch artist - you would be persuing him if it were a dutchman anyway and whilst bombings of abortion clinics happen there is really nothing you can say about it other than condemn fanatics of all kinds).\n \n If anything its in Europe's interest to oppose the 'US's war on Islam' seeing as with Turkey in the EU Iraq is actually our neighbour. By being apparently on the side of Islam (or in actual fact, just not caring) we make the EU seem more reasonable than hardline US and more attractive to moderate muslims and arabs who will eventually be the ones who defeat Islamic fundamentalism rather than any outside power.\n Despite what you may want to believe Islam is no more violent than Judaism far as stict interpretation goes. Its only that they actually won enough of the crusades that its even an issue today (compared to the Hebrews who after a violent and bloody reign got beaten down by the romans, but til then where happily butchering all those who got in the way of the holyland, or wanted to become allies or other such foolery)\n\n \n Reading your post reminds me of the Jew who said prior to WWII and Hitler's consolidating his power -- \"Well, they can't kill all the Jews.\" You just wait and see. Old Muley knows what he is talking about. This problem is not going to affect me but it will you. \n \n BTW, how many Jews are sawing heads off these days?", 
   {}, 
   124890, 
   null, 
   1116525900.0
  ], 
  [
   125199, 
   null, 
   "lord tammerlain", 
   "I'd like to believe that but the news reports that I read say otherwise. Just today I posted an article from Germany where several Muslim women have been murdered for \"family honor.\"\n \n What I would like to see is a national law in each nation that takes in these people to mandatorially execute anyone who would kill family members. If they don't like the law, then get out of the country and go back to where they came from. None of us would let a mad dog into our homes to run amuck. We would call the humane society or shoot it on the spot.\n\n \n \n Perhaps it is fear of sucessfull Arabic people that is driving the fear of political elites in NA and in Europe. The following article shows that Arabic people int the US sucessfull then the average American\n \n http://www.foreignpolicy.com/story/cms.php?story_id=2781\n \n \nPeople of Arab descent living in the United States are doing far better than the average American. That is the surprising conclusion drawn from data collected by the U.S. Census Bureau in 2000 and released last March. The census found that U.S. residents who report having Arab ancestors are better educated and wealthier than average Americans.\n \n Whereas 24 percent of Americans  hold college degrees, 41 percent of Arab Americans are college graduates. The median income for an Arab family living in the United States is $52,300-4.6 percent higher than other American families-and more than half of all Arab Americans own their home. Forty-two percent of people of Arab descent in the United States work as managers or professionals, while the same is true for only 34 percent of the general U.S. population. For many, this success has come on quickly: Although about 50 percent of Arab Americans were born in the United States, nearly half of those born abroad did not arrive until the 1990s. \n \n \n", 
   {
    "unicode_changes_made": true
   }, 
   125048, 
   null, 
   1116540240.0
  ], 
  [
   125229, 
   null, 
   "Diogenes99", 
   "I guess that would be due to selective reporting...\nGot any links to assassinations carried out by Christian fundamentalists in Europe over the last century or so?\n \n \nOf course we do. That`s what america is for, right?\nThat was in the past, when there was hope that Europe could become civilized enough to govern itself. :p \n \n \nIf we're wrong, you're screwed anyway. America can't compete with Europe and the middle east and the same thing that converted Europe to whatever Islamic based society its become will do exactly the same thing in the US, because thats why it happened in Europe - our society couldn't compete.\nYou are assuming that the US will become as decadent and incapable of defending itself as Europe. It's possible, but not probable.\n \n \nPerhaps it is fear of sucessfull Arabic people that is driving the fear of political elites in NA and in Europe.\nI doubt it. Successful Arab people don't volunteer for suicide missions, fly airplanes into office buildings, or spread anthrax around (unless they have a screw loose in their head somewhere, like Sami al Arian). Fear of someone else's success is more of a European trait.", 
   {}, 
   124936, 
   null, 
   1116542700.0
  ], 
  [
   125240, 
   null, 
   "Eddie", 
   "Got any links to assassinations carried out by Christian fundamentalists in Europe over the last century or so?\n\n \n I guess it depends on what you mean by assasination, but I got this: Knutby killings", 
   {}, 
   125229, 
   null, 
   1116543360.0
  ], 
  [
   125246, 
   null, 
   "Diogenes99", 
   "Interesting reading. Do you consider this cult to be Christian fundamentalists?", 
   {}, 
   125240, 
   null, 
   1116543720.0
  ], 
  [
   125254, 
   null, 
   "Eddie", 
   "Interesting reading. Do you consider this cult to be Christian fundamentalists?\n\n \n Yes. Very much so.", 
   {}, 
   125246, 
   null, 
   1116543900.0
  ], 
  [
   125452, 
   null, 
   "Missouri Mule", 
   "Perhaps it is fear of sucessfull Arabic people that is driving the fear of political elites in NA and in Europe. The following article shows that Arabic people int the US sucessfull then the average American\n \n http://www.foreignpolicy.com/story/cms.php?story_id=2781\n\n \n I don't doubt that many Arab-Americans are quite successful. The reason they are here after all is for opportunity. That's why a lot of immigrants come here and since they have the gumption to get up on their own two hind legs and do something for themselves rather than wait for a government handout, they are likely to be the best and the brightest. In fact one of my doctors is from Lebanon. Bear in mind that not all are Muslims. Many are Christians who fled the Middle East because of religious persecution.", 
   {}, 
   125199, 
   null, 
   1116570720.0
  ], 
  [
   125499, 
   null, 
   "Tastyfish", 
   "Jews/Nazis and Europeans/Muslims are very different things, the entire principle is different. The first is all about a minority being blamed for the fall of germany and accusing them of plotting world domination and the latter is about which society appeals more to common people. Given that most immigrants here are going to earn more than they would at home and have so much more on offer here for less I don't think we should feel that threatened. \n \n The rise of Islamic fundamentalism is the same as chrisitian fundamentalism, the old relgion feels threatened by advancies in science and the changing attitude of people so goes more to the extremes. In doing so they are going to push more people away in wealthier countries than they will recruit. What you need to do is provide a real alternative to religion and improve conditions for the common people. While this may be what the US thinks its doiing, its doing it for that reason (you still think you are there to try to kill all the terrorists) more or less, its not doing it very well or at the very least its making it happen very violently.", 
   {}, 
   125452, 
   null, 
   1116595500.0
  ], 
  [
   125614, 
   null, 
   "Diogenes99", 
   "...What you need to do is provide a real alternative to religion and improve conditions for the common people...\nNot likely. The need for a higher power to explain the unexplainable seems to be hardwired into the human psyche. The higher power is usually one or more gods (traditional religion), but since the days of Marx we have seen the rise of a new belief system that looks to government as the source of all things. It's called secularism, but it has all the essential characteristics of a religion.", 
   {}, 
   125499, 
   null, 
   1116617040.0
  ], 
  [
   125618, 
   null, 
   "sinjin", 
   "Not likely. The need for a higher power to explain the unexplainable seems to be hardwired into the human psyche. The higher power is usually one or more gods (traditional religion), but since the days of Marx we have seen the rise of a new belief system that looks to government as the source of all things. It's called secularism, but it has all the essential characteristics of a religion.\n\n \n The need for a \"witch doctor\" to explain the unexplainable seems to be hardwired into the human \"society\".", 
   {}, 
   125614, 
   null, 
   1116617460.0
  ], 
  [
   126065, 
   null, 
   "Tastyfish", 
   "Not likely. The need for a higher power to explain the unexplainable seems to be hardwired into the human psyche. The higher power is usually one or more gods (traditional religion), but since the days of Marx we have seen the rise of a new belief system that looks to government as the source of all things. It's called secularism, but it has all the essential characteristics of a religion.\n\n But religion is pretty mucg sidelined here in europe, its still a massive thing in the states it seems, and its almost every week that we here of some of your fundamentalist citizens burning harry potter, blowing up abortion clinics, wanting to ban cloning of anykind or just its power in politics with regards to gay rights.\n Here, at least in the UK religion is just ignored for the most part - might go to church if theres a wedding or a funereal. But other than that it does little except host the occasional vilage fete. On the whole its like this regardless of your religion, other than Muslims or Jews may also may not eat certain foods. \n \n I would put a lot down to how the media interprets things, far as you look from here, you are almost as bad as the Islamic fundamentalists you are fighting/encouraging in Iraq.", 
   {}, 
   125614, 
   null, 
   1116701820.0
  ], 
  [
   126070, 
   null, 
   "Missouri Mule", 
   "But religion is pretty mucg sidelined here in europe, its still a massive thing in the states it seems, and its almost every week that we here of some of your fundamentalist citizens burning harry potter, blowing up abortion clinics, wanting to ban cloning of anykind or just its power in politics with regards to gay rights.\n Here, at least in the UK religion is just ignored for the most part - might go to church if theres a wedding or a funereal. But other than that it does little except host the occasional vilage fete. On the whole its like this regardless of your religion, other than Muslims or Jews may also may not eat certain foods. \n \n I would put a lot down to how the media interprets things, far as you look from here, you are almost as bad as the Islamic fundamentalists you are fighting/encouraging in Iraq.\n\n \n That is just terrible. Where in the world do you get these ideas? I've suspected that the MSM in Europe are composed almost entirely of the looney left but if this is actually true (what you say), they are completely off the planet, in outer space somewhere around the Jupiter. Pathetic.", 
   {}, 
   126065, 
   null, 
   1116702480.0
  ], 
  [
   126073, 
   null, 
   "Eddie", 
   "That is just terrible. Where in the world do you get these ideas? I've suspected that the MSM in Europe are composed almost entirely of the looney left but if this is actually true (what you say), they are completely off the planet, in outer space somewhere around the Jupiter. Pathetic.\n\n \n We have quite a few well-respected columnists comparing the insurgency in Iraq qith Norweigan resistance against nazi-germany. You seem to have lost the media-war, at least in certain parts of europe...\n \n And yes, I agree that it`s somewhat \"looney\"... Allthough I would not say that it is an exclusive left-wing trait to bash the US over Iraq here...", 
   {}, 
   126070, 
   null, 
   1116702720.0
  ], 
  [
   126074, 
   null, 
   "Tastyfish", 
   "You are missing the point, the US is portrayed in the media as being very, very religious or a slave to big buisnesses motivated purely by greed and it scares us slightly here as because this is what is reported (rather than Ted, devout Christian brought apples and a new pair of shoes today) it is assumed to be more common that it may be. Exactly the same thing is happening with the european Muslims - yes there are occasional honor killings, but there are far more killed because they supported the wrong football team in a riot or millions of other things.\n You do exactly the same thing, you hear a few reports in the news and assume its commonplace.", 
   {}, 
   126070, 
   null, 
   1116702780.0
  ], 
  [
   126081, 
   null, 
   "Missouri Mule", 
   "You are missing the point, the US is portrayed in the media as being very, very religious or a slave to big buisnesses motivated purely by greed and it scares us slightly here as because this is what is reported (rather than Ted, devout Christian brought apples and a new pair of shoes today) it is assumed to be more common that it may be. Exactly the same thing is happening with the european Muslims - yes there are occasional honor killings, but there are far more killed because they supported the wrong football team in a riot or millions of other things.\n \n You do exactly the same thing, you hear a few reports in the news and assume its commonplace.\n\n \n That's just craziness. It isn't reality. \n \n I have yet to hear of a single \"Christian Fundamentalist\" stabbing and nearly decapitating someone in a public street as has happened in the Netherlands. There are a few nutballs around like Jim Jones and Rudolph but they pose no (I emphasize no) threat to our way of life. Islamic terrorism certainly does. And to you too.", 
   {}, 
   126074, 
   null, 
   1116703560.0
  ], 
  [
   126091, 
   null, 
   "Tastyfish", 
   "We don't expect to be tied to the back of a tow truck til our heads come off if we are black here either, you have your share of idiot fanatics.\n \n However your beleif that this is a common occurance is just nonsense, its not reality. Things that would happen in an Islamic fundamentalist country are not going to happen here (at least with at all the same frequency). You commit murder, then you've commited murder whatever the reason you beleive justifies it. Europe is under no imminant threat from Islam, its not going to change our way of life any more than its going to change the US's. Not only that because there are so many different countries in the EU, even if it does bizarrely and miraculously convert one to an Islamic state its interactions with the others are going to swiftly tip it back the other way.\n \n You are being completely paranoid. If anything its that which is going to change your way of life, not any external agent.", 
   {}, 
   126081, 
   null, 
   1116704640.0
  ], 
  [
   126127, 
   null, 
   "Diogenes99", 
   "But religion is pretty mucg sidelined here in europe, ...\nI had heard that folks in Britain had pretty much abandoned the church, and were becoming a tribal society loosely organized around football teams... :p \n \n \nYou are missing the point, the US is portrayed in the media as being very, very religious or a slave to big buisnesses motivated purely by greed and it scares us slightly here as because this is what is reported (rather than Ted, devout Christian brought apples and a new pair of shoes today) it is assumed to be more common that it may be. Exactly the same thing is happening with the european Muslims - yes there are occasional honor killings, but there are far more killed because they supported the wrong football team in a riot or millions of other things.\nYou need to understand that the MSM (more accurately described as LM, Legacy Media) is overwhelmingly left-wing and worships the god of Big Government to provide for their hedonism. They are fundamentalist fanatics in their belief and, like zealous minorities everywhere, they regard traditionalists with fear and loathing. They are terribly frustrated by their inability to win elections, and their prose is becoming more venomous as they fade toward obscurity on the ash heap of history.\n \n \nWe don't expect to be tied to the back of a tow truck til our heads come off if we are black here either, you have your share of idiot fanatics.\nThat was hardly religious fundamentalism, any more than the case of the poor bloke in a British prison who was killed and eaten by his cellmate a few years ago. Psychopaths like Tim McVeigh, Sweeney Todd, Jim Jones, and Jack the Ripper are not confined to any particular race or society.\n \n \nHowever your beleif that this is a common occurance is just nonsense, its not reality. Things that would happen in an Islamic fundamentalist country are not going to happen here (at least with at all the same frequency).\nThat's not very comforting. I will concede that sensationalism sells newspapers (and magazines like NewsWeak), and that the stories we see make the news because they are out of the ordinary. The thing we find most repugnant is that some of things, like honor killings, seem to be accepted by Islamic society.\n \n \nEurope is under no imminant threat from Islam, its not going to change our way of life any more than its going to change the US's.\nNeville Chamberlain lives!", 
   {}, 
   126091, 
   null, 
   1116708000.0
  ], 
  [
   126147, 
   null, 
   "Missouri Mule", 
   "We don't expect to be tied to the back of a tow truck til our heads come off if we are black here either, you have your share of idiot fanatics.\n \n However your beleif that this is a common occurance is just nonsense, its not reality. Things that would happen in an Islamic fundamentalist country are not going to happen here (at least with at all the same frequency). You commit murder, then you've commited murder whatever the reason you beleive justifies it. Europe is under no imminant threat from Islam, its not going to change our way of life any more than its going to change the US's. Not only that because there are so many different countries in the EU, even if it does bizarrely and miraculously convert one to an Islamic state its interactions with the others are going to swiftly tip it back the other way.\n \n You are being completely paranoid. If anything its that which is going to change your way of life, not any external agent.\n\n \n You are obviously referring to the incident in Jasper, Texas. I read and heard about that horrible crime and thought that it must populated by a bunch of redneck racists. Surprise, surprise, I traveled through there and it is a modern very hospitable town. The murderers (two of them) will die by lethal injection (sentenced by white jurors, yet). The third will serve life in prison. This whole thing was a bunch of political hatred for Bush in the presidential election of 2000. \n \n If you think for one moment that Europe is going to get off the hook for this widespread and increasingly prevalent Islamic fanaticism then you are as deceived as was Neville Chamberlain when he thought he could do business with Adolf Hitler. You'll look back on this 5-10 years down the road and remember what old Muley told you back here in 2005. Just think Eurabia. It's happening and you will pay the piper for your obstinance in failing to deal with reality.", 
   {}, 
   126091, 
   null, 
   1116710340.0
  ], 
  [
   126156, 
   null, 
   "lord tammerlain", 
   "Big differences\n \n NAZI Germany, population tens of millions with a big army in Europe\n \n Militant Islam, maybe a few hundred at most in Europe\n \n Huge threat difference.\n \n The reality now, in the near future is that Europe is of course under threat from terrorism, not just by militant islam, but from neo nazis, separatist movements and many others. Untill there is a united muslim army Europe only has to deal with the terrorist threats, which Europe has dealt with for decades. From Communists, from the IRA, ETA, from NATO and its own governments.", 
   {}, 
   126147, 
   null, 
   1116711420.0
  ], 
  [
   126202, 
   null, 
   "Diogenes99", 
   "Big differences\n \n NAZI Germany, population tens of millions with a big army in Europe\n \n Militant Islam, maybe a few hundred at most in Europe\n \n Huge threat difference.\nTrue, if you count all Germans as Nazis. I suspect the percentage of brownshirts among the German population in the early thirties was a lot smaller than the percentage of fanatics among the Muslim immigrants to Europe now, but I could be wrong.\n \n \nThe reality now, in the near future is that Europe is of course under threat from terrorism, not just by militant islam, but from neo nazis, separatist movements and many others. Untill there is a united muslim army Europe only has to deal with the terrorist threats, which Europe has dealt with for decades. From Communists, from the IRA, ETA, from NATO and its own governments.\nThe European tolerance for terrorist violence amazes me. Is it something in the water?", 
   {}, 
   126156, 
   null, 
   1116715980.0
  ], 
  [
   126206, 
   null, 
   "Big_Bear_Scot", 
   "The European tolerance for terrorist violence amazes me. Is it something in the water?\n \n \n No, we try to stop it when ever we can. I wouldn't call the British Army in Northern Ireland during the Height of the troubles as tolerant to terrorist violence. I wouldn't call the collusion between British Intelligence and Loyalist Terrorists to kill Republicans was tolerance. \n \n I wouldn't call Spain not giving into ETA's demands for an Independent Basque country as tolerance. \n \n I could go on for ages about examples of Europeans and European Governments not tolerating Terrorist violence.", 
   {}, 
   126202, 
   null, 
   1116716460.0
  ], 
  [
   126245, 
   null, 
   "georged", 
   "The US has inner-cities where a stroll, especially after dark, presents far more danger than isolated incidents in other countries. But we tend to overlook our own social deficiencies.", 
   {}, 
   126206, 
   null, 
   1116722400.0
  ], 
  [
   126431, 
   null, 
   "Missouri Mule", 
   "The US has inner-cities where a stroll, especially after dark, presents far more danger than isolated incidents in other countries. But we tend to overlook our own social deficiencies.\n\n \n I can agree with this. But I also remember when I walked the streets of Paris and Brussels in the wee hours of the morning. I don't think I would do that today.", 
   {}, 
   126245, 
   null, 
   1116742680.0
  ], 
  [
   126474, 
   null, 
   "Jo Bennett", 
   "Please... left wing media? Have you watched/read any British media. For the papers on the right we have:\n Telegraph\n Times\n Daily (and Sunday) Mail\n Express\n Sun (+news of the world)\n \n In the centre we have\n Independent\n \n On the left (moderate left mind you)\n Guardian\n Mirror\n \n Who the hell knows it's just soft porn\n Star\n \n For TV on the right we have:\n ITV\n Sky (or fox as it is known in the US)\n \n Centre\n BBC\n \n Left (again very slightly)\n Channel 4\n \n Who the hell knows, nobody watches it\n Channel 5\n EDIT: added those tastyfish reminded me of", 
   {}, 
   126431, 
   null, 
   1116756000.0
  ], 
  [
   126495, 
   null, 
   "Tastyfish", 
   "Don't forget the Mirror, Star and News of the World for the right. Though papers might be pushing it.", 
   {}, 
   126474, 
   null, 
   1116771600.0
  ], 
  [
   126565, 
   null, 
   "Missouri Mule", 
   "Please... left wing media? Have you watched/read any British media. For the papers on the right we have:\n Telegraph\n Times\n Daily (and Sunday) Mail\n Express\n Sun (+news of the world)\n \n In the centre we have\n Independent\n \n On the left (moderate left mind you)\n Guardian\n Mirror\n \n Who the hell knows it's just soft porn\n Star\n \n For TV on the right we have:\n ITV\n Sky (or fox as it is known in the US)\n \n Centre\n BBC\n \n Left (again very slightly)\n Channel 4\n \n Who the hell knows, nobody watches it\n Channel 5\n EDIT: added those tastyfish reminded me of\n\n \n \n You would certainly know better than I would what constitutes the political spectrum in the news media there. I do believe however that some of the conclusions of the left wing press/media are downright bizarre. I read a lot of this stuff and I wonder sometimes what planet I am on. \n \n As I am typing this I am listening to \"This Week\" on ABC and one of the opiners is from \"The Nation.\" This is an American publication but the most extreme left-wing mainstream publication in the U.S. It reminds me so much of what I read in the British newspapers. The arguments put forth are so disengenious as to break down the lines of communication. \n \n As to a reliable British based publication I would believe what I find in \"The Economist.\" As an American who has been a long time subscriber I can't recommend the WSJ too highly. What I am looking for more than about anything else is factual news and reasoned opinion.", 
   {}, 
   126474, 
   null, 
   1116782700.0
  ], 
  [
   126568, 
   null, 
   "Jo Bennett", 
   "Everything I've seen from the WSJ and the economist seems to be the worst kind of insidious right wing, free market drivel, the sort of thing I expect from The Times or the Daily Telegraph, only worse.", 
   {}, 
   126565, 
   null, 
   1116783000.0
  ], 
  [
   126570, 
   null, 
   "Eddie", 
   "WSJ has both poor quality as well as pushing an obvious agenda IMO. It`s one of the worst of the larger publications. Sometimes I wonder if they even bother to check up facts before printing their articles, or if they go on hearsay alone...", 
   {}, 
   126568, 
   null, 
   1116783240.0
  ], 
  [
   126572, 
   null, 
   "Missouri Mule", 
   "Everything I've seen from the WSJ and the economist seems to be the worst kind of insidious right wing, free market drivel, the sort of thing I expect from The Times or the Daily Telegraph, only worse.\n\n \n I can hardly believe my eyes. You can't be serious or if you are, then it is hard to believe we will ever be able to have a meeting of minds. What can you possibly argue with in this opinion piece? What could be more reasoned and sensible?\n \n American capitalism\n \n Damaged goods\n May 19th 2005\n From The Economist print edition\n \n The American economic model is doing all right. It could be doing even better\n \n LOOKING around the world, you do not see many economies, least of all rich ones, doing as well as America's. In the inexhaustible capacity of its private sector to innovate, in its seemingly unquenchable desire to reinvent itself, the United States still leads the world, and reaps the material rewards of that leadership. Its brand of capitalism appears to have something going for it-so it may seem churlish, even perverse, to wonder how much better a country as successful as this might do if it really tried. And yet it could indeed be doing better. That's right: American capitalism is not beyond improvement.\n \n In 2001-02, at the height of the Enron scandal, and amid the other corporate debacles that stained the reputation of American business, that would have seemed too obvious to be worth stating. But concerns about corporate probity have receded of late. This is for a variety of reasons. One of them, or so its designers hope, was the Sarbanes-Oxley statute, the measure conceived in response to those scandals. But that law is not in fact proving to be the unalloyed blessing that its creators envisaged. Meanwhile, other flaws in the American business model remain unattended to; they were simply not addressed by SOX (as it is now, not always affectionately, known). So, pleasant though it must be for the United States to contemplate the current performance of the continental European alternative, it would be wrong, as well as unAmerican, to be complacent. There is still some work to do at home...\n \n (Snip)\n \n A fine way to deal with this would be to cut corporate taxes (against which debt service can be deducted, hence the pro-debt bias); and an excellent way to pay for that would be to launch an assault on corporate welfare-the $100 billion a year or so, conservatively estimated, of special-interest subsidies and handouts that the government pays to American businesses. Preferably, don't just cut that lot, eliminate it.\n \n This last recommendation is one that George Bush will be especially reluctant to accept. Mr Bush is the classic instance of a conservative politician who confuses support for particular businesses with support for enterprise in general. These seemingly similar ideas are in fact directly contradictory. The way to support enterprise-American enterprise, the best in the world-is to be as unEuropean as possible. Mr President, look at France. Notice their economic policies. See how they subsidise this and protect that. Do we have to spell it out?\n \n http://www.economist.com/opinion/displayStory.cfm?story_id=3984578", 
   {
    "unicode_changes_made": true
   }, 
   126568, 
   null, 
   1116783540.0
  ], 
  [
   126577, 
   null, 
   "Missouri Mule", 
   "WSJ has both poor quality as well as pushing an obvious agenda IMO. It`s one of the worst of the larger publications. Sometimes I wonder if they even bother to check up facts before printing their articles, or if they go on hearsay alone...\n\n \n You're wrong. You don't read it. Making such claims is just knee-jerk liberalism.", 
   {}, 
   126570, 
   null, 
   1116783600.0
  ], 
  [
   126585, 
   null, 
   "Jo Bennett", 
   "The economist is fundamentally biased. It values total wealth more than living standards, it think market solutions are the only solutions. The article you posted shows that clearly. The assumption that the US economy is the best in the world is not one I would agree with. It has intrinsically right wing attitudes to the economy - that money is the purpose and measure of success of an economy, not the wellbeing of its citizens. By all means stop subsidies for private business, but don't automatically assume that the best way to dispose of the money saved is to cut corporate taxes. The passages you highlight take a fundamentally right wing view, that the market will do what is best. IT'S NOT TRUE.", 
   {}, 
   126577, 
   null, 
   1116784140.0
  ], 
  [
   126592, 
   null, 
   "Eddie", 
   "You're wrong. You don't read it. Making such claims is just knee-jerk liberalism.\n\n \n I have actually read quite a few WSJ articles on the internet. They are seldom high quality, and a few have been really bad. I remember one particular article about Swedish economic and political situation during the 90ies. There where so many factual errors it was almost embarassing.", 
   {}, 
   126577, 
   null, 
   1116784620.0
  ], 
  [
   126608, 
   null, 
   "Missouri Mule", 
   "The economist is fundamentally biased. It values total wealth more than living standards, it think market solutions are the only solutions. The article you posted shows that clearly. The assumption that the US economy is the best in the world is not one I would agree with. It has intrinsically right wing attitudes to the economy - that money is the purpose and measure of success of an economy, not the wellbeing of its citizens. By all means stop subsidies for private business, but don't automatically assume that the best way to dispose of the money saved is to cut corporate taxes. The passages you highlight take a fundamentally right wing view, that the market will do what is best. IT'S NOT TRUE.\n\n \n Well, obviously you and I do not agree. Rather than shooting figuratively at one another, why don't you tell me what will work? I suppose I don't really understand what you believe to be correct economic policies. Are you just advocating the complete substitution of a market based economy with socialism? And what evidence do you have that socialism will work better than a market based economy? Why do you believe that politicians are better able to guide an economy than the \"invisible hand\" of Adam Smith's economical model?\n \n Adam Smith and the invisible hand\n by Helen Joyce\n \n \n ...every individual necessarily labours to render the annual revenue of the society as great as he can. He generally, indeed, neither intends to promote the public interest, nor knows how much he is promoting it. By preferring the support of domestic to that of foreign industry, he intends only his own security; and by directing that industry in such a manner as its produce may be of the greatest value, he intends only his own gain, and he is in this, as in many other cases, led by an invisible hand to promote an end which was no part of his intention. Nor is it always the worse for the society that it was no part of it. By pursuing his own interest he frequently promotes that of the society more effectually than when he really intends to promote it. I have never known much good done by those who affected to trade for the public good. \n \n \n (Snip)\n \n Perhaps the strongest reason for leaving the allocation of effort and reward to the invisible hand is that when it misappropriates goods, it is likely to be on a small scale. More centralised methods of allocating goods are more prone to corruption and waste. \n \n http://plus.maths.org/issue14/features/smith/", 
   {}, 
   126585, 
   null, 
   1116785820.0
  ], 
  [
   126611, 
   null, 
   "Missouri Mule", 
   "I have actually read quite a few WSJ articles on the internet. They are seldom high quality, and a few have been really bad. I remember one particular article about Swedish economic and political situation during the 90ies. There where so many factual errors it was almost embarassing.\n\n \n Obviously I don't have a perfect memory or even that I read what you are referring to. Why don't you give me a flavor of their \"factual errors?\" And are you talking about their news sections or their opinion pieces? And who wrote it? Sometimes in the opinion pieces these are submitted by authors in the nations that are the subject. Perhaps this was written by a Swedish politician who had an ax to grind.", 
   {}, 
   126592, 
   null, 
   1116785940.0
  ], 
  [
   126616, 
   null, 
   "Eddie", 
   "Obviously I don't have a perfect memory or even that I read what you are referring to. Why don't you give me a flavor of their \"factual errors?\" And are you talking about their news sections or their opinion pieces? And who wrote it? Sometimes in the opinion pieces these are submitted by authors in the nations that are the subject. Perhaps this was written by a Swedish politician who had an ax to grind.\n\n \n It might have been an oppinion piece, but it was submitted by a journalist (with an english name). I don`t expect you to remeber it, I can`t even recall that much of the article in question (read it a year or two ago). As for an example of errors, the article claimed that the social democrats had been in power since the end of world war II, which was factually incorrect. They lost two elections between world war II and 1992. Minor detail, yes. But it was one of many in the same article that just made me wonder wether they even bother to check the facts beofre they print it.", 
   {}, 
   126611, 
   null, 
   1116786540.0
  ], 
  [
   126687, 
   null, 
   "georged", 
   "I have actually read quite a few WSJ articles on the internet. They are seldom high quality, and a few have been really bad. I remember one particular article about Swedish economic and political situation during the 90ies. There where so many factual errors it was almost embarassing.\n\n \n \n WSJ is heavily editorialized by the very nature of its readership market. I always enjoyed the articles on scandals, US company specifics and used their numbers, but let's not forget their bills are paid by brokerages, banks, trading firms, M&A arms and others with highly defined markets directly related to finance. Optimism regarding US economics is the WSJ stock in trade.", 
   {}, 
   126592, 
   null, 
   1116791820.0
  ], 
  [
   126696, 
   null, 
   "Jo Bennett", 
   "There is a place for the market in certain areas, particularly in non-essential goods and services. In the provision of others such as healthcare, education, electricity, postal services etc. the level of regulation required to ensure an acceptable service to everyone is such that it is more efficient and fairer to have the public sector run them. I don't advocate soviet state capitalism, (it didn't resemble communism enough to be worthy of the name) I think the ideal balance would be a mixed economy of public enterprises and worker owned collective businesses. In the mean time tax breaks for collective businesses and regulation of the excesses of the market are the way to push things in that direction. I would consider a return of intellectual property, particularly patents, to their original intention by reducing their lifespan would be extremely beneficial to innovation - the capitalist driven over-protection of intellectual property causing serious damage to science and technology advancement, and cementing the power of the rich over the poor (who can afford the most lawyers?).", 
   {}, 
   126687, 
   null, 
   1116792480.0
  ], 
  [
   127054, 
   null, 
   "Missouri Mule", 
   "It might have been an oppinion piece, but it was submitted by a journalist (with an english name). I don`t expect you to remeber it, I can`t even recall that much of the article in question (read it a year or two ago). As for an example of errors, the article claimed that the social democrats had been in power since the end of world war II, which was factually incorrect. They lost two elections between world war II and 1992. Minor detail, yes. But it was one of many in the same article that just made me wonder wether they even bother to check the facts beofre they print it.\n\n \n So it probably was an opinion piece. It is not unusual for someone to post an opinion and they have a rebuttal area on the second page of the editorial section where they will be run. If you felt strongly about it I would have said something. I doubt I even read it to be truthful. I only glance at the editorial page as usually get that off the internet where I have a daily e-mail alerting me of same. \n \n I pay particular attention (as best I can) to articles regarding the economy and other associated subjects. I wish I had paid more attention in the runup to the tech bust in 2000. Contrary to what many of us believed at the time investing in the stock market and particularly in the tech stocks was not a license to print money. We just thought it was.", 
   {}, 
   126616, 
   null, 
   1116834360.0
  ], 
  [
   127058, 
   null, 
   "Missouri Mule", 
   "There is a place for the market in certain areas, particularly in non-essential goods and services. In the provision of others such as healthcare, education, electricity, postal services etc. the level of regulation required to ensure an acceptable service to everyone is such that it is more efficient and fairer to have the public sector run them. I don't advocate soviet state capitalism, (it didn't resemble communism enough to be worthy of the name) I think the ideal balance would be a mixed economy of public enterprises and worker owned collective businesses. In the mean time tax breaks for collective businesses and regulation of the excesses of the market are the way to push things in that direction. I would consider a return of intellectual property, particularly patents, to their original intention by reducing their lifespan would be extremely beneficial to innovation - the capitalist driven over-protection of intellectual property causing serious damage to science and technology advancement, and cementing the power of the rich over the poor (who can afford the most lawyers?).\n\n \n Worker owned collective businesses? Can you cite any successful models? You are still going to need management to make decisions.", 
   {}, 
   126696, 
   null, 
   1116834480.0
  ], 
  [
   127063, 
   null, 
   "Jo Bennett", 
   "You can hire managers to make day to day decisions. I have a big fat example - the British cooperative movement, including co-op grocery stores and supermarkets, pharmacies, funeral directors, wholesalers, farms, banks. There is also the John Lewis chain of department stores. There aren't many of these because the capitalist business model can squeeze them out by bribing the worker-owners to sell up. This worked very well with many mutual financial institutions.", 
   {}, 
   127058, 
   null, 
   1116834720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Europatsies", 
  "url": "http://www.4forums.com/political/european-politics-economics/5272-europatsies.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 5272, 
  "discussion_files": [
   [
    "13982.html", 
    "http://www.4forums.com/political/european-politics-economics/5272-europatsies-print.html"
   ], 
   [
    "13983.html", 
    "http://www.4forums.com/political/european-politics-economics/5272-europatsies-5-print.html"
   ], 
   [
    "13984.html", 
    "http://www.4forums.com/political/european-politics-economics/5272-europatsies-4-print.html"
   ], 
   [
    "13985.html", 
    "http://www.4forums.com/political/european-politics-economics/5272-europatsies-3-print.html"
   ], 
   [
    "13986.html", 
    "http://www.4forums.com/political/european-politics-economics/5272-europatsies-2-print.html"
   ]
  ], 
  "identifier": 5272
 }
]