[
 [
  [
   124127, 
   null, 
   "SteveRogers", 
   "Saw this on another board:\n \n \n US 'ignored Iraq oil smuggling'\n \n The US turned a blind eye to the former Iraq regime's $8bn trade in smuggled oil, a new US Senate report says.\n \n The report says the US was well aware of both the smuggling and the kickbacks Iraq solicited from players in the UN's oil-for-food programme.\n \n Published by Democrat minority members of a key committee, it follows charges levelled against several Russian politicians and UK MP George Galloway.\n \n Mr Galloway has flown to Washington DC to defend himself in person.\n \n He will testify before the Senate Permanent Subcommittee on Investigations later on Tuesday.\n \n Others accused of receiving oil allocations from Baghdad include French former Interior Minister Charles Pasqua, Russian ultranationalist MP Vladimir Zhirinovsky, and Russian former presidential aides Alexander Voloshin and Sergei Issakov.\n \n Mr Galloway, Mr Pasqua and Mr Zhirinovsky have all denied the allegations. \n \n (snip)\n \n 'Facilitation'\n \n But it also said that the far bigger smuggling trade was carried out with tacit US approval.\n \n Much of the oil went out by land through Turkey and Syria, but much also went by sea.\n \n The report takes the example of a series of shipments from the port of Khor al-Amaya in southern Iran in the month before the US-led coalition began its 2003 invasion.\n \n Jordan paid $53m in hard currency for 7.7 million barrels on seven tankers, all of which were explicitly allowed to pass by the US naval blockade.\n \n \"The US was not only aware of Iraqi oil sales which violated UN sanctions and provided the bulk of the illicit money Saddam Hussein obtained from circumventing UN sanctions,\" the report said.\n \n \"On occasion, the US actually facilitated the illicit oil sales.\" [B]\n \n http://news.bbc.co.uk/2/hi/americas/4554507.stm", 
   {
    "post_info": {
     "post_title": "US implicated in OFF"
    }
   }, 
   null, 
   null, 
   1116361560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  US implicated in OFF", 
  "url": "http://www.4forums.com/political/news-forum/5273-us-implicated-off.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 5273, 
  "discussion_files": [
   [
    "30334.html", 
    "http://www.4forums.com/political/news-forum/5273-us-implicated-off-print.html"
   ]
  ], 
  "identifier": 5273
 }
]