[
 [
  [
   124235, 
   null, 
   "Missouri Mule", 
   "I heard about this yesterday and previously but this is what they are trained to do. Newsweek of course is Al Queda's unwitting accomplice. Of course the left has no demonstrated ability to understand when they are being conned so they just lap these lies up.\n ===========================\n \n Al Qaeda Training Manual\n \n \n First, on page 13 in the FIRST LESSON, the manual lists \"Missions Required of the Military Organization\" (\"the Military Organization\" is how Al Qaeda refers to itself in the manual). On this top eight list, sitting at number five, we have:\n \n 5. Spreading rumors and writing statements that instigate people against the enemy.\n \n So Al Qaeda understands the basic purpose of their organization, along with blowing up things, is spreading rumors. NEWSWEaK should also understand that this is pretty much Isikoff's agenda as well.\n \n Now, what things are Al Qaeda members are suppose to do when captured? Again, I refer you to the Traning Manual, Lesson Eighteen, \"Prison and Detention Centers,\" Page 176.\n \n 1. At the beginning of the trial, once more the brothers must insist on proving that torture was inflicted on them by State Security [investigators] before the judge. 2. Complain [to the court] of mistreatment while in prison.\n \n So, before they are even captured, Al Qaeda members are taught to make public accusations of torture. This is not only part of their training, but IT IS THE MOST IMPORTANT THING they are taught to do while in prison. While in prison, \"spreading rumors\" is the only one of their eight missions that they can fulfill. Without independent corroboration, such charges are less than groundless. You might say that they were a planned part of a conspiracy...\n \n (snip)\n \n http://artofwarplus.com/wordpress/index.php?p=436", 
   {
    "post_info": {
     "post_title": "Al Qaeda Training Manual (Newsweek taking tips?)"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1116372540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Al Qaeda Training Manual (Newsweek taking tips?)", 
  "url": "http://www.4forums.com/political/current-events-debates/5280-al-qaeda-training-manual-newsweek-taking-tips.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 5280, 
  "discussion_files": [
   [
    "6623.html", 
    "http://www.4forums.com/political/current-events-debates/5280-al-qaeda-training-manual-newsweek-taking-tips-print.html"
   ]
  ], 
  "identifier": 5280
 }
]