[
 [
  [
   124526, 
   null, 
   "Kronus", 
   "So, it's been one year since gays were allowed to marry in Massachusetts. Alot of people made alot of predictions about what would happen, let's see how those predictions are doing.\n \n If gays are allowed to marry than... \n \n the Apocolypse will come: Nope, doesn't look like it.\n \n the bedrock of society will collapse, morals will disintegrate: No, not yet.\n \n there will be a flood of divorces: Nope, pretty much stable.\n \n we'll slide down the slippery slope towards incest, bestiality, and polygamy: No sliding observed.\n \n I can't think of a single dire prediction the naysayers and doomcriers made that has come to pass. Several thousand gay couples got married, and all that happened was that several thousand families are happier.", 
   {
    "post_info": {
     "post_title": "1 year anniversary"
    }
   }, 
   null, 
   null, 
   1116429300.0
  ], 
  [
   124538, 
   null, 
   "jyoshu", 
   "I think it's equally interesting how so FEW gay couples are now marrying in Massachusetts. There was that rush to the courthouse early on, when there was political gain in it, and then now that it's legal, news reports say its down to a trickle at best. The fad indeed wore off quickly there once the cameras left.\n \n Meanwhile, plenty of marriages between men and women happen every day there.", 
   {}, 
   124526, 
   null, 
   1116431100.0
  ], 
  [
   124545, 
   null, 
   "tonybrown74", 
   "I think it's equally interesting how so FEW gay couples are now marrying in Massachusetts. There was that rush to the courthouse early on, when there was political gain in it, and then now that it's legal, news reports say its down to a trickle at best. The fad indeed wore off quickly there once the cameras left.\n \n Meanwhile, plenty of marriages between men and women happen every day there.\n\n \n Why does the number of same-sex marriages matter? Does it make the fact that there are couples that need the protections of marriage any less significant? Or are you saying that there is some magical threshold number that needs to be obained before someones issues of discrimination is to be take seriously?", 
   {}, 
   124538, 
   null, 
   1116433740.0
  ], 
  [
   124553, 
   null, 
   "jyoshu", 
   "Why does the number of same-sex marriages matter? Does it make the fact that there are couples that need the protections of marriage any less significant? Or are you saying that there is some magical threshold number that needs to be obained before someones issues of discrimination is to be take seriously?\n\n \n No, I'm not saying that at all. In fact it's not the state that isn't taking it seriously, IMO.", 
   {}, 
   124545, 
   null, 
   1116434820.0
  ], 
  [
   124556, 
   null, 
   "tonybrown74", 
   "No, I'm not saying that at all. In fact it's not the state that isn't taking it seriously, IMO.\n\n \n So, you're saying that gay people don't take marriage seriously, because we aren't all rushing to the altar?", 
   {}, 
   124553, 
   null, 
   1116435660.0
  ], 
  [
   124560, 
   null, 
   "jyoshu", 
   "So, you're saying that gay people don't take marriage seriously, because we aren't all rushing to the altar?\n\n \n Well maybe you can answer it--if gay marriage is so important to so many gay people, why aren't more of them rushing to Massachusetts to take advantage of this? Or even the gay couples right there in Massachusetts? One would surely think, given the level of time, vitriol, and social activism put into your movement, that this would be monumental and that all those so many gay couples whom you all said \"can't marry\" would be doing so by now.", 
   {}, 
   124556, 
   null, 
   1116436080.0
  ], 
  [
   124562, 
   null, 
   "Symbiote", 
   "Yeh, and you'd think as a straight person in favour of equal rights for gays, I should jump on a plane to Massachusetts and get married to a man there too. The issue is primarily one of principle.", 
   {}, 
   124560, 
   null, 
   1116436320.0
  ], 
  [
   124571, 
   null, 
   "tonybrown74", 
   "Well maybe you can answer it--if gay marriage is so important to so many gay people, why aren't more of them rushing to Massachusetts to take advantage of this? Or even the gay couples right there in Massachusetts? One would surely think, given the level of time, vitriol, and social activism put into your movement, that this would be monumental and that all those so many gay couples whom you all said \"can't marry\" would be doing so by now.\n\n \n Because the type of committment and responsibility that comes with marriage is a huge step. It should not be taken lightly, Las Vegas style. Many straights trivialize marriage when they do not consider all the responsibilities that come with it. It should be an educated and informed decision, as with eveything else of such life-altering proportions.\n \n That said, just because people aren't rushing to the altar, doesn't mean that they should not have fought for the recognition of that right in the first place. I am a single gay man. I fought just as hard as any committed couple for marriage rights. Why? Because even if one of us (meaning any American) is being denied rights and privileges, then all of us are affected. And who knows how I'd feel a few years down the road? Should I have waited until I needed marriage before fighting for my rights?", 
   {}, 
   124560, 
   null, 
   1116437040.0
  ], 
  [
   124601, 
   null, 
   "JustineCredible", 
   "Well maybe you can answer it--if gay marriage is so important to so many gay people, why aren't more of them rushing to Massachusetts to take advantage of this? Or even the gay couples right there in Massachusetts? One would surely think, given the level of time, vitriol, and social activism put into your movement, that this would be monumental and that all those so many gay couples whom you all said \"can't marry\" would be doing so by now.\n\n \n \n There's a really obvious answer, marriages in Massachusetts aren't portable! Fairly simple.\n If a legal marriage in Mass isn't going to be equally legally recognized in say Illinois, where a specific couple happens to actually reside, then a legal marriage in Mass is basically pointless. \n \n Massechusetts marriage for gays is only applicable in Massechusetts. It's not recognized outside that state, it has no bearing on the federal level. Any rights and protections it may convey aren't recognized equally outside of Massechusetts. \n \n Heck, I don't live in Massechusetts, I live in Illinois...so do most of our friends and family. I have friends in Virginia who aren't making any hasty dash up I95 to Mass either, why? Because a marriage up there doesn't mean diddly where they live!", 
   {}, 
   124560, 
   null, 
   1116439200.0
  ], 
  [
   124607, 
   null, 
   "joebrummer", 
   "By some interesting coincidence, the Rhode Island, Mass's friendly neighbors are holding back to bakc hearings on our gay marriage bills. I watched the Senate hearing on local cable last night, and I will be attending and tesifying before the House Judiciary Committee tonight. Many of the arguments in last night's hearing focused on the fact Rhode Islanders are moving the ten minutes over the border where they are able to get married. They are taking with them their property taxes, sales taxes, and other income the state needs. \n \n Heopfully, this year the bill will not die in committee like previous years. It has much more support in the house than it ever has. Last year we only had 5 co-sponsors this year we have over 50! It has a good chance of going to the full House for a vote, I can't say what I think will happen with the Senate version of the bill, but it does look good!\n \n Wish me luck that I don't studder my way through my testimony!", 
   {}, 
   124601, 
   null, 
   1116440220.0
  ], 
  [
   124611, 
   null, 
   "JustineCredible", 
   "By some interesting coincidence, the Rhode Island, Mass's friendly neighbors are holding back to bakc hearings on our gay marriage bills. I watched the Senate hearing on local cable last night, and I will be attending and tesifying before the House Judiciary Committee tonight. Many of the arguments in last night's hearing focused on the fact Rhode Islanders are moving the ten minutes over the border where they are able to get married. They are taking with them their property taxes, sales taxes, and other income the state needs. \n \n Heopfully, this year the bill will not die in committee like previous years. It has much more support in the house than it ever has. Last year we only had 5 co-sponsors this year we have over 50! It has a good chance of going to the full House for a vote, I can't say what I think will happen with the Senate version of the bill, but it does look good!\n \n Wish me luck that I don't studder my way through my testimony!\n\n \n \n Good luck and God's Speed!!!", 
   {}, 
   124607, 
   null, 
   1116440340.0
  ], 
  [
   124620, 
   null, 
   "Kronus", 
   "\n Massechusetts marriage for gays is only applicable in Massechusetts. It's not recognized outside that state, it has no bearing on the federal level. Any rights and protections it may convey aren't recognized equally outside of Massechusetts. \n \n\n \n Don't be so sure about that. Right now Mass has a law on the books saying that if you can't get married in your home state, you can't get married in Mass. So technically Mass isn't supposed to marry gays from most other states.\n \n Let's suppose that law gets overturned, then what happens? Can other states refuse to recognise Mass marriages? IANAL, but I don't think so. Right now straights can go to Vegas and get married even if they couldn't get married in their home states, and the marriage must be recognized when they return home. Section 10, clause 1 of the US constitution says, among other things, that no state may impair the obligations of contracts. This means, among other things, that if a state marries two people, no other state can say they aren't married. Illinois may choose to not perform gay marriages, but they'll have to recognize gay marriages that are legally perfromed in another state. Anyway, that's how I see it. I don't suppose we have any Constitional lawyers around who would care to comment on this analysis?\n \n Edit:\n We also have Article 4, section 1, which is even more relevant:\n Full Faith and Credit shall be given in each State to the public Acts, Records, and judicial Proceedings of every other State.", 
   {}, 
   124601, 
   null, 
   1116441420.0
  ], 
  [
   124637, 
   null, 
   "Jo Bennett", 
   "What the hell does the take up of same sex marriage have to do with anything? I suppose all black people should have married whites after interracial marriage was legalised?", 
   {}, 
   124620, 
   null, 
   1116444300.0
  ], 
  [
   124663, 
   null, 
   "Voice Of Reason", 
   "Well maybe you can answer it--if gay marriage is so important to so many gay people, why aren't more of them rushing to Massachusetts to take advantage of this? Or even the gay couples right there in Massachusetts? One would surely think, given the level of time, vitriol, and social activism put into your movement, that this would be monumental and that all those so many gay couples whom you all said \"can't marry\" would be doing so by now.\n\n \n \n Because except for a few militant gays and liberals most gay couples just flat don't care...........They just want to love their life in peace and harmony just like everyone else and are embarrassed by the notoriety by about by the same militants........", 
   {}, 
   124560, 
   null, 
   1116446760.0
  ], 
  [
   124664, 
   null, 
   "MrWriteLA", 
   "One would think that the smaller the percentage of same-sex partners actually taking advantage of being able to legally marry, the smaller the threat to the \"sanctity of the institution.\"\n \n But I guess some people are just never satisfied.\n \n \"My, the food here is just awful!\"\n \"Yes, and such small helpings!\"", 
   {}, 
   124637, 
   null, 
   1116446820.0
  ], 
  [
   124666, 
   null, 
   "Voice Of Reason", 
   "What the hell does the take up of same sex marriage have to do with anything? I suppose all black people should have married whites after interracial marriage was legalised?\n\n \n \n That is and insult to all African Americans and their fight for equal rights.......", 
   {}, 
   124637, 
   null, 
   1116447060.0
  ], 
  [
   124688, 
   null, 
   "JustineCredible", 
   "That is and insult to all African Americans and their fight for equal rights.......\n\n \n How? \n \n I've already shown to you that MANY black civil leaders back same sex marriage...\n \n How is it you are so incenced by this?\n \n Are you black?", 
   {}, 
   124666, 
   null, 
   1116451620.0
  ], 
  [
   124691, 
   null, 
   "tonybrown74", 
   "Because except for a few militant gays and liberals most gay couples just flat don't care...........They just want to love their life in peace and harmony just like everyone else and are embarrassed by the notoriety by about by the same militants........\n\n \n Oh yeah! That's it!\n \n If it weren't for those \"militant gays\" there would be no marriage rights in the first place. I guess we should have just grovelled at the feet of our hetero masters and waited and waited and waited until some measly crumblets were dropped from the table.\n \n Clueless.\n \n Every right, every bit of recognition, every creep towards equality has been won because militants, whether the be gay, black, women, whatever, fought tooth and nail for them. Some have edured ridicule, others beaten and hosed, and some were even killed, countless others jailed, jobs lossed, homes vandalised and others spat on just to win some sort of basic recognition.\n \n You feel that you need to call us militant in order to win a cheap point, then you go ahead. I know that those couples who could not be there because they had to watch their kids, or had to stay at work to make ends meet, appreciated what I (and many others) sacrificed for them.", 
   {}, 
   124663, 
   null, 
   1116452280.0
  ], 
  [
   124692, 
   null, 
   "tonybrown74", 
   "How? \n \n I've already shown to you that MANY black civil leaders back same sex marriage...\n \n How is it you are so incenced by this?\n \n Are you black?\n\n \n He insults every black person by assuming to know what any of us have gone through and speaking as if he's an authority on black people.", 
   {}, 
   124688, 
   null, 
   1116452400.0
  ], 
  [
   124696, 
   null, 
   "Kronus", 
   "He insults every black person by assuming to know what any of us have gone through and speaking as if he's an authority on black people.\n\n \n Actually it's just a standard debate trick. If you can't defend your position, change the topic.", 
   {}, 
   124692, 
   null, 
   1116453000.0
  ], 
  [
   124761, 
   null, 
   "Voice Of Reason", 
   "How? \n \n I've already shown to you that MANY black civil leaders back same sex marriage...\n \n How is it you are so incenced by this?\n \n Are you black?\n\n \n And many don't..........One of the major reasons President Bush was re elected and carried the key state of Ohio was the African American vote and the gay marriage issue..........I would go as far as to say that if not for that issue he probably would not have carried the state and been Re elected.........\n \n \n \n\n Are you black?\n \n \n No I am not, but I respect the African American fight for equal rights and to compare it to the gay right issue is ridiculous........\n \n \n \n \nActually it's just a standard debate trick. If you can't defend your position, change the topic.\n \n \n Ah but I did not change the topic..........The militants did...........", 
   {}, 
   124688, 
   null, 
   1116457320.0
  ], 
  [
   124818, 
   null, 
   "Nurglitch", 
   "It's a combination of factors such as the sanctity of marriage (no point in rushing into such a serious business), the relative scarcity of gays and lesbians, the relative meaninglessness of getting married in Mass. such as when your rights are limited to the rights provided by the state and non-transferable. Once you've narrowed it down, it's no wonder that there's only a trickle of people lining up to get married in Mass.\n \nAnd many don't. One of the major reasons President Bush was re elected and carried the key state of Ohio was the African American vote and the gay marriage issue. I would go as far as to say that if not for that issue he probably would not have carried the state and been Re elected.\n If you look at the official breakdown of numbers, and especially with the differences between the 2000 and 2004 presidential elections, you'll find out that the tie-breaker was people earning 200k+ a year - people who directly benefitted from the Bush tax cuts. Bush carried Ohio on what really matters - money. \n \nNo I am not, but I respect the African American fight for equal rights and to compare it to the gay right issue is ridiculous.\n You can certainly make ridiculous comparisons, but there are also important intersections between any two civil rights issues.", 
   {}, 
   124664, 
   null, 
   1116462600.0
  ], 
  [
   124875, 
   null, 
   "Voice Of Reason", 
   "You know We on the right should probably thank the Gay militant Agenda and those activist judges in Mass. because without them and the backlash caused by there activism President Bush would have never carried the state of Ohio and been re elected President in 2004.........", 
   {}, 
   124818, 
   null, 
   1116470280.0
  ], 
  [
   124894, 
   null, 
   "wsm2506", 
   "I think it's equally interesting how so FEW gay couples are now marrying in Massachusetts. There was that rush to the courthouse early on, when there was political gain in it, and then now that it's legal, news reports say its down to a trickle at best. The fad indeed wore off quickly there once the cameras left.\n \n Meanwhile, plenty of marriages between men and women happen every day there.\n\n \n Well, IF your assumption of <1% gay people, why should you be suprised?\n \n What good would it do me for Ron and I to move to MA. and have another ceremony if it is not recognized in our state of residence?", 
   {}, 
   124538, 
   null, 
   1116475500.0
  ], 
  [
   124895, 
   null, 
   "wsm2506", 
   "Well maybe you can answer it--if gay marriage is so important to so many gay people, why aren't more of them rushing to Massachusetts to take advantage of this? Or even the gay couples right there in Massachusetts? One would surely think, given the level of time, vitriol, and social activism put into your movement, that this would be monumental and that all those so many gay couples whom you all said \"can't marry\" would be doing so by now.\n\n \n See previous post.", 
   {}, 
   124560, 
   null, 
   1116475620.0
  ], 
  [
   124896, 
   null, 
   "wsm2506", 
   "That is and insult to all African Americans and their fight for equal rights.......\n\n \n And YOU, madam, are an insult to all humanity.", 
   {}, 
   124666, 
   null, 
   1116475920.0
  ], 
  [
   124902, 
   null, 
   "Kronus", 
   "You know We on the right should probably thank the Gay militant Agenda and those activist judges in Mass. because without them and the backlash caused by there activism President Bush would have never carried the state of Ohio and been re elected President in 2004.........\n\n \n So you admit that Bush doesn't deserve to be president based on his own abilities? How nice.\n \n <covers face to avoid spray as VOR backpedals<", 
   {}, 
   124875, 
   null, 
   1116476880.0
  ], 
  [
   124923, 
   null, 
   "JustineCredible", 
   "You know We on the right should probably thank the Gay militant Agenda and those activist judges in Mass. because without them and the backlash caused by there activism President Bush would have never carried the state of Ohio and been re elected President in 2004.........\n\n \n Um, is the \"Gay militant Agenda\" different than the \"gay agenda\" or the \"militant gay agenda\" of which those on the \"Right\" like to tout? \n I'm curious because I never recieved my copy of any of those \"agendi.\" I've heard a lot of hearsay on the \"gay agenda\" but as I said, I never recieved a copy of this supposed \"agenda\" so I really cannot comment. \n If you have some information on this I'm sure I'm not the only one who would like if you would share it. \n \n emoticon_rolleyes", 
   {}, 
   124875, 
   null, 
   1116485400.0
  ], 
  [
   124976, 
   null, 
   "tonybrown74", 
   "Justine, since you have obviously lost your copy of the Militant Gay Agenda (TM), let me remind you that there is a Take-Over of World Financial Institutions Meeting promptly at 2:30(ish) followed by a mandatory Softball game - just for the lesbians - at 5:00pm. The gay men will be attending an afternoon High Tide Tea Dance at 5:15. :p", 
   {}, 
   124923, 
   null, 
   1116517740.0
  ], 
  [
   125005, 
   null, 
   "JustineCredible", 
   "Justine, since you have obviously lost your copy of the Militant Gay Agenda (TM), let me remind you that there is a Take-Over of World Financial Institutions Meeting promptly at 2:30(ish) followed by a mandatory Softball game - just for the lesbians - at 5:00pm. The gay men will be attending an afternoon High Tide Tea Dance at 5:15. :p\n\n \n \n OH well that figures, only AFTER I've donated my cleats to the \"Baby Dykes Foundation\" do they suddenly decide to have a softball game!! \n \n GRRRRR emoticon_mad", 
   {}, 
   124976, 
   null, 
   1116521760.0
  ], 
  [
   125070, 
   null, 
   "tonybrown74", 
   "OH well that figures, only AFTER I've donated my cleats to the \"Baby Dykes Foundation\" do they suddenly decide to have a softball game!! \n \n GRRRRR emoticon_mad\n\n \n I guess you must have missed the Indoctrinate Our Nation's Youth Conference Call that was at 11:00 AM emoticon_xclown", 
   {}, 
   125005, 
   null, 
   1116527760.0
  ], 
  [
   125116, 
   null, 
   "JustineCredible", 
   "I guess you must have missed the Indoctrinate Our Nation's Youth Conference Call that was at 11:00 AM emoticon_xclown\n\n \n No, I missed that too...I was busy working with Catholic Priests on tactical manuvers. ;)", 
   {}, 
   125070, 
   null, 
   1116532440.0
  ], 
  [
   125136, 
   null, 
   "tonybrown74", 
   "No, I missed that too...I was busy working with Catholic Priests on tactical manuvers. ;)\n\n \n ROFLMAO!!!", 
   {
    "post_info": {
     "post_title": "Coke-On-Monitor-Alert!!!"
    }
   }, 
   125116, 
   null, 
   1116534300.0
  ], 
  [
   125167, 
   null, 
   "Nurglitch", 
   "You know We on the right should probably thank the Gay militant Agenda and those activist judges in Mass. because without them and the backlash caused by there activism President Bush would have never carried the state of Ohio and been re elected President in 2004.[sic]\n As I pointed out, the numbers available suggest that President Bush was re-elected on the strength of his tax cuts rather than on the issue of gay rights. \n \n Here's the raw data: http://www.washingtonpost.com/wp-srv/politics/elections/2004/graphics/exitPolls_ohio.html", 
   {}, 
   125005, 
   null, 
   1116536580.0
  ], 
  [
   125301, 
   null, 
   "gnojek", 
   "MMMMM, tax cuts.", 
   {
    "post_info": {
     "attachments": 1
    }
   }, 
   125167, 
   null, 
   1116548040.0
  ], 
  [
   125326, 
   null, 
   "Nurglitch", 
   "The great thing about the tax cuts is all you had to do to be qualified for them is earn 200k+ a year. There's a reason the Log Cabin Republicans exist, and that's because affluent gays and lesbians exist, and find their pocket-books mattering slightly more than whatever mealy-mouthed waffling John Kerry had to offer on gay rights. More to the point the effect of tax cuts are easily seen and felt than vague social legislation.", 
   {}, 
   125301, 
   null, 
   1116549960.0
  ], 
  [
   125366, 
   null, 
   "wsm2506", 
   "He insults every black person by assuming to know what any of us have gone through and speaking as if he's an authority on black people.\n\n \n He insults everyone. I think it is his reason de'etre.", 
   {}, 
   124692, 
   null, 
   1116554460.0
  ], 
  [
   125533, 
   null, 
   "jyoshu", 
   "The great thing about the tax cuts is all you had to do to be qualified for them is earn 200k+ a year. There's a reason the Log Cabin Republicans exist, and that's because affluent gays and lesbians exist,\n\n \n I would dare say there are a lot more \"affluent\" Democrat gays then affluent Republican gays. \n \n The idea of associating Republicans with wealth and not Democrats is a myth. Ever heard of George Soros?", 
   {}, 
   125326, 
   null, 
   1116605280.0
  ], 
  [
   126061, 
   null, 
   "Nurglitch", 
   "Oh there are definitely wealthy Democrats, although I don't know if there are more wealthy gay Democrats or wealthy gay Republicans. I'd bet on the latter, but I don't know for sure. \n \n But if I were a wealthy American I would vote for the guy that is against gay marriage and pro-tax cuts (Bush) rather than for the guy that is against gay marriage and against tax cuts as well (Kerry).\n \n A side note: Yes, I have heard of George Soros. It's pretty interesting how he's dropped out of sight since January. I didn't know he was a registered Democrat though - I thought he was just anti-Bush.", 
   {}, 
   125533, 
   null, 
   1116701340.0
  ], 
  [
   126172, 
   null, 
   "wsm2506", 
   "Well maybe you can answer it--if gay marriage is so important to so many gay people, why aren't more of them rushing to Massachusetts to take advantage of this? \n\n \n Because it is only valid in Mass. No portability like your marriage.", 
   {}, 
   124560, 
   null, 
   1116712800.0
  ], 
  [
   126180, 
   null, 
   "Kronus", 
   "Because it is only valid in Mass. No portability like your marriage.\n\n \n The state of Massachusetts will not issue marriage licenses to out of state gays. There's an old law on the book, dating from segregation times, that says that Mass won't give licenses to people who can't get married in their own states. Sort of the opposite of Vegas. The govenor has instructed that this law, which has been ignored for decades, be applied to gays.", 
   {}, 
   126172, 
   null, 
   1116713340.0
  ], 
  [
   126187, 
   null, 
   "Nurglitch", 
   "The govenor has instructed that this law, which has been ignored for decades, be applied to gays.\n That's nice of him. It'll help prevent those awkward situations where people thought that their marriages were valid.", 
   {}, 
   126180, 
   null, 
   1116713820.0
  ], 
  [
   126195, 
   null, 
   "Kronus", 
   "That's nice of him. It'll help prevent those awkward situations where people thought that their marriages were valid.\n\n \n That's the interesting thing now, isn't it. The Constitution seems to be quite clear about this point. If you get married in one state, another state does not have the right to say that you aren't married. At least, as clearly as I can tell, and I make no claims to being a Constitutional lawyer. However, there it is, and I expect we'll being seeing this point work it's way up the legal ladders soon. States may decide who they'll give marriage licenses to, but that can't say that a legal marriage performed in another state doesn't count.", 
   {}, 
   126187, 
   null, 
   1116714720.0
  ], 
  [
   126205, 
   null, 
   "Nurglitch", 
   "If the law exists, and hasn't been struck down, then it seems likely that it's constitutional. Now if my memory isn't mistaken, there are new laws on the books of many states that prohibit the recognition of out-of-state same-sex marriages. Because these haven't been struck down, yet, it seems like such laws may be somehow constitutional. Or it could just be that no-one has gotten around to testing their constitutionality.", 
   {}, 
   126195, 
   null, 
   1116716220.0
  ], 
  [
   126268, 
   null, 
   "Kronus", 
   "If the law exists, and hasn't been struck down, then it seems likely that it's constitutional. Now if my memory isn't mistaken, there are new laws on the books of many states that prohibit the recognition of out-of-state same-sex marriages. Because these haven't been struck down, yet, it seems like such laws may be somehow constitutional. Or it could just be that no-one has gotten around to testing their constitutionality.\n\n \n Your last point is dead on. The only way a law can be ruled unconstitutional is if someone challenges it, loses, appeals, etc,etc, and it works its way up to the supreme court. Gay marriage has only been an option for one year in one state, and no one out of that state (who's gay of course) can get married there. First the Mass law keeping out of state gays from getting married will need to be repealed. That's in the works. Then some couple will have to decide they want to be a test case. They'll go to Mass, get married, go home, and be told that their marriage isn't recognized. Then the legal jousting starts.", 
   {}, 
   126205, 
   null, 
   1116724560.0
  ], 
  [
   126290, 
   null, 
   "wsm2506", 
   "That's the interesting thing now, isn't it. The Constitution seems to be quite clear about this point. If you get married in one state, another state does not have the right to say that you aren't married. At least, as clearly as I can tell, and I make no claims to being a Constitutional lawyer. However, there it is, and I expect we'll being seeing this point work it's way up the legal ladders soon. States may decide who they'll give marriage licenses to, but that can't say that a legal marriage performed in another state doesn't count.\n\n \n The DOMA tries, among other things, to say that individual states do not have to recognize same sex marriages or unions from another state. In doing so, it tries to circumvent the constitution, which is only one aspect of the unconstitutionality of the DOMA.", 
   {}, 
   126195, 
   null, 
   1116725760.0
  ], 
  [
   126292, 
   null, 
   "Voice Of Reason", 
   "So you admit that Bush doesn't deserve to be president based on his own abilities? How nice.\n \n <covers face to avoid spray as VOR backpedals<\n\n \n \n All I know is the Liberal media and liberals like you had this country going to hell in a handbasket prior to the 2004 elections and this president won by 3,000,000 votes and gained votes in every state he won in 2000, plus he carried increases in both the house and the senate, something that had been done in 50 years so he must be doing something right..........\n \n You liberals think this president is dumb....We conservatives think he is dumb like a fox...........", 
   {}, 
   124902, 
   null, 
   1116726000.0
  ], 
  [
   126293, 
   null, 
   "Nurglitch", 
   "Sounds like a royal hassle that'll cost a mountain of cash. I'd suggest that money is better spent in moving to Canada where same-sex marriage is recognized, constitutionally protected, and not really an issue any more.", 
   {}, 
   126290, 
   null, 
   1116726000.0
  ], 
  [
   126294, 
   null, 
   "Voice Of Reason", 
   "As I pointed out, the numbers available suggest that President Bush was re-elected on the strength of his tax cuts rather than on the issue of gay rights. \n \n Here's the raw data: http://www.washingtonpost.com/wp-srv/politics/elections/2004/graphics/exitPolls_ohio.html\n\n \n \n The state that swung the elction to President Bush was Ohio which passed a ban to gay marriage constitutional amendment by a huge margin........He also made great gains with African Americans in that state who were stongly against gay marriage..........\n \n You do the math my friend...........", 
   {}, 
   125167, 
   null, 
   1116726180.0
  ], 
  [
   126298, 
   null, 
   "Nurglitch", 
   "All I know is the Liberal media and liberals like you had this country going to hell in a handbasket prior to the 2004 elections and this president won by 3,000,000 votes and gained votes in every state he won in 2000, plus he carried increases in both the house and the senate, something that had been done in 50 years so he must be doing something right.\n Funny, up here in Canada we were amazed at the inability of the American media to fault the President for anything more than talking funny. Given the Democrats' inability to organize, their lack of platform, and absent charisma, it's a wonder that Bush didn't win more. \n \n Honestly, with opponents like the Democrats, it'll be a wonder if President Bush isn't elected again in 2008!*\n \n *This is hyperbole, by the by.", 
   {}, 
   126293, 
   null, 
   1116726360.0
  ], 
  [
   126299, 
   null, 
   "wsm2506", 
   "The state that swung the elction to President Bush was Ohio which passed a ban to gay marriage constitutional amendment by a huge margin........He also made great gains with African Americans in that state who were stongly against gay marriage..........\n \n You do the math my friend...........\n\n \n You are assuming a connection there that probably doesn't exist, and offer only your opinion. Try comparing the margins on Bush's victory and the amendment.", 
   {}, 
   126294, 
   null, 
   1116726480.0
  ], 
  [
   126301, 
   null, 
   "Nurglitch", 
   "The state that swung the elction to President Bush was Ohio which passed a ban to gay marriage constitutional amendment by a huge margin........He also made great gains with African Americans in that state who were stongly against gay marriage..........\n \n You do the math my friend.\n I did the math. The math unambiguously states that it was voters earning 200k+ a year that made the difference.", 
   {}, 
   126298, 
   null, 
   1116726540.0
  ], 
  [
   126306, 
   null, 
   "Voice Of Reason", 
   "Funny, up here in Canada we were amazed at the inability of the American media to fault the President for anything more than talking funny. Given the Democrats' inability to organize, their lack of platform, and absent charisma, it's a wonder that Bush didn't win more. \n \n Honestly, with opponents like the Democrats, it'll be a wonder if President Bush isn't elected again in 2008!*\n \n *This is hyperbole, by the by.\n\n \n The Liberal media here in the U.S. constantly preached on how bad the economy was and how bad things were going in Iraq.......In addition they kept harping about how low President Bush's approval rating was and that no president has ever got re elected with an approval rating of 50 percent or below........\n \n Well there has now.............", 
   {}, 
   126298, 
   null, 
   1116726960.0
  ], 
  [
   126308, 
   null, 
   "Voice Of Reason", 
   "You are assuming a connection there that probably doesn't exist, and offer only your opinion. Try comparing the margins on Bush's victory and the amendment.\n\n \n Well if you want to ignore the facts and can't do the math I can't help you.........", 
   {}, 
   126299, 
   null, 
   1116727080.0
  ], 
  [
   126309, 
   null, 
   "Voice Of Reason", 
   "I did the math. The math unambiguously states that it was voters earning 200k+ a year that made the difference.\n\n \n you got any links to back that up?..........", 
   {}, 
   126301, 
   null, 
   1116727140.0
  ], 
  [
   126316, 
   null, 
   "wsm2506", 
   "you got any links to back that up?..........\n\n \n How about you? Where are the links to back up your opinion? (I don't recall ever seeing you back up anything, but I may be wrong).", 
   {}, 
   126309, 
   null, 
   1116727560.0
  ], 
  [
   126324, 
   null, 
   "Voice Of Reason", 
   "How about you? Where are the links to back up your opinion? (I don't recall ever seeing you back up anything, but I may be wrong).\n\n \n ah, the question was not for you. but if you don't believe that Ohio was the key state and that their Constitutional Amendment and African Americans had nothing to do with swinging the state to President Bush then you are living in a fantasy world my friend..........", 
   {}, 
   126316, 
   null, 
   1116728160.0
  ], 
  [
   126492, 
   null, 
   "wsm2506", 
   "ah, the question was not for you. but if you don't believe that Ohio was the key state and that their Constitutional Amendment and African Americans had nothing to do with swinging the state to President Bush then you are living in a fantasy world my friend..........\n\n \n As usual, you offer nothing but unfounded personal opinion. emoticon_rolleyes Can I try some of whatever it is you are smoking?", 
   {}, 
   126324, 
   null, 
   1116771240.0
  ], 
  [
   126521, 
   null, 
   "JustineCredible", 
   "ah, the question was not for you. but if you don't believe that Ohio was the key state and that their Constitutional Amendment and African Americans had nothing to do with swinging the state to President Bush then you are living in a fantasy world my friend..........\n\n \n Who cares who the question was for? Really, is it necessary for you to be such an arse about it? I don't see anything in the rules that says one must \"wait to reply until spoken to\". You just can't stand it when anyone can prove you wrong. The really ironic thing is, everyone does.", 
   {}, 
   126324, 
   null, 
   1116773940.0
  ], 
  [
   126524, 
   null, 
   "JustineCredible", 
   "Funny, up here in Canada we were amazed at the inability of the American media to fault the President for anything more than talking funny. Given the Democrats' inability to organize, their lack of platform, and absent charisma, it's a wonder that Bush didn't win more. \n \n Honestly, with opponents like the Democrats, it'll be a wonder if President Bush isn't elected again in 2008!*\n \n *This is hyperbole, by the by.\n\n \n Oh don't worry, with as many of the Bush clan who are in politics, it's probably not that far fetched after all.", 
   {}, 
   126298, 
   null, 
   1116774060.0
  ], 
  [
   126561, 
   null, 
   "Nurglitch", 
   "you got any links to back that up?.\nI provided one in post #34, and here's similar numbers for 2000: http://www.msnbc.com/m/d2k/g/polls.asp?office=P&state=OH", 
   {}, 
   126524, 
   null, 
   1116782160.0
  ], 
  [
   126624, 
   null, 
   "jyoshu", 
   "Funny, up here in Canada we were amazed at the inability of the American media to fault the President for anything more than talking funny.\n\n \n Then you haven't watched our news very much at all. They've been on the attack against him since the day he was elected the first time, with the exception of right after 9/11 when they actually supported him for a bit.", 
   {}, 
   126298, 
   null, 
   1116787200.0
  ], 
  [
   126655, 
   null, 
   "Nurglitch", 
   "Then you haven't watched our news very much at all. They've been on the attack against him since the day he was elected the first time, with the exception of right after 9/11 when they actually supported him for a bit.\n I read quite a bit of American news - always good to know what the elephant on the continent is up to. Depending on the media outlet, Bush was either praised, or was made fun of. Nobody seemed interested in making an intelligent critique of his policies, or discussing his performance as President (possibly because he's done a rather good job). Plenty of people were willing to point out that the Emperor had no clothes, and many were content to be the 'royal fart catchers' but none were willing to discuss his job performance. To be honest I found more critical discussion of his policies in the foreign media.", 
   {}, 
   126624, 
   null, 
   1116789360.0
  ], 
  [
   126859, 
   null, 
   "Voice Of Reason", 
   "As usual, you offer nothing but unfounded personal opinion. emoticon_rolleyes Can I try some of whatever it is you are smoking?\n\n \n I followed the 2004 elections very close.............Unlike you I know what state swung the election for the president........I also know that President Bush made huge gains in the African American Vote..........I know a constitutional amendment was passed by a huge majority in Ohio............\n \n I klnow the dems thought they would carry that state..........That is all I need to know...........", 
   {}, 
   126492, 
   null, 
   1116807960.0
  ], 
  [
   126861, 
   null, 
   "Voice Of Reason", 
   "Funny, up here in Canada we were amazed at the inability of the American media to fault the President for anything more than talking funny. Given the Democrats' inability to organize, their lack of platform, and absent charisma, it's a wonder that Bush didn't win more. \n \n Honestly, with opponents like the Democrats, it'll be a wonder if President Bush isn't elected again in 2008!*\n \n *This is hyperbole, by the by.\n\n \n Youe ver read the New York or the LA times? Aw nevermind.........", 
   {}, 
   126298, 
   null, 
   1116808080.0
  ], 
  [
   126863, 
   null, 
   "Voice Of Reason", 
   "Oh don't worry, with as many of the Bush clan who are in politics, it's probably not that far fetched after all.\n\n \n Boy if Jeb Bush was to get elected president in 2008 that would really stick in the craws of you liberals...................\n \n I would not rule it out.....Boy that would be fun to see......\n \n Maybe you all can threaten to move to Canada again if that happens...We can only wish............. :)", 
   {}, 
   126524, 
   null, 
   1116808320.0
  ], 
  [
   126903, 
   null, 
   "jitobear", 
   "Boy if Jeb Bush was to get elected president in 2008 that would really stick in the craws of you liberals...................\n \n I would not rule it out.....Boy that would be fun to see......\n \n Maybe you all can threaten to move to Canada again if that happens...We can only wish............. :)\n\n \n Oh - I would not be surprised. I fully believe the Bushes will keep winning....whatever it takes. (Any resemblamce to an implication of crooked dealing by the Bush family is entirely puposeful.)", 
   {}, 
   126863, 
   null, 
   1116813960.0
  ], 
  [
   126927, 
   null, 
   "Voice Of Reason", 
   "Oh - I would not be surprised. I fully believe the Bushes will keep winning....whatever it takes. (Any resemblamce to an implication of crooked dealing by the Bush family is entirely puposeful.)\n\n \n Sounds like sour grapes to me........... :)", 
   {}, 
   126903, 
   null, 
   1116819000.0
  ], 
  [
   126937, 
   null, 
   "joebrummer", 
   "Sounds like sour grapes to me........... :)\n\n \n \n Then I would only guess you don't really understand the concept of Sour grapes.", 
   {}, 
   126927, 
   null, 
   1116820800.0
  ], 
  [
   127015, 
   null, 
   "Voice Of Reason", 
   "Then I would only guess you don't really understand the concept of Sour grapes.\n\n \n You will never know............ :)", 
   {}, 
   126937, 
   null, 
   1116828900.0
  ], 
  [
   127122, 
   null, 
   "jyoshu", 
   "Boy if Jeb Bush was to get elected president in 2008 that would really stick in the craws of you liberals...................\n \n I would not rule it out.....Boy that would be fun to see......\n \n Maybe you all can threaten to move to Canada again if that happens...We can only wish............. :)\n\n \n Jeb would indeed make a good president, but he's already ruled out running.\n \n I hear McCain might run again. Bill Frist as well.\n \n I think Condi Rice would be a great pick, but I think she may have also said she was not going to at this point.", 
   {}, 
   126863, 
   null, 
   1116859080.0
  ], 
  [
   127125, 
   null, 
   "jyoshu", 
   "I read quite a bit of American news - always good to know what the elephant on the continent is up to. Depending on the media outlet, Bush was either praised, or was made fun of. Nobody seemed interested in making an intelligent critique of his policies, or discussing his performance as President (possibly because he's done a rather good job). Plenty of people were willing to point out that the Emperor had no clothes, and many were content to be the 'royal fart catchers' but none were willing to discuss his job performance. To be honest I found more critical discussion of his policies in the foreign media.\n\n \n I think it is probably because many people here ae pretty much aware of his policies--there's little need for the media to have to rehash them. People tend to make up their minds. Nevertheless I have heard his policies discussed in the media many times. American press tries to put on an objective front, although they usually aren't very successful.", 
   {}, 
   126655, 
   null, 
   1116860400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  1 year anniversary", 
  "url": "http://www.4forums.com/political/gay-rights-debates/5289-1-year-anniversary.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 5289, 
  "discussion_files": [
   [
    "21923.html", 
    "http://www.4forums.com/political/gay-rights-debates/5289-1-year-anniversary-print.html"
   ], 
   [
    "21924.html", 
    "http://www.4forums.com/political/gay-rights-debates/5289-1-year-anniversary-5-print.html"
   ], 
   [
    "21925.html", 
    "http://www.4forums.com/political/gay-rights-debates/5289-1-year-anniversary-4-print.html"
   ], 
   [
    "21926.html", 
    "http://www.4forums.com/political/gay-rights-debates/5289-1-year-anniversary-3-print.html"
   ], 
   [
    "21927.html", 
    "http://www.4forums.com/political/gay-rights-debates/5289-1-year-anniversary-2-print.html"
   ]
  ], 
  "identifier": 5289
 }
]