[
 [
  [
   125014, 
   null, 
   "Missouri Mule", 
   "\n \n \"The day will come when we will rule America. The day will come when we will rule Britain and the entire world - except for the Jews. The Jews will not enjoy a life of tranquillity under our rule because they are treacherous by nature, as they have been throughout history. The day will come when everything will be relieved of the Jews - even the stones and trees which were harmed by them. Listen to the Prophet Muhammad, who tells you about the evil end that awaits Jews. The stones and trees will want the Muslims to finish off every Jew.\"\n \n What is there to say? Have I not said that these fanatics are the heirs of Hitler's Nazis? Truly the \"Cult of Death.\"\n ==============================\n May 19, 2005\n Bashing Newsweek\n By DAVID BROOKS\n \n Maybe it won't be so bad being cut off from the blogosphere. I look around the Web these days and find that Newsweek's retracted atrocity story has sent everybody into cloud-cuckoo-land. Every faction up and down the political spectrum has used the magazine's blunder as a chance to open fire on its favorite targets, turning this into a fevered hunting season for the straw men.\n \n Many of my friends on the right have decided that the Newsweek episode exposes the rotten core of the liberal media. Dennis Prager, who is intelligent 99 percent of the time, writes, \"Newsweek is directly responsible for the deaths of innocents and for damaging America.\" Countless conservatives say the folks at Newsweek were quick to believe the atrocity tales because they share the left-wing, post-Vietnam mentality. On his influential blog, Austin Bay writes that the coastal media \"presume the worst about the U.S. military - always make that presumption.\"\n \n Excuse me, guys, but this is craziness. I used to write for Newsweek. I know Mike Isikoff and the editors. And I know about liberals in the media. The people who run Newsweek are not a bunch of Noam Chomskys with laptops. Not even close. Whatever might have been the cause of their mistakes, liberalism had nothing to do with it.\n \n Meanwhile, the left side of the blogosphere has erupted with fury over the possibility that American interrogators might not have flushed a Koran down the toilet. The Nation and leftish Web sites are in a frenzy to prove that the story is probably true even if Newsweek is retracting it.\n \n This, too, is unhinged. Would it be illegal for more people on the left to actually be happy that a story slurring Americans may turn out to be unproven? Could there be a few more liberals willing to admit that prisoners routinely lie about their treatment? (Do we expect them to say their time in captivity wasn't so bad?)\n \n Then I click my mouse over to the transcripts of administration statements and I can't believe what I'm seeing. We're in the middle of an ideological war against people who want to destroy us, and what have the most powerful people on earth become? Whining media bashers. They're attacking Newsweek while bending over backward to show sensitivity to the Afghans who just went on a murderous rampage.\n \n Talk about the bigotry of low expectations.\n \n Maybe we should all focus on what's important. Newsweek's little item was seized and exploited by America's enemies in a way that was characteristically cynical, delusional and fascistic.\n \n The people who seized upon this item, like the radical clerics in Afghanistan, are cynical in the way they manipulate episodes like this to whip up hatred and so magnify their own standing.\n \n At the same time, they believe everything that could be alleged about America - and more. They've spent so many years inhabiting a delusional mental landscape filled with conspiracy theories and paranoia that you could drill deep into their minds without ever touching reality.\n \n Finally, they are strategically ruthless. Jeffrey Goldberg of The New Yorker, who has spent years reporting on extremists, says they use manufactured spasms of hatred to desensitize their followers. After followers spend a few years living through rabid riots and vicious sermons, killing an American or a Jew or even a fellow Muslim seems no more consequential than killing a mosquito. That's how suicide bombers are made.\n \n The rioters are the real enemy, not Newsweek and not the American soldiers serving as prison guards. Just to restore some proper perspective, let me quote a snippet from a sermon delivered by Sheik Ibrahim Mudeiris, which ran last weekend on the Palestinian Authority's official TV station:\n \n \"The day will come when we will rule America. The day will come when we will rule Britain and the entire world - except for the Jews. The Jews will not enjoy a life of tranquillity under our rule because they are treacherous by nature, as they have been throughout history. The day will come when everything will be relieved of the Jews - even the stones and trees which were harmed by them. Listen to the Prophet Muhammad, who tells you about the evil end that awaits Jews. The stones and trees will want the Muslims to finish off every Jew.\"\n \n These are the extremists, the real enemy. Let's keep our eye on the ball...\n \n http://www.nytimes.com/2005/05/19/opinion/19brooks.html?hp", 
   {
    "post_info": {
     "post_title": "Bashing Newsweek"
    }
   }, 
   null, 
   null, 
   1116522660.0
  ], 
  [
   125020, 
   null, 
   "SteveRogers", 
   "I know this fellow. Stands on the corner everyday ranting about how he is going to own the county. He is going to be rich and own it all. Now one day he may do something and hurt someone, whose to say. But it is clear he will never own much of anything let alone the county.\n \n Unless we lose control of ourselfs and act too unethically, the calim of ruling everything can't possibly come true. It is hyperbole and rather comical hyperbole to boot. The fact you give it creedence and are distrubed by it is worrisome. Suggests you can easily be worked into a fever. Such fevers put us in Iraq in the first place.\n \n Newsweek essentially has the story correct, so I suggest we simply clean that up, stop using religion to torture prisoners, and exercise some responsible and ethical behavior. There are too many bad folks out there, the world would be better if we didn't work so hard to be like them.", 
   {}, 
   125014, 
   null, 
   1116523440.0
  ], 
  [
   125071, 
   null, 
   "Truthsayer", 
   "The extreme liberals would like nothing more to see the Newsweek story prove to be true, in my opinion. Just an oppertunity to get in an \"I told ya so,\" even at the costs of American lives over on the ground in the Middle East not to mention the recruiting incentive for the Islamic Terrorists.\n \n And both sides of the aisle have dirty hands as far as their desire to glorify their positions at the cost of our nation. This is merely one example.\n \n Washington needs an enema. Anyone hoping that the Newsweek story pans out to be true is no friend to our country in my humble opinion. But I think it goes beyond this one story. \n \n The way I see it is there are liberal Americans and there are conservative Americans. I can work side by side with any American.\n \n There are liberal extremists and there are conservative extremists. They are both concerned more with their pride and and their agenda to be concerned as to what is best for the nation. That is very Un-american to me. I can't work with those types.", 
   {}, 
   125020, 
   null, 
   1116527820.0
  ], 
  [
   125289, 
   null, 
   "SteveRogers", 
   "What makes you think it is a matter of hope? See this is the attitude that is so destructive for the country. It is dishonest and unworthy of a good and free people.\n \n The story, or the facts of it, are either true or not. Most the evidence supports it being true. But speaking for us liberals, we just had our meeting last night, too bad you don't know the secret hand shake, Bush has already been proven wrong. If \"I told you so's\" were all we wanted, that's been done. Only the most delusional can't see that now.\n \n No, this is about truth and dishonesty. Mule's argument above is dishonest. And your's isn't much better.", 
   {}, 
   125071, 
   null, 
   1116546480.0
  ], 
  [
   125317, 
   null, 
   "gnojek", 
   "The extreme liberals would like nothing more to see the Newsweek story prove to be true, in my opinion.\n\n Actually, (if I am indeed an extreme liberal) I wish the story weren't true, but it's corroborated by at least a couple past news stories.\n \n And then why would any liberal WANT their government to be throwing Korans in poopcans (damn this censor)? \n \n I would think to a liberal this would be a bad thing.\n \n \nJust an oppertunity to get in an \"I told ya so,\" even at the costs of American lives over on the ground in the Middle East not to mention the recruiting incentive for the Islamic Terrorists.\n\n If the military was concerned about terrorist recruits, maybe they shouldn't desecrate the book that ALL muslims must protect? ya think?\n \n \n \nWashington needs an enema. Anyone hoping that the Newsweek story pans out to be true is no friend to our country in my humble opinion. But I think it goes beyond this one story. \n\n No one wants it to be true, but IT IS TRUE.\n \n \nThere are liberal extremists and there are conservative extremists. They are both concerned more with their pride and and their agenda to be concerned as to what is best for the nation. That is very Un-american to me. I can't work with those types.\n\n Then there are the 'wardens' ar guantanamo bay. \n They are concerned with their mission (or agenda if you please).\n Whether it's un-american or not is beside the point, but part of their mission involved desecrating the koran.", 
   {}, 
   125071, 
   null, 
   1116549420.0
  ], 
  [
   125328, 
   null, 
   "Duo_Maxwell", 
   "Let's examine this:\n 1) The story was run past 2 pentagon officals who did not take offense or ask for change about the koran part\n 2) The story has been reported by British and Russian newsources as well as Al-Jazeera almost a full year ago.\n 3) Specific techiniques known to be sacriligious aganist Islam have been reported numerous times and been deemed true by military probes in US prisons. \n \n Which is worse, refusing to believe it because you don't want to, or accepting it based on evidence, prior history, and a set pattern?", 
   {}, 
   125014, 
   null, 
   1116550200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bashing Newsweek", 
  "url": "http://www.4forums.com/political/peace-middle-east/5303-bashing-newsweek.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5303, 
  "discussion_files": [
   [
    "16064.html", 
    "http://www.4forums.com/political/peace-middle-east/5303-bashing-newsweek-print.html"
   ]
  ], 
  "identifier": 5303
 }
]