[
 [
  [
   125458, 
   null, 
   "Redratio1", 
   "..a piece of genetic material taken from your own body and inserted into a sterile egg to create a batch of undifferentiated cells to reinsert into your body to save your life?", 
   {
    "post_info": {
     "post_title": "Would you allow..."
    }
   }, 
   null, 
   null, 
   1116571200.0
  ], 
  [
   125461, 
   null, 
   "johnson", 
   "..a piece of genetic material taken from your own body and inserted into a sterile egg to create a batch of undifferentiated cells to reinsert into your body to save your life?\n\n \n Well if it saves my life what is the problem??\n \n Aren't we pro life here?????", 
   {}, 
   125458, 
   null, 
   1116571680.0
  ], 
  [
   125850, 
   null, 
   "Redratio1", 
   "I was expecting more of a response on this topic considering therapeudic embryonic stem cell research has taken off this week.", 
   {}, 
   125461, 
   null, 
   1116650640.0
  ], 
  [
   125880, 
   null, 
   "Duo_Maxwell", 
   "why not?\n \n Life is cheap and I hold no silly notions.\n Science should be used to benefit life, not ignored.", 
   {}, 
   125850, 
   null, 
   1116653760.0
  ], 
  [
   125883, 
   null, 
   "Redratio1", 
   "why not?\n \n Life is cheap and I hold no silly notions.\n Science should be used to benefit life, not ignored.\n\n \n The anti-abortionists claim that would be killing a human life to save one.", 
   {}, 
   125880, 
   null, 
   1116654240.0
  ], 
  [
   125888, 
   null, 
   "Hunter", 
   "Well if it saves my life what is the problem??\n \n Aren't we pro life here?????\n\n It is much more important that you concern yourself with the destiny of your soul, not how many years you can stay on the earth.", 
   {}, 
   125461, 
   null, 
   1116655620.0
  ], 
  [
   125919, 
   null, 
   "Redratio1", 
   "It is much more important that you concern yourself with the destiny of your soul, not how many years you can stay on the earth.\n\n \n I'm sure it is many a doctors' spiritual duty to relieve suffering, just as Jesus healed the sick. \n \n Besides, who wants to go back to 40 year average lifespan, like they have in Afghanistan? Not me.", 
   {}, 
   125888, 
   null, 
   1116662880.0
  ], 
  [
   125927, 
   null, 
   "Adept", 
   "It is much more important that you concern yourself with the destiny of your soul, not how many years you can stay on the earth.\n\n \n Soul? Pray tell good man, in which lobe of the brain does the soul reside? In which organ is it manufactured? Is it some kind of yet undiscovered hormone? Or is it a state of consciousness?\n \n With regards to the topic: Why ever not? I'm far more important to me than some half-developed clone thingy.", 
   {}, 
   125888, 
   null, 
   1116665340.0
  ], 
  [
   125939, 
   null, 
   "Wraith", 
   "Besides, who wants to go back to 40 year average lifespan, like they have in Afghanistan? Not me.\n\n \n To be honest I wouldn't mind too much missing old age...(whenever that starts).", 
   {}, 
   125927, 
   null, 
   1116673860.0
  ], 
  [
   125940, 
   null, 
   "Wez", 
   "It is much more important that you concern yourself with the destiny of your soul, not how many years you can stay on the earth.\n\n \n If you can have both however...\n \n -Wez", 
   {}, 
   125888, 
   null, 
   1116674100.0
  ], 
  [
   125956, 
   null, 
   "Another opinion", 
   "..a piece of genetic material taken from your own body and inserted into a sterile egg to create a batch of undifferentiated cells to reinsert into your body to save your life?\nThe stem cells that are used for such potentially life-saving procedures are at such an extremely early stage of development that there is no biological possibility that the beginnings of a mind exist. There is absolutely no feeling, no emotion, no thought, no sense of pain. The batch of cells is still an object. They are the very beginnings of the body where the beginnings of the mind (or, for that matter, a soul, if one is of the opinion that a soul must include some sense of mind) are very far off. \n \n However, unless I am mistaken in the biology of this particular batch of cells, they could potentially develop into an actual person (where, for me, person means not only body but some sense of mind or soul as well). This sense of potential personhood should not be taken lightly. This would not be a case of a woman's right over her own body. This would be the case of deliberately generating living human cells (note: this is not equal to a living person) for medical reasons benefiting a living person. \n \n In the balance of having some respect for the idea that these cells could potentially become a person (again, still far off from being actual people - i.e. starting to have a mind), I would only condone using such stem cells if it is a case of saving the life of an existing person - be it myself or anyone else. I would not, for example, condone use of stem cells to help alleviate a medical condition which is not life threatening.", 
   {}, 
   125458, 
   null, 
   1116683340.0
  ], 
  [
   126046, 
   null, 
   "tonybrown74", 
   "It is much more important that you concern yourself with the destiny of your soul, not how many years you can stay on the earth.\n\n \n LOL!\n \n And yet you look both ways when crossing street.", 
   {}, 
   125888, 
   null, 
   1116699120.0
  ], 
  [
   126051, 
   null, 
   "johnson", 
   "It is much more important that you concern yourself with the destiny of your soul, not how many years you can stay on the earth.\n\n \n What makes you think I don't. Yours is not the only religion on earth!! And I didn't just jump to the concluision that your soul needed concern, so don't jump to it with me.", 
   {}, 
   125888, 
   null, 
   1116699600.0
  ], 
  [
   126395, 
   null, 
   "Redratio1", 
   "A batch of undifferientiated cells in a dish is no more a human than a braindead meta-corpse.", 
   {}, 
   126051, 
   null, 
   1116736560.0
  ], 
  [
   126711, 
   null, 
   "Duo_Maxwell", 
   "The anti-abortionists claim that would be killing a human life to save one.\n\n \n So? Life is cheap. You can't change that, the least you can do is profit from it. And people call me a leftist! That's a hardcore capitalist view.", 
   {}, 
   125883, 
   null, 
   1116793200.0
  ], 
  [
   127104, 
   null, 
   "Clive14", 
   "The anti-abortionists claim that would be killing a human life to save one.\nThe anti-abortionists claim a load of **** on many issues. I don't listen to them. To put the \"life\" of an unfertilized egg above that of a person is grotesquely sick IMO. I support any such stem cell research wholeheartedly.", 
   {}, 
   125883, 
   null, 
   1116851700.0
  ], 
  [
   127761, 
   null, 
   "Redratio1", 
   "I just don't get how a bunch of undifferientiated cells can be considered a human life.\n \n AND FURTHER, how is it killing a human being if you are reabsorbing the DNA and transforming that undifferientiated cell mass into viable cells. \n \n The DNA re-enters your own body. You have absorbed your own DNA matched cells.\n \n Something tells me this boils down to a severe lack of understanding about science, as it usually does.", 
   {}, 
   127104, 
   null, 
   1116934980.0
  ], 
  [
   127766, 
   null, 
   "snakespit", 
   "Something tells me this boils down to a severe lack of understanding about science, as it usually does.\n\n Actually, I think it boils down to a group of people who feel that they are fulfilling some spiritual requirement to go to heaven by not only telling us what they would do, but telling the rest of us what we should do as well. Science is only an issue when it serves to better their lives while at the same time making them look more spiritually grounded than everyone else.", 
   {}, 
   127761, 
   null, 
   1116937020.0
  ], 
  [
   127767, 
   null, 
   "Redratio1", 
   "Actually, I think it boils down to a group of people who feel that they are fulfilling some spiritual requirement to go to heaven by not only telling us what they would do, but telling the rest of us what we should do as well. Science is only an issue when it serves to better their lives while at the same time making them look more spiritually grounded than everyone else.\n\n \n It is silly, because they are in charge. The people who are most in LALA land are in charge. That gives me pause.", 
   {}, 
   127766, 
   null, 
   1116937080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Would you allow...", 
  "url": "http://www.4forums.com/political/abortion-debates/5315-would-you-allow.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 5315, 
  "discussion_files": [
   [
    "31694.html", 
    "http://www.4forums.com/political/abortion-debates/5315-would-you-allow-print.html"
   ], 
   [
    "31695.html", 
    "http://www.4forums.com/political/abortion-debates/5315-would-you-allow-2-print.html"
   ]
  ], 
  "identifier": 5315
 }
]