[
 [
  [
   125528, 
   null, 
   "Missouri Mule", 
   "What can I say that I haven't already said. We are dealing with monsters that care not one whit about our lives and don't even care about their own. It would seem that we will be in perpetual war until we track down and kill every one of these predators.\n ==============================\n MAD no more: Can America's new enemies be deterred?\n Townhall ^ | May 19, 2005 | Clifford D. May\n \n Once upon a time, \"credible deterrence\" was the main pillar of America's national security strategy. The Soviet Union may have been, as President Reagan said, an \"evil empire.\" But it was not an irrational empire.\n \n American strategic planners could confidently assume that Soviet leaders would not want the Kremlin flattened - least of all while they were inside. As long as the Russians believed the United States retained its Kremlin-flattening capabilities, their aggressive impulses would be restrained.\n \n This logic led to MAD - Mutually Assured Destruction, a Cold War doctrine based on the belief that stability and peace could best be assured if an outbreak of hostilities would guarantee an undesirable outcome for both sides.\n \n I was reminded of this the other day when Secretary of State Condoleezza Rice issued a warning to North Korean dictator Kim Jong Il, whose regime has been building nuclear weapons and test-firing missiles that could deliver them. The United States, Dr. Rice said, can \"deter whatever the North Koreans are up to.\"\n \n While admiring her icy resolve, I wondered: Can we, really? Or, more to the point, what reason do we have to believe that deterrence is a strategy that can influence the decision-making calculus of someone like Kim?\n \n Is it not possible that Kim might decide to risk - or even sacrifice - his life in order to have the honor of seriously damaging those he sees as enemies? Or might he figure that whatever Americans may threaten, they would never retaliate against innocent North Koreans who are not responsible for Kim's actions or even for keeping him in power?\n \n Perhaps, the CIA has provided Dr. Rice with reliable intelligence concluding that Kim adores being tyrant-in-chief and would do nothing to seriously jeopardize his job. Similar motivations appear to explain why Libyan dictator Muammar Qaddafi gave up his Weapons of Mass Destruction (WMD) programs after seeing Saddam Hussein dragged from a spider hole.\n \n Speaking of Saddam, deterrence clearly did not work where he was concerned. He could have held on to his power and palaces had he only cooperated as he promised at the end of the Gulf War in 1991, had he simply complied with UN Security Council Resolutions demanding he disclose what he had done with his WMD.\n \n Why was his behavior not altered by the credible threat of force? Was he counting on his European friends - some of whom, we now know, he was lavishly rewarding -- to leash the American dogs? Did he miscalculate, believing that if American leaders were convinced that he still had a stockpile of WMD they'd be too cowardly to send troops into battle with him? Did his own scientists trick him into believing he had a daunting WMD capability and was he shocked to see his military machine sputter and stall? Or had he becomes so jaded that he no longer cared about his palaces and privileges and wanted only to lead one last guerilla war?\n \n Perhaps we'll never know. But if a secular Ba'athist like Saddam could not be deterred by the firepower that the U.S. assembled on his doorstep, what is the chance that Osama bin Laden, Abu Musab al-Zarqawi and the suicide-terrorists they command - radical Islamists who believe that martyrdom comes to those killed while fighting a \"holy war\" against \"infidels\" - can be deterred even by the possibility of Mutually Assured Destruction?\n \n And what about Iran's mullahs? Some of them already have indicated that they do not regard Israel's nuclear weapons as a credible deterrent. They have suggested that if they nuked Tel Aviv, and the \"Little Satan\" leveled Tehran in response, they'd be the winners since a large percentage of the world's Jews would be dead while the percentage of Muslims killed would be miniscule.\n \n It hardly would require a huge leap of logic for them similarly to conclude that if the destruction of New York, Washington or another capital important to the \"Great Satan\" requires the sacrifice of a few million Iranians that would be a price worth paying.\n \n Once upon a time, we understood our enemies' ambitions and fears. We knew something about how their minds worked. But now is a different time. With all due respect to Dr. Rice, new ideas and new doctrines are needed.\n \n Clifford D. May is the president of the Foundation for the Defense of Democracies, a policy institute focusing on terrorism and a Townhall.com member group.\n \n http://www.townhall.com/columnists/cliffordmay/cm20050519.shtml", 
   {
    "post_info": {
     "post_title": "MAD no more"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1116604920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  MAD no more", 
  "url": "http://www.4forums.com/political/current-events-debates/5319-mad-no-more.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 5319, 
  "discussion_files": [
   [
    "25037.html", 
    "http://www.4forums.com/political/current-events-debates/5319-mad-no-more-print.html"
   ]
  ], 
  "identifier": 5319
 }
]