[
 [
  [
   6758, 
   null, 
   "Cuchulainn", 
   "Please don't write this off as a troll post. I have been to many fourms in America and Europe. I have noticed something very significant. Many born again fundamentalists or evangelicals seem quite free to admit to a life of drug abuse, violence, spouse abuse, and alcoholism.\n \n I have watched the Evangelical Telly Networks (TBN) and others. Pat Robertson was a scoundrel who womanised, drank, and who knows what else. I have heard a couple (man and wife) Verne Something and his wife. They sang country music and preached. He had full white hair and western suits. I remember him often talking about how bad he was before being saved. I have heard this over and over in the forums, including here in the 18 year old lad who was born again in 2001.\n \n Many Atheists have opened up their past histories, background experiences of deeply personal nature as well. But I can't recall any who talked about alcoholism, violence, or spouse abuse. I know only one atheist in Amsterdam who admits to recreational drug use.\n \n I admit that all of these people claim that the bad habits ceased, with the exception of Jimmy Swaggart, Jim Bakker, Rev. Moorhead of Bellvue.\n \n It seems that religion helps inhibit bad addictions replacing them with fundamentalist Christianity. I assume that Christians attribute this to a saving grace. But is it possible that many people with addictive personalities are more prone to fundamentalistic emotional religions and cults than to philosophical or more intellectual faiths?\n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "Drugs, Alcohol, and Evangelism."
    }
   }, 
   null, 
   null, 
   1050540120.0
  ], 
  [
   6761, 
   null, 
   "thistownwilleat", 
   "I don't think it's so much that people with addictions/vices, etc are more prone to fundamental religion, I just believe that it sounds good, and makes your religion sound better when you talk about going from axe muderer to born again Christian, so those are the stories you hear. It's just added drama for ratings.", 
   {}, 
   6758, 
   null, 
   1050545340.0
  ], 
  [
   6762, 
   null, 
   "gilligan8503", 
   "i am an outwardly atheist and i open say: i use drugs on a recreational occasion.\n \n but yeah, i agree with thistown; it makes religion sound better; maybe they hope there are gulible axe-murderers watching televagilists.\n \n btw, the son of sam is a born again christian. :)", 
   {}, 
   6758, 
   null, 
   1050545700.0
  ], 
  [
   6777, 
   null, 
   "Habbit", 
   "emoticon_rolleyes You know what is the sign of a stupid person? When they try to talk to about things they don't understand, and, because they don't understand it, use their misinformation to bash certain groups that they don't like. \n \n Now, I could pick apart Cuchulainn's post paragraph by paragraph, but that would be a huge waste of my time, considering the only statement I need to make is one sentence. \n \n Maybe if you actually listened to what the people on those Evangelical Telly Networks had to say, instead of forming your own pathetic opinions about people when you don't what you're talking about, you'd find the answer to your sad little accusation, is that the people you see refering back to their past don't do it to Someone can easily get off an alchohol, drug, etc. addiction without turning to Christ. However, the reason people refer back to their past is to show that God is no respector of persons and that no matter what you've done, you can always find Jesus.", 
   {}, 
   6758, 
   null, 
   1050599640.0
  ], 
  [
   6795, 
   null, 
   "lurch", 
   "Well, that was one sentence. Sadly, it's hard to tell where one stops and another begins. For example\n \n...the people you see refering back to their past don't do it to Someone can easily get off an alchohol [sic], drug, etc. addiction without turning to Christ. \n\n What does that say? What does that mean?\n \n That sounds to me like a great reason to stay away from Christ. I had always heard that drug and alcohol addictions were difficult to break. Turns out that without Christ it is easy.", 
   {}, 
   6758, 
   null, 
   1050611340.0
  ], 
  [
   6801, 
   null, 
   "Habbit", 
   "idiot-\n \n \nWell, that was one sentence. Sadly, it's hard to tell where one stops and another begins. For example\n \n What does that say? What does that mean?\n\n \n Well, I'm sorry, I thought that most people would be able to find it, but then I forgot you where such a XXXXX. The said sentence is, \"However, the reason people refer back to their past is to show that God is no respector of persons and that no matter what you've done, you can always find Jesus.\" \n \n \nThat sounds to me like a great reason to stay away from Christ. I had always heard that drug and alcohol addictions were difficult to break. Turns out that without Christ it is easy.\n\n \n Read my statement again, this time more carefully.", 
   {}, 
   6758, 
   null, 
   1050615960.0
  ], 
  [
   6807, 
   null, 
   "lurch", 
   "Let me get this straight. You type\n \n...the people you see refering back to their past don't do it to Someone can easily get off an alchohol [sic], drug, etc. addiction without turning to Christ.\n\n and I'm a XXXXX because it doesn't make sense to me?\n \n Do you have anything of value to say that is not an insult of those who are your intellectual superiors?", 
   {}, 
   6758, 
   null, 
   1050619140.0
  ], 
  [
   6815, 
   null, 
   "Cuchulainn", 
   "Originally posted by lurch \n Well, that was one sentence. Sadly, it's hard to tell where one stops and another begins. For example\n \n What does that say? What does that mean?\n \n That sounds to me like a great reason to stay away from Christ. I had always heard that drug and alcohol addictions were difficult to break. Turns out that without Christ it is easy. \n \n \n I think it is an example of why we need to re-introduce science, math, and the Queen's English grammar back into the schools. This chap, the Hobbit, seems to be syntactically challenged, grammatically dissociated.....crikey lets just say lacking in education. He/she/it probably attended a Christian academy. My post was in no way insulting. But this Hobbit fellow is full of hate and anger. He has issues that go beyond religious hate. Ha, ha and he says find Jesus. Did Jesus spout hate?\n \n Cuchulainn", 
   {}, 
   6758, 
   null, 
   1050637560.0
  ], 
  [
   6816, 
   null, 
   "Cuchulainn", 
   "Originally posted by Habbit \n emoticon_rolleyes You know what is the sign of a stupid person? When they try to talk to about things they don't understand, and, because they don't understand it, use their misinformation to bash certain groups that they don't like. \n \n Great, your generous in that self-confession.\n \n Now, I could pick apart Cuchulainn's post paragraph by paragraph, but that would be a huge waste of my time, considering the only statement I need to make is one sentence.\n \n You also need to borrow about 60 more points of IQ to debate rationally with me. \n \n Maybe if you actually listened to what the people on those Evangelical Telly Networks had to say, instead of forming your own pathetic opinions about people when you don't what you're talking about, you'd find the answer to your sad little accusation,\n \n I didn't accuse. I asked the question, Why do they seem to say these things. Either they are doing it to make their irrational cult beliefs seem stronger or they really are a lot of scumbags who are emotionally attracted to fundamentalism.\n \n  is that the people you see refering back to their past don't do it to Someone can easily get off an alchohol, drug, etc. addiction without turning to Christ. \n \n That agrammatical sentence makes no sense.\n \n However, the reason people refer back to their past is to show that God is no respector of persons and that no matter what you've done, you can always find Jesus. \n \n \n God doesn't respect persons? Eh? Yet God loves us? Eh? You can always find Jesus? I didn't know Jesus was lost. If I find him I will send him to the Israeli Consulate for tickets back to Jerusalam. I have to get some humour out of your posts. I am basically kind hearted. I would rather regard your comments as dark humour rather than incoherent irrational rambling.\n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "It still makes no sense Hobbit."
    }
   }, 
   6758, 
   null, 
   1050638400.0
  ], 
  [
   6817, 
   null, 
   "Cuchulainn", 
   "If indeed nasty buggerers are more likely to go into Evangelical Fundamentalism Telly Rip-off shows, the following is also interesting.\n \n This NEW data was provided by Spike Tyson.\n \n The old article is here.\n \n http://www.atheists.org/nj/html/body_prisons.html\n \n I have expanded the figures to provide a % of the total respondents, and I have ranked them (they were presented to me alphabetically). These stats\n were obtained from their computer on 5 March 1997.\n \n \n The Federal Bureau of Prisons does have statistics on religious\n affiliations of inmates. The following are total number of\n inmates per religion category:\n \n \n \n Response Number %\n \n ---------------------------- --------\n \n Catholic----------------------29267--------------------------------39.164%\n Protestant--------------------26162--------------------------------35.008%\n Muslim------------------------5435----------------------------------7.273%\n American Indian -------------2408----------------------------------3.222%\n Nation-------------------------1734----------------------------------2.320%\n Rasta---------------------------1485----------------------------------1.987%\n Jewish-------------------------1325-----------------------------------1.773%\n Church of Christ-------------1303-----------------------------------1.744%\n Pentecostal--------------------1093----------------------------------1.463%\n Moorish-----------------------1066-----------------------------------1.426%\n Buddhist------------------------882-----------------------------------1.180%\n Jehovah Witness---------------665-----------------------------------0.890%\n Adventist-----------------------621-----------------------------------0.831%\n Orthodox------------------------375---------------------------------- 0.502%\n Mormon-------------------------298-----------------------------------0.399%\n Scientology---------------------190----------------------------------- 0.254%\n Atheist----------------------156------------------------------------0.209%\n Hindu----------------------------119-----------------------------------0.159%\n Santeria--------------------------117-----------------------------------0.157%\n Sikh-------------------------------14------------------------------------ 0.019%\n Bahai-------------------------------9------------------------------------0.012%\n Krishna----------------------------7-------------------------------------0.009%\n \n \n Total Known Responses 74731 100.001% (rounding to 3 digits does this)\n \n Total In Prisons 96968\n \n Sincerely,\n Denise Golumbaski, Research Analyst, Federal Bureau of Prisons\n \n Not unexpected as a result. Note that atheists, being a moderate proportion of the USA population (about 8-16%) are disproportionately less in the prison populations (0.21%).\n ==================================================\n \n Thanks to Karl B. for this submission. Please note that this is an old article (several decades) and the data is no longer valid. However, this does prove that the link between morals and religion is highly overstated.\n \n Studies: \n \n Atheists Supply less than One Percent of Prison Populations\n by Dale Clark,\n \n Index: Atheism and Awareness (News) \n Home to Positive Atheism \n \n (Received July, 1997\n \n It's surprising how many people remark to me, \"You're an Atheist? You must have no conscience about committing crime then.\" Nothing could be further from the truth. In fact, if we examine the population of our prisons, we see a very different picture.\n \n In \"The New Criminology,\" Max D. Schlapp and Edward E. Smith say that two generations of statisticians found that the ratio of convicts without religious training is about one-tenth of one percent. W.T. Root, Professor of Psychology at the University of\n Pittsburgh, examined 1,916 prisoners and said, \"Indifference to religion, due to thought, strengthens character,\" adding that Unitarians, Agnostics, Atheists and Free-Thinkers were absent from penitentiaries, or nearly so.\n \n During 10 years in Sing-Sing, of those executed for murder 65 percent were Catholics, 26 percent Protestants, six percent Hebrew, two percent Pagan, and less than one-third of one percent non-religious.\n \n Steiner and Swancara surveyed Canadian prisons and found 1,294 Catholics, 435 Anglicans, 241 Methodists, 135 Baptists, and one Unitarian.\n \n Dr. Christian, Superintendent of the N.Y. State Reformatories, checked records of 22,000 prison inmates and found only four college graduates. In \"Who's Who,\" 91 percent were college graduates; Christian commented that \"intelligence and knowledge produce right living,\" and, \"crime is the offspring of superstition and ignorance.\"\n \n A survey of Massachusetts reformatories found every inmate to be religious. (i.e. no unbelievers.)\n \n In Joliet Prison, there were 2,888 Catholics, 1,020 Baptists, 617 Methodists and no prisoners identified as non-religious.\n \n Michigan had 82,000 Baptists and 83,000 Jews in the state population; but in the prisons, there were 22 times as many Baptists as Jews, and 18 times as many Methodists as Jews. In Sing-Sing, there were 1,553 inmates, 855 of them (over half) Catholics, 518 Protestants, 117 Jews, and 8 non-religious.\n \n Steiner first surveyed 27 states and found 19,400 Christians, 5,000 with no preference and only 3 Agnostics (one each in Connecticut, New Hampshire, and Illinois). A later, more exhaustive survey found 60,605 Christians, 5,000 Jews, 131 Pagans, 4,000 \"no preference,\" and only 3 Agnostics.\n \n In one 19-state survey, Steiner found 15 non-believers, Spiritualists, Theosophists, Deists, Pantheists and one Agnostic among nearly 83,000 inmates. He labeled all 15 as \"anti-Christians.\" \n \n The Elmira, N.Y. reformatory system overshadowed all others,\n with nearly 31,000 inmates, including 15,694 Catholics (half) and 10,968 Protestants, 4,000 Jews, 325 refusing to answer, and no unbelievers.\n \n Copyright 2002 by American Atheists, Inc \n American Atheists Magazine \n \n Information was presented over the airwaves by John Patrick Michael Murphy. You might be able to get the tape of that radio show from Michael Scott Earl on the website at:\n www.reasonworks.com\n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "Info for the Hobbit"
    }
   }, 
   6758, 
   null, 
   1050640140.0
  ], 
  [
   6820, 
   null, 
   "Cuchulainn", 
   "I am convinced that Fundamentalistic and Authoritarian Religions (like Catholicism, Evangelical fundamentalism) are associated with higher crime rates and levels of immorality because of the mind set (Brain wiring) of those people.\n \n Fundamentalism/Orthodox Roman Catholicism are highly irrational, fear driven, hate fueled ideologies. They affect moral and ethical conditioning in children raised in these cults. Those who drift in voluntarily, have problems with abstract reasoning, critical analysis, logical algorithms, and conceptual connections. Normal people are able to see, hear, critically analyse, attempt to make connections to some proposition or story. If it fails the logical test it is rejected by the medial, lateral, and orbitofrontal \"rubbish filter\" circuits. \n \n I believe that religious fundamentalists have defects in this brain circuitry that makes them not only gullible, unable to reject irrational rubbish, but inefficient in reasoning right and wrong. It also makes them gullible to wildly irrational cults like Christian Fundamentalism and Pentacostalism. I know this is going to bring hate responses, but it is my opinion. I wll add an article from a journal of the American Medical Association, the Archives of Neurology.\n \n In the Archives of Neurology, June 2002, Vol. 59, No. 6. Pages 916-919, is the following article, \"The Neurology of Reasoning\". This is a very prestigious neurology journal affiliated with the American Medical Association.\n \n They did some interesting studies using PET scanning to highlight areas of focal brain activity. They gave patients and volunteers a series of tests in deductive and inductive reasoning, executive problems to solve. They even electrocortically stimulated right and left frontal gyral areas separately.\n \n The results are fascinating. It shows the pathways and cortical areas that perform thought and reason (logical function). They identified areas of prefrontal cortex laterally, medially, and orbitofrontally. Left hemisphere areas mediated the major rational functions while right hemisphere area had more of an affective or emotional role, relating the data to past emotion laden experiences.\n \n One group of people were schizophrenic or bipolar. They initially had some problems with left frontal mediated problem solving and premise-conclusion accuracy. \n \n Then the investigators electrically stimulate these patient's left frontal area, the patients when presented conclusions with false premises, they immediately rejected them and were emotional in this rejection. When the same patients were stimulated on the right hemisphere, they \"responded calmly and appeared unaffected by the absurdity of the premises.\"\n \n The Left hemisphere applies rules of formal logic independent of the content of the presented data. The Right Hemisphere uses the data to assure that it corresponds to memory experiences (indoctrination for example.)\n \n The authors, Dr. Shuren, MD and Dr. Grafman Ph.D., do not address religious belief. They also site a number of case reports of patients with brain lesions in the different locations of concern. This information goes a long way to understand dementing illnesses like Alzheimer's and Fronto-Temporal Dementia.\n \n The part that we can all agree upon is that it is a big advance in finding causes and cures of these degenerative diseases. That is most important.\n \n But philosophically, it is stimulation to be finally analysing thought, reasoning, logic, and executive mental functions to know how we all work.\n \n Secondarily, it fits well with my earlier hypotheses about the possible differences between sceptical/unbeliever and more gullible/believer types of brains. I suspect that Atheists, Agnostics, Freethinkers have brains in which the left hemisphere centres and pathways are more efficient. Why they are more efficient could be due to synaptic density, receptor regulation, and possibly the concentration of cortical neurons in those areas.\n \n By contrast, religious believers as well as those who believe in UFO's, Bigfoot, and Nessie have less efficient, less stimulated, or less developed logic circuitry in their left frontal lobes and/or more excitable right frontal circuits.\n \n Evidence is piling up that the brains of determined atheists are quite different from determined religionists. Naturally there is a spectrum in which intermediate types prevail and in them you have people who are weakly religious or weakly sceptical. Those are the ones who may convert one way or the other depending on life experiences, or education.\n \n So, that religionists don't feel like I am slagging them, I am not claiming superiority of one versus the other, just difference.\n \n It also reinforces my above posit that many people don't choose to believe or not believe. Our conscious, or seemingly conscious brain does not decide. Our more complex circuitry analyses the data of God belief and bible ideas. Those of us with more developed Left Pre-frontal centres, circuits, synaptic regulation, receptors, and neuronal population density, have no real choice. Our brains cannot accept the concepts anymore than we can accept cubical spheres. Others, no slag intended, readily accept premises that we cannot, and conclusions that our brains reject. Their religiously tending brains accept it and for them it makes sense, in view of the strong emotional input and learned experiences.\n \n Ok, Lads and Lasses, I await your attacks. But the trends in science are rapidly making more and more advances in the field of Neurocognition. Scepticism and unquestioning belief are opposite ends of a spectrum most left frontal sceptics at one end, and most right frontal hyperstimulated religious fanatics at the other. This explains why fundies and Catholics are hyperreligious and why more break the law and make irrationo-legal decisions getting them into prisons in disproportionate numbers.\n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "My Hypothesis on religion and moral behaviour."
    }
   }, 
   6758, 
   null, 
   1050643560.0
  ], 
  [
   6821, 
   null, 
   "Tim", 
   "I think you have to take into consideration that Atheists make up only a very small percentage of the general population of America. According to ARIS (American Religious Identification Survey) Atheists only constitute 0.4% of the population and agnostics constitute 0.5% of the population. Therefore, it's not surprising that there aren't very many atheists and agnostics in the prison. \n \n http://www.sullivan-county.com/identity/deism_grows.htm", 
   {}, 
   6758, 
   null, 
   1050644640.0
  ], 
  [
   6863, 
   null, 
   "Cuchulainn", 
   "Tim:\n \n Polls are flawed by how the questions are asked. Here are a couple that seem fair. And I add an explanation that you may accept for the prison statistics.\n \n \"Eight percent of all adults describe themselves as atheist or agnostic. This segment covers an estimated 10 to 15 million adults.\"\n \n http://www.barna.org/cgi-bin/PagePressRelease.asp?PressReleaseID=105&Reference=B.\n \n \"Secular/Nonreligious/Agnostic/Atheist: This is a highly disparate group and not a single religion. Although atheists are a small subset of this grouping, this category is not synonymous with atheism. Atheists actually make up less than one-tenth of one percent of the population in many countries where large numbers claim no religious preference, such as the United States (7.5% nonreligious) and Australia (15% nonreligious).\"\n \n http://www.adherents.com/Religions_By_Adherents.html#Nonreligious\n \n I didn't bother the quoting the higher numbers of the American Humanist Association and the American Atheists, because you would likely refuse to accept that. The point is that in American where Atheists are hated intensively by 49% of the population, and cases of discrimination are full in the ACLU's files. Many American Atheists will not admit Atheism to a pollster. A medical doctor, especially in small town America cannot afford to be discovered as an atheist or risk losing half of his patients and half of referrals to specialists like me. Small business men face the same problem. It is entirely legal discrimination. We have no amendment that says you cannot hate us and boycott our business or medical practices. So my discussions with many other \"closet\" atheist doctors suggest that 4 out of 5 doctors hide their Atheism or fake Christianity publically (because food on the family table is higher morality.) When one considers this, it may be that the number of Atheists in polls may be half or a third of the actual number while the number of Christians may be exaggerated because saying \"I am Christian\" confers first class citizenship.\n \n One factor in the prison is that all prisoners are under pressure to call themselves Christian. Christian prisoners are more likely to get better treatment and much better chances of parole. I dare say that a parole board in the American south would deny parole to an admitted Atheist. So prison is one place a real Atheist if he is not stupid would pretend to be a Christian for favoured treatment.\n \n \n Cuchulainn", 
   {
    "unicode_changes_made": true
   }, 
   6758, 
   null, 
   1050792240.0
  ], 
  [
   6917, 
   null, 
   "Habbit", 
   "idiot-\n \n \nand I'm a XXXXX because it doesn't make sense to me?\n\n \n Exactly, XXXXX.\n \n \nDo you have anything of value to say that is not an insult of those who are your intellectual superiors?\n\n \n Do you have anything to do other than whine and complain... to those who are your intellectual superiors?\n \n Cuchulainn-\n \n \nI think it is an example of why we need to re-introduce science, math, and the Queen's English grammar back into the schools.\n\n \n Well, kid, you're insulting yourself and most of the people here, because I don't go to public schools. \n \n *cough*stupid*cough* \n \n \n This chap, the Hobbit, seems to be syntactically challenged, grammatically dissociated.....crikey lets just say lacking in education.\n\n \n And you, my friend, are illiterate. The name is Habbit. Not Hobbit. You're not even two sentences in before you start to look stupid.\n \n \nHe/she/it probably attended a Christian academy.\n\n \n Try again.\n \n \nMy post was in no way insulting.\n\n \n Using misinformation to boost your ego is insulting.\n \n \nBut this Hobbit fellow is full of hate and anger. \n\n \n Just like your signature.\n \n \nHe has issues that go beyond religious hate. \n\n \n Oh gee, thank you for having the answers to my problems. Dr. Cuchulainn, Ph.D. \n \n \nHa, ha and he says find Jesus. Did Jesus spout hate?\n\n \n That's why you should be glad Jesus died on the cross and not me. \n \n \nGreat, your generous in that self-confession.\n\n \n Thanks.\n \n \nYou also need to borrow about 60 more points of IQ to debate rationally with me. \n\n \n You also need to borrow a new insult. Did you get that one from Crim?\n \n \nI didn't accuse. I asked the question, Why do they seem to say these things. Either they are doing it to make their irrational cult beliefs seem stronger or they really are a lot of scumbags who are emotionally attracted to fundamentalism.\n \n\n \n Would you rather have me say 'you'd find the answer to your sad little insults'?\n \n \nThat agrammatical sentence makes no sense.\n\n \n Think harder. I'm sure you'd get it. After all, you are an atheist and you're smarter than us blind religious fools.\n \n \nGod doesn't respect persons? Eh? Yet God loves us? Eh? You can always find Jesus? I didn't know Jesus was lost. If I find him I will send him to the Israeli Consulate for tickets back to Jerusalam. \n \n \n 1. Yeah.\n 2. Eh?\n 3. Yeah.\n 4. Eh?\n 5. Yeah.\n 6. Eh?\n 7. Ok.\n \n \nI have to get some humour out of your posts.\n\n \n The feeling's mutual.\n \n \nI would rather regard your comments as dark humour rather than incoherent irrational rambling.\n \n\n \n EH? That's funny, because I consider yours to be incoherent irrational rambling! \n \n \nInfo for the Hobbit \n\n \n Charlatan.\n \n \nNot unexpected as a result. Note that atheists, being a moderate proportion of the USA population (about 8-16%) are disproportionately less in the prison populations (0.21%).\n\n \n Atheist.com, that's sure to be a fair, unbiased website. One more thing, I hope that number also includes humanists, 'liberal theologians' etc. One more thing, 1997 was 6 years ago. One more thing, there are a lot of atheists who claim to be Christians. One more thing, I think it's funny how the largest groups of people in America have the largest numbers of prisoners. Unfair?Of course not, anything bashing religion is totally fair. One more thing, most of Catholics and Protestants probably went to jail for speaking out against homosexual sexual relations. (I probably need to put this: [/sarcasm])\n \n \nI am convinced that Fundamentalistic and Authoritarian Religions (like Catholicism, Evangelical fundamentalism) are associated with higher crime rates and levels of immorality because of the mind set (Brain wiring) of those people.\n\n \n I am convinced that white people commit more horrible crimes than black people based on scientific evidence that most serial rapists/killers, more freaks, (like people who kidnap people and cut up their bodies and stick them in freezers) etc. are white. \n \n XXXXX.\u0099", 
   {}, 
   6758, 
   null, 
   1050889620.0
  ], 
  [
   6921, 
   null, 
   "gilligan8503", 
   "*sigh*", 
   {}, 
   6758, 
   null, 
   1050891900.0
  ], 
  [
   6952, 
   null, 
   "Tim", 
   "Okay, let's stop the name calling and personal attacks. 'nuff said.", 
   {}, 
   6758, 
   null, 
   1050909240.0
  ], 
  [
   6968, 
   null, 
   "Habbit", 
   "Tim, on both sides.", 
   {}, 
   6758, 
   null, 
   1050958140.0
  ], 
  [
   7204, 
   null, 
   "Cuchulainn", 
   "One more thing, most of Catholics and Protestants probably went to jail for speaking out against homosexual sexual relations\n \n Speaking out? It seems that most of the time Catholic or Protestant clerics get in trouble it is for buggering young boys and occasionally girls. So, you think the Catholic-Proddies (mostly fundies) go to prison for speaking against buggering. What do you think these wankers are doing IN prison? EH? Catholic poofters buggering Proddy hodgies?\n \n Since you seem to be rather unnaturally preoccupied with homosexuality, not the topic of the thread, here is a good site about the science of Homophobia.\n \n http://www.apa.org/releases/homophob.html\n \n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "Hobbit hypothesises homosexuality"
    }
   }, 
   6758, 
   null, 
   1051318320.0
  ], 
  [
   7298, 
   null, 
   "Habbit", 
   "Cuchulainn-\n \n \nSpeaking out?\n\n \n I love how you so eloquently cut out the rest of my quote.\n \n \nIt seems that most of the time Catholic or Protestant clerics get in trouble it is for buggering young boys and occasionally girls. So, you think the Catholic-Proddies (mostly fundies) go to prison for speaking against buggering. What do you think these wankers are doing IN prison? EH? Catholic poofters buggering Proddy hodgies?\n\n \n 1) I think all Catholics should be put in jail.\n 2) I care not for pseudo-Christian fools either.\n \n \nSince you seem to be rather unnaturally preoccupied with homosexuality, not the topic of the thread, here is a good site about the science of Homophobia.\n\n \n Why thank you for twisting my words and putting words into my mouth yet again. I wish I had a website I could give you, but I could find nothing about 'word twisters' or 'making up stuff.'", 
   {}, 
   6758, 
   null, 
   1051592580.0
  ], 
  [
   7300, 
   null, 
   "gilligan8503", 
   "ah, the inciteful habbit strikes again!", 
   {}, 
   6758, 
   null, 
   1051593600.0
  ], 
  [
   7303, 
   null, 
   "thistownwilleat", 
   "\"Why thank you for twisting my words and putting words into my mouth yet again. I wish I had a website I could give you, but I could find nothing about 'word twisters' or 'making up stuff.'\"\n \n Habbit seriously man, I know you're trying as hard as you can but lets all face the facts. You're not a funny guy. At all. You're not witty, insightful, or good with sarcasm for that matter either.", 
   {}, 
   6758, 
   null, 
   1051601520.0
  ], 
  [
   7304, 
   null, 
   "Cuchulainn", 
   "The notation of your apparent homosexual obsession, in my opinion, that led me to remark on the studies of Homophobia as a form of suppressed homosexual desires, really irritated you.\n \n I don't have any bias against homosexuals, active or latent, so nothing personal was intended. I should not deliberately trigger your internal demons of possible sexual orientation issues.\n \n I must be honest as a Darwinistic evolutionist, to consider homosexuality as a maladaptive mutational disorder. I mean nothing hateful about that. Please do not take offence. I mean no offence if a person is impotent or has any other maladaptive condition.\n \n I will not post further on this thread to demonstrate my intention to not traumatise certain people. I apologise for my use of negative slur terms like wanker and buggering. That was uncalled for. I am sorry.\n \n Cuchulainn", 
   {
    "post_info": {
     "post_title": "Aye Hobbit, I struck a chord."
    }
   }, 
   6758, 
   null, 
   1051604700.0
  ], 
  [
   7307, 
   null, 
   "Habbit", 
   "gilligan-\n \n \nah, the inciteful habbit strikes again!\n\n \n Nice arguement.\n \n thistownwilleat-\n \n \nHabbit seriously man, I know you're trying as hard as you can but lets all face the facts. You're not a funny guy. At all. You're not witty, insightful, or good with sarcasm for that matter either.\n\n \n Ok, Strong Bad. \n \n Cuchulainn-\n \n \nThe notation of your apparent homosexual obsession, in my opinion, that led me to remark on the studies of Homophobia as a form of suppressed homosexual desires, really irritated you.\n\n \n That's all fine and dandy, however, the only thing irritating me is you.\n \n \nI don't have any bias against homosexuals, active or latent, so nothing personal was intended. I should not deliberately trigger your internal demons of possible sexual orientation issues.\n\n \n I don't have any bias against homosexuality either. As long as they stay out of my way and one doesn't try to hit on me, they won't get their nose broken. The homosexuals I'm against are the ones are trying to make it legal to go into schools and brainwash kids about the homosexual lifestyle. Same goes for homosexual adoptions, kids should be adopted for the sake of getting them into good homes, not to further someone's sexual orientation. \n \n \nI will not post further on this thread to demonstrate my intention to not traumatise certain people. I apologise for my use of negative slur terms like wanker and buggering. That was uncalled for. I am sorry.\n\n \n You should be. In concludence, I believe the reason you are targeting me is because you are trying to ignore your own homosexual desires.", 
   {}, 
   6758, 
   null, 
   1051627140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Drugs, Alcohol, and Evangelism.", 
  "url": "http://www.4forums.com/political/religion-debates/534-drugs-alcohol-evangelism.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 534, 
  "discussion_files": [
   [
    "14759.html", 
    "http://www.4forums.com/political/religion-debates/534-drugs-alcohol-evangelism-print.html"
   ], 
   [
    "14760.html", 
    "http://www.4forums.com/political/religion-debates/534-drugs-alcohol-evangelism-2-print.html"
   ]
  ], 
  "identifier": 534
 }
]