[
 [
  [
   6781, 
   null, 
   "Middle", 
   "What do you think about Eugenics?", 
   {
    "post_info": {
     "post_title": "Eugenics"
    }
   }, 
   null, 
   null, 
   1050600960.0
  ], 
  [
   6785, 
   null, 
   "Crim", 
   "if you could somehow get everyone to agree with it, it would work\n \n but it can't be forced", 
   {}, 
   6781, 
   null, 
   1050601440.0
  ], 
  [
   6838, 
   null, 
   "Middle", 
   "Do you really think that we could ever achieve a perfect human race though? Maybe it would work if everybody agreed to it...but you would get to that point where the blood lines would be so close because of perfect breeding that there would be mutations...Like the breed of German Sheperd dogs that are bred for show...they are showing mutations now because the blood-lines are so close. Plus, I like to think that the flaws of people is what makes them interesting...", 
   {}, 
   6781, 
   null, 
   1050689520.0
  ], 
  [
   6839, 
   null, 
   "Crim", 
   "There are mutations in every person regardless of how they're bred. The vast majority just don't do anything. You wouldn't be able to create a 'perfect' human because everyone has a different opinion on perfect. Besides, it's highly unlikely that people with 'weak' genes would so willingly give up their reproductive rights.", 
   {}, 
   6781, 
   null, 
   1050689700.0
  ], 
  [
   6841, 
   null, 
   "Middle", 
   ":p :) well said", 
   {}, 
   6781, 
   null, 
   1050773040.0
  ], 
  [
   6857, 
   null, 
   "Middle", 
   "Wait a minute, I just realized that you contradict yourself. \nYou wouldn't be able to create a 'perfect' human because everyone has a different opinion on perfect.\n and yet, before you said \nif you could somehow get everyone to agree with it, it would work\n I agree that you cannot create the perfect human being...but then that means the whole theory of eugenics (creating the perfect race) wouldn't work...please explain yourself :)", 
   {}, 
   6781, 
   null, 
   1050789120.0
  ], 
  [
   6858, 
   null, 
   "Crim", 
   "Simple.\n Eugenics isn't about creating perfection. It's making improvements through selective breeding.", 
   {}, 
   6781, 
   null, 
   1050789900.0
  ], 
  [
   6860, 
   null, 
   "Middle", 
   ":) So if it could work, you would agree with it?", 
   {}, 
   6781, 
   null, 
   1050790920.0
  ], 
  [
   6861, 
   null, 
   "Crim", 
   "No.", 
   {}, 
   6781, 
   null, 
   1050791160.0
  ], 
  [
   6864, 
   null, 
   "Middle", 
   "well, somebody agrees with me then...but there's no one else in this conversation...I wonder what everybody else thinks", 
   {}, 
   6781, 
   null, 
   1050795060.0
  ], 
  [
   7318, 
   null, 
   "Middle", 
   "c'mon people!!! I can't debate with one person (who agrees with me!)", 
   {}, 
   6781, 
   null, 
   1051638240.0
  ], 
  [
   7353, 
   null, 
   "gilligan8503", 
   "i hate to get you down, but i agree. i also say eugenics would not be probable. i also don't think it should even be attempted, because like middle, i think flaws make people interesting. also, flaws may be a good thing, it is how you determine a flaw. einstein was autistic. if einstein wasn't autistic, he mostlikely wouldn't have done much of anything spectacular. his high-functioning form of autism abled him to computer hella fast (that's right, i said hella).", 
   {}, 
   6781, 
   null, 
   1051668900.0
  ], 
  [
   8068, 
   null, 
   "DarKnight", 
   "Originally posted by gilligan8503 \n i einstein was autistic. if einstein wasn't autistic, he mostlikely wouldn't have done much of anything spectacular. \n \n \n What are you talking about? Einstein was DYSLEXIC! a huugge difference as any dyslexic will tell you (cos you won't get much out of the autistic)\n \n If you become fixated on breeding the perfect person then of cource eugenics breaks down. \n The perfect lawyer would make a useless cop.\n \n The trick is to sub-catagorize the species. Not unlike Huxley's \"brave new world\"*, if we set out to design the perfect network of specialists, each to their job, then that might just work. Infact then we could allow the \"regular civilians\" to just relax and concentrate on being individuals while the super-people take the burden of the economy.\n \n \n *For those that haven't read it, its a book.", 
   {}, 
   6781, 
   null, 
   1052942640.0
  ], 
  [
   8074, 
   null, 
   "gilligan8503", 
   "um, yeah and he was autistic...\n don't speak when you don't know.", 
   {}, 
   6781, 
   null, 
   1052950380.0
  ], 
  [
   8076, 
   null, 
   "DarKnight", 
   "Okay fine. What I meant to say was Einstien was not a higher functioning autistic but he (based on resent information) did suffer from aspergers syndrome which, okay, is technically a form of aspergers. \n \n The point I wanted to make was the latent mathematical or general intellectuall \"boost\" that is inherant in cases of higher functioning autistics you don't get with asperger's. \n What you get is a guy who's a bit of a nutball, for better or worse maybe, so maybe he thought in a different way but the fact that he was genuinely naturally talented in things mathematical/physics had nothing to do with his medical condition.\n \n Besides I think you really missed the point of my post, you know the bit underneath about the ACTUAL subject of discussion?\n \n Oh yeah, and Middle? Don't worry, you're not alone, I agree with you, I think eugenics could work \n (and I mean that in a nice \"perfect world\" way and not some twisted aryan way).", 
   {}, 
   6781, 
   null, 
   1052951340.0
  ], 
  [
   8091, 
   null, 
   "gilligan8503", 
   "you may be right and you may be wrong. if he laked these 'flaws', he could very well have been different. his disablilities could have led him down a certain path. they affected him and without these affects, he would have been a different person and could have done other things.\n \n the point is, someone's 'flaw' may make them push harder or see things a different way. i'm sure einstein's 'flaws' made him think differently and come upon things in a different manner. i mean, the guy didn't even know his own telephone number or address.", 
   {}, 
   6781, 
   null, 
   1052966700.0
  ], 
  [
   8103, 
   null, 
   "DarKnight", 
   "True, but following the same line of logic, he could have just as easily donee bigger and better things. \n Who knows? he might have discovered even greater things had he not been \"flawed\".\n I don't actually belive what I said, I'm just following the line of logic to show you that you cannot asume such\"flaws\" are benifital on ANY level.", 
   {}, 
   6781, 
   null, 
   1052996100.0
  ], 
  [
   8441, 
   null, 
   "gilligan8503", 
   "of course, so i say: leave things the way they are. \"if it ain't broken, don't fix it.\"", 
   {}, 
   6781, 
   null, 
   1054012860.0
  ], 
  [
   12954, 
   null, 
   "dreamweaver", 
   "Do you really think that we could ever achieve a perfect human race though?\n\n \n Humans are, by definition not perfect. Therefore for us to \"be perfect\" we would have to not have emotions. If we did not have emotions then we could not emote, but that is a different debate. Perfection is an extremity, an extremity which can technically not exist in the human race.\n \n By \"perfect\" I assume that you mean \"perfect in every way\". If this is not so, then I apologise. If you could, just state your definition of perfect.", 
   {}, 
   8441, 
   null, 
   1060442220.0
  ], 
  [
   13056, 
   null, 
   "Middle", 
   "I think you misunderstood my point. I don't think Eugenics could work to a very large extent (considering it has been practiced for a long time previously) and I don't believe it should ever be attempted to such an extent again.", 
   {}, 
   8076, 
   null, 
   1060570200.0
  ], 
  [
   13057, 
   null, 
   "Middle", 
   "Oops! I'm sorry, I was only on the first page...please disregard the above statement...", 
   {}, 
   13056, 
   null, 
   1060570260.0
  ], 
  [
   13060, 
   null, 
   "Middle", 
   "I think i did mean that statement as \"perfect in everyway\"...It was somewhat a hypothetical question because I do agree with you...It would never happen because it is an extreme and everyone has a different idea of \"perfect\". However, I think Eugenics mostly concentrated on being physically perfect. Darknight: I think it's important for people to have \"flaws\"...such as autism (sorry if I spelled it wrong)...I need to check the statistics on this, but I'm pretty sure it's proven that most people with autism are smarter than the average person. It may be idealistic but I believe that even the most \"flawed\" (if you consider it a flaw to have autism) people can achieve great things and therefore the whole theory of Eugenics is ..for lack of a better word...stupid.", 
   {}, 
   13057, 
   null, 
   1060570860.0
  ], 
  [
   13063, 
   null, 
   "Crim", 
   "but I'm pretty sure it's proven that most people with autism are smarter than the average person.\n \n \n Some people with autism have flashes of brilliance, however, it destroys one's ability to interact with the world and communicate with other people. Let's just say no one would be signing up for autism if it was being given out for free.", 
   {}, 
   13060, 
   null, 
   1060572900.0
  ], 
  [
   14457, 
   null, 
   "&#8206;", 
   "Autism is not very well understood. There is no way to prove whether or not people such as Einstein actually had High-Functioning Autism or Asperger's Syndrome. But what is clear is that autism must be genetically linked to some genetic trait that increases one's chance for having many children. Autistic people have such low birthrates that were it a standalone trait, not related to anything else, it would have died out long ago. Some scientists who have studied autism have made note of the fact that autistic children seem to be more attractive than average, and that they rarely show physical deformities unless they also have some other disease or disorder that affects them. The same has been said of gay men by other scientists. While I have no proof, I think it is quite likely that when we finally do cure autism, we will be getting rid of some good things as well. I fully support eugenics, but I think that properly done human eugenics will increase human diversity rather than decrease it.", 
   {}, 
   8076, 
   null, 
   1062800700.0
  ], 
  [
   16359, 
   null, 
   "montalban", 
   "Nazis practiced eugenics.\n \n People who support eugenics are putting a value judgment on people. No Christian worth his salt would agree to treat another human in such a cold and callous way.\n \n I'm totally amazed to read the sort of flippant way you guys have dealth with this fascist topic.\n \n We are all images of God.", 
   {}, 
   14457, 
   null, 
   1064067660.0
  ], 
  [
   18008, 
   null, 
   "epaphras_faith", 
   "you may be right and you may be wrong. if he laked these 'flaws', he could very well have been different. his disablilities could have led him down a certain path. they affected him and without these affects, he would have been a different person and could have done other things.\n \n the point is, someone's 'flaw' may make them push harder or see things a different way. i'm sure einstein's 'flaws' made him think differently and come upon things in a different manner. i mean, the guy didn't even know his own telephone number or address.\n\n \n Excuse me, Einstein was not autisitc. One of the characteristics of autistic people is that they lose the ability of speech as early as 2 or three years old. Aspergers is different but both occur in children prior to the age of 18. Einstein did not exhibit the charactersitic symptoms of either of those disroders in his childhood. Those symptoms are defined in the DSM IV-R.\n \n He was odd and a bit scatterbrained and he was potentially dyslexic but the social disorder and inability to form any relationships of significance in early childhood did not exist for Einstein.", 
   {}, 
   8091, 
   null, 
   1065139320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Eugenics", 
  "url": "http://www.4forums.com/political/science-math-debates/535-eugenics.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 535, 
  "discussion_files": [
   [
    "28051.html", 
    "http://www.4forums.com/political/science-math-debates/535-eugenics-print.html"
   ], 
   [
    "28052.html", 
    "http://www.4forums.com/political/science-math-debates/535-eugenics-2-print.html"
   ]
  ], 
  "identifier": 535
 }
]