[
 [
  [
   126413, 
   null, 
   "Missouri Mule", 
   "The numbers tell the tale. Europe is changing and probably not for the better. The denial of Europeans to this change not surprising based on their past history but it is most alarming.\n ========================\n \n Monday, May 23, 2005\n \n Europe Closing Shop?\n \n Demographics: The population of Europe is set to start shrinking soon. And if recent events there are any indication, that's not a good thing. We may be watching the slow-motion death of a civilization.\n \n The events to which we refer have garnered little notice. Yet each, in its own way, is equally telling about the radical changes in store for Europe - and America as well.\n \n On Friday, it was announced in Germany's Hesse state that all schools will soon offer instruction in Islam to Muslim students. Meanwhile, the U.S.-based Weekly Standard reports that a recent confidential government study found a surprising rise in religious expression among Muslims in French public schools.\n \n What's wrong with all this? Maybe nothing. As in the U.S., many nations in Europe have more than one culture and many religions living within their borders. We are all open societies. The problem is what this says about Europe's future.\n \n Europe is changing. The birthrate, now at 1.5 live births per female, is well below the 2.1 required just to replace its population. Birthrates of immigrant Muslim populations there are three times the average. Upshot: By 2020 or so, the European population will fall by more than 4% while the Muslim population will double.\n \n By 2050, just to keep the current worker-to-retiree ratio intact, Europe will have to bring in an estimated 13.5 million immigrants each year. That's 608 million immigrants - the equivalent of 10 Germanys - over 45 years. Anything less will consign the Continent to unavoidable economic decline.\n \n And where will all these newcomers come from? The same places they've come from in the past - Turkey, Algeria, Morocco, Tunisia, Pakistan - all Muslim. Europe's new nursery.\n \n This has ramifications for America as well. We assume that the Europe we'll be dealing with tomorrow will be much the same as Europe today - one that understands and shares our cultural values. The fact is, as Europe slowly becomes more Muslim and less European, it is at risk of dying - not as a place, but as a culture.\n \n Europe's faithless Christianity is already moribund. In London, more people worship in mosques each week than in the Church of England's houses of worship. And in France, there are more practicing Muslims than baptized Catholics.\n \n This means the U.S. will increasingly be isolated in world affairs. For example, will a Europe of, say, 50 million Muslims be more hostile to the U.S.' pro-Israel policy? Seems likely.\n \n Europe's politics may also become more unstable. Al-Qaida cells have already been found in Germany, France, Italy and Spain. Politicians in the Netherlands have been assassinated for \"insulting\" Islam.\n \n Demographic trends also put the U.S. economy at risk. Two years ago, at a much-hyped conference in Spain titled \"Islam in Europe,\" 2,000 European Muslim leaders called on Muslims around the world to help bring about an end to the capitalist system.\n \n As the biggest player in that system, the U.S. faces a delicate task: how to keep an old but estranged friend from committing suicide.\n \n http://www.investors.com/editorial/issues03.asp?v=5/21", 
   {
    "post_info": {
     "post_title": "Europe Closing Shop?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1116740580.0
  ], 
  [
   126482, 
   null, 
   "Wraith", 
   "This means the U.S. will increasingly be isolated in world affairs.\n \n ...end to the capitalist system.\n\n \n emoticon_cry ;)\n \n \n Europe's faithless Christianity...\n \n ...how to keep an old but estranged friend from committing suicide. \n\n \n I know! Undertake a counter invaision of Europe!\n \n Radical fundermental Christian Americans who selflessly give up their lives in the USA to 'save Europe' by reproducing and evangelizing to safeguard Europe's spiritual, political, and economic future!\n \n emoticon_rolleyes \n \n Some how I don't think it's going to happen...\n \n These articles make me laugh so much.", 
   {}, 
   126413, 
   null, 
   1116765240.0
  ], 
  [
   126660, 
   null, 
   "lord tammerlain", 
   "What is strange about that article is it doesnt mention how to prevent Europe from commiting suicide. Where is Europe going to get the new white people that it would need to prevent that \"suicide\"? The Europeans are unlikely to start breeding like rabits without a serious socialogical change, and the white people from the US are unlikely to move to Europe ( too foreign and they speak weird languages).\n \n They could always change the immigration from muslim countries to African or east Asian ( who are suffering from the same aging population Korea, China and Japan are aging faster). Or they could take south Asians, say from Pakistan (oops more muslims) \n \n Looks like it is lights out for Europe, no chance of salvation.", 
   {}, 
   126482, 
   null, 
   1116790080.0
  ], 
  [
   126879, 
   null, 
   "Duo_Maxwell", 
   "Why is it that every such article Mule posts about islam assumes that every muslim is a fundementalist and will act as such? \n \n Some of the richest people in the world are hardcore muslim capitalist. Heck, Bin Laden's own family is one of those.", 
   {}, 
   126660, 
   null, 
   1116811020.0
  ], 
  [
   127044, 
   null, 
   "Missouri Mule", 
   "What is strange about that article is it doesnt mention how to prevent Europe from commiting suicide. Where is Europe going to get the new white people that it would need to prevent that \"suicide\"? The Europeans are unlikely to start breeding like rabits without a serious socialogical change, and the white people from the US are unlikely to move to Europe ( too foreign and they speak weird languages).\n \n They could always change the immigration from muslim countries to African or east Asian ( who are suffering from the same aging population Korea, China and Japan are aging faster). Or they could take south Asians, say from Pakistan (oops more muslims) \n \n Looks like it is lights out for Europe, no chance of salvation.\n\n \n I don't pretend to have all the answers but I think it would be wise for the leaders of Europe to have a frank and open discussion and work up some realistic plans on how to deal with this. Do they want to maintain their culture; their centuries of history and all the rest or do they want to be transformed into another version of Saudi Arabia? If they don't care; that's fine. If not, then there would be every indication there is trouble on the horizon. Ask the American Indian how that turned out. Or any native populations that were either wiped out (as in Tasmania) or elsewhere where a stronger civilization took control.\n \n http://www.tasmanianaboriginal.com.au/woodpile.htm", 
   {}, 
   126660, 
   null, 
   1116832980.0
  ], 
  [
   127123, 
   null, 
   "Clive14", 
   "...And where will all these newcomers come from? The same places they've come from in the past &#8212; Turkey, Algeria, Morocco, Tunisia, Pakistan &#8212; all Muslim....\nAnd a very selective list. But it needs to be a selective list, for whithout it the whole Islamaphobia argument comes crumbling down. In reality only France has large numbers of immigrants from Algeria, Morocco and Tunisia as those countries speak French. In the UK we have large numbers of people from the West Indies and southern Africa (predominantly Christian countries), India (mainly Hindu and Sikh) and much of the rest of Asia (as much Bhudist and Muslim). There is a wide range of religions coming into Europe via immigrants. BUt let's not let mere facts get in the way of the mule's Muslim-hatred driven rants, eh? emoticon_rolleyes", 
   {}, 
   126413, 
   null, 
   1116859500.0
  ], 
  [
   127137, 
   null, 
   "Missouri Mule", 
   "And a very selective list. But it needs to be a selective list, for whithout it the whole Islamaphobia argument comes crumbling down. In reality only France has large numbers of immigrants from Algeria, Morocco and Tunisia as those countries speak French. In the UK we have large numbers of people from the West Indies and southern Africa (predominantly Christian countries), India (mainly Hindu and Sikh) and much of the rest of Asia (as much Bhudist and Muslim). There is a wide range of religions coming into Europe via immigrants. BUt let's not let mere facts get in the way of the mule's Muslim-hatred driven rants, eh? emoticon_rolleyes\n\n \n What's the makeup of Birmingham? The issue is not hatred of Muslims. It is a great concern over the demographic trends and what will inevitably be the political ramifications.", 
   {}, 
   127123, 
   null, 
   1116861480.0
  ], 
  [
   127147, 
   null, 
   "Clive14", 
   "What's the makeup of Birmingham? The issue is not hatred of Muslims. It is a great concern over the demographic trends and what will inevitably be the political ramifications.\nHmm, now why Birmingham I wonder? Let's take a look at some figures shall we:\n \n Local authorities with the 10 largest percentage Muslim populations in 2001:\n \n Tower Hamlets 36.4%\n Newham 24.3%\n Blackburn with Darwen UA 19.4%\n Bradford 16.1%\n Waltham Forest 15.1%\n Luton UA 14.6%\n Birmingham 14.3%\n Hackney 13.8%\n Pendle 13.4%\n Slough UA 13.4% \n \n Hmm, I'd suggest you choose Tower Hamlets next time emoticon_xclown\n \n Of course the national percentage, rather than some poorly executed cheery-pick is 2.7%. Run for your lives, the tiny minority are taking over! emoticon_rolleyes \n \n \nThe issue is not hatred of Muslims. It is a great concern over the demographic trends and what will inevitably be the political ramifications.\nThese being made-up and highly improbable demographic trends and Islamaphobia-driven ludicrously improbable political ramifications of course. You can only sustain your case by the misuse of statistics as demonstrated by your Birmingham example and by careful selection of neo-fascist anti-Islam articles.", 
   {}, 
   127137, 
   null, 
   1116862740.0
  ], 
  [
   127154, 
   null, 
   "Missouri Mule", 
   "Hmm, now why Birmingham I wonder? Let's take a look at some figures shall we:\n \n Local authorities with the 10 largest percentage Muslim populations in 2001:\n \n Tower Hamlets 36.4%\n Newham 24.3%\n Blackburn with Darwen UA 19.4%\n Bradford 16.1%\n Waltham Forest 15.1%\n Luton UA 14.6%\n Birmingham 14.3%\n Hackney 13.8%\n Pendle 13.4%\n Slough UA 13.4% \n \n Hmm, I'd suggest you choose Tower Hamlets next time emoticon_xclown\n \n Of course the national percentage, rather than some poorly executed cheery-pick is 2.7%. Run for your lives, the tiny minority are taking over! emoticon_rolleyes \n \n These being made-up and highly improbable demographic trends and Islamaphobia-driven ludicrously improbable political ramifications of course. You can only sustain your case by the misuse of statistics as demonstrated by your Birmingham example and by careful selection of neo-fascist anti-Islam articles.\n\n \n I asked the question because a lady from Britain had informed me sometime ago that the makeup of Birmingham had changed dramatically in the past few years. I've not been there so I thought I would get another perspective.\n \n How many Muslims do you have in the UK? Do you know that? What is all of this stuff I see coming out of the UK calling for jihad, etc.? Is it safe to walk down the streets of London at night as I did in 1965 when I visited there on leave?\n \n BTW, why am I \"neo-fascist\" to question the changing makeup of Europe? I am not going to be the one to bear the effects of a mosque on every corner and flamerthrowers declaring war on the infidels. (that would be you BTW.)\n \n BTW, 14.3% does seem to me to be a rather sizeable percentage. When do you get concerned? When it is 51%? Given enough time and the respective birth rates that would seem to be a virtual certainty? Am I wrong?", 
   {}, 
   127147, 
   null, 
   1116863400.0
  ], 
  [
   127155, 
   null, 
   "Jo Bennett", 
   "I think MM's real fear is that Muslims tend to vote Labour and will help keep the tories buried, it's not that MM hates muslims he's just worried that they're all secret communists... emoticon_xclown\n \n What exactly is the effect of a \"mosque on every street corner\"? Is it bad? If you think Muslims are the reason London isn't safe then you're even dumber than you seem. The stuff you see coming out of the UK proclaiming Jihad is overblown BS from your right wing media. There have been 1 or 2 nutty Imams, and a few muslims who hold extreme views. The real threat from extremism here, however, is from fascists who claim to be Christian, like the BNP and their convicted-criminal-leader Nick Girffin.", 
   {}, 
   127147, 
   null, 
   1116863400.0
  ], 
  [
   127156, 
   null, 
   "Missouri Mule", 
   "I think MM's real fear is that Muslims tend to vote Labour and will help keep the tories buried, it's not that MM hates muslims he's just worried that they're all secret communists... emoticon_xclown\n \n What exactly is the effect of a \"mosque on every street corner\"? Is it bad? If you think Muslims are the reason London isn't safe then you're even dumber than you seem.\n\n \n I don't give a damn about your politics. Had I been there I would have voted for Blair myself. I recall that as bad as the Communists were they still behaved in a rational way; they actually wanted to remain living. Tell that to the jihadists who just live to die.\n \n I have no clue why London \"isn't safe.\" Why don't you tell me?", 
   {}, 
   127155, 
   null, 
   1116863640.0
  ], 
  [
   127159, 
   null, 
   "Jo Bennett", 
   "Because it's an enormous, annonymous city with massive disparity between rich and poor, the centre of pretty much all commercial activity, including illegal. There are some gang problems in parts of it too. It's also about the most likely place in Britain to meet an armed assailant. In any case, you'd probably be safe enough in London, women tend to be more vulnerable, as with anywhere. Also it will very much depend on the area you go in. There are good areas and rough areas.", 
   {}, 
   127156, 
   null, 
   1116864060.0
  ], 
  [
   127168, 
   null, 
   "Clive14", 
   "I asked the question because a lady from Britain had informed me sometime ago that the makeup of Birmingham had changed dramatically in the past few years. I've not been there so I thought I would get another perspective.\nThis is true. 60 years ago it would have been nearly 100% white and Christian as would the rest of the country.\n \n \nHow many Muslims do you have in the UK? Do you know that?\nThe 2001 census puts the figure at 1,591,126 Muslims compared with 42,079,417 Christians. That is what is called a minority.\n \n \nWhat is all of this stuff I see coming out of the UK calling for jihad, etc.?\nIt's called \"biased reporting\". For a true representation of Muslims in Britain, try listening to what the Muslim Council of Britain says rather than the right wing anti-Islam laden **** you keep referencing.\n \n \nIs it safe to walk down the streets of London at night as I did in 1965 when I visited there on leave?\nIt's as dangerous to walk the streets of London at night now as it was in 1965: in some parts it is highly dangerous. In others it's very safe. Of course I'm assuming you are white, straight and do not show off excessive wealth. If you are non white or gay, then you have a greatly increased risk of being attacked. If you show off wealth, you risk being mugged.\n \n \nBTW, why am I \"neo-fascist\" to question the changing makeup of Europe? I am not going to be the one to bear the effects of a mosque on every corner and flamerthrowers declaring war on the infidels. (that would be you BTW.)\nYou answer your own question. emoticon_rolleyes \n \n \nBTW, 14.3% does seem to me to be a rather sizeable percentage. When do you get concerned? When it is 51%?\nIt's below 3% nationally. Even if it reached 51% nationally, I'd not be concerned unless the majority population tried to force it's religion down my throat. Tell me, have you ever visited Gambia? It is a majority Muslim country. It bears as much resemblance to Saudi Arabia as Thailand does. There is a world of difference between a Muslim population and Islamic religious nutterdom, just as there is a world of difference between Catholic population and the murderous thugs of the IRA.\n \n \nGiven enough time and the respective birth rates that would seem to be a virtual certainty? Am I wrong?\nYes.", 
   {}, 
   127154, 
   null, 
   1116865020.0
  ], 
  [
   127173, 
   null, 
   "Eddie", 
   "How many Muslims do you have in the UK? Do you know that? \n\n \n About 2,7%... You do the math ;)\n \n The western european average being 2% (making the prediction from your original post a whooping 5% or so of europes population muslim in 2020...) Hardly the stuff of nightmares, unless you consider muslims and Islam being the root of all evil.\n \n \n \n Is it safe to walk down the streets of London at night as I did in 1965 when I visited there on leave?\n\n \n I was there roughly 6 years ago when I was 17. I walked alone at nights (even drunk). Unless something very dramatic has happened, I would guess you are still safe in London at nights (with the obvious exeption of certain areas). \n \n \nBTW, why am I \"neo-fascist\" to question the changing makeup of Europe? I am not going to be the one to bear the effects of a mosque on every corner and flamerthrowers declaring war on the infidels. (that would be you BTW.)\n\n \n You sure could have fooled me... Your rants sounds exactly like the filth that is spewed by neo-fascist parties and organisations here in europe. If it talks like a duck, and sits like a duck. Chances are pretty good that it is a duck...\n \n \nBTW, 14.3% does seem to me to be a rather sizeable percentage. When do you get concerned? When it is 51%? Given enough time and the respective birth rates that would seem to be a virtual certainty? Am I wrong?\n\n \n \n What is a \"sizeable precentage\" to you? Do you consider 14,3% blacks a sizeable percentage? Is it somehow based on racial purity or something simmiliar? What should be of concern? I don`t really understand how you think sometimes\n \n And no, it is not a certainty that Muslim will be the dominant religion in Europe. I find it more likely that we all will die from some kind of natural disaster/nuclear war/meteorite/plague before this happens...", 
   {}, 
   127154, 
   null, 
   1116865200.0
  ], 
  [
   127177, 
   null, 
   "Missouri Mule", 
   "This is true. 60 years ago it would have been nearly 100% white and Christian as would the rest of the country.\n \n The 2001 census puts the figure at 1,591,126 Muslims compared with 42,079,417 Christians. That is what is called a minority.\n \n It's called \"biased reporting\". For a true representation of Muslims in Britain, try listening to what the Muslim Council of Britain says rather than the right wing anti-Islam laden **** you keep referencing.\n \n It's as dangerous to walk the streets of London at night now as it was in 1965: in some parts it is highly dangerous. In others it's very safe. Of course I'm assuming you are white, straight and do not show off excessive wealth. If you are non white or gay, then you have a greatly increased risk of being attacked. If you show off wealth, you risk being mugged.\n \n You answer your own question. emoticon_rolleyes \n \n It's below 3% nationally. Even if it reached 51% nationally, I'd not be concerned unless the majority population tried to force it's religion down my throat. Tell me, have you ever visited Gambia? It is a majority Muslim country. It bears as much resemblance to Saudi Arabia as Thailand does. There is a world of difference between a Muslim population and Islamic religious nutterdom, just as there is a world of difference between Catholic population and the murderous thugs of the IRA.\n \n Yes.\n\n \n I suppose I was lucky then. I did walk down the streets of London and never feared for my safety. I was just a typical American dressed in casual clothing.\n \n You claim that a high birth rate of Muslims and a low birth rate for native Brits won't tip the scales in favor of a Muslim state within a few decades. Is this the British equivalent of \"new math?\" How can you be so certain of your position?\n \n A lot of Americans fear the immigration (legal or illegal) from Mexico. We have about 35% here where I live with. The fundamental difference is that they are not Muslim. They are Christian. After they have been here for a while they usually assimilate into our culture and there are no problems of note. However, in Los Angeles, CA. the story is evidently different with a move to annex California to Mexico. Since I don't much give a damn about California for a number of reasons I wouldn't much mind if they succeeded. (It would also mean that a Democrat could never again be elected president.) But again the difference is that virtually all Mexicans (or Hispanic/Latino if you will) are Christian (Catholic) and do not pose a cultural earthquake to our values.\n \n And our black population is virtually all Christian. And they fought to get INTO American society as full-fledged citizens with all the rights thereof. What you have is the mirror opposite. I've heard native born Pakistani Brits declare that they are Muslims first and Brits second. Ignore that at your own peril.", 
   {}, 
   127168, 
   null, 
   1116865680.0
  ], 
  [
   127181, 
   null, 
   "Jo Bennett", 
   "And Muslims do? If the Christian right are looking for allies in their moralistic crusade, the mosques is where they could find them. That said, assimilation is going just fine for the vast majority of muslims here. Most are as assimilated as any other faith group, including Jews who have been here centuries.", 
   {}, 
   127177, 
   null, 
   1116866100.0
  ], 
  [
   127191, 
   null, 
   "Eddie", 
   "@MM\n \n Your whole theory about inevitable muslim domination relies on the notion that muslims tend to have dramaticly higher birthrates than non-muslims. How are these birthrates calculated?\n \n EDIT: Oh, and do you actually know any muslims? Or what are you basing your whole \"cultural earthquake\" assertion on?", 
   {}, 
   127181, 
   null, 
   1116867000.0
  ], 
  [
   127199, 
   null, 
   "Missouri Mule", 
   "@MM\n \n Your whole theory about inevitable muslim domination relies on the notion that muslims tend to have dramaticly higher birthrates than non-muslims. How are these birthrates calculated?\n\n \n Good question. Those are the reports I have read many times. I just did a \"google\" this popped up. I think it is a fair reindition of the facts so far as I can tell.\n \n \n \n European Islam or Islamic Europe?\n Douglas E. Streusand\n \n If the grim visage of Osama bin Laden personifies the most threatening aspect of Islam for Americans, the European equivalent might easily be a Muslim woman and her children. Europe has low birth rates and aging populations. Combined with increasing numbers of Muslim immigrants and their higher fertility rates the continent may face a demographic and cultural transformation over the next two generations. Though Europe is hardly immune to Islamic totalitarian violence, the distant prospect of cultural submergence overshadows the immediate danger of terrorism. European regimes, even those critical of U.S. policy in Iraq, are cooperating in various ways in the global struggle against Islamic totalitarianism. But that struggle is peripheral to the efforts of EU governments, individually and collectively, to come to grips with the growing Muslim proportion of their populations.\n \n The birth rate of the indigenous peoples of the European Union countries is now well below the replacement level of 2.1 children per woman. Without immigration, the EU's population could drop by 100 million by 2075. In addition to declining in number, the EU population is aging, which means that fewer and fewer workers must support European retirement and welfare systems. As a result, EU governments have an enormous financial incentive to build up their work forces by taking in ever more immigrants.\n \n At present, the population of the EU is approximately 5% Muslim; France is 10% Muslim. Leaving aside the possible admission of the countries with large Muslims populations like Turkey and Bulgaria, the Muslim proportion of the EU population will probably grow to 10% overall by 2020 if current trends continue. If, however, the rate of immigration increases, the proportion of Muslims will rise significantly faster. Some observers believe that a surge in Muslim population may produce a Christian and Jewish flight from Europe. The controversy in France and elsewhere about the wearing of hijab in public schools is only the current idiom of discourse on the future of Europe.\n \n One may reduce various scenarios for Europe's future to two extremes: the evolution of an Islamic Europe, in which Muslim institutions and culture supplant secular and Christian institutions and culture; and the development of a European Islam, in which European Muslims share the European identity developed by European Catholics, Protestants and Jews. More than two centuries ago, Edward Gibbon wrote that but for Charles Martel's victory at Tours in 732, \"Perhaps the interpretation of the Koran would now be taught in the schools of Oxford and her pulpits might demonstrate to a circumcised people the sanctity and truth of the revelation of Mohammed.\" The vision of an Islamic Europe implies the undoing of the alleged effects of that Carolingian triumph. A European Islam, in contrast, would add Islam to Oxford's curriculum without removing anything else.\n \n The idea of a European Islam is not merely the product of wishful thinking of Western liberals... \n \n (Snip)\n \n http://www.neweuropereview.com/English/english-streusand.cfm", 
   {
    "unicode_changes_made": true
   }, 
   127191, 
   null, 
   1116867540.0
  ], 
  [
   127205, 
   null, 
   "Missouri Mule", 
   "@MM\n \n Your whole theory about inevitable muslim domination relies on the notion that muslims tend to have dramaticly higher birthrates than non-muslims. How are these birthrates calculated?\n \n EDIT: Oh, and do you actually know any muslims? Or what are you basing your whole \"cultural earthquake\" assertion on?\n\n \n I don't know many. I have a doctor who I believe may be a Muslim although I have not questioned him about his religious views. He is from Lebanon and is living the American dream. I had a fraternity brother in college many years ago who was from Palestine. Again, I didn't ask him about his religion. I did meet a living breathing Muslim in Dallas a couple of years ago. He was selling Toyotas and I asked him specifically and whether he had any difficulty with practicing his faith. He said he had no problem and said \"America is the greatest country in the world.\" Now he might have been lying to me to gain my confidence but he seemed sincere. I have exchanged views with a Muslim over in Indonesia. He seemed like a decent enough fellow.\n \n I'm not against Muslims per se. What I do fear is that far too many Muslims are seduced by the likes of bin Laden and that Islam is the centerpiece of their lives. Throw in the issue of Israel and we have a volatile mix. One could argue that this is why Europe is more sympathetic to the Palestinian cause than is America. The politicians cannot ignore their constitutuents.", 
   {}, 
   127191, 
   null, 
   1116867900.0
  ], 
  [
   127211, 
   null, 
   "Eddie", 
   "It said nothing of the methods used in the calculation. My guess is that since the european muslim population is relative young and fertile, their birth rates are highly exagerated (ans easily used by neo-fascists and christian nutters for political gains).\n \n The think piece you just posted was rather... oppionated to put it mildly. emoticon_rolleyes\n \n The Israel-Palestina issue is a very old in Europe. It has nothing to do with the muslim faith...", 
   {}, 
   127199, 
   null, 
   1116868080.0
  ], 
  [
   127216, 
   null, 
   "Missouri Mule", 
   "It said nothing of the methods used in the calculation. My guess is that since the european muslim population is relative young and fertile, their birth rates are highly exagerated (ans easily used by neo-fascists and christian nutters for political gains).\n \n The think piece you just posted was rather... oppionated to put it mildly. emoticon_rolleyes\n\n \n Eddie, if you are really all that interested in the birth rate you can easily find it. Just do a \"google\" and I'm sure it will be there for you to read yourself. This is not really \"news.\" It has been widely written about.", 
   {}, 
   127211, 
   null, 
   1116868320.0
  ], 
  [
   127223, 
   null, 
   "Eddie", 
   "Eddie, if you are really all that interested in the birth rate you can easily find it. Just do a \"google\" and I'm sure it will be there for you to read yourself. This is not really \"news.\" It has been widely written about.\n\n \n I have been searching for quite some time now to find out more about the issue. I have read from both sides of the fence and tried to find any official statistics that can be used. Problem is that I have never been able to trace the actual studies behind the reasoning for \"muslim domination\". And everytime I encounter the argument, different figures are being presented. To me, it sounds to much of an urban myth...", 
   {}, 
   127216, 
   null, 
   1116868500.0
  ], 
  [
   127225, 
   null, 
   "Clive14", 
   "...You claim that a high birth rate of Muslims and a low birth rate for native Brits won't tip the scales in favor of a Muslim state within a few decades. Is this the British equivalent of \"new math?\" How can you be so certain of your position?\nLast time I checked, Muslims born in Britain are \"native Brits\", so your question makes no sense. That aside, the paperwork for a registering a newborn child records the where the mother and father were born, but does not record their religion. I'm therefore intrigued to know how you are so confident in your claim that Muslims have more babies per couple than other people in Britain. Sources please.\n \n \nA lot of Americans fear the immigration (legal or illegal) from Mexico. We have about 35% here where I live with. The fundamental difference is that they are not Muslim. They are Christian.\nI do not understand what you are trying to argue here. Are you claiming that Mexicans make no difference to American society? If so, why do so many people in southern America fear their immigration?\n \n \nI've heard native born Pakistani Brits declare that they are Muslims first and Brits second. Ignore that at your own peril.\nWhat is a \"native born Pakistani Brit\" supposed to be? I'm sure many people Muslims do consider themselves Muslim first, British second. I consider myself European first, British seond, English third. Am I too a danger to English society? Does the rest of my country ignore me at my peril?", 
   {}, 
   127177, 
   null, 
   1116868560.0
  ], 
  [
   127228, 
   null, 
   "Missouri Mule", 
   "\n \n The Israel-Palestina issue is a very old in Europe. It has nothing to do with the muslim faith...\n\n \n I don't doubt that. I was discussing in the context of the difficulty in getting young Muslims to look at the broader view of life. So much of what is said about Israel is incendiary and it feeds into those rabble rousers who are looking for reasons to push their views.\n \n Interesting that you say it has \"nothing\" to do with Muslim faith. One could extrapolate from that that anti-semitism is alive and well in Europe generally, although it was supposed to be stamped out after WWII. It is still lurking below the surface as that French minister put it when he referred to that \"****** little country in the ME\" (meaning Israel.)", 
   {}, 
   127211, 
   null, 
   1116868620.0
  ], 
  [
   127233, 
   null, 
   "Missouri Mule", 
   "Last time I checked, Muslims born in Britain are \"native Brits\", so your question makes no sense. That aside, the paperwork for a registering a newborn child records the where the mother and father were born, but does not record their religion. I'm therefore intrigued to know how you are so confident in your claim that Muslims have more babies per couple than other people in Britain. Sources please.\n \n I do not understand what you are trying to argue here. Are you claiming that Mexicans make no difference to American society? If so, why do so many people in southern America fear their immigration?\n \n What is a \"native born Pakistani Brit\" supposed to be? I'm sure many people Muslims do consider themselves Muslim first, British second. I consider myself European first, British seond, English third. Am I too a danger to English society? Does the rest of my country ignore me at my peril?\n\n \n The British born Muslims were Pakistani descended. They were interviewed and went on about how they wanted to join the jihadists. There have been other such examples widely written about. I'm sure you have seen them.\n \n I said that Mexicans do not pose a danger to our society because they are not carrying the burden of a religion that wants to exterminate the infidels as Islamists have clearly stated. How do you think that Islam spread? It was through force. Either believe or off with your head. You may not believe but your children and grandchildren will. \n \n Your own statement about your allegiance is silly and frivolous.", 
   {}, 
   127225, 
   null, 
   1116868920.0
  ], 
  [
   127236, 
   null, 
   "Clive14", 
   "...One could argue that this is why Europe is more sympathetic to the Palestinian cause than is America...\nOne could, but one would be wrong. America is preo Israel because America is dominated by fundamentalist Christians that see the Israel/ Palestine issue as the start of the God/ Satan endgame and/ or see Isreal as having always been belonging to the Jewish people regardless of who actually lived there. The reason European countries supported the mad scheme of betraying the Palestinian people after WW2 by taking their land off them and handing it to zionists is because of a massive guilt trip over failing to help the millions of Jews murdered by the Nazis.", 
   {}, 
   127205, 
   null, 
   1116868980.0
  ], 
  [
   127237, 
   null, 
   "Eddie", 
   "I don't doubt that. I was discussing in the context of the difficulty in getting young Muslims to look at the broader view of life. So much of what is said about Israel is incendiary and it feeds into those rabble rousers who are looking for reasons to push their views.\n \n Interesting that you say it has \"nothing\" to do with Muslim faith. One could extrapolate from that that anti-semitism is alive and well in Europe generally, although it was supposed to be stamped out after WWII. It is still lurking below the surface as that French minister put it when he referred to that \"****** little country in the ME\" (meaning Israel.)\n\n \n Ebing very sceptic against Israel and bein anti-semitic are often confused. No doubt, there are anti-semetic forces in Europe. Probably much stronger than in most places on this planet (with the exeption of the ME), one should be wary of equating critisism against Israel as a state and critisism of the jewish people...", 
   {}, 
   127228, 
   null, 
   1116868980.0
  ], 
  [
   127251, 
   null, 
   "Clive14", 
   "The British born Muslims were Pakistani descended. They were interviewed and went on about how they wanted to join the jihadists. There have been other such examples widely written about. I'm sure you have seen them.\nI don't read the neo-fascist **** you so love to read. I therefore haven't heard about half a dozen individuals being endlessly misquoted until Islamaphobes believe that Islam has already taken over Europe. There are extremists of all sorts in Britain. The Islamic ones are a tiny minority. The British National Party and other rascist organisations are far more of a threat.\n \n \nI said that Mexicans do not pose a danger to our society because they are not carrying the burden of a religion that wants to exterminate the infidels as Islamists have clearly stated.\nThe majority of Muslims are not Islamic extremists wanting to exterminate the infidels, so I fail to see what you are trying to argue therefore.\n \n \nHow do you think that Islam spread?\nIt spread throughout the middle east and into Europe through a combination of force and through conversion of occupied peoples over a few generations. It spread largely by completely peaceful means throughout much of northern Africa and through Malaysia and Indonesia.\n \n \nIt was through force. Either believe or off with your head.\nYou offer me a false dichotomy.\n \n \nYour own statement about your allegiance is silly and frivolous.\nIncorrect, it simply shows that your statement about allegiance is pure scaremongering.", 
   {}, 
   127233, 
   null, 
   1116869760.0
  ], 
  [
   127253, 
   null, 
   "georged", 
   "one should be wary of equating critisism against Israel as a state and critisism of the jewish people...\n\n \n My wife is a practicing Jew, loves Jews, despises the state of Israel for what US Christianity has turned it into (easy bible thumpers, I'm not trying to hijack the thread into a religious subject, just a comment on a posted observation).", 
   {}, 
   127237, 
   null, 
   1116869820.0
  ], 
  [
   127258, 
   null, 
   "Clive14", 
   "...One could extrapolate from that that anti-semitism is alive and well in Europe generally, although it was supposed to be stamped out after WWII. It is still lurking below the surface as that French minister put it when he referred to that \"****** little country in the ME\" (meaning Israel.)...\nRefering to Israel as \"that \"****** little country in the ME\" is not anti-semitic. The Israeli government likes to play the anti-semitism card every time their country is criticised, but they play a false card by doing so. I've even heard of Jewish people being accused of being anti-semitic for criticising Israel! emoticon_rolleyes", 
   {}, 
   127228, 
   null, 
   1116869880.0
  ], 
  [
   127286, 
   null, 
   "Clive14", 
   "Missouri Mule, you appeared to miss my request for you to provide sources for your claims that Muslims have more children than other British couples, so here is a gentle reminder. Thanks.", 
   {}, 
   127233, 
   null, 
   1116871440.0
  ], 
  [
   127306, 
   null, 
   "Missouri Mule", 
   "Missouri Mule, you appeared to miss my request for you to provide sources for your claims that Muslims have more children than other British couples, so here is a gentle reminder. Thanks.\n\n \n Well, here is one and there are many. I just did a google search: \"muslim birthrate in Europe.\" \n \n The UN predicts that Europe's non-Muslim population will drop by an estimated 7.5 million over the next 45 years while it's Muslim population will increase. European Christians are having fewer children - an average of 1.5 children each. However, to sustain a population, a birthrate of 2.1 children per woman is required. Since workers are needed to pay taxes and maintain the economy, Europe is bringing in millions of immigrants - mostly Muslim. Approximately 1.6 million new immigrants are needed annually to keep Europe's working population stable. But if Europe wants to maintain the current ratio of workers to retirees, with more of its aging population retiring all the time, it will have to bring in a staggering 13.5 million immigrants every year. Millions of these are (and will probably continue to be) Muslims, especially if Turkey with its seventy-one million (primarily Muslim) population is accepted into the European Union.\n \n Muslims tend to have their children when young, in contrast to the native Europeans. They also tend to have more of them. Estimates suggest that birthrates and immigration will put the Muslim population of Europe at 10 percent (10%) by 2020. (7) Already, the Muslim birthrate in Europe is three times higher than the non-Muslim birthrate. In fact, for the past four years, the most common name for baby boys in Brussels, Belgium has been \"Mohammed,\" with \"Osama\" placing a close second.\n \n In the Netherlands, Muslims represent a majority among children under fourteen in the country's four largest cities. Rotterdam, a port city where over half the population is of foreign origin will soon unveil Europe's largest mosque, and official projections confirm that Amsterdam and Rotterdam will have fifty percent (50%) non-Western populations (mostly Muslim) by 2020. This has brought the Dutch to the realization that their nation, the nation that spawned geniuses like Erasmus, Spinoza and Rembrandt, is in danger of being overwhelmed by an alien culture that knows no compromise and refuses to be assimilated into secular Dutch society.\n \n For these and other reasons, several leading radical Islamic theologians like Yousef al-Qaradawi in Qatar (the spiritual leader of the radical Muslim Brotherhood) and Sheikh Abd al-Rahman al-Sudais in Saudi Arabia speak of the Islamic conquest of Europe simply by allowing demographics and Muslim conversions to take their course. (8) They see the adoption of the Muslim faith and the submission of Christian Europe to Islamic rule as inevitable. \"We will remodel this country in an Islamic image,\" the London-based preacher Sheikh Omar Bakri Muhammad told an attentive audience less than two months after 9/11. \"We will replace the Bible with the Qur'an.\"...\n \n (Snip)\n \n http://www.jfednepa.org/mark%20silverberg/eurabia.html\n \n Here's another interesting article.\n \n Behind the wooden door of a brick Brussels town house, Jean-François Bastin, 61, a Belgian convert to Islam, holds court before a steady stream of Islamic activists. His fledgling Young Muslims Party is one of the new groups aggressively pursuing pro-Muslim agendas in Europe.\n \n He calls Osama bin Laden \"a modern Robin Hood,\" and the World Trade Center attacks \"a poetic act,\" \"a pure abstraction.\" His 23-year-old son is in jail in Turkey on charges that he was involved in the bombings there that killed 61 people in November 2003.\n \n But Mr. Bastin argues that his son's troubles are evidence that Muslim youths feel politically excluded in Europe. He says political engagement is an antidote to militancy.\n \n \"There is deviance because people don't find their place here,\" he said, a long, hennaed beard falling over the front of his Arab-style tunic, his graying hair tucked beneath a turban fashioned from a multicolored head scarf. \"If we deny that political voice that can judge and determine what is good for Muslims, from the point of view of their religion and their citizenship, their children are going to look for adventures elsewhere.\"\n \n Mr. Bastin, who converted to Islam in 1972 after a spiritual quest led him to Morocco, dismisses the far right's fears of an Islamization of Europe, even if he does dream of an Islamic theocracy governing the Continent someday.\n \n (Snip)\n \n http://64.207.171.242/pages/news_belgium_021205.html", 
   {
    "unicode_changes_made": true
   }, 
   127286, 
   null, 
   1116872700.0
  ], 
  [
   127443, 
   null, 
   "Jo Bennett", 
   "Haven't we already discredited your \"most popular names\" junk in this forum already?", 
   {}, 
   127306, 
   null, 
   1116888480.0
  ], 
  [
   127467, 
   null, 
   "Missouri Mule", 
   "Haven't we already discredited your \"most popular names\" junk in this forum already?\n\n \n Did you? I can't recall. How did you do that?", 
   {}, 
   127443, 
   null, 
   1116891960.0
  ], 
  [
   127473, 
   null, 
   "Jo Bennett", 
   "Eddie did it, he posted a big pile of links showing the most popular names for various European countries.", 
   {}, 
   127467, 
   null, 
   1116892380.0
  ], 
  [
   127522, 
   null, 
   "Eddie", 
   "@ MM\n \n So you claim Mark Silverberg, executive director of the Jewish Federation of Northeastern Pennsylvania as your source? Funny how he doesn`t supply a link or at least reference to the figure of birth rates... Perhaps that`s because it has been ripped from another author who had a completly different message (but also failed to substantiate his claim with any studies or address the issue of young muslim population and how that will affect any \"excess\" birth rates currently enjoyed by all immigrant groups from various countries and regions)...\n \n I also found this to be rather interesting: Baby Boom in France Perhaps the fears of a shrinking population in Europe is overblown. At least it still grows and if other countries could make the same \"upswing\" as France recently did, there might not even be a population problem...", 
   {}, 
   127473, 
   null, 
   1116897660.0
  ], 
  [
   127584, 
   null, 
   "daewoo", 
   "No offense to all involved, but this entire argument is idiotic. Population grtowth has always been cyclic everywehre in the world. Currently, your average american family has 2.3 children. 30 yrs ago, average American family had 5 children. I am from a family of 10. My wife and I have 2 kids and don't plan on any more. \n \n Look at historic figures and you quickly see the cycle.", 
   {}, 
   127522, 
   null, 
   1116903180.0
  ], 
  [
   127696, 
   null, 
   "Missouri Mule", 
   "No offense to all involved, but this entire argument is idiotic. Population grtowth has always been cyclic everywehre in the world. Currently, your average american family has 2.3 children. 30 yrs ago, average American family had 5 children. I am from a family of 10. My wife and I have 2 kids and don't plan on any more. \n \n Look at historic figures and you quickly see the cycle.\n\n \n I can't see how you come to the conclusion that this argument is \"idiotic.\" I believe the weight of evidence is strongly on the side that shows native Europeans are dying off and not replacing themselves. In order to pay for the vast socialistic programs enacted, someone has to be there to ante up. The immigrants coming in are largely from North Africa and Turkey. They are largely Muslim. They have a historically and religiously inspired high birth rate. Hmmmmm. Do you think there might be a conclusion to be drawn from these facts? Methinks so.\n \n And this also has a political angle in that European politicians wanting to be elected and reelected have to suck up to their constituents and as the population grows more and more Muslim the resulting policies are likely to be more and more anti-American. And, if a country such as France tips completely into a Muslim theocracy as some have suggested, then it is Katy bar the door. It is no longer a democracy as democracy is incompatible with Islam. Connect the dots.", 
   {}, 
   127584, 
   null, 
   1116916560.0
  ], 
  [
   127715, 
   null, 
   "daewoo", 
   "I can't see how you come to the conclusion that this argument is \"idiotic.\" I believe the weight of evidence is strongly on the side that shows native Europeans are dying off and not replacing themselves. In order to pay for the vast socialistic programs enacted, someone has to be there to ante up. The immigrants coming in are largely from North Africa and Turkey. They are largely Muslim. They have a historically and religiously inspired high birth rate. Hmmmmm. Do you think there might be a conclusion to be drawn from these facts? Methinks so.\n \n And this also has a political angle in that European politicians wanting to be elected and reelected have to suck up to their constituents and as the population grows more and more Muslim the resulting policies are likely to be more and more anti-American. And, if a country such as France tips completely into a Muslim theocracy as some have suggested, then it is Katy bar the door. It is no longer a democracy as democracy is incompatible with Islam. Connect the dots.\n\n \n Because birth rate is cyclic. It always has been, and likely always will be. That is just part of being a developed naiton. Look up the numbers for the US. There have been a half dozen times in the last 100 years that immigration has outpaced births.", 
   {}, 
   127696, 
   null, 
   1116917940.0
  ], 
  [
   127737, 
   null, 
   "gamehuis", 
   "Most popular names in Holland:\n \n http://www.svb.nl/nl/regelingen/kinderbijslag/kindernamen/index.jsp\n \n \n Most popular names in 11 other European countries:\n \n http://www.answers.com/topic/most-popular-names\n \n \n No waves of Muslims names to be found. If anything it's those damn Scandinavian names that are taking hold.", 
   {}, 
   127715, 
   null, 
   1116925860.0
  ], 
  [
   127749, 
   null, 
   "Jo Bennett", 
   "Ah, it seems that the baby name stat appears to be like most of MM's favoured stats, highly selective but technically correct. I can't find a figure for Brussels, but Rotterdam in 2003 appears to have had mohammed as the most popular boys name. Given that this is in isolated cities, and not a general trend (Mohammed is around 20th in the UK, which can pretty much be accounted for by the frequency with which Muslim parents call their child Mohammed, it's like trying to measure how many Mexicans there are in the US by the number of guys called Jesus).", 
   {}, 
   127737, 
   null, 
   1116932400.0
  ], 
  [
   127782, 
   null, 
   "Clive14", 
   "Well, here is one and there are many. I just did a google search: \"muslim birthrate in Europe.\" ...\nYou misunderstood me. I wasn't after you doing a google search for articles that just make the same claims as you. I wanted you to provide me with links (or details of publications) to the UN and national governmenst that show the statistics. You could try searching through the UK 2001 census data for example, that might provide birthrate by ethic/ religious groupings, but I don't think so.", 
   {}, 
   127306, 
   null, 
   1116942180.0
  ], 
  [
   127785, 
   null, 
   "Redratio1", 
   "Europe will become a protectorate of the USA as it has been for the last 60 years..\n \n The Eu will only re-dircet democractic impulses to a most inefficeint uber-body. It is kind of amusing to watch as what we have proctected from aggression for so many years turn on us and develope and independent force; A LA Euro-forces. \n Europe is still 20 years behind the US in weapons tech. The only people now to sell those arms to are enemies of the alliance. And somehow France and Germany, and Russia and China have no problem is selling those arms.\n \n Its absurd.", 
   {}, 
   127177, 
   null, 
   1116942540.0
  ], 
  [
   127790, 
   null, 
   "Eddie", 
   "I can't see how you come to the conclusion that this argument is \"idiotic.\" I believe the weight of evidence is strongly on the side that shows native Europeans are dying off and not replacing themselves. In order to pay for the vast socialistic programs enacted, someone has to be there to ante up. The immigrants coming in are largely from North Africa and Turkey. They are largely Muslim. They have a historically and religiously inspired high birth rate. Hmmmmm. Do you think there might be a conclusion to be drawn from these facts? Methinks so..\n\n \n And now you are just making stuff up! \n \n Out of the 5 countries making up North Africa, 2 countries do not even have birth rates at replenishment levels. Nor does Turkey...\n \n Turkey has a birth rate of 1.94, Algeria (1,92), Tunisia (1.75), Egypt (2,88), Morocko (2.73) . Only Lybia has any real birth rate figures of note (3.34). And even this is exeptionally low for an African country...\n \n @ Redratio\n \n And how does this apply to the subject in hand? If you want to talk about european military capabilities, I suggest you start a new thread.", 
   {}, 
   127696, 
   null, 
   1116943380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Europe Closing Shop?", 
  "url": "http://www.4forums.com/political/european-politics-economics/5350-europe-closing-shop.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 5350, 
  "discussion_files": [
   [
    "16905.html", 
    "http://www.4forums.com/political/european-politics-economics/5350-europe-closing-shop-print.html"
   ], 
   [
    "16906.html", 
    "http://www.4forums.com/political/european-politics-economics/5350-europe-closing-shop-3-print.html"
   ], 
   [
    "16907.html", 
    "http://www.4forums.com/political/european-politics-economics/5350-europe-closing-shop-2-print.html"
   ]
  ], 
  "identifier": 5350
 }
]