[
 [
  [
   126452, 
   null, 
   "peddler8111", 
   "This should be easy for you students of evolution.\n How did a lizard evolve an avian lung?\n \n http://www.biology.eku.edu/RITCHISO/birdrespiration.html [/B]", 
   {
    "post_info": {
     "post_title": "[B]The Avian Lung."
    }
   }, 
   null, 
   null, 
   1116746160.0
  ], 
  [
   126466, 
   null, 
   "Close_slave_can", 
   "Whats is difference between the avian lung and a giraffes neck, that is not just long it has to have fancy blood vessels that contract and expand so the pressure in its brain is the same when its head is bent down to drink or raised up high to feed?", 
   {}, 
   126452, 
   null, 
   1116751860.0
  ], 
  [
   126468, 
   null, 
   "Demon38", 
   "What is the problem with reptile to bird lung evolution? Plausible scenarios exist. Are you saying it couldn't have evolved?", 
   {}, 
   126466, 
   null, 
   1116752340.0
  ], 
  [
   126604, 
   null, 
   "pandion", 
   "How did a lizard evolve an avian lung?\nWell, the easy answer is that a lizard didn't evolve an avian lung. There is no known example of a lizard that has an avian lung. However, there is a variety of lung morphologies found in reptiles, including simple sacs in some lizards to the partitioned chambers with intricate support structures in organisms such as monitor lizards and crocodilians. And I am sure that peddler is aware that the crocodilians are the closest living relatives of birds, having arisen from an ancestral archosaur. The dinosaurs, through the ornithodirans, also arose from archosaurs. So the more advanced lung structure may have been ancestral since lizards arose from ancestral diapsids which also gave rise to the archosaurs.\n \n So some birds have a system of (usually) 9 flexible air sacs that that act as bellows to move air through the lungs. Although the air sacs are not directly involved in respiration, they do have other functions, such as thermoregulation and weight reduction. Extensions of these air sacs have invaded the skeleton and form what are called pneumatic bones in birds.\n \n However, there is considerable evidence that this condition occurred in organisms ancestral to birds first. Thus, in the maniraptoriformes it may have been useful in weight reduction in running predators and was retained in birds because the weight reduction was also useful for flight.\n \n But some birds, current and fossil, do not have pneumatic bones. For example, Hesperonis lacked them for obvious reasons. But of course, Hesperonis lacked wings useful for flight.\n \n Looks like peddler is just a parrot of what his controlers have told him to say. To bad he lacks the integrity to educate himself.", 
   {}, 
   126468, 
   null, 
   1116785580.0
  ], 
  [
   126676, 
   null, 
   "peddler8111", 
   "Whats is difference between the avian lung and a giraffes neck, that is not just long it has to have fancy blood vessels that contract and expand so the pressure in its brain is the same when its head is bent down to drink or raised up high to feed?\n\n Can you be a bit more specific?", 
   {}, 
   126466, 
   null, 
   1116791160.0
  ], 
  [
   126850, 
   null, 
   "Close_slave_can", 
   "Can you be a bit more specific?\n\n If you think evolution cannot explain any change then why pick the avian lung in particular? Maybe try and show how genesis can integrate almost or more observations in a meaningful way than evolution, then genesis competes, otherwise it does not.", 
   {}, 
   126676, 
   null, 
   1116806940.0
  ], 
  [
   126975, 
   null, 
   "peddler8111", 
   "If you think evolution cannot explain any change then why pick the avian lung in particular? Maybe try and show how genesis can integrate almost or more observations in a meaningful way than evolution, then genesis competes, otherwise it does not.\n\n Because if evolution cannot explain all changes it is false, Unless you propose some creatures evolved and some were specially created. Is that what you mean?\n \n Genesis says that all creatures were specially created. It fits with the observational evidence but there is no smoking gun that proves it.\n Statis is the norm not the exception.\n \n One is right the other wrong. It cannot be both ways.\n \n Do you have an answer to how a lizard can morph into a bird considering the amazing difference in the lungs?", 
   {}, 
   126850, 
   null, 
   1116824880.0
  ], 
  [
   126977, 
   null, 
   "peddler8111", 
   "What is the problem with reptile to bird lung evolution? Plausible scenarios exist. Are you saying it couldn't have evolved?\n\n Let's hear it . How could mutations and natural selections produce the changes necessary and how could the intermediate be viable?\n There are lots of problems , it is not plausible . It is not possible.", 
   {}, 
   126468, 
   null, 
   1116825060.0
  ], 
  [
   127006, 
   null, 
   "pandion", 
   "Because if evolution cannot explain all changes it is false, Unless you propose some creatures evolved and some were specially created. Is that what you mean?\nThat's just not true. It is a logical fallacy. Evolutionary theory makes no claims to be able to recount every mutation, recombination, migration, random mating, or chance death of every organsim. But the evidence for evolution is beyond dispute. More than 99% of degreed biologists accept evolutionary theory as the best explanation for the observed data.\n \nGenesis says that all creatures were specially created. It fits with the observational evidence but there is no smoking gun that proves it.\nAnd I've never seen anyone present observational evidence that would indicate that all creatures were specially created. Please do so.\n \nStatis is the norm not the exception.\nAnd that remark is relevant because? Just to inform you once again, the word is \"stasis.\" You make yourself look ignorant and foolish when you can't even spell correctly. However, stasis is the norm in a stable environment. The reasons are simple. Organisms tend to become well adapted to a stable environment. As Richard Dawkins would explain, they tend to become adapted to a particular nich in a particular environment, and when that environment undergoes rapid change, they go extinct. The fossil record is full of such examples. Dawkins used the analogy of climbing a mountain of adaptation that made it impossible for the organism to cross to the peak of the new environment. Try reading \"Climbing Mount Improbable\" for an understanding.\n \nOne is right the other wrong. It cannot be both ways.\nRight. I'll go with the observational data every time. I don't think that mythology has much bearing on reality.\n \nDo you have an answer to how a lizard can morph into a bird considering the amazing difference in the lungs?\nYes. I already addressed that issue. You embarrass yourself by bringing it up again without actually presenting any arguments against my points.\n \n But hey. That's creationism. Just keep hammering away at the same old stories no matter how many times they are debunked. It's a bit like Goebbels anthem. Tell a lie often enough and people will begin to believe it.", 
   {}, 
   126975, 
   null, 
   1116827820.0
  ], 
  [
   127091, 
   null, 
   "Clive14", 
   "This should be easy for you students of evolution.\n How did a lizard evolve an avian lung?\nYep it is easy. Lizards didn't evolve an avian lung.\n \n This should be easy for the creationist:\n \n The avian lung is far more efficient than the mammalian lung. Why didn't your god therefore fit the superior lung design to mammals, especially that apparent \"special creation\", us humans? Also please explain why he fitted a superior eye design to squid and octupuses than what he fitted to all vertibrates.\n \n Once you have answered these two easy questions, I've a few hundred more for you :p", 
   {}, 
   126452, 
   null, 
   1116846840.0
  ], 
  [
   127946, 
   null, 
   "gnojek", 
   "Because if evolution cannot explain all changes it is false,\n\n So if genesis can't explain some things then it is false?\n \n Ok, genesis, and all you theologians out there, a quick question off the top of my head.\n \n Using only scripture, please explain why dinosaurs are extinct.", 
   {}, 
   126975, 
   null, 
   1116960600.0
  ], 
  [
   127990, 
   null, 
   "Demon38", 
   "Let's hear it . How could mutations and natural selections produce the changes necessary and how could the intermediate be viable?\n \n \n Had to do a little research, but found some interesting stuff about avian lung evolution. First of all, it is plausible that the reptilian lung could have evolved into the avian lung. From here:\n Avilung \n \n \"Those who argue it is impossible appear to assume that only one lung type can exist at a time. But there are elements of the avian lung system that would benefit a creature with a more reptilian lung.\n \n For example, the avian lung has air sacs that play a role in air movement, but little or no role in blood oxygenation. A reptilian lung also has areas without the vascularization and septae that carry out the oxygenation. It is not hard to imagine air sacs forming from these areas and increasing lung ventilation.\n \n So, formation of airsacs is not hard to imagine. The next big issue is the one-way air flow of the avian lung versus the tidal flow of the reptilian lung.\n \n The reptilian lung has septae projecting into the lung interior from the lung wall. This is very different from the alveoli (tiny vascularized air sacs) of the mammalian lung. It is not difficult to imagine these septae growing together to form vascularized tubes. Why would this be of some advantage?\n \n Well, there could be areas in the reptilian-lung-with-air-sacs where the air flow has modest pressure and velocity during inhalation, but higher velocity and pressure during exhalation. This could happen due to the shape of the lung, the shape of the air sac, the specific manner in which the air sac and/or lung are expanded and compressed, the shape of the passage from lung to air sac, the growth of valve-like flaps in some area, etc.\n \n With this higher pressure/velocity during exhalation, the lung could then begin pumping air through the tubes in a mostly one-way manner like an avian lung does. This would increase the efficiency of the lung, even though it is still operated in a bellows fashion like a reptilian lung.\n \n The changes I described could occur first in a small area of the lung. The benefit of the change could create evolutionary pressure toward larger areas of change and/or change at multiple sites in the lung. Eventually, the modified portion of the lung would be providing the bulk of the respiration, and the evolutionary pressure would be toward improvement of that system and gradual deterioration of the reptilian system.\"\n \n And here's an article on the selection pressures that caused the avian lung to evovle: \n dinolung \n \n \"Now, a University of Washington paleontologist theorizes that low oxygen and repeated short but substantial temperature increases because of greenhouse warming sparked two major mass-extinction events, one of which eradicated 90 percent of all species on Earth.\n In addition, Peter Ward, a UW professor of biology and Earth and space sciences, believes the conditions spurred the development of an unusual breathing system in some dinosaurs, a group called Saurischian dinosaurs that includes the gigantic brontosaurus. Rather than having a diaphragm to force air in and out of lungs, the Saurischians had lungs attached to a series of thin-walled air sacs that appear to have functioned something like bellows to move air through the body. \n Ward, working with UW biologist Raymond Huey and UW radiologist Kevin Conley, believes that breathing system, still found in today's birds, made the Saurischian dinosaurs better equipped than mammals to survive the harsh conditions in which oxygen content of air at the Earth's surface was only about half of today's 21 percent.\"\n \n There you go, what's your refutation?", 
   {}, 
   127946, 
   null, 
   1116964500.0
  ], 
  [
   128182, 
   null, 
   "peddler8111", 
   "Had to do a little research, but found some interesting stuff about avian lung evolution. First of all, it is plausible that the reptilian lung could have evolved into the avian lung. From here:\n Avilung \n\n The article starts out with an ad homien attack on Dr. Safarti. They try to portray a Phd Scientist an a WORLD CLASS chess player as a fool. This is not how scientist behave. This discredits anything they have to say. The author goes on to attack Dr.Safarti by sayining his chemistry is fallacious whatever that means. Dr.Safarti has a PHD in chemistry the author ,who knows. National Geographic would be proud. If you want to have me read your links try linking them to a scientific site not a political/religious one that supports the atheistic politicians at the so called nat science foundation. That's a joke.\n \n\n \n \"Those who argue it is impossible appear to assume that only one lung type can exist at a time. But there are elements of the avian lung system that would benefit a creature with a more reptilian lung.\n A tail would benefit humans -so what? A dog could benefit from a human brain. This is what you call proof?\n \n\n For example, the avian lung has air sacs that play a role in air movement, but little or no role in blood oxygenation. A reptilian lung also has areas without the vascularization and septae that carry out the oxygenation. It is not hard to imagine air sacs forming from these areas and increasing lung ventilation.\n It's not hard to imagine it is impossible to conceive. This is the stuff of fairy tales. Subjunctivitus.\n \n\n So, formation of airsacs is not hard to imagine. The next big issue is the one-way air flow of the avian lung versus the tidal flow of the reptilian lung.\n Not hard for someone who decided in advance. Impossible for a research scientist. It is absurd.\n \n\n The reptilian lung has septae projecting into the lung interior from the lung wall. This is very different from the alveoli (tiny vascularized air sacs) of the mammalian lung. It is not difficult to imagine these septae growing together to form vascularized tubes. Why would this be of some advantage?\n\n Every statement includes it is not hard or difficult to [IMAGINE[/b] This is not an argument it is babbling.\n \n\n Well, there could be areas in the reptilian-lung-with-air-sacs where the air flow has modest pressure and velocity during inhalation, but higher velocity and pressure during exhalation. This could happen due to the shape of the lung, the shape of the air sac, the specific manner in which the air sac and/or lung are expanded and compressed, the shape of the passage from lung to air sac, the growth of valve-like flaps in some area, etc.\n Well there could be a Santa Clause in an alternative Universe that kills children who are good and gives their toys to bad ones. This is so loony it is almost funny.\n \n\n With this higher pressure/velocity during exhalation, the lung could then begin pumping air through the tubes in a mostly one-way manner like an avian lung does. This would increase the efficiency of the lung, even though it is still operated in a bellows fashion like a reptilian lung.\n Are you sure you read this yourself?\n \n\n The changes I described could occur first in a small area of the lung. The benefit of the change could create evolutionary pressure toward larger areas of change and/or change at multiple sites in the lung. Eventually, the modified portion of the lung would be providing the bulk of the respiration, and the evolutionary pressure would be toward improvement of that system and gradual deterioration of the reptilian system.\"\n \n And here's an article on the selection pressures that caused the avian lung to evovle: \n dinolung \n \n Fascinating, more subjunctive phrases. I'm surprised!\n \n\n \"Now, a University of Washington paleontologist theorizes that low oxygen and repeated short but substantial temperature increases because of greenhouse warming sparked two major mass-extinction events, one of which eradicated 90 percent of all species on Earth.\n In addition, Peter Ward, a UW professor of biology and Earth and space sciences, believes the conditions spurred the development of an unusual breathing system in some dinosaurs, a group called Saurischian dinosaurs that includes the gigantic brontosaurus. Rather than having a diaphragm to force air in and out of lungs, the Saurischians had lungs attached to a series of thin-walled air sacs that appear to have functioned something like bellows to move air through the body. \n Ward, working with UW biologist Raymond Huey and UW radiologist Kevin Conley, believes that breathing system, still found in today's birds, made the Saurischian dinosaurs better equipped than mammals to survive the harsh conditions in which oxygen content of air at the Earth's surface was only about half of today's 21 percent.\"\n \n There you go, what's your refutation?\n\n I must admit this is a very long winded fairy tale you tell.\n I  imagine  it [b] could be [b/] one of the lamest arguments I have ever heard in my life.", 
   {
    "unicode_changes_made": true
   }, 
   127990, 
   null, 
   1116993300.0
  ], 
  [
   128187, 
   null, 
   "peddler8111", 
   "So if genesis can't explain some things then it is false?\n \n Ok, genesis, and all you theologians out there, a quick question off the top of my head.\n \n Using only scripture, please explain why dinosaurs are extinct.\n\n Genesis in a history book not a science book. The dinosaurs where not extinct then.\n If one single animal did not evolve from some mythical chemical mix then evolution is false. The avian lung is evolutions achilles heel.", 
   {}, 
   127946, 
   null, 
   1116993900.0
  ], 
  [
   128189, 
   null, 
   "peddler8111", 
   "Yep it is easy. Lizards didn't evolve an avian lung.\n \n This should be easy for the creationist:\n \n The avian lung is far more efficient than the mammalian lung. Why didn't your god therefore fit the superior lung design to mammals, especially that apparent \"special creation\", us humans? Also please explain why he fitted a superior eye design to squid and octupuses than what he fitted to all vertibrates.\n \n Once you have answered these two easy questions, I've a few hundred more for you :p\n\n Only an atheist is arrogant enough to presume to question why God decided to do that.\n The greatest scientist in history said about the order of the universe:\n The Author of the system must have found it convenient.\n \n Birds did not evolve one either. They were created with it up an running.", 
   {}, 
   127091, 
   null, 
   1116994200.0
  ], 
  [
   128191, 
   null, 
   "peddler8111", 
   "Embryo Studies Show Dinosaurs Could Not Have Given Rise To Modern Birds\n CHAPEL HILL -- Careful study of bird, alligator and turtle embryos at early stages offer convincing evidence that the \"fingers\" of bird wings correspond to the index, middle and ring fingers of humans, while the little finger and \"thumb\" have been lost. \n \n Related News Stories \n Scientist Says Ostrich Study Confirms Bird \"Hands\" Unlike Those Of Dinosaurs (August 15, 2002) -- Drs. Alan Feduccia and Julie Nowicki of the University of North Carolina at Chapel Hill have opened a series of live ostrich eggs at various stages of development and found what they believe is proof ... < full story\n \n New Sickle-Clawed Fossil From Madagascar Links Birds And Dinosaurs (March 16, 1998) -- A new raven-sized fossil bird, showing clear evidence of the close relationship between theropod dinosaurs and birds, has been discovered on the island of Madagascar by scientists working under a ... < full story\n \n New Study Suggests Missing Link That Explains How Dinosaurs Learned To Fly (January 17, 2003) -- Two-legged dinosaurs may have used their forelimbs as wing-like structures to propel themselves rapidly up steep inclines long before they took to the skies, reports a University of Montana ... < full story\n \n New Theory Of The Evolution Of Bird Flight Linked To Parental Care (January 30, 2002) -- Modern birds evolved from ground-dwelling reptiles as their increasingly refined parenting skills led them into the trees, where they could better protect their young, proposes a researcher at the ... < full story\n \n < more related stories\n \n \n --------------------------------------------------------------------------------\n Related sections: Plants & Animals\n Fossils & Ruins \n \n \n \n \n \n Such developmental evidence of digit identity conflicts with the theory that modern birds arose from dinosaurs as some paleontologists have claimed since the 1970s. Dinosaurs had \"fingers\" corresponding to the first, second and third fingers on human hands, and as a result, it is almost impossible to envision how a bird wing could have evolved from a dinosaur hand. \n \n That's the view expressed in Friday's (Oct. 24) issue of the journal Science. \n \n Dr. Ann C. Burke, a developmental biologist who is assistant professor at the University of North Carolina at Chapel Hill, conducted the new studies and wrote the Science article with Dr. Alan Feduccia, professor and chair of biology at UNC-CH. Feduccia has been a strong critic of the belief that dinosaurs gave rise to birds. \n \n \"The theory that birds descended from dinosaurs has become dogma in the past 20 years or so, and yet a large number of people do not accept it because there are insurmountable problems with that theory,\" Feduccia said. \"First, there is the time problem in that superficially bird-like dinosaurs occurred some 30 million to 80 million years after the earliest known bird, which is 150 million years old.\" \n \n Most of the bird-like dinosaurs were \"looking at the meteor some 65 million years ago,\" he said, a reference to the giant meteor believed to have struck the Earth then and killed off all dinosaurs within a short time. \n \n \"Second, flesh-eating dinosaurs thought to have given rise to birds were large earth-bound creatures with heavy balancing tails and short forelimbs. This is absolutely the worse body plan for the evolution of bird flight.\" \n \n Third, he said, if one views a chicken skeleton and a dinosaur skeleton through binoculars they appear similar, but close and detailed examination reveals many differences. Theropod dinosaurs, for example, had curved, serrated teeth, but the earliest birds had straight, unserrated peg-like teeth. \n \n All dinosaurs had a major joint in the lower jaw that early birds did not. Birds have a reversed rear toe that opposes the front three toes and allows birds to perch. Dinosaurs had no reversed toe. Birds grow a girdle of bone in their chests quite different from dinosaur chests. \n \n The new work involved microscopic examination of early limb development in ostriches, chickens, cormorants, alligators and turtles and comparison of chick fore- and hindlimbs. \n \n \"We know that dinosaurs developed \"hands\" with digits one, two and three -- which are the same as the thumb, index and middle fingers of humans -- because digits four and five remain as tiny bumps or vestiges on early dinosaur skeletons,\" Feduccia said. \"Apparently dinosaurs developed a very specialized, almost unique \"hand\" for grasping and raking. \n \n \"Our studies of bird embryos, however, show that only digits two, three and four develop, and this creates a new problem,\" he said. \"How do you derive a bird \"hand,\" for example, with digits two, three and four from a dinosaur hand that has only digits one, two and three\" The answer is that you can't.\" \n \n Findings from the examination of alligator and turtle embryos were consistent with those of birds, the biologist added. \n \n Far more likely is that birds and dinosaurs had a much older common ancestor, he said. Many superficial similarities between birds and dinosaurs arose because both groups developed body designs for walking upright on two hind legs and began to resemble each other over millions of years. \n \n \"The dinosaurian origin of birds is based on sloppy science,\" Feduccia said. \"It is a fantasy by which one believes it's possible vicariously to study dinosaurs at the backyard bird feeder.\" \n \n In an accompanying commentary in Science titled \"The Forward March of the Bird-Dinosaur Halted?\", Dr. Richard Hinchliffe of the University of Wales said the new report calls into question the dinosaurs-to-birds idea and is a forceful statement of the opposing theory. \n \n \"...The present paper gives the developmental evidence a sharp focus which makes it a timely contribution to current debate on bird origins,\" wrote Hinchliffe, the world authority on vertebrate limb development. \"This convincing evidence of 2-3-4 wing digit identity will not be to the liking of ... supporters of a dinosaur origin of birds. \n \n \"For the time being, this important developmental evidence that birds have a 2-3-4 digital formula, unlike the dinosaur 1-2-3, is the most important barrier to belief in the dinosaur-origin orthodoxy.\" \n \n \n --------------------------------------------------------------------------------\n \n This story has been adapted from a news release issued by University Of North Carolina At Chapel Hill.", 
   {}, 
   128189, 
   null, 
   1116994620.0
  ], 
  [
   128202, 
   null, 
   "Demon38", 
   "I must admit this is a very long winded fairy tale you tell.\n \n \n And yet you can offer nothing to show it's impossible! It most certainly is a plausible explaination! Fairytale?!? Don't think so, a logical path for the developement of the avian lung.", 
   {}, 
   128189, 
   null, 
   1116995820.0
  ], 
  [
   128206, 
   null, 
   "peddler8111", 
   "And yet you can offer nothing to show it's impossible! It most certainly is a plausible explaination! Fairytale?!? Don't think so, a logical path for the developement of the avian lung.\n\n Look at the 2 side by side. They are as different as night and day. No creature can live without breathing for millions of years except in fairy tales.", 
   {}, 
   128202, 
   null, 
   1116996660.0
  ], 
  [
   128209, 
   null, 
   "Demon38", 
   "From here:\n Dinodigit \n \n \"Burke and Feduccia conclude (1) that the development of the avian hand is incompatible with a dinosaurian ancestry of birds. This conclusion, however, does not fit the data; the theropod manus has a unique and extraordinary pattern of digit reduction (1, 2) that must be based on a derived pattern of development. The identification by Burke and Feduccia (1) of the posterior digit in the avian hand as digit IV is based on the assumptions that digit IV is the first to develop, that the pattern of development in the avian hand is not extraordinary, and that the development of the avian foot and hand are equivalent. Because these assumptions are not correct for theropod dinosaurs, Burke and Feduccia have effectively assumed that birds are not dinosaurs, and the report's conclusion that they are not inevitably follows irrespective of the results of the experiments in the report, or of evolutionary history. Furthermore, these assumptions appear tautological--they are not independent of each other, nor of the conclusions reached in the report.\"\n \n And in the same article:\n \n \"The developmental aspects of the avian hand reported by Burke and Feduccia are, despite their conclusion to the contrary, entirely consistent with a theropod origin of birds.\"\n \n So the evidence for dino to bird evolution isn't completely conclusive. Burke and Feduccia are definitely in the minority and their hypothesis is far from accepted. The present view by the majority of paleontologists is that birds evolved from dinosaurs. All the experts you've quoted agree that birds DID evolve, not from dinosaurs but from an earlier reptile. Once again, they all accept that birds evolved, what is in question is from what did they evolve from.", 
   {}, 
   128202, 
   null, 
   1116997020.0
  ], 
  [
   128210, 
   null, 
   "Demon38", 
   "Look at the 2 side by side. They are as different as night and day. No creature can live without breathing for millions of years except in fairy tales.\n \n \n Yes, and a plausible, possible explaination of how one evolved into another was presented, you're the only one talking about a creature not breathing for millions of years. This goes back to your complete lack of knowledge of evolution........ Where did you demonstrate that the avian lung could not evolve from the dinosaurian lung?", 
   {}, 
   128209, 
   null, 
   1116997200.0
  ], 
  [
   128240, 
   null, 
   "peddler8111", 
   "Yes, and a plausible, possible explaination of how one evolved into another was presented, you're the only one talking about a creature not breathing for millions of years. This goes back to your complete lack of knowledge of evolution........ Where did you demonstrate that the avian lung could not evolve from the dinosaurian lung?\n\n Science is about knowledge , not imagination. All there is a sevidence is imagination. it is all based on the assumption of naturalism , not science.\n \n People for the Ethical Treatment of Stuffed Toys (PETST) recently contacted me about my photos of a stuffed Darwin doll being horribly crushed in a vise. They are now seeking a restraining order to bar any further such treatment of toys in my attic. Furthermore, in conjunction with the National Center for Selling Evolution (NCSE), they have promised to start a national campaign against intelligent design under the banner: \"Intelligent Design Is Voodoo Science.\" Just remember, you heard it here first!", 
   {
    "post_info": {
     "attachments": 1
    }, 
    "unicode_changes_made": true
   }, 
   128210, 
   null, 
   1117001700.0
  ], 
  [
   128263, 
   null, 
   "Close_slave_can", 
   "Is that a mouse trap in darwins Beard, as well as his head \n in a vice? Double blasphemy, you would go straight to hell if it \n existed? Seriously though are you saying all the evidence connected to theories of evolution is imaginary?", 
   {}, 
   128240, 
   null, 
   1117007880.0
  ], 
  [
   128269, 
   null, 
   "Clive14", 
   "Only an atheist is arrogant enough to presume to question why God decided to do that.\nKudos to athiests then.\n \n \nThe greatest scientist in history said about the order of the universe:\n The Author of the system must have found it convenient.\nThat's your answer is it: you believe your god just bodged together life in a convenient fashion rather than doing a proper job? What a lazy-arsed god you believe in.", 
   {}, 
   128189, 
   null, 
   1117009680.0
  ], 
  [
   128320, 
   null, 
   "peddler8111", 
   "Yes, and a plausible, possible explaination of how one evolved into another was presented, you're the only one talking about a creature not breathing for millions of years. This goes back to your complete lack of knowledge of evolution........ Where did you demonstrate that the avian lung could not evolve from the dinosaurian lung?\n\n The burden of proof is on you. You are claiming it is a scientific fact.\n There is no known way this could possibly happen.\n To decide it did despite this is a religious belief not science. It is your axiom not a reasonable interpretation of the evidence.\n I can't prove that Superman was really a coward and refused to fight the Germans but I am quite sure that is the case. Prove me wrong if you can.\n That makes as much sense as your argument.", 
   {}, 
   128210, 
   null, 
   1117034340.0
  ], 
  [
   128325, 
   null, 
   "peddler8111", 
   "Kudos to athiests then.\n \n That's your answer is it: you believe your god just bodged together life in a convenient fashion rather than doing a proper job? What a lazy-arsed god you believe in.\n\n \n Sir Issac Newton was an idiot and you are a genius? Hmm. Let me think about that for a second?\n Your god does not exist and therfore did nothing. My God only had to speak.", 
   {}, 
   128269, 
   null, 
   1117034580.0
  ], 
  [
   128326, 
   null, 
   "Clive14", 
   "Sir Issac Newton was an idiot and you are a genius? Hmm. Let me think about that for a second?\nYou really think so? Im flattered, but I think you are wrong.", 
   {}, 
   128325, 
   null, 
   1117034820.0
  ], 
  [
   128334, 
   null, 
   "peddler8111", 
   "Is that a mouse trap in darwins Beard, as well as his head \n in a vice? Double blasphemy, you would go straight to hell if it \n existed? Seriously though are you saying all the evidence connected to theories of evolution is imaginary?\n\n Clive I really am starting to believe you are so indoctrinated you have become a robot in a way.\n There is no evidence connected to anything!\n Please try and think for yourself. There is no pile of evidence that the evolutionist have and there is no pile of evidence the Creationist have.\n There is only the evidence and it cannot speak for itself.\n \n The evolutionist interprets it as proof that god is unnecessary.\n \n The Creationist interprets it as that God created everything.\n \n You must decide which interpretation fits the evidence.\n \n The real question is are you a Christian , a Jew, a pagan , a polytheist ,agnostic or an atheist ?\n \n All ot the observable evidence fits the Creation model perfectly. Evolution disregards any hard evidence that contradicts it.\n \n For example coal is said to be billions of years old. It almost invariably registers as less than 15k with carbon dating. It would not register at all with carbon dating if it was a million years old let alone billions.\n This is ignored. Coal and oil can and have been produced in a labroratory in weeks not billions of years, this is ignored.\n Diamonds and opals can be produced in the lab. There are minute differences in them and naturally occuring ones so the evolutionist say that is evidence for billions of years. That is nonsense.\n Clocks and fishing reals have been found encased in rock. Rocks can be formed in the lab.\n Sedimentation has happened recently in a matter of hours that is taught to take billions of years, this is ignored.\n Canyons are formed in a matter of days , Islands that look as old as anything on earth appear in a matter of days .\n \n Evolution extrapolates evidence by saying if you add billions of years to small variations within a species lizards will turn into birds. That is based on imagination not observation.\n \n The evidence is the same for everyone. The evidence is , no one owns it.\n Please think about that.", 
   {}, 
   128263, 
   null, 
   1117035780.0
  ], 
  [
   128345, 
   null, 
   "Close_slave_can", 
   "There is only the evidence and it cannot speak for itself.\n \n The evolutionist interprets it as proof that god is unnecessary.\n \n The Creationist interprets it as that God created everything.\n \n You must decide which interpretation fits the evidence.\n \n\n \n I think both of those interepations are quite inappropriate. I think it just plain crazy to start thinking about the existance or non-existance of supreme beings when you are looking at fossils.", 
   {}, 
   128334, 
   null, 
   1117037640.0
  ], 
  [
   128347, 
   null, 
   "Clive14", 
   "Clive I really am starting to believe you are so indoctrinated you have become a robot in a way.\nYou were replying to Close_slave_can. Why are you therefore addressing the reply to me?\n \n \nThere is no evidence connected to anything!\nReally? There is no evidence for gravity? No evidence that organisms are composed of cells? No evidence that light exists? No evidence that the Earth goes around the Sun?\n \n \nPlease try and think for yourself. There is no pile of evidence that the evolutionist have and there is no pile of evidence the Creationist have.\nHalf right. There is no pile of evidence the Creationist have. The \"evolutionists\" are near buried under the evidence that supports their position though.\n \n \nThere is only the evidence and it cannot speak for itself.\nLikewise there is only the evidence and it cannot speak for itself in regard to whether the Earth is a sphere or flat then? So the flat-earthers simply interpret the evidence differently?\n \n \nThe evolutionist interprets it as proof that god is unnecessary.\nNo you are mistaken. Many \"evolutionists\" are religious people that believe in a god. \n \n \nThe Creationist interprets it as that God created everything.\nThis is true. They misinterpret the evidence to fit their faith.\n \n \nYou must decide which interpretation fits the evidence.\nI opt for the honest interpretation.\n \n \nThe real question is are you a Christian , a Jew, a pagan , a polytheist ,agnostic or an atheist ?\nIs it? Who says? It's an irrelevent question.\n \n \nAll ot the observable evidence fits the Creation model perfectly.\nNo it really doesn't. That is why YEC \"theory\" has been falified: there is no evidence that fits a literal interpretation of Biblical creation.\n \n \nEvolution disregards any hard evidence that contradicts it.\nIncorrect. Science changes to fit the new evidence. That is the nature of science.\n \n \nFor example coal is said to be billions of years old.\nBy creationists maybe, not by anyone who knows what they are talking about though. Coal is formed from dead trees and thus has to be less than 1/2 billion years old. It cannot be billions of years old.\n \n \nIt almost invariably registers as less than 15k with carbon dating. It would not register at all with carbon dating if it was a million years old let alone billions. This is ignored. \nIncorrect, it is not ignored. It is investigated. Coal and oil are known to be far older than the 50Ka or so that carbon dating can measure. So when carbon dating dates it as less than 50Ka, it needs explaining, not ignoring. Investigations reveal that it is only coal and oil in close proximity to the air or radioactive rocks or that have been exposed to Sulfur bacteria that show these oddly young ages. This offers an explanaition therefore: the coal and oil have been radioactively contaminated. It is the creationist-lie websites that ignore things as this explanaition is never revealed.\n \n \nCoal and oil can and have been produced in a labroratory in weeks not billions of years, this is ignored.\nOf course it is ignored as temperatures and pressures that do not exist in the natural world are sued to create them.\n \n \nDiamonds and opals can be produced in the lab. There are minute differences in them and naturally occuring ones so the evolutionist say that is evidence for billions of years. That is nonsense.\nNot nonsense: it's sensible. When pressures and temperatures thousands of times greater than exist anywhere on Earth (that'll be your \"minute differences\") are used, it is inane to attempt to suggest they are comparible.\n \n \nClocks and fishing reals have been found encased in rock.\nAnd?\n \n \nRocks can be formed in the lab.\nSo can computers. I guess they form naturally too therefore?\n \n \nSedimentation has happened recently in a matter of hours that is taught to take billions of years, this is ignored.\nNo it isn't ignored. It is carefully explained to rather dense creationists that the two aren't comparible.\n \n \nCanyons are formed in a matter of days\nAnd some take millions of years. Your point?\n \n \nIslands that look as old as anything on earth appear in a matter of days .\nPlease supply an example of a few days old island that looks billions of years old. You are making this one up.\n \n \nEvolution extrapolates evidence by saying if you add billions of years to small variations within a species lizards will turn into birds. That is based on imagination not observation.\nEvolution has never claimed that lizards turned into birds. Lizards are a modern group of animals, just like birds. The oldest known lizard fossils are around 100 million years old. \n \n \nThe evidence is the same for everyone. The evidence is , no one owns it.\n Please think about that.\nIf only that were true. Sadly the creationist movement thrives on taking evidence and misprepresenting it, ignoring it and blatantly lying about it. Not all evidence interpretation is equal sadly.", 
   {}, 
   128334, 
   null, 
   1117038240.0
  ], 
  [
   128354, 
   null, 
   "pandion", 
   "Clocks and fishing reals have been found encased in rock.\nAs already explained, the fishing reel has been shown to be a fake, a fraud perpetrated by a creationist whose purpose was to show that the earth is young.\n \n I'm sure that we will continue to see peddler tout the fishing reel in a rock as evidence of something even though it was a not-too-good fraud. It was good enough to fool the creationists who looked at it and it was very carefully protected from observation by qualified geologists. For good reason. The first qualified scientist to see it debunked it.\n \n On the other hand, peddler will continue to talk about the Piltdown Man fraud, a very good fake perpetrated on science and debunked by scientists. Or Nebraska Man, a mistake by a collector that was overreported by a news magazine. It was never described or reported in scientific literature. The mistake was discovered by scientists.\n \n He will also continue to babble on about another good fake that was never described and reported in the scientific literature, Archaeoraptor. This fraud was also debunked by scientists, the first ones to examine it.\n \n And, of course, there is peddler's claim that Archaeopteryx is a fraud. That claim was made by 2 astronomers, an electronics expert, a physician and a physicist. Their claims have also been debunked completely. Only ignorant creationists still claim fraud.", 
   {}, 
   128347, 
   null, 
   1117039740.0
  ], 
  [
   128482, 
   null, 
   "peddler8111", 
   "Really? There is no evidence for gravity? No evidence that organisms are composed of cells? No evidence that light exists? No evidence that the Earth goes around the Sun?\nThere is evidence but it is not connected. To compare observational evidence to imagination in the interpretation of fossils is disingenuous\n \n\n Half right. There is no pile of evidence the Creationist have. The \"evolutionists\" are near buried under the evidence that supports their position though.[/b]\n[b] Only if viewed with the presupposition of naturalism .\n \n\n Likewise there is only the evidence and it cannot speak for itself in regard to whether the Earth is a sphere or flat then? So the flat-earthers simply interpret the evidence differently? \nYou are trying to link fairy stories with observable science.\n \n\n No you are mistaken. Many \"evolutionists\" are religious people that believe in a god. \nMany religious people worship satan . You can claim to be religious if you worship your cat. Theistic evolutionist create their own god to fit with the opinions of atheistic scientist. When the theory changes their religion changes.\n \n\n This is true. They misinterpret the evidence to fit their faith.\n So you are saying anyone who is not an atheist is an idiot or are you trying to say theistic evolutionist are XXXXXX?\n Everyone interprets evidence to fit there belief. Evolution is a belief it cannot be observed, only imagined.\n \n\n I opt for the honest interpretation.\n From the folks that gave us piltdown man and \"piltdown\" bird , the dating disaster and murdered people for museum display's? Brilliant deduction.\n \n \n\n \n No it really doesn't. That is why YEC \"theory\" has been falified: there is no evidence that fits a literal interpretation of Biblical creation.\n Not to an atheist or a theistic evolutionist who thinks atheist are superior to them.\n It fits perfectly. Even Darwin said that , so did Crick and Gould. It is only the XXXXXX at the Nat Center for Selling Evolution and talk/origin types that deny the appearance of design. \n The Bible say that animals would produce after their kind. Falsify that professor. Give me of a dog bearing a non dog.\n \n\n Incorrect. Science changes to fit the new evidence. That is the nature of science.\n Did it ever occur to you that means the evidence is very , very often wrong? You disregard the Bible out of hand knowing that science will change it's mind on almost everything to do with evolution. It already has.\n \n\n By creationists maybe, not by anyone who knows what they are talking about though. Coal is formed from dead trees and thus has to be less than 1/2 billion years old. It cannot be billions of years old.\n It is no where near a million years old. You can you produce it in a lab and carbon date it. The 1/2 billion or millions of years or whatever todays fairy story is is impossible. It is is a religious belief not science. It is based on the assumption the world is old enough to account for evolution. It is reasoning in a circle.\n [quote\n Incorrect, it is not ignored. It is investigated. Coal and oil are known to be far older than the 50Ka or so that carbon dating can measure. So when carbon dating dates it as less than 50Ka, it needs explaining, not ignoring. Investigations reveal that it is only coal and oil in close proximity to the air or radioactive rocks or that have been exposed to Sulfur bacteria that show these oddly young ages. This offers an explanaition therefore: the coal and oil have been radioactively contaminated. It is the creationist-lie websites that ignore things as this explanaition is never revealed.[/quote] That is reasoning in a circle. We know the coal is very old even though it can be produced from garbage in a matter of weeks. More than 90 percent of all dating is thrown out not because of improper technique or contamination but because it does not fit the evolution timeline. \n \n\n \n Of course it is ignored as temperatures and pressures that do not exist in the natural world are sued to create them.\n You don't know that they did not exist . You don't know what catastrophes could have created those conditions. That is a dispute not a refute and you are to blind to see the difference.\n \n \n And some take millions of years. Your point?[/quote] It has been observed that it can happen quickly the millions of years is not science but pure imagination. \n \n\n Please supply an example of a few days old island that looks billions of years old. You are making this one up.\n \n Evolution has never claimed that lizards turned into birds. Lizards are a modern group of animals, just like birds. The oldest known lizard fossils are around 100 million years old. \n I already did Surtsey Island. If you want more Hawaii , New Zealand , the New Krakatoa all look as old as anyplace on earth.\n You have no idea what something billions of years old would look like. How would you? That's impossible .\n \n\n If only that were true. Sadly the creationist movement thrives on taking evidence and misprepresenting it, ignoring it and blatantly lying about it. Not all evidence interpretation is equal sadly.\nAnyone that disagrees with you is a liar. I have no more time to talk to stupid children who claim they can not be wrong and anyone who disagrees with them is a liar.\n cya", 
   {}, 
   128347, 
   null, 
   1117058040.0
  ], 
  [
   128665, 
   null, 
   "Clive14", 
   "Since peddler has me on his ignore list, I'd prefer not to waste my time replying to his last post. However if anyone wants me to, please speak up here and I'll do so.", 
   {}, 
   128482, 
   null, 
   1117104060.0
  ], 
  [
   128666, 
   null, 
   "Symbiote", 
   "Evolution is a belief it cannot be observed, only imagined.\n\n \n It might help if you understood what evolution was; a change in the frequency of alleles from one generation to the next. It may be observed with relative ease - especially with regards to simple traits, such as hair or eye colour.\n \n You yourself believe evolution occurs, you only object to a few particular examples of evolution, for example between kinds, or over long periods of time.\n \n \n Only if viewed with the presupposition of naturalism .\n\n \n The physical sciences must operate in a naturalist world to discover anything of any worth. If instead of asking \"why do things get hot when you rub them?\" and answering friction, a \"Heat Creation Scientist\" answered \"God made it that way\", we would lose a great deal of practical importance.", 
   {}, 
   128665, 
   null, 
   1117104600.0
  ], 
  [
   128716, 
   null, 
   "peddler8111", 
   "It might help if you understood what evolution was; a change in the frequency of alleles from one generation to the next. It may be observed with relative ease - especially with regards to simple traits, such as hair or eye colour.\n I know that is the way it is portrayed but that is disingenuous. If that was what you really meant I would agree. It is not. What you really mean if you add the miracles of the god of chance [chaos] and time [cronos] this explains the existence of all the bio-diversity on earth.\n The word genus means kind. There is great variation-[evolution]-if you will , between animals of the same genus -kind- but none between animals of different ones. You can cross a little dog with a big dog and end up with a medium size dog. Crossing a cat and a dog is impossible as is your hidden definition of evolution.\n If you want to believe that I don't understand what alleles means then so be it. I do , I wonder why you cannot understand that this does not turn one genus-[kind]-into another.\n \n\n You yourself believe evolution occurs, you only object to a few particular examples of evolution, for example between kinds, or over long periods of time.\n That is like saying I believe in capital punishment but feel imposing it for talking in class in the first grade is excessive.\n One is as far removed from the other as is possible.\n Depends on what you mean by a long period of time. To believe that changes within a genus -[kind]-over a hypothetical millions of years senario results in new genus's -[kinds]- is a fairy tale not science. I don't have any objection to fairy tales unless they are meant to be taken as fact.\n \n \n\n \n The physical sciences must operate in a naturalist world to discover anything of any worth. If instead of asking \"why do things get hot when you rub them?\" and answering friction, a \"Heat Creation Scientist\" answered \"God made it that way\", we would lose a great deal of practical importance.\n\n This is simply not true. Scientist are not robots and they all have pre-suppositions. Your reference to a \"Heat Creation Scientist\" is laughable and shows your complete and total ignorance of science and ability to think for yourself.\n The history of science is obviously of no interest to you. You might be suprised that the theory of gasses in space somehow condensing to become stars was discovered at a seance in the 1600's . It is still believed to day. Spontaneous Generation of life [abio-genesis]is an ancient pagan belief and is still believed today.\n The greatest scientist in history were Christians that believed God created the Universe and created every living organism by the power of His voice.\n Science was born in predominatley Christian europe and every single university it was studied in was built by Christians. Oxford, Cambridge, Harvard Yale, Princeton etc.\n Your argument that science demands that scienctist dismiss the possibilty that miracles from God occur is ludicrous. That Christians who are scientist are stupid and unscientific makes me question your intelligence\n The most ludicrous thing you maintain is that evolutionist are nuetral and have no pre-suppositions. Naturalism/atheism is definiteley a pre-supposition.\n Evolution is atheistic regardless of your personal beliefs. It requires no miracles from God, that is atheism. Science means to know and therefore miracles are not science. The study of there affects however is.\n Have you ever heard of Newton , or Kelvin ? Are the M.R.I. and the Laser , the Airplane etc. the inventions of non-scientific religious nuts too stupid to understand friction?\n I understand evolution I just don't believe the fairy tale that fish walked out of the sea and we all came from a common ancestor that was not Human. Actually not even an animal just a bunch of randomly mixed amino acids.\n Long ago and far far away!\n Believe what you wish . I am a child of God not a mistake . So are you, I am sorry you believe you are nothing more that an accident of nature. What purpose does your life have?", 
   {}, 
   128666, 
   null, 
   1117120860.0
  ], 
  [
   128720, 
   null, 
   "Symbiote", 
   " I know that is the way it is portrayed but that is disingenuous.\n\n \n That's not the \"way it is portrayed\", that's what it is. And if you want to argue against \"evolution\", that's what you'll have to argue against.\n \n If you want to argue against atheism, secularism, the big bang, or some such, be my guest, but don't call them evolution and get a response other than everyone in the room rolling their eyes at you.\n \n \nWhat you really mean if you add the miracles of the god of chance [chaos] and time [cronos] this explains the existence of all the bio-diversity on earth.\n\n \n Evolution is used as an explanatory tool to explain, in naturalistic terms, how complex life could have arisen on Earth. This explanation itself isn't \"evolution\", its an application of evolution to the field of History. Whether the orthodox Evolutionary History view is correct or incorrect, evolution itself remains intact. Even if God created the world 3 minutes ago, and implanted us all with false memories, we could easily observe evolution in the real world.\n \n \nI understand evolution I just don't believe the fairy tale that fish walked out of the sea and we all came from a common ancestor that was not Human.\n\n \n Yes, you don't believe in the evolutionary explanation of history - that's fine. You will need to come up with some dodgy \"God / Satan made things appear older and more like our ancestors than they actually are\" excuses, but its doable. That doesn't touch actual evolutionary theory though.\n \n Science must find a naturalist explanation - that's what makes it science.", 
   {}, 
   128716, 
   null, 
   1117121580.0
  ], 
  [
   128774, 
   null, 
   "pandion", 
   "There is great variation-[evolution]-if you will , between animals of the same genus -kind- but none between animals of different ones.\nThen why did you claim that the 13 or 14 different species of Galapagos finches \"interbreed\"? But how can this be? There are at least 6 different genera of finches and no interbreeding between genra has ever been observed. I know of two examples of interbreeding between members of the same genus, which is not unexpected given the recent separation of the species as revealed by DNA analysis.", 
   {}, 
   128720, 
   null, 
   1117128120.0
  ], 
  [
   128913, 
   null, 
   "Demon38", 
   "Peddler8111 posted:\n \nThe burden of proof is on you. You are claiming it is a scientific fact.\n \n \n No, you're the one claiming it's impossible, the burden of proof is on you to show that it's impossible, you haven't done that. I'm not claiming it's a scientific fact. What I am claiming is all the experts agree that birds did evovle. \n \n \nThere is no known way this could possibly happen.\n \n \n Why not.......\n \n \nTo decide it did despite this is a religious belief not science.\n \n \n No it's not, all the evidence points to bird evolution. True, there is not enough evidence to say for certain how the avian lungs evolved, but it's obvious that they did.\n \n \nIt is your axiom not a reasonable interpretation of the evidence.\n \n \n No, the theory of bird evolution is a reasonable interpretation of the evidence, all the experts agree. Now, not all the experts agree that birds evolved from therapod dinosaurs, some think they evolved earlier from archosaur, like all the experts you keep quoting. \n Alan Feduccia:\n \nFeduccia has broken more new ground with his \"big-bang\" theory. He thinks that the ancestors of all today's birds evolved explosively in only about 5 to 10 million years.\n \n \n So what are you attempting to do here? All the experts you try to use agree that birds did evolve, just not from dinosaurs. They agree that the avian lung did evolve from a reptilian lung, just not from dinosuars. So do you agree with the experts that you quote, that birds evolved from an earlier reptile?", 
   {}, 
   128774, 
   null, 
   1117140240.0
  ], 
  [
   128922, 
   null, 
   "gnojek", 
   "\n If you want to believe that I don't understand what alleles means then so be it. I do , I wonder why you cannot understand that this does not turn one genus-[kind]-into another.\n\n Ah! So we have a definition of \"kind\" and you say it = \"genus.\"\n \n How many genuses do you suppose exist on the earth?\n Do you think this number of organisms in pairs could fit on a 450 ft wooden boat?\n \n Now, how many genuses EVER existed on the Earth?\n They would all have to fit on the boat too.", 
   {}, 
   128716, 
   null, 
   1117141200.0
  ], 
  [
   128923, 
   null, 
   "gnojek", 
   "Then why did you claim that the 13 or 14 different species of Galapagos finches \"interbreed\"? But how can this be? There are at least 6 different genera of finches and no interbreeding between genra has ever been observed. I know of two examples of interbreeding between members of the same genus, which is not unexpected given the recent separation of the species as revealed by DNA analysis.\n\n Your making his argument for him.", 
   {}, 
   128774, 
   null, 
   1117141320.0
  ], 
  [
   128933, 
   null, 
   "peddler8111", 
   "Ah! So we have a definition of \"kind\" and you say it = \"genus.\"\n \n How many genuses do you suppose exist on the earth?\n Do you think this number of organisms in pairs could fit on a 450 ft wooden boat?\n \n Now, how many genuses EVER existed on the Earth?\n They would all have to fit on the boat too.\n\n All you can do is argue about semantics because your theory is hollow. A finch cannot breed with a jackrabbit. Why not? Random amino acids became every thing on earth.\n Long ago and far far away.", 
   {}, 
   128922, 
   null, 
   1117142700.0
  ], 
  [
   128943, 
   null, 
   "peddler8111", 
   "Peddler8111 posted:\n \n \n No, you're the one claiming it's impossible, the burden of proof is on you to show that it's impossible, you haven't done that. I'm not claiming it's a scientific fact. What I am claiming is all the experts agree that birds did evovle. \n \n \n \n Why not.......\n \n \n \n No it's not, all the evidence points to bird evolution. True, there is not enough evidence to say for certain how the avian lungs evolved, but it's obvious that they did.\n \nObvious? ROFL Pray tell how is that?\n \n \n\n No, the theory of bird evolution is a reasonable interpretation of the evidence, all the experts agree. Now, not all the experts agree that birds evolved from therapod dinosaurs, some think they evolved earlier from archosaur, like all the experts you keep quoting. \n Alan Feduccia:\n \n \n So what are you attempting to do here? All the experts you try to use agree that birds did evolve, just not from dinosaurs. They agree that the avian lung did evolve from a reptilian lung, just not from dinosuars. So do you agree with the experts that you quote, that birds evolved from an earlier reptile?\n\n No there is no evidence of that sort of thing ever happening in the history of the world. The question is why do so many insist on maintaining the **** about therapod dinosaurs becoming birds. Science means to know not make up a story and agrue to keep what is obviously wrong.\n Without an absoutely unwaivering belief in naturalism this issue would die as it is all imaginary. Some are just more ridiculous than others.We take the side of science in spite of the patent absurdity of some of its constructs, in spite of its failure to fulfill may of its extravagant promises of health and life, in spite of the tolerance of the scientific community for unsubstantiated just-so stories, because we have a prior commitment, a commitment to materialism. It is not that the methods of institutions of science somehow compel us to accept a material explanation of the phenomenal world, but, on the contrary, that we are forced by our a priori adherence to material causes to create an apparatus of investigation and a set of concepts that produce material explanations, no matter how counterintuitive, no matter how mystifying to the uninitiated. Moreover, the materialism is an absolute, for we cannot allow a Divine Foot in the door.\"\n Richard Lewontin, geneticist", 
   {}, 
   128913, 
   null, 
   1117143900.0
  ], 
  [
   128944, 
   null, 
   "fishpower", 
   "Long ago and far far away.\n\n \n I haven't been the most active participant in these debates, but on behalf of those who have, I move that next time Peddlar says this we slap him with a fish.", 
   {}, 
   128933, 
   null, 
   1117143900.0
  ], 
  [
   128948, 
   null, 
   "Redratio1", 
   "Science means to know not make up a story and agrue to keep what is obviously wrong.\n\n \n Which is exactly what you are doing. Ironic isn't it? emoticon_xclown", 
   {}, 
   128943, 
   null, 
   1117144260.0
  ], 
  [
   128958, 
   null, 
   "Tastyfish", 
   "All you can do is argue about semantics because your theory is hollow. A finch cannot breed with a jackrabbit. Why not? Random amino acids became every thing on earth.\n Long ago and far far away.\n\n Who knows I might get unignored...\n \n But if you mix jackrabbit and finch DNA you can see why they don't breed, its not due to some magical thing that stops it - you can see the process of it trying and failing. Compared to a pure finch or jackrabbit zygote you can see at what stages the things stop being able to interact.\n \n More interesting it seeing how closely related organsims can't produce fertile offspring - we can see the chromosomes lining up and seperating to produce the sterile animal and later on we can see the same thing trying to take place and failing if the mule or whatever tried to breed.\n Why it fails matchs what we would expect from evolution, the two chromosomes are either too different to be able to pair up in any meaningful way, or there are one or more left over.\n \n In flies, the generation of new chromosomes has been observed, its really not that hard a thing just a mistake as they pair up and one chromosone crossing over with one it shouldn't", 
   {}, 
   128933, 
   null, 
   1117144740.0
  ], 
  [
   128966, 
   null, 
   "peddler8111", 
   "That's not the \"way it is portrayed\", that's what it is. And if you want to argue against \"evolution\", that's what you'll have to argue against.\n Okay then I guess that means that fish to amphibians and such is not part of evolution and it only has to do with hair and eye color as you said. Okay we argee. The common ancestor story is not part of evolution. I am beginning to like the way you think.\n \n\n If you want to argue against atheism, secularism, the big bang, or some such, be my guest, but don't call them evolution and get a response other than everyone in the room rolling their eyes at you.\n Roll all you want without the god of time we would not be arguing in the first place. \n Long ago and far far away is everything to what you call evolution.\n \n \n\n \n Evolution is used as an explanatory tool to explain, in naturalistic terms, how complex life could have arisen on Earth. This explanation itself isn't \"evolution\", its an application of evolution to the field of History. Whether the orthodox Evolutionary History view is correct or incorrect, evolution itself remains intact. Even if God created the world 3 minutes ago, and implanted us all with false memories, we could easily observe evolution in the real world.\nThat deep. How would you come to the conclusion there is a naturalistic explanation? The only way evoltion remains intact is naturalism/atheism remains in tact. It is circular reasoning not based on evidence. There is no evidence that man decended from lower animals it is an atheistic / humanist worldview not science.\n Remains in tact-what does that mean? You will believe it regardless of the evidence?\n \n \n\n \n Yes, you don't believe in the evolutionary explanation of history - that's fine. You will need to come up with some dodgy \"God / Satan made things appear older and more like our ancestors than they actually are\" excuses, but its doable. That doesn't touch actual evolutionary theory though.\n \n Science must find a naturalist explanation - that's what makes it science.\nNo science means to know. You don't know there is a naturalistic explanation it is only a senario, a fairy tale, a what if question, not science.\n \n We take the side of science in spite of the patent absurdity of some of its constructs, in spite of its failure to fulfill may of its extravagant promises of health and life, in spite of the tolerance of the scientific community for unsubstantiated just-so stories, because we have a prior commitment, a commitment to materialism. It is not that the methods of institutions of science somehow compel us to accept a material explanation of the phenomenal world, but, on the contrary, that we are forced by our a priori adherence to material causes to create an apparatus of investigation and a set of concepts that produce material explanations, no matter how counterintuitive, no matter how mystifying to the uninitiated. Moreover, the materialism is an absolute, for we cannot allow a Divine Foot in the door.\"\n Richard Lewontin, geneticist\n \n Your constant insistance that scientist must believe the world created itself is silly, \n The greatest scientist in history did. Where do you get such nonsense from?", 
   {}, 
   128720, 
   null, 
   1117145460.0
  ], 
  [
   128969, 
   null, 
   "Tastyfish", 
   "If the divine can get a foot in the door, yay them. But just accpeting what a holy book says in stupid and pointless - it does nothing to further science.\n \n Anyway, if science can use the supernatural the its not supernatural anymore - just natural. How would you distinguish between things that are supposedly supernatural and those that are just explained", 
   {}, 
   128966, 
   null, 
   1117145640.0
  ], 
  [
   128970, 
   null, 
   "peddler8111", 
   "Which is exactly what you are doing. Ironic isn't it? emoticon_xclown\n\n Very good red! Keep up the good work !", 
   {}, 
   128948, 
   null, 
   1117145820.0
  ], 
  [
   128981, 
   null, 
   "Waxy", 
   "Very good red! Keep up the good work !\n\n \n Did you miss the part in your book where it says \"Do unto others as you would have them do unto you\"?\n \n You complain about your treatment, and then in the next breath treat others in the very same manner you complain about being treated.\n \n Respect is earned Peddler.\n \n Waxy", 
   {}, 
   128970, 
   null, 
   1117146960.0
  ], 
  [
   129020, 
   null, 
   "thebootfitter", 
   "Very good red! Keep up the good work !\n\n Waxy, I think Peddler here may be giving us a hint that he is really a troll attempting to make 'creationists' look bad and Redratio is onto him. Peddler readily admits to this scenario by his quote above, don't you think?", 
   {}, 
   128970, 
   null, 
   1117152120.0
  ], 
  [
   129028, 
   null, 
   "pandion", 
   "Your making his argument for him.\nNot at all. Peddler's assertion, no doubt based on ignorance, was that Darwin claimed that the \"Galapagos finches\" couldn't interbreed. I'm not sure what peddler means by that, but there are 13 to 15 different species of Galapagos finches in 6 different genera. What I assumed was that he means is that Darwin made some claim about interbreeding between these species.\n \n Such a claim is ignorant since Darwin didn't even recognize the finches that he collected as being separate species. Darwin thought that there were several species of Galapagos tortoises (he was wrong), and a single species of finch (he was wrong). It was Owen who pointed out the fact to him, and the finches may have played some role in his thinking, but by the time he had become aware of the several species, it was too late to express any opinion. Darwin took very poor notes about the finches and had to beg another crew-member who had taken excellent notes, for his collection to give to Owen - that other crew-member was none other than Capt. Fitzroy.\n \n So one must wonder exactly what peddler is claiming. I suspect that he is claiming that evolutionary theory claims that the various species of Galapagos finches do not interbreed. (To actually state that the Galapagos finches don't interbreed would be silly. The very definition of species, the biological species concept is that a species is a population of interbreeding organisms.) So I guess peddler has just failed to think out what he is claiming and expressed a simple idea quite badly.\n \n So the question is, does evolutionary theory actually claim that the various species of Galapagos finches do not interbreed? That would be nonsense. What is observed, and some of the reason for the taxonomy of the finches, is that some populations are reproductively isolated from others. Therefore, they are considered separate species. However, under unusual circumstances there has been observed some interbreeding between closely related species. They have been classified in the same genus and DNA analysis has confirmed the close relationships. In fact, in one case the birds are genetically indistinguishable although they look slightly different and eat food from different sources.\n \n Even if we become lumpers and lump all of the interbreeding species together, we would still have 11 separate and non-interbreeding species of Galapagos finches. DNA analysis shows that they are descended from the Ecuadorian grassquit.", 
   {}, 
   128923, 
   null, 
   1117153620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  [B]The Avian Lung.", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5352-b-avian-lung.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 5352, 
  "discussion_files": [
   [
    "5549.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5352-b-avian-lung-print.html"
   ], 
   [
    "5550.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5352-b-avian-lung-4-print.html"
   ], 
   [
    "5551.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5352-b-avian-lung-3-print.html"
   ], 
   [
    "5552.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5352-b-avian-lung-2-print.html"
   ]
  ], 
  "identifier": 5352
 }
]