[
 [
  [
   126494, 
   null, 
   "Kronus", 
   "Originialy posted by Kronus:\n I realize that this is a total aside, but that isn't quite right. Infinity does come in various sizes, or as the mathematicans would put it, orders. However, the integers and the even integers are of the same order. There aren't more of one than the other.\n \n Two infinite sets are of the same order if you can make a one to one mapping between them, with nothing left over on either side. To map the integers to the even integers all you would need to do is multiply the integer by two, and you'll get a unique mapping to an even integer, so they're of the same order.\n \n If you feel like discussing this more, we should probably start a new thread, this one is bouncing around enough as it is.\n \n \n\n There still would be twice as many integers as even or odd integers in any order of infinity wouldnt there?\n\n \n So here's the new thread. :)\n \n The tricky thing about infinity is to not think of it as a number. It's not a number, it's a property of a set. Since it's not a number all the things you can do to a number don't work on infinity. For example, you can't divide infintiy by two to get something half as big, you can't count the number of things in an infinite set, you can't even talk about the \"size\" of an infinite set in the way most people think of size. The concept of \"twice as big\" doesn't make any mathematical sense when talking about an infinite set. For one set to be twice as big as another, you'ld have to first be able to say how big they are, and you can't say how big infinite sets are, that's the point. You can say that one set is of a larger order, but that doesn't tell you how much larger the other order is. You just know that if you create any one to one pairing, the larger order would always have elements left over.", 
   {
    "post_info": {
     "post_title": "Infinity"
    }
   }, 
   null, 
   null, 
   1116771480.0
  ], 
  [
   126497, 
   null, 
   "canadianman76", 
   "Originialy posted by Kronus:\n I realize that this is a total aside, but that isn't quite right. Infinity does come in various sizes, or as the mathematicans would put it, orders. However, the integers and the even integers are of the same order. There aren't more of one than the other.\n \n Two infinite sets are of the same order if you can make a one to one mapping between them, with nothing left over on either side. To map the integers to the even integers all you would need to do is multiply the integer by two, and you'll get a unique mapping to an even integer, so they're of the same order.\n \n If you feel like discussing this more, we should probably start a new thread, this one is bouncing around enough as it is.\n \n \n \n So here's the new thread. :)\n \n The tricky thing about infinity is to not think of it as a number. It's not a number, it's a property of a set. Since it's not a number all the things you can do to a number don't work on infinity. For example, you can't divide infintiy by two to get something half as big, you can't count the number of things in an infinite set, you can't even talk about the \"size\" of an infinite set in the way most people think of size. The concept of \"twice as big\" doesn't make any mathematical sense when talking about an infinite set. For one set to be twice as big as another, you'ld have to first be able to say how big they are, and you can't say how big infinite sets are, that's the point. You can say that one set is of a larger order, but that doesn't tell you how much larger the other order is. You just know that if you create any one to one pairing, the larger order would always have elements left over.\n\n This is a cool new thread, and i hope it will go for a while.\n What do you think bout the fact that infinity cannot exist without zero? (Forever had to start somewhere?) I wrote this in an other thread somewhere. I thout it sounded pretty learnded and was proud of it. emoticon_xagree", 
   {}, 
   126494, 
   null, 
   1116771960.0
  ], 
  [
   126509, 
   null, 
   "Kronus", 
   "This is a cool new thread, and i hope it will go for a while.\n What do you think bout the fact that infinity cannot exist without zero? (Forever had to start somewhere?) I wrote this in an other thread somewhere. I thout it sounded pretty learnded and was proud of it. emoticon_xagree\n\n \n Can you expand on that a bit? I mean, an infinite set doesn't have to contain zero, but that's not what you're saying, is it? So, what is it that you are saying?", 
   {}, 
   126497, 
   null, 
   1116772980.0
  ], 
  [
   126519, 
   null, 
   "Jo Bennett", 
   "\n The tricky thing about infinity is to not think of it as a number. It's not a number, it's a property of a set. Since it's not a number all the things you can do to a number don't work on infinity. For example, you can't divide infintiy by two to get something half as big, you can't count the number of things in an infinite set, you can't even talk about the \"size\" of an infinite set in the way most people think of size. The concept of \"twice as big\" doesn't make any mathematical sense when talking about an infinite set. For one set to be twice as big as another, you'ld have to first be able to say how big they are, and you can't say how big infinite sets are, that's the point. You can say that one set is of a larger order, but that doesn't tell you how much larger the other order is. You just know that if you create any one to one pairing, the larger order would always have elements left over.\n\n \n What about the delta function though? Surely that allows a description of two infinities, one quantifiably larger than the other. If you define 2delta(x) and delta(x), the former is clearly twice the larger, but both are still of infinite height at zero.", 
   {}, 
   126494, 
   null, 
   1116773880.0
  ], 
  [
   126520, 
   null, 
   "canadianman76", 
   "Can you expand on that a bit? I mean, an infinite set doesn't have to contain zero, but that's not what you're saying, is it? So, what is it that you are saying?\n\n Can infinity go backwards beyond the big bang when there were no dimensions? No depth, length, width, or even time? If so, Id like for you to explain how in laymen terms or even with the language of mathematics. If not, then how does it not have a beginning?\n An infinitely large object could only have been infinitley large from the moment that large existed or the big bang, could it not? If it had size before that, then how when there wasnt a platform to support size?", 
   {}, 
   126509, 
   null, 
   1116773880.0
  ], 
  [
   126539, 
   null, 
   "Kronus", 
   "Ok. I was mostly talking about infinity in the mathematical sense. That is, an infinitily large set. You're talking about infinite stuff. The only \"thing\" I know of that anyone claims is infinite is the size of the universe, and I don't claim to understand that at all. However, from a philisophical point of view, I don't see that it's necessary for something infinitely large to necessarily have a starting point, a zero. Granted, that's the way our universe works, and if we're talking about what actaully has happened then, well, there you are. In theory, though, couldn't there be a universe of infinite size that had simply always been? So, infinite in time as well as space? I can't really picture an infinite size, so given that I might as well not be able to visualize infintite time too. :)", 
   {}, 
   126520, 
   null, 
   1116778260.0
  ], 
  [
   126556, 
   null, 
   "bmittking", 
   "I don't think of infinity as a number. I think of it more as a phrase.", 
   {}, 
   126494, 
   null, 
   1116781620.0
  ], 
  [
   126557, 
   null, 
   "Jo Bennett", 
   "The infinite static universe was one favoured by many physicists, including Einstein as I recall, which resulted in him making what he called the greatest mistake of his life - inserting the cosmological constant into the Friedmann equation. As it turns out such a constant may be correct after all, though not of a large enough magnitude to maintain a static universe.", 
   {}, 
   126539, 
   null, 
   1116781680.0
  ], 
  [
   126602, 
   null, 
   "Kronus", 
   "So Jo, if I understand what you're saying, an infinite static universe is theoretically possible, but some of its constants might have to be different than the ones we currently have? Is that right?", 
   {}, 
   126557, 
   null, 
   1116785280.0
  ], 
  [
   126704, 
   null, 
   "Jo Bennett", 
   "There are problems with the infinite static model, specifically the Olber paradox, which asks why if the universe is infinite, and light has had an infinite amount of time to reach us, why is the sky not as bright as the Sun all night and day? I think that this paradox was part of the reason the big bang model was first formulated, though I could be mistaken. It is possible to have an infinite static universe, but as far as I can see without looking at the maths, the physical laws themselves would have to change as well for us to be able to exist in it.", 
   {}, 
   126602, 
   null, 
   1116792960.0
  ], 
  [
   126813, 
   null, 
   "Kronus", 
   "There are problems with the infinite static model, specifically the Olber paradox, which asks why if the universe is infinite, and light has had an infinite amount of time to reach us, why is the sky not as bright as the Sun all night and day? I think that this paradox was part of the reason the big bang model was first formulated, though I could be mistaken. It is possible to have an infinite static universe, but as far as I can see without looking at the maths, the physical laws themselves would have to change as well for us to be able to exist in it.\n\n \n I think I can answer that paradox. If the universe is infinite, we'd have an infinite number of stars shining light in an infinite number of directions, yes? So, which of those two infinities, if either, is of the greater order? The number of stars would clearly be of the same order as the rational numbers, since you could assign a number to each star. The number of directions the light could go would be of the same order as the irrationals. Direction can be described based on 3 numbers; 3 angles, or 2 angles and a distance, or 3 distances. To get all directions, some on these numbers would have to be irrational, and so the set of directions would be the same order as the irrationals. And since the order of the irrationals is greater than the order of the rationals, you basically have more directions for the light to go than suns producing the light.\n \n And just to clarify, I was by no means suggesting that our universe was infinite and static. I was just asking if just a universe could, in theory, exist, if you tweaked some universal constants.", 
   {}, 
   126704, 
   null, 
   1116803580.0
  ], 
  [
   126912, 
   null, 
   "zachvac", 
   "the original question about there being twice as many integers as odds or evens makes me think of the question:\n \n \"if an odd plus an odd is even, an even plus an even is even, and an odd plus an even is odd, why aren't there twice as many evens as odds?\"\n \n \n \n By the way, you say there is no way to divide infinity by an integer like 2. Would you say multiplying it by -1 and getting -infinity would still work? Multiplying by 0 would still get 0.\n \n \n and one way to define infinity would be 1/0, right?\n \n 1/0=x\n 0*x=1\n 1/x=0\n now as x gets larger and larger, 1/x gets closer and closer to 0. So if x were infinity, 1/x would equal 0, thus 1/0 or any integer/0 = infinity.\n \n 0/0 on the other hand can be any number.\n 0/0=x\n 0*x=0\n 0/x=0\n 0=0\n Thought this sort of pertained to the discussion, do these last 2 work?", 
   {}, 
   126813, 
   null, 
   1116815340.0
  ], 
  [
   126922, 
   null, 
   "Kronus", 
   "\n By the way, you say there is no way to divide infinity by an integer like 2. Would you say multiplying it by -1 and getting -infinity would still work? Multiplying by 0 would still get 0.\n \n\n Nope, none of those work, because infinity isn't a number. You can't mutliply it, divide it, you can't do any sort of arithmetic on it at all.\n \n \n\n and one way to define infinity would be 1/0, right?\n \n\n Nope. Division by zero is undefined. 1/0 has no meaning in math. An engineer might let you get away with calling it infinity, but only as a way of saying you can't actually build something that has a dimension like that.\n \n \n\n 1/0=x\n 0*x=1\n 1/x=0\n now as x gets larger and larger, 1/x gets closer and closer to 0. So if x were infinity, 1/x would equal 0, thus 1/0 or any integer/0 = infinity.\n \n\n \n It's true that as x gets larger 1/x approaches 0. It is also true if 1/y = x, then as y goes to 0, x goes to infinity. However the rules of math still don't let you say that 1/0 = infinity or 1/infinity = 0. You can talk about the limits as you approach infinity, but you can't do algebra with infinity, and you can't divide by zero.", 
   {}, 
   126912, 
   null, 
   1116818100.0
  ], 
  [
   127093, 
   null, 
   "canadianman76", 
   "the original question about there being twice as many integers as odds or evens makes me think of the question:\n \n \"if an odd plus an odd is even, an even plus an even is even, and an odd plus an even is odd, why aren't there twice as many evens as odds?\"\n\n Because an even times an odd is an odd, so you have an equal ammount of opposites in this equation.", 
   {}, 
   126912, 
   null, 
   1116847020.0
  ], 
  [
   127106, 
   null, 
   "toby", 
   "\n \n It's true that as x gets larger 1/x approaches 0.\n\n \n Careful. This limit doesn't exist. Know what I mean?", 
   {}, 
   126922, 
   null, 
   1116852600.0
  ], 
  [
   127107, 
   null, 
   "toby", 
   "the original question about there being twice as many integers as odds or evens makes me think of the question:\n \n \"if an odd plus an odd is even, an even plus an even is even, and an odd plus an even is odd, why aren't there twice as many evens as odds?\"?\n\n \n Because an even plus and odd is also odd.", 
   {}, 
   126912, 
   null, 
   1116853020.0
  ], 
  [
   127116, 
   null, 
   "Kronus", 
   "Careful. This limit doesn't exist. Know what I mean?\n\n \n True, a function must be defined at a point in order to have a limit at that point. I don't see where you're going with this though.", 
   {}, 
   127106, 
   null, 
   1116857760.0
  ], 
  [
   127117, 
   null, 
   "toby", 
   "True, a function must be defined at a point in order to have a limit at that point. I don't see where you're going with this though.\n\n \n I'm suggesting that the right hand limit and the left hand limit are not the same, and therefore a single limit does not exist.", 
   {}, 
   127116, 
   null, 
   1116858060.0
  ], 
  [
   127121, 
   null, 
   "Kronus", 
   "I'm suggesting that the right hand limit and the left hand limit are not the same, and therefore a single limit does not exist.\n\n \n There is no right hand or left hand limit, because 1/x is undefined at 0 regardless of which direction you approach it from. But what I'm asking is why does the lack of a limit matter? How does it bear on what's being discussed? I just don't see where you're going here.", 
   {}, 
   127117, 
   null, 
   1116858840.0
  ], 
  [
   127298, 
   null, 
   "toby", 
   "There is no right hand or left hand limit, because 1/x is undefined at 0 regardless of which direction you approach it from. But what I'm asking is why does the lack of a limit matter? How does it bear on what's being discussed? I just don't see where you're going here.\n\n \n The value appoaches positive infinity from the right and negative infinity from the left. The value may not be getting large (except in an absolute sense).", 
   {}, 
   127121, 
   null, 
   1116872400.0
  ], 
  [
   127328, 
   null, 
   "Kronus", 
   "The value appoaches positive infinity from the right and negative infinity from the left. The value may not be getting large (except in an absolute sense).\n\n \n But what is your point? How does this relate to anything that's being talked about? What, in short, are you getting at? Sorry if this sounds brusque, but you've totally lost me here.", 
   {}, 
   127298, 
   null, 
   1116873960.0
  ], 
  [
   127339, 
   null, 
   "toby", 
   "But what is your point? How does this relate to anything that's being talked about? What, in short, are you getting at? Sorry if this sounds brusque, but you've totally lost me here.\n\n \n I was only attempting to clarify that the value you were saying was getting large, may not in fact be getting large, at least not in the way somebody might think. Somebody may care.\n \n Since you got onto orders of infinity, you might want to introduce the continuum hypothesis.", 
   {}, 
   127328, 
   null, 
   1116874680.0
  ], 
  [
   127756, 
   null, 
   "Redratio1", 
   "I remember in physics, we were always searching for the non-infiniate or reality based solution to our math problems. \n \n I think infinities only exist in closed loops in reality. Abstractly mathematically, it is a hugely useful tool and a marker. Sort of like imaginary numbers.", 
   {}, 
   127339, 
   null, 
   1116934080.0
  ], 
  [
   127852, 
   null, 
   "toby", 
   "The Continuum Hypothesis states that there is no subset of the real numbers which has cardinality strictly between that of the reals and that of the integers. For example, the set of rationals can be mapped 1-1 either onto the integers or the reals (I'll leave it as a problem to figure out which).\n \n The interesting thing here is that nobody knows whether the continuum hypothesis is true or not.", 
   {}, 
   127756, 
   null, 
   1116954480.0
  ], 
  [
   128393, 
   null, 
   "toby", 
   "For example, the set of rationals can be mapped 1-1 either onto the integers or the reals (I'll leave it as a problem to figure out which).\n \n\n \n Sheesh. No guesses even. The rationals (i.e., numbers of the form a/b, a,b both integers, and b not zero) can be mapped 1-1 to onto the integers. (There's a cute demonstration of how this is done if you'd like to find the mapping.) If N0  is the number of integers, this implies that N0^2  is still N0.", 
   {}, 
   127852, 
   null, 
   1117045320.0
  ], 
  [
   130264, 
   null, 
   "canadianman77", 
   "Because an even plus and odd is also odd.\n\n what does (+2)+(-1)=? we better get blue mountain on this one! It could take a while! emoticon_confused", 
   {}, 
   127107, 
   null, 
   1117462440.0
  ], 
  [
   130265, 
   null, 
   "Jo Bennett", 
   "1, what's the problem?", 
   {}, 
   130264, 
   null, 
   1117462620.0
  ], 
  [
   130447, 
   null, 
   "WhiteFalcon", 
   "what does (+2)+(-1)=? we better get blue mountain on this one! It could take a while! emoticon_confused\n\n \n An odd (1), whats the point..?", 
   {}, 
   130264, 
   null, 
   1117488120.0
  ], 
  [
   130908, 
   null, 
   "Redratio1", 
   "Back to school for someone! emoticon_xclown", 
   {}, 
   130447, 
   null, 
   1117590240.0
  ], 
  [
   131633, 
   null, 
   "canadianman77", 
   "Is there a mathematical proof for infinity?", 
   {}, 
   130908, 
   null, 
   1117691040.0
  ], 
  [
   131765, 
   null, 
   "Kronus", 
   "Is there a mathematical proof for infinity?\n\n \n There's a mathematical defintion. But I suspect what you're asking is if infinity actually exists. The answer is, depends on what you mean. (surprise!)\n \n There are no infinite sets of actuall stuff, as far as I know. The universe may be infinite in size. The set of integers is definately infinite; that has been proven.\n \n Does any of this help?", 
   {}, 
   131633, 
   null, 
   1117726080.0
  ], 
  [
   131797, 
   null, 
   "Jo Bennett", 
   "If the universe is infinite in size, then surely, as we are aware of more than two stars, and by the cosmological principle the universe is homogeneous and isotropic on the macro scale, there must be an infinite number of stars, yes?", 
   {}, 
   131765, 
   null, 
   1117730820.0
  ], 
  [
   131906, 
   null, 
   "toby", 
   "If the universe is infinite in size, then surely, as we are aware of more than two stars, and by the cosmological principle the universe is homogeneous and isotropic on the macro scale, there must be an infinite number of stars, yes?\n\n \n Well, the observable universe is finite: we can't observe stuff inifinitely far away.", 
   {}, 
   131797, 
   null, 
   1117738320.0
  ], 
  [
   131922, 
   null, 
   "canadianman77", 
   "There's a mathematical defintion. But I suspect what you're asking is if infinity actually exists. The answer is, depends on what you mean. (surprise!)\n \n There are no infinite sets of actuall stuff, as far as I know. The universe may be infinite in size. The set of integers is definately infinite; that has been proven.\n \n Does any of this help?\n\n No I think I meant a mathematical definition. Thanks. Do you have any links?", 
   {}, 
   131765, 
   null, 
   1117740480.0
  ], 
  [
   132118, 
   null, 
   "Kronus", 
   "No I think I meant a mathematical definition. Thanks. Do you have any links?\n\n \n It's wierd, but I don't. It's a mathematical term, so it must have a definite definition, but none of the first dozen links I googled had one. I'll poke around a bit more, now that you've got my curiosity up, and I'll let you know if i come across anything.", 
   {}, 
   131922, 
   null, 
   1117759860.0
  ], 
  [
   132156, 
   null, 
   "canadianman77", 
   "It's wierd, but I don't. It's a mathematical term, so it must have a definite definition, but none of the first dozen links I googled had one. I'll poke around a bit more, now that you've got my curiosity up, and I'll let you know if i come across anything.\n\n Cool. If you find it could you dumb it up a bit? Im not that good with mathematical formulas.", 
   {}, 
   132118, 
   null, 
   1117768680.0
  ], 
  [
   132291, 
   null, 
   "Jo Bennett", 
   "One possible definition of infinity is the differential of any non-continuous function taken at a point where it is discontiuous, like my previous example of the differential of the sign function evaluated at 0.", 
   {}, 
   132156, 
   null, 
   1117797420.0
  ], 
  [
   132442, 
   null, 
   "Kronus", 
   "Well, I found this:\n \n Infinity, in mathematics, that which is not finite. A sequence of numbers, a1, a2, a3, ... , is said to \"approach infinity\" if the numbers eventually become arbitrarily large, i.e., are larger than some number, N, that may be chosen at will to be a million, a billion, or any other large number (see limit). The term infinity is used in a somewhat different sense to refer to a collection of objects that does not contain a finite number of objects. For example, there are infinitely many points on a line, and Euclid demonstrated that there are infinitely many prime numbers. The German mathematician Georg Cantor showed that there are different orders of infinity, the infinity of points on a line being of a greater order than that of prime numbers (see transfinite number). In geometry one may define a point at infinity, or ideal point, as the point of intersection of two parallel lines, and similarly the line at infinity is the locus of all such points; if homogeneous coordinates (x1, x2, x3) are used, the line at infinity is the locus of all points (x1, x2, 0), where x1 and x2 are not both zero. (Homogeneous coordinates are related to Cartesian coordinates by x=x1/x3 and y=x2/x3.)\n \n A couple of the definitions boil down to \"something that isn't finite\". Helpful?", 
   {
    "unicode_changes_made": true
   }, 
   132291, 
   null, 
   1117823880.0
  ], 
  [
   132612, 
   null, 
   "Nurglitch", 
   "http://en.wikipedia.org/wiki/Axiom_of_infinity\n \n I love axioms...:)", 
   {}, 
   132442, 
   null, 
   1117847040.0
  ], 
  [
   132657, 
   null, 
   "canadianman77", 
   "http://en.wikipedia.org/wiki/Axiom_of_infinity\n \n I love axioms...:)\n\n I dont understand what an axiom is.", 
   {}, 
   132612, 
   null, 
   1117859340.0
  ], 
  [
   132744, 
   null, 
   "Kronus", 
   "I dont understand what an axiom is.\n\n \n Here's a good definition: \n \" A self-evident principle or one that is accepted as true without proof as the basis for argument; \"\n \n For example, one of the axioms in Euclidian geometry is that the shortest distance between two points is a straight line. In philosophy you might except as an axiom that you and the person your talking with actually exist.\n \n Now as for what Nurglitch linked to, if it is actually an axiom than it's an axiom presented in very formal language, making it a little tough to understand. :)\n It boils down to: \"There is a set containing all the natural numbers.\", which is of course infinite. My set theory is rusty, but it seems to me that that ought to be a provable statement somehow, and so not really an axiom.", 
   {}, 
   132657, 
   null, 
   1117897200.0
  ], 
  [
   133508, 
   null, 
   "zachvac", 
   "Nope, none of those work, because infinity isn't a number. You can't mutliply it, divide it, you can't do any sort of arithmetic on it at all.\n \n \n Nope. Division by zero is undefined. 1/0 has no meaning in math. An engineer might let you get away with calling it infinity, but only as a way of saying you can't actually build something that has a dimension like that.\n \n \n \n It's true that as x gets larger 1/x approaches 0. It is also true if 1/y = x, then as y goes to 0, x goes to infinity. However the rules of math still don't let you say that 1/0 = infinity or 1/infinity = 0. You can talk about the limits as you approach infinity, but you can't do algebra with infinity, and you can't divide by zero.\n\n \n \n well I'm not sure about the algebra stuff, or how to get there, but my math teacher assures me that for any non-zero number n, n/0 = infinity and that 0/0 is indeterminable.", 
   {}, 
   126922, 
   null, 
   1118033880.0
  ], 
  [
   133514, 
   null, 
   "Kronus", 
   "well I'm not sure about the algebra stuff, or how to get there, but my math teacher assures me that for any non-zero number n, n/0 = infinity and that 0/0 is indeterminable.\n\n \n What grade are you in? Alot of people get introduced to infinity by being told x/0 = infinity, but if you keep up the math you'll be told later that that really isn't true. You can't divide by zero, it's not allowed. Sometimes it's conveinient to pretend that you can, and call x/0 infinity, but if you're being precise than you can't do it.", 
   {}, 
   133508, 
   null, 
   1118036160.0
  ], 
  [
   134010, 
   null, 
   "zachvac", 
   "What grade are you in? Alot of people get introduced to infinity by being told x/0 = infinity, but if you keep up the math you'll be told later that that really isn't true. You can't divide by zero, it's not allowed. Sometimes it's conveinient to pretend that you can, and call x/0 infinity, but if you're being precise than you can't do it.\n\n \n I am in precal so I will take calculus next year. It all started when someone concluded that since the reciprocal of 0 is undefined, that the reciprocal of undefined is 0 (makes no sense). She just sort of mentioned that actually 0/0 was indeterminable and any other n/0 was infinity. So a couple of us in class were playing around with it and figured that if you look at it algebraically, it works out.\n \n In my opinion (or maybe it's fact, maybe it's completely wrong, I'm not an expert on this) it seems like if you're being precise you really can't have infinity since it isn't a precise number. It seems like you could make many definitions of how to do math with infinity. You could say that infinity + or minus anything is infinity and same with -infinity, only than addition would no longer be communitive and other stuff would be messed up. It seems like no matter what you do you would have to abandon adding, multiplying, etc. as if you were working with real numbers, you would have to give some further definitions to the common arithmetic operators (+, -, etc.) to include infinity and there could be different ways to redefine them. Am I wrong here?", 
   {}, 
   133514, 
   null, 
   1118122320.0
  ], 
  [
   134066, 
   null, 
   "Kronus", 
   "I am in precal so I will take calculus next year. It all started when someone concluded that since the reciprocal of 0 is undefined, that the reciprocal of undefined is 0 (makes no sense). She just sort of mentioned that actually 0/0 was indeterminable and any other n/0 was infinity. So a couple of us in class were playing around with it and figured that if you look at it algebraically, it works out.\n\n She was playing a little fast and lose there. Calling n/0 infinity makes sense when you're just starting out. Like you said, the algebra seems to make sense. As you get higher in math you'll learn that that's really just a convienience, and not strictly true. It's a useful way to look at it sometimes, but if you're being strictly mathematical division by zero is undefined.\n \n \n\n In my opinion (or maybe it's fact, maybe it's completely wrong, I'm not an expert on this) it seems like if you're being precise you really can't have infinity since it isn't a precise number. It seems like you could make many definitions of how to do math with infinity. You could say that infinity + or minus anything is infinity and same with -infinity, only than addition would no longer be communitive and other stuff would be messed up. It seems like no matter what you do you would have to abandon adding, multiplying, etc. as if you were working with real numbers, you would have to give some further definitions to the common arithmetic operators (+, -, etc.) to include infinity and there could be different ways to redefine them. Am I wrong here?\n\n You're on the right track. Where you stepped off is when you said you can't have infinity because it isn't a precise number. Infinity is, in fact, not a number, but that doesn't mean it doesn't exist. It just means that you shouldn't try to do things with it that you would do with numbers. Like you said, addition, multiplication etc. really have no meaning when you try to apply them to infinity. Those are tools for manipulating numbers, and infinity isn't one.\n \n Edit:\n Here's a website that does an excellent job of discussing this:\n http://mathforum.org/dr.math/faq/faq.divideby0.html", 
   {}, 
   134010, 
   null, 
   1118156640.0
  ], 
  [
   134934, 
   null, 
   "zachvac", 
   "I read through the site you posted (I had actually read one of those when looking it up) but they all assume that we are looking for a real number. For example:\n \n \"12 divided by 0 is x \n would mean that \n 0 times x = 12. \n \n But no value would work for x because 0 times any number is 0! \n So division by zero doesn't work.\n \" - http://mathforum.org/library/drmath/view/58507.html\n \n By this logic we could conclude that i doesn't exist because we are talking about 2 numbers of the same sign equalling a negative number, thus the square root of -1 is undefined. But we extend the definitions and include imaginary and complex numbers. We change a few rules to make it work. Math is made up by us anyway, it just works. Sort of like the right hand rule with the cross product of vectors. We made it up, but as long as it's consistent, it works for our purposes. We wanted to work with the square root of negative numbers so we created i and redefined some rules and operations. Why can't we do that with infinity?\n \n For the purpose of this post assume n is any positive number that is not infinity or -infinity\n we could as an axiom state that 1/0=infinity, n*infinity=infinity, n+infinity=infinity, infinity-infinity is indeterminable (can be any number [including infinity and -infinity]). infinity*infinity=infinity, all other mathematical operations and their definitions apply unless overridden here except for 0*any number=0. So from the first one we could conclude that any real number x/0=infinity by the multiplication property of equality, that -1/0=-infinity, -n*infinity=-infinity, and many other things. There are other versions of definitions people could give to these operations but these seem the most logical to me. What's wrong with adding definition like this?", 
   {}, 
   134066, 
   null, 
   1118294160.0
  ], 
  [
   135049, 
   null, 
   "Jo Bennett", 
   "Because they wouldn't be any use for anything. What would you use them for?", 
   {}, 
   134934, 
   null, 
   1118339520.0
  ], 
  [
   140657, 
   null, 
   "canadianman77", 
   "I read through the site you posted (I had actually read one of those when looking it up) but they all assume that we are looking for a real number. For example:\n \n \"12 divided by 0 is x \n would mean that \n 0 times x = 12. \n \n But no value would work for x because 0 times any number is 0! \n So division by zero doesn't work.\n \" - http://mathforum.org/library/drmath/view/58507.html\n \n By this logic we could conclude that i doesn't exist because we are talking about 2 numbers of the same sign equalling a negative number, thus the square root of -1 is undefined. But we extend the definitions and include imaginary and complex numbers. We change a few rules to make it work. Math is made up by us anyway, it just works. Sort of like the right hand rule with the cross product of vectors. We made it up, but as long as it's consistent, it works for our purposes. We wanted to work with the square root of negative numbers so we created i and redefined some rules and operations. Why can't we do that with infinity?\n \n For the purpose of this post assume n is any positive number that is not infinity or -infinity\n we could as an axiom state that 1/0=infinity, n*infinity=infinity, n+infinity=infinity, infinity-infinity is indeterminable (can be any number [including infinity and -infinity]). infinity*infinity=infinity, all other mathematical operations and their definitions apply unless overridden here except for 0*any number=0. So from the first one we could conclude that any real number x/0=infinity by the multiplication property of equality, that -1/0=-infinity, -n*infinity=-infinity, and many other things. There are other versions of definitions people could give to these operations but these seem the most logical to me. What's wrong with adding definition like this?\n\n I wonder what 0/infinity would look like if we locked it in a room with a bunch of eggheads for a year and threw in food to keep them alive and lots of coffee?! Lmao!!", 
   {}, 
   134934, 
   null, 
   1119618360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Infinity", 
  "url": "http://www.4forums.com/political/science-math-debates/5355-infinity.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 5355, 
  "discussion_files": [
   [
    "14665.html", 
    "http://www.4forums.com/political/science-math-debates/5355-infinity-print.html"
   ], 
   [
    "14666.html", 
    "http://www.4forums.com/political/science-math-debates/5355-infinity-4-print.html"
   ], 
   [
    "14667.html", 
    "http://www.4forums.com/political/science-math-debates/5355-infinity-3-print.html"
   ], 
   [
    "14668.html", 
    "http://www.4forums.com/political/science-math-debates/5355-infinity-2-print.html"
   ]
  ], 
  "identifier": 5355
 }
]