[
 [
  [
   127032, 
   null, 
   "daewoo", 
   "I just happened across this page that explains the weak dollar and the associated problems. It is written so even kids can understand it.\n \n \n http://www.gold-eagle.com/gold_digest_04/stott101404.html\n \n \n Worth reading, though an important exception was left out The paragraph that reads:\n \n \nIf the US dollar is weak, compared to say the Japanese yen, then the Japanese goods will cost more to purchase here, and it will harm Japanese exports to us. By the same token, if our dollar is weak, compared to the yen, then the Japanese will find that American goods are cheaper for the Japanese to buy, and American exports will benefit. The yen is not linked or locked to the dollar, but has a market of its own.\n\n \n Should really include the sentence \"Unless a given nations manufactured goods are heavily reliant on imported materials or production equipment, in whihc case the benifit of a weak currency may be overshadowed by increased production related import costs\".", 
   {
    "post_info": {
     "post_title": "Weak dollar for idiots"
    }
   }, 
   null, 
   null, 
   1116830700.0
  ], 
  [
   127033, 
   null, 
   "Missouri Mule", 
   "I just happened across this page that explains the weak dollar and the associated problems. It is written so even kids can understand it.\n \n http://www.gold-eagle.com/gold_digest_04/stott101404.html\n \n Worth reading, though an important exception was left out The paragraph that reads:\n \n Should really include the sentence \"Unless a given nations manufactured goods are heavily reliant on imported materials or production equipment, in whihc case the benifit of a weak currency may be overshadowed by increased production related import costs\".\n\n \n Sometimes that is true and sometimes it isn't. It also depends on whether or not the foreign company desires to maintain its market share. Toyota's sales are booming but its profits and stock prices are moving sideways if not downward. This is one reason that the Japanese have had to move a lot of its own manufacturing to other countries for lower priced labor. Look at your Japanese nameplates and see where they are manufactured.\n \n BTW, you left out the most important part and is what is driving this fellow's argument. I've heard the same thing dating back to the 1970s when gold went all the way to $850. Those ladies in the secretarial pool are still waiting to regain their investment.\n \n Don Stott has been a precious metals broker since 1977, has written five books, hundreds of columns, and his web site is www.coloradogold.com", 
   {}, 
   127032, 
   null, 
   1116831000.0
  ], 
  [
   127048, 
   null, 
   "daewoo", 
   "Sometimes that is true and sometimes it isn't. It also depends on whether or not the foreign company desires to maintain its market share. Toyota's sales are booming but its profits and stock prices are moving sideways if not downward. This is one reason that the Japanese have had to move a lot of its own manufacturing to other countries for lower priced labor. Look at your Japanese nameplates and see where they are manufactured.\n\n \n Doesn't matter. Company X is an american comapny that produces widgets. 54% of the cost of production on those widgets is imported materials, BLM goods and tooling. The dollar falls 5%. The cost of production for company X goes up. Company X must raise prices to remain competitive. \n \n You get another reaction when conifdering imports, which is why consumer level inflation always follows monetary inflation isntead fo leading it. The japanese have been eating the diffrence iun order to maintain market share until consumer levle inflaiton catches up and raises the cost of US vehicles (though their latest numbers show 16% ROI, so as usual your assesment is wrong). As consumer level inflaiton picks up, our import partners will raise prices along with US companies in order to boost profits.", 
   {}, 
   127033, 
   null, 
   1116833340.0
  ], 
  [
   127410, 
   null, 
   "lord tammerlain", 
   "http://www.atimes.com/atimes/Global_Economy/GE24Dj03.html\n \n An opinion piece on a very related topic\n \n \n\n \n Time-traveling from the Greek to the Roman empire, the British empire, and the young history of the US, one notes that the most widely accepted (reserve) currency always had its home in the political powerhouse of its times. Political power rests on three determining factors: the productive capacity of that nation; its international trade relations; and its capability to defend itself. \n \n snip\n \n Inflation, the beginning of the end\n The aureus had a respectable lifespan of more than 400 years before inflation diminished its reputation. Nothing has changed since: whenever a currency loses its value, so does its popularity. First the Roman emperors started chipping away at the edges - the need to prevent this resulted in the edge grooves still seen on many coins now in circulation - and then the purity of the coins was tampered with until they became pieces of lead covered with a thin coat of gold. \n \n As the Roman empire declined, so did the Roman money as a means of tangible form of payment for goods and services. In medieval times, all forms of money, and their respective strength, were mainly tied to the content of precious metals - a system that continued till World War I. One Swiss gold franc had the same value as one Austrian gold crown or a Dutch gold coin of the same weight. There was no need for a Bretton Woods agreement in these times. \n \n \n snip\n \n The reserve currency of the 18th and 19th century was undoubtedly the British pound sterling. As the name says, a one pound note could at any time be redeemed against one pound of sterling (pure) silver at the Bank of England or before that at the treasury of the king. The sixpence stemmed from the custom of cutting a silver penny in six equal pieces for small purchases. \n \n With the demise of the British empire, which went hand in hand with the outsourcing of its productive capacity to the colonies, where labor was cheap,  the pound was replaced by the US dollar in the early 20th century, when the US ascended to the throne of the biggest economy in the world, a place it has held ever since. \n \n \n snip\n \n Of course it is premature to speculate about the yuan becoming the reserve currency of the world. But it is not premature to speculate when the resource-rich countries will begin to favor the euro as the preferred means of payment for the riches in their soil. Until now, commodities have been predominantly priced in dollars on the world markets, stemming from the fact that the US is the single-biggest buyer and consumer of energy and has been the biggest buyer of most other commodities. In an age of global redistribution, this might change as the US gives up its number one purchaser position.  \n Staying with dollar-based prices - which could mean using the currency of a third country that is primarily known for its huge amount of debt and no plausible recipe for a turnaround - could become too costly a way for others to conduct their bilateral trade. After outsourcing American production, an outsourcing of control of international trade could well be on the way. The race for financial dominance is on. And it will be decided in favor of the country or region that manages to maintain a lead in production, which will inevitably be located in proximity to the world's largest base of consumers.  \n \n", 
   {}, 
   127048, 
   null, 
   1116880800.0
  ], 
  [
   127417, 
   null, 
   "Missouri Mule", 
   "Doesn't matter. Company X is an american comapny that produces widgets. 54% of the cost of production on those widgets is imported materials, BLM goods and tooling. The dollar falls 5%. The cost of production for company X goes up. Company X must raise prices to remain competitive. \n \n You get another reaction when conifdering imports, which is why consumer level inflation always follows monetary inflation isntead fo leading it. The japanese have been eating the diffrence iun order to maintain market share until consumer levle inflaiton catches up and raises the cost of US vehicles (though their latest numbers show 16% ROI, so as usual your assesment is wrong). As consumer level inflaiton picks up, our import partners will raise prices along with US companies in order to boost profits.\n\n \n I beg to differ with you. Raising prices seldom enhances a company's competitiveness. Many times it is necessary to eat the additional costs or reduce them from what they formerly were. This is what Wal-Mart does all the time. They squeeze their vendors and are not all that popular as a result but no one can arguably make the case that they are uncompetitive. \n \n A lot of German companies have had to suck it up or give up the market when the Euro increased in value. And many more simply gave up the fight and put their manufacturing plants in America where labor costs are not out of sight as in Germany. \n \n BTW, all of the Toyota Camry production is based right here in the U.S. (They now have eight plants.) They are building a new Tundra factory in San Antonio. They will shortly be building the new Camry hi-brid here in the U.S. as well. Nissan builds their new Titan P/U in the U.S. and 85% of their content is American made. I really can't recall when the Japanese raised prices on much of anything. I was looking at a new Toyota Camry the other day and if anything it looked to be priced lower than it was in 2002. If you are arguing that manufactured goods in Japan would be raised it may be so but I'm unaware of that and we know, because it has been published, that Toyota's profits have gone down even though their sales have gone up. \n \n Bottom line is that one can only raise their prices when they \"can get away with it.\" Competitive forces more often than not don't permit that. And that's why (to change the subject slightly) medical care costs won't come down until the market is allowed to work its magic. That will have to come sooner or later or we will all be bankrupt.", 
   {}, 
   127048, 
   null, 
   1116881400.0
  ], 
  [
   127571, 
   null, 
   "daewoo", 
   "I beg to differ with you. Raising prices seldom enhances a company's competitiveness. Many times it is necessary to eat the additional costs or reduce them from what they formerly were. This is what Wal-Mart does all the time. They squeeze their vendors and are not all that popular as a result but no one can arguably make the case that they are uncompetitive. \n\n \n Competitive was a bad choice of words, though a company selling at less than their production cost will not be in business long, which is about as uncompetitive as you can get. The wiord I was looking for was viability.", 
   {}, 
   127417, 
   null, 
   1116901620.0
  ], 
  [
   135476, 
   null, 
   "Missouri Mule", 
   "Competitive was a bad choice of words, though a company selling at less than their production cost will not be in business long, which is about as uncompetitive as you can get. The wiord I was looking for was viability.\n\n \n Well we know that GM is losing money and they certainly aren't viable. On the other hand Wal-Mart is making money and they are viable. Offhand I would say viability is a function of good or bad management.", 
   {}, 
   127571, 
   null, 
   1118424240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Weak dollar for idiots", 
  "url": "http://www.4forums.com/political/economics-debates/5367-weak-dollar-idiots.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 5367, 
  "discussion_files": [
   [
    "13478.html", 
    "http://www.4forums.com/political/economics-debates/5367-weak-dollar-idiots-print.html"
   ]
  ], 
  "identifier": 5367
 }
]