[
 [
  [
   127084, 
   null, 
   "Snoopy", 
   "American investigators involved in the probe say Saddam Hussein misused the program to get military related goods for 7 years. They were allegedly pooled and to later used by Fedayeen against American commandos. Even if so, I tend to see it kind of blinder on the American part. Their Hulliburton \"love affair\" with notorious Saddam is far more captivating story. Actually this firm accumulated rather a pool of money due to lucrative oil contracts with Saddam. And Mr. Rumsfeld was well in the know that Saddam got not cash but American weapons for oil. Cheney role in Hulliburton should be explored as well imo. Keep it in mind that Hulliburton is the recipient of massive tax payers' subsidies. Can they be happy with the fact that this company is used by public officials to cheat, give bribes to dictators and so forth? It's 90% certainty that Washington is presently keeping with those endless bloody wars to get super profits by means of such companies. And it will fight tooth and nail to go on with it. And it's going to attack people and organizations trying to stop it. UN was strongly against war in Iraq and now it's not supportive of the American probable military operation in Iran. No wonder UN is target of strong criticism. Well it doesn't add optimism. What if countries unite their efforts and arrange second of Nuremberg for Bush and his command?", 
   {
    "post_info": {
     "post_title": "White House hysteria around that UN program oil-for-food looks fishy"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1116842820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  White House hysteria around that UN program oil-for-food looks fishy", 
  "url": "http://www.4forums.com/political/peace-middle-east/5372-white-house-hysteria-around-un-program-oil-food-looks-fishy.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5372, 
  "discussion_files": [
   [
    "21866.html", 
    "http://www.4forums.com/political/peace-middle-east/5372-white-house-hysteria-around-un-program-oil-food-looks-fishy-print.html"
   ]
  ], 
  "identifier": 5372
 }
]