[
 [
  [
   127100, 
   null, 
   "Close_slave_can", 
   "I will admit my ignorance. \n I thought that the only intereptation of the Adam and Eve Story was just a long winded way of saying man is flawed. What else is there?", 
   {
    "post_info": {
     "post_title": "Isn't &quot;Adam and Eve&quot; just a way of saying man is flawed?"
    }
   }, 
   null, 
   null, 
   1116850140.0
  ], 
  [
   127212, 
   null, 
   "trebor", 
   "I will admit my ignorance. \n I thought that the only intereptation of the Adam and Eve Story was just a long winded way of saying man is flawed. What else is there?\n\n \n I guess you are not understanding the Hebrew involved. There are plenty of puns, a lot of political references, and bunch of 'just so' stories in there.\n \n For example, ADAM means mankind, and is related to the term 'dirt' Adamah, also known as 'red clay'. Adamah is also related to the term 'edom' which means blood. \n \n The term 'created' is the term that potter would used for forming pots. So, if you look at the sentace 'God created man out of dirt', you could see the subtles such as 'God formed mankind out of flesh and blood' similar to the way a potter forms pots out clay'. \n \n the Hebrew for Eve is related to two word, LOVE and LIFE. \n \n So, God gave mankind love and life for companionship. \n \n The concept of man being 'flaws' because of adam and eve is something that was added by Paul, and expanded up on by Saint Augustus. It is not inherent in the text of Genesis if you are educated with some of the deeper, allegoricial meanings of Adam and EVe.", 
   {}, 
   127100, 
   null, 
   1116868080.0
  ], 
  [
   127229, 
   null, 
   "billsco", 
   "So, God gave mankind love and life for companionship. \n \n \n\n \n It's also helpful to understand the word mankind is composed of two separate words. MANK and IND. \n \n I just don't make any sense of it.", 
   {}, 
   127212, 
   null, 
   1116868680.0
  ], 
  [
   127693, 
   null, 
   "thebootfitter", 
   "It's also helpful to understand the word mankind is composed of two separate words. MANK and IND. \n\n Ha! I love \"Deep Thoughts... by Jack Handey\"!!!", 
   {}, 
   127229, 
   null, 
   1116916440.0
  ], 
  [
   127705, 
   null, 
   "peddler8111", 
   "I will admit my ignorance. \n I thought that the only intereptation of the Adam and Eve Story was just a long winded way of saying man is flawed. What else is there?\n\n Maybe you should read the book. Just a thought.", 
   {}, 
   127100, 
   null, 
   1116917280.0
  ], 
  [
   127878, 
   null, 
   "Nurglitch", 
   "Trebor's got a point. You have to be up on classical Hebrew allegory and metaphor to read Genesis with any hope of understanding it correctly. When in doubt, ask a Rabbi.", 
   {}, 
   127705, 
   null, 
   1116956460.0
  ], 
  [
   128119, 
   null, 
   "Close_slave_can", 
   "I just reread the king james version, and it still seems that it would make no difference if you view the chapter literally or not, If you disagree please state how the literal events guide your moral compass.", 
   {}, 
   127878, 
   null, 
   1116979800.0
  ], 
  [
   128338, 
   null, 
   "unkerpaulie", 
   "in taking genesis literally, you accept that God is all-powerful, and that man has sinned and is need of redemption. if the events in genesis did not occur in reality, then there is no reason to believe that God is all-powerful in reality, nor that man is sinful and in need of redemption in reality. therefore there is no reason to believe that christianity (based on the premises i described above) is a valid religion if genesis is not taken literally\n \n anything is possible in fiction (including making 5-sided round squares, eating burritos too hot to eat, and creating people from dirt)", 
   {}, 
   128119, 
   null, 
   1117036200.0
  ], 
  [
   128344, 
   null, 
   "Close_slave_can", 
   " if the events in genesis did not occur in reality, then there is no reason to believe that God is all-powerful in reality\n\n \n \n Certain evidence of genesis would prove God's existence. However we don't have that situation, so it is a free for all, It is up to you to decide if god is all powerful and I don't see what evolution has to do with it.", 
   {}, 
   128338, 
   null, 
   1117037100.0
  ], 
  [
   128386, 
   null, 
   "unkerpaulie", 
   "Certain evidence of genesis would prove God's existence. However we don't have that situation, so it is a free for all, It is up to you to decide if god is all powerful and I don't see what evolution has to do with it.\n\n how can a religion be based on the idea that god's power is anybody's guess? there must be a common and unifying concept about god's power that every member of the religion shares, otherwise the religion will fall apart in that aspect. a religion based upon a \"free-for-all\" ideology will not last. certainly no bible-based religion can support a free-for-all ideology", 
   {}, 
   128344, 
   null, 
   1117044960.0
  ], 
  [
   128529, 
   null, 
   "Close_slave_can", 
   "how can a religion be based on the idea that god's power is anybody's guess? there must be a common and unifying concept about god's power that every member of the religion shares, otherwise the religion will fall apart in that aspect. a religion based upon a \"free-for-all\" ideology will not last. certainly no bible-based religion can support a free-for-all ideology\n \n \n I did not choose my words carefully \"god's power anybody's guess\" should be replaced with \"god is all powerful, thats just the way it is\", every christian I have queried has this attitude so I really don't understand your concept about religion falling apart.", 
   {}, 
   128386, 
   null, 
   1117067280.0
  ], 
  [
   128553, 
   null, 
   "peddler8111", 
   "Trebor's got a point. You have to be up on classical Hebrew allegory and metaphor to read Genesis with any hope of understanding it correctly. When in doubt, ask a Rabbi.\n\n I have talked to many Rabbi's . Few of them took Genesis as true but not one said it was not written as history.", 
   {}, 
   127878, 
   null, 
   1117072980.0
  ], 
  [
   128554, 
   null, 
   "peddler8111", 
   "Certain evidence of genesis would prove God's existence. However we don't have that situation, so it is a free for all, It is up to you to decide if god is all powerful and I don't see what evolution has to do with it.\n\n All you need is a vague hypothesis to believe in evolution. You can not please God without faith.\n If you choose the unproven and ever changing scientific assumptions of atheists you have no faith at all. God could have made you believe and worship Him. He gave you free will. You have chosen to follow man instead.\n God is very fair. He keeps His Word. He exaults His Word above His name.\n You spit on His Word.", 
   {}, 
   128344, 
   null, 
   1117073280.0
  ], 
  [
   128741, 
   null, 
   "unkerpaulie", 
   "I did not choose my words carefully \"god's power anybody's guess\" should be replaced with \"god is all powerful, thats just the way it is\", every christian I have queried has this attitude so I really don't understand your concept about religion falling apart.\n\n obviously, thats a big difference lol\n \n fair enough. i agree that God's power is irrelevant to the truth of evolution. but it is not irrelevant to the truth of genesis. sadly, the truth of genesis is inversely proportional to truth of evolution, so in that way God's power does become an issue\n \n if genesis is not a literal account of what happened, why would we assume that God has the power to speak light into being, or form people out of dirt. genesis being an allegory suggests that god does NOT have the power to speak light into existence and form humans out of dust. if god lacks this fundamental power, why would we think that god has any power at all?\n \n i am asking directly to anybody that believes god exists: do you believe that god is powerful enough to speak a single planet in the universe into existence out of nothing? yes or no", 
   {}, 
   128529, 
   null, 
   1117124100.0
  ], 
  [
   128742, 
   null, 
   "unkerpaulie", 
   "All you need is a vague hypothesis to believe in evolution. You can not please God without faith.\n If you choose the unproven and ever changing scientific assumptions of atheists you have no faith at all. God could have made you believe and worship Him. He gave you free will. You have chosen to follow man instead.\n God is very fair. He keeps His Word. He exaults His Word above His name.\n You spit on His Word.\n\n when you say god's word, are you referring to the bible?", 
   {}, 
   128554, 
   null, 
   1117124220.0
  ], 
  [
   128761, 
   null, 
   "trebor", 
   "obviously, thats a big difference lol\n \n fair enough. i agree that God's power is irrelevant to the truth of evolution. but it is not irrelevant to the truth of genesis. sadly, the truth of genesis is inversely proportional to truth of evolution, so in that way God's power does become an issue\n \n if genesis is not a literal account of what happened, why would we assume that God has the power to speak light into being, or form people out of dirt. genesis being an allegory suggests that god does NOT have the power to speak light into existence and form humans out of dust. if god lacks this fundamental power, why would we think that god has any power at all?\n \n i am asking directly to anybody that believes god exists: do you believe that god is powerful enough to speak a single planet in the universe into existence out of nothing? yes or no\n\n \n Of course, that is 'assuming' that the god you are looking at is the Judeo-christian god, and you are looking at Genesis as literal, rather than allegorical.", 
   {}, 
   128741, 
   null, 
   1117126020.0
  ], 
  [
   128763, 
   null, 
   "unkerpaulie", 
   "Of course, that is 'assuming' that the god you are looking at is the Judeo-christian god, and you are looking at Genesis as literal, rather than allegorical.\n\n no not necessarily. i'm talking about anybody that believes that any god exists, regardless of his historical source or biblical similarity\n \n does this god possess the power to create a living creature out of non-living matter, such as clay?", 
   {}, 
   128761, 
   null, 
   1117126560.0
  ], 
  [
   128772, 
   null, 
   "jim's trucking", 
   "in taking genesis literally, you accept that God is all-powerful, and that man has sinned and is need of redemption. if the events in genesis did not occur in reality, then there is no reason to believe that God is all-powerful in reality, nor that man is sinful and in need of redemption in reality. therefore there is no reason to believe that christianity (based on the premises i described above) is a valid religion if genesis is not taken literally\n \n anything is possible in fiction (including making 5-sided round squares, eating burritos too hot to eat, and creating people from dirt)\n\n \n BOOK OF LIFE Chapter 1\n a.Deserts are generally sandy and hot.\n b.Rivers are wet and flow downhill.\n c.Properly trained fish can fly at 30,000 feet AMSL.\n \n (c) is incorrect and unbelievable; therefore there is no reason to believe (a) or (b)\n \n I don't think so! emoticon_rolleyes \n \n (This is not like you, unkerpaulie.)", 
   {}, 
   128338, 
   null, 
   1117127640.0
  ], 
  [
   128804, 
   null, 
   "unkerpaulie", 
   "BOOK OF LIFE Chapter 1\n a.Deserts are generally sandy and hot.\n b.Rivers are wet and flow downhill.\n c.Properly trained fish can fly at 30,000 feet AMSL.\n \n (c) is incorrect and unbelievable; therefore there is no reason to believe (a) or (b)\n \n I don't think so! emoticon_rolleyes \n \n (This is not like you, unkerpaulie.)\n\n if properly trained fish have never flown at 30,000 feet amsl, then there is no reason to believe that properly trained can fly at 30,000 feet amsl. that is what i am saying. if god did not create man out of dirt, or speak the sun into existence, then there is no reason to believe that god CAN form humans out of dirt, nor speak the sun into existence\n \n furthermore, in your example you listed 3 things that are not interdependent. \n \n can we assume that god possesses the ability to form living people from dirt and/or speak the sun and moon into existence?", 
   {}, 
   128772, 
   null, 
   1117130880.0
  ], 
  [
   128832, 
   null, 
   "jim's trucking", 
   "if properly trained fish have never flown at 30,000 feet amsl, then there is no reason to believe that properly trained fish can fly at 30,000 feet amsl. that is what i am saying.\nThis is not logically sound. Man has not been to Mars. I can still believe that man will someday get to Mars. \n \n \n\n if god did not create man out of dirt, or speak the sun into existence, then there is no reason to believe that god CAN form humans out of dirt, nor speak the sun into existence\nThis is also not logically sound. The fact that I have not yet (did not) paint an oil on canvas that rivals those of the Dutch masters does not mean that I cannot.\n \n \n \n\n furthermore, in your example you listed 3 things that are not interdependent.\n They don't have to be interdependent when used to argue that a perceived falacy in one part of a book (Genesis) does not mean the entire book is invalid. Hense, I can believe some parts literally and accept others as allegories.\n \n \n \n\n can we assume that god possesses the ability to form living people from dirt and/or speak the sun and moon into existence?\nI suppose one can assume anything one chooses about God. There's a difference between being capable of doing things and actually doing them. I believe God is capable of anything, but I don't believe He did it just by speaking things into existence. The only way mankind can understand how things came about is to put them in simplistic, believable terms.\n \n God said, \"Let there be light.\"... and there was light. That doesn't mean He actually mouthed the words. It's just part of man's attempt to understand.", 
   {}, 
   128804, 
   null, 
   1117133460.0
  ], 
  [
   128951, 
   null, 
   "unkerpaulie", 
   "This is not logically sound. Man has not been to Mars. I can still believe that man will someday get to Mars. \n \n This is also not logically sound. The fact that I have not yet (did not) paint an oil on canvas that rivals those of the Dutch masters does not mean that I cannot.\n\n im talking about it being reasonable to assume. if no trained fish in history has ever flown at 30,000 feet, then there is no reason to assume that fish can fly at that altitude. it doesnt make it a fact that no fish can fly at that altitude, but just that there is no reason to assume such\n \n \nThey don't have to be interdependent when used to argue that a perceived falacy in one part of a book (Genesis) does not mean the entire book is invalid. Hense, I can believe some parts literally and accept others as allegories.\n\n i'm not invalidating christianity simply because it happens to be in the same book as genesis. the problem is that christianity is based directly upon the premises found in genesis.\n \n \nI suppose one can assume anything one chooses about God. There's a difference between being capable of doing things and actually doing them. I believe God is capable of anything, but I don't believe He did it just by speaking things into existence. The only way mankind can understand how things came about is to put them in simplistic, believable terms.\n \n God said, \"Let there be light.\"... and there was light. That doesn't mean He actually mouthed the words. It's just part of man's attempt to understand.\n\n you are not answering the question. is it reasonable to assume that god possesses the ability to speak the moon into existence and/or form living people out of dirt?", 
   {}, 
   128832, 
   null, 
   1117144380.0
  ], 
  [
   129001, 
   null, 
   "jim's trucking", 
   "im talking about it being reasonable to assume. if no trained fish in history has ever flown at 30,000 feet, then there is no reason to assume that fish can fly at that altitude. it doesnt make it a fact that no fish can fly at that altitude, but just that there is no reason to assume such\nAside: I'm not aware of the existence of any trained fish, except maybe to say that pond raised catfish will gather near an aproaching feed tractor (they sense the vibrations of it) expecting the food. It was introduced as a logic train only. It is logical for humans to assume that fish will never fly at 30,000 feet AMSL...but the fact that we have never witnessed it is not basis enough for the belief that it will never happen. It's their basic structure and the need for water flowing thru gills that makes me believe they will never fly in air (other than as the existing \"flying fish\" do).\n \n \n \n \n\n i'm not invalidating christianity simply because it happens to be in the same book as genesis. the problem is that christianity is based directly upon the premises found in genesis.\nI'm not sure I agree with that. Christianity is based on the New Testament.\n \n \n\n you are not answering the question. is it reasonable to assume that god possesses the ability to speak the moon into existence and/or form living people out of dirt?\nI'm hesitant to attach human frailties to God. If we agree that God is omnipotent, it is foolish to limit his powers to those we understand or can accept as physical possibilities. It is unimaginable that any human could do that, therefore hard to imagine God doing it. This is likely why I believe the 6-day creation is an allegory. I don't believe earth came before the sun. I don't believe God spoke the sun into existence. I believe He set the whole thing in motion and things happened from there, taking millions of years to develop into stars, planets, etc. There are star nurseries spitting out baby stars as we speak. Our sun was just one of them. Perhaps another habitable planet will develop and life will be introduced to it and evolve into many species ruled by intelligent beings, just as it did here. Perhaps this has already happened in a number of places.\n \n It is extremely difficult to believe that our little earth is the only place in the universe where lifeforms came to be.\n \n I believe it is reasonable to assume that God is capable of doing those things, but those are not necessarily the ways He made them.", 
   {}, 
   128951, 
   null, 
   1117149120.0
  ], 
  [
   129004, 
   null, 
   "trebor", 
   "\n \n I'm not sure I agree with that. Christianity is based on the New Testament.\n \n\n \n \n If that is true, why do so many people quote Genesis when trying to prove 'Original sin'.\n \n Why do so many people quote Leviticus when foaming at the mouth about homosexuality?\n \n Why do so many people use mistranslations,and quotes out of contexts to from the \"Old testament\" to show a 'prophecy' about Jesus?", 
   {}, 
   129001, 
   null, 
   1117149420.0
  ], 
  [
   129009, 
   null, 
   "jim's trucking", 
   "If that is true, why do so many people quote Genesis when trying to prove 'Original sin'.\nI do not know.\n \n \n \n\n Why do so many people quote Leviticus when foaming at the mouth about homosexuality?\nI do not know.\n \n \n \n\n Why do so many people use mistranslations,and quotes out of contexts to from the \"Old testament\" to show a 'prophecy' about Jesus?\nI do not know.\n \n Perhaps the answers to all three questions are the same...they just don't know any better.\n \n However, I do know that Jesus Christ(ianity) arrived in the middle of the story and straightened out some misconceptions about the Old Testament. The Old Testament is more of a basis for Judaism than Christianity. The Jews simply believe the Messiah hasn't arrived yet.", 
   {}, 
   129004, 
   null, 
   1117150020.0
  ], 
  [
   129035, 
   null, 
   "trebor", 
   "I do not know.\n \n \n I do not know.\n \n \n I do not know.\n \n Perhaps the answers to all three questions are the same...they just don't know any better.\n \n However, I do know that Jesus Christ(ianity) arrived in the middle of the story and straightened out some misconceptions about the Old Testament. The Old Testament is more of a basis for Judaism than Christianity. The Jews simply believe the Messiah hasn't arrived yet.\n\n \n From the Jewish point of view, the Jesus arriaved, and created more misconceptions about the Tanakh, or rather the believers in him that came afterwards. The concept of the Messiah from the Jewish perspectiive is much much different than the Christian perspective.", 
   {}, 
   129009, 
   null, 
   1117154760.0
  ], 
  [
   129232, 
   null, 
   "unkerpaulie", 
   "I believe it is reasonable to assume that God is capable of doing those things, but those are not necessarily the ways He made them.\n\n what we both agree on is that even though we have never observed something (fish flying) we cannot definitely conclude that it is impossible, but at the same time we can reasonable assume that it is impossible. furthermore, never having seen fish flying at that altitude, we have NO REASON to believe that it is possible. is this correct?\n \n now, you believe that it is reasonable to assume that God has the ability to transform dirt into living organisms, and to speak a planet into existence. may i ask what is the reason that you believe this?", 
   {}, 
   129001, 
   null, 
   1117208400.0
  ], 
  [
   129236, 
   null, 
   "unkerpaulie", 
   "\"I'm not sure I agree with that. Christianity is based on the New Testament.\"\n \n christianity is based on the life of jesus christ, and the indoctrination of the early church by paul. can we agree to that?\n \n jesus was recorded in the new testament numerous times referencing the \"scriptures\" or old testament. his references touched on everything in the old testament, from the creation by god, to adam, to noah, to abraham, to the exodus, moses, the laws, joshua, the kings, the psalms and proverbs, and the phophets. nearly every major old testament event and concept was addressed by jesus in the gospels.\n \n furthermore, paul introduced lots of new ideas and customs as parts of the church functionality and traditions. he also referenced quite a few old testament cites.\n \n christianity is explictly founded upon the old testament in a fundamental way", 
   {}, 
   129232, 
   null, 
   1117209180.0
  ], 
  [
   129251, 
   null, 
   "jim's trucking", 
   "what we both agree on is that even though we have never observed something (fish flying) we cannot definitely conclude that it is impossible, but at the same time we can reasonable assume that it is impossible. furthermore, never having seen fish flying at that altitude, we have NO REASON to believe that it is possible. is this correct?\nNot entirely. The fact that we have never seen them flying at that altitude as little to do with lack of belief that they could. So the sentence, \"never having seen fish flying at that altitude, we have NO REASON to believe it is possible\" puts undue value on the fact that we have not seen them do it. My hesitancy in believing they can fly at all is based on their structure and physical restraints rather than the fact that I have not seen it happen. This is much the same as in my never having seen an alien spacecraft should not imply that they do not exist. Not having experienced (seen) something is no reason to believe it doesn't exist.\n \n \n \n\n now, you believe that it is reasonable to assume that God has the ability to transform dirt into living organisms, and to speak a planet into existence. may i ask what is the reason that you believe this?\nMy belief is that God is omnipotent. \n \n However, just because God can do anything does not mean that He did it that way. I'm saying he could have made man out of dirt, but didn't. I'm saying He could speak a planet into existence, but hasn't yet (that I know of).", 
   {}, 
   129232, 
   null, 
   1117212600.0
  ], 
  [
   129256, 
   null, 
   "jim's trucking", 
   "\"I'm not sure I agree with that. Christianity is based on the New Testament.\"\n\n \n christianity is based on the life of jesus christ, and the indoctrination of the early church by paul. can we agree to that?\nYes.\n \n \n \n\n jesus was recorded in the new testament numerous times referencing the \"scriptures\" or old testament. his references touched on everything in the old testament, from the creation by god, to adam, to noah, to abraham, to the exodus, moses, the laws, joshua, the kings, the psalms and proverbs, and the phophets. nearly every major old testament event and concept was addressed by jesus in the gospels.\n \n furthermore, paul introduced lots of new ideas and customs as parts of the church functionality and traditions. he also referenced quite a few old testament cites.\n \n christianity is explictly founded upon the old testament in a fundamental way\nChristianity is based of the belief that Jesus Christ is the Savior (Messiah) prophesied in the Old Testament. Jesus is a Jew. Jesus came through Jewish bloodline. The Jews maintain that the Messiah is yet to come.\n \n Without the Old Testament, there is no lineage attached to Jesus, therefore I will agree that Christianity had its roots recorded in the Old Testament. If Jesus had not come, we'd likely still have religions based fundamentally on the Old Testament, but we just wouldn't have Christianity. Christianity is based more on the New Testament than the Old Testament, even though you can't have one without the other.", 
   {}, 
   129236, 
   null, 
   1117213560.0
  ], 
  [
   129258, 
   null, 
   "unkerpaulie", 
   "Not entirely. The fact that we have never seen them flying at that altitude as little to do with lack of belief that they could. So the sentence, \"never having seen fish flying at that altitude, we have NO REASON to believe it is possible\" puts undue value on the fact that we have not seen them do it. My hesitancy in believing they can fly at all is based on their structure and physical restraints rather than the fact that I have not seen it happen. This is much the same as in my never having seen an alien spacecraft should not imply that they do not exist. Not having experienced (seen) something is no reason to believe it doesn't exist.\n\n having never seen aliens, as well as the information i have about the sightings of aliens, i believe it is reasonable to believe that earth-visiting aliens do not exist\n \n \nMy belief is that God is omnipotent. \n \n However, just because God can do anything does not mean that He did it that way. I'm saying he could have made man out of dirt, but didn't. I'm saying He could speak a planet into existence, but hasn't yet (that I know of).\n\n therefore, you have no REASON to believe that god is omnipotent, or at the very least capable of speaking things into existence and giving life to dirt. why would i believe he is capable of doing these things?", 
   {}, 
   129251, 
   null, 
   1117213800.0
  ], 
  [
   129339, 
   null, 
   "jim's trucking", 
   "having never seen aliens, as well as the information i have about the sightings of aliens, i believe it is reasonable to believe that earth-visiting aliens do not exist\nActually, your conclusion should be that you have no reason to believe that they exist rather than that you have reason to believe that they do not exist. Lack of a sighting is not indicative of non-existence.\n \n Would you agree that our military may have some secret weapons that we have never seen? If so, then your logic tieing an incidence of not having ever seen something to reasoning that it doesn't exist is invalid. If not, naivete has overcome you.\n \n There are likely millions of things I have never seen. I will not jump to the conclusion that they do not exist. My only conclusion is that I have no reason (yet) to believe that they do exist.\n \n \n \n\n therefore, you have no REASON to believe that god is omnipotent, or at the very least capable of speaking things into existence and giving life to dirt. why would i believe he is capable of doing these things?\nFaith does not require reason.", 
   {}, 
   129258, 
   null, 
   1117220520.0
  ], 
  [
   129348, 
   null, 
   "trebor", 
   "\n \n Faith does not require reason.\n\n \n \n I will even go further, and say that faith requires a lack of reason.", 
   {}, 
   129339, 
   null, 
   1117221540.0
  ], 
  [
   129353, 
   null, 
   "billsco", 
   "Further, in spite of reason.", 
   {}, 
   129348, 
   null, 
   1117222020.0
  ], 
  [
   129368, 
   null, 
   "jim's trucking", 
   "I will even go further, and say that faith requires a lack of reason.\nNot necessarily. I have faith that my truck will start each morning. The reason is that it hasn't failed me yet. When it begins to fail on a regular basis, I will lose my faith in it. I have faith in certain people for a similar reason.\n \n \n \nFurther, in spite of reason.\nThat, too! But when you're talking about faith in God, it is incorrect to confine the argument to things that humans can understand. God is not limited by our ability to reason.", 
   {}, 
   129348, 
   null, 
   1117223880.0
  ], 
  [
   129406, 
   null, 
   "billsco", 
   " I have faith that my truck will start each morning. The reason is that it hasn't failed me yet. When it begins to fail on a regular basis, I will lose my faith in it. \n\n \n Seeing that you own a Dodge, you'll be an atheist soon.", 
   {}, 
   129368, 
   null, 
   1117228140.0
  ], 
  [
   129806, 
   null, 
   "unkerpaulie", 
   "Actually, your conclusion should be that you have no reason to believe that they exist rather than that you have reason to believe that they do not exist. Lack of a sighting is not indicative of non-existence.\n \n Would you agree that our military may have some secret weapons that we have never seen? If so, then your logic tieing an incidence of not having ever seen something to reasoning that it doesn't exist is invalid. If not, naivete has overcome you.\n \n There are likely millions of things I have never seen. I will not jump to the conclusion that they do not exist. My only conclusion is that I have no reason (yet) to believe that they do exist.\n\n true, but you would still be able to determine what seems plausible based on your past experiences and knowledge. when i say something you've \"seen\" before, the meaning includes what you have heard or read about from reliable sources. therefore, it would be reasonable to believe that the military has secret weapons that we dont know about, because of what we know about the nature of the military.\n \n now, what we know about the nature of god tells us nothing of his ability to create life from dirt or to speak things into existence. the few references that imply that god has such abilities have been shown to be not based on actual events, but based on made up literature. a fictional story cannot giva us any information about the reality of something. therefore, we have no knowledge that god has the ability to speak things into existence.\n \n what reason is there to believe that god has these abilities?\n \n \nFaith does not require reason.\n\n i'd say that faith and reason are mutually exclusive, in that faith can only exist in the absence of reason. a combination of faith and reason can bring us to a belief, but as reason (evidence) increases, faith necessarily decreases. for example, the first time on a high-speed roller coaster, your belief in the reliability of the roller coaster may be mainly faith based (80% faith, 20% reason). then as you get more familiar from repeatedly riding the coaster and returning safely consistently, your belief may become 2% faith, 98% reason. of course, in your mind the possibility is that something unpredictible might happen still exists\n \n faith is the opposite of reason", 
   {}, 
   129339, 
   null, 
   1117341180.0
  ], 
  [
   129961, 
   null, 
   "jim's trucking", 
   "Seeing that you own a Dodge, you'll be an atheist soon.\nPssst! I was talking about my Ford!", 
   {}, 
   129406, 
   null, 
   1117393200.0
  ], 
  [
   131089, 
   null, 
   "Perry5", 
   "Werent Adam and Eve ejected from paradice because Adam could not control his serpent.", 
   {
    "post_info": {
     "post_title": "(Adam and Eve.)"
    }
   }, 
   127100, 
   null, 
   1117629360.0
  ], 
  [
   131090, 
   null, 
   "Jaaaman", 
   "Werent Adam and Eve ejected from paradice because Adam could not control his serpent.\n\n Adam and Eve were expelled from the garden due to there disobedience of Gods commandment not to eat of the tree of knowledge.", 
   {}, 
   131089, 
   null, 
   1117629960.0
  ], 
  [
   131122, 
   null, 
   "Waxy", 
   "Adam and Eve were expelled from the garden due to there disobedience of Gods commandment not to eat of the tree of knowledge.\n\n \n Yep, God likes his followers to be nice and dumb. :p :p \n \n Waxy", 
   {}, 
   131090, 
   null, 
   1117644600.0
  ], 
  [
   131140, 
   null, 
   "unkerpaulie", 
   "Yep, God likes his followers to be nice and dumb. :p :p \n \n Waxy\n\n you make it sound like sarcasm, but this is dead on. jesus likening his followers to sheep and children is no accident. the very idea of faith requires a base of ignorance to be effective. knowledge of any kind is counterproductive and even potentially detrimental to faith. i'm not trying to be sarcastic, this is as serious as it gets. ask any true believer", 
   {}, 
   131122, 
   null, 
   1117647180.0
  ], 
  [
   131146, 
   null, 
   "Big Orn", 
   "you make it sound like sarcasm, but this is dead on. jesus likening his followers to sheep and children is no accident. the very idea of faith requires a base of ignorance to be effective. knowledge of any kind is counterproductive and even potentially detrimental to faith. i'm not trying to be sarcastic, this is as serious as it gets. ask any true believer\n\n That's the mindset I've noticed of all those that think logic is supreme, but you miss the point entirely. Jesus is not referring to the ignorance of children, but the purety of heart - those that have not allowed \"the world\" to blind them to the things of God.", 
   {}, 
   131140, 
   null, 
   1117647540.0
  ], 
  [
   131160, 
   null, 
   "unkerpaulie", 
   "That's the mindset I've noticed of all those that think logic is supreme, but you miss the point entirely. Jesus is not referring to the ignorance of children, but the purety of heart - those that have not allowed \"the world\" to blind them to the things of God.\n\n the purity of heart is directly linked to the lack of knowledge in children. because children dont hove much knowledge and experience, they are essentially humble, gullible and unprejudiced. the only reason children lose these qualities is because as they grow up they become aware of reality and gain knowledge. however, people that grow up where education and experience is limited to a few areas (such as indigenous natives of remote countries) would still have some of these qualities and would make good candidates for adopting faith. right here in america and other developed countries, there is an evident lack of entusiasm for higher education in the church. the church-goers are contually programmed that worldly education is controlled by the devil, and that the knowledge of science and philosphy will turn their young people away from god. your very statement says this perfectly: \"those that have not allowed \"the world\" to blind them to the things of God\". a classic yet common case of religious brainwashing into thinking that knowledge of the world equates to evil and ungodliness\n \n there is no question that knowledge is the enemy of religion", 
   {}, 
   131146, 
   null, 
   1117649220.0
  ], 
  [
   131185, 
   null, 
   "Big Orn", 
   "the purity of heart is directly linked to the lack of knowledge in children. because children dont hove much knowledge and experience, they are essentially humble, gullible and unprejudiced. the only reason children lose these qualities is because as they grow up they become aware of reality and gain knowledge. however, people that grow up where education and experience is limited to a few areas (such as indigenous natives of remote countries) would still have some of these qualities and would make good candidates for adopting faith. right here in america and other developed countries, there is an evident lack of entusiasm for higher education in the church. the church-goers are contually programmed that worldly education is controlled by the devil, and that the knowledge of science and philosphy will turn their young people away from god. your very statement says this perfectly: \"those that have not allowed \"the world\" to blind them to the things of God\". a classic yet common case of religious brainwashing into thinking that knowledge of the world equates to evil and ungodliness\n \n there is no question that knowledge is the enemy of religion\n\n Ignorance is bliss? That's not the way I see it. But, how can I refute your claim? It's obvious to the world that if a person believes in the unseen things, good and/or bad, that they are classified as dumb, ignorant, even stupid. It's accepted that if a person increases their knowledge of the world and worldly things that they cannot accept God.\n However, you have still missed the point - Despite knowing these things, a person can still have a pure heart. They can still receive the blessings of God, spread the Gospel, build His kingdom, and then go home at night and find a way to travel to other planets via wormholes through the science of hyperdrive.", 
   {}, 
   131160, 
   null, 
   1117651140.0
  ], 
  [
   131187, 
   null, 
   "trebor", 
   "you make it sound like sarcasm, but this is dead on. jesus likening his followers to sheep and children is no accident. the very idea of faith requires a base of ignorance to be effective. knowledge of any kind is counterproductive and even potentially detrimental to faith. i'm not trying to be sarcastic, this is as serious as it gets. ask any true believer\n\n \n \n The whole things about God being the shepard and the believers being the sheep \n makes me think of mutton and lamb chops for some reason.", 
   {}, 
   131140, 
   null, 
   1117651260.0
  ], 
  [
   131192, 
   null, 
   "Big Orn", 
   "The whole things about God being the shepard and the believers being the sheep \n makes me think of mutton and lamb chops for some reason.\n\n Thousands of comedians out of work and you're trying to be funny...\n \n Ironic...", 
   {}, 
   131187, 
   null, 
   1117651380.0
  ], 
  [
   131716, 
   null, 
   "Perry5", 
   "A state of mind that is a guarantee of absolutely noting to absolutely no one.\n \n (Science and progress.)\n \n hit them over the head with the darkness of the bible and religian.\n \n Now that science has come to understand and treat the consepts of bipolar and mental depression are the christian communities ready to step forward and stop blaming God and demons for everything that thay do not understand???", 
   {
    "post_info": {
     "post_title": "(Faith.)"
    }
   }, 
   129339, 
   null, 
   1117704900.0
  ], 
  [
   131786, 
   null, 
   "unkerpaulie", 
   "Ignorance is bliss? That's not the way I see it. But, how can I refute your claim? It's obvious to the world that if a person believes in the unseen things, good and/or bad, that they are classified as dumb, ignorant, even stupid. It's accepted that if a person increases their knowledge of the world and worldly things that they cannot accept God.\n However, you have still missed the point - Despite knowing these things, a person can still have a pure heart. They can still receive the blessings of God, spread the Gospel, build His kingdom, and then go home at night and find a way to travel to other planets via wormholes through the science of hyperdrive.\n\n ron, without a doubt, the more one learns about reality, the more they lose their \"childlike purity\". its just a fact. maturity is the absence of childishness. it doesnt come with age, but with knowledge and experience. yes there are mature christians, but the more mature they become, the more they filter out parts of the bible that dont make sense to them. it is simply impossible to have knowledge of reality and still accept the bible as true. the person will have to suppress one or they other, because they both contradict.\n \n jesus admonishes his disciples to be like children because children are innocent and trusting. children are full of hope and admire their elders (well, back in those days lol). however, as one matures and gains knowledge, these qualities are replaced with caution, wisdom, skepticism and level-headedness. they are not spurred on by an idealistic utopia, but are sucked into the droning routine of day-to-day reality. of course the child-like qualities make for a more blissful existence, but its bliss at the cost of being oblivious to reality", 
   {}, 
   131185, 
   null, 
   1117729980.0
  ], 
  [
   131788, 
   null, 
   "unkerpaulie", 
   "A state of mind that is a guarantee of absolutely noting to absolutely no one.\n \n (Science and progress.)\n \n hit them over the head with the darkness of the bible and religian.\n \n Now that science has come to understand and treat the consepts of bipolar and mental depression are the christian communities ready to step forward and stop blaming God and demons for everything that thay do not understand???\n\n that will never happen. the more ignorance and unanswered questions exist, the more gaps for god to fill in. ANYTHING unexpected or unexplained is the work of god in the theist view", 
   {}, 
   131716, 
   null, 
   1117730160.0
  ], 
  [
   131806, 
   null, 
   "Big Orn", 
   "ron, without a doubt, the more one learns about reality, the more they lose their \"childlike purity\". its just a fact. maturity is the absence of childishness. it doesnt come with age, but with knowledge and experience. yes there are mature christians, but the more mature they become, the more they filter out parts of the bible that dont make sense to them. it is simply impossible to have knowledge of reality and still accept the bible as true. the person will have to suppress one or they other, because they both contradict.\n \n jesus admonishes his disciples to be like children because children are innocent and trusting. children are full of hope and admire their elders (well, back in those days lol). however, as one matures and gains knowledge, these qualities are replaced with caution, wisdom, skepticism and level-headedness. they are not spurred on by an idealistic utopia, but are sucked into the droning routine of day-to-day reality. of course the child-like qualities make for a more blissful existence, but its bliss at the cost of being oblivious to reality\n\n I can't say how you are, unkerpaulie, (nor anyone else here) in real life, or how you carry yourself in the face of adversity, but don't you agree that most \"learned\" people apply their own \"logic\" to the humdrum, droning of everyday life? It's human nature to feel burdened with problems that can't be worked out or with troubles that seem routine. Daily stress and pressures of the \"fast lane\" take even the most dedicated religious leaders aback. I consider knowledge power, just as you do, or anyone else for that matter, but I've come to the conclusion that the Lord has given us a way out - not shunning responsibility - but being able to cope with it according to the Gospel. The Gospel, btw, is not just a copious supply of spiritual edicts, but a way of life. I realize that Christianity has been donned with the wrong kind of armor due to its \"label\" from the Crusades and Inquisitions, but knowledge has been filtering out that mindset slowly, but surely, even though there are still those that hold to its sinful doctrine.\n Child-like faith comes with the acceptance that someone in authority is in control and that your problems are merely avenues of discovery - knowledge, if you will. The more of that sort of knowledge that a person acquires, the more they are able to solidify their faith and the more trust they have in God. That's my point. There's nothing wrong with remaining pure and innocent - and having the lap of a Father in which to sit when things go wrong. The Bible, as a whole, is telling us just that - and along came Christ to prove it - especially this part:\n \n jesus admonishes his disciples to be like children because children are innocent and trusting.\n\n What is so wrong with it?", 
   {
    "unicode_changes_made": true
   }, 
   131788, 
   null, 
   1117732020.0
  ], 
  [
   131822, 
   null, 
   "unkerpaulie", 
   "I can't say how you are, unkerpaulie, (nor anyone else here) in real life, or how you carry yourself in the face of adversity, but don't you agree that most \"learned\" people apply their own \"logic\" to the humdrum, droning of everyday life? It's human nature to feel burdened with problems that can't be worked out or with troubles that seem routine. Daily stress and pressures of the \"fast lane\" take even the most dedicated religious leaders aback. I consider knowledge power, just as you do, or anyone else for that matter, but I've come to the conclusion that the Lord has given us a way out - not shunning responsibility - but being able to cope with it according to the Gospel. The Gospel, btw, is not just a copious supply of spiritual edicts, but a way of life. I realize that Christianity has been donned with the wrong kind of armor due to its \"label\" from the Crusades and Inquisitions, but knowledge has been filtering out that mindset slowly, but surely, even though there are still those that hold to its sinful doctrine.\n Child-like faith comes with the acceptance that someone in authority is in control and that your problems are merely avenues of discovery - knowledge, if you will. The more of that sort of knowledge that a person acquires, the more they are able to solidify their faith and the more trust they have in God. That's my point. There's nothing wrong with remaining pure and innocent - and having the lap of a Father in which to sit when things go wrong. The Bible, as a whole, is telling us just that - and along came Christ to prove it - especially this part:\n \n What is so wrong with it?\n\n we are saying the same thing from different angles. the mental pacifier that god will take care of you does relieve stress for the person that feels the situation they are in is overwhelming them. however, like any other mind altering substance, the problem itself doesnt go away just because you've willed yourself into believing it has. on the positive side, the mental state of telling yourself \"god is with me, therefore i can defeat this\" is a fantastic affirmation, and guess what, the individual overcomes the problem. in this light there really is nothing wrong with seeing oneself as subjected to god\n \n however, realistically, it goes to show that, like in every situation that one can come across, how overwhelming it gets is nothing more than what the mind believes. if the mind believes that the condition is futile, then it becomes truth and the situation defeats you. however, once the mind says it is capable of handing and mastering the situation, the same becomes truth and the situation becomes and accomplished task. this holds whether you believe in god or not.\n \n the main difference is that the believer believes he could only overcome the siyuation with the help of god, while the non-believer believes that his own internal resolve is what causes him to overcome the situation. the results of both cases are the same, and really neither is \"wrong\". its more or less a matter of preference", 
   {
    "unicode_changes_made": true
   }, 
   131806, 
   null, 
   1117734180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Isn't \"Adam and Eve\" just a way of saying man is flawed?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5373-isnt-adam-eve-just-way-saying-man-flawed.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 5373, 
  "discussion_files": [
   [
    "22135.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5373-isnt-adam-eve-just-way-saying-man-flawed-print.html"
   ], 
   [
    "22136.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5373-isnt-adam-eve-just-way-saying-man-flawed-4-print.html"
   ], 
   [
    "22137.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5373-isnt-adam-eve-just-way-saying-man-flawed-3-print.html"
   ], 
   [
    "22138.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5373-isnt-adam-eve-just-way-saying-man-flawed-2-print.html"
   ]
  ], 
  "identifier": 5373
 }
]