[
 [
  [
   127446, 
   null, 
   "Uncle Sam I am", 
   "I wasn't sure what forum to post this on. This one seemed as good as any.\n \n The following is based on an editorial article by Dr. Erwin W. Lutzer in the 05/22/05 Chicago Tribune. It has been edited and modified by me since archived articles are available for a fee only.\n \n We have heard a lot about the religious right imposing their morality on others. But isn't it true that the left also tries to impose their agenda on the rest of us? Abortion, same sex marriage, the Teri Schiavo case, all are a matter of opinion, and no matter which side one is on, somebody is imposing their morality on someone else. In all moral judgments and in every law, someone's morality prevails, whether that of the right or the left.\n \n If same sex marriage becomes law, it affects more people than just those being married. It would affect adoption laws and the entire school system. Children will be taught in school that a family can be any combination of adults, 2 men or 2 women. Is that not a morality being imposed upon our children? Here in Illinois where I live, the human rights act has been amended to include sexual orientation, and it makes no exemption for churches. Churches that fail to comply will have their tax exempt status revoked, even though allowing homosexual priests, pastors or administration personnel would be the equivalent of allowing adulterers, fornicators or thieves. One of the basic tenants of religion is the biblical definition of sin. The left is imposing its morality on the church by making them redefine sin according to their political correct ideology rather than by what the bible says. It seems political correctness has trumped freedom of religion.\n \n Much to do is made about the 1st amendment phrase \"Congress shall make no law respecting an establishment of religion\" as a reason to eliminate expressions of religion from public life. But the second part of the sentence is conveniently forgotten, which bars congress from \"prohibiting the free exercise thereof.\" How is it that we have interpreted this amendment to mean that a student who brings his bible to class is somehow an example of congress establishing a religion? And is congress not prohibiting the free exercise of religion when they tell churches that they have to hire homosexuals and to allow them to hold positions in the church?\n \n Many of us conservative Christians do not advocate a totalitarian form of government. If anything we fear a totalitarian form of government imposed by the secular left. When children are indoctrinated in school with a morality that is contrary to both natural law and their parents convictions; is that not a step towards totalitarianism? The mother who chooses abortion imposes her morality on her unborn baby whose life is snuffed out without the right or ability to dissent. When a whole class of people such as babies in the womb, can be denied the basic right to life and killed for convenience, is that not a step towards totalitarianism? And who is next, the infirm, disabled, those with \"no quality of life?\"\n \n Henry Cox wrote about how secularism is most deceptive when it pretends to be neutral. He said; \"Secularism on the other hand, is the name of an ideology, a new closed world view, which functions very much like religion...It must be checked where it pretends not to be a world view, but nonetheless seeks to impose its ideology through the organs of the state.\"\n \n It is easy to repeat the mantra that conservative Christians want to \"impose their morality on others\" without realizing that the liberals have been doing so for years, by judges who opinions affect us all. At least conservative Christians do not pretend to be neutral.", 
   {
    "post_info": {
     "post_title": "Imposing Morality"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1116889620.0
  ], 
  [
   127453, 
   null, 
   "Diogenes99", 
   "Excellent article! Thanks for posting it.", 
   {}, 
   127446, 
   null, 
   1116890760.0
  ], 
  [
   127454, 
   null, 
   "sinjin", 
   "It is easy to repeat the mantra that conservative Christians want to \"impose their morality on others\" without realizing that the liberals have been doing so for years, by judges who opinions affect us all. At least conservative Christians do not pretend to be neutral.\n\n \n Sorry you see the freedom of others to choose how they want to live without your interference as an imposition. Tough.", 
   {}, 
   127446, 
   null, 
   1116890880.0
  ], 
  [
   127458, 
   null, 
   "Jo Bennett", 
   "I'm a Christian and I'm very suspicious of secularism as an ideology. Secularism in my experience tends to be anti-religious. Secularists talk about not teaching religion in schools, but if religion is not addressed in schools then you are, by default, teaching atheism. There will always be a morality imposed by society, and taught in schools, even if it is something as simple as hitting people in wrong. The question must therefore be, what morality do we teach. Given the diversity of opinion and trying to avoid imposing more than is necessary, I would suggest that \"avoid doing harm to others\" is the most limited morality that it is feasible to teach. As far as specific religious teaching goes, there is a risk with teaching a specific religion, even if the instruction is voluntary, that those who chose not to participate will be victimised. I'm not sure what the solution is. The US has an enforced secularism in its government, yet the US is a very fundamentalist Christian country. Here in the UK, we have a state church, our head of state is crowned in church, the church runs many state schools; yet we have nothing like the level of fundamentalism that exists in the US. Christianity here is also, I think, more left wing than in the US. It has been said of the labour party here that it \"owes as much to methodism as to marxism\", and that is true of a lot of socialism in Britain. At the forefront of social and trade justice movements you will find Christians and Christian leaders, in a way that you don't so much in the US, except maybe among black communities. In the US Christianity and the left have somehow managed to end up on different sides of the fence, which just makes no sense to me.", 
   {}, 
   127446, 
   null, 
   1116891180.0
  ], 
  [
   127479, 
   null, 
   "sinjin", 
   "Secularists talk about not teaching religion in schools, but if religion is not addressed in schools then you are, by default, teaching atheism. \n\n \n How so? There's a difference between studying religions from an anthropological standpoint and teaching the principles of a religion as truth. \n \n How would a class in atheism go? Good morning class, there's no god, class dismissed.", 
   {}, 
   127458, 
   null, 
   1116892920.0
  ], 
  [
   127487, 
   null, 
   "Wraith", 
   "Secularists talk about not teaching religion in schools, but if religion is not addressed in schools then you are, by default, teaching atheism.\n\n \n How can they be teaching aethism without it specifically being taught that 'there is no God'?\n \n What a bizzare statement... emoticon_frazzled", 
   {}, 
   127479, 
   null, 
   1116893520.0
  ], 
  [
   127492, 
   null, 
   "Nurglitch", 
   "Hmm, it might be something to point out a few distinctions - \n \n 1. There is a distinction between moral facts and moral intuitions. What you think is wrong may not be wrong, and so forth. In matters moral, as in all other things, perception is not the thing itself. 'Their morality' and 'our morality' just translates as 'their perception of morality' and 'our perception of morality'. \n \n 2. Morality is not the same as legality. They certainly cover the same ground, and morality should inform law, but the decisions of courts are not moral decisions. \n \n On the whole though I rather agree with the guy. People shouldn't be imposing their own perceptions of morality on one another unless those perceptions are accurate. The sentiment goes for both sides. But they need to agree on a common framework of law that respects all moral traditions.\n \n Also, does anyone else find it strange when Christians use the moral relativism argument?\n \n Likewise, how come people identify secularism with atheism these days? The whole point of secularism is an indifference to religion and the promotion of neutral ground on which people of different faiths can meet peacefully and on equal terms.", 
   {}, 
   127487, 
   null, 
   1116894420.0
  ], 
  [
   127493, 
   null, 
   "Jo Bennett", 
   "If God is never mentioned, then surely the implicit assumption must be that God does not exist. Studying form an anthropological standpoint, talking about religion as a mechanism for control and social cohesion also has a tendency to be atheist in outlook.", 
   {}, 
   127487, 
   null, 
   1116894540.0
  ], 
  [
   127495, 
   null, 
   "sinjin", 
   "If God is never mentioned, then surely the implicit assumption must be that God does not exist. Studying form an anthropological standpoint, talking about religion as a mechanism for control and social cohesion also has a tendency to be atheist in outlook.\n\n \n I disagree that anything is implicit but it's a good assumption IMO.", 
   {}, 
   127493, 
   null, 
   1116895440.0
  ], 
  [
   127502, 
   null, 
   "Duo_Maxwell", 
   "We have heard a lot about the religious right imposing their morality on others. But isn't it true that the left also tries to impose their agenda on the rest of us? Abortion, same sex marriage, the Teri Schiavo case, all are a matter of opinion, and no matter which side one is on, somebody is imposing their morality on someone else.\n\n \n How so? \n \n Pro Choice lets people decided what they want to do. If they want to keep the baby, fine, if not fine. no moral judgements on either. You are free to do what you wish. How is letting each individual use their own morals in making the decisions imposing morality upon them? \n Schiavo? I, for example didn't care either way, I just wanted them to follow the law which they did. If you will notice, it was the right who was imposing moralityu upon the system in a manner that was one, anti-conservative, two major attacks upon seperation of powers, and three supporting judicial activism. \n Same sex marriage? Marriage is a legal contract between three parities. Nothing more in the eyes of the state. Marriage is what you make of it, not what society tells you. The denial of gay marriage because of the attacks it would bring upon marriage is imposing morality upon others. You are telling them what they should believe and what marriage means instead of letting them decicide for themselves. \n \n \n\n If same sex marriage becomes law, it affects more people than just those being married. It would affect adoption laws and the entire school system. Children will be taught in school that a family can be any combination of adults, 2 men or 2 women.\n\n \n So? A family is that. A family can be alot of things. The total jerk next to you in the foxhole is your family. Your crew is your family. Seems we have no problems having complete male families when it comes to combat eh? \n \n \nIs that not a morality being imposed upon our children?\n\n \n Are they stating it is wrong? Are they stating it is right? No, there are merely stating what exists. Alot of things exist that are inherently bad. Your point is? \n \n \nHere in Illinois where I live, the human rights act has been amended to include sexual orientation, and it makes no exemption for churches. Churches that fail to comply will have their tax exempt status revoked, even though allowing homosexual priests, pastors or administration personnel would be the equivalent of allowing adulterers, fornicators or thieves.\n\n \n And this is wrong why? The less power the church has the dictate factless doctrine the better. Still though, that is a breach of the 1st ammendement. \n \n \nOne of the basic tenants of religion is the biblical definition of sin. The left is imposing its morality on the church by making them redefine sin according to their political correct ideology rather than by what the bible says. It seems political correctness has trumped freedom of religion.\n\n \n So? Churchs have done that to themselves since the end of the Roman Empire, what's the big deal about it being changed from the outside? 800 years of changing sin to reflect the Church's political ideology, what's another 10? \n \n \n How is it that we have interpreted this amendment to mean that a student who brings his bible to class is somehow an example of congress establishing a religion? And is congress not prohibiting the free exercise of religion when they tell churches that they have to hire homosexuals and to allow them to hold positions in the church?\n\n \n What was the kid thing about? Is congress telling them they cannot practice? No. Is Congress saying that their faith is outlawed? No. Is Congress saying that they must abide to the legal code of the country they reside in? Yes. The Church is not above the state and should not be. We all know where that leads. \n \n \n\n Many of us conservative Christians do not advocate a totalitarian form of government.\n\n \n Most of you aren't conservative and most of you do advocate some form of fascism. \n \n \nWhen children are indoctrinated in school with a morality that is contrary to both natural law and their parents convictions; is that not a step towards totalitarianism?\n\n \n Indoctrinated? If you think that schools have anything to do with teaching morality, you got another thing comming. It is often the morality taught by the school that is rejected and rebelled aganist by the students. Natural law? What natural law? \n \n \nThe mother who chooses abortion imposes her morality on her unborn baby whose life is snuffed out without the right or ability to dissent.\n\n \n Life is cheap, and if there is a soul it will come back anyways. Big deal.", 
   {}, 
   127446, 
   null, 
   1116896340.0
  ], 
  [
   127513, 
   null, 
   "Wraith", 
   "If God is never mentioned, then surely the implicit assumption must be that God does not exist. Studying form an anthropological standpoint, talking about religion as a mechanism for control and social cohesion also has a tendency to be atheist in outlook.\n\n \n First if God or God(s) are never mentioned then perahps that's because 'He' doesn't relate to the topic at hand.\n \n I had religious education lessons which taught about many different religions and hence God/Gods were mentioned but there is no other topic being taught which specifically related to God or God(s).\n \n Also putting aside whether religion (which ever) is based in fact it could be argued it is a form of control and social cohesion. The question is whether it is a 'divine' form of control and social cohesion or just one constructed by man. I'm sure this distinction is not touched upon in the lesson.", 
   {}, 
   127502, 
   null, 
   1116897360.0
  ], 
  [
   127541, 
   null, 
   "gnojek", 
   "We have heard a lot about the religious right imposing their morality on others. But isn't it true that the left also tries to impose their agenda on the rest of us? Abortion, same sex marriage, the Teri Schiavo case, all are a matter of opinion, and no matter which side one is on, somebody is imposing their morality on someone else. In all moral judgments and in every law, someone's morality prevails, whether that of the right or the left.\n\n \"The left\" is saying that all people should be free to determine their own morals. They must be trying to impose this moral on others. \"The right\" is saying that only their sense of morality is the right one, no one has the right to decide what's moral to them or not. They must be trying to impose all their morals on others. I'd say imposing one moral is better than imposing them all.\n \n \nIf same sex marriage becomes law, it affects more people than just those being married.\n\n Only in their heads.\n \n \nIt would affect adoption laws and the entire school system.\n\n Adoption laws, yes, but the whole school system?\n I don't see how it would affect the school system one bit.\n \n \nChildren will be taught in school that a family can be any combination of adults, 2 men or 2 women.\n\n From what I remember, nothing is ever taught to children regarding what is or is not a family. Not in any class I was in.\n \n The TV show \"My two Dads\" on the other hand...\n \n \nIs that not a morality being imposed upon our children? \n\n No.\n \n\n Here in Illinois where I live, the human rights act has been amended to include sexual orientation, and it makes no exemption for churches. Churches that fail to comply will have their tax exempt status revoked, even though allowing homosexual priests, pastors or administration personnel would be the equivalent of allowing adulterers, fornicators or thieves. One of the basic tenants of religion is the biblical definition of sin. The left is imposing its morality on the church by making them redefine sin according to their political correct ideology rather than by what the bible says. It seems political correctness has trumped freedom of religion.\n\n This has to be an exxageration, if not a misrepresentation.\n \n \nMuch to do[sic] is made about the 1st amendment phrase \"Congress shall make no law respecting an establishment of religion\" as a reason to eliminate expressions of religion from public life. But the second part of the sentence is conveniently forgotten, which bars congress from \"prohibiting the free exercise thereof.\" How is it that we have interpreted this amendment to mean that a student who brings his bible to class is somehow an example of congress establishing a religion? And is congress not prohibiting the free exercise of religion when they tell churches that they have to hire homosexuals and to allow them to hold positions in the church?\n\n Another exaggeration.\n \n \nMany of us conservative Christians do not advocate a totalitarian form of government.\n\n But many of you do.\n \n \nIf anything we fear a totalitarian form of government imposed by the secular left. \n\n Yeah, that makes sense.\n \n \nWhen children are indoctrinated in school with a morality that is contrary to both natural law and their parents convictions; is that not a step towards totalitarianism? \n\n Even if this happened, the fact that any parent can withdraw their kids from public schools indicates to me that there is anything but totalitarianism.\n \n \nThe mother who chooses abortion imposes her morality on her unborn baby whose life is snuffed out without the right or ability to dissent. \n\n I don't know about anyone here, but my mother certainly imposed her morality on me in every way. That's usually done in the child rearing process.\n \n But, are they saying that a child should develop his own morality?\n Do they mean that no morality should ever be imposed on a child?\n Great!\n The first step is outlawing underaged theistic indoctrination.\n Any church or individual found preaching to a child will be fined or jailed.\n I don't think this is what the \"freedom loving\" author had in mind.\n \n \nWhen a whole class of people such as babies in the womb, can be denied the basic right to life and killed for convenience, is that not a step towards totalitarianism?\n\n No. This question makes no sense.\n \n It's like saying that forcing women to have babies is a step toward totalitarianism.\n \n \nAnd who is next, the infirm, disabled, those with \"no quality of life?\"\n\n What does this have to do with imposing morality?\n Is this just a slippery slope argument?\n \n \nHenry Cox wrote about how secularism is most deceptive when it pretends to be neutral. He said; \"Secularism on the other hand, is the name of an ideology, a new closed world view, which functions very much like religion...It must be checked where it pretends not to be a world view, but nonetheless seeks to impose its ideology through the organs of the state.\"\n\n Let's break this down.\n The state is a mechanism whereby force is instituted upon a population within a certain boundary, usually geographic.\n Law is a mechanism whereby the state imposes its force upon the people.\n Most laws have to do with some sort of ideology (killing is bad), whether they are secular, religious, or both.\n So the last sentence could easily be reworded for religion.\n \n \"Religion seeks to impose its ideology through the organs of the state.\"\n \n And it's totally true.\n \n \n \nIt is easy to repeat the mantra that conservative Christians want to \"impose their morality on others\" without realizing that the liberals have been doing so for years, by judges who opinions affect us all. At least conservative Christians do not pretend to be neutral.\n\n If neutrality means that everyone gets to exercise their own morality within the framework of their own worldview, then \"liberals\" (like the founding fathers) are indeed neutral when it comes to the imposition of morals.\n \n And this is correct that \"conservative\" (actually authoritarian) Christians are not neutral. They are the ones moving against freedom, not for it.\n \n If they only realized that people must be free to sin if they are to be truly saved by grace. They must embrace Christ by free will, and sin no more by free will, not by the edicts of fellow mortals.", 
   {
    "unicode_changes_made": true
   }, 
   127446, 
   null, 
   1116899100.0
  ], 
  [
   127589, 
   null, 
   "Dzeron", 
   "Libertarians have similar stances to liberals on social issues, but their anti-state economic stance eliminates all \"imposing of secularism.\" Churches won't lose tax-exempt status for denying gay marriages because in a libertarian society, everything is tax-exempt. Libertarians don't support politically correct indoctrination in public schools, for they do not support public schools. Granted, libertarians advocate an imposition of ethics, but it is an ethics flexible to personal morality. (also note that there are many different libertarian ideologies, mostly varying on the issue of property rights.)\n \n It is inevitable that the leftist ideology will impose secularism on society because it advocates an economic system controlled by the State, and it advocates that the State should be secular. In such a system, secularism is backed by the State in an indirect manner - i.e. an economic one. The teaching of evolution in public school is the best example I can think of right now.\n \n Rightism, obviously, advocates direct imposition of Christian fundamentalist morality. It is no use to argue otherwise.", 
   {
    "post_info": {
     "post_title": "What about libertarians?"
    }
   }, 
   127541, 
   null, 
   1116903900.0
  ], 
  [
   127635, 
   null, 
   "Symbiote", 
   "From a classical liberal, or libertarian standpoint, imposing morals on another means forcing them to use, or prohibiting them from using, their property, or the property of another who has given their permission, in a way in which they desire.\n \n So, for example, forcing someone to carry on an unwanted pregnancy, give their money to sick orphans, fight for their nation, attend an educational institution, or have sex with a man, are impositions of morality under such a system (assuming some form of generic private property rights).\n \n Outside the framework of private property - the formless mangle of policy without principle of today's self-styled \"conservatives\" and \"progressives\", the originator of this thread is correct in that every policy debate becomes a clash for dominance between opposing whims - Some want evolution taught in schools, some want creationism, and no matter who gets what they want, someone is imposing their morality, because everyone is forced to pay for education.\n \n The situation has come so far from America's original guiding principles that an alternative to imposed morality is scarcely conceivable.\n \n This point is most telling:\n \nMany of us conservative Christians do not advocate a totalitarian form of government. If anything we fear a totalitarian form of government imposed by the secular left.\n\n \n Yes, and most of the left fear a totalitarian government of the right. The end result is that both parties, left and right, seek more government power for their own ends.", 
   {}, 
   127589, 
   null, 
   1116908940.0
  ], 
  [
   127640, 
   null, 
   "Diogenes99", 
   "The US has an enforced secularism in its government, yet the US is a very fundamentalist Christian country. Here in the UK, we have a state church, our head of state is crowned in church, the church runs many state schools; yet we have nothing like the level of fundamentalism that exists in the US.\nPerhaps there is a connection there. Schools (at least for very young students) have to teach and support some level of social morality: don't socialize while the teacher is talking, don't sass the teacher, don't run into the traffic, look both ways before you cross the street, ad inf. With a strictly secular government, and under pressure of nonsensical lawsuits about the Ten Commandments (the icon of rule of law), the citizens here probably feel more of a need for a broader sense of morality to prepare their children to become useful adults.", 
   {}, 
   127589, 
   null, 
   1116909180.0
  ], 
  [
   127659, 
   null, 
   "Uncle Sam I am", 
   "Those are all good points. I am in no way advocating breaking down the barrier of church and state. I do not believe religion should have any part in government, or be flaunted in the face of anyone who wants nothing to do with it. I am merely highlighting a very good point that the article brings out, which is no matter what laws become enacted because of judicial decree, there is always going to be one ideology, be it left or right, that will be imposed on those who differ with it.\n \n Abortion in England is legal, but it is not so much of a devisive issue there as it is here in the U.S. Why? Because it was made law by the legislature, and can be reversed any time if the majority of the public decide to do so.\n \n Here in America, abortion (for example) was a morality that was imposed upon us by liberal judges who decided these things for us in spite of the fact that the majority of the public were against it. Unlike the abortion law in England, ours cannot be changed no matter what the public thinks. Isn't that a morality imposed by the left? Just because the one imposing it is a judge does not make it right. After all, the supreme court once ruled in favor of slavery.\n \n This is why the fight for judicial nominations is so important to both sides, because each wants its own ideology to pushed to forefront and be made law. So, it is a little disingenuous to accuse anyone of forcing morality, because morality of one sort or another will be imposed no matter what.", 
   {}, 
   127640, 
   null, 
   1116910560.0
  ], 
  [
   127666, 
   null, 
   "zachvac", 
   "\n We have heard a lot about the religious right imposing their morality on others. But isn't it true that the left also tries to impose their agenda on the rest of us? Abortion, same sex marriage, the Teri Schiavo case, all are a matter of opinion, and no matter which side one is on, somebody is imposing their morality on someone else. In all moral judgments and in every law, someone's morality prevails, whether that of the right or the left.\n \n\n This is mostly true. It is possible to give people a choice of morality. I think that allowing same-sex marriage would be allowing people to choose between their versions of morality.\n \n \n\n If same sex marriage becomes law, it affects more people than just those being married. It would affect adoption laws and the entire school system. Children will be taught in school that a family can be any combination of adults, 2 men or 2 women. Is that not a morality being imposed upon our children? Here in Illinois where I live, the human rights act has been amended to include sexual orientation, and it makes no exemption for churches. Churches that fail to comply will have their tax exempt status revoked, even though allowing homosexual priests, pastors or administration personnel would be the equivalent of allowing adulterers, fornicators or thieves. One of the basic tenants of religion is the biblical definition of sin. The left is imposing its morality on the church by making them redefine sin according to their political correct ideology rather than by what the bible says. It seems political correctness has trumped freedom of religion.\n \n\n Last I knew people weren't taught what \"families\" are in school. I don't agree with taking away tax exempt status from a church if they fail to allow these people in churches. Actually I don't understand why churches get tax-exempt status in the first place. They are a private organization and unless they are non-profit, they should have to pay taxes. But also since they are a private organization they should be able to exclude whoever they want.\n \n \n\n Much to do is made about the 1st amendment phrase \"Congress shall make no law respecting an establishment of religion\" as a reason to eliminate expressions of religion from public life. But the second part of the sentence is conveniently forgotten, which bars congress from \"prohibiting the free exercise thereof.\" How is it that we have interpreted this amendment to mean that a student who brings his bible to class is somehow an example of congress establishing a religion? And is congress not prohibiting the free exercise of religion when they tell churches that they have to hire homosexuals and to allow them to hold positions in the church?\n \n\n I don't buy the argument that anyone says that bringing a bible to class is not allowed. As far as I know people are allowed to bring the Bible, or any other book to class. If a school doesn't allow this then I agree with you they are wrong, however I doubt a school has actually done this. I also agree with you about the church hiring people.\n \n \n \n\n Many of us conservative Christians do not advocate a totalitarian form of government. If anything we fear a totalitarian form of government imposed by the secular left. When children are indoctrinated in school with a morality that is contrary to both natural law and their parents convictions; is that not a step towards totalitarianism? The mother who chooses abortion imposes her morality on her unborn baby whose life is snuffed out without the right or ability to dissent. When a whole class of people such as babies in the womb, can be denied the basic right to life and killed for convenience, is that not a step towards totalitarianism? And who is next, the infirm, disabled, those with \"no quality of life?\"\n \n\n abortion actually imposes no morality, just an action. The point is though that I could make the same argument for ants and flies. The infirm, disabled, etc. are all alive humans, so they should havee no fear. But the mother imposing her will on her fetus (yes fetus, not baby) is not the government imposing their will, which is totalitarianism. When the government starts forcing parents to abort, then we can start worrying.\n \n \n\n It is easy to repeat the mantra that conservative Christians want to \"impose their morality on others\" without realizing that the liberals have been doing so for years, by judges who opinions affect us all. At least conservative Christians do not pretend to be neutral.\n\n \n Judges, as much as people disagree with this, interpret the law, they don't impose morality or create laws. Those that accuse the Schivo judges of not siding with Schivo are the ones who want activist judges. The law clearly sided with the husband and the judges (many of whom were conservative) actually made the right decision. This is their job and I can't speak for all liberals, but many conservatives also want judges to impose their version of morality.\n \n \n I will fight anyone who wishes to impose their morality on anyone else. If a school wants to stop a kid from bringing his bible, I will fight that. If a government wants to force people to pray, I will fight that. And if a government starts aborting fetuses I will fight that. They should allow people to choose their morality as long as it doesn't impede on the rights of others (if my morality is I have to kill you, I'm not allowed to) I should be able to choose what my morals are.", 
   {
    "post_info": {
     "post_title": "Interesting Article"
    }, 
    "unicode_changes_made": true
   }, 
   127446, 
   null, 
   1116911700.0
  ], 
  [
   127678, 
   null, 
   "Symbiote", 
   "So, it is a little disingenuous to accuse anyone of forcing morality, because morality of one sort or another will be imposed no matter what.\n\n \n Morality of some sort will only be imposed if someone imposes it - and it's only disingenuous to complain about the imposition of morality if you are an advocate of it yourself.\n \n So I trust, since you believe in forcing morality on people, that when you are forced to take it up the arse, worship Satan, and perform abortions, you will no have no ground to stand on - you having already accepted that forcing your morality on people is both neccessary and legitimate.\n \n \nJust because the one imposing it is a judge does not make it right.\n\n \n And just because it is imposed by the majority does not make it right.", 
   {}, 
   127666, 
   null, 
   1116913920.0
  ], 
  [
   128094, 
   null, 
   "Uncle Sam I am", 
   "Actually I don't understand why churches get tax-exempt status in the first place. They are a private organization and unless they are non-profit, they should have to pay taxes. But also since they are a private organization they should be able to exclude whoever they want.\n\n Churches are not \"organizations\" in the business sense of the word, but they are definately \"non-profit,\" at least they are supposed to be. Churches provide a place for people to experience God as they understand Him. They are not taxed because they do not exist in order to make money. Also they are self supported finacially by their members, and much of the money the members donate goes toward charities and disaster relief. Of course there will always be a Jim and Tammy Faye Baker, but wherever there is money, there will be a crook.\n \n \nabortion actually imposes no morality, just an action. The point is though that I could make the same argument for ants and flies. The infirm, disabled, etc. are all alive humans, so they should havee no fear. But the mother imposing her will on her fetus (yes fetus, not baby) is not the government imposing their will, which is totalitarianism. When the government starts forcing parents to abort, then we can start worrying.\n\n So, the taking of a human life is OK as long as the government does not order it? If life starts at conception, and it would be pretty difficult to prove that it doesn't, then abortion IS the taking of a human life. But actually, I would not accuse someone of murder if they honestly did not understand what they were doing. But when we take it upon ourselves to decide who is worthy to live or die, we make ourselves into a god, whether we believe in a supreme being or not. \n \n I was the child of a teenage mother, put up for adoption, and raised in a good home. If I had been born before 1971, I might not be alive today. If I had been aborted, I would not be around to complain about someone imposing their morality on me, would I? As long as there is no one around to complain, many people sweep it under the rug and say it never happened. But even Planned Parenthood has agreed that life begins at conception. http://dianedew.com/conceptn.htm\n Planned Parenthood, SIECUS admit:\n Life begins at conception  \n '... at least one [sperm] will reach the egg, fertilize it,\n and conception will take place. A new life will begin.'\n -- Conception, Birth and Contraception\n Approved by Planned Parenthood and SIECUS in 1969 \n as \"a fine book\" with a \"solid base for understanding ... reproduction\" \n \n \nJudges, as much as people disagree with this, interpret the law, they don't impose morality or create laws. Those that accuse the Schivo judges of not siding with Schivo are the ones who want activist judges. The law clearly sided with the husband and the judges (many of whom were conservative) actually made the right decision. This is their job and I can't speak for all liberals, but many conservatives also want judges to impose their version of morality.\n\n If judges merely interpret laws, then why is there such a battle to get judges that agree with party politics? The democrats use abortion as their litmus test for judges. If that were not true they would not be threatening to filibuster so many Bush nominees.\n \n \nThey should allow people to choose their morality as long as it doesn't impede on the rights of others (if my morality is I have to kill you, I'm not allowed to) I should be able to choose what my morals are.\n\n So, who becomes the arbiter of deciding what moralities are acceptable. The whole point of the article is that no one lives in a vacuum. Everything we do affects someone. Every judicial decree is a forced morality. If it weren't, it never would have been brought before the judiciary to be settled.\n \n Was the Supreme Court correctly interpreting the Constitution when they ruled in favor of slavery?", 
   {}, 
   127666, 
   null, 
   1116977880.0
  ], 
  [
   128193, 
   null, 
   "Diogenes99", 
   "Judges, as much as people disagree with this, interpret the law, they don't impose morality or create laws. Those that accuse the Schivo judges of not siding with Schivo are the ones who want activist judges. The law clearly sided with the husband and the judges (many of whom were conservative) actually made the right decision.\nDisagreed.\n \n (1) Michael Schiavo should not have been the guardian. While it is a reasonable default to declare the spouse as the guardian, it has to remain open to challenge (Hacking and Peterson come to mind). Once Michael moved on with his life, moved in with his girlfriend, and started a family with her, there is not a court in the land that would deny Terri a divorce. Judge George Greer made sure there was no one to speak for her.\n \n (2) Terri's wishes were not that cut and dried. Years after she became disabled (but not very long after the malpractice settlement came through) Michael produced his brother and the brother's wife to declare that Terri had said she wouldn't want to live like that. The family produced sworn affadavits from friends of Terri's that for several years they had heard Michael say he had no idea what Terri would have wanted. On evidence too flimsy to support a $10 fine for jaywalking, George Greer sentenced Terri to die.\n \n Of all the subsequent court reviews of the case, not a single one went back to the facts or in any way challenged Greer's findings. None of them would ever uphold a prison sentence on that quality of evidence, but they all allowed Terri's execution to proceed.\n \n (3) Terri's execution was extremely brutal, definitely cruel and unusual. And it was an execution, since she was in no way terminal. Her mother wasn't even allowed to offer water for her lips, or a sliver of ice to ease her swollen tongue. Do you suppose the judge was afraid she would choke to death? Or maybe he was more afraid that she wouldn't?\n \n \nWas the Supreme Court correctly interpreting the Constitution when they ruled in favor of slavery?\nYes. And the people responded by changing the Constitution, which is as it should be. Judges should apply the law as written to the individual cases. If that results in injustice (as perceived by the people) then it's up to the people to change the law. It is not the prerogative of judges to define social policy.", 
   {}, 
   128094, 
   null, 
   1116994740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Imposing Morality", 
  "url": "http://www.4forums.com/political/current-events-debates/5380-imposing-morality.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 5380, 
  "discussion_files": [
   [
    "18056.html", 
    "http://www.4forums.com/political/current-events-debates/5380-imposing-morality-print.html"
   ], 
   [
    "18057.html", 
    "http://www.4forums.com/political/current-events-debates/5380-imposing-morality-2-print.html"
   ]
  ], 
  "identifier": 5380
 }
]