[
 [
  [
   127555, 
   null, 
   "Voice Of Reason", 
   "Well it happened again.......I am sure glad I am not a card carrying Republican....\n \n http://www.cnn.com/2005/POLITICS/05/23/filibuster.fight/index.html\n \n \n enators compromise on filibusters\n \n Monday, May 23, 2005 Posted: 7:54 PM EDT (2354 GMT)\n \n story.mccain.sen.tv.jpg\n Sen. John McCain announces an agreement has been reached on judicial nominees Monday.\n \n \n \n \n WASHINGTON (CNN) -- A bipartisan group of senators reached an agreement after days of talks to avert a showdown Tuesday over President Bush's judicial nominees, Sen. John McCain announced Monday evening.\n \n Standing with a group of 14 senators, the Arizona Republican said the seven Republicans and seven Democrats had brokered a deal to \"avert a crisis\" over the nominees.\n \n Democrats filibustered 10 of Bush's 218 nominees in his first term, saying they were too radical for a lifetime appointment to the bench.\n \n Forty-four Democrats and one independent in the current Senate have stuck to that position.\n \n Bush has renominated seven of those judges -- including Texas Supreme Court Justice Priscilla Owen. Senate debate began last week on Owen's nomination to the 5th U.S. Circuit Court of Appeals.\n \n Unable to garner the 60 votes necessary to end a filibuster -- a form of extended debate that has been part of Senate rules since the early 19th century -- Senate Majority Leader Bill Frist, a Tennessee Republican, has put into motion what some call the \"nuclear option.\"\n \n Sen. John Cornyn, a Texas Republican, moved Friday for cloture to end debate on Owen's nomination. The vote is set for Tuesday. (Full story)\n \n If the cloture vote were to fail, Frist would use some parliamentary maneuvering, with help from Vice President Dick Cheney as the body's presiding officer, to get a vote on a procedural motion that effectively would limit debate on a judicial nominee, according to a scenario described by Senate sources cited in The Washington Post.\n \n Such a procedural motion would not be subject to debate and presumably would pass with a simple majority of 51 votes, instead of the three-fifths supermajority required for cloture on a filibuster.\n \n Once that happens, the Senate would set a time to vote on Owen's nomination, which would require only a simple majority for confirmation.\n \n The \"nuclear\" aspect of the scenario is that it effectively would circumvent a Senate rule that requires a two-thirds vote of 67 to change a rule.\n \n If the Republican majority eliminated the filibuster, Democrats threatened to use Senate rules to push their agenda and disrupt the GOP's -- effectively slowing the chamber's business to a crawl.\n \n Earlier Monday, Bush called for the full Senate to vote on his judicial picks, saying his nominees deserve \"a fair hearing.\"\n \n \"I expect them to get an up-or-down vote. That's what I expect,\" Bush said at a news conference with Afghan President Hamid Karzai. \"And I think the American people expect that as well.\"\n \n Bush said his philosophy in selecting nominees has been been consistent.\n \n \"My job is to pick people who will interpret the Constitution, not use the bench from which to write law,\" Bush said.\n \n The nominees under consideration have been tapped for federal appellate courts. But Supreme Court nominations -- including the chief justice post -- are likely at stake down the road.", 
   {
    "post_info": {
     "post_title": "Republicans wimp out and cave on Nuclear Option."
    }
   }, 
   null, 
   null, 
   1116900660.0
  ], 
  [
   127558, 
   null, 
   "Duo_Maxwell", 
   "ah, yes, preserving minority rights. How far up on your list of things to do is \"striping minorities of any and all right?\" \n \n \n\"My job is to pick people who will interpret the Constitution, not use the bench from which to write law,\" Bush said.\n\n \n That's odd considering how Owen has legislated from the bench on a number of instances. \n \n \nEarlier Monday, Bush called for the full Senate to vote on his judicial picks, saying his nominees deserve \"a fair hearing.\"\n\n \n If he believed that, he would be informing the public about his nomination's history. Huh. I'd love to hear Bush's spin on how Pryor supported a 1st ammendemnt violation becuase his religion told him to.", 
   {}, 
   127555, 
   null, 
   1116900960.0
  ], 
  [
   127691, 
   null, 
   "Voice Of Reason", 
   "Maybe I was a little hasty in condeming the Republicans on this compromise.....It seems the Republicans might have been dumb like a fox.......By this compromise they get their 3 most Conservative nominees for the circuit court vacancies for and up or down vote on the floor.........They will be confirmed easily and with 1 or 2 vacancies possibly in the U.S. Supreme Court this summer they could fall right in for a judgeship there....If the dems try and filibuster them then the leader can call for the nuclear option again.......\n \n This could be and excellent chance to finally throw out Roe V Wade..........", 
   {}, 
   127558, 
   null, 
   1116916320.0
  ], 
  [
   127708, 
   null, 
   "Duo_Maxwell", 
   "Along with every other right you don't like. \n \n How can you call yourself a conservative and support government sponsored morality and intervension into the personal lives of it's citizens?\n \n That's not going to stop abortion as you have been told already. It's only going to lead to more infanticide, more trips down to Mexico, more backalley hanger abortions and more deaths among pregnant women. \n \n You really don't care about women at all. \n Carlin is right, you're a woman hater.", 
   {}, 
   127691, 
   null, 
   1116917400.0
  ], 
  [
   127738, 
   null, 
   "gamehuis", 
   "[You really don't care about women at all. \n Carlin is right, you're a woman hater.\n\n He probably was rejected by a woman and now wants to take it out on the whole group.\n \n What was that VoR? It's sad, so sad?", 
   {}, 
   127708, 
   null, 
   1116926280.0
  ], 
  [
   127739, 
   null, 
   "Duo_Maxwell", 
   "lol.\n \n what I find contridictiiory is that VOR wants a vote on these judges yet he rails aganist such behavior. He's agnaist activist judges yet he;s for Owen who has legislated from the judicial bench several times. he;s aganist judges applying their own opinions on law, yet he;s for Pryor who supported a violation of the 1st ammendement because his religion told him to. Pryor's opinion overruled the consitution in his statements and his ruling. That's a clear sign of a BAD judge. \n \n But there's a likely explanation for that: VOR is extremely ignorant. however, here I can't fault him. The media has done a **** poor job (at best) at informing the public about these judicial nominees.", 
   {}, 
   127738, 
   null, 
   1116926580.0
  ], 
  [
   127774, 
   null, 
   "Redratio1", 
   "This is a victory for the moderate majority in this country that doesn't want a theocracy nor a socialist state. We are sick of GOP BS, and Dems empty promises. I hope john McCain gets fed up enough to create a truely viable third party in this country. One that actually reflects the free spirit of our countrymen.", 
   {}, 
   127739, 
   null, 
   1116939300.0
  ], 
  [
   127815, 
   null, 
   "jyoshu", 
   "Guess I'll stand alone in giving kudos to all involved in reaching a compromise. C'mon guys--this is a good thing.\n \n Of course the real test of whether or not the Democrats are serious about doing their duty to give nominees an up or down vote will be when Rhenquist retires and Bush nominates somebody for his position.", 
   {}, 
   127774, 
   null, 
   1116950760.0
  ], 
  [
   127867, 
   null, 
   "Truthsayer", 
   "This is a victory for the moderate majority in this country that doesn't want a theocracy nor a socialist state. We are sick of GOP BS, and Dems empty promises. I hope john McCain gets fed up enough to create a truely viable third party in this country. One that actually reflects the free spirit of our countrymen.\n\n \n Right on!!\n \n McCain rules! The power, as I have said all along, rests in the middle. The moderates. The dems are just as sick of their whiny, Pablum puking, bleeding heart, ultra-leftwing liberals as we are of our religious fanatic, ultra-rightwing neo-facists!\n \n I told you all there was more of us than there were of them. They only scream and insult louder. That's all. And we are all sick of them. We humored them just long enough to get Bush elected and now we have to think of the future. Those guys are making us look bad in the public eye and we are going to finally put a stop to them.\n \n Progress on the front! The country is rolling down the track yet again. Hats off to the republicans AND the democrats for finally waking up and putting America first and their partisanship second.\n \n I feel better days coming down the road. (Not that these days are all that bad....) Just my opinion, mind you.", 
   {}, 
   127774, 
   null, 
   1116955680.0
  ], 
  [
   127941, 
   null, 
   "Voice Of Reason", 
   "This is a victory for the moderate majority in this country that doesn't want a theocracy nor a socialist state. We are sick of GOP BS, and Dems empty promises. I hope john McCain gets fed up enough to create a truely viable third party in this country. One that actually reflects the free spirit of our countrymen.\n\n \n Ain't gonna happen Red................McCain has said over and over again he is a Republican and will remain one...Your best bet is Ralph Nader if he is not completely senile by 2008...........", 
   {}, 
   127774, 
   null, 
   1116960300.0
  ], 
  [
   127944, 
   null, 
   "Voice Of Reason", 
   "Guess I'll stand alone in giving kudos to all involved in reaching a compromise. C'mon guys--this is a good thing.\n \n Of course the real test of whether or not the Democrats are serious about doing their duty to give nominees an up or down vote will be when Rhenquist retires and Bush nominates somebody for his position.\n\n \n \n The part of the agreement I have a problem with is the circumstances in which dems will filibuster.................What defines extreme circumstances? What happens with vancancies for Supreme Court Justices? .Lots of questions here, not to many answers..........", 
   {}, 
   127815, 
   null, 
   1116960420.0
  ], 
  [
   127945, 
   null, 
   "Voice Of Reason", 
   "Bottom line the silent majority is neither hard right or left....They are moderate conservatives............Nothing proved that more then the 2004 presidential and congressional elections........", 
   {}, 
   127944, 
   null, 
   1116960600.0
  ], 
  [
   127994, 
   null, 
   "gnojek", 
   "This is a victory for the moderate majority in this country that doesn't want a theocracy nor a socialist state. We are sick of GOP BS, and Dems empty promises. I hope john McCain gets fed up enough to create a truely viable third party in this country. One that actually reflects the free spirit of our countrymen.\n\n No way, he's a Republican shill.\n He just fakes like he gives a ****.", 
   {}, 
   127774, 
   null, 
   1116964740.0
  ], 
  [
   127997, 
   null, 
   "jyoshu", 
   "The part of the agreement I have a problem with is the circumstances in which dems will filibuster.................What defines extreme circumstances? What happens with vancancies for Supreme Court Justices? .Lots of questions here, not to many answers..........\n\n \n I have a feeling this whole issue is going to come right back up when Bush appoints a SCOTUS judge. The dems want a liberal on there too badly to not start filabustering again.\n \n I do think there will come a point, if they continue doing it, that they'll just lose more seats over it. The American people are getting more and more fed up with the Democrats in congress every election cycle.", 
   {}, 
   127944, 
   null, 
   1116964980.0
  ], 
  [
   128059, 
   null, 
   "Duo_Maxwell", 
   "Guess I'll stand alone in giving kudos to all involved in reaching a compromise. C'mon guys--this is a good thing.\n \n Of course the real test of whether or not the Democrats are serious about doing their duty to give nominees an up or down vote will be when Rhenquist retires and Bush nominates somebody for his position.\n\n \n That's a load of ******** and you fell for Frists's lies. There is no such producedure or stating in the consitution. \n \n The Democrat's duty is to prevent a anti-consitution judge from getting a life appointment. Considering how Owen has disregarded the constution and legislated from the bench and Pryor has publically defended blantant violations because his religion said so, the democrats are fully justified.\n \n If the public was informed as to the backgrounds of these judges, particularly how Pryor believed it was okay to violate the consitution because his religion said so, would you think that the public would disagree with the democrats?\n \n I take it none of you have any ideas as to the background of these judges? \n \n Once again, VOR IS WRONG. The number of conservatives in US is steadily declining. It's likely less then 10% of the populace at best.", 
   {}, 
   127815, 
   null, 
   1116974400.0
  ], 
  [
   128061, 
   null, 
   "kickin50", 
   "Congrats to the only 14 senators who seem to have a spine. What they did was to answer to their own conscience today. They'll answer to their constituency soon. That's as it should be. Both parties be damned.", 
   {}, 
   127997, 
   null, 
   1116974640.0
  ], 
  [
   128165, 
   null, 
   "Voice Of Reason", 
   "No way, he's a Republican shill.\n He just fakes like he gives a ****.\n\n \n You have to be kidding me.......... emoticon_rolleyes", 
   {}, 
   127994, 
   null, 
   1116990360.0
  ], 
  [
   128167, 
   null, 
   "Voice Of Reason", 
   "I have a feeling this whole issue is going to come right back up when Bush appoints a SCOTUS judge. The dems want a liberal on there too badly to not start filabustering again.\n \n I do think there will come a point, if they continue doing it, that they'll just lose more seats over it. The American people are getting more and more fed up with the Democrats in congress every election cycle.\n\n \n The irony of the situation is the Democratic Party has no clue........They keep moving further and further left...........A true moderate in the party has no voice and if he or she happens to be pro life forget about it.........", 
   {}, 
   127997, 
   null, 
   1116990600.0
  ], 
  [
   128170, 
   null, 
   "Big_Bear_Scot", 
   "The irony of the situation is the Democratic Party has no clue........They keep moving further and further left...........A true moderate in the party has no voice and if he or she happens to be pro life forget about it.........\n\n \n Is it not the same way the with pro-choice Reps ?\n \n Also you need to ask yourself a question. If the Reps have been in charge of Executive & Legislative branches(for the last 5 years) why have they not done anything to limit abortion ?", 
   {}, 
   128167, 
   null, 
   1116991380.0
  ], 
  [
   128172, 
   null, 
   "jyoshu", 
   "Is it not the same way the with pro-choice Reps?\n\n \n Actually, no it's not. There are very high profile Republican leaders who are pro-choice--Schwarzenegger, Pataki, Colin Powell, and Giuliani are such examples. A number of them were given speaking spots at the Republican National Convention. Can you imagine a pro-lifer getting a speaking spot at the Democratic National Convention? Mark Shields, a well-known pro-life Democrat journalist has noted and criticized this example of intolerance in the Democratic Party more than once in his editorials.\n \n http://www.cnn.com/2005/ALLPOLITICS/03/22/big.tent/", 
   {}, 
   128170, 
   null, 
   1116991920.0
  ], 
  [
   128173, 
   null, 
   "Voice Of Reason", 
   "Is it not the same way the with pro-choice Reps ?\n \n Also you need to ask yourself a question. If the Reps have been in charge of Executive & Legislative branches(for the last 5 years) why have they not done anything to limit abortion ?\n\n \n No its not the same.........You ever hear of Gov Arnold, or Rudy Guiliani.....Both very much pro choice and leaders of the Republican party........\n \n How about telling me who the pro life leaders are of the Democratic party?\n \n You ever hear of the filbuster?\n \n I can tell you they are working on it my friend and are taking a huge step in that direction when the 3 pro life nominees for the appeals court are improved in the next week.........\n \n Hold on to your hat.........it will be fun........", 
   {}, 
   128170, 
   null, 
   1116992400.0
  ], 
  [
   128174, 
   null, 
   "Big_Bear_Scot", 
   "Did Kerry not come and say that he thought abortion was wrong ? but he would not legislate against choice ?\n \n I honestly couldn't imagine a pro-choice Rep actually running with pro-choice as one of foundation of his campaign.", 
   {}, 
   128172, 
   null, 
   1116992520.0
  ], 
  [
   128387, 
   null, 
   "kickin50", 
   "You're right. Democrats don't have a pro-life leader. Don't want or need one. That's because politics is politics and religion is religion. The Dems aren't trying to fuse the two.\n \n The Reps, on the other hand, have both pro-life and pro-choice because they're trying to fuse everybody.", 
   {}, 
   128174, 
   null, 
   1117045020.0
  ], 
  [
   128396, 
   null, 
   "JPSartre12", 
   "[QUOTE=Voice Of Reason]Well it happened again.......I am sure glad I am not a card carrying Republican....\n \n http://www.cnn.com/2005/POLITICS/05/23/filibuster.fight/index.html\n \n \n enators compromise on filibusters\n \n Monday, May 23, 2005 Posted: 7:54 PM EDT (2354 GMT)\n \n story.mccain.sen.tv.jpg\n Sen. John McCain announces an agreement has been reached on judicial nominees Monday. \n \n I'm beginning to believe that McCain's favorite sex position is on his back because he can only screw up. :xcensored \n \n This is another McCain abortion, just like his Campaign Reform Bill that let the floodgates loose on big money contributors but violated the little guy's 1st Amendment rights. If you graded McCain-Feingold on how much big money was kept out of the campaign because of their Campaign Reform Bill, you'd have to give them an \"F\" for complete FAILURE. \n This compromise is just another example of McCain snatching defeat from the jaws of victory. The more I hear about him, the more I'm convinced that he's really a closet liberal. emoticon_mad", 
   {}, 
   127555, 
   null, 
   1117045620.0
  ], 
  [
   128398, 
   null, 
   "JPSartre12", 
   "You're right. Democrats don't have a pro-life leader. Don't want or need one. That's because politics is politics and religion is religion. The Dems aren't trying to fuse the two.\n\n \n The Democrats are trying hard not to link religion with politics because their policies and agenda is anti-religious and amoral.\n \n \n\n The Reps, on the other hand, have both pro-life and pro-choice because they're trying to fuse everybody.\n\n \n The Republicans have both because they have a wide spectrum of followers. The Democratic flock of stray sheep mentality isn't the only one that exists. :)", 
   {}, 
   128387, 
   null, 
   1117045920.0
  ], 
  [
   128488, 
   null, 
   "kickin50", 
   "The Republicans have both because they have a wide spectrum of followers. The Democratic flock of stray sheep mentality isn't the only one that exists. :)\nBaaaa. Baaaa.", 
   {}, 
   128398, 
   null, 
   1117059960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Republicans wimp out and cave on Nuclear Option.", 
  "url": "http://www.4forums.com/political/politics-debates/5382-republicans-wimp-out-cave-nuclear-option.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 5382, 
  "discussion_files": [
   [
    "17553.html", 
    "http://www.4forums.com/political/politics-debates/5382-republicans-wimp-out-cave-nuclear-option-print.html"
   ], 
   [
    "17554.html", 
    "http://www.4forums.com/political/politics-debates/5382-republicans-wimp-out-cave-nuclear-option-2-print.html"
   ]
  ], 
  "identifier": 5382
 }
]