[
 [
  [
   127645, 
   null, 
   "zachvac", 
   "Whenever there is a debate on the death penalty it always seems that people think we should have the death penalty because it is worse than life in prison. The people against it then talk of how it costs more and they argue and argue. How about this?\n \n \n We have a special prison just for people who would have gotten the death penalty. When you're there you do hard, manual labor, go into a hot dry cell, get globs of food and sleep on your little cot in your cell and do it all over again the next day. This way you could earn your keep if the labor saved money plus we would save money from the death penalty. If they didn't work hard we could whip them or do whatever, involuntary servitude is still allowed as a punishment for crime whereof the party shall have been duly convicted under the 13th ammendment. These are only the worse criminals, murderers, rapists, etc. and the purpose of this is to not only save money on the death penalty, but to make these peoples' lives a living hell where they can only wish they were dead.", 
   {
    "post_info": {
     "post_title": "the current state of jail"
    }
   }, 
   null, 
   null, 
   1116909660.0
  ], 
  [
   128141, 
   null, 
   "georged", 
   "Whenever there is a debate on the death penalty it always seems that people think we should have the death penalty because it is worse than life in prison. The people against it then talk of how it costs more and they argue and argue. How about this?\n \n \n We have a special prison just for people who would have gotten the death penalty. When you're there you do hard, manual labor, go into a hot dry cell, get globs of food and sleep on your little cot in your cell and do it all over again the next day. This way you could earn your keep if the labor saved money plus we would save money from the death penalty. If they didn't work hard we could whip them or do whatever, involuntary servitude is still allowed as a punishment for crime whereof the party shall have been duly convicted under the 13th ammendment. These are only the worse criminals, murderers, rapists, etc. and the purpose of this is to not only save money on the death penalty, but to make these peoples' lives a living hell where they can only wish they were dead.\n\n \n That would go a long way in determent for all classes of crime. Mandatory school field trip at age 10. And it would have to reduce our deplorable recidivism record.", 
   {}, 
   127645, 
   null, 
   1116983220.0
  ], 
  [
   128180, 
   null, 
   "daewoo", 
   "That would go a long way in determent for all classes of crime. Mandatory school field trip at age 10. And it would have to reduce our deplorable recidivism record.\n\n \n I disagree. I think that violent crime would go through the roof as the result of such a thing. The DOJ studied this for several years and found that once penalties surpass a certain level, crime stops dropping as a result, criminals just be come more willing to hurt people to get away with it.\n \n I think we have enough criminals on the street now with no reservations when it comes to hurting or killin people. I don't think we need to encourage the trait by making the punishment for crimes so terrible that we create more folks willing to kill witnesses rather than face consequences.", 
   {}, 
   128141, 
   null, 
   1116993240.0
  ], 
  [
   128304, 
   null, 
   "zachvac", 
   "I disagree. I think that violent crime would go through the roof as the result of such a thing. The DOJ studied this for several years and found that once penalties surpass a certain level, crime stops dropping as a result, criminals just be come more willing to hurt people to get away with it.\n \n I think we have enough criminals on the street now with no reservations when it comes to hurting or killin people. I don't think we need to encourage the trait by making the punishment for crimes so terrible that we create more folks willing to kill witnesses rather than face consequences.\n\n \n \n First of all I can't see how a tougher punishment could raise the crime level. Stay the same maybe, but not raise it. As I said this should only be for the worst kind of criminals that would regualrly receive the death penalty. We're choosing not to kill them, but they should have to work and suffer, not sit around and watch TV, see the other threat in this topic \"My kind of sherrif\"", 
   {}, 
   128180, 
   null, 
   1117030560.0
  ], 
  [
   128849, 
   null, 
   "Voice Of Reason", 
   "First of all I can't see how a tougher punishment could raise the crime level. Stay the same maybe, but not raise it. As I said this should only be for the worst kind of criminals that would regualrly receive the death penalty. We're choosing not to kill them, but they should have to work and suffer, not sit around and watch TV, see the other threat in this topic \"My kind of sherrif\"\n\n \n I think 90 percent of all inmates on death row would accept your scenario rather then be executed no matter how hard their life would be............\n \n As I have said many times.............Where there is life their is hope.....Where there is death there is no hope.................", 
   {}, 
   128304, 
   null, 
   1117135020.0
  ], 
  [
   128898, 
   null, 
   "Dono", 
   "As I have said many times.............Where there is life their is hope.....Where there is death there is no hope.................\n \n\n There is no argument (as you yourself have stated) that innocents have been convicted of capital crimes, later to be exonerated, and innocents have been executed. You waffled when I asked what you considered an acceptable ratio of innocents to guilty was. You are correct when you state, \"\n Where there is death there is no hope\", and that in itself is reason to stop the executions and join the rest of the world. Quote: ...... more than three countries a year on average have abolished the death penalty in law since 1976 or have gone from abolishing it for ordinary crimes to abolishing it for all crimes. Seventy-five countries and territories, including Australia, Germany, and Spain, refuse to impose the death penalty for any crime.\n If a citizen murders an innocent person, he/she is a murderer. If the state murders an innocent person, that is an unfortunate mistake?\n Dono", 
   {}, 
   128849, 
   null, 
   1117139220.0
  ], 
  [
   128903, 
   null, 
   "Voice Of Reason", 
   "There is no argument (as you yourself have stated) that innocents have been convicted of capital crimes,\n \n \n I believe that is off topic..........I am only talking about criminals where there is absolutely no doubt of guiilt.........I would not put people on death row where there is a doubt of guilt..........", 
   {}, 
   128898, 
   null, 
   1117139640.0
  ], 
  [
   128904, 
   null, 
   "joebrummer", 
   "Have you give any thought to the large portions of people in prison who are mentally ill and NOT getting any treatment????\n \n Of the nearly 2 million inmates being held in prisons and jails across the country, experts believe nearly 500,000 are mentally ill. According to the National Alliance for the Mentally Ill (NAMI), 16 percent of the prison population can be classified as severely mentally ill, meaning that they fit the psychiatric classification for illnesses such as schizophrenia, major depression, and bipolar disorder. According to staff at city and community jails, 25 percent of the jail population is severely mentally ill. However, when other mental illnesses, such as anti-social personality disorder, borderline personality disorder and depression, are included, the numbers are much higher, and NAMI puts the number of inmates suffering from both mental illness and substance abuse the percentage at well over 50 percent. \n \n http://www.pbs.org/wgbh/pages/frontline/shows/asylums/etc/faqs.html", 
   {}, 
   128898, 
   null, 
   1117139700.0
  ], 
  [
   128914, 
   null, 
   "Duo_Maxwell", 
   "I would not put people on death row where there is a doubt of guilt..........\n\n \n Then you are a liar.  And a flip flopper. \n \n You say that you are all for the penalty. Then you say we shouldn't execute those with doubt of guilt. Then you say we should kill peterson. Then you say we shouldn't. then you say we should. Now you're saying he shouldn't even be there. \n \n make up your mind Voice of John Kerry and Jane Fonda", 
   {}, 
   128903, 
   null, 
   1117140300.0
  ], 
  [
   128918, 
   null, 
   "Zardoz", 
   "Whenever there is a debate on the death penalty it always seems that people think we should have the death penalty because it is worse than life in prison. The people against it then talk of how it costs more and they argue and argue. How about this?\n \n \n We have a special prison just for people who would have gotten the death penalty. When you're there you do hard, manual labor, go into a hot dry cell, get globs of food and sleep on your little cot in your cell and do it all over again the next day. This way you could earn your keep if the labor saved money plus we would save money from the death penalty. If they didn't work hard we could whip them or do whatever, involuntary servitude is still allowed as a punishment for crime whereof the party shall have been duly convicted under the 13th ammendment. These are only the worse criminals, murderers, rapists, etc. and the purpose of this is to not only save money on the death penalty, but to make these peoples' lives a living hell where they can only wish they were dead.\n\n \n Soooo...how are you going to make the convicts do this without resorting to the use of torture or other actions nearly as bad as a death penalty?\n How are you going to prevent abuses of the government and law to convict people of a harsher crime so you can 'get free labor'?\n It's one thing to educate and employ inmates who want to do so (and many do want to do so for the extra priveledges it brings) but, a lot of the 'cooshy' niceness that inmates have is to pacify them so they are more managable for the limited amount of guards to handle. You'd end up losing money in some forced labor situations in the cost of extra guards, compensation to widows of dead guards and the like than you'd save by making them dig ditches.\n Yeah...whip me and I'll show you why I was convicted of such a nefarious crime.\n Have you ever been on either side of the bars? Guard/Prisoner?\n I've been on both (although I was innocent I tells ya! (which was true)).\n Personally, I'd prefer the dark hole attitude for the harshest of criminals. 1 hour a day to muck about in a small place and 23 in the hole. But, that didn't prove to be effective either.\n \n The chain gang attituded has a nice rosy look to it when you gloss over all the details. There's a reason why it was eliminated...several acutually.\n \n The only time I can see labor being any good for a prisoner is either when it's voluntary for low risk offenders and/or with short prison sentances.\n Why run or cause problems if you're going to get released in a couple of months?\n \n \n Many penal issues don't really go towards deterance. More towards some emotional desire to make the convict suffer and receive his just punishment.", 
   {}, 
   127645, 
   null, 
   1117140720.0
  ], 
  [
   128931, 
   null, 
   "Nurglitch", 
   "Quite what purpose revenge serves I don't know. Ol' Jeebus was definitely onto something when he preached forgiveness. \n \n I'm not saying that there shouldn't be consequences to criminal behaviour, but that such consequences should be directed towards preventing future criminal behaviour. People like incorrigible rapists and murderers may be cheaper to kill off than they are to keep, unless they have some particular value to society. A child molester who is carefully separated from children, for example, may still serve society. If we can't arrange that, then we might as well just dispose of them. After all, that is what we do with dangerous animals. \n \n But we owe it to people to try and help prevent them from offending again.", 
   {}, 
   128918, 
   null, 
   1117142460.0
  ], 
  [
   128941, 
   null, 
   "Eddie", 
   "First of all I can't see how a tougher punishment could raise the crime level. Stay the same maybe, but not raise it. As I said this should only be for the worst kind of criminals that would regualrly receive the death penalty. We're choosing not to kill them, but they should have to work and suffer, not sit around and watch TV, see the other threat in this topic \"My kind of sherrif\"\n\n \n Actually you could show how crime levels theoreticly could rise as a consequence of harsher punishment by using economic models.\n \n In short (I could go into the more technical parts if you want to, but I think this will be enough to show what I mean): If we consider crime as an economic activity (a way to get resources) and if we consider punishment as an external cost for criminal activity, an increase in punishment will naturally dissuade individuals from becomming criminals (as the treshold for starting a criminal career is raised). However, those who still choose to commit criminal acts may actually increase their number of criminal acts when the cost for commmiting crime is increased in order to compensate for the increase. It all depends on the risk aversion and preferences of the individual. \n \n As I said, this was very summarized and simplified. If you want I could explain it a bit more thouroghly.", 
   {}, 
   128304, 
   null, 
   1117143780.0
  ], 
  [
   128994, 
   null, 
   "Dono", 
   "I believe that is off topic..........\n\n The topic thread starts with \"Whenever there is a debate on the death penalty\" \n \nI am only talking about criminals where there is absolutely no doubt of guiilt.........I would not put people on death row where there is a doubt of guilt..........\n\n In the current system and in any foreseeable future system there is absolutely no way you can assure that only the guilty will be convicted. I assume that the \"doubt\" you speak of must reside in the minds of peers that made the verdict and penalty. From my own personal experience as a juror and a member of numerous jury pools, I would hate to rest my fate in the hands of some of my fellow jurors. For example, on one jury where I was foreman (a theft case) the defendant was seen taking the objects from the car by four people and the stolen objects were found in his car. Our verdict was 11 to 1 for conviction. The lone juror could offer no reason why he voted as he did and finally changed his mind. We then went to the penalty phase where we considered that the young man had no previous record and had received testimony about his good character. The vote was 11 to 1 for a probated sentence, guess who the one was that wanted to send him to prison? Sorry for the long story but the fact is juries are people and people are fallible. As long as we have the death penalty we will kill innocents.\n Dono", 
   {}, 
   128903, 
   null, 
   1117148700.0
  ], 
  [
   129043, 
   null, 
   "Voice Of Reason", 
   "I am talking about capital cases where the evidence is rock solid and there is no question of guilt...............", 
   {}, 
   128994, 
   null, 
   1117155360.0
  ], 
  [
   129060, 
   null, 
   "Dono", 
   "I am talking about capital cases where the evidence is rock solid and there is no question of guilt...............\n\n And I am talking about the real world, as it is, not some fantasy.\n Dono", 
   {}, 
   129043, 
   null, 
   1117161660.0
  ], 
  [
   129397, 
   null, 
   "Voice Of Reason", 
   "And I am talking about the real world, as it is, not some fantasy.\n Dono\n\n \n \n It just boggles the mind that you liberals have more compassion for rapists and murderers then you do for the murdering of innocent, defenseless babies in the womb......", 
   {}, 
   129060, 
   null, 
   1117227180.0
  ], 
  [
   129409, 
   null, 
   "Jo Bennett", 
   "You mentioned off topic VOR? It seems when you can't win one debate you try to switch to another where you think you have more of a leg to stand on.", 
   {}, 
   129397, 
   null, 
   1117228980.0
  ], 
  [
   129431, 
   null, 
   "Dono", 
   "It just boggles the mind that you liberals have more compassion for rapists and murderers then you do for the murdering of innocent, defenseless babies in the womb......\n\n It appears that some minds are easily boggled. We were having an exchange on the death penality and your response is abortion. Since I have never posted on that subject, you have no way of knowing what my feelings are, but I have noted that a complete lack of knowledge has never stopped you before.\n Dono", 
   {}, 
   129397, 
   null, 
   1117232100.0
  ], 
  [
   129435, 
   null, 
   "georged", 
   "You mentioned off topic VOR? It seems when you can't win one debate you try to switch to another where you think you have more of a leg to stand on.\n\n \n Unfortunately, I don't think its intentional. Pity.", 
   {}, 
   129409, 
   null, 
   1117232580.0
  ], 
  [
   129578, 
   null, 
   "zachvac", 
   "I believe that is off topic..........I am only talking about criminals where there is absolutely no doubt of guiilt.........I would not put people on death row where there is a doubt of guilt..........\n\n \n In the US court systems there is NO SUCH THING as no doubt of guilt. They have to be proven guilty beyond a reasonable doubt to be executed. People lie, fingerprints get smudged, and sometimes when you think the person is most definately guilty, they get off (OJ Simpson). Unless they plead guilty to the crime, we have no way of establishing guilt without a doubt.", 
   {}, 
   128903, 
   null, 
   1117260300.0
  ], 
  [
   129585, 
   null, 
   "zachvac", 
   "Actually you could show how crime levels theoreticly could rise as a consequence of harsher punishment by using economic models.\n \n In short (I could go into the more technical parts if you want to, but I think this will be enough to show what I mean): If we consider crime as an economic activity (a way to get resources) and if we consider punishment as an external cost for criminal activity, an increase in punishment will naturally dissuade individuals from becomming criminals (as the treshold for starting a criminal career is raised). However, those who still choose to commit criminal acts may actually increase their number of criminal acts when the cost for commmiting crime is increased in order to compensate for the increase. It all depends on the risk aversion and preferences of the individual. \n \n As I said, this was very summarized and simplified. If you want I could explain it a bit more thouroghly.\n\n \n I get this in terms of economics but this is not economics. I would like to know why you think this would apply to jail. Jail (at least in these terms) is a one-time fee. If you get caught, it's over. In economics, the more you sell the more you make. In this scenario, the more you commit the more of a chance of getting caught. I can see where they may just commit the crime anyway despite the punishment and keep the crime rate the same, but for the crime rate to rise when the punishment goes up is rediculous in my opinion. Maybe I could understand it better if you stick to the actual scenario. Thanks.", 
   {}, 
   128941, 
   null, 
   1117260720.0
  ], 
  [
   129631, 
   null, 
   "lord tammerlain", 
   "I get this in terms of economics but this is not economics. I would like to know why you think this would apply to jail. Jail (at least in these terms) is a one-time fee. If you get caught, it's over. In economics, the more you sell the more you make. In this scenario, the more you commit the more of a chance of getting caught. I can see where they may just commit the crime anyway despite the punishment and keep the crime rate the same, but for the crime rate to rise when the punishment goes up is rediculous in my opinion. Maybe I could understand it better if you stick to the actual scenario. Thanks.\n\n \n \n If I commit one felony, which will result in a life sentance where is the deterence for me not to commit more such crimes. Since if I get caught the jail time that I am going to serve is exactly the same, the cost/benifit analysis is tilted towards commiting more crimes. The real deterence at that point is the more crimes that I commit the higher probablity of getting caught.", 
   {}, 
   129585, 
   null, 
   1117283400.0
  ], 
  [
   129638, 
   null, 
   "Eddie", 
   "I get this in terms of economics but this is not economics. I would like to know why you think this would apply to jail. \n\n \n I believe individuals always act in order to maximize their own percieved \"good\" in any give situation. Good and bad can be expressed in economic terms as gains and costs. Most choices will result in both \n gains and costs elements as well as carry opportunity costs (the net-gain/cost that could have achieved by making the opposite choice). I do believe that individuals always use these mechanics subconsiously or concoiusly when making a choice. The issue is not wether this applies to individuals IMO, but rather how to quantify the \"good\" and \"bad\" for individual choices.\n \n The model I tried to apply to the jail situation deals with the mechanics of making choices and how individuals maximize good with a budget constraint. In the jail case, the good is economic benefit and the cost is the risk of getting caught and punishment. The budget constraint can be virtually anything that constrain the choices of the individual. In the jail case, the constraint is time. The opportunity cost is the net-gain from honest work.\n \n \n If you get caught, it's over. In economics, the more you sell the more you make. In this scenario, the more you commit the more of a chance of getting caught. \n\n \n Economics is more than just sales. It`s also (among other things) about explaining choices and actions of humans who are constrained by various factors (budget). \n \n I agree that the more crime you commit the more of a risk of getting caught. However, this is a part of the cost of carrying out the action and it should be used to detract from the gain from commiting the crime.\n \n \nI can see where they may just commit the crime anyway despite the punishment and keep the crime rate the same, but for the crime rate to rise when the punishment goes up is rediculous in my opinion. \n\n \n Lets try an analogy. \n \n If you where to make 10 dollars/hour at your current job and work 8 hours a day, you would make 80 dollars/day. If the government where to put a 10% tax on your paycheck, your earnings would be 70 dollars/day. Would you still work 8 hours? Or would you work more? Or perhaps work less? I can`t answer for you because I don`t know your preferences. Some would probably work less in this scenario as they would value one hour of leisure time more than they would value 9 dollars. Others would work more as they would try to compensate this loss in earnings. Others would work the same ammount of hours.\n \n In economic theory, this is often called the \"income effect\" and \"substitution effect\". The income effect makes the individual work more if their earnings are lowered as they try to compensate fot the loss, alternatively it makes the individual work less when their earnings are raised as they now can \"afford\" more leisure time. The substitution effect works in the opposite direction (unless one or two of the goods involved are \"inferior\", but let`s not get into that ;)). When the relative price for leisure is lowered by the lowered hourly earnings, the individual will choose to consume more leisure time and work less. The net effect of these two effects cannot be determined by theory. They can only be observed empiricly. The only thing we can say is that the treshold for start working is raised when the earnings are lowered, and the treshold is lowered when earnings are raised.\n \n In the crime situation, the individual is choosing between two alternate ways to get a pay-check (just like the individual was choosing between leisure time and money in the analiogy above). The same income- and substitution effects apply here. The punishment and the risk for getting caught can be viewed as a tax on the earnings, as it is a percieved direct cost of the action. The same income and substitution effects apply to the choice between honest work and criminal activity as they did on the choice between leisure time and working.\n \n I`m not saying that this model will predict a rise in criminal activity if punishments are harsher. But I`m saying that the model presents a theoretic possibility for it to happen. Coupled with the other posters points (like Daewos point about \"having nothing to loose\" and the DOJ study) gives weight to the argument that criminal activity could be expected to rise if we where to implement draconian measures in attempts to stop it.\n \n I hope I made my position on the issue a bit more clear (I know I have a tendancy to muddle things) :)\n \n Oh, and LT also brought up a very interesting point. And that is that the cost for commiting crime can be considered regressive (the cost for making one aditional criminal activity becomes less and less for each crime you commit). By increasing the cost by implementing more draconian punishments, you make the cost even more regressive. And regressive costs on activities (lika a regressive tax) naturally encourages more of that behaviour.", 
   {}, 
   129585, 
   null, 
   1117289160.0
  ], 
  [
   131989, 
   null, 
   "Morfos", 
   "zachvac's idea was a good one. emoticon_idea \n \n -We need more work done in the prisons anyway. The death penalty is a waste unless you take their organs.", 
   {}, 
   129397, 
   null, 
   1117746660.0
  ], 
  [
   134264, 
   null, 
   "Obvious Child", 
   "It just boggles the mind that you liberals have more compassion for rapists and murderers then you do for the murdering of innocent, defenseless babies in the womb......\nThe question was one of if we actually know they ARE rapists and murderers.\n \n Incidentally, the death penalty for rape could clearly raise crime as its probably safer to rape and then murder if you'll be executed for rape anyway.", 
   {}, 
   129397, 
   null, 
   1118181600.0
  ], 
  [
   136313, 
   null, 
   "Nurglitch", 
   "Likewise I can't imagine that people would be willing to suffer tortuous life imprisonment, making the apprehension of dangerous criminals even more dangerous.", 
   {}, 
   134264, 
   null, 
   1118605920.0
  ], 
  [
   198352, 
   null, 
   "akira_rayn216", 
   "There is no argument (as you yourself have stated) that innocents have been convicted of capital crimes, later to be exonerated, and innocents have been executed.Dono\n\n \n With the system proposed by zachvac, the innocent could then be freed from the jail, and receive government compensation for the work they did. That would indeed save money, would lessen the severity of convicting innocents, and they would be compensated for their trouble. Seems logical to me. emoticon_xhoho", 
   {}, 
   128898, 
   null, 
   1139957400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  the current state of jail", 
  "url": "http://www.4forums.com/political/crime-debates/5384-current-state-jail.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 5384, 
  "discussion_files": [
   [
    "31499.html", 
    "http://www.4forums.com/political/crime-debates/5384-current-state-jail-print.html"
   ], 
   [
    "31500.html", 
    "http://www.4forums.com/political/crime-debates/5384-current-state-jail-2-print.html"
   ]
  ], 
  "identifier": 5384
 }
]