[
 [
  [
   127650, 
   null, 
   "Missouri Mule", 
   "1) What was Abu Nidal's involvement and why was he murdered by Saddam?\n \n 2) Was there a connection with Saddam and Al Queda?\n \n I can't verify this is factual but it has the ring of truth. If this is true, then Bush had every legal and moral right to remove Saddam's rogue regime. This is not only a \"smoking gun\"; it is a raging forrest fire.\n =====================================\n 24-May-2005 04:43 \n \n Al-Qaeda number two Ayman al-Zawahiri\n \n IRAQ: FORMER PM REVEALS SECRET SERVICE DATA ON BIRTH OF AL-QAEDA IN IRAQ\n \n Baghdad, 23 May (AKI) - The number two of the al-Qaeda network, Ayman al-Zawahiri, visited Iraq under a false name in September 1999 to take part in the ninth Popular Islamic Congress, former Iraqi premier Iyad Allawi has revealed to pan-Arab daily al-Hayat. In an interview, Allawi made public information discovered by the Iraqi secret service in the archives of the Saddam Hussein regime, which sheds light on the relationship between Saddam Hussein and the Islamic terrorist network. He also said that both al-Zawahiri and Jordanian militant al-Zarqawi probably entered Iraq in the same period.\n \n \"Al-Zawahiri was summoned by Izza Ibrahim Al-Douri - then deputy head of the council of the leadership of the revolution - to take part in the congress, along with some 150 other Islamic figures from 50 Muslim countries,\" Allawi said.\n \n According to Allawi, important information has been gathered regarding the presence of another key terrorist figure operating in Iraq - the Jordanian militant Abu Musab al-Zarqawi.\n \n \"The Jordanian Abu Musab al-Zarqawi entered Iraq secretly in the same period,\" Allawi affirmed, \"and began to form a terrorist cell, even though the Iraqi services do not have precise information on his entry into the country,\" he said.\n \n Allawi's remarks come after statements to al-Hayat by King Abdallah II of Jordan over Saddam's refusal to hand over al-Zarqawi to the authorities in Amman.\n \n On this question Allawi said: ''The words of the Jordanian King are correct and important. We have proof of al-Zawahiri's visit to Iraq, but we do not have the precise date or information on al-Zarqawi's entry, though it is likely that he arrived around the same time.\"\n \n In Allawi's view, Saddam's government \"sponsored\" the birth of al-Qaeda in Iraq, coordinating with other terrorist groups, both Arab and Muslim. \"The Iraqi secret services had links to these groups through a person called Faruq Hajizi, later named Iraq's ambassador to Turkey and arrested after the fall of Saddam's regime as he tried to re-enter Iraq. Iraqi secret agents helped terrorists enter the country and directed them to the Ansar al-Islam camps in the Halbija area,\" he said.\n \n The former prime minister claims that Saddam's regime sought to involve even Palestinian Abu Nidal - head of a group once considered the world's most dangerous terrorist organisation - in its terrorist circuit. Abu Nidal's organisation was responsible for terrorist attacks in some 20 countries, killing more than 300 people and wounding hundreds more.\n \n He added that Abu Nidal's refusal to cooperate with Islamist groups was the reason for his death in Iraq, in the summer of 2002.\n \n http://www.adnki.com/index_2Level.php?cat=Terrorism&loid=8.0.169852178&par=0", 
   {
    "post_info": {
     "post_title": "This answers two questions I have had for years"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1116910140.0
  ], 
  [
   127669, 
   null, 
   "Kronus", 
   "\n \n I can't verify this is factual but it has the ring of truth. If this is true, then Bush had every legal and moral right to remove Saddam's rogue regime. \n\n \n It doesn't work that way. You have to have proof first, you can't dig it up later. If I shoot a random person on the street, and it turns out that that person was planning a shooting spree, I'm still a murderer. My actions don't suddenly become justified, they just become fortunate. Bush had no justification for invading, and even if one turns up now the invasion was still illegal.", 
   {}, 
   127650, 
   null, 
   1116912060.0
  ], 
  [
   127688, 
   null, 
   "Missouri Mule", 
   "It doesn't work that way. You have to have proof first, you can't dig it up later. If I shoot a random person on the street, and it turns out that that person was planning a shooting spree, I'm still a murderer. My actions don't suddenly become justified, they just become fortunate. Bush had no justification for invading, and even if one turns up now the invasion was still illegal.\n\n \n Evidently you didn't read the article. I've argued for a long time that I believed it was highly likely that Bush had information he was not sharing with the general public. This would tend to substantiate that view. If he had known this he would have been grossly negligent not to have invaded.\n \n The reason I said I couldn't verify it as factual is because I am not familiar with this news source. However, it goes on to name real names and the facts surrounding those names. And it clears up some not so mysterious loose ends that go to Bush's thinking why Saddam had to go. It will be interesting to see if the MSM pick up on this story. At the very least they should knock it down if it can be substantiated but it appears the documentation would make the case one way or another.", 
   {}, 
   127669, 
   null, 
   1116915720.0
  ], 
  [
   127714, 
   null, 
   "SteveRogers", 
   "And you have been wrong for a long time. Much like during the cold war enemies crossed paths and talked for many reasons. This same example could be used against every country in the Middle East. Because you have a willing suspension of disbief, you accept it without proper questioning. You might also ask if this connect ion is so clear, why only you and the adminstration see it. All reports to date say no evidence of a working relationship. IN fact, most report quite strongly that Al Qaeda wanted Saddam dead, which is why they worked with the Kurds.\n \n Reason it out without bias and you'll see clearer.", 
   {}, 
   127688, 
   null, 
   1116917880.0
  ], 
  [
   127780, 
   null, 
   "Redratio1", 
   "Where is the Saddam connnection?\n \n I don't see it.\n \n This quite nebulous.", 
   {}, 
   127714, 
   null, 
   1116941100.0
  ], 
  [
   127817, 
   null, 
   "Kronus", 
   "Evidently you didn't read the article. I've argued for a long time that I believed it was highly likely that Bush had information he was not sharing with the general public. This would tend to substantiate that view. If he had known this he would have been grossly negligent not to have invaded.\n \n\n \n I think you're the one who didn't read it. There's not a word in there indicating that Bush had any knowledge of any of this. I don't see how you got that impression at all. The fact still remains that Bush had no justification for invasion.", 
   {}, 
   127688, 
   null, 
   1116950820.0
  ], 
  [
   127858, 
   null, 
   "SteveRogers", 
   " The fact still remains that Bush had no justification for invasion.\n\n \n That is right. But the faithful wil continue to believe when all logic says otherwise. emoticon_rolleyes :xcensored", 
   {}, 
   127817, 
   null, 
   1116954960.0
  ], 
  [
   127893, 
   null, 
   "Missouri Mule", 
   "I think you're the one who didn't read it. There's not a word in there indicating that Bush had any knowledge of any of this. I don't see how you got that impression at all. The fact still remains that Bush had no justification for invasion.\n\n \n I don't know whether to laugh or cry at your response. Do you believe that Bush is going to share all intelligence information such as this with the general public? I worked in the military as a classified control clerk and I can tell you that there is a tremendous amount of information that will never be widely shared. Actually, I think they go overboard. What we do know for a fact is that Bush made up his mind early on to remove Saddam but was persuaded by Powell to go to the U.N. in a last gasp attempt to get the \"world community\" on board. Both Cheney and Rumsfeld told him he was wasting his time. They were right. Powell was stabbed in the back by the French. \n \n In any event the documents, if authentic, prove beyond any doubt that Saddam was providing a safe harbor for terrorists to operate from. How on earth could Bush have allowed that to continue after 9/11. He would have been criminally negligent to ignore such information.", 
   {}, 
   127817, 
   null, 
   1116957420.0
  ], 
  [
   127894, 
   null, 
   "Missouri Mule", 
   "Where is the Saddam connnection?\n \n I don't see it.\n \n This quite nebulous.\n\n \n Saddam was a Stalinist. In fact, he modeled his country after the methods that Stalin ran the Soviet Union. Stalin knew everything that went in on the Soviet Union. It follows that so did Saddam. By permitting terrorists to operate out of Iraq meant he had to go. We're about to this point with Syria and Iran will follow. Both have to go down.", 
   {}, 
   127780, 
   null, 
   1116957480.0
  ], 
  [
   127956, 
   null, 
   "georged", 
   "That is right. But the faithful wil continue to believe when all logic says otherwise. emoticon_rolleyes :xcensored\n\n \n Logic? The faithful, I prefer the word sheep, don't need no stinking logic!", 
   {}, 
   127858, 
   null, 
   1116961440.0
  ], 
  [
   127982, 
   null, 
   "SteveRogers", 
   "I don't know whether to laugh or cry at your response. Do you believe that Bush is going to share all intelligence information such as this with the general public? I worked in the military as a classified control clerk and I can tell you that there is a tremendous amount of information that will never be widely shared. Actually, I think they go overboard. What we do know for a fact is that Bush made up his mind early on to remove Saddam but was persuaded by Powell to go to the U.N. in a last gasp attempt to get the \"world community\" on board. Both Cheney and Rumsfeld told him he was wasting his time. They were right. Powell was stabbed in the back by the French. \n \n In any event the documents, if authentic, prove beyond any doubt that Saddam was providing a safe harbor for terrorists to operate from. How on earth could Bush have allowed that to continue after 9/11. He would have been criminally negligent to ignore such information.\n\n \n Yet, you believe you can make it up to support his error? Seriously, can't you do better than this. And while authenticity is certainly a concern here and with this adminstration runnning things, it proves nothing of the kind. Nothing that, again, couldn't be proven of most the nations on the planet.\n \n I realize this is so important to you that you are willing to try and streach anything as justification, but you are simply wrong. So, take a deep breath, suck it up and try to actually think all we know through and there might be some hope for you yet. \n \n Or maybe not.", 
   {}, 
   127893, 
   null, 
   1116963720.0
  ], 
  [
   128000, 
   null, 
   "lord tammerlain", 
   "Saddam was a Stalinist. In fact, he modeled his country after the methods that Stalin ran the Soviet Union. Stalin knew everything that went in on the Soviet Union. It follows that so did Saddam. By permitting terrorists to operate out of Iraq meant he had to go. We're about to this point with Syria and Iran will follow. Both have to go down.\n\n \n \n A few problems with tht in general, \n \n 1. The no fly zones protected Kurdish terrorists attacking Turkey\n 2. The only \" terrorist\" training camp in Iraq was in the northern No Fly Zone which prevented Saddam from taking it out. I believe that it was in Kurdish controlled terrirtory.\n 3. Saudi Arabia, Pakistan, have supported hard core Islamist far more then Syria or Iran and in the world of Islamic militants are a far bigger threat.\n 4. If supporting terrorists ( current US style definition of attacking civilians when not part of a defined military I fully expect the US to clear out Florida of Anti Castro terrorists and hand over Posada to Venezuela.", 
   {}, 
   127894, 
   null, 
   1116965580.0
  ], 
  [
   128035, 
   null, 
   "Kronus", 
   "Do you believe that Bush is going to share all intelligence information such as this with the general public? \n\n \n Do you believe that Bush had this intelligence? That\\'s the critical point here, isn\\'t it? I see no reason to believe that he did, your article gives no reason, and you\\'ve given no reason. You\\'re still just trying to justify his actions after the fact.", 
   {}, 
   127893, 
   null, 
   1116971400.0
  ], 
  [
   128068, 
   null, 
   "Duo_Maxwell", 
   "Um, question: Why is it that the 9/11 report refutes virtually all such claims of Qaeda-Saddam ties?", 
   {}, 
   128035, 
   null, 
   1116975600.0
  ], 
  [
   128072, 
   null, 
   "sinjin", 
   "Um, question: Why is it that the 9/11 report refutes virtually all such claims of Qaeda-Saddam ties?\n\n Well obviously the commission is composed of liberals. Probably atheists too. Send them packing to Eurabia where they can play soccer all day, whatever that is.", 
   {}, 
   128068, 
   null, 
   1116976560.0
  ], 
  [
   128115, 
   null, 
   "Missouri Mule", 
   "Do you believe that Bush had this intelligence? That's the critical point here, isn't it? I see no reason to believe that he did, your article gives no reason, and you've given no reason. You're still just trying to justify his actions after the fact.\n\n \n No, and you don't know that he didn't. Draw.", 
   {}, 
   128035, 
   null, 
   1116979560.0
  ], 
  [
   128129, 
   null, 
   "SteveRogers", 
   "No, and you don't know that he didn't. Draw.\n\n \n No, he doesn't have to. You do. The affirmative carries the burden. If you can't prove an affirmative, you have to concede the point. If you are of course honest that is.", 
   {}, 
   128115, 
   null, 
   1116981060.0
  ], 
  [
   128186, 
   null, 
   "Diogenes99", 
   "It doesn't work that way. You have to have proof first, you can't dig it up later.\nHave you told Dan Rather?\n \n \nAll reports to date say no evidence of a working relationship.\nTrue, but the article is talking about Saddam's apparent attempt to make al-Qaeda his tool. That in itself would justify the invasion.\n \n Reason it out without bias and you'll see clearer.", 
   {}, 
   128129, 
   null, 
   1116993420.0
  ], 
  [
   128190, 
   null, 
   "Voice Of Reason", 
   "Have you told Dan Rather?\n \n True, but the article is talking about Saddam's apparent attempt to make al-Qaeda his tool. That in itself would justify the invasion.\n \n Reason it out without bias and you'll see clearer.\n\n \n Diogenes, Missouri Mule........The Left will never believe there was a connection between Saddam and 9/11/01.....When it comes to that subject they are in a state of denial............You could get a video with Bin laden on his death bed admitting the connection and they would say it was a fake...........", 
   {}, 
   128186, 
   null, 
   1116994620.0
  ], 
  [
   128207, 
   null, 
   "SteveRogers", 
   "Have you told Dan Rather?\n \n True, but the article is talking about Saddam's apparent attempt to make al-Qaeda his tool. That in itself would justify the invasion.\n \n Reason it out without bias and you'll see clearer.\n\n \n No it doesn't. Not even close. Since Al Qaeda wanted to kill him, one would expect him to try to seek an advantage.\n \n No, and VOR, you really shouldn't expect people to accept nonsense that can't be supported. If you say there is a working relationship, you have to provide evidence because absence of evidence is absence of evidence. Now use that brain of yours and think it through.", 
   {}, 
   128186, 
   null, 
   1116996720.0
  ], 
  [
   128260, 
   null, 
   "Missouri Mule", 
   "No, he doesn't have to. You do. The affirmative carries the burden. If you can't prove an affirmative, you have to concede the point. If you are of course honest that is.\n\n \n \"Affirmative\" my butt. The president has a sworn duty to protect the citizens of this country. He has to go on the best intelligence and common sense reasoning to do what is required. If these documents are valid, this was truly a \"slam-dunk\" case in every way.", 
   {}, 
   128129, 
   null, 
   1117005720.0
  ], 
  [
   128340, 
   null, 
   "SteveRogers", 
   "\"Affirmative\" my butt. The president has a sworn duty to protect the citizens of this country. He has to go on the best intelligence and common sense reasoning to do what is required. If these documents are valid, this was truly a \"slam-dunk\" case in every way.\n\n \n No in isn't in any way. But the burden is Bush's to prove and yours since you are echoing the affirmative claim. If you can't, you have nothing. And Bush has nothing.\n \n If contacts are a criteria, then every nation on the planet is guilty. They all have contacts with bad fellows. You need more, much more to prove your case.", 
   {}, 
   128260, 
   null, 
   1117036320.0
  ], 
  [
   128361, 
   null, 
   "Kronus", 
   "No, and you don't know that he didn't. Draw.\n\n \n No, it's not a draw! You said that that article fully justifies Bush's invasion. Now you're saying that it doesn't. Which was my point all along. If you want to change your mind then go ahead, but at least show some integrity about it.", 
   {}, 
   128115, 
   null, 
   1117041240.0
  ], 
  [
   128382, 
   null, 
   "Missouri Mule", 
   "No, it's not a draw! You said that that article fully justifies Bush's invasion. Now you're saying that it doesn't. Which was my point all along. If you want to change your mind then go ahead, but at least show some integrity about it.\n\n \n I am convinced that Bush had knowledge of these tiese before he went into Iraq. Having that knowledge was justification for taking the action that he did. He could not permit a sanctuary for terrorists in the Middle East after 9/11. No president could.", 
   {}, 
   128361, 
   null, 
   1117044300.0
  ], 
  [
   128391, 
   null, 
   "daewoo", 
   "I am convinced that Bush had knowledge of these tiese before he went into Iraq. Having that knowledge was justification for taking the action that he did. He could not permit a sanctuary for terrorists in the Middle East after 9/11. No president could.\n\n \n So we should support tyhe decision based on hypothetical secret information? How gullible can you possibly be?\n \n Even if he did have this hypothetical secret information, the invasion was still illegal. Now, since we KNOW that the invasion in Iraq has helped spawn new terrorists, why is this secret information not being trotted out?", 
   {}, 
   128382, 
   null, 
   1117045320.0
  ], 
  [
   128409, 
   null, 
   "georged", 
   "I am convinced that Bush had knowledge of these tiese before he went into Iraq. Having that knowledge was justification for taking the action that he did. He could not permit a sanctuary for terrorists in the Middle East after 9/11. No president could.\n\n \n MM, that's akin to stating Mexico or any other country should be illegally invaded and occupied because you think there's a possibility of terrorists making it a sanctuary. You need to identify why terrorists target the US, recognize Iraq had nothing to do with terrorists attacking or potentially attacking the US and understand why the administration invaded and occupied Iraq. Anything else is idle speculation. Hint: It wasn't because Iraq poised any danger to the US. \n \n This subject has long been a topic of discussion on this forum, but I thought it had been put to rest some time ago. We were lied to about WMDs, the invasion was illegal and now we're paying a big, big price for a bad call. There's nothing else to it. And please spare me the Islamic phobia rant.", 
   {}, 
   128382, 
   null, 
   1117047120.0
  ], 
  [
   128424, 
   null, 
   "Missouri Mule", 
   "MM, that's akin to stating Mexico or any other country should be illegally invaded and occupied because you think there's a possibility of terrorists making it a sanctuary. You need to identify why terrorists target the US, recognize Iraq had nothing to do with terrorists attacking or potentially attacking the US and understand why the administration invaded and occupied Iraq. Anything else is idle speculation. Hint: It wasn't because Iraq poised any danger to the US. \n \n This subject has long been a topic of discussion on this forum, but I thought it had been put to rest some time ago. We were lied to about WMDs, the invasion was illegal and now we're paying a big, big price for a bad call. There's nothing else to it. And please spare me the Islamic phobia rant.\n\n \n You haven't read what I have written here. I have said repeatedly that Bush was operating from intelligence that was not shared with the general public. He knew enough about Saddam and his connections or acquiesance to terrorists to know it was ridiculous to ignore him in the larger war on terrorism. \n \n I totally disagree with you that Saddam posed no threat to us. The sanctions were coming apart with the U.N.'s complicity and crooked oil for food program. He would then have been free to have reinstituted all of his WMD programs and we could have done nothing about it until that nuclear cloud was rising over NYC. Then we would have had the justification and only then by the appeasers here who think we should have unlimited patience. I think that is an absurd position to take.", 
   {}, 
   128409, 
   null, 
   1117047960.0
  ], 
  [
   128428, 
   null, 
   "Missouri Mule", 
   "So we should support tyhe decision based on hypothetical secret information? How gullible can you possibly be?\n \n Even if he did have this hypothetical secret information, the invasion was still illegal. Now, since we KNOW that the invasion in Iraq has helped spawn new terrorists, why is this secret information not being trotted out?\n\n \n Well--- it is. I just posted it. This is the subject of this thread.\n \n I reject entirely this bogus \"illegal\" assertion. There are only going to be two types of people after this war on terrorism has run its course, the dead and the alive. I choose to be among the alive.", 
   {}, 
   128391, 
   null, 
   1117048080.0
  ], 
  [
   128452, 
   null, 
   "Kronus", 
   "\n I reject entirely this bogus \"illegal\" assertion. There are only going to be two types of people after this war on terrorism has run its course, the dead and the alive. I choose to be among the alive.\n\n \n There are going to be two kinds of people after this \"war\" is over. Those who upheld the ideals that this country is based on, and those who abandoned them out of fear for their lives. Dead or alive, I'll be in the former, and you'll be in the later.", 
   {}, 
   128428, 
   null, 
   1117050000.0
  ], 
  [
   128453, 
   null, 
   "SteveRogers", 
   "ANd you still haven't proven the existenceof such intel. You are grasping at straws and rather weakly at that.\n \n And in the sense that we made agreements, this war is illegal and much more in keeping with what Hitler and Saddam himself would do as opposed to the honored American tradition of doing the \"right\" thing. In Iraq, we, the US, are the agressors. Without just cause, we invaded and occupied another country. That is every bit as illegal as Saddam going into Kuwait.", 
   {}, 
   128428, 
   null, 
   1117050060.0
  ], 
  [
   128467, 
   null, 
   "daewoo", 
   "I totally disagree with you that Saddam posed no threat to us. The sanctions were coming apart with the U.N.'s complicity and crooked oil for food program. He would then have been free to have reinstituted all of his WMD programs and we could have done nothing about it until that nuclear cloud was rising over NYC. Then we would have had the justification and only then by the appeasers here who think we should have unlimited patience. I think that is an absurd position to take.\n\n \n \n The sanctions were falling apart becuase the rest of the world listened to the UN inspectors the first 6 times that they declared Iraq WMD free. \n \n This was the problem. we would give the UN inpectors lists of where we just KNEW they would find WMDs, and they would come up empty. Then we woudl make a new list, and another list, and another list. It was getting rediculous. This is why the rest fo the world was not surprised to find that there were no WMDs. They already knew that. Unlike Americans, who don't bother to look at or read anything that is not actively being pushed by politicians astalking points, much of the world actually pays attention to such things.\n \n \n \nI reject entirely this bogus \"illegal\" assertion. There are only going to be two types of people after this war on terrorism has run its course, the dead and the alive. I choose to be among the alive.\n\n \n I am sure you do, just like you reject a declining economy and a weaening dollar, depsite the fact that it is staring you right in the face and all you need is a graph.\n \n the idea that all that will be left after this is over is just plain stupid. I think Kronus has it right. If America falls, it will nto be because of ME terrorists, it will be because of people like YOU. It will be because you and your little neo fascists buddies are runnign around categorically denying that we have any economc problems, depsite the fact that any retard can see that we do. Our lifestyle will disapear because you and your ilk are such chickenshits that you would prefer to live in a totalitsarin state than take the risks that go with freedom.", 
   {}, 
   128424, 
   null, 
   1117053180.0
  ], 
  [
   128469, 
   null, 
   "SteveRogers", 
   "Someone who wants to believe doesn't assess evidence. They fill in blanks with by claiming we don't know it all when the real problem is there willingness to believe.", 
   {}, 
   128467, 
   null, 
   1117053780.0
  ], 
  [
   128470, 
   null, 
   "georged", 
   "Someone who wants to believe doesn't assess evidence. They fill in blanks with by claiming we don't know it all when the real problem is there willingness to believe.\n\n \n Fits right in with the basis of fundamentalist belief systems.", 
   {}, 
   128469, 
   null, 
   1117054200.0
  ], 
  [
   128477, 
   null, 
   "SteveRogers", 
   "Fits right in with the basis of fundamentalist belief systems.\n\n \n I know. :xcensored", 
   {}, 
   128470, 
   null, 
   1117056900.0
  ], 
  [
   128490, 
   null, 
   "Missouri Mule", 
   "The sanctions were falling apart becuase the rest of the world listened to the UN inspectors the first 6 times that they declared Iraq WMD free. \n \n This was the problem. we would give the UN inpectors lists of where we just KNEW they would find WMDs, and they would come up empty. Then we woudl make a new list, and another list, and another list. It was getting rediculous. This is why the rest fo the world was not surprised to find that there were no WMDs. They already knew that. Unlike Americans, who don't bother to look at or read anything that is not actively being pushed by politicians astalking points, much of the world actually pays attention to such things.\n \n I am sure you do, just like you reject a declining economy and a weaening dollar, depsite the fact that it is staring you right in the face and all you need is a graph.\n \n the idea that all that will be left after this is over is just plain stupid. I think Kronus has it right. If America falls, it will nto be because of ME terrorists, it will be because of people like YOU. It will be because you and your little neo fascists buddies are runnign around categorically denying that we have any economc problems, depsite the fact that any retard can see that we do. Our lifestyle will disapear because you and your ilk are such chickenshits that you would prefer to live in a totalitsarin state than take the risks that go with freedom.\n\n \n There you go again with your \"declining economy\" and \"weakening dollar.\" I think in the interest of full disclosure you should tell us what you are actually selling. Offhand, I'd say you are into \"precious metals\" like the nonsense than went on in the 1970s when secretarial pools were buying up gold at $850 an ounce.\n \n You ridiculous assertion that I would prefer to live in a totalitarian state is a perfect example of your deluded thinking. It is your kind that has your head buried in the sand that would only permit that to occur. The same kind of thinking that brought about WWII by the \"peace in our time\" types.\n \n Frankly, I think you need to take a pill and calm down. Your post indicated a tendency toward mental disordered thinking. You might want to have that checked out.", 
   {}, 
   128467, 
   null, 
   1117060440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  This answers two questions I have had for years", 
  "url": "http://www.4forums.com/political/peace-middle-east/5385-answers-two-questions-i-have-had-years.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5385, 
  "discussion_files": [
   [
    "26472.html", 
    "http://www.4forums.com/political/peace-middle-east/5385-answers-two-questions-i-have-had-years-print.html"
   ], 
   [
    "26473.html", 
    "http://www.4forums.com/political/peace-middle-east/5385-answers-two-questions-i-have-had-years-3-print.html"
   ], 
   [
    "26474.html", 
    "http://www.4forums.com/political/peace-middle-east/5385-answers-two-questions-i-have-had-years-2-print.html"
   ]
  ], 
  "identifier": 5385
 }
]