[
 [
  [
   6873, 
   null, 
   "paradigm_shift", 
   "This may be unnecessary, but I just got the impression from reading a couple of threads here that some people are getting confused by the term 'atheist'.\n One person claimed that an athiest's beliefs are not supported by facts, and so are no more valid that Xian beliefs.\n \n In actual fact, different people use the term atheist in different ways. To quote http://www.infidels.org/news/atheism/intro.html , \n \n \n \n \n \"Atheism is characterized by an absence of belief in the existence of gods. This absence of belief generally comes about either through deliberate choice, or from an inherent inability to believe religious teachings which seem literally incredible. It is not a lack of belief born out of simple ignorance of religious teachings.\n \n Some atheists go beyond a mere absence of belief in gods: they actively believe that particular gods, or all gods, do not exist. Just lacking belief in Gods is often referred to as the \"weak atheist\" position; whereas believing that gods do not (or cannot) exist is known as \"strong atheism\".\n \n Regarding people who have never been exposed to the concept of 'god': Whether they are 'atheists' or not is a matter of debate. Since you're unlikely to meet anyone who has never encountered religion, it's not a very important debate...\n \n It is important, however, to note the difference between the strong and weak atheist positions. \"Weak atheism\" is simple scepticism; disbelief in the existence of God. \"Strong atheism\" is an explicitly held belief that God does not exist. Please do not fall into the trap of assuming that all atheists are \"strong atheists\". There is a qualitative difference in the \"strong\" and \"weak\" positions; it's not just a matter of degree.\n \n Some atheists believe in the non-existence of all Gods; others limit their atheism to specific Gods, such as the Christian God, rather than making flat-out denials.\n \n \"But isn't disbelieving in God the same thing as believing he doesn't exist?\"\n \n Definitely not. Disbelief in a proposition means that one does not believe it to be true. Not believing that something is true is not equivalent to believing that it is false; one may simply have no idea whether it is true or not. Which brings us to agnosticism.\n \n \"What is agnosticism then?\"\n \n The term 'agnosticism' was coined by Professor T.H. Huxley at a meeting of the Metaphysical Society in 1876. He defined an agnostic as someone who disclaimed both (\"strong\") atheism and theism, and who believed that the question of whether a higher power existed was unsolved and insoluble. Another way of putting it is that an agnostic is someone who believes that we do not know for sure whether God exists. Some agnostics believe that we can never know.\n \n In recent years, however, the term agnostic has also been used to describe those who simply believe that the evidence for or against God is inconclusive, and therefore are undecided about the issue.\n \n To reduce the amount of confusion over the use of term agnosticism, it is recommended that usage based on a belief that we cannot know whether God exists be qualified as \"strict agnosticism\" and usage based on the belief that we merely do not know yet be qualified as \"empirical agnosticism\".\n \n Words are slippery things, and language is inexact. Beware of assuming that you can work out someone's philosophical point of view simply from the fact that she calls herself an atheist or an agnostic. For example, many people use agnosticism to mean what is referred to here as \"weak atheism\", and use the word \"atheism\" only when referring to \"strong atheism\".\n \n Beware also that because the word \"atheist\" has so many shades of meaning, it is very difficult to generalize about atheists. About all you can say for sure is that atheists don't believe in God. For example, it certainly isn't the case that all atheists believe that science is the best way to find out about the universe.\"\n \n \n \n \n So someone who calls themself an atheist does not necessarily claim to know a God does not exist. \n Sorry if this was not needed, but in any case it may help new users etc.", 
   {
    "post_info": {
     "post_title": "Definitions of 'atheist' and 'agnostic', clearing up confusion"
    }
   }, 
   null, 
   null, 
   1050802140.0
  ], 
  [
   6875, 
   null, 
   "Crim", 
   "good post", 
   {}, 
   6873, 
   null, 
   1050803880.0
  ], 
  [
   7321, 
   null, 
   "Middle", 
   "Yes, I agree...quick question: Can you be agnostic and a weak atheist?", 
   {}, 
   6873, 
   null, 
   1051638480.0
  ], 
  [
   7322, 
   null, 
   "Crim", 
   "Yes.\n I would guess most agnostics are.", 
   {}, 
   6873, 
   null, 
   1051638780.0
  ], 
  [
   7586, 
   null, 
   "Pikeman85", 
   "nod, I'd say I am an empirical agnostic and a weak athiest", 
   {}, 
   6873, 
   null, 
   1051954380.0
  ], 
  [
   7628, 
   null, 
   "Middle", 
   "Thank you for that useful information...It's something I never would've known...", 
   {}, 
   6873, 
   null, 
   1052000220.0
  ], 
  [
   8757, 
   null, 
   "Burnout", 
   "That is a helpful quote because I don't believe in any god, but say that it is impossible to prove or disprove his existance. I didn't know my \"politically correct\" title until now.", 
   {}, 
   6873, 
   null, 
   1054620720.0
  ], 
  [
   8758, 
   null, 
   "Burnout", 
   "Oops. I didn't mean to say \"quote\". Instead i meant to say \"piece of info\" or something like that, but it doesn't really matter.", 
   {}, 
   6873, 
   null, 
   1054621020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Definitions of 'atheist' and 'agnostic', clearing up confusion", 
  "url": "http://www.4forums.com/political/religion-debates/539-definitions-atheist-agnostic-clearing-up-confusion.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 539, 
  "discussion_files": [
   [
    "18562.html", 
    "http://www.4forums.com/political/religion-debates/539-definitions-atheist-agnostic-clearing-up-confusion-print.html"
   ]
  ], 
  "identifier": 539
 }
]