[
 [
  [
   128457, 
   null, 
   "FISHX", 
   "This is a matter that i hold very close to my heart just wondered what everyone elses opinion is of the barbaric way these baby's are treated even after death.\n \n \n \n http://www.ashevilletribune.com/in_their_words.htm", 
   {
    "post_info": {
     "post_title": "How could they?"
    }
   }, 
   null, 
   null, 
   1117050840.0
  ], 
  [
   128468, 
   null, 
   "Tastyfish", 
   "I don't beleive its true, the site it comes from is hardly unbiased and unless you want to believe in some terrible conspiracy this is going to be big news. Not to mention there just isn't that much demand for random assorted organs anyway, if at all really. \n They would be of almost no use to developmental research and would be too far developed for stem cell research.", 
   {}, 
   128457, 
   null, 
   1117053240.0
  ], 
  [
   128497, 
   null, 
   "FISHX", 
   "http://www.stockportexpress.co.uk/news/s/10/10388_mums_organ_scandal_battle.html\n \n http://www.organretention.org/news5.htm\n \n \n http://uk.geocities.com/pity2uk/HTML/almil.htm\n \n \n http://www.davidicke.net/newsroom/europe/england/012901a.html\n \n \n http://www.southmanchesterreporter.co.uk/news/s/66/66854_new_human_organs_probe_launched.html\n \n \n This unfortunatly this is very real the i have been fighting this personaly for 11 years and there is still no end in sight.\n The reason that it isn't publisised is because it isn't illegal the scarey thing is that you will be prosecuted for taking a ring of a dead body but not if you take a limb/organ or in my case the complete body.", 
   {}, 
   128468, 
   null, 
   1117061220.0
  ], 
  [
   128503, 
   null, 
   "Tastyfish", 
   "You liked to David Icke - the guy who beleives that Giant Lizards are secretly running the world today...you need to take this with a pinch of salt.\n \n Anyway, I honestly don't really see a problem with salvaging things from the dead that are going to benefit the rest of mankind. It sounds icky, and is to a degree but seems better than feeding them to maggots or just burning them.\n Fair enough if you want have it as an option like Organ Donors but seems the same thing really to me, especially as there are babies that die because they need immediate organ or tissue donors after being born.\n \n Its the allegations of babies being killed to fund this I doubt, seems to be an attempt to sensationalise a piece of news. I stand by the original point that there isn't really a medical use for fetus skin as was claimed, some of the organs might be of more use but thats about it.", 
   {}, 
   128497, 
   null, 
   1117062060.0
  ], 
  [
   128508, 
   null, 
   "FISHX", 
   "You liked to David Icke - the guy who beleives that Giant Lizards are secretly running the world today...you need to take this with a pinch of salt.\n \n Anyway, I honestly don't really see a problem with salvaging things from the dead that are going to benefit the rest of mankind. It sounds icky, and is to a degree but seems better than feeding them to maggots or just burning them.\n Fair enough if you want have it as an option like Organ Donors but seems the same thing really to me, especially as there are babies that die because they need immediate organ or tissue donors after being born.\n \n Its the allegations of babies being killed to fund this I doubt, seems to be an attempt to sensationalise a piece of news. I stand by the original point that there isn't really a medical use for fetus skin as was claimed, some of the organs might be of more use but thats about it.\n\n \n \n It may only be salvaging to you but to the parents involved it is body theft.\n \n Let me just ask you to step in our shoes for just 10 minutes imagine trawling around 100's of hospital labs and medical schools seeing all these poor little babies lined up in jars and i don't mean just a few there is up to 50 in each hospital and school imagine looking at those jars hoping that one of them is your child so you can at lastgive him the burial he/she deserves(a basic human right) yet at the same time praying that none of them are yours.\n \n Having done that can you still say that it is only salvage bearing in mind our children were only sent for post mortem and many of us have not seen them since?", 
   {}, 
   128503, 
   null, 
   1117062660.0
  ], 
  [
   128509, 
   null, 
   "Tastyfish", 
   "I totally agree that it should be more like the organ donor system, though I think a lot of the controversy arises where families of patients have signed away more than they thought (as was the case in the UK, it was legal because the families had actually allowed it not really thinking about it). Having never been in the situation (and hopefully never either), I have no idea how confusing or misleading (not intentionally, I think its due to there being a standard question like 'do you mind if parts of the body are used for transplants or research?', only in extreme cases will their be a problem) I don't know who's really to blame.\n \n However to ban it completely, especially if its mainly due to a misunderstanding of policy or options I would see as worse. But yes, it should certainly be like organ donation.", 
   {}, 
   128508, 
   null, 
   1117062960.0
  ], 
  [
   128510, 
   null, 
   "FISHX", 
   "I totally agree that it should be more like the organ donor system, though I think a lot of the controversy arises where families of patients have signed away more than they thought (as was the case in the UK, it was legal because the families had actually allowed it not really thinking about it). Having never been in the situation (and hopefully never either), I have no idea how confusing or misleading (not intentionally, I think its due to there being a standard question like 'do you mind if parts of the body are used for transplants or research?', only in extreme cases will their be a problem) I don't know who's really to blame.\n \n However to ban it completely, especially if its mainly due to a misunderstanding of policy or options I would see as worse. But yes, it should certainly be like organ donation.\n\n \n \n I can tell you for a fact that it was nothing to do with the consent form i wasn't even asked to sign one it is basicaly the lowest crime to humanity that could ever be commited i just wish it was a crime to steal bodies as it is to steal from a body.\n As for making it illegal i think it should have been illegal all along i am pretty sure that body snatching was illegal in the 1800's just a shame it isn't now.", 
   {}, 
   128509, 
   null, 
   1117063260.0
  ], 
  [
   128512, 
   null, 
   "Tastyfish", 
   "While I can't speak for your case personally, the ones mentioned in your links were in the UK fairly recently (couple of years ago or so) and while there was a bit of hubub at the time, it turns out that the hosptials do tell you want happens when a body is given to their possesion, it becomes theres and they follow their normal policy regardless of how old it is. Its just unusual and emotive that it was fetuses involved.\n \n Are you saying that you had a child die and then never had the body returned, or did you have an abortion and then want to body to bury? Whilst the former is pretty much inexcusable without some kind of consent the latter is on slightly more shaky ground (mainly because of time most abortions are carried out). Without knowing the vague details of what is going on in a specific case regarding to a situation that is as varied as it can be you can't really form an opinion. The first article you posted, while it might resonate with you looks so full of factual errors, if not outright fabricated seems a far worse crime for trying to prey on your tragic experiences to villify people for something that I strongly suspect they never did.", 
   {}, 
   128510, 
   null, 
   1117063740.0
  ], 
  [
   128515, 
   null, 
   "FISHX", 
   "While I can't speak for your case personally, the ones mentioned in your links were in the UK fairly recently (couple of years ago or so) and while there was a bit of hubub at the time, it turns out that the hosptials do tell you want happens when a body is given to their possesion, it becomes theres and they follow their normal policy regardless of how old it is. Its just unusual and emotive that it was fetuses involved.\n \n Are you saying that you had a child die and then never had the body returned, or did you have an abortion and then want to body to bury? Whilst the former is pretty much inexcusable without some kind of consent the latter is on slightly more shaky ground (mainly because of time most abortions are carried out). Without knowing the vague details of what is going on in a specific case regarding to a situation that is as varied as it can be you can't really form an opinion. The first article you posted, while it might resonate with you looks so full of factual errors, if not outright fabricated seems a far worse crime for trying to prey on your tragic experiences to villify people for something that I strongly suspect they never did.\n\n \n \n No i didn't terminate i had a still born son i specificely requested that i had his body returned to me there is a record of him being picked up by the coroner and there the trail ends for now.\n \n The reason i am more inclined to beleive that there is a market out there for limbs and organs is because this country has been selling bodie parts for well over a 25 years it all startet at prestwich hospital and it was all brought to light with the case of Ciryl mark issacs.\n This isn't something new that has only just started in the support organisation S.T.O.R.M. there are parents that have been looking for their children for 20 years this is real it is now and it is time that everybody knew the true horrors of what the new medical advances cost.", 
   {}, 
   128512, 
   null, 
   1117064340.0
  ], 
  [
   128517, 
   null, 
   "Tastyfish", 
   "Well I wouldn't class that as a true horror I'm afraid, just a beaurocratic screw up. Its unfortunate I'll agree and distressing for those involved, but there are far worse things out there that benefit more from the title of 'true horror'. You have my sympathy though, and I'd agree that if your system doesn't have the parents having the final word over what happens to their baby, still birth or not then the law needs to be changed. Just an outright ban I would be against.", 
   {}, 
   128515, 
   null, 
   1117064760.0
  ], 
  [
   128682, 
   null, 
   "foreverblue", 
   "\n \n Anyway, I honestly don't really see a problem with salvaging things from the dead that are going to benefit the rest of mankind. It sounds icky, and is to a degree but seems better than feeding them to maggots or just burning them\n.\n \n \n This is the most obscene,disgusting and down right vilest thing i have ever had the misfortune to come across.Do you watch the news or read the papers,because it was all over the national news and the papers so much in fact that the goverment set up an inquiry,and a commitee to deal with it.\n To say my sons body was salvage is bang out of order and i would thank you to think about the effect that your uncaring words have on people.\n \n How long have been on this board,because it is all over the place that fishx{my wife} is staunchly pro life and it would of been more helpful for your case than asking such a stupid question as to ask if she had had an abortion.\n You live in good old blighty and yet claim no knowledge of what was going on do you not remember alder hey childrens hospital.The system you are discussing is the same system that you live under,it was hope hospital in salford that took my babys body and never returned it.", 
   {}, 
   128503, 
   null, 
   1117116060.0
  ], 
  [
   129089, 
   null, 
   "xeiah", 
   "This is a matter that i hold very close to my heart just wondered what everyone elses opinion is of the barbaric way these baby's are treated even after death.\n \n \n \n http://www.ashevilletribune.com/in_their_words.htm\n\n \n \n This is not what hospitals do with biomedical waste. They incinerate it. \n \n If these people are really doing this I can\"t imagine who the buyer is , and they are breaking many many laws.", 
   {}, 
   128457, 
   null, 
   1117165620.0
  ], 
  [
   129092, 
   null, 
   "Tastyfish", 
   ".\n \n \n This is the most obscene,disgusting and down right vilest thing i have ever had the misfortune to come across.Do you watch the news or read the papers,because it was all over the national news and the papers so much in fact that the goverment set up an inquiry,and a commitee to deal with it.\n To say my sons body was salvage is bang out of order and i would thank you to think about the effect that your uncaring words have on people.\n \n How long have been on this board,because it is all over the place that fishx{my wife} is staunchly pro life and it would of been more helpful for your case than asking such a stupid question as to ask if she had had an abortion.\n You live in good old blighty and yet claim no knowledge of what was going on do you not remember alder hey childrens hospital.The system you are discussing is the same system that you live under,it was hope hospital in salford that took my babys body and never returned it.\n\n \n It was in the news for a while and I'm pretty sure the inquiry found that it was a terrible misfortune based on miscommunication between the hospital and the parents. There was no selling of stolen dead babies for profit type of business going on with is what Fishx implies with the first post.\n \n Sorry, didn't mean to offend there but I still think its better than another baby has a chance to live than pretty much anything with respect to the desceased. If it happened to me I would have no problem at all about any of my organs being used to save lives, either directly or indirectly through training of more doctors or research. Yet, I still respect your wishes and said before that if this is going to happen it should certainly be cleared with the parents first. You're just going to have to accept my appologies and realise that I have no idea what you went through, having not been there myself.\n \n Being in an abortion forum, and the nature of the first post it seemed very quite possible that Fishx had had an abortion, though regretted it and wanted the remains to bury - this is a very different case than the one you have unfortunately experienced, hence the question.", 
   {}, 
   128682, 
   null, 
   1117166340.0
  ], 
  [
   129197, 
   null, 
   "FISHX", 
   "This is not what hospitals do with biomedical waste. They incinerate it. \n \n If these people are really doing this I can\"t imagine who the buyer is , and they are breaking many many laws.\n\n \n \n Sorry to shatter you little world but this is happening it has been happening 25 years and it is happening now and it is completly legal no laws have been broken and yes there is a market for fetal tissue /limbs and bodies.\n \n Do some research you will be surprised what you will find.", 
   {}, 
   129089, 
   null, 
   1117195200.0
  ], 
  [
   129202, 
   null, 
   "Clive14", 
   "Sorry to shatter you little world but this is happening it has been happening 25 years and it is happening now and it is completly legal no laws have been broken and yes there is a market for fetal tissue /limbs and bodies.\n \n Do some research you will be surprised what you will find.\nI reckon the parts go to feed the scree-fise that are secretly taking over the world (http://www.azathot.com/oddities/sh/main.html). Drink mango tea and your babies will be safe then! emoticon_rolleyes", 
   {}, 
   129197, 
   null, 
   1117199880.0
  ], 
  [
   129214, 
   null, 
   "Steeeeve", 
   "....or cool aid", 
   {}, 
   129202, 
   null, 
   1117201860.0
  ], 
  [
   129333, 
   null, 
   "09dragonfly06", 
   "When we started to study fetal anatomy in my college anatomy class we were taken into a laboratory with 10 jars lined up on the table. 1-9 were all the stages of fetal development (actual specimes, not plastic, not fake) in jar ten there was an was fetus with anencephally. It was horrible to look at. I and a few other people had to leave because it was so awful. I don't know where they came or how they obtained them.", 
   {}, 
   129202, 
   null, 
   1117219800.0
  ], 
  [
   129336, 
   null, 
   "FISHX", 
   "Great to see you over here Dragonfly it is much better than the other place not so many Trolls make sure you pass word to the others would be great to see them over here where we can debate in peace and civility. :) :) :)", 
   {}, 
   129333, 
   null, 
   1117220100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How could they?", 
  "url": "http://www.4forums.com/political/abortion-debates/5402-how-could-they.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 5402, 
  "discussion_files": [
   [
    "29901.html", 
    "http://www.4forums.com/political/abortion-debates/5402-how-could-they-print.html"
   ], 
   [
    "29902.html", 
    "http://www.4forums.com/political/abortion-debates/5402-how-could-they-2-print.html"
   ]
  ], 
  "identifier": 5402
 }
]