[
 [
  [
   128532, 
   null, 
   "Artemis", 
   "Peddler has now repeatedly ignored my post pointing out that he actually does believe in evolution, so let me repeat the gist: Peddler said that Neanderthals were Sapiens, I said they looked different (skulls) and he said that the skull shape had changed over time. Let me just remind you that evolution is defined as the change in genetic makeup of a population over time...\n \n -----------------------------------------------------------------------\n \n That being said, I'm going to walk through this step by step:\n \n Why Peddler Believes in Evolution \n \n 1. Given blond parents have blond children.\n \n 2. Suppose that all the non-blond people in the world suddenly decided to not reproduce with blond people.\n \n 3. Conclude there would, eventually, be no blond people left in the world.\n \n 4. Given sexual selection is roughly defined as choosing of/competition for mates.\n \n 5. Given the sexual selection theory falls under the category of natural selection.\n \n 6. Given the natural selection theory is a fundamental tenet of evolution.\n \n 7. Given that evolution is defined as the change of the makeup of a population over time.\n \n 8. Conclude humanity, having chosen against the blond gene, has sexually selected non-blonds.\n \n 9. Conclude humanity, having bred out the blond gene, has selected out blonds.\n \n 10. Conclude humanity, having gone from a population with some of the blond gene to selecting out the blond gene and having a wholly non-blond population, has changed over time.\n \n 11. Conclude humanity has evolved.", 
   {
    "post_info": {
     "post_title": "Step By Step"
    }
   }, 
   null, 
   null, 
   1117067580.0
  ], 
  [
   128537, 
   null, 
   "Redratio1", 
   "Peddler ALSO says he doesn't believe in macroevolution, but agrees with the idea of speciation.\n \n Speciation where two distict populations genetically drift apart far enough that they cannot inter-breed.\n \n That's is the basis of macroevolution.", 
   {}, 
   128532, 
   null, 
   1117068600.0
  ], 
  [
   128889, 
   null, 
   "gnojek", 
   "And I've seen allusion to the rapid speciation that would be needed for primordial \"Ark kinds\" to change into all the species we see today. Not only is this evolution, but it's evolution at a pace not even evolutionists can imagine.", 
   {}, 
   128537, 
   null, 
   1117138800.0
  ], 
  [
   128909, 
   null, 
   "Duo_Maxwell", 
   "Peddler ALSO says he doesn't believe in macroevolution, but agrees with the idea of speciation.\n \n Speciation where two distict populations genetically drift apart far enough that they cannot inter-breed.\n \n That's is the basis of macroevolution.\n\n \n Ah, but you forget, he only does that when it suits him and he has litterally made up his own definition of what speciation is. \n \n Peddler believes evolution is wrong, but the evolution he thinks is wrong is the one of his own design.", 
   {}, 
   128537, 
   null, 
   1117140120.0
  ], 
  [
   129293, 
   null, 
   "Artemis", 
   "I get the impression Peddler has me on his ignore list, too. Fascinating, because I've made a total of 6 posts, all but this one directed at him, and he has only responded to one, and when I followed up to further prove him wrong he did not respond. A later post regarding shades of grey in debate he also did not respond to.\n \n I think he ignored me the moment I appeared.\n \n If Peddler does not respond to this thread, we can infer that he has put me on his ignore list, and further infer that he is backing out because he can't handle two good points made against him.\n \n Peddler8111: Respond for the sake of your own dignity, or else the rest of us should feel no need not to ignore you either. If you do respond, I will thank you for doing so and affirm that you are not backing out.", 
   {}, 
   128909, 
   null, 
   1117217100.0
  ], 
  [
   129314, 
   null, 
   "trebor", 
   "I get the impression Peddler has me on his ignore list, too. Fascinating, because I've made a total of 6 posts, all but this one directed at him, and he has only responded to one, and when I followed up to further prove him wrong he did not respond. A later post regarding shades of grey in debate he also did not respond to.\n \n I think he ignored me the moment I appeared.\n \n If Peddler does not respond to this thread, we can infer that he has put me on his ignore list, and further infer that he is backing out because he can't handle two good points made against him.\n \n Peddler8111: Respond for the sake of your own dignity, or else the rest of us should feel no need not to ignore you either. If you do respond, I will thank you for doing so and affirm that you are not backing out.\n\n \n Even when he reads something, he seems to ignore what it actually says.", 
   {}, 
   129293, 
   null, 
   1117218420.0
  ], 
  [
   129697, 
   null, 
   "Beowulf Lee", 
   "We DID learn about selective hearing in health class.", 
   {}, 
   129314, 
   null, 
   1117303440.0
  ], 
  [
   129800, 
   null, 
   "canadianman77", 
   "You shouldnt be so hard on the mentally disabled (Im not mentioning peddlers name) emoticon_rolleyes \n Would you kick the kane out from under an old mans hand, or throw a quadrapelegic out of his/her wheelchair? I think not! You should not be so hard on piddler, he isnt so smart and you should not discourage him from trying to fit in with those of us who have a brain in our head.", 
   {}, 
   129697, 
   null, 
   1117339140.0
  ], 
  [
   130022, 
   null, 
   "Duo_Maxwell", 
   "IMO, peddler's behavior is similar to that of christians who preach fire and brimestone and have no tolerance for other religions: Peddler's behaviors reflect badly upon the whole of creation.", 
   {}, 
   129800, 
   null, 
   1117400760.0
  ], 
  [
   130032, 
   null, 
   "Artemis", 
   "Hmm, I think this public insulting should stop (even though I think he's brought it upon himself). The purpose of this thread is to challenge a glaring hypocrisy in the Creationist viewpoint. I only ask that Peddler respond to my claims; should he have placed me on ignore, so be it.\n \n Peddler, respond now or I will assume you have \"ignored\" me and use this as proof of your inability to respond to more than 1 of as little as 7 points.\n \n The rest of you, play nice.", 
   {}, 
   130022, 
   null, 
   1117402380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Step By Step", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5403-step-step.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 5403, 
  "discussion_files": [
   [
    "3965.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5403-step-step-print.html"
   ]
  ], 
  "identifier": 5403
 }
]