[
 [
  [
   128738, 
   null, 
   "Missouri Mule", 
   "One of the reasons we are in Iraq. Iran is the prize. We got to this mess because of Jimmah Carter who rolled over for the terrorists and are still paying for his appeasement 26 years later. This is the kind of information that Bush was working from when he made his decision to remove Saddam. We had to be next door to remove the regime of Iran and it will go, sooner or later; the worst terrorist regime in the world.\n =====================\n \n Tehran's Terror Master \n By Patrick Devenny\n FrontPageMagazine.com | May 26, 2005\n \n Early on the morning of March 16th, 1984, William Buckley left for work at the American embassy in Beirut, Lebanon. Officially, Mr. Buckley, a decorated veteran of the Special Forces, served as the political officer at the embassy. In reality, however, Mr. Buckley was the embassy's CIA station chief. On his way to the compound, Buckley's car was stopped by a group of masked men, who forced him from his car at gunpoint. His assailants would later be identified as terrorists from the group Islamic Jihad, which served as an alias for the real perpetrators, Hezbollah. The circumstances surrounding the next 15 months of William Buckley's life remain mysterious to this day. Hints of his plight were provided in disturbing video tapes, in which he appeared worn down and brutalized. It was later revealed that additional tapes were shot showing the CIA station chief being viciously tortured and beaten by Islamic Jihad members. Finally, sometime in October of 1985, Buckley died of pneumonia, no doubt stemming from the lengthy torture sessions. His main interrogator and tormentor was a 21 year old Lebanese terrorist named Imad Mugniyah.\n \n Twenty years later, the butcher of William Buckley still plagues the free world. Imad Mugniyah is the current military commander of the terrorist group Hezbollah, overseeing an international organization which some American officials have dubbed \"the A-team of terrorism.\" Far less well known than his compatriot and sometimes partner Osama Bin Laden, Mugniyah is arguably more dangerous. Indeed, before the 9-11 attacks, Mugniyah was the prime focus of American anti-terror efforts, not Bin Laden. Comfortable in his anonymity, Mugniyah has successfully carried out some of the most professional terrorist attacks of the last two decades against a wide array of international targets. With Hezbollah currently flexing its muscle as a political force inside Lebanon, it would behoove Americans to remember that the leadership of this so-called \"political\" organization remains in the hands of dangerous extremists who think nothing of slaughtering hundreds of people at the behest of their masters in Tehran. Mugniyah's very existence casts doubt on the idea that Hezbollah could ever be an honest participant in a future Lebanese democracy. \n \n Origins\n \n While the face of Bin Laden has been prominently featured in every world publication of note and is almost instantly recognizable, the real face of Imad Mugniyah is elusive. Only two or three photographs of the Hezbollah operative are known to exist. Further accentuating the mystery around Mugniyah is the fact that the picture that currently serves as the U.S. Government's official wanted poster is almost 20 years old...\n \n (Snip)\n \n http://www.frontpagemag.com/Articles/ReadArticle.asp?ID=18188", 
   {
    "post_info": {
     "post_title": "Tehran's Terror Master"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1117123560.0
  ], 
  [
   128867, 
   null, 
   "Kronus", 
   "One of the reasons we are in Iraq. Iran is the prize. \n\n \n We invaded Iraq because we want to invade Iran? That's the stupidest thing I've heard. Which isn't to say that it isn't what Bush was thinking. That sort of \"planning\" would be about on par with what we've seen so far.\n \n We are now so bogged down in Iraq and Afghanistan that we couldn't invade Lichtenstien if we wanted to, never mind Iran. And everyone in the world knows it. That's part of the reason that Iran and North Korea are flaunting their growing nuclear capabilities, they know we can't do anything about it. Bush got us into a war that we didn't need, with no exit strategy, and now we can't respond to real threats.", 
   {}, 
   128738, 
   null, 
   1117137480.0
  ], 
  [
   128973, 
   null, 
   "georged", 
   "We invaded Iraq because we want to invade Iran? That's the stupidest thing I've heard. Which isn't to say that it isn't what Bush was thinking. That sort of \"planning\" would be about on par with what we've seen so far.\n \n We are now so bogged down in Iraq and Afghanistan that we couldn't invade Lichtenstien if we wanted to, never mind Iran. And everyone in the world knows it. That's part of the reason that Iran and North Korea are flaunting their growing nuclear capabilities, they know we can't do anything about it. Bush got us into a war that we didn't need, with no exit strategy, and now we can't respond to real threats.\n\n \n And we're bleeding out our national wealth on that folly faster than one could say the Shah of Iran.", 
   {}, 
   128867, 
   null, 
   1117146120.0
  ], 
  [
   129014, 
   null, 
   "Missouri Mule", 
   "We invaded Iraq because we want to invade Iran?  That's the stupidest thing I've heard. Which isn't to say that it isn't what Bush was thinking. That sort of \"planning\" would be about on par with what we've seen so far.\n \n We are now so bogged down in Iraq and Afghanistan that we couldn't invade Lichtenstien if we wanted to, never mind Iran. And everyone in the world knows it. That's part of the reason that Iran and North Korea are flaunting their growing nuclear capabilities, they know we can't do anything about it. Bush got us into a war that we didn't need, with no exit strategy, and now we can't respond to real threats.\n\n \n It is necessary to have a staging base. Better than having to operate off of aircraft carriers. That just limits the attack by air. You need boots on the ground.", 
   {}, 
   128867, 
   null, 
   1117150860.0
  ], 
  [
   129016, 
   null, 
   "Missouri Mule", 
   "And we're bleeding out our national wealth on that folly faster than one could say the Shah of Iran.\n\n \n Hardly, you should check what our deficits were in WWII. We can handle this war with ease.", 
   {}, 
   128973, 
   null, 
   1117150920.0
  ], 
  [
   129030, 
   null, 
   "Kronus", 
   "It is necessary to have a staging base. Better than having to operate off of aircraft carriers. That just limits the attack by air. You need boots on the ground.\n\n \n Well, considering that we were already in Afghanistan, which also shares a border with Iran, invading a second country to get a staging base would be really, really, stupid. Again, not saying that's not what Bush is thinking. Just saying that it's stupid.", 
   {}, 
   129014, 
   null, 
   1117154160.0
  ], 
  [
   129038, 
   null, 
   "Kronus", 
   "And we're bleeding out our national wealth on that folly faster than one could say the Shah of Iran.\n\n \n That's actually part of the point. Bush wants the country to run out of funds. Here's how it works. First, bankrupt the country. Then, say that you don't have enough money for those pesky liberal things like welfare and social security. The fact that people don't actully want our senior citizens living off of cat food is sort of lost on him.", 
   {}, 
   128973, 
   null, 
   1117155000.0
  ], 
  [
   129087, 
   null, 
   "georged", 
   "That's actually part of the point. Bush wants the country to run out of funds. Here's how it works. First, bankrupt the country. Then, say that you don't have enough money for those pesky liberal things like welfare and social security. The fact that people don't actully want our senior citizens living off of cat food is sort of lost on him.\n\n \n I find it very funny that people compare our post-WW2 industrial capability with zero global competition to present circumstances. Now that's stupid.", 
   {}, 
   129038, 
   null, 
   1117165320.0
  ], 
  [
   129265, 
   null, 
   "SteveRogers", 
   "That reason sounds as good as any actually put forth by the adminstration, but such would immoral and worthy of war crimes charges. \n \n Of course, had we dealt fairly with Iran from the beginning instead of supporting brutal dictators like the shah of Iran, we probably would have a good ally their. That said, too much is accepted about those bad Iranians when in fact they would mellow and younger blood would change the country from within over time if we simply let them.", 
   {}, 
   129087, 
   null, 
   1117215120.0
  ], 
  [
   129312, 
   null, 
   "Missouri Mule", 
   "That reason sounds as good as any actually put forth by the adminstration, but such would immoral and worthy of war crimes charges. \n \n Of course, had we dealt fairly with Iran from the beginning instead of supporting brutal dictators like the shah of Iran, we probably would have a good ally their. That said, too much is accepted about those bad Iranians when in fact they would mellow and younger blood would change the country from within over time if we simply let them.\n\n \n After they get the bomb? After NYC is reduced to a nuclear ash? You've a lot of faith in their good intentions. I don't.", 
   {}, 
   129265, 
   null, 
   1117218300.0
  ], 
  [
   129420, 
   null, 
   "SteveRogers", 
   "After they get the bomb? After NYC is reduced to a nuclear ash? You've a lot of faith in their good intentions. I don't.\n\n \n Who Iran? Why would Iran bomb NewYork? You realize the minute any nation actually did such, that nation becomes a parking lot. All them having nuks would do, something we encourage with our aggression BTW, is allow Iran to force its way to the table. It would limit US dictates, not eliminate, but limit, reduce. \n \n As I have said, you are too afraid and you let that fear effect your judgement.", 
   {}, 
   129312, 
   null, 
   1117229640.0
  ], 
  [
   129430, 
   null, 
   "Desaix", 
   "One of the reasons we are in Iraq. Iran is the prize. \n \n \n emoticon_rolleyes I suggest you read Friedman more carefully in the future.If you did read him closely you would realise that Iran doesn't support terrorists that want to start a bombing campaign in America,that Iran-US relations are relatively good,that the US army is already too stretched,that if Afghanistan was invaded quite clearly Iran could be invaded,indeed with greater ease,that if Iran was invaded Iraq would absolutely explode and that there is no reason,currently,for the US to invade Iran.None.\n \n BTW,i find your attempt to support sending the US army,the youth and future of America,into every country in the world simply on the weakest logic and proof fascinating.'Support the troops' by throwing away there life on pointless ventures isn't the sign of a patriot.", 
   {}, 
   128738, 
   null, 
   1117232040.0
  ], 
  [
   129467, 
   null, 
   "Missouri Mule", 
   "emoticon_rolleyes I suggest you read Friedman more carefully in the future.If you did read him closely you would realise that Iran doesn't support terrorists that want to start a bombing campaign in America,that Iran-US relations are relatively good,that the US army is already too stretched,that if Afghanistan was invaded quite clearly Iran could be invaded,indeed with greater ease,that if Iran was invaded Iraq would absolutely explode and that there is no reason,currently,for the US to invade Iran.None.\n \n BTW,i find your attempt to support sending the US army,the youth and future of America,into every country in the world simply on the weakest logic and proof fascinating.'Support the troops' by throwing away there life on pointless ventures isn't the sign of a patriot.\n\n \n Friedman occasionally has gems of wisdom. He also has moments of extreme stupidity. \n \n To believe that our relations with Iran are \"good\" is to turn logic on its head. They are horrible and have been since the mad mullahs took over in 1979.", 
   {}, 
   129430, 
   null, 
   1117237800.0
  ], 
  [
   129470, 
   null, 
   "Missouri Mule", 
   "Who Iran? Why would Iran bomb NewYork? You realize the minute any nation actually did such, that nation becomes a parking lot. All them having nuks would do, something we encourage with our aggression BTW, is allow Iran to force its way to the table. It would limit US dictates, not eliminate, but limit, reduce. \n \n As I have said, you are too afraid and you let that fear effect your judgement.\n\n \n Your logic depends on our waiting for NYC to be reduced to a radioactive parking lot and that Iran would be immediately indentified as the perpetrator. They have been involved in state sponsorship of terrorism since the 1980s. They would dearly love nothing better than to bring down the \"Great Satan.\"", 
   {}, 
   129420, 
   null, 
   1117237920.0
  ], 
  [
   129493, 
   null, 
   "Desaix", 
   "Friedman occasionally has gems of wisdom. He also has moments of extreme stupidity. \n \n To believe that our relations with Iran are \"good\" is to turn logic on its head. They are horrible and have been since the mad mullahs took over in 1979.\n\n \n Considering that Iran is a 'rogue state' the relations between both countries were good and benficial to both sides.Why I have I got a feeling you ignored the parts in the book that you didn't want to believe?\n \n BNTW,i said a little bit more in my post then you adressed.Like a US invasion being illogical and irrational.", 
   {}, 
   129467, 
   null, 
   1117241400.0
  ], 
  [
   129494, 
   null, 
   "Missouri Mule", 
   "Considering that Iran is a 'rogue state' the relations between both countries were good and benficial to both sides.Why I have I got a feeling you ignored the parts in the book that you didn't want to believe?\n \n BNTW,i said a little bit more in my post then you adressed.Like a US invasion being illogical and irrational.\n\n \n Self-defense is never illogical or irrational. In fact, Florida has recently passed and enacted legislation that will allow a homeowner to take proactive action to blow someone away if they are threatening you or pose a threat to your well-being. I think we should have killed that Iranian revolution in its cradle and we would have spared ourselves all of the problems that we had during the 1980s with Hezbollah.", 
   {}, 
   129493, 
   null, 
   1117241640.0
  ], 
  [
   129501, 
   null, 
   "gnojek", 
   "'Support the troops' by throwing away there life on pointless ventures isn't the sign of a patriot.\n\n Have you seen those ribbons that say \"Support Their Civilians\" ?", 
   {}, 
   129430, 
   null, 
   1117242300.0
  ], 
  [
   129502, 
   null, 
   "Desaix", 
   "Have you seen those ribbons that say \"Support Their Civilians\" ?\n\n \n Not over here no but i've heard about them.Seem like cheap propaganda.Why do you ask?\n \n \nSelf-defense is never illogical or irrational. In fact, Florida has recently passed and enacted legislation that will allow a homeowner to take proactive action to blow someone away if they are threatening you or pose a threat to your well-being. I think we should have killed that Iranian revolution in its cradle and we would have spared ourselves all of the problems that we had during the 1980s with Hezbollah.\n\n \n Let me get this correct-The US is exercising its right to self defense by invading islaic and proud counties with huge populations that support and fund groups that do not want to attack the US?Should the US invade N.Ireland,N.Spain,Sri Lanka,Colombia etc as well?This is truly propesterous.", 
   {}, 
   129501, 
   null, 
   1117242660.0
  ], 
  [
   129508, 
   null, 
   "Missouri Mule", 
   "Not over here no but i've heard about them.Seem like cheap propaganda.Why do you ask?\n \n \n \n Let me get this correct-The US is exercising its right to self defense by invading islaic and proud counties with huge populations that support and fund groups that do not want to attack the US?Should the US invade N.Ireland,N.Spain,Sri Lanka,Colombia etc as well?This is truly propesterous.\n\n \n Permit to state that your comparison is \"preposterous.\" None of these nations are terrorist supporting regimes.", 
   {}, 
   129502, 
   null, 
   1117243440.0
  ], 
  [
   129509, 
   null, 
   "georged", 
   "Not over here no but i've heard about them.Seem like cheap propaganda.Why do you ask?\n \n \n \n Let me get this correct-The US is exercising its right to self defense by invading islaic and proud counties with huge populations that support and fund groups that do not want to attack the US?Should the US invade N.Ireland,N.Spain,Sri Lanka,Colombia etc as well?This is truly propesterous.\n\n \n We already have effective control over Columbia complete with US Military 'advisors' under the guise of 'War on Drugs', the earlier S. American version of 'War on Terror', so take that one off the list. Blaming other countries for our own problems is far easier and more palatable to the US public than internal solutions. Watch your back.", 
   {}, 
   129502, 
   null, 
   1117243560.0
  ], 
  [
   129511, 
   null, 
   "Desaix", 
   "Permit to state that your comparison is \"preposterous.\" None of these nations are terrorist supporting regimes.\n\n \n No but these states contain terror groups that have no reason and will not attack the US homeland.The comparison still stands.Iran is no danger to the US.Hizbollah is no danger to the US.An invasion of Iran would lead to chaos among the Iraqi Shia's.\n \n Anyway it could still be argued that Colombia and Sri Lanka do indeed support terror groups and allow terror tactics among there governments.As does Russia and dozens of other countries.", 
   {}, 
   129508, 
   null, 
   1117243860.0
  ], 
  [
   129581, 
   null, 
   "SteveRogers", 
   "Your logic depends on our waiting for NYC to be reduced to a radioactive parking lot and that Iran would be immediately indentified as the perpetrator. They have been involved in state sponsorship of terrorism since the 1980s. They would dearly love nothing better than to bring down the \"Great Satan.\"\n\n \n Do you hear the fear in your typing? You are so scared you'd do almost anything except reason out the likelihood and risk being a good and free people who act on facts and not fears. \n \n I mean listen to yourself. There is no reason to believe the nation of Iran would nuk NYC. If you are going to make such outlandish claims, at least try to support them. Fear alone doesn't support anything. emoticon_xchicken emoticon_xdonno :xbanghead", 
   {}, 
   129470, 
   null, 
   1117260600.0
  ], 
  [
   129587, 
   null, 
   "Missouri Mule", 
   "No but these states contain terror groups that have no reason and will not attack the US homeland.The comparison still stands.Iran is no danger to the US.Hizbollah is no danger to the US.An invasion of Iran would lead to chaos among the Iraqi Shia's.\n \n Anyway it could still be argued that Colombia and Sri Lanka do indeed support terror groups and allow terror tactics among there governments.As does Russia and dozens of other countries.\n\n \n I don't believe I have said anything about invading Iran -- ever. In my view a few well placed nuclear bunker busters will get the job done. We cannot permit this gangster regime to ever get the nuclear bomb.\n \n And you are so far wrong about Hezbollah not being a danger to the U.S. it is frightening. If most people are this unaware of the murders and mayhem that these thugs have committed on mankind since the founding of the Islamic \"Republic\" of Iran they would be astounded. Like those 241 Marines in Beirut for example; or all of those diplomats and agents murdered in Lebanon during the 1980s. Hezbollah has been designated a terror group for decades by the U.S. And Iran funds it.\n \n (CBS) This is what deputy secretary of state Richard Armitage had in mind a few months ago when he pinned this label on Hezbollah.\n \n \"Hezbollah may be the 'A-Team of Terrorists' and maybe al-Qaeda is actually the 'B' team. And they're on the list and their time will come,\" says Armitage. \"There is no question about it - it's all in good time. And we're going to go after these problems just like a high school wrestler goes after a match. We're going to take them down one at a time.\"... \n \n \n (Snip)\n \n http://www.cbsnews.com/stories/2003/04/18/60minutes/main550000.shtml", 
   {
    "unicode_changes_made": true
   }, 
   129511, 
   null, 
   1117260840.0
  ], 
  [
   129596, 
   null, 
   "SteveRogers", 
   " . . . it is frightening. \n \n \n\n \n That's ok. IN a few years the grown ups will be back and some real work can be done. ;)", 
   {}, 
   129587, 
   null, 
   1117261320.0
  ], 
  [
   129603, 
   null, 
   "Missouri Mule", 
   "That's ok. IN a few years the grown ups will be back and some real work can be done. ;)\n\n \n Not likely to change if you mean the U.S. government regardless of which party wins. No politician can stand aside and let a major American city be reduced to a nuclear ash. If anything the next president will be even more determined to rid the world of Iran's thugocracy. Whoever it is will be reading the same intelligence reports that Bush has been reading.", 
   {}, 
   129596, 
   null, 
   1117262820.0
  ], 
  [
   129708, 
   null, 
   "Desaix", 
   "I don't believe I have said anything about invading Iran -- ever. In my view a few well placed nuclear bunker busters will get the job done. We cannot permit this gangster regime to ever get the nuclear bomb.\n\n \n Well then why would Iran be the prize of occuping Iraq if some Isreali bombs or US bombs from Afghanistan can sort out the Iranian problem? emoticon_rolleyes \n \n \nAnd you are so far wrong about Hezbollah not being a danger to the U.S. it is frightening. If most people are this unaware of the murders and mayhem that these thugs have committed on mankind since the founding of the Islamic \"Republic\" of Iran they would be astounded. Like those 241 Marines in Beirut for example; or all of those diplomats and agents murdered in Lebanon during the 1980s. Hezbollah has been designated a terror group for decades by the U.S. And Iran funds it.[I]\n\n \n Theres a difference between bombing a US base in Lebanon and bombing a US city.A blindingly obvious one.Hizbollah has never tried to bomb the US,has no reason to bomb the US and quite clearly if the US admin believed Hizbollah was about to strike in the US,then the US admin would have done more then put sanctions on Hizbollah.Simply because an Islamic organistion has the ability to strike the US desn't mean it will if its not in there interest to do so.Although i doubt you'll agree with that. emoticon_rolleyes", 
   {}, 
   129587, 
   null, 
   1117305540.0
  ], 
  [
   129719, 
   null, 
   "Missouri Mule", 
   "Well then why would Iran be the prize of occuping Iraq if some Isreali bombs or US bombs from Afghanistan can sort out the Iranian problem? emoticon_rolleyes \n \n Theres a difference between bombing a US base in Lebanon and bombing a US city.A blindingly obvious one.Hizbollah has never tried to bomb the US,has no reason to bomb the US and quite clearly if the US admin believed Hizbollah was about to strike in the US,then the US admin would have done more then put sanctions on Hizbollah.Simply because an Islamic organistion has the ability to strike the US desn't mean it will if its not in there interest to do so.Although i doubt you'll agree with that. emoticon_rolleyes\n\n \n I don't believe the logistics of operating out of Afghanistan would work nearly as well as operating from Iraq. In any event the timing would not have been fully ripe as it is now coming to be.\n \n I don't make a huge distinction between bombing the U.S. mainland or attacking large numbers of Americans as happened in Beirut. That was purely an Iranian operation. \n \n It really comes down to this. American and Iran (the government) are incompatible in this world. One of the two of our governments is going to be dismantled. I'll leave the rest up to your imagination.", 
   {}, 
   129708, 
   null, 
   1117306680.0
  ], 
  [
   129812, 
   null, 
   "SteveRogers", 
   "Not likely to change if you mean the U.S. government regardless of which party wins. No politician can stand aside and let a major American city be reduced to a nuclear ash. If anything the next president will be even more determined to rid the world of Iran's thugocracy. Whoever it is will be reading the same intelligence reports that Bush has been reading.\n\n \n The difference is there are people who act out of reason and with proper evidence and not out of fear. So, yeah, I think there will be a difference even if another republican gets in.", 
   {}, 
   129603, 
   null, 
   1117342800.0
  ], 
  [
   129824, 
   null, 
   "Missouri Mule", 
   "The difference is there are people who act out of reason and with proper evidence and not out of fear. So, yeah, I think there will be a difference even if another republican gets in.\n\n \n I've not heard of any major candidate of either party who is claiming that going into Iraq was a \"mistake.\" So you may have to wait a while.", 
   {}, 
   129812, 
   null, 
   1117345500.0
  ], 
  [
   129840, 
   null, 
   "SteveRogers", 
   "I've not heard of any major candidate of either party who is claiming that going into Iraq was a \"mistake.\" So you may have to wait a while.\n\n \n Because you haven't heard it means very little. You will.", 
   {}, 
   129824, 
   null, 
   1117351740.0
  ], 
  [
   129906, 
   null, 
   "Missouri Mule", 
   "Because you haven't heard it means very little. You will.\n\n \n I won't hold my breath.", 
   {}, 
   129840, 
   null, 
   1117387260.0
  ], 
  [
   129908, 
   null, 
   "SteveRogers", 
   "I won't hold my breath.\n\n \n emoticon_rolleyes But you will all the same. ;)", 
   {}, 
   129906, 
   null, 
   1117387620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Tehran's Terror Master", 
  "url": "http://www.4forums.com/political/peace-middle-east/5410-tehrans-terror-master.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5410, 
  "discussion_files": [
   [
    "4231.html", 
    "http://www.4forums.com/political/peace-middle-east/5410-tehrans-terror-master-print.html"
   ], 
   [
    "4232.html", 
    "http://www.4forums.com/political/peace-middle-east/5410-tehrans-terror-master-3-print.html"
   ], 
   [
    "4233.html", 
    "http://www.4forums.com/political/peace-middle-east/5410-tehrans-terror-master-2-print.html"
   ]
  ], 
  "identifier": 5410
 }
]