[
 [
  [
   128771, 
   null, 
   "georged", 
   "Current US policy is moving towards a 27.5% tariff on all Chinese products. With the exception of a few, inefficient but politically protected industries, the US produces few of the consumer goods we now import from China. What we do manufacture is so out of line with labor/compliance costs to be totally uncompetitive even if the Chinese doubled their prices.\n \n Does anyone think the US public, with stagnated wages, understands that move will be a substantial direct increase in their cost of living? Is the administration counting on blind patriotism for public approval of again having their wallets lifted?\n \n Or, does anyone else see this as a move to increase consumer spending in an effort to keep expanding the internal transaction driven GDP? As in the net difference from wholesale to retail price, our usual crisis management style in lieu of long-range planning. \n \n http://news.yahoo.com/s/ap/20050526/ap_on_bi_ge/us_china_trade", 
   {
    "post_info": {
     "post_title": "The Yuan, again"
    }
   }, 
   null, 
   null, 
   1117127580.0
  ], 
  [
   128778, 
   null, 
   "Missouri Mule", 
   "Even the Europeans want it revalued and they are about to tip into a depression. There are other suppliers and no nation ought to be getting an unfair trade advantage through currency manipulation. Let it float.", 
   {}, 
   128771, 
   null, 
   1117128420.0
  ], 
  [
   128779, 
   null, 
   "daewoo", 
   "It does not take much imagination to see the motivaiton here. A 27.5% tariff will not hurt the chinese, nor will it come even close to making US manufacturers competitive with them. What it WILL do is provide a huge new revenue stream for the governement.\n \n I wonder if the American consumer realises that this essentially is a revocation of Bushs big tax cuts....and then some.", 
   {}, 
   128771, 
   null, 
   1117128840.0
  ], 
  [
   128784, 
   null, 
   "lord tammerlain", 
   "I would hate to see what a 27.5% tariff is going to do to the inflation rate in the US. I foresee a lot of angry Walmart shoppers.\n \n I think of it as a quick way to pacify some manufacturing states voters who have lost many jobs, and a subtle way for the Federal government to get some more cash.\n \n \n As for letting it float, China first needs to build up the domestic infrustructure that will allow Chinese domestic financial services to cope with the possible wide swings that floating would cause. As it stands China doesnt have the expertise that is needed for proper hedging for smooth international transactions that a floating currency would require.", 
   {}, 
   128778, 
   null, 
   1117129080.0
  ], 
  [
   128797, 
   null, 
   "Missouri Mule", 
   "It does not take much imagination to see the motivaiton here. A 27.5% tariff will not hurt the chinese, nor will it come even close to making US manufacturers competitive with them. What it WILL do is provide a huge new revenue stream for the governement.\n \n I wonder if the American consumer realises that this essentially is a revocation of Bushs big tax cuts....and then some.\n\n \n Your posts constantly amaze me. a 27.5% tariff will NOT hurt the Chinese? Give me a break.", 
   {}, 
   128779, 
   null, 
   1117130220.0
  ], 
  [
   128798, 
   null, 
   "Missouri Mule", 
   "I would hate to see what a 27.5% tariff is going to do to the inflation rate in the US. I foresee a lot of angry Walmart shoppers.\n \n I think of it as a quick way to pacify some manufacturing states voters who have lost many jobs, and a subtle way for the Federal government to get some more cash.\n \n As for letting it float, China first needs to build up the domestic infrustructure that will allow Chinese domestic financial services to cope with the possible wide swings that floating would cause. As it stands China doesnt have the expertise that is needed for proper hedging for smooth international transactions that a floating currency would require.\n\n \n It will have virtually no effect on the U.S. inflation rate. There are other suppliers all around the world who can produce cheap goods.", 
   {}, 
   128784, 
   null, 
   1117130340.0
  ], 
  [
   128806, 
   null, 
   "georged", 
   "What the public, and some of our posters don't understand is the inflationary pressure of rising prices on an already battered money supply, much less personal resources when per-capita incomes are dead in the water. And Wal-Mart, with their volume and low cost of goods sold, will become even more powerful with higher prices. \n \n As has been said, let inflation out of its artificial cage and the boys are quickly separated from the men. I'd personally enjoy 8-10% interest rates, but I know our charity kitchen would be overwhelmed. \n \n More internal transaction GDP churning hoping the margin between wholesale and retail will keep track with payment imbalance. What a hopeless plan.\n \n I'm not personally familiar with China's banking system, other than knowing many of the senior people were educated and many employed at top universities and companies outside of China, which tells me China isn't going to rush into floating the Yuan because US administration says that's what they want. A blanket tariff won't reduce their production margins (internal competition maintains that balance) and prices of Chinese imports could easily double without enabling US manufacturers to come anywhere close to being competitive. The American public will take whatever hit they're told to take to keep our leaky boat afloat.", 
   {}, 
   128784, 
   null, 
   1117131180.0
  ], 
  [
   128807, 
   null, 
   "daewoo", 
   "Your posts constantly amaze me. a 27.5% tariff will NOT hurt the Chinese? Give me a break.\n\n \n Average profit margin on chinese exports is 200%. Chinese goods generally beat US manufactured goods by 30% on the shelf. The 27.5% will not even cut the difference on the shelf.\n \n The chinese have stated constantly that they can take 400% shelf price increases and still remain competitive on 90% of their export goods. They will simply take a slightly lower profit margin.\n \n \n \nIt will have virtually no effect on the U.S. inflation rate. There are other suppliers all around the world who can produce cheap goods.\n\n \n It will have a huge increase on US inflation. The next cheapest country for production is india, at 20% over the cost of the chinese and less than 1/4 the profit margin (which means they cannot fudge simply lower their profits to cover differences).\n \n The only people that this is goign to hurt is the US consumer in the form of inflaiton and higher priced goods.", 
   {}, 
   128797, 
   null, 
   1117131240.0
  ], 
  [
   128808, 
   null, 
   "georged", 
   "Even the Europeans want it revalued and they are about to tip into a depression. There are other suppliers and no nation ought to be getting an unfair trade advantage through currency manipulation. Let it float.\n\n \n I see you still don't understand US GDP composition or global trade cost of goods sold.", 
   {}, 
   128778, 
   null, 
   1117131300.0
  ], 
  [
   128809, 
   null, 
   "lord tammerlain", 
   "Not as cheaply, and not in the short period of time that would be required for adjustment. Production has been moved from Mexico to China, because China is cheaper. Production has been moved from east Asian countries to China because China is cheaper.\n \n China is the low cost producer that has the infrustucture needed for export. To move production to another country is going to take time and money. That is going to result in higher prices for US consumers. That is going to be reflected in the inflation rate.\n \n The other possible countries that could be as cheap as China are India, Pakistan and possibly Vietnam. None of which have the infrustructure for producing the goods (factories) or for the exportation of said goods ( highways, railways or ports) that China has.\n \n Is China going to be hurt, yes but so will the US consumer.", 
   {}, 
   128798, 
   null, 
   1117131360.0
  ], 
  [
   128814, 
   null, 
   "georged", 
   "Average profit margin on chinese exports is 200%. Chinese goods generally beat US manufactured goods by 30% on the shelf. The 27.5% will not even cut the difference on the shelf.\n \n\n \n And China will pay the tariff in surplus USD, removing the necessity of purchasing US securities to get rid of them. That alone should be worth a few hundred basis points of increased US interest rates.", 
   {}, 
   128807, 
   null, 
   1117131960.0
  ], 
  [
   128822, 
   null, 
   "georged", 
   "China is the low cost producer that has the infrustucture needed for export. To move production to another country is going to take time and money. That is going to result in higher prices for US consumers. That is going to be reflected in the inflation rate.\n \n\n \n Americans neglect understanding that China spent most of the 1990s and the last four years in infrastructure improvement for that very purpose in their plan to increase public per-capita income that will serve to expand production well beyond the comprehension of most Americans. Why do Americans think world prices for scrap metal, cement and other building material prices went through the roof? Anyone care to venture a guess on the last US massive infrastructure improvement? Try the federal highway system and port facilities 40+ years ago. With our military spending and declining tax base, we simply don't have that kind of money.", 
   {}, 
   128809, 
   null, 
   1117132620.0
  ], 
  [
   128828, 
   null, 
   "lord tammerlain", 
   "Americans neglect understanding that China spent most of the 1990s and the last four years in infrastructure improvement for that very purpose in their plan to increase public per-capita income that will serve to expand production well beyond the comprehension of most Americans. Why do Americans think world prices for scrap metal, cement and other building material prices went through the roof? Anyone care to venture a guess on the last US massive infrastructure improvement? Try the federal highway system and port facilities 40+ years ago. With our military spending and declining tax base, we simply don't have that kind of money.\n\n \n China unlike any other nation over the last 15-20 years has spent a huge sum on infrustructure, and is still behind what is needed. India, Mexico, Pakistan or any other \" low cost \" producer is so far behind that to make up any significant decrease in Chinese production would take years.", 
   {}, 
   128822, 
   null, 
   1117133040.0
  ], 
  [
   128866, 
   null, 
   "georged", 
   "China unlike any other nation over the last 15-20 years has spent a huge sum on infrustructure, and is still behind what is needed. India, Mexico, Pakistan or any other \" low cost \" producer is so far behind that to make up any significant decrease in Chinese production would take years.\n\n \n India and Pakistan are incurring capital flight, something the US granting F16s to Pakistan will certainly encourage, and Mexico's lack of internal stability defies capital investment for infrastructure improvements beyond serving specific facilities intended to serve US markets. China has a big, big lead. With their long-range planning, we're just seeing the tip of China's future. If the EU comes together in a timely manner to service domestic and Asian markets with lower labor costs from developing members, two strong economical forces will put the US in a very bad position until the standard of living is firmly two-tiered and labor costs become feasible for purposes of global trade. If we have any capital left.", 
   {}, 
   128828, 
   null, 
   1117137480.0
  ], 
  [
   129018, 
   null, 
   "Missouri Mule", 
   "Average profit margin on chinese exports is 200%. Chinese goods generally beat US manufactured goods by 30% on the shelf. The 27.5% will not even cut the difference on the shelf.\n \n The chinese have stated constantly that they can take 400% shelf price increases and still remain competitive on 90% of their export goods. They will simply take a slightly lower profit margin.\n \n It will have a huge increase on US inflation. The next cheapest country for production is india, at 20% over the cost of the chinese and less than 1/4 the profit margin (which means they cannot fudge simply lower their profits to cover differences).\n \n The only people that this is goign to hurt is the US consumer in the form of inflaiton and higher priced goods.\n\n \n Won't happen. Where do you get these ideas? There are any number of countries around the world that can replace China's production. Additionally, the Chinese will inevitably eat a lot of the additional cost as the Europeans have done since the Euro increased in value. (As your own post states.) You should really get out and smell the dog poop and read up on this subject.\n \n \"Huge increase in U.S. inflation?\" That's a truly bizarre statement from someone who claims to understand economics. That's not even remotely possible. A tiny bit, but \"huge?\" No way in Hades.", 
   {}, 
   128807, 
   null, 
   1117151280.0
  ], 
  [
   129057, 
   null, 
   "daewoo", 
   "Won't happen. Where do you get these ideas? There are any number of countries around the world that can replace China's production. Additionally, the Chinese will inevitably eat a lot of the additional cost as the Europeans have done since the Euro increased in value. (As your own post states.) You should really get out and smell the dog poop and read up on this subject.\n\n \n Why? Becuase you read some rediculous editorial (and shared it here) that stated that India and pakistan could pick up the slack? Get a clue. India and pakistan are essentially stuck in the 70's as far as manufacturing capability goes. They are 30+ yrs behind the curve. The chinese on the other hand have traded market share in their consumer market for manufacturing technology. \n \n \n\"Huge increase in U.S. inflation?\" That's a truly bizarre statement from someone who claims to understand economics. That's not even remotely possible. A tiny bit, but \"huge?\" No way in Hades.\n\n \n As far as imports rank, china is right behind canada, and if you remove natural resources and ag goods, they are our biggest import partner. Nearly 20% of consumer goods sold in this country originate in china. While the chinese will certainly eat part of the idiotic tariffs, I think expectign them to eat mor than half is asking a littl emuch. Even with a 27.5% increase in price, theya re still ahead of most fo the world when it comes to qulity of goods for delivered price. You don't htink that a 13.5% increase in 20% of our low level consumer goods will cause inflationary problems????\n \n BTW, we are stillw aiting with baited breath for your financial pedigree.", 
   {}, 
   129018, 
   null, 
   1117161300.0
  ], 
  [
   129084, 
   null, 
   "georged", 
   "Won't happen. Where do you get these ideas? There are any number of countries around the world that can replace China's production.\n\n \n It doesn't sound like you spent any time in the business world. Do you understand national capital investment for infrastructure? If you did, you'd understand how your comment of 'any number of countries could replace China's production' sounds.", 
   {}, 
   129018, 
   null, 
   1117165080.0
  ], 
  [
   129136, 
   null, 
   "Missouri Mule", 
   "It doesn't sound like you spent any time in the business world. Do you understand national capital investment for infrastructure? If you did, you'd understand how your comment of 'any number of countries could replace China's production' sounds.\n\n \n You and Daewoo throw out these high falootin words that imply you actually know what you are talking about. What in the hell is \"national capital investment for infrastructure\" have to do with this debate? Absolutely nothing. I spent enough time in the business world to know **** from shinola. Daewoo already shot down his own argument and I highlighted that in a previous post.", 
   {}, 
   129084, 
   null, 
   1117173000.0
  ], 
  [
   129163, 
   null, 
   "daewoo", 
   "You and Daewoo throw out these high falootin words that imply you actually know what you are talking about. What in the hell is \"national capital investment for infrastructure\" have to do with this debate? Absolutely nothing. I spent enough time in the business world to know **** from shinola. \n\n \n \n national capital investment for infrastructure= simple concept. It is essentially making capitol investments in your infrastructure, i.e makign sure there is plenty of power to go around (for factories, etc...), investing in the creation of shipping facilites (land and sea based), commerical hubs, since commercial areas have MUCH greater utility requirements from electricity to sewage to garbage disposal than other areas. Without this public level investment, there is no such thing as industrial expansion. Building a factory in an area where you cannot get suitable electircity to run it is an exercise in futility, or an area where there is no means to ship your finished goods.\n \n For example, Gujarat is indias largest port. It has the capacity to handle 39 MMTPA. It also has no deep draft berths, which means that it can not take any really BIG ships. \n \n Shanghai Harbor on the other hand has the capacity to handle 340 MMTPA and EVERY large berth is deep draft capable. China has 4 other ports capable of handling over 300 MMTPA. \n \n Look at electrical infrastructure. India has a 1.5 MW cap on electrical services, and you can only get that in 2% of the country. China will drop you a 10 MW service anywhere in the country, and can do a 500 MW service in over 30% of the country. \n \n It would take 30 years for india to be able to produce even 1/10 of what the chinese do. The chinese produce more goods for export yearly than india, pakistan, turkey, mexico, syria, iran, israel, korea (N and S), taiwan and singapore COMBINED. Even if those nations listed above started RIGHT NOW with a series of rapid industrial upgrades, it would take them 15 years to be able to equal china in production. \n \n \nDaewoo already shot down his own argument and I highlighted that in a previous post.\n\n \n How so? Becuase I fail to see a 27.5% tariff on goods that they are making an average of 200% on to be significant? Face it, MM, 27.5% out of a 200% average profit is NOTHING. You are talking about a mosquito biting an elephant here. \n \n We are still waiting to be dazzled with your business pedigree. I am guessing eitehr truck driver, or used car salesman based on the fact that you have referred to \"still haul some cars for local ford dealer\".....) before. You started the \"trot out the pedigree\" ******* match. Pony up.", 
   {}, 
   129136, 
   null, 
   1117174920.0
  ], 
  [
   129179, 
   null, 
   "gamehuis", 
   "I'm surprised that some people still aren't aware of what the Chinese have done to upgrade their country. Sure, certain areas like the financial sector are still lagging (which is why they won't float the Yuan just yet), but when it comes to industry and infrastructure they're done a most admirable job.\n \n Does anybody here also think it's kinda funny that a communist country is beating the US at their own game (i.e. capitalism)?", 
   {}, 
   128771, 
   null, 
   1117180080.0
  ], 
  [
   129182, 
   null, 
   "lord tammerlain", 
   "One question about the tariff\n \n How is it going to be implemented (if at all)?\n \n Is only going to be on the value of the chinese components of the shipped goods, or the entire good being shipped from China?\n \n China has a large market for final assembly of electronics, with parts shipped in from the likes of Japan and Korea, what will the tariff be on specifically?\n \n One other thing to note is that much of the stuff shipped from China is from co owned plants Chinese- Korean/ Japanes/ US. This will hurt those foreign companies in the pocketbook. The large number of autoparts that are made in China are not from 100 % Chinese owned manufactureres.", 
   {}, 
   129179, 
   null, 
   1117182420.0
  ], 
  [
   129229, 
   null, 
   "georged", 
   "One question about the tariff\n \n How is it going to be implemented (if at all)?\n \n Is only going to be on the value of the chinese components of the shipped goods, or the entire good being shipped from China?\n \n China has a large market for final assembly of electronics, with parts shipped in from the likes of Japan and Korea, what will the tariff be on specifically?\n \n One other thing to note is that much of the stuff shipped from China is from co owned plants Chinese- Korean/ Japanes/ US. This will hurt those foreign companies in the pocketbook. The large number of autoparts that are made in China are not from 100 % Chinese owned manufactureres.\n\n \n This started about 18-months ago and has pending bills in both the US house and senate on all Chinese originated imports. It had the usual supporters, inefficient US industries and unions who are big contributors/votes to both parties. The administration was initially against it (for public consumption) but US trade imbalance expanded so rapidly they're now in a bind to keep internal transactions of consumer and public spending high enough to to offset that growing imbalance and produce (cooked as they may be) positive GDP growth numbers. Positive GDP growth numbers are the finger in the endangered dike of consumer confidence. \n \n I haven't read the bills, they're still in committee, but doubt trade name components from Japan, etc. would be included. And let's not forget many Ford, GM and Chrysler new vehicle assembly parts are from China. Right now the issue is centered on textiles and furniture. If the US and EU did force the issue, and be in violation of WTO agreements, a trade war could quickly spread throughout the world. The first big loser in such a conflict would be the US as other nations would quickly dry up treasury purchases while they watched the USD evaporate to offset tariffs until interest rates were increased to a point of, well, we really don't want to go there.\n \n The danger is not the Yuan. That, as with so many other examples, is being used to refocus the US public from the real issue, we're not competitive in global markets and never will be with our current standard of living. No politician is going to speak that truth to the voting public.", 
   {}, 
   129182, 
   null, 
   1117207080.0
  ], 
  [
   129231, 
   null, 
   "georged", 
   "I'm surprised that some people still aren't aware of what the Chinese have done to upgrade their country. Sure, certain areas like the financial sector are still lagging (which is why they won't float the Yuan just yet), but when it comes to industry and infrastructure they're done a most admirable job.\n \n Does anybody here also think it's kinda funny that a communist country is beating the US at their own game (i.e. capitalism)?\n\n \n Very funny. The principles have always been there, we ignored them while China used them. \n \n As MM fails to understand, the capital part of the word capitalism is the key component of industrial growth. Capital goes where it receives the largest returns. The US spent public and private capital in and following WW2 to improve infrastructure first out of necessity and then for capitalizing on being the dominant producer in a mostly industrially devastated world. Then we sat back and reaped the benefits of that investment until our standard of living rose to where our labor and compliance costs made us an easy target for a new kid on the block.\n \n While US government cries about the Yuan being the bogeyman, we created our own problems. And now we're paying the price for 30-years of fiscal irresponsibility.", 
   {}, 
   129179, 
   null, 
   1117208280.0
  ], 
  [
   129235, 
   null, 
   "georged", 
   "You and Daewoo throw out these high falootin words that imply you actually know what you are talking about. What in the hell is \"national capital investment for infrastructure\" have to do with this debate? Absolutely nothing. I spent enough time in the business world to know **** from shinola. Daewoo already shot down his own argument and I highlighted that in a previous post.\n\n \n What business world were you in, the government or on Mars? If you don't understand infrastructure investment, how it relates to industrial production for the purpose of positive global trade and how that influences a tax base which drives a currency, you're bound to be lost in this discussion of, a currency. \n \n Shinola is a poor choice for quality leather care, it sucks the moisture out of leather and causes cracking.", 
   {}, 
   129136, 
   null, 
   1117209120.0
  ], 
  [
   129270, 
   null, 
   "Missouri Mule", 
   "What business world were you in, the government or on Mars? If you don't understand infrastructure investment, how it relates to industrial production for the purpose of positive global trade and how that influences a tax base which drives a currency, you're bound to be lost in this discussion of, a currency. \n \n Shinola is a poor choice for quality leather care, it sucks the moisture out of leather and causes cracking.\n\n \n You and your XXX-hole buddy here keep throwing out terms that purport to establish your business bonifides; even to the point of discussing business deals and the like to impress the impressionable. I'm not impressed.", 
   {}, 
   129235, 
   null, 
   1117215360.0
  ], 
  [
   129274, 
   null, 
   "gamehuis", 
   "You should be, they're the ones living the much talked about American Dream.", 
   {}, 
   129270, 
   null, 
   1117215840.0
  ], 
  [
   129280, 
   null, 
   "Waxy", 
   "You and your XXX-hole buddy here keep throwing out terms that purport to establish your business bonifides; even to the point of discussing business deals and the like to impress the impressionable. I'm not impressed.\n\n \n I'm pretty sure I'm on mister MM's ignore list, but I'm gonna comment anyway.\n \n You just gave the sure fire symbol of being in over your head - resorting to personal attacks, while blatantly using inappropriate language. (The mods have been pretty lax lately, so hopefully they'll let it slide, people have been banned for less in the past.)\n \n The question is, who are you trying to impress? emoticon_rolleyes \n \n Waxy", 
   {}, 
   129270, 
   null, 
   1117216140.0
  ], 
  [
   129285, 
   null, 
   "Missouri Mule", 
   "I'm pretty sure I'm on mister MM's ignore list, but I'm gonna comment anyway.\n \n You just gave the sure fire symbol of being in over your head - resorting to personal attacks, while blatantly using inappropriate language. (The mods have been pretty lax lately, so hopefully they'll let it slide, people have been banned for less in the past.)\n \n The question is, who are you trying to impress? emoticon_rolleyes \n \n Waxy\n\n \n Wow, you are easily offended, aren't you? So houty touty that you never heard that term before. How about joined at the hip, then? I have been repeatedly insulted by these two swelled heads \"experts\" on economics. They think they own this forum and they pontificate with such nonsense as \"Inflation\" controls the price of oil when any dunderhead with an IQ over 50 knows that is pure drivel and nonsense. I'm not going to let them get away with this crapola. They are two phonies who believe their own propaganda. I'm not biting.", 
   {}, 
   129280, 
   null, 
   1117216440.0
  ], 
  [
   129287, 
   null, 
   "Missouri Mule", 
   "You should be, they're the ones living the much talked about American Dream.\n\n \n Money doesn't define intelligence. Even if it were true and we don't know that for a fact anyway; except for their own self promotion. I've seen such phonies before and they usually don't have a pot to **** in after all the assets and debts are added up. Truly successful people don't brag about their wealth. The insecure do, however.", 
   {}, 
   129274, 
   null, 
   1117216560.0
  ], 
  [
   129290, 
   null, 
   "Waxy", 
   "I'm surprised that some people still aren't aware of what the Chinese have done to upgrade their country. Sure, certain areas like the financial sector are still lagging (which is why they won't float the Yuan just yet), but when it comes to industry and infrastructure they're done a most admirable job.\n \n Does anybody here also think it's kinda funny that a communist country is beating the US at their own game (i.e. capitalism)?\n\n \n I'm with you here. It's one of those great ironies.\n \n The key difference IMHO, is the ability of the Chinese to act with a single purposed and vision. The Chinese brand of \"communism\", and I use that term loosely, allows them to act like one large corporation, rather than 1000s of ineffective small corporations fighting for the same scraps. \n \n There's no fighting between \"conservatives\" and \"liberals\" over pointless soundbytes that endlessly drag down the system and paralyze the economy.\n \n The biggest factor IMHO is that the Chinese have no desire to be the world's morality police (that's putting a rosy spin on it emoticon_rolleyes ) and spend themselves poor in the process. They focus on securing their own house first, and they've been doing it with the pen.\n \n They simply go about their business of becoming the world's most powerful nation with a single minded determination and work ethic that puts the USA and everyone else to shame. The best part is, they're doing it by beating the rest of the world at it's own game, capitalism, and using them as a pawn in the process.\n \n Waxy", 
   {}, 
   129179, 
   null, 
   1117216800.0
  ], 
  [
   129294, 
   null, 
   "lord tammerlain", 
   "Money doesn't define intelligence. Even if it were true and we don't know that for a fact anyway; except for their own self promotion. I've seen such phonies before and they usually don't have a pot to **** in after all the assets and debts are added up. Truly successful people don't brag about their wealth. The insecure do, however.\n\n \n Daewoo is in all likely hood not a phony, a company that does what he says his ( not anymore) did exsists in the city that he lives in, with the owner being of an age that would be appropriate to Daewoo. ( Yes I did check it out).\n \n As for George, the information that he has provided here is of a high enough technical nature that a \"faking it\" would be impossible for a person not involved in the economic/business field.", 
   {}, 
   129287, 
   null, 
   1117217160.0
  ], 
  [
   129295, 
   null, 
   "Missouri Mule", 
   "I'm with you here. It's one of those great ironies.\n \n The key difference IMHO, is the ability of the Chinese to act with a single purposed and vision. The Chinese brand of \"communism\", and I use that term loosely, allows them to act like one large corporation, rather than 1000s of ineffective small corporations fighting for the same scraps. \n \n There's no fighting between \"conservatives\" and \"liberals\" over pointless soundbytes that endlessly drag down the system and paralyze the economy.\n \n The biggest factor IMHO is that the Chinese have no desire to be the world's morality police (that's putting a rosy spin on it emoticon_rolleyes ) and spend themselves poor in the process. They focus on securing their own house first, and they've been doing it with the pen.\n \n They simply go about their business of becoming the world's most powerful nation with a single minded determination and work ethic that puts the USA and everyone else to shame. The best part is, they're doing it by beating the rest of the world at it's own game, capitalism, and using them as a pawn in the process.\n \n Waxy\n\n \n We'll see about that. Don't be surprised if their banking system goes belly up (it's already bankrupt) and the whole house of cards comes tumbling down.", 
   {}, 
   129290, 
   null, 
   1117217160.0
  ], 
  [
   129296, 
   null, 
   "Waxy", 
   "Wow, you are easily offended, aren't you? So houty touty that you never heard that term before. How about joined at the hip, then? I have been repeatedly insulted by these two swelled heads \"experts\" on economics. They think they own this forum and they pontificate with such nonsense as \"Inflation\" controls the price of oil when any dunderhead with an IQ over 50 knows that is pure drivel and nonsense. I'm not going to let them get away with this crapola. They are two phonies who believe their own propaganda. I'm not biting.\n\n \n Not in the least.\n \n I do like to think that I'm mature enough to leave the truck stop at the truck stop though. I can function is both worlds just fine, and have for years, it's pretty much a requirement when you work in the oil patch.\n \n I don't use $5 words out on the rigs and can cuss with the best of them if need be, but I don't curse at people in the boardroom. That's simple common sense and courtesy.\n \n IMHO, it's only a reflection on the person themselves (not a poisitive one) if they can't grasp that concept.\n \n As for the assertions of the \"phonies\", I haven't seen you give anything but your opinion, completely unsupported, as proof of their lack of knowledge. You've been called out several times and have failed to produce. \"Put up or shut up\" as they say. \n \n You're in a gun fight, you better put your knife away and draw.\n \n Waxy", 
   {}, 
   129285, 
   null, 
   1117217280.0
  ], 
  [
   129297, 
   null, 
   "daewoo", 
   "You and your XXX-hole buddy here keep throwing out terms that purport to establish your business bonifides; even to the point of discussing business deals and the like to impress the impressionable. I'm not impressed.\n\n \n This is the economic advice forum. This is essentially here to discuss things like business deals and solicit advice from others. \n \n I really don't give a rats furry back end if you are impressed or not. You have no credibility here in such matters. Youhave displayed your gross ignorance so many time I have quite counting.\n \n We are still waiting on your business pedigree.", 
   {}, 
   129270, 
   null, 
   1117217340.0
  ], 
  [
   129298, 
   null, 
   "Waxy", 
   "We'll see about that. Don't be surprised if their banking system goes belly up (it's already bankrupt) and the whole house of cards comes tumbling down.\n\n \n Before or after the USA goes belly up for the same reasons?\n \n Denying China's might at this point is purposely naive IMHO.\n \n Waxy", 
   {}, 
   129295, 
   null, 
   1117217400.0
  ], 
  [
   129299, 
   null, 
   "Missouri Mule", 
   "Daewoo is in all likely hood not a phony, a company that does what he says his ( not anymore) did exsists in the city that he lives in, with the owner being of an age that would be appropriate to Daewoo. ( Yes I did check it out).\n \n As for George, the information that he has provided here is of a high enough technical nature that a \"faking it\" would be impossible for a person not involved in the economic/business field.\n\n \n Well, I haven't gone to that trouble and don't intend to but my point is still valid. One does not go about bragging about their accomplishments unless they are essentially insecure. I know of a long time \"friend\" (since early childhood) who is evidently well off. He brags about how accomplishments, been around the world, the latest fancy automobile, great big house in the best neighborhood and he deigns to contact me here in the boondocks to do something; I suppose to validate his huge success. I eventually suggested that he might want to do something about his depression as I'm not his psychiatrist. Haven't heard from him lately. \n \n I have more respect for the poorest person in the world if he is intellectually honest and lives a good life. I don't need some swelled head telling me of his wealth and material possessions. When we go out of this world we will do so the same way we came into it. With nothing.", 
   {}, 
   129294, 
   null, 
   1117217520.0
  ], 
  [
   129302, 
   null, 
   "Missouri Mule", 
   "Before or after the USA goes belly up for the same reasons?\n \n Denying China's might at this point is purposely naive IMHO.\n \n Waxy\n\n \n I'm not denying that and I'm not hoping for it. However, one should be aware that they have some very serious problems that are not widely discussed. In order for that country to become truly great they are going to have to cast off their communist political governance and become fully capitalistic. They are going to have to install proven accounting procedures into their banking system and they are going to have to come clean. It is almost as bad as Enron and you know how they turned out.", 
   {}, 
   129298, 
   null, 
   1117217640.0
  ], 
  [
   129307, 
   null, 
   "daewoo", 
   "I'm with you here. It's one of those great ironies.\n \n The key difference IMHO, is the ability of the Chinese to act with a single purposed and vision. The Chinese brand of \"communism\", and I use that term loosely, allows them to act like one large corporation, rather than 1000s of ineffective small corporations fighting for the same scraps. \n \n There's no fighting between \"conservatives\" and \"liberals\" over pointless soundbytes that endlessly drag down the system and paralyze the economy.\n \n The biggest factor IMHO is that the Chinese have no desire to be the world's morality police (that's putting a rosy spin on it emoticon_rolleyes ) and spend themselves poor in the process. They focus on securing their own house first, and they've been doing it with the pen.\n \n They simply go about their business of becoming the world's most powerful nation with a single minded determination and work ethic that puts the USA and everyone else to shame. The best part is, they're doing it by beating the rest of the world at it's own game, capitalism, and using them as a pawn in the process.\n \n Waxy\n\n \n \n This does seem to be chinas strength. It kind of makes you wondeir if maybe some of the far left are correct, that the USSR would have worked if the right people had been in charge. There is very little infighting in china, you actually see companies working together without trying to stab each other in the back. \n \n If things continue there as they have, we may well see a decline in the capitolist model.", 
   {}, 
   129290, 
   null, 
   1117217940.0
  ], 
  [
   129318, 
   null, 
   "lord tammerlain", 
   "This does seem to be chinas strength. It kind of makes you wondeir if maybe some of the far left are correct, that the USSR would have worked if the right people had been in charge. There is very little infighting in china, you actually see companies working together without trying to stab each other in the back. \n \n If things continue there as they have, we may well see a decline in the capitolist model.\n\n \n \n I think we are seeing the rise of directed capitolism. The US \"let the market\" decide method of Capitalism forgets that many people are short sighted XXXXXX and will only think of the now. That thinking destroys the long term strength of a nation by not investing in the nations physical and \"people\" infrustructure. A factory is all well and good, but without an educated and healthy workforce to work in it, you would have been better off not building it.\n \n That I believe is the failing of Neo Liberal economics, it fails to account that an educated and healthy workforce is the most important quality for a nations long term sucess.", 
   {}, 
   129307, 
   null, 
   1117218720.0
  ], 
  [
   129322, 
   null, 
   "daewoo", 
   "Daewoo is in all likely hood not a phony, a company that does what he says his ( not anymore) did exsists in the city that he lives in, with the owner being of an age that would be appropriate to Daewoo. ( Yes I did check it out).\n\n \n Actually, there are 3 in town. Mine is just the only one big enough to be worthy of note, and the other two are owned by old fogies. We all essentially exist to service the aircraft industry in Wichita. I was just the only one smartr enough to branch out a bit so as not to have all my eggs in one basket. \n \n \nWell, I haven't gone to that trouble and don't intend to but my point is still valid. One does not go about bragging about their accomplishments unless they are essentially insecure. I know of a long time \"friend\" (since early childhood) who is evidently well off. He brags about how accomplishments, been around the world, the latest fancy automobile, great big house in the best neighborhood and he deigns to contact me here in the boondocks to do something; I suppose to validate his huge success. I eventually suggested that he might want to do something about his depression as I'm not his psychiatrist. Haven't heard from him lately.\n\n \n He may be the victim of our declining economy. Some people seem to be unable to help making inappropriate connections between wealth and personal worth. \n \n Who is bragging?\n \n \nI have more respect for the poorest person in the world if he is intellectually honest and lives a good life. I don't need some swelled head telling me of his wealth and material possessions. When we go out of this world we will do so the same way we came into it. With nothing.\n\n \n Words of a poor man.\n \n We are still waiting to be astounded by your business pedigree.", 
   {}, 
   129294, 
   null, 
   1117218900.0
  ], 
  [
   129328, 
   null, 
   "lord tammerlain", 
   "Actually, there are 3 in town. Mine is just the only one big enough to be worthy of note, and the other two are owned by old fogies. We all essentially exist to service the aircraft industry in Wichita. I was just the only one smartr enough to branch out a bit so as not to have all my eggs in one basket. \n \n\n \n No offense meant but I checked when it was stated you could read Arabic during a discusion with fracas.", 
   {}, 
   129322, 
   null, 
   1117219500.0
  ], 
  [
   129331, 
   null, 
   "daewoo", 
   "I think we are seeing the rise of directed capitolism. The US \"let the market\" decide method of Capitalism forgets that many people are short sighted XXXXXX and will only think of the now. That thinking destroys the long term strength of a nation by not investing in the nations physical and \"people\" infrustructure. A factory is all well and good, but without an educated and healthy workforce to work in it, you would have been better off not building it.\n \n That I believe is the failing of Neo Liberal economics, it fails to account that an educated and healthy workforce is the most important quality for a nations long term sucess.\n\n \n \n Directed capitolism certainly on one level, good old fashioned rank socialism on another. I was reading a deal the other day about chinas long term soaicl goals (health care, etc...) and it almost looks like they are shooting for a large scale sweden, or canada.", 
   {}, 
   129318, 
   null, 
   1117219740.0
  ], 
  [
   129335, 
   null, 
   "daewoo", 
   "No offense meant but I checked when it was stated you could read Arabic during a discusion with fracas.\n\n \n None taken. In fact, anybody who happens to be in Emporia area for the next 4 months can get a tour. I'll even take you to dinner :) After that, I jpoin the ranks of the functionally unemployed and will no longer be able to grant tours. \n \n God, thats exciting to say", 
   {}, 
   129328, 
   null, 
   1117219980.0
  ], 
  [
   129338, 
   null, 
   "georged", 
   "You and your XXX-hole buddy here keep throwing out terms that purport to establish your business bonifides; even to the point of discussing business deals and the like to impress the impressionable. I'm not impressed.\n\n \n Just about everyone posting in the forum has revealed personal and professional details to offer experience and/or education that fits their areas of expertise for purposes of pursuing subjects. We have many posters who are learned and/or experienced/knowledgeable in many topics. For structural economic cause and effect, I look to Eddie. Several posters are current on US and global economics. Waxy provides his geology profession on oil/energy and other matters. Gamehuis is a day trader and if he isn't up to speed on equity and currency, we'd know because his PC would disappear. When it comes to global trade patterns and motivation, goods, currency and government structure, Lord T posts like a state department insider. There are others, but my point is that there are posters here who are very knowledgeable about various topics and if someone was in over his/her head in a discussion, that becomes apparent as quickly as a poor poker player in a high stakes game. \n \n I've never seen any examples of personal net worth posted on this forum, nor would they be appropriate. With regard to your comment about people commenting about their wealth, no, they normally don't. At least not to those without wealth, because it creates insecurity and instant jealousy which often turns ugly with profanity and personal slurs. I guess you didn't see or read Warren Buffett (lives about as simple as any person) when he made a real killing in currency trades. His smile was huge and he was justifiably proud of his accomplishment. Professional pride is acknowledgment of accomplishment by one's peers, not something easily faked. Nor is ignorance.", 
   {}, 
   129270, 
   null, 
   1117220460.0
  ], 
  [
   129352, 
   null, 
   "georged", 
   " They are going to have to install proven accounting procedures into their banking system and they are going to have to come clean. It is almost as bad as Enron and you know how they turned out.\n\n \n Maybe you can enlighten us on what was left out of IFAD's convergence of GAAP published in 2002 after the Asian financial crisis? CAS has 108 minor differences from GAAP, none considered material for reporting validity by any professional body and acceptable to even Ford and GM bean counters for joint venture purposes. No company demands 'as pure as Caesar's wife' books like the vehicle industry as they have very powerful unions with audit rights. Considering the amount of business Ford does with Chinese firms and China's government, you, as an investor in Ford equity stock, should be very familiar with those circumstances \n \n Enron pure and simple cooked the books. In China, the perpetrators would be probably be dead before it ever became meat for the lawyers.", 
   {}, 
   129302, 
   null, 
   1117221960.0
  ], 
  [
   129366, 
   null, 
   "daewoo", 
   "I've never seen any examples of personal net worth posted on this forum, nor would they be appropriate. With regard to your comment about people commenting about their wealth, no, they normally don't. At least not to those without wealth, because it creates insecurity and instant jealousy which often turns ugly with profanity and personal slurs. I guess you didn't see or read Warren Buffett (lives about as simple as any person) when he made a real killing in currency trades. His smile was huge and he was justifiably proud of his accomplishment. Professional pride is acknowledgment of accomplishment by one's peers, not something easily faked. Nor is ignorance.\n\n \n I think MM is confusing professional pride with boasting or bragging. I make no apologies. I came out of college with $182 in my checking account and some very expensive pieces of toilet paper (degrees). Everything I have accomplished since then I have done through hard work and diligence, and I am damn proud of it. I am not all that proud of the posessions I have accumulated, but am damn proud of the fact that I know my family will never have to worry about there not being enough money to survive and not have to suffer though a life of hand me down clothes and welfare dinners.", 
   {}, 
   129338, 
   null, 
   1117223520.0
  ], 
  [
   129369, 
   null, 
   "georged", 
   "I think MM is confusing professional pride with boasting or bragging. I make no apologies. I came out of college with $182 in my checking account and some very expensive pieces of toilet paper (degrees). Everything I have accomplished since then I have done through hard work and diligence, and I am damn proud of it. I am not all that proud of the posessions I have accumulated, but am damn proud of the fact that I know my family will never have to worry about there not being enough money to survive and not have to suffer though a life of hand me down clothes and welfare dinners.\n\n \n Given the choice of having them or not, I'm an admitted materialist. I appreciate the accumulation of possessions. Serviceable or adequate is fine, but to a materialist the next step up is always more enjoyable.", 
   {}, 
   129366, 
   null, 
   1117224120.0
  ], 
  [
   129376, 
   null, 
   "daewoo", 
   "Given the choice of having them or not, I'm an admitted materialist. I appreciate the accumulation of possessions. Serviceable or adequate is fine, but to a materialist the next step up is always more enjoyable.\n\n \n \n don't get me wrong, I certainly enjoy my toys. I just take no particular pride in them. I have never sent out pictures of my car or my house for christmas, nor have I ever had any relative or friend harass me for not sending pictures of my computer setup or entertainment center. I will admit that when I bought my first brand new car, I was pretty pumped about it. such things become passe pretty quickly.", 
   {}, 
   129369, 
   null, 
   1117224900.0
  ], 
  [
   129389, 
   null, 
   "gamehuis", 
   "There is nothing wrong with being proud of ones accomplishments just as long as one doesn't let it go to ones head.\n \n The first time I did really well with my daytrading job I phoned up my father to express my joy. I did my homework and it paid off. I was proud, but I know that I have to be humble because it can just as easily go the other way around when I get cocky and think that I don't need to work hard anymore to get good results.", 
   {}, 
   129376, 
   null, 
   1117226460.0
  ], 
  [
   129434, 
   null, 
   "daewoo", 
   "There is nothing wrong with being proud of ones accomplishments just as long as one doesn't let it go to ones head.\n \n The first time I did really well with my daytrading job I phoned up my father to express my joy. I did my homework and it paid off. I was proud, but I know that I have to be humble because it can just as easily go the other way around when I get cocky and think that I don't need to work hard anymore to get good results.\n\n \n probably 80-85% of business strtups I have seen fail are for this very reason. People get a taste of sucess and stop working hard. You have to be willing and able to work just as hard in year 10 as you were in year 1, or you cannot expect good results.\n \n This is also a pretty good sum up with Americas economic problems right now. We had 50 yrs where we were the big boys on the industrial block. then we spent some time coasting. We got a taste of sucess and quite working hard, and as a result are being surpased by those who are sitll working hard.", 
   {}, 
   129389, 
   null, 
   1117232520.0
  ], 
  [
   129460, 
   null, 
   "Missouri Mule", 
   "This is the economic advice forum. This is essentially here to discuss things like business deals and solicit advice from others. \n \n I really don't give a rats furry back end if you are impressed or not. You have no credibility here in such matters. Youhave displayed your gross ignorance so many time I have quite counting.\n \n We are still waiting on your business pedigree.\n\n \n You seem to put a lot of stock into \"business pedigrees\" whatever that may be. I prefer to take my lead from those who can see truth for what it is and what is bulloney. As an example I would defer to timeless genius of Eric Hoffer, who made his living as a longshoreman. Of course, that would be beneath your pay grade and he didn't have the credentials that you so highly value. \n \n Suffice it to say that I didn't just fall off the turnip wagon, although I have a good deal of respect for those people who filled that turnip wagon as opposed to the charlatans who come here and elsewhere to dispense their economic hogwash. I've seen your kind before. The Joe Granvilles, the Robert Prechters and all of the other fast buck artists who make their living preaching doom and gloom. You can fool some (as you have evidently done) but you don't fool me. \n \n I'm here because I like to argue politics and economics. I'm retired and can do whatever I want to do. You appear to need to come here to massage your oversized ego. It doesn't matter how much your bank balance shows; how much you think of yourself and who you rub elbows with. A phoney is still a phoney in any language.", 
   {}, 
   129297, 
   null, 
   1117236840.0
  ], 
  [
   129485, 
   null, 
   "georged", 
   "You seem to put a lot of stock into \"business pedigrees\" whatever that may be. I prefer to take my lead from those who can see truth for what it is and what is bulloney. As an example I would defer to timeless genius of Eric Hoffer, who made his living as a longshoreman. Of course, that would be beneath your pay grade and he didn't have the credentials that you so highly value. \n \n Suffice it to say that I didn't just fall off the turnip wagon, although I have a good deal of respect for those people who filled that turnip wagon as opposed to the charlatans who come here and elsewhere to dispense their economic hogwash. I've seen your kind before. The Joe Granvilles, the Robert Prechters and all of the other fast buck artists who make their living preaching doom and gloom. You can fool some (as you have evidently done) but you don't fool me. \n \n I'm here because I like to argue politics and economics. I'm retired and can do whatever I want to do. You appear to need to come here to massage your oversized ego. It doesn't matter how much your bank balance shows; how much you think of yourself and who you rub elbows with. A phoney is still a phoney in any language.\n\n \n The forum continues to discuss politics and economics, but your opinions have a uniform lack of depth, primarily confined to cut/past articles or whatever the media has decided to tell the public. When asked for detail or confronted for being uninformed, you wander off on tangents using derogatory comments of a personal nature in attempts to discredit posters with far more displayed knowledge and experience than you've exhibited. Pretty simple, engage brain and expound on details. Forget the **** like blanket statements of China's accounting system being out of whack when it's obvious you don't have a clue about a subject, just mouthing something you've read or heard from a public media source. Most people involved in economics, finance and investing rely on paid, private subscriptions or current education from objective, non-political sources for their news. And it isn't cheap. If you wish to continue sounding like a buffoon with your media-inspired sales propaganda, that is your privilege, but knock off the personal slurs. You're becoming a troll. Genuine \"devil's advocates\" generally identify themselves as such out of respect for etiquette and courtesy, while trolls dismiss etiquette and courtesy altogether.", 
   {}, 
   129460, 
   null, 
   1117240560.0
  ], 
  [
   129503, 
   null, 
   "Missouri Mule", 
   "The forum continues to discuss politics and economics, but your opinions have a uniform lack of depth, primarily confined to cut/past articles or whatever the media has decided to tell the public. When asked for detail or confronted for being uninformed, you wander off on tangents using derogatory comments of a personal nature in attempts to discredit posters with far more displayed knowledge and experience than you've exhibited. Pretty simple, engage brain and expound on details. Forget the **** like blanket statements of China's accounting system being out of whack when it's obvious you don't have a clue about a subject, just mouthing something you've read or heard from a public media source. Most people involved in economics, finance and investing rely on paid, private subscriptions or current education from objective, non-political sources for their news. And it isn't cheap. If you wish to continue sounding like a buffoon with your media-inspired sales propaganda, that is your privilege, but knock off the personal slurs. You're becoming a troll. Genuine \"devil's advocates\" generally identify themselves as such out of respect for etiquette and courtesy, while trolls dismiss etiquette and courtesy altogether.\n\n \n That's an oxymoron to claim that \"paid, private subscriptions\" are objective. They are anything but. I've lost more money listening to experts than I could count. The WORST mistake I ever made was listening to paid experts and one was my next door neighborhood. He also talked up China well over a decade ago and my money went into a rathole. I've had paid subscriptions to economic newsletters and they are almost always wrong. If you want to learn about the stock market or other economic matters, put your own money on the line. You'll learn soon enough. \n \n You're claiming that I've been mean to you. You should read some of your own posts to me. What's good for the goose is good for the gander.\n \n No one here should be deceived that anyone posting here (including me) has all the answers or some special insight into the future. We don't. Not one of us. Even the \"great\" Warren Buffett has recently gotten burned by investing in the Euro and against the dollar. So much for his crystal ball. \n \n Warren Buffett loses $310m by betting against the greenback\n \n The Times\n May 2, 2005\n By Patrick Hosking and Gabriel Rozenberg\n WARREN BUFFETT has lost $310 million (£162 million) betting against the US dollar. But the world's second-richest man and best-known investment guru is undeterred and continues to position Berkshire Hathaway, his investment company, for dollar weakness...\n \n \n http://www.benadorassociates.com/article/14457\n ---------------------------------------------------\n And if you actually think that China's banking system is sound, you are the one who is smoking something. Check this out (there are many more saying the same thing.)\n \n May 2, 2004\n OP-ED COLUMNIST\n Let Us Pray\n By THOMAS L. FRIEDMAN\n \n TOKYO\n \n Here's what I learned in Tokyo: If you're the leader of Japan, America, Australia, Taiwan, Malaysia, Russia, Thailand, Indonesia, Singapore, the Philippines or the European Union and you're not going to bed each night saying the following prayer for China, then you're not paying attention:\n \n \"Dear Heavenly Father, please keep the leader of China, President Hu Jintao, healthy and on an even keel. Please see to it that he moves steadily and carefully toward restructuring the Chinese banking system and ridding it of its huge overhang of bad loans and corruption, before there is a real meltdown that would be felt around the world. Give him the wisdom to cool the overheated Chinese economy without creating a recession that would prompt China to stop importing like crazy and start just exporting like crazy. And Father, forgive us for all the bad words we used in recent years to describe China's leaders - terms like `Butchers of Beijing.' We did not mean it. We meant to say `Bankers of Beijing,' because their economy is now fueling growth all over Asia, bolstering Japan and sucking up imports from everywhere. May China's leaders live to 120, and may they enjoy 9 percent G.D.P. growth every year of their lives. Thank you, Father. Amen.\"...\n \n (Snip)\n \n and this little snippet:\n \n The most striking thing about being in Asia today is hearing how much more important China's growth engine has become for companies all across the region - and well beyond it. When Chinese authorities told banks last week to cut back their wild lending, commodity prices and stock markets tumbled all over the world. News that China is having regular blackouts because it can't buy enough crude oil is helping push up gasoline prices the world over.\n \n (I posted this over a year ago in another forum and this is the complete article. The original link is no longer active. So I am hardly a newcomer to this subject.)\n \n http://www.whistlestopper.com/forum/archive/index.php/t-10390.html", 
   {
    "unicode_changes_made": true
   }, 
   129485, 
   null, 
   1117243020.0
  ], 
  [
   129504, 
   null, 
   "georged", 
   "'Pay Grade' is a term normally associated with those employed or formerly employed by a government agency, often enlisted military or lower civil service ranks, is it not? I've never heard a civilian use it and the officers I've known refer to each other by rank or time in rank. Just trying to keep my financial jargon up to date.", 
   {}, 
   129485, 
   null, 
   1117243020.0
  ], 
  [
   129506, 
   null, 
   "Missouri Mule", 
   "'Pay Grade' is a term normally associated with those employed or formerly employed by a government agency, often enlisted military or lower civil service ranks, is it not? I've never heard a civilian use it and the officers I've known refer to each other by rank or time in rank. Just trying to keep my financial jargon up to date.\n\n \n It has come into common venacular to mean that one isn't qualified to speak to a particular subject. It's also a cop-out when one doesn't want to answer a question. I hear it all the time on political discussion sites.", 
   {}, 
   129504, 
   null, 
   1117243320.0
  ], 
  [
   129517, 
   null, 
   "georged", 
   " If you want to learn about the stock market or other economic matters, put your own money on the line. You'll learn soon enough. \n\n \n I have. And the only money I lost was due to increased taxes for pulling out early from pre-tax investments, the only investments I didn't initiate based on my own research and knowledge. But if I was still interested in US equity investments I'd never use 'investment' advice subscriptions for anything other than fire starter. One uses expensive subscriptions from people who can tear apart balance sheet and income statements to save you the time and aggravation. They generally charge around $150-200/hr. And I'd never do business with a neighbor any more than a relative. I want someone with professional liability insurance, a strong capital position and community standing so my lawyer can recover any potential losses from bad advice. Business is not a friendly or neighborly sport. \n \n What did the shouting cut/paste have to do with China's accounting system? You still haven't commented on any material differences in CAS and GAAP that you, against world accounting professional group opinions, feel is dangerous. Ford is preparing to do dealer financing in China, so you, as an equity owner, need to warn them about what they're up against.\n \n I don't think Warren is crying about his latest transaction; several earlier swift dips were each larger profits than the loss. You did miss the point.", 
   {}, 
   129503, 
   null, 
   1117246020.0
  ], 
  [
   129600, 
   null, 
   "Missouri Mule", 
   "I have. And the only money I lost was due to increased taxes for pulling out early from pre-tax investments, the only investments I didn't initiate based on my own research and knowledge. But if I was still interested in US equity investments I'd never use 'investment' advice subscriptions for anything other than fire starter. One uses expensive subscriptions from people who can tear apart balance sheet and income statements to save you the time and aggravation. They generally charge around $150-200/hr. And I'd never do business with a neighbor any more than a relative. I want someone with professional liability insurance, a strong capital position and community standing so my lawyer can recover any potential losses from bad advice. Business is not a friendly or neighborly sport. \n \n What did the shouting cut/paste have to do with China's accounting system? You still haven't commented on any material differences in CAS and GAAP that you, against world accounting professional group opinions, feel is dangerous. Ford is preparing to do dealer financing in China, so you, as an equity owner, need to warn them about what they're up against.\n \n I don't think Warren is crying about his latest transaction; several earlier swift dips were each larger profits than the loss. You did miss the point.\n\n \n Well first of all, he just happened to be my neighbor and ironically didn't even know he was my neighbor until after we went to him for his \"expert\" advice. (We were separated by a large stand of trees on acreage and had never spoken to him or his wife.) It so happened that he and his partner had a long time program on radio discussing investing and my wife thought we needed \"professional\" help. That's how we happened to go to him. So that is immaterial. It was purely coincidental.\n \n Secondly, China's banking system is bankrupt. It just is. One doesn't need to look any further than that. A house built on a poor foundation is going to fall into the ditch sooner or later. Their economy may very well grow for some time but they are going to have major problems that a command type government is ill equipped to deal with. In the end you can't make water run uphill. You seem to have a thing about \"cutting and pasting\" as though it diminishes the argument. I cut and paste because I wanted to show what others who have studied these issues have had to say. I won't cut and paste this, but this problem is not something that I concocted out of thin air. It has been written about extensively. This is a good summary. While I won't cut and paste it I will post the link. You can debate it if you will. I'm not going to try to outreason someone like this true expert who actually knows what he is talking about. I could not possibly hope to explain it as well as he has. Read it, you just might learn something.\n \n http://www.businessweek.com/magazine/content/02_47/b3809164.htm\n \n http://www.businessweek.com/bwdaily/dnflash/nov2002/nf20021122_7765.htm\n \n Thirdly, I never said that Buffett was \"crying\" about his betting against the Euro. He was just wrong -- flat wrong. Like a lot of people, in my opinion who go chasing after quick money. I can't see how Europe with all of its problems, an anemic economy and political problems coming out of their ears is going to have a strong currency if there is no growth. And their socialistic welfare schemes are now coming home to roost and it won't be a pretty sight when the peasants see how they have been conned all these years. There is no free lunch.", 
   {}, 
   129517, 
   null, 
   1117262040.0
  ], 
  [
   129629, 
   null, 
   "daewoo", 
   "You seem to put a lot of stock into \"business pedigrees\" whatever that may be. I prefer to take my lead from those who can see truth for what it is and what is bulloney. As an example I would defer to timeless genius of Eric Hoffer, who made his living as a longshoreman. Of course, that would be beneath your pay grade and he didn't have the credentials that you so highly value. \n\n \n You are the one who wanted to know backgrounds and qualifications, not me. George and I ponied up. It is your turn.\n \n \n \n\n Suffice it to say that I didn't just fall off the turnip wagon, although I have a good deal of respect for those people who filled that turnip wagon as opposed to the charlatans who come here and elsewhere to dispense their economic hogwash. I've seen your kind before. The Joe Granvilles, the Robert Prechters and all of the other fast buck artists who make their living preaching doom and gloom. You can fool some (as you have evidently done) but you don't fool me. \n\n \n Ahhh, so used car salesman it is.\n \n \nI'm here because I like to argue politics and economics. I'm retired and can do whatever I want to do. You appear to need to come here to massage your oversized ego. It doesn't matter how much your bank balance shows; how much you think of yourself and who you rub elbows with. A phoney is still a phoney in any language.\n \n\n \n Again, you seem to be the phony here. I have posted my creditials, you keep referring to years of experience in the business world, yet have failed to expand on that at all. Thus far, all we know is that your former profession apparently involved moving cars around to ford dealers, since you aparently \"still\" do that some times, that you prefer to invest in companies that show less than 2% ROI, you know nothing about currency valuations or currency trading, and you have no idea how bonds are rated. I am trying to comprehend exactly what your business background is that allows for such gross incompetance in so many areas of economics. \n \n I feel that I have backed my ascertations and economic based observations with factual evidence and clearly laid out my logic for the conclusions I have drawn. Other people do not seem to have trouble following that logic. While I do not pretend to hold a candle to George, I certainly think I have demonstrated at least a basic grasp on economic concepts and their application. I can not say the same for you.\n \n \n \nWell first of all, he just happened to be my neighbor and ironically didn't even know he was my neighbor until after we went to him for his \"expert\" advice. (We were separated by a large stand of trees on acreage and had never spoken to him or his wife.) It so happened that he and his partner had a long time program on radio discussing investing and my wife thought we needed \"professional\" help. That's how we happened to go to him. So that is immaterial. It was purely coincidental.\n\n \n \n Your wife was right.", 
   {}, 
   129460, 
   null, 
   1117279620.0
  ], 
  [
   129653, 
   null, 
   "Missouri Mule", 
   "You are the one who wanted to know backgrounds and qualifications, not me. George and I ponied up. It is your turn.\n \n Ahhh, so used car salesman it is.\n \n Again, you seem to be the phony here. I have posted my creditials, you keep referring to years of experience in the business world, yet have failed to expand on that at all. Thus far, all we know is that your former profession apparently involved moving cars around to ford dealers, since you aparently \"still\" do that some times, that you prefer to invest in companies that show less than 2% ROI, you know nothing about currency valuations or currency trading, and you have no idea how bonds are rated. I am trying to comprehend exactly what your business background is that allows for such gross incompetance in so many areas of economics. \n \n I feel that I have backed my ascertations and economic based observations with factual evidence and clearly laid out my logic for the conclusions I have drawn. Other people do not seem to have trouble following that logic. While I do not pretend to hold a candle to George, I certainly think I have demonstrated at least a basic grasp on economic concepts and their application. I can not say the same for you.\n \n Your wife was right.\n\n \n The reason I asked for your expertise background is because you kept throwing these $10 words around which gave me to believe you were trying to impress people here. As I said, I'm not impressed. You may have made a pile of money in your life but you haven't learned much in the way of economics. I just posted two links to two excellent articles in Business Week in my post above that explained in exquisite detail why China is on such shaky ground. (I didn't post the articles themselves because your buddy complained about my \"cutting and pasting.\") I went on to say that I was not going to regurgitate what someone else has already said; someone who is truly expert, and someone who is better able to articulate the facts than I could. I take it that you didn't bother to read those before you replied. I would have been most interested in your take and rebuttal. Having seen none, I take it that you have none. \n \n I once made a comment here about transporting vehicles at a local Ford dealer. Suffice it to say that I did not make my living transporting vehicles in my former life. I've done this exactly twice. It is not my living. It is irrelevant.\n \n Let me give you some timeless advice. Don't get too big for your britches and try getting off your high horse and mingle with the common man without all of the technical mumbo-jumbo. Even Alan Greenspan doesn't do that. (You may have heard of him.) Your so-called pedigree or business acumen doesn't give you a license to dispense nonsense.\n ------------------------------\n I am going to make one exception as to your request about my background. I will tell you something about my investing history.\n \n And if you want to comment about these companies I will discuss with you and possibly even appreciate your insight. I purchase these stocks through Scott Trade. I'll use the stock symbols.\n \n ADP, C, CSCO, DELL, EMC, F, HDI, INTC, MSFT, PFE, SPY, WMT. These are all large cap companies. If I had it to do over, I would have never invested in Pfizer or EMC, or most of the tech stocks. I listened to the advice of others when I should have been doing my homework. And I regard the advice of financial \"experts\" as worthless or even downright dangerous to one's net worth. And \"Pompous\" Bob Brinker gives me a pain in the butt. If I had anything to do over in my life I would have gotten stock investing down pat. On that basis I have done poorly. For the average layman it is probably best to just invest in a good mutual fund like Vanguard's S&P index fund.", 
   {}, 
   129629, 
   null, 
   1117295520.0
  ], 
  [
   129654, 
   null, 
   "gamehuis", 
   "With regards to China's bad loans, I'd say that the $500 billion in foreign reserves that they are holding should cover that.\n \n And as for Alan Greenspan, the guy's a hack who never gives a straight answer and who's company, known as the Federal Reserve (a bank that never has had a proper audit since its creation), has given away any future prosperity for the American people.", 
   {}, 
   129653, 
   null, 
   1117296060.0
  ], 
  [
   129657, 
   null, 
   "Missouri Mule", 
   "With regards to China's bad loans, I'd say that the $500 billion in foreign reserves that they are holding should cover that.\n \n And as for Alan Greenspan, the guy's a hack who never gives a straight answer and who's company, known as the Federal Reserve (a bank that never has had a proper audit since its creation), has given away any future properity for the American people.\n\n \n You didn't bother reading the articles did you? Your comments about Greenspan and the Fed are rubbish.", 
   {}, 
   129654, 
   null, 
   1117296720.0
  ], 
  [
   129668, 
   null, 
   "gamehuis", 
   "You didn't bother reading the articles did you? Your comments about Greenspan and the Fed are rubbish.\n\n Yes I've read your two and a half year old doomsday articles. But you apparently haven't been paying attention what has happened in the last two and a half years. The Chinese government is well aware of the problem of bad loans and has adressed the issue.\n \n As for my comments on Greenspan, what exactly is so rubbish about them?\n Greenspan's a hack, he set the interest rates at 1% just so people would borrow more in an attempt to polish the economic figures.\n \n He never gives a straight answer. During one of the Senate hearings a Senator became quite impatient with Greenspan because he kept avoiding the questions being asked to him.\n \n The Federal Reserve has never had a proper audit, the Federal Banking Agency Audit Act of 1978 prohibits the Government Accounting Office from including these items in their audits:\n \n (1) transactions for or with a foreign central bank, government of a foreign country, or nonprivate international financing organization;\n \n (2) deliberations, decisions, or actions on monetary policy matters, including discount window operations, reserves of member banks, securities credit, interest on deposits, and open market operations;\n \n (3) transactions made under the direction of the Federal Open Market Committee; or\n \n (4) a part of a discussion or communication among or between members of the Board of Governors and officers and employees of the Federal Reserve System related to clauses (1)-(3) of this subsection.\n \n And with it's 1% interest stunt the Federal Reserve has loaded the American public with debt which they can never hope to pay back. \n The Federal Reserve did nothing when it saw the stock bubble and is doing nothing now with the housing bubble.", 
   {
    "unicode_changes_made": true
   }, 
   129657, 
   null, 
   1117299180.0
  ], 
  [
   129674, 
   null, 
   "lord tammerlain", 
   "Greenspan's policies have been the major factor in creating the stock market bubble and the housing bubble. He is in my estimation deathly afraid of the fundamental deflationary forces that are facing the US economy. Instead he is working hard to ensure that inflation, ( really quite a bit higher then official numbers) takes care of that problem. \n \n He has done a reasonable job so far of walking that tightrope between deflating the bubbles, and the hyper inflation that generally results from excessively loose economic policies.", 
   {}, 
   129668, 
   null, 
   1117300080.0
  ], 
  [
   129679, 
   null, 
   "Missouri Mule", 
   "Yes I've read your two and a half year old doomsday articles. But you apparently haven't been paying attention what has happened in the last two and a half years. The Chinese government is well aware of the problem of bad loans and has adressed the issue.\n\n \n How have they addressed the issue?", 
   {}, 
   129668, 
   null, 
   1117300680.0
  ], 
  [
   129682, 
   null, 
   "Missouri Mule", 
   "Greenspan's policies have been the major factor in creating the stock market bubble and the housing bubble. He is in my estimation deathly afraid of the fundamental deflationary forces that are facing the US economy. Instead he is working hard to ensure that inflation, ( really quite a bit higher then official numbers) takes care of that problem. \n \n He has done a reasonable job so far of walking that tightrope between deflating the bubbles, and the hyper inflation that generally results from excessively loose economic policies.\n\n \n How are you sure about inflation here in the U.S.? I'm the one who is out looking at prices and I haven't seen this inflation. In fact in many respects we have had a collapse of prices in certain areas. \n \n I personally believe that housing is out of balance. One of the main reasons are the absurd appraisals that always seem to come right to the value of the loan. It's a sham. That may be about to end and like all things, what goes up has to come down. Evidently few people learned the lessons of the tech bubble in 2000. I'm not seeing it here but those fools in California are employing the \"greater fool\" theory and someone like all ponsi schemes is going to be left holding the bag. I don't get the rationale of blaming Greenspan for this. But yes, you are correct that he did have much concern about deflation. We all should. But I don't see how it can be argued that he wanted inflation to occur. Otherwise, why would he be raising interest rates on a regular basis? That doesn't compute.", 
   {}, 
   129674, 
   null, 
   1117300980.0
  ], 
  [
   129686, 
   null, 
   "lord tammerlain", 
   "The official US inflation rate is being heavily manipulated over the last few years. They are substituting items of an \"equivalent\" nature, when the original goes up beyond what is acceptable. A factor called Hedonics, is being used to adjust the rate (hedonics is when items are adjusted for added features/technology an example of which are washing machines, due to the higher level of features in todays washing machine its calculated factor in the Inflation rate is lowered).\n \n Then you have the housing costs, with the increase in house prices you would expect that to be reflected in the inflation rate, however they have substituted the prices for new home for rents to a certain level ( something that may have lowered the inflation rate by 1% as housing represent around 22% of the inflation rate I believe.", 
   {}, 
   129682, 
   null, 
   1117301760.0
  ], 
  [
   129688, 
   null, 
   "gamehuis", 
   "How have they addressed the issue?\n\n First of all they won't float the Yuan. Doing so would at this point in time would have a severe negative effect on the financial market.\n \n Secondly, they've given banks tight deadlines to reduce their bad loan ratio:\n \n http://www.china-ready.com/news/ChinasBigFourBanks080703.htm", 
   {}, 
   129679, 
   null, 
   1117302120.0
  ], 
  [
   129690, 
   null, 
   "gamehuis", 
   "How are you sure about inflation here in the U.S.? I'm the one who is out looking at prices and I haven't seen this inflation. In fact in many respects we have had a collapse of prices in certain areas.\n\n I guess you don't eat or use gasoline .", 
   {}, 
   129682, 
   null, 
   1117302360.0
  ], 
  [
   129691, 
   null, 
   "georged", 
   "Greenspan's policies have been the major factor in creating the stock market bubble and the housing bubble. He is in my estimation deathly afraid of the fundamental deflationary forces that are facing the US economy. Instead he is working hard to ensure that inflation, ( really quite a bit higher then official numbers) takes care of that problem. \n \n He has done a reasonable job so far of walking that tightrope between deflating the bubbles, and the hyper inflation that generally results from excessively loose economic policies.\n\n \n I'll be watching for return of the long bond in 2006. Treasury's first move will be substitution of fixed 30-year terms to replace existing internal debt to curb book exposure to rising interest rates. If broad US tariff measures against China are implemented prior to issuance, signaling substantial consumer price increases, treasury will do everything in its power to use long bonds to fix foreign entity debt service rates by reducing rollover issues while the public pounds sand with inflation. About a year of that and China will float the Yuan, making purchase of US debt without high yields even more undesirable. If treasury does use the long bond as I think they will, and the housing bubble breaks, the US public is in for the ride of their lives.\n \n I keep looking for recovery ability time period, but our expanding payment imbalance, declining capital and tax bases and lack of manufacturing competitiveness all point to an extended decline.", 
   {}, 
   129674, 
   null, 
   1117302420.0
  ], 
  [
   129693, 
   null, 
   "Missouri Mule", 
   "The official US inflation rate is being heavily manipulated over the last few years. They are substituting items of an \"equivalent\" nature, when the original goes up beyond what is acceptable. A factor called Hedonics, is being used to adjust the rate (hedonics is when items are adjusted for added features/technology an example of which are washing machines, due to the higher level of features in todays washing machine its calculated factor in the Inflation rate is lowered).\n \n Then you have the housing costs, with the increase in house prices you would expect that to be reflected in the inflation rate, however they have substituted the prices for new home for rents to a certain level ( something that may have lowered the inflation rate by 1% as housing represent around 22% of the inflation rate I believe.\n\n \n You are really kind of losing me here. In 1994 I paid $999 for a 22 cubic foot refrigerator by Amana. This year I bought a new Amana 26.5 cubic foot refrigerator by Amana. I paid $989 for it. Has all the bells and whistles, stainless steel, really nice. \n \n I purchased a new washer and dryer in 2001 when we moved here. Paid about $1,300. The same ones today are now on sale for $999. With more features yet.\n \n I bought a new F-150 Ford pickup four months ago. I paid little more than I paid for the same model in 1993 and it had less features and much less desirable than the new model. \n \n I think I know what inflation is. In 1965 I paid 79 cents for a two pound package of Velveeta cheese spread. I now pay $4.49 for the exact same thing. I haven't checked the inflation rate since 1965 but I suspect it runs roughly the same as the inflation on this package of cheese. \n \n One could also talk about the cost of electronics and computers. I was looking at an ad in Office Depot the other day and they had a scanner for $4.99 after rebate. I paid $150 about three years ago. \n \n I'm not seeing this hidden inflation you are talking about. If not for the cost of medical care (that would require an entirely new thread), I think we are getting far more for our money than we did in year's past and our incomes have risen substantially. \n \n What am I missing here?", 
   {}, 
   129686, 
   null, 
   1117302480.0
  ], 
  [
   129712, 
   null, 
   "georged", 
   "I guess you don't eat or use gasoline .\n\n \n This is a fairly accurate description of the overall effects of current US inflation; cycles leading to, perpetuation and results. While dated 2003, the primary factor of non-energy/food consumer prices, Chinese and other developing country labor, is still valid as is cause.\n \n http://www.mises.org/fullstory.aspx?control=1405\n \n As Lord T accurately points out, cooking the books has become a government specialty. Why spending deficits and supplementary funding aren't subtracted from annual GDP still amazes me.", 
   {}, 
   129690, 
   null, 
   1117305960.0
  ], 
  [
   129718, 
   null, 
   "jskufan", 
   "You are really kind of losing me here. In 1994 I paid $999 for a 22 cubic foot refrigerator by Amana. This year I bought a new Amana 26.5 cubic foot refrigerator by Amana. I paid $989 for it. Has all the bells and whistles, stainless steel, really nice. \n \n I purchased a new washer and dryer in 2001 when we moved here. Paid about $1,300. The same ones today are now on sale for $999. With more features yet.\n \n I bought a new F-150 Ford pickup four months ago. I paid little more than I paid for the same model in 1993 and it had less features and much less desirable than the new model. \n \n I think I know what inflation is. In 1965 I paid 79 cents for a two pound package of Velveeta cheese spread. I now pay $4.49 for the exact same thing. I haven't checked the inflation rate since 1965 but I suspect it runs roughly the same as the inflation on this package of cheese. \n \n One could also talk about the cost of electronics and computers. I was looking at an ad in Office Depot the other day and they had a scanner for $4.99 after rebate. I paid $150 about three years ago. \n \n I'm not seeing this hidden inflation you are talking about. If not for the cost of medical care (that would require an entirely new thread), I think we are getting far more for our money than we did in year's past and our incomes have risen substantially. \n \n What am I missing here?\n\n \n You're missing the fact that the price for many of the products you're buying has remained somewhat stable because they are being produced in a lower cost environment: another country. Even products such as appliances or domestically assembled automobiles are containing higher percentages of imported parts to help defray costs. We're keeping our costs of goods down by exporting their production to other countries. Unfortunately, the benefit of cheaper imported products is being offset by lower wages for some Americans as they gain first hand knowledge on what many here already know about the government's employment statistics: a job is not necessarily a job.", 
   {}, 
   129693, 
   null, 
   1117306500.0
  ], 
  [
   129721, 
   null, 
   "Waxy", 
   "\n I bought a new F-150 Ford pickup four months ago. I paid little more than I paid for the same model in 1993 and it had less features and much less desirable than the new model. \n\n \n I'm going to Missouri to buy my next truck! emoticon_wow emoticon_wow \n \n I bought a new F350 XLT Crew Cab 4X4 V10 in '02, I'd have to check my papers for the actual number, but IIRC, it was under $40,000 OTD, I checked on the '05s recently for a friend, and I couldn't touch the same truck for less than $47,000. A coil spring front suspension and a shiny new grill are worth $7000? \n \n The diesels were $55,000 plus! \n \n Actual MSRP's were closer to $55-65,000. FOR A ONE TON PICK UP TRUCK! \n \n That being said, I do agree that not everything is rising rapidly in price. Some items do seem to remain fairly consistent - computers and electronics come to mind - digital cameras, etc... as long as you don't have to have it the day it hits the shelves, there are some great deals to be had, and the prices are comparable to, in some cases better than, prices even 10 years ago. (Of course, none of these items are manufactured in NA.)\n \n Waxy", 
   {}, 
   129693, 
   null, 
   1117306920.0
  ], 
  [
   129722, 
   null, 
   "Missouri Mule", 
   "You're missing the fact that the price for many of the products you're buying has remained somewhat stable because they are being produced in a lower cost environment: another country. Even products such as appliances or domestically assembled automobiles are containing higher percentages of imported parts to help defray costs. We're keeping our costs of goods down by exporting their production to other countries. Unfortunately, the benefit of cheaper imported products is being offset by lower wages for some Americans as they gain first hand knowledge on what many here already know about the government's employment statistics: a job is not necessarily a job.\n\n \n Well, my Amana refrigerator was built in Iowa. (virtually all domestic content.) My Ford F-150 in Kansas City. My washer and dryer were made in New Zealand. I'm pretty sure my Velveeta cheese is made in America. And since I'm now hungry I think I will go cut me a slice.", 
   {}, 
   129718, 
   null, 
   1117306980.0
  ], 
  [
   129723, 
   null, 
   "Missouri Mule", 
   "I'm going to Missouri to buy my next truck! emoticon_wow emoticon_wow \n \n I bought a new F350 XLT Crew Cab 4X4 V10 in '02, I'd have to check my papers for the actual number, but IIRC, it was under $40,000 OTD, I checked on the '05s recently for a friend, and I couldn't touch the same truck for less than $47,000. A coil spring front suspension and a shiny new grill are worth $7000? \n \n The diesels were $55,000 plus! \n \n Actual MSRP's were closer to $55-65,000. FOR A ONE TON PICK UP TRUCK! \n \n That being said, I do agree that not everything is rising rapidly in price. Some items do seem to remain fairly consistent - computers and electronics come to mind - digital cameras, etc... as long as you don't have to have it the day it hits the shelves, there are some great deals to be had, and the prices are comparable to, in some cases better than, prices even 10 years ago. (Of course, none of these items are manufactured in NA.)\n \n Waxy\n\n \n I got off the phone with the local Ford dealer and gave them a heads-up on GM's decision to extend their incentives. (They'll have to adjust their prices in response) I could give you their e-mail or phone number and you could get their prices. Some of the prices I am seeing in the newspapers are making me dizzy. I thought I got a good deal in January. They are even better now. \n You're talking Canadian dollars, though. So, I don't know. \n \n BTW, I'm in Texas, now. I hail from Missouri.\n \n I'm looking in the Tyler newspaper as I speak. They have one up the road at $32,490. 2005 F350 Dually crewcab with diesel engine. Listed for $40,730. (not 4x4 though) You have to read the fine print though but those are the highlights.", 
   {}, 
   129721, 
   null, 
   1117307220.0
  ], 
  [
   129725, 
   null, 
   "daewoo", 
   "Well, my Amana refrigerator was built in Iowa. (virtually all domestic content.) My Ford F-150 in Kansas City. My washer and dryer were made in New Zealand. I'm pretty sure my Velveeta cheese is made in America. And since I'm now hungry I think I will go cut me a slice.\n\n \n Your amana refrigerator is assembeled in Iowa. The cooling components (compressor, heat exchangers, evaporator, etc...) are provided by Modine, and are all re-branded chinese products. No company in the US makes refrigeration quality heat exchangers any more. Even the insulation most likely comes from DuPonts mexisco factor, unless they got it from Owens Corning, in which case it came from Brazil.", 
   {}, 
   129722, 
   null, 
   1117308000.0
  ], 
  [
   129726, 
   null, 
   "Missouri Mule", 
   "Your amana refrigerator is assembeled in Iowa. The cooling components (compressor, heat exchangers, evaporator, etc...) are provided by Modine, and are all re-branded chinese products. No company in the US makes refrigeration quality heat exchangers any more. Even the insulation most likely comes from DuPonts mexisco factor, unless they got it from Owens Corning, in which case it came from Brazil.\n\n \n Then I stand corrected. You are sure about this, though. It was my impression that the compressor was a Tecumseh and I thought that was made in the U.S. \n \n In any event I'm reasonably certain my Velveeta is still made in the U.S. So I'm off to my ostensibly parts made in China Amana refrigerator go cut a slice and eat my lunch. I'm on my own this weekend.", 
   {}, 
   129725, 
   null, 
   1117308420.0
  ], 
  [
   129730, 
   null, 
   "jskufan", 
   "I got off the phone with the local Ford dealer and gave them a heads-up on GM's decision to extend their incentives. (They'll have to adjust their prices in response) I could give you their e-mail or phone number and you could get their prices. Some of the prices I am seeing in the newspapers are making me dizzy. I thought I got a good deal in January. They are even better now. \n You're talking Canadian dollars, though. So, I don't know. \n \n BTW, I'm in Texas, now. I hail from Missouri.\n \n I'm looking in the Tyler newspaper as I speak. They have one up the road at $32,490. 2005 F350 Dually crewcab with diesel engine. Listed for $40,730. (not 4x4 though) You have to read the fine print though but those are the highlights.\n\n \n Your gain is Ford's loss. Why do you figure they've gotten so generous with their pricing? Has their manufacturing cost gone down? Is steal cheaper? Has the UAW loosened their grip? Maybe their liability insurance has gone down from lack of litigation? Like the rest of our domestic manufacturers they're under intensive pressure from the lower cost import versions and will continue to subsidize sales with artificially low interest rates and huge rebates as long as they can. When all profits dry up and expenses continue to rise, they'll shut down and move to some third world country and offer you that same pick up at a similar price. But hey, at least inflation won't be an issue.", 
   {}, 
   129723, 
   null, 
   1117309440.0
  ], 
  [
   129732, 
   null, 
   "Waxy", 
   "I got off the phone with the local Ford dealer and gave them a heads-up on GM's decision to extend their incentives. (They'll have to adjust their prices in response) I could give you their e-mail or phone number and you could get their prices. Some of the prices I am seeing in the newspapers are making me dizzy. I thought I got a good deal in January. They are even better now. \n You're talking Canadian dollars, though. So, I don't know. \n \n BTW, I'm in Texas, now. I hail from Missouri.\n \n I'm looking in the Tyler newspaper as I speak. They have one up the road at $32,490. 2005 F350 Dually crewcab with diesel engine. Listed for $40,730. (not 4x4 though) You have to read the fine print though but those are the highlights.\n\n \n One interesting factor -\n \n When I was buying, I bought new for one reason only, I couldn't buy used.\n \n Every truck in western Canada that came off lease was put on a car hauler and exported to the USA, no questions asked. They didn't even bother trying to sell them in Canada. Dealers could get Canadian retail price for one and two year old trucks just by changing the dash to imperial and sending them to auction across the border. It was a full fledged cottage industry until the Loonie started shooting up and taking the wind out of their sales. The used market for trucks has dried up considerably as a result. \n \n I was actually offered a \"free truck\" when I was buying by one of the auto brokers here in town. I buy the truck, as he spec'd it out, and in one year (Ford requires that all trucks be registered in Canada for one year before they can be exported), I give it back to him with under 40,000 kms and he gives me another new one. I just continually make the payments. It was a sweetheart deal actually, but I had to make payments on a loaded diesel, and it was more than I wanted to spend, on top of that, I was concerned about exactly what happened, and being stuck with a truck I didn't really want.\n \n As for prices, I order what I want, and pay cash at fleet rate through the my company, so I'm quite certain that I won't get a better deal anywhere. The simple fact is, prices have gone WAY up on trucks in the last 2-3 years.\n \n Waxy", 
   {}, 
   129723, 
   null, 
   1117309740.0
  ], 
  [
   129734, 
   null, 
   "daewoo", 
   "Then I stand corrected. You are sure about this, though. It was my impression that the compressor was a Tecumseh and I thought that was made in the U.S. \n \n In any event I'm reasonably certain my Velveeta is still made in the U.S. So I'm off to my ostensibly parts made in China Amana refrigerator go cut a slice and eat my lunch. I'm on my own this weekend.\n\n \n The \"Tecumseh\" compressor is a re-branded modine. Tecumseh has not actually made their own refrigeration compressors for years. I only know this because Modine used to have 2 factories here in Emporia, one that made industrial heat exchangers, and the other that made \"Tecumseh\" compressors and smaller heat exchangers and evaporators for residential refrigeration units. They shut the second factory down several years ago and moved it to mexico. Theya re still producing 90+% of tecumsehs compressors, just dong it using mexicans in mexico instead of illegal aliens in the US.", 
   {}, 
   129726, 
   null, 
   1117310520.0
  ], 
  [
   129735, 
   null, 
   "georged", 
   "Your amana refrigerator is assembeled in Iowa. The cooling components (compressor, heat exchangers, evaporator, etc...) are provided by Modine, and are all re-branded chinese products. No company in the US makes refrigeration quality heat exchangers any more. Even the insulation most likely comes from DuPonts mexisco factor, unless they got it from Owens Corning, in which case it came from Brazil.\n\n \n We just reviewed appliances for our new home and went through this drill. We ended up with all imported appliances. And fixtures. And lumber. And etc., etc., etc. Cement, gravel and asphalt and cabinetry will be US products because they're local. If I could, I'd import the labor. \n \n Amana (Maytag) and one other are the only refrigerators even assembled in the US. They're under a IAM union contract, so that may well be just a matter of time as Maytag also services non-US markets and the new housing market here will slow. GE and other top line products not as dependent on cyclical mass housing construction as Maytag went to Mexico to service US markets years ago. GE makes few mistakes.", 
   {}, 
   129725, 
   null, 
   1117311060.0
  ], 
  [
   129740, 
   null, 
   "daewoo", 
   "We just reviewed appliances for our new home and went through this drill. We ended up with all imported appliances. And fixtures. And lumber. And etc., etc., etc. Cement, gravel and asphalt and cabinetry will be US products because they're local. If I could, I'd import the labor. \n \n Amana (Maytag) and one other are the only refrigerators even assembled in the US. They're under a IAM union contract, so that may well be just a matter of time as Maytag also services non-US markets and the new housing market here will slow. GE and other top line products not as dependent on cyclical mass housing construction as Maytag went to Mexico to service US markets years ago. GE makes few mistakes.\n\n \n this is a shell game that the Us public has not really caught on to yet. Virtually nothign is made in the USA anymore, unless union contracts have you tied down, in which case you are pretty much screwed in todays business world. Labor and compliance costs are too high, and frankly they can be better made in other coutnries because there is a better pool of skilled labor to choose from.\n \n I think this is key to the Bush Adminsitrations illusion that a lower dollar will helpt the US economy. If you do not take into account the fact that even items assembeled in the US are primarily assembeled from imported components, it actually looks good, on paper.", 
   {}, 
   129735, 
   null, 
   1117311780.0
  ], 
  [
   129747, 
   null, 
   "Dono", 
   "As an observer of this discussion, let me offer a review of some parts as I see them. First MM asks for the credentials of daewoo and George to speak on economics, indicating to me that he considered credentials to be relevant. They respond and ask MM for his. MM repeatedly avoids a direct response but does reveal that he didn't just fall off a turnip truck and knows **** from shinola. Based on this I will give more credence to daewoo and George on economics and give credence to MM should the subjects of vegetable truck equilibrium and ****/Shinola be proffered. \n Dono", 
   {}, 
   129654, 
   null, 
   1117316220.0
  ], 
  [
   129786, 
   null, 
   "georged", 
   "As an observer of this discussion, let me offer a review of some parts as I see them. First MM asks for the credentials of daewoo and George to speak on economics, indicating to me that he considered credentials to be relevant. They respond and ask MM for his. MM repeatedly avoids a direct response but does reveal that he didn't just fall off a turnip truck and knows **** from shinola. Based on this I will give more credence to daewoo and George on economics and give credence to MM should the subjects of vegetable truck equilibrium and ****/Shinola be proffered. \n Dono\n\n \n That turnip truck has been around so long one would think it worn out, but it seemingly always has people falling off. Currently bent government fiscal propaganda needs naive supporters, so I guess that's a prime example of supply and demand.", 
   {}, 
   129747, 
   null, 
   1117330200.0
  ], 
  [
   129790, 
   null, 
   "georged", 
   "this is a shell game that the Us public has not really caught on to yet. Virtually nothign is made in the USA anymore, unless union contracts have you tied down, in which case you are pretty much screwed in todays business world. Labor and compliance costs are too high, and frankly they can be better made in other coutnries because there is a better pool of skilled labor to choose from.\n \n I think this is key to the Bush Adminsitrations illusion that a lower dollar will helpt the US economy. If you do not take into account the fact that even items assembeled in the US are primarily assembeled from imported components, it actually looks good, on paper.\n\n \n I just took a look around my office and am proud to announce I saw one item made in the USA. I don't know if banjo picks will provide a deep enough base for payment balance recovery, but that's as good an opportunity as I'm seeing. \n \n Assembly as a new manufacturing base, it gets those manufacturing percentages in government numbers and also drives employment, can sustain GDP numbers using consumer/public debt to facilitate consumption. One hiccup and you have serious recovery problems because that collapses imports but provides really great numbers. Let's see if the public will bite on that one. \n \n What else can government do? They backed us into a corner, the public would never willingly accept a planned (pardon me while I laugh) reduction in their standard of living. Blame somebody else, like China. We have lot of balls in the air at one time.", 
   {}, 
   129740, 
   null, 
   1117332300.0
  ], 
  [
   129791, 
   null, 
   "jskufan", 
   "That turnip truck has been around so long one would think it worn out, but it seemingly always has people falling off. \n\n \n Let's hope it lasts a lot longer, as the new model will be subject to the proposed tariffs when we have to import it, and suddenly falling off will become out of reach for the average American. It's not that the cost of production in China is too low, it's more the cost here in America is too high. There will come a time when Chinese workers will organize themselves and demand higher wages, workman's compensation, medical insurance, pensions, and cost of living increases. Societal greed will nurture out of control liability insurance premiums due to exorbitant lawsuits against manufacturers. The Chinese government will impose environmental and safety regulations on industry that will force major increases in the cost of goods sold. Finally, after years and years of all these forces working against their domestic industry, providing there isn't another up and coming country looking to industrialize, we may again be in a position to compete for all those lost manufacturing jobs.", 
   {}, 
   129786, 
   null, 
   1117333560.0
  ], 
  [
   129813, 
   null, 
   "Missouri Mule", 
   "Your gain is Ford's loss. Why do you figure they've gotten so generous with their pricing? Has their manufacturing cost gone down? Is steal cheaper? Has the UAW loosened their grip? Maybe their liability insurance has gone down from lack of litigation? Like the rest of our domestic manufacturers they're under intensive pressure from the lower cost import versions and will continue to subsidize sales with artificially low interest rates and huge rebates as long as they can. When all profits dry up and expenses continue to rise, they'll shut down and move to some third world country and offer you that same pick up at a similar price. But hey, at least inflation won't be an issue.\n\n \n I'm not unaware of the reality of the marketplace and how this will impact Ford's profits. However, it is also true that the pickups and SUVs were always \"cash cows\" to both GM and Ford. I've not looked at the bottom line here but it appears to me that even if they have to operate at zero profit and/or even losses to get over the hump while GM goes under (as they will) it will be a necessary part of doing business. It is no secret that there is a worldwide excess amount of capacity and a glut of inventory (there's that old \"supply and demand\" again). At such a point that Ford or whoever is no longer making a profit they will have to do what they have to do to survive or they will go out of business. The reason I cannot work up much sympathy for GM is because they gave away everything to the UAW decades ago and then Ford and Chrysler had a gun held to their heads to agree to the same absurd wage demands. If I recall correctly, the total compensation package for a line employee is now about $65 per hour. As a consumer it is my duty to enjoy the savings. That's the reality of the marketplace.", 
   {}, 
   129730, 
   null, 
   1117342860.0
  ], 
  [
   129815, 
   null, 
   "Missouri Mule", 
   "this is a shell game that the Us public has not really caught on to yet. Virtually nothing is made in the USA anymore, unless union contracts have you tied down, in which case you are pretty much screwed in todays business world. Labor and compliance costs are too high, and frankly they can be better made in other coutnries because there is a better pool of skilled labor to choose from.\n \n I think this is key to the Bush Adminsitrations illusion that a lower dollar will help the US economy. If you do not take into account the fact that even items assembeled in the US are primarily assembeled from imported components, it actually looks good, on paper.\n\n \n Assuming for the moment that I agree with your analysis, what exactly is your solution to these alleged problems? Imagine you are a member of the U.S. Congress or the president, what legislation, etc., do you propose? What is your argument to the American people?", 
   {}, 
   129740, 
   null, 
   1117343160.0
  ], 
  [
   129816, 
   null, 
   "Missouri Mule", 
   "The \"Tecumseh\" compressor is a re-branded modine. Tecumseh has not actually made their own refrigeration compressors for years. I only know this because Modine used to have 2 factories here in Emporia, one that made industrial heat exchangers, and the other that made \"Tecumseh\" compressors and smaller heat exchangers and evaporators for residential refrigeration units. They shut the second factory down several years ago and moved it to mexico. Theya re still producing 90+% of tecumsehs compressors, just dong it using mexicans in mexico instead of illegal aliens in the US.\n\n \n Evidently you seem to be up on the status of where things are made. I won't attempt to argue the point. Let's assume that everything you say is factual. Your implied argument as best as I can tell is that this is destructive to the U.S. (that we no longer have much U.S. produced items.) I'm sure that you would agree that it is highly unlikely that Americans are inclined to purchase more expensive items simply because it says that they are \"Made in the U.S.) And yet we have very low unemployment, the highest per capita income in the entire world. And people from my vantage point seem to be living rather high on the hog. Granted that some people are living beyond their means through borrowing, etc., many others do not. We have more millionaires per capita than we have ever had in our history. We have the highest home ownership than we have ever had. If not for Iraq we might actually be able to balance the budget (we should regardless). Your implied argument seems to be that this standard of living cannot be sustained and we will inevitably have a lower standard of living because we are no longer producing most of our manufactured goods. In view of the fact that we have a low unemployment rate (and likely to go still lower), what are all of these people doing for a living? How is it that they are able to sustain their high standards of living? Is that all going to be swept away one way by a catastrophic financial collapse? We've been hearing for years that we are one or two years away from financial ruin and the next great depression will be on us. Somehow it never seems to happen. \n \n What am I missing here? What do you think is going to happen to our economy and if you ran things, what policies would you put into place to correct these deficiencies?", 
   {}, 
   129734, 
   null, 
   1117344060.0
  ], 
  [
   129845, 
   null, 
   "daewoo", 
   "That turnip truck has been around so long one would think it worn out, but it seemingly always has people falling off. Currently bent government fiscal propaganda needs naive supporters, so I guess that's a prime example of supply and demand.\n\n \n You would think by nowe there would be some governemnt regulation regarding restraints in turnip trucks. Side and frontal impact testing should be mandatory for them, and the UAW will want a piece, of course.", 
   {}, 
   129786, 
   null, 
   1117354860.0
  ], 
  [
   129846, 
   null, 
   "daewoo", 
   "Assuming for the moment that I agree with your analysis, what exactly is your solution to these alleged problems? Imagine you are a member of the U.S. Congress or the president, what legislation, etc., do you propose? What is your argument to the American people?\n\n \n \n I know of at least 1 senator, one ex senator, and 2 congressional reps that have purchased homes outside the country. They plan to ride it out, make money while there is money to be made, then flee the country before the American people realise how abdly they have been screwed and tear them apart in the streets. \n \n Sounds like a plan to me. You cnanot simply wave a wand and undo 25 years of rapid de-industrialization.", 
   {}, 
   129815, 
   null, 
   1117355040.0
  ], 
  [
   129847, 
   null, 
   "daewoo", 
   "Evidently you seem to be up on the status of where things are made. I won't attempt to argue the point. Let's assume that everything you say is factual. Your implied argument as best as I can tell is that this is destructive to the U.S. (that we no longer have much U.S. produced items.) I'm sure that you would agree that it is highly unlikely that Americans are inclined to purchase more expensive items simply because it says that they are \"Made in the U.S.) And yet we have very low unemployment, the highest per capita income in the entire world. And people from my vantage point seem to be living rather high on the hog. Granted that some people are living beyond their means through borrowing, etc., many others do not. We have more millionaires per capita than we have ever had in our history. We have the highest home ownership than we have ever had. If not for Iraq we might actually be able to balance the budget (we should regardless). Your implied argument seems to be that this standard of living cannot be sustained and we will inevitably have a lower standard of living because we are no longer producing most of our manufactured goods. In view of the fact that we have a low unemployment rate (and likely to go still lower), what are all of these people doing for a living? How is it that they are able to sustain their high standards of living? Is that all going to be swept away one way by a catastrophic financial collapse? We've been hearing for years that we are one or two years away from financial ruin and the next great depression will be on us. Somehow it never seems to happen. \n \n What am I missing here? What do you think is going to happen to our economy and if you ran things, what policies would you put into place to correct these deficiencies?\n\n \n \n \n Your naiton is either making money or loosing it. We are loosing it. there is no question of that. Even just looking at official trade numbers (which discount several important expenditures) shows this clearly.\n \n What you are seeing when it coes to new millionares, etc.. is the inevitable move to a two tiered system that comes with a service based economy. It is essnetially economically neutral for the nation. It is simply a matter of shiffiling money around internally.", 
   {}, 
   129816, 
   null, 
   1117355280.0
  ], 
  [
   129892, 
   null, 
   "georged", 
   "Your naiton is either making money or loosing it. We are loosing it. there is no question of that. Even just looking at official trade numbers (which discount several important expenditures) shows this clearly.\n \n\n \n For me a look at GDP components from 2000 on for both the US and China (or anyone else) is a pretty simple example of national fiscal direction. 2000 was our last year of gradual decline as an industrial nation, which began in the 1980s. From 2001 on, the shift from domestic manufacturing expansion gross dollars to consumer and government consumption has been dramatic with a corresponding increase in imports. Government expenditures facilitated by debt have tripled in that period, capital formation is unchanged and our tax base is in process of deterioration. We're dissipating our national wealth at an alarming rate with no foreseeable change. We're shoveling it out the door, replacing it with internal transactions and that means expanding the money supply with no new wealth entering the system.", 
   {}, 
   129847, 
   null, 
   1117383900.0
  ], 
  [
   129895, 
   null, 
   "Missouri Mule", 
   "I know of at least 1 senator, one ex senator, and 2 congressional reps that have purchased homes outside the country. They plan to ride it out, make money while there is money to be made, then flee the country before the American people realise how abdly they have been screwed and tear them apart in the streets. \n \n Sounds like a plan to me. You cnanot simply wave a wand and undo 25 years of rapid de-industrialization.\n\n \n Your example may be true but it is not significant so far as our national economy is concerned. What would you do if you held the levers of power to change things that you deem damaging to our long-term survival as an industrial and economic power? You're in charge; what do you do? What policies do you implement?\n \n I.E. Would you slap on big tariffs as per Pat Buchannan? Would you simply mandate that our trade be equalizied and no more trade deficits? Do you immediately balance the budget and no more deficits. Do you prohibite mortgages that have low down payments? Do you mandate domestic content in all manufactured goods in the U.S. such as the Amana refrigerator that you cited? Do we refuse to accept Chinese goods? Stop doing business with them? Do we go back to the gold standard? Do we abolish the Federal Reserve? \n \n Again, what would you do if you have the power to wave your magic wand and change things for the better as you see it?", 
   {}, 
   129846, 
   null, 
   1117385520.0
  ], 
  [
   129914, 
   null, 
   "georged", 
   "\n \n Again, what would you do if you have the power to wave your magic wand and change things for the better as you see it?\n\n \n I'd throw us into a deep economic recession, depression if necessary, to get the standard of living in line with our internal transaction based economy without further endangering our future. That would include requiring all union, civil service, SS, military retirement and social service COLAs to swing both ways, reduce the military to a defense posture and return the national guard to deal with inevitable civil violence. No need to send jobs off-shore, we have an adequate labor force here, they just haven't realized their true worth in a global economy. No different than any other remedy; repair the pain and move on without it. Very simple to achieve, I'd just publish real, unpolished numbers and let consumer confidence take its course. Basically a corporate turn-around, conserve as much cash as possible, use debt in a judicial manner, get rid of the deadwood and contingent liabilities while shaping market direction and goals. As a true fiscal conservative and Republican, I'm not afraid to admit I don't care about the little people nor do I have aspirations to make the history books. That's the reason I'm not a politician.", 
   {}, 
   129895, 
   null, 
   1117388160.0
  ], 
  [
   129922, 
   null, 
   "daewoo", 
   "Georges suggestions above sound good to me, though I would makie a few additions. I would slash and burn at the government level. No more payment transfers to states, highway spending cut in half, mediacaid out the window, a decline in EPA, DEA, FBI, Nsa spending. Get rid of that rediculous prescription drug plan and the majority of welfare entitlement plans. This will bolster our supply of cheap labor, as all the folks who previously enjoyed life as publiuc leeches are forced to scramble for jobs lest they be allowed to starve to death in the street (and like george, I care very little for the little man, so this does not especially bother me).", 
   {}, 
   129914, 
   null, 
   1117389060.0
  ], 
  [
   129945, 
   null, 
   "gamehuis", 
   "Heh, good to see that there are still some real Republicans left. :p", 
   {}, 
   129922, 
   null, 
   1117391400.0
  ], 
  [
   129954, 
   null, 
   "georged", 
   "Heh, good to see that there are still some real Republicans left. :p\n\n \n Cracks me up when I read posts by self-described Republican/conservatives supporting a false economy by government expansion and improving the standard of living in Iraq under the guise of defense or humanitarianism. Even my liberal friends have better fiscal sense than that. But they generally have more money than those afflicted with Islamania or fear of those Chinese commies and tend to read books rather than newspapers or watching TV.", 
   {}, 
   129945, 
   null, 
   1117392480.0
  ], 
  [
   129956, 
   null, 
   "Missouri Mule", 
   "Interesting. Well I might as well weigh in.\n \n I would abolish cash transactions in order to capture all of the tax revenues that are due. No reason why drug dealers should escape the IRS's clutches. I would have a genuine national ID card or a standard state ID that was not subject to being counterfeited. We must know and be able to determine who resides in or is visiting our country. I would embark immediatedly on a program to slash energy use and bar the importation of middle eastern oil. I would replace that with energy from Canada (at whatever price) and especially nuclear energy. I would get the rest from our own domestic sources such as coal conversion. I would drill everywhere. I would demand a balanced budget every year and refuse to accept anything less from Congress. The budget would be set in stone (a certain % of the national income) could never be constitutionally exceeded. \n \n I would have a constitutional convention and to eliminate gerrymandering. Congressional districting would be done through a computer program to be applied to all states. \n \n The U.N. would be kicked out of the U.S. within one year and we would refuse to participate unless it was restricted to true deomocratic nations. \n \n That just comes to mind and as one can easily see, none of this will ever happen. The budget will still be unbalanced. We will hem and haw on our border security. Congress will never agree to stop gerrymandering. And the environmental freaks will never agree to build nuclear plants. And of course our \"privacy\" fetish will never allow a true national ID card. But the U.N. is on shaky ground in public opinion and that just might happen.", 
   {}, 
   129945, 
   null, 
   1117392600.0
  ], 
  [
   129979, 
   null, 
   "georged", 
   "We need to open the borders to cheap labor until Americans become cognizant of their true labor value in a global marketplace. Otherwise commerce will just continue to export jobs to find those lower costs. A goal of servicing a portion of China's consumer population would use business plan labor overheads required to achieve the necessary penetration. Security would no longer be an issue. With a defensive military positioned in the US, Israel on its own and our vacating the ME, Islamania will be recognized for its racism content and rapidly fade as a political tool of fear. We can buy their oil, its the same price as Canada with no military costs. That's what the rest of the world does, and on a very successful basis.", 
   {}, 
   129956, 
   null, 
   1117394940.0
  ], 
  [
   129984, 
   null, 
   "Waxy", 
   "I would abolish cash transactions in order to capture all of the tax revenues that are due. \n \n \n My biggest pet peeve is waiting in line for some dumb XXX to pay for his $2 item by bank card or credit card. I live in a cash world, and I wouldn't have it any other way.\n \n IMHO, believing you can eliminate the black market by eliminating cash is also somewhat naieve.\n \n \nI would have a genuine national ID card or a standard state ID that was not subject to being counterfeited. We must know and be able to determine who resides in or is visiting our country. \n \n \n That is the most communist, or more correctly fascist idea I can imagine. I'm amazed that someone who considers themselves a \"conservative\" would even ponder such a thought.\n \n The \"right to bear arms\" clause would truly kick in for me if they ever tried that one.\n \n \nI would embark immediatedly on a program to slash energy use and bar the importation of middle eastern oil.\n\n \n Very little of the USA's oil comes from the middle east, check it out if you don't believe me. Now, if you decided you didn't want to deal with OPEC altogether, that's another story. \n \n It seems like cutting off your nose to spite your face to me though.\n \n \nI would replace that with energy from Canada (at whatever price) and especially nuclear energy. \n \n \n Really. emoticon_idea $$$$$$$$$$$$$$$ :p \n \n How's about 100 times the current rate? 1000 times? How far could we go before we become the next Iraq?\n \n As for nuclear, I completely agree. IMHO, nuclear is our best source of energy. Unfortunately it's been corrupted and research has been stopped due to weapons production and the irrational fears it sparks in the general public.\n \n \nI would get the rest from our own domestic sources such as coal conversion. \n \n \n Blood from a stone. It can be done, but it ain't pretty. That, and it actually operates at an energy deficit with current technology.\n \n \nI would drill everywhere.\n\n \n Why?\n \n There's no oil everywhere. Check the USGS website or the AAPG for more info.\n \n \nI would demand a balanced budget every year and refuse to accept anything less from Congress. The budget would be set in stone (a certain % of the national income) could never be constitutionally exceeded. \n \n \n I would love to see Canada's federal government adopt this policy. A few of the provinces have already done so. \n \n \nThe U.N. would be kicked out of the U.S. within one year and we would refuse to participate unless it was restricted to true deomocratic nations. \n \n \n I'm a true believer in the theory behind the UN, unfortunately, it has become rather ineffective, for a number of reasons.\n \n Waxy", 
   {}, 
   129956, 
   null, 
   1117395360.0
  ], 
  [
   129989, 
   null, 
   "Waxy", 
   " No more payment transfers to states, highway spending cut in half, mediacaid out the window, a decline in EPA, DEA, FBI, Nsa spending.\n\n \n Some of these ideas would seem rather counterproductive to me. We just got finished talking about how China's spending on infrastructure has positioned them well ahead of their competition.\n \n Letting ours deteriorate seems less than a perfect plan to me.\n \n Our environment is also key to our future, and disregarding it is a fatal plan IMHO.\n \n Also, it would seem to me that their might be more need than ever for the DEA and FBI if the second part of your plan kicks in. :p \n \n \nGet rid of that rediculous prescription drug plan and the majority of welfare entitlement plans. This will bolster our supply of cheap labor, as all the folks who previously enjoyed life as publiuc leeches are forced to scramble for jobs lest they be allowed to starve to death in the street (and like george, I care very little for the little man, so this does not especially bother me).\n\n \n I like this idea, in theory, in practice however, you'd have an angry mob on your hands, and those that are haves, had better be prepared for a fight.\n \n I know George has touched on this before.\n \n Waxy", 
   {}, 
   129922, 
   null, 
   1117395840.0
  ], 
  [
   129998, 
   null, 
   "daewoo", 
   "Some of these ideas would seem rather counterproductive to me. We just got finished talking about how China's spending on infrastructure has positioned them well ahead of their competition.\n \n Letting ours deteriorate seems less than a perfect plan to me.\n\n \n Currently, our highways are designed as 30 yr roads, but are all on a 5 yr reconstruction rotation. The road becomes checked or develops a marginally roung surface, and it gets REPLACED (not just resurfaced). This is rediculous. We can easily cut highway funds in half and still have a quite servicable highway system (especially since most of the states divert the lions share of highway tranfer payments to other programs). This is just life. Perfectly smooth, pothole free roads with paved shoulders an entire lane wide are nice. Unfortunatly, we cannot afford them any more. \n \n \nOur environment is also key to our future, and disregarding it is a fatal plan IMHO.\n\n \n \n Remove the $50,000 daily cap on EPA fees and let them keep 70% of fees collected. This will encourage them to put the work in required to get the big polluters, as opposed to nitpicking with small business owners over whether or not they need a class 2 or a class 3 air filtration unit. They do not mess witht he big boys because it is just not worth the headache. Make their survival dependant on it, and they will go the extra mile.\n \n \nAlso, it would seem to me that their might be more need than ever for the DEA and FBI if the second part of your plan kicks in. :p \n\n \n No, we will need national guard to maintain order if my plan kicked in. The US public is not going to take these transitions well. \n \n \n \nI like this idea, in theory, in practice however, you'd have an angry mob on your hands, and those that are haves, had better be prepared for a fight.\n \n I know George has touched on this before.\n\n \n Survival of the fittest.", 
   {}, 
   129989, 
   null, 
   1117397700.0
  ], 
  [
   130004, 
   null, 
   "daewoo", 
   "We need to open the borders to cheap labor until Americans become cognizant of their true labor value in a global marketplace. Otherwise commerce will just continue to export jobs to find those lower costs. A goal of servicing a portion of China's consumer population would use business plan labor overheads required to achieve the necessary penetration. Security would no longer be an issue. With a defensive military positioned in the US, Israel on its own and our vacating the ME, Islamania will be recognized for its racism content and rapidly fade as a political tool of fear. We can buy their oil, its the same price as Canada with no military costs. That's what the rest of the world does, and on a very successful basis.\n\n \n \n I disagree. We let some people starve to death in the streets, and folks will get the idea that thye have 2 options....get a job and live or refuse to work and die. It makes no difference to me which choice they make. We do not need cheap imported labor, we have an entire pool of worthless people here who can be put to work. They just need the proper motivation. As long as it is more profitable to sit at home than it is to sweep floors for $7 per hour, you are going to have too many folks sitting at home, and not enough floor sweepers.", 
   {}, 
   129979, 
   null, 
   1117398120.0
  ], 
  [
   130009, 
   null, 
   "georged", 
   "\n No, we will need national guard to maintain order if my plan kicked in. The US public is not going to take these transitions well. \n \n\n \n We're eventually going to need them here regardless of how the transition is made, slowly with crushing debt or as an executed plan where they help supply food kitchen logistics and maintain order. Most of Europe avoided our potential dilemma by being required out of necessity to service post WW2 social needs, capping military as a portion of budget revenue from tax base not GDP and avoiding massive public debt. We're not going to have post WW2 prosperity from dominating world markets to dig our way out of this one. And I seriously doubt that beyond temporarily eagerly accepting our debt to expand their industrial capability, China or anyone else is going to be real sympathetic to our looming problems.", 
   {}, 
   129998, 
   null, 
   1117399140.0
  ], 
  [
   130021, 
   null, 
   "Waxy", 
   "I disagree. We let some people starve to death in the streets, and folks will get the idea that thye have 2 options....get a job and live or refuse to work and die. It makes no difference to me which choice they make. We do not need cheap imported labor, we have an entire pool of worthless people here who can be put to work. They just need the proper motivation. As long as it is more profitable to sit at home than it is to sweep floors for $7 per hour, you are going to have too many folks sitting at home, and not enough floor sweepers.\n\n \n I completely agree with you on this one.\n \n We don't need more people, in fact, I think more people is a bad idea. What we need is to give the people we already have a reality check.\n \n I'm guessing there's more than enough of them to pick up the slack. If not, trimming the gov't/civil service fat would add a whole legion of new workers (albeit poor ones :p ). \n \n You just have to make the jobs that currently only the immigrant workers are willing to do appealing to those currently not working. The quickest way to do that is to eliminate their monthly check - provide them with a little motivation if you will.\n \n Of course it's far more complicated than that in reality, but in theory, I'm all for it.\n \n Also, being somewhat of a softy, I would like to ensure that those that truly require assistance are getting it.\n \n Waxy", 
   {}, 
   130004, 
   null, 
   1117400700.0
  ], 
  [
   130214, 
   null, 
   "squid", 
   "Double Post, Sorry.", 
   {}, 
   130021, 
   null, 
   1117439460.0
  ], 
  [
   130215, 
   null, 
   "squid", 
   "No doubt China is a major player, and will continue to become stronger on the global stage. As has been mentioned earlier in this thread, Chinese demand for products such as steel, iron ore, and coal has sky rocketed in the recent past, and Australia has capitalized on this increased demand. Contracts for supplying China with natural gas valued at $30Bn+ have also been sealed. The Chinese have indeed been pumping resources into infrastructure, and it is starting to pay off. \n \n I am not a fan of tariffs. Most of the time they are used to protect inefficient sectors of the economy, industries which really represent a misallocation of resources. But what has been said is true, that the US don't have large industries in the same areas of goods and services that the Chinese are importing, it does make this look like a money grabbing exercise because their is no domestic industry to protect. \n \n The Australian Government, in conjunction with the Chinese, have set up joint committies to discuss a Free Trade Agreement between the two countries. It's exciting that some foreign economies are starting to perk up a little because we were getting kind of lonely. ;)", 
   {}, 
   130021, 
   null, 
   1117439580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Yuan, again", 
  "url": "http://www.4forums.com/political/economic-advice/5412-yuan-again.html", 
  "breadcrumbs": [
   "Economic Advice"
  ], 
  "id_number": 5412, 
  "discussion_files": [
   [
    "12639.html", 
    "http://www.4forums.com/political/economic-advice/5412-yuan-again-print.html"
   ], 
   [
    "12640.html", 
    "http://www.4forums.com/political/economic-advice/5412-yuan-again-8-print.html"
   ], 
   [
    "12641.html", 
    "http://www.4forums.com/political/economic-advice/5412-yuan-again-6-print.html"
   ], 
   [
    "12642.html", 
    "http://www.4forums.com/political/economic-advice/5412-yuan-again-4-print.html"
   ], 
   [
    "12643.html", 
    "http://www.4forums.com/political/economic-advice/5412-yuan-again-5-print.html"
   ], 
   [
    "12644.html", 
    "http://www.4forums.com/political/economic-advice/5412-yuan-again-7-print.html"
   ], 
   [
    "12645.html", 
    "http://www.4forums.com/political/economic-advice/5412-yuan-again-3-print.html"
   ], 
   [
    "12646.html", 
    "http://www.4forums.com/political/economic-advice/5412-yuan-again-2-print.html"
   ]
  ], 
  "identifier": 5412
 }
]