[
 [
  [
   128773, 
   null, 
   "Clive14", 
   "http://news.bbc.co.uk/1/hi/technology/4576855.stm\n \n Now everyone can play their own perfect blend of evolution and creation in the comfort of their own home! \n \n Not sure it'll be any use as a tool for explaining how evolution works (it sounds like it'll use fully artificial selection principles, rather than natural selection ones for example). It sound slike it will be fun though, especially if you enjoy \"God Sim\" type games.", 
   {
    "post_info": {
     "post_title": "Play God and Create your own Life Forms"
    }
   }, 
   null, 
   null, 
   1117127880.0
  ], 
  [
   128811, 
   null, 
   "unkerpaulie", 
   "http://news.bbc.co.uk/1/hi/technology/4576855.stm\n \n Now everyone can play their own perfect blend of evolution and creation in the comfort of their own home! \n \n Not sure it'll be any use as a tool for explaining how evolution works (it sounds like it'll use fully artificial selection principles, rather than natural selection ones for example). It sound slike it will be fun though, especially if you enjoy \"God Sim\" type games.\n\n lol this is really funny. i think this will be a great fun way to misinform a huge number of young people as to how evolution works. look what happened with spongebob. would you believe that lots of children think they actually get those yellow dishwashing sponges from the sea? lol\n \n looks like fun though", 
   {}, 
   128773, 
   null, 
   1117131660.0
  ], 
  [
   129000, 
   null, 
   "Wraith", 
   "I know a lot about this game and have been following it closely.\n \n Here's a good forum if you'd like to research it more... \n \n As to whether it is a good aid for explaining evolution I would say no.\n \n In reality you as 'the god' have complete control over the creature and it's appearance as it develops -- the game itself is a cartoonish parody of the stages of development of life from single celled organisms to intelligent nation building species (and beyond).\n \n Your creature's species succeeds because of your interaction rather than because it's design is the most optimum. The game then does not simulate evolution rather it uses it as part of the 'story line' because it is you and not natural selection who gets to decided whether the animal grows another limb or not.\n \n Having said all this I'm very much looking forward to it's release... projected to be in the third quarter of next year. :(", 
   {
    "unicode_changes_made": true
   }, 
   128811, 
   null, 
   1117149060.0
  ], 
  [
   129086, 
   null, 
   "Tastyfish", 
   "Sure it won't beat Sim-earth and if you want to really play God, think Black and White 2 looks far more fun.\n \n The combining of everyone's creatures seemed interesting too, think it was gamespy that said that its not MMO, but instead it picks successful creatures and then has spreads them over the world as computer controlled ones. From the sound of it you only control one actual creature rather than a speicies", 
   {}, 
   129000, 
   null, 
   1117165140.0
  ], 
  [
   129198, 
   null, 
   "Wraith", 
   "From the sound of it you only control one actual creature rather than a speicies\n\n \n No, there's many stages but it's only in the early ones that you control one creature (it lays and egg and then you control the offspring). In the later stages you control entire towns of creatures and eventually multiple planets with different colonies. Indeed you will be able to have tanks, planes, ships, sub marines, and space ships under your control fighting other civilisations like an RTS.\n \n Imagine this is a single player game but a master server harvests the player created content (like your creature and it's society and culture) to populate other people's game.\n \n Indeed, when you start the game the game will download creatures based on the needs of the environment. So say the ecosystem needs a couple of species of small carnivores, a medium and large herbivore, and one large super carnivore, the game will log onto the master system and pick said creatures from all those uploaded by other people.\n \n Every time you find a new planet in the simulated galaxy the computer will automatically populate it with suitable creatures created by everyone else in the world who is playing the game.\n \n Black & White 2 looks really good but I'd far rather have Spore going by what I know about it at the moment.", 
   {}, 
   129086, 
   null, 
   1117196100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Play God and Create your own Life Forms", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5413-play-god-create-your-own-life-forms.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 5413, 
  "discussion_files": [
   [
    "4004.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5413-play-god-create-your-own-life-forms-print.html"
   ]
  ], 
  "identifier": 5413
 }
]