[
 [
  [
   128996, 
   null, 
   "Uncle Sam I am", 
   "There's so much debate over whether or not a fetus is a human being.\n \n But no one would be born into this world without first being an embryo, and then developing into a fetus.\n \n If your mother had an abortion while YOU were in the womb, would YOU \"be a human being\" right now? I doubt it.\n \n A fetus has been proven to be alive. It has a heart beat and a developing body. New ultrasound technology has even proven that babies in the womb smile when external stimulus like an abdomen rub is introduced.\n \n Each one of us goes through continuous stages of development, begining with the embryonic stage, and ending with the break down of the body in old age (if we live that long). Some say that the brain is not developed in a fetus though. But the brain is not yet fully developed in a 2 year old either. Should we allow 2 year olds to be killed?\n \n So, if a fetus is not human, then what were YOU at that stage of development? Could YOU have been killed during an abortion, or would it just have been a glob of tissue (which conveniently resulted in your non-existence)?", 
   {
    "post_info": {
     "post_title": "Is there anyone here who has NEVER been a fetus in the womb?"
    }
   }, 
   null, 
   null, 
   1117148820.0
  ], 
  [
   128998, 
   null, 
   "Nurglitch", 
   "If we're going to talk about identity, it might help to situate the discussion. Here's an article: http://plato.stanford.edu/entries/identity/", 
   {}, 
   128996, 
   null, 
   1117148940.0
  ], 
  [
   128999, 
   null, 
   "Hunter", 
   "Let us not forget that as a fetus is a living human being, that human also has a soul.", 
   {}, 
   128996, 
   null, 
   1117149000.0
  ], 
  [
   129006, 
   null, 
   "Sigma", 
   "But no one would be born into this world without first being an embryo, and then developing into a fetus.\n\n \n True. You're point?\n \n \n\n If your mother had an abortion while YOU were in the womb, would YOU \"be a human being\" right now? I doubt it.\n\n \n Is this what you're so afraid of? Are you insecure that if your mother had a choice she would not have wanted to have you? Personally, I am glad my mother chose to have me. I am also glad she had a choice whether or not to have me.\n \n I would never be so disrespectful as to say \"You could have made the wrong choice with me so I'm going to make sure you never have that choice again!\".\n \n \n\n New ultrasound technology has even proven that babies in the womb smile when external stimulus like an abdomen rub is introduced.\n\n \n I had not heard this... do you have a source on it?\n \n \n\n So, if a fetus is not human, then what were YOU at that stage of development?\n\n \n A fetus.\n \n \n\n Could YOU have been killed during an abortion, or would it just have been a glob of tissue (which conveniently resulted in your non-existence)?\n\n \n Without any consciousness is there any ME? A philosophical question. If I had been aborted, I would have never known and I would have never cared.", 
   {}, 
   128996, 
   null, 
   1117149660.0
  ], 
  [
   129007, 
   null, 
   "sinjin", 
   "Let us not forget that as a fetus is a living human being, that human also has a soul.\n\n \n That would be a matter of faith not fact.", 
   {}, 
   128999, 
   null, 
   1117149780.0
  ], 
  [
   129025, 
   null, 
   "Uncle Sam I am", 
   "Are you insecure that if your mother had a choice she would not have wanted to have you? Personally, I am glad my mother chose to have me. I am also glad she had a choice whether or not to have me.\n\n I was put up for adoption in 1959. My mother was a teenager (according to the foster parents who had me). I probably would have been aborted if it were legally possible at the time.\n \n As the old adage goes; \"It's not a choice, it's a baby.\" Life is more important than a womans convenience. There is always adoption. No one is forcing the woman to raise the baby.\n \n \nI had not heard this... do you have a source on it?\n\n http://www.wombswindow.com/\n http://news.bbc.co.uk/2/hi/health/3105580.stm\n http://cognews.com/1063910084/index_html\n \n \nWithout any consciousness is there any ME? A philosophical question. If I had been aborted, I would have never known and I would have never cared.\n\n How do you know that babies in the womb have no consciousness? According to those reports I have cited, there is considerable evidence to the contrary.\n \n Even so, a person in a coma has no consciousness, yet many come out of them all the time.\n \n There is no one in the world like YOU. Your DNA and chromisomes cannot be duplicated. If you are aborted in the womb, all of the talents and traits of character that make you special would cease to exist. Just because you didn't know you were aborted, and someone else would be born that same day, does not negate the fact that there would never be another YOU. If Mozart had never been born, would someone else have written the exact same symphonies that have amazed people for centuries? If Michael Jordan had never been born, would Chicago (where I'm from) ever have had anything to cheer about for decades?\n \n The ME, that you mention, is not something that just appears out of nowhere. It is a long process of development, from an embryo, to a fetus, to a toddler, to an adolecent, to a teenager, to a young adult, to a middle aged adult, to an old adult. Who are we to say that the first stages of development are unimportant?", 
   {}, 
   129006, 
   null, 
   1117153020.0
  ], 
  [
   129026, 
   null, 
   "Voice Of Reason", 
   "That would be a matter of faith not fact.\n\n \n The soul part might be but not the living human being.......", 
   {}, 
   129007, 
   null, 
   1117153020.0
  ], 
  [
   129032, 
   null, 
   "sinjin", 
   "The soul part might be but not the living human being.......\n\n \n The human \"being\" part is opinion not fact.", 
   {}, 
   129026, 
   null, 
   1117154460.0
  ], 
  [
   129037, 
   null, 
   "Voice Of Reason", 
   "The human \"being\" part is opinion not fact.\n\n \n Maybe for the pro abortion people but not for the pro life people.......We believe life begins at conception.............", 
   {}, 
   129032, 
   null, 
   1117155000.0
  ], 
  [
   129041, 
   null, 
   "Sigma", 
   "Uncle Sam I am,\n \nI was put up for adoption in 1959. My mother was a teenager (according to the foster parents who had me). I probably would have been aborted if it were legally possible at the time.\n\n \n And so you want to make sure no one has that choice, because it could have happened to you?\n \n Make no mistake, I truly am grateful that my mother chose to have me. I also am very glad that she had that choice. I would never want her to have had me merely because she had no other choice. Perhaps the fact that she gave you up makes you more insecure than me, and I can understand if that is the case.\n \n \n\n As the old adage goes; \"It's not a choice, it's a baby.\" Life is more important than a womans convenience. There is always adoption. No one is forcing the woman to raise the baby.\n\n \n You are, however, advocating forcing her to continue the pregnancy and forcing her to give birth.\n \n Your rhetoric non-withstanding, whether or not to have an abortion is a choice.\n \n \n\n http://www.wombswindow.com/\n http://news.bbc.co.uk/2/hi/health/3105580.stm\n http://cognews.com/1063910084/index_html\n\n \n Thank you :) This doesn't change my view in the slightest, but I'm always interested in such things.\n \n ETA, the sites mention nothing of reaction to outside stimulus such as an abdomen rub, and theorize that it is a reflex.\n \n \n\n How do you know that babies in the womb have no consciousness? According to those reports I have cited, there is considerable evidence to the contrary.\n\n \n According to every reliable source I have ever read, a fetus does not even have the machinery capable of supporting consciousness during the time-frame that the vast majority of abortions are performed.\n \n \n\n Even so, a person in a coma has no consciousness, yet many come out of them all the time.\n\n \n Yay for them :)\n \n \n\n There is no one in the world like YOU. Your DNA and chromisomes cannot be duplicated. If you are aborted in the womb, all of the talents and traits of character that make you special would cease to exist.\n\n \n If I were aborted, I would have had no talents or traits or character.\n \n \n\n Just because you didn't know you were aborted, and someone else would be born that same day, does not negate the fact that there would never be another YOU.\n\n \n There was never a ME in the first place. I didn't cease to be, I had never existed in the first place.\n \n \n\n If Mozart had never been born, would someone else have written the exact same symphonies that have amazed people for centuries? If Michael Jordan had never been born, would Chicago (where I'm from) ever have had anything to cheer about for decades?\n\n \n If Hitler had never been born? What then? This line of reasoning is empty\n \n \n\n The ME, that you mention, is not something that just appears out of nowhere. It is a long process of development, from an embryo, to a fetus, to a toddler, to an adolecent, to a teenager, to a young adult, to a middle aged adult, to an old adult.\n\n \n Truly, the self is constantly in a state of re-invention.\n \n \n\n Who are we to say that the first stages of development are unimportant?\n\n \n Who says that?\n \n Voice of Reason,\n \nMaybe for the pro abortion people but not for the pro life people.......We believe life begins at conception.............\n\n \n Being human and alive is distinct from a human \"being\", which is his point I believe.", 
   {
    "unicode_changes_made": true
   }, 
   129037, 
   null, 
   1117155240.0
  ], 
  [
   129062, 
   null, 
   "Sigma", 
   "There is no one in the world like YOU. Your DNA and chromisomes cannot be duplicated. If you are aborted in the womb, all of the talents and traits of character that make you special would cease to exist. Just because you didn't know you were aborted, and someone else would be born that same day, does not negate the fact that there would never be another YOU. \n\n \n Refering to this passage specifically (separate from my post replying to you above) I wanted to share a passage from Steven Pinker's book \"The Blank Slate\" that provides an interesting perspective to those who believe DNA a person makes.\n \n \nIn the face of these difficult choices it is tempting to look to biology to find or ratify boundaries such as \"when life begins.\" But that only highlights the clash between two incommensurable ways of conceiving life and mind. The intuitive and morally useful concept of an immaterial spirit simply cannot be reconciled with the scientific concept of brain activity emerging ggradually in ontogeny and phylogeny. No matter where we try to draw the line between life and nonlife, or between mind and nonmind, ambiguous cases pop up to challenge our moral intuitions. \n \n The closest event we can find to a thunderclap marking the entry of a soul into the world is the moment of conception. At that instant a new human genome is determined , and we have an entity destined to develop into a unique individual. The Catholic Church and certain other Christian denominations designate conception as the moment of ensoulment and the beginning of life (which, of course, makes abortion a form of murder). But just as a microscope reveals that a straight edge is really ragged, research on human reproduction shows that the \"moment of conception\" is not a moment at all. Sometimes several sperm penetrate the outer membrane of the egg, and it takes time for the egg to eject the extra chromosomes. What and where is the soul during this interval? Even when a single sperm enters, its genes remain separate from those of the egg for a day or more, and it takes yet another day or so for the newely merged genome to control the cell. So the \"moment\" of conception is in fact a span of twenty-four to forty-eight hours. Nor is the conceptus destined to become a baby. Between two-thirds and three-quarters of them never implant in the uterus and are spontaneously aborted, some because they are genetically defective, others for no descernible reason.\n \n Still, one might say that at whatever point during this interlude the new genome is formed, the specification of a unique new person has come into existence. The soul, by this reasoning, may be identified with the genome. But during the next few days, as the embryo's cells begin to divide, they can split into several embryos, which develop into identical twins, triplets, and so on. Do identical twins share a soul? Did the Dionne quintuplets make do with one-fifth of a soul each? If not, where did the four extra souls come from? Indeed, every cell in the growing embryo is capable, with the right manipulations, of becoming a new embryo that can grow into a child. Does a multicell embryo consist of one soul per cell, and if so, where do the other souls go when the cells lose that ability? And not only can one embryo become two people, but two embryos can become one person. Occasionally two fertilized eggs, which ordinarily would go on to become fraternal twins, merge into a single embryo that develops into a person who is a genetic chimera: some of her cells have one genome, others have another genome. Does her body house two souls?\n [snip]\n \n The idea that ensoulment takes place at conception is not only hard to reconcile with biology but does not have the moral superiority credited to it. It impplies that we should prosecute users of intrauterine contraceptive devices and the \"morning-after pill\" for murder, because they prevent the conceptus from implanting. It implies that we should divert medical research from curing cancer and heart disease to preventing the spontaneous miscarriages of vast numbers of microscopic conceptuses.[snip] And it flouts the key moral intuition that other people are worthy of moral consideration because of their feelings--their ability to love, think, plan, enjoy, and suffer-- all of which depend on a functioning nervous system.\n [snip]\n \n The discovery that what we call \"the person\" emerges piecemeal from a gradual developing brain forces us to reframe problems in bioethics. It would have been convenient if biologists had discovered a point at which the brain is fully assembled and is plugged in and turned on for the first time, but that is not how brains work. The nervous system emerges in the embryo as a simple tube and differenciates into a brain and spinal cord. The brain begins to function in the fetus, but it continues to wire itself well into childhood and even adolescence. The demand by both religious and secular ethicists that we identify the \"criteria for personhood\" assumes that a dividing line in the brain development can be found. But any claim that such a line has been sighted leads to moral absurdities.\n\n \n He also proposes a sort of solution.\n \n \n\n There is no solution to these dilemmas, because they arise out of a fundamental incommensurability: between our intuitive psychology, with its all-or-none concept of a person or soul, and the brute facts of biology, which tell us taht the human brain evolved gradually, develops gradually, and can die gradually. And that means that moral conundrums such as abortion, euthanasia and animal rights will never be resolved in a decisive and intuitively satisfying way.[snip] As the bioethicist Ronald Green has pointed out, it just means we have to reconceptualize the problem: from finding a boundary in nature to choosing a boundary that best trades off the conflicting goods and evils for each policy dilemma\n", 
   {}, 
   129025, 
   null, 
   1117161960.0
  ], 
  [
   129075, 
   null, 
   "Symbiote", 
   "I was born in an egg on a mountaintop.", 
   {}, 
   129062, 
   null, 
   1117163400.0
  ], 
  [
   129076, 
   null, 
   "xeiah", 
   "Is there anyone who was not first an ova and a sperm?\n \n Do those have souls? \n \n I am having an abortion each time I menstrate?\n \n If so I haven't been signing any state concent forms. OOOPS!", 
   {}, 
   129075, 
   null, 
   1117163760.0
  ], 
  [
   129081, 
   null, 
   "Uncle Sam I am", 
   "And so you want to make sure no one has that choice, because it could have happened to you?\n\n There is a choice, it's called abstinance. You make it sound as if someone just forced the woman's legs open and impregnated her. Why is it that she has a choice when it comes to abortion, but she doesn't seem to have a choice when it comes to spreading her legs?\n \n \nYou are, however, advocating forcing her to continue the pregnancy and forcing her to give birth.\n\n I think that is a small price to pay compared with the death of a baby. After all it takes two to tango. She didn't just get knocked up without taking that chance (rape victims not included).\n \n \nYour rhetoric non-withstanding, whether or not to have an abortion is a choice.\n\n So is murder, theft, arson, blackmail, and doing laundry.\n \n \nETA, the sites mention nothing of reaction to outside stimulus such as an abdomen rub, and theorize that it is a reflex.\n\n That part was from what I saw on the television news when the story broke.\n \n \nAccording to every reliable source I have ever read, a fetus does not even have the machinery capable of supporting consciousness during the time-frame that the vast majority of abortions are performed.\n\n This becomes a grey area and is debateable especially in the realm of religion. The bible says that God knew us before we were born. The text implies that God can communicate even with those who humans cannot communicate with\n \n \nIf I were aborted, I would have had no talents or traits or character.\n \n There was never a ME in the first place. I didn't cease to be, I had never existed in the first place.\n\n But the DNA and chromisomes that were in place before birth knew who you would be.\n \n \nIf Hitler had never been born? What then? This line of reasoning is empty\n\n The truth is, we have no idea who we are aborting, or what kind of genius or wicked person it may be. This is why we should not play God by being the ones to decide life or death.", 
   {
    "unicode_changes_made": true
   }, 
   129041, 
   null, 
   1117164720.0
  ], 
  [
   129109, 
   null, 
   "jitobear", 
   "Life is more important than a womans convenience. There is always adoption. No one is forcing the woman to raise the baby.\n\n \n I do not believe abortion is generally about convenience because preganancy is more than mere inconvenience. Even if she does not have to raise the child, it does not mean she is emotionally, mentally, physically, or economically able to support a pregnancy.\n \n I have frequently suggested finding ways of bringing abortion down by addressing these issues - but according the lifers around here these problems don't exist and all that needs to be done is taking punitive measures against women.\n \n But then - when they take that stance they really do lose all credibility. At least for me. Wouldn't leave my kid alone with someone who loves like that.", 
   {}, 
   129025, 
   null, 
   1117169460.0
  ], 
  [
   129151, 
   null, 
   "Voice Of Reason", 
   "I do not believe abortion is generally about convenience because preganancy is more than mere inconvenience. Even if she does not have to raise the child, it does not mean she is emotionally, mentally, physically, or economically able to support a pregnancy.\n \n I have frequently suggested finding ways of bringing abortion down by addressing these issues - but according the lifers around here these problems don't exist and all that needs to be done is taking punitive measures against women.\n \n But then - when they take that stance they really do lose all credibility. At least for me. Wouldn't leave my kid alone with someone who loves like that.\n\n \n No one, I repeat no one wants to take punitive actions against any woman unless you call carrying the baby to term punitive action.........\n \n All we want is for the baby in the womb to have the same chance you did if possible...........", 
   {}, 
   129109, 
   null, 
   1117174020.0
  ], 
  [
   129173, 
   null, 
   "Nurglitch", 
   "All we want is for the baby in the womb to have the same chance you did if possible.\n So if Jitobear's mother had the option to abort Jitobear in utero, you want Jitobear to have the same option with any children she carries? That's awfully progressive of you.", 
   {}, 
   129151, 
   null, 
   1117177500.0
  ], 
  [
   129190, 
   null, 
   "Zardoz", 
   "IIRC, I have no memories of ever being a 'fetus in a womb'. There is no conclusive proof stating I was ever a fetus in a womb so, I must assume I wasn't ever a fetus...in a womb.\n \n What's the point to this thread?", 
   {}, 
   129173, 
   null, 
   1117188000.0
  ], 
  [
   129241, 
   null, 
   "Sigma", 
   "Uncle Sam I am,\n \nThere is a choice, it's called abstinance. You make it sound as if someone just forced the woman's legs open and impregnated her. Why is it that she has a choice when it comes to abortion, but she doesn't seem to have a choice when it comes to spreading her legs?\n\n \n Oh of course! How could I forget that a woman can be abstinent and the pregnancy just goes away.\n \n Yes, she has the choice whether or not to have sex. She also has the choice whether or not to remain pregnant.\n \n \n\n I think that is a small price to pay compared with the death of a baby.\n\n \n Stripping rights away is never a small price to pay.\n \n \n\n So is murder, theft, arson, blackmail, and doing laundry.\n\n \n Agreed :)\n \n \n\n This becomes a grey area and is debateable especially in the realm of religion. The bible says that God knew us before we were born. The text implies that God can communicate even with those who humans cannot communicate with\n\n \n My invisible cake tells me you're wrong.\n \n \n\n But the DNA and chromisomes that were in place before birth knew who you would be.\n\n \n My DNA and chromosomes know nothing.\n \n \n\n The truth is, we have no idea who we are aborting, or what kind of genius or wicked person it may be. This is why we should not play God by being the ones to decide life or death.\n\n \n So if we decide the fetus lives we're playing God as well, eh? Damned if we do damned if we don't ;)\n \n We shouldn't decide, the woman should decide. She has authority over her own body.\n \n Voice of Reason,\n \nNo one, I repeat no one wants to take punitive actions against any woman unless you call carrying the baby to term punitive action.........\n\n \n If you're legislating it into a legal consequence you are using it as a punishment.", 
   {}, 
   129081, 
   null, 
   1117210860.0
  ], 
  [
   129252, 
   null, 
   "jitobear", 
   "No one, I repeat no one wants to take punitive actions against any woman unless you call carrying the baby to term punitive action.........\n\n \n \n \nIf you're legislating it into a legal consequence you are using it as a punishment.\n\n \n Especially if you refuse to acknowledge or address the issues women faced with unwanted pregnancy have.\n \n \n \nAll we want is for the baby in the womb to have the same chance you did if possible...........\n\n \n \n Please don't bring, me, my mother and her potential actions up as justification. I was raised pro-choice. I am mad as hell about the lack of options my mother and grandmother had - and so are/were they (my grandma as she is now deceased).\n \n My mother was not allowed to get her tubes tied without my father's permission. Something she only got because her doctor lied to him about her ability to have future children. This same man, who got to control my mother's reproductive organs, walked on his kids less than ten years later.\n \n My grandmother raised 11 children in a one room shack at time when women could barely make a living or get a divorce. My grandpa was crazy, abusive and did not work. Despite efforts she was not granted birth control without his permission, which he would not give.\n \n My grandmother was the first person to tell me that my life and body are mine. Once laws changed my grandma could be quoted saying \"I wouldn't take a million dollars for any of my kids, but I won't pay a penny for another.\"", 
   {}, 
   129241, 
   null, 
   1117213260.0
  ], 
  [
   129385, 
   null, 
   "Voice Of Reason", 
   "So if Jitobear's mother had the option to abort Jitobear in utero, you want Jitobear to have the same option with any children she carries? That's awfully progressive of you.\n\n \n \n Nice try but your play on words does not work..........You know exactly what I meant........", 
   {}, 
   129173, 
   null, 
   1117226100.0
  ], 
  [
   129386, 
   null, 
   "Voice Of Reason", 
   "IIRC, I have no memories of ever being a 'fetus in a womb'. There is no conclusive proof stating I was ever a fetus in a womb so, I must assume I wasn't ever a fetus...in a womb.\n \n What's the point to this thread?\n\n \n You are in a state of dnial my friend if you don't believe you were ever a fetus....", 
   {}, 
   129190, 
   null, 
   1117226160.0
  ], 
  [
   129387, 
   null, 
   "Voice Of Reason", 
   "If you're legislating it into a legal consequence you are using it as a punishment.\n[\n \n Nope, it was legislated by Liberals and feminists in 1972 with Roe V Wade.........I want to remove that legislation and give the repsonisbility back to the state where it belongs...........", 
   {}, 
   129386, 
   null, 
   1117226340.0
  ], 
  [
   129391, 
   null, 
   "Voice Of Reason", 
   "Especially if you refuse to acknowledge or address the issues women faced with unwanted pregnancy have.\n \n \n \n \n \n Please don't bring, me, my mother and her potential actions up as justification. I was raised pro-choice. I am mad as hell about the lack of options my mother and grandmother had - and so are/were they (my grandma as she is now deceased).\n \n My mother was not allowed to get her tubes tied without my father's permission. Something she only got because her doctor lied to him about her ability to have future children. This same man, who got to control my mother's reproductive organs, walked on his kids less than ten years later.\n \n My grandmother raised 11 children in a one room shack at time when women could barely make a living or get a divorce. My grandpa was crazy, abusive and did not work. Despite efforts she was not granted birth control without his permission, which he would not give.\n \n My grandmother was the first person to tell me that my life and body are mine. Once laws changed my grandma could be quoted saying \"I wouldn't take a million dollars for any of my kids, but I won't pay a penny for another.\"\n\n \n I don't know what telling us about your family history has to do with anything..............Of course there were injustices against women in the past.......I admit that and they have ben corrected.......\n \n That does not make unnecesary abortions right..........", 
   {}, 
   129252, 
   null, 
   1117226580.0
  ], 
  [
   129396, 
   null, 
   "Sigma", 
   "\n Nope, it was legislated by Liberals and feminists in 1972 with Roe V Wade.........I want to remove that legislation and give the repsonisbility back to the state where it belongs...........\n\n \n Really? What did the law state?", 
   {}, 
   129387, 
   null, 
   1117227180.0
  ], 
  [
   129399, 
   null, 
   "Voice Of Reason", 
   "Really? What did the law state?\n\n \n Roe V Wade....The most vile law every made against a human being.....", 
   {}, 
   129396, 
   null, 
   1117227420.0
  ], 
  [
   129403, 
   null, 
   "Sigma", 
   "Roe V Wade....The most vile law every made against a human being.....\n\n \n Roe v Wade was a decision that struck down a law. I'm asking what law was made that you wish repealed.", 
   {}, 
   129399, 
   null, 
   1117227720.0
  ], 
  [
   129427, 
   null, 
   "Uncle Sam I am", 
   "I do not believe abortion is generally about convenience because preganancy is more than mere inconvenience. Even if she does not have to raise the child, it does not mean she is emotionally, mentally, physically, or economically able to support a pregnancy.\n\n Then she shouldn't take the risk of getting pregnant. \n \n \nI have frequently suggested finding ways of bringing abortion down by addressing these issues - but according the lifers around here these problems don't exist and all that needs to be done is taking punitive measures against women.\n\n Many other cultures do not have a problem keeping their legs crossed and their fly's zipped. Western culture glamorizes casual sex and encourages kids to date at an early age when they should be focused on school. Many of the same people (hollywood actors for instance) who are crying about the aids epidemic and raising all kinds of money to find a cure, are the same ones who are encouraging dangerous behavior. Theses are the ones our culture idolizes and uses for role models.\n \n We can bring abortions down by not encouraging females to have them. \n \n Today, a student needs parental consent in order for the school to give her an aspirin. She also needs parental consent to get her ears pierced. But she can go into a clinic and have an invasive medical proceedure without telling anyone! What's wrong with this picture?", 
   {}, 
   129109, 
   null, 
   1117231800.0
  ], 
  [
   129440, 
   null, 
   "Hunter", 
   "Especially if you refuse to acknowledge or address the issues women faced with unwanted pregnancy have.\n \n \n \n \n \n Please don't bring, me, my mother and her potential actions up as justification. I was raised pro-choice. I am mad as hell about the lack of options my mother and grandmother had - and so are/were they (my grandma as she is now deceased).\n \n My mother was not allowed to get her tubes tied without my father's permission. Something she only got because her doctor lied to him about her ability to have future children. This same man, who got to control my mother's reproductive organs, walked on his kids less than ten years later.\n \n My grandmother raised 11 children in a one room shack at time when women could barely make a living or get a divorce. My grandpa was crazy, abusive and did not work. Despite efforts she was not granted birth control without his permission, which he would not give.\n \n My grandmother was the first person to tell me that my life and body are mine. Once laws changed my grandma could be quoted saying \"I wouldn't take a million dollars for any of my kids, but I won't pay a penny for another.\"\n\n \n Jitobear, are you saying that you are sad because your momma didn't have the option to abort you? Are you in fact, Roemary's baby? BOY-HOWDY!!!!", 
   {}, 
   129252, 
   null, 
   1117233480.0
  ], 
  [
   129454, 
   null, 
   "Nurglitch", 
   "Nice try but your play on words does not work..........You know exactly what I meant........\n In fact I believe you said:\n \nAll we want is for the baby in the womb to have the same chance you did if possible...........\n If you want babies in the womb to have the same chance that we did, and you're asking for them to have the same chance that we did, then you must have known that such a chance included the risk of abortion in many cases.\n \n If you want us to understand you, I think it might help if you're more careful with how you express you opinion.", 
   {}, 
   129440, 
   null, 
   1117236180.0
  ], 
  [
   129462, 
   null, 
   "Voice Of Reason", 
   "Roe v Wade was a decision that struck down a law. I'm asking what law was made that you wish repealed.\n\n \n \n What law was struck down by Roe V Wade?", 
   {}, 
   129403, 
   null, 
   1117237140.0
  ], 
  [
   129463, 
   null, 
   "Voice Of Reason", 
   "In fact I believe you said:\n If you want babies in the womb to have the same chance that we did, and you're asking for them to have the same chance that we did, then you must have known that such a chance included the risk of abortion in many cases.\n \n If you want us to understand you, I think it might help if you're more careful with how you express you opinion.\n\n \n Not prior to 1972 when the states had jurisdiction on abortion.........What a staggering figure 40,000,000 is since it has been made easy to have and abortion at the drop of a hat.....", 
   {}, 
   129454, 
   null, 
   1117237380.0
  ], 
  [
   129464, 
   null, 
   "Sigma", 
   "What law was struck down by Roe V Wade?\n\n \n A Texas law forbidding abortion.", 
   {}, 
   129462, 
   null, 
   1117237560.0
  ], 
  [
   129466, 
   null, 
   "Voice Of Reason", 
   "A Texas law forbidding abortion.\n\n \n you have to better then that............\n \n \nMany other cultures do not have a problem keeping their legs crossed and their fly's zipped. Western culture glamorizes casual sex and encourages kids to date at an early age when they should be focused on school.\n \n \n It did not use to be that way prior to the \"If it feels good do it\" sixties and Roe V Wade in 1972......", 
   {}, 
   129464, 
   null, 
   1117237620.0
  ], 
  [
   129474, 
   null, 
   "Nurglitch", 
   "Not prior to 1972 when the states had jurisdiction on abortion.........What a staggering figure 40,000,000 is since it has been made easy to have and abortion at the drop of a hat.....\n Surprisingly some people were born after 1972 and some other people aren't even American and come from places with a different history of abortion laws. So what you really meant to say was that babies in the womb should get the same chance that babies born prior to 1972 in the US did? Does that mean they should have the same risk of illegal abortions then?", 
   {}, 
   129466, 
   null, 
   1117238220.0
  ], 
  [
   129479, 
   null, 
   "Voice Of Reason", 
   "Surprisingly some people were born after 1972 and some other people aren't even American and come from places with a different history of abortion laws. So what you really meant to say was that babies in the womb should get the same chance that babies born prior to 1972 in the US did? Does that mean they should have the same risk of illegal abortions then?\n\n \n Abortions were state issues prior to the federal government sticking their nose in..........I would go out and a limb and say there were not 40,000,000 abortions performed from 1900 to 1972 then when all you had to do was say, \"I forgot to use birth control when I had sex so I want to use abortion as my birth control.\"", 
   {}, 
   129474, 
   null, 
   1117238700.0
  ], 
  [
   129537, 
   null, 
   "xeiah", 
   "Abortions were state issues prior to the federal government sticking their nose in..........I would go out and a limb and say there were not 40,000,000 abortions performed from 1900 to 1972 then when all you had to do was say, \"I forgot to use birth control when I had sex so I want to use abortion as my birth control.\"\n\n \n \n Ok VoR, Where did you get *THAT* idea?\n \n Wemen prior to 1972 could go to the doctor and say \"I forgot to use birth control when I had sex so I want to use abortion as my birth control.\" and their Dr. would then of course say \"oh sure! I'll give you on abortion\" Then they would have to ask the women especialy for the first 60 years of the century, \"What's birth control?\"\n \n Why did we ever need to nationaly legalize abortion then? Since it was obviously something women had no trouble gaining access to?", 
   {}, 
   129479, 
   null, 
   1117256100.0
  ], 
  [
   129538, 
   null, 
   "jitobear", 
   "Jitobear, are you saying that you are sad because your momma didn't have the option to abort you? Are you in fact, Roemary's baby? BOY-HOWDY!!!!\n\n \n No - I am telling you and the Voice of Absolute Lack of Reason to not bring up the emotional \"what if your mother had aborted\" argument here. My mother nad grandmother did not have that or many other options - and I wish they did. If I had been aborted - oh well - you would be locking horns with someone else today.", 
   {}, 
   129440, 
   null, 
   1117256160.0
  ], 
  [
   129540, 
   null, 
   "Nurglitch", 
   "Abortions were state issues prior to the federal government sticking their nose in..........I would go out and a limb and say there were not 40,000,000 abortions performed from 1900 to 1972 then when all you had to do was say, \"I forgot to use birth control when I had sex so I want to use abortion as my birth control.\"\n Pardon me, but what does that have to do with babies in the womb getting the same chance at life as the rest of us whose mothers may or may not have had access to abortion, either because we were born in the USA prior to 1972, or because we were not born in the USA at all? Doesn't anyone else know what Voice of Reason is trying to say here?", 
   {}, 
   129538, 
   null, 
   1117256520.0
  ], 
  [
   129541, 
   null, 
   "Hunter", 
   "No - I am telling you and the Voice of Absolute Lack of Reason to not bring up the emotional \"what if your mother had aborted\" argument here. My mother nad grandmother did not have that or many other options - and I wish they did. If I had been aborted - oh well - you would be locking horns with someone else today.\n\n \n I notice that you avoided my question about you possibly being Rosemary's baby. I think that is quite significant. Are you or are you not the product of Satan's loin? Do you have a tail?\n \n \n The above post is a humour check only. emoticon_wow", 
   {}, 
   129538, 
   null, 
   1117256640.0
  ], 
  [
   129550, 
   null, 
   "Voice Of Reason", 
   "Ok VoR, Where did you get *THAT* idea?\n \n Wemen prior to 1972 could go to the doctor and say \"I forgot to use birth control when I had sex so I want to use abortion as my birth control.\" and their Dr. would then of course say \"oh sure! I'll give you on abortion\" Then they would have to ask the women especialy for the first 60 years of the century, \"What's birth control?\"\n \n Why did we ever need to nationaly legalize abortion then? Since it was obviously something women had no trouble gaining access to?\n\n \n I am talking about after 1972 when Roe V Wade made it so easy to get and abortion..............\n \n I can tell you I lived a bunch of those years prior to 1972 and women knew what birth control was even if they did not have the morning after pill which has killed a bunch of them..........", 
   {}, 
   129537, 
   null, 
   1117257300.0
  ], 
  [
   129552, 
   null, 
   "Voice Of Reason", 
   "Pardon me, but what does that have to do with babies in the womb getting the same chance at life as the rest of us whose mothers may or may not have had access to abortion, either because we were born in the USA prior to 1972, or because we were not born in the USA at all? Doesn't anyone else know what Voice of Reason is trying to say here?\n\n \n No, it was a different era.........Families had values...........Women carried their babies to term............People respected life unlike today........", 
   {}, 
   129540, 
   null, 
   1117257480.0
  ], 
  [
   129553, 
   null, 
   "Nurglitch", 
   "No, it was a different era.........Families had values...........Women carried their babies to term............People respected life unlike today........\n Would you please answer my question directly?", 
   {}, 
   129552, 
   null, 
   1117257660.0
  ], 
  [
   129554, 
   null, 
   "xeiah", 
   "I would argue that abortion is still not *easily* atained in the US but true it is at least atainable. However, I do I belive then I must have mis-read the wording of your previous post. \n \n Also women may have known about the pilll, then ( only after 1960 when it was interduced) but how many were able to get acess to it and did? \n \n Who was killed by the morning after pill? Do you even know what is in it?", 
   {}, 
   129550, 
   null, 
   1117257840.0
  ], 
  [
   129614, 
   null, 
   "Sigma", 
   "Doesn't anyone else know what Voice of Reason is trying to say here?\n\n \n haha I think most have stopped even reading his posts ;)\n \n You have an iron constitution to stomach him.", 
   {}, 
   129540, 
   null, 
   1117266120.0
  ], 
  [
   129775, 
   null, 
   "Steeeeve", 
   "human being\n \n n : any living or extinct member of the family Hominidae\n \n \n What would a fetus be under in science? I can't really think of any organism (as in animal) that would change families or DNA for that matter. A caterpillar has the same DNA as the butterfly it becomes for example. A fetus has the same DNA as a grown human.\n \n So....classifing a fetus would be the same as an adult. What evidence supports it not being a human?", 
   {}, 
   129614, 
   null, 
   1117325640.0
  ], 
  [
   129830, 
   null, 
   "WhiteFalcon", 
   "human being\n \n n : any living or extinct member of the family Hominidae\n \n \n What would a fetus be under in science? I can't really think of any organism (as in animal) that would change families or DNA for that matter. A caterpillar has the same DNA as the butterfly it becomes for example. A fetus has the same DNA as a grown human.\n \n So....classifing a fetus would be the same as an adult. What evidence supports it not being a human?\n\n \n So...your saying a caterpillar is the same as a butterfly, or is \"classified\" as the same? No a caterpillar is a caterpillar. Even though it eventually evolves into a butterfly, you cant classify a caterpillar as a butterfly, there are differences.\n \n So to continue, lets say a caterpillar is a fetus and a butterfly is an adult. A fetus is different then an adult. At what point can you classify a human being as a human being is the question. Fetus's lack many things adults have, and an adult is considered a human being. So you cant say a fetus is a human being if it is much different then an adult which is considered one. Fetus's are cells, that could turn into a human being, but arent one yet.", 
   {}, 
   129775, 
   null, 
   1117348320.0
  ], 
  [
   129844, 
   null, 
   "Adept", 
   "Unless you are the village idiot, you know in your heart that the murder of the innocent unborn is wrong.\n\n \n Unless you are a totalitarian fascist, you know in your heart that forcing peoples choices is wrong.\n \n emoticon_rolleyes", 
   {}, 
   129830, 
   null, 
   1117354740.0
  ], 
  [
   129942, 
   null, 
   "Steeeeve", 
   "So...your saying a caterpillar is the same as a butterfly, or is \"classified\" as the same? No a caterpillar is a caterpillar. Even though it eventually evolves into a butterfly, you cant classify a caterpillar as a butterfly, there are differences.\n\n \n DNA speaking...there are no differences and thus they are classified as the same thing. http://www.newton.dep.anl.gov/askasci/mole00/mole00314.htm\n \n A caterpillar has just not developed into a butterfly yet. much the same way a fetus hasnt developed into what we call a \"child\" and a \"child\" hasn't fully developed into what we call an \"adult\". You still develop from child to adult do you not? I grew some 5 and a half feet from birth.\n \n \n \nUnless you are a totalitarian fascist, you know in your heart that forcing peoples choices is wrong.\n This logic cannot work unless you are consistent on it. You would have to say that I should have a freedom of choice in killing someone without penalty.", 
   {}, 
   129844, 
   null, 
   1117391280.0
  ], 
  [
   129958, 
   null, 
   "foreverblue", 
   "This logic cannot work unless you are consistent on it. You would have to say that I should have a freedom of choice in killing someone without penalty.\n.\n \n \n \n Do you mean that in the way that your intended target cannot defend themselves?", 
   {}, 
   129942, 
   null, 
   1117392960.0
  ], 
  [
   129969, 
   null, 
   "WhiteFalcon", 
   "Unless you are the village idiot, you know in your heart that the murder of the innocent unborn is wrong.\n\n \n You my friend have no reason to post in this, because your argument about this topic is merley based on Your own personal religious belief. Ive seen the other thread where someone finally noted you on it. I cant find it right now but the person blew your whole religious argument apart. Let me ask you this since you do base it on religion- a baby is a blessing, no? How much of a blessing is it if the baby isnt even wanted by the parents?", 
   {}, 
   129830, 
   null, 
   1117393860.0
  ], 
  [
   129983, 
   null, 
   "WhiteFalcon", 
   "DNA speaking...there are no differences and thus they are classified as the same thing. http://www.newton.dep.anl.gov/askasci/mole00/mole00314.htm\n\n \n I am thinking outside the box, and am not just doing DNA speaking.\n \n \nA caterpillar has just not developed into a butterfly yet. much the same way a fetus hasnt developed into what we call a \"child\" and a \"child\" hasn't fully developed into what we call an \"adult\". You still develop from child to adult do you not? I grew some 5 and a half feet from birth.\n\n \n Fetus's lack many things \"childs\" have, and a \"child\" is considered a human being. A fetus cant live without being in a mother. A child or even baby can live and survive in this place we call earth were we live. You take that \"fetus\" outside its mother and it will die. Brain? No. Fetus's are potential life, and killing a bunch of cells with no brain matter living inside a mother is not killing a human being, just a potential one. \n \n \nThis logic cannot work unless you are consistent on it. You would have to say that I should have a freedom of choice in killing someone without penalty.\n\n \n And you conservatives are very consistant in your \"pro life belief\". Dont kill babies and ignore womens rights and choices, but lets be quick to get that death penalty going and kill some more innocent people . Death penalty isnt so \"pro life\" to me. \n And no this \"freedom of choice in killing someone without penalty\" wouldnt be consistent, because fetus's arent human beings.", 
   {}, 
   129942, 
   null, 
   1117395300.0
  ], 
  [
   130000, 
   null, 
   "Steeeeve", 
   "Fetus's lack many things \"childs\" have, and a \"child\" is considered a human being. A fetus cant live without being in a mother. A child or even baby can live and survive in this place we call earth were we live. You take that \"fetus\" outside its mother and it will die. Brain? No. Fetus's are potential life, and killing a bunch of cells with no brain matter living inside a mother is not killing a human being, just a potential one. \n \n So a \"fetus\" 1min from being born can't live outside the mother? This is not true. Killing a bunch of cells with no brain matter? They have brain matter fairly early in development. So that is not true.\n \n Not only that, a \"child\" lacks many things an adult human being has..such as size, fully developed brain, a few other odds and ends that don't matter too much (such as nasual cavity stuff). Much like the catapiller, the fetus is just one stage of the life of the organism.\n \n \nAnd no this \"freedom of choice in killing someone without penalty\" wouldnt be consistent, because fetus's arent human beings.\n Then what are they? What DNA do they have? What makes them not a human? What would science classify them as? Is it just because they look different? I don't think a 8 month baby looks that much different from a just born baby. So what is the standard for a human being? Who decided this and what gives them that authority?\n \n \nAnd you conservatives are very consistant in your \"pro life belief\". Dont kill babies and ignore womens rights and choices, but lets be quick to get that death penalty going and kill some more innocent people . Death penalty isnt so \"pro life\" to me. \n Are you saying you are against the dealth penalty but for abortion? And maybe you weren't directing this comment at me but when did I say I believe in the death penalty and when did I say I ignore womens rights and choices? \n \n \n \nI am thinking outside the box, and am not just doing DNA speaking.\n There still is no difference in them other then different stages of life. Just like the differences in child and adult, only we don't have as drastic changes...however, puberty comes to mind as one.\n \n \n \n You seem to believe that there is this thing called a \"fetus\" that is a completly different organism that changes within a split second from a fetus into a \"child\"...I know of no species that does that and have no reason to believe humans and fetuss have that relationship.", 
   {}, 
   129983, 
   null, 
   1117397820.0
  ], 
  [
   130080, 
   null, 
   "Zardoz", 
   "\n And no this \"freedom of choice in killing someone without penalty\" wouldnt be consistent, because fetus's arent human beings.\n\n \n Check into fetal homicide laws. Many states have them. Several say life begins at conception in their legislature.\n How can someone be prosecuted for murder for killing something that 'isn't a human being'???\n \n \n Basically, in the artificial bubble of abortion rights something magic happens that makes them 'not human' in some peoples eyes. Other than that, they usually are acknowledged as 'human'. \n Some will hair split the definition of 'being' and go into all sorts to nuances on why they don't see a fetus as equivelent to an adult.\n So, 'outside the box' allows you to 'make **** up' for your own personal interpretation. Pretty sweet I must say. But, some would be crying bloody murder (literally) if everyone did such a thing in regards to classification of another human type.\n \n In essence, many pro-abortionist seem to be saying 'My interpretation is more valid than yours...even if it goes against everything else...and you should just accept it....ummm, because I say so.'\n Sounds like the religious pro-lifers stance when they invoke the soul.\n \n And unless one side is willing to radically accept a differing idea...abortion debate is often nothing more than a broken record.", 
   {}, 
   129983, 
   null, 
   1117408260.0
  ], 
  [
   130102, 
   null, 
   "Hunter", 
   "You my friend have no reason to post in this, because your argument about this topic is merley based on Your own personal religious belief. Ive seen the other thread where someone finally noted you on it. I cant find it right now but the person blew your whole religious argument apart. Let me ask you this since you do base it on religion- a baby is a blessing, no? How much of a blessing is it if the baby isnt even wanted by the parents?\n\n \n I don't need a reason to post my opinions here. Just because a child may not be \" wanted \" does not give anyone the right to deprive that child of life. BOY-HOWDY!!!!!", 
   {}, 
   129969, 
   null, 
   1117410900.0
  ], 
  [
   130112, 
   null, 
   "Nurglitch", 
   "And unless one side is willing to radically accept a differing idea...abortion debate is often nothing more than a broken record.\nYeah, that's why I don't argue a pro-choice position on the basis of whether the fetus is a human being or not. I just take it for granted that a fetus is a full-status human being with the same 'rights' as any other.", 
   {}, 
   130102, 
   null, 
   1117414020.0
  ], 
  [
   130147, 
   null, 
   "WhiteFalcon", 
   "So a \"fetus\" 1min from being born can't live outside the mother? This is not true.\n\n \n Never said it was. I said if a \"fetus\" cant live without being inside its mother its not yet a \"human being\". Your way off.\n \n \nKilling a bunch of cells with no brain matter? They have brain matter fairly early in development. So that is not true.\n\n \n Can they think?\n \n \nNot only that, a \"child\" lacks many things an adult human being has..such as size, fully developed brain, a few other odds and ends that don't matter too much (such as nasual cavity stuff). Much like the catapiller, the fetus is just one stage of the life of the organism.\n\n \n \"Human beings\" all live the same way. Babies, children, adults, all live the same way in the same enviornment. A \"fetus\" lives completley different, inside a mother. It cant think, it cant live without its mother, then its not yet a \"human being\". \n \n \nThen what are they? What DNA do they have? What makes them not a human? What would science classify them as? Is it just because they look different? I don't think a 8 month baby looks that much different from a just born baby. So what is the standard for a human being? Who decided this and what gives them that authority?\n\n \n potential \"human being\". Who decides that they are \"human beings\", and what gieves them that authority?\n \n \n \nwhen did I say I ignore womens rights and choices?\n \n \n Wow, am I seeing this right? In case you didnt know when your against abortion you are ignoring womens \"rights and choices\".\n \n \n \nYou seem to believe that there is this thing called a \"fetus\" that is a completly different organism that changes within a split second from a fetus into a \"child\"...I know of no species that does that and have no reason to believe humans and fetuss have that relationship.\n\n \n Completley different organism? Ok good assumption.", 
   {}, 
   130000, 
   null, 
   1117422660.0
  ], 
  [
   130152, 
   null, 
   "WhiteFalcon", 
   "Basically, in the artificial bubble of abortion rights something magic happens that makes them 'not human' in some peoples eyes. Other than that, they usually are acknowledged as 'human'. \n\n \n I classify them as a potential human being.\n \n \nSome will hair split the definition of 'being' and go into all sorts to nuances on why they don't see a fetus as equivelent to an adult.\n\n \n Do you see a \"fetus\" equivalent to an \"adult\".\n \n \nSo, 'outside the box' allows you to 'make **** up' for your own personal interpretation. Pretty sweet I must say. But, some would be crying bloody murder (literally) if everyone did such a thing in regards to classification of another human type.\n\n \n If what you say is \"true\" then why is there a debate on it. Its called a difference in beliefs or thoughts.\n \n \nIn essence, many pro-abortionist seem to be saying 'My interpretation is more valid than yours...even if it goes against everything else...and you should just accept it....ummm, because I say so.'\n Sounds like the religious pro-lifers stance when they invoke the soul.\n\n \n And you pro life dont say this? Goes against \"everything else\"? My view isnt based on religion, so it was nice of you to jump to conclusions but your wrong.\n \n \nAnd unless one side is willing to radically accept a differing idea...abortion debate is often nothing more than a broken record.\n\n \n True, this is my beleif and you have yours.", 
   {}, 
   130080, 
   null, 
   1117423320.0
  ], 
  [
   130186, 
   null, 
   "Hunter", 
   "I am thinking outside the box, and am not just doing DNA speaking.\n \n \n \n Fetus's lack many things \"childs\" have, and a \"child\" is considered a human being. A fetus cant live without being in a mother. A child or even baby can live and survive in this place we call earth were we live. You take that \"fetus\" outside its mother and it will die. Brain? No. Fetus's are potential life, and killing a bunch of cells with no brain matter living inside a mother is not killing a human being, just a potential one. \n \n \n \n And you conservatives are very consistant in your \"pro life belief\". Dont kill babies and ignore womens rights and choices, but lets be quick to get that death penalty going and kill some more innocent people . Death penalty isnt so \"pro life\" to me. \n And no this \"freedom of choice in killing someone without penalty\" wouldnt be consistent, because fetus's arent human beings.\n\n \n I am a very conservative Christian and am opposed to abortion and the death penalty. You are quite wrong when you state that a fetus is not a human. If a fetus is not the very beginning of a human being, what is it?", 
   {}, 
   129983, 
   null, 
   1117431480.0
  ], 
  [
   130189, 
   null, 
   "zachvac", 
   "I am a very conservative Christian and am opposed to abortion and the death penalty. You are quite wrong when you state that a fetus is not a human. If a fetus is not the very beginning of a human being, what is it?\n\n \n So are you willing to state that a seed is the equivelant of a fully grown tree? It, just as a fetus has the potential to become one but needs support (the woman's body, someone to teach it how to live, someone to plant it and help it grow). I think this is a valid analogy, do you claim that a seed is the same as a fully grown tree?", 
   {}, 
   130186, 
   null, 
   1117432020.0
  ], 
  [
   130193, 
   null, 
   "Hunter", 
   "So are you willing to state that a seed is the equivelant of a fully grown tree? It, just as a fetus has the potential to become one but needs support (the woman's body, someone to teach it how to live, someone to plant it and help it grow). I think this is a valid analogy, do you claim that a seed is the same as a fully grown tree?\n\n \n I don't claim that a seed is the same as a tree, I claim that only God can make a tree. No seed, no baby or tree.", 
   {}, 
   130189, 
   null, 
   1117432500.0
  ], 
  [
   130199, 
   null, 
   "elephant2005", 
   "You my friend have no reason to post in this, because your argument about this topic is merley based on Your own personal religious belief. Ive seen the other thread where someone finally noted you on it. I cant find it right now but the person blew your whole religious argument apart. Let me ask you this since you do base it on religion- a baby is a blessing, no? How much of a blessing is it if the baby isnt even wanted by the parents?\n\n \n Who do you think you are? Of course this person has reason to post his opinions. So what if his arguments are based on his own religious beliefs. Yours are based on your own personal opinions and I am much more apt to follow an individual speaking from religion than one speaking from his own arrogant, not so logical, twisted mind. \n \n A baby is not only a blessing to his parents. A baby has the potential to be a blessing to a multitude of people. You have no reason to post your opinion based on this twisted thinking. The worth of a baby is not restricted only to what his parents feel he is worth. You better believe a baby is a blessing.", 
   {}, 
   129969, 
   null, 
   1117434720.0
  ], 
  [
   130428, 
   null, 
   "WhiteFalcon", 
   "Who do you think you are? Of course this person has reason to post his opinions. So what if his arguments are based on his own religious beliefs. Yours are based on your own personal opinions and I am much more apt to follow an individual speaking from religion than one speaking from his own arrogant, not so logical, twisted mind. \n \n A baby is not only a blessing to his parents. A baby has the potential to be a blessing to a multitude of people. You have no reason to post your opinion based on this twisted thinking. The worth of a baby is not restricted only to what his parents feel he is worth. You better believe a baby is a blessing.\n\n \n Ok bud,\n Reread the post and you will see that he came at me with an insult. He wasnt in the debate and said some illlogical comment so I commented back on him for it. Get some thicker skin, this is a internet forum. Dont fight his battles, he can fight his own. Who do you think you are? You seem to be mistakin, you are the one with \"twisted thinking, or \"illogical\" views. Let me show you..\n \n All you people seem to think a baby that is aborted would have been the next George Washington. If you cant realize that if a baby isnt wanted or loved by his parents chances are the baby will be malnourished, mentally handicaped, physically handicaped, and those young girls will drop out of high school, and ruin their lives, then your not looking at life. You people cant seem to see that hard side of having a child. What a \"blessing\" that would be.", 
   {}, 
   130199, 
   null, 
   1117484820.0
  ], 
  [
   130483, 
   null, 
   "Voice Of Reason", 
   "All you people seem to think a baby that is aborted would have been the next George Washington. If you cant realize that if a baby isnt wanted or loved by his parents chances are the baby will be malnourished, mentally handicaped, physically handicaped, and those young girls will drop out of high school, and ruin their lives, then your not looking at life. You people cant seem to see that hard side of having a child. What a \"blessing\" that would\n \n \n I am sure there are a lot of babies that might have been aborted grew up to be fine upstanding citizens and to deny that is to live in a world of fantasy........\n \n In this day and age there is no excuse for a new born to be unwanted......There are many organizations and social services theat will help..........\n \n All the baby wants is to have the same chance you and I had and you want to deny that chance........\n \n Shame on you...........", 
   {}, 
   130428, 
   null, 
   1117490880.0
  ], 
  [
   130573, 
   null, 
   "WhiteFalcon", 
   "I am sure there are a lot of babies that might have been aborted grew up to be fine upstanding citizens and to deny that is to live in a world of fantasy........\n\n \n I am sure there are as well. I am saying that babies with a teen mother dont usually get the best childhood, and odds are they wont end up being \"upstanding citizens\". In some cases I am sure they will, however you are ignoring the hardships the baby faces and the mother and father face when they are in their teen years and arent ready to care for a baby.\n \n You people are ignoring womens rights and choices and making the choices for them. Whatever happened to the freedom in America? Who are you to make a women do something she doesnt want? Some girls life are ruined just because the condom broke. What you fail to see is sure a \"life\" is spared, however many \"lifes\" can be ruined.", 
   {}, 
   130483, 
   null, 
   1117503900.0
  ], 
  [
   130579, 
   null, 
   "Zardoz", 
   "What you fail to see is sure a \"life\" is spared, however many \"lifes\" can be ruined.\n\n \n Hmmm, actual life vs potential lives being ruined.\n And, this is a difficult 'choice' how? Because you know the absolute outcome??? Nope, can't be that.\n \n That's how you phrased it. Might want to rethink your verbage.\n \n \n Many people attempted to have my mother abort me (way back when it was illegal, including her own mother...with all sorts of pressure) when she became pregnant at a young age (17).\n My two oldest children (adopted) were born to a teen mother...\n \n \n I understand your beliefs that teen mothers and others simply aren't ready to take care of such a responsibility as raising a child. 'Babies haveing babies and all...' but, is anyone (normal) really ever 100% prepared to have children? I'd say the majority of children ever born were more spur of the moment events than something carefully planned out.\n \n \n If I were to take your mentality of sacrificing something in existance to prevent a 'potential' negative to myself...well, it wouldn't be a pretty world for most.", 
   {}, 
   130573, 
   null, 
   1117505580.0
  ], 
  [
   130583, 
   null, 
   "WhiteFalcon", 
   ".And, this is a difficult 'choice' how? \n\n \n Thats just it. Not necessarily dificult or easy, but that there is a Choice.\n \n \n \nI understand your beliefs that teen mothers and others simply aren't ready to take care of such a responsibility as raising a child. 'Babies haveing babies and all...' but, is anyone (normal) really ever 100% prepared to have children? I'd say the majority of children ever born were more spur of the moment events than something carefully planned out.\n\n \n What makes you say that the majority arent \"prepared\" or dont want to have a baby at the time they do? I doubt that. \n \n What I still fail to see an answer for is how you can be so quick to blatently ignore womens rights and choices. Since when is it \"right\" to make a women do something she does not want to do? \n \n \n \nIf I were to take your mentality of sacrificing something in existance to prevent a 'potential' negative to myself...well, it wouldn't be a pretty world for most.\n\n \n It goes the same way. If I were to take your mentality of destroying the rights and choices of women to control their bodys, and create childs that arent even wanted....well, it wouldnt be a pretty world for most.", 
   {}, 
   130579, 
   null, 
   1117509840.0
  ], 
  [
   130601, 
   null, 
   "Steeeeve", 
   "Never said it was. I said if a \"fetus\" cant live without being inside its mother its not yet a \"human being\". Your way off.\n \n\n \n \nA fetus cant live without being in a mother.\n\n \n I think you did....\n \n \n \n \n\n \n Can they think?\n \n \n\n yes, and I don't think thinking is a requirement to be a human being because what kind of standard is that? Are people that think more more human? My cat thinks and it is not a human...My grandpa couldn't really think because of the disease he had so is he not human? A 8month old baby can think yet it is not human but with this standard is??? As I said earily, the only one that can be the judge of whether or not someone is a person is the person themself, who are you to say otherwise?\n \n \n\n \"Human beings\" all live the same way. Babies, children, adults, all live the same way in the same enviornment. A \"fetus\" lives completley different, inside a mother. It cant think, it cant live without its mother, then its not yet a \"human being\". \n \n First off, you don't get to define human being. I would say (assuming you don't believe in God) that you are the judge of whether or not you are a human being and no one else can tell you whether you are or are not. Secondly, a baby has a different enviroment then an adult. I would argue that a baby of 1min old can't survive on its own while a \"normal\" adult could. \n \n \n\n potential \"human being\". Who decides that they are \"human beings\", and what gieves them that authority?\n \n I didn't read this earier but yeah, who are you to decide who is a human being? Who am I? Who are you to say someone is only a \"potential human being\"? I would say the only fair thing to do is ask what is in question whether or not \"it\" is a human being. However, since you can't that while it is in the mother I would say gotta play it safe and assume it will say it is a human being as this is the only reversable option. \n \n \n\n Wow, am I seeing this right? In case you didnt know when your against abortion you are ignoring womens \"rights and choices\".\n \n Says who? I know many women that don't support abortion and are for womens \"rights\". As for choices, everyone can choose to do anything, it is just some choices come with consequences that happen to be jail or things like that. I have the choice to steal, if I do, I will get arrested and sent to prison. So yeah, you see correctly.\n \n \n\n Completley different organism? Ok good assumption.\n I'm just going by what you were talking about... If it is not a human then it is obviously a different organism in your book. And thus changes from one thing to another in a split second(in mother to birth).", 
   {}, 
   130147, 
   null, 
   1117516380.0
  ], 
  [
   130613, 
   null, 
   "Zardoz", 
   "Thats just it. Not necessarily dificult or easy, but that there is a Choice.\n\n A choice that isn't allowed in any other circumstances.\n Someones life (for those who equate the fetus to any other human) for potential difficulties.\n \n \nWhat makes you say that the majority arent \"prepared\" or dont want to have a baby at the time they do? I doubt that. \n\n A comment like this just baffles the senses for me. It's like someone living in a cave. \n There have been numberous studies published and bandied in nearly every form of media. People seldom 'plan' a pregnancy. It's been like that for a long time. Historically, it's a given that if you engage in sexual intercourse, a child could result. Most people engage in intercourse not for an antiseptic intellectual reasons but because of the randy feeling...the other desires, pleasures, closeness to your partner.\n \n This falls into the catagory of most people stating they don't make enough money. Studies on income boil down to everyone wanting, on average, an extra 20% added th their income to feel secure. No matter how much they make, they always want a 'little more'. And it's ALWAYS and extra ~20%...even if you add 20%, they want more. It's probably an instinctual thing for all I know.\n And, on surveys, most people don't think they are financially ready to have a child. Yet, most find ways to accomodate. \n \n In essence, the answer to your question on what makes me think most people aren't ready...is their answers in numberous surveys and studies.\n The minority are the ones who plan...and often, the majority of those have fertility issues and have only come to that stage where they actively plan to have a child is when one hasn't came 'naturally/accidentally' or they simply haven't been in a position to really have one naturally. Workaholics types who have limited time for marriage or otherwise earlier in life.\n \n More people plan NOT to have a child than they do to have one.\n \n \nWhat I still fail to see an answer for is how you can be so quick to blatently ignore womens rights and choices. Since when is it \"right\" to make a women do something she does not want to do? \n\n I was going to address this in my last post but, I figured it it would be too far off tangent and more of a philosophy issue...so I had edited it out.\n \n Rights_do_NOT_exist.\n \n There is no universal womans right to have an abortion. It's make believe.\n You have no 'absolute' right to control your body. You might think so and it might make people behave a lot more nicely currently to allow the illusion to exist but, it's an artificial creation.\n \n All rights can be taken away. More easily by general consensus of the majority.\n For examply, the rights enjoyed by western societies are an abnormally not shared by many other people of the world.\n Freedom of religion. Even in America, that's mildly curbtailed.\n Speech and freedom of expression. Not absolute. We hear all the time about not being allowed to have the right to shout fire in a theater.\n How about european anti-hate speech laws?\n \n The concept that one has absolute control over their bodies.\n Forced labor. \n The taking of DNA from one to use as evidence in a trial against said person (should violate their 5th amendment rights).\n Your inability to have certain things done to your body of your own free will without consequences. Drug use for example. Or extreme fetishism.\n \n Your 'rights' are subject to a change in the law.\n Rights have come...and gone in the course of time. \n \n You, of course, have the ability and personal power to think otherwise and go against that law or consensus...but, there could be consequences.\n \n Rights are nothing more than a social contract.\n Many people think they exist and come from God or what ever. But, many of those type of people also believe in other issues of a highly debatable nature.\n \n Your right to your body is about equal to the unborns right to live.\n You say you don't acknowledge it's right as being superior (or even remotly equal) to yours and I can say the same in reverse.\n Your right to liberty is less than my right to live in nearly every society. That's why we lock some up. Even though there was that thing on Right to 'life, liberty and the pursuit of happyness.' Control over your body is a liberty. Which often is a lesser right to the Life from my perspective.\n \n For me, you claiming 'rights' is the equivelent to a religious person commenting on religious issues. How do you 'know' you have rights?\n \n \n See, told you it was a tangent. ;)\n \n \n \nIt goes the same way. If I were to take your mentality of destroying the rights and choices of women to control their bodys, and create childs that arent even wanted....well, it wouldnt be a pretty world for most.\n\n Been there, done that. I thought it was swell.\n And, one mans trash is anothers treasure. I've adopted 3. I might get around to acquiring some more.\n \n And if you think some 'unwanted' children makes for an unattractive world.\n Then you really should visit some of the darker places in history. \n It's like saying a 'refugee' camp is a 'concentration' camp.\n \n Or thinking that removing people from the welfare system is the same as rounding them up and exterminating them.\n \n \n \n Hmmm, other than coerced abortion, has a pro-choicer ever militantly knocked off the opposition? A reverse 'Rudolph' if you will?\n Just curious as I can't personally recall such a thing. So, I'm left with the thought that either the pro-lifers have more nutters/militants in the mix OR pro-choicers aren't much more than whiney pacifist...probably more of the former over the latter.", 
   {}, 
   130583, 
   null, 
   1117518720.0
  ], 
  [
   130820, 
   null, 
   "Sigma", 
   "A choice that isn't allowed in any other circumstances.\n Someones life (for those who equate the fetus to any other human) for potential difficulties.\n\n \n Sure it is. We have not yet gotten to the point of forced donation of organs or blood, even though it would almost certainly save lives. Even if the need were immediate and I were the only one available, I would not be forced to donate anything against my will or without my consent. Even if I caused the condition or accident (even if I caused the accident on purpose) I would not be forced to donate my organs or blood.\n \n It isn't \"Someones life (for those who equate the fetus to any other human) for potential difficulties\", it's a life for bodily autonomy.\n \n \n\n There is no universal womans right to have an abortion. It's make believe.\n You have no 'absolute' right to control your body. You might think so and it might make people behave a lot more nicely currently to allow the illusion to exist but, it's an artificial creation.\n\n \n True, there is no \"right to abort\". The Federal gov't, however, has no right to stop women from getting them (within their own state, anyway).\n \n \n\n All rights can be taken away. More easily by general consensus of the majority.\n\n \n Not exactly so. There are laws that protect minorities from oppression of the majority.\n \n \n\n The concept that one has absolute control over their bodies.\n Forced labor. \n\n \n Can you be forced to take medication you specifically stated you do not want? The desire is to be free of something happening to your body (pregnancy).\n \n \n\n Your inability to have certain things done to your body of your own free will without consequences. Drug use for example. Or extreme fetishism.\n\n \n The desire isn't the freedom to do what you want, but to be free to stop something from happening to your body.\n \n \n\n Your right to your body is about equal to the unborns right to live.\n\n \n The \"unborn\" have no right to live.\n \n \n\n You say you don't acknowledge it's right as being superior (or even remotly equal) to yours and I can say the same in reverse.\n Your right to liberty is less than my right to live in nearly every society.\n\n \n Not so. If you infringe on my liberty in such matters as invading my house (in some cases), burglarizing my house (in nearly all cases), I can kill you. Your life is less important than my freedom. Of course the reverse is true in some cases as well. It all depends on the circumstances.\n \n \n\n That's why we lock some up. Even though there was that thing on Right to 'life, liberty and the pursuit of happyness.' Control over your body is a liberty. Which often is a lesser right to the Life from my perspective.\n\n \n \"right to life\" is not in the Constitution. However, it specifically states the State cannot take away our liberty.", 
   {}, 
   130613, 
   null, 
   1117578120.0
  ], 
  [
   130921, 
   null, 
   "WhiteFalcon", 
   "So a \"fetus\" 1min from being born can't live outside the mother?\n\n \n False, I never stated when or when not a fetus is able to survive without living in the mother.\n \n I said if a \"fetus\" cant live without being inside its mother its not yet a \"human being\".\n \n If a \"fetus\" is Living off its mother then it wont beable to survive outside its mother.\n \n \n \nFirst off, you don't get to define human being. \n\n \n And you do?\n \n \nI would say (assuming you don't believe in God) that you are the judge of whether or not you are a human being and no one else can tell you whether you are or are not. \n\n \n Fetus's arent able to decide if they are a \"human being\". \n \n \nSecondly, a baby has a different enviroment then an adult. I would argue that a baby of 1min old can't survive on its own while a \"normal\" adult could. \n\n \n Does a \"baby\" have a different enviornment? Where do they both live? Geneally speaking yes, the \"enviornments\" are the same. Compare a babys enviornment to a \"fetus's\". A fetus lives inside its mother, babys dont. \n \n \nI didn't read this earier but yeah, who are you to decide who is a human being? Who am I? Who are you to say someone is only a \"potential human being\"? I would say the only fair thing to do is ask what is in question whether or not \"it\" is a human being. However, since you can't that while it is in the mother I would say gotta play it safe and assume it will say it is a human being as this is the only reversable option. \n\n \n Thats my belief and my choice. Who are you to say it is? \n \n \n Says who? I know many women that don't support abortion and are for womens \"rights\". As for choices, everyone can choose to do anything, it is just some choices come with consequences that happen to be jail or things like that. I have the choice to steal, if I do, I will get arrested and sent to prison. So yeah, you see correctly.\n\n \n You are taking away a womens choice when you are against abortion. Thats why the people that are pro abortion are also classified as pro choice.\n Your taking away her \"right\" of doing something to Her own body that she does not want done.\n \n \nI'm just going by what you were talking about... If it is not a human then it is obviously a different organism in your book. And thus changes from one thing to another in a split second(in mother to birth).\n\n \n Its not a \"different organism\" in my book. I classify it as a potential human being.", 
   {}, 
   130601, 
   null, 
   1117591440.0
  ], 
  [
   131025, 
   null, 
   "Steeeeve", 
   "I said if a \"fetus\" cant live without being inside its mother its not yet a \"human being\".\n Maybe that is what you meant to say but you clearly didnt say that earlier. You said the following...\n \n \nA fetus cant live without being in a mother.\n\n I don't make this stuff up...\n \n \n \n \nAnd you do?\n No, however, you are claiming to.\n \n \nFetus's arent able to decide if they are a \"human being\". \n Yeah but will be able to at some point. And who else has the authority to? Are you suggesting someone can tell you whether or not you are a human being?\n \n \nDoes a \"baby\" have a different enviornment? Where do they both live? Geneally speaking yes, the \"enviornments\" are the same. Compare a babys enviornment to a \"fetus's\". A fetus lives inside its mother, babys dont. \n I would say a babies enviroment is much different then an adults. And once again, are you suggesting that enviroment is what makes you human?\n \n \nThats my belief and my choice. Who are you to say it is? \n I am not one to say. But are you saying you are the one who gets to decide? Does this mean I can decide you are not a human? I don't think so.\n \n \nYou are taking away a womens choice when you are against abortion. Thats why the people that are pro abortion are also classified as pro choice.\n Your taking away her \"right\" of doing something to Her own body that she does not want done.\n \n Killing a fetus wouldn't be doing something to just her own body now would it? The fetus is a seperate organism...its own body. What about the babies choice? It doesn't get one? THat would be limiting choice. And since when do you have a choice to kill someone (other then abortion)? I guess you could have that \"choice\" I would just make the consequence jail time.\n \n \nIts not a \"different organism\" in my book. I classify it as a potential human being.\n So a potential human being is a human being then? Well that solves that problem. Seriously, they are either different or the same. You can't have it both.", 
   {}, 
   130921, 
   null, 
   1117603320.0
  ], 
  [
   131079, 
   null, 
   "Zardoz", 
   "Sure it is. We have not yet gotten to the point of forced donation of organs or blood, even though it would almost certainly save lives. Even if the need were immediate and I were the only one available, I would not be forced to donate anything against my will or without my consent. Even if I caused the condition or accident (even if I caused the accident on purpose) I would not be forced to donate my organs or blood.\n\n ;) If you say there's not market for forced donated organs, whatever...\n Didya know that an exhibit in CA based on actual human bodies plastinated(sp) is being looked into as it is believed that the supposed donated bodies might not have been voluntarily donated. They came from China and ended up in the US on tour. Just a mere allegation of US use of potntially force donated anatomical parts. Or about the rumors of forced organ donation from 3rd world markets.\n Ever wonder at some of the anatomical skeletons with really good dental hygene making it to the market.\n \n \nIt isn't \"Someones life (for those who equate the fetus to any other human) for potential difficulties\", it's a life for bodily autonomy.\n\n Still missing the issue that this, in and of itself is a fundamental difference with some. I recognize that some pro-choicers see the fetus as equivelant to a body part. Some on the other side apparently refuse to acknowlege that their opponents have a differing view point.\n \n \nTrue, there is no \"right to abort\". The Federal gov't, however, has no right to stop women from getting them (within their own state, anyway).\n\n *Giggles*\n Right? Where does this 'right' thing come from. Did you over look my tangental comment. Did Americans have a right to drink alcohol when many pushed for prohibition...taking that 'right' away in an amendment. Or was a right granted when it was repealled. How about voting rights?\n Merely reflections of the majorities desires and willingness to compromise.\n Rights are not universal. They come and they go.\n \n \nNot exactly so. There are laws that protect minorities from oppression of the majority.\n\n Depends on who you want to say is a minority...\n You say it's the woman needing protection from other's influences and desires. I understand that stance.\n We say we're protecting the minority too...by safeguarding the unborn (who [broken record]is the equivelent to any other human in our eyes[/broken record].\n Matter of perspective and viewpoint. \n \n \nCan you be forced to take medication you specifically stated you do not want? The desire is to be free of something happening to your body (pregnancy).\n\n Yes, there have been cases IIRC of people being forced to take medication against their will. The nut houses are full of them for example. So are jails and other detention facilities.\n You coulkd argue that some don't have a legal right to make decisions for themselves since they are mentally deemed incompetent by a judge. But, that doesn't cover the majority who haven't been deemed so.\n Ever force an 'inmate' to take their meds? I have.\n As I've mentioned in another thread, there use to be hysteria laws.\n Deeming the female incapable of making rational decisions on her behalf.\n I disagree with them but, to many, a woman desiring to kill her own child would be grounds for mental incompetance. Just food for thought.\n \n \nThe desire isn't the freedom to do what you want, but to be free to stop something from happening to your body.\n\n And a minor (unborn child in this case) who can't speak for themselves often can have protection too. Judges have ruled against parents who's choices have or may harm a child. I could easily see a decree where the legal system says you don't have to have a child growing in you but, you have no right to harm him (unless he's harming you physically) while removing it from your body. There are plenty of force usage laws in effect where you can't use greater force than is applied. I'd find it ironic to have to invent a different abortion practice that didn't overtly harm the fetus during it's removal. Once it's out, it would fall under other protection type policies. And, in most probably fall under a Texas-like futile care rule and allowed to simply die on it's own. Or, in later pregnancies, placed in incubation (if applicable) and allowed to live. Being put up for adoption or deemed a ward of the state.\n This, of course, is just speculation but just illustrates the point that some believe you don't have a mythical right to harm another unless in self defense and, of course, the fetus is deemed 'another'.\n \n \nThe \"unborn\" have no right to live.\n\n Says you. \n Others disagree.\n \n \nNot so. If you infringe on my liberty in such matters as invading my house (in some cases), burglarizing my house (in nearly all cases), I can kill you. Your life is less important than my freedom. Of course the reverse is true in some cases as well. It all depends on the circumstances.\n\n Depends on where you live. Seriously. Look more into use of force laws.\n Some states, that is true. Others, it's not.\n Your absolutism...simply doesn't exist. And, there's even a strong possiblity that you'll suffer advers consequences. In my job, I get to see a lot of news. Past week, a locak man went to jail for life for 'killing a man in self defense'. How about 'wrongful death lawsuit'. Got money for a lawyer?\n What about other, enlightned and progressive countries?\n Canada...jail for life for 'self defense' just last week. I can't recall the number of times I've heard tales of Brits bemoaning the issue that they can't properly defend themselves against the Neds (urban hoodilums) due to use of force restrictions.\n \n Sorry, NO, you can't simply 'kill me'.\n You may have the power and ability and desire to do so...and actually do it. But, consequences follow. Simply because others don't see you as having the 'right' to.\n \n \n\"right to life\" is not in the Constitution. However, it specifically states the State cannot take away our liberty.\n\n Straw man.\n I didn't say it was in the constitution. It was outlined in the declaration.\n It's also a still held belief by many.\n And, the state can take away liberty...with just cause.\n \n I've been previosly arrested and jailed for 9 days on the mere accusation of a 'speech' crime.\n Not a shred of evidence other than a he said/she said statement to police.\n Was also refused a lawyer and railroaded into general holding while the prosecution attempted to 'build a case' against me without benefit of legal counsel.\n \n During the alleged incident. I was on privatly owned property too. You think you can get away with unbridled 'Self defense'? I sputter laughter in your general direction.\n \n Liberty...\n \n Bwahahahahhahhahahhahahhhahhahahha.\n \n I'm sure I had a solid case of 'infringement of my civil liverties'. Cashing in on that is often a lot more hassle than it's worth. \n \n \n Want to discuss how many say the patriot act has infringed on liberties?\n Want to see how many say the equivelent of 'I don't care' or 'not true'?\n \n \n \n @WhiteFalcon,\n Define 'human being.'\n \n \n \n And, what's all this banter about 'Who are you to decide?' 'Who's the judge?'\n We ALL are.\n \n You're all wrong. Because I believe so. = 'I said so form of debate'.\n That's what this discussion seems to boil down to.\n \n I personally fully understand the majority of issues most 'pro-choicers' make.\n I disagree with their stance and actively seek to overturn and prevent it.\n I do so through the subversive application of 'might' when ever I can...because I can.\n Those opposed to me do so also in reverse...because they can.", 
   {}, 
   130820, 
   null, 
   1117621740.0
  ], 
  [
   131121, 
   null, 
   "Sigma", 
   ";) If you say there's not market for forced donated organs, whatever...\n Didya know that an exhibit in CA based on actual human bodies plastinated(sp) is being looked into as it is believed that the supposed donated bodies might not have been voluntarily donated. They came from China and ended up in the US on tour. Just a mere allegation of US use of potntially force donated anatomical parts. Or about the rumors of forced organ donation from 3rd world markets.\n Ever wonder at some of the anatomical skeletons with really good dental hygene making it to the market.\n\n \n Yes, but that's not legally permissable. Hence this being an issue.\n \n \n\n Still missing the issue that this, in and of itself is a fundamental difference with some. I recognize that some pro-choicers see the fetus as equivelant to a body part. Some on the other side apparently refuse to acknowlege that their opponents have a differing view point.\n\n \n I didn't say the fetus was a body part. Your quote implied a trade of a life to mitigate potential difficulties. I was pointing out where that was wrong.\n \n \n\n *Giggles*\n Right? Where does this 'right' thing come from. Did you over look my tangental comment. Did Americans have a right to drink alcohol when many pushed for prohibition...taking that 'right' away in an amendment. Or was a right granted when it was repealled. How about voting rights?\n Merely reflections of the majorities desires and willingness to compromise.\n Rights are not universal. They come and they go.\n\n \n Yes, they come and go I agree. Yes we do have the right to drink and smoke (in a sense because the gov't cannot restrict it). Prohibition took away that right. We do have the right to abort because the gov't cannot restrict us. There is nothing in the Constitution to prevent us from being able to.\n \n \n\n Depends on who you want to say is a minority...\n You say it's the woman needing protection from other's influences and desires. I understand that stance.\n We say we're protecting the minority too...by safeguarding the unborn (who [broken record]is the equivelent to any other human in our eyes[/broken record].\n Matter of perspective and viewpoint. \n\n \n I wasn't even applying it to anything, I was merely stating that there are laws protecting those in the minority.\n \n \n\n Yes, there have been cases IIRC of people being forced to take medication against their will. The nut houses are full of them for example. So are jails and other detention facilities.\n You coulkd argue that some don't have a legal right to make decisions for themselves since they are mentally deemed incompetent by a judge. But, that doesn't cover the majority who haven't been deemed so.\n Ever force an 'inmate' to take their meds? I have.\n As I've mentioned in another thread, there use to be hysteria laws.\n Deeming the female incapable of making rational decisions on her behalf.\n I disagree with them but, to many, a woman desiring to kill her own child would be grounds for mental incompetance. Just food for thought.\n\n \n Pfft. Those with diminished competence and those whos rights have already been stripped away for offenses against our society. Neither of those cases apply to women (in this day and age). To use that as justification to force a woman to continue a pregnancy is idiotic. We, as citizens, have the right to refuse to have things happen to our body we do not want. True, this is assuming we are in our right mind, but I think we can safely assume that.\n \n \n\n And a minor (unborn child in this case) who can't speak for themselves often can have protection too. Judges have ruled against parents who's choices have or may harm a child. I could easily see a decree where the legal system says you don't have to have a child growing in you but, you have no right to harm him (unless he's harming you physically) while removing it from your body.\n\n \n That would be horrible. Even during normal childbirth, the woman's safety should come first. If the fetus is coming out wrong, I wouldn't want the doctors to have to worry if what they are doing to help the woman might possibly be harming the fetus (beyond what they do now). That just opens them up to more litigation.\n \n Pregnancy is always stressful to the woman's body, which can constitute harm. It is true that parents cannot make choices to harm a born child, but that born child can be taken from them. The circumstances of pregnancy make that impossible. Legislation against the mother in favor of the \"unborn\" is morally repugnant, in my eyes.\n \n \n\n There are plenty of force usage laws in effect where you can't use greater force than is applied. I'd find it ironic to have to invent a different abortion practice that didn't overtly harm the fetus during it's removal. Once it's out, it would fall under other protection type policies. And, in most probably fall under a Texas-like futile care rule and allowed to simply die on it's own. Or, in later pregnancies, placed in incubation (if applicable) and allowed to live. Being put up for adoption or deemed a ward of the state.\n This, of course, is just speculation but just illustrates the point that some believe you don't have a mythical right to harm another unless in self defense and, of course, the fetus is deemed 'another'.\n\n \n I happen to think abortion can always be talked of in terms of self-defense. You are preventing something from happening to your body, and you are using appropriate force (since nothing else will stop it from happening).\n \n \n\n Says you. \n Others disagree.\n\n \n No, it's a fact. The fetus has no right to life.\n \n \n\n Depends on where you live. Seriously. Look more into use of force laws.\n Some states, that is true. Others, it's not.\n\n \n Er, yes. That's why I said \"in some cases\" and \"in most cases\". I've looked up self-defense laws. Felony tresspass is able to be met with deadly force in some states. In most states burglary is able to be met with deadly force. In nearly all states killing someone while they commit a felony generally falls under \"justifiable homicide\". Whether it actually happens this way is of course a different matter.\n \n \n\n Your absolutism...simply doesn't exist.\n\n \n I didn't say it was absolute.\n \n \n\n And, there's even a strong possiblity that you'll suffer advers consequences. In my job, I get to see a lot of news. Past week, a locak man went to jail for life for 'killing a man in self defense'. How about 'wrongful death lawsuit'. Got money for a lawyer?\n What about other, enlightned and progressive countries?\n Canada...jail for life for 'self defense' just last week. I can't recall the number of times I've heard tales of Brits bemoaning the issue that they can't properly defend themselves against the Neds (urban hoodilums) due to use of force restrictions.\n\n \n Yes, I know we over litigate in our society.\n \n \n\n Sorry, NO, you can't simply 'kill me'.\n You may have the power and ability and desire to do so...and actually do it. But, consequences follow. Simply because others don't see you as having the 'right' to.\n\n \n Consequences always follow actions. This doesn't mean I can't change them if I'm able. Depending on the circumstances, I can be perfectly justified in killing you to protect my freedom.\n \n \n\n Straw man.\n I didn't say it was in the constitution. It was outlined in the declaration.\n It's also a still held belief by many.\n\n \n That's fine, but the Declaration not legally enforcable. The Constitution is. There is no \"right to life\" in the Constitution.\n \n \n\n And, the state can take away liberty...with just cause.\n\n \n Of course. The 14th provides this. However, the Federal gov't cannot in this matter. A Federal ban on abortion is unconstitutional.\n \n \n\n I've been previosly arrested and jailed for 9 days on the mere accusation of a 'speech' crime.\n Not a shred of evidence other than a he said/she said statement to police.\n Was also refused a lawyer and railroaded into general holding while the prosecution attempted to 'build a case' against me without benefit of legal counsel.\n\n \n This is illegal.\n \n \n\n During the alleged incident. I was on privatly owned property too. You think you can get away with unbridled 'Self defense'? I sputter laughter in your general direction.\n\n \n I didn't say unbridled.\n \n \n\n I'm sure I had a solid case of 'infringement of my civil liverties'. Cashing in on that is often a lot more hassle than it's worth. \n\n \n Using an illegal action by authorities to say that legal protections do not exist is asnine.\n \n \n\n Want to discuss how many say the patriot act has infringed on liberties?\n Want to see how many say the equivelent of 'I don't care' or 'not true'?\n\n \n The patriot act is a dung heap upon a shitpile.", 
   {}, 
   131079, 
   null, 
   1117644240.0
  ], 
  [
   131407, 
   null, 
   "Zardoz", 
   "Yes, but that's not legally permissable. Hence this being an issue.\n\n As was said, laws can changed. Some pro-choice types in that situation would violate the law due to moral issues.\n The same happens in reverse.\n \n \nI didn't say the fetus was a body part. Your quote implied a trade of a life to mitigate potential difficulties. I was pointing out where that was wrong.\n\n Equivelant. Mass if tissue, anatomical body part.\n It's hair splitting.\n This side often sees it as a trade in life to mitigate potential difficulties. The other side often doesn't see it that way.\n \n Is this concept to hard to grasp?\n \n \nYes, they come and go I agree. Yes we do have the right to drink and smoke (in a sense because the gov't cannot restrict it). Prohibition took away that right. We do have the right to abort because the gov't cannot restrict us. There is nothing in the Constitution to prevent us from being able to.\n\n Why keep arguing the constitution?\n I don't give a rats XXX (for the sake of this discussion) about it. Rights come and go. The govenments 'right' to inmpose it's collective will upon others exist and will continue to exist. Some even seem to welcome it.\n It's not right...it's ability.\n \n Where do these 'Rights' come from?\n \n \n \nI wasn't even applying it to anything, I was merely stating that there are laws protecting those in the minority.\n\n And?\n \n \nPfft. Those with diminished competence and those whos rights have already been stripped away for offenses against our society. Neither of those cases apply to women (in this day and age). To use that as justification to force a woman to continue a pregnancy is idiotic. We, as citizens, have the right to refuse to have things happen to our body we do not want. True, this is assuming we are in our right mind, but I think we can safely assume that.\n\n Due process of the law get's to where they have 'rights' stripped away.\n AND, there are some rights that can't be 'stripped away.'\n Also, you miss the point where medication was forced upon someone who didn't have a court order stating that their 'right' was stripped away?\n Happens all the time.\n I recall my wife being instructed once when she was at a juvinile youth facility to give a perscription overdose of hormones to induce early abortion to a girl who was temprarily in their care. She refused since she knew what the medication was for and what it would do.\n The 'medication' was against the minors desires to carry a child to term as she repeatedly discussed having the baby and no one told her what the meds she was to take were for.\n Stuff like this happens all the time. This is not to say that the general desires and support of the pro-choice movement don't have altruistic ideas.\n But, the system is abused. Quite often.\n \n \nThat would be horrible. Even during normal childbirth, the woman's safety should come first. If the fetus is coming out wrong, I wouldn't want the doctors to have to worry if what they are doing to help the woman might possibly be harming the fetus (beyond what they do now). That just opens them up to more litigation.\n\n Straw man.\n At no time did I specifically imply that the womans safety wouldn't be an issue. I even said 'self defense' is applicable for termination.\n \nThis, of course, is just speculation but just illustrates the point that some believe you don't have a mythical right to harm another unless in self defense and, of course, the fetus is deemed 'another'.\n\n \n \nPregnancy is always stressful to the woman's body, which can constitute harm. It is true that parents cannot make choices to harm a born child, but that born child can be taken from them. The circumstances of pregnancy make that impossible. Legislation against the mother in favor of the \"unborn\" is morally repugnant, in my eyes.\n\n And abortion is always harmful to a woman's body. And, normal stresses have never been deemed harmful to ones body unless it was an abnormality.\n Morals are subjective. You don't seem to care about mine, why sohould I yours???\n This type of debate falls repeatedly into the 'Because I say so. form of debate.' I have said before I really don't like abortion discussions purely because it is that. But, from my perspective, I often see a lot of athiestic types bash the religious types on this subject for using such debate techniques.\n \n \nI happen to think abortion can always be talked of in terms of self-defense. You are preventing something from happening to your body, and you are using appropriate force (since nothing else will stop it from happening).\n\n And? So you think it's self defense. Others, still disagree.\n The end result is how many on our side vs your side. So far, it seems that your side has had the edge... that seems to be changing slowly. Might never be reveresed. Then again, it might. Maybe we can play 'Who has the most activist judges and who can get their representatives to change laws.'\n \n \nNo, it's a fact. The fetus has no right to life.\n\n Rights DO_NO_EXIST.\n They are a compromise between people willing to give up personal power and actions to guarantee something the prefer isn't infringed upon.\n Already there are several laws stating that if you infrionge upon a 'fetus' 'right to life', you can have SEVER consequences.\n Out side the bubble of abnortion 'rights' the law often says the fetus IS protected.\n \n \n \nEr, yes. That's why I said \"in some cases\" and \"in most cases\". I've looked up self-defense laws. Felony tresspass is able to be met with deadly force in some states. In most states burglary is able to be met with deadly force. In nearly all states killing someone while they commit a felony generally falls under \"justifiable homicide\". Whether it actually happens this way is of course a different matter.\n\n Some states...no ALL. Thus, it is NOT a universal right.\n Also, you didn't specifically state and ONLY state defense of your life. And, even then, that's not always universally true.\n \n \n \n [quote[I didn't say it was absolute.[/quote]\n And not being absolute, nothing really is. Neither is abortion. Yet, some seem to think it is or should be.\n \n \nYes, I know we over litigate in our society.\n\n hehe, Well, ligitation creates jobs... ;)\n \n \n \nConsequences always follow actions. This doesn't mean I can't change them if I'm able. Depending on the circumstances, I can be perfectly justified in killing you to protect my freedom.\n\n Sure, you can change them. Already have. Doesn't mean it will stay changed in a manner you approve of forever. And while you can be justified in killing me, a different court may say that my survivors are justified in owning you financially with wrongful death penalties.\n Odd how one court can give a verdict that seems contrary to another. *shrugs*\n \n \nThat's fine, but the Declaration not legally enforcable. The Constitution is. There is no \"right to life\" in the Constitution.\n\n A lot of things, as has been said are not protected in the constitution.\n That can and has changed...and changed back.\n \n \nOf course. The 14th provides this. However, the Federal gov't cannot in this matter. A Federal ban on abortion is unconstitutional.\n\n Currently\n \n \nThis is illegal.\n\n People with the power often get to finaggle with what's legal.\n I've stolen children with loopholes and alternate contradictorary laws.\n Legal...is FUN.\n \n \nUsing an illegal action by authorities to say that legal protections do not exist is asnine.\n\n Who enforces the law?\n If you want your rights protected and no one is willing to do so...how do you get them protected?\n What does the ACLU and other such organizations exist for? Activism...and the like. To motivate people to do something they, in essence, said or agreed to do.\n \n \nThe patriot act is a dung heap upon a shitpile.\n\n ;)\n Still, it exists currently...", 
   {}, 
   131121, 
   null, 
   1117668420.0
  ], 
  [
   131512, 
   null, 
   "Sigma", 
   "As was said, laws can changed. Some pro-choice types in that situation would violate the law due to moral issues.\n The same happens in reverse.\n\n \n I don't believe I've disputed that laws can change. I suppose this means you concede that there is currently no legal basis to forbid abortion? \n \n Whenever I make a point that something is not legally allowable, you retreat and say \"laws can change\". Yes, of course they can, but that's not the point. It's also not the point that people break the law.\n \n \n\n Equivelant. Mass if tissue, anatomical body part.\n It's hair splitting.\n This side often sees it as a trade in life to mitigate potential difficulties. The other side often doesn't see it that way.\n\n \n It's a trade in life no matter what. It is not always to mitigate potential difficulties. There is no one reason it's done for. It's a trade of life to ensure bodily autonomy.\n \n \n\n Why keep arguing the constitution?\n I don't give a rats XXX (for the sake of this discussion) about it. Rights come and go. The govenments 'right' to inmpose it's collective will upon others exist and will continue to exist. Some even seem to welcome it.\n It's not right...it's ability.\n\n \n The ability that we call a right. Why are you arguing semantics? The gov't does have the power to impose laws, and the extent of that power is detailed in the Constitution. You may not care what the Constitution says, but it is supposed to be what Federal laws are based upon. \n \n What exactly are you arguing? That laws change? I know this. That what is a right today may be restricted tomorrow? I know this. However, that is the point. Pro-life people wish to change the law, pro-choice people do not wish them to.\n \n Is it that you are morally against abortion but see that your view has no legal backing so you're holding out on the hope that the laws will change?\n \n \n\n Where do these 'Rights' come from?\n\n \n Wherever you wish to believe they come from.\n \n \n\n And?\n\n \n And nothing. You mentioned something about rights being taken away by the majority. I said that wasn't exactly true since there are laws protecting minorities.\n \n \n\n Due process of the law get's to where they have 'rights' stripped away.\n AND, there are some rights that can't be 'stripped away.'\n\n \n What rights can't be stripped away?\n \n \n \n\n Also, you miss the point where medication was forced upon someone who didn't have a court order stating that their 'right' was stripped away?\n\n \n Your point was that those who are not mentally competent or who already had their rights stripped from them had decisions made for them regarding what can be done with their body. I don't think I missed it, it just has no relevance re: abortion.\n \n \n\n Happens all the time.\n I recall my wife being instructed once when she was at a juvinile youth facility to give a perscription overdose of hormones to induce early abortion to a girl who was temprarily in their care. She refused since she knew what the medication was for and what it would do.\n The 'medication' was against the minors desires to carry a child to term as she repeatedly discussed having the baby and no one told her what the meds she was to take were for.\n Stuff like this happens all the time. This is not to say that the general desires and support of the pro-choice movement don't have altruistic ideas.\n But, the system is abused. Quite often.\n\n \n Ok, the system is abused. Your point?\n \n \n\n Straw man.\n At no time did I specifically imply that the womans safety wouldn't be an issue. I even said 'self defense' is applicable for termination.\n\n \n It is not a strawman. You outlined a situation without an exception. You did indeed imply that there would be no consideration for the woman, only that the fetus not be harmed.\n \n \n\n And abortion is always harmful to a woman's body.\n\n \n Difference: Abortion is chosen. What you wish is for her pregnancy to continue against her will.\n \n \n\n And, normal stresses have never been deemed harmful to ones body unless it was an abnormality.\n\n \n Yet it is harmful to the body. It is simply considered \"normal\" harm.\n \n \n\n Morals are subjective. You don't seem to care about mine, why sohould I yours???\n\n \n Why should I care if you care? ;)\n \n I know you have your own morals. When you try to make me follow yours, we have problems. You are free to follow your morals as they affect yourself and I will respect them, and I ask the same.\n \n\n This type of debate falls repeatedly into the 'Because I say so. form of debate.' I have said before I really don't like abortion discussions purely because it is that. But, from my perspective, I often see a lot of athiestic types bash the religious types on this subject for using such debate techniques.\n\n \n Only in a moral discussion. But since morals are subjective they can be nothing else. And since pro-life people have no legal backing, they have nothing else to argue. I assume this is why you don't argue and simply say \"laws can change\"?\n \n \n\n And? So you think it's self defense. Others, still disagree.\n\n \n Indeed they do :) It is an opinion, but to me abortion is always justified because of the circumstances surrounding pregnancy.\n \n \n\n The end result is how many on our side vs your side. So far, it seems that your side has had the edge... that seems to be changing slowly. Might never be reveresed. Then again, it might. Maybe we can play 'Who has the most activist judges and who can get their representatives to change laws.'\n\n \n It will be a step toward fascism if your side gets their way :(\n \n \n\n Rights DO_NO_EXIST.\n They are a compromise between people willing to give up personal power and actions to guarantee something the prefer isn't infringed upon.\n\n \n Which we call \"rights\".\n \n \n\n Already there are several laws stating that if you infrionge upon a 'fetus' 'right to life', you can have SEVER consequences.\n Out side the bubble of abnortion 'rights' the law often says the fetus IS protected.\n\n \n The fetus has no right to life to infringe upon. If you do certain actions you can be punished, but you cannot violate a right that does not exist.\n \n \n\n Some states...no ALL. Thus, it is NOT a universal right.\n Also, you didn't specifically state and ONLY state defense of your life. And, even then, that's not always universally true.\n\n \n It isn't ONLY in defense of your life. Criminal trespass is not threatening your life and some states allow you to kill people doing this. I did not state this is always true, I was using these as examples to refute you when you stated:  Your right to liberty is less than my right to live in nearly every society . It is not true in our society.\n \n \n\n And not being absolute, nothing really is. Neither is abortion. Yet, some seem to think it is or should be.\n\n \n Agreed. And I do think it should be.\n \n \n\n Sure, you can change them. Already have. Doesn't mean it will stay changed in a manner you approve of forever. And while you can be justified in killing me, a different court may say that my survivors are justified in owning you financially with wrongful death penalties.\n Odd how one court can give a verdict that seems contrary to another.\n\n \n Not odd. That's how the system works. That's why we have appeals :)\n \n \n\n People with the power often get to finaggle with what's legal.\n I've stolen children with loopholes and alternate contradictorary laws.\n Legal...is FUN.\n \n Who enforces the law?\n If you want your rights protected and no one is willing to do so...how do you get them protected?\n What does the ACLU and other such organizations exist for? Activism...and the like. To motivate people to do something they, in essence, said or agreed to do.\n\n \n None of this is relevant re: abortion.\n \n \n\n Still, it exists currently...\n\n \n Laws can change :p\n \n Seriously though, true, until it is struck down. Many things contained within, as far as I know, specifically contradict rights found in the Constitution. Until we get someone responsible in power or it is struck down by the courts, we will have to live with it.\n \n I'm going on vacation for a bit, see everyone later :)", 
   {
    "unicode_changes_made": true
   }, 
   131407, 
   null, 
   1117676940.0
  ], 
  [
   131604, 
   null, 
   "WhiteFalcon", 
   "Maybe that is what you meant to say but you clearly didnt say that earlier. You said the following...\n I don't make this stuff up...\n\n \n No instead you assume...\n \n \n No, however, you are claiming to.\n\n \n And you arent? I claim it because that is what I believe.\n \n \nYeah but will be able to at some point. And who else has the authority to? Are you suggesting someone can tell you whether or not you are a human being?\n\n \n Really? A \"fetus\" can decide if its a human being or not? You are suggesting someone Can say a fetus is a \"human being\", but cant not say they are. \n \n \n I would say a babies enviroment is much different then an adults. And once again, are you suggesting that enviroment is what makes you human?\n\n \n I see you have ignored the difference in \"enviornemnts\" of fetus's and everything else(ie adults, babys etc.)\n \n \n I am not one to say. But are you saying you are the one who gets to decide? Does this mean I can decide you are not a human? I don't think so.\n\n \n When did I say I decide for the whole world what is a \"human being\" and what is not. That is my own belief. I am human because I am not a fetus.\n \n \nKilling a fetus wouldn't be doing something to just her own body now would it? The fetus is a seperate organism...its own body. What about the babies choice? It doesn't get one? THat would be limiting choice. And since when do you have a choice to kill someone (other then abortion)? I guess you could have that \"choice\" I would just make the consequence jail time.\n\n \n The \"fetus\" cant voice its choice. It doesnt get one because its \"potential\". It should be the person that can voice what she wants to be done for the good of her/her potential baby. Why is it that you dont get \"jail time\" for killing a \"fetus\", but you do if you kill another \"human being\"?\n \n \nSo a potential human being is a human being then? Well that solves that problem. Seriously, they are either different or the same. You can't have it both.\n\n \n Note the word \"potential\".", 
   {}, 
   131025, 
   null, 
   1117687740.0
  ], 
  [
   131624, 
   null, 
   "Steeeeve", 
   "And you arent? I claim it because that is what I believe.\n Good to know you are the one that gets to decide who is human and who isn't. Tell me, am I human as you are the only one that can tell us all. I never claimed to be the one that gets to decide who is human. I said only ther person themself can't determine if they are human or not.\n \n \nReally? A \"fetus\" can decide if its a human being or not? You are suggesting someone Can say a fetus is a \"human being\", but cant not say they are. \n I'm suggesting we default as a human being until it(the fetus) can decide because you can't reverse the decision the other way. You are right, I think it is a human and you may not. However we really have no authority in that matter (well atleast I claim not to), and if you think about it, only you have the authority (if you beleive in no God) to say you are a human.\n \n \nI see you have ignored the difference in \"enviornemnts\" of fetus's and everything else(ie adults, babys etc.)\n \n Are you ignoring the difference in enviroments from a baby and adult?\n \n \nWhen did I say I decide for the whole world what is a \"human being\" and what is not. That is my own belief. I am human because I am not a fetus.\n I don't follow...like three sentences about you said \"I(you) claim it because that is what I believe\"..either you are claiming to be the person that decides for the whole world or you claim it only for yourself which would indicate you agree with me that only you yourself can determine if you are really a human or not.\n \n \nThe \"fetus\" cant voice its choice. It doesnt get one because its \"potential\". It should be the person that can voice what she wants to be done for the good of her/her potential baby. Why is it that you dont get \"jail time\" for killing a \"fetus\", but you do if you kill another \"human being\"?\n \n \n What if I were a mute? Does this make me not a person? And still, how is a fetus \"potential\"? I don't recall anything saying a fetus is a potential human being, I don't see anything in science, I don't see anything with my eyes that suggests a baby 1sec away from birth is only potential and 1sec later is a human. I am still wondering how it changes from one organism to the next when it is the same yet not the same at the same time. This is what you are saying you know.. You say it is a human but REALLY only a potential human which makes it not human or maybe part human. However, besides this making no sense and unknown in nature you think it is so. Do you realize that a sunflower seed is the same type of plant as when it is a seed and the actual plant. They are just different stages of development. Turning this to humans...the fetus maybe just the \"seed\" of a human but still human non the less and thus deserves basic human rights even if it can't talk, move, think, etc. So if we establish the fetus to be a person then you would have to say you rank humans in importance. Women above fetus for example, or maybe White above Black will do. Ranking humans has never been a wise idea and is never right.", 
   {}, 
   131604, 
   null, 
   1117690560.0
  ], 
  [
   131664, 
   null, 
   "WhiteFalcon", 
   "Good to know you are the one that gets to decide who is human and who isn't. Tell me, am I human as you are the only one that can tell us all. I never claimed to be the one that gets to decide who is human. I said only ther person themself can't determine if they are human or not.\n\n \n I apologize, I didnt realize that you were referring to the subject of if I can decide who is a human being or not. I thought your were referring to why you can say a fetus is or is not a \"human being\".\n \n As for the topic of who decides what is a human being or not- No, I definitley dont decide for people if they are a human being or not. Believe what you want to believe. I say society, science, and your personal belief decides what is and what isnt.\n \n \n \nI'm suggesting we default as a human being until it(the fetus) can decide because you can't reverse the decision the other way. You are right, I think it is a human and you may not. However we really have no authority in that matter (well atleast I claim not to), and if you think about it, only you have the authority (if you beleive in no God) to say you are a human.\n\n \n So what if a person where to say that they were not a \"human being\" and that they believed thus. According to your logic, this would be true thus, becuase its him thats stating it, no? \n \n \n Are you ignoring the difference in enviroments from a baby and adult?\n\n \n I believed I thouched on this earlier. Overall a baby lives in the same \"outside\" world that an adult lives in. They see the same things, and are able to interact with one another etc.\n \n I still see you avoid the difference of enviornemnts of a fetus and even a baby.\n \n \n \n \nWhat if I were a mute? Does this make me not a person? And still, how is a fetus \"potential\"? I don't recall anything saying a fetus is a potential human being, I don't see anything in science, I don't see anything with my eyes that suggests a baby 1sec away from birth is only potential and 1sec later is a human. I am still wondering how it changes from one organism to the next when it is the same yet not the same at the same time. This is what you are saying you know.. You say it is a human but REALLY only a potential human which makes it not human or maybe part human. However, besides this making no sense and unknown in nature you think it is so. Do you realize that a sunflower seed is the same type of plant as when it is a seed and the actual plant. They are just different stages of development. Turning this to humans...the fetus maybe just the \"seed\" of a human but still human non the less and thus deserves basic human rights even if it can't talk, move, think, etc. So if we establish the fetus to be a person then you would have to say you rank humans in importance. Women above fetus for example, or maybe White above Black will do. Ranking humans has never been a wise idea and is never right.\n\n \n I still fail to see an answer to one of my questions-Why is it that you dont get jail time for killing a \"fetus\", but you do if you kill another \"human being\"?\n Why cant you answer this?\n \n As for your 1 min revelance. I believe I stated before that a fetus is a fetus as long as its living off its mother and needs it to survive. A \"fetus\" 1 min/sec from being born is no longer living off its mother and doesnt need to live in her to survive. It doesnt change in a matter of \"seconds\". \n \n As for your \"mute\" comment. I never stated that a person that cant talk isnt a human being. I stated a person that cant voice their opinion then has no opinion, unless there is any other way of communicating it. A women can voice her opinion, a fetus can not.\n \n Is a seed a flower? The analogys arent going to work, we already went through the butterfly one.", 
   {}, 
   131624, 
   null, 
   1117694040.0
  ], 
  [
   132148, 
   null, 
   "wayneinFL", 
   "Originally Posted by zachvac\n So are you willing to state that a seed is the equivelant of a fully grown tree? It, just as a fetus has the potential to become one but needs support (the woman's body, someone to teach it how to live, someone to plant it and help it grow). I think this is a valid analogy, do you claim that a seed is the same as a fully grown tree?\n \n \n Good analogy. I agree 100%, A fetus needs the mother same as an infant, toddler or wayward adolescent needs his mother. An infant, toddler or adolescent can't legally be killed with or without consent of the mother, so a fetus shouldn't, either- whether you can see him or not.", 
   {}, 
   130193, 
   null, 
   1117767240.0
  ], 
  [
   132495, 
   null, 
   "jitobear", 
   "Good analogy. I agree 100%, A fetus needs the mother same as an infant, toddler or wayward adolescent needs his mother. An infant, toddler or adolescent can't legally be killed with or without consent of the mother, so a fetus shouldn't, either- whether you can see him or not.\n\n \n A mother also does not have to provide for an infant, toddler or adolescent if she can not or does not wish to (adopotion, safe haven, etc.) - this is not the case with a fetus. If she is unwilling or unable to sustain a pregnancy - she only has one option.", 
   {}, 
   132148, 
   null, 
   1117830900.0
  ], 
  [
   132498, 
   null, 
   "Hydra", 
   "[\n \n Nope, it was legislated by Liberals and feminists in 1972 with Roe V Wade.........I want to remove that legislation and give the repsonisbility back to the state where it belongs...........\n\n \n There is no legislation; Roe v. Wade was a decision handed down by SCOTUS.", 
   {}, 
   129387, 
   null, 
   1117831380.0
  ], 
  [
   132581, 
   null, 
   "Steeeeve", 
   "I apologize, I didnt realize that you were referring to the subject of if I can decide who is a human being or not. I thought your were referring to why you can say a fetus is or is not a \"human being\".\n \n As for the topic of who decides what is a human being or not- No, I definitley dont decide for people if they are a human being or not. Believe what you want to believe. I say society, science, and your personal belief decides what is and what isnt.\n Ok, I thought you might have misread somewhere emoticon_xangel Its cool though.\n \n As for who decides a human...what if society, science, and personal beliefs said one thing one day and changed the next...does this me what was right had changed? I am not convinced it does. For example. science, society, and personal beliefs thought blacks were different then whites and thus not persons however I doubt this was correct but now incorrect...I think it was always incorrect. So while science, soceity, and personal beliefs might be a good thing to reference I am not certain they are the ones that can determine that. Evenso, those 3 don't really say one way or the other...so with that you would think we should play it safe until we absolutly know. You can't reverse killing millions if you find out indeed it was a human.\n \n \nSo what if a person where to say that they were not a \"human being\" and that they believed thus. According to your logic, this would be true thus, becuase its him thats stating it, no? \n Well, if he were to decide he is not a human being then we would probably label him as \"crazy\" for one..however, I would say he could believe this if he wanted, however, not much you can do about it then.\n \n \nI believed I thouched on this earlier. Overall a baby lives in the same \"outside\" world that an adult lives in. They see the same things, and are able to interact with one another etc.\n \n I still see you avoid the difference of enviornemnts of a fetus and even a baby.\n No, I really just don't view enviroment as a critiria to be a human or to exist. I do understand what you are saying though so don't get me wrong there.\n \n \nI still fail to see an answer to one of my questions-Why is it that you dont get jail time for killing a \"fetus\", but you do if you kill another \"human being\"?\n Why cant you answer this?\n I honestly don't recall you asking..however I will answer it now.\n \n You can get jail time for killing a fetus, Scott Peterson for example got a double murder charge (and conviction). Not only that, law does not always reflect what is right. Slavery laws are a good example of that one.\n \n \nAs for your 1 min revelance. I believe I stated before that a fetus is a fetus as long as its living off its mother and needs it to survive. A \"fetus\" 1 min/sec from being born is no longer living off its mother and doesnt need to live in her to survive. It doesnt change in a matter of \"seconds\". \n \n Well technically it is living off the mother at that point but that aside, a fetus is after 2 months and you say that it is a person after it need not live on the mother? If this is so how are you sure? Are you suggesting we ban abortions after 2 months? I'd be for that idea (although would want more, but its a start), and is partial birth abortion (or whatever you wanna call it) wrong?\n \n \nAs for your \"mute\" comment. I never stated that a person that cant talk isnt a human being. I stated a person that cant voice their opinion then has no opinion, unless there is any other way of communicating it. A women can voice her opinion, a fetus can not.\n This may be true, however, that doesn't mean you can just kill the fetus. If you ask me \"can I kill you\" and I don't answer it doesn't mean you can. So if you want to use that then I suggest you go with the option that can be reversed, death not being that option.\n \n \nIs a seed a flower? The analogys arent going to work, we already went through the butterfly one.\n Yeah, it is actually. It is the same thing eventhough it may not look the same. A butterfly is the same as a cattapillar eventhough it looks different too. All these things just have different stages of development however they never change what they are.", 
   {}, 
   132498, 
   null, 
   1117843320.0
  ], 
  [
   132691, 
   null, 
   "WhiteFalcon", 
   "\n As for who decides a human...what if society, science, and personal beliefs said one thing one day and changed the next...does this me what was right had changed? I am not convinced it does. For example. science, society, and personal beliefs thought blacks were different then whites and thus not persons however I doubt this was correct but now incorrect...I think it was always incorrect. So while science, soceity, and personal beliefs might be a good thing to reference I am not certain they are the ones that can determine that. Evenso, those 3 don't really say one way or the other...so with that you would think we should play it safe until we absolutly know. You can't reverse killing millions if you find out indeed it was a human.\n\n \n If society, science, and personal belief doesnt or isnt an \"effective\" way of lableing \"human\", what is? Science proves blacks are different then whites (in skin color). If people could say and believe that they were whatever they wanted, then what would become of \"society\"? What would be the point of \"science\" that teaches us that society has named us as human beings.\n So lets say science and then society lables fetus's as humans. Does that make abortion even \"worse\" of an act? No one enjoys abortions. What you also have to see is that the \"fetus\" isnt the only \"life\" involved..\n \n \nWell, if he were to decide he is not a human being then we would probably label him as \"crazy\" for one..however, I would say he could believe this if he wanted, however, not much you can do about it then.\n\n \n Would it be \"society\" that would label him as crazy? This wouldnt be true if he lables himself as something other then \"society and science\" has labled him. \n \n \nI honestly don't recall you asking..however I will answer it now.\n \n You can get jail time for killing a fetus, Scott Peterson for example got a double murder charge (and conviction). Not only that, law does not always reflect what is right. Slavery laws are a good example of that one.\n\n \n Jail time for an abortion? If it is so easy to say a \"fetus\" is a human being, why is there a huge consequence for killing another person, but there isnt for having an abortion?\n \n \nWell technically it is living off the mother at that point but that aside, a fetus is after 2 months and you say that it is a person after it need not live on the mother? If this is so how are you sure? Are you suggesting we ban abortions after 2 months? I'd be for that idea (although would want more, but its a start), and is partial birth abortion (or whatever you wanna call it) wrong?\n\n \n A baby 1 min/sec isnt living off its mother anymore. Me personally, I would agree with making women choose a decision in a certian time limit. My main point is that they would still have that \"chioce\".\n \n \nThis may be true, however, that doesn't mean you can just kill the fetus. If you ask me \"can I kill you\" and I don't answer it doesn't mean you can. So if you want to use that then I suggest you go with the option that can be reversed, death not being that option.\n\n \n In your analogy, I would not have the \"control\" or \"responsability\" to you that a women would have with her fetus/baby. The fetus is hers. She makes the decisions. Its also the mothers body and chioce that you ignore.", 
   {}, 
   132581, 
   null, 
   1117869300.0
  ], 
  [
   132790, 
   null, 
   "Steeeeve", 
   "If society, science, and personal belief doesnt or isnt an \"effective\" way of lableing \"human\", what is? Science proves blacks are different then whites (in skin color). If people could say and believe that they were whatever they wanted, then what would become of \"society\"? What would be the point of \"science\" that teaches us that society has named us as human beings.\n So lets say science and then society lables fetus's as humans. Does that make abortion even \"worse\" of an act? No one enjoys abortions. What you also have to see is that the \"fetus\" isnt the only \"life\" involved..\n\n \n What is you ask? Well, I stated eariler that (if you dont believe in a God) then you could judge only yourself as being a human or not. I am sure you could reference society, science (which mostly refers to a fetus as a human by the way). I do see the fetus is not the only life involved. However, killing one for the benefit of another is not exactly the best thing around. I put a want below a right anyday. Someone WANTS to get an abortion because they need to finish school for example. This is more important then someones life? I think not because if this were true then me robbing someone and killing them to pay for school is more important then that guys life. A fetus is a human, A child is a human, An adult is a human...all humans have a right to live and it doesn't matter where they are what they look like (including skin color) or how many sicknesses they have.\n \n \nWould it be \"society\" that would label him as crazy? This wouldnt be true if he lables himself as something other then \"society and science\" has labled him. \n \n I never said science and society should be the standard.\n \n \nJail time for an abortion? If it is so easy to say a \"fetus\" is a human being, why is there a huge consequence for killing another person, but there isnt for having an abortion?\n Yeah, my point exactly. Talk about placing the mother above everything including the law. Someone else kills a fetus it is murder but if the mother kills it then it is ok? Seems hypocritical. I didn't thing supporting someone gave you the right to kill them. As I said eariler, not all laws are just.\n \n \nA baby 1 min/sec isnt living off its mother anymore. Me personally, I would agree with making women choose a decision in a certian time limit. My main point is that they would still have that \"chioce\".\n Not after that time limit they wouldn't. And who are you to choose when that is? Once again, that is deciding when someone is good enough to live and who really has the power to do that other then yourself about you. 1min/sec the baby is living off the mother because it is using the mothers oxygen to breath by the way (the whole thing attached to the imbilican cord(sp?). The baby doesn't open its lungs until it is out of the mother.\n \n \nfetus is hers. She makes the decisions. Its also the mothers body and chioce that you ignore.\n Since when is it ok to own someone? The baby is its own self and deserving of rights. I don't see how the mother doesn't have a choice anyway...sex or not...there is the choice (excluding rape victims here). This whole choice thing just doesn't pan out. I don't really have a choice to kill you freely do I?", 
   {}, 
   132691, 
   null, 
   1117906440.0
  ], 
  [
   133250, 
   null, 
   "WhiteFalcon", 
   "What is you ask? Well, I stated eariler that (if you dont believe in a God) then you could judge only yourself as being a human or not. I am sure you could reference society, science (which mostly refers to a fetus as a human by the way). I do see the fetus is not the only life involved. However, killing one for the benefit of another is not exactly the best thing around. I put a want below a right anyday. Someone WANTS to get an abortion because they need to finish school for example. This is more important then someones life? I think not because if this were true then me robbing someone and killing them to pay for school is more important then that guys life. A fetus is a human, A child is a human, An adult is a human...all humans have a right to live and it doesn't matter where they are what they look like (including skin color) or how many sicknesses they have.\n\n \n Isnt it society that labels us as what we are in todays world? There would be no control, and no pont for societys basis and science's beliefs. The word \"human being\" would not be of what it is today. There is too much \"personal\", and not enough \"control\" in your example. The mother should have the say in what id done with the \"fetus\". She is carrying it, she created it, she would be the one responsable for her Own \"fetus's\" life. Again the fetus cant and doesnt have a voice/opinion, therfore the one who would carry this \"fetus\" and who created it sould have all the power to decide what she wants done, because if it werent for her in the first place this \"fetus\" wouldnt be inside her. All women should have a \"choice\" for what they want to be done to Their Own baby.\n \n \nI never said science and society should be the standard.\n\n \n Yes however you said \"he would be labled as crazy\". Who would label hm that then, if its not \"society\"?\n \n \n Yeah, my point exactly. Talk about placing the mother above everything including the law. Someone else kills a fetus it is murder but if the mother kills it then it is ok? Seems hypocritical. I didn't thing supporting someone gave you the right to kill them. As I said eariler, not all laws are just.\n\n \n Hypocritical? The \"women\" does more then support her fetus. Since when can it be allowed were the government strips people of their choices that involve their own body?\n \n \nNot after that time limit they wouldn't. And who are you to choose when that is? Once again, that is deciding when someone is good enough to live and who really has the power to do that other then yourself about you. 1min/sec the baby is living off the mother because it is using the mothers oxygen to breath by the way (the whole thing attached to the imbilican cord(sp?). The baby doesn't open its lungs until it is out of the mother.\n\n \n That is my \"personal belief\", one of which you seem to support more then \"society and science\" in basing on what isnt and what is. \n \n \n Since when is it ok to own someone? The baby is its own self and deserving of rights. I don't see how the mother doesn't have a choice anyway...sex or not...there is the choice (excluding rape victims here). This whole choice thing just doesn't pan out. I don't really have a choice to kill you freely do I?\n\n \n Because that baby is surviving becuase of her. How can she not beable to have \"ownership\" if she is this \"fetus's\" way of survival? It should be the womens choice if She would want to have Her baby. Ill ask again, Since when can it be allowed were the government strips people of their choices that involve their own body? That baby is Hers, and she should have all the right to decide what she wants for Her baby.", 
   {}, 
   132790, 
   null, 
   1118008080.0
  ], 
  [
   133293, 
   null, 
   "Steeeeve", 
   "Isnt it society that labels us as what we are in todays world? There would be no control, and no pont for societys basis and science's beliefs. The word \"human being\" would not be of what it is today. There is too much \"personal\", and not enough \"control\" in your example. The mother should have the say in what id done with the \"fetus\". She is carrying it, she created it, she would be the one responsable for her Own \"fetus's\" life. Again the fetus cant and doesnt have a voice/opinion, therfore the one who would carry this \"fetus\" and who created it sould have all the power to decide what she wants done, because if it werent for her in the first place this \"fetus\" wouldnt be inside her. All women should have a \"choice\" for what they want to be done to Their Own baby.\n Are you what society says you are? No. You are what you are. Even so, if we just went on societys and science belief we still would come up with a fetus being a human life.\n \n You then say the fetus has no voice/opinion. I will answer that by saying how do you know? Did the fetus say to you it had no opinion? Being able to form an opinion or speak is not what makes you a human. Then you say the mother created it...and I would say it takes two to create a life. Also, if you say that then your mother should be able to control you now too. You are suggesting that if you need someone for survival then they have the right to kill you whenever you want. I can't think of any instance where this is a good idea much less moral. Not only that, a women does have a choice to do what she wants with her own body...however, the fetus is not her body now is it?\n \n \nYes however you said \"he would be labled as crazy\". Who would label hm that then, if its not \"society\"?\n Ok...does this make it true? Society can label all they want but that standard won't work as society is often wrong....slavery comes to mind again.\n \n \nHypocritical? The \"women\" does more then support her fetus. Since when can it be allowed were the government strips people of their choices that involve their own body?\n Since forever. Ever heard of drug laws? You can be detained for attempting suicide, you can't be drunk in public, you can't do a lot of things to yourself and this restricts your \"choices\" to your own body. As for your first sentence, the women was given the gift of being able to bare children. They happen to be the ones that carry a child for development. How does this make it ok to give them right to kill?\n \n \nThat is my \"personal belief\", one of which you seem to support more then \"society and science\" in basing on what isnt and what is. \n I don't want what I believe to be the standard because who am I to do such a thing? However, the fetus can decide for himself and until then you can't kill them.\n \n \nThat baby is Hers, and she should have all the right to decide what she wants for Her baby.\n So if I purchase an adult then I have the right to decide what I want to do with it? No, of course not. The fact that it is inside the mother doesn't matter either. If it is a human you just can't kill it unless you believe murdering is ok.", 
   {}, 
   133250, 
   null, 
   1118012760.0
  ], 
  [
   134016, 
   null, 
   "WhiteFalcon", 
   "Are you what society says you are? No. You are what you are. Even so, if we just went on societys and science belief we still would come up with a fetus being a human life.\n\n \n Really? If I say I am an alien does it make it \"True\"? We learn what we are , what is correct, by what society gives us. \n \n \nYou then say the fetus has no voice/opinion. I will answer that by saying how do you know? Did the fetus say to you it had no opinion? \n\n \n The \"fetus\" has no voice, and is therfore incapable of \"voicing\" an opinion. How do I know? Last time I checked, a \"fetus\" cant communicate to us.\n \n \nBeing able to form an opinion or speak is not what makes you a human. \n\n \n Never said it is. Go back to your \"mute\" comment, becuase we have already gone through this issue.\n \n \n Then you say the mother created it...and I would say it takes two to create a life. \n\n \n Sure \"two\" create. Who caries the \"fetus\" and provides the things necessary for survival? \n \n \n Also, if you say that then your mother should be able to control you now too. You are suggesting that if you need someone for survival then they have the right to kill you whenever you want. \n\n \n I dont believe thats what I am suggesting. I am suggesting that a women should be able to have and voice her own choice of what she wants with the baby that she would bring into this world. I am suggesting that we dont \"control\" these women and at many times make them ruin their lives, because they now have to care for a baby. I am suggesting that the \"babies\" should have parents that want it to be born. \n \n \nI can't think of any instance where this is a good idea much less moral. Not only that, a women does have a choice to do what she wants with her own body...however, the fetus is not her body now is it?\n\n \n Well earlier you said that it was attached to the mother throughout the whole term (ie. 1 min/sec from birth). I would say a baby being born has a lot to do with the mothers \"body\". \n \n \nOk...does this make it true? Society can label all they want but that standard won't work as society is often wrong....slavery comes to mind again.\n\n \n You tell me. Your the one that said \"he would be labled as crazy\". From the \"standard\" that society has set I would say people would agree that in such a case he would be \"crazy\". \n \n \n I don't want what I believe to be the standard because who am I to do such a thing? However, the fetus can decide for himself and until then you can't kill them.\n\n \n The \"fetus\" cant decide for itself. \n \n \nSo if I purchase an adult then I have the right to decide what I want to do with it? No, of course not. The fact that it is inside the mother doesn't matter either. If it is a human you just can't kill it unless you believe murdering is ok.\n\n \n Your analogy again is poor. If you \"purchase\" a human being? You cant continue to ignore that a women is the \"voice\" of this \"fetus\", because the fetus has none. \n \n The matter of if a particular women wants to have a baby should be her choice, not the governments.", 
   {}, 
   133293, 
   null, 
   1118123160.0
  ], 
  [
   358536, 
   null, 
   "simone", 
   "There's so much debate over whether or not a fetus is a human being.\n \n But no one would be born into this world without first being an embryo, and then developing into a fetus.\n \n If your mother had an abortion while YOU were in the womb, would YOU \"be a human being\" right now? I doubt it.\n \n A fetus has been proven to be alive. It has a heart beat and a developing body. New ultrasound technology has even proven that babies in the womb smile when external stimulus like an abdomen rub is introduced.\n \n Each one of us goes through continuous stages of development, begining with the embryonic stage, and ending with the break down of the body in old age (if we live that long). Some say that the brain is not developed in a fetus though. But the brain is not yet fully developed in a 2 year old either. Should we allow 2 year olds to be killed?\n \n So, if a fetus is not human, then what were YOU at that stage of development? Could YOU have been killed during an abortion, or would it just have been a glob of tissue (which conveniently resulted in your non-existence)?\n\n I've been a fetus in the womb. Eventually I'll be a small pile of ashes. Are you going to grant me total human rights in perpetuity?", 
   {}, 
   128996, 
   null, 
   1245879660.0
  ], 
  [
   358537, 
   null, 
   "Another opinion", 
   "I've been a fetus in the womb. Eventually I'll be a small pile of ashes. Are you going to grant me total human rights in perpetuity?\n\n Simone, just to let you know, you should double check how old a thread is before you respond to it. This thread pretty much ended in 2005. Indeed, \"Uncle Sam I am\" hasn't posted anything since 05-31-2005 which means that he is long gone. It was only revived because of a completely unrelated post by vwxy500 whose only posts are two posts advertising wholesale prices on various goods. So, my guess would be that it was a computer automatically finding random places to post the advertisements. Unless someone new decides to answer your post here, I would be highly surprised if anyone who had actually participated on that thread will answer you.", 
   {}, 
   358536, 
   null, 
   1245880260.0
  ], 
  [
   358541, 
   null, 
   "Chuz Life", 
   "I've been a fetus in the womb. Eventually I'll be a small pile of ashes. Are you going to grant me total human rights in perpetuity?\n\n \n The right one has to their life is \"granted?\"\n \n I thought that the right that a person has to their life, liberty, due process etc.. (basic human rights) are inherent.\n \n Not so?", 
   {
    "post_info": {
     "post_title": "The right one has to their life is &quot;granted?&quot;"
    }
   }, 
   358536, 
   null, 
   1245880860.0
  ], 
  [
   358542, 
   null, 
   "chester", 
   "The right one has to their life is \"granted?\"\n \n I thought that the right that a person has to their life, liberty, due process etc.. (basic human rights) are inherent.\n \n Not so?\n\n \n Once again, your position on this metaphysical issue is weak.emoticon_mad\n \n If it were the universal that you claim it is, it would not need the force of law for its enforcement.\n \n Would you repeal Section 1 of Amendment XIV and the Census Clause, both of which confer personhood only on born persons?", 
   {
    "post_info": {
     "post_title": "Choice - an all-American family value!"
    }
   }, 
   358541, 
   null, 
   1245881640.0
  ], 
  [
   358545, 
   null, 
   "Chuz Life", 
   "Once again, your position on this metaphysical issue is weak.emoticon_mad\n \n If it were the universal that you claim it is, it would not need the force of law for its enforcement.\n \n Would you repeal Section 1 of Amendment XIV and the Census Clause, both of which confer personhood only on born persons?\n\n \n Chester I don't have time to educate you. But you should be made aware of the fact that most people can see that the 14th Amendment (and the census) makes a distinction between \"persons\" and \"citizens\" (person's born or naturalized in the U.S.)\n \n As to your other comment,... if ignorance and denials such as yours were \"universal\" I guess we would not need debate the issue any further as well.\n \n So much for your non-sequitur fallaciousness.\n \n emoticon_xclown", 
   {
    "post_info": {
     "post_title": "Persons and citizens,...."
    }
   }, 
   358542, 
   null, 
   1245882300.0
  ], 
  [
   358556, 
   null, 
   "chester", 
   "Chester I don't have time to educate you. But you should be made aware of the fact that most people can see that the 14th Amendment (and the census) makes a distinction between \"persons\" and \"citizens\" (person's born or naturalized in the U.S.)\n \n As to your other comment,... if ignorance and denials such as yours were \"universal\" I guess we would not need debate the issue any further as well.\n \n So much for your non-sequitur fallaciousness.\n \n emoticon_xclown\n\n \n Translation: I elevate my position on this metaphysical question above all others, and, since it is weak, I demand that the law be used to enforce it upon others, whether or not they agree.\n \n Nice statement in a pluralistic society, wouldn't you say?emoticon_mad", 
   {
    "post_info": {
     "post_title": "Choice - an all-American family value!"
    }
   }, 
   358545, 
   null, 
   1245887580.0
  ], 
  [
   358558, 
   null, 
   "Chuz Life", 
   "Translation: I elevate my position on this metaphysical question above all others, and, since it is weak, I demand that the law be used to enforce it upon others, whether or not they agree.\n \n Nice statement in a pluralistic society, wouldn't you say?emoticon_mad\n\n \n I can't overcome anyone's perceptive problems but my own, Chester. If this is actually your translation of my stated position, so be it. I do remember that such mis-characterizations are against the forum rules, however; so I will be reporting it for abuse. \n \n It is also worth noting that in a free society, We have a Constitutional right to \"demand\" laws for anything we want. That doesn't mean our demands will be respected. For that (respect from our lawmakers) we need to make *compelling Constitutional arguments; and support those arguments (demands) with sufficient information as to compel the lawmakers to redress our grievances. (*= add a bunch of other political pressures and money in a real world application)\n \n --Chuz Life emoticon_xbye", 
   {
    "post_info": {
     "post_title": "If this is how you see it,..."
    }
   }, 
   358556, 
   null, 
   1245891000.0
  ], 
  [
   358614, 
   null, 
   "simone", 
   "Simone, just to let you know, you should double check how old a thread is before you respond to it. This thread pretty much ended in 2005. Indeed, \"Uncle Sam I am\" hasn't posted anything since 05-31-2005 which means that he is long gone. It was only revived because of a completely unrelated post by vwxy500 whose only posts are two posts advertising wholesale prices on various goods. So, my guess would be that it was a computer automatically finding random places to post the advertisements. Unless someone new decides to answer your post here, I would be highly surprised if anyone who had actually participated on that thread will answer you.\n\n Point taken.", 
   {}, 
   358537, 
   null, 
   1245954060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is there anyone here who has NEVER been a fetus in the womb?", 
  "url": "http://www.4forums.com/political/abortion-debates/5417-there-anyone-here-who-has-never-been-fetus-womb.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 5417, 
  "discussion_files": [
   [
    "2130.html", 
    "http://www.4forums.com/political/abortion-debates/5417-there-anyone-here-who-has-never-been-fetus-womb-print.html"
   ], 
   [
    "2131.html", 
    "http://www.4forums.com/political/abortion-debates/5417-there-anyone-here-who-has-never-been-fetus-womb-7-print.html"
   ], 
   [
    "2132.html", 
    "http://www.4forums.com/political/abortion-debates/5417-there-anyone-here-who-has-never-been-fetus-womb-5-print.html"
   ], 
   [
    "2133.html", 
    "http://www.4forums.com/political/abortion-debates/5417-there-anyone-here-who-has-never-been-fetus-womb-4-print.html"
   ], 
   [
    "2134.html", 
    "http://www.4forums.com/political/abortion-debates/5417-there-anyone-here-who-has-never-been-fetus-womb-6-print.html"
   ], 
   [
    "2135.html", 
    "http://www.4forums.com/political/abortion-debates/5417-there-anyone-here-who-has-never-been-fetus-womb-3-print.html"
   ], 
   [
    "2136.html", 
    "http://www.4forums.com/political/abortion-debates/5417-there-anyone-here-who-has-never-been-fetus-womb-2-print.html"
   ]
  ], 
  "identifier": 5417
 }
]