[
 [
  [
   129015, 
   null, 
   "gnojek", 
   "Hey, I just had to share this.\n \n What do you think?\n \n http://www.whitehouse.gov/news/releases/2005/05/20050524-3.html\n \n \nSee, in my line of work you got to keep repeating things over and over and over again for the truth to sink in, to kind of catapult the propaganda.\n\n \n You gotta at least give the man credit for being honest!\n \n I'll just chalk this line up on Dubya's list of gems. :)", 
   {
    "post_info": {
     "post_title": "Bush's Social Security Propaganda"
    }
   }, 
   null, 
   null, 
   1117150860.0
  ], 
  [
   129849, 
   null, 
   "Duo_Maxwell", 
   "http://www.dldewey.com/feb05.htm\n \n Actual picture of where social security stands. Notice he blames both parties.", 
   {}, 
   129015, 
   null, 
   1117355940.0
  ], 
  [
   129866, 
   null, 
   "gamehuis", 
   "http://www.dldewey.com/feb05.htm\n \n Actual picture of where social security stands. Notice he blames both parties.\n\n Very interesting article, thanks for the link.\n \n Apart from the whole Social Security issue, I find the last part of the article which was about Homeland Security most disturbing.", 
   {}, 
   129849, 
   null, 
   1117363560.0
  ], 
  [
   129951, 
   null, 
   "Steeeeve", 
   "Hey, I just had to share this.\n \n What do you think?\n \n http://www.whitehouse.gov/news/releases/2005/05/20050524-3.html\n \n \n \n You gotta at least give the man credit for being honest!\n \n I'll just chalk this line up on Dubya's list of gems. :)\n\n \n Not very sure how you took that line....however, he was referring to catapulting the proproganda that says he is going to cut SS for current retiriees. I'm not seeing your point :p", 
   {}, 
   129015, 
   null, 
   1117391820.0
  ], 
  [
   130744, 
   null, 
   "gnojek", 
   "It doesn't matter how he meant it. It's a great line.\n Besides, I doubt he meant what you say.\n He was probably looking at propaganda in a good way, as in merely disseminating information.\n \n I like this website though.\n \n http://zfacts.com/p/793.html\n \n http://zfacts.com/p/784.html\n \n Anyway, I'm not trying to argue about private accounts or what, because I don't really care that much about SS. I never planned on relying on it for anything. But it would be nice if I find myself SOL after retirement for some reason to at least have some of my money back from SS.\n \n I just wanted to share this great quote.", 
   {}, 
   129951, 
   null, 
   1117565340.0
  ], 
  [
   130768, 
   null, 
   "kickin50", 
   "Observation. Some people say they never planned on counting on SS anyway so what's the difference. Some people have given up ever seeing a penny. Some are hoping for something. Anything is better than nothing. Why is that? Why has the public so bought in to the sales pitch that it's a lost cause. Why can't we demand that the budget be reorganized and reprioritized to pay what we're owed. They took my money and I want it back. I feel like every pay stub is a receipt - and :xcensored it, I want what I paid for. To Uncle Sam: quit taking money under false pretenses and spending it elsewhere. If Uncle Sam wasn't a cartoon character, he'd be in jail.", 
   {}, 
   130744, 
   null, 
   1117568940.0
  ], 
  [
   130782, 
   null, 
   "fracas", 
   "some public sentimemt on the topic\n link", 
   {}, 
   130768, 
   null, 
   1117571520.0
  ], 
  [
   130783, 
   null, 
   "daewoo", 
   "Well said, Kickin50\n \n It is sad that public accountability in this country has dropped to the point that Americans simply watch thousands of dollar per year dissapear from their payroll, supposedly to help fund their retirement, with no percieved hope of ever seeing it again, and we squabble over \"private accounts\".\n \n Better idea, the next politican who submits or argues for approval of a budget that includes funds from the SS trust fund, we drag them out, tar and feather them, toss them up against the wall and shoot them, then leave the body hanging outside the capitol building until it rots away as a reminder to our other leaders that we find the theft of trillions of dollars unacceptable. \n \n There seems to be a debate about whether or not SS in in crisis or not. There should be no debate, seocial secutiry is definatly in crisis, becase the politicians have stolen all the money out of it to support irresponsible spending. current real value of the SS trust fund is under $100 million bucks. The rest is IOUs that we have no dedicated revenue stream to repay.", 
   {}, 
   130768, 
   null, 
   1117571760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush's Social Security Propaganda", 
  "url": "http://www.4forums.com/political/politics-debates/5419-bushs-social-security-propaganda.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 5419, 
  "discussion_files": [
   [
    "26106.html", 
    "http://www.4forums.com/political/politics-debates/5419-bushs-social-security-propaganda-print.html"
   ]
  ], 
  "identifier": 5419
 }
]