[
 [
  [
   129486, 
   null, 
   "Voice Of Reason", 
   "Another strike against Gay marriage?\n \n http://www.foxnews.com/story/0,2933,157922,00.html\n \n N.Y. Court: Mayor to Be Tried for Gay Nups \n Friday, May 27, 2005\n \n \n New Paltz, N.Y., Mayor Jason West (search) faces 24 misdemeanor counts of violating the state's domestic relations law by marrying couples without licenses in late February 2004. He faces fines and up to a year in jail if convicted.\n \n West's actions came amid a flurry of efforts in various states to wed gay couples after San Francisco Mayor Gavin Newsom (search) allowed gay couples there to marry in February 2004. Those efforts have largely been put on hold by the courts.\n \n West has maintained he was upholding the gay couples' constitutional rights to equal protection - and thus his oath of office - by allowing them to wed in the Hudson Valley college town in late February 2004.\n \n But top state officials, including Gov. George Pataki (search) and Attorney General Eliot Spitzer (search), have said same-sex ceremonies violate state law.", 
   {
    "post_info": {
     "post_title": "Mayor to stand trial for marrying Gays in New York"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1117240620.0
  ], 
  [
   129505, 
   null, 
   "Jaaaman", 
   "Well, he broke the law in marrying these couples without a license. He deserves whatever punishment that he gets.", 
   {}, 
   129486, 
   null, 
   1117243200.0
  ], 
  [
   129859, 
   null, 
   "Duo_Maxwell", 
   "Depends. I doubt sptizer is going to waste his time on that case, but if he does, then the mayor is in for a rough ride. \n \n Still, if he can prove the law is unconsitutional, then all is well. Merely because the state law says A does not make it consitutional, but then again, look who posted the article emoticon_rolleyes, that says much about which kind of people think lowely of the consitution.", 
   {}, 
   129505, 
   null, 
   1117357860.0
  ], 
  [
   130103, 
   null, 
   "JustineCredible", 
   "OMG OMG OMG!!! I JUST GOT IT!!!     \n \n \n It arrived yesterday just before I was to leave to attend a \"Meet and Greet\" put on by one of my bosses (as I work for myself...most of the time and do a lot of side work here and there) for Chicago IML. \n \n I finally got my copy of the \"Gay Agenda!\" I was so amazed!!! \n \n You'll never guess what the first line says~~~~ \n \n \n WE THE PEOPLE...\n \n \n Hmmm...yup, there you have it folks...the \"Gay Agenda\"...aka \n The US CONSTITUTION! Get used to it!", 
   {}, 
   129859, 
   null, 
   1117411320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mayor to stand trial for marrying Gays in New York", 
  "url": "http://www.4forums.com/political/gay-rights-debates/5430-mayor-stand-trial-marrying-gays-new-york.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 5430, 
  "discussion_files": [
   [
    "22716.html", 
    "http://www.4forums.com/political/gay-rights-debates/5430-mayor-stand-trial-marrying-gays-new-york-print.html"
   ]
  ], 
  "identifier": 5430
 }
]