[
 [
  [
   129757, 
   null, 
   "Wez", 
   "What's everyone's opinion on them?\n \n http://www.homeoffice.gov.uk/n_story.asp?item_id=675\n \n -Wez", 
   {
    "post_info": {
     "post_title": "UK ID cards"
    }
   }, 
   null, 
   null, 
   1117319760.0
  ], 
  [
   129765, 
   null, 
   "Eddie", 
   "Iris scans and fingerprints aside, we`ve practicly had this system for years. While there is no law making it mandatory to carry ID cards, you can`t really function wihtout one...", 
   {}, 
   129757, 
   null, 
   1117322820.0
  ], 
  [
   129870, 
   null, 
   "OccamsRazor", 
   "What's everyone's opinion on them?\n \n -Wez\n\n \n Less than enthusiastic!\n \n I'm very concerned by this proposed scheme- firstly how much is everyday person going to have to fork out on one of these things? The London School of Economics (LSE) has just published an analysis on the likely expense of implementing the system and has said that the governments £5.88bn over 10 years is far too low and a cost of £12-18bn is far more likely. In their estimation that is a minimum cost range as it does not consider the cost of legal battles against organisations (like Liberty) and individuals whose chose to refuse cards on moral/legal grounds. LSE decribes these costs as being \"substantial\".\n \n Remember the Poll tax? groups set up to give legal advice to those who refused to pay their tax, and this organised opposition cost the judicary large sums of money fighting battles against the objectors. The same could happen with ID cards- with the advent of the WWW opposition will be on an altogether larger and co-ordinated level.\n \n This sounds like the scheme could be very costly- and the government has already indicated it will pass the cost of the scheme on, in part at least, to the citizens (well, subjects if we are to be exact) of the UK. How often will the ID card then have to be renewed? how much is that going to cost? we already have 10 year passports and 10 year photocard driving licences which we pay for.\n \n Cost aside there are the more serious issues around how ID cards will affect our day to day lives:\n \n -what will become dependent on them?\n -will we have to carry them at all times?\n -when will be obliged to produce them?\n -under what circumstances will the Police be able to insist we show our ID card?\n -what will the consequences (ie. criminalisation) of not producing an ID card when required?\n -how quickly can a replacement be arranged?\n \n I'm also worried that once we have ID cards we are stuck with them forever more. In addition, once a scheme is passed in law it them becomes much easier to alter it to tighter limits than would have been acceptable at its introduction- ie. to begin with it might only be necessary to produce an ID card when requested at a Police station within 7 days, as applies a driving liscence at the moment. This law could then be altered in the future, for example, to make them mandatory to carry at all times.", 
   {}, 
   129757, 
   null, 
   1117368960.0
  ], 
  [
   129875, 
   null, 
   "Wraith", 
   "I'd rather they spend the money on more (proper) police.\n \n \n \n \n \nI'm also worried that once we have ID cards we are stuck with them forever more. In addition, once a scheme is passed in law it them becomes much easier to alter it to tighter limits than would have been acceptable at its introduction- ie. to begin with it might only be necessary to produce an ID card when requested at a Police station within 7 days, as applies a driving liscence at the moment. This law could then be altered in the future, for example, to make them mandatory to carry at all times.\n\n \n Yes, I agree with all of this -- it's only a short step before we're required to be 'chipped'. First it'll be voluntary then it will slowly become mandatory.", 
   {}, 
   129870, 
   null, 
   1117370040.0
  ], 
  [
   129896, 
   null, 
   "georged", 
   "I'd rather they spend the money on more (proper) police.\n Yes, I agree with all of this -- it's only a short step before we're required to be 'chipped'. First it'll be voluntary then it will slowly become mandatory.\n\n \n The US has required federal social security numbers be issued to infants for years. States are now required to adopt federal standards for driver licenses\n or lose federal LE grants. The current reliance on SS numbers for national identification was graphically demonstrated when I changed states of residence and my new state would not accept my original SS card as a second piece of identification because it had been laminated, a federal implementation. \n \n I think chips will eventually become the norm in all developed nations. In the US all valuable farm/sporting stock and many domestic pets have been chipped for years. As Eddie points out, ID has been required to function within society on a normal basis for a long time. Try traveling without a credit card and passport/driver license to back it up.", 
   {}, 
   129875, 
   null, 
   1117385640.0
  ], 
  [
   130006, 
   null, 
   "Wraith", 
   "The US has required federal social security numbers be issued to infants for years. States are now required to adopt federal standards for driver licenses\n or lose federal LE grants. The current reliance on SS numbers for national identification was graphically demonstrated when I changed states of residence and my new state would not accept my original SS card as a second piece of identification because it had been laminated, a federal implementation.\n\n \n Just to make a point here we're talking about UK ID cards.\n \n I live in England, we have national insurance numbers.\n \n \nI think chips will eventually become the norm in all developed nations. In the US all valuable farm/sporting stock and many domestic pets have been chipped for years. As Eddie points out, ID has been required to function within society on a normal basis for a long time. Try traveling without a credit card and passport/driver license to back it up.\n\n \n I don't get your point here -- I'd rather see the money spent on more Police.\n \n I also oppose ID cards for reasons beyond them being a massive waste of public money.\n \n Oh and I don't have a credit card nor do I have any plans on getting one. I've been to the US four times.\n \n Some people don't travel, and some people don't own cars and they aren't required to carry about ID.\n \n I find it highly amusing that you should bring up US policies as if you're saying \"well the US has X what's your problem with bringing in similar in the UK?\".\n \n I also don't consider the government has any right to enforce the surgical implantation of mirco chips into the public.", 
   {}, 
   129896, 
   null, 
   1117398540.0
  ], 
  [
   130018, 
   null, 
   "georged", 
   "Just to make a point here we're talking about UK ID cards.\n \n I live in England, we have national insurance numbers.\n \n \n \n I don't get your point here -- I'd rather see the money spent on more Police.\n \n I also oppose ID cards for reasons beyond them being a massive waste of public money.\n \n Oh and I don't have a credit card nor do I have any plans on getting one. I've been to the US four times.\n \n Some people don't travel, and some people don't own cars and they aren't required to carry about ID.\n \n I find it highly amusing that you should bring up US policies as if you're saying \"well the US has X what's your problem with bringing in similar in the UK?\".\n \n I also don't consider the government has any right to enforce the surgical implantation of mirco chips into the public.\n\n \n I was offering a comparison, nothing else intended, of the US easing into national identification, how that's been accomplished and agreeing with another poster that chips will eventually become the norm. I'm old enough that I'm not particularly concerned with the issue affecting my life, personally or in a political manner. I understand your sensitivity regarding US policies in your response suggesting I was favoring US paranoia beginning to dominate some UK matters, but that was the price paid for joining Bush the Crusader's aggression, of which I'm in total disagreement.", 
   {}, 
   130006, 
   null, 
   1117400400.0
  ], 
  [
   130242, 
   null, 
   "Phunting", 
   "Mixed. I have no problem with them being introduced, and think they would help guard against various abuses of the system. Whether they are worth the money we would have to fork out for them remains to be seen.\n \n I don't have a problem with it being compulsory to carry them, but understand a lot would do. Although I don't see why they should be compulsory to be carried as long as they could be produced when taking a new job, going to the doctors or using other services.", 
   {}, 
   130018, 
   null, 
   1117457760.0
  ], 
  [
   130244, 
   null, 
   "Jo Bennett", 
   "I've never heard anything that proves to me that they would be useful. All listed benefits seem to be vague and only really applicable if people are required to carry them and produce them on demand. I don't want the liberty to go where I like annonymously so long as I am not committing a crime taken away. The government has no right to monitor me.", 
   {}, 
   130242, 
   null, 
   1117458180.0
  ], 
  [
   130247, 
   null, 
   "Big_Bear_Scot", 
   "I don't agree with the things.\n \n First of all up here in Scotland, you will not be required to produce ID cards to access devolved services such as the NHS. So they will be pretty useless up here. Now comes the problem, if I go down South for Holiday and I become sick I would be required to show the ID card to get treatment.\n \n Another reason why I despise them is the cost of the things, the Government wants to introduce them but they want to pass the cost of the cards on to us.", 
   {}, 
   130244, 
   null, 
   1117458960.0
  ], 
  [
   130267, 
   null, 
   "Wez", 
   "All the benifits they will apparently provide, appear to be easier to produce if the money was simply spent on more policemen/ law enforcement agencies...\n \n -Wez", 
   {}, 
   130247, 
   null, 
   1117463520.0
  ], 
  [
   130268, 
   null, 
   "Eddie", 
   "I don`t really get this. If you don`t have ID cards, how do you verify your identity when purchasing alcohol or medicine, using a creditcard, rent a movie, apply for loans, withdraw cash from bank accounts, take tests at the uni etc etc? I mean, not everyone has a driving license, right?", 
   {}, 
   130267, 
   null, 
   1117463940.0
  ], 
  [
   130270, 
   null, 
   "Big_Bear_Scot", 
   "don`t really get this. If you don`t have ID cards, how do you verify your identity when purchasing alcohol or medicine, using a creditcard, rent a movie, apply for loans, withdraw cash from bank accounts, take tests at the uni etc etc? I mean, not everyone has a driving license, right?\n \n \n With Alcohol, the person who serves the alcohol may ask for ID, where a passport,student card or driver license can be used. If no ID is shown then you can be refused service. But usually you only get asked for ID if you look under 18 or in some places 21.\n \n With a credit card, we have a method of Chip and pin where you enter your pin number into the keypad once your card has been swiped, before that was introduced a signature was used to verify identity.\n \n To rent a movie, when you join a Rental shop you can produce 2 forms of ID such as a house hold Bill or a bank statement, then you can rent any movie you want as long as you meet that age restriction of the film.\n \n For Withdrawing money, you usually go to a cash machine(ATM) to lift money. But if you go into the branch they have a system similar to the chip and pin method of using credit cards.\n \n For Taking tests at uni you just produce your Student ID when you take the test.", 
   {}, 
   130268, 
   null, 
   1117464480.0
  ], 
  [
   130271, 
   null, 
   "Jo Bennett", 
   "You don't need an ID for medicine usually - you need a prescription, you can get someone else to pick it up for you. For alcohol they can refuse to serve you if they don't think you're 18, and there are various things you can prove your age with if it's a problem.\n \n Credit card you use a signature or a PIN given to you by the issuer. Rent a movie you use a card given to you by the video store, I use my student union card as it's a student union owned store. Applying for loans you use a combination of a variety of possible IDs, including Brith certificate, marriage certificate, bank statements, utility bills etc. Withdrawing cash from bank accounts it's usually signature or pin, as for credit cards. For large amounts they can ask for Birth certificate and/or other items as for loans. Taking tests at uni I use my uni Library Card, which has my photo and my library card number.\n \n The difference with all these is that they're not held by central government, they don't contain biometric information, or links to medical records, or whatever. They detail, at most, my name, contact details, date of birth, and what course I'm taking.", 
   {}, 
   130268, 
   null, 
   1117464540.0
  ], 
  [
   131102, 
   null, 
   "lord tammerlain", 
   "Here is one reason to dislik the UK National ID card\n http://www.axisoflogic.com/artman/publish/article_18169.shtml\n \nHome Office disagrees but hides behind \"commercial confidentiality\" card...\n \n The cost of the government's proposed biometric national ID card scheme will more than treble to £18bn, according to a report by experts at the London School of Economics (LSE).  \n A regulatory impact assessment by the Home Office last year put the cost of the controversial ID card scheme at around £5.5bn over 10 years but the LSE study to be released later this week estimates the actual cost will work out at between £12bn and £18bn. That would mean the cost of a biometric ID card rising from the current Home Office figure of £93 paid by each citizen to a cost of more than £300 per individual.\n \n \n snip\n \n Hosein also questioned the suitability of multiple biometric identifiers to be used in such a vast and complex project. \n \n \"There aren't any large-scale biometric ID schemes like this anywhere in the world. I don't think biometric technology was made to be done on this scale,\" he said. \n \n The Home Office said it disagreed with the LSE figures but declined to reveal the cost of setting up the ID card scheme citing \"reasons of commercial confidentiality\". \n \n A spokeswoman also declined to comment on why the government figures should be trusted when it had already revised the cost and purpose of the ID cards upwards three times from an initial £25 per card back in 2003 to the current figure of £93.\n \n\n \n In USD that would be something like 30-40 billion dollars. Is there really a need for such a complex ID system?", 
   {}, 
   130271, 
   null, 
   1117636020.0
  ], 
  [
   131240, 
   null, 
   "Wraith", 
   "£18 billion far better spent on more police...", 
   {}, 
   131102, 
   null, 
   1117656300.0
  ], 
  [
   131505, 
   null, 
   "Tastyfish", 
   "£18 billion far better spent on more police...\n\n Or just a really big sign that says \"Please don't commit crime\".\n \n Enough similar things in place at the moment anyway for where it will do anything, all I see it doing is costing money and opening the door for more extensive indentity theft. If you can get a passport and driving licience illegally then its not much different for a card unless we get truly into the realms of the excessive, yet still there are probably easier ways round things.\n \n I don't honestly see the massive civil liberty problems - get caught without an ID card (say pulled over by the police for suspected drink driving) and you don't have it all you would have to do is turn up the next day with it and you'd be fine (or possibly fined for not having it). Oh yeah, same thing happens with insurance and driving leicence anyway", 
   {}, 
   131240, 
   null, 
   1117676460.0
  ], 
  [
   131775, 
   null, 
   "Hydra", 
   "£18 billion far better spent on more police...\n\n \n Oh, how true !", 
   {}, 
   131240, 
   null, 
   1117728780.0
  ], 
  [
   131777, 
   null, 
   "Eddie", 
   "Or just a really big sign that says \"Please don't commit crime\".\n\n \n Hmmm.. A bit unorthodox... But I like it! :p", 
   {}, 
   131505, 
   null, 
   1117728900.0
  ], 
  [
   131782, 
   null, 
   "Jo Bennett", 
   "Or just a really big sign that says \"Please don't commit crime\".\n \n Enough similar things in place at the moment anyway for where it will do anything, all I see it doing is costing money and opening the door for more extensive indentity theft. If you can get a passport and driving licience illegally then its not much different for a card unless we get truly into the realms of the excessive, yet still there are probably easier ways round things.\n \n I don't honestly see the massive civil liberty problems - get caught without an ID card (say pulled over by the police for suspected drink driving) and you don't have it all you would have to do is turn up the next day with it and you'd be fine (or possibly fined for not having it). Oh yeah, same thing happens with insurance and driving leicence anyway\n\n \n Difference is that the ID card will effectively be a licence to exist. I only need a driving licence if I want to drive (which I don't), I only need a passport if I want to travel abroad (which I haven't for some years). Also, you only need these documents WHILE you are doing the acitivity concerned. Currently I'm pretty difficult to keep track of, I don't own a mobile phone, I don't have any formal ID, and I see no reason why I should. In a free society the case has to be made to decrease freedom, not the other way round.", 
   {}, 
   131505, 
   null, 
   1117729320.0
  ], 
  [
   131828, 
   null, 
   "Wraith", 
   "I feel like Jo Bennet -- I don't own a credit card, I have a unregistered pay-as-you-go mobile phone, I don't drive, I think the only ID I have is my passport and I doubt I'll be updating that once it goes out of date.\n \n I really am oppposed to being forced to have a 'lisence to walk out one's door'.\n \n If I'm not commiting an offence it's none of the Police's business who I am, what I'm doing, and where I'm going.\n \n \n This above added with £18 billion being better spent on more police makes me completely opposed to ID cards.\n \n In fact I completely hate how Blair's trying IMHO to score political points making out he's 'bringing in measures' when really he's proposing to waste £18bn on what is basically a placebo.", 
   {}, 
   131782, 
   null, 
   1117734720.0
  ], 
  [
   132309, 
   null, 
   "Phunting", 
   "In fact I completely hate how Blair's trying IMHO to score political points making out he's 'bringing in measures' when really he's proposing to waste £18bn on what is basically a placebo.\nWell to quote Sir Humphry Appleby:\n \n Sir Humphrey: Bernard, what is the purpose of our defence policy?\n Bernard: To defend Britain.\n Sir Humphrey: No Bernard, it is to make the people think that Britain is defended.\n Bernard: The Russians?\n Sir Humphrey: Not the Russians, the British, the Russians know it's not.\n \n Little changes, just the name of the 'enemy'...", 
   {}, 
   131828, 
   null, 
   1117807020.0
  ], 
  [
   132312, 
   null, 
   "Jo Bennett", 
   "In any case, aren't we mainly defending ourselves against the French anyway? The foreign and commonwealth office has a tendency to think long term... the last century of France being an ally is a mere blip.", 
   {}, 
   132309, 
   null, 
   1117807980.0
  ], 
  [
   132313, 
   null, 
   "Big_Bear_Scot", 
   "Do you guys realise that Blair and his Cronies would probably force the ID cards bill through the House, he will probably say that a wee plastic ID card will stop terrorism and Organised Crime. \n \n Then they will use the fear of a terrorist attack to force the British public to carry an ID card. I would say that we will be carrying ID cards in the next five years.\n \n Now if it is the case that these ID cards go through, would you carry them about your person ?\n \n Would you produce them when asked ?\n \n Or are you planning to take a stand and not carry those cards ?", 
   {}, 
   132312, 
   null, 
   1117808580.0
  ], 
  [
   132319, 
   null, 
   "Tastyfish", 
   "I could see the use for them if they were basically there just as a form of ID for you to use if you don't have anything else - but I really don't think that to have them being compulsory to carry in any real way would be workable. You wouldn't have to carry them around with you, it would be the same as it is now - get stopped by the police and they record it, you have to show them ID and more (especially if you own a car). If not you have 48 hours to show them some the right documents or you get fined/arrested depending on what you were suspected of.\n \n Random ID check spot checks would be completely unworkable as people leave wallets in other trousers and suchlike enough as it is. You only need it if you were going to be stopped by them, in which case they would want ID as it is now anyway.\n \n Would you mind as much if other ID could be used as well? If it didn't have to be that one card then its hardly different from now. Still a massive waste of money but hardly the beginning of the end for todays society.\n \n I don't think it would be that easy to push it through using threat of terrorist attack here, seeing as we've had enough over the past few decades and the recent Islamic ones have been caught. Thats without going into mentions of Patriot Acts and the bad PR just being that paranoid causes now.", 
   {}, 
   132313, 
   null, 
   1117809480.0
  ], 
  [
   133129, 
   null, 
   "Jo Bennett", 
   "Do you guys realise that Blair and his Cronies would probably force the ID cards bill through the House, he will probably say that a wee plastic ID card will stop terrorism and Organised Crime. \n \n Then they will use the fear of a terrorist attack to force the British public to carry an ID card. I would say that we will be carrying ID cards in the next five years.\n \n Now if it is the case that these ID cards go through, would you carry them about your person ?\n \n Would you produce them when asked ?\n \n Or are you planning to take a stand and not carry those cards ?\n\n \n I'm inclined to say that I would refuse to carry one, but it remains to be seen what my attitude will be if faced with fines and/or imprisonment because of it.", 
   {}, 
   132313, 
   null, 
   1117997460.0
  ], 
  [
   133562, 
   null, 
   "Phunting", 
   "Do you guys realise that Blair and his Cronies would probably force the ID cards bill through the House, he will probably say that a wee plastic ID card will stop terrorism and Organised Crime. \n \n Then they will use the fear of a terrorist attack to force the British public to carry an ID card. I would say that we will be carrying ID cards in the next five years.\n \n Now if it is the case that these ID cards go through, would you carry them about your person ?\n \n Would you produce them when asked ?\n \n Or are you planning to take a stand and not carry those cards ?\nYes, yes and no.\n \n Despite my cynicism over the scheme, I have no real objections to it. I would quite gladly carry an ID card, and think on the whole they are a good idea.\n \n I don't think they really need to be, or should be, compulsory to carry. But I wouldn't really care if they were.", 
   {}, 
   132313, 
   null, 
   1118056740.0
  ], 
  [
   162346, 
   null, 
   "Carrie", 
   "what about id theft? i mean if your id card got stolen, you dont just have to think about a replacement can you 'cancel' the old one. i know your finger print details and stuff will be on it butif for example the police pulled me over and found dope on me, they probably wont be asking for my finger prints, just to see my id card. i could pull anyones out of my pocket, i could have stolen one earlier. and then you would probaly be able to get fake id cards soon anyway, so what would be the point?", 
   {}, 
   131102, 
   null, 
   1126823940.0
  ], 
  [
   162353, 
   null, 
   "Wez", 
   "what about id theft? i mean if your id card got stolen, you dont just have to think about a replacement can you 'cancel' the old one. i know your finger print details and stuff will be on it butif for example the police pulled me over and found dope on me, they probably wont be asking for my finger prints, just to see my id card. i could pull anyones out of my pocket, i could have stolen one earlier. and then you would probaly be able to get fake id cards soon anyway, so what would be the point?\n\n Presumably because they have your picture on it, so you need to replace the picture, which is damn hard to do to the point where the difference isn't noticable. Then you'd need to find someone of the right age and gender.\n \n -Wez", 
   {}, 
   162346, 
   null, 
   1126824360.0
  ], 
  [
   163084, 
   null, 
   "Carrie", 
   "Presumably because they have your picture on it, so you need to replace the picture, which is damn hard to do to the point where the difference isn't noticable. Then you'd need to find someone of the right age and gender.\n \n -Wez\n\n yer i thought of that after i posted it, opps. but you'd still have fakes which might cause problems. why do people want them any way?", 
   {}, 
   162353, 
   null, 
   1126991880.0
  ], 
  [
   163336, 
   null, 
   "Tastyfish", 
   "Later of course you could add a whole load of useful stuff onto it, so that rather than Sainsbury's, Nightclub, Petrol cards etc it all gets added onto the current one along with NHS files so ambulance workers and docters can get instant case history (unless you purposely chose not to have it added by going private or suchlike). As a precaution its not hard to imagine ID insurance (maybe compulasory like car insurance) so ID theft amounts to little more than someone from eastern europe gaining entry to the UK for a bit, but with not problems for you - much in the same way as credit card fraud. However ID cards are going to be a lot more personal - an email (to your official government address, if they don't mind giving us a physical one based on where we live seems odd that they can't give us an official electronic one based on who we are) informing us of what was done is hardly too much - whilst the odd video rental one a weekend might go unnoticed, a visa to Kiribati might raise a few eyebrows", 
   {}, 
   163084, 
   null, 
   1127057160.0
  ], 
  [
   198232, 
   null, 
   "OccamsRazor", 
   "Well, the Government won the vote in the commons this evening with a cyncial compromise on the issue of ID cards not being complusory. So now we have a \"voluntary\" ID card scheme until 2008 when you will have to get one if you make passport application. I'm very unimpressed and feel sorry for the 20 Labour MP's who had the guts to rebel but will be judged against the complicity of their fellow party members when the next election comes round.", 
   {}, 
   163336, 
   null, 
   1139882880.0
  ], 
  [
   198270, 
   null, 
   "Jo Bennett", 
   "Looks like before the end of 2007 I'm gonig to need to think about whether I need a passport in the subsequent ten years, they can naff off if they think I'm going to get an ID card.", 
   {}, 
   198232, 
   null, 
   1139918460.0
  ], 
  [
   198345, 
   null, 
   "Wez", 
   "This seems like such a waste of money to me. It's sad.:(\n \n -Wez", 
   {}, 
   198270, 
   null, 
   1139957100.0
  ], 
  [
   199691, 
   null, 
   "Yodhrin", 
   "I absolutely agree with the anti-ID card sentiments.\n \n My business is my own, unless I am comitting a crime the Police have no right to know who I am or what Im doing. If they do suspect me of comitting a crime there already exist adequate, totally voluntary, methods of verifying my identity.\n \n The passing of the ID Cards bill will lead, in effect, to making ID cards manditory by the \"back door\" as it were. By 2010, if Labour are still in power, they will have passed laws requiring ID cards to be produced for any and all common, everyday tasks, to the point where other methods of verifying identification are rendered obsolete.\n \n I have a debit card, my student ID and my birth certificate, and that is all I will ever have. If any attempt is made to make ID cards manditory, overtly or otherwise, I will refuse to carry one, even if that leads to a criminal prosecution, because if people dont take a stand on such issues, we may as well just start calling ourselves a Dictatorship today and be done with it.", 
   {}, 
   198345, 
   null, 
   1140619740.0
  ], 
  [
   201731, 
   null, 
   "peteratwar", 
   "Question would you trust this or any future government not to misuse any identity card ?\n \n It would not have stopped any of the terrorist attacks.\n \n It won\\'t stop Identity theft.\n \n It will increase crime as the ID cards become targeted by criminals\n \n It is hugely expensive.\n \n It will add enormously to the bureaucracy.\n \n The mismatch rate is quite high on current testing.\n \n Any system can be forged. Criminals are not stupid many of them are brilliant.\n \n The Government have provided no sensible justification for them. None of their arguments hold water.\n \n Money could be much better spent elsewhere where there is so little benefit", 
   {}, 
   199691, 
   null, 
   1141834260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  UK ID cards", 
  "url": "http://www.4forums.com/political/crime-debates/5441-uk-id-cards.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 5441, 
  "discussion_files": [
   [
    "26087.html", 
    "http://www.4forums.com/political/crime-debates/5441-uk-id-cards-print.html"
   ], 
   [
    "26088.html", 
    "http://www.4forums.com/political/crime-debates/5441-uk-id-cards-3-print.html"
   ], 
   [
    "26089.html", 
    "http://www.4forums.com/political/crime-debates/5441-uk-id-cards-2-print.html"
   ]
  ], 
  "identifier": 5441
 }
]