[
 [
  [
   130295, 
   null, 
   "Missouri Mule", 
   "I thought this was an interesting tidbit. Long overdue. \"My\" always struck me as kind of silly. I can hardly wait for the next version of windows (not.)\n ============================\n \n Microsoft Notebook: The end of 'my' is nigh\n \n The Seattle Post-Intelligencer, by Todd Bishop \n \n \n Those folders on your Windows desktop will still be yours--but in the future you'll need to figure that out on your own. Ending a longstanding tradition, Microsoft Corp. plans to stop using the word \"my\" as the default prefix for such folders as \"My Documents,\" \"My Music,\" \"My Pictures\" and others along those lines...\n \n (Snip)\n \n Another change in the upcoming Windows version, code-named Longhorn, could render even the newly named default folders moot for some users. A new Windows search feature will let people create custom \"virtual folders\" that continuously gather files and organize them automatically based on keyword, file type and other characteristics...\n \n (Snip)\n \n Microsoft Notebook: The end of 'my' is nigh", 
   {
    "post_info": {
     "post_title": "Microsoft Notebook: The end of 'my' is nigh"
    }
   }, 
   null, 
   null, 
   1117470300.0
  ], 
  [
   130600, 
   null, 
   "JordanF", 
   "That's interesting. Microsoft does think everything is their's (use their licensing XXXX as an example -- once I buy the software binaries, it's mine, not their's).\n Switch to BSD or Linux (maybe even Mac) and you'll be fine. :)", 
   {}, 
   130295, 
   null, 
   1117515960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Microsoft Notebook: The end of 'my' is nigh", 
  "url": "http://www.4forums.com/political/computers/5461-microsoft-notebook-end-my-nigh.html", 
  "breadcrumbs": [
   "Computers"
  ], 
  "id_number": 5461, 
  "discussion_files": [
   [
    "1741.html", 
    "http://www.4forums.com/political/computers/5461-microsoft-notebook-end-my-nigh-print.html"
   ]
  ], 
  "identifier": 5461
 }
]