[
 [
  [
   131445, 
   null, 
   "gnojek", 
   "I was wondering why the Republicans \"proposed\" a constitutional ammendment essentially banning gay marriage, or at least \"defining\" the term marriage, but there are scores of other things in this world that they are opposed to and they did not propose constitutional ammendments to ban them.\n \n Why wasn't there talk about an ammendment to ban emryonic stem cell research? \n The only thing that was done was to make it a little harder to do by blocking federal funding.\n But if Bush and the Republicans were really opposed to it, wouldn't they propose an ammendment to ban it?\n \n Or take abortion. Why was there no push for an ammendment to define \"human life\" or to at least ban abortions?\n \n Why did gay marriage get this special treatment?\n \n My opinion is that Republicans are not really so opposed to these things.\n \n I'm honestly curious about the reasons.\n Can anyone explain it to me?", 
   {
    "post_info": {
     "post_title": "Why no ammendment?"
    }
   }, 
   null, 
   null, 
   1117671240.0
  ], 
  [
   132142, 
   null, 
   "gnojek", 
   "Ok Republicans, are you chicken or ignorant of your own party?", 
   {}, 
   131445, 
   null, 
   1117764960.0
  ], 
  [
   132163, 
   null, 
   "Kronus", 
   "Politics, pure and simple. Most people aren't opposed to stem cell research. Most people aren't opposed, or at least aren't violently opposed, to abortion. No matter how strongly the neo-cons felt about these issues they weren't going to stick their necks out trying to fight them, because they knew they'd lose the support of their constituents. They figured they had a winner with the gay marriage thing, until it turned out that while alot of people don't like gay marriage, they also don't want an amendment banning it. You may have noticed them backing away from the idea now that the polls show that it isn't popular. Liberals stick their necks out for ideals, sometimes to their detriment. Conservatives are, well, more conservative, and only fight the fights they'll win.", 
   {}, 
   132142, 
   null, 
   1117769160.0
  ], 
  [
   132230, 
   null, 
   "Voice Of Reason", 
   "Why did gay marriage get this special treatment?\n \n \n Because activist judges in Mass made law instead of interpreting it and rammed it down the throats of the people and you can pretty much thank them for getting President Bush reelected...........", 
   {}, 
   132163, 
   null, 
   1117777620.0
  ], 
  [
   132232, 
   null, 
   "Duo_Maxwell", 
   "Simple answer: Bush is a flip flopper. As I recall, there are a few republicans in Congress who still push it, but the bill for the ammendement is basically dead. \n \n As Kronus said, there isn't much support for the ammendenment. The GOP got the public fired up about the alleged horrors of gay marriage but when asked if they would support a ammendement support dropped drastically. Apparently the public is skitterish about changing the consitution, and who can blame them? The last time a ammendement was passed that restricted rights, we had the prohibition fiasco. No one wants to see anything like that occur again in this country. \n \n The Gop will use things for their own gain until it becomes a major liability. We are seeing this with Delay as moderate republicans are distancing themselves from him. No one who's worried about reelection wants to be connected to a senator who's been criticized harshly by the highest board of ethics in this country three times in less then 6 months.", 
   {}, 
   132230, 
   null, 
   1117778040.0
  ], 
  [
   132258, 
   null, 
   "Redratio1", 
   "Its called a wedge issue. It was used to generate votes for Republicans by forcing it on the ballot in many states and giving it national attention in the media. \n \n You notice the full assault on gay rights has cooled down after the elections. No more handouts slapped onto cars in church parking lots with \"liberal = gay\" messages Carl Rove loves so much.\n \n Merely a wedge issue.", 
   {}, 
   132232, 
   null, 
   1117779600.0
  ], 
  [
   134140, 
   null, 
   "gnojek", 
   "Because activist judges in Mass made law instead of interpreting it and rammed it down the throats of the people .\n\n Even if this is the case, why would Bush and co. choose a nearly impossbile task to combat them? Ammending the constitution is more than difficult.\n \n They know this. They never really wanted an ammendment.\n \n And if we are going to apply the same logic, activist judges rammed legal abortions down our throats, where's the push for a constitutional ammendment?\n \n They must really not be against that one at all.", 
   {}, 
   132230, 
   null, 
   1118169060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why no ammendment?", 
  "url": "http://www.4forums.com/political/politics-debates/5489-why-no-ammendment.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 5489, 
  "discussion_files": [
   [
    "10658.html", 
    "http://www.4forums.com/political/politics-debates/5489-why-no-ammendment-print.html"
   ]
  ], 
  "identifier": 5489
 }
]