[
 [
  [
   131649, 
   null, 
   "Voice Of Reason", 
   "Wouldn't this just torques the jaws of Liberals? Eight more years of the Bush family..........I wonder if all the Liberal would finally move to Canada like they promised over and over again..........\n \n \n http://www.cnn.com/2005/POLITICS/05/31/bush.plug/index.html\n \n (CNN) -- Florida Gov. Jeb Bush would be \"awfully good\" in the job of president, but the timing isn't right, his father and former President George H.W. Bush told CNN Tuesday.\n \n Asked if he would want Jeb to run, Bush said, \"Someday I would, yes.\"\n \n Bush, who was president from 1989-1993, appeared on CNN's \"Larry King Live\" with former first lady Barbara, from the family compound in Kennebunkport, Maine.\n \n Jeb Bush is in his second gubernatorial term, which ends in January 2007. His brother George ends his second presidential term in January 2009 and cannot run again.\n \n \"He'd be awfully good,\" the elder Bush said. \"This guy's smart, big and strong. Makes the decisions. And you know, not without controversy, but he's led that state.\"", 
   {
    "post_info": {
     "post_title": "Boy would this stick in the craws of Liberals...."
    }
   }, 
   null, 
   null, 
   1117692480.0
  ], 
  [
   131654, 
   null, 
   "Duo_Maxwell", 
   "considering jeb's position on a number of issues, you certainly wouldn't like him if you were informed. But then again, you're never informed.", 
   {}, 
   131649, 
   null, 
   1117692960.0
  ], 
  [
   133059, 
   null, 
   "Black Aces", 
   "Wouldn't this just torques the jaws of Liberals? Eight more years of the Bush family..........I wonder if all the Liberal would finally move to Canada like they promised over and over again..........\n \n \n http://www.cnn.com/2005/POLITICS/05/31/bush.plug/index.html\n \n (CNN) -- Florida Gov. Jeb Bush would be \"awfully good\" in the job of president, but the timing isn't right, his father and former President George H.W. Bush told CNN Tuesday.\n \n Asked if he would want Jeb to run, Bush said, \"Someday I would, yes.\"\n \n Bush, who was president from 1989-1993, appeared on CNN's \"Larry King Live\" with former first lady Barbara, from the family compound in Kennebunkport, Maine.\n \n Jeb Bush is in his second gubernatorial term, which ends in January 2007. His brother George ends his second presidential term in January 2009 and cannot run again.\n \n \"He'd be awfully good,\" the elder Bush said. \"This guy's smart, big and strong. Makes the decisions. And you know, not without controversy, but he's led that state.\"\n\n \n \n \n He'll never make to the Whitehouse. The only way he'll ever get there is when his brother or someone else invites him to come in.\n \n There's to much baggae with Jeb.\n \n \n The Broward S&L going belly up is one example...\n \n He defaulted on that $4.56 million dollar loan from Broward Savings & loan. \n \n The property was originally appraised at over $4 million and then poof, after he defaults on his loan, it mysteriously gets re-appraised and now its only worth $500.000? \n He can't come up with the $4.56 million to pay the original loan but he is able to pay the $500,000. He can pay the $500,000, but not a penny more. But, he'll let the american taxpayer pay the other $4 million thats owed on the original loan. So, us kind hearted taxpayers paid $4million for Jeb so that he may keep this piece of property.\n First we are forced to pay the $4 million of the original loan, and secondly, when Jeb, the brilliant one, sells that piece of property for over $8 miilion, he gets to keep every single penny of the profits. He doesn't have to pay a penny of the $4 million back to the taxpayers. \n \n Hell, imagine if any of us tried to pull something like that off?\n \n \n Thats just 1 of quite a few reasons why Jeb wont make it to the Whitehouse.", 
   {}, 
   131649, 
   null, 
   1117965960.0
  ], 
  [
   133082, 
   null, 
   "Obvious Child", 
   "It's true. The chances of Jeb gettting to the White House are like the chances of a stupid ex-alchoholic who dodged active military service and was considered the stupid kid of the family getting in.", 
   {}, 
   133059, 
   null, 
   1117986900.0
  ], 
  [
   133084, 
   null, 
   "georged", 
   "Wouldn't this just torques the jaws of Liberals? Eight more years of the Bush family..........I wonder if all the Liberal would finally move to Canada like they promised over and over again..........\n \"\n\n \n No, but you could bank on the fact our remaining capital would leave for elsewhere. Fast.", 
   {}, 
   131649, 
   null, 
   1117987980.0
  ], 
  [
   133087, 
   null, 
   "lord tammerlain", 
   "Wouldn't this just torques the jaws of Liberals? Eight more years of the Bush family..........I wonder if all the Liberal would finally move to Canada like they promised over and over again..........\n \n \n \n\n \n \n I for one would like that very much. The liberals in the US are the economic future of the US, they are the creative types that create the movie scripts, the video games, the clothing designers ( except Tommy Hilfiger(sp) you can keep him).\n \n These are the people that are creating the new wealth in the US, the manufacturing industry is going to China, Korea. If you look at the Red/Blue States, the most creative, RD heavy states are the blue liberal states, California, Washington, Mass. If the liberals from those areas came to Canada, we would take a big lead in the creative industries that will provide a big boost to Canada economically", 
   {}, 
   131649, 
   null, 
   1117989060.0
  ], 
  [
   133093, 
   null, 
   "georged", 
   "I for one would like that very much. The liberals in the US are the economic future of the US, they are the creative types that create the movie scripts, the video games, the clothing designers ( except Tommy Hilfiger(sp) you can keep him).\n \n These are the people that are creating the new wealth in the US, the manufacturing industry is going to China, Korea. If you look at the Red/Blue States, the most creative, RD heavy states are the blue liberal states, California, Washington, Mass. If the liberals from those areas came to Canada, we would take a big lead in the creative industries that will provide a big boost to Canada economically\n\n \n Much of movie production has been put on location in Canada for decades. And Vancouver has a huge population of former Hong Kong Chinese noted for their software contributions. And clothing designs are already liberal in flavor (according to 'Real Americans') as they originate in Europe, hit the East Coast and move West. All Canada really needs to secure 90% of US creative types is to relocate Beverly Hills, Boston, Manhattan and Seattle to Vancouver. 'Real Americans' generally despise those cities and their citizens.", 
   {}, 
   133087, 
   null, 
   1117992180.0
  ], 
  [
   133186, 
   null, 
   "marc9000", 
   "I for one would like that very much. The liberals in the US are the economic future of the US, they are the creative types that create the movie scripts, the video games, the clothing designers ( except Tommy Hilfiger(sp) you can keep him).\n \n These are the people that are creating the new wealth in the US, the manufacturing industry is going to China, Korea. \n\n \n These are the people that drive the manufacturing industry out also, with environmental and safety regulations. \n \n On the original subject here though, as a Bush supporter, I'd still rather not see Jeb or any other Bush become president. It gives an impression of a dynasty - not what the U.S. is about.", 
   {}, 
   133087, 
   null, 
   1118001600.0
  ], 
  [
   133193, 
   null, 
   "gamehuis", 
   "On the original subject here though, as a Bush supporter, I'd still rather not see Jeb or any other Bush become president. It gives an impression of a dynasty - not what the U.S. is about.\n\n You already have that with the Kennedy's.", 
   {}, 
   133186, 
   null, 
   1118002620.0
  ], 
  [
   133204, 
   null, 
   "lord tammerlain", 
   "These are the people that drive the manufacturing industry out also, with environmental and safety regulations. \n \n On the original subject here though, as a Bush supporter, I'd still rather not see Jeb or any other Bush become president. It gives an impression of a dynasty - not what the U.S. is about.\n\n \n \n Safety regulations are much better then having people die on the job or lose a limb or be blinded. The exist for a good reason, and I fully support the vast majority of them ( having a family member die because of a lack of safety on the job might cause a person to feel that way) \n \n As for environmental regulations, take a swim in Lake Ontario, and eat some fish from it. Or perhaps live downwind from an oil refinery without any emmision controls. \n \n Admitedly some can go to far, and have to much red tape, but they exist for a reason, and without them North America would be a far worse place.", 
   {}, 
   133186, 
   null, 
   1118003940.0
  ], 
  [
   133249, 
   null, 
   "Redratio1", 
   "The right wing Christian conservative Baptists are going to pick a Catholic? I seriously doubt it. Larf!", 
   {}, 
   133204, 
   null, 
   1118008020.0
  ], 
  [
   133300, 
   null, 
   "marc9000", 
   "You already have that with the Kennedy's.\n\n \n I was talking about the presidency - that's where the attention is.", 
   {}, 
   133193, 
   null, 
   1118013240.0
  ], 
  [
   133310, 
   null, 
   "marc9000", 
   "Safety regulations are much better then having people die on the job or lose a limb or be blinded. The exist for a good reason, and I fully support the vast majority of them ( having a family member die because of a lack of safety on the job might cause a person to feel that way) \n\n \n If you had a family member die I'm genuinely sorry. But everything has a cost. Anyone who lost a family member in a car accident probably wishes the speed limit was only 5 mph. Their family member would still be alive, but our society couldn't function. If we continue to lose economic activity because of government regulation, our society will cease to function.\n \n \nAs for environmental regulations, take a swim in Lake Ontario, and eat some fish from it. Or perhaps live downwind from an oil refinery without any emmision controls. \n\n \n No thanks, with freedom comes responsibility. I have enough sense to not do those things.\n \n \nAdmitedly some can go to far, and have to much red tape, but they exist for a reason, and without them North America would be a far worse place.\n\n \n More and more, the reason is to scare people. Frightened people are amazingly easy to separate from their freedoms and money.", 
   {}, 
   133204, 
   null, 
   1118013720.0
  ], 
  [
   133315, 
   null, 
   "Duo_Maxwell", 
   "If you had a family member die I'm genuinely sorry. But everything has a cost. Anyone who lost a family member in a car accident probably wishes the speed limit was only 5 mph. Their family member would still be alive, but our society couldn't function. If we continue to lose economic activity because of government regulation, our society will cease to function.\n\n \n Yet if we don't have regulation, society will cease to function as well. \n \n \n\n No thanks, with freedom comes responsibility. I have enough sense to not do those things.\n\n \n Yet you do not hold the polluters responsible for their acts? Oddly you claim you have enough common sense, but you don't have enough common sense to dictate that those behaviors are wrong? Apparently a plant pouring toxic waste into drinking water is A-Ok to you. After all, it's your responsiblity not to drink it, but its not their responsibility for screwing it up in the first place. emoticon_rolleyes \n \n \n\n More and more, the reason is to scare people. Frightened people are amazingly easy to separate from their freedoms and money.\n\n \n LOL. Yes, the Bush campagin and adminstration is a perfect example of frightened people being seperated from their freedoms and money.", 
   {}, 
   133310, 
   null, 
   1118014620.0
  ], 
  [
   133647, 
   null, 
   "lord tammerlain", 
   "\n \n No thanks, with freedom comes responsibility. I have enough sense to not do those things.\n \n \n\n \n \n The comments about drinking Lake Ontario water was meant to show that industrial companies were not being responsible, they have poluted a common economic resource to the direct harm of many other people. Their freedom their fore needs to be restricted because of their lack of responsiblity.\n \n Imagine if Lake Ontario was your drinking water source, or you had a commercial/ sport fishery that operated on it. Your life and lively hood have been directly and negatively affected because of that polution.\n \n \n As for Safety, I have been through many different introductory safety classes for ( a good 30 different ) industrial sites in Alberta. Only one would I have called excessive in lenght and depth of instruction. Oddly enough it was the one that I almost fell to my death ( poor maintanence on safety quipement ). A safety record like the coal mines in China would not be cost effective in places like the US or Canada, ( Workers compenstation costs alone would bankrupt many mining companies)", 
   {}, 
   133310, 
   null, 
   1118079120.0
  ], 
  [
   133973, 
   null, 
   "marc9000", 
   "The comments about drinking Lake Ontario water was meant to show that industrial companies were not being responsible, they have poluted a common economic resource to the direct harm of many other people. Their freedom their fore needs to be restricted because of their lack of responsiblity. \n\n \n The question is, who made the decision that their freedom needs to be restricted, someone concerned with Canada's economy, or someone concerned with their own funding? \n \n \nImagine if Lake Ontario was your drinking water source, or you had a commercial/ sport fishery that operated on it. Your life and lively hood have been directly and negatively affected because of that polution. \n\n \n MY life and livelyhood, yes. If an important enough industry is shut down, CANADA'S life and livelyhood has been directly and negatively affected. You don't need our liberals as bad as you may think. :) \n \n \n \n \nAs for Safety, I have been through many different introductory safety classes for ( a good 30 different ) industrial sites in Alberta. Only one would I have called excessive in lenght and depth of instruction. Oddly enough it was the one that I almost fell to my death ( poor maintanence on safety quipement ). A safety record like the coal mines in China would not be cost effective in places like the US or Canada, ( Workers compenstation costs alone would bankrupt many mining companies)\n\n \n As with pollution, costs and benefits concerning safety must be weighed. The old saying \"if one life is saved, it will be worth it\", is the mindset you'll get if you get our blue state liberals. It's not going to help your economy.", 
   {}, 
   133647, 
   null, 
   1118112540.0
  ], 
  [
   133980, 
   null, 
   "lord tammerlain", 
   "The question is, who made the decision that their freedom needs to be restricted, someone concerned with Canada's economy, or someone concerned with their own funding? \n \n MY life and livelyhood, yes. If an important enough industry is shut down, CANADA'S life and livelyhood has been directly and negatively affected. You don't need our liberals as bad as you may think. :) \n \n As with pollution, costs and benefits concerning safety must be weighed. The old saying \"if one life is saved, it will be worth it\", is the mindset you'll get if you get our blue state liberals. It's not going to help your economy.\n\n \n With the environment, it generally costs alot more to clean up then to prevent the mess in the first place. The EPA superfund sites are ample evidence of that. Environmental problems can have extremely widespread effects, like for instance the high level of disease in India and Bangledesh due to high arsenic levels in their drinking water. While not caused by man made polution it provides a good example of what could occur to the South west if some XXXXX dumped toxic waste down a well to save on disposal costs.\n \n As for safety, other then the NSTB ( the one regulating automobiles) I cant comment about US safety regulations. I can for Alberta, and I would say that in most cases, the cost/benifit analysis is very well done. Common sense safety is and should be a requirement. Safety harness's, air monitoring for toxic gases, proper training, are all needed. Making contingency plans for a meteor strike is not.", 
   {}, 
   133973, 
   null, 
   1118113620.0
  ], 
  [
   133993, 
   null, 
   "marc9000", 
   "With the environment, it generally costs alot more to clean up then to prevent the mess in the first place. \n\n \n I agree, but only because special interest environmentalists are defining the \"clean up\". It includes their funding.\n \n \nThe EPA superfund sites are ample evidence of that. Environmental problems can have extremely widespread effects, like for instance the high level of disease in India and Bangledesh due to high arsenic levels in their drinking water. While not caused by man made polution it provides a good example of what could occur to the South west if some XXXXX dumped toxic waste down a well to save on disposal costs. \n\n \n Again, disposal costs are defined by those who must include their own funding. It's not the XXXXX's fault that disposal costs are multiple times higher than they need to be. Self serving government agencies, corrupt politicians, as well as private environmental companies that must meet a host of government regulations all need their slice of the pie.\n \n \nAs for safety, other then the NSTB ( the one regulating automobiles) I cant comment about US safety regulations. I can for Alberta, and I would say that in most cases, the cost/benifit analysis is very well done. Common sense safety is and should be a requirement. Safety harness's, air monitoring for toxic gases, proper training, are all needed. Making contingency plans for a meteor strike is not.\n\n \n Many safety regulations are good things, but that doesn't stop the cold, hard fact that every unused safety devise COST somebody something. The U.S. has many more unused, government mandated safety devices than it did 50 years ago. Thanks mainly to our blue-state liberals. It doesn't help our economy.", 
   {}, 
   133980, 
   null, 
   1118118060.0
  ], 
  [
   133997, 
   null, 
   "Duo_Maxwell", 
   "I agree, but only because special interest environmentalists are defining the \"clean up\". It includes their funding.\n\n \n Wow you are ignorant. special interest? Like the sierra club who recieves no funding from such clean ups? Oh yes, you're wrong (hint that is going to be a pattern).\n \n \n\n Again, disposal costs are defined by those who must include their own funding. It's not the XXXXX's fault that disposal costs are multiple times higher than they need to be.\n\n \n What do you mean higher? Disposal costs are far lower then clean up costs. Which is more practical, spending $10 to dispose it properly or $100 to clean it up? Even you can do basic cost analysis. \n \n \nSelf serving government agencies, corrupt politicians, as well as private environmental companies that must meet a host of government regulations all need their slice of the pie.\n\n \n heaven forbid we have clean water, pollution free air, acid free rain, etc, etc etc. But then again, some people like to live their lives without cancer. Apparently you welcome it. \n \n \n\n Many safety regulations are good things, but that doesn't stop the cold, hard fact that every unused safety devise COST somebody something. The U.S. has many more unused, government mandated safety devices than it did 50 years ago.\n\n \n Yet ODDLY life spans have gone up! Child and infant morality is down, deaths in child births are down, disease and viruses surivial rates are at all time highs , do you think there could be a cause? emoticon_rolleyes \n \n \nThanks mainly to our blue-state liberals. It doesn't help our economy.\n\n \n And economics is beyond you as well. Who pays for those safety features? Consumers, who builds those safety features? Companies. How do they do that? Hiring people.", 
   {}, 
   133993, 
   null, 
   1118119440.0
  ], 
  [
   134033, 
   null, 
   "lord tammerlain", 
   "\n \n Many safety regulations are good things, but that doesn't stop the cold, hard fact that every unused safety devise COST somebody something. The U.S. has many more unused, government mandated safety devices than it did 50 years ago. Thanks mainly to our blue-state liberals. It doesn't help our economy.\n\n \n \n At the industrial sites I have been at very few safety devices are not used, or important for the safe operation of the plant. Having a fire crew at a billion dollar facility makes economic sense from an insurance standpoint. Providing SCBA for hazardous environments within the plant, helps prevent respiratory illness's and possible death due to a leak of toxic gas like H2S.\n \n I cant see Canada's safety regulations at most industrial plants being much weaker if at all then those in the US. For the most part the money spent on safety at those plants is money well spent. It helps keep insurance costs down, Workers comp bills down, fewer days off due to injury.", 
   {}, 
   133993, 
   null, 
   1118129880.0
  ], 
  [
   134050, 
   null, 
   "marc9000", 
   "Wow you are ignorant. special interest? Like the sierra club who recieves no funding from such clean ups? Oh yes, you're wrong (hint that is going to be a pattern). \n\n \n Go away, Bevis!! :xcensored Real men are debating here!!", 
   {}, 
   133997, 
   null, 
   1118147280.0
  ], 
  [
   134051, 
   null, 
   "marc9000", 
   "At the industrial sites I have been at very few safety devices are not used, or important for the safe operation of the plant. Having a fire crew at a billion dollar facility makes economic sense from an insurance standpoint. Providing SCBA for hazardous environments within the plant, helps prevent respiratory illness's and possible death due to a leak of toxic gas like H2S.\n \n I cant see Canada's safety regulations at most industrial plants being much weaker if at all then those in the US. For the most part the money spent on safety at those plants is money well spent. It helps keep insurance costs down, Workers comp bills down, fewer days off due to injury.\n\n \n But I believe that in both the U.S. and Canada, for every one good environmental law, there are several wasteful environmental laws (brought on by liberalism) that hurt the economy far more than those same liberals movie scripts, video games, and clothing design.", 
   {}, 
   134033, 
   null, 
   1118147520.0
  ], 
  [
   134056, 
   null, 
   "Platypus", 
   "As with pollution, costs and benefits concerning safety must be weighed. The old saying \"if one life is saved, it will be worth it\", is the mindset you'll get if you get our blue state liberals. It's not going to help your economy.\n\n Don't like that justification? Then how about \"capitalism relies on people paying the true cost of their actions\"? Polluters shift their costs onto others, causing a misallocation of resources that only a plutocrat could love and any true capitalist would hate.", 
   {}, 
   133973, 
   null, 
   1118152380.0
  ], 
  [
   134079, 
   null, 
   "Waxy", 
   "More and more, the reason is to scare people. Frightened people are amazingly easy to separate from their freedoms and money.\n\n \n You can cut the irony in that statement with a knife.\n \n Waxy", 
   {}, 
   133310, 
   null, 
   1118159820.0
  ], 
  [
   134081, 
   null, 
   "Waxy", 
   "But I believe that in both the U.S. and Canada, for every one good environmental law, there are several wasteful environmental laws (brought on by liberalism) that hurt the economy far more than those same liberals movie scripts, video games, and clothing design.\n\n \n Examples?\n \n I work in the oil and gas business, one of, if not the, most heavily regulated industry there is. I can honestly say that I support the environmental regulations 100%, they can be a pain in the butt, and they can be expensive, but compared to the days when the regulations didn't exist, they're worth every penny. I also can't think of any regulations off the top of my head that I would consider to be redundant or excessive. I've come across some pretty goofy environmental technicalities, but none that have an actual impact on our operations or the economy.\n \n I completely disagree with your assertion that safety and environment need to be, or worse yet, should be, compromised in favour of the $$$$.\n \n It's short sighted, and self destructive.\n \n Waxy", 
   {}, 
   134051, 
   null, 
   1118160180.0
  ], 
  [
   134429, 
   null, 
   "marc9000", 
   "Examples? \n\n \n http://4forums.com/political/showthread.php?t=3399\n \n http://4forums.com/political/showthread.php?t=2900\n \n Here's some more interesting reading on the subject.\n \n http://www.townhall.com/columnists/thomassowell/ts20010524.shtml\n \n http://www.townhall.com/columnists/walterwilliams/ww20030618.shtml\n \n \n \n \nI work in the oil and gas business, one of, if not the, most heavily regulated industry there is. I can honestly say that I support the environmental regulations 100%, they can be a pain in the butt, and they can be expensive, but compared to the days when the regulations didn't exist, they're worth every penny. I also can't think of any regulations off the top of my head that I would consider to be redundant or excessive. I've come across some pretty goofy environmental technicalities, but none that have an actual impact on our operations or the economy. \n\n \n I take it you're just talking about the oil and gas business, when you say you can't think of any regulations that you would consider to be redundant or exessive. Are you not considering your life in general? My first link above concerned what I do for a living, but I see a lot of excessivness in things like auto emissions testing, and environmental laws imposed not on large business, but on very small businesses and individuals.\n \n \nI completely disagree with your assertion that safety and environment need to be, or worse yet, should be, compromised in favour of the $$$$.\n \n It's short sighted, and self destructive.\n \n Waxy\n\n \n Compromised according to whom? That's the million dollar question. \n \n A Thomas Sowell quote;\n \n People who are very aware that they have more knowledge than the average person are often very unaware that they do not have one tenth of the knowledge of all the average persons put together. In this situation, for the intelligentsia to impose their notions on ordinary people is to impose ignorance on knowledge. \n\n \n Nowhere does this apply more than with today's environmentalism.", 
   {}, 
   134081, 
   null, 
   1118196360.0
  ], 
  [
   134430, 
   null, 
   "marc9000", 
   "You can cut the irony in that statement with a knife.\n \n Waxy\n\n \n You may be lumping domestic policy and foriegn policy together. I don't, because the U.S. constitution doesn't.", 
   {}, 
   134079, 
   null, 
   1118196720.0
  ], 
  [
   134645, 
   null, 
   "lord tammerlain", 
   "http://4forums.com/political/showthread.php?t=3399\n \n http://4forums.com/political/showthread.php?t=2900\n \n Here's some more interesting reading on the subject.\n \n http://www.townhall.com/columnists/thomassowell/ts20010524.shtml\n \n http://www.townhall.com/columnists/walterwilliams/ww20030618.shtml\n \n \n \n \n \n I take it you're just talking about the oil and gas business, when you say you can't think of any regulations that you would consider to be redundant or exessive. Are you not considering your life in general? My first link above concerned what I do for a living, but I see a lot of excessivness in things like auto emissions testing, and environmental laws imposed not on large business, but on very small businesses and individuals.\n \n \n \n Compromised according to whom? That's the million dollar question. \n \n A Thomas Sowell quote;\n \n \n Nowhere does this apply more than with today's environmentalism.\n\n \n Alberta is a very non governmental interference style of province. We do not have auto emission testing, and for small business's not being allowed to dump chemical waste in the garbage ( not that it isnt done) or sewer system their are very few environment regulations on normal business operations for small business. New real estate developments in environmentally sensitive areas do have quite a few hurdles but usually go through.\n \n For individuals in Alberta, environmental laws do not matter except the following examples. The dumping of paint, motor oil etc down the sewer or to the garbage dump ( many cities or towns have disposal areas at the local fire dept). Dumping of your garbage anywhere. For Calgary washing your car in the driveway and allowing the runoff to enter the sewer sytem that empties into the river.\n \n As for rural communties I can not recall if the burning of garbage has been banned or not, 20 years ago you were allowed to.", 
   {}, 
   134429, 
   null, 
   1118256600.0
  ], 
  [
   135316, 
   null, 
   "marc9000", 
   "Alberta is a very non governmental interference style of province. We do not have auto emission testing, and for small business's not being allowed to dump chemical waste in the garbage ( not that it isnt done) or sewer system their are very few environment regulations on normal business operations for small business. New real estate developments in environmentally sensitive areas do have quite a few hurdles but usually go through.\n \n For individuals in Alberta, environmental laws do not matter except the following examples. The dumping of paint, motor oil etc down the sewer or to the garbage dump ( many cities or towns have disposal areas at the local fire dept). Dumping of your garbage anywhere. For Calgary washing your car in the driveway and allowing the runoff to enter the sewer sytem that empties into the river.\n \n As for rural communties I can not recall if the burning of garbage has been banned or not, 20 years ago you were allowed to.\n\n \n \n From what you're describing the U.S. and Canada do some similar things concerning environmentalism. I never really gave any thought to Canada and auto emission testing - I'm not surprised that you don't have it. Auto emissons supposedly aren't much of a problem in cooler temperatures. This testing is sporadic throughout the U.S. It comes & goes (comes more than it goes). Certain parts of Ky. have just eliminated it believe it or not, not the northern part where I live however. There's never any clear proof that it does any good. It's always controversial.\n \n Have you noticed an increase in recent years in how much road de-icing chemicals are used in Canada? How about fuel spills like the one in my link above - does Canada \"clean up\" fuel spills in a similar way? Have you heard anything about underground gasoline storage at fuel stations in Canada? Over the past decade the U.S. EPA has demanded closure / upgrading of fuel stations all across the country, at GREAT expense. If you haven't done that yet, there may be some U.S. liberal who would love to create that for you! :) Not good for an economy though.", 
   {}, 
   134645, 
   null, 
   1118371320.0
  ], 
  [
   135366, 
   null, 
   "lord tammerlain", 
   "\n Have you noticed an increase in recent years in how much road de-icing chemicals are used in Canada? How about fuel spills like the one in my link above - does Canada \"clean up\" fuel spills in a similar way? Have you heard anything about underground gasoline storage at fuel stations in Canada? Over the past decade the U.S. EPA has demanded closure / upgrading of fuel stations all across the country, at GREAT expense. If you haven't done that yet, there may be some U.S. liberal who would love to create that for you! :) Not good for an economy though.\n\n \n For road de icing Calgary started using salt or the equivalent again after a period of years that we didnt, we were using just gravel. Fuel spills depending on the size and location the clean up is different. If the spill is large ( not sure of the size) it is going to be cleaned or if it will affect the river system/drinking water.\n \n Many of the older gas stations in Calgary have been replacing their underground tanks, I believe because many of them were corroding and had an increased chance of leaking. I dont believe that they were replaced or upgraded just because. For those in the States were they replaced because of new standards or because of a reasonable chance of leaking?", 
   {}, 
   135316, 
   null, 
   1118380440.0
  ], 
  [
   136443, 
   null, 
   "Duo_Maxwell", 
   "Go away, Bevis!! :xcensored Real men are debating here!!\n\n \n Oh yes, real men like you who make claims yet never back them up? Or how about real men like you who lie through their teeth? Or how about real men like you who apply double standards everywhere? \n \n Really, pathetic.", 
   {}, 
   134050, 
   null, 
   1118633880.0
  ], 
  [
   136478, 
   null, 
   "Nurglitch", 
   "Oh yes, real men like you who make claims yet never back them up? Or how about real men like you who lie through their teeth? Or how about real men like you who apply double standards everywhere?\n Good point, how about putting your money where your mouth is and leading by example?", 
   {}, 
   136443, 
   null, 
   1118644260.0
  ], 
  [
   136511, 
   null, 
   "kickin50", 
   "As for environmental regulations, take a swim in Lake Ontario, and eat some fish from it. Or perhaps live downwind from an oil refinery without any emmision controls. \n\n \n \nNo thanks, with freedom comes responsibility. I have enough sense to not do those things.\n\n \n \nThe comments about drinking Lake Ontario water was meant to show that industrial companies were not being responsible, they have poluted a common economic resource to the direct harm of many other people. Their freedom their fore needs to be restricted because of their lack of responsiblity.\n \n Imagine if Lake Ontario was your drinking water source, or you had a commercial/ sport fishery that operated on it. Your life and lively hood have been directly and negatively affected because of that polution.\n \n\n \n http://www.epa.gov/glnpo/aoc/cuyahoga.html The first 2 paragraphs are enough to explain the outragous level of irresponsibility we're talking about here. Left to it's own judgment, this is what industry does.\n \n The water flow: Cuyahoga River to Lake Erie, over Niagara Falls and into Lake Ontario. Water source for many millions of people -- not to mention 2 countries. That's not to say that the water was clean when it made it to Lake Erie. There are also 3 lakes upstream, Superior, Huron, and Michigan. Those lakes are polluted by and water sources for places like Chicago. Irresponsible industry has an impact on the Great Lakes all the way from Minnesota and Wisconsin to New York City.\n \n This would be the same massive water source that the rest of the water starved country is jealous of and would love to divert to the heartland for drinking water and irrigation. Irrigation? That would put it in a grocery store near you - no matter where you are. Truthfully, it already is. As for fish, you've all eaten it. So, just where is it that it's safe to live?", 
   {}, 
   133647, 
   null, 
   1118671380.0
  ], 
  [
   136554, 
   null, 
   "Waxy", 
   "http://4forums.com/political/showthread.php?t=3399\n \n http://4forums.com/political/showthread.php?t=2900\n \n Here's some more interesting reading on the subject.\n \n http://www.townhall.com/columnists/thomassowell/ts20010524.shtml\n \n http://www.townhall.com/columnists/walterwilliams/ww20030618.shtml\n\n \n OK, first off, you don't see a problem with diesel contamination of the soil and groundwater, but you're all torqued up about salt on the roads? emoticon_confused\n \n Anyhoo, link #1.\n \n It may comes as a shock to you, but I've worked directly in the contamination clean up business. In fact, I've worked on about 50 such clean up jobs, as the prime contractor. I've done everything from mapping the soil types and areal extent of the spill, to being the guy in the Bobcat or backhoe that gets lowered into the pit by a crane - working wearing a respirator in what is essentially a giant bomb waiting to to happen. So you can spare me the lecture on when you once hauled a load of dirt from a site, I'm not impressed.\n \n I've been there and done that, and IME, it was worth every penny to clean that mess up. Whether it just had a strong fuel smell, or the ground was actually liquified with fuels, that is NOT a good situation. For the contractors involved, the project is easily 10X as complex and costly to undertake, the price tag is going to be higher. In my case, the soil was hauled about 300 miles in specially designed end dumps to a contamination plant. The soil was first incinerated, and then land spread and worked repeatedly, both dirty and expensive jobs, but there really is no other alternative.\n \n My brother works for an environmental remediation contractor, they work almost exclusively for oil companies, cleaning up service station sites and oil batteries or tank sites. They've developed technology to drill wells and circulate the groundwater to remove contamination, and so far it's been fairly successful. They make peanuts, both as individuals and as a company, compared to oil industry jobs requiring the same type of training and expertise. You don't get rich on the environmental side in Alberta.\n \n I've got a cousin that worked for a summer with the government. Her job was to travel all over the province and measure contamination levels around service stations. Not surprising, all those tanks that were put in during the 50'sand 60' were leaking - badly. They knew it, and just kept filling them anyway. I'm not exaggerating when I tell you she had death threats from some of those service station owners when she informed them that they needed to abandon their tanks and install above ground tanks. It wasn't cheap for the owners, and it just might have put some of them out of business, but IMHO, when the alternative is dumping thousands of liters of fuel into the groundwater system, it's a small price to pay. There's a responsibility to do more than simply make money that comes with being a business owner. I know you'll disagree. \n \n The \"townhall\" links don't interest me in the least, Ann Coulter would likely enjoy them though.\n \n \nI take it you're just talking about the oil and gas business, when you say you can't think of any regulations that you would consider to be redundant or exessive. Are you not considering your life in general? My first link above concerned what I do for a living, but I see a lot of excessivness in things like auto emissions testing, and environmental laws imposed not on large business, but on very small businesses and individuals.\n\n \n What in my life is excessive?\n \n I'm a big snowmobiler, I'm really annoyed at the EPA regualtions regarding two stroke engines, but at the same time, the regulations have brought on not only cleaner 2 strokes, but 4 strokes that are better than ever. The EPA regulations that everyone predicted would be the end of the motorcycle industry have caused its greatest boom in 20 years.\n \n Auto emissions testing is a no brainer. How does that truly affect you? If your POS car is spewing out burnt oil and high emissions, it should be taken off the road. As long as the regulations are reasonable, what's wrong with them?\n \n As for big vs. small business, just because you don't see the application to big business doesn't mean it isn't happening, and in a lot of cases, to a higher degree.\n \n Waxy", 
   {}, 
   134429, 
   null, 
   1118681940.0
  ], 
  [
   136556, 
   null, 
   "Waxy", 
   "From what you're describing the U.S. and Canada do some similar things concerning environmentalism. I never really gave any thought to Canada and auto emission testing - I'm not surprised that you don't have it. Auto emissons supposedly aren't much of a problem in cooler temperatures. This testing is sporadic throughout the U.S. It comes & goes (comes more than it goes). Certain parts of Ky. have just eliminated it believe it or not, not the northern part where I live however. There's never any clear proof that it does any good. It's always controversial.\n\n \n Several provinces, including B.C. and Ontario I believe, have emissions testing and regulations. How can reducing the emissions of vehicles not be good?\n \n \nHave you noticed an increase in recent years in how much road de-icing chemicals are used in Canada? How about fuel spills like the one in my link above - does Canada \"clean up\" fuel spills in a similar way? Have you heard anything about underground gasoline storage at fuel stations in Canada? Over the past decade the U.S. EPA has demanded closure / upgrading of fuel stations all across the country, at GREAT expense. If you haven't done that yet, there may be some U.S. liberal who would love to create that for you! :) Not good for an economy though.\n\n \n See my post above.\n \n The rural economy is just fine, and, we don't have thousands of liters of fuel in the ground.\n \n Waxy", 
   {}, 
   135316, 
   null, 
   1118682240.0
  ], 
  [
   136865, 
   null, 
   "marc9000", 
   "OK, first off, you don't see a problem with diesel contamination of the soil and groundwater, but you're all torqued up about salt on the roads? emoticon_confused\n\n \n Yes for two reasons. \n 1. The ratio is thousands of liters of petroleum, vs. tens of millions of tons of salt.\n \n 2. Salt mixes with water, petroleum does not.\n \n \nAnyhoo, link #1.\n \n It may comes as a shock to you, but I've worked directly in the contamination clean up business. In fact, I've worked on about 50 such clean up jobs, as the prime contractor. I've done everything from mapping the soil types and areal extent of the spill, to being the guy in the Bobcat or backhoe that gets lowered into the pit by a crane - working wearing a respirator in what is essentially a giant bomb waiting to to happen. So you can spare me the lecture on when you once hauled a load of dirt from a site, I'm not impressed. \n\n \n I wasn't trying to impress you, it wasn't dangerous. It was actually pretty easy money, but it depresses me to make money while not doing anything useful. There's more to being a small business owner than just making money ya know. :p \n \n \nI've been there and done that, and IME, it was worth every penny to clean that mess up. Whether it just had a strong fuel smell, or the ground was actually liquified with fuels, that is NOT a good situation. \n\n \n Why not? Were there a lot of houses around, or was it miles from civilization? If there was a lot of human population, it may not have been a good situation, if the people decided it wasn't, and if they completely understood the \"cleanup\" cost, and who would pay it. Because even if it's a company or municipality that pays, they deserve to have it made clear to them how much their taxes / product costs are going up. The news articles in my two links above are very careful to omit that information. \n \n \n \n For the contractors involved, the project is easily 10X as complex and costly to undertake, the price tag is going to be higher. In my case, the soil was hauled about 300 miles in specially designed end dumps to a contamination plant. The soil was first incinerated, and then land spread and worked repeatedly, both dirty and expensive jobs, but there really is no other alternative.\n\n \n No other alternative according to whom? Those who make money doing the work, or those unsuspecting people who paid for it?\n \n \n \nMy brother works for an environmental remediation contractor, they work almost exclusively for oil companies, cleaning up service station sites and oil batteries or tank sites. They've developed technology to drill wells and circulate the groundwater to remove contamination, and so far it's been fairly successful. They make peanuts, both as individuals and as a company, compared to oil industry jobs requiring the same type of training and expertise. You don't get rich on the environmental side in Alberta. \n\n \n I'm sure they're doing the best they can. It's a business, and they seek to grow the same as any business. Their method of growing would be to seek more environmental regulation. \n \n \nI've got a cousin that worked for a summer with the government. Her job was to travel all over the province and measure contamination levels around service stations. Not surprising, all those tanks that were put in during the 50'sand 60' were leaking - badly. They knew it, and just kept filling them anyway. I'm not exaggerating when I tell you she had death threats from some of those service station owners when she informed them that they needed to abandon their tanks and install above ground tanks. It wasn't cheap for the owners, and it just might have put some of them out of business, but IMHO, when the alternative is dumping thousands of liters of fuel into the groundwater system, it's a small price to pay. There's a responsibility to do more than simply make money that comes with being a business owner. I know you'll disagree. \n\n \n In my second link, did you read post #5? That's the other side of the story, the one your cousin may have failed to tell you. A tank installed in the 50's or 60's, leaking badly, needs to be replaced. 15 year old tanks, not leaking, with 5 years left on their warranty's, DO NOT. How was your cousin paid, by the hour, or by the number of tanks she ordered replaced? What kind of time mandates did she have when she INFORMED them? \n \n From the news article in my second link;\n \n \n\"We don't have an environmental issue here with rock salt,\" she said. \n \n Even a staunch environmentalist like Glen Brand of the Cincinnati chapter of the Sierra Club finds it hard to compare environmental harm to the life-saving benefits of salted streets. \n \n \"The most important thing is to provide safe roads,\" he said. \"That comes before all else. \n\n \n Why is it that a \"staunch environmentalist\" tosses his passion right out the window when it comes to safety?? Have you ever heard an environmentalist say \"the most important thing is private property rights. That comes before all else.\" ??? WHY NOT? \n \n \n \nThe \"townhall\" links don't interest me in the least, Ann Coulter would likely enjoy them though. \n\n \n Well, they're both by economists, too bad you missed them. Warm & fuzzys about the environment can quickly take a back seat to an empty stomach.\n \n \n \nWhat in my life is excessive? \n\n \n I was asking about excessive regulations, in areas of your life other than your occupation.\n \n \nI'm a big snowmobiler, I'm really annoyed at the EPA regualtions regarding two stroke engines, but at the same time, the regulations have brought on not only cleaner 2 strokes, but 4 strokes that are better than ever. The EPA regulations that everyone predicted would be the end of the motorcycle industry have caused its greatest boom in 20 years. \n\n \n The regulations caused the boom? Or the boom happened in spite of the regulations?\n \n \nAuto emissions testing is a no brainer. How does that truly affect you? If your POS car is spewing out burnt oil and high emissions, it should be taken off the road. \n\n \n According to whom? An environmentalist who is paid to make that decision? If most cars are not spewing out high emissions, why should they have to pay so the government can make sure? \n \n \n As long as the regulations are reasonable, what's wrong with them? \n\n \n Nothing, as long as fully informed people deem them reasonable. They don't get the chance to decide where I live. It's unpopular here, but it doesn't stop millions of northern Ky. dollars from being whisked away to California every year. (the testing company's headquarters) \n \n \nAs for big vs. small business, just because you don't see the application to big business doesn't mean it isn't happening, and in a lot of cases, to a higher degree. \n \n Waxy\n\n \n And a lot of people don't see the COST.", 
   {}, 
   136554, 
   null, 
   1118719440.0
  ], 
  [
   136868, 
   null, 
   "marc9000", 
   "Several provinces, including B.C. and Ontario I believe, have emissions testing and regulations. How can reducing the emissions of vehicles not be good? \n\n \n When it causes an otherwise useful vehicle to not be used - when it destroys the liberty of the person who chooses to use it.\n \n \n \nSee my post above.\n \n The rural economy is just fine, and, we don't have thousands of liters of fuel in the ground.\n \n Waxy\n\n \n That's your opinion - someone down the road who's kid had to do without something so he could buy another car or have his \"fixed\" may not think so.", 
   {}, 
   136556, 
   null, 
   1118719800.0
  ], 
  [
   136920, 
   null, 
   "Duo_Maxwell", 
   "Good point, how about putting your money where your mouth is and leading by example?\n\n \n I'm waiting for him to respond to my first post. Of course the obvious course of action would be to stop waiting as he will not respond.", 
   {}, 
   136478, 
   null, 
   1118740560.0
  ], 
  [
   136964, 
   null, 
   "Waxy", 
   "Yes for two reasons. \n 1. The ratio is thousands of liters of petroleum, vs. tens of millions of tons of salt.\n \n 2. Salt mixes with water, petroleum does not.\n\n \n The ratio is irrelevent. It's a simple function of how toxic the pollutant is.\n \n I agree that all that road salt is bad for the environment, but your position is hypocritical, to say the least.\n \n \nWhy not? Were there a lot of houses around, or was it miles from civilization? If there was a lot of human population, it may not have been a good situation, if the people decided it wasn't, and if they completely understood the \"cleanup\" cost, and who would pay it. Because even if it's a company or municipality that pays, they deserve to have it made clear to them how much their taxes / product costs are going up. The news articles in my two links above are very careful to omit that information. \n \n \n In all cases, the stations were either in the city, or in small towns. \n \n The cleanup was somewhat subsidized by the county and provincial gov't, but in the end, why should the taxpayer pay to clean up someone else's mess? Remember personal liberty? It brings with it personal responsibility. If you've got leaking tanks in the ground, it's your own personal problem to fix them, no one else's. \n \n IME, the cost of the clean up was made very clear to the customers up front, it was really a pretty simple thing to estimate. The fact that it was left out of two articles you found on the internet is a veryy weak basis for your assumption that all environmental clean up work is done on the sly with an unlimited budget.\n \n \nNo other alternative according to whom? Those who make money doing the work, or those unsuspecting people who paid for it?\n\n \n Again, why are the people unsuspecting? That's a baseless assumption on your part. \n \n If the alternative is leave the hydrocarbons in the soil because you don't want to pay for the cleanup, TOUGH. I don't want the soil and my drinking water contaminated by your leaking tanks.\n \n Who's personal freedom trumps whoms?\n \n \nI'm sure they're doing the best they can. It's a business, and they seek to grow the same as any business. Their method of growing would be to seek more environmental regulation. \n \n \n Again, this is a ridiculous assertion. \n \n Their method for growing is to continue to do good work and continue to develop new technology.\n \n Trust me, there's no shortage of work out there as it is, there's no shortage of competition for that work either though.\n \n \nIn my second link, did you read post #5? That's the other side of the story, the one your cousin may have failed to tell you. A tank installed in the 50's or 60's, leaking badly, needs to be replaced. 15 year old tanks, not leaking, with 5 years left on their warranty's, DO NOT. How was your cousin paid, by the hour, or by the number of tanks she ordered replaced? What kind of time mandates did she have when she INFORMED them? \n \n \n I agree that tanks not leaking and within their rated lifespan should not be required to be replaced. I also agree that MTBE is one of the biggest screw ups of the environmental lobby.\n \n You're certainly a jaded fellow. :p \n \n It was a gov't job LOL, she was paid by the hour. She would do all she could pass people's tanks, she wasn't in the business of shutting people down, but if your tanks leak, your tanks leak, that's just the way it is. She didn't have anything to gain personally from it. In fact, that's a rather assinine assumption on your part. \n \n I don't recall the exact timeframe that station owners were given to replace the tanks, but IIRC, it was actually a substantial time period, somewhere in the neighborhood of 6 months to 1 year.\n \n Unfortunately, when they were \"informed\" (most knew damn well their tanks leaked) many people simply walked away from the station and the cost of clean up, leaving the gov't with the tab. There are still hundreds, if not thousands, of sites out there that will likely never be cleaned up, or at the least, will be waiting a long time to be cleaned up.\n \n \nWhy is it that a \"staunch environmentalist\" tosses his passion right out the window when it comes to safety?? Have you ever heard an environmentalist say \"the most important thing is private property rights. That comes before all else.\" ??? WHY NOT? \n \n \n Why is it that thousands of other environmentalists don't in the case of road salt?\n \n At any rate, safety is very important.\n \n \"Private property rights\", what about my right to drink clean water? Breathe clean air? \n \n Again, who's rights are more important?\n \n Private property rights are great, but they are not a license to do as you please regardless of the consequences your actions may have for others.\n \n \nWell, they're both by economists, too bad you missed them. Warm & fuzzys about the environment can quickly take a back seat to an empty stomach.\n\n \n I don't mind missing the ramblings of \"economists\" that write like spoiled, immature teenagers. \n \n \nI was asking about excessive regulations, in areas of your life other than your occupation.\n\n \n The only thing I can think of is the closing of some of my favourite areas to off highway vehicle use due to environmental concerns. It makes me mad, and I stand up to it where it's unwarranted, with a considerable amount of my own time and money invested. However, I understand it, and I even tend to agree with it to a certain extent. Unfortunately, it only takes a handful of XXXXXX to destroy an area that thousands of people use and enjoy without causing any damage.\n \n \nThe regulations caused the boom? Or the boom happened in spite of the regulations?\n\n \n The regulation caused the boom, plain and simple, by forcing the manufacturers to develop the 4 stroke. The inflow of cash and advanced technology into motorcycling created far better bikes and a whole new market for them. IMHO, no EPA, we'd all still be riding the same 2 stroke MX'ers that they've been building largely unchanged since the mid 80's.\n \n \nAccording to whom? An environmentalist who is paid to make that decision? If most cars are not spewing out high emissions, why should they have to pay so the government can make sure? \n \n \n Most people aren't criminals, why should I have to pay for a police force?\n \n Do you have insurance? Been in an accident?\n \n Do you pay school taxes? Have any children currently attending school?\n \n This argument is a non sequitor. \n \n \nNothing, as long as fully informed people deem them reasonable. They don't get the chance to decide where I live. It's unpopular here, but it doesn't stop millions of northern Ky. dollars from being whisked away to California every year. (the testing company's headquarters) \n \n \n So is it the testing, or the fact the company is based in California that actual bothers you?\n \n \nAnd a lot of people don't see the COST.\n\n \n I'd hate to see the cost of operating without environmental regulations, or regulations such as those that you would favour.\n \n For a quick example of the impact of unregulated or poorly regulated environmental controls, look up the oil fields of Oklahoma/California, or the Turner Valley area of southern Alberta, right up into the late 60's.\n \n Or, as suggested, go for a swim in Lake Ontario.\n \n Waxy", 
   {}, 
   136865, 
   null, 
   1118766900.0
  ], 
  [
   136965, 
   null, 
   "Waxy", 
   "When it causes an otherwise useful vehicle to not be used - when it destroys the liberty of the person who chooses to use it.\n\n \n That's your opinion of \"useful\". \n \n Again, what about the rights of everyone else to breathe clean air?\n \n What about my liberty?\n \n \nThat's your opinion - someone down the road who's kid had to do without something so he could buy another car or have his \"fixed\" may not think so.\n\n \n Tough. \n \n We all have to things we don't want to and make sacrifices for the greater good. That's just reality.\n \n Waxy", 
   {}, 
   136868, 
   null, 
   1118767140.0
  ], 
  [
   136974, 
   null, 
   "Obvious Child", 
   "as far as I can make out, marc9000 is against the protection of life in health and safety and the maintanence of general quality of life with the destruction of the enviroment because they are not worhtwhile if they slow economic growth. Why? I'd far rather be happy than rich anyday, and I am more likely to be happy because I live in a pleasant enviroment i can hand down to my children and because I know that people are protected from the most selfish drives of capitalist industry than because I can afford another huge gas-guzzling 4 by 4.\n \n Capatilism is very into protecting private property, but public property like the enviroment has no weight. If its everyone's problem then de facto its nobodies problem.", 
   {}, 
   136965, 
   null, 
   1118767680.0
  ], 
  [
   136981, 
   null, 
   "Symbiote", 
   "what about my right to drink clean water? Breathe clean air?\n\n \n What about my right to eat a 20 kilogram steak, and date Jennifer Lopez? Bring them to me at once - or you are violating my liberty!\n \n \nCapatilism is very into protecting private property, but public property like the enviroment has no weight.\n\n \n I agree, public property should be abolished.", 
   {}, 
   136974, 
   null, 
   1118768400.0
  ], 
  [
   136986, 
   null, 
   "Waxy", 
   "What about my right to eat a 20 kilogram steak, and date Jennifer Lopez? Bring them to me at once - or you are violating my liberty!\n \n\n \n Careful what you wish for. ;) :p\n \n Waxy", 
   {}, 
   136981, 
   null, 
   1118769000.0
  ], 
  [
   137100, 
   null, 
   "lord tammerlain", 
   "What about my right to eat a 20 kilogram steak, and date Jennifer Lopez? Bring them to me at once - or you are violating my liberty!\n \n \n \n I agree, public property should be abolished.\n\n \n \n You can try to eat a 20 Kilogram steak any time you want, just find a butcher to cut you one. I would actually pay to see you eat one in a single sitting.\n \n Now for you to date J Lo, she also has the right to say no.", 
   {}, 
   136981, 
   null, 
   1118778840.0
  ], 
  [
   137113, 
   null, 
   "lord tammerlain", 
   "Now to the real issue.\n \n In fact oil and gas does mix to a very small degree in water, and of course can and does contaminate ground water and other drinking water sources. If I am not mistake less then 10 mg/L of oil or gas contamination in water makes it unpalatable for human consumption.\n \n A heavily poluting car is not a problem, 1 million heavily poluting autos is. Monitoring auto emmisions in Montana doesnt make economic sense. Monitoring auto emmisions in LA, Vancouver or Toronto ( currently suffering from an inversion trapping air polutants within the city)\n \n Alberta is not overly excessive when it comes to environmental cleanup or industry. Sediment from oil and gas batteries ( Oil well collection sites designed to remove sediments and water from oil) is used on rural roads to keep dust down as long as certain conditions are met ( heavy metal contamination). Industrial sites that are contaminated but present no risk are not cleaned up. If the contamination is spreading or presents a risk to human life it is cleaned up. \n \n Two examples \n 1. Creosote (sp) used to treat rail road wood ties. In downtown Calgary along the Bow river, there used to be in the early 1900's a plant used to treat railroad ties with Creosote. Of course many many litres leaked and contaminated the area. In the early 1990's the Creosote started to leak into the river and into area basements. It was cleaned up and I believe still has a small monitoring station that is pumping up the remaining creosote.\n 2. An oil refinery that closed down in the 50's was not cleaned up at that time. Now many homeowners have been directly and negatively affected by the high lead ( I lbelieve) contamination in their neighborhood. Imperial OIl ( Esso) is having to remove the top 1 meter of open surface top soil for almost the entire area.", 
   {}, 
   137100, 
   null, 
   1118779860.0
  ], 
  [
   137295, 
   null, 
   "marc9000", 
   "The ratio is irrelevent. It's a simple function of how toxic the pollutant is. \n\n \n Pollutants are almost always more toxic in greater quantities. Today's technology can find microscopic amounts of deadly substances in just about everything we eat and drink. But the amounts are small enough not to matter. If one drinks enough ocean salt water, they'll die. Ratio is very relevent. \n \n \nI agree that all that road salt is bad for the environment, but your position is hypocritical, to say the least. \n \n \n MY position is hypocritical? It's hypocritical to condemn small amounts of pollution from private sources, and condone large amounts of pollution from public sources.\n \n \n \nIn all cases, the stations were either in the city, or in small towns. \n \n The cleanup was somewhat subsidized by the county and provincial gov't, but in the end, why should the taxpayer pay to clean up someone else's mess? Remember personal liberty? It brings with it personal responsibility. If you've got leaking tanks in the ground, it's your own personal problem to fix them, no one else's. \n\n \n Personal liberty should mean no one but the property owner should make the decision about clean up. Unless there's clear evidence that contamination can leech to adjoining property, it's no one else's business. \n \n \nIME, the cost of the clean up was made very clear to the customers up front, it was really a pretty simple thing to estimate. The fact that it was left out of two articles you found on the internet is a veryy weak basis for your assumption that all environmental clean up work is done on the sly with an unlimited budget.\n\n \n Environmental clean up costs are seldom clear because so many of them are INDIRECT costs. Either taxes, or business costs passed on to the consumer. I DID NOT find those articles on the internet. I found them in my local, mainstream newspaper, THEN looked them up on the net. They were local things from MY community, and that information was largely the only information available in my area.\n \n \n \nAgain, why are the people unsuspecting? That's a baseless assumption on your part. \n\n \n They are unsuspecting because most of the cost is indirect. The cost penetrates the economy like most people don't realize. It's not reported to them. IMO there would be quite an uproar if people could see some cost comparisons of, for example, how much cheaper per gallon gasoline would be without the 1998 tank testing regulations that rendered so many storage tanks useless. It was INDIRECTLY paid for, at the pump. \n \n \nIf the alternative is leave the hydrocarbons in the soil because you don't want to pay for the cleanup, TOUGH. I don't want the soil and my drinking water contaminated by your leaking tanks. \n\n \n How far is your drinking water source from those tanks, and how far can that petroleum leech through the ground? Something besides the emotions of a minority should figure into the decisions made on others private property.\n \n \nWho's personal freedom trumps whoms? \n\n \n Property owners, when there's no clear evidence that their actions infringe on others. Emotional cries of \"I wanna breath clean air\" may suffice in some types of societies, but not free ones.\n \n \n \nAgain, this is a ridiculous assertion. \n \n \n Not when you notice how much the U.S. EPA has grown in size, budget, and power over the last 35 years. Or how many new private environmental companies have started up in that time. \n \n By the way, I may come across as thinking the sun rises and sets on the U.S. and I honestly don't intend to do that. It's where I live, and I'm most concerned about U.S. laws. I do appreciate hearing from you Canadians and others how things are in your countries. Do you call it the ~EPA~ in Canada? How long has it been in existance? Does each province have it's own, or is there one for all of Canada?\n \n \nTheir method for growing is to continue to do good work and continue to develop new technology. \n\n \n You trust government or an environmental company completely, but believe product producing companies are likely to care only about money? IMO it more often than not goes the other way, because of how legalities and free markets work.\n \n \nTrust me, there's no shortage of work out there as it is, there's no shortage of competition for that work either though. \n\n \n There's a shortage of competition for government agencies.\n \n \n \nI agree that tanks not leaking and within their rated lifespan should not be required to be replaced. I also agree that MTBE is one of the biggest screw ups of the environmental lobby. \n\n \n Thanks for bringing up MTBE - how long ago was the screw up discovered? Three counties in my area STILL HAVE IT in gasoline. Government agencies are very slow at admitting their screw ups, aren't they? At the expence of my drinking water!! emoticon_mad I don't know exactly why - they can't be sued like a private company in exactly the same position sure as #&%$ would!!\n \n \nYou're certainly a jaded fellow. :p \n \n It was a gov't job LOL, she was paid by the hour. She would do all she could pass people's tanks, she wasn't in the business of shutting people down, but if your tanks leak, your tanks leak, that's just the way it is. She didn't have anything to gain personally from it. In fact, that's a rather assinine assumption on your part. \n\n \n Assinine? All I was doing was comparing her to another person doing the exact same job that shut down my aquaintance 1 mile up the road from me who had tanks that DIDN'T leak. He was probably paid by the hour too. He may be like the type of person this world has no shortage of, people who get their jollies giving other people orders. \n \n \nI don't recall the exact timeframe that station owners were given to replace the tanks, but IIRC, it was actually a substantial time period, somewhere in the neighborhood of 6 months to 1 year. \n\n \n My aquaintance up the road paid roughly $100,000 for his tanks in 1984. I don't know what it would be in today's dollars, but 6 months to 1 year isn't very substantial for someone pumping gas & fixing cars to cough it up. \n \n \nUnfortunately, when they were \"informed\" (most knew damn well their tanks leaked) many people simply walked away from the station and the cost of clean up, leaving the gov't with the tab. There are still hundreds, if not thousands, of sites out there that will likely never be cleaned up, or at the least, will be waiting a long time to be cleaned up. \n\n \n And some may have walked away from a building & land they owned, and got nothing for it. Years of work down the drain - their lives wiped out, when reasonable compromises could have been reached. And you're so surprised that your cousin got her life threatened?\n \n \n \n \nWhy is it that thousands of other environmentalists don't in the case of road salt? \n\n \n I don't see evidence that they exist. I'd like to see what they have to say - do you have any links?\n \n \nAt any rate, safety is very important. \n\n \n Auto crash safety is 100% UNRELATED to environmentalism.\n \n \n\"Private property rights\", what about my right to drink clean water? Breathe clean air? \n \n Again, who's rights are more important?\n \n Private property rights are great, but they are not a license to do as you please regardless of the consequences your actions may have for others. \n\n \n May have, or WILL have according to evidence, not emotion? Who decides?\n \n \n \n \nI don't mind missing the ramblings of \"economists\" that write like spoiled, immature teenagers. \n\n \n \n oooooookay :) \n \n \n \n \nThe only thing I can think of is the closing of some of my favourite areas to off highway vehicle use due to environmental concerns. It makes me mad, and I stand up to it where it's unwarranted, with a considerable amount of my own time and money invested. However, I understand it, and I even tend to agree with it to a certain extent. Unfortunately, it only takes a handful of XXXXXX to destroy an area that thousands of people use and enjoy without causing any damage.\n \n \n \n The regulation caused the boom, plain and simple, by forcing the manufacturers to develop the 4 stroke. The inflow of cash and advanced technology into motorcycling created far better bikes and a whole new market for them. IMHO, no EPA, we'd all still be riding the same 2 stroke MX'ers that they've been building largely unchanged since the mid 80's. \n\n \n I don't believe free markets need government regulation for incentive to build improved products.\n \n \n \nMost people aren't criminals, why should I have to pay for a police force?\n \n Do you have insurance? Been in an accident?\n \n Do you pay school taxes? Have any children currently attending school?\n \n This argument is a non sequitor. \n\n \n Those are different situations. Crime has always been around - politicians and people have centuries of experience dealing with it. Environmentalism is practically brand new, and still being defined. Insurance? Voluntary, until recently. Still should be IMO (another thread) I pay school taxes and have no kids in school, and don't mind. They'll be working and contributing to the same society that I live in.\n \n \n \n \nSo is it the testing, or the fact the company is based in California that actual bothers you? \n\n \n Both, equally.\n \n \n \n \nI'd hate to see the cost of operating without environmental regulations, or regulations such as those that you would favour.\n \n For a quick example of the impact of unregulated or poorly regulated environmental controls, look up the oil fields of Oklahoma/California, or the Turner Valley area of southern Alberta, right up into the late 60's.\n \n Or, as suggested, go for a swim in Lake Ontario.\n \n Waxy\n\n \n Look them up? Is there information about them that's not been written by and for environmentalists?", 
   {}, 
   136964, 
   null, 
   1118808000.0
  ], 
  [
   137298, 
   null, 
   "marc9000", 
   "That's your opinion of \"useful\". \n\n \n No, it's the opinion of the person that owns the vehicle, the only person that matters in a free society. \n \n \nAgain, what about the rights of everyone else to breathe clean air?\n \n What about my liberty? \n\n \n In my area, we see no comparisons of today's air vs. yesterdays air before the testing began. Without those comparisons, your definitions of \"clean air\" aren't well enough defined IMO.\n \n \n \n \nTough. \n \n We all have to things we don't want to and make sacrifices for the greater good. That's just reality.\n \n Waxy\n\n \n Ahh yes, the greater good. Defined by elites.", 
   {}, 
   136965, 
   null, 
   1118808360.0
  ], 
  [
   137300, 
   null, 
   "marc9000", 
   "as far as I can make out, marc9000 is against the protection of life in health and safety and the maintanence of general quality of life with the destruction of the enviroment because they are not worhtwhile if they slow economic growth. Why? I'd far rather be happy than rich anyday, and I am more likely to be happy because I live in a pleasant enviroment i can hand down to my children and because I know that people are protected from the most selfish drives of capitalist industry than because I can afford another huge gas-guzzling 4 by 4.\n \n Capatilism is very into protecting private property, but public property like the enviroment has no weight. If its everyone's problem then de facto its nobodies problem.\n\n \n I'm against allowing only special interests, with financial and political power gains in the balance, to define what the \"destruction of the environment\" is.", 
   {}, 
   136974, 
   null, 
   1118808660.0
  ], 
  [
   137516, 
   null, 
   "Waxy", 
   "Pollutants are almost always more toxic in greater quantities. Today's technology can find microscopic amounts of deadly substances in just about everything we eat and drink. But the amounts are small enough not to matter. If one drinks enough ocean salt water, they'll die. Ratio is very relevent. \n\n \n So your point is that 1 gallon of hydrocarbon in your water is better than 10 pounds of salt? 100lbs of salt? The same? Worse?\n \n My point is that it takes very little of any pollutant to contaminate water/environment.\n \n \nMY position is hypocritical? It's hypocritical to condemn small amounts of pollution from private sources, and condone large amounts of pollution from public sources.\n\n \n Yes, your position is hypocritical, regardless of whether or not you're willing to acknowledge it or not.\n \n \nPersonal liberty should mean no one but the property owner should make the decision about clean up. Unless there's clear evidence that contamination can leech to adjoining property, it's no one else's business. \n \n \n Are you serious?\n \n There is clear evidence. Tonnes of it. Simple grade school geography/geology tells us that ground water circulates, often over very large distances (100's of miles).\n \n NEVER, have I encountered a contaminated site where the contamination abruptly stopped at the surveyed boundaries of the owner's land. That's ridiculous.\n \n Further to that, the land owner should be be responsible not only for the clean up his own property should it be sold, but should be, and is, liable for any damages that his polluting has caused to adjoining landowners.\n \n \nThey are unsuspecting because most of the cost is indirect. The cost penetrates the economy like most people don't realize. It's not reported to them. IMO there would be quite an uproar if people could see some cost comparisons of, for example, how much cheaper per gallon gasoline would be without the 1998 tank testing regulations that rendered so many storage tanks useless. It was INDIRECTLY paid for, at the pump. \n \n \n $0.000001/gallon maybe?\n \n IMHO, there would be very little uproar, if any. Partly because the effect of something like the 1998 tank testing regulations would barely be a blip on the price graph, but also because, IME, most intelligent people see the value in investing in the maintaining of a clean and healthy environment. \n \n \nHow far is your drinking water source from those tanks, and how far can that petroleum leech through the ground? Something besides the emotions of a minority should figure into the decisions made on others private property.\n\n \n In many cases, water sources are a matter of only hundreds of yards away.\n \n Petroleum/water in underground aquifers can travel 100s of miles. This is a WELL documented fact, and I can supply references for you if you'd like. \n \n Your refusal to acknowledge that these regulations are based on valid science doesn't invalidate them. There is no emotion involved is shutting down leaking gasoline tanks that are contaminating groundwater. If it were up to me, not only would the tanks be shut down, but the holder of the \"private property rights\" would be facing stiff fines for polluting the groundwater. \n \n \nProperty owners, when there's no clear evidence that their actions infringe on others. Emotional cries of \"I wanna breath clean air\" may suffice in some types of societies, but not free ones.\n\n \n No clear evidence? Again, where do you get this from? Your imagination?\n \n Breathing clean air and drinking clean water may just be \"emotional cries\" in your mind, but to the majority of people, they represent the very basics of survival, and are far more important than $$$ now. \n \n On top of that, clean air and water are the key to a strong population and a strong economy. \n \n \nNot when you notice how much the U.S. EPA has grown in size, budget, and power over the last 35 years. Or how many new private environmental companies have started up in that time. \n\n \n When you start from zero, there's no where to go but up.\n \n I won't argue that gov't agencies like the EPA are unwieldy and inefficient, of course they are, they're gov't agencies, but they're doing an important job. \n \n \nBy the way, I may come across as thinking the sun rises and sets on the U.S. and I honestly don't intend to do that. It's where I live, and I'm most concerned about U.S. laws. I do appreciate hearing from you Canadians and others how things are in your countries. Do you call it the ~EPA~ in Canada? How long has it been in existance? Does each province have it's own, or is there one for all of Canada?\n\n \n It's a mix. Water and oceans are strictly federal. Most other regulations are a mixture of federal and provincial regulation.\n \n There isn't an \"EPA\" as such in Canada, but rather an number of smaller gov't agencies.\n \n \nYou trust government or an environmental company completely, but believe product producing companies are likely to care only about money? IMO it more often than not goes the other way, because of how legalities and free markets work.\n\n \n Where have I stated that? Or are you just assuming/placing words in my mouth?\n \n There are many private companies that have exceptional environmental records, there are many that don't. On top of that, I certainly don't implicitly trust gov't or the environmental lobby on any issue - my stance on global warming should be more than enough proof of that.\n \n What are you basing that opinion on? \n \n All of the good will and stringent environmental practies that large corporations were undertaking before the advent of environmental regulations? \n \n Large corporations flocking to overseas locations were environmental regulation are largely non-existant to maximize profits? \n \n I think your glasses are a little rose coloured in this situation.\n \n \nAssinine? All I was doing was comparing her to another person doing the exact same job that shut down my aquaintance 1 mile up the road from me who had tanks that DIDN'T leak. He was probably paid by the hour too. He may be like the type of person this world has no shortage of, people who get their jollies giving other people orders. \n \n \n Yes assinine. To automatically assume that someone in that position would actually work on the basis of what would essentially be a commision for shutting people down, and to assume that a person would actually \"get their jollies\" by closing down the source of someone's livelihood. \n \n \nMy aquaintance up the road paid roughly $100,000 for his tanks in 1984. I don't know what it would be in today's dollars, but 6 months to 1 year isn't very substantial for someone pumping gas & fixing cars to cough it up. \n \n \n Life's tough. IMHO, they should be thankful there are no legal ramifications for the polluting they've been doing for the last 20-50 years.\n \n In this particualr case, where he wasn't polluting, it's a tougher call.\n \n Regardless, allowing a year to \"get it together\" so to speak seems reasonable to me. \n \n \nAnd some may have walked away from a building & land they owned, and got nothing for it. Years of work down the drain - their lives wiped out, when reasonable compromises could have been reached. And you're so surprised that your cousin got her life threatened?\n\n \n So you would condone, or at least understand, the \"kill the messenger\" mentality? Why am I not surprised.\n \n Isn't a big part of \"personal property rights\" accepting the responsibility that goes along with those rights, or does that only apply when it's convenient?\n \n According to your theory above, the private land holder/business owner should be striving to be 100% pollution free due to market pressure and legal liabilities, why isn't that happening? Could it be profit?\n \n What would you deem a reasonable compromise?\n \n \nMay have, or WILL have according to evidence, not emotion? Who decides?\n\n \n There's plenty of evidence. For crying out loud, there's been entire Hollywood movies based around some these situations.\n \n Scientists decide. People trained in the field with appropriate experience and credentials. \n \n The only emotion I see here is coming from you.\n \n \nI don't believe free markets need government regulation for incentive to build improved products.\n\n \n Nor do I, but in this particular case, the correlation is undeniable.\n \n \nThose are different situations. Crime has always been around - politicians and people have centuries of experience dealing with it. Environmentalism is practically brand new, and still being defined. Insurance? Voluntary, until recently. Still should be IMO (another thread) I pay school taxes and have no kids in school, and don't mind. They'll be working and contributing to the same society that I live in.\n\n \n Why are they different? Answer - They aren't.\n \n Pollution hasn't always been around? Of course it has, as long as man has been around, and especially for the last 2-300 years.\n \n We're learning to deal with it, we've got a long way to go, and it won't be easy or cheap, much like dealing with criminals.\n \n Insurance is mandatory in Alberta.\n \n So you see no problem with school taxes because you feel they'll provide you, and society in general, with a tangible benefit in the future, but you're opposed to environmental regulations and the associated \"indirect costs\". \n \n Hypocrital again, to say the least. If you can't leave a clean and prosperous environment to your children, what's the difference whether they're educated or not, where will they work?\n \n \nLook them up? Is there information about them that's not been written by and for environmentalists?\n\n \n Yes, but, what does it matter?\n \n If you want info about rocket science, do you ask a rocket scientist or a garbage man?\n \n Look up those areas, I'm guessing even you would be appaled at how the environment was treated until regulations were put in place - regulations much of the industry fought tooth and nail. If nothing else, it makes for some very interesting historical reading. \n \n Waxy", 
   {}, 
   137295, 
   null, 
   1118862720.0
  ], 
  [
   137518, 
   null, 
   "Waxy", 
   "No, it's the opinion of the person that owns the vehicle, the only person that matters in a free society. \n\n \n B.S.\n \n The parallels I could draw to that statement are endless, there's no point.\n \n \nIn my area, we see no comparisons of today's air vs. yesterdays air before the testing began. Without those comparisons, your definitions of \"clean air\" aren't well enough defined IMO.\n\n \n You haven't noticed any changes one way or the other personally?\n \n Have you looked for the actual data?\n \n \nAhh yes, the greater good. Defined by elites.\n\n \n emoticon_rolleyes \n \n Yes, the elites.\n \n Waxy", 
   {}, 
   137298, 
   null, 
   1118862900.0
  ], 
  [
   137682, 
   null, 
   "marc9000", 
   "So your point is that 1 gallon of hydrocarbon in your water is better than 10 pounds of salt? 100lbs of salt? The same? Worse? \n\n \n My point is that there is a DOUBLE STANDARD. The EPA may not be 100% corrupt, but IMO it is one of the most corrupt bureaucracies in the U.S.\n \n \nMy point is that it takes very little of any pollutant to contaminate water/environment.\n \n Yes, your position is hypocritical, regardless of whether or not you're willing to acknowledge it or not. \n\n \n If you won't acknowledge that pollution problems from road de-icing are swept under the rug far more than other pollution problems, your position is more hypocritical than mine.\n \n \n \n \nAre you serious?\n \n There is clear evidence. Tonnes of it. Simple grade school geography/geology tells us that ground water circulates, often over very large distances (100's of miles).\n \n NEVER, have I encountered a contaminated site where the contamination abruptly stopped at the surveyed boundaries of the owner's land. That's ridiculous.\n \n Further to that, the land owner should be be responsible not only for the clean up his own property should it be sold, but should be, and is, liable for any damages that his polluting has caused to adjoining landowners. \n\n \n 100's of miles? So if an underground tank from the 50's is discoverd to have been leaking for years, evidence of it would be miles away? You could dig miles away from it and find traces of gasoline? I'd have to see it with my own eyes. I've lived in the same house all my life. Decades ago, my brothers and I pulled out many an engine-trans-rear axle-gas tank in a field beside the house. I couldn't even guess how many gallons of gasoline / oil hit the ground. The cistern I still drink from today is about 400 feet away. I pump it dry and clean it every couple of years. No traces of petroleum that I can see, I do see some streaks near the top in the masonry cracks that show ground water gets in when it rains hard. I'm not completely defiant, I don't drink as much of it as I used to, and I avoid spilling gas and oil like I used to. But I'm still here! I\"m sure I'll outlive a few more healthnuts before I'm done.\n \n \n \n \n$0.000001/gallon maybe?\n \n \n Maybe, but considering the cost of replacing that many tanks, maybe not.\n \n \nIMHO, there would be very little uproar, if any. Partly because the effect of something like the 1998 tank testing regulations would barely be a blip on the price graph, but also because, IME, most intelligent people see the value in investing in the maintaining of a clean and healthy environment. \n \n \n Several stations around here closed in 98, and were never re-opened. I'm sure that's typical across the U.S. Less stations = more driving to get to gas. Of course more new stations were built - more cost. All trucks that deliver products buy fuel, and pass on the cost. There's more, it all adds up.\n \n \n \n \nIn many cases, water sources are a matter of only hundreds of yards away.\n \n Petroleum/water in underground aquifers can travel 100s of miles. This is a WELL documented fact, and I can supply references for you if you'd like. \n\n \n I'd like to see them. \n \n \nYour refusal to acknowledge that these regulations are based on valid science doesn't invalidate them. There is no emotion involved is shutting down leaking gasoline tanks that are contaminating groundwater. If it were up to me, not only would the tanks be shut down, but the holder of the \"private property rights\" would be facing stiff fines for polluting the groundwater. \n\n \n Don't most people who live in areas where much activity at all is going on, get their drinking water from a water treatment plant? Are these plants not capable of purifying the water? \n \n \n \nNo clear evidence? Again, where do you get this from? Your imagination? \n\n \n My home situation that I described above. You don't have to believe it, but I know it's true.\n \n \nBreathing clean air and drinking clean water may just be \"emotional cries\" in your mind, but to the majority of people, they represent the very basics of survival, and are far more important than $$$ now. \n \n On top of that, clean air and water are the key to a strong population and a strong economy. \n\n \n Different people have different definitions of \"clean\". When presented with cleaning costs, their definitions tend to change. They're not being allowed enough involvement in the process IMO. \n \n \n \n \nWhen you start from zero, there's no where to go but up. \n\n \n And nowhere to stop, no matter how \"clean\" things get.\n \n \nI won't argue that gov't agencies like the EPA are unwieldy and inefficient, of course they are, they're gov't agencies, but they're doing an important job. \n\n \n Some of it is important, I agree. But not enough to justify ALL the cost.\n \n \n \n \nWhere have I stated that? Or are you just assuming/placing words in my mouth? \n \n There are many private companies that have exceptional environmental records, there are many that don't. On top of that, I certainly don't implicitly trust gov't or the environmental lobby on any issue - my stance on global warming should be more than enough proof of that.\n \n What are you basing that opinion on? \n\n \n \nThere's a responsibility to do more than simply make money that comes with being a business owner. I know you'll disagree. \n\n \n Statements like that are a pretty strong hint of it. \n \n \nAll of the good will and stringent environmental practies that large corporations were undertaking before the advent of environmental regulations? \n\n \n That was sarcasm, I trust. Another hint of it. Common sense and a free press worked just a little bit before the wonderful government got involved. \n \n \nLarge corporations flocking to overseas locations were environmental regulation are largely non-existant to maximize profits? \n \n I think your glasses are a little rose coloured in this situation. \n\n \n Largely non-existant, or more reasonable?\n \n \n \nYes assinine. To automatically assume that someone in that position would actually work on the basis of what would essentially be a commision for shutting people down, and to assume that a person would actually \"get their jollies\" by closing down the source of someone's livelihood.\n\n \n You've never seen a little wanna-be tyrant in action at a local level? Visit the U.S. sometime. I saw on another message board where an OTR trucker in California got a ticket for smoking (alone) in his truck. Violated \"smoking in the workplace\" law. That cop would make a great EPA agent. \n \n \n \n \nLife's tough. IMHO, they should be thankful there are no legal ramifications for the polluting they've been doing for the last 20-50 years.\n \n In this particualr case, where he wasn't polluting, it's a tougher call.\n \n Regardless, allowing a year to \"get it together\" so to speak seems reasonable to me. \n\n \n Six figures is a lot of getting together for a one or two man business. Have you ever been self employed? \n \n \n \n \nSo you would condone, or at least understand, the \"kill the messenger\" mentality? Why am I not surprised. \n\n \n I don't condone revenge killing, of course. But I understand if somone else would in these circumstances. I am self employed. \n \n \nIsn't a big part of \"personal property rights\" accepting the responsibility that goes along with those rights, or does that only apply when it's convenient? \n\n \n It applies when that \"responsibility\" is defined by correct interpretation of the U.S. Constitution. \n \n \nAccording to your theory above, the private land holder/business owner should be striving to be 100% pollution free due to market pressure and legal liabilities, why isn't that happening? Could it be profit? \n\n \n My theory is that \"100%\" isn't necessary. There is an acceptable, realistic level, suitable for a free society.\n \n \nWhat would you deem a reasonable compromise? \n\n \n A case by case basis. The problem with government agencies is that so much of their requirement has to be documented, with certain rules applicable to many situations, so their robot employees can match rules and commands. \n \n \n \nThere's plenty of evidence. For crying out loud, there's been entire Hollywood movies based around some these situations. \n\n \n HOLLYWOOD MOVIES?? Townhall columnists are \"spoiled, immature teenagers\", and Hollywood is a better information source?? Please, just a few seconds of your time to read a small paragraph from a spoiled, immature teenager; \n \n \nCalifornia's San Bernardino County was just about ready to build a new hospital. That was until the U.S. Fish and Wildlife Department discovered that the endangered flower-loving Delhi Sands fly was found on the site. The county had to spend $4.5 million to move the hospital 250 feet; it also had to divert funds from its medical mission to pay for mandated Delhi Sands fly studies. \n\n \n That wan't a movie script. That was the real world. \n \n \n \n \nWhy are they different? Answer - They aren't.\n \n Pollution hasn't always been around? Of course it has, as long as man has been around, and especially for the last 2-300 years. \n\n \n Sacrificing money and freedom to deal with it hasn't been around very long.\n \n \nWe're learning to deal with it, we've got a long way to go, and it won't be easy or cheap, much like dealing with criminals.\n \n Insurance is mandatory in Alberta.\n \n So you see no problem with school taxes because you feel they'll provide you, and society in general, with a tangible benefit in the future, but you're opposed to environmental regulations and the associated \"indirect costs\". \n \n Hypocrital again, to say the least. If you can't leave a clean and prosperous environment to your children, what's the difference whether they're educated or not, where will they work? \n\n \n Environmentalism is much more vague and hard to define. \n \n \n \nYes, but, what does it matter? \n\n \n It matters what their motives are.\n \n \nIf you want info about rocket science, do you ask a rocket scientist or a garbage man? \n\n \n If I want info about the feasability of a rocket science program at taxpayers expence, I ask the taxpaying garbage man every time.\n \n \nLook up those areas, I'm guessing even you would be appaled at how the environment was treated until regulations were put in place - regulations much of the industry fought tooth and nail. If nothing else, it makes for some very interesting historical reading. \n \n Waxy\n\n \n I may just do that, but I'll also see if I can find anything on what the arguments of the industry were too.", 
   {}, 
   137516, 
   null, 
   1118894340.0
  ], 
  [
   137684, 
   null, 
   "marc9000", 
   "B.S.\n \n The parallels I could draw to that statement are endless, there's no point. \n\n \n You're right, there's not. :) We have basic political differences.\n \n \n \n \nYou haven't noticed any changes one way or the other personally?\n\n \n NO I HAVE NOT, NOT IN THE SLIGHTEST.\n \n \nHave you looked for the actual data? \n\n \n No, because if there was anything that favored environmentalism, my liberal news sources would be hitting me in the face with them.\n \n \n \n emoticon_rolleyes \n \n Yes, the elites.\n \n Waxy\n\n \n Yes, the ones my country's framers tried to warn me about.", 
   {}, 
   137518, 
   null, 
   1118894700.0
  ], 
  [
   137747, 
   null, 
   "Platypus", 
   "PMY position is hypocritical? It's hypocritical to condemn small amounts of pollution from private sources, and condone large amounts of pollution from public sources.\n\n I won't say it's hypocritical, but it's certainly disingenuous to ignore the relative toxicity of the substances involved. A \"large amount\" of something that's already present in the human body and in fact necessary for that body to function might indeed be preferable to a \"small amount\" of something as toxic as gasoline or MTBE. Quantity is important, but that shouldn't be spun to mean it's the only factor to consider.\n \nPersonal liberty should mean no one but the property owner should make the decision about clean up. Unless there's clear evidence that contamination can leech to adjoining property, it's no one else's business. \n\n Absolutely wrong. In the old Chelsea salt works, there used to be a problem with ground subsidence, causing buildings to collapse etc. It was absolutely impossible then, and probably still would be today, to attribute a particular subsidence to a particular salt mine, but the fact remained that the salt miners as a group were causing the destruction of other people's property. The solution was to require that miners pay into an insurance fund, based on the quantity of salt they produced, with the fund proceeds being used to pay those affected by subsidence. Pollution is just like that. It's generally difficult if not impossible to trace a specific harm to a specific polluter, especially when the effects might not be noticeable for decades, but that doesn't mean a debt isn't owed. Given that the cost might not be recoverable after the harm is done, it must be prevented from being incurred.\n \nHow far is your drinking water source from those tanks, and how far can that petroleum leech through the ground?\n\n A very long way. As soon as it hits the water table, which is often not far underground, it can diffuse quite rapidly. Aquifers are like rivers and lakes underground, with the same capability of spreading pollution over long distances.\n \nThanks for bringing up MTBE - how long ago was the screw up discovered? Three counties in my area STILL HAVE IT in gasoline. Government agencies are very slow at admitting their screw ups, aren't they?\n\n Are you trying to claim that the slow response is due to the EPA itself, and not to industry pressure?\n \nI don't believe free markets need government regulation for incentive to build improved products.\n\n It depends on what you mean by \"improved\" doesn't it? If \"improved\" means more appealing to the buyer but with greater cost/risk for others, then yes, regulation is needed. Ditto if the product itself is fine but the processes for making it place a burden (e.g. pollution) on others.\n \nNo, it's the opinion of the person that owns the vehicle, the only person that matters in a free society. \n\n Wrong. To the extent that the person's use of that vehicle affects others, their opinions matter too. Your right to swing your fist ends at the tip of my nose.\n \nIn my area, we see no comparisons of today's air vs. yesterdays air before the testing began. Without those comparisons, your definitions of \"clean air\" aren't well enough defined IMO.\n\n Even if it truly were impossible to measure air quality before direct measurement started, that wouldn't justify ignoring the problem. In any case it's not impossible. Tree-ring studies, for example, provide strong indications of air quality prior to direct measurement.\n \nThe EPA may not be 100% corrupt, but IMO it is one of the most corrupt bureaucracies in the U.S.\n\n Indeed it is, but not for the reasons you think. The source of its corruption is its close ties to the industries it supposedly polices, and its tendency to safeguard those interests instead of the public's.\n \nCommon sense and a free press worked just a little bit before the wonderful government got involved. \n\n Wrong yet again. Study the history of the EPA. You'll find that it was created specifically as a response to industry failure to act in the real world as your utopian dreams suggest. Government typically does not institute regulation just for the hell of it. A regulatory agency might outgrow its mandate, or become obsolete due to technological/social change, but the initial reasons for any agency's creation are usually pretty strong. All you need to do is not turn a blind eye to history.\n \nIt applies when that \"responsibility\" is defined by correct interpretation of the U.S. Constitution. \n\n And who made you the judge of what's a correct interpretation? I think Congress (which created the agencies you oppose) and the Supreme Court (which supported them) might know a thing or two about constitutional interpretation that you don't. Yes, correct interpretation matters, which means your interpretation doesn't.", 
   {}, 
   137295, 
   null, 
   1118926380.0
  ], 
  [
   138493, 
   null, 
   "marc9000", 
   "I won't say it's hypocritical, but it's certainly disingenuous to ignore the relative toxicity of the substances involved. A \"large amount\" of something that's already present in the human body and in fact necessary for that body to function might indeed be preferable to a \"small amount\" of something as toxic as gasoline or MTBE. Quantity is important, but that shouldn't be spun to mean it's the only factor to consider. \n\n \n That would be true if the ratio was 60% salt vs. 40% petroleum, or 70% salt vs. 30% petroleum, etc. But it's not, it's more like 99% salt vs. 1% petroleum. And the percentages keep moving in the same direction. Road salt usage keeps going up. As old steel underground petroleum tanks deteriorate, and are replaced by newer higher tech non steel ones, petroleum pollution goes down. And it's not completely because of the EPA, it's because as steel tanks leak and deteriorate, the leaks get worse so that eventually it's not economical to keep using them.\n \n \nAbsolutely wrong. In the old Chelsea salt works, there used to be a problem with ground subsidence, causing buildings to collapse etc. It was absolutely impossible then, and probably still would be today, to attribute a particular subsidence to a particular salt mine, but the fact remained that the salt miners as a group were causing the destruction of other people's property. The solution was to require that miners pay into an insurance fund, based on the quantity of salt they produced, with the fund proceeds being used to pay those affected by subsidence. Pollution is just like that. It's generally difficult if not impossible to trace a specific harm to a specific polluter, especially when the effects might not be noticeable for decades, but that doesn't mean a debt isn't owed. Given that the cost might not be recoverable after the harm is done, it must be prevented from being incurred. \n\n \n If it's not possible to forsee it, how is it possible to prevent it from being incurred? Guess? Err on the side of safety? Who does the guessing? Who loses liberty? If it is discovered that a guess that cost someone money or liberty turned out to be false, should the guesser be held accountable? \n \n \nA very long way. As soon as it hits the water table, which is often not far underground, it can diffuse quite rapidly. Aquifers are like rivers and lakes underground, with the same capability of spreading pollution over long distances. \n\n \n I gave my own personal example that says that's not true. It's probably more likely or less likely in different types of soil. If the water table IS far underground, or non existant in certain areas, should rules be the same in those areas as they are in areas where porus soil is a problem?\n \n \n \nAre you trying to claim that the slow response is due to the EPA itself, and not to industry pressure? \n\n \n Yes. If no government agency was involved, if it was all private, there would have been a very quick response. If Enron would have recommended that we put MTBE in gasoline, for example.\n \n \nIt depends on what you mean by \"improved\" doesn't it? If \"improved\" means more appealing to the buyer but with greater cost/risk for others, then yes, regulation is needed. Ditto if the product itself is fine but the processes for making it place a burden (e.g. pollution) on others. \n\n \n Costs/risks, burdens. Who decides, free markets in a constitutionally limited government, or a government agency?\n \n \nWrong. To the extent that the person's use of that vehicle affects others, their opinions matter too. Your right to swing your fist ends at the tip of my nose. \n\n \n Yes, their opinions do matter. Not the opinions of their unelected, self serving spokesman. \n \n \nEven if it truly were impossible to measure air quality before direct measurement started, that wouldn't justify ignoring the problem. In any case it's not impossible. Tree-ring studies, for example, provide strong indications of air quality prior to direct measurement. \n\n \n Reasonable proof should exist, before liberties are destroyed by unelected government agencies. How can tree ring studies differentiate between man made pollution and natural pollution, such as volcanic activity?\n \n \nIndeed it is, but not for the reasons you think. The source of its corruption is its close ties to the industries it supposedly polices, and its tendency to safeguard those interests instead of the public's. \n\n \n Those are exactly the reasons I think. If a government agency is in bed with a private company, who is the more guilty one? I think it's the one that is supported by taxpayers, with no competetive incentive.\n \n The vast majority of the public owns, works for, or buys products from medium & small businesses who do not have close ties with the EPA.\n \n \n \nWrong yet again. Study the history of the EPA. You'll find that it was created specifically as a response to industry failure to act in the real world as your utopian dreams suggest. Government typically does not institute regulation just for the hell of it.  A regulatory agency might outgrow its mandate, or become obsolete due to technological/social change, but the initial reasons for any agency's creation are usually pretty strong. All you need to do is not turn a blind eye to history. \n\n \n \"does not institute regulation just for the hell of it\" - Really? The framers of the Constitution may not have agreed with you. Shall we check a few phrases from the Bill of Rights?\n \n \"shall make no law\"\n \"shall not be infringed\"\n \"no soldier shall be quartered\"\n \"unreasonable searches and seizures\"\n \"no person shall be held\"\n \"nor shall private property be taken\"\n \"shall not be required\"\n \"shall not be construed\"\n \n The framers had first hand knowledge of \"regulation just for the hell of it\". They didn't have their senses dulled by 200+ years of relative freedom.\n \n Have you ever heard of a country collapsing because of oppressive government? Have you ever heard of a country collapsing because they polluted themselves to death?? \n \n It isn't ME who's turning a blind eye to history.\n \n \n \n \nAnd who made you the judge of what's a correct interpretation? I think Congress (which created the agencies you oppose) and the Supreme Court (which supported them) might know a thing or two about constitutional interpretation that you don't. Yes, correct interpretation matters, which means your interpretation doesn't.\n\n \n My interpretation means little? - Congress and the Supreme Court can be trusted completely with interpreting the Constitution? Don't think George Washington agreed with you here either.\n \n \n If men are to be precluded from offering their sentiments on a matter which may involve the most serious and alarming consequences that can invite the consideration of mankind, reason is of no use to us; the freedom of speech may be taken away, and dumb and silent we may be led like sheep to the slaughter. \n\n \n I don't care how smart John McCain and Russ Feingold think they are, the words \"Congress shall make no law...abridging the freedom of speech\" are understandable by just about anybody, understandable enough to know that their \"campaign reform\" law was UNCONSTITUTIONAL. \n \n Do you completely trust Congress and the Supreme Court - is reason of any use to you?", 
   {}, 
   137747, 
   null, 
   1119061140.0
  ], 
  [
   139249, 
   null, 
   "Waxy", 
   "If you won't acknowledge that pollution problems from road de-icing are swept under the rug far more than other pollution problems, your position is more hypocritical than mine.\n\n \n Do you think this might have a correlation to toxicity and the severity of the problem? emoticon_rolleyes \n \n How many times do I have to explain it?\n \n \n100's of miles? So if an underground tank from the 50's is discoverd to have been leaking for years, evidence of it would be miles away? You could dig miles away from it and find traces of gasoline? I'd have to see it with my own eyes. I've lived in the same house all my life. Decades ago, my brothers and I pulled out many an engine-trans-rear axle-gas tank in a field beside the house. I couldn't even guess how many gallons of gasoline / oil hit the ground. The cistern I still drink from today is about 400 feet away. I pump it dry and clean it every couple of years. No traces of petroleum that I can see, I do see some streaks near the top in the masonry cracks that show ground water gets in when it rains hard. I'm not completely defiant, I don't drink as much of it as I used to, and I avoid spilling gas and oil like I used to. But I'm still here! I\"m sure I'll outlive a few more healthnuts before I'm done.\n\n \n Yes, evidence could certainly be found miles away, depending on the amount of fuel that leaked, and the geology of the area.\n \n Go outside your house and dig around in those old spots. Is the oil still there? What does it look like, pretty much the same as when you dumped it?\n \n You're aware of the fact that you don't have to be able to see the petroleum in water for it to be toxic right? \n \n It's soluble components in gasoline (benzene, toluene, etc...) that are the most toxic, and the most mobile.\n \n Ever wonder why cancer rates are on the rise?\n \n \nI'd like to see them. \n \n \n http://ewr.cee.vt.edu/environmental/teach/gwprimer/btex/btex.html#1.%20Introduction\n \n http://gis.esri.com/library/userconf/proc01/professional/papers/pap213/p213.htm\n \n http://www.skidmore.edu/~jthomas/fairlysimpleexercises/gwasessment.html - this one might be particularly useful for you.\n \n http://www.hillsdalecounty.info/planningeduc0020.asp\n \n http://research.esd.ornl.gov/hydrology/WAG5/\n \n http://www.dcnr.state.pa.us/topogeo/groundwater/bad_hydro.aspx - a counter point link describing limitation on groundwater flow.\n \n Is that enough for you?\n \n Groundwater and even hydrocarbons in the subsurface are capable of migrating 1000kms, small distances are a \"drop in the bucket\" so to speak.\n \n \nDon't most people who live in areas where much activity at all is going on, get their drinking water from a water treatment plant? Are these plants not capable of purifying the water? \n \n \n Yes and no. It can be done, it is costly. Why not eliminate the source of the problem rather than putting a band aid on it?\n \n Besides, why change the subject now?\n \n \nMy home situation that I described above. You don't have to believe it, but I know it's true.\n\n \n I'm sure you \"know\" a lot of things are true.\n \n \nAnd nowhere to stop, no matter how \"clean\" things get.\n\n \n Yep, right. emoticon_rolleyes \n \n \nSome of it is important, I agree. But not enough to justify ALL the cost.\n\n \n What's justifiable?\n \n Who decides?\n \n Someone like yourself with only a very limited understanding of the subject and limited anecdotal evidence, or trained scientists and other experts?\n \n I know who I want making the decisions.\n \n \nStatements like that are a pretty strong hint of it. \n \n \n Statements like that are a hint of nothing. You made an assumption based on your preconceived notions, and when challenged, you couldn't back it up.\n \n You're responsible for following the rules and cleaning up your own mess. \n \n \nThat was sarcasm, I trust. Another hint of it. Common sense and a free press worked just a little bit before the wonderful government got involved.\n\n \n A hint of my mistrust of private enterprise and capitalism when it comes to the environment? You're darn right. I'm just as leary of most government agencies.\n \n I'm glad you picked up the sarcasm in this one, despite the other two being dripping with it, you seemed to have missed it.\n \n As far as the effectiveness of \"common sense and a free press\", apparently the point of the sarcasm was completely lost on you.\n \n \nLargely non-existant, or more reasonable?\n \n \n I can only shake my head at this one. Do you want to live in Mexico City?\n \n \nSix figures is a lot of getting together for a one or two man business. Have you ever been self employed? \n \n \n Yes I have. \n \n What's your point?\n \n You're breaking the law, there's consequences. \n \n I'm not saying it's easy, and I'm not happy about it, but that's the reality of owing a small business.\n \n \nI don't condone revenge killing, of course. But I understand if somone else would in these circumstances. I am self employed. \n \n \n I knew you were rather fanatical before I engaged in this debate, but I'm getting a glimpse of just how fanatical you are.\n \n My point is made then. I've got no further comment on this one.\n \n \nIt applies when that \"responsibility\" is defined by correct interpretation of the U.S. Constitution. \n \n \n Correct meaning your interpretetation, not those of the Supreme Court, Congress, etc... emoticon_rolleyes \n \n \nMy theory is that \"100%\" isn't necessary. There is an acceptable, realistic level, suitable for a free society.\n\n \n I agree, but the goal should remain 100%, and work within a reasonable compromise.\n \n \nA case by case basis. The problem with government agencies is that so much of their requirement has to be documented, with certain rules applicable to many situations, so their robot employees can match rules and commands. \n \n \n And that would save money how?\n \n \nHOLLYWOOD MOVIES?? Townhall columnists are \"spoiled, immature teenagers\", and Hollywood is a better information source?? Please, just a few seconds of your time to read a small paragraph from a spoiled, immature teenager; \n \n \n The point here, since I seem to have to spell everything out for you, is that this situation is so common, and is so much a part of general public knowledge, that Hollywood has even made movies about it. (Erin Brokovich for one) It has nothing to do with using Hollywood as a source of information. \n \n \nSacrificing money and freedom to deal with it hasn't been around very long.\n\n \n Unfortunately. That's why we're now paying for it.\n \n \nEnvironmentalism is much more vague and hard to define. \n \n \n Not really. Only in your mind.\n \n \nIf I want info about the feasability of a rocket science program at taxpayers expence, I ask the taxpaying garbage man every time.\n\n \n I'm glad you're not in charge. \n \n I prefer to make my decisions based on the recommendations and work of those qualified to form scientific and intelligent opinions on the subject at hand.\n \n \nI may just do that, but I'll also see if I can find anything on what the arguments of the industry were too.\n\n \n Please do.\n \n Then, do a little more digging and find out what the effects of the new environmental regulations were on the industry. \n \n I can't wait to see your reaction. :p \n \n Waxy", 
   {}, 
   137682, 
   null, 
   1119303360.0
  ], 
  [
   139252, 
   null, 
   "Waxy", 
   "You're right, there's not. :) We have basic political differences.\n\n \n It has nothing to do with political differences, and everything to do with simple logic.\n \n I'm not going to bother spelling it out for you.\n \n \nNo, because if there was anything that favored environmentalism, my liberal news sources would be hitting me in the face with them.\n\n \n Keep your eyes peeled on FOX news. :p \n \n \nYes, the ones my country's framers tried to warn me about.\n\n \n Your vigilence and patriotism is noted. emoticon_rolleyes \n \n Waxy", 
   {}, 
   137684, 
   null, 
   1119303600.0
  ], 
  [
   139471, 
   null, 
   "Platypus", 
   "That would be true if the ratio was 60% salt vs. 40% petroleum, or 70% salt vs. 30% petroleum, etc. But it's not, it's more like 99% salt vs. 1% petroleum.\n\n So a toxicity difference of millions to one matters less to you than a volume difference of a mere hundred to one? Learn some math.\n \nIf it's not possible to forsee it, how is it possible to prevent it from being incurred? Guess? Err on the side of safety?\n\n Basically yes, but without the prejudicial language. The best scientific predictions and estimates - which are not just guesses - should be used, and the precautionary principle applied.\n \nIf it is discovered that a guess that cost someone money or liberty turned out to be false, should the guesser be held accountable?\n\n First, let's stop tying money and liberty together all the time. I know laissez-fairies think that property rights are the only kind that matter, but there are other kinds of liberty that rational people consider more important. Money is the only thing really at stake here.\n \n Yes, bad estimates will happen. One kind of bad estimate is assuming nothing bad will happen and doing nothing. It's a simple matter of risk management. It's better that several catastrophes be avoided, even if that also means one false alarm, than that we sit back and let everything go to hell. As long as our action - or inaction - is guided by scientifically valid estimations of risk and cost, we'll be better off. We tried the other way. It sucked. As I said before, learn the history of the EPA and similar agencies before you criticize.\n \nI gave my own personal example that says that's not true.\n\n Personal examples don't mean squat. After you finish learning basic math, learn basic statistics as well. Other people have their own \"personal examples\" which conflict with yours, and the only way to make a rational decision is to get past anecdotes to the statistical reality.\n \nIt's probably more likely or less likely in different types of soil. If the water table IS far underground, or non existant in certain areas, should rules be the same in those areas as they are in areas where porus soil is a problem?\n\n No, probably not. There's no reason such factors can't be accounted for.\n \nIf no government agency was involved, if it was all private, there would have been a very quick response.\n\n That's a strong prediction. What is it based on? Absolutely nothing is my guess, unless self-interest counts as a reason. These types of pollution existed for decades, ever since use of gasoline became widespread, without the private sector doing a damn thing to address it. They had no incentive to do so, and you should know that markets are all about incentives. There was no incentive to avoid polluting, so there was no effort.\n \nCosts/risks, burdens. Who decides, free markets in a constitutionally limited government, or a government agency?\n\n Free markets, but free markets don't just happen by themselves. A market characterized by perverse incentives and ignored externalities is not truly a free market. Markets are powerful things, and market mechanisms should be used to handle whatever kinds of resource allocation etc. that they can, but sometimes they need a bit of a nudge.\n \n You also seem to be missing the point that government isn't something that is imposed on the people from outside, and treating it as such is just a cop-out to avoid responsibility. The government and all of its agencies is us, the people, acting in their collective and democratic interest. Yes, government power is constitutionally limited, but that doesn't mean it's totally proscribed.\n \nHow can tree ring studies differentiate between man made pollution and natural pollution, such as volcanic activity?\n\n It's not hard, actually, since the two leave different chemical traces. Look it up. Educate yourself, instead of demanding that others education for free. Nobody loves a leech.\n \n\"does not institute regulation just for the hell of it\" - Really? The framers of the Constitution may not have agreed with you. Shall we check a few phrases from the Bill of Rights?\n\n You forgot \"general welfare\" and \"to protect these rights governments are instituted among men\" (indicating recognition that rights might not be preserved otherwise). I guess you like to pick and choose which parts of the Declaration and Constitution you care about, but it's an utterly transparent and childish ploy. The founders were well aware of the dangers both of too much government and of too little. Government is not the only agent that can deny liberty, and is necessary as a counterweight to others that are even less subject to popular will or constitutional limitation.\n \nThe framers had first hand knowledge of \"regulation just for the hell of it\". They didn't have their senses dulled by 200+ years of relative freedom.\n\n The ones whose senses are dulled are those who think that freedom (and opportunity which is its complement) just kind of happened and did not require positive action by the government to preserve it.\n \nHave you ever heard of a country collapsing because of oppressive government?\n\n Yes, but I've also noticed a lot of countries collapsing because of too little. If you don't like living where there's a social contract that might inconvenience you, try living in Afghanistan or Sierra Leone. That's the kind of society (or non-society, really) that you'd give us, whether you know/admit it or not. Those places are rather hellish compared to the US, but that's the point. Since you don't seem to believe in American ideals, I suggest you try those alternatives. Good luck to you.\n \nMy interpretation means little? - Congress and the Supreme Court can be trusted completely with interpreting the Constitution?\n\n Did I say completely, or anything that meant it the way your paraphrase does? Putting words in other people's mouths is another example of childish non-debate. As long as you engage in such tactics in lieu of facts and reason, you fall further behind in every round.", 
   {}, 
   138493, 
   null, 
   1119361800.0
  ], 
  [
   140567, 
   null, 
   "marc9000", 
   "Do you think this might have a correlation to toxicity and the severity of the problem? emoticon_rolleyes \n \n How many times do I have to explain it? \n\n \n Once would be real nice. You haven't addressed it at all. You're very convincing about how bad petroleum is, but you've done nothing to show that salt is comparatively harmless.\n \n \n \n \nYes, evidence could certainly be found miles away, depending on the amount of fuel that leaked, and the geology of the area.\n \n Go outside your house and dig around in those old spots. Is the oil still there? What does it look like, pretty much the same as when you dumped it?\n \n You're aware of the fact that you don't have to be able to see the petroleum in water for it to be toxic right? \n \n It's soluble components in gasoline (benzene, toluene, etc...) that are the most toxic, and the most mobile.\n \n Ever wonder why cancer rates are on the rise? \n\n \n I suspect it could largely be due to current eating habits and exercise habits. 2/3 of Americans are said to be overweight today, as opposed to less than 1/2 in the early 60's. We can't blame everything on petroleum leaks from small businesses.\n \n \n \n \nhttp://ewr.cee.vt.edu/environmental/teach/gwprimer/btex/btex.html#1.%20Introduction\n \n http://gis.esri.com/library/userconf/proc01/professional/papers/pap213/p213.htm\n \n http://www.skidmore.edu/~jthomas/fairlysimpleexercises/gwasessment.html - this one might be particularly useful for you.\n \n http://www.hillsdalecounty.info/planningeduc0020.asp\n \n http://research.esd.ornl.gov/hydrology/WAG5/\n \n http://www.dcnr.state.pa.us/topogeo/groundwater/bad_hydro.aspx - a counter point link describing limitation on groundwater flow.\n \n Is that enough for you? \n\n \n It's enough on petroleum, not enough on salt. The fourth one's table of problems and cures did include salt, however. Let's compare two of the proposed solutions from that link.\n \n On underground storage tanks,\n \n \nPrevention:\n - Proper installation, maintenance, leak testing and inventory control.\n - Permit compliance.\n - Leak backup containment.\n - Removal of abandoned tanks or filling with inert material.\n\n \n 4 big checkmarks - plenty of private property invaded, plenty of money spent.\n \n Now for road salt\n \n \nPrevention:\n - Proper protection of salt storage.\n - Minimize use of salt.\n - Use alternative deicing materials.\n\n \n Three big failures. I noticed a wide open salt storage bin in Cincinnati right along I-75 just a week or so ago. The next two are an equal joke of course. In 1965-66, only 2 million tons of road salt were used all across the U.S. \n \n http://emml.mtu.edu/gem/community/publications/wellspring/deicingdebate.html\n \n Today, it's 15 million. What is going to stop it from increasing further? Why couldn't we cut back to 60's levels, for the environment? We have built more roads since the 60's but the percentage is fairly small. Except for the beltways and a few extensions, our interstate system was in place in the 60's. Instead of 2 million tons, why don't we allow for the extra roads and make it 3 million? A little more plowing, a little more dicipline in driving habits, we could even have a tax refund for 12 million tons of salt! It would be a drop in the bucket of course, but all the accumulated taxes that now cost us almost half of our income came one drop-in-the-bucket at a time. The public would grumble, but no more than they do at auto emissions testing. The big problem would be ~insurance lobbyists~, that's where the problem lies! Money & corruption - that's what causes the environmental double standard that you can't disprove.\n \n \n \n \nGroundwater and even hydrocarbons in the subsurface are capable of migrating 1000kms, small distances are a \"drop in the bucket\" so to speak.\n\n \n Is this from one of your links above? From your second link;\n \n \nHundreds of millions of years ago, Southeast Minnesota was covered by a warm, shallow sea. \n\n \n How can we know where \"fact\" ends, and evolutionary/environmental propaganda begins?\n \n \n \nYes and no. It can be done, it is costly. Why not eliminate the source of the problem rather than putting a band aid on it?\n \n Besides, why change the subject now?\n\n \n The subject is groundwater pollution - no subject change at all. emoticon_rolleyes \n \n Except for rainwater, it's not really safe to drink any water from a stream or pond. You never know if a dead animal is rotting in the water up around the bend. Any water in a city water system is treated. The water entering a treatment plant can be dirty in varying degrees, and will come out the clean end safe to drink. It's not a band aid, water treatment plants can't be made cheaper just because the EPA says it's \"eliminated the source of the problem\". The EPA is never going to claim that anyway, there's always more to be done. If they ever permenantly \"eliminate\" pollutions sources, their funding could be in jeopardy.\n \n \n \nI'm sure you \"know\" a lot of things are true.\n\n \n I know things that I personally experience a lot better than I know where warm, shallow seas were hundreds of millions of years ago. \n \n \n \n \nYep, right. emoticon_rolleyes \n \n \n \n What's justifiable?\n \n Who decides?\n \n Someone like yourself with only a very limited understanding of the subject and limited anecdotal evidence, or trained scientists and other experts? \n\n \n Not just myself, but people collectively. People have a right to question why private pollution is bad, but government pollution is not a problem.\n \n I\n \nStatements like that are a hint of nothing. You made an assumption based on your preconceived notions, and when challenged, you couldn't back it up. \n\n \n They are a hint of plenty, because there is often NO DIFFERENCE between your posts and those of a rabid environmentalist. I did read through the \"global warming\" thread. It is amazing - you seemed like a different person there. In this thread, I can see no difference between your reasoning and the reasoning of a global warming alarmist.\n \n \n \n \nA hint of my mistrust of private enterprise and capitalism when it comes to the environment? You're darn right. I'm just as leary of most government agencies. \n\n \n But you give them a FREE PASS on road salt? \n \n \nI'm glad you picked up the sarcasm in this one, despite the other two being dripping with it, you seemed to have missed it.\n \n As far as the effectiveness of \"common sense and a free press\", apparently the point of the sarcasm was completely lost on you. \n\n \n Oh no no no no no, I caught it, I just didn't say anything, I was being polite. :p So you're MORE LEARY of common sense and a free press, than most government agencies?? \n \n \n \n \nI can only shake my head at this one. Do you want to live in Mexico City? \n\n \n If I was running a filling station and wanted to be left alone, I probably would.\n \n \n \n \nYes I have. \n \n What's your point? \n\n \n My point is this ~ many people who work as an employee, on a tax withholding payroll, with benefits, vacation, sick days etc. can have a hard time understanding why a service they require (a roof on their house, a major repair on their car) requires them to pay 4 or 5 times their own hourly rate to a worker/workers who very well may be less skilled than they themselves are. They don't understand normal business operating expences, let alone operating expences involved in a government as large as the U.S. currently is. I've been reading your posts long enough to know you have a grasp of it, but your comment about 6 months to a year being plenty of time for a one or two man business to scare up six figures didn't indicate it.\n \n \n \n \n \n I knew you were rather fanatical before I engaged in this debate, but I'm getting a glimpse of just how fanatical you are. \n\n \n Much of the U.S. could be considered fanatical according to you. One of our founders said \"when the government fears the people, there is liberty. When the people fear the government, there is tyranny. \n \n Did you hear about the U.S Supreme Court ruling today? Eventually someone will die over that one - I hope it's a long time away and I hope it's rare. Much better if it's a government agent than a private citizen, but either way, their death won't be in vain. We'll learn from it.\n \n \n \n And that would save money how? \n\n \n That one's about liberty far more than money.\n \n \n \n \nThe point here, since I seem to have to spell everything out for you, is that this situation is so common, and is so much a part of general public knowledge, that Hollywood has even made movies about it. (Erin Brokovich for one) It has nothing to do with using Hollywood as a source of information. \n\n \n So common, part of public knowledge? You have it backwards. The only way a lot all the public got the knowledge was from the propaganda movie. Some people vote based on nothing more than what they hear on late night comedy TV. Why aren't any movies made showing the waste of moving a hospital to avoid disturbing the Delhi Sands Fly?\n \n \n \n \nPlease do.\n\n \n Haven't had a chance to do that yet. Did some checking on salt though - it seems to be a REAL problem. I won't bother to link you - I'm sure you know about it.\n \n \nThen, do a little more digging and find out what the effects of the new environmental regulations were on the industry. \n\n \n No new regulations on salt.", 
   {}, 
   139249, 
   null, 
   1119584040.0
  ], 
  [
   140589, 
   null, 
   "marc9000", 
   "So a toxicity difference of millions to one matters less to you than a volume difference of a mere hundred to one? Learn some math. \n\n \n Millions to one? Where did you get that precision comparision? I don't think you have anything on me when it comes to math.\n \n \nBasically yes, but without the prejudicial language. The best scientific predictions and estimates - which are not just guesses - should be used, and the precautionary principle applied. \n\n \n Disregarding who loses, or gains liberty / money? Being concerned about it isn't prejudicial, it really is legitimate.\n \n \nFirst, let's stop tying money and liberty together all the time. I know laissez-fairies think that property rights are the only kind that matter, but there are other kinds of liberty that rational people consider more important. Money is the only thing really at stake here. \n\n \n When it comes to big vs. small domestic government, they ARE tied together. You and I probably have different definitions of \"rational\" people.\n \n \nYes, bad estimates will happen. One kind of bad estimate is assuming nothing bad will happen and doing nothing. It's a simple matter of risk management. \n\n \n Domestically, assuming nothing bad will happen and being wrong, is often far less costly to repair than wasteful, costly risk management. Costly in money, and liberty. It is a different story in foreign affairs however. The constitution gives government more power concerning foreign affairs than it does with domestic affairs.\n \n \n It's better that several catastrophes be avoided, even if that also means one false alarm, than that we sit back and let everything go to hell. As long as our action - or inaction - is guided by scientifically valid estimations of risk and cost, we'll be better off. We tried the other way. It sucked. As I said before, learn the history of the EPA and similar agencies before you criticize. \n\n \n Who should I trust to give me the history lesson? The EPA?\n \n \n \n \nPersonal examples don't mean squat. \n\n \n They do in a society where people vote, write congressmen, post on message boards, and own guns.\n \n \n \nNo, probably not. There's no reason such factors can't be accounted for. \n\n \n Yes there is a reason. If the EPA is not accountable enough to account for them.\n \n \n \nThat's a strong prediction. What is it based on? Absolutely nothing is my guess, unless self-interest counts as a reason. \n\n \n Private business is far more likely to be destroyed by the U.S. legal system than is a government agency.\n \n \n These types of pollution existed for decades, ever since use of gasoline became widespread, without the private sector doing a damn thing to address it. They had no incentive to do so, and you should know that markets are all about incentives. There was no incentive to avoid polluting, so there was no effort. \n\n \n And the EPA was formed, and it was a good thing. But there weren't enough safeguards to keep it from growing into a self serving monster.\n \n \nFree markets, but free markets don't just happen by themselves. A market characterized by perverse incentives and ignored externalities is not truly a free market. Markets are powerful things, and market mechanisms should be used to handle whatever kinds of resource allocation etc. that they can, but sometimes they need a bit of a nudge. \n\n \n Nudged yes, destroyed, no.\n \n \nYou also seem to be missing the point that government isn't something that is imposed on the people from outside, and treating it as such is just a cop-out to avoid responsibility. The government and all of its agencies is us, the people, acting in their collective and democratic interest. Yes, government power is constitutionally limited, but that doesn't mean it's totally proscribed. \n\n \n Different government agencies seem to have different standards. We see police cars, fire trucks, ambulances all the time. They are paid for by taxpayers, and those in charge of them often seem to take pride in them. We sometimes see police cars with slogans on them, \"to protect and serve\". We see jurisdiction names proudly displayed on them. Even school district vehicles have emblems on them, often with the words \"for official use only\". Schools, jails, police stations, firehouses, what legitimate group couldn't get a polite tour of them upon request? Tell me please, when was the last time you saw a vehicle with ~EPA~ emblazoned on it's side? The EPA has vehicles - I sometimes see them on job sites. Unmarked, luxury SUV's. Have you ever seen an EPA office? There's one in Cincinnati. It's like a fortress. In my business I was involved in parking lot pavement work on it. Armed guards watched me very closely. High fences, security gates, not inviting at all. What do they do in there that they want no one to see? How many other government agencies are shrouded in mystery and secrecy? \n \n Couldn't they project a more positive public image if they were more outgoing, like a police dept? In addition to having their gas guzzling SUV's marked with attractive letters, they could have pictures of sparkling waterfalls, or smiling trees on them. They could invite school children to tour their taxpayer funded offices. Or could it be that they're afraid of what the childrens parents might think about how their hard earned tax money is being spent? \n \n \nIt's not hard, actually, since the two leave different chemical traces. Look it up. Educate yourself, instead of demanding that others education for free. Nobody loves a leech.\n\n \n Would these be the trees that lived in the same area where the warm, shallow sea was hundreds of millions of years ago? Are they smarter than trees without such an impressive background? Should we give them the right to vote? \n \n \n \nYou forgot \"general welfare\" and \"to protect these rights governments are instituted among men\" (indicating recognition that rights might not be preserved otherwise). I guess you like to pick and choose which parts of the Declaration and Constitution you care about, but it's an utterly transparent and childish ploy. \n\n \n Instituted among men deriving their just powers from the consent of the governed. Who's really picking and choosing? General welfare? Here's what James Madison had to say;\n \n \"With respect to the two words 'general welfare', I have always regarded them as qualified by the detail of powers connected with them. To take them in a literal and unlimited sense would be a metamorphsis of the constitution into a character which there is a host of proofs was not contemplated by it's creators.\"\n \n I think he's saying that there are ways a government can promote the general welfare, provided it doesn't violate parts of the constitution. The way the EPA sometimes declares private property \"wetlands\" or an endangered species preserve, and then denies the landowner use of it without paying him for it, violates the last line of the 5th amendment.\n \n \n \nThe founders were well aware of the dangers both of too much government and of too little. Government is not the only agent that can deny liberty, and is necessary as a counterweight to others that are even less subject to popular will or constitutional limitation. \n\n \n Do you have examples of \"others\"?\n \n \nThe ones whose senses are dulled are those who think that freedom (and opportunity which is its complement) just kind of happened and did not require positive action by the government to preserve it. \n\n \n The one's whose senses are REALLY dull are those who think freedom is a gift from government. \"Endowed by their creator\" - ever hear the phrase before?\n \n \nYes, but I've also noticed a lot of countries collapsing because of too little. If you don't like living where there's a social contract that might inconvenience you, try living in Afghanistan or Sierra Leone. That's the kind of society (or non-society, really) that you'd give us, whether you know/admit it or not. Those places are rather hellish compared to the US, but that's the point. Since you don't seem to believe in American ideals, I suggest you try those alternatives. Good luck to you. \n\n \n You're giving me suggestions on where to live, and you're profile doesn't say where YOU live? Why am I not surprised? I don't believe in American ideals? I've made my points using the text of the constitution far more than you have.\n \n \nDid I say completely, or anything that meant it the way your paraphrase does? Putting words in other people's mouths is another example of childish non-debate. As long as you engage in such tactics in lieu of facts and reason, you fall further behind in every round.\n \n \n I didn't put words in your mouth, I'm just going by what you post. You posted this;\n \n \nAnd who made you the judge of what's a correct interpretation? I think Congress (which created the agencies you oppose) and the Supreme Court (which supported them) might know a thing or two about constitutional interpretation that you don't. Yes, correct interpretation matters, which means your interpretation doesn't. \n\n \n Translating your sarcastic \"might know a thing or two\" into \"completely\" wasn't that far off. Would you trust Congress and the Supreme Court more than me if you found out that more than half of the U.S. population agreed with me?", 
   {}, 
   139471, 
   null, 
   1119589740.0
  ], 
  [
   140627, 
   null, 
   "Fishbulb", 
   "You know, Marc, salt contamination could be a very significant problem. I'll admit I haven't read this last page of the thread too closely, but if you could point out any study (if you haven't already) that shows the dangers of salt contamination in groundwater? Perhaps the risk isn't as significant because the salt is more easily degraded by natural means.\n \n Now on to oil: Iif an aquifer is contaminated with hydrocarbons (even a small amount), it may be rendered unfit for human consumption for decades.\n http://www.mst.dk/publica/projects/2001/87-7944-367-2.htm\n -A bit technical, but has some useful information.\n \n And if you're still skeptical as to just how far water can travel underground, you really should read more about aquifers. Take, for example, the Ogallala Aquifer:\n http://www.npwd.org/Ogallala.htm\n It's one of the largest continuous aquifers in the world, and provides water to much of the region it covers. It's already facing problems with depletion. Imagine if a groundwater supply this large were contaminated.", 
   {}, 
   140589, 
   null, 
   1119600600.0
  ], 
  [
   140661, 
   null, 
   "Platypus", 
   "Millions to one? Where did you get that precision comparision?\n\n Those are the kinds of toxicity differences that exist in the real world. Try learning something about the world around you - i.e. grow up.\n \nDisregarding who loses, or gains liberty / money?\n\n I never said that, so you're fighting yet another strawman. Grow up.\n \nWhen it comes to big vs. small domestic government, they ARE tied together. You and I probably have different definitions of \"rational\" people.\n\n Absolutely.\n \nDomestically, assuming nothing bad will happen and being wrong, is often far less costly\n\n Assertion without proof, and untrue. Grow up.\n \nWho should I trust to give me the history lesson? The EPA?\n\n There are plenty of other sources. Grow up.\n \nThey do in a society where people vote, write congressmen, post on message boards, and own guns.\n\n Only in aggregate - i.e. statistically, as I pointed out. Grow up.\n \nPrivate business is far more likely to be destroyed by the U.S. legal system than is a government agency.\n\n Assertion without proof, and untrue. Grow up.\n \nNudged yes, destroyed, no.\n\n Nothing is being destroyed here (another strawman). Grow up.\n \nInstituted among men deriving their just powers from the consent of the governed. Who's really picking and choosing?\n\n Still you, since the government does have the consent of the governed as expressed through elections etc. Grow up.\n \nYou're giving me suggestions on where to live, and you're profile doesn't say where YOU live?\n\n Ad hominem. Grow up.\n \nWhy am I not surprised? I don't believe in American ideals? I've made my points using the text of the constitution far more than you have.\n\n Only in your dreams. Grow up.\n \nTranslating your sarcastic \"might know a thing or two\" into \"completely\" wasn't that far off.\n\n No, it's an almost complete misrepresentation and hence yet another strawman. Grow up.\n \nWould you trust Congress and the Supreme Court more than me if you found out that more than half of the U.S. population agreed with me?\n\n They don't, and appeal to popularity is a fallacy anyway. Grow up.\n \n \n \n That was the most immature post I've seen on a political forum in the last couple of years, Marc, containing absolutely nothing of any informative value. All you seem to have is strawmen, assertions without proof, and a grab bag of other fallacies, wrapped up in a condescension ill-justified in light of the fact that you have obviously not bothered to educate yourself on the matters you discuss. You've lost, pure and simple, but I know you'll never admit it and will try to have the last word nonetheless. Go find someone else to play that stupid little game; I have no more use for you even as entertainment.", 
   {}, 
   140589, 
   null, 
   1119619140.0
  ], 
  [
   140880, 
   null, 
   "Waxy", 
   "Once would be real nice. You haven't addressed it at all. You're very convincing about how bad petroleum is, but you've done nothing to show that salt is comparatively harmless.\n\n \n I've never claimed that salt was harmless. emoticon_confused\n \n Can you point out where I've stated that?\n \n You're arguing a strawman.\n \n I stated that your choice to compare to compare hyrdrocarbons and salt on a volume for volume basis was flawed, and that only minor amounts of hydrocarbon create toxicity, compared to relatively large volumes of road salt.\n \n I got my road salt info here - \n \n http://www.ec.gc.ca/substances/ese/eng/psap/final/roadsalts.cfm\n \n It's a gov't environmental agency, so you'll likely view it as useless.\n \n \nI suspect it could largely be due to current eating habits and exercise habits. 2/3 of Americans are said to be overweight today, as opposed to less than 1/2 in the early 60's. We can't blame everything on petroleum leaks from small businesses.\n\n \n Who said we could?\n \n \nIt's enough on petroleum, not enough on salt. The fourth one's table of problems and cures did include salt, however. Let's compare two of the proposed solutions from that link.\n \n On underground storage tanks,\n \n 4 big checkmarks - plenty of private property invaded, plenty of money spent.\n \n Now for road salt\n \n Three big failures. I noticed a wide open salt storage bin in Cincinnati right along I-75 just a week or so ago. The next two are an equal joke of course. In 1965-66, only 2 million tons of road salt were used all across the U.S. \n \n http://emml.mtu.edu/gem/community/publications/wellspring/deicingdebate.html\n \n Today, it's 15 million. What is going to stop it from increasing further? Why couldn't we cut back to 60's levels, for the environment? We have built more roads since the 60's but the percentage is fairly small. Except for the beltways and a few extensions, our interstate system was in place in the 60's. Instead of 2 million tons, why don't we allow for the extra roads and make it 3 million? A little more plowing, a little more dicipline in driving habits, we could even have a tax refund for 12 million tons of salt! It would be a drop in the bucket of course, but all the accumulated taxes that now cost us almost half of our income came one drop-in-the-bucket at a time. The public would grumble, but no more than they do at auto emissions testing. The big problem would be ~insurance lobbyists~, that's where the problem lies! Money & corruption - that's what causes the environmental double standard that you can't disprove.\n\n \n You seem to be operating under the two wrongs make a right method.\n \n I don't really see how the evils of salt have anything to do with the evils of hydrocarbon.\n \n You scream blue murder about salt, then in the same breath criticize regulations on hydrocarbons. (Some might call this hypocritical.) \n \n The real kicker is, you justify your opposition to hydrocarbons by pointing out how poorly we're dealing with salt.\n \n Can you honestly not see the flaw in that reasoning?\n \n \n \nIs this from one of your links above? From your second link;\n \n How can we know where \"fact\" ends, and evolutionary/environmental propaganda begins?\n\n \n emoticon_rolleyes \n \n I didn't know you were a creationist. That explains a lot - particularly your total lack of scientific knowledge.\n \n Here's a link to the Minnesota Geological Survey. Educate yourself.\n \n http://www.geo.umn.edu/mgs/\n \n \nExcept for rainwater, it's not really safe to drink any water from a stream or pond. You never know if a dead animal is rotting in the water up around the bend. Any water in a city water system is treated. The water entering a treatment plant can be dirty in varying degrees, and will come out the clean end safe to drink. It's not a band aid, water treatment plants can't be made cheaper just because the EPA says it's \"eliminated the source of the problem\". The EPA is never going to claim that anyway, there's always more to be done. If they ever permenantly \"eliminate\" pollutions sources, their funding could be in jeopardy.\n\n \n I'm sure you'll do your best to maintain the need for agencies like the EPA.\n \n Removing dissolved hydrocarbons, particularly benzene, toluene, etc... is VERY difficult to impossible, not to mention VERY expensive, and most water treatment facilities are not equipped to do so. \n \n If you want to pay the taxes to modify your water treatment plant so that Joe Sixpack can continue to dump petroleum on his private property, I guess that's your perogative. \n \n I perfer to nip the problem in the bud, it's cheaper that way.\n \n \nI know things that I personally experience a lot better than I know where warm, shallow seas were hundreds of millions of years ago. \n \n \n http://www.geo.umn.edu/mgs/\n \n You got a better explanation?\n \n \nNot just myself, but people collectively. People have a right to question why private pollution is bad, but government pollution is not a problem.\n\n \n Two wrongs make a right again.\n \n Not only that, but people are questioning gov't pollution.\n \n \nThey are a hint of plenty, because there is often NO DIFFERENCE between your posts and those of a rabid environmentalist. I did read through the \"global warming\" thread. It is amazing - you seemed like a different person there. In this thread, I can see no difference between your reasoning and the reasoning of a global warming alarmist.\n\n \n I think you must read every second word, and just fill in the blanks with inferences and whatever it is you want to hear.\n \n I've never been called a rabid environmentalist before, every I know would laugh out loud at that. If simply pointing out to someone with no knowledfe of the subject that hydrocarbon leaks are serious, have potentially far reaching affects, and need to be dealt with makes me a rabid environmentalist, then so be it. \n \n I consider it simple common sense, even self interest for the most part.\n \n \nBut you give them a FREE PASS on road salt? \n \n \n WHERE?\n \n Answer - in your head.\n \n From post #39 -\n \n \nI agree that all that road salt is bad for the environment.\n \n \n I simply compared levels of toxicity of salt and hydrocarbons, the rest is your imagination and twisted logic.\n \n \nOh no no no no no, I caught it, I just didn't say anything, I was being polite. :p So you're MORE LEARY of common sense and a free press, than most government agencies?? \n \n \n You obviously didn't catch it.\n \n Quit trying to put words in my mouth, you've been doing repeatedly and it's getting very tiresome. It's childish to say the least.\n \n \nIf I was running a filling station and wanted to be left alone, I probably would.\n\n \n As many on your side are so fond of saying - \"Don't let the door hit you on the way out, America love it or leave it.\"\n \n We both know there's no way in hell you'd voluntarily move to Mexico City, even if I bought you your very own gas station there.\n \n \nMy point is this ~ many people who work as an employee, on a tax withholding payroll, with benefits, vacation, sick days etc. can have a hard time understanding why a service they require (a roof on their house, a major repair on their car) requires them to pay 4 or 5 times their own hourly rate to a worker/workers who very well may be less skilled than they themselves are. They don't understand normal business operating expences, let alone operating expences involved in a government as large as the U.S. currently is. I've been reading your posts long enough to know you have a grasp of it, but your comment about 6 months to a year being plenty of time for a one or two man business to scare up six figures didn't indicate it.\n\n \n Do you get a lifetime to pay your traffic fines?\n \n These people faced a hard slog no doubt, but they had plenty of gov't assistance - loans, grants, etc... and I find it hard to believe that they weren't aware their tanks were leaking. They should have been planning on the refit.\n \n If you've got the experience you claim to have, you know darn well that they were aware of the leaking tanks - you don't just have profit disappear into the ground and not know it.\n \n Regardless, it's the cost of doing business. People make money, people lose money. I never enjoy watching someone lose their life savings or suffer, but it's a simple reality. Given your political and economic leanings, I would have thought you'd embrace the concept.\n \n \nMuch of the U.S. could be considered fanatical according to you. One of our founders said \"when the government fears the people, there is liberty. When the people fear the government, there is tyranny. \n \n \n No they couldn't. Most of the USA, at least I hope, wouldn't condone or at least \"understand\" killing the messenger when they didn't like the message.\n \n You can vote them out of office any time you like.\n \n \nHaven't had a chance to do that yet. Did some checking on salt though - it seems to be a REAL problem. I won't bother to link you - I'm sure you know about it.\n\n \n I do actually.\n \n Unlike you, I like to know a little something about a subject before I presume to form an opinion and speak about it.\n \n Waxy", 
   {}, 
   140567, 
   null, 
   1119655440.0
  ], 
  [
   141251, 
   null, 
   "marc9000", 
   "You know, Marc, salt contamination could be a very significant problem. I'll admit I haven't read this last page of the thread too closely, but if you could point out any study (if you haven't already) that shows the dangers of salt contamination in groundwater? Perhaps the risk isn't as significant because the salt is more easily degraded by natural means. \n\n \n Here are two reasonable looking ones.\n \n http://www.forester.net/sw_0107_environmental.html\n \n \nRoad salt, however, is a pollutant that received little attention in the Watershed Agreement. Aside from a partnership program in which New York City pays to construct salt and sand storage facilities in watershed towns, road salt is not specifically regulated in the Watershed Agreement. \n\n Could this be a sign of corruption? The insurance industry loves road salt.\n \n \n \n \n http://emml.mtu.edu/gem/community/publications/wellspring/deicingdebate.html\n \n \nDespite these known cases of road-salt contamination, MTU GEM staff were surprised by the extent to which the public and decision makers perceive road salt to be a major source of groundwater pollution. In our 1992 groundwater awareness survey of 170 county fair-goers, road salt was ranked as the most serious groundwater contaminant, ahead of the other choices: gasoline/oil, bacteria, pesticides, solvents, and nitrates. Similarly, the 105 respondents to our 1992 water resources needs assessment ranked road salt second only to gasoline/oil. \n\n \n \n \n \n Now on to oil: Iif an aquifer is contaminated with hydrocarbons (even a small amount), it may be rendered unfit for human consumption for decades.\n http://www.mst.dk/publica/projects/2001/87-7944-367-2.htm\n -A bit technical, but has some useful information.\n \n And if you're still skeptical as to just how far water can travel underground, you really should read more about aquifers. Take, for example, the Ogallala Aquifer:\n http://www.npwd.org/Ogallala.htm\n It's one of the largest continuous aquifers in the world, and provides water to much of the region it covers. It's already facing problems with depletion. Imagine if a groundwater supply this large were contaminated.\n\n \n I don't disregard this information, but I'd like for the general public to do the imagining. Almost all environmental decisions are political. It would be nice if they weren't, but we can't change it. They should be decided in a political way IMO.", 
   {}, 
   140627, 
   null, 
   1119767340.0
  ], 
  [
   141267, 
   null, 
   "marc9000", 
   "I've never claimed that salt was harmless. emoticon_confused\n \n Can you point out where I've stated that?\n \n You're arguing a strawman.\n \n I stated that your choice to compare to compare hyrdrocarbons and salt on a volume for volume basis was flawed, and that only minor amounts of hydrocarbon create toxicity, compared to relatively large volumes of road salt.\n \n I got my road salt info here - \n \n http://www.ec.gc.ca/substances/ese/eng/psap/final/roadsalts.cfm\n \n It's a gov't environmental agency, so you'll likely view it as useless. \n\n \n I don't think my comparing them on a volume for volume basis is flawed because salt use continues to go up. Legitimate EPA actions (yes I think there are a few, and market forces (newer tech tanks, and avoidance of waste) should hold the line, or improve petroleum pollution.\n \n \n \n \nWho said we could? \n\n \n You, with this;\n \n \nIt's soluble components in gasoline (benzene, toluene, etc...) that are the most toxic, and the most mobile.\n \n Ever wonder why cancer rates are on the rise? \n\n \n \n \n \nYou seem to be operating under the two wrongs make a right method.\n \n I don't really see how the evils of salt have anything to do with the evils of hydrocarbon.\n \n You scream blue murder about salt, then in the same breath criticize regulations on hydrocarbons. (Some might call this hypocritical.) \n \n The real kicker is, you justify your opposition to hydrocarbons by pointing out how poorly we're dealing with salt.\n \n Can you honestly not see the flaw in that reasoning? \n\n \n No I can't. Most other government agencies have to consistently do their job. Police can't obviously fight crime on one side of the city, and let it go on the other side. Firemen can't let buildings burn on one side of the city only. The EPA should address pollution consistently, in keeping with political guidelines. When our fourth amendment says \"reasonable\", I don't think it means \"reasonable according to an unelected bureaucracy\".\n \n \n \n emoticon_rolleyes \n \n I didn't know you were a creationist. That explains a lot - particularly your total lack of scientific knowledge.\n \n Here's a link to the Minnesota Geological Survey. Educate yourself.\n \n http://www.geo.umn.edu/mgs/\n\n \n You didn't know, with the New Testament verse in my sig, and my angelic disposition? :p \n \n \n \n \nI'm sure you'll do your best to maintain the need for agencies like the EPA.\n \n Removing dissolved hydrocarbons, particularly benzene, toluene, etc... is VERY difficult to impossible, not to mention VERY expensive, and most water treatment facilities are not equipped to do so. \n\n \n Are they equipped to TEST it, or are they just assuming it might be there it they don't get their regulations passed?\n \n \n \n \n \nhttp://www.geo.umn.edu/mgs/\n \n You got a better explanation? \n\n \n Yes, the book of Genesis.\n \n \n \n \nTwo wrongs make a right again.\n \n Not only that, but people are questioning gov't pollution. \n\n \n I'll be watching for it on the front page of the NY Times. emoticon_rolleyes \n \n \n \n \n \n \nWHERE?\n \n Answer - in your head.\n \n From post #39 - \n \n I simply compared levels of toxicity of salt and hydrocarbons, the rest is your imagination and twisted logic. \n\n \n And in your comparison, you claim it's insignificant compared to petroleum. Close to a free pass. \n \n \n \n \nYou obviously didn't catch it.\n \n Quit trying to put words in my mouth, you've been doing repeatedly and it's getting very tiresome. It's childish to say the least. \n \n \n \nIt's a gov't environmental agency, so you'll likely view it as useless.\n \n I'm sure you \"know\" a lot of things are true. \n\n \n Quit putting words in my mouth!! emoticon_cry \n \n \n \nAs many on your side are so fond of saying - \"Don't let the door hit you on the way out, America love it or leave it.\"\n \n We both know there's no way in hell you'd voluntarily move to Mexico City, even if I bought you your very own gas station there. \n\n \n You're right about that! :) Too hot down there anyway.\n \n \n \n \nDo you get a lifetime to pay your traffic fines?\n \n These people faced a hard slog no doubt, but they had plenty of gov't assistance - loans, grants, etc... and I find it hard to believe that they weren't aware their tanks were leaking. They should have been planning on the refit.\n \n If you've got the experience you claim to have, you know darn well that they were aware of the leaking tanks - you don't just have profit disappear into the ground and not know it.\n \n Regardless, it's the cost of doing business. People make money, people lose money. I never enjoy watching someone lose their life savings or suffer, but it's a simple reality. Given your political and economic leanings, I would have thought you'd embrace the concept. \n\n \n I embrace the concept when it's market forces, not government commands.\n \n \n \n \nNo they couldn't. Most of the USA, at least I hope, wouldn't condone or at least \"understand\" killing the messenger when they didn't like the message. \n\n \n Makes it harder for them to find \"messengers\". \n \n \nYou can vote them out of office any time you like. \n\n \n The U.S. passed that point of simplicity several decades ago.\n \n \n \n \n I do actually.\n \n Unlike you, I like to know a little something about a subject before I presume to form an opinion and speak about it.\n \n Waxy\n\n \n As I said to Fishbulb, it would be nice if environmentalism wasn't political. But we can't change the fact that it is. Environmentalists have largely made it that way, and they must be dealt with politically.", 
   {}, 
   140880, 
   null, 
   1119770580.0
  ], 
  [
   141360, 
   null, 
   "Fishbulb", 
   "Here are two reasonable looking ones.\n \n http://www.forester.net/sw_0107_environmental.html\n\n \n That article is primarily focused on surface water contamination. While those issues are important, what we're discussing here is groundwater. The article only mentions groundwater as a tributary to surface watersheds. Not to mention that it's 4 years old. I wouldn't be surprised if New York is now using newer techniques mentioned in the article. I'll admit that road salt isn't a good thing, but you have yet to show that it's more hazardous than hydrocarbons. There is absolutely NO WAY to remove hydrocarbons from groundwater. Once they're there, you'd better look for a new water source.\n \n \n Interestingly enough, there's an article in this month's National Geographic about Natural Gas being drilled from public land. It's really an interesting read.", 
   {}, 
   141267, 
   null, 
   1119818880.0
  ], 
  [
   141411, 
   null, 
   "Waxy", 
   "I don't think my comparing them on a volume for volume basis is flawed because salt use continues to go up. Legitimate EPA actions (yes I think there are a few, and market forces (newer tech tanks, and avoidance of waste) should hold the line, or improve petroleum pollution.\n\n \n And hydrocarbon use is going down?\n \n All of that info on hydrocarbon pollution that has been supplied to you, and you're still at step one. What was the point of these last 3 pages?\n \n That's called being purposely ignorant.\n \n \nYou, with this;\n\n \n You understand that something can be an important contributing factor without being THE ONLY factor right?\n \n Please read what's there.\n \n Honestly, this shouldn't be so difficult. emoticon_frazzled \n \n \nNo I can't. Most other government agencies have to consistently do their job. Police can't obviously fight crime on one side of the city, and let it go on the other side. Firemen can't let buildings burn on one side of the city only. The EPA should address pollution consistently, in keeping with political guidelines. When our fourth amendment says \"reasonable\", I don't think it means \"reasonable according to an unelected bureaucracy\".\n\n \n Then there's no point in continuing this debate. You reason at the level of a child. \"Well Jimmy gets to do it, so I should be able to do it too.\" \n \n You're either being intentionally ignorant, or you are truly incapable of understanding basic reasoning and logic. At this point, I'm not sure which one it is, but I'm starting to favour one over the other.\n \n \nYou didn't know, with the New Testament verse in my sig, and my angelic disposition? :p \n \n \n No, you're quite typical. YEC's are a somewhat rare \"kind\" though.\n \n \nAre they equipped to TEST it, or are they just assuming it might be there it they don't get their regulations passed?\n\n \n Most major centers in Canada are equipped to test for it, I would assume that not all water treatment plants have the capability though.\n \n Errr on the side of caution? No, too expensive. emoticon_rolleyes \n \n \nYes, the book of Genesis.\n\n \n emoticon_rolleyes :p \n \n Drop by the Creation vs. Evolution forum, I'd love to have a go at you there. :p \n \n \nAnd in your comparison, you claim it's insignificant compared to petroleum. Close to a free pass. \n \n \n The difference is, I backed up my comparison/claim. You just offer opinion.\n \n On top of that, as I've already pointed out SEVERAL TIMES, I never gave salt a free pass, I simply pointed out the differences in volumes of the two materials that are required to create toxic conditions. \n \n That's the last time I'm going to repeat that for you.\n \n \nQuit putting words in my mouth!! emoticon_cry \n \n \n You truly are immature.\n \n \nYou're right about that! :) Too hot down there anyway.\n\n \n Yeah, I'm sure it's the heat. emoticon_rolleyes \n \n \nI embrace the concept when it's market forces, not government commands.\n\n \n I've demonstrated for you repeatedly how the concept operates under \"market forces\", again, you've chosen to remain purposely ignorant. \n \n Unfortunately, theory and reality often don't jive.\n \n \nThe U.S. passed that point of simplicity several decades ago.\n\n \n Has it really? Or has the complacency factory just risen dramatically?\n \n Or, what if, a majority of people actually support what the EPA is doing? emoticon_wow\n \n \nAs I said to Fishbulb, it would be nice if environmentalism wasn't political. But we can't change the fact that it is. Environmentalists have largely made it that way, and they must be dealt with politically.\n\n \n I agree, it's unfortunate that the free market and capitalism are incapable of regulating themselves and having the foresight to protect the environment, therefore requiring that environmental protection become governmental and political in nature.\n \n Waxy", 
   {}, 
   141267, 
   null, 
   1119827460.0
  ], 
  [
   142269, 
   null, 
   "marc9000", 
   "That article is primarily focused on surface water contamination. While those issues are important, what we're discussing here is groundwater. The article only mentions groundwater as a tributary to surface watersheds. Not to mention that it's 4 years old. I wouldn't be surprised if New York is now using newer techniques mentioned in the article. I'll admit that road salt isn't a good thing, but you have yet to show that it's more hazardous than hydrocarbons. \n\n \n I think it's common sense that in a large enough volume, salt can be worse than small enough amounts of hydrocarbons. There has to be a microscopic measurement of hydrocarbons that is too small to harm humans. No one here has shown that there is not.\n \n In this link that I posted earlier;\n \n http://www.cincypost.com/2003/02/20/salt022003.html\n \n it has these two quotes from two different people;\n \n \n \n\"We don't have an environmental issue here with rock salt,\" she said. \n \n \"The most important thing is to provide safe roads,\" he said. \"That comes before all else. \n\n \n Notice that these two people didn't say they thought salt wasn't harmful. They were saying that they didn't care if salt was harmful - something else, completely unrelated to environmentalism, trumped it. Environmentalism is largely political.\n \n \n \n \nThere is absolutely NO WAY to remove hydrocarbons from groundwater. Once they're there, you'd better look for a new water source. \n\n \n Unless you know that they exist in microscopic amounts too low to harm humans.\n \n \n \n \nInterestingly enough, there's an article in this month's National Geographic about Natural Gas being drilled from public land. It's really an interesting read.\n\n \n I'll see if I can find it when I have time.", 
   {}, 
   141360, 
   null, 
   1120012080.0
  ], 
  [
   142280, 
   null, 
   "marc9000", 
   "And hydrocarbon use is going down? \n\n \n No, but there is a difference in how hydrocarbons in fuel, and road salt are USED. The only time hydrocarbons GET in groundwater is when it's not being used in it's normal way, it's either spilled accidentally, or carelessly dumped. Salt gets in groundwater when it's used in it's normal, intended way - dumped on the roads. So newer tech tanks and avoidance of waste should help hydrocarbon pollution to go down. Politics has caused road salt use to go UP, and it's not being addressed.\n \n \n \nYou understand that something can be an important contributing factor without being THE ONLY factor right?\n \n Please read what's there.\n \n Honestly, this shouldn't be so difficult. emoticon_frazzled \n\n \n When we have \"can be a factor without being the only factor\", we're doing a lot of guesswork. Too much to allow elites to destroy liberty, IMO.\n \n \n \n \nThen there's no point in continuing this debate. You reason at the level of a child. \"Well Jimmy gets to do it, so I should be able to do it too.\" \n\n \n You're right, there's not much point in continuing this debate - this analogy tells volumes about you. You consider government to be like a \"parent\", and citizens who question it's stepping outside of it's authorized bounds as \"children\". You'll deny it, but you did. I'll be glad to repost it in perfect order if you'd like.\n \n \n \n \n \nDrop by the Creation vs. Evolution forum, I'd love to have a go at you there. :p \n\n \n That's understandable. If one feels defeated on one subject, he may tend to seek another subject he feels he has a better chance at. I seldom if ever look at the Creation vs. Evolution forum - I prefer subjects relating to ever changing politics and current events. But I'll do some checking at that forum. If I can find an avenue of Creation vs. Evolution that hasn't already been flogged to death there, you may get your wish. :) \n \n \n \nThe difference is, I backed up my comparison/claim. You just offer opinion.\n \n On top of that, as I've already pointed out SEVERAL TIMES, I never gave salt a free pass, I simply pointed out the differences in volumes of the two materials that are required to create toxic conditions. \n\n \n With projections of future volumes, as one goes up and the other stays the same or goes down?\n \n \n \n \n \n \nHas it really? Or has the complacency factory just risen dramatically? \n\n \n Yes, complacency has risen - that's a large part of it.\n \n \nOr, what if, a majority of people actually support what the EPA is doing? emoticon_wow \n\n \n They do, unless they clearly see their personal cost, and can't clearly see any result. The EPA must play politics to see that it doesn't happen too much.\n \n \n \n \nI agree, it's unfortunate that the free market and capitalism are incapable of regulating themselves and having the foresight to protect the environment, therefore requiring that environmental protection become governmental and political in nature.\n \n Waxy\n\n \n Yes, you made that clear above. Free market / capitalism = children. Government = parent.", 
   {}, 
   141411, 
   null, 
   1120014420.0
  ], 
  [
   142500, 
   null, 
   "Waxy", 
   "No, but there is a difference in how hydrocarbons in fuel, and road salt are USED. The only time hydrocarbons GET in groundwater is when it's not being used in it's normal way, it's either spilled accidentally, or carelessly dumped. Salt gets in groundwater when it's used in it's normal, intended way - dumped on the roads. So newer tech tanks and avoidance of waste should help hydrocarbon pollution to go down. Politics has caused road salt use to go UP, and it's not being addressed.\n\n \n No argument here.\n \n \nWhen we have \"can be a factor without being the only factor\", we're doing a lot of guesswork. Too much to allow elites to destroy liberty, IMO.\n\n \n Unreal. Those darn elites again. emoticon_mad :p \n \n Where's the guesswork? Benzene, toluence, etc... are PROVEN CARCINOGENS. Some of the most carcinogenic compounds we know of. \n \n Alcohol is a factor in many car accidents. It may not be the only factor, ie speed, road conditions, driver skill, a deer, etc... can all be factors in an accident in addition to alcohol.\n \n Does that mean then that we should just ignore alcohol as key factor?\n \n Again, this shows a complete lack of basic reasoning and logic on your part.\n \n \nYou're right, there's not much point in continuing this debate - this analogy tells volumes about you. You consider government to be like a \"parent\", and citizens who question it's stepping outside of it's authorized bounds as \"children\". You'll deny it, but you did. I'll be glad to repost it in perfect order if you'd like.\n\n \n LMAO. Yeah, that's exactly the subliminal message I was trying to get across. :p \n \n You're a real piece of work marc9000. :p \n \n Please do repost it \"in perfect order\". Should be good for a laugh, or at the least, some insight into how your mind works.\n \n By pointing out the childishness of your reasoning with an intentionally simple analogy, I somehow defined the gov't as the \"parent\" and the people as \"children\". \n \n ROFLMAO. Again, unreal. \n \n \nThat's understandable. If one feels defeated on one subject, he may tend to seek another subject he feels he has a better chance at. \n \n \n Ohhh man, this just keeps getting better. :p \n \n ARE YOU KIDDING?\n \n You actually think you've won this debate? LOL. \n \n Maybe some readers would care to comment. :p \n \n \nI seldom if ever look at the Creation vs. Evolution forum - I prefer subjects relating to ever changing politics and current events. But I'll do some checking at that forum. If I can find an avenue of Creation vs. Evolution that hasn't already been flogged to death there, you may get your wish. :) \n \n \n Despite my favourite definition of insanity (stolen from Einstein), I may give it whirl.\n \n \nThey do, unless they clearly see their personal cost, and can't clearly see any result. The EPA must play politics to see that it doesn't happen too much.\n\n \n You're right, everyone in the USA that supports the EPA is an idiot with no knowledge of the subject. On top of that, the EPA is so powerful, that it maintains its conspiracy of lies and deceit over the entire population with ease.\n \n Only people such as yourself see through their evil conspiracy and truly understand and object. emoticon_rolleyes \n \n \nYes, you made that clear above. Free market / capitalism = children. Government = parent.\n\n \n emoticon_xclown :p \n \n Waxy", 
   {}, 
   142280, 
   null, 
   1120062660.0
  ], 
  [
   142787, 
   null, 
   "marc9000", 
   "No argument here. \n\n \n So that means I won? :p \n \n \n \n \nUnreal. Those darn elites again. emoticon_mad :p \n \n Where's the guesswork? Benzene, toluence, etc... are PROVEN CARCINOGENS. Some of the most carcinogenic compounds we know of. \n\n \n The guesswork is in the AMOUNTS. How much is spilled, and how many proven carcinogens make it to our drinking glasses.\n \n \nAlcohol is a factor in many car accidents. It may not be the only factor, ie speed, road conditions, driver skill, a deer, etc... can all be factors in an accident in addition to alcohol.\n \n Does that mean then that we should just ignore alcohol as key factor? \n\n \n Apples & oranges. Drinking alcohol before driving is easily identified if a wreck happens. If someone gets cancer, it's more difficult to accuse private owners of old filling stations.\n \n \n \nLMAO. Yeah, that's exactly the subliminal message I was trying to get across. :p \n \n You're a real piece of work marc9000. :p \n \n Please do repost it \"in perfect order\". Should be good for a laugh, or at the least, some insight into how your mind works.\n \n By pointing out the childishness of your reasoning with an intentionally simple analogy, I somehow defined the gov't as the \"parent\" and the people as \"children\". \n \n ROFLMAO. Again, unreal. \n\n \n \nYou seem to be operating under the two wrongs make a right method.\n \n I don't really see how the evils of salt have anything to do with the evils of hydrocarbon.\n \n You scream blue murder about salt, then in the same breath criticize regulations on hydrocarbons. (Some might call this hypocritical.) \n \n The real kicker is, you justify your opposition to hydrocarbons by pointing out how poorly we're dealing with salt.\n \n Can you honestly not see the flaw in that reasoning? \n\n \n \n]No I can't. Most other government agencies have to consistently do their job. Police can't obviously fight crime on one side of the city, and let it go on the other side. Firemen can't let buildings burn on one side of the city only. The EPA should address pollution consistently, in keeping with political guidelines. When our fourth amendment says \"reasonable\", I don't think it means \"reasonable according to an unelected bureaucracy\".\n\n \n \nThen there's no point in continuing this debate. You reason at the level of a child. \"Well Jimmy gets to do it, so I should be able to do it too.\" \n\n \n Nothing subliminal at all, it's right there for all to see. Jimmy is insurance companies and municipalities and salt companies, and I'm an old filling station owner. And my parents the EPA tells me, \"We're your parents, and you'll do as we say. Some day you'll understand why Jimmy the rich one gets different treatment than you the poor one. Why should we let you do what Jimmy does? Two wrongs don't make a right you know.\"\n \n \n \n \n \nOhhh man, this just keeps getting better. :p \n \n ARE YOU KIDDING?\n \n You actually think you've won this debate? LOL. \n \n Maybe some readers would care to comment. :p \n\n \n Well, you gotta admit it was a good line. You led me right into it.\n \n There's seldom a winner in non-judged debates. We've each made our good points. You think you've made more good points than me, and I KNOW I've made more good points than you. :p \n \n \n \n \nDespite my favourite definition of insanity (stolen from Einstein), I may give it whirl.\n \n \n \n You're right, everyone in the USA that supports the EPA is an idiot with no knowledge of the subject. On top of that, the EPA is so powerful, that it maintains its conspiracy of lies and deceit over the entire population with ease.\n \n Only people such as yourself see through their evil conspiracy and truly understand and object. \n\n \n You may be more guilty than me of exaggerating oponents positions.\n \n \nLegitimate EPA actions (yes I think there are a few, \n", 
   {}, 
   142500, 
   null, 
   1120098900.0
  ], 
  [
   143033, 
   null, 
   "Waxy", 
   "Apples & oranges. Drinking alcohol before driving is easily identified if a wreck happens. If someone gets cancer, it's more difficult to accuse private owners of old filling stations.\n\n \n You do understand analogies right? \n \n a·nal·o·gy ( P ) Pronunciation Key (-nl-j)\n n. pl. a·nal·o·gies \n \n Similarity in some respects between things that are otherwise dissimilar. \n A comparison based on such similarity. See Synonyms at likeness. \n Biology. Correspondence in function or position between organs of dissimilar evolutionary origin or structure. \n A form of logical inference or an instance of it, based on the assumption that if two things are known to be alike in some respects, then they must be alike in other respects. \n Linguistics. The process by which words or morphemes are re-formed or created on the model of existing grammatical patterns in a language, often leading to greater regularity in paradigms, as evidenced by helped replacing holp and holpen as the past tense and past participle of help on the model of verbs such as yelp, yelped, yelped. \n \n analogy\n \n n 1: an inference that if things agree in some respects they probably agree in others 2: drawing a comparison in order to show a similarity in some respect; \"the operation of a computer presents and interesting analogy to the working of the brain\"; \"the models show by analogy how matter is built up\" 3: the religious belief that between creature and creator no similarity can be found so great but that the dissimilarity is always greater; language can point in the right direction but any analogy between God and humans will always be inadequate [syn: doctrine of analogy] [ant: apophatism, cataphatism]\n \n \nNothing subliminal at all, it's right there for all to see. Jimmy is insurance companies and municipalities and salt companies, and I'm an old filling station owner. And my parents the EPA tells me, \"We're your parents, and you'll do as we say. Some day you'll understand why Jimmy the rich one gets different treatment than you the poor one. Why should we let you do what Jimmy does? Two wrongs don't make a right you know.\"\n\n \n LOL. :p :p \n \n Try as I might, and I read this over several times, I can't wrap my head around the way your mind works. emoticon_frazzled \n \n My post was simply an analogy for the method of reasoning you're using, (I use that term loosely.) and pointing out the futility in trying to have a debate with someone that reasons in that manner.\n \n It has nothing to do with parents, the EPA, insurance companies, etc... We could be talking about Star Wars, the simply analogy of your reasoning would remain the same. You reason like a child. \n \n \"Two wrongs make a right.\" \n \n \"If Bill can do it, why can't I.\" \n \n \"All the cool kids are doing, so I want to do it too.\"\n \n Most, apparently not all, people grow out of that pattern of thinking somewhere around the age of 12, definitely by the time they've graduated from high school. It has to do with the ability to think critically and understand basic logic.\n \n However, somewhere along the line you pulled out your George Lucas sized imagination and put \"parents=gov't\" and \"kids=citizens\" into the equation. \n \n Good thing I didn't say you reasoned like someone that's mildly retarded, every citizen would then be mildly retarded and the gov't would be a mental institution. :p \n \n \nThere's seldom a winner in non-judged debates. We've each made our good points. You think you've made more good points than me, and I KNOW I've made more good points than you. :p \n \n \n Like I said earlier, I'm sure you \"know\" a lot of things.\n \n \nYou may be more guilty than me of exaggerating oponents positions.\n\n \n Now that you put me on to, I can see how much fun it is, and how much easier it makes debating.\n \n Waxy", 
   {}, 
   142787, 
   null, 
   1120149480.0
  ], 
  [
   143310, 
   null, 
   "jskufan", 
   "\n Nothing subliminal at all, it's right there for all to see. Jimmy is insurance companies and municipalities and salt companies, and I'm an old filling station owner. And my parents the EPA tells me, \"We're your parents, and you'll do as we say. Some day you'll understand why Jimmy the rich one gets different treatment than you the poor one. Why should we let you do what Jimmy does? Two wrongs don't make a right you know.\"\n \n \n\n \n You keep trying to compare the use of road salts by municipalities to the efforts of the EPA to regulate non-complying automobiles and the isolated cases of petroleum products leaking into the soil from underground storage tanks. While it's true that they're all forms of pollutants, salt is dispersed with the consent of the masses in an attempt to minimize injuries from slippery conditions that would otherwise claim the lives of many drivers on our roadways. People accept the possible downside of salt runoff because the alternative would require closing major roadways for extended periods every time the temperature drops below freezing. This in turn would trigger horrendous economical hardship and public safety concerns for most everyone living in the affected regions. Again, the key point here is the government is applying the salt with the approval of their constituents. Your comparisons are all examples of private citizens and companies that are polluting community resources because they either can't or won't conform to modern day safe storage practices. As for the older, non-complying automobiles, maybe they should have been \"grandfathered\" but I guess the question is: How long???", 
   {}, 
   142787, 
   null, 
   1120180800.0
  ], 
  [
   143771, 
   null, 
   "marc9000", 
   "You do understand analogies right? \n\n \n Yes, I do. I also understand how they can easily become false analogies. That's when two things are too dissimilar to be compared, or when the differences make the comparison weak. \n \n \n \nLOL. :p :p \n \n Try as I might, and I read this over several times, I can't wrap my head around the way your mind works. emoticon_frazzled \n\n \n Maybe this will help you.\n \n http://www.ushistory.org/declaration/document/index.htm\n \n The 12th paragraph down;\n \nHe has erected a multitude of New Offices, and sent hither swarms of Officers to harass our people and eat out their substance. \n\n \n Pretty amazing isn't it? Was this paragraph about today's EPA? Or have tyrannical procedures not changed much over the centuries?\n \n Do you have equal problems wrapping your head around the U.S. government's foundation? Do you believe the signers of the Declaration of Independence reasoned like children? emoticon_confused It's more than just a rant. I think it's more than just an explaination of why the U.S. decided to revolt against England. They may have considered it a good guideline for future generations to use, to compare future government to what they revolted from. \n \n \n \n \nMy post was simply an analogy for the method of reasoning you're using, (I use that term loosely.) and pointing out the futility in trying to have a debate with someone that reasons in that manner.\n \n It has nothing to do with parents, the EPA, insurance companies, etc... We could be talking about Star Wars, the simply analogy of your reasoning would remain the same. You reason like a child. \n \n \"Two wrongs make a right.\" \n \n \"If Bill can do it, why can't I.\" \n \n \"All the cool kids are doing, so I want to do it too.\"\n \n Most, apparently not all, people grow out of that pattern of thinking somewhere around the age of 12, definitely by the time they've graduated from high school. It has to do with the ability to think critically and understand basic logic.\n \n However, somewhere along the line you pulled out your George Lucas sized imagination and put \"parents=gov't\" and \"kids=citizens\" into the equation. \n\n \n No I didn't, I read your posts, containing your false analogies. Both of your imaginary children, Jimmy and Bill, are questioning the authority in their lives (parents) I'm questioning the authority in my life (government) But the questioners, and authorities, are too different to be compared. It was the same in your drunk driver vs. property owner false analogy. \n \n \nGood thing I didn't say you reasoned like someone that's mildly retarded, every citizen would then be mildly retarded and the gov't would be a mental institution. :p \n\n \n Yes, it's a very good thing you didn't say that. Because if you did, it would be obvious that you've run completely out of substance, and now have nothing but personal insults. \n \n You have a good fourth of July weekend - remember the reason for the season! emoticon_idea", 
   {}, 
   143033, 
   null, 
   1120272240.0
  ], 
  [
   143783, 
   null, 
   "marc9000", 
   "You keep trying to compare the use of road salts by municipalities to the efforts of the EPA to regulate non-complying automobiles and the isolated cases of petroleum products leaking into the soil from underground storage tanks. While it's true that they're all forms of pollutants, salt is dispersed with the consent of the masses in an attempt to minimize injuries from slippery conditions that would otherwise claim the lives of many drivers on our roadways. \n\n \n Hello to another ol FTE guy - it's been awhile!\n \n I don't think it's dispersed with the consent of the masses as much as it's dispersed at the order of the insurance lobby. \n \n \n \nPeople accept the possible downside of salt runoff because the alternative would require closing major roadways for extended periods every time the temperature drops below freezing. This in turn would trigger horrendous economical hardship and public safety concerns for most everyone living in the affected regions. \n\n \n That's because the people are uninformed. We use 15 million tons per year today, as opposed to 10 million in 1983, and 2 million in the mid 60's. In the mid 60's, we didn't have many major roadways closed, economical hardships or public safety concerns. With increasing government, we've grown increasingly spoiled. There don't seem to be any plans to hold the line on 15 million tons/year. How long before it reaches 20 million, then 25 million, year in and year out? If a new discovery is made that it's more harmful than we thought, will we hear about it, or will the insurance lobby increase political contributions?\n \n \n \n Again, the key point here is the government is applying the salt with the approval of their constituents. Your comparisons are all examples of private citizens and companies that are polluting community resources because they either can't or won't conform to modern day safe storage practices. \n\n \n Modern day practices? \"New offices, sending hither swarms of officers\"? As long as the swarms aren't too obvious to too many people. It's the main reason EPA vehicles aren't marked. The main reason auto emission testing hasn't (yet) gone national. Incrementalism works.\n \n \n \n As for the older, non-complying automobiles, maybe they should have been \"grandfathered\" but I guess the question is: How long???\n\n \n In a free society, very simple, as long as they last. They won't last forever. If there weren't so many government regulations on car manufacturers, more people would be able to afford newer cars.", 
   {}, 
   143310, 
   null, 
   1120274220.0
  ], 
  [
   143848, 
   null, 
   "jskufan", 
   "Hello to another ol FTE guy - it's been awhile!\n \n \n\n \n Hello back at you! ;) \n \n Marc, you don't have to convince me that there are great inequalities of justice that occur in our government. I guess the other side of the coin is that despite how strongly we feel on an issue, we live in a society where the majority gets the last say. Something may not appear to be moral, logical, or prudent, but if 51% of Americans believe it (theoretically), it's probably going to become law. I agree with you that the EPA, like a lot of other government agencies, is inefficient, bloated, and has the propensity to outstretch its boundaries and infringe on individuals rights. I do, however, disagree that industry and the individual citizen are capable of regulating themselves when it comes to doing the right thing with respect to the environment. All we have to do is roll the clock back several years ago and witness all the cleanup efforts of our lakes, rivers, and neighborhoods from the many years of unregulated pollution that occurred before we started holding people accountable. Just travel outside the United States and you'll get all the proof you need. For an industrialized nation, I suppose there is always a fine line between too much, and too little. Too much regulation and we stifle industry, too little and we pay the price with health concerns. I guess it's like a swinging pendulum that has to settle somewhere in the middle.", 
   {}, 
   143783, 
   null, 
   1120321860.0
  ], 
  [
   144092, 
   null, 
   "marc9000", 
   "Well said Jskufan, but I think things would be different if 51% of todays Americans appreciated their freedom as much as 51% of Americans did in 1776. Or if today's 51% had the more unselfish 200 year old values that told them by standing up for their neighbors freedoms, they helped retain their own freedoms. Here's another paragraph from the Declaration of Independence;\n \n \nFor suspending our own Legislatures, and declaring themselves invested with power to legislate for us in all cases whatsoever.\n\n \n Kind of reminds you of the recent Supreme Court ruling on eminent domain, doesn't it? How many of America's 51% notices? The same amount that notices questionable EPA activities?", 
   {}, 
   140661, 
   null, 
   1120421580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Boy would this stick in the craws of Liberals....", 
  "url": "http://www.4forums.com/political/politics-debates/5495-boy-would-stick-craws-liberals.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 5495, 
  "discussion_files": [
   [
    "15681.html", 
    "http://www.4forums.com/political/politics-debates/5495-boy-would-stick-craws-liberals-print.html"
   ], 
   [
    "15682.html", 
    "http://www.4forums.com/political/politics-debates/5495-boy-would-stick-craws-liberals-6-print.html"
   ], 
   [
    "15683.html", 
    "http://www.4forums.com/political/politics-debates/5495-boy-would-stick-craws-liberals-4-print.html"
   ], 
   [
    "15684.html", 
    "http://www.4forums.com/political/politics-debates/5495-boy-would-stick-craws-liberals-5-print.html"
   ], 
   [
    "15685.html", 
    "http://www.4forums.com/political/politics-debates/5495-boy-would-stick-craws-liberals-3-print.html"
   ], 
   [
    "15686.html", 
    "http://www.4forums.com/political/politics-debates/5495-boy-would-stick-craws-liberals-2-print.html"
   ]
  ], 
  "identifier": 5495
 }
]