[
 [
  [
   131916, 
   null, 
   "lord tammerlain", 
   "http://www.atimes.com/atimes/Southeast_Asia/GF03Ae01.html\n \n This will make some people laugh and some people quite mad.\n \n \nBANGKOK - The Osama bin Laden cigarette lighter is adorned with his raised, chrome portrait, an embossed \"9-11\", sketches of the New York World Trade Center, an approaching airplane, and a big red splotch. When you flick the sleek, metal lighter open, a light-emitting diode illuminates the splotch so it glows bright red on one of the buildings, emphasizing the site of the first crash. Loud, computerized music beeps out a loop of Mozart. \n \n snip\n \n I paid US$2 for it, in the old Soviet market in Phnom Penh,\" a Canadian traveler, who asked not to be identified, said in an interview after visiting the Cambodian capital. \"One man's catastrophe is another man's cheesy souvenir,\" he said. \"I bought three, for the novelty. I'll give them to people who would appreciate the irony that they even exist. When you open it, it plays a classical tune. It's quite freaky, eh?\" \n \n snip\n \n While Asian customers often appear non-plussed or bored with the al-Qaeda leader's appearance in their markets, many foreign tourists express shock and awe at the commercialization of the world's most-wanted killer. Other tourists, including Americans, can be seen laughing with sarcastic delight at the cruel globalization of absurdity, despite the outrageous insult to bin Laden's victims. \n \n Thai clothing sellers cater to both sides by offering a high-quality T-shirt adorned with a reverently painted, color portraits of bin Laden; another hangar dangles a T-shirt with the al-Qaeda leader's face targeted inside a red bull's-eye. One common T-shirt in Thailand, which seems to attract mostly cynics and anti-right-wingers, is printed with the faces of bin Laden and President George W Bush side-by-side, and captioned, \"CIA and FBI Presents: Twin Terrors\".  \n \"I bought one of the T-shirts of the Twin Terrors,\" said a snickering New Yorker who visited Bangkok's tourist-friendly Patpong Road night market. \"But I'm afraid of bringing it back to America. Can you imagine what customs might do to me if they find it in my luggage?\"  \n \n Elsewhere in Southeast Asia, a hand-held, \"Laden vs USA\" computerized game is available in Hanoi, Vietnam. The game includes photos of bin Laden wearing a white turban alongside a grimacing Bush. As one plays, using the game's 10 white push-buttons, a matchbox-sized screen shows an image of one of the World Trade Towers exploding while a second airplane bursts into flames after hitting the other tower. The player's low-flying airplane has to defend itself from attacks by jet bombers. \n \n \"The game is divided into 20 levels,\" the package explains. \"What's more, the inspiring music will play during the game.\" On sale for $5, it is similar to a Nintendo Game Boy but built by Panyu Gaming Electronic Co Ltd in China. \n", 
   {
    "post_info": {
     "post_title": "Cashing in on Osama"
    }
   }, 
   null, 
   null, 
   1117739700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Cashing in on Osama", 
  "url": "http://www.4forums.com/political/news-forum/5501-cashing-osama.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 5501, 
  "discussion_files": [
   [
    "9096.html", 
    "http://www.4forums.com/political/news-forum/5501-cashing-osama-print.html"
   ]
  ], 
  "identifier": 5501
 }
]