[
 [
  [
   132637, 
   null, 
   "Missouri Mule", 
   "We have an old saying that you can't put a nickle in the machine and expect to get a dollar's worth of candy.\n \n In Lisbon in 2000, the EU leaders claimed that the European economy would overtake the United States by 2010, and that the euro would drive that growth. Today, Europeans' income still trails Americans', and the Lisbon Agenda often seems a bad joke.\n =========================\n \n The Scotsman \n Sat 4 Jun 2005 \n Euro in trouble: The Italians are ready to consider returning Italy to the lira.\n \n Euro facing meltdown as Italy considers backing out\n \n JAMES KIRKUP AND NICOLA SMITH\n IN BRUSSELS\n \n EUROPE'S political crisis spread to the euro yesterday after Italy publicly discussed abandoning the single currency and reverting to the lira.\n \n The Italian suggestion, once unthinkable to the European establishment, comes as a poll showed a majority of Germans want to pull out of the euro and revive the Deutschmark.\n \n The threats to the future of the euro have disturbed currency markets already nervous about the growing crisis over the European Constitution.\n \n In his remarks yesterday, Roberto Maroni, the Italian welfare minister, said it was no longer unthinkable that the country would abandon the euro and revert to the lire.\n \n The single currency \"has proved inadequate in the face of the economic slowdown, the loss of competitiveness and the job crisis\", he said.\n \n The minister is a member of the Northern League, a minority partner in the coalition government of the prime minister, Silvio Berlusconi. Although several of his government colleagues dismissed Mr Maroni's call, the criticism was not universal.\n \n Guido Crosetto, an economic spokesman for Mr Berlusconi's Forza Italia party, said that Mr Maroni had a point: \"Maybe it would have been better not to join monetary union, but now it's too late.\"\n \n Ottmar Issing, the European Central Bank's chief economist, warned Italy about talk of leaving the euro.\n \n \"Italy shouldn't just think about such a step three times; it should think about it 20 times. It would be economic suicide for them to leave the monetary union,\" he said in Frankfurt.\n \n But in a telling admission, he added: \"People's unease and unhappiness with the economic situation are understandable.\"\n \n The euro fell this week to its lowest value against the dollar for eight weeks, as international investors calculated that the debacle over the constitution could only hamper the process of reforming the faltering European economy.\n \n Despite the furious attempts of the euro's defenders, the single currency is becoming increasingly caught up in the wider debate over the future of Europe which was set off by the constitutional row.\n \n Even Jean-Claude Juncker, the Prime Minister of Luxembourg, who also chairs the \"euro group\" of finance ministers from euro countries, admitted yesterday that the political crisis was putting the single currency under pressure. \"As a result of the referendums, the euro is weakened,\" he said.\n \n Much of the Dutch animosity to the European project was driven by the feeling that the euro has led to rising prices and a falling standard of living.\n \n Even in Germany, the driving force behind the euro's creation in 1999, there are signs of doubt about the project.\n \n German authorities were forced this week to deny a report that the finance ministry and the central bank have an emergency plan for the break-up of the euro, but the German people are certainly discussing that outcome. A survey for Stern magazine this week showed 56 per cent of Germans want to return to the Deutschmark.\n \n Bert Ruerup, the head of chancellor Gerhard Schröder's Council of Economic Advisers, admitted this week that the predicted economic gains from the euro are \"dreams that have never come true\".\n \n While few government officials or economists believe the dramatic break-up of the euro is likely in the short term, there are genuine concerns that the currency could die a lingering death as it loses international credibility.\n \n One particular worry is that the poor performance of the euro economies and the political deadlock over the constitution could deter the new EU members from seeking to join the currency.\n \n Countries like Poland and the Czech Republic have been actively seeking membership since joining the EU last year, but one official in a major European government told The Scotsman yesterday that there is now a \"real danger\" that their enthusiasm could wane.\n \n Since the French and Dutch electorates decisively rejected the EU constitution in referendums this week, international money markets have been taking the prospect of a crisis in the euro much more seriously.\n \n The doubts over the European project have exacerbated concerns about Italy's place in the euro.\n \n The Italian economy is shrinking, but inflation there is still rampant. That in turn prevents the European Central Bank from making the cuts in interest rates that many say are needed to kickstart the French and German economies.\n \n Independent economists said that Mr Maroni's idea could not be ignored. Julien Seetharandoo, an economist at Capital Economics, a London consultancy, warned that leaving the euro could worsen Italy's economic plight.\n \n Nonetheless, the question of a euro break-up is \"definitely worth asking\".\n \n And Joachim Fels, a senior European economist at Morgan Stanley, warned that the pressure on the euro is growing. He said: \"Increasing political and economic divergences imply that somewhere down the road it might all blow up.\"\n \n The slow, chaotic death of the constitution has raised doubts about the political cohesion of the EU; cohesion that underpins the euro.\n \n The impasse over the constitution - which may only be resolved at a Brussels summit later this month - deepened yesterday.\n \n Ireland and Portugal joined Britain in hinting that they may suspend plans for referendums on the constitution, even as Germany pressed for the ratification of the treaty to continue.\n \n Mr Schröder and Jacques Chirac, the French president, meet in Berlin today to discuss a strategy for keeping the constitution alive.\n \n It also emerged yesterday that Mr Schröder had called for the meeting to be attended by the leaders of Belgium, the Netherlands, Italy and Luxembourg, the EU's six founding members.\n \n That plan was rejected by the Dutch, but disclosure still raised speculation that Germany will press for a \"core Europe\" to push ahead with the constitution despite the objections of newer members.\n \n By contrast, Tony Blair, the Prime Minister, is quietly trying to build alliances in favour of a lengthy and possibly indefinite pause in the constitution process.\n \n Jack Straw, the Foreign Secretary, will tell MPs on Monday that legislation which would have allowed a British referendum has been shelved, but ahead of the Brussels summit, he will stop short of calling for the treaty to be scrapped.\n \n The Tories attacked that reticence yesterday, insisting that Mr Straw must openly declare the constitution is \"dead and buried\".\n \n HAS THE CHANGE DONE ANYONE ANY GOOD?\n \n ANYONE wondering why the current storm has blown up around the euro should remember Bill Clinton's dictum: \"It's the economy, stupid.\"\n \n The single European currency is in many ways a remarkable achievement. To create a workable currency union from 12 economies as disparate as that of Germany and Greece is something of a modern miracle, no matter how well that union actually performs.\n \n But there's the rub. Has the biggest and most ambitious economic project in modern European history actually done anyone any good?\n \n The currency's defenders insist that the answer is a firm \"yes\", citing stable exchange rates and low interest rates.\n \n That is of course true, but the people of the eurozone could be forgiven for asking in response: \"Yes, but what have you done for me lately?\"\n \n Several euro countries, notably France and Germany, have double-digit unemployment, and have for years. Growth, meanwhile, is sluggish at best, and negative in countries such as Italy.\n \n In Lisbon in 2000, the EU leaders claimed that the European economy would overtake the United States by 2010, and that the euro would drive that growth. Today, Europeans' income still trails Americans', and the Lisbon Agenda often seems a bad joke.\n \n As for the euro, some of its users blame it for soaring prices, and others for painful tax rises and cuts in public spending. The evidence to justify that blame may be contestable. But so is the evidence that the euro has made anyone better off.\n \n \n This article:\n \n http://news.scotsman.com/index.cfm?id=611492005\n \n European Union:\n \n http://news.scotsman.com/topics.cfm?tid=591", 
   {
    "post_info": {
     "post_title": "&quot;It's the economy, stupid.&quot;  (Socialism taking its well deserved hit.)"
    }
   }, 
   null, 
   null, 
   1117853280.0
  ], 
  [
   132711, 
   null, 
   "gamehuis", 
   "Meh, the sun can't shine all the time. Naturally the Euro will have its ups and downs. It's just that the lame duck governments (as Wim Duisenberg would call them) in Italy, Germany and France have to keep their cool when things don't go well.\n \n The Euro is here to stay. Going back to their old currencies will cause their economies more harm (economically and politically) than the introduction of the Euro has ever done.\n \n Rome wasn't built in one day and neither will the EU.", 
   {}, 
   132637, 
   null, 
   1117883880.0
  ], 
  [
   132715, 
   null, 
   "Eddie", 
   "Yeah, this is just political oportunism at its best. And fairly common throughout Europe. Whenever european politicians feel the need to divert attention from their own failiures, EU will serve as a scapegoat (no wonder EU scepsism is still strong emoticon_rolleyes).... I guess it`s a bit like your politicians using UN as the source of all american failiures. It`s always a good trick to have an international institution to blame things on as you are not as likely to be called upon it...\n \n Had Mr Maroni had the support of berlusconi in this political stunt, I might have considered it genuine. Now it`s just damage control. It is especially common for small parties to try to attract EU sceptics by making wild claims and statements. This is probably very different from the US situation where the two parties that matters actually have the ability to make drastic changes and therfor must stand for everything they say (or be caught making lies). Liga Nord will never be called on this as they will never achieve the ability to make that kind of change.\n \n That the Germans are sceptic is not very surprising. They need to get out of their decade long recession. They don`t have that many options left to try With their currency tied to the Euro, that is one more option out of the window. Allthough, considering german historic relationship with inflation, I would say that option was destroyed in 1945 rather than 1993...\n \n What all of this has to do with socialism and how socialism has \"taken a well deserved hit\" is beyond me...", 
   {}, 
   132711, 
   null, 
   1117885560.0
  ], 
  [
   132772, 
   null, 
   "lord tammerlain", 
   "Italy economy is even more inefficient and overly regulated then France's. With the high Euro, Italy's ability to compete on the international level has been negatively impacted ( compared to Germany where the Euro has had barely affected it's exports ). Now that Italy is part of the Euro it no longer has the easy way out for international economic competition by lowering the value of its currency.\n \n Dumping the Euro will not help Italy, far from it. The increased costs for trading in the Euro area will generally hurt it far more then help. Ridding itself of Berlusconi and his crony capitalism ( the likes of which was last seen in the corrupt economies of Latin America ) should be the first goal for improving Italy's economy.", 
   {}, 
   132715, 
   null, 
   1117904580.0
  ], 
  [
   132817, 
   null, 
   "georged", 
   "Italy economy is even more inefficient and overly regulated then France's. With the high Euro, Italy's ability to compete on the international level has been negatively impacted ( compared to Germany where the Euro has had barely affected it's exports ). Now that Italy is part of the Euro it no longer has the easy way out for international economic competition by lowering the value of its currency.\n \n Dumping the Euro will not help Italy, far from it. The increased costs for trading in the Euro area will generally hurt it far more then help. Ridding itself of Berlusconi and his crony capitalism ( the likes of which was last seen in the corrupt economies of Latin America ) should be the first goal for improving Italy's economy.\n\n \n When I look at Germany's numbers, especially a 20% positive trade balance and positive payment balance with 33% of the labor force in goods manufacturing, and debt at 65%/GDP I'm impressed. With $70-billion/yr being poured into the former E. Germany not including social services I'm even more impressed. \n \n UK - trade balance -19%, payment balance -$33-billion (USD), goods\n manufacturing labor 26%, debt 40%/GDP.\n \n France - trade balance neutral, payment balance -$319-billion, goods manufacturing labor 24%, debt 67%/GDP.\n \n Italy - trade balance +2%, payment balance -$21-billion, goods manufacturing labor 32%, debt 106%/GDP.\n \n Netherlands - trade balance +14%, payment balance +$20-billion, goods manufacturing labor 23%, debt 56%/GDP.\n \n I don't intend to slight other countries by omission, but as EU 'swing' votes all the above face the same rising social cost problems, the same unemployment from aging populations and labor rigidity forcing capital flight. What makes Germany and the Netherlands shine? \n \n (Italy's debt alone would make moving off the Euro an instant disaster of enormous proportion)", 
   {}, 
   132772, 
   null, 
   1117910820.0
  ], 
  [
   132825, 
   null, 
   "gamehuis", 
   "I can't speak for the Germans, but in my country we have a group of people in the government known as \"fiscal conservatives\". I hear they've died out in the US. :p\n \n Our government has an almost obsessive fixation with bringing the national debt down.\n When last year the national debt went up with a \"whopping\" \u0080 10 billion, it caused great debate in the parliament because the ultimate goal is to get rid of the national debt within one generation.\n \n Plus the good old Dutch trait of not spending a penny too much also helps to keep the books balanced. :p", 
   {}, 
   132817, 
   null, 
   1117912620.0
  ], 
  [
   132827, 
   null, 
   "georged", 
   "I can't speak for the Germans, but in my country we have a group of people in the government known as \"fiscal conservatives\". I hear they've died out in the US. :p\n \n\n \n It was so quick and final there was no memorial service. Fiscal conservatives in the US are now considered un-American and lacking patriotism by 'Real Americans'.", 
   {}, 
   132825, 
   null, 
   1117912800.0
  ], 
  [
   132887, 
   null, 
   "Duo_Maxwell", 
   "Eddie, don't you know the formula?\n \n Something bad happens in Europe = Socialism's fault. \n \n Natural disaster? Obviously socialism.\n Flooding? Socialism.\n Falling birth rates? Socialism\n Falling wages? Socialism\n Aging populace? Socialism\n Nightfall? Socialism. \n \n When you think like Mule, everything bad is the fault of socialism. \n \n \n However I do find it amusing that Mule's complete lack of economic knowledge leads him to put some merit in the article.", 
   {}, 
   132827, 
   null, 
   1117920420.0
  ], 
  [
   132897, 
   null, 
   "gamehuis", 
   "Eddie, don't you know the formula?\n \n Something bad happens in Europe = Socialism's fault. \n \n Natural disaster? Obviously socialism.\n Flooding? Socialism.\n Falling birth rates? Socialism\n Falling wages? Socialism\n Aging populace? Socialism\n Nightfall? Socialism. \n\n You forgot one:\n \n Socialism? It's the Liberals fault.\n \n :p", 
   {}, 
   132887, 
   null, 
   1117921440.0
  ], 
  [
   132900, 
   null, 
   "Duo_Maxwell", 
   "I am quickly losing all hope that Mule can even be reasoned with. Therefore, if I cannot hit him with a fry pan, I'm going to mock him.\n \n Missouri Mule: My printer stopped working! DAMN SOCIALISM! Why is it raining? DAMN SOCIALISM! It's too bright outside. DAMN SOCIALISM! Why is the AC too high in my house? DAMN SOCIALISM! Why does my dog need to walk? DAMN SOCIALISM! My toliet backed up. DAMN SOCIALISM! Why do I have to walk so far to the store? DAMN SOCIALISM! I need to nap. DAMN SOCIALISM! Nature calls! DAMN SOCIALISM", 
   {}, 
   132897, 
   null, 
   1117921620.0
  ], 
  [
   132907, 
   null, 
   "Eddie", 
   "Eddie, don't you know the formula?\n \n Something bad happens in Europe = Socialism's fault. \n \n\n \n Hehe... I guess you`re right. :p", 
   {}, 
   132887, 
   null, 
   1117922460.0
  ], 
  [
   133140, 
   null, 
   "Missouri Mule", 
   "Hehe... I guess you`re right. :p\n\n \n It is simply that socialism is by its very nature an inefficient use of resources. It may be a good idea in theory as no one wants those unable to help themselves to die of starvation but to put able bodied people on the dole indefinitely as does Europe it is downright crazy. Extend this out another five years and see if the gap between Europe and the U.S. doesn't grow further yet. At what point do the scales fall from Europe's eyes and they realize that there is no such thing as a free lunch?", 
   {}, 
   132907, 
   null, 
   1117998240.0
  ], 
  [
   133185, 
   null, 
   "Big_Bear_Scot", 
   "\n It is simply that socialism is by its very nature an inefficient use of resources. It may be a good idea in theory as no one wants those unable to help themselves to die of starvation but to put able bodied people on the dole indefinitely as does Europe it is downright crazy. Extend this out another five years and see if the gap between Europe and the U.S. doesn't grow further yet. At what point do the scales fall from Europe's eyes and they realize that there is no such thing as a free lunch?\n \n \n Name one EU country that implements a pure Socialist Economy ?", 
   {}, 
   133140, 
   null, 
   1118001540.0
  ], 
  [
   133188, 
   null, 
   "gamehuis", 
   "It is simply that socialism is by its very nature an inefficient use of resources. It may be a good idea in theory as no one wants those unable to help themselves to die of starvation but to put able bodied people on the dole indefinitely as does Europe it is downright crazy. Extend this out another five years and see if the gap between Europe and the U.S. doesn't grow further yet. At what point do the scales fall from Europe's eyes and they realize that there is no such thing as a free lunch?\n\n At what point do the scales fall from your eyes and do you realize that the US is borrowing $ 2 billion each day from the Asians to sustain it's economy.", 
   {}, 
   133140, 
   null, 
   1118002140.0
  ], 
  [
   133202, 
   null, 
   "Eddie", 
   "It is simply that socialism is by its very nature an inefficient use of resources. It may be a good idea in theory as no one wants those unable to help themselves to die of starvation but to put able bodied people on the dole indefinitely as does Europe it is downright crazy. Extend this out another five years and see if the gap between Europe and the U.S. doesn't grow further yet. At what point do the scales fall from Europe's eyes and they realize that there is no such thing as a free lunch?\n\n \n The Euro has nothing to do with socialist polycies in Europe. That`s just a stretch. Just like your SS situation has nothing to with laize fare polycies in the US.", 
   {}, 
   133140, 
   null, 
   1118003760.0
  ], 
  [
   133214, 
   null, 
   "Duo_Maxwell", 
   "It is simply that socialism is by its very nature an inefficient use of resources.\n\n \n Oddly the small groups that do implement socialism, have lasted far longer then any nation in history. But Mule can't be bothered with facts. \n \n \nExtend this out another five years and see if the gap between Europe and the U.S. doesn't grow further yet.\n\n \n What gap? Europe doesn't have as large as trade deficits as the US. Most European countries have lower gdp to debt, most have much smaller deficits, birthrates and immigration are comparatively similar. Real (I doubt you know what that is) Gdp growth is among the same levels. \n \n \nAt what point do the scales fall from Europe's eyes and they realize that there is no such thing as a free lunch?\n\n \n When did they ever? Oh yes, never.\n \n Go back to school, and study something called \"economics\" it's quite clear you don't know what that is.", 
   {}, 
   133140, 
   null, 
   1118005200.0
  ], 
  [
   133270, 
   null, 
   "Jo Bennett", 
   "Socialism is, in fact, a far more efficient use of resources than capitalism. Capitalism relies on supply and demand - ie surplus products to function. Competition relies on goods being used to make inferior products, which then are wasted. Capitalism also encourages the manufacture of goods with a limited lifespan, further eating up resources. If capitalism is so efficient, why is the US the most resources hungry nation on the planet, so much so that if everyone lived like the average US citizen we would need 6 planets to sustain everyone?", 
   {}, 
   133214, 
   null, 
   1118011260.0
  ], 
  [
   133272, 
   null, 
   "Missouri Mule", 
   "The true believers will just keep believing the nonsense of socialism. I'm not going to bother with a rebuttal as no serious economist on the planet would argue in favor of socialism. Not one.", 
   {}, 
   133270, 
   null, 
   1118011380.0
  ], 
  [
   133276, 
   null, 
   "Jo Bennett", 
   "The true believers will just keep believing the nonsense of socialism. I'm not going to bother with a rebuttal as no serious economist on the planet would argue in favor of socialism. Not one.\n\n \n Ah, argument by \"everyone agrees with me\". Well I'm convinced...\n \n It rather depends on your definition of socialism. Will Hutton, renowned British economist, advocates something a long way from free market economics, roughly a variant on Keynesianism I understand.", 
   {}, 
   133272, 
   null, 
   1118011620.0
  ], 
  [
   133288, 
   null, 
   "daewoo", 
   "The true believers will just keep believing the nonsense of socialism. I'm not going to bother with a rebuttal as no serious economist on the planet would argue in favor of socialism. Not one.\n\n \n \n Actually there have been several economists who have argued in favor of socialism. There are STILL economists who argue in favor of socialism. Now that the Chinese have surpassed the US as a producer nation, and the US industrial sector has failed miserably, peopel seem to be taking aharder look at such things.", 
   {}, 
   133272, 
   null, 
   1118012460.0
  ], 
  [
   133291, 
   null, 
   "Missouri Mule", 
   "Actually there have been several economists who have argued in favor of socialism. There are STILL economists who argue in favor of socialism. Now that the Chinese have surpassed the US as a producer nation, and the US industrial sector has failed miserably, peopel seem to be taking aharder look at such things.\n\n \n There is no recognized economist on the planet who would argue in favor of socialism over a free market economy. Not one. \n \n Where are in the world are you coming up with this Chinese business? If you are talking strictly about low wages and production that might be accurate but the U.S. is still far and away the most productive industrialized nation in the world.", 
   {}, 
   133288, 
   null, 
   1118012760.0
  ], 
  [
   133301, 
   null, 
   "daewoo", 
   "There is no recognized economist on the planet who would argue in favor of socialism over a free market economy. Not one. \n\n \n UR wrong\n \n \nWhere are in the world are you coming up with this Chinese business? If you are talking strictly about low wages and production that might be accurate but the U.S. is still far and away the most productive industrialized nation in the world.\n\n \n \n both growth and real production.\n \n not veen going to bother arguing it with you. It requires an understandign of how currency works and infrastructure investments, 2 tings you have proven unable to comprehend at even the most basic level.", 
   {}, 
   133291, 
   null, 
   1118013240.0
  ], 
  [
   133323, 
   null, 
   "Eddie", 
   "There is no recognized economist on the planet who would argue in favor of socialism over a free market economy. Not one. \n \n\n \n Please explain what you mean by \"socialism\" and \"free market economy\".", 
   {}, 
   133291, 
   null, 
   1118015280.0
  ], 
  [
   133324, 
   null, 
   "Duo_Maxwell", 
   "Please explain what you mean by \"socialism\" and \"free market economy\".\n\n \n Yes, I'd like to see that too.", 
   {}, 
   133323, 
   null, 
   1118015340.0
  ], 
  [
   133346, 
   null, 
   "georged", 
   "There is no recognized economist on the planet who would argue in favor of socialism over a free market economy. Not one. \n \n\n \n That has to be one of the most ignorant, disassociated statements in a long string that you've made. I think that one put you out in front of VOR.", 
   {}, 
   133291, 
   null, 
   1118016900.0
  ], 
  [
   133372, 
   null, 
   "Missouri Mule", 
   "That has to be one of the most ignorant, disassociated statements in a long string that you've made. I think that one put you out in front of VOR.\n\n \n Well, since you didn't bother to produce one then I assume there isn't one, or at least one I've ever heard about.\n \n This is clearly a stupid argument. It is an oxymoron to say \"socialist economist.\" They are anything but. Charlatans, yes, but economists; no.\n \n Let me repeat once again. A free market economy is vastly superior to socialism. Period. Period, and period.", 
   {}, 
   133346, 
   null, 
   1118018340.0
  ], 
  [
   133374, 
   null, 
   "Jo Bennett", 
   "I already mentioned Will Hutton. What is your view of him? Is he socialist or free market? The answer is somewhere in between, like the economies of europe. And he is most definitely an economist.", 
   {}, 
   133372, 
   null, 
   1118018520.0
  ], 
  [
   133377, 
   null, 
   "Big_Bear_Scot", 
   "Well, since you didn't bother to produce one then I assume there isn't one, or at least one I've ever heard about.\n \n This is clearly a stupid argument. It is an oxymoron to say \"socialist economist.\" They are anything but. Charlatans, yes, but economists; no.\n \n Let me repeat once again. A free market economy is vastly superior to socialism. Period. Period, and period..\n \n \n Since you have stated that, I suppose you could give us some economic comparisons between a pure Socialist economy and a pure free market economy. Just to back up your claim.", 
   {}, 
   133372, 
   null, 
   1118018580.0
  ], 
  [
   133422, 
   null, 
   "georged", 
   "Well, since you didn't bother to produce one then I assume there isn't one, or at least one I've ever heard about.\n \n This is clearly a stupid argument. It is an oxymoron to say \"socialist economist.\" They are anything but. Charlatans, yes, but economists; no.\n \n Let me repeat once again. A free market economy is vastly superior to socialism. Period. Period, and period.\n\n \n I'd be somewhat curious to hear your explanation of the differences in free market trade between socialistic and democratic countries. Just for fun, include communistic as a third difference. Trade variations are something that interests me.", 
   {}, 
   133372, 
   null, 
   1118020380.0
  ], 
  [
   133427, 
   null, 
   "daewoo", 
   "Well, since you didn't bother to produce one then I assume there isn't one, or at least one I've ever heard about.\n \n This is clearly a stupid argument. It is an oxymoron to say \"socialist economist.\" They are anything but. Charlatans, yes, but economists; no.\n \n Let me repeat once again. A free market economy is vastly superior to socialism. Period. Period, and period.\n\n \n Oskar Lange\n Abba Lerner (these guys therories are essentially what the chinese are basing their economy on)\n Beatrice Webb\n Robert Heilbroner\n Emil Lederer\n Joan Robinson\n Gunnar Myrdal\n John Maynard Keynes\n \n Off the top of my head. These are all famous folks you should have heard of.\n \n Just out of curiosity, if a free market economy is automatically vastly superior to a socialist one, why does the US carry a huge trade deficit, but canada, china, and even sweden do not? Why does Boeing need 14 billion in grants and subsidies to make their new plane competiotive, when aerobus only needs a few billion in loans?\n \n I owuld certainly agree that socialism as a pure form is unlikely to work, but it sesm thatt here are perhaps some things there (in the socialist system) that we should probably not discount immediatly without some examination.\n \n The battle as far as which is the better system is far from over. The economists I listed above are mostly famous dead folks. Do you need a list of contemporary economists? I assure you there is no problem in providing it. As has been the case in every other circumstance regarding the economy, you have opened your mouth and removed all doubt......", 
   {}, 
   133372, 
   null, 
   1118022060.0
  ], 
  [
   133429, 
   null, 
   "Big_Bear_Scot", 
   "I owuld certainly agree that socialism as a pure form is unlikely to work, but it sesm thatt here are perhaps some things there (in the socialist system) that we should probably not discount immediatly without some examination.\n \n \n We can only examine the Theories behind a pure Socialist Economy and a pure free market Economy as to my knowledge there are no Countries that implement eithie of these two extremes.\n \n Most Countries in the World have a mixed Economy, where there is a mix between a centrally directed Economy(essentially the back bone of a Socialist Economy *) and free Market Forces, even the US which is touted as the Country that implements a free market as some sort of central control via legislation.\n \n *NB.\n Even then some Socialist disagree that we need a centrally planned Economy, we could still leave it to the market(but with heavy restriction via regulation) these people are called Market Socialists.", 
   {}, 
   133427, 
   null, 
   1118022900.0
  ], 
  [
   133463, 
   null, 
   "Duo_Maxwell", 
   "It is an oxymoron to say \"socialist economist.\"\n\n \n lol. Normally I have to pay for such entertainment. There is nothing more entertaining them a bubbling idiot trying to explain something he knows nothing about. Socialism is merely one form of a economy. One can easily be a socialist economists, because all economics is the study of choices. Socialism is merely a choice. You are not only ignorant, but highly entertaining in your profound ignorance. \n \n \nA free market economy is vastly superior to socialism.\n\n \n Define superior. The market fails in many aspects. Free market doesn't provide people with what they need. Free market emphasises things that appear to be good when they are often not. Free market doesn't produce public goods that the country needs.", 
   {}, 
   133372, 
   null, 
   1118026080.0
  ], 
  [
   133522, 
   null, 
   "Missouri Mule", 
   "Oskar Lange\n Abba Lerner (these guys therories are essentially what the chinese are basing their economy on)\n Beatrice Webb\n Robert Heilbroner\n Emil Lederer\n Joan Robinson\n Gunnar Myrdal\n John Maynard Keynes\n \n Off the top of my head. These are all famous folks you should have heard of.\n \n Just out of curiosity, if a free market economy is automatically vastly superior to a socialist one, why does the US carry a huge trade deficit, but canada, china, and even sweden do not? Why does Boeing need 14 billion in grants and subsidies to make their new plane competiotive, when aerobus only needs a few billion in loans?\n \n I owuld certainly agree that socialism as a pure form is unlikely to work, but it sesm thatt here are perhaps some things there (in the socialist system) that we should probably not discount immediatly without some examination.\n \n The battle as far as which is the better system is far from over. The economists I listed above are mostly famous dead folks. Do you need a list of contemporary economists?  I assure you there is no problem in providing it. As has been the case in every other circumstance regarding the economy, you have opened your mouth and removed all doubt......\n\n \n Some contemporary economists would be nice.", 
   {}, 
   133427, 
   null, 
   1118038800.0
  ], 
  [
   133560, 
   null, 
   "Jo Bennett", 
   "I've already given you one... you still haven't said anything about him...", 
   {}, 
   133522, 
   null, 
   1118053800.0
  ], 
  [
   133563, 
   null, 
   "Eddie", 
   "How about Rudolf Meidner. A bit old, but still quite active (published a book as late as 1999).\n \n For a younger verision, we have Dan Andersson. \n \n For a more internationally reknowned economist, we have the indian economist Amartya Sen who has some socialist leanings (allthough to be honest, I have not read any of his work myself, but from the things I`ve read about them and him, he seems to have some socialist leanings)", 
   {}, 
   133560, 
   null, 
   1118056860.0
  ], 
  [
   133635, 
   null, 
   "Missouri Mule", 
   "I already mentioned Will Hutton. What is your view of him? Is he socialist or free market? The answer is somewhere in between, like the economies of europe. And he is most definitely an economist.\n\n \n Are you serious?\n \n http://www.guardian.co.uk/Columnists/Column/0,5673,1494916,00.html", 
   {}, 
   133374, 
   null, 
   1118078040.0
  ], 
  [
   133636, 
   null, 
   "Missouri Mule", 
   "How about Rudolf Meidner. A bit old, but still quite active (published a book as late as 1999).\n \n For a younger verision, we have Dan Andersson. \n \n For a more internationally reknowned economist, we have the indian economist Amartya Sen who has some socialist leanings (allthough to be honest, I have not read any of his work myself, but from the things I`ve read about them and him, he seems to have some socialist leanings)\n\n \n I've not heard of him so I checked Google but the results came back in Swedish. What are his thoughts?", 
   {}, 
   133563, 
   null, 
   1118078220.0
  ], 
  [
   133643, 
   null, 
   "Jo Bennett", 
   "Are you serious?\n \n http://www.guardian.co.uk/Columnists/Column/0,5673,1494916,00.html\n\n \n What's your point? Try reading \"The state we're in\" a critique of short termism in the British economy, or \"The world we're in\" which takes a wider view of global economics. Hutton is a journalist as well as an economist.", 
   {}, 
   133635, 
   null, 
   1118078880.0
  ], 
  [
   133645, 
   null, 
   "Missouri Mule", 
   "What's your point? Try reading \"The state we're in\" a critique of short termism in the British economy, or \"The world we're in\" which takes a wider view of global economics. Hutton is a journalist as well as an economist.\n\n \n The first thing I noticed was that this was in the Guardian. The second thing I noticed was that there was rationalization of Mao. that's when I stopped being interested in his views.", 
   {}, 
   133643, 
   null, 
   1118079060.0
  ], 
  [
   133646, 
   null, 
   "Jo Bennett", 
   "He's still an economist, you can't dispute that.", 
   {}, 
   133645, 
   null, 
   1118079120.0
  ], 
  [
   133650, 
   null, 
   "daewoo", 
   "Are you serious?\n \n http://www.guardian.co.uk/Columnists/Column/0,5673,1494916,00.html\n\n \n \n So because he condems Mao for being cruel and making some foolish decisions he is not a socialist? Did you even read the article??", 
   {}, 
   133635, 
   null, 
   1118079240.0
  ], 
  [
   133656, 
   null, 
   "Missouri Mule", 
   "So because he condems Mao for being cruel and making some foolish decisions he is not a socialist? Did you even read the article??\n\n \n I read enough.", 
   {}, 
   133650, 
   null, 
   1118079780.0
  ], 
  [
   133674, 
   null, 
   "daewoo", 
   "I read enough.\n\n \n Enough to know that the article has nothing to do with this thread? Then why did you post it??", 
   {}, 
   133656, 
   null, 
   1118081220.0
  ], 
  [
   133719, 
   null, 
   "Eddie", 
   "I've not heard of him so I checked Google but the results came back in Swedish. What are his thoughts?\n\n \n He`s a social democrat, and LO`s* chief labour econonomist. He`s probably slightly more socialist than our current social democratic government. Mr Andersson is probably the single most powerful economist in Sweden today (but not necessarily most influental).\n \n * The swedish manual-labour union.", 
   {}, 
   133636, 
   null, 
   1118085960.0
  ], 
  [
   133721, 
   null, 
   "Missouri Mule", 
   "Enough to know that the article has nothing to do with this thread? Then why did you post it??\n\n \n I didn't post it dummy. This was someone else's link. I was commenting on Hutton's take on Mao. Get your facts straight.", 
   {}, 
   133674, 
   null, 
   1118086140.0
  ], 
  [
   133729, 
   null, 
   "Jo Bennett", 
   "I didn't post it dummy. This was someone else's link. I was commenting on Hutton's take on Mao. Get your facts straight.\n\n \n It WAS your link. Are you amnesiac as well as stupid?", 
   {}, 
   133721, 
   null, 
   1118086380.0
  ], 
  [
   133739, 
   null, 
   "daewoo", 
   "I didn't post it dummy. This was someone else's link. I was commenting on Hutton's take on Mao. Get your facts straight.\n\n \n \n Hmmm, lets step into the way back machine:\n \n \n \n \nOriginally Posted by Jo Bennett\n \nI already mentioned Will Hutton. What is your view of him? Is he socialist or free market? The answer is somewhere in between, like the economies of europe. And he is most definitely an economist.\n\n \n \n Are you serious?\n \n http://www.guardian.co.uk/Columnist...1494916,00.html\n \n\n \n So, Jo Bennett asked for your view on will hutton as a socialist economist, and you seem to imply that the article you link has some bearing on that. which it does not.", 
   {}, 
   133721, 
   null, 
   1118087040.0
  ], 
  [
   133907, 
   null, 
   "Missouri Mule", 
   "Hmmm, lets step into the way back machine:\n \n So, Jo Bennett asked for your view on will hutton as a socialist economist, and you seem to imply that the article you link has some bearing on that. which it does not.\n\n \n OK, let's get back on subject. I asked for the names of any recognized economist who would argue that socialism is superior to free market capitalism. Among the names was this one particular fellow -- Will Hutton. I was asked twice about him. I looked him up and pointed to an article where he was apologizing for Mao's mass murders numbering in the 10s of millions. Any damn fool that pretends that it is in anyway excusable to defend Mao is not a serious economist. He's an idiot.", 
   {}, 
   133739, 
   null, 
   1118104920.0
  ], 
  [
   133923, 
   null, 
   "Duo_Maxwell", 
   "You have no shame. When you were clearly proven to be wrong, you can't even admit it. \n \n Not to mention you just went and used the fallacy of poisiong the wells. \n Will Hutton's views on Mao's genocidal behavior have no impact upon his views on socialistic economics. If you want to prove he's without merit on socialisim, prove those views wrong. If we used your insane logic, we could attack Bush for his bad business practices 20 years ago and then say everything he's doing now is wrong, and you must accept it as your own logic dictates it", 
   {}, 
   133907, 
   null, 
   1118106060.0
  ], 
  [
   133951, 
   null, 
   "daewoo", 
   "OK, let's get back on subject. I asked for the names of any recognized economist who would argue that socialism is superior to free market capitalism. Among the names was this one particular fellow -- Will Hutton. I was asked twice about him. I looked him up and pointed to an article where he was apologizing for Mao's mass murders numbering in the 10s of millions. Any damn fool that pretends that it is in anyway excusable to defend Mao is not a serious economist. He's an idiot.\n\n \n \n Hutton is definatly an economist, a fairly famous one. \n \n Now, lets look at the article a little, since you already admitted you did not read it.\n \n \nHe may have been a despot, but the leader of the largest country in the world unintentionally did his people good \n\n \n That is the tag line. This does not sound to me like the article is going to be apologetic to Mao and his murderous policies.\n \n \nIt is less than 30 years ago that the 20th-century's bloodiest dictator was approaching death, his country still dirt poor, his vision in ruins, with tens of millions of his fellow citizens dead at his hands. Today, that same country has enjoyed three decades of the most unparalleled economic growth. Mao's death has proved the trigger for an extraordinary economic renaissance.\n\n \n first paragraph. This does not look like apologetics to me\n \n \nNobody can disagree that he was a cruel and authoritarian despot who murdered millions; even his successor, Deng Xiaoping, pronounced that he was at least 30 per cent wrong and guilty of 'excesses'.\n\n \n second paragraph. still not seeing it.\n \n We will skip ahead, almost tot he bottom of the article, where he finally says something about mao that is not along the lines of \"butchering maniac\":\n \n \nIt was more closely modelled on the imperial system than either critic or supporter ever concedes. And when Mao died, the second paradox is that the decentralisation and pragmatism he fostered, notwithstanding mad forays such as the campaign to kill sparrows, allowed Deng, the architect of today's China, quickly to put in place policies that would drive the astonishing economic turnround.\n\n \n Srtill FAR, FAR from being apologetic.\n \n Here is the wrap up:\n \n \nMao is now revealed as more of a monster than we ever guessed, thanks to Chang and Halliday. But even monsters can create good they may never have self-consciously aimed for or wanted.\n \n History is the story of contradictions and unintended consequences. This book - and our understanding of China - would have been stronger still had it acknowledged them. \n\n \n In the first apragraph, he calls the guy a bloody dictator. In thewrap up, he calls him a monster. And he is apologetic how???", 
   {}, 
   133907, 
   null, 
   1118108460.0
  ], 
  [
   133991, 
   null, 
   "Missouri Mule", 
   "Hutton is definatly an economist, a fairly famous one. \n \n Now, lets look at the article a little, since you already admitted you did not read it.\n \n That is the tag line. This does not sound to me like the article is going to be apologetic to Mao and his murderous policies.\n \n first paragraph. This does not look like apologetics to me\n \n second paragraph. still not seeing it.\n \n We will skip ahead, almost tot he bottom of the article, where he finally says something about mao that is not along the lines of \"butchering maniac\":\n \n Srtill FAR, FAR from being apologetic.\n \n Here is the wrap up:\n \n In the first apragraph, he calls the guy a bloody dictator. In thewrap up, he calls him a monster. And he is apologetic how???\n\n \n Sure, and if Hitler had gone to his excesses he would have been a great leader for the German people. After all he did some \"good\" too. Let's hear it for Stalin too while we're at it. After all, he did lead the USSR through WWII, didn't he? And who can forget Pol Pot. After all he was cleansing the Cambodian people of their impure thoughts and the unnecessary riff-raff of their society.", 
   {}, 
   133951, 
   null, 
   1118117640.0
  ], 
  [
   133992, 
   null, 
   "daewoo", 
   "Sure, and if Hitler had gone to his excesses he would have been a great leader for the German people. After all he did some \"good\" too. Let's hear it for Stalin too while we're at it. After all, he did lead the USSR through WWII, didn't he? And who can forget Pol Pot. After all he was cleansing the Cambodian people of their impure thoughts and the unnecessary riff-raff of their society.\n\n \n Maybe you could point directly to the portions of the articles that suggest that Hutton is a mao apologist to you. I won't hold my breath.\n \n Why don't you just admit you were WRONG and move on? You should be getting used to being shown as a fool by now...", 
   {}, 
   133991, 
   null, 
   1118117820.0
  ], 
  [
   134037, 
   null, 
   "gamehuis", 
   "Sure, and if Hitler had gone to his excesses he would have been a great leader for the German people. After all he did some \"good\" too. Let's hear it for Stalin too while we're at it. After all, he did lead the USSR through WWII, didn't he? And who can forget Pol Pot. After all he was cleansing the Cambodian people of their impure thoughts and the unnecessary riff-raff of their society.\n\n Please stick to the subject and don't try to deflect it with your usual WWII BS.\n \n Just admit you were wrong, there's no shame in it. Any real American would be able to do it.", 
   {}, 
   133991, 
   null, 
   1118134020.0
  ], 
  [
   134041, 
   null, 
   "Jo Bennett", 
   "OK, let's get back on subject. I asked for the names of any recognized economist who would argue that socialism is superior to free market capitalism. Among the names was this one particular fellow -- Will Hutton. I was asked twice about him. I looked him up and pointed to an article where he was apologizing for Mao's mass murders numbering in the 10s of millions. Any damn fool that pretends that it is in anyway excusable to defend Mao is not a serious economist. He's an idiot.\n\n \n Your personal opinion of someone is not the measure of whether they are an economist or not. If we exclude all the people you think are XXXXXX then, by defintion, we exclude all socialists. However, if we take a general consensus it becomes quite clear that there are reputable socialist economists.", 
   {}, 
   133907, 
   null, 
   1118143440.0
  ], 
  [
   134052, 
   null, 
   "Big_Bear_Scot", 
   "Here is an Economist that champions a (kind of) Socialist Economy\n \n James Yunker \n \n have a look at is paper on Market Socialism", 
   {}, 
   134041, 
   null, 
   1118148600.0
  ], 
  [
   134466, 
   null, 
   "Missouri Mule", 
   "Maybe you could point directly to the portions of the articles that suggest that Hutton is a mao apologist to you. I won't hold my breath.\n \n Why don't you just admit you were WRONG and move on? You should be getting used to being shown as a fool by now...\n\n \n Your argument is every bit as valid as arguing that there was some good after all in the KKK.", 
   {}, 
   133992, 
   null, 
   1118209860.0
  ], 
  [
   134467, 
   null, 
   "daewoo", 
   "Your argument is every bit as valid as arguing that there was some good after all in the KKK.\n\n \n could you point to the part fo the article that implies that to you? I am not seeing it. the closest I see to that is where he says Mao was a monster and some good accidentally came out of his policies re: internal structure.", 
   {}, 
   134466, 
   null, 
   1118211060.0
  ], 
  [
   134475, 
   null, 
   "Jo Bennett", 
   "It's broadly similar for saying that Hitler was unintentionally responsible for the setting up of the EU, which is true, and widely known. The difference is that few of us know Chinese history as well as we do European, so similar information can come as a shock.", 
   {}, 
   134467, 
   null, 
   1118220480.0
  ], 
  [
   134581, 
   null, 
   "Missouri Mule", 
   "could you point to the part fo the article that implies that to you? I am not seeing it. the closest I see to that is where he says Mao was a monster and some good accidentally came out of his policies re: internal structure.\n\n \n Suppose it could be established that the KKK actually did some actual good during its existence. And suppose I were to write about it in historical context and throw in something positive about it. What would be your response? Let me guess. I would be labeled an racist, wouldn't I? \n \n I'm not against someone for pointing out the good and bad of anything or anyone. But liberals have so demeaned the right to speak one's own mind that it is dangerous to say anything for fear that it will be used against someone so best to say nothing. In this event I pointed out that Mr. Hutton portrayed Mao is a somewhat positive light. Using the same standards as the liberals have used, I trashed Hutton. However, I hadn't heard of him anyway. And I doubt I would have heard of most European economists but I was responding to Jo's question about him and responded with my quick take. I would have had to follow his thoughts over a long period of time before I would have fully understood him well.", 
   {}, 
   134467, 
   null, 
   1118252760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  \"It's the economy, stupid.\"  (Socialism taking its well deserved hit.)", 
  "url": "http://www.4forums.com/political/european-politics-economics/5519-its-economy-stupid-socialism-taking-its-well-deserved-hit.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 5519, 
  "discussion_files": [
   [
    "22886.html", 
    "http://www.4forums.com/political/european-politics-economics/5519-its-economy-stupid-socialism-taking-its-well-deserved-hit-print.html"
   ], 
   [
    "22887.html", 
    "http://www.4forums.com/political/european-politics-economics/5519-its-economy-stupid-socialism-taking-its-well-deserved-hit-4-print.html"
   ], 
   [
    "22888.html", 
    "http://www.4forums.com/political/european-politics-economics/5519-its-economy-stupid-socialism-taking-its-well-deserved-hit-3-print.html"
   ], 
   [
    "22889.html", 
    "http://www.4forums.com/political/european-politics-economics/5519-its-economy-stupid-socialism-taking-its-well-deserved-hit-2-print.html"
   ]
  ], 
  "identifier": 5519
 }
]