[
 [
  [
   133516, 
   null, 
   "Missouri Mule", 
   "The Chinese market is now down over 50% in the past year.\n And we have geniuses here who constantly bemoan the American economy. Go figure.\n ======================\n China Stock Market Continues to Tank\n Dow Jones newswires | June 5, 2005 | Dow Jones\n \n SHANGHAI (Dow Jones)--China's benchmark share index fell to its lowest in eight years Monday on mounting concerns over the trial sale of nontradable shares. The Shanghai Composite Index shed 1.4% early Monday to 998.63. It was the first time the index fell below 1000 points since Feb. 21, 1997, when it hit an intraday low of 967.49.\n \n (MORE) Dow Jones Newswires 06-05-05 2315ET\n \n If the Chinese economic reforms have produced one great lesson so far, it is this: wealth is created by entrepreneurs, laborers and managers, not the government.\n \n http://www.atimes.com/atimes/China/GE24Ad03.html", 
   {
    "post_info": {
     "post_title": "So much for the wonderful Chinese economy."
    }
   }, 
   null, 
   null, 
   1118037420.0
  ], 
  [
   133517, 
   null, 
   "Symbiote", 
   "Its true, the Chinese economy was and still is a bubble.\n \n You seem to think that if your trading partners have problems, this makes you stronger. The reverse is true. China's problems will make America's worse, and vice versa.\n \n Now if you want to sit there and toss off about the superiority of the American system, be my guest, but you're just a nationalist with no desire to understand, let alone deal with, real problems.", 
   {}, 
   133516, 
   null, 
   1118038080.0
  ], 
  [
   133518, 
   null, 
   "Missouri Mule", 
   "Its true, the Chinese economy was and still is a bubble.\n \n You seem to think that if your trading partners have problems, this makes you stronger. The reverse is true. China's problems will make America's worse, and vice versa.\n \n Now if you want to sit there and toss off about the superiority of the American system, be my guest, but you're just a nationalist with no desire to understand, let alone deal with, real problems.\n\n \n I don't think that. I was making the point that socialism is a failure and that the market economy is vastly superior.", 
   {}, 
   133517, 
   null, 
   1118038320.0
  ], 
  [
   133525, 
   null, 
   "Symbiote", 
   "I agree with you that the free market is the best and most just economic system.\n \n The problem is, you don't believe in the market, you believe in America, whatever form it may take - Socialist, Fascist, Capitalist, whatever, it doesn't matter to you.\n \n China has repeatedly taken free-market reforms. It is still in many respects less free than the US - but at least it is moving in the right direction. The US economy on the other hand is becoming more socialist by the day.\n \n In this thread, you criticise the falls on the stock market - ignoring the fact (probably because you did not understand the article), that the falls took place because of market reforms - because of the privatisation of previously publically held stocks.\n \n So for you to XXXX on about how socialism sucks and this fall proves it, you're only shooting yourself in the foot, as usual, to get a cheap \"bash the foreigners\" gag in.\n \n In attempting to criticise \"socialist\" China, you post an article talking about the detrimental effects of stock privatization, and calling for more \"effective regulation\".\n \n So there's the current situation, people like you call for \"socialist China\" to better \"regulate\" its \"anything goes\" markets. The author laments \"capital flowing so freely\"", 
   {}, 
   133518, 
   null, 
   1118039100.0
  ], 
  [
   133534, 
   null, 
   "Missouri Mule", 
   "I agree with you that the free market is the best and most just economic system.\n \n The problem is, you don't believe in the market, you believe in America, whatever form it may take - Socialist, Fascist, Capitalist, whatever, it doesn't matter to you.\n \n China has repeatedly taken free-market reforms. It is still in many respects less free than the US - but at least it is moving in the right direction. The US economy on the other hand is becoming more socialist by the day.\n \n In this thread, you criticise the falls on the stock market - ignoring the fact (probably because you did not understand the article), that the falls took place because of market reforms - because of the privatisation of previously publically held stocks.\n \n So for you to XXXX on about how socialism sucks and this fall proves it, you're only shooting yourself in the foot, as usual, to get a cheap \"bash the foreigners\" gag in.\n \n In attempting to criticise \"socialist\" China, you post an article talking about the detrimental effects of stock privatization, and calling for more \"effective regulation\".\n \n So there's the current situation, people like you call for \"socialist China\" to better \"regulate\" its \"anything goes\" markets. The author laments \"capital flowing so freely\"\n\n \n I absolutely do believe in the free market system. I do, however, believe that it is necessary to have regulation so that incidents like Enron and the like don't happen because of sleight of hand con men. What you do is to see the ground rules; like a game of football. The game is played within these boundaries. And then the game begins. That's more or less what happens in the U.S.. There are, to be sure, some corrections that need to be made. However, a planned, or command economy where the rules of supply and demand and the other proven economic principles are cast aside do not work. This is why the economies of France and Germany are in such a mess. And the Chinese economy is a disaster waiting to happen. It is said that the stock market it a leading indicator. This bodes very bad for the Chinese economy and by extension the world economy. There is very likely to be some significant political instability within China and markets definitely does not like uncertainty.\n \n The Chinese economy is an economic \"bubble\" that will burst with all of its attendant fallout. Probably the most serious is that of the Chinese banking system which is beyond bad. It is worse than worst. I've provided these numbers in the past and they are truly frightening.", 
   {}, 
   133525, 
   null, 
   1118041440.0
  ], 
  [
   133542, 
   null, 
   "Symbiote", 
   "The French and German economies are \"mixed\", just like the US's. They are by no means \"command economies\". By calling them \"command economies\" you give real command economies a good name.\n \n Iraq has a command economy, great job US admin with those price controls.\n \n And again, clearly you did not understand this article. Why are you criticising China for its market reforms? For selling off nationally owned stocks? This is what you say you are for, in principle, but when its put into practice, you oppose it.\n \n The numbers you \"provided\" were shown, IIRC, to be several years out of date and no longer relevant.\n \n You believe in the \"Free Market\" in the same way you believe in \"Free Speech\" - you believe the \"Free Market\" is whatever the US courts decide, and anything not in the US is therefore not Free.", 
   {}, 
   133534, 
   null, 
   1118044080.0
  ], 
  [
   133547, 
   null, 
   "Duo_Maxwell", 
   "lol. This is amusing. \n \n Stock prices, whether they be in Tokyo, London or New York are to a degree, bad indictors of the actual economy. Stock prices are based upon consumer confidence. If the consumer does not have confidence in the stock, it will drop due to mass sellings. In fact, many stock prices are bad indictors of the companies they represent. The price earnings ratio is complete garbage, that can be manipulated so many ways that anyone with basic accounting doesn't put any value in the ratio. Many companies in the US are overvauled in their stock, many ridiculously such as google, a loss of 50% of the \"value\" doesn't actually mean the company is bad, merely consumers were spooked. Seriously, basic finance. \n \n The article seems to be that the Chinese government is moving from state control to private control. As such, it should be no suprise that uncertainty will follow such a drastic change of 'ownership.' Where ever you are, consumers don't like drastic change. There has never been a period in history where drastic economic change has lead to short term certainly and stability. As such, we should expect uncertainty to follow China's actions. Hence, a drop in the stock market isn't unforseen. In fact, it should happen as stocks are a relatively liquid asset and in times of uncertainty people tend to accumulate assets that can quickly be traded for what they need. \n \n I don't see what Mule's *****ing about. It seems that their actions caused a by the book consequence that doesn't prove either the weakness or the strength of China's economy. What will prove the strength or weakness is what follows this, will a major capitalistic free enterprise economy in China lead to a new economic superpower or will contiuned government interference stagnate the economy? Only time will tell.\n \n My advice to Mule, stop talking about anything that has to do with economics or finance. It is quite clear you know very little about both.", 
   {}, 
   133542, 
   null, 
   1118045640.0
  ], 
  [
   133586, 
   null, 
   "daewoo", 
   "The non-tradable shares are shares that have been held by various government units as well as legally defined entities. Their sale would bring enormous downward pressure on the markets because the nontradable shares constitute 64% of market value, 74% of which belongs to the state.\n\n \n Wow, 64% of market value, and dumped on the market overnight. That was not a real hot idea, unless the plan is to drive the market to its bottom so that anybody with more intelligence than a rabbit can buy in low (again) and make a fortune on the rebound. \n \n This is a MAJOR market reform. They essentially just privatized all of the previosly held state companies. This would be a good time to start looking at the market and finding a chinese broker. The privatization will bring bucu foreign investment.", 
   {}, 
   133547, 
   null, 
   1118070000.0
  ], 
  [
   133625, 
   null, 
   "georged", 
   "Wow, 64% of market value, and dumped on the market overnight. That was not a real hot idea, unless the plan is to drive the market to its bottom so that anybody with more intelligence than a rabbit can buy in low (again) and make a fortune on the rebound. \n \n This is a MAJOR market reform. They essentially just privatized all of the previosly held state companies. This would be a good time to start looking at the market and finding a chinese broker. The privatization will bring bucu foreign investment.\n\n \n The only fly in the soup is that 90% of all listed companies are still under government control. China's stock market has always been a tool to successfully separate individual investors from their money. This was the first of four steps in planned reform, announced and described in detail last month. I'm surprised gamehuis isn't ordering a new yacht from short positions. \n \n Anyone who uses China's stock markets to gauge China's economy is pathetically uninformed about capital formation. That means they're unaware of listing requirements, lack of regulation and, most important, intent.", 
   {}, 
   133586, 
   null, 
   1118076600.0
  ], 
  [
   133628, 
   null, 
   "Missouri Mule", 
   "The French and German economies are \"mixed\", just like the US's. They are by no means \"command economies\". By calling them \"command economies\" you give real command economies a good name.\n \n Iraq has a command economy, great job US admin with those price controls.\n \n And again, clearly you did not understand this article. Why are you criticising China for its market reforms? For selling off nationally owned stocks? This is what you say you are for, in principle, but when its put into practice, you oppose it.\n \n The numbers you \"provided\" were shown, IIRC, to be several years out of date and no longer relevant.\n \n You believe in the \"Free Market\" in the same way you believe in \"Free Speech\" - you believe the \"Free Market\" is whatever the US courts decide, and anything not in the US is therefore not Free.\n\n \n I believe you have misstated what I said. I never said (although you inferred) that France and Germany had command type economies. However, as a government becomes more socialistic there is logically more distortion of the market forces. This would be in the form of guaranteed work weeks and social benefits that can't be supported except through excessive taxation. A true command economy would be the old Stalinist model. France and Germany are not but they are trending or have been involved in \"commanding\" certain social ends to be achieved such as the asinine 35 hour work week.\n \n In my opinion, the reforms in China are illusory. Unless and until they clean up the banking system and become a true democracy they are heading off the cliff. Their tanking stock market is a precursor for the disaster to come.", 
   {}, 
   133542, 
   null, 
   1118077080.0
  ], 
  [
   133638, 
   null, 
   "daewoo", 
   "The only fly in the soup is that 90% of all listed companies are still under government control. China's stock market has always been a tool to successfully separate individual investors from their money. This was the first of four steps in planned reform, announced and described in detail last month. I'm surprised gamehuis isn't ordering a new yacht from short positions. \n \n Anyone who uses China's stock markets to gauge China's economy is pathetically uninformed about capital formation. That means they're unaware of listing requirements, lack of regulation and, most important, intent.\n\n \n I would certainly agree that only an idiot would read anything into the chinese stock market as far as an indicator of economic health. The very idea is frankly preposterous.\n \n I think that as they carry out the rest of their (short term) reform plan, the chinese stock market will experience growth. \n \n Governement control of listed companies is indeed a problem. Witht he governement essentially unloading their stock, it seems that they are willing to give up some control. The problem is that if control passes from the governement and you are not already in, you have missed the boat. \n \n BTW, MM does not like/understand big words like \"capital formation\", \"listing requirements\" or \"regulation\". They are technical mumbo jumbo.\n \n \n Personally, I find it interesting that MM would see fit to comment on this at all. Look at the US market. It is so out of parity with valuation it is rediculous.", 
   {}, 
   133625, 
   null, 
   1118078520.0
  ], 
  [
   133639, 
   null, 
   "Jo Bennett", 
   "Limited working weeks enhance productivity. Britain opts out of the working time directive (max 48 hour week) and the result is low producivity. If people work shorter hours then, up to a point, they will do pretty much the same work, but in less time.", 
   {}, 
   133628, 
   null, 
   1118078580.0
  ], 
  [
   133651, 
   null, 
   "Missouri Mule", 
   "Limited working weeks enhance productivity. Britain opts out of the working time directive (max 48 hour week) and the result is low producivity. If people work shorter hours then, up to a point, they will do pretty much the same work, but in less time.\n\n \n You really take the kool-aid, don't you?", 
   {}, 
   133639, 
   null, 
   1118079240.0
  ], 
  [
   133652, 
   null, 
   "gamehuis", 
   "I'm surprised gamehuis isn't ordering a new yacht from short positions.\n\n Heh, I'm sorry but I was too busy shorting US semiconductor stocks for the past year. :p", 
   {}, 
   133625, 
   null, 
   1118079300.0
  ], 
  [
   133653, 
   null, 
   "Missouri Mule", 
   "I would certainly agree that only an idiot would read anything into the chinese stock market as far as an indicator of economic health. The very idea is frankly preposterous.\n \n I think that as they carry out the rest of their (short term) reform plan, the chinese stock market will experience growth. \n \n Governement control of listed companies is indeed a problem. Witht he governement essentially unloading their stock, it seems that they are willing to give up some control. The problem is that if control passes from the governement and you are not already in, you have missed the boat. \n \n BTW, MM does not like/understand big words like \"capital formation\", \"listing requirements\" or \"regulation\". They are technical mumbo jumbo.\n \n Personally, I find it interesting that MM would see fit to comment on this at all. Look at the US market. It is so out of parity with valuation it is rediculous.\n\n \n Like our stock market is not an leading indicator of future economic activity? So the Chinese stock market is different, is it? They have repealed the laws of economics? \n \n Really, why don't you tell us all about our market and \"parity with valuation?\"", 
   {}, 
   133638, 
   null, 
   1118079480.0
  ], 
  [
   133659, 
   null, 
   "lord tammerlain", 
   "The Chinese stock market does not function in the same open manner that the NYSE does, it is not as liquid, and far more open to manipulation from individual investors and the Chinese government.\n \n I would not invest in the Chinese stock market as an outsider, and if I was Chinese before I invested in the Chinese stock market I would have placed more then a few bribes with different governmental officials at both the provincial and federal government levels.", 
   {}, 
   133653, 
   null, 
   1118080020.0
  ], 
  [
   133661, 
   null, 
   "Missouri Mule", 
   "The Chinese stock market does not function in the same open manner that the NYSE does, it is not as liquid, and far more open to manipulation from individual investors and the Chinese government.\n \n I would not invest in the Chinese stock market as an outsider, and if I was Chinese before I invested in the Chinese stock market I would have placed more then a few bribes with different governmental officials at both the provincial and federal government levels.\n\n \n A lot of people do and the insiders and others are putting out a \"sell\" signal that something is terribly wrong. I'd heed their advice. I never ignore a stock market. It can easily turn into a stampede. That's what set off the Great Depression.", 
   {}, 
   133659, 
   null, 
   1118080200.0
  ], 
  [
   133663, 
   null, 
   "lord tammerlain", 
   "For China I would watcht the Real Estate values along the coast as a far better indicator of the internal Chinese economy ( bubble like conditions like the the coastal US )", 
   {}, 
   133661, 
   null, 
   1118080440.0
  ], 
  [
   133667, 
   null, 
   "Missouri Mule", 
   "For China I would watcht the Real Estate values along the coast as a far better indicator of the internal Chinese economy ( bubble like conditions like the the coastal US )\n\n \n Aren't they a little out of whack as well?", 
   {}, 
   133663, 
   null, 
   1118080500.0
  ], 
  [
   133672, 
   null, 
   "daewoo", 
   "Like our stock market is not an leading indicator of future economic activity? So the Chinese stock market is different, is it? They have repealed the laws of economics? \n\n \n Besides not being freely traded? and no, the stock market in any nation is a pretty bad indicator of future economic activity. The stock market is a good indicator of consumer confidence, though. In the US, nearly 80% of trading is doen by institutional traders churning comissions. \n \n \nReally, why don't you tell us all about our market and \"parity with valuation?\"\n\n \n \n If someboyd with some credibility wants to take that up I would be happy to. I would be surprised if you understand the term \"parity with evaluation\".", 
   {}, 
   133653, 
   null, 
   1118081100.0
  ], 
  [
   133730, 
   null, 
   "Missouri Mule", 
   "Besides not being freely traded? and no, the stock market in any nation is a pretty bad indicator of future economic activity.  The stock market is a good indicator of consumer confidence, though. In the US, nearly 80% of trading is doen by institutional traders churning comissions. \n \n If someboyd with some credibility wants to take that up I would be happy to. I would be surprised if you understand the term \"parity with evaluation\".\n\n \n If you don't believe that the stock market is a leading indicator then you don't understand anything about economics. \n \n Why don't you explain your high fallooting term \"parity with evaluation?\" You go on with these big words when you could have used words that the common man understands. I told you before; I'm not impressed.", 
   {}, 
   133672, 
   null, 
   1118086380.0
  ], 
  [
   133774, 
   null, 
   "daewoo", 
   "If you don't believe that the stock market is a leading indicator then you don't understand anything about economics. \n \n Why don't you explain your high fallooting term \"parity with evaluation?\" You go on with these big words when you could have used words that the common man understands. I told you before; I'm not impressed.\n\n \n \n As I said, I am not going to deabte this with you because you are financially illiterate and have 0 credibility. If somebody else wants to step up and debate it, I will be happy to.", 
   {}, 
   133730, 
   null, 
   1118089980.0
  ], 
  [
   133790, 
   null, 
   "Duo_Maxwell", 
   "Funny how that works. I said basically what you guys said and Mule completely ignored me.\n \n *sigh* Mule really should just stop talking about anything that has to do with finance.", 
   {}, 
   133774, 
   null, 
   1118093160.0
  ], 
  [
   133874, 
   null, 
   "georged", 
   "Funny how that works. I said basically what you guys said and Mule completely ignored me.\n \n *sigh* Mule really should just stop talking about anything that has to do with finance.\n\n \n He erroneously thinks he does, which is why he keeps posting and continually displaying his lack of knowledge. If you've noticed, people are beginning to ignore his comments.", 
   {}, 
   133790, 
   null, 
   1118101380.0
  ], 
  [
   133880, 
   null, 
   "Dono", 
   "He erroneously thinks he does, which is why he keeps posting and continually displaying his lack of knowledge. If you've noticed, people are beginning to ignore his comments.\n\n \"It is better to remain silent and be thought a fool, than open one's mouth and remove all doubt.\"\n Dono", 
   {}, 
   133874, 
   null, 
   1118101980.0
  ], 
  [
   133898, 
   null, 
   "Missouri Mule", 
   "As I said, I am not going to deabte this with you because you are financially illiterate and have 0 credibility. If somebody else wants to step up and debate it, I will be happy to.\n\n \n No, you are the idiot. I have been reading the WSJ for 35 years and have never seen the term. You are throwing out these 10 dollar words and the sycophants who kiss your rear end come along and chime in. Never, but never is there any intellectual depth to what you say. It is just more of the same old bilge. You are an ignoramus and an XXX.", 
   {}, 
   133774, 
   null, 
   1118104080.0
  ], 
  [
   133899, 
   null, 
   "Waxy", 
   "No, you are the idiot. I have been reading the WSJ for 35 years and have never seen the term. You are throwing out these 10 dollar words and the sycophants who kiss your rear end come along and chime in. Never, but never is there any intellectual depth to what you say. It is just more of the same old bilge. You are an ignoramus and an XXX.\n\n \n LOL, that's tellin' him! :p \n \n Waxy", 
   {}, 
   133898, 
   null, 
   1118104260.0
  ], 
  [
   133910, 
   null, 
   "georged", 
   "No, you are the idiot. I have been reading the WSJ for 35 years and have never seen the term. You are throwing out these 10 dollar words and the sycophants who kiss your rear end come along and chime in. Never, but never is there any intellectual depth to what you say. It is just more of the same old bilge. You are an ignoramus and an XXX.\n\n \n When it comes to finance and economics, your definition of intellectual depth and knowledge is the opposite of anything I've ever experienced and I've lived in that world for many years. Like many mature people who think they know what they're talking about and don't have a clue, you resort to personal attacks when your limited knowledge is exhausted.", 
   {}, 
   133898, 
   null, 
   1118105220.0
  ], 
  [
   133915, 
   null, 
   "Missouri Mule", 
   "When it comes to finance and economics, your definition of intellectual depth and knowledge is the opposite of anything I've ever experienced and I've lived in that world for many years. Like many mature people who think they know what they're talking about and don't have a clue, you resort to personal attacks when your limited knowledge is exhausted.\n\n \n More bilge. I've been attacked numerous times by you and your joined at the hip groupies here and it always devolves into an ad hominem attack on my mental ability or my knowledge. For once in my life, I would actually like to hear an analysis of economics that makes sense.\n \n I don't know what your background is or whether you are rolling in money. It wouldn't make any difference how wealthy or learned you think you are. It only makes a difference in what you know. Thus far I haven't seen anything that suggests you know what you are talking about. Am I wrong? And if I am wrong, tell me why I am wrong. Otherwise I assume you are just talking to hear your head rattle.", 
   {}, 
   133910, 
   null, 
   1118105580.0
  ], 
  [
   133919, 
   null, 
   "Duo_Maxwell", 
   "If you don't believe that the stock market is a leading indicator then you don't understand anything about economics.\n\n \n Comming from the person who doesn't even understand what economics is, the whole oxymoron socialist economist kind of did you in with that. The stock market is merely a sign of consumer confidence. It doesn't evaluate the true strength or weakenss of the economy. Stocks themselves are bad indicators of a company's worth. Google has relatively no assets yet its stock price is outrageous. You clearly ignored the reason why China's stock market dropped: drastic economic changes. You also clearly ignored that the stock market SHOULD fall under such actions as people cling to liquid assets in times of uncertainty. \n \n Really, just shutup about anything having to do with economics or finance, you're only making yourself appear dumber then you were the day before", 
   {}, 
   133730, 
   null, 
   1118105820.0
  ], 
  [
   133924, 
   null, 
   "Missouri Mule", 
   "Comming from the person who doesn't even understand what economics is, the whole oxymoron socialist economist kind of did you in with that. The stock market is merely a sign of consumer confidence. It doesn't evaluate the true strength or weakenss of the economy. Stocks themselves are bad indicators of a company's worth. Google has relatively no assets yet its stock price is outrageous. You clearly ignored the reason why China's stock market dropped: drastic economic changes. You also clearly ignored that the stock market SHOULD fall under such actions as people cling to liquid assets in times of uncertainty. \n \n Really, just shutup about anything having to do with economics or finance, you're only making yourself appear dumber then you were the day before\n\n \n Tell you what. Why don't you tell me what you know about the Chinese banking system? This should be good.", 
   {}, 
   133919, 
   null, 
   1118106060.0
  ], 
  [
   133932, 
   null, 
   "Duo_Maxwell", 
   "Tell you what. Why don't you tell me what you know about the Chinese banking system? This should be good.\n\n \n Changing the subject as well aren't we?  \n \n Sure, no problem. The chinese banking system is the reason for the major uncertainly in the economy as the banking system has been the primary driver of the recent expansion. The problem is that the banking system has relatively little regulation and the banks have gone somewhat insane in the amount of loans they have let out. Litterally anyone could get a loan. Also, as I recall the RR set for the banking system is pretty pathetic not to mention that the amount of defaults is already alarming. Should the banking system take a hint, the economy could litterally collapse as banks recall the loans and debetors default at astronomical rates.\n \n But I hardly expect you to understand that as it requires some finance background. :) \n \n For someone who reads the WJS, you sure seem to skip alot of it.", 
   {}, 
   133924, 
   null, 
   1118106480.0
  ], 
  [
   133938, 
   null, 
   "daewoo", 
   "No, you are the idiot. I have been reading the WSJ for 35 years and have never seen the term. You are throwing out these 10 dollar words and the sycophants who kiss your rear end come along and chime in. Never, but never is there any intellectual depth to what you say. It is just more of the same old bilge. You are an ignoramus and an XXX.\n\n \n \n Thats not even a strictly economic term.\n \n Parity-\n Equality, as in amount, status, or value.\n \n Valuation-\n The act or process of assessing value or price; an appraisal.\n \n Yes, they are big words, but words that most people should be familiar with. \n \n translation-\n The US market is over pumped. Stocks are generally higher than they should be given the strengths and weaknesses of the companies in question.\n \n I didn't realise until your next post that you would have trouble with the term. You see, in theory, you hould be able to look at a companies financial data, the number of outstanding shares, and more or less be able to extrapoalte their stock price. Doesn't work in the US, because XXXXXX like you ignore the financial data and buy ford stock because you think the 500 is neat. \n \n Again, I am not going to debte you on this becuse it is useless. Even when you are unquestionably proven wrong, and your argument is shown to be a complete load of garbage, you do not change your posiiton. You are hopeless. If somebody else wants to debate it (waxy....step on up if you like) I am happy to do so.\n \n I doubt you will see it though, since most here who have followed our debates probably look at the posityions and go \"daewoos right, mules wrong\" becuse you have been wrong every other time, why not this time?? It is like watching somebody debate oil with waxy. There is just no point. Waxy has established his credentials in that arena. Now, if Waxy was debating against somebody else who had established some knowledge in that area, I would watch with interest. \n \n You have not established any knowledge in the realm of economics or finance. In fact, the exact opposite is true. You have consistently displayed a complete ignorance in those areas.", 
   {}, 
   133898, 
   null, 
   1118107200.0
  ], 
  [
   133940, 
   null, 
   "Duo_Maxwell", 
   "Ah, but Daewoo you CAN extrapoalte the real stock price of a company if you have the financial statements. It just of course takes some work, some accounting knowledge and some basic math.\n \n Do you think Mule knows anything about the Chinese banking system?", 
   {}, 
   133938, 
   null, 
   1118107560.0
  ], 
  [
   133941, 
   null, 
   "daewoo", 
   "Changing the subject as well aren't we?  \n \n Sure, no problem. The chinese banking system is the reason for the major uncertainly in the economy as the banking system has been the primary driver of the recent expansion. The problem is that the banking system has relatively little regulation and the banks have gone somewhat insane in the amount of loans they have let out. Litterally anyone could get a loan. Also, as I recall the RR set for the banking system is pretty pathetic not to mention that the amount of defaults is already alarming. Should the banking system take a hint, the economy could litterally collapse as banks recall the loans and debetors default at astronomical rates.\n\n \n Sorry, Duo, but you are only part right here. A large portion of the chinese banking system is governemtn owned/operated. The majority of defaulted laons (ones big enough to matter anyway) are madef rom these government owned banks to government owned businesses. When a governemtn owned business defaults on a loan to a governmetn owned bank, you have essentially tranferred debt liability from one subsidery to another. In these cases, there is no real loss to the parent corporation (the government int eh case of china). They are simply shifting money between subsidaries without being blatently obvious about it.", 
   {}, 
   133932, 
   null, 
   1118107560.0
  ], 
  [
   133943, 
   null, 
   "Duo_Maxwell", 
   "hey, I haven't read anything about the system in a long time. That's just what I recalled.", 
   {}, 
   133941, 
   null, 
   1118107680.0
  ], 
  [
   133946, 
   null, 
   "georged", 
   "More bilge. I've been attacked numerous times by you and your joined at the hip groupies here and it always devolves into an ad hominem attack on my mental ability or my knowledge. For once in my life, I would actually like to hear an analysis of economics that makes sense.\n \n\n \n Innumerable posts on finance and economics have been devoted to attempts to enlighten you with facts by posters possessing education, knowledge and experience in those fields, which you adamantly reject in favor of your own, obviously second-hand opinions from selected media sources, defined by political loyalty and/or supported by advertising revenue. From your responses, not only do you lack any apparent grounding in the basics of those fields such as formal education or self-taught study (of which media is excluded), you obviously have no practical experience. \n \n That is not an ad hominem attack, but simple statement of facts based on your general posting content.", 
   {}, 
   133915, 
   null, 
   1118107800.0
  ], 
  [
   133995, 
   null, 
   "Missouri Mule", 
   "Innumerable posts on finance and economics have been devoted to attempts to enlighten you with facts by posters possessing education, knowledge and experience in those fields, which you adamantly reject in favor of your own, obviously second-hand opinions from selected media sources, defined by political loyalty and/or supported by advertising revenue. From your responses, not only do you lack any apparent grounding in the basics of those fields such as formal education or self-taught study (of which media is excluded), you obviously have no practical experience. \n \n That is not an ad hominem attack, but simple statement of facts based on your general posting content.\n\n \n Look, let's cut the bull. You and your cohorts here have been trashing the U.S. economy. The sky is falling, etc. The Chinese economy is more productive; that sort of nonsense. Or put succinctly:\n \n \"It was once said of Hegel that he set out his philosophy with such obscurity that people finished by thinking it profound.\" (Daewoo's modus operandi.)\n \n What I have said is that our economy is not going into the tank. That our economy is the most productive in the entire world. That we have the highest standard of living and the highest per capita income and purchasing power of any nation on earth. These are demonstrable facts that cannot be disproven.\n \n You and your ilk keep floating these esoteric if not meaningless terms and mumbo-jumbo that no established economist or anyone else I know accepts. Your views would be roughly comparable to John Kenneth Galbraith when he declared that the Soviet economy was superior to ours back about 1984. He said something to the effect that it was more efficient or some such nonsense. We were bound to in the long run come out second best to their wonderful system. \n \n http://www.campusreportonline.net/main/articles.php?id=68 \n \n Thank you very much but I'll take my cues from Lawrence Kudlow, Milton Friedman and Thomas Sowell if you don't mind. I'm not here to be cowed by the likes of you.", 
   {}, 
   133946, 
   null, 
   1118118660.0
  ], 
  [
   133999, 
   null, 
   "lord tammerlain", 
   "\n What I have said is that our economy is not going into the tank. That our economy is the most productive in the entire world. That we have the highest standard of living and the highest per capita income and purchasing power of any nation on earth. These are demonstrable facts that cannot be disproven.\n \n .\n\n \n \n I wont comment on the productivity, but yes the US does have the highest standard of living and one of the highest per capita incomes, ( a few much smaller countries are higher) and a very high purchasing power.\n \n That is the problem, they are not sustainable anymore. You yourself have commented about the high wages and benifits that the Union employees  have which makes their companies uncompetitive. Reduce their wages and the overall standard of living in the US is going to drop. Then the other producers in the US have to drop their wages and benifits to compete with the newly lowered union contracts. \n \n When you compare the standard of living in the US, Europe, the cost of production in the US and Europe to that of India and China, a simple fact should stare out at you. We are going to drop to meet them as they rise up to meet us. Will their be differences sure, but nowwhere near what they are now. As it stands I would not want to be in the lower 50% on the economic/education scale in the US or Europe in the coming decades.", 
   {}, 
   133995, 
   null, 
   1118119800.0
  ], 
  [
   134019, 
   null, 
   "daewoo", 
   "Look, let's cut the bull. You and your cohorts here have been trashing the U.S. economy. The sky is falling, etc. The Chinese economy is more productive; that sort of nonsense. Or put succinctly:\n \n \"It was once said of Hegel that he set out his philosophy with such obscurity that people finished by thinking it profound.\" (Daewoo's modus operandi.)\n\n \n We haev not even adressed any advanced economic concepts. The vast majority of wht we discuss here is the kind of thing that any high shool senior should understand.\n \n The fact that you have yet to support even a single one of your arguments should tell you something about where you are getting your cues. You keep getting whipped and sent home crying. You have no credibility left, and your ignorance is so obvious as to be laughable. Since nearly everything you have argued here has been proven wrong, you should probably re-examine your grasp of even simple economic concepts. \n \n I have backed my position with facts and logic. You have not. That is allt here is to it.", 
   {}, 
   133995, 
   null, 
   1118123880.0
  ], 
  [
   134055, 
   null, 
   "Symbiote", 
   "Mule says:\n \n \nThere are, to be sure, some corrections that need to be made. However, a planned, or command economy where the rules of supply and demand and the other proven economic principles are cast aside do not work. This is why the economies of France and Germany are in such a mess.\n\n \n Mule says:\n \n \nI never said (although you inferred) that France and Germany had command type economies.\n\n \n Command economies do not work - this is why France and Germany are in such a mess. But France and Germany aren't command economies. This making sense to anyone else?", 
   {}, 
   133653, 
   null, 
   1118150160.0
  ], 
  [
   134121, 
   null, 
   "Nurglitch", 
   "About as much as anything else the Mule ever posts.", 
   {}, 
   134055, 
   null, 
   1118166840.0
  ], 
  [
   134129, 
   null, 
   "gamehuis", 
   "Maybe someone like VoR understands, but I sure the Hell don't.", 
   {}, 
   134121, 
   null, 
   1118167740.0
  ], 
  [
   134594, 
   null, 
   "Missouri Mule", 
   "I wont comment on the productivity, but yes the US does have the highest standard of living and one of the highest per capita incomes, ( a few much smaller countries are higher) and a very high purchasing power.\n \n That is the problem, they are not sustainable anymore. You yourself have commented about the high wages and benifits that the Union employees  have which makes their companies uncompetitive. Reduce their wages and the overall standard of living in the US is going to drop. Then the other producers in the US have to drop their wages and benifits to compete with the newly lowered union contracts. \n \n When you compare the standard of living in the US, Europe, the cost of production in the US and Europe to that of India and China, a simple fact should stare out at you. We are going to drop to meet them as they rise up to meet us. Will their be differences sure, but nowwhere near what they are now. As it stands I would not want to be in the lower 50% on the economic/education scale in the US or Europe in the coming decades.\n\n \n This is part of the misunderstanding that people outside of the U.S. and resident dunces like Daewoo have with the U.S. Only about 13% of the American work force is comprised of union workers. Take away the government workers and the teacher's unions and unionism is about dead in the U.S. It served its place in its time. It is now an anachronism that will finally die, somewhat slowly and with a lot of bellowing and posturing, but it will die. Unions are uncompetitive and do not mesh with our free market system any longer. And yet with the unions dying we still have the highest standard of living in the world. But somehow the gloomsters and doomsters (like Daewoo, georged and Duo) daily ponitificate and tell us we are going down the tubes. We have been told this for decades and it never seems to happen. Maybe in my next lifetime I will finally see this happen, but not in this lifetime.", 
   {}, 
   133999, 
   null, 
   1118253420.0
  ], 
  [
   134607, 
   null, 
   "daewoo", 
   "This is part of the misunderstanding that people outside of the U.S. and resident dunces like Daewoo have with the U.S. Only about 13% of the American work force is comprised of union workers. Take away the government workers and the teacher's unions and unionism is about dead in the U.S. It served its place in its time. It is now an anachronism that will finally die, somewhat slowly and with a lot of bellowing and posturing, but it will die. Unions are uncompetitive and do not mesh with our free market system any longer. And yet with the unions dying we still have the highest standard of living in the world. But somehow the gloomsters and doomsters (like Daewoo, georged and Duo) daily ponitificate and tell us we are going down the tubes. We have been told this for decades and it never seems to happen. Maybe in my next lifetime I will finally see this happen, but not in this lifetime.\n\n \n You do understand that high union wages are not only indicitive of, but help drive, high wages overall, right?\n \n Also, I and others who have a LOT more financial knowledge and understanding than you have posted pages and pages of data that back our position. You have posted none that backs yours. \n \n you are right about one thing. For decades we have been warned. Now the barbarians are at the gate, and XXXXXX like youare still reveling in Americas past glory. Sad.", 
   {}, 
   134594, 
   null, 
   1118253960.0
  ], 
  [
   134628, 
   null, 
   "lord tammerlain", 
   "You do understand that high union wages are not only indicitive of, but help drive, high wages overall, right?\n \n\n \n \n MM, the above part posted by daewoo is a very important peice of information.\n \n Take away high union pay and wages, then the bar for that type of job is lowered. Lower pay and fewer benifits for non union employees like those at Nissan plants. Lower standard of living.\n \n Then you get the secondary effects, because the auto industry now pays it employees less overall, they have less to spend, less to spend means that retailers like Circuit City are going to sell less in overall dollar terms, causing them to hold the line on wage increases, and force them to buy goods from lower cost producers.\n \n The US, Europe are facing a big big problem with India and China from an economic standpoint. The US/Europe are high cost countries, which is fine if they are competing between them selves as the differences are easily worked out. But when trying to compete with China or India where direct costs are in India less then 25% for highly skilled employees and in China 10% or less for the manual labor positions. Trying to adjust our production costs to match those cost structures is going to require a massive adjustment, that I dont think anyone here in the west wants to make.", 
   {}, 
   134607, 
   null, 
   1118255280.0
  ], 
  [
   134946, 
   null, 
   "Missouri Mule", 
   "You do understand that high union wages are not only indicitive of, but help drive, high wages overall, right?\n \n Also, I and others who have a LOT more financial knowledge and understanding than you have posted pages and pages of data that back our position. You have posted none that backs yours. \n \n you are right about one thing. For decades we have been warned. Now the barbarians are at the gate, and XXXXXX like youare still reveling in Americas past glory. Sad.\n\n \n That's the party line. If for no other reason that wage inflation, unions are good. I'm not at all certain that contemporary students of the American economic scene necessarily buy into that theory. It is also another view that it is necessary to raise the minimum wage in order to push up on union wages. Unions have traditionally been at the forefront pushing for a higher minimum wage. Yet, as we all know, very few people actually work for the minimum wage. Something called the old \"supply and demand\" bugaboo keeps rearing its ugly head. But you wouldn't know anything about that concept, would you Mr. Inflation Man?", 
   {}, 
   134607, 
   null, 
   1118300400.0
  ], 
  [
   134947, 
   null, 
   "Missouri Mule", 
   "MM, the above part posted by daewoo is a very important peice of information.\n \n Take away high union pay and wages, then the bar for that type of job is lowered. Lower pay and fewer benifits for non union employees like those at Nissan plants. Lower standard of living.\n \n Then you get the secondary effects, because the auto industry now pays it employees less overall, they have less to spend, less to spend means that retailers like Circuit City are going to sell less in overall dollar terms, causing them to hold the line on wage increases, and force them to buy goods from lower cost producers.\n \n The US, Europe are facing a big big problem with India and China from an economic standpoint. The US/Europe are high cost countries, which is fine if they are competing between them selves as the differences are easily worked out. But when trying to compete with China or India where direct costs are in India less then 25% for highly skilled employees and in China 10% or less for the manual labor positions. Trying to adjust our production costs to match those cost structures is going to require a massive adjustment, that I dont think anyone here in the west wants to make.\n\n \n But you forgot one thing. Those Nissan employees will still be at work long after the overpaid union workers of GM are in the unemployment lines and on welfare after their pension plans are rendered null and void when GM files for Chapter 11. \n \n So whose the winner here? The overpaid and underworked union auto workers or the relatively well-off and secure in their jobs non-union auto workers? Not to mention that their wages won't be siphoned off to buy off the liberal politicians they support. \n \n Bottom line is that unions are now obsolete. The last union worker leaving should turn off the lights.", 
   {}, 
   134628, 
   null, 
   1118300700.0
  ], 
  [
   134950, 
   null, 
   "lord tammerlain", 
   "But you forgot one thing. Those Nissan employees will still be at work long after the overpaid union workers of GM are in the unemployment lines and on welfare after their pension plans are rendered null and void when GM files for Chapter 11. \n \n So whose the winner here? The overpaid and underworked union auto workers or the relatively well-off and secure in their jobs non-union auto workers? Not to mention that their wages won't be siphoned off to buy off the liberal politicians they support. \n \n Bottom line is that unions are now obsolete. The last union worker leaving should turn off the lights.\n\n \n \n MM you are not seeing the bigger picture of what lower wages means to the economy as a whole. Overall it has little to due with Union or non Union workers in the US it has to due with non union workers in China and India. As your above explantion indicated that union members were overpaid compared to non union Nissan workers, those non union Nissan workers are overpaid compared to South Korean workers, and vastly overpaid compared to Chinese workers. Eventually those non union Nissian workers will lose their jobs to the chinese worker.\n \n As you stated. Production of any tradable good in the US is now/will be obsolete, let the last American worker turn off the lights", 
   {}, 
   134947, 
   null, 
   1118301540.0
  ], 
  [
   134956, 
   null, 
   "daewoo", 
   "That's the party line. If for no other reason that wage inflation, unions are good. I'm not at all certain that contemporary students of the American economic scene necessarily buy into that theory. It is also another view that it is necessary to raise the minimum wage in order to push up on union wages. \n\n \n Interesting theory, but the facts do not back it up. In order to compare the two, you have to consider buyign power of the two. This is what unions look at when they do wage negotiations. The gap between average union wage and average non union wage in this country is roughly 8% (8.43 IIRC). When you consider buying power, union wages have increased only 6% since 1980. ted for buying power has decreased 27.5% since 1980. There has never been a minimum wage increse that directly correlated with an increase in average union wage. IT has simply never happened. \n \n \nUnions have traditionally been at the forefront pushing for a higher minimum wage. Yet, as we all know, very few people actually work for the minimum wage.\n\n \n 2.7% of the workforce works for minimum wage. The average minimum wage earner in the US is a 24-32 yr old white woman with 2 children. Thats a good bunch to pick on I suppose.\n \n 17 states have now increased minimum wage beyond the federal laevel but there has been no upward pressure on wages overall specific to those states which can be traced to the increase. The wages in those states (besides minimum wage) have remained on par with national levels.\n \n \nSomething called the old \"supply and demand\" bugaboo keeps rearing its ugly head. But you wouldn't know anything about that concept, would you Mr. Inflation Man?\n\n \n Not sure where you are going with this, unless you are talking supply and demand regarding labor pricing. Do you really want to strt up the moronic inflation argument again? You have been beat down so many times it is not even funny. Nobody seems to think you have any credibility left on it, so why bother?", 
   {}, 
   134946, 
   null, 
   1118304900.0
  ], 
  [
   135023, 
   null, 
   "georged", 
   "MM you are not seeing the bigger picture of what lower wages means to the economy as a whole. Overall it has little to due with Union or non Union workers in the US it has to due with non union workers in China and India. As your above explantion indicated that union members were overpaid compared to non union Nissan workers, those non union Nissan workers are overpaid compared to South Korean workers, and vastly overpaid compared to Chinese workers. Eventually those non union Nissian workers will lose their jobs to the chinese worker.\n \n As you stated. Production of any tradable good in the US is now/will be obsolete, let the last American worker turn off the lights\n\n \n Or that profits and capital investment from Nissan and other manufacturers physically located here and servicing only US markets leave the US, contributing to imbalance of payments. For some strange reason Americans believe foreign manufacturers building facilities in the US is beneficial to Americans, perpetuated by politicians seeking to provide jobs and enhance their popularity for elections. Basic accounting allows for any of their capital investments to be written down under US tax code, leaving the US buyer to come up with $20k USD for a new car/truck, of which $2k in profit and depreciation reserves leave the US. Are people so stupid as to cheer for those $12/hr jobs? Sure they are, even though each one that rolls off an assembly line removes another substantial piece of national wealth. When they're finished hauling that piece of wealth out of the country, they'll again evaluate off-shore labor and transportation against domestic (US) costs. Anyone want to bet they've made the right choice and US wages will, in the face of a plant shutting down, come way down? Don't forget that by the time those plants are fully amortized, China will be exporting vehicles to the US, including Toyota, using their cost of labor as competition. Domestic (US) wage levels are in competition within a global market, not something so simple as US union/non-union/minimum wage issues.", 
   {}, 
   134950, 
   null, 
   1118336940.0
  ], 
  [
   135032, 
   null, 
   "lord tammerlain", 
   "Or that profits and capital investment from Nissan and other manufacturers physically located here and servicing only US markets leave the US, contributing to imbalance of payments. For some strange reason Americans believe foreign manufacturers building facilities in the US is beneficial to Americans, perpetuated by politicians seeking to provide jobs and enhance their popularity for elections. Basic accounting allows for any of their capital investments to be written down under US tax code, leaving the US buyer to come up with $20k USD for a new car/truck, of which $2k in profit and depreciation reserves leave the US. Are people so stupid as to cheer for those $12/hr jobs? Sure they are, even though each one that rolls off an assembly line removes another substantial piece of national wealth. When they're finished hauling that piece of wealth out of the country, they'll again evaluate off-shore labor and transportation against domestic (US) costs. Anyone want to bet they've made the right choice and US wages will, in the face of a plant shutting down, come way down? Don't forget that by the time those plants are fully amortized, China will be exporting vehicles to the US, including Toyota, using their cost of labor as competition. Domestic (US) wage levels are in competition within a global market, not something so simple as US union/non-union/minimum wage issues.\n\n \n The $2k that leaves the country, is better then if $15k leaves the country,\n and the $12h/hr job is better then no job. But neither are better  then if no money left the country and that $12/hr job was a $15/hr job.\n \n Had to add that in so hopefully some people will realize that economics is a grey area, with things not being black and white for an economy, but a series of tradeoffs", 
   {}, 
   135023, 
   null, 
   1118337900.0
  ], 
  [
   135034, 
   null, 
   "Missouri Mule", 
   "MM you are not seeing the bigger picture of what lower wages means to the economy as a whole. Overall it has little to due with Union or non Union workers in the US it has to due with non union workers in China and India. As your above explantion indicated that union members were overpaid compared to non union Nissan workers, those non union Nissan workers are overpaid compared to South Korean workers, and vastly overpaid compared to Chinese workers. Eventually those non union Nissian workers will lose their jobs to the chinese worker.\n \n As you stated. Production of any tradable good in the US is now/will be obsolete, let the last American worker turn off the lights\n\n \n I'm not arguing for lower wages; merely that unions are obsolete. Very few people are members of unions any longer except for such defenders of the status quo and mediocrity; the teacher's unions come to mind. \n \n Whenever I see unions, I see crooks, mob connections, corruption, protection for incompetents and an unwillingness to come into the 21st century.", 
   {}, 
   134950, 
   null, 
   1118338260.0
  ], 
  [
   135043, 
   null, 
   "Missouri Mule", 
   "Or that profits and capital investment from Nissan and other manufacturers physically located here and servicing only US markets leave the US, contributing to imbalance of payments. For some strange reason Americans believe foreign manufacturers building facilities in the US is beneficial to Americans, perpetuated by politicians seeking to provide jobs and enhance their popularity for elections. Basic accounting allows for any of their capital investments to be written down under US tax code, leaving the US buyer to come up with $20k USD for a new car/truck, of which $2k in profit and depreciation reserves leave the US. Are people so stupid as to cheer for those $12/hr jobs? Sure they are, even though each one that rolls off an assembly line removes another substantial piece of national wealth. When they're finished hauling that piece of wealth out of the country, they'll again evaluate off-shore labor and transportation against domestic (US) costs. Anyone want to bet they've made the right choice and US wages will, in the face of a plant shutting down, come way down? Don't forget that by the time those plants are fully amortized, China will be exporting vehicles to the US, including Toyota, using their cost of labor as competition. Domestic (US) wage levels are in competition within a global market, not something so simple as US union/non-union/minimum wage issues.\n\n \n This is craziness. If foreign investment were not put back into America then we would indeed have problems, but that clearly is not the case. Toyota for example is a worldwide company. For all we know they don't send anything back to Japan and may be using their profits to build yet more plants in the U.S. (eight at last count). These are well paying American jobs on American soil. In the absence of these jobs; (the construction of the plants, the spending of the money in the local economy even before the first car rolls out the door is money in American pockets.)we would be poorer. Clearly that is not happening. \n \n To make your argument one would have to believe that in a completely undeveloped country where no industry exists, a foreign enterprise building a factory there somehow impoverishes the local population. That's nutty and defies common sense. Only an economic imbecile would make such an argument.", 
   {}, 
   135023, 
   null, 
   1118338680.0
  ], 
  [
   135052, 
   null, 
   "georged", 
   "The $2k that leaves the country, is better then if $15k leaves the country,\n and the $12h/hr job is better then no job. But neither are better  then if no money left the country and that $12/hr job was a $15/hr job.\n \n Had to add that in so hopefully some people will realize that economics is a grey area, with things not being black and white for an economy, but a series of tradeoffs\n\n \n A longer process to shed national wealth, with no countering exports same result. The required trade-offs require balance to retain/increase wealth, true growth. The US is currently way out of balance but our economy is so large we have a lot of wealth to go through until our creditors reach a point of no longer requiring our markets at their current levels.", 
   {}, 
   135032, 
   null, 
   1118339640.0
  ], 
  [
   135053, 
   null, 
   "daewoo", 
   "This is craziness. If foreign investment were not put back into America then we would indeed have problems, but that clearly is not the case.\n\n \n Even with foreign investment being put back into america, you are talkign about a net loss because the profits are being exported. It is a net loss for the US economy. Admittedly a smaller loss than if the production was kept overseas, but still aloss. It makes for a slightly smaller hole in your bucket.\n \n \nToyota for example is a worldwide company. For all we know they don't send anything back to Japan and may be using their profits to build yet more plants in the U.S. (eight at last count).\n \n\n \n Parst of their overhead does go to building plants on US soil. This is still economically negative. This is especially negative since indicators seem to show that more americans (the buy american crowd) are willing to look at these vehicles since they are built here. The profit still leaves. Look at toyotas financials.\n \n \nThese are well paying American jobs on American soil. In the absence of these jobs; (the construction of the plants, the spending of the money in the local economy even before the first car rolls out the door is money in American pockets.)we would be poorer. Clearly that is not happening.\n \n\n \n Since the consumer bears all costs, theese are internal transactions and therefore economically neutral. The only part that really makes a difference is where the profit goes. the rest is just varying degrees of loss.\n \n \nTo make your argument one would have to believe that in a completely undeveloped country where no industry exists, a foreign enterprise building a factory there somehow impoverishes the local population. That's nutty and defies common sense. Only an economic imbecile would make such an argument.\n\n \n That depends on where the finished goods and the profits are going. If the finished goods are being exported, you have a net gain for the country where the factory resides because money in the form of wages, construction,etc.... come into the country from the outside. \n \n If the goods are built in that country to be used internally with profit being returned to the country of origin (owners of the factory), that is an economic drain on the economy because the wages being paid are economically neutral (since they simply consist of internal transactions) and the profit is leaving the country, which is a net loss. \n \n We ar talkign antions here, not your home town. Macroeconomics", 
   {}, 
   135043, 
   null, 
   1118339700.0
  ], 
  [
   135074, 
   null, 
   "georged", 
   "This is craziness. If foreign investment were not put back into America then we would indeed have problems, but that clearly is not the case. Toyota for example is a worldwide company. For all we know they don't send anything back to Japan and may be using their profits to build yet more plants in the U.S. (eight at last count). These are well paying American jobs on American soil. In the absence of these jobs; (the construction of the plants, the spending of the money in the local economy even before the first car rolls out the door is money in American pockets.)we would be poorer. Clearly that is not happening. \n \n To make your argument one would have to believe that in a completely undeveloped country where no industry exists, a foreign enterprise building a factory there somehow impoverishes the local population. That's nutty and defies common sense. Only an economic imbecile would make such an argument.\n\n \n I'll ignore the personal comments you invariably resort to when you have no answers. I grew up in Texas and, judging by your posts, manners seem to have taken a bad downward turn. \n \n If you don't understand how a foreign entity producing in the US for US consumption recaptures invested capital by depreciation which reduces tax exposure after a local economy has consumed it and then takes all profits, you have no accounting or treasury experience, especially on how tax shelter drives balance sheet cash in asset based entities, and offer no value to the topic. Incidentally, profits in a public company without a majority stockholder are never used for capitalization purposes, ever hear of ROI? Like politicians, you're job oriented on a localized, immediate gratification basis without understanding the true cost or end results, cause and effect. Common sense has nothing to do with numbers.", 
   {}, 
   135043, 
   null, 
   1118342100.0
  ], 
  [
   135107, 
   null, 
   "Dono", 
   "I'll ignore the personal comments you invariably resort to when you have no answers. I grew up in Texas and, judging by your posts, manners seem to have taken a bad downward turn. \n\n Our borders are open and we have no control on migrating Missouri Mules. Most Texans still place value on good manners and refrain from name calling. \n Dono", 
   {}, 
   135074, 
   null, 
   1118345160.0
  ], 
  [
   135136, 
   null, 
   "georged", 
   "Our borders are open and we have no control on migrating Missouri Mules. Most Texans still place value on good manners and refrain from name calling. \n Dono\n\n \n I still have relatives in Texas and a couple of friends, who haven't been taken with poor manners and name calling, but had overlooked the Caucasian looking for cheap housing migration.", 
   {}, 
   135107, 
   null, 
   1118348340.0
  ], 
  [
   135398, 
   null, 
   "Missouri Mule", 
   "I'll ignore the personal comments you invariably resort to when you have no answers. I grew up in Texas and, judging by your posts, manners seem to have taken a bad downward turn. \n \n If you don't understand how a foreign entity producing in the US for US consumption recaptures invested capital by depreciation which reduces tax exposure after a local economy has consumed it and then takes all profits, you have no accounting or treasury experience, especially on how tax shelter drives balance sheet cash in asset based entities, and offer no value to the topic. Incidentally, profits in a public company without a majority stockholder are never used for capitalization purposes, ever hear of ROI? Like politicians, you're job oriented on a localized, immediate gratification basis without understanding the true cost or end results, cause and effect. Common sense has nothing to do with numbers.\n\n \n I gave you a specific example of foreign investment coming into a developing country. And, as I expected, you ignored it. It is at the basic level of understanding and you revert as always to a bunch of mumbo-jumbo believing that others will take you pontificating as superior knowledge and intellect. I would remind you that true intelligence is taking the complex and making it simple, not the other way around.\n \n Assuming that you have any real interest in learning about our economy I suggest you review the WSJ today that discusses our foreign trade deficit. And incidentally, it doesn't rely on mumbo-jumbo to confuse the reader. Any dummy could understand it; even you.", 
   {}, 
   135074, 
   null, 
   1118386920.0
  ], 
  [
   135402, 
   null, 
   "Missouri Mule", 
   "Even with foreign investment being put back into america, you are talkign about a net loss because the profits are being exported. It is a net loss for the US economy. Admittedly a smaller loss than if the production was kept overseas, but still aloss. It makes for a slightly smaller hole in \n\n \n You're assuming that there are profits and that the profits are taken back to Japan (the Toyota example.) How many tens of billions have been invested in the U.S. with the attendent mulitiplier effect throughout our economy? Would it have been preferable to simply have American workers sitting on their butts watching Ophra Winfrey in the afternoons? How much wealth would that have produced?\n \n I was thinking about this today and it occurred to me that even if our foreign trade deficit doubled it would inevitably have to be reinvested back in the U.S. Otherwise the foreign nations would sooner or later be holding worthless U.S. dollars and would be forced to to rachet down production in their own countries that would further depress their economies. How much higher does employment in Germany have to be (already at 12%) before it is too high? Just as water seeks its own level, at some point the dollar will reach a level that will mean that foreign consumers will see the value in U.S. goods or other services; possibly tourism to spend their dollars here in the U.S. That drives our tourist industry and our retailers will be selling to these tourists and buying our products even if they were originally foreign produced. That dollar spent in China will be spent here in the U.S. by the foreign tourist or businessman. Additionally the banks in foreign lands will not likely allow the dollar to collapse because of the adverse effect on their own economies. \n \n As I have said previously, I'll start to worry when Alan Greenspan starts to worry.", 
   {}, 
   135053, 
   null, 
   1118387880.0
  ], 
  [
   135407, 
   null, 
   "daewoo", 
   "You're assuming that there are profits and that the profits are taken back to Japan (the Toyota example.) \n\n \n No public company uses profits for capitalization. Take a look at toyotas ROI for a clue.\n \n \nHow many tens of billions have been invested in the U.S. with the attendent mulitiplier effect throughout our economy? Would it have been preferable to simply have American workers sitting on their butts watching Ophra Winfrey in the afternoons? How much wealth would that have produced?\n\n \n No, I would rather they be out working for a reasonable wage for export purposes. Multiplier effect is not a macroeconomis theory. It has no place here. \n \n \n \n \nI was thinking about this today and it occurred to me that even if our foreign trade deficit doubled it would inevitably have to be reinvested back in the U.S. Otherwise the foreign nations would sooner or later be holding worthless U.S. dollars and would be forced to to rachet down production in their own countries that would further depress their economies.\n\n \n No, it doesn't, because if our trade deficit were to double we would be broke, so there would be no point in producing new goods for the American consumer market. Currently our currency is being stabilized by the asian market, and they purchase out bond issues in order to help keep our economy stable so we keep buying. The minute that becomes unprofitable (i.e they have to spend more to stabilize our economy than they can get out of it) they will drop us like a hot rock. \n \n \n How much higher does employment in Germany have to be (already at 12%) before it is too high? Just as water seeks its own level, at some point the dollar will reach a level that will mean that foreign consumers will see the value in U.S. goods or other services; possibly tourism to spend their dollars here in the U.S. \n\n \n Your understanding of currency valuations is pathetic. I have explained it too many times to go through it again. The effect that a low dollar has as far as our current competitiveness in the world market, working from an industrial sector as heavily reliant on imported goods as ours has been hashed over several times. I have provided the numbers, examples, and links to reference materials. I am done refuting it. You will just be back next week with the same moronic argument anyway, so there is no point.\n \n \nAs I have said previously, I'll start to worry when Alan Greenspan starts to worry.\n\n \n Then maybe you should get your hands on his last public disclosure. He has pulled over 80% of his investmetns from US equity markets. Greenspans job is to make you not worry. That whole public disclsure thing is a bitch.", 
   {}, 
   135402, 
   null, 
   1118390880.0
  ], 
  [
   135417, 
   null, 
   "gamehuis", 
   "Heh, Greenspan says:\n \n \"Everything's fine, no bubble here, now move along.\" \n \n It would be funny if the wellbeing of an entire nation wasn't at stake...", 
   {}, 
   135407, 
   null, 
   1118396460.0
  ], 
  [
   135420, 
   null, 
   "daewoo", 
   "Heh, Greenspan says:\n \n \"Everything's fine, no bubble here, now move along.\" \n \n It would be funny if the wellbeing of an entire nation wasn't at stake...\n\n \n \n The guy has reached the point where he will say just about anything to keep the market moving. Back in (I believe) february there was a bad NFP report. the same day (roughly 20 minutes later) Greenspan came out and made some comments that ralllied the dollar on the currency market (It should have, and was, dropping like a rock). The thing I found puzling was that the comments were simply not true. They were not even questionable, they were simply falsehoods. I posted here about it, and a few other places, thinking maybe my numbers were off, or maybe I had read things wrong (which happens occasionally, though never quite THAT bad). \n \n It turned out that no, he was just lying through his teeth to keep the dollar up. The next month, deficit information came out, and it was not pretty. The same day, Greenspan got up there (again, within an hour of the numbers coming out) and told several lies, and again tossed a lifeline to the dollar. \n \n I have noticed that the effect that greenspans comments have on the currency market has diminished greatly recently. People have figured out the game. Bad numbers come, greenspan or one of the fed governers steps up to re-assure the public and stop the dollar from falling in a pit. \n \n Here is one of my favorite parts:\n \n \n\"Despite some of the risks that I have highlighted, the U.S. economy seems to be on a reasonably firm footing, and underlying inflation remains contained,\" he said.\n\n \n What a joke. Inflation is unquestionably coming, regardless fo the actions of the fed. sure, inflation seems contained if you do not add in energy and food, and you ignoree the nearly 1% last month. Infaltion is a done deal. We run too big a trade deficit to be dealing in weak dollars and not end up with consumer level inflation.\n \n this does seem roughly connected to this remark, though:\n \n \nEven though it's raised the target for its fed funds rate, an overnight bank lending rate, to 3 percent from 1 percent last summer, longer-term bond yields, which are set by the market, have fallen -- a phenomenon Greenspan has called puzzling.\n\n \n Why are we rasingin interest rates, depsite the fact that demand for expansion capital is flat (which means that increased interest rates will have little or no effect)? Because the Japanese and Chinese are not willing to buy any more of our bonds unless we raise rates.\n \n I like \"puzzling\". Unless he has been labotimised, there is no puzzle. The writing is on the wall. Guys who deal in bonds tend to be kind of like currency traders or independant day traders. If they do not fully understand the game, they will not be in it long. This is why I much prefer the currency market or the bond market as an indicator of economic health, as opposed to the stock market, which is mostly institutional traders churning comissions (thus the predominatly narrow band trading), and joe schmoe dumbasses who invest based on idiocy instead of hard facts and economic data (for instance, purchasing Ford stock despite the fact that their own numbers predict a loss in market share and slower sales, and they only showed a 1.7% ROI last year). \n \n Puzzling. That cracks me up.", 
   {}, 
   135417, 
   null, 
   1118400660.0
  ], 
  [
   135428, 
   null, 
   "georged", 
   "I gave you a specific example of foreign investment coming into a developing country. And, as I expected, you ignored it. It is at the basic level of understanding and you revert as always to a bunch of mumbo-jumbo believing that others will take you pontificating as superior knowledge and intellect. I would remind you that true intelligence is taking the complex and making it simple, not the other way around.\n \n Assuming that you have any real interest in learning about our economy I suggest you review the WSJ today that discusses our foreign trade deficit. And incidentally, it doesn't rely on mumbo-jumbo to confuse the reader. Any dummy could understand it; even you.\n\n \n MM, when it comes to finance and economics, you obviously don't know what you're talking about.", 
   {}, 
   135398, 
   null, 
   1118413440.0
  ], 
  [
   135483, 
   null, 
   "Missouri Mule", 
   "MM, when it comes to finance and economics, you obviously don't know what you're talking about.\n\n \n Obviously you don't know know any more than Daewoo. That's what we know for a certainty.\n \n I gave you a specific situation and you couldn't respond to it. It was simple and direct. Construct an argument where development in an undeveloped country makes it less wealthy than it was before. That was the most basic scenario that even you should have been able to understand.\n \n Your argument is that Toyota's development here in the U.S. makes us less wealthy. That's ridiculous. \n \n If our economy was so precarious and our dollar so worthless why do trading nations continue to send us goods for dollars that will be worthless and why do trading nations continue to invest here? Evidently they don't have good sense and just prefer to flush their money down a rathole. That's essentially your argument as I understand it. Am I wrong?", 
   {}, 
   135428, 
   null, 
   1118424660.0
  ], 
  [
   135531, 
   null, 
   "lord tammerlain", 
   "Obviously you don't know know any more than Daewoo. That's what we know for a certainty.\n \n I gave you a specific situation and you couldn't respond to it. It was simple and direct. Construct an argument where development in an undeveloped country makes it less wealthy than it was before. That was the most basic scenario that even you should have been able to understand.\n \n Your argument is that Toyota's development here in the U.S. makes us less wealthy. That's ridiculous. \n \n If our economy was so precarious and our dollar so worthless why do trading nations continue to send us goods for dollars that will be worthless and why do trading nations continue to invest here? Evidently they don't have good sense and just prefer to flush their money down a rathole. That's essentially your argument as I understand it. Am I wrong?\n\n \n \n MM Toyota making an investment in a new factory in say Columbia which has no automobile factories ( to my knowledge ) for the Columbia market is a very good thing for Columbia. here is why.\n \n 1. Direct investment, at least 300 million is going to be invested into Columbia, pretty much a good thing no matter where such investments occur.\n 2. Jobs for Columbians that PREVIOUSLY did not exist. New jobs, not jobs that are replacing other jobs in Columbia.\n 3. Less money leaving Columbia for every Toyota sold in Columbia then if the factory was not built. Ie Previously the money per car spent on manufacturing was spent in Japan, putting $4000 into the Japanese economy just from manufacturing, that $4000 now is being spent in Columbia. $4000 fewer dollars leaving the Columbia economy. \n 4. Now lets say Toyota made a net profit of $2000 per vehicle sold in Columbia. At this point it does not matter that the vehicle was built in Japan or Columbia, that $2000 is leaving Columbia. A loss to the Columbia economy.\n \n \n Compared to the US, the benifits are fewer,\n 1. Is the same.\n 2. Given that US auto manufacturing has an overcapacity ( it can produce more cars then it can sell) the new Toyota plant is replacing jobs, ( witness 25000 GM employess losing their jobs ). For every new job Toyota brings to the US, a higher paying job at GM is lost, that is a negative.\n 3. For every Toyota that is built in the US, a GM car is not, meaning a relatively zero benifit to the US.\n 4. Again if Toyota was making a net profit of $2000 per vehicle that is $2000 leaving the US.\n \n So a new foreign owned autofactory in a county that has none or an expanding industry is a strongly benifical thing to a generally developing nation. However a new foreign owned autofactory that is being built in country with a mature auto market the benifits are not as high and may cause more money to leave the economy then it brought in.", 
   {}, 
   135483, 
   null, 
   1118428380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  So much for the wonderful Chinese economy.", 
  "url": "http://www.4forums.com/political/economic-advice/5549-so-much-wonderful-chinese-economy.html", 
  "breadcrumbs": [
   "Economic Advice"
  ], 
  "id_number": 5549, 
  "discussion_files": [
   [
    "10295.html", 
    "http://www.4forums.com/political/economic-advice/5549-so-much-wonderful-chinese-economy-print.html"
   ], 
   [
    "10296.html", 
    "http://www.4forums.com/political/economic-advice/5549-so-much-wonderful-chinese-economy-5-print.html"
   ], 
   [
    "10297.html", 
    "http://www.4forums.com/political/economic-advice/5549-so-much-wonderful-chinese-economy-4-print.html"
   ], 
   [
    "10298.html", 
    "http://www.4forums.com/political/economic-advice/5549-so-much-wonderful-chinese-economy-3-print.html"
   ], 
   [
    "10299.html", 
    "http://www.4forums.com/political/economic-advice/5549-so-much-wonderful-chinese-economy-2-print.html"
   ]
  ], 
  "identifier": 5549
 }
]