[
 [
  [
   133666, 
   null, 
   "billsco", 
   "The U.S. Supreme Court has just ruled that the ten states which have legalized marijuana for ill patients are out of line. \n \n http://news.yahoo.com/fc/health/medical_marijuana\n \n How pathetic is this? Let's round up those lawbreakers and imprison them. emoticon_rolleyes \n \n I'm very disappointed.", 
   {
    "post_info": {
     "post_title": "Medical marijuana illegal"
    }
   }, 
   null, 
   null, 
   1118080500.0
  ], 
  [
   138819, 
   null, 
   "deathlord52", 
   "Only proves that the entire government system is polluted. A treatment illegal really only due to its uncontrollability from the drug companies. And the government, controlled by the pharma money, pulling an end around by calling it commerce. Finally approved by a court seemingly swayed by political leanings (a few got it though).", 
   {}, 
   133666, 
   null, 
   1119161760.0
  ], 
  [
   141168, 
   null, 
   "gnojek", 
   "Yeah, who needs marijuana when you have morphine and oxycontin? emoticon_rolleyes \n \n I like this little article for kids:\n http://kidshealth.org/kid/grow/drugs_alcohol/know_drugs.html\n \n \nIllegal Drugs\n When people talk about the \"drug problem,\" they usually mean abusing legal drugs or using illegal drugs, such as marijuana, ecstasy, cocaine, LSD, and heroin. (Marijuana is generally an illegal drug, but some states allow doctors to prescribe it to adults for certain illnesses.) \n\n \n I actually like how they worded this.", 
   {}, 
   138819, 
   null, 
   1119739740.0
  ], 
  [
   150506, 
   null, 
   "KM_Scharnhorst", 
   "Yay, hey Timmy, why don't you just take that entire bottle of sleeping pills, and tell me how you feel in the morning. I'm sure it's not \"abusing\" them, after all, they're LEGAL.\n \n The \"drug crisis\" can be eliminated, if we just didn't prohibit drugs. Without the effect of prohibition, combined with the ease of just running over to your local Walgreens and filling out your prescription (what, you think anyone would be crazy enough to make currently illegal drugs over-the-counter?) for your daily fix (with regular trips to the doctor, of course), the pot of gold that is the illegal drug market would VANISH.\n \n Hell, look what happened when alcohol was made illegal. It's value sky-rocketed, MORE people used alcohol than ever, and it wasn't even safe alcohol, as it would've been if the government regulated alcohol manufacturing. People put in poisons, embalming solutions, to give their mix that extra kick. All the violence that broke out as well, for control over the business. It's practically a carbon copy of what's going on today.\n \n It's been proven, people can live normal, productive lives while nursing a habit. Addicted? Go to a local drug clinic, and get a quality-controlled substance from a doctor, not some powder off the street, which is comprised of who knows what. Hell, maybe those farmers in South America (no racism intended) can plant crops again, instead of continually burning down the damn rain forest to make room for coca plants (which, by the way, grows like a XXXXXXn weed, and can flourish nearly anywhere).\n \n And in a wonderful twist, when teenagers are asked today, what's the illegal substance that is the most difficult to acquire. They generally state that it's LEGAL products, like beer and cigarettes, because those things are regulated by the government. \n \n Ah screw it, not like anyone will ever heed the ranting of some fool.", 
   {}, 
   141168, 
   null, 
   1122318240.0
  ], 
  [
   151424, 
   null, 
   "sglaine", 
   "The U.S. Supreme Court has just ruled that the ten states which have legalized marijuana for ill patients are out of line. \n \n http://news.yahoo.com/fc/health/medical_marijuana\n \n How pathetic is this? Let's round up those lawbreakers and imprison them. emoticon_rolleyes \n \n I'm very disappointed.\n\n \n \n Thats the problem. We have too much government.", 
   {}, 
   133666, 
   null, 
   1122579840.0
  ], 
  [
   151429, 
   null, 
   "gamehuis", 
   "Marijuana is illegal as medicine because the government makes no money out of it.\n As soon as Pfizer or Merck design a superweed, marijuana will be legal before you can say dope.", 
   {}, 
   151424, 
   null, 
   1122580620.0
  ], 
  [
   151432, 
   null, 
   "sglaine", 
   "Marijuana is illegal as medicine because the government makes no money out of it.\n As soon as Pfizer or Merck design a superweed, marijuana will be legal before you can say dope.\n\n \n \n You have a very good point there. :)", 
   {}, 
   151429, 
   null, 
   1122580920.0
  ], 
  [
   151441, 
   null, 
   "biccat", 
   "Marijuana is illegal as medicine because the government makes no money out of it.\n As soon as Pfizer or Merck design a superweed, marijuana will be legal before you can say dope.\n\n Aren't there already drugs in existence that contain the chemicals that are (supposedly) beneficial in marijuana (i.e. THC)?", 
   {}, 
   151429, 
   null, 
   1122581880.0
  ], 
  [
   151445, 
   null, 
   "gamehuis", 
   "Aren't there already drugs in existence that contain the chemicals that are (supposedly) beneficial in marijuana (i.e. THC)?\n\n I looked it up and apparently there is a synthetic form of THC on the market, (generically known as Dronabinol and sold under the trade name Marinol). But it is only allowed under restricted prescription (it's a Schedule II controlled substance, the same as morphine or cocaine) and is far less effective than plant-derived THC.", 
   {}, 
   151441, 
   null, 
   1122583020.0
  ], 
  [
   151567, 
   null, 
   "sglaine", 
   "Now only if congress and the senate would smoke a joint during one of there sessions.\n \n Maybe after they get the munchies they would make it legal. emoticon_xangel", 
   {}, 
   151445, 
   null, 
   1122602820.0
  ], 
  [
   151625, 
   null, 
   "Spad", 
   "Thats the problem. We have too much government.\n\n I NEVER though we would agree on something. \n \n Outlawing MJ is like outlawing Dandelions.\n \n It does provide organized crime with all kinds of money, and keeps the prison and police industries going strong. Think of how many people would become unemployed if MJ was suddenly legalized.", 
   {}, 
   151424, 
   null, 
   1122622440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Medical marijuana illegal", 
  "url": "http://www.4forums.com/political/health-debates/5558-medical-marijuana-illegal.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 5558, 
  "discussion_files": [
   [
    "14322.html", 
    "http://www.4forums.com/political/health-debates/5558-medical-marijuana-illegal-print.html"
   ]
  ], 
  "identifier": 5558
 }
]