[
 [
  [
   7191, 
   null, 
   "kelvin90701", 
   "So far on the pro-gun I have used:\n \n 1) Department of Justice\n 2) The FBI\n 3) Dan Rather\n \n I have not used:\n \n 1) The NRA\n \n as sources.\n \n Who do you use as a source to form your opinions.", 
   {
    "post_info": {
     "post_title": "Sources?  Who do you cite?"
    }
   }, 
   null, 
   null, 
   1051298580.0
  ], 
  [
   7192, 
   null, 
   "voiceofreason", 
   "I cite from many sources. I don't make the mistake of just depending on one source.", 
   {}, 
   7191, 
   null, 
   1051304100.0
  ], 
  [
   7194, 
   null, 
   "kelvin90701", 
   "From the top of my head, you have used:\n \n 1) Sarah Brady\n 2) NEJM\n 3) Sarah Brady\n 4) and Sarah Brady.\n \n Was it you who brought up assault rifles and the Department of Justice? The source that clearly states that assault rifles only helped police in uniform? It was a while back. Please help my memory and detail your sources.", 
   {}, 
   7191, 
   null, 
   1051305900.0
  ], 
  [
   7200, 
   null, 
   "JFriday", 
   "My favorites are the Dept. of Justice, FBI, and ofcourse those ones from the U.K. Home Office that VOR wont read.", 
   {}, 
   7191, 
   null, 
   1051311960.0
  ], 
  [
   7215, 
   null, 
   "kelvin90701", 
   "\"The weapons' menacing looks, coupled with the public's confusion over fully automatic machine guns versus semi-automatic assault weapons-anything that looks like a machine gun is assumed to be a machine gun-can only increase the chance of public support for restrictions on these weapons.\"\n \n http://www.vpc.org/studies/awaconc.htm\n \n The VPC is using confusion to ban assault weapons. This is not a guess, this is not a accusation. This is from thier own website. When I read this passage, I absolutely could not believe it. Forget logic and reason. Instead rely on confusion.", 
   {
    "post_info": {
     "post_title": "Horrific attitude at VPC"
    }, 
    "unicode_changes_made": true
   }, 
   7191, 
   null, 
   1051335000.0
  ], 
  [
   7216, 
   null, 
   "kelvin90701", 
   "Who is the VPC? For a non profit orginization, they have no board of directors? Check out the website? No one on the site claims to work for it? Then who are they?", 
   {
    "post_info": {
     "post_title": "Who is the VPC?"
    }
   }, 
   7191, 
   null, 
   1051335720.0
  ], 
  [
   7236, 
   null, 
   "voiceofreason", 
   "Who is the VPC?\n \n \n....The National Rifle Association acknowledges the VPC as \"the most effective...anti-gun rabble rouser in Washington.\" As the most aggressive group in the gun control movement, the VPC has a decade-long record of policy successes on the federal, state, and local levels-including first revealing the threat posed by gun shows, drastically reducing the number of gun dealers, banning the possession of guns by domestic violence offenders, and exposing gun industry marketing to women and even children....http://www.vpc.org/aboutvpc.htm\n\n \n The VPC is more anti-gun than the Brady Center to Prevent Gun Violence. The Brady people just want more restrictions on guns; they don't want to ban guns. Sarah Brady even bought her son a gun for Christmas. \n \n The VPC wants to ban handguns. I strongly agree. \n Read why handguns need to be banned at http://www.vpc.org/studies/unsafe.htm\n \n After reading all the evidence and statistics they present, how can anyone disagree?", 
   {
    "unicode_changes_made": true
   }, 
   7191, 
   null, 
   1051413120.0
  ], 
  [
   7288, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n \n \n After reading all the evidence and statistics they present, how can anyone disagree? \n \n \n 1)Because know one knows who they are? \n 2)They have a very un-scientific and one sided agenda.\n \n For all you know it could be an Al-Queda website. Because no one claims to own it, or be a part of it, then how can you judge thier character.", 
   {}, 
   7191, 
   null, 
   1051588260.0
  ], 
  [
   7290, 
   null, 
   "kelvin90701", 
   "Lets not forget. I also like to use VOR as a source:\n \n http://www.washtimes.com/metro/20030212-71671916.htm\n \n \"We're not bad or dangerous people,\" said plaintiff Tom G. Palmer, who lives in the Dupont Circle neighborhood. \"We just want to be able to defend ourselves against an intruder\" -VOR link\n \n \"The men threatened to kill Mr. Palmer and his friend, telling them that their bodies would not be found. Mr. Palmer said he stymied his assailants by pulling out a 9 mm handgun.\" - VOR link\n \n \"Ms. Parker, according to the lawsuit, has been threatened by drug dealers. She wants to own a handgun for her protection, but she \"fears arrest, criminal prosecution, incarceration and fine if she were to possess a functional handgun within her home,\" the lawsuit states.\" - VOR link\n \n \"I'm able to protect people's lives at work, but I'm not allowed to go home, where there are open-air drug markets, and defend myself,\" Mr. Heller said.\" -VOR link", 
   {
    "post_info": {
     "post_title": "They want to protect themselves."
    }
   }, 
   7191, 
   null, 
   1051588800.0
  ], 
  [
   7310, 
   null, 
   "JFriday", 
   "Hahaha, youch, good work Kelvin!", 
   {}, 
   7191, 
   null, 
   1051627680.0
  ], 
  [
   7424, 
   null, 
   "kelvin90701", 
   "\"Data concerning weapons usage are\n collected for the crimes of murder, robbery, and\n aggravated assault. Personal weapons such as\n hands, fists, feet, etc. were used in 31.1 percent\n of those crimes. Firearms were involved in 26.2\n percent of incidents. Knives or cutting instruments\n were used in 14.9 percent of violent\n crimes. Other dangerous weapons were\n employed in the remaining 27.8 percent of\n offenses. (See Tables 19 and 2.10.) Weapon\n information is not collected for forcible rape.\" -VOR link page 8\n \n http://www.fbi.gov/ucr/cius_01/01crime2.pdf\n \n We need to ban hands, fists, and feet. They are far more dangerous to society than guns. VOR your stats show that hands and feet are much more dangerous than guns. How about sueing the maker of hands and feet, since the makers of hands and feet are clearly responsible for so many deaths.", 
   {}, 
   7191, 
   null, 
   1051775820.0
  ], 
  [
   7431, 
   null, 
   "JFriday", 
   "I am going to file a claim against VOR for having hands and feet and making America unsafe. Hands and Feet weaponry(HFW) are a the most commonly used weapons in schools, churches, bars, and generally anywhere, they are an unncecissary public nuisance and they need to be registered and licenced, I hope one day to live in a society peaceful enough so that HFWs will not be needed, tolerated, or even exist.\n \n Now on to teeth...", 
   {}, 
   7191, 
   null, 
   1051805340.0
  ], 
  [
   7442, 
   null, 
   "voiceofreason", 
   "Once again, Kelvin your logic is totally flawed. Hands and feet are not more dangerous than firearms. Would you rather be shot or hit? Most murders in the US are committed with a firearm. Why? Because firearms make much more effective murder weapons than hands and feet. Firearms are more lethal and therefore more dangerous. \n \n Just because hands and feet are used more often does not mean they are more dangerous. More often does not equal more dangerous. That is flawed logic. Look up the word dangerous in the dictionary. \n \n Pro-gun logic. Now that's an oxymoron.", 
   {}, 
   7191, 
   null, 
   1051816440.0
  ], 
  [
   7444, 
   null, 
   "Crim", 
   "Additionally, hands and feet are not formed for the purposes of dealing damage.", 
   {}, 
   7191, 
   null, 
   1051816800.0
  ], 
  [
   7446, 
   null, 
   "Patriot", 
   "Who are you trying to take guns from? The law-abiding or criminals?", 
   {}, 
   7191, 
   null, 
   1051819260.0
  ], 
  [
   7483, 
   null, 
   "kelvin90701", 
   "Originally posted by Patriot \n Who are you trying to take guns from? The law-abiding or criminals? \n \n \n The answer is very clear. He wants law abiding people to be unarmed.\n \n \n http://www.washtimes.com/metro/20030212-71671916.htm\n \n \"We're not bad or dangerous people,\" said plaintiff Tom G. Palmer, who lives in the Dupont Circle neighborhood. \"We just want to be able to defend ourselves against an intruder\" -VOR link", 
   {}, 
   7191, 
   null, 
   1051843680.0
  ], 
  [
   7723, 
   null, 
   "JFriday", 
   "That post was pure sarcasm if you could not tell, it just goes to show that people will ALWAYS be able to kill and hurt others, taking away guns from law abiding citizens is not going to help at all, the criminals will always have their guns and even if they didnt, lets say if it was possible to get them away from criminals and stop them from getting them again, they would just use something else, you cant ban everything.", 
   {}, 
   7191, 
   null, 
   1052198100.0
  ], 
  [
   7739, 
   null, 
   "voiceofreason", 
   "What's your point? Nobody is disputing that you can kill people without guns. It's just that with guns you can kill more people than if you had knives or sharp pointed sticks.", 
   {}, 
   7191, 
   null, 
   1052204220.0
  ], 
  [
   7867, 
   null, 
   "voiceofreason", 
   "Originally posted by kelvin90701 \n So far on the pro-gun I have used:\n \n 1) Department of Justice\n 2) The FBI\n 3) Dan Rather\n \n I have not used:\n \n 1) The NRA\n \n as sources.\n \n Who do you use as a source to form your opinions. \n \n You posted the following under the thread about ballistic fingerprinting.\n \n \nOriginally posted by kelvin90701 \n \"Canada's political rulers originally projected a $2 million budget to cover the cost of building and running a much-touted \"universal\" firearm registry, but now as official Auditor General's investigation has revealed the national gun registration scheme will have cost taxpayers in excess of $1 billion. And this 49,000 percent cost overrun has somehow kept secret from Parliament for years.\" - American Rifleman March2003\n \n \n American Rifleman is an NRA publication. I thought you said that you have not used the NRA as a source. hmmm.....", 
   {
    "post_info": {
     "post_title": "Re: Sources?  Who do you cite?"
    }
   }, 
   7191, 
   null, 
   1052470920.0
  ], 
  [
   7871, 
   null, 
   "kelvin90701", 
   "Yes. You can count me on that one. I will openly admit to that one. My appology for shooting off my mouth.\n \n Yes I jump to conclusions. \n \n I will also make a u-turn once proven wrong.\n \n My only excuse and a weak one, is yes I did quote that NRA rag, because the information is in a quickly consumable form. It won't happen again. Then I am afraid you will have to run your brain on overdrive.\n \n \n http://www.cnsnews.com/ForeignBureaus/archive/200212/FOR20021204f.html\n \n \n http://www.ssaa.org.au/canregistry6.html\n \n http://www.jointogether.org/gv/news/summaries/reader/0,2061,555622,00.html\n \n The most damning:\n \n http://www.cfc-ccaf.gc.ca/en/Audit/CFP-Op2001.asp\n \n The Canadian government itself. Notice that the 2002 audit is missing (in progess), but the cost over run in 2001 is already enormous.\n \n The NRA is not alone on this issue and it is not incorrect or misleading. It is very clear that the overrun is real and not a matter of opinion.\n \n You already have a history of being misleading with in the same post and incorrectly citing articles.\n \n My appology for shooting off my mouth on this one.", 
   {}, 
   7191, 
   null, 
   1052510940.0
  ], 
  [
   9295, 
   null, 
   "kelvin90701", 
   "Ideas are for more powerful than guns. We don't allow our enemies to have guns, why should we allow them to have ideas? \n \n - Joseph Stalin, In Politics \n \n \n \n This was such a classic I thought it too good to be true. It has got to be an urban legend. Anyone every read Polilitics? Is it really there?", 
   {}, 
   7191, 
   null, 
   1055097960.0
  ], 
  [
   9301, 
   null, 
   "Patriot", 
   "I don't know about that one, but how about these?\n \n \"How we burned in the prison camps later thinking: What would things have been like if every police operative, when he went out at night to make an arrest, had been uncertain whether he would return alive? If during periods of mass arrests people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever was at hand? The organs would very quickly have suffered a shortage of officers and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt.\"\n - Alexander Solzhenitsyn, Nobel Prize winner and author of The Gulag Archipelago, who spent 11 years in Soviet concentration camps.\n \n Political power grows out of the barrel of a gun.\n - Mao Zedong, Nov. 6, 1938, Selected Works, Vol. 2\n \n http://www.constitution.org/mil/cs_milit.htm", 
   {
    "unicode_changes_made": true
   }, 
   7191, 
   null, 
   1055100660.0
  ], 
  [
   9743, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n Once again, Kelvin your logic is totally flawed. Hands and feet are not more dangerous than firearms. Would you rather be shot or hit? Most murders in the US are committed with a firearm. Why? Because firearms make much more effective murder weapons than hands and feet. Firearms are more lethal and therefore more dangerous. \n \n Just because hands and feet are used more often does not mean they are more dangerous. More often does not equal more dangerous. That is flawed logic. Look up the word dangerous in the dictionary. \n \n Pro-gun logic. Now that's an oxymoron. \n \n \n That was weak. It is right there in front of your face and yet you deny it.\n \n \"Most murders in the US are committed with a firearm. \" Without out a dobut definately a false statement. Again it is right there in front of you.", 
   {}, 
   7191, 
   null, 
   1055608380.0
  ], 
  [
   10722, 
   null, 
   "voiceofreason", 
   "Originally posted by kelvin90701 \n That was weak. It is right there in front of your face and yet you deny it.\n \n \"Most murders in the US are committed with a firearm. \" Without out a dobut definately a false statement. Again it is right there in front of you. \n \n Without doubt definitely a false statement? I can't believe this.\n \n \"The FBI's Crime in the United States estimated that 66% of the 15,517 murders in 2000 were committed with firearms.\"\n http://www.ojp.usdoj.gov/bjs/guns.htm", 
   {}, 
   7191, 
   null, 
   1056460680.0
  ], 
  [
   10723, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n Without doubt definitely a false statement? I can't believe this.\n \n \"The FBI's Crime in the United States estimated that 66% of the 15,517 murders in 2000 were committed with firearms.\"\n http://www.ojp.usdoj.gov/bjs/guns.htm \n \n \n Sorry you are absolutely right. My appologies for miss quoting you. Reading my own post again, the stats were not about murders, they were about crimes. \n \n Yes 66% percent of murders are committed with fireaerms.\n \n Your own stats also state:\n \n \"Data concerning weapons usage are\n collected for the crimes of murder, robbery, and\n aggravated assault. Personal weapons such as\n hands, fists, feet, etc. were used in 31.1 percent\n of those crimes. Firearms were involved in 26.2\n percent of incidents. Knives or cutting instruments\n were used in 14.9 percent of violent\n crimes. Other dangerous weapons were\n employed in the remaining 27.8 percent of\n offenses. (See Tables 19 and 2.10.) Weapon\n information is not collected for forcible rape.\" -VOR link page 8\n \n http://www.fbi.gov/ucr/cius_01/01crime2.pdf\n \n Hmmm? Hands and feet?", 
   {}, 
   7191, 
   null, 
   1056467100.0
  ], 
  [
   14445, 
   null, 
   "God Fearing Ath", 
   "I usually only cite scholarly sources: Dr's Kleck (from FSU) and Lott (from Yale) mostly. There have been lots of good papers from other folks, including Toch, Lizotte, Wright, Eskridge, etc.\n \n -GFA", 
   {}, 
   10723, 
   null, 
   1062795420.0
  ], 
  [
   14447, 
   null, 
   "God Fearing Ath", 
   "I just noted voice's sig, and would like to point out that a meta-analysis of the scholarly legal journals found that 42 of 48 papers published on the topic in the 1990's held that gun ownership was an individual -- not collective --right (Kates, 2001).", 
   {}, 
   14445, 
   null, 
   1062795780.0
  ], 
  [
   14476, 
   null, 
   "kelvin90701", 
   "I just noted voice's sig, and would like to point out that a meta-analysis of the scholarly legal journals found that 42 of 48 papers published on the topic in the 1990's held that gun ownership was an individual -- not collective --right (Kates, 2001).\n\n \n Love still has her handgun.", 
   {}, 
   14447, 
   null, 
   1062818940.0
  ], 
  [
   35676, 
   null, 
   "Tim", 
   "So far on the pro-gun I have used:\n \n 1) Department of Justice\n 2) The FBI\n 3) Dan Rather\n \n I have not used:\n \n 1) The NRA\n \n as sources.\n \n Who do you use as a source to form your opinions.\n\n A good point. It's hard to take posts from Rev. Hellhound and Patrick Henry seriously when they depend so much on propaganda from biased web sites.", 
   {}, 
   7191, 
   null, 
   1077558540.0
  ], 
  [
   35679, 
   null, 
   "Rev. HellH0und", 
   "A good point. It's hard to take posts from Rev. Hellhound and Patrick Henry seriously when they depend so much on propaganda from biased web sites.\n\n \n Oh give it a rest... Just because you have the attention span of a lemur does not mean I am posting \"propaganda\" Kelvin will vouch for the depth I have contributed in the past...\n \n \n So if you are so willing to violate my civil rights will YOU be coming to get my guns or will you be sending someone elses child to do your nazi dirty work?", 
   {}, 
   35676, 
   null, 
   1077558720.0
  ], 
  [
   35683, 
   null, 
   "Tim", 
   "Oh give it a rest... Just because you have the attention span of a lemur does not mean I am posting \"propaganda\" Kelvin will vouch for the depth I have contributed in the past...\n \n \n So if you are so willing to violate my civil rights will YOU be coming to get my guns or will you be sending someone elses child to do your nazi dirty work?\n\n Talk about begging the question! I don't want your gun, and if such a law were passed it's not my job to enforce the law.", 
   {}, 
   35679, 
   null, 
   1077559020.0
  ], 
  [
   35684, 
   null, 
   "Rev. HellH0und", 
   "Talk about begging the question! I don't want your gun, and if such a law were passed it's not my job to enforce the law.\n\n \n \n I see you are willing to violate my constitutional rights yet you expect someone else to do your dirty work.... How typical.", 
   {}, 
   35683, 
   null, 
   1077559080.0
  ], 
  [
   35689, 
   null, 
   "Tim", 
   "I see you are willing to violate my constitutional rights yet you expect someone else to do your dirty work.... How typical.\n\n Begging the question. First you have to prove that I'm willing to violate your constitutional rights.", 
   {}, 
   35684, 
   null, 
   1077559560.0
  ], 
  [
   35692, 
   null, 
   "Rev. HellH0und", 
   "Begging the question. First you have to prove that I'm willing to violate your constitutional rights.\n\n \n \n \n ****yawn*** typical liberal... Tell me then what DO you want from me and my guns?", 
   {}, 
   35689, 
   null, 
   1077559740.0
  ], 
  [
   35694, 
   null, 
   "Tim", 
   "****yawn*** typical liberal... Tell me then what DO you want from me and my guns?\n\n I just want the truth to be told so that the American people can make an informed decision about gun control policies.", 
   {}, 
   35692, 
   null, 
   1077559860.0
  ], 
  [
   35697, 
   null, 
   "Rev. HellH0und", 
   "I just want the truth to be told so that the American people can make an informed decision about gun control policies.\n\n \n \n Vague and \"ducking\" the question. So you havbe no problem with me if I own an ar-15? \n \n You want the truth? You mean michael moore's truth? VPC's truth? Feinstiens truth (she has the ONLY CCW permit in san fran yet she is the biggest anti-gun biggot around)... Which truth do you want?", 
   {}, 
   35694, 
   null, 
   1077560160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Sources?  Who do you cite?", 
  "url": "http://www.4forums.com/political/gun-control-debates/556-sources-who-do-you-cite.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 556, 
  "discussion_files": [
   [
    "23036.html", 
    "http://www.4forums.com/political/gun-control-debates/556-sources-who-do-you-cite-print.html"
   ], 
   [
    "23037.html", 
    "http://www.4forums.com/political/gun-control-debates/556-sources-who-do-you-cite-3-print.html"
   ], 
   [
    "23038.html", 
    "http://www.4forums.com/political/gun-control-debates/556-sources-who-do-you-cite-2-print.html"
   ]
  ], 
  "identifier": 556
 }
]