[
 [
  [
   134060, 
   null, 
   "Hydra", 
   "Post-ABC Poll: Bush Ignoring Public Concerns\n Majority Says President Distracted by Issues They Care Little About\n \n By Richard Morin\n Washington Post Staff Writer\n Tuesday, June 7, 2005; 7:17 AM\n \n \n \n A clear majority of Americans say President Bush is ignoring the public's concerns and instead has become distracted by issues that most people say they care little about, according to a new Washington Post-ABC News poll.\n \n The survey found that 58 percent of those interviewed said Bush is concentrating mainly in his second term on problems and partisan squabbles that these respondents said were unimportant to them. Four in 10 -- 41 percent -- said the president was focused on important problems -- a double-digit drop from three years ago.\n \n Underlying that finding is a continuing deep and bitter partisan divide that has fueled increasingly bitter fights in Congress, most recently over some of Bush's nominees to the federal courts. Relatively few Americans viewed that issue as particularly important.\n \n According to the poll, nearly eight in 10 Democrats say Bush is not concentrating on issues they personally view as vital while three out of four Republicans disagree.\n \n Ominously for Bush and the Republicans, a strong majority of self-described political independents -- 68 percent -- say they disagreed with the president's priorities. That suggests Bush's mixed record in the second term on issues the public views as critical -- particularly on Iraq and the economy -- may be as much a liability for GOP candidates in next year's mid-term election as his performance in his first term was an asset to Republican congressional hopefuls last year and in 2002.\n \n Overall, the president's job approval rating stood at 48 percent, virtually identical to where it was last month. Currently 52 percent of the public disapproves of the job Bush is doing as president, the first time in his presidency that more than half of the public has expressed negative views of the president's performance.\n \n Continuing violence in Iraq continues to fuel negative views of the White House. Four in 10 Americans currently approve of the job that Bush is doing in Iraq while 58 percent disapproved. It marked the 13th consecutive month that less than half of the country approved of Bush's handling of the situation in Iraq.\n \n A total of 1,002 randomly selected adults were interviewed June 2-5 for this survey. Margin of sampling error for the overall results is plus or minus 3 percentage points.\n \n Complete results of this Washington Post-ABC News poll will be available at washingtonpost.com at 5 p.m. today.\n \n © 2005 The Washington Post Company", 
   {
    "post_info": {
     "post_title": "Bu$h has no use for public concerns"
    }
   }, 
   null, 
   null, 
   1118154660.0
  ], 
  [
   134061, 
   null, 
   "Hydra", 
   "Now we know what a true \"Lame Duck\" is ! emoticon_rolleyes :) emoticon_rolleyes", 
   {}, 
   134060, 
   null, 
   1118154720.0
  ], 
  [
   134091, 
   null, 
   "lord tammerlain", 
   "Now we know what a true \"Lame Duck\" is ! emoticon_rolleyes :) emoticon_rolleyes\n\n \n \n To which, I can only say good. I dont know if the world could have withstood another term like his first.", 
   {}, 
   134061, 
   null, 
   1118162940.0
  ], 
  [
   134095, 
   null, 
   "Hydra", 
   "To which, I can only say good. I dont know if the world could have withstood another term like his first.\n\n \n I can't wait to see the 5:00 P.M. poll. I have a number of GOPer friends who are truly disappointed with his actions in office, even though they voted for him a second time. Tis truly sad..........", 
   {}, 
   134091, 
   null, 
   1118163720.0
  ], 
  [
   134130, 
   null, 
   "Jaxian", 
   "I'm no fan of Bush's political beliefs and ideals, but I can't say I agree with the implications here. The public's concerns are not necessarily those most important to America. Bush stated in the past that he doesn't make decisions based on polls, and that is one thing I can agree with him on. Simply because he isn't addressing the public's concerns doesn't make him a lame duck president. Masses of people are very often uninformed; it is Bush's job to determine how he can best do good for America, and that is what he should be doing.", 
   {}, 
   134095, 
   null, 
   1118167740.0
  ], 
  [
   134214, 
   null, 
   "Hydra", 
   "I'm no fan of Bush's political beliefs and ideals, but I can't say I agree with the implications here. The public's concerns are not necessarily those most important to America. Bush stated in the past that he doesn't make decisions based on polls, and that is one thing I can agree with him on. Simply because he isn't addressing the public's concerns doesn't make him a lame duck president. Masses of people are very often uninformed; it is Bush's job to determine how he can best do good for America, and that is what he should be doing.\n\n \n Any president in their second term are lame ducks. \"Simply because he usn't addressing the public's concerns\"; like interstate highways, NCLB, RW Titile I and RW Title II are a few of the many programs that are un-funded mandates. The public has a right to be concerned.", 
   {}, 
   134130, 
   null, 
   1118176020.0
  ], 
  [
   134333, 
   null, 
   "Hydra", 
   "Post-ABC Poll: Americans Say War in Iraq Has Not Made U.S. Safer\n \n By Dana Milbank and Claudia Deane\n Washington Post Staff Writers\n Tuesday, June 7, 2005; 5:11 PM\n \n \n \n For the first time since the war in Iraq began, over half of the American public believes the fight there has not made the United States safer, according to a new Washington Post-ABC News poll.\n \n While the focus in Washington has shifted from the Iraq conflict to Social Security and other domestic matters, the survey found that Americans rank Iraq second only to the economy in importance -- and that many are losing patience with the enterprise.\n \n Nearly three quarters of Americans say the number of casualties in Iraq is unacceptable, while two-thirds say the U.S. military there is bogged down and nearly six in 10 say the war was not worth fighting -- in all three cases matching or exceeding the highest levels of pessimism yet recorded. More than four in ten now believe the U.S. presence in Iraq is becoming analogous to the experience in Vietnam.\n \n Perhaps most ominously, 52 percent said the war in Iraq has not contributed to the long-term security of the United States, while 47 percent said it did. It was the first time a majority of Americans disagreed with the central notion President Bush has offered to build support for war: that the fight there will make Americans safer from terrorists at home. In late 2003, 62 percent thought the Iraq war aided U.S. security, and just three months ago 52 percent thought so.\n \n Overall, more than half-- 52 percent -- disapprove of how Bush is handling his job. A somewhat larger majority-56 percent-- disapproved of Republicans in Congress and an identical proportion disapproved of Democrats.\n \n However, there were signs that Bush and Republicans in Congress were receiving more of the blame for the recent standoffs over such issues as Bush's judicial nominees and Social Security. Six in ten respondents said Bush and GOP leaders are not making good progress on the nation's problems; of those, 67 percent blamed the president and Republicans while 13 percent blamed congressional Democrats. For the first time, a majority, 55 percent, also said Bush has done more to divide the country than to unite it.\n \n The surge in violence in Iraq since the new government took control -- 80 U.S. soldiers and more than 700 Iraqis died in May amid a rash of car bombings -- has been accompanied by rising gloom about the overall fight against terrorism. By 50 percent to 49 percent, Americans approved of the way Bush is handling the war on terror, down from 56 percent approval in April, equaling the lowest rating Bush has earned on the issue that has consistently been his core strength with the public.Some authorities on war and public opinion said the figures indicate that pessimism about the war in Iraq has reached a dangerous level. \"It appears that Americans are coming to the realization that the war in Iraq is not being won and may well prove unwinnable,\" said retired Army Col. Andrew Bacevich, now a professor at Boston University. \"That conclusion bleeds over into a conviction that it may not have been necessary in the first place.\"\n \n That's the view of poll respondent Margaret Boudreaux, 63, a casino worker living in Oakdale, La. \"I don't think it's going well, there's too much killing,\" she said, worrying that the Iraq invasion could move more enemies to violence. \"I think that some of the people, if they could, would get revenge for what we've done.\"\n \n \"You hear a lot about Saddam but nothing about Osama bin Laden. I don't think he [Bush] does enough to deal with the problems of terrorism. . . . He's done a lot of talking, but we haven't seen real changes,\" said another poll respondent, Kathy Goyette, 54, a San Diego nurse. \"People are getting through airport security with things that are unbelievable. . . . I don't think he learned from 9/11.\"\n \n While Bush has shelved his routine speeches about terrorism and Congress has turned to domestic issues, fear of terrorism has receded from the public consciousness. Only 12 percent called it the nation's top priority, behind the economy, Iraq, health care and Social Security.\n \n The drop in Bush's war on terror approval ratings came disproportionately from political independents. In March, 63 percent of independents approved of Bush's job on terrorism. By April this had fallen to 54 percent. And in this weekend's survey, only 40 percent gave him good marks.\n \n The poll suggests that views on the Iraq war's impact also remain highly partisan. Three in four Republicans said the Iraq invasion has boosted domestic security, while three in four Democrats said it has not. Political independents lean negative on the issue: about six in ten said the war has not made Americans safer.\n \n Overall, Bush's 48 percent job approval rating was essentially unchanged from the 47 percent rating he received in a late April poll. And there was growth in the proportion of people who said the economy was doing well: 44 percent, up from 37 percent in April.\n \n But the public took a generally gloomy view of the White House and Congress. A plurality said Bush is doing worse in his second term than in his first, and 58 percent said he is not concentrating on the things that matter most to them -- the worst showing Bush has had in this measure in Post polls.\n \n Congress fared no better. The proportion of the public disapproving of the legislative body was at its highest since late 1998, during Bill Clinton's impeachment. More people said they would look at a candidate other than their sitting congressmen than at any point in nearly eight years. For the first time since April, 2001, Democrats (46 percent) were trusted more than Republicans (41 percent) to cope with the nation's problems. But at the same time, favorability ratings for the Democratic party, at 51 percent, tied their all time low.\n \n A total of 1,002 randomly selected adults were interviewed by telephone June 2-5 for this Post-ABC News poll. The margin of sampling error for the overall results is plus or minus three percentage points.\n \n The poll also found disapproval or division when it came to Bush's performance on several other recent, high-profile issues. Only 33 percent supported the way the president is handling federal funding of embryonic stem cell research, while 55 percent did not. The public divided on the president's handling of judicial nominations, 46 percent approving and 44 percent disapproving. And half said they were opposed to drilling in Alaska's Arctic National Wildlife Refuge, a proposal Bush has backed and which is now being debated in Congress.\n \n But the most striking trend identified by the survey was the spreading impatience over Iraq and national security matters. While six in 10 were confident that the U.S. was not violating the rights of detainees at the military base in Guantanamo Bay, Cuba, Americans were more skeptical that the government is protecting the rights of U.S. citizens at home. Only half said Americans' rights were being adequately protected, down from 69 percent in September, 2003.\n \n James Burk, a sociologist at Texas A&M, said the disillusionment about Iraq may have grown to the point that policymakers will have difficulty reversing it. \"People all across the country know people in Iraq [so] there's a direct connection to the war,\" he said. He sees a \"disjuncture\" between upbeat administration rhetoric and realities the public perceives. \"These data suggest we will soon reach the point, if we haven't yet reached the point, where that kind of language will seem too out of touch.\"\n \n Director of polling Richard Morin contributed to this report.\n \n © 2005 The Washington Post Company", 
   {}, 
   134214, 
   null, 
   1118188200.0
  ], 
  [
   147340, 
   null, 
   "PoohBear", 
   "ok how is being in iraq not helping our safety?", 
   {}, 
   134333, 
   null, 
   1121395380.0
  ], 
  [
   147385, 
   null, 
   "zachvac", 
   "ok how is being in iraq not helping our safety?\n\n \n Well if you want us to believe that being in Iraq is helping our safety, you have the burden of proof. That's like me making a claim \"how is being in Iraq not saving toilet paper?\". Present proof that being in Iraq has helped our safety. Even most Republican's don't buy that anymore, but they believe it is important to help the oppressed Iraqi people.", 
   {}, 
   147340, 
   null, 
   1121403060.0
  ], 
  [
   147854, 
   null, 
   "Wez", 
   "ok how is being in iraq not helping our safety?\n\n You're the one who has to provide evidence that Iraq IS improving your security here. Have fun.:p\n \n -Wez", 
   {}, 
   147340, 
   null, 
   1121550000.0
  ], 
  [
   147870, 
   null, 
   "PoohBear", 
   "lets see i havent been blown up... and havent been shot at so im good! what about you?", 
   {}, 
   147854, 
   null, 
   1121553960.0
  ], 
  [
   147874, 
   null, 
   "Dono", 
   "lets see i havent been blown up... and havent been shot at so im good! what about you?\n\n I find nothing good about 15 dead americans and $2 billion per week in a country that never threatened us.\n Dono", 
   {}, 
   147870, 
   null, 
   1121555760.0
  ], 
  [
   147876, 
   null, 
   "Wez", 
   "lets see i havent been blown up... and havent been shot at so im good! what about you?\n\n You weren't blown up before Iraq either.\n \n So how has it improved the security of your country?\n \n -Wez", 
   {}, 
   147870, 
   null, 
   1121555940.0
  ], 
  [
   147879, 
   null, 
   "Ghost", 
   "You can't prove being in Iraq is improving our national security, based on the nature of the situation. Any evidence that it is is probably confidential. Kinda like we have no idea how effective we are at stopping terrorist attacks on our own soil, because we don't know how many have been planned, how many have been thwarted, etc. Any time there is a success, it's hidden, but anytime there is a failure, something explodes violently and people die.", 
   {}, 
   147870, 
   null, 
   1121556240.0
  ], 
  [
   147887, 
   null, 
   "Heads_On_Pikes", 
   "\n So how has it improved the security of your country?\n \n -Wez\n\n \n There have been zero attacks by Islamic extremists on American soil since Sept. 11, 2001. The record speaks for itself. The nutters are far too busy blowing themselves (and countless innocents) up in Iraq and Afghanistan trying to drive off the infidels to go on a serious worldwide offensive.", 
   {}, 
   147876, 
   null, 
   1121557200.0
  ], 
  [
   147890, 
   null, 
   "Wez", 
   "There have been zero attacks by Islamic extremists on American soil since Sept. 11, 2001. The record speaks for itself. The nutters are far too busy blowing themselves (and countless innocents) up in Iraq and Afghanistan trying to drive off the infidels to go on a serious worldwide offensive.\n\n London?\n \n More Americans are dying to extremists than before 9/11.\n \n -Wez", 
   {}, 
   147887, 
   null, 
   1121557500.0
  ], 
  [
   147903, 
   null, 
   "Heads_On_Pikes", 
   "London?\n\n \n \n I many on the left consider Tony Blair to be Bush's lapdog but is London really American soil now?\n \n \nMore Americans are dying to extremists than before 9/11.\n \n -Wez\n\n \n Yeah, that is true enough in terms of military personnel, not in terms of innocent civilians. \n \n On the other hand, extremists are being captured and killed at a far greater rate than was happening prior to 9/11. They are literally flocking into Iraq. I often hear anti-war folks say that the \"Flypaper\" stratagy would be a war crime, so I am attempting to reference to it less and less. :)", 
   {}, 
   147890, 
   null, 
   1121560860.0
  ], 
  [
   147904, 
   null, 
   "georged", 
   "There have been zero attacks by Islamic extremists on American soil since Sept. 11, 2001. The record speaks for itself. The nutters are far too busy blowing themselves (and countless innocents) up in Iraq and Afghanistan trying to drive off the infidels to go on a serious worldwide offensive.\n\n \n Why would they bother expending resources in the US? We're doing an excellent job of spending US lifes and national wealth on our own in Iraq, Afghanistan and with 'homeland defense'. How could they ever match our own efforts?", 
   {}, 
   147887, 
   null, 
   1121561100.0
  ], 
  [
   147922, 
   null, 
   "marc9000", 
   "Why would they bother expending resources in the US? \n\n \n Because it's the most cost efficient for them. 9/11 proved it - 1/2 million in expenditures for them and 19? people lost, 639 billion in cost to us with 3000 dead, in only a few hours time. By the time we get to 639 billion and 3000 killed in our offensive in Afganistan and Iraq, they'll lose far more than 1/2 million dollars and 19 people.", 
   {}, 
   147904, 
   null, 
   1121565120.0
  ], 
  [
   147955, 
   null, 
   "biccat", 
   "I many on the left consider Tony Blair to be Bush's lapdog but is London really American soil now?\n\n To be fair, many on the right considered Tony Blair to be Clinton's lapdog, and there was a lot of concern if we would be in a difficult situation with England if a Republican won in 2000.\n \n Fortunately, things have worked out alright. England has been a strong US ally for most of our history (since WWII), irrespective of White House politics.", 
   {}, 
   147903, 
   null, 
   1121573340.0
  ], 
  [
   147968, 
   null, 
   "daewoo", 
   "Because it's the most cost efficient for them. 9/11 proved it - 1/2 million in expenditures for them and 19? people lost, 639 billion in cost to us with 3000 dead, in only a few hours time. By the time we get to 639 billion and 3000 killed in our offensive in Afganistan and Iraq, they'll lose far more than 1/2 million dollars and 19 people.\n\n \n you have got to be kidding me. Every time there is a major sucessful strike in Iraq, oil jumps, same with saudi arabia. Thiose guys who are plannign the attacks know when to buy. They are making a FORTUNE on the Iraq war. Despite the Bush administrations rhetoric, less than 10 percent of those killed/captured have been identified as \"foreign fighters\". So all we really know for sure is that AQ is providing moral support for what is going on in Iraq. Zarqawi was not a mamber, nor was he really affiliated with AQ prior tot he war. aFter the US made him famous, BL said \"this is our guy there\". I would be surprised of Al Quedas entire expediture for the Iraq war topped $50 million. On the other hand, if they have not made billions on oil futures, using the attacks in the region to perpetrate spikes in the prices, they are utter fools (and they have already proven they are NOT utter fools).\n \n So, yes, they may have lost $50 million so far in IRaq, but their return has to be in the billions. Additionally, they have sucessfully used our agression in Iraq as a recruitment tool and fund raising tool. We ahve yet to see any indication that their phenomenal post invasion growth, both in terms of manpower and money, has slowed at all.\n \n IU know I would scrape up $50 million in order to have an inside track on when attacks would be occuring on oil facilities in the ME. Working the futres angle, I would make billions the first year alone, and with todays online trading and money shuffling, nobody would ever be able to track it.", 
   {}, 
   147922, 
   null, 
   1121576940.0
  ], 
  [
   147999, 
   null, 
   "Wez", 
   "I many on the left consider Tony Blair to be Bush's lapdog but is London really American soil now?\n\n \"The nutters are far too busy blowing themselves (and countless innocents) up in Iraq and Afghanistan trying to drive off the infidels to go on a serious worldwide offensive.\"\n You said \"worldwide offensive\", not just America. :p \n \n \nYeah, that is true enough in terms of military personnel, not in terms of innocent civilians. \n\n Is the life of a civilian better/worse than that of a soldier? The terrorists don't care if they're killing civilians or military police. Why would they? An American life is an American life, and they're killing more than ever.\n \n \n\n On the other hand, extremists are being captured and killed at a far greater rate than was happening prior to 9/11. They are literally flocking into Iraq.\n\n Maybe, but so long they're killing so many Americans, it's really not that great. Both terrorists killed and Americans killed have gone up. That seems a hollow victory to me.\n \n -Wez", 
   {}, 
   147903, 
   null, 
   1121601600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bu$h has no use for public concerns", 
  "url": "http://www.4forums.com/political/government-debates/5570-bu-h-has-no-use-public-concerns.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 5570, 
  "discussion_files": [
   [
    "30067.html", 
    "http://www.4forums.com/political/government-debates/5570-bu-h-has-no-use-public-concerns-print.html"
   ], 
   [
    "30068.html", 
    "http://www.4forums.com/political/government-debates/5570-bu-h-has-no-use-public-concerns-2-print.html"
   ]
  ], 
  "identifier": 5570
 }
]