[
 [
  [
   134102, 
   null, 
   "georged", 
   "Lord T touched on the subject of short/long term interest yield spreads with the looming possibility of inversion in another thread. This article is the first general media report I've read that addresses this most fearsome potential and puts a number, regardless of validity, on the economic impact of the residential housing bubble bursting:\n \n http://www.marketwatch.com/news/story.asp?guid=%7B61D996A6-75FF-4529-ABAB-E79814C7DC30%7D&siteid=google\n \n Since the US's chief economic propagandist is still claiming to use short-term interest rates to cool 'potential' inflation while excluding energy and food from that calculation without mention of Asian government investors in treasury issues demanding higher interest rates to offset USD losses, I was wondering what others think the impact of the housing bubble collapse might be in percentage of US GDP. Gotta be a biggie.", 
   {
    "post_info": {
     "post_title": "US interest rates and the housing bubble"
    }
   }, 
   null, 
   null, 
   1118164380.0
  ], 
  [
   134118, 
   null, 
   "gamehuis", 
   "I was reading about Greenspans comments on the possible inversion of long and short term rates yesterday and was amazed (or maybe I shouldn't have been) that the man just basically acts like there's no problem.\n This man will say just about anything to keep the USS America afloat.\n \n But eventhough the man is acting nonchalantly about it, he must be sweating like a pig behinds the scenes. On the one hand inversion of the long and short term rates is deadly, but on the other hand he must continue to raise rates to keep the inflation down and to keep foreign investors buying those T-bills.\n I wonder how long he can keep this act up.\n \n As for the housing bubble, I never knew that so much of the current US economic activity was related to the housing boom. \n Can you imagine when the bubble breaks? The US can then just write off 25% of its GDP. Ouch.", 
   {}, 
   134102, 
   null, 
   1118166540.0
  ], 
  [
   134131, 
   null, 
   "georged", 
   "\n As for the housing bubble, I never knew that so much of the current US economic activity was related to the housing boom. \n Can you imagine when the bubble breaks? The US can then just write off 25% of its GDP. Ouch.\n\n \n US GDP is over 80% public and consumer spending facilitated by debt. Domestic housing is by far our healthiest industry, contributing whatever volume it is to our internal transactions. 2005 mortgage volume alone is projected at $2.1-trillion, that's 18% of GDP by itself. Considering flow-through services supported by the building industry, 25% might well be a conservative number.", 
   {}, 
   134118, 
   null, 
   1118167920.0
  ], 
  [
   134134, 
   null, 
   "gamehuis", 
   "Dude I hope you have a house with a big electric fence around it and are in the possession of a big gun, because when the bubble breaks it's not going to be pretty.\n \n I also hope that you have some money stored away which you can use to scoop up all that cheap real-estate when the market has hit rock bottom. :p", 
   {}, 
   134131, 
   null, 
   1118168280.0
  ], 
  [
   134147, 
   null, 
   "georged", 
   "Dude I hope you have a house with a big electric fence around it and are in the possession of a big gun, because when the bubble breaks it's not going to be pretty.\n \n I also hope that you have some money stored away which you can use to scoop up all that cheap real-estate when the market has hit rock bottom. :p\n\n \n Raw land suitable for development will drop down nicely and they don't make anymore of that. Nobody wants the crackerboxes currently being pawned off on the public. The big unknown is recovery period. Investing in something at the bottom is always dependent on how long money is tied up before it provides a return. With a service economy and no manufacturing dominance to put new wealth and jobs into the system, what's going to drive a recovery?", 
   {}, 
   134134, 
   null, 
   1118169780.0
  ], 
  [
   134158, 
   null, 
   "daewoo", 
   "Since the US's chief economic propagandist is still claiming to use short-term interest rates to cool 'potential' inflation while excluding energy and food from that calculation without mention of Asian government investors in treasury issues demanding higher interest rates to offset USD losses, I was wondering what others think the impact of the housing bubble collapse might be in percentage of US GDP. Gotta be a biggie.\n\n \n I would imagine around 25% if you limit it to strictly the housing bubble, construction and associated supply pipelines.\n \n If you broaden the view a little bit, I would say much more than that. Housing bubble bursting will put millions upside down in their homes. Even those who manage to hang onto those homes will have a hard time affording much beyond that. Additionally, many folks have transferred credit cards and such to their mortgage, and at adjustable rates.\n \n A bursting of the housing bubble will have adverse effects on all areas of the economy from the stock market to consumer spending. Given the broader view, I would imagine 35-40% is a reasonable estimate. \n \n There is some precedent for such a bubble burst. Look at the Ag crash of the early 80s. Most ag operations were essentially operating on the strength of land prices. Overnight farmland went from $1000 per acre to $80 per acre. Realistically, it never should have gotten that low, but the market overcorrected. Look at the effect that had in agricultural communities. Farmers were going out of business faster than the paperwork could be filed. New car sales in those areas went through the floor. Even consumer stores filling basic needs (grocery stores, clothing stores, etc..) felt the heat. Here in Emporia, there used to be 5 grocery stores. By then end there was only 1, a Dillon's that was being kept alive through capital influxes from corporate. \n \n I think that it is comparable, though the housing bubble presents the same problem on a national scale. Too many people are living on credit and are frankly overextended, and too much of that credit is tied directly to their home.", 
   {
    "unicode_changes_made": true
   }, 
   134102, 
   null, 
   1118171280.0
  ], 
  [
   134166, 
   null, 
   "daewoo", 
   "Raw land suitable for development will drop down nicely and they don't make anymore of that. Nobody wants the crackerboxes currently being pawned off on the public. The big unknown is recovery period. Investing in something at the bottom is always dependent on how long money is tied up before it provides a return. With a service economy and no manufacturing dominance to put new wealth and jobs into the system, what's going to drive a recovery?\n\n \n That is truly the hundred mllion dollar question. I have tapped my usual sources for such tidbits of information, but nobody seems willing to hazard a guess. \n \n With the low value of current homes (carboard siding, chipboard roof and floors, etc...) I doubt we will see a rush to buy them. Purchasing land for development may be riskier than it has been in the past, since people seem to be having trouble seeing any real end to the problems. Even if you pick up development land at a dime on the dollar, you are not doing any good if you have to sit on it (and pay taxes on it) for 30+ years.", 
   {}, 
   134147, 
   null, 
   1118172060.0
  ], 
  [
   134174, 
   null, 
   "gamehuis", 
   "Raw land suitable for development will drop down nicely and they don't make anymore of that. Nobody wants the crackerboxes currently being pawned off on the public. The big unknown is recovery period. Investing in something at the bottom is always dependent on how long money is tied up before it provides a return. With a service economy and no manufacturing dominance to put new wealth and jobs into the system, what's going to drive a recovery?\n\n Well, my guess is that after the bubble bursts, people will be so desperate for cash that they'll buy in to the Social Security/Private Accounts scheme/scam.\n This will boost the equity markets, which in turn will boost consumer confidence, which in turn will boost consumer spending and so will boost GDP and the whole circus will start all over again. ;)", 
   {}, 
   134147, 
   null, 
   1118173020.0
  ], 
  [
   134183, 
   null, 
   "daewoo", 
   "Well, my guess is that after the bubble bursts, people will be so desperate for cash that they'll buy in to the Social Security/Private Accounts scheme/scam.\n This will boost the equity markets, which in turn will boost consumer confidence, which in turn will boost consumer spending and so will boost GDP and the whole circus will start all over again. ;)\n\n \n I don't think that a corrolation between private accounts and a cash poor public is likely to exist. Places I have been where there are severe economic problems, people are more interested in keeping food on the table and a roof over their heads than in hypothetical retirement arrangements.\n \n the issue is not entirely consuemr confidence. Our consumer marrket is based largely on private debt. If you take away the ability to charge it, consumer markets are in for a bumpy ride regardless of consumer confidence levels. Over half of home loans in the US are variable rate, and fewer than 20% of american homeowners have 10% equity in those homes. This is goign to make it difficult int he face of a correction for consumers to obtain credit.", 
   {}, 
   134174, 
   null, 
   1118173620.0
  ], 
  [
   134194, 
   null, 
   "georged", 
   "Well, my guess is that after the bubble bursts, people will be so desperate for cash that they'll buy in to the Social Security/Private Accounts scheme/scam.\n This will boost the equity markets, which in turn will boost consumer confidence, which in turn will boost consumer spending and so will boost GDP and the whole circus will start all over again. ;)\n\n \n Consumer confidence, spending and private accounts all require jobs. What jobs will replace those lost by an abrupt adjustment in the residential real estate market? In a single residential transaction there's the builder, subs, suppliers, appraiser, loan officer/clerical staff, escrow officer/clerical staff, loan seller after transaction closes, loan buyer, staffs and we haven't landscaped, furnished or maintained it. Any economy will only absorb a finite number of burger flippers. \n \n You're just getting tired of short selling stress and hoping for long-term equity positions with reasonable capital gain tax rates?", 
   {}, 
   134174, 
   null, 
   1118174580.0
  ], 
  [
   134211, 
   null, 
   "gamehuis", 
   "Oops, yeah I forgot that to spend you need a job. The whole 'borrow money for free' deal which the US has right now won't apply anymore when the bubble breaks and financial institutions are left in ruin. Sorry, my bad.\n \n \nYou're just getting tired of short selling stress and hoping for long-term equity positions with reasonable capital gain tax rates?\n\n Heh, that would indeed be nice and a lot more relaxing than the vulturing I'm doing right now.\n \n I also have another motive for wanting the market to stay stable. My family has a lot of stock in two bio-tech firms, one of which will have an IPO later this year. It's imperative that the market doesn't tank for a couple of years so that we can offload the stock and cash in.\n Ideally the market should stay stable for about 5 years or so. If it tanks after that it's fine by me.", 
   {}, 
   134194, 
   null, 
   1118175780.0
  ], 
  [
   134217, 
   null, 
   "lord tammerlain", 
   "Give it about one year after Greenspan retires before the house of cards crumbles. The bursting of the bubble is going to need a pyschological push and the broader markets faith in Greenspan will be gone replaced by ????. When some bad economic numbers pop up and the new guy cant soothe the investor's emotions the decline will hit and hit fast ( should be slower then the tech bubble bursting but felt alot more )", 
   {}, 
   134211, 
   null, 
   1118176200.0
  ], 
  [
   134249, 
   null, 
   "georged", 
   "\n I also have another motive for wanting the market to stay stable. My family has a lot of stock in two bio-tech firms, one of which will have an IPO later this year. It's imperative that the market doesn't tank for a couple of years so that we can offload the stock and cash in.\n Ideally the market should stay stable for about 5 years or so. If it tanks after that it's fine by me.\n\n \n Restricted stock tied to earnings or cap? That's a tough one. This administration has so many secret balls in the air I don't think anyone can predict what timetable to use on market duration for anything. When real estate does adjust, there's going to be a mob of dummies screaming while trying to get at their government encouraged pre-tax savings before they evaporate like after the dot.com thing. That'll be the time to scoop up well-capitalized blue chips. Five years is a long time. If anyone had told me five-years ago that we'd be spending public money we don't have like a drunken sailor, I'd have laughed.", 
   {}, 
   134211, 
   null, 
   1118180460.0
  ], 
  [
   134259, 
   null, 
   "georged", 
   "Give it about one year after Greenspan retires before the house of cards crumbles. The bursting of the bubble is going to need a pyschological push and the broader markets faith in Greenspan will be gone replaced by ????. When some bad economic numbers pop up and the new guy cant soothe the investor's emotions the decline will hit and hit fast ( should be slower then the tech bubble bursting but felt alot more )\n\n \n There are rumors of his going on through the end of this administration.\n The general publics comfortable with his political bob & weave ability of never answering a question, never providing a statement that can be pinned down and support of this administration cooking the books. I'm beginning to wonder if domestic vehicle manufacturing might not spring the first hole in the dike. They have a good year of cash, though Ford isn't as well capitalized as GM nor do they have GM's cash but many of primary suppliers of both are in dire straits. IMO jobs going will precede a real estate adjustment.", 
   {}, 
   134217, 
   null, 
   1118181120.0
  ], 
  [
   134263, 
   null, 
   "gamehuis", 
   "Restricted stock tied to earnings or cap? That's a tough one. This administration has so many secret balls in the air I don't think anyone can predict what timetable to use on market duration for anything. When real estate does adjust, there's going to be a mob of dummies screaming while trying to get at their government encouraged pre-tax savings before they evaporate like after the dot.com thing. That'll be the time to scoop up well-capitalized blue chips. Five years is a long time. If anyone had told me five-years ago that we'd be spending public money we don't have like a drunken sailor, I'd have laughed.\n\n Well the thing is that we can technically offload the stock from the first company on the day of the IPO. My family only owns about 2%, so we don't have any selling restrictions. But the company is sure to have an earnings increase of at least 500% in the next couple of years because the market segment in which it operates is projected to grow from $ 1 billion to $ 7 billion over the next 5 years and the company owns some very nifty patents.\n \n So the question is, do we dump the stock this year and make a killing or do we hold on to the stock, wait till the stock price goes up and make a real killing (but increase the risk of the market going belly up and leave us with virtually nothing)?\n \n The other company is affiliated with the first, but isn't projected to have an IPO for at least 3-4 years.\n \n This is why the 5 year stable market timeframe is so important to me.\n \n I'm just hoping that the Feds will be able to cook the books for such a long timeframe.\n \n \nIMO jobs going will precede a real estate adjustment.\n\n http://money.cnn.com/2005/06/07/news/fortune500/gm_closings/index.htm\n \n Argh! :p", 
   {}, 
   134249, 
   null, 
   1118181360.0
  ], 
  [
   134303, 
   null, 
   "fracas", 
   "a whole thread on an estimate\n fascinating\n \n \n reminds me of threads like \"What if Napoleon had a B52 at Waterloo\"\n \n let the bubble burst and the sky fall i say\n its about time\n \n the money i've put into my houses have been less than rent.", 
   {}, 
   134263, 
   null, 
   1118184240.0
  ], 
  [
   134330, 
   null, 
   "georged", 
   "\n So the question is, do we dump the stock this year and make a killing or do we hold on to the stock, wait till the stock price goes up and make a real killing (but increase the risk of the market going belly up and leave us with virtually nothing)?\n \n The other company is affiliated with the first, but isn't projected to have an IPO for at least 3-4 years.\n \n This is why the 5 year stable market timeframe is so important to me.\n \n I'm just hoping that the Feds will be able to cook the books for such a long timeframe.\n \n \n http://money.cnn.com/2005/06/07/news/fortune500/gm_closings/index.htm\n \n Argh! :p\n\n \n Everyone would like to have that crystal ball.", 
   {}, 
   134263, 
   null, 
   1118187900.0
  ], 
  [
   134335, 
   null, 
   "fracas", 
   "a question for Daewoo\n \n since you put so much emphasis on the significance of manufacturing aspects of the economy, what is your response to GM's labor cutting. such a move would trim the company to make it more competitive, thus a stronger economic engine ... but at the cost of jobs, which would significantly dampens the economic power of the consumer base to buy the manufactured products.", 
   {}, 
   134330, 
   null, 
   1118188320.0
  ], 
  [
   134339, 
   null, 
   "georged", 
   "a whole thread on an estimate\n fascinating\n \n \n reminds me of threads like \"What if Napoleon had a B52 at Waterloo\"\n \n let the bubble burst and the sky fall i say\n its about time\n \n the money i've put into my houses have been less than rent.\n\n \n I think the only estimates, or unknowns, are timing and scope. Conditions required for that market to adjust are well defined and in place. All it needs to start leaking is a couple of months of declining job market and the general public will begin the serious frown stage.", 
   {}, 
   134303, 
   null, 
   1118188620.0
  ], 
  [
   134341, 
   null, 
   "daewoo", 
   "a question for Daewoo\n \n since you put so much emphasis on the significance of manufacturing aspects of the economy, what is your response to GM's labor cutting. such a move would trim the company to make it more competitive, thus a stronger economic engine ... but at the cost of jobs, which would significantly dampens the economic power of the consumer base to buy the manufactured products.\n\n \n It was inevitable. We have all just been waiting for the official news.\n \n It will certainly trim the company, but frankly it is probably too little too late. Legacy costs are killing them, and in the past they have skimped on quality in order to compete even with the massive legacy overhead. They have built a reputation for poor quality. for most Americans, their vehicle is the second biggest investment they will ever make. They do not simply forget 15-20 years of bad reputation overnight. \n \n GM is facing declining sales and a loss of market share. Cutting those jobs and movign remaingin plants to 100% capacity is a cost savings measure that they shouldhave taken 5 years ago.", 
   {}, 
   134335, 
   null, 
   1118188920.0
  ], 
  [
   134351, 
   null, 
   "daewoo", 
   "I think the only estimates, or unknowns, are timing and scope. Conditions required for that market to adjust are well defined and in place. All it needs to start leaking is a couple of months of declining job market and the general public will begin the serious frown stage.\n\n \n Or another 1% increase in interest rates, which is enough to put a not unsignificant portion of homeowners at a point where they will be unable to service their mortgage.", 
   {}, 
   134339, 
   null, 
   1118189640.0
  ], 
  [
   134382, 
   null, 
   "fracas", 
   "It was inevitable. We have all just been waiting for the official news.\n \n It will certainly trim the company, but frankly it is probably too little too late. Legacy costs are killing them, and in the past they have skimped on quality in order to compete even with the massive legacy overhead. They have built a reputation for poor quality. for most Americans, their vehicle is the second biggest investment they will ever make. They do not simply forget 15-20 years of bad reputation overnight. \n \n GM is facing declining sales and a loss of market share. Cutting those jobs and movign remaingin plants to 100% capacity is a cost savings measure that they shouldhave taken 5 years ago.\n\n \n certainly GM was a bloated beast laden with quality and distribution problems. but that wasn't my question.\n \n it was more about the balance between an efficient manufacturer trimming itself to be a stronger economic engine and that of the economic cost of layoffs.", 
   {}, 
   134341, 
   null, 
   1118191260.0
  ], 
  [
   134383, 
   null, 
   "georged", 
   "It was inevitable. We have all just been waiting for the official news.\n \n It will certainly trim the company, but frankly it is probably too little too late. Legacy costs are killing them, and in the past they have skimped on quality in order to compete even with the massive legacy overhead. They have built a reputation for poor quality. for most Americans, their vehicle is the second biggest investment they will ever make. They do not simply forget 15-20 years of bad reputation overnight. \n \n GM is facing declining sales and a loss of market share. Cutting those jobs and movign remaingin plants to 100% capacity is a cost savings measure that they shouldhave taken 5 years ago.\n\n \n The unspoken impact is those are primarily assembly plants and parts depots. \n Moving them offshore will also cost domestic support jobs, making the total loss closer to 100,000 jobs or more, depending if 3 or 4 to one is used as the flow-through multiplier. And GM vehicle volume is forecast as dropping from the current 6-million units to 5-million/yr for an additional transaction loss in dealer margin, service and finance. Tough to replace that, and the loss of capital expenditures, in a service economy. Let's not forget public announcements are normally the tip of a planning iceberg.", 
   {}, 
   134341, 
   null, 
   1118191260.0
  ], 
  [
   134389, 
   null, 
   "georged", 
   "The unspoken impact is those are primarily assembly plants and parts depots. \n Moving them offshore will also cost domestic support jobs, making the total loss closer to 100,000 jobs or more, depending if 3 or 4 to one is used as the flow-through multiplier. And GM vehicle volume is forecast as dropping from the current 6-million units to 5-million/yr for an additional transaction loss in dealer margin, service and finance. Tough to replace that, and the loss of capital expenditures, in a service economy. Let's not forget public announcements are normally the tip of a planning iceberg.\n\n \n ps: when I say moving them offshore I meant the capital investment. To where JT is probably already spending it preparing to service that market.", 
   {}, 
   134383, 
   null, 
   1118191440.0
  ], 
  [
   134391, 
   null, 
   "lord tammerlain", 
   "certainly GM was a bloated beast laden with quality and distribution problems. but that wasn't my question.\n \n it was more about the balance between an efficient manufacturer trimming itself to be a stronger economic engine and that of the economic cost of layoffs.\n\n \n \n GM going bankrupt would not be a strong economic engine, and mass layoffs would still have occured", 
   {}, 
   134382, 
   null, 
   1118191560.0
  ], 
  [
   134399, 
   null, 
   "fracas", 
   "it fascinates me how both you, georged, and Daewoo have not been able to answer the question without being bogged by the particulars and doomsaying, as well as stating the obvious.\n \n Daewoo: GM's move should have occurred long ago. that is obvious that when any behemoths undertake restructuring the concensus is always it should havev happened long ago. that GM has a reputation for poor quality.\n \n Georged: that the economic impact will be more than the 25000 layoff. duh. as GM down sizes this will effect also the parts manufacturers, suppliers, those who service the products, those who sell the products, those we service the laidoff workers ... etc. obvious.\n \n LT: a bankrupt company cannot be an economic engine. duh.\n \n \n so let me rephrase the question again.\n What should the balance be when a large company needs to restructure to remain economically competitive, especially when layoff are significant.\n an economy needs both suppliers and consumers (duh, my share of the obvious to keep things on tract) especially when the economic emphasis is on manufacturing.", 
   {}, 
   134391, 
   null, 
   1118191980.0
  ], 
  [
   134407, 
   null, 
   "daewoo", 
   "certainly GM was a bloated beast laden with quality and distribution problems. but that wasn't my question.\n \n it was more about the balance between an efficient manufacturer trimming itself to be a stronger economic engine and that of the economic cost of layoffs.\n\n \n \n The layoffs are inconsequential in this case. GM is fighting for survival. They have tio do whatever it takes towards that end. If that means layoff, so be it. The alternative is to keep running like they have been and EVERYBODY is out of a job.", 
   {}, 
   134382, 
   null, 
   1118192400.0
  ], 
  [
   134414, 
   null, 
   "daewoo", 
   "so let me rephrase the question again.\n What should the balance be when a large company needs to restructure to remain economically competitive, especially when layoff are significant.\n an economy needs both suppliers and consumers (duh, my share of the obvious to keep things on tract) especially when the economic emphasis is on manufacturing.\n\n \n That has already been answered. What should the balance be? You trim the fat, do the layoffs, and move on. Otheriwse you end up with a compnay that is belly up, which removes even nmore consumers from the pool, plus you have lost a manufacturer. Consumers are a lot easier to come by than manufacturers, especially in an employers labor market where labort costs drop as people are willing to work for less. If labor costs drop low enoguh (along with compliance costs), we could possibly actually EXPORT some stuff for a net gain to our economy.", 
   {}, 
   134399, 
   null, 
   1118192880.0
  ], 
  [
   134415, 
   null, 
   "georged", 
   "a question for Daewoo\n \n since you put so much emphasis on the significance of manufacturing aspects of the economy, what is your response to GM's labor cutting. such a move would trim the company to make it more competitive, thus a stronger economic engine ... but at the cost of jobs, which would significantly dampens the economic power of the consumer base to buy the manufactured products.\n\n \n Smaller, trimmer, etc. is not stronger as an economic force. The high level of competition will keep ROIs at defined levels, with GM admittedly already $1500/unit behind all competition but Ford. The consumer purchaser base, excluding those directly and indirectly affected by facility and personnel reductions, will purchase from other manufacturers. If they don't switch to Ford, all profits from their brand switch will leave the country, diminish equity market dividends, adding to our current outflow of wealth. This is a survival move with a negative impact on the general economy.", 
   {}, 
   134335, 
   null, 
   1118192940.0
  ], 
  [
   134423, 
   null, 
   "daewoo", 
   "Smaller, trimmer, etc. is not stronger as an economic force. The high level of competition will keep ROIs at defined levels, with GM admittedly already $1500/unit behind all competition but Ford. The consumer purchaser base, excluding those directly and indirectly affected by facility and personnel reductions, will purchase from other manufacturers. If they don't switch to Ford, all profits from their brand switch will leave the country, diminish equity market dividends, adding to our current outflow of wealth. This is a survival move with a negative impact on the general economy.\n\n \n \n IMO the interesting thing will be to see how ford responds. With GM offering their employee discount to the general public, and taking some cost cutting measures, I think it is pretty obvious that they are going after market share from ford. Both compnaies are in similar financial condition, but GM has a LOT more cash and much stronger lines of credit. I think that both companies know that taking market share fromt he japanese is a joke, and that now that the japanese have set their sights on the truck market, their days (ford and GM) there are numbered.", 
   {}, 
   134415, 
   null, 
   1118193960.0
  ], 
  [
   134426, 
   null, 
   "georged", 
   "IMO the interesting thing will be to see how ford responds. With GM offering their employee discount to the general public, and taking some cost cutting measures, I think it is pretty obvious that they are going after market share from ford. Both compnaies are in similar financial condition, but GM has a LOT more cash and much stronger lines of credit. I think that both companies know that taking market share fromt he japanese is a joke, and that now that the japanese have set their sights on the truck market, their days (ford and GM) there are numbered.\n\n \n Fantasies of taking market share from any of the foreign marques would be a result of quality illegal drugs. Both are after remains of the buy American market segment. Ford put forth a lot of hype, but still hasn't announced any solid measures to turn itself around. Both still have excessive duplication in product lines and surplus production capability burning money. Should be some interesting, forthcoming announcements.", 
   {}, 
   134423, 
   null, 
   1118195520.0
  ], 
  [
   134439, 
   null, 
   "fracas", 
   "That has already been answered. What should the balance be? You trim the fat, do the layoffs, and move on. Otheriwse you end up with a compnay that is belly up, which removes even nmore consumers from the pool, plus you have lost a manufacturer. Consumers are a lot easier to come by than manufacturers, especially in an employers labor market where labort costs drop as people are willing to work for less. If labor costs drop low enoguh (along with compliance costs), we could possibly actually EXPORT some stuff for a net gain to our economy.\n\n \n so you favor an effective competitive company over labor.", 
   {}, 
   134414, 
   null, 
   1118197800.0
  ], 
  [
   134440, 
   null, 
   "georged", 
   "so you favor an effective competitive company over labor.\n\n \n I can't answer for Daewoo, but can assure you that it's required for any manufacturing business, for-profit, not-for-profit, privately, publicly or employee owned, to be effective in order to employ labor on a long-term basis.", 
   {}, 
   134439, 
   null, 
   1118198400.0
  ], 
  [
   134441, 
   null, 
   "daewoo", 
   "so you favor an effective competitive company over labor.\n\n \n Of course. Unemployed labor (after the companies are gone) basically equates to people standing around. There is no inherent value in people standing around doing nothing.", 
   {}, 
   134439, 
   null, 
   1118198460.0
  ], 
  [
   134442, 
   null, 
   "fracas", 
   "i agree. just getting some clarification of where you guys stand. \n \n yes, we should cut labor cost.\n yes, we should also cut management bloat.\n \n \n to me, the GM cut is a necessary action to even try to remain in the game. whether they came too little too late remain to be seen.\n not a bad news thing for the national economy though it will hurt quite a few. hopefully they can find replacement jobs.", 
   {}, 
   134440, 
   null, 
   1118198880.0
  ], 
  [
   134447, 
   null, 
   "daewoo", 
   "i agree. just getting some clarification of where you guys stand. \n \n yes, we should cut labor cost.\n yes, we should also cut management bloat.\n\n \n IMO Management bloat is as big a problem, if not bigger, than production labor costs. We ahev one of the most over managed workforces on the planet. Too many birght eyed young high school students have gone on to college with thoughts fo finding desk work somewhere. Too many folks driving desks, not enough wrench turners. The cumulative effect of this has been devastating ont he US economy. Good wrench turners have become increasingly difficult to find, while MBAs are a dime a dozen. It is to the point that wrench turners demand a premium, and we have no choice but to pay it. My little brother is a mechanic. He made nearly $70,000 last year. he just turned down a job at a ford dealership in missouri that was offering a $35,000 sign on bonus. When his current employer found that he was seriously conmsidering leaving, they matched the $35,000 in exchange for a 2 yr contract. \n \n \n \nto me, the GM cut is a necessary action to even try to remain in the game. whether they came too little too late remain to be seen.\n not a bad news thing for the national economy though it will hurt quite a few. hopefully they can find replacement jobs\n \n\n \n As long as bush is still around, he will create governmetn jobs for them to keep GDP pumped.", 
   {}, 
   134442, 
   null, 
   1118199600.0
  ], 
  [
   134522, 
   null, 
   "fracas", 
   "yes, Bush is responsible for everything! emoticon_rolleyes\n \n back to the real world\n \nThis year, U.S. industrial production is expected to rise 3.7%, slower than the 4.1% growth of last year. Germany is expected to slow to growth of 1.9% from 2.4%, while Italy is forecast to record a decline of 0.5%, compared with a fall of 0.7% in 2004. The drop-off is even more pronounced in parts of Asia, with industrial-production growth slipping to 1.4% in Japan from 5.2%, to 7.5% in Malaysia from 12.6%, and to 6.3% in Singapore from 13.9%. Export-oriented Asian economies such as Malaysia depend heavily on Japan to soak up their goods and are getting hammered by its slowdown. China is expected to decelerate modestly, to 14% from 16.7%, although past predictions about Chinese slowdowns haven't materialized.\n \n The region suffering the most from the slowdown is Western Europe, where strict regulations and a lack of labor mobility make it difficult and expensive for companies to cut costs through outsourcing and layoffs. Currency shifts also have hurt manufacturers there. Although the dollar has regained some ground recently, the weakening of the U.S. currency makes U.S.-made goods more competitive in Europe and other markets.\n \n A wide range of industries, from autos to semiconductors to heavy machinery, are feeling the slump. The impact of the auto sector's weakness, mainly in the U.S. and Europe, has spread through the network of auto-parts suppliers, and many now are struggling to survive.\n \n A survey of chief financial officers, conducted by Duke University and CFO Magazine, found that 87% of U.S. manufacturers said they were facing pricing pressures as a result of high energy and raw material costs, while only 2.3% cited labor costs. The survey found Asian manufacturers point to rising wages as their biggest problem.\n\n \n interesting that US manufacturing increase for last year was ahead of GDP growth, and at least on par with this year's GDP growth.", 
   {}, 
   134447, 
   null, 
   1118247600.0
  ], 
  [
   134558, 
   null, 
   "georged", 
   "yes, Bush is responsible for everything! emoticon_rolleyes\n \n back to the real world\n \n \n interesting that US manufacturing increase for last year was ahead of GDP growth, and at least on par with this year's GDP growth.\n\n \n GDP as a whole number is meaningless for other than maintaining consumer confidence when incurred debt and supplementary funding (non-budget debt) are included. Subtract them and look at GDP. For lack of significance of manufacturing growth, look at GDP composition for 2004:\n \n agriculture: 0.9% \n industry: 19.7% \n services: 79.4% \n \n We are in an internal transaction service economy. The decline of our manufacturing industry due to inability to compete is reflected by our abnormal trade deficit and payment imbalance. Little new wealth is entering with a high rate of capital fleeing the country. \n \n Bush isn't responsible for our decline, that started in the early 1980s, he merely facilitated the highest rate of deterioration in history due to fiscal irresponsibility in efforts to drive GDP for consumer confidence in a service economy.", 
   {}, 
   134522, 
   null, 
   1118251140.0
  ], 
  [
   134565, 
   null, 
   "Missouri Mule", 
   "GDP as a whole number is meaningless for other than maintaining consumer confidence when incurred debt and supplementary funding (non-budget debt) are included. Subtract them and look at GDP. For lack of significance of manufacturing growth, look at GDP composition for 2004:\n \n agriculture: 0.9% \n industry: 19.7% \n services: 79.4% \n \n We are in an internal transaction service economy. The decline of our manufacturing industry due to inability to compete is reflected by our abnormal trade deficit and payment imbalance. Little new wealth is entering with a high rate of capital fleeing the country. \n \n Bush isn't responsible for our decline, that started in the early 1980s, he merely facilitated the highest rate of deterioration in history due to fiscal irresponsibility in efforts to drive GDP for consumer confidence in a service economy.\n\n \n One thing is for certain. Either you are right or you are wrong. How long do we have to wait for your doom and gloom prophesy to come to fruition? Seems I have been hearing this for about three decades now.", 
   {}, 
   134558, 
   null, 
   1118251500.0
  ], 
  [
   134578, 
   null, 
   "fracas", 
   "GDP as a whole number is meaningless for other than maintaining consumer confidence when incurred debt and supplementary funding (non-budget debt) are included. Subtract them and look at GDP. For lack of significance of manufacturing growth, look at GDP composition for 2004:\n \n agriculture: 0.9% \n industry: 19.7% \n services: 79.4% \n \n We are in an internal transaction service economy. The decline of our manufacturing industry due to inability to compete is reflected by our abnormal trade deficit and payment imbalance. Little new wealth is entering with a high rate of capital fleeing the country. \n \n Bush isn't responsible for our decline, that started in the early 1980s, he merely facilitated the highest rate of deterioration in history due to fiscal irresponsibility in efforts to drive GDP for consumer confidence in a service economy.\n\n the point i made was that the manufacturing growth rate exceeds that of the national economy.\n we used to be an agrarian economy and when this changed, many cried doom. we changed and evolved.\n we have already shifted away from an industrial economy. already. no use crying over spilt milk. we will evolve.\n we cannot remain an industrialized economy anyway considering the global economy.\n i do not see being a service economy as being a problem.", 
   {}, 
   134558, 
   null, 
   1118252460.0
  ], 
  [
   134597, 
   null, 
   "daewoo", 
   "the point i made was that the manufacturing growth rate exceeds that of the national economy.\n we used to be an agrarian economy and when this changed, many cried doom. we changed and evolved.\n we have already shifted away from an industrial economy. already. no use crying over spilt milk. we will evolve.\n we cannot remain an industrialized economy anyway considering the global economy.\n i do not see being a service economy as being a problem.\n\n \n you do not see being a serviced based economy as a problem? If you are a service based economy, where does new wealth come from? Additionally, assuming that you are not running a perfectly balanced economy (i.e where you manufacture JUST enough goods for your economy and do not have to import anything), a service based economy requires imports to operate. Every time we import something, money leaves the country. You do understand that there is a finite amount of wealth available, right?\n \n What happens when you have a bucket and poke a hole in it?", 
   {}, 
   134578, 
   null, 
   1118253600.0
  ], 
  [
   134602, 
   null, 
   "lord tammerlain", 
   "the point i made was that the manufacturing growth rate exceeds that of the national economy.\n we used to be an agrarian economy and when this changed, many cried doom. we changed and evolved.\n we have already shifted away from an industrial economy. already. no use crying over spilt milk. we will evolve.\n we cannot remain an industrialized economy anyway considering the global economy.\n i do not see being a service economy as being a problem.\n\n \n \n Only if the services that are created can produce new wealth for the US. These services will need to be exchanged with other countries in order to pay for imports of physical goods.\n \n You can see the strong push by the US for IP rights as a way to ensure that services will be in some way a tradable good. For the \"global economy\" and the US being a service economy it is going to have to concentrate on the creative aspects of business and industry to remain wealthy. This means a high level of education for a large part of the population.\n \n Otherwise trying to support an economy on a large number of custodial engineers and the culinary art of burger flipping will be very difficult.", 
   {}, 
   134578, 
   null, 
   1118253720.0
  ], 
  [
   134603, 
   null, 
   "Missouri Mule", 
   "you do not see being a serviced based economy as a problem? If you are a service based economy, where does new wealth come from? Additionally, assuming that you are not running a perfectly balanced economy (i.e where you manufacture JUST enough goods for your economy and do not have to import anything), a service based economy requires imports to operate. Every time we import something, money leaves the country. You do understand that there is a finite amount of wealth available, right?\n \n What happens when you have a bucket and poke a hole in it?\n\n \n How long do you libs get away with your \"hamburger flipper\" charge against the Republicans?\n \n I'll worry about the \"wealth\" leaving this country when Greenspan starts to worry about it.", 
   {}, 
   134597, 
   null, 
   1118253780.0
  ], 
  [
   134604, 
   null, 
   "georged", 
   "the point i made was that the manufacturing growth rate exceeds that of the national economy.\n we used to be an agrarian economy and when this changed, many cried doom. we changed and evolved.\n we have already shifted away from an industrial economy. already. no use crying over spilt milk. we will evolve.\n we cannot remain an industrialized economy anyway considering the global economy.\n i do not see being a service economy as being a problem.\n\n \n Then tell me how you're going to expand, capitalize, a service economy dependent on internal transactions when your wealth is leaving the country, not coming in. The only issue is to what extent credit can be expanded and still service incurred debt, which also defines the finite time frame because that's ultimately dependent on tax base. \n \n That's no different than a citizen, income and bills, with credit cards. If that person's income, tax base in the case of government, is increasing, credit can be expanded to service credit card debt. If income drops, compounded interest will eventually overtake it, resulting in insolvency.", 
   {}, 
   134578, 
   null, 
   1118253900.0
  ], 
  [
   134609, 
   null, 
   "lord tammerlain", 
   "Greenspan is worried about it, he has quite often expressed his concern about the trade deficit. One has to consider Greenspan always when speaking about the economy expresses his concern in the best possible light.\n \n Stock market bubble - Irrational exurberance, end result Nasdaq dropped by 60%, DOW by what 30% or so\n \n Housing bubble - froth", 
   {}, 
   134603, 
   null, 
   1118254080.0
  ], 
  [
   134610, 
   null, 
   "daewoo", 
   "GDP as a whole number is meaningless for other than maintaining consumer confidence when incurred debt and supplementary funding (non-budget debt) are included. Subtract them and look at GDP. For lack of significance of manufacturing growth, look at GDP composition for 2004:\n \n agriculture: 0.9% \n industry: 19.7% \n services: 79.4% \n \n \n \n \n\n \n \n compared to:\n \n Agriculture 2.8%\n Industry 34%\n Services 63.2%\n \n In 1965 (40 yrs)", 
   {}, 
   134558, 
   null, 
   1118254140.0
  ], 
  [
   134627, 
   null, 
   "daewoo", 
   "Only if the services that are created can produce new wealth for the US. These services will need to be exchanged with other countries in order to pay for imports of physical goods.\n \n You can see the strong push by the US for IP rights as a way to ensure that services will be in some way a tradable good. For the \"global economy\" and the US being a service economy it is going to have to concentrate on the creative aspects of business and industry to remain wealthy. This means a high level of education for a large part of the population.\n \n Otherwise trying to support an economy on a large number of custodial engineers and the culinary art of burger flipping will be very difficult.\n\n \n This would have been a great plan if it had worked. We sould have been the first society to ever exist soley on brain power and bureaucracy.\n \n Instead, IBMs business consulting is in the toilet, American Airlines attempts to sell consulting services ended abruptly due to some rather rude comments by the CEO of british air (namely \"Why would we hire as consultants a compny that relies on government bailouts to stay in business?\"). Apparently people are not real hot to hire folks to tell them how to run their businesseds into the ground.\n \n IP could possibly be saleable, if not for the fact that the chinese essentially do not recognise even the concept and when called on it they flipped the rest of the world the bird. Other nations are starting to steal IP now as well (to the point that the USPTO is considering taking their online patenet database down) in order to stay competitive.", 
   {}, 
   134602, 
   null, 
   1118255040.0
  ], 
  [
   134644, 
   null, 
   "georged", 
   "One thing is for certain. Either you are right or you are wrong. How long do we have to wait for your doom and gloom prophesy to come to fruition? Seems I have been hearing this for about three decades now.\n\n \n That's about right, our decline started in the 1970s with the first imbalance of payments in, I believe, 1981 when we began our swing from creditor to debtor nation. I don't have a crystal ball to predict how long we can maintain our present circumstances; that's dependent on our ability to service debt combined with the level of desirability of our markets by our creditors. It's a big economy and has a lot of wealth to shed.", 
   {}, 
   134565, 
   null, 
   1118256420.0
  ], 
  [
   134652, 
   null, 
   "georged", 
   "You can see the strong push by the US for IP rights as a way to ensure that services will be in some way a tradable good. For the \"global economy\" and the US being a service economy it is going to have to concentrate on the creative aspects of business and industry to remain wealthy. This means a high level of education for a large part of the population.\n \n Otherwise trying to support an economy on a large number of custodial engineers and the culinary art of burger flipping will be very difficult.\n\n \n A very difficult scenario. We're already facing the problem of exchanging quality for quantity education, and that won't cut it. That just creates a partially educated second tier with no application for their limited knowledge/skills while expanding social service demands.", 
   {}, 
   134602, 
   null, 
   1118258100.0
  ], 
  [
   134694, 
   null, 
   "Dono", 
   "What happens when you have a bucket and poke a hole in it?\n\n You would have a Holy bucket, something our president would support.\n Dono", 
   {}, 
   134597, 
   null, 
   1118262600.0
  ], 
  [
   134710, 
   null, 
   "lord tammerlain", 
   "Or like gamehuis, you put your finger in the hole to stop the leak ( I may have the countries mixed up)\n \n (from a old folk style story)", 
   {}, 
   134694, 
   null, 
   1118263200.0
  ], 
  [
   134720, 
   null, 
   "gamehuis", 
   "Yeah, us Dutch guys are renowned for sticking our fingers into dykes and holes. :p", 
   {}, 
   134710, 
   null, 
   1118263620.0
  ], 
  [
   134756, 
   null, 
   "daewoo", 
   "Yeah, us Dutch guys are renowned for sticking our fingers into dykes and holes. :p\n\n \n Ok, before we get off in a conversation aboout the holy implications of sticking your fingers in dykes holes, I will give the answer I was looking for:\n \n You end up with an empty bucket.", 
   {}, 
   134720, 
   null, 
   1118269020.0
  ], 
  [
   134858, 
   null, 
   "fracas", 
   "you do not see being a serviced based economy as a problem? If you are a service based economy, where does new wealth come from? Additionally, assuming that you are not running a perfectly balanced economy (i.e where you manufacture JUST enough goods for your economy and do not have to import anything), a service based economy requires imports to operate. Every time we import something, money leaves the country. You do understand that there is a finite amount of wealth available, right?\n\n and\n \nThen tell me how you're going to expand, capitalize, a service economy dependent on internal transactions when your wealth is leaving the country, not coming in. The only issue is to what extent credit can be expanded and still service incurred debt, which also defines the finite time frame because that's ultimately dependent on tax base. \n \n That's no different than a citizen, income and bills, with credit cards. If that person's income, tax base in the case of government, is increasing, credit can be expanded to service credit card debt. If income drops, compounded interest will eventually overtake it, resulting in insolvency.\n\n define wealth?\n \n btw\n \ncompared to:\n \n Agriculture 2.8%\n Industry 34%\n Services 63.2%\n \n In 1965 (40 yrs)\n\n i find this post funny as it was after my post stating\n \nthe point i made was that the manufacturing growth rate exceeds that of the national economy.\n we used to be an agrarian economy and when this changed, many cried doom. we changed and evolved.\n we have already shifted away from an industrial economy. already. no use crying over spilt milk. we will evolve.\n we cannot remain an industrialized economy anyway considering the global economy.\n i do not see being a service economy as being a problem.\n", 
   {}, 
   134597, 
   null, 
   1118279880.0
  ], 
  [
   134870, 
   null, 
   "daewoo", 
   "and\n \n define wealth?\n\n \n goods with tangible value\n \n \n \n [/quote]i find this post funny as it was after my post stating[/QUOTE]\n \n Didn't see your post. Email notifications from 4forums do not always arrive int eh correct order.", 
   {}, 
   134858, 
   null, 
   1118280540.0
  ], 
  [
   134879, 
   null, 
   "fracas", 
   "goods with tangible value\n\n \n so possession of these goods indicate wealth?\n so if a nation owns more goods with tangible value it is wealthier?\n \n does it matter where the goods come from or just their possession?", 
   {}, 
   134870, 
   null, 
   1118282580.0
  ], 
  [
   134888, 
   null, 
   "daewoo", 
   "so possession of these goods indicate wealth?\n so if a nation owns more goods with tangible value it is wealthier?\n \n does it matter where the goods come from or just their possession?\n\n \n \n I forgot to mentiuon that those goods have to be convertible.\n \n It does not particularly matter where they came from, as long as they havbe tangible value and are fully convertible. Thre romans and the british became exceptionally wealthy by building empires and conquring other nations.", 
   {}, 
   134879, 
   null, 
   1118284740.0
  ], 
  [
   134900, 
   null, 
   "fracas", 
   "I forgot to mentiuon that those goods have to be convertible.\n \n It does not particularly matter where they came from, as long as they havbe tangible value and are fully convertible. Thre romans and the british became exceptionally wealthy by building empires and conquring other nations.\n\n what do you mean convertable?\n \n is building an empire and exploiting the conquered requisit to being a \"wealthy nation\"?", 
   {}, 
   134888, 
   null, 
   1118285880.0
  ], 
  [
   134945, 
   null, 
   "daewoo", 
   "what do you mean convertable?\n \n is building an empire and exploiting the conquered requisit to being a \"wealthy nation\"?\n\n \n Convertible=able to be exchanged for other goods. When you are talking a nation, you need goods that can be exchanged for other goods in other nations. We use money to facilitate such exchanges. The exception would be if you produce everything you need as a nation internally.\n \n Empire building is not a pre requsit, it is generally a sign of desperation. Military conquest is expensive as it is essentially added to overhead. If you are in a situation where you must use your military to build wealth you are in trouble.", 
   {}, 
   134900, 
   null, 
   1118300280.0
  ], 
  [
   134997, 
   null, 
   "fracas", 
   "Convertible=able to be exchanged for other goods. When you are talking a nation, you need goods that can be exchanged for other goods in other nations. We use money to facilitate such exchanges. The exception would be if you produce everything you need as a nation internally.\n\n 1. exchange when?\n \n 2. these are all convertable wealth. do they count?\n cash?\n gold reserve?\n credit?\n \n 3. thus for a nation to be wealthy, we must accumulate more convertable goods of value than we export?\n \n \n \nEmpire building is not a pre requsit, it is generally a sign of desperation. Military conquest is expensive as it is essentially added to overhead. If you are in a situation where you must use your military to build wealth you are in trouble.\n\n i agree\n just wondered because both the Roman and British examples you cited are by conquest/imperialism", 
   {}, 
   134945, 
   null, 
   1118333820.0
  ], 
  [
   135002, 
   null, 
   "daewoo", 
   "1. exchange when?\n \n 2. these are all convertable wealth. do they count?\n cash?\n gold reserve?\n credit?\n \n\n \n Cash is only a convertible good as long as it s desired byt he rest of the world. If your currency looses desirablilty, its value drops, as has happened to the US in recent years. Whether or not your cash counts depends largely on its value on the international market.\n \n Gold is certianly counted\n \n Credit is not convertible, nor is it wealth. Credit is a means of borrowing wealth from others. when you consider the coast of servicing debt, credit that you actually use is negative wealth, unless you use the money you borrow to sucessfully make more than the debt service costs.\n \n \n3. thus for a nation to be wealthy, we must accumulate more convertable goods of value than we export?\n\n \n \n In order for a nation to become weathy and stay weathy, they must generate more wealth than they import, not export. Exports are traded for other convertible goods (usually currency). Exports add to a nations wealth.", 
   {}, 
   134997, 
   null, 
   1118334360.0
  ], 
  [
   135009, 
   null, 
   "fracas", 
   "In order for a nation to become weathy and stay weathy, they must generate more wealth than they import, not export. Exports are traded for other convertible goods (usually currency). Exports add to a nations wealth.\n\n \n a wealthy nation generates manufactured goods of value, they should keep more of these goods than they export, and they should export more than they import?", 
   {}, 
   135002, 
   null, 
   1118335080.0
  ], 
  [
   135016, 
   null, 
   "daewoo", 
   "a wealthy nation generates manufactured goods of value, they should keep more of these goods than they export, and they should export more than they import?\n\n \n From a practical standpooint it does not matter whether they export them or not. If you export, you end up wtih additional cash. If you keep them, you end up with lots of stuff. If you are keeping them just to keep them, it is better to export and exchange them for cash since the items will decrease in value over time. This also helps bring more cash into the country (cash is the ultimate convertible commodity)\n \n They should CERTIANLY export more than they import. If they do not, they will eventually run out of money and their economy will wither and die.", 
   {}, 
   135009, 
   null, 
   1118336040.0
  ], 
  [
   135037, 
   null, 
   "georged", 
   "is building an empire and exploiting the conquered requisit to being a \"wealthy nation\"?\n\n \n Yes. Military force is the primary historical method, then came exploration leading to colonization, WW1&2 and, with world-wide economical transportation, trade is currently the big club with (excluding the US) greatly reduced military costs. He who has the gold rules has never changed. Now, thanks to technology, payment balance is the gauge.", 
   {}, 
   134900, 
   null, 
   1118338440.0
  ], 
  [
   135106, 
   null, 
   "fracas", 
   "so tell me why it should be predicated on material goods of value rather than values in themselves, whether the values are materiel or service.\n sure having something physical is nice but it can be depreciate. part of the cost of any item is not just parts and production but also perceived worth, some of which is predicated on how long it will hold work\n and cash can also be devalued\n but service once rendered is done, its value transfered in total.\n \n cost of manufacturing = startup machinery + parts + labor. and parts and labors must be renewed with each production. the profit (cash) is only a small portion of the sale. and it isn't the manufacturer that keeps the product, thus holds little residual mamterial goods of value other than the machinery,\n whereas cost of service, especially service = startup training + parts + labor. however, training is a smaller cost, as well as parts. the profit margin is higher, i.e. more cash earned.\n since cash is more reliable and more convertable than actual material goods of value, it would be preferable to hoard cash than goods.", 
   {}, 
   135037, 
   null, 
   1118345160.0
  ], 
  [
   135130, 
   null, 
   "georged", 
   "so tell me why it should be predicated on material goods of value rather than values in themselves, whether the values are materiel or service.\n sure having something physical is nice but it can be depreciate. part of the cost of any item is not just parts and production but also perceived worth, some of which is predicated on how long it will hold work\n and cash can also be devalued\n but service once rendered is done, its value transfered in total.\n \n cost of manufacturing = startup machinery + parts + labor. and parts and labors must be renewed with each production. the profit (cash) is only a small portion of the sale. and it isn't the manufacturer that keeps the product, thus holds little residual mamterial goods of value other than the machinery,\n whereas cost of service, especially service = startup training + parts + labor. however, training is a smaller cost, as well as parts. the profit margin is higher, i.e. more cash earned.\n since cash is more reliable and more convertable than actual material goods of value, it would be preferable to hoard cash than goods.\n\n \n Which one will accomplish generating the most profit from demand, whether constructed or natural resource based and accumulated asset value, will be chosen by capital suppliers. Somewhere in the overall demand of all products, service or goods, there must an adequate amount of product, be them goods or services, to accomplish export ability to expand the originating nation's wealth or growth will expand internal money supplies, essentially devaluing it. \n \n From a business viewpoint, a services entity accumulates almost no hard equity, limiting its market value to a multiple of cash flow, usually 1-2 times annual cash flow and whatever goodwill (future potential) the market will bear. A manufacturing business or financial entity accumulates tangible assets, cash flow and goodwill values, the goodwill generally supported by harder market share than service entities. No brainer for most long-term investors. \n \n It's very difficult to secure capital for a pure services business, one reason entrepreneurs start them with little capital, and equally difficult to sell them as originating management is generally their primary key to success.", 
   {}, 
   135106, 
   null, 
   1118347680.0
  ], 
  [
   135191, 
   null, 
   "daewoo", 
   "so tell me why it should be predicated on material goods of value rather than values in themselves, whether the values are materiel or service.\n sure having something physical is nice but it can be depreciate. part of the cost of any item is not just parts and production but also perceived worth, some of which is predicated on how long it will hold work\n and cash can also be devalued\n but service once rendered is done, its value transfered in total.\n\n \n If you can get away with a fully service based economy, that is, where you export services on a level that surpass your imports of material goods in dollar value, it is a reasonable plan. Unfortunatly nobody has ever managed to pull it off, and the Us attempt has already failed miserably. You cannot create value with services. They are essentially 100% labor costs with 0 generation of tangible value.\n \n \ncost of manufacturing = startup machinery + parts + labor. and parts and labors must be renewed with each production. the profit (cash) is only a small portion of the sale. and it isn't the manufacturer that keeps the product, thus holds little residual mamterial goods of value other than the machinery,\n whereas cost of service, especially service = startup training + parts + labor. however, training is a smaller cost, as well as parts. the profit margin is higher, i.e. more cash earned.\n since cash is more reliable and more convertable than actual material goods of value, it would be preferable to hoard cash than goods.\n\n \n BUT, in a manufacturing enterprise you build equity in the form of machinery, inventory, etc.... This is why it is so much simpler to get a manufacturing (or even retail) operation started than a large service based operation. Investors are not real hot to sink money into a service based compnay with no equity, thus no possibility of any kind fo return should the enterprise fail.\n \n From a purely academic standpoint, it does nto matter in any event, since there is essentially no hope of any current nation, including the US, sustaining itself through service exports. It is already a failed model.", 
   {}, 
   135106, 
   null, 
   1118355360.0
  ], 
  [
   135245, 
   null, 
   "fracas", 
   "no one is talking about a 100% service economy.\n \n lets look at it this way.\n if 2% of the economy is agricultural and this is enough to feed us plus some others, this is good enough\n if 18% of the economy is manufacturing and this provide us with sufficient material goods plus some to export, this too is good enough\n and if the remainder of the economy is service base, fine.\n since the whole pie is getting bigger, this too is good.\n (remember that the manufacturing growth is outpacing or at least matching the growth of the pie as a whole)\n \n equity in materials is transient, more so than it used to be.\n case example. our power grid system is outdated, and our phone line primarily wired. many nations currently being modernized are skipping techonological material generation, going from no electricity to modern grids, or a few phone lines to cellular network.\n the biggest problem about a material based economy is how rapidly these goods are devalued immediately after sales.\n xcept for houses. which brings us back to the thread topic. the housing bubble is largely irrelevant. firstly because the money is being spent either on rent or on the mortgage. secondly because the bubble is only in a few regions. thirdly because there will only be so much land as the population will continue to grow and this is the ultimate material wealth of value as well.\n \n btw, equity is no longer predicated solely on goods. equiity is being given to persons and ideas as well. the economy is evolving and transforming. cannot mourn for the past that has left, otherwise you will be like GM trying to make drastic changes hoping it is not too little too late.", 
   {}, 
   135191, 
   null, 
   1118359920.0
  ], 
  [
   135260, 
   null, 
   "georged", 
   "no one is talking about a 100% service economy.\n \n lets look at it this way.\n if 2% of the economy is agricultural and this is enough to feed us plus some others, this is good enough\n if 18% of the economy is manufacturing and this provide us with sufficient material goods plus some to export, this too is good enough\n and if the remainder of the economy is service base, fine.\n since the whole pie is getting bigger, this too is good.\n (remember that the manufacturing growth is outpacing or at least matching the growth of the pie as a whole)\n \n\n \n We no longer feed ourselves. Beginning in 2005, the US is a net food importer with the percentage of imports/exports forecast to increase. Why? Just like consumer goods, we can import for less money than growing it here. \n \n 18% of the economy as industrial won't do it. Even those figures are skewed as we now book assembly of foreign made components as manufacturing, which is an import. Look at trade numbers, we're currently running at a $600-billion deficit. Why? Same reason, less expensive to buy it than make it here. 30% is about minimum for industrial content of true GDP. Industrial production growth percentage matching GDP growth percentage is not a gain.\n \n We're back to the same problem, no matter how large the base becomes, enough of it has to be positive trade to inject new wealth into our system for real growth. Our general standard of living has to drop soon enough to meet our competition's rise in costs before we run out of capital, or in our case, credit. We're a debtor nation digging ourselves in deeper. Until that standard of living does drop, from integration with lower labor cost in S. America or a severe economic recession, the problem remains.\n \n Before you mention isolation, remember we're also a net importer of most natural resources. We'd have to trade for those and that's not possible with our cost of produced goods.", 
   {}, 
   135245, 
   null, 
   1118362800.0
  ], 
  [
   135288, 
   null, 
   "fracas", 
   "we import food not because we can't feed ourselves, but because we want to. now i can get durians, start fruits, mangos, tamarimds and all sort of foreign foods in regular supermarkets, not specialty stores. do we need these varieties? no.\n \n we import manufactured goods not because we need to, but because we want to. why BMW and Toyotas instead of Fords and Chrysler? because we can have both.\n \n ultimately who do you want to have wealthy, whether you define it in terms of material goods or living easy with services, the consumers or captains of industries? can you have a wealthy nation when the average citizen is not wealthy?\n i actually think we are too wealthy in both regards. we have shifted from survival to security, and beyond from needs to want to what the hell why not. none of these items carry any real intrinsic value.\n \n the housing bubble is inconsequential ... better that than a tech-bubble, or a manufacturing bubble (like the rust belt) because none of thoses things are essential wealth. because when Google or GM goes bankrupt i have nothing. even if my houses are worth 10% i am still ahead because rent has 0%value. \n \n when your economy relies on manufacturing, you are losing resources (energy as well as natural/raw resources), providing value to non-national (if you sell just within your own country, the net is zero, so you have to export to gain), and ultimately, its value is in the service the manufactured goods can provide.\n true economic wealth is predicated on human resources, from simple labor (i cut your lawn this week, i can do it a gain next, and again next, no waste, no devaluation), professional labor (i set your bone, make you well, save your life), or generate an idea to make a patent (and realp the benefits of both fee and improved value)\n \n \n not saying our economy is peachy because it could be better. we should save more (not in cash but in things of real value, like land), invest more (not in infrastructures or manufacturing capacity but education), and be more efficient in our wealth (meaning more emphasis on value and less waste and harm in their acquisition)\n but i am not worry about either the housing bubble or our lost of manufacturing prowess because we are innovating and generating value, bypassing the carriers of those values for the values themselves.", 
   {}, 
   135260, 
   null, 
   1118365560.0
  ], 
  [
   135296, 
   null, 
   "georged", 
   "\n not saying our economy is peachy because it could be better. we should save more (not in cash but in things of real value, like land), invest more (not in infrastructures or manufacturing capacity but education), and be more efficient in our wealth (meaning more emphasis on value and less waste and harm in their acquisition)\n but i am not worry about either the housing bubble or our lost of manufacturing prowess because we are innovating and generating value, bypassing the carriers of those values for the values themselves.\n\n \n That's a political statement. If you want to change the world, that's a very noble gesture, and I'll watch that progression while managing my investments based on real time numbers and forecasting. \n \n One purpose of contributing to forums is calculating general public reaction to events and conditions. They (forums) respond a lot faster with base opinions than do generally old news polls or public announcements.", 
   {}, 
   135288, 
   null, 
   1118366820.0
  ], 
  [
   135304, 
   null, 
   "daewoo", 
   "we import food not because we can't feed ourselves, but because we want to. now i can get durians, start fruits, mangos, tamarimds and all sort of foreign foods in regular supermarkets, not specialty stores. do we need these varieties? no.\n\n \n Specialty food imports are less than 4% of total food imports int he US. We import food becuase we need to. We produce plenty of bulk grain, but at the end ofthe day that is nto nearly enough to feed a population of 300 million. the simple fact of the matter is that other nations produce food cheaper than we do, and as long as that is the case, we will continue to import food.\n \n \nwe import manufactured goods not because we need to, but because we want to. why BMW and Toyotas instead of Fords and Chrysler? because we can have both.\n\n \n We do not even make tool steel in the US anymore. Tool steel is the cornerstone of industry. We do not make bolts (mass produced) in the Us anymore. Good luck running an industry without tool steel and bolts. Some of the manufactured goods we import are done as choice...becuase American consumers want the best value for their dollar and frankly they are not going to get it form a US company. The majority of manufactured good we import, we do so because they are no longer produced in the united states anymore because US companies were uncompetitive.\n \n \nthe housing bubble is inconsequential ... better that than a tech-bubble, or a manufacturing bubble (like the rust belt) because none of thoses things are essential wealth. because when Google or GM goes bankrupt i have nothing. even if my houses are worth 10% i am still ahead because rent has 0%value. \n \n \n Inconsequntial? 3 trillion in equity value gone overnight and you say it is inconsequential? If the housing bubble bursts, and you are upside down in your house, you would have been ahead to be rentign because you are stuck with an unsalable resource that you owe excessive money on. If you are paying into a house that you find yourself upside down in, your payments are equal to less than zero because you have assumed debt service on the loan.\n \n \nwhen your economy relies on manufacturing, you are losing resources (energy as well as natural/raw resources), providing value to non-national (if you sell just within your own country, the net is zero, so you have to export to gain), and ultimately, its value is in the service the manufactured goods can provide.\n\n \n Yes\n \n \ntrue economic wealth is predicated on human resources, from simple labor (i cut your lawn this week, i can do it a gain next, and again next, no waste, no devaluation), professional labor (i set your bone, make you well, save your life), or generate an idea to make a patent (and realp the benefits of both fee and improved value)\n\n \n From an economic standpoint, if you pay a guy $10 per week to mow your lawn, it does not matter whether he mosws your lawn or not, as long as you continue to give him the $10 per week. All service based economies are like this. If no transfer of tangible goods takes place, no value is created, there is no economic gain or loss. We could shut down all service based businesses tomorrow, and as long as we keep shifting the money around that is being shifted now, in similar sums, it would be an economically neutral act. Generation of a patent is only a valuable act to the economy as a whole if you can export the idea and sell it abroad, or the product that applies the patenet is exported.\n \n \n \nnot saying our economy is peachy because it could be better. we should save more (not in cash but in things of real value, like land), invest more (not in infrastructures or manufacturing capacity but education), and be more efficient in our wealth (meaning more emphasis on value and less waste and harm in their acquisition)\n but i am not worry about either the housing bubble or our lost of manufacturing prowess because we are innovating and generating value, bypassing the carriers of those values for the values themselves.\n \n\n \n No offense intended, but that is one of the most rediculous statements I have heard all week. That puts you right on par with MM as far as economic prowess. In your model, we simply pull value out fo the sky without production of any tangible value. As a nation, how exactly do you propose that we save more in things with real value (what a joke) like land? We ahve a finite amount, and frankly the value of land is entirely dependant on uncontrolled factors. There were several folks around here who were quite welathy going into teh 80's, when land was $1000 an acre. People had tens of millions tied up in land....a \"safe\" investment. 2 years later when the ag market crashed and that same land was selling for $80 per acre, and those millionairs now had millions in debt with no tangible value to back it up. They discovered quickly that land is only a good investment if you can be sure that its value will either increase or hold parity, and that there is no way to be sure of that because the value of land is predicated by the health of the economy as a whole. \n \n We are not innovating and creating tangible value. We are atempting to keep an economy on its last leg going through the use of massive internal transactions. that is not innovative at all. The romans did it as their economy started to crash, as did the british, and the southern states with slavery. This is nothing new or innovative. I could give you dozens, if not hundreds of examples through history.\n \n You want to see what happens to regions that do survive the transition from a manufacturing economy to a service economy? Imagine the ME with no oil. At one time the ME was the manufacturing powerhouse fo the world. Trade caravans left the ME and went far into europe. Once they lost their ability as far as manufacturing, essentially falling behind europe (and for the same reasons the US is now falling behind china), they kept their economy going for a long itme based on internal transaction and living on acquired wealth.", 
   {}, 
   135288, 
   null, 
   1118368200.0
  ], 
  [
   135306, 
   null, 
   "daewoo", 
   "That's a political statement. If you want to change the world, that's a very noble gesture, and I'll watch that progression while managing my investments based on real time numbers and forecasting. \n \n One purpose of contributing to forums is calculating general public reaction to events and conditions. They (forums) respond a lot faster with base opinions than do generally old news polls or public announcements.\n\n \n Hehe. Me too. Log on every day thinking \"is the american public still stupid\", and I get my answer. If we ever see an influx of Americans here that know as much about economics as Lord Temmerlin or Gamehuis, I will know I have some positions I need to liquidate. Luckily most of them seem to be more like Missouri mule and Fracas.", 
   {}, 
   135296, 
   null, 
   1118368560.0
  ], 
  [
   135314, 
   null, 
   "lord tammerlain", 
   "\n \n the housing bubble is inconsequential ... better that than a tech-bubble, or a manufacturing bubble (like the rust belt) because none of thoses things are essential wealth. because when Google or GM goes bankrupt i have nothing. even if my houses are worth 10% i am still ahead because rent has 0%value. \n \n \n\n \n \n A housing bubble is not inconsequential, nor is it better or worse then tech bubble or manufacturing bubble. The extent and how far the crash is what makes it better or worse.\n \n Japan during the 80's built up a huge ( massive ) property bubble. People were buying land, bidding up the value to astronomical levels, accomodated by borrowing from the banks. Everything was fine as long as the property values kept increasing. I do believe at one time it was theorised that the Imperial palace ( or gardens ) overall maybee a hundred acres or less ( going on memory) was worth more then the entire state of florida at the time.\n \n Then as we all know the Japanese property bubble burst, causing many people to become quite broke. The Japanese banks have been left with billions and billions of non performing loans, that they have spent the last decade getting rid of. This is the major reason that Japan's economic growth has been relatively poor for the last 10 years.\n \n The land is still their, the building that were built still exist, they just cant be exchanged for the same amount of money as before.", 
   {}, 
   135288, 
   null, 
   1118370840.0
  ], 
  [
   135325, 
   null, 
   "fracas", 
   "it fascinate me how some see only trees and not forests.\n \n 1. Georged. have no idea what you are trying to say. i am not making a political statement. and i am not even trying to change the world. it is you and Daewoo who is trying to do so, trying to reverse the course of event. i am fine with the course we are on. btw, my investment portfolio averages 15% growth a year. not great, but not bad. see #11 as well Georged.\n \n \n @daewoo\n 2. food production. we certainly can produce enough food to feed ourselves. the fact that we import specialty food, rice, or what ever else is because we want to, not because we need to. see also number 3\n \n 3. same with basic tools or whatever else. we specialize in certain things because we are better at those things, because those things carry a higher profit margin, and in return we let others do the basics. in order to export to other markets we have to open ours. there's not much we need from abroad manufactured so it just make sense for us to import things we cannot match in efficiency, such as cheaper tools because of cheaper labor.\n \n 4. unsalable resources? why would you want to sell your house and rent instead? and if the mortgage payment is more than rent, you still own the land. realestate will always have value, and it is always better to own than not to own. why is that so hard to grasp?\n \n 5. there's where you are wrong about service. you pay service because you need it and cannot do it yourself, which in a sense make it invaluable to you. and you also pay for service because it is cheaper to pay another to do a task you can do, but don't want to so you can do something else more profitable. time is money, which is value. whereas a manufactured product can have x value with person A in time T0 verses value y with person B at time T1, and either x and or y can have a value of zero, whereas your time will never be value zero.\n \n 6. land holds value not in reference to the money paid for it, but that it always have residual value greater than zero. but practically land holds value not in reference to the money paid for it but when referrence to the money that would have gone for rent. now if you are an individual renting, you are clearly better off buying. when you are an individual investing in realestate for profit, then this carries no greater intrinsic risk than investing in the stock market. when you invest for profit you got to expect losses, whether it be land bubble bust of tech bubble bust. cost of doing business. billions and billions lost with either. we go on because the economy ultimately cater to the individual consumer and not the captains of industries. let the captains eat cake. and you know what else, a realestate bubble burst is an opportunity to acquire wealth, but a industry bust is only an opportunity to lose more wealth.\n \n 7. value out of the sky? you mean emphasizing value of people and the product of people? LOL. age of materialism in deed. without people there is nothing. without people there would be no goods and no values, thus no people. this has sustained economies from time zero. agriculture was of value because people, and people are the engines of agrarian economies. same with industries. i consider myself a capitalist but not foolish enough to disvalue labor because labor is both value of production and value of consumption.\n \n 8. don't know what century you have been living in but you have missed the last one in which we advanced technologically through innovation of ideas, efficiency, as well as products. \n \n 9. the ME has never been a manufacturing economy. trade does not generate manufactured goods. the ME were middlemen for goods coming to and from china/india. and they lost out to the europeans who had better, and bigger ships, and the ships were better because of innovation and design, not the material or the physical structures of the manufactured ships. and now the ME is still not a manufacturing because they do not process the oil they sell. and they are slowly but surely depleting their limited natural resources. their economies are even more fragile than ours because everything of real value they sell away in exchange for things of variable values like cash and material goods. and you know what, even they know this, that is why they continue to trade with infidels like the west, even the fundamentalists in iran want to, even al qaeda will.\n \n 10. china, LOL. China has a huge capacity to be an economic giant but it is not currently anywhere near that of the US. China's economy was on par with that of California. currently how is china economically competitive? because it export more manufactured goods than it imports? look again at the real bottom line, china's main export is labor, and main value economically resides with its consumer potential. china is still playing catch up to acquire the material goods you give so much value to by using its human value as equity. but without innovation they will not be real competitors. who we need to worry about is india because it has similar human value equity, a more free society and economy, and actual innovation technologically. china LOL.\n \n LT, see #4 and #6\n \n 11. gaging forum reaction to calculate anything is pathetic. it is an unrepresentative population and fraught with projection error, bias artifacts, and selective sampling. this is absolutely the most stupid comment ever uttered to place value on forums discussion. but i should have expected it from Daewoo and Georged, who likes to hear themselves babble and act like somebody.\n so stunningly stupid that i will have to quote it for prosperity, and posteriorly.\n \nOne purpose of contributing to forums is calculating general public reaction to events and conditions. They (forums) respond a lot faster with base opinions than do generally old news polls or public announcements.\n\n Hehe. Me too. Log on every day thinking \"is the american public still stupid\", and I get my answer. If we ever see an influx of Americans here that know as much about economics as Lord Temmerlin or Gamehuis, I will know I have some positions I need to liquidate. Luckily most of them seem to be more like Missouri mule and Fracas.\n\n true ignorance is when you don't know how ignorant you are.\n keep it up boys cause your prancings makes me smile.\n examples boys, examples. better than i can ever fabricate.\n \n \n btw, its also usually obvious the first to insult the other is the one losing the argument.", 
   {}, 
   135314, 
   null, 
   1118373900.0
  ], 
  [
   135331, 
   null, 
   "daewoo", 
   "Then as we all know the Japanese property bubble burst, causing many people to become quite broke. The Japanese banks have been left with billions and billions of non performing loans, that they have spent the last decade getting rid of. This is the major reason that Japan's economic growth has been relatively poor for the last 10 years.\n\n \n To put this in context......Real estate prices last year in tokyo (residential) increased by .9%. This would be nothign to write home about except that it si the first time in 17 years that real estate values have increased in ANY part of Japan.\n \n \n Additionally, in Japan, the bursting of their real estate bubble infected their entire financial system. It spread like a cancer that deflated their stock market (remember the good old days....the Nikkei at 40,000??). We already have a wild equity bubble in the US (stock market). You have to wonder if the result of a burst of our real estate bubble will be similar.\n \n The other thing to watch out for would be vast overcorrection int he market. Fro a period, the japanese were looking at a 94% decline in real estate values. That was an overcorrection. The bursting of the real estate bubble and the damage it caused in their stock market as people rushed to pull investments in order to cover their real estate exposure fed off of each other. How many americans have 94% equity in their home? How about 80%? Because that is likely what will be needed in order to survive the next round here in the US. \n \n Look at the estimates earlier in the thread regarding percentage of GDP effected by such an event. I think that the estimate by George.....17% IIRC is probably best case scenario. I would imagine 25-30% decline when considering construction flow thorugh and supply lines as well. If you consider additional costs likely to be associated (though not directly) such as the massive hit that equity markets are likely to take as people rush to remove investments there in order to keep their home, the picture gets even bleaker. \n \n \n \nA housing bubble is not inconsequential, nor is it better or worse then tech bubble or manufacturing bubble. The extent and how far the crash is what makes it better or worse.\n\n \n I would disagree with this. I think that by its very nature a real estate bubble is destined to be worse than a tech bubble. First, we know that historically real estate bubbles tend to grow more spectacularly than regular equity market bubbles. Second, American investors invest in cash, they do not buy their houses in cash. An equity bubble will certainly strip their cash, but unless they are either stupid enough or unlucky enough to have some (frankly) dumb positions open at the wrong time, they are just loosing cash. A housing bubble hits them at home and leaves them holding a $100,000 property with a $500,000 mortgage, including debt service on that mortgage.", 
   {}, 
   135314, 
   null, 
   1118374440.0
  ], 
  [
   135340, 
   null, 
   "fracas", 
   "its also amusing the watch the wagons circling and the milling around with each others with congratulatory commiseration.\n \n i love this forum!\n more and more!\n :)", 
   {}, 
   135331, 
   null, 
   1118375400.0
  ], 
  [
   135344, 
   null, 
   "daewoo", 
   "its also amusing the watch the wagons circling and the milling around with each others with congratulatory commiseration.\n \n i love this forum!\n more and more!\n :)\n\n \n No wagons circiling. Your argument is just so ludicrous, and there is so much evidence to the contrary, that the pages fill up quickly.", 
   {}, 
   135340, 
   null, 
   1118375760.0
  ], 
  [
   135360, 
   null, 
   "lord tammerlain", 
   "fracas, \n \n have you considered what the property ( real estate ) bubble in Japan has done to the Japanese economy? For many Japanese who bought real estate at the top of the bubble for homes or whatever reason would have been far better off if they rented at that time, saved their money and bought when the bubble burst. Instead they lost alot of wealth, if not going bankrupt because they bought a house instead of renting.\n \n When that loss is multiplied across a nation the effects in Japan at least are obvious. A property bubble causes economic hardship, people will go bankrupt, banks will have non performing loans and some financial institutions can go bankrupt.\n \n \n Overall you have to realize that value is relative and is determined by what people are willing/ ( and over a long time frame ) able to pay for it. A house that was worth a million dollars, ten years ago is now in a crime ridden neighborhood and is worth $600 000 today, not a good investment.\n \n A Beanie babie that you bought at $2 dollars and sold for $200, a very good investment, especially for a product with little real value ( as seen by the eventual collapse of the Beanie babie craze. )", 
   {}, 
   135002, 
   null, 
   1118377680.0
  ], 
  [
   135427, 
   null, 
   "fracas", 
   "LT\n \n you are comparing realestate investment against an abstract investment. this is not the case. reaslestate/housing investment are made by:\n 1. home buyers to live in. their reference is rent, which they have to pay anyway. as long as this is the case they may not make money but they certainly won't be losing everything. perhaps you should calculate how much money you spent in rent over a lifetime.\n 2. amateur investors. they buy a house, +/- update, live in it a few years, then sell. if they were smart they would do this by an interest only financial package, and when compared to rent, they still come out alright with a bubble burst.\n 3. professional investors: tend not to buy houses. they develope. still less risky than stocks.\n 4. people don't go bankrupt because of a housing bubble burst. they go bankrupt when they lose their jobs. and housing bubbles tend to follow an economic down turn, not cause one. people lose jobs, can't afford to pay the mortgage, or try to sell their house in a flooded market, which causes a devaluation, i.e. bubble burst\n realestate bubble is a whole different animal than an industrial or manufacturing bubble\n \n btw, i read this a little while ago and thought it funny\n \nIf you had purchased $1000.00 of Nortel stock one year ago, it would now be worth $49.00.\n \n With Enron, you would have $16.50 left of the original $1,000.00.\n \n With WorldCom, you would have less than $5.00 left.\n \n But, if you had purchased $1,000.00 worth of Beer one year ago, drank all the beer, then turned in the cans for the aluminum recycling price, you would have $214.00.\n \n Based on the above, current investment advice is to drink heavily and recycle.\n \n It's called the 401-Keg Plan! :)\n", 
   {}, 
   135360, 
   null, 
   1118411820.0
  ], 
  [
   135500, 
   null, 
   "lord tammerlain", 
   "LT\n \n you are comparing realestate investment against an abstract investment. this is not the case. reaslestate/housing investment are made by:\n 1. home buyers to live in. their reference is rent, which they have to pay anyway. as long as this is the case they may not make money but they certainly won't be losing everything. perhaps you should calculate how much money you spent in rent over a lifetime.\n 2. amateur investors. they buy a house, +/- update, live in it a few years, then sell. if they were smart they would do this by an interest only financial package, and when compared to rent, they still come out alright with a bubble burst.\n 3. professional investors: tend not to buy houses. they develope. still less risky than stocks.\n 4. people don't go bankrupt because of a housing bubble burst. they go bankrupt when they lose their jobs. and housing bubbles tend to follow an economic down turn, not cause one. people lose jobs, can't afford to pay the mortgage, or try to sell their house in a flooded market, which causes a devaluation, i.e. bubble burst\n realestate bubble is a whole different animal than an industrial or manufacturing bubble\n \n btw, i read this a little while ago and thought it funny\n\n \n A house is also a home, but it is an investment at the same time. The intangibles of home ownership are not reflected in general economic stats\n \n I buy a house at the top of a housing boom to live in. The bubble burst's and I am required to transfer to another part of the country. I bought my house at $200 000, with $20 000 down. Now that I have to sell it is worth $150 000, and I have only $170 000 in equity. Opps big financial loss and I have to come up with $20 000 to give to the bank.\n \n Now lets look at the high number of interest only mortgages that are being taken, overall in the US about 30% ( a recent post here has the specifics). These people are at huge risk during a housing bubble, they have zero equity in their home and with a large part of the people taking interest only mortgages are doing so because they can not afford a traditional mortgage. When the bubble bursts, these people are going to be upside down on their homes, owing far more to the bank then the house is worth.", 
   {}, 
   135427, 
   null, 
   1118426580.0
  ], 
  [
   135519, 
   null, 
   "Missouri Mule", 
   "For what it is worth, I think housing prices in California are absurd. That's one of the many reasons I wouldn't think of living there. The 0% loans are not in theory a bad thing if they are used properly but they are quite dangerous if they are speculative and a person can't stand the financial shock.", 
   {}, 
   135500, 
   null, 
   1118427660.0
  ], 
  [
   135523, 
   null, 
   "fracas", 
   "A house is also a home, but it is an investment at the same time. The intangibles of home ownership are not reflected in general economic stats\n \n I buy a house at the top of a housing boom to live in. The bubble burst's and I am required to transfer to another part of the country. I bought my house at $200 000, with $20 000 down. Now that I have to sell it is worth $150 000, and I have only $170 000 in equity. Opps big financial loss and I have to come up with $20 000 to give to the bank.\n \n Now lets look at the high number of interest only mortgages that are being taken, overall in the US about 30% ( a recent post here has the specifics). These people are at huge risk during a housing bubble, they have zero equity in their home and with a large part of the people taking interest only mortgages are doing so because they can not afford a traditional mortgage. When the bubble bursts, these people are going to be upside down on their homes, owing far more to the bank then the house is worth.\n\n \n that is why i keep reminding you that the investment in a home is not disposable income that would have gone instead into precious metal or stock. it is money that would have been lost as rent. if they stop their mortage payment and walk away because their house is worth zero (never will happen) they are no worse than even compared to rent.\n and comparing money going into rent vs money going into a home ownership will reveal that a housing bubble burst for what it is.", 
   {}, 
   135500, 
   null, 
   1118427840.0
  ], 
  [
   135613, 
   null, 
   "lord tammerlain", 
   "Here is a simple and easy to understand article about the \"potential\" housing bubble and the options people have\n \n http://moneycentral.msn.com/content/P119380.asp\n \n \n\n \n 7 ways to beat a housing bubble\n \n \n snip\n \n But it's a lot easier to lock in a stock gain than a home's price appreciation. I've been getting e-mails from readers asking for ways to hold on to these gains if, as they fear, prices could be poised to fall.\n \n snip\n \n Or you might even decide you don't have to do anything at all. \"I agree that a bubble now exists, but all real estate has to do is flatten out for awhile and the bubble will go away,\" says Tom Kirk, president of CPA Wealth Management Services in Melbourne, Fla. \"It doesn't have to decrease 20%.\" \n \n Except in the most speculative markets -- and I'm addressing the concerns of homeowners here, not real-estate speculators -- significant declines in housing prices are both modest and rare.\n \n That said, a 50% or 100% jump in your home's value can induce anxiety. \n \n \n A homeowner's greatest financial risk is losing more than all of his equity. Let's say you put down $20,000 on a $200,000 house, or 10%, and prices decline to $170,000. If you have to sell, it will cost you $10,000 out of pocket, in addition to losing the down payment.  \n \n \"Instead of buying a hedge against falling home prices, we need to get back to the old-fashioned way of protecting ourselves from the possibility of falling prices -- build home equity,\" says Elaine Scoggins, a planner in Tampa, Fla.\n \n That means avoiding things like interest-only mortgages, which give you no equity. On your existing mortgage, round up your monthly mortgage payment -- write a check for $1,000 a month instead of $940, for instance -- to build equity faster.\n \n snip\n \n One sign of a property bubble is investors buying single-family homes as investments rather than to live in themselves. Such buyers are eager to lease the house back to its occupants because it eliminates the cost of finding tenants. \n \n \"This can be done in bubble areas while the bubble is on,\" notes Curt F. Fey, a financial advisor in Pittsford, N.Y. \"An increasing number of single-family homes are bought by other than residents. If you're right, you can buy your house back more cheaply after the bubble bursts. If you're wrong, at least you pocketed your earlier gains\n \n \n\n \n This next part for those in the highest areas affected by the bubble is especially important\n \n \nSell, rent, buy\n \"When clients ask us about the current real-estate bubble on Maui, I (suggest that they) sell their house, rent for a couple of years, and then buy another residence at a lower price\" after the bubble bursts, says E. Dennis DeStefano, a financial adviser on that Hawaiian island. \n \n If you can rent a home for less that it would cost to buy one that's similar, it's likely prices are too high and will retreat. If my wife weren't so attached to our family home here in northern New Jersey, that's exactly what I would do, because rentals in this area are cheaper than purchases.\n", 
   {}, 
   135523, 
   null, 
   1118436060.0
  ], 
  [
   135619, 
   null, 
   "fracas", 
   "key to weathering a housing bubble burst\n don't sell your house and live in it instead\n \n \n btw, interest only loans are designed for people not to own a house but to buy a house to resell as an investment. like all investment they can lose. why is that a problem?\n no risks no gains.", 
   {}, 
   135613, 
   null, 
   1118436480.0
  ], 
  [
   135627, 
   null, 
   "georged", 
   "key to weathering a housing bubble burst\n don't sell your house and live in it instead\n \n \n btw, interest only loans are designed for people not to own a house but to buy a house to resell as an investment. like all investment they can lose. why is that a problem?\n no risks no gains.\n\n \n The majority of people who are using interest only loans for buying homes are living in them because that's the only way they can lower the payment enough to meet qualification ratio requirements for the loan. Using the prior example, the risk of a market adjustment costing $10k out-of-pocket is especially real with new US bankruptcy legislation effective this summer; individuals will not be able to discharge debt, merely hold it at arms length until their financial situation improves to where they can satisfy the obligation. Or not. \n \n \n In any prudent investment your exposure should be limited to gain only, with capital protected. That's the reason the old saying of put money in equity markets only if you can afford to lose it has been around forever, to remind people a balanced portfolio is the key to financial success. Again referring to prior post, why would anyone buy a home on interest only when they could rent the same home for less money, avoid maintenance/tax and invest the difference?", 
   {}, 
   135619, 
   null, 
   1118438040.0
  ], 
  [
   135629, 
   null, 
   "fracas", 
   "if they are living in houses bought with interest only loan, it is essentially renting with option to realp profit on transfer of the \"lease\"\n \n in many if not most instances renting $ and mortgage $ is on par and frequently it is more expensive to rent. have not even configured the tax benefits vs the cost of upkeeps.\n \n naturally people invest for the gains, doesn't mean it cannot lose or should not be expected to lose", 
   {}, 
   135627, 
   null, 
   1118438280.0
  ], 
  [
   135638, 
   null, 
   "georged", 
   "if they are living in houses bought with interest only loan, it is essentially renting with option to realp profit on transfer of the \"lease\"\n \n in many if not most instances renting $ and mortgage $ is on par and frequently it is more expensive to rent. have not even configured the tax benefits vs the cost of upkeeps.\n \n naturally people invest for the gains, doesn't mean it cannot lose or should not be expected to lose\n\n \n I'm sure every person so financially stretched out that they have to use interest only loans to buy a house expects to make a financial killing. If they can make the graduated interest jumps, I wish them well. But no thanks. I'll let someone else shoulder those types of risks. If I'm speculating, I want it to be with my money that I can pull if the need arises to protect capital.", 
   {}, 
   135629, 
   null, 
   1118439000.0
  ], 
  [
   135639, 
   null, 
   "fracas", 
   "never said interest only loans were a good idea\n it has its place\n and it isn't all that popular for the very same reasons.", 
   {}, 
   135638, 
   null, 
   1118439300.0
  ], 
  [
   135641, 
   null, 
   "lord tammerlain", 
   "never said interest only loans were a good idea\n it has its place\n and it isn't all that popular for the very same reasons.\n\n \n \n http://4forums.com/political/showthread.php?t=5434\n \n They were not very popular before, they are now\n \n \nIn 2004, fully 50.4% of the mortgage loans issued for purchases of single-family homes in Georgia were to pay interest only. That made the Peach State No. 1 in the nation in its share of interest-only mortgages. But a whole bunch of other states were not far behind: California was second, at 47.1%, Colorado third, at 45.5%, Nevada fourth, at 44.7%, and the District of Columbia, fifth at 43.8%. \n \n\n \n When anything gets to those number it is very popular. 40+% of new mortgages in many states are zero interest, that is one reason why the housing bubble matters.", 
   {}, 
   135639, 
   null, 
   1118439720.0
  ], 
  [
   135650, 
   null, 
   "georged", 
   "http://4forums.com/political/showthread.php?t=5434\n \n They were not very popular before, they are now\n \n \n \n When anything gets to those number it is very popular. 40+% of new mortgages in many states are zero interest, that is one reason why the housing bubble matters.\n\n \n Under that frenzy of activity lies a defined weakness in the form of limited, no equity or negative equity which will be compounded as most loan originators are in it for only the origination points. The loans are then packaged and sold as securities. To quasi-government corporations such as Fanny Mae, recently shaken with still unresolved accounting scandals in the form of mis-stated earnings. Not a pretty picture.", 
   {}, 
   135641, 
   null, 
   1118440920.0
  ], 
  [
   135698, 
   null, 
   "fracas", 
   "LT\n \n thanks\n \n yup, those interest only loans are being misused\n \n never the less, what that really means is that a whole bunch of people are really renting instead of buying, though they do have one thing over a regular renter, potential for profit when their \"rental lease\" ends and they sell the house. thus while they certainly won't have equity and no profit when the bubble hits as they sell, they are really not worse off than renting from the get go.\n and again, the best way the weather a bubble burst even for interests only mortgagers is not to sell their house!", 
   {}, 
   135641, 
   null, 
   1118447280.0
  ], 
  [
   135719, 
   null, 
   "daewoo", 
   "LT\n \n thanks\n \n yup, those interest only loans are being misused\n \n never the less, what that really means is that a whole bunch of people are really renting instead of buying, though they do have one thing over a regular renter, potential for profit when their \"rental lease\" ends and they sell the house. thus while they certainly won't have equity and no profit when the bubble hits as they sell, they are really not worse off than renting from the get go.\n and again, the best way the weather a bubble burst even for interests only mortgagers is not to sell their house!\n\n \n If you eventually end up upside down in your house, you have just been renting anyway. the only part of the house that you won is the equity in it. the rest you are renting from the bank on a monthly basis.\n \n If the bubble bursts and you are holding properties, then youa re pretty much screwed if you do nto have enough equity to leave you positive equity following the correction. If not, any payments, plus cost of maintenance, that you have made are essentially without value. At that point, you have just been renting your house. \n \n If all you have is the house you live in, and you haev no equity in it, then youa re pretty much screwed a far as weathering a bubble bursting scenario. If you have investmtent properties, the smart thing to do would be to sell them before the bubble bursts.\n \n A good example i read the other day came from japan. If you owned a house in tokyo valued at $500,000 in 1990, you still most likely owe $500,000 today (because they boosted interest rates in order to compensate for additional risk on over financed loans). the house is now worth $100,000. So, you owe $500,000 on a $100,000 house, are almost certainly not gaining much if any equity, and the house is essentially undsaleable unless you can cough up $400,000 on demand.\n \n You would have been better off to be renting. \n \n You do not \"own\" you house unless you have equity in it. Equity goes away, so does ownership.", 
   {}, 
   135698, 
   null, 
   1118449920.0
  ], 
  [
   135728, 
   null, 
   "fracas", 
   "unless you have to pay money to have another person take your house away from you, you have at least broken even.\n \n \nA good example i read the other day came from japan. If you owned a house in tokyo valued at $500,000 in 1990, you still most likely owe $500,000 today (because they boosted interest rates in order to compensate for additional risk on over financed loans). the house is now worth $100,000. So, you owe $500,000 on a $100,000 house, are almost certainly not gaining much if any equity, and the house is essentially undsaleable unless you can cough up $400,000 on demand.\n\n \n lets take this example then.\n and start from the present with you owing 400,000 on a 100,000 house.\n 1. whatever you do don't sell and wait. see how much it will be worth when the housing market recovers. you need a place to live don't you?\n 2. still cheaper to keep the mortgage as rent in Tokyo is astronomical.\n \n the housing bubble burst only hurts when you are selling during the crisis.\n its temporal value maybe less than the debt you owe on it, but it has residual value that will likely appreciate once the crisis has ebbed.\n or if you are a speculator doing realestate trades ... which make you one of the big boys for which investment lost should be part of being in the business. even then, if you can as you have been, hold the property.\n same adage: sell high, hold low, buy low.", 
   {}, 
   135719, 
   null, 
   1118450820.0
  ], 
  [
   135741, 
   null, 
   "lord tammerlain", 
   ".\n \n the housing bubble burst only hurts when you are selling during the crisis.\n its temporal value maybe less than the debt you owe on it, but it has residual value that will likely appreciate once the crisis has ebbed.\n or if you are a speculator doing realestate trades ... which make you one of the big boys for which investment lost should be part of being in the business. even then, if you can as you have been, hold the property.\n same adage: sell high, hold low, buy low.\n\n \n Which is why how big, and how long the your house is upside down matters.\n \n If it take 10 years for the market value of your home for you to break even, you are stuck in the same house for ten years if you dont want to lose money. I know of at least two areas just in Canada that after a real estate crash, it took about ten years for the houses in those areas to reach the previous previous highs. Those crashes were very localized in Toronto and Vancouver, with far stricter lending requirements then are currently used. Ie no interest only loans. These interest only loans are fueling this bubble in the US, driving price far higher then they would otherwise. You can realistically expect that in the areas with a visiable bubble that housing prices will when the bubble burst will go down to what they were 3 years ago.", 
   {}, 
   135728, 
   null, 
   1118452260.0
  ], 
  [
   135745, 
   null, 
   "jskufan", 
   "I'm having trouble wrapping my mind around those attempting to \"minimize\" the effects of the bursting real estate bubble. Unlike the stock market correction, where investors lost \"committed\" but \"owned\" equity, devalued real estate for those with a mortgage means their loss will take years to repay from future earnings. Buying any investment at the high point in its value cycle and riding it down has the exact same effect on your net worth. Just like the stock market, the real estate market is full of overvalued investments.", 
   {}, 
   135728, 
   null, 
   1118452860.0
  ], 
  [
   135746, 
   null, 
   "daewoo", 
   "unless you have to pay money to have another person take your house away from you, you have at least broken even.\n\n \n which is EXACTLY the scnario that a large housing bubble creates. You owe $200,000 on a $100,000 house, and if you want to sell it, you have to pay the bank $100,000 out of your own pocket for the privelage. \n \n \nlets take this example then.\n and start from the present with you owing 400,000 on a 100,000 house.\n 1. whatever you do don't sell and wait. see how much it will be worth when the housing market recovers. you need a place to live don't you?\n 2. still cheaper to keep the mortgage as rent in Tokyo is astronomical.\n\n \n Better idea would be to sell the house now, rent for a year, then buy the same house for $100,000. that way you do not end up in the hole $300,000\n \n Rent is tokyo on a $100,000 house is MUCH cheapert than morgage payments on a $500,000 note on that same $100,000 house.\n \n \nthe housing bubble burst only hurts when you are selling during the crisis.\n its temporal value maybe less than the debt you owe on it, but it has residual value that will likely appreciate once the crisis has ebbed.\n\n \n Yes, eventually it might regain value. In the mean time you are paying debt service on an overfinanced home. A bubble as large as we are talking now is not somethign we have experince with in the US. The only real model we can go by is the japanese one. i posted (I think on this thread) that tokyo residentail real estate went up .9% last year, the first gain in 17 years. If that is going to be par for the course, you would be MUCH better off to abandon the loan, go through forclosure/bankrupcy, and then work at rebuilding your credit over the next 6 or 8 years. Assumign the tokyo residential market is indicitive, you would be paying debt service on that $400,000 note for over 100 years before your property valuation caught up to the loan. Good luck on that one.\n \n \nor if you are a speculator doing realestate trades ... which make you one of the big boys for which investment lost should be part of being in the business. even then, if you can as you have been, hold the property.\n\n \n I am unaware of anyt \"big boy\" real estate specualtors who are not liquidating. Even trump is moving residential properties and has scrapped devlopment on 2 projects that were planned for 2006 and 2007. \n \n We are either at the top, or near the top of the bubble. To buckle down with your properties and try to ride out a 3 trillion dollar bubble is simply beyond the realm of logic. You cannot weather a bubble like that with investment properties, to try is idiocy at its finest. 3 trillion is over 10% of the total real estate value of the US. Coinsidering economic losses that will go with it (thsi is a place where \"multiplier effect\" certainly applies, and works both ways), you are looking at an overall decline in GDP from 18-40%. Even using the falsely pumped GDP numbers we have been seeing (gdp driven by government spending), that put us in the red 14-37% JUST with the bursting of the bubble. What do you think that will do to consumer confidence? Keep in mind that real estae values are predicated mostly by consumer confidence. \n \n To put this in perspective, the Great Depression was brought about by an 18.3% drop in GDP over a 13 month period. The 18% number (which corresponds to the 14% number) assumes that the only industry to suffer is the home loan industry. It asusmes that construction is unaffected, retail sales remain constant, etc....", 
   {}, 
   135728, 
   null, 
   1118452920.0
  ], 
  [
   135762, 
   null, 
   "fracas", 
   "LT\n \n 1. most mortgages are from 15-30 years. 10 years? bah. and if you need to move, you still would have broken even when compared to renting. the real difference is that in 10 years enron stock is still worthless, your house won't be.\n \n \n jskufan\n \n 2. net worth even with the same hard assets vary with time. same with realestate.\n \n \n daewoo\n \n 3. you are assuming that rent fluctuate with market price. this is not the case and the fluctuation is substantially less variable. if you sell for a lost you owe the difference between original loan - equity - sale cost. does not make sense to sell and lose 100k only to buy it back. hold on to it at weather the crisis.\n \n 4. have to factor in the differential between an overpriced mortage vs rent.\n \n 5. the assumption you are making is that you cannot weather out the crisis because of its size. firstly the bubble pertains to overvaluation correction, not an absolute value crash. secondly unlike the stock market crash people do not rush to sell their house for fear or devaluation, they are living in the damn thing afterall.\n \n 6. sure, a bubble burst could have wider economic impact, but that all depends on how deep (devaluation) how wide (geographically) and how long.\n \n\"Although we certainly cannot rule out home price declines, especially in some local markets, these declines, were they to occur, likely would not have substantial macroeconomic implications,\" he said.\n\n how deep will depend partly on supply and demand:\n \nAs an industry, housing actually hasn't really grown in the past 50 years. In the 1950s and 1960s the industry did about 2 million new housing units a year, in the 1970s it was 1.8 million, a bit less in the 1980s and 1990s. Now it's back around 1.8 million annually again so far this decade.\n Despite the fact that the U.S. population has grown by 40 million families since the 1970s, we're still producing about the same number of homes.\n But that's not the whole story. Of the roughly 1.8 million homes the industry now produces a year -- about 300,000 to 400,000 are second homes, which is much more than in the 1970s.\n So as a country we produce significantly less primary homes even though we've had all this population growth, mostly as a result of regulation. So there's a supply and demand imbalance.\nlink \n how wide seems limited to certain markets. lets look at one hot market in southern cal\n \nMURRIETA ---- A \"bubble\" has indeed formed in the Southwest Riverside County housing market, a regional economist said Wednesday, but he added that it's unlikely to burst for several reasons ---- chiefly strong job growth in the inland region, coupled with a supply and demand imbalance.\n \n \"Is there a bubble? Definitely. Is it about to burst? No,\" said Inland Empire economist John Husing during a speech about the local housing market before a group of real estate professionals.\n \n In real-estate terms, a bubble is the point where home prices have climbed to levels that are no longer sustainable and suggests the housing market is likely to crash. The most recent housing bubble burst in the early 1990s, as scores of speculators snapped up homes in anticipation of large financial gains, only to have the bottom fall out of the market.\n \n The main difference this time around, Husing said, is that employment growth is on the rise and the Southland isn't facing a major reduction in jobs, such as the more than 500,000 jobs that were lost a decade ago when the region's defense industry suffered major cutbacks.\n\n link \n once again supply and demand\n and employment certain will contribute to the \"how long\"\n what about Florida?\n \nWhile many real estate investors continue to bet on the success of South Florida's condominium boom, McCabe is putting together groups of investors ready to buy the minute the bubbly winds shift, and he says he already has dozens of investors on board and about $10 million in capital.\n \n McCabe's plan is to buy out the speculators who, when the condo market turns, likely won't have the cash to hold on to their properties and will be looking for a back door out.\n\n link \n and finally consider this as well\n \n\"There has been much discussion recently about a housing bubble, but the truth is that home price appreciation has slowed considerably in the past three months. The time to talk about a bubble was last December,\" says Carl Steidtmann, chief economist of Deloitte Research and author of the monthly index.\n \n \"Consumer spending growth in the summer months will be largely dependent on the direction of home prices and job growth,\" continued Steidtmann. \"As job growth continues to accelerate, we should see a corresponding pickup in real wage growth.\"\n\n link \n \n thus i conclude that the bubble if/when it burst will not be catatrophic, especially for the average home owner, and probably as well for the mid investors.\n \n btw, all these links are on the first page of googling \"housing bubble\"\n \n \n the sky is not falling\n we are not doomed.", 
   {
    "unicode_changes_made": true
   }, 
   135746, 
   null, 
   1118456640.0
  ], 
  [
   135767, 
   null, 
   "jskufan", 
   "\n \n jskufan\n \n 2. net worth even with the same hard assets vary with time. same with realestate.\n \n \n \n\n \n I agree, my point was simply that when most people lost money in the equity markets, they lost money they owned. It was bad enough watching stock prices drop, but the loss was over when the bell rang. Loosing money on a heavilly leveraged property would be the equivalent of watching the price of stocks fall that you hadn't payed for yet. That scenario is worse because it effects future income as well. In addition, for most (a lot of) Americans, their home is the single largest investment in their portfolio. Finally, as others have pointed out, the rippling effects of such a correction will undoubtedly impact other aspects of the market and economy making it even harder for the \"average\" homeowner to deal with the losses and repay the debt.", 
   {}, 
   135762, 
   null, 
   1118457780.0
  ], 
  [
   135768, 
   null, 
   "georged", 
   "I agree, my point was simply that when most people lost money in the equity markets, they lost money they owned. It was bad enough watching stock prices drop, but the loss was over when the bell rang. Loosing money on a heavilly leveraged property would be the equivalent of watching the price of stocks fall that you hadn't payed for yet. That scenario is worse because it effects future income as well. In addition, for most (a lot of) Americans, their home is the single largest investment in their portfolio. Finally, as others have pointed out, the rippling effects of such a correction will undoubtedly impact other aspects of the market and economy making it even harder for the \"average\" homeowner to deal with the losses and repay the debt.\n\n \n Back to job loss impact in an internal transaction driven economy. That'll provide an adjustment to the general standard of living.", 
   {}, 
   135767, 
   null, 
   1118458320.0
  ], 
  [
   135770, 
   null, 
   "lord tammerlain", 
   "Here is a link that provides a detailed list of stats for the US housing market.\n \n http://www.forbes.com/strategies/2005/03/02/cx_da_0302topnews.html\n \n \nFirst, a new study by the National Association of Realtors shows that 23% of all homes purchased in 2004 were for investment, while another 13% were vacation homes. \n \n \n snip\n \n The study, based on 2003 census data, says there are 43.8 million second homes in the U.S. While 6.6 million of these are vacation homes, far more, 37.2 million, are investment units. This compares with 72.1 million owner-occupied homes. About a quarter of last year's home sales were for investment homes, NAR says. \n \n \n snip\n \n If rents can't sustain a mortgage, there is no point in owning an investment property, except for the hope that home prices will inevitably rise, as they have been. \n \n \n snip\n 2001, the median price of an investment home has risen 25.4%, from $118,000 to $146,900(In most markets, the average price is much higher than the median.) But if prices start to fall or if mortgage rates start to rise, there could be a rush to sell and a crash. \n \n Otherwise, some investment buyers could find themselves unable to get renters at all, as rental vacancy rates are near historic highs. With many buyers putting down almost no cash, they could simply let their bank foreclose and walk away. \n \n \n", 
   {}, 
   135768, 
   null, 
   1118458860.0
  ], 
  [
   135802, 
   null, 
   "daewoo", 
   "\n 3. you are assuming that rent fluctuate with market price. this is not the case and the fluctuation is substantially less variable. if you sell for a lost you owe the difference between original loan - equity - sale cost. does not make sense to sell and lose 100k only to buy it back. hold on to it at weather the crisis.\n\n \n Rent not only generally fluctuates with market price, it is also largely controlled by demand. people who purchase properties for rental ugenerally use their payment as basis for setting their monthly rental charge. There is some difference lately, since demand for rentals is realtively low, and people see the property itself as a money tree. \n \n \n4. have to factor in the differential between an overpriced mortage vs rent.\n\n \n Which is likely to be substantial. \n \n \n5. the assumption you are making is that you cannot weather out the crisis because of its size. firstly the bubble pertains to overvaluation correction, not an absolute value crash. secondly unlike the stock market crash people do not rush to sell their house for fear or devaluation, they are living in the damn thing afterall.\n\n \n This is true. Instead that find that they cannot afford to make the payments on them and they end up being foreclosed on. Even minor market correctiosn have, in the past, led to double or even triple forclosure rates. Additionally, many, many people have bought second properties as investments or vacation homes. These folks will almost certainly rush to sell as the market falls.\n \n \n6. sure, a bubble burst could have wider economic impact, but that all depends on how deep (devaluation) how wide (geographically) and how long.\n\n \n \n \nthe sky is not falling\n we are not doomed.\n\n \n Of couse we are not doomed. Some of us are going to make a buttload of money. You are just not one of them. Run the numbers yourself, do not rely on talking heads to do your thinking for you. \n \n If greenspan was not worried about a major correction he would not be so concerned abotu interest only loans. Even carrying an interest only loan, your average american can handle a 10% downward change in the housing market. \n \n People were making the same arguments abotu the .com bubble that you are making here RE: the likelyhood of a real estate bubble bursting and probable effects. even as the whole house of cards came crashing down, there were talkign heads out there saying \"nothign to worry about...it is all good.\n \n When it was all said and done, I laughed at them, just as I will be laughing at folks like you at the end of this. Politicians lie. Talking heads lie. The numbers never, ever lie. Money has no friends, no loyalty, and no party.", 
   {}, 
   135762, 
   null, 
   1118470260.0
  ], 
  [
   135866, 
   null, 
   "fracas", 
   "1. rent does fluctuate i'd already stated that. but it does not do so to the same range as realestate prices in a market crash/downturn. rent fluctuates more with employment and other economic factors.\n 2. rent has been same or more than mortgages. perhaps it has been a while since you actually rented.\n 3. there is a huge difference between the tech bust and a realestate bubble correction. stock crashes can leave you with nothing; bubble correction still leave you with a house. of all the values/wealth you spoke of, stock has the least inherent value as its worth is totally market subjected, varrying between zero and hundreds of dollars for a stock. this is not the case with realestate.", 
   {}, 
   135802, 
   null, 
   1118496000.0
  ], 
  [
   135890, 
   null, 
   "georged", 
   "2. rent has been same or more than mortgages. perhaps it has been a while since you actually rented.\n \n\n \n Perhaps in some places where the real estate market hasn't experienced upward revaluation. If values have increased due to buyer demand from low interest rates or desirability of location for whatever reason, rental rates invariably fall below a point where there's no cash flow return on investment or negative return on investment. Former rental houses with rents appropriate for 4-5 years ago appreciated to a point where only a fool would hold them for rental purposes. We now have a circumstance where people are buying residences as rentals with break-even or negative cash flow hoping to sell them for a capital gain that will show a positive margin after retiring the mortgage, negative cash flow, depreciation recapture and taxes/maintenance.\n \n That's because a rental market can only absorb rent levels compatible with prevailing work force income levels. And worker income certainly hasn't kept pace with residential appreciation. Over the past three years I've watched new housing prices escalate to a point where people buying homes for appreciation speculation are all negative cash flow rentals. Why? Because demand for buildable land has driven those prices up and building materials, for a variety of reasons, have increased in cost to where even the basic entry level home is now out of reach for renters at the bottom of the food chain. Result? A surplus of negative cash flow rentals continuing to depress rental rates. \n \n Buy low, sell high is still the basic rule of thumb for any investment. If our economy does stumble, for any reason, negative cash flow rental houses held for speculation will be in the first group of dominoes to fall. And rents will drop accordingly because a lot of people with money who prefer rentals as long-term investments have gotten liquid waiting for that event.", 
   {}, 
   135866, 
   null, 
   1118505060.0
  ], 
  [
   135897, 
   null, 
   "georged", 
   "\n People were making the same arguments abotu the .com bubble that you are making here RE: the likelyhood of a real estate bubble bursting and probable effects. even as the whole house of cards came crashing down, there were talkign heads out there saying \"nothign to worry about...it is all good.\n \n\n \n They were still attempting to call it a 'normal market adjustment' even after their 401k program values had vaporized. \n \n Every investment has a market to book value ratio. When I look at what goes into a $300,000 basic shack, all I see is about $200,000 of buyer demand, fluff, driven by low interest loans facilitating home ownership and negative cash flow investments for people making the monthly nut by the skin of their teeth and credit cards. Maybe someone can tell me that won't eventually create serious problems, but I suggest they take a look at our ever cyclical real estate markets and economy.", 
   {}, 
   135802, 
   null, 
   1118506020.0
  ], 
  [
   135907, 
   null, 
   "daewoo", 
   "3. there is a huge difference between the tech bust and a realestate bubble correction. stock crashes can leave you with nothing; bubble correction still leave you with a house. of all the values/wealth you spoke of, stock has the least inherent value as its worth is totally market subjected, varrying between zero and hundreds of dollars for a stock. this is not the case with realestate.\n\n \n The biggest difference between a stock bubble and a real estate bubble is that in the former, people only loose money that have. In the latter, they loose money that they don't have.", 
   {}, 
   135866, 
   null, 
   1118507220.0
  ], 
  [
   135911, 
   null, 
   "georged", 
   "The biggest difference between a stock bubble and a real estate bubble is that in the former, people only loose money that have. In the latter, they loose money that they don't have.\n\n \n And still have payments to make on air. The stock market crash of 1929 was \n driven by people who couldn't meet margin calls, since rectified by legislation. What's the difference in buying equity stock at market value on 100% margin or financing an investment house on 100% of market value with an adjustable loan?", 
   {}, 
   135907, 
   null, 
   1118507820.0
  ], 
  [
   135928, 
   null, 
   "fracas", 
   "The biggest difference between a stock bubble and a real estate bubble is that in the former, people only loose money that have. In the latter, they loose money that they don't have.\n\n actually no\n money lost in stock is unlikely to be recuperated by doing nothing\n whereas a house will holds residual value.\n \n georged, think about it as renting with option to own.", 
   {}, 
   135907, 
   null, 
   1118511360.0
  ], 
  [
   135936, 
   null, 
   "daewoo", 
   "actually no\n money lost in stock is unlikely to be recuperated by doing nothing\n whereas a house will holds residual value.\n \n georged, think about it as renting with option to own.\n\n \n A stock loss is just as likely to be recouperated by doing nothing as a real estate loss. If a stock goes through the floor, that company is nto out of business, their stock is just down. Assuming they are a good company (good companies grow), their stockl will likely eventually regain that lost value. \n \n \n fracas, think of it as buying for twice real value.", 
   {}, 
   135928, 
   null, 
   1118512500.0
  ], 
  [
   135939, 
   null, 
   "georged", 
   "\n \n georged, think about it as renting with option to own.\n\n \n Sound idea as long as payment remains comparable to pure rental rates, holds market value and continues to appreciate. Timing, in and out, being the key. \n \n Timing is everything. With the two-year capital gain free ride of $500k for a couple in a primary residence, there's no easier way to make a decent chunk of money. Current high values make taking profits on a primary home difficult\n due to the fact that relocation presents that same inflated market. Getting off at the right time, before the inevitable adjustment, will allow you to retain your gain and buy into the adjusted market. Or take it, buy property and build a new one. You'll make at least 40% on appreciation the moment a certificate of occupancy is issued, in any market.", 
   {}, 
   135928, 
   null, 
   1118512920.0
  ], 
  [
   135942, 
   null, 
   "lord tammerlain", 
   "Perhaps in some places where the real estate market hasn't experienced upward revaluation. If values have increased due to buyer demand from low interest rates or desirability of location for whatever reason, rental rates invariably fall below a point where there's no cash flow return on investment or negative return on investment. Former rental houses with rents appropriate for 4-5 years ago appreciated to a point where only a fool would hold them for rental purposes. We now have a circumstance where people are buying residences as rentals with break-even or negative cash flow hoping to sell them for a capital gain that will show a positive margin after retiring the mortgage, negative cash flow, depreciation recapture and taxes/maintenance.\n \n That's because a rental market can only absorb rent levels compatible with prevailing work force income levels. And worker income certainly hasn't kept pace with residential appreciation. Over the past three years I've watched new housing prices escalate to a point where people buying homes for appreciation speculation are all negative cash flow rentals. Why? Because demand for buildable land has driven those prices up and building materials, for a variety of reasons, have increased in cost to where even the basic entry level home is now out of reach for renters at the bottom of the food chain. Result? A surplus of negative cash flow rentals continuing to depress rental rates. \n \n Buy low, sell high is still the basic rule of thumb for any investment. If our economy does stumble, for any reason, negative cash flow rental houses held for speculation will be in the first group of dominoes to fall. And rents will drop accordingly because a lot of people with money who prefer rentals as long-term investments have gotten liquid waiting for that event.\n\n \n \n That is the Calgary market, last year I was looking at getting another rental property, and was checking the rental rates at the lower end of the market, and they were far to low to cover mortgage and general maintanence cost.\n \n Quite a few places are first month free rent and are offering sweet deals to renters just to have some cash flow", 
   {}, 
   135890, 
   null, 
   1118513520.0
  ], 
  [
   135986, 
   null, 
   "fracas", 
   "not twice value once you subtract rent\n \n and buy low sell high is true for most things\n not sure what 401k has to do with anything\n \n LT, check rental rates of place comparable to what you would want to buy. checking the low end of the market hardly seem objective for comparison now does it?", 
   {}, 
   135942, 
   null, 
   1118518440.0
  ], 
  [
   135991, 
   null, 
   "georged", 
   "\n not sure what 401k has to do with anything\n \n\n \n I was referring to when equity markets tanked from the dot.com scenario; talking heads and many others were in denial even after their retirement programs had lost a majority of market value, including original investments. \n \n We'll hear the same things when RE adjusts, the difference being mortgages won't vanish like equity and will be almost impossible to discharge under new BK legislation lobbied in by the financial services industry. They'll carry it on their books as a non-performing asset, auction off the asset and carry the balance in a collection sub as a note receivable. Then, with current technology, the sub can easily hound the debtor until they pay or death when the note can be collected from any estate assets.", 
   {}, 
   135986, 
   null, 
   1118521680.0
  ], 
  [
   141185, 
   null, 
   "lord tammerlain", 
   "http://www.economist.com/finance/displayStory.cfm?story_id=4079027\n \n Here is a well writen piece on the housing bubble, that exists quite a few countries worldwide.\n \n \nAnother mantra of housing bulls in America is that national average house prices have never fallen for a full year since modern statistics began. Yet outside America, many countries have at some time experienced a drop in average house prices, such as Britain and Sweden in the early 1990s and Japan over the past decade. So why should America be immune? Alan Greenspan, chairman of America's Federal Reserve, accepts that there are some local bubbles, but dismisses the idea of a national housing bubble that could harm the whole economy if it bursts. America has in the past seen sharp regional price declines, for example in Boston, Manhattan and San Francisco in the early 1990s. This time, with prices looking overvalued in more states than ever in the past, average American prices may well fall for the first time since the Great Depression.\n \n snip\n \n Another worrying lesson from abroad for America is that even a mere levelling-off of house prices can trigger a sharp slowdown in consumer spending. Take the Netherlands. In the late 1990s, the booming Dutch economy was heralded as a model of success. At the time, both house prices and household credit were rising at double-digit rates. The rate of Dutch house-price inflation then slowed from 20% in 2000 to nearly zero by 2003. This appeared to be the perfect soft landing: prices did not drop. Yet consumer spending declined in 2003, pushing the economy into recession, from which it has still not recovered. When house prices had been rising, borrowing against capital gains on homes to finance other spending had surged. Although house prices did not fall, this housing-equity withdrawal plunged after 2001, removing a powerful stimulus to spending.\n \n Housing-equity withdrawal has also fallen sharply over the past year in Britain and Australia, denting household spending. In Australia, the 12-month rate of growth in retail sales has slowed from 8% to only 1.8% over the past year; GDP growth has halved to 1.9%. In Britain, too, a cooling of the housing market has been accompanied by an abrupt slowdown in consumer spending. If, as seems likely, home prices continue to fall in both countries, spending will be further squeezed\n", 
   {}, 
   135991, 
   null, 
   1119742380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  US interest rates and the housing bubble", 
  "url": "http://www.4forums.com/political/policy-ideas/5571-us-interest-rates-housing-bubble.html", 
  "breadcrumbs": [
   "Policy Ideas"
  ], 
  "id_number": 5571, 
  "discussion_files": [
   [
    "6434.html", 
    "http://www.4forums.com/political/policy-ideas/5571-us-interest-rates-housing-bubble-print.html"
   ], 
   [
    "6435.html", 
    "http://www.4forums.com/political/policy-ideas/5571-us-interest-rates-housing-bubble-8-print.html"
   ], 
   [
    "6436.html", 
    "http://www.4forums.com/political/policy-ideas/5571-us-interest-rates-housing-bubble-6-print.html"
   ], 
   [
    "6437.html", 
    "http://www.4forums.com/political/policy-ideas/5571-us-interest-rates-housing-bubble-4-print.html"
   ], 
   [
    "6438.html", 
    "http://www.4forums.com/political/policy-ideas/5571-us-interest-rates-housing-bubble-5-print.html"
   ], 
   [
    "6439.html", 
    "http://www.4forums.com/political/policy-ideas/5571-us-interest-rates-housing-bubble-7-print.html"
   ], 
   [
    "6440.html", 
    "http://www.4forums.com/political/policy-ideas/5571-us-interest-rates-housing-bubble-3-print.html"
   ], 
   [
    "6441.html", 
    "http://www.4forums.com/political/policy-ideas/5571-us-interest-rates-housing-bubble-2-print.html"
   ]
  ], 
  "identifier": 5571
 }
]