[
 [
  [
   60, 
   null, 
   "admin", 
   "What did the Founding Fathers intend with the Second Amendment? \n \n http://www.youdebate.com/DEBATES/SECONDAMENDMENT.HTM", 
   {
    "post_info": {
     "post_title": "Second Amendment"
    }
   }, 
   null, 
   null, 
   1043625840.0
  ], 
  [
   1223, 
   null, 
   "Patriot", 
   "America is blessed to have a Constitution, which is the acknowledged and universally affirmed supreme law of the land. There is no human law that is higher than the Constitution in the United States of America. The Framers intended for the Constitution to be a list of enumerated powers, a grant of authority from the people of the United States to the newly formed Federal Government. The \"Federalists\" where those who supported a stronger national government. To educate the public as to what their position was, as well as to defend it from the assaults made upon it by the likes of Patrick Henry and Thomas Jefferson, these men wrote what has since become known as the \"Federalist Papers.\" In these papers, James Madison, Alexander Hamilton, and others again and again assured the public and the detractors of the proposed Federal government that the powers granted to the Federal Government were \"enumerated.\" That means that the Constitution is a list of what the government can do. If it isn't in the Constitution, it cannot be done. That is illegal. The Federalists didn't think we needed a Bill of Rights... they thought it was self evident that since it was a list of enumerated powers, no rights of the people could be infringed! Fortunately, wiser heads prevailed, and everyone agreed that they would ratify the new Constitution, provided that a Bill of Rights was immediately written and passed. The Founders wanted to specially mention and protect certain rights. 2nd on this list of special rights was the right to keep and bear arms. The text of the 2nd Amendment is as follows: \n \n \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\"\n \n Before going further, I'd like to spend some time defining the terms we find in the 2nd Amendment. \n We'll start with the word \"militia.\" What is the militia? The U.S.C. (Title 1, Subtitle A, Part 1, Chapter 13, Section 311) defines the militia as, \"all able-bodied males at least 17 years of age and, except as provided in section 313 of title 32, under 45 years of age who are, or who have made a declaration of intention to become, citizens of the United States and of female citizens of the United States who are members of the National Guard.\" (Section 313 of title 32, raises the maximum age for entrance into the National Guard for former military personnel.) Webster's 1828 Dictionary defines the word \"militia\" like this: \n \"The body of soldiers in a state enrolled for discipline, but not engaged in actual service except in emergencies; as distinguished from regular troops, whose sole occupation is war or military service. The militia of a country are the able bodied men organized into companies, regiments and brigades, with officers of all grades, and required by law to attend military exercises on certain days only, but at other times left to pursue their usual occupations.\"\n \n So now we know that the word \"militia\" was intended by the Founders to refer to the body of citizens eligible for military duty. Notice how in § 311 the National Guard is distinguished from the militia. \n The next item to define is the term, \"well-regulated.\" Webster's 1828 Dictionary's definition of the word, regulated: \n \"Adjusted by rule, method, or forms; put in good order; subjected to rules or restrictions.\"\n Another definition, this time from the Oxford English Dictionary (2nd Edition, 1989):\n 1) To control or direct by a rule, principle, method, etc. \n 2) To adjust to some standard or requirement as for amount, degree, etc. \n 3) To adjust so as to ensure accuracy of operation. \n 4) To put in good order.\n The correct definition we are looking for here is \"to put in good order,\" according to Alexander Hamilton, in the Federalist Papers #29. \n Next word we will deal with is the word \"people.\" There has been some twisting of that word by certain parties, and so it will be good to see how the Founders defined it. Some gun control advocates try to say that the word \"people\" here refers to a collective body of people, (a state) meaning there is no personal right to keep and bear arms. How could this be? Does the 4th Amendment refer to a \"collective\" right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures? That is obviously nonsense. Why would the Founders use the word \"people\" if they meant the states? Surely they were capable of expressing exactly what they meant. If they had meant there was only a collective right, and not an individual right, they would have said it. \n Now we will deal with the next phrase, \"keep and bear.\" This is pretty self-explanatory. \"Keep\" means that the people have a right to own arms, and \"bear\" means they have the right to use them. \n Last but not least, we'll discuss what the word \"arms\" means. This is very important, for even if we correctly interpret the rest of the amendment, we still have the chance to go wrong here. The relevant definition in Webster's 1828 is as follows: \n \n \"Weapons of offense, or armor for defense and protection of the body.\"\n In his paper, \"The Right to Keep and Bear... What?\" Alo Konsen speculates that the word \"arms\" means more than just what has traditionally been considered small-arms (rifles, shotguns, and handguns). Mr. Konsen speculates that the word \"arms\" encompasses nearly the whole of the modern military arsenal. (See Mr. Konsen's paper, http://www.cga94.com/contributors/stuff/arms/iii.htm to see his explaination.) For the purpose of this paper, I will content myself with the definition that the word \"arms\" means weapons that can be borne by infantry, especially firearms. \n \n I believe the primary goal of the 2nd Amendment was to show a preference the Founders had to a militia over a large standing army. For instance, in the Federalist Papers, Alexander Hamilton said, \n \n \"[I]f circumstances should at any time oblige the government to form an army of any magnitude, that army can never be formidable to the liberties of the people while there is a large body of citizens, little if at all inferior to them in discipline and the use of arms, who stand ready to defend their rights and those of their fellow citizens.\" (Federalist #29) \n \n Noah Webster also weighed in on the subject: \n \n \"Before a standing army can rule, the people must be disarmed; as they are in almost every kingdom in Europe. The supreme power in America cannot enforce unjust laws by the sword; because the whole body of the people are armed, and constitute a force superior to any band of regular troops that can be, on any pretence, raised in the United States. A military force, at the command of Congress, can execute no laws, but such as the people perceive to be just and constitutional; for they will possess the power.\"\n \n Notice I said that the preservation of a militia was the 2nd's PRIMARY goal. It's secondary goal is to protect individual weapon ownership. If you had suggested to the Founders that the 2nd Amendment didn't protect an individual right to keep and bear arms, you would have had quite a debate on your hands. Here is what some of the Founders said concerning firearms: \n \n \"No free man shall ever be debarred the use of arms.\" -- Proposed Virginia Constitution, 1776 Thomas Jefferson \n \n \"When the resolution of enslaving America was formed in Great Britain, the British Parliament was advised by an artful man, who was governor of Pennsylvania, to disarm the people; that it was the best and most effectual way to enslave them; but that they should not do it openly, but weaken them, and let them sink gradually.\". . . I ask, who are the militia? They consist now of the whole people, except a few public officers.\" -- Virginia's U.S. Constitution ratification convention, 1788 George Mason, of Virginia \n \n \"The said Constitution [shall] be never construed to authorize Congress to infringe the just liberty of the press, or the rights of conscience; or to prevent the people of the United States, who are peaceable citizens, from keeping their own arms.\" -- Samuel Adams of Massachusetts, Massachusetts' U.S. Constitution ratification convention, 1788 \n \n \"The Constitution preserves the advantage of being armed which Americans possess over the people of almost every other nation. . . (where) the governments are afraid to trust the people with arms.\" -- James Madison of Virginia, The Federalist, No.46 \n \n \"[A]rms discourage and keep the invader and plunderer in awe, and preserve order in the world as well as property. . . Horrid mischief would ensue were the law-abiding deprived of the use of them.\" -- Thomas Paine of Pennsylvania, Thoughts On Defensive War, 1775\n \n Can anyone suggest that they didn't intend an individual right to keep and bear arms? That of course would be absurd. The Supreme Court has repeatedly refused to hear 2nd Amendment cases since 1939, so our hands are tied for now. \n In closing, I will say that America has fallen far to give up so essential a right so easily.", 
   {
    "unicode_changes_made": true
   }, 
   60, 
   null, 
   1044590580.0
  ], 
  [
   1677, 
   null, 
   "Patriot", 
   "hey, it's really great that all you guys agree with me. :D", 
   {}, 
   60, 
   null, 
   1044934440.0
  ], 
  [
   1729, 
   null, 
   "Patriot", 
   "Not that there's much room for disagreement.", 
   {}, 
   60, 
   null, 
   1044992040.0
  ], 
  [
   1731, 
   null, 
   "thistownwilleat", 
   "\"In his paper, \"The Right to Keep and Bear... What?\" Alo Konsen speculates that the word \"arms\" means more than just what has traditionally been considered small-arms (rifles, shotguns, and handguns). Mr. Konsen speculates that the word \"arms\" encompasses nearly the whole of the modern military arsenal. (See Mr. Konsen's paper, http://www.cga94.com/contributors/stuff/arms/iii.htm to see his explaination.) \"\n \n --So...then the laws that say that I can't own a tank are unconstitutional?", 
   {
    "unicode_changes_made": true
   }, 
   60, 
   null, 
   1044995400.0
  ], 
  [
   1734, 
   null, 
   "Patriot", 
   "What laws? as far as i know you are allowed to do so. W/o the ordinance though. \n \n I'm familiar w/ Mr. Konsen's paper, but I shy away from so broad a definition. I think defining \"arms\" as weapons that may be carried by a man a good, and true definition.", 
   {}, 
   60, 
   null, 
   1044999540.0
  ], 
  [
   1741, 
   null, 
   "thistownwilleat", 
   "I can't name them, but even as little as I know of the politics concerning guns, I'm fairly sure that there is a law against owning a tank, or an F-16, or a flamethrower.", 
   {}, 
   60, 
   null, 
   1045000800.0
  ], 
  [
   1742, 
   null, 
   "Patriot", 
   "Actually, it'll interest you to know that flamethrowers are perfectly legal. \n \n There aren't laws against owning de-milled F-16s or tanks. Of course, you have to come up with the cash.", 
   {}, 
   60, 
   null, 
   1045002000.0
  ], 
  [
   1744, 
   null, 
   "Tim", 
   "James Madison's first draft of the second amendment was:\n \n \"The right of the people to keep and bear arms shall not be infringed; a well armed and well regulated militia being the best security of a free country: but no person religiously scrupulous of bearing arms shall be compelled to render military service in person.\"\n \n From this passage it appears that the phrase \"to bear arms\" refers to military service.", 
   {}, 
   60, 
   null, 
   1045002720.0
  ], 
  [
   1747, 
   null, 
   "Patriot", 
   "right to military service?! who else would have the right to serve in the military if it wasn't the people of the nation? I think that that's obvious. The 2nd means something more.", 
   {}, 
   60, 
   null, 
   1045003920.0
  ], 
  [
   2506, 
   null, 
   "JFriday", 
   "The same people mentioned in the first ammendment are also mentioned in the second. If Madison meant Soldiers in the Militia by the word \"people\" then infact the 1st ammendment only refers to the militia as well. There were proposals that would have worded it stating that the officers of the militia would keep the weapons in their homes only but instead he threw that out and chose the word \"people\" as in you and me. A little over 97% of court cases agree that the 2nd Ammendment applies to the individual.", 
   {
    "post_info": {
     "post_title": "The &quot;people&quot;"
    }
   }, 
   60, 
   null, 
   1045601520.0
  ], 
  [
   2532, 
   null, 
   "Tim", 
   "\"A little over 97% of court cases agree that the 2nd Ammendment applies to the individual.\"\n \n The original question was what did the Founding Fathers intend.\n Since you bring that up, the only case that I know of in which a court has ruled that the second amendment is an individual right is US vs Emerson. On the other hand, I know of more than thirty cases in which the courts have supported the militia interpretation of the second amendment.", 
   {}, 
   60, 
   null, 
   1045618440.0
  ], 
  [
   2538, 
   null, 
   "kelvin90701", 
   "Originally posted by thistownwilleat \n  Mr. Konsen speculates that the word \"arms\" encompasses nearly the whole of the modern military arsenal. (See Mr. Konsen's paper, http://www.cga94.com/contributors/stuff/arms/iii.htm to see his explaination.) \"\n \n --So...then the laws that say that I can't own a tank are unconstitutional? \n \n \n It is not speculation. When the 2nd Amendment was written, modern military weapons were flint lock rifles. The whole purpose of the 2nd Amendment was so common people could fight off a state armed with modern military weapons.\n \n Today the weapons have changed, but the need or the intent has not.\n \n The 2nd Amendment does not mean we fight a tyrannical government with flint lock rifles.", 
   {
    "unicode_changes_made": true
   }, 
   60, 
   null, 
   1045624500.0
  ], 
  [
   2539, 
   null, 
   "kelvin90701", 
   "Laws restricting ownership of any weapon is unconstitional. It is how you use weapons that should be restricted. If you are using weapons that don't endanger anyone, then what is the beef? If you use a tank or a flamethrower to rob a bank, then that should be illegal. Wait it already is.", 
   {}, 
   60, 
   null, 
   1045624920.0
  ], 
  [
   2542, 
   null, 
   "Tim", 
   "\"Laws restricting ownership of any weapon is unconstitional.\"\n Are you saying that private citizens should be able to own nuclear and biological weapons according to the second amendment?", 
   {}, 
   60, 
   null, 
   1045625700.0
  ], 
  [
   2543, 
   null, 
   "JFriday", 
   "The DA here in Shreveport has now decided to implement the NRA's \"project exile\". This will start in May I will fill you in once it gets running. Project Exile basically states that if you are caught selling drugs and you have a gun the DA will ask for the maximum sentence on both cases (it is culmative i.e. selling drugs 5 years with a gun attach an aditional ten at the bear minimum for a total of 15 years and that is federal time you will serve 85% of your sentence before you are eligiable for parole). So basically commiting a crime and possesing a gun really hurts(i.e. robbing a bank 10 years, robbing a bank with a gun additional 10 years)\n I will keep a look out for stats concerning this.", 
   {
    "post_info": {
     "post_title": "Some very good news well for me"
    }
   }, 
   60, 
   null, 
   1045625880.0
  ], 
  [
   2545, 
   null, 
   "kelvin90701", 
   "Yes. If a person can manage and store WMD with what is considered safe. If I can do the job as good or even better than the state. If I can meet all of their requirements that the government sets for itself, then I sould be allowed to own WMDs.", 
   {}, 
   60, 
   null, 
   1045626180.0
  ], 
  [
   2967, 
   null, 
   "voiceofreason", 
   "You're nuts, Kelvin. Only the rich would be able to afford military weapons. The rich would have dominion over the poor.", 
   {}, 
   60, 
   null, 
   1046028720.0
  ], 
  [
   3085, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n You're nuts, Kelvin. Only the rich would be able to afford military weapons. The rich would have dominion over the poor. \n \n \n Huh? Please expound how the Gates, the Gettys, the Kennedys, the Hiltons, the Rockafellers dominate the poor with guns. The rich can afford and can legally own them right now. Are they enslaving the poor right now at the end of a gun barrel?\n \n Please explain that if a common man can store, use, and own modern military weapons as safe or even safer that the state; that he/she should not be allowed to own military weapons.", 
   {}, 
   60, 
   null, 
   1046069220.0
  ], 
  [
   3238, 
   null, 
   "voiceofreason", 
   "Huh? Please expound how the Gates, the Gettys, the Kennedys, the Hiltons, the Rockafellers dominate the poor with guns. The rich can afford and can legally own them right now. Are they enslaving the poor right now at the end of a gun barrel?\n \n You were talking about WMDs (weapons of mass destruction), not guns. Don't go back and change your story. \n \n A person with an average income can afford to purchase guns, but not WMDs. Only the rich would be able to do that. The second amendment does not allow private citizens to own WMDs. Tell me one court case that interprets the second amendment that way.", 
   {}, 
   60, 
   null, 
   1046210160.0
  ], 
  [
   3260, 
   null, 
   "kelvin90701", 
   "I stand corrected on the WMD/military weapons arguement, sorry for the digression trying muddle the subject and change it.", 
   {}, 
   60, 
   null, 
   1046226180.0
  ], 
  [
   3261, 
   null, 
   "kelvin90701", 
   "Ok the WMD of argument is moot. There is not going to by any vendor. Even the gazallionaires like Bill Gates won't get them.\n \n But my arguement on weapons ownership for common men still stands.\n \n If a common man can use, own, and store modern military weapons as safe or even safer than the state, by what logic do you argue that only the state should have them?", 
   {}, 
   60, 
   null, 
   1046226540.0
  ], 
  [
   4575, 
   null, 
   "AKonsen", 
   "My research pretty clearly indicates what the Founders and their informed contemporaries understood \"arms\" to mean in their day: that the Second Amendment guarantees an individual's right to keep and bear any and all weapons, no matter how destructive. Yes, it's an unsettling thought. But a proper textualist reading of the 2nd Amendment leads fairly obviously to that conclusion.\n \n Granted, I think the potential results are way too dangerous to leave things as they are. That's why my paper suggests a 28th Amendment limiting individual access to excessively destructive weapons that threaten society, while preserving the common-sense meaning of the individual right protected by the text of the 2nd Amendment.\n \n Thanks for reading my paper. It's pretty darn cool to see it pop up now and again. The crowd over at FreeRepublic.com really gave it a good going-over, and I made some changes as a result.", 
   {
    "post_info": {
     "post_title": "Actually, you *can* keep and bear WMDs"
    }
   }, 
   60, 
   null, 
   1047538020.0
  ], 
  [
   4602, 
   null, 
   "Patriot", 
   "Mr. Konsen, \n \n First let me say I'm very pleased to meet you. I have personally cited your paper (but you may already know that. emoticon_smile ) \n \n However, I disagree with your definition of the word \"arms.\" While we could indeed, in a very broad way, interpret arms to mean any weapon, I do not think that was the intent of the Framers for this simple reason: They were very much opposed to the states posessing warships. I should think we'd have seen a big fuss if that wasn't the originial intent of Madison et al. However, the national-level government was much against the state's posession of warships. Arguably, the states could say they were exercising their militia powers. However that argument didn't hold water, and the states were forced to disband (or actually sell to the Feds, as I recall) their warships. \n \n Don't you think that means there are limits? \n \n Guncite.com (who links to your paper) says it like this:\n \"In Colonial times \"arms\" usually meant weapons that could be carried. This included knives, swords, rifles and pistols. Dictionaries of the time had a separate definition for \"ordinance\" (as it was spelled then) meaning cannon. Any hand held, non-ordnance type weapons, are theoretically constitutionally protected. Obviously nuclear weapons, tanks, rockets, fighter planes, and submarines are not.\"\n \n If the Feds chose at some time to supply the militia with ships and cannon (as you showed in your paper) I think it was in excess of 2nd Amendment rights. Not a bad thing by anymeans (seeing as we are at the opposite pole today) but I don't think it means that all arms are protected by the 2nd. \n \n Also, I'm squeemish about circulating such an amendment as you propose (which could do no harm if done correctly) simply because I fear it'll be abused in the present political atmosphere toward civilian ownership of weapons in general and guns in particular.", 
   {}, 
   60, 
   null, 
   1047590760.0
  ], 
  [
   4638, 
   null, 
   "kelvin90701", 
   "Oh boy, a whole can of worms here. The full text of the SA is without a doubt meant to protect firearms ownership within a militia. Firearms ownership at the time the SA was written was defacto and did not need protection. The militia is not the National Guard. Anti-gunners have the problem of somehow equating a militia with the National Guard. If you intrepret the SA as meaning gun owernship for the purpose of a militia, then anyone can form a militia, and legally have military weapons.\n \n Everyone should be nervous about a 28th Amendment. Messing with the Constitution is always dangerous.", 
   {}, 
   60, 
   null, 
   1047612660.0
  ], 
  [
   4641, 
   null, 
   "Debater", 
   "Why is it dangerous?", 
   {}, 
   60, 
   null, 
   1047613260.0
  ], 
  [
   4681, 
   null, 
   "kelvin90701", 
   "The notions in the Constitution have been tried and experimented with since Saxon law. We are left with what has worked. It is all an experiment. We can experiment like prohibition or we can experiment like the First Amendment.\n \n The first 10 protect freedom. Prohibition is a restriction. Any amendments that sound like a restriction I would be suspicious of.", 
   {}, 
   60, 
   null, 
   1047624300.0
  ], 
  [
   4750, 
   null, 
   "Debater", 
   "According to current law all male citizens between the ages of (I think it is) 17 and 45 are part of the militia.", 
   {}, 
   60, 
   null, 
   1047671820.0
  ], 
  [
   4784, 
   null, 
   "Patriot", 
   "That is correct, Debater. If you see my first post in this thread, you can find the citation to it in the US Code.", 
   {}, 
   60, 
   null, 
   1047686040.0
  ], 
  [
   4795, 
   null, 
   "Tim", 
   "In Maryland v. United States the Supreme Court ruled that-\n \"The National Guard is the modern Militia reserved to the States by Art. I. § 8, cl. 15, 16, of the Constitution. It has only been in recent years that the National Guard has been an organized force, capable of being assimilated with ease into the regular military establishment of the United States. From the days of the Minutemen of Lexington and Concord until just before World War I, the various militias embodied the concept of a citizen army, but lacked the equipment and training necessary for their use as an integral part of the reserve force of the United States Armed Forces. The passage of the National Defense Act of 1916 materially altered the status of the militias by constituting them as the National Guard.\"\n \n http://caselaw.lp.findlaw.com/scripts/getcase.pl?navby=search&court=US&case=/us/381/41.html", 
   {}, 
   60, 
   null, 
   1047690840.0
  ], 
  [
   4798, 
   null, 
   "JFriday", 
   "The National Defence Act of 1916 called on States to finance, support, and train militias. It basically called on every state to make the militias more effective by organizing them. Until then there was no requirement that the state maintain a militia, but of the states citizenry to do so. It did not however prevent citizens from forming their own militias as they see fit. What its main purpose to do was to hold accountable those who did not follow the laws of the militias (i.e. not showing up for drill) alot more harsh and also required that those joining swear an oath to follow the laws and commands, as there had been no previous requirment to do so.", 
   {}, 
   60, 
   null, 
   1047692460.0
  ], 
  [
   4842, 
   null, 
   "Patriot", 
   "Despite your S.C. case, Tim, there are still sections in the US Code that say EVERY male 17-45 is in the militia, not just those that choose to join the N.G. Therefore, I am in the militia, despite the fact that I'm not a member of the National Guard.", 
   {}, 
   60, 
   null, 
   1047788280.0
  ], 
  [
   4876, 
   null, 
   "kelvin90701", 
   "I for one believe that the ENTIRE text of the SA deals with ownership of firearms within the context of a militia and not private ownership.\n \n The 1916 Act screws with the Constitution in some very dangerous ways. The purpose of the SA is an armed force to balance the Federal government. Now with the 1916 Act the Feds can take control of the N.G. anytime they want to. \n \n The N.G. has lost it's independace to the Federal government. The N.G. derives most of it corps from ex-federal services. The unifroms and infrastructure mimcs federal forces. The N.G. and federal forces are all or once have been poker buddies when in the service. So who is the N.G. loyal to? There is no militia protecting \"the people\". There is no use of the SA as it was orginally intended by the 1916 Act.", 
   {}, 
   60, 
   null, 
   1047815160.0
  ], 
  [
   4913, 
   null, 
   "Patriot", 
   "the National Guard already IS a federal institution. Everytime we go to war, National Guard units go too.", 
   {}, 
   60, 
   null, 
   1047862740.0
  ], 
  [
   5029, 
   null, 
   "JFriday", 
   "Patriot and Kelvin:\n \n Your crushing of other people arguments with facts and statistics has to stop, you two are running everyone else off. ;) \n \n Where has everyone gone? We need more liberals on this website. Lets ask Norm to go drag some commies over here.", 
   {}, 
   60, 
   null, 
   1048008420.0
  ], 
  [
   5033, 
   null, 
   "Debater", 
   "Anybody but commies!!emoticon_frazzled", 
   {}, 
   60, 
   null, 
   1048015080.0
  ], 
  [
   5038, 
   null, 
   "JFriday", 
   "HAHAHAHAHA\n \n Commies should be able to express their viewpoints, they are wrong and we are right and I feel that I would be able to argue points with them effectively and if they get out of hand we can just unleash SN on them.", 
   {}, 
   60, 
   null, 
   1048022160.0
  ], 
  [
   5040, 
   null, 
   "Patriot", 
   "you forget, jfriday, that communists are not in favor of gun control until they come to power. ;)", 
   {}, 
   60, 
   null, 
   1048022640.0
  ], 
  [
   5118, 
   null, 
   "kelvin90701", 
   "Originally posted by JFriday \n Patriot and Kelvin:\n \n Your crushing of other people arguments with facts and statistics has to stop, you two are running everyone else off. ;) \n \n Where has everyone gone? We need more liberals on this website. Lets ask Norm to go drag some commies over here. \n \n \n If you know where the commies have a debate forum, please post it here. I would like to go and join. Just to make it clear I'm joining the forum, not the commies.", 
   {}, 
   60, 
   null, 
   1048056240.0
  ], 
  [
   5142, 
   null, 
   "JFriday", 
   "Good point, aslong as they are not in power they dont want gun control, when they get into power they do. I will ask Norm to bring some of his old buddies over here. Or just go E-mail the VPC, AGS or some other anti gun website.", 
   {}, 
   60, 
   null, 
   1048092360.0
  ], 
  [
   5378, 
   null, 
   "voiceofreason", 
   "Some good links to communist discussion forums:\n \n www.che-lives.com/cgi/community/forums.pl?forum=22\n \n http://www.commiediscussion.cjb.net/", 
   {}, 
   60, 
   null, 
   1048382580.0
  ], 
  [
   5386, 
   null, 
   "kelvin90701", 
   "Hey Thanks. Your not such a bad guy after all. How long do you think it will take before I get banned from those groups?", 
   {}, 
   60, 
   null, 
   1048387740.0
  ], 
  [
   5520, 
   null, 
   "JFriday", 
   "Boy I have made a couple of enemies over there but it was fun.", 
   {}, 
   60, 
   null, 
   1048612740.0
  ], 
  [
   7189, 
   null, 
   "voiceofreason", 
   "Recently, the Ninth Circuit Court of Appeals ruled that the second amendment does not grant you an individual right to own a gun. (Silveira v. Lockyer)\n \n \n\"If the Founding Fathers could read the Ninth Circuit's opinion, they would be cheering,\" said Mr. Henigan. \"By so forcefully challenging the perversion of the Second Amendment by those who seek to dismantle our gun laws, the Court has honored the Framers and their Constitution.\"\n\n http://www.bradycampaign.org/press/release.asp?Record=442", 
   {}, 
   60, 
   null, 
   1051294920.0
  ], 
  [
   7199, 
   null, 
   "JFriday", 
   "The 9th Circuit is the most overturned court in the land VOR I would not celebrate so soon.", 
   {}, 
   60, 
   null, 
   1051311900.0
  ], 
  [
   7271, 
   null, 
   "Patriot", 
   "Originally posted by voiceofreason \n Recently, the Ninth Circuit Court of Appeals ruled that the second amendment does not grant you an individual right to own a gun. (Silveira v. Lockyer)\n \n \n \n I wonder what the 2nd DOES grant then.... Any answers to that, VoR?", 
   {}, 
   60, 
   null, 
   1051556520.0
  ], 
  [
   7842, 
   null, 
   "voiceofreason", 
   "The decision by the 9th U.S. Circuit Court of Appeals in San Francisco said the amendment's right to bear arms is intended to maintain effective state militias and is not an individual right.\n \n \"The historical record makes it equally plain that the amendment was not adopted in order to afford rights to individuals with respect to private gun ownership or possession,\" Judge Stephen Reinhardt wrote.\n \n The 9th U.S. Circuit Court of Appeals is the same federal court that ruled earlier this year that the phrase \"under God\" in the Pledge of Allegiance violates the separation of church and state. http://www.foxnews.com/story/0,2933,72371,00.html\n\n \n That settles the matter.", 
   {}, 
   60, 
   null, 
   1052376480.0
  ], 
  [
   7864, 
   null, 
   "kelvin90701", 
   "What? What does church and state have to do with the gun ban?\n \n Dude you really need to be more carefull what you post.\n \n Yes the article upholds the ban. If you think that it is settled, you are seriously full of delusions.\n \n Again the 9th court is the most over turned court in history.", 
   {}, 
   60, 
   null, 
   1052450460.0
  ], 
  [
   7873, 
   null, 
   "voiceofreason", 
   "I just thought it was interesting that the same court that is protecting our first amendment freedoms is also correctly interpreting the second amendment.", 
   {}, 
   60, 
   null, 
   1052514600.0
  ], 
  [
   7876, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n I just thought it was interesting that the same court that is protecting our first amendment freedoms is also correctly interpreting the second amendment. \n \n \n Again, \"THE MOST OVERTURNED COURT IN HISTORY\"", 
   {}, 
   60, 
   null, 
   1052515560.0
  ], 
  [
   7877, 
   null, 
   "Patriot", 
   "Not only the most overturned, but wrong in this case at least. \n \n \n Evidence of an Individual Right \n \n In his popular edition of Blackstone's Commentaries on the Laws of England (1803), St. George Tucker, a lawyer, Revolutionary War militia officer, legal scholar, and later a U.S. District Court judge, wrote of the Second Amendment: \n \n The right of the people to keep and bear arms shall not be infringed, and this without any qualification as to their condition or degree, as is the case in the British government. \n In the appendix to the Commentaries, Tucker elaborates further: \n This may be considered as the true palladium of liberty... The right of self-defense is the first law of nature; in most governments it has been the study of rulers to confine this right within the narrowest limits possible. Whenever standing armies are kept up, and the right of the people to keep and bear arms is, under any color or pretext whatsoever, prohibited, liberty, if not already annihilated, is on the brink of destruction.\n Tucker's remarks are solid evidence that the militia clause was not the sole reason for preserving the right of the people to keep and bear arms. Tucker specifically mentions self-defense. This indicates two things: The scope of the right to keep and bear arms was not restricted to military purposes or the common defense (just such a provision was rejected by the Senate), and that \"the people\" means individuals, not a collective entity, and not a state. \n (William Blackstone was an English jurist who published Commentaries on the Laws of England, in four volumes between 1765 and 1769. Blackstone is credited with laying the foundation of modern English law and certainly influenced the thinking of the American Founders.) \n \n In the Federalist Papers, No. 29, Alexander Hamilton clearly states membership in a well regulated militia is not required for the right to keep arms: \n \n What plan for the regulation of the militia may be pursued by the national government is impossible to be foreseen...The project of disciplining all the militia of the United States is as futile as it would be injurious if it were capable of being carried into execution... Little more can reasonably be aimed at with the respect to the people at large than to have them properly armed and equipped ; and in order to see that this be not neglected, it will be necessary to assemble them once or twice in the course of a year. \n ---The Federalist Papers, No. 29. \n After James Madison's Bill of Rights was submitted to Congress, Tench Coxe (see also: Tench Coxe and the Right to Keep and Bear Arms, 1787-1823) published his \"Remarks on the First Part of the Amendments to the Federal Constitution,\" in the Federal Gazette, June 18, 1789 He asserts that it's the people (as individuals) with arms, who serve as the ultimate check on government: \n As civil rulers, not having their duty to the people duly before them, may attempt to tyrannize, and as the military forces which must be occasionally raised to defend our country, might pervert their power to the injury of their fellow-citizens, the people are confirmed by the next article in their right to keep and bear their private arms. \n \"Coxe's defense of the amendments was widely reprinted. A search of the literature of the time reveals that no writer disputed or contradicted Coxe's analysis that what became the Second Amendment protected the right of the people to keep and bear \"their private arms.\" The only dispute was over whether a bill of rights was even necessary to protect such fundamental rights.\" (Halbrook, Stephen P. \"The Right of the People or the Power of the State Bearing Arms, Arming Militias, and the Second Amendment\". Originally published as 26 Val. U. L.Rev. 131-207, 1991). \n Earlier, in The Pennsylvania Gazette, Feb. 20, 1788, while the states were considering ratification of the Constitution, Tench Coxe wrote: \n \n Who are the militia? are they not ourselves. Is it feared, then, that we shall turn our arms each man against his own bosom. Congress have no power to disarm the militia. Their swords, and every other terrible implement of the soldier, are the birth-right of an American...The unlimited power of the sword is not in the hands of either the federal or state governments but, where I trust in God it will ever remain, in the hands of the people. \n William Rawle's \"A View of the Constitution of the United States of America\" (1829), was adopted as a constitutional law textbook at West Point and other institutions. In Chapter 10 he describes the scope of the Second Amendment's right to keep and bear arms: \n \n The prohibition is general. No clause in the constitution could by any rule of construction be conceived to give congress a power to disarm the people. Such a flagitious attempt could only be made under some general pretence by a state legislature. But if in any blind pursuit of inordinate power, either should attempt it, this amendment may be appealed to as a restraint on both. \n This is another quote where it is obvious that \"the people\" means individuals since Rawle writes neither the states nor the national government has legitimate authority to disarm its citizens. \n (In 1791 William Rawle was appointed as a United States Attorney for Pennsylvania by President George Washington, a post he held for more than eight years. He was also George Washington's candidate for the nation's first attorney general, but Rawle declined the appointment.) \n \n A lengthier quote from Rawle, and more quotes from St. George Tucker are presented in the quotes from commentators section. \n \n \n More quotes from the Founding Fathers. \n \n The Early Supreme Court \n \n There were only three Second Amendment related Supreme Court cases in the 19th Century. Here is a quote from the case of Presser v. Illinois, 116 U.S. 252 (1886) : \n \n It is undoubtedly true that all citizens capable of bearing arms constitute the reserved military force or reserve militia of the United States as well as of the States, and in view of this prerogative of the general government...the States cannot, even laying the constitutional provision in question [the Second Amendment] out of view, prohibit the people from keeping and bearing arms, so as to deprive the United States of their rightful resource for maintaining the public security, and disable the people from performing their duty to the general government. \n At the time of this decision the entire Bill of Rights was considered inapplicable to the states. It served as a limitation upon only the federal government (Barron v. Baltimore, 1833). Regardless of this limitation, the Presser court wrote that the right to keep and bear arms existed for \"all citizens capable of bearing arms\" and the states could not infringe upon this right. \n \n \n \n http://www.guncite.com/gc2ndpur.html", 
   {}, 
   60, 
   null, 
   1052515860.0
  ], 
  [
   7880, 
   null, 
   "kelvin90701", 
   "Originally posted by Patriot \n Not only the most overturned, but wrong in this case at least. \n \n \n \n \n \n \n \n Not only do their superiors in higher courts think they are a joke, but their peers in other circuit courts think they are a joke.", 
   {}, 
   60, 
   null, 
   1052516880.0
  ], 
  [
   11455, 
   null, 
   "DHard3006", 
   "There is no requirement in the 2nd amend that a person must be in a militia to bear arms. \n \n Also tanks, fighter aircraft and yes even rockets are legal to own. People collect these items. Has there been any crimes with these items? No!", 
   {}, 
   7880, 
   null, 
   1057424100.0
  ], 
  [
   11474, 
   null, 
   "Patriot", 
   "There is no requirement in the 2nd amend that a person must be in a militia to bear arms. \n \n Also tanks, fighter aircraft and yes even rockets are legal to own. People collect these items. Has there been any crimes with these items? No!\n\n \n One point I would like to make is that rockets are not legal to own, unless they are demil-ed, and the same goes for tanks and aircraft. They are called Destructive Devices under the NFA, and are regulated heavily.", 
   {}, 
   11455, 
   null, 
   1057542300.0
  ], 
  [
   11499, 
   null, 
   "enfant terrible", 
   "the only case that I know of in which a court has ruled that the second amendment is an individual right is US vs Emerson. On the other hand, I know of more than thirty cases in which the courts have supported the militia interpretation of the second amendment.\n\n \n Exactly. Moreover, in Emerson the discussion of the 2nd Am. is dicta (arguments not pertinent to the verdict) so it is not a binding precedent even for the courts in the same Circuit.\n \n A question for the \"original intent\" crowd:\n \n What did the Founding Fathers intend with the misplaced comma in the 2nd Amendment?", 
   {}, 
   2532, 
   null, 
   1057568400.0
  ], 
  [
   11532, 
   null, 
   "DHard3006", 
   "One point I would like to make is that rockets are not legal to own, unless they are demil-ed, and the same goes for tanks and aircraft. They are called Destructive Devices under the NFA, and are regulated heavily.\n\n \n Do some research. People collect functional tanks and aircraft. Did you ever hear of the Confederate Air Force? They restore and fly military aircraft. As for tanks, there are many web sites that promote collecting tanks and other military vehicles. And people shoot laws rockets. They just do not shoot live HE rounds. It is a little expensive.", 
   {}, 
   11474, 
   null, 
   1057639500.0
  ], 
  [
   11567, 
   null, 
   "enfant terrible", 
   "For those who claim that the 2nd Am. protects even the right to have WMDs: surely Saddam Hussein and Kim Yong Il cannot be denied the same right, right?", 
   {
    "post_info": {
     "post_title": "Brothers in arms"
    }
   }, 
   11532, 
   null, 
   1057654920.0
  ], 
  [
   11584, 
   null, 
   "tsmith2771", 
   "For those who claim that the 2nd Am. protects even the right to have WMDs: surely Saddam Hussein and Kim Yong Il cannot be denied the same right, right?\n\n \n When used as a threat to the United States, no they don't have that right, squash them and those like them. Pound them into submission becuase if they have the power we have then they would damn sure do the same and if you think they wouldn't you are living in a dream world and really really need to grow up.", 
   {}, 
   11567, 
   null, 
   1057659540.0
  ], 
  [
   11597, 
   null, 
   "enfant terrible", 
   "When used as a threat to the United States...\n\n \n No one asked about using them, just about \"bearing\" them.", 
   {}, 
   11584, 
   null, 
   1057663680.0
  ], 
  [
   11615, 
   null, 
   "DHard3006", 
   "For those who claim that the 2nd Am. protects even the right to have WMDs: surely Saddam Hussein and Kim Yong Il cannot be denied the same right, right?\n\n \n At last check the two people you mentioned do not live in America or hold American citizenship. \n \n As for access to wmd, per all of the news networks terrorist and the two people you mentioned all ready have access to these wmd in other countries!", 
   {}, 
   11567, 
   null, 
   1057690920.0
  ], 
  [
   11632, 
   null, 
   "enfant terrible", 
   "At last check the two people you mentioned do not live in America or hold American citizenship.\n\n \n So what? That just means we have even less authority to regulate what they may or may not do.\n \n Clearly, if we could not forbid Bill Gates to own nukes and ICBMs, we cannot forbid Kim Yong Il the same thing, either.", 
   {}, 
   11615, 
   null, 
   1057696500.0
  ], 
  [
   11641, 
   null, 
   "DHard3006", 
   "So what? That just means we have even less authority to regulate what they may or may not do.\n \n Clearly, if we could not forbid Bill Gates to own nukes and ICBMs, we cannot forbid Kim Yong Il the same thing, either.\n\n \n The 2nd amend only applies to Americans.\n \n It is always interesting that gun haters throw out the nuke and missile scare tactic every time a person defends no limits on the right to bear arms. \n \n Has there ever been one recorded incident of an American citizen trying to purchase a nuke or missile? if the gun haters are going to use this scare tactic they should be able to produce one recorded incident of this happening. \n \n Has there ever been a crime committed with these items in America? \n No!\n \n Will gun haters constantly chant this scare tactic to push for gun control laws? Yes!", 
   {}, 
   11632, 
   null, 
   1057700700.0
  ], 
  [
   11654, 
   null, 
   "enfant terrible", 
   "It is always interesting that gun haters throw out the nuke and missile scare tactic every time a person defends no limits on the right to bear arms. \n \n Has there ever been one recorded incident of an American citizen trying to purchase a nuke or missile?\n\n \n Of course there hasn't - because there is no way in hell you could ever legally do so.\n \n It is not scare tactics. It is simply showing that you don't know what you are talking about.", 
   {}, 
   11641, 
   null, 
   1057707420.0
  ], 
  [
   11656, 
   null, 
   "DHard3006", 
   "Of course there hasn't - because there is no way in hell you could ever legally do so.\n \n It is not scare tactics. It is simply showing that you don't know what you are talking about.\n\n \n \n Since you stated they are illegal to own, please produce the law defending your claim. A very simple request.\n \n Unlike you I am not trying to make my opponent look stupid. I admit when I do not know something. In this case I do not know of any laws prohibiting the ownership of nukes or icbm's. I do not know of this law simple because I have never checked into purchasing a nuke or icbm. I have never had the urge to own them seeing how they are rather costly to own, so I just never checked into the laws. Since you appear to be the expert on nukes and icbm's you must know the law. So would you please produce the law or web site where I could read it for myself.\n \n For help you may want to check out the atf web site. Plus they do take questions. Now maybe the atf would not be the ones to ask seeing how nukes and icbm's are not guns. \n \n So who would you ask about this. \n \n One of the gun haters should know the law or where we can read it, since the gun haters chant this gun hater scare tactic all of the time.\n \n Oh and if nukes and icbm's are illegal to own what is the point of gun haters asking this question?", 
   {}, 
   11654, 
   null, 
   1057708740.0
  ], 
  [
   11665, 
   null, 
   "voiceofreason", 
   "Despite the claims of some pro-gunners, there is no constitutional right to own nuclear weapons. In the following case a federal appeals court ruled that there is no individual right to own pipe bombs or machine guns. Since there is no right to privately own these weapons, why would there be a right to privately own nuclear weapons? \n \n \"The Second Amendment to the United States Constitution provides: 'A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.' In this case, we must decide whether this amendment grants constitutional protection to an individual whose possession or use of machineguns and pipe bombs is not reasonably related to an organized state militia. We hold that it does not.\"\n US v. Wright (11th Cir 1997)\n http://www.healylaw.com/cases/wright.htm", 
   {}, 
   11656, 
   null, 
   1057716660.0
  ], 
  [
   11676, 
   null, 
   "DHard3006", 
   "Despite the claims of some pro-gunners, there is no constitutional right to own nuclear weapons. In the following case a federal appeals court ruled that there is no individual right to own pipe bombs or machine guns. Since there is no right to privately own these weapons, why would there be a right to privately own nuclear weapons? \n \n \"The Second Amendment to the United States Constitution provides: 'A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.' In this case, we must decide whether this amendment grants constitutional protection to an individual whose possession or use of machineguns and pipe bombs is not reasonably related to an organized state militia. We hold that it does not.\"\n US v. Wright (11th Cir 1997)\n http://www.healylaw.com/cases/wright.htm\n\n \n \n Gun haters please show me the law that defends your claim.\n \n As for machine-guns, they are legal to own. They are somewhat regulated, but they are legal to own in all but a few states. How do I know this? I own a few myself. Plus I go to machine-gun shoots. \n \n By the way gun haters there has only been one crime with a legally registered machine-guns in the last 30 to 40 yr.. The machine-guns used in the la bank robbery were illegally converted machine-guns. Once again proving that criminals do not obey gun control laws. Only law abiding citizens are affected by gun control laws.\n \n So gun haters if you are going to make a claim, please provide the needed facts to defend that claim. In this case the laws against owning nukes or icbm's. I have stated I do not know this law simply because I have no desire to own a nuke or icbm. Because if this I have never check into this.\n \n As for making pipe bombs. The law appears to be if you intend to use them for a crime you are in trouble. Because I cannot find any law that states you cannot make a pipe bomb. \n \n So if you are going to quote a law please have the law available for us to read.", 
   {}, 
   11665, 
   null, 
   1057724100.0
  ], 
  [
   11737, 
   null, 
   "enfant terrible", 
   "Unlike you I am not trying to make my opponent look stupid.\n\n \n Oh, no. Not your opponent. You are right about that.", 
   {}, 
   11656, 
   null, 
   1057812360.0
  ], 
  [
   11744, 
   null, 
   "DHard3006", 
   "Still no answer to defend your claim! It is a very simple request. If gun haters are going to state there is a law, then they should be able to produce that law. \n \n What can one expect from a member of a hate group.", 
   {}, 
   11737, 
   null, 
   1057814160.0
  ], 
  [
   11773, 
   null, 
   "kelvin90701", 
   "\"Laws restricting ownership of any weapon is unconstitional.\"\n Are you saying that private citizens should be able to own nuclear and biological weapons according to the second amendment?\n\n \n Yes, If (important here is IF) I can keep and maintain nuclear weapons with MORE responsibility and GEATER saftey that the Department of Defense. Then there is no reason for the government to deny me the purchase of a nulcear weapon if I can find a seller.\n \n The simple fact that I cannot maintain nuclear weapons with MORE responsibility and GREATER saftey than the Department of Defense is reason enough for me that I do not want to own them. Nor can I find a seller.\n \n But...\n \n I can keep assault rifles with MORE responsibility and even GREATER saftey that the US Army. My rifles are under more locks and and controls. I train with my rifle more and I score better than 90% of soldiers. I am MORE responsible, SAFER, and BETTER trained than the Army. There is no rational reason to deny me equalivant firearms.\n \n The day when I can build a personal bunker, pay nuclear technicians, and pay armed guards to protect my nuclear bomb, then the government has no rational reason to deny me ownership of a nuke.", 
   {}, 
   2542, 
   null, 
   1057822440.0
  ], 
  [
   11777, 
   null, 
   "enfant terrible", 
   "I can keep assault rifles with MORE responsibility and even GREATER saftey that the US Army.\n\n \n Yes, I am sure you can also keep morphine with more responsibility and greater safety than a hospital. emoticon_xbouncer \n \n So do only those as responsible as you have the right to keep weapons? And how do they prove they have the responsibility of a Kelvinator?", 
   {}, 
   11773, 
   null, 
   1057825260.0
  ], 
  [
   11790, 
   null, 
   "kelvin90701", 
   "Yes, I am sure you can also keep morphine with more responsibility and greater safety than a hospital. emoticon_xbouncer \n \n So do only those as responsible as you have the right to keep weapons? And how do they prove they have the responsibility of a Kelvinator?\n\n \n Read the post, IF I can do A, then I am allowed to do B. I can not keep morphine responsibily, then I can not own morphine. I can keep assault rifles responsibily, then I am allowed to own assault rifles. That is a hallmark of our law system, personal responsibility. I do things that I can carry out with saftey and responsibility. I can not carry out heart surgery with saftey and responsibility, I am not allowed to perform heart surgery.\n \n But... I can keep assault weapons with saftey and responsibility.\n \n I train more than often than 90% of soliders with my rifle. I am at the rifle range every weekend. I a better marksman than most soliders, only special forces put more rounds down range than I do. I keep my weapons in a steel safe that only explosives will open and you will need a forklift to carry away. The army just keeps them in a building and sometimes in a wooden box.\n \n I believe I use more care and responsibility than the army to keep my weapons safe.", 
   {}, 
   11777, 
   null, 
   1057860480.0
  ], 
  [
   11798, 
   null, 
   "enfant terrible", 
   "I can not keep morphine responsibily\n\n \n I see that. ;)", 
   {}, 
   11790, 
   null, 
   1057874700.0
  ], 
  [
   11808, 
   null, 
   "kelvin90701", 
   "I see that. ;)\n\n \n I do not keep my rifles in a wooden box and I train more than the US army. I am more responsible than the army. Then there is no rational reason to deny me ownership of an assault rifle. My guns are less dangerous to the saftey of society than the US Armies guns. There is no reason to prevent me and other people who are responsible and good decent people from access to firearms.", 
   {}, 
   11798, 
   null, 
   1057885620.0
  ], 
  [
   11812, 
   null, 
   "DHard3006", 
   "Still no answer to the simple question. If there is a law against owning nukes and icbm's please post it. Oh and do not forget the law about pipe bombs. I did a search today and could not find any law against making pipe bombs. I did find a few laws that covered using pipe bombs or any bomb for that matter for a crime.", 
   {}, 
   11808, 
   null, 
   1057890300.0
  ], 
  [
   11816, 
   null, 
   "voiceofreason", 
   "Still no answer to the simple question. If there is a law against owning nukes and icbm's please post it. Oh and do not forget the law about pipe bombs. I did a search today and could not find any law against making pipe bombs. I did find a few laws that covered using pipe bombs or any bomb for that matter for a crime.\n\n You don't answer my simple questions. Why should people answer your simple questions? You can own nuclear materials to produce energy if you get a license. As for nuclear weapons, there is no law allowing private citizens to own these weapons. I don't know any law about pipe bombs. I was just pointing out that the second amendment does not protect the private ownership of pipebombs. The title of this thread is the second amendment so let's stick to the topic.", 
   {}, 
   11812, 
   null, 
   1057891920.0
  ], 
  [
   11819, 
   null, 
   "kelvin90701", 
   "Still no answer to the simple question. If there is a law against owning nukes and icbm's please post it. Oh and do not forget the law about pipe bombs. I did a search today and could not find any law against making pipe bombs. I did find a few laws that covered using pipe bombs or any bomb for that matter for a crime.\n\n \n The question is actually moot. You won't find any seller of icbms. Pipe bombs? I would not want to own one. There are no quality controls or saftey requirements for such homemade devices. Such devices are dangerous and I would consider irresponsible to own. Claymore's and anti-tank guns? I could not store those items with saftey in my home. I would endanger my neghbors with the amount of explosives in them. If I lived in the middle of Alaska, then I see no problem for owning them if I had equilivant training that the Army uses to train soldiers. In that respect I consider that portion of laws restricting destructive devices as unconstitutional. Ofcourse the question is also moot. I won't find any seller of LAWs or Claymores.", 
   {}, 
   11812, 
   null, 
   1057896600.0
  ], 
  [
   11857, 
   null, 
   "DHard3006", 
   "Gun haters stated there was a law to defend their claims. The question was, can the gun haters produce the law they are using to defend their statements. It appears like all hate group members when pressed for proof they cannot produce it. Please produce the law against anti-tank guns, LAWS rockets, pipe bombs, nuke's, and icbm's\n \n As for you remarks about anit-tank guns and LAWS rockets. These are legal to own. Before making claims like this people need to visit the ATF web site or their own states web sites and do some research. How do I know anti-tank guns and LAWS rockets are legal own. Simple I have attend shooting events and watched them being fired. Plus there has never been a crime committed with these items. \n \n As for safe storage. How do you store gasoline? This is far more dangerous then ammunition for these guns. \n \n Unlike the gun haters I have answered their question.", 
   {}, 
   11819, 
   null, 
   1057948140.0
  ], 
  [
   11877, 
   null, 
   "kelvin90701", 
   "Gun haters stated there was a law to defend their claims. The question was, can the gun haters produce the law they are using to defend their statements. It appears like all hate group members when pressed for proof they cannot produce it. Please produce the law against anti-tank guns, LAWS rockets, pipe bombs, nuke's, and icbm's\n \n As for you remarks about anit-tank guns and LAWS rockets. These are legal to own. Before making claims like this people need to visit the ATF web site or their own states web sites and do some research. How do I know anti-tank guns and LAWS rockets are legal own. Simple I have attend shooting events and watched them being fired. Plus there has never been a crime committed with these items. \n \n As for safe storage. How do you store gasoline? This is far more dangerous then ammunition for these guns. \n \n Unlike the gun haters I have answered their question.\n\n \n I am aware of the legality of owning destructive devices. They are legal to own. You just need more paper work. If you have a seller in mind, let me know. I'd like to try out a few LAWs. I am also aware of the destructive power of 1 gallon gasoline. Try and explain that to a laywer. I am pretty sure I can convince a jurry of the saftey of 1 gallon of gasoline. I don't think I can convince a jurry or my insurance company of the saftey of 14 sticks of TNT if I had an accident in my garage.\n \n I am talking personally. I would not want to store 14 sticks of TNT in my garage for the reasons above, but a gallon of gas in a can is OK.", 
   {}, 
   11857, 
   null, 
   1057970820.0
  ], 
  [
   11878, 
   null, 
   "kelvin90701", 
   "Despite the claims of some pro-gunners, there is no constitutional right to own nuclear weapons. In the following case a federal appeals court ruled that there is no individual right to own pipe bombs or machine guns. Since there is no right to privately own these weapons, why would there be a right to privately own nuclear weapons? \n \n \"The Second Amendment to the United States Constitution provides: 'A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.' In this case, we must decide whether this amendment grants constitutional protection to an individual whose possession or use of machineguns and pipe bombs is not reasonably related to an organized state militia. We hold that it does not.\"\n US v. Wright (11th Cir 1997)\n http://www.healylaw.com/cases/wright.htm\n\n \n \n I believe you are a little confused. You are right, there is no laws saying \"YES\" I can own destructive devices. You forget, we live in a free country. We can do anything we want as long as it there is no law against it. There is no law preventing me to own nuclear weapons or any other insanely massively destructive device.\n \n There is no law saying that is OK for me to break the sound barrier in a car in the Nevada desert, there is no law saying it is OK for me to for me to sail around the world in a boat, there is no law saying it is OK for me to dress like a clown, there are no laws saying it is OK for me it cross breed apples and oranges in my backyard. When there are now laws saying an activity is OK, you can do it. We live in a free country. You can not do things when a law says NO. There are no laws for me saying is OK to wipe my butt with toilet paper. Just because the laws does not say it is OK, do I have to ask permission first?", 
   {}, 
   11665, 
   null, 
   1057971780.0
  ], 
  [
   11885, 
   null, 
   "enfant terrible", 
   "Here are some articles from the US Code. Title 18, Part I contains federal crimes.\n \n Chapter 10, Section 175: Possession of biological wepons is prohibited and punishable up to life imprisonment.\n \n Ch. 11B, Sect. 229: Possession of chemical wepons is prohibited unless authorized by law or an appropriate military commander. Punishable by fine and/or \"any term of years\".\n \n Ch. 39, Sect. 831: Possession of nuclear materials w/o lawful authority is prohibited and punishable by fine and/or imprisonment. This section is more complicated, but its part (a)(1)(B) effectively covers all private possession of nuclear/radiological weapons.\n \n Ch. 40, Sect. 842: Traffic in explosives is heavily restricted and regulated. Penalties (Sect. 844) for violations may be severe.\n \n Ch. 44, Sect. 922:\n (a)(7-8) Importing, manufacturing or selling armor-piercing ammunition is prohibited, except for US government/military use.\n (b)(4) Machineguns, short-barreled rifles and the like are prohibited unless specifically authorized by the government.\n (p)(1) Any firearm that does not show up on usual security check devices (metal detectors, x-ray scanners etc.) is prohibited.\n Other provisions of this section regulate and restrict traffic in firearms generally. Sect. 924 provides fine/prison penalties.\n \n This is not necessarily an exhaustive list of prohibitions on ownership of specific weapons. And this is just the federal criminal law. Many states have additional prohibitions.\n \n You still think you can own nukes?", 
   {}, 
   11878, 
   null, 
   1057988760.0
  ], 
  [
   11892, 
   null, 
   "kelvin90701", 
   "Here are some articles from the US Code. Title 18, Part I contains federal crimes.\n \n Chapter 10, Section 175: Possession of biological wepons is prohibited and punishable up to life imprisonment.\n \n Ch. 11B, Sect. 229: Possession of chemical wepons is prohibited unless authorized by law or an appropriate military commander. Punishable by fine and/or \"any term of years\".\n \n Ch. 39, Sect. 831: Possession of nuclear materials w/o lawful authority is prohibited and punishable by fine and/or imprisonment. This section is more complicated, but its part (a)(1)(B) effectively covers all private possession of nuclear/radiological weapons.\n \n Ch. 40, Sect. 842: Traffic in explosives is heavily restricted and regulated. Penalties (Sect. 844) for violations may be severe.\n \n Ch. 44, Sect. 922:\n (a)(7-8) Importing, manufacturing or selling armor-piercing ammunition is prohibited, except for US government/military use.\n (b)(4) Machineguns, short-barreled rifles and the like are prohibited unless specifically authorized by the government.\n (p)(1) Any firearm that does not show up on usual security check devices (metal detectors, x-ray scanners etc.) is prohibited.\n Other provisions of this section regulate and restrict traffic in firearms generally. Sect. 924 provides fine/prison penalties.\n \n This is not necessarily an exhaustive list of prohibitions on ownership of specific weapons. And this is just the federal criminal law. Many states have additional prohibitions.\n \n You still think you can own nukes?\n\n \n Ahhh I think you need to check those laws again. I don't discount many of them, but.......\n \n 1) Farmer next door just used explosives to remove a tree stump. You can buy powder in the mail, just pay the extra explosives hazard fee, they prefer you order in large volume: https://www.eabco.com/VVuori02.html\n \n 2) I buy SS109 armour piecing ammo in the mail all the time: http://www.billstclair.com/ammo.html\n \n 3) Machine guns are legal. Here is where you can buy them: \n http://www.gunsnstuf.com/\n Here is where you fill out the paper work:\n http://www.classthreesupply.com/HTBAMG.htm\n \n No I can not own nukes. No one will sell them to me, the government has a monopoly. Just because I have the right to buy something, does not mean I have the right for someone to force them to sell it to me. No I can not own biological weapons. No one will sell them to me. No one is about to challege the constitutionality of that law.\n \n Didn't both sides use chlorine gas to kill each other in WW1:\n http://www.intheswim.com/catalog.cfm?dest=dept&deptid=1137&storeid=11&requestTimeout=500\n It's not a weapon. I am sure a college chemistry textbook will show you enough to make the tablets into a weapon. Ofcourse it would be illegal, it is called a weapon. I would have to find some other use for it to make it legal. Maybe it is an insect fogger, not a chemical weapon. Maybe I will save time just buy the insect fogger instead of making one. \n http://store.yahoo.com/onestopshopcatalog/lawn---garden-catalog-lawn---garden-power-machines---tools-insect-foggers.html\n \n I can be just as smart XXX as you.", 
   {}, 
   11885, 
   null, 
   1058001480.0
  ], 
  [
   11906, 
   null, 
   "enfant terrible", 
   "I can be just as smart XXX as you.\n\n \n Only half of that, and the second half I am afraid.", 
   {}, 
   11892, 
   null, 
   1058033460.0
  ], 
  [
   11943, 
   null, 
   "kelvin90701", 
   "Only half of that, and the second half I am afraid.\n\n \n Your points:\n \n 1) I can not own machine guns\n \n 2) I can not own explosives\n \n 3) I can not own armour piercing ammo.\n \n 4) I can not own nuclear, chemical, biological weapons. \n \n ___________________________________________________\n \n 1) Here is what you need to do to buy a machine gun:\n http://www.gunsnstuf.com/\n http://www.classthreesupply.com/HTBAMG.htm\n \n 2) Just pay the extra explosives handeling fee and it will be delivered to your door:\n https://www.eabco.com/VVuori02.html\n \n 3) Send in your drivers license photo copy to prove your 18 and you can buy armour piercing ammo: http://www.billstclair.com/ammo.html\n \n 4) WW1 chemical weapon (or insect fogger)? http://store.yahoo.com/onestopshopc...ct-foggers.html\n Nuclear or biological weapons? I yield to you. I can not buy them.", 
   {}, 
   11906, 
   null, 
   1058090640.0
  ], 
  [
   11956, 
   null, 
   "enfant terrible", 
   "Of course it is possible that you can buy those things. I never said you could not. What I did say is: you may not. It is illegal.\n \n You can buy heroin, too. People do it all the time. Doesn't mean they may.", 
   {}, 
   11943, 
   null, 
   1058130780.0
  ], 
  [
   11964, 
   null, 
   "tarawa12", 
   "Of course it is possible that you can buy those things. I never said you could not. What I did say is: you may not. It is illegal.\n \n You can buy heroin, too. People do it all the time. Doesn't mean they may.\n\n \n \n YOU are misinformed.\n \n Machineguns are legal to buy and own.\n \n Explosives are legal to buy and own.\n \n Armor piercing ammo is legal to buy and own in some calibers just not \"ALL\" of them.\n \n Nuke/chem/BIO- You are probably correct on that point.", 
   {}, 
   11956, 
   null, 
   1058134440.0
  ], 
  [
   11967, 
   null, 
   "DHard3006", 
   "Of course it is possible that you can buy those things. I never said you could not. What I did say is: you may not. It is illegal.\n \n You can buy heroin, too. People do it all the time. Doesn't mean they may.\n\n \n Finally a gun hater produces the data to defend their claims. Even though some of it appears wrong. \n \n It is not illegal to own machine-guns. Some states(very few) have banned them but not all of the states. \n \n Now it is illegal for any new machine-guns to be manufactured for sell to the public since May of 1986. This is called the machine-gun ban of 1986. A republican president signed that ban. \n \n So now gun haters since it may be illegal to own nukes. Tell me why ever time a person defends no gun bans the gun haters throw out the nuke bs. I mean if nukes are illegal why do gun haters constantly chant this bs? Can you show me a message board where a person is demanding the right to own nukes? \n \n As for AP (armor piercing bullets) ammo. We can no longer import AP ammo made outside of the US. But we can still buy US made AP ammo. \n \n BTW do you know what AP ammo is? Give us your thoughts on what makes a bullet an armor piercing round.", 
   {}, 
   11956, 
   null, 
   1058138940.0
  ], 
  [
   11977, 
   null, 
   "enfant terrible", 
   "Finally a gun hater produces the data to defend their claims. Even though some of it appears wrong.\n\n \n 1. There is no such thing as a \"gun hater\" and your calling me a \"gun hater\" makes no more sense than it would make for me to call you a \"female parent lover\".\n \n 2. Everything I claimed is based on the US Code. No other source can compete with it re: legality of some action in the US. If you disagree with any of my claims, you must show that I misinterpreted the Code. No other counterarguments are valid.", 
   {}, 
   11967, 
   null, 
   1058211540.0
  ], 
  [
   11983, 
   null, 
   "tarawa12", 
   "1. There is no such thing as a \"gun hater\" and your calling me a \"gun hater\" makes no more sense than it would make for me to call you a \"female parent lover\".\n \n 2. Everything I claimed is based on the US Code. No other source can compete with it re: legality of some action in the US. If you disagree with any of my claims, you must show that I misinterpreted the Code. No other counterarguments are valid.\n\n \n \n Look up \"ATF Form 4\".\n \n Fill it out and you have started the process to buy a machinegun.\n \n Also look up \"NFA of 1934\". \n \n Your comments on explosives (RE: USC)only say it's restricted & regulated...NOT banned as you have implied.\n \n Do a little more thorough research before you post this as \"fact\". Maybe if you lived here you would be alittle more aware or your rights and what they represent.", 
   {}, 
   11977, 
   null, 
   1058224680.0
  ], 
  [
   11985, 
   null, 
   "DHard3006", 
   "1. There is no such thing as a \"gun hater\" and your calling me a \"gun hater\" makes no more sense than it would make for me to call you a \"female parent lover\".\n \n 2. Everything I claimed is based on the US Code. No other source can compete with it re: legality of some action in the US. If you disagree with any of my claims, you must show that I misinterpreted the Code. No other counterarguments are valid.\n\n \n A gun haters is a person that wants gun control laws that infringe on the right to bear arms or wants to ban the right to bear arms.\n \n Gun haters would like to be called anti gun or gun control advocate. These names do not really describe what a gun hater is. A gun hater is a member of a hate group that want to take rights away from other people. Like any hate group gun haters will use lies and attack anybody speaking out against their goals.\n \n Gun haters are like any other hate group. Groups like the kkk, nazis, or communist.", 
   {}, 
   11977, 
   null, 
   1058237340.0
  ], 
  [
   11999, 
   null, 
   "enfant terrible", 
   "A gun haters is a person that wants gun control laws that infringe on the right to bear arms or wants to ban the right to bear arms.\n\n \n The \"right to bear arms\" is the right to serve in the military. No one wants to deny you that right. And even if someone did, why would it make him a gun hater?\n \n \nA gun hater is a member of a hate group that want to take rights away from other people.\n\n \n Wait a minute. If they hate guns, then they want to take rights away from guns, not from people. Make up your mind.\n \n \nGun haters are like any other hate group. Groups like the kkk, nazis, or communist. \n\n \n Or broccoli haters.", 
   {}, 
   11985, 
   null, 
   1058294640.0
  ], 
  [
   12000, 
   null, 
   "enfant terrible", 
   "Do a little more thorough research before you post this as \"fact\".\n\n \n Did you refute anything I said?", 
   {}, 
   11983, 
   null, 
   1058294700.0
  ], 
  [
   12003, 
   null, 
   "tarawa12", 
   "Did you refute anything I said?\n\n Umm, yeah I did. But since you didn't bother to look them up here it is.\n \n USC, Title 26, Chapter 53-\n http://caselaw.lp.findlaw.com/casecode/uscodes/26/subtitles/e/chapters/53/subchapters/b/parts/i/sections/section_5841.html\n \n (a) Central registry\n The Secretary shall maintain a central registry of all firearms\n in the United States which are not in the possession or under the\n control of the United States. This registry shall be known as the\n National Firearms Registration and Transfer Record. The registry\n shall include -\n (1) identification of the firearm;\n (2) date of registration; and\n (3) identification and address of person entitled to possession\n of the firearm.\n (b) By whom registered\n Each manufacturer, importer, and maker shall register each\n firearm he manufactures, imports, or makes. Each firearm\n transferred shall be registered to the transferee by the\n transferor.\n (c) How registered\n Each manufacturer shall notify the Secretary of the manufacture\n of a firearm in such manner as may by regulations be prescribed and\n such notification shall effect the registration of the firearm\n required by this section. Each importer, maker, and transferor of\n a firearm shall, prior to importing, making, or transferring a\n firearm, obtain authorization in such manner as required by this\n chapter or regulations issued thereunder to import, make, or\n transfer the firearm, and such authorization shall effect the\n registration of the firearm required by this section.\n (d) Firearms registered on effective date of this Act\n A person shown as possessing a firearm by the records maintained\n by the Secretary pursuant to the National Firearms Act in force on\n the day immediately prior to the effective date of the National\n Firearms Act of 1968 shall be considered to have registered under\n this section the firearms in his possession which are disclosed by\n that record as being in his possession.\n (e) Proof of registration\n A person possessing a firearm registered as required by this\n section shall retain proof of registration which shall be made\n available to the Secretary upon request.\n \n \n There you go.", 
   {}, 
   12000, 
   null, 
   1058299320.0
  ], 
  [
   12005, 
   null, 
   "tarawa12", 
   "Here are some articles from the US Code. Title 18, Part I contains federal crimes.\n \n Ch. 11B, Sect. 229: Possession of chemical wepons is prohibited unless authorized by law or an appropriate military commander. Punishable by fine and/or \"any term of years\".\n \n\n Also \"poison gas\" is termed a \"destructive device\" and is therefore legal to own under the NFA of 1934.\n \n http://caselaw.lp.findlaw.com/casecode/uscodes/26/subtitles/e/chapters/53/subchapters/b/parts/i/sections/section_5845.html\n \n The term ''destructive device'' means (1) any explosive,\n incendiary, or poison gas (A) bomb, (B) grenade, (C) rocket having\n a propellent charge of more than four ounces, (D) missile having an\n explosive or incendiary charge of more than one-quarter ounce, (E)\n mine, or (F) similar device; (2) any type of weapon by whatever\n name known which will, or which may be readily converted to, expel\n a projectile by the action of an explosive or other propellant, the\n barrel or barrels of which have a bore of more than one-half inch\n in diameter, except a shotgun or shotgun shell which the Secretary\n finds is generally recognized as particularly suitable for sporting\n purposes; and (3) any combination of parts either designed or\n intended for use in converting any device into a destructive device\n as defined in subparagraphs (1) and (2) and from which a\n destructive device may be readily assembled. \n \n \n hmmm.......", 
   {}, 
   11885, 
   null, 
   1058299800.0
  ], 
  [
   12008, 
   null, 
   "enfant terrible", 
   "Umm, yeah I did.\n\n \n Exactly which of my statements did you refute?", 
   {}, 
   12003, 
   null, 
   1058308740.0
  ], 
  [
   12009, 
   null, 
   "enfant terrible", 
   "Also \"poison gas\" is termed a \"destructive device\" and is therefore legal to own under the NFA of 1934.\n\n \n If the US code provision I cited was enacted after 1934 (and, given what it talks about, I don't think it is necessary for me to verify that), then it trumps your statute by standard rules of statutory construction.", 
   {}, 
   12005, 
   null, 
   1058308920.0
  ], 
  [
   12012, 
   null, 
   "tarawa12", 
   "If the US code provision I cited was enacted after 1934 (and, given what it talks about, I don't think it is necessary for me to verify that), then it trumps your statute by standard rules of statutory construction.\n\n You wish.....\n \n \n If what \"you\" think is correct (which it isn't) then they would have have to ammend the given statue. Since they didn't it is therefore legal to own.\n \n In the same link I provided do you also suggest that:\n \"(1) any explosive,\n incendiary, or poison gas (A) bomb, (B) grenade, (C) rocket having\n a propellent charge of more than four ounces, (D) missile having an\n explosive or incendiary charge of more than one-quarter ounce, (E)\n mine, or (F) similar device;\"\n \n are also \"illegal\" because your statue \"trumps\" mine?\n \n If so, you are sadly mistaken and fail to grasp what is legal here in the US and what isn't.", 
   {}, 
   12009, 
   null, 
   1058315160.0
  ], 
  [
   12014, 
   null, 
   "tarawa12", 
   "Exactly which of my statements did you refute?\n\n Well so far I've proven you wrong on 2 out of 4. I'll prove the other two when I get around to it.", 
   {}, 
   12008, 
   null, 
   1058315400.0
  ], 
  [
   12036, 
   null, 
   "enfant terrible", 
   "If what \"you\" think is correct (which it isn't) \n\n \n So when was it enacted?\n \n \nthen they would have have to ammend the given statue. \n\n \n Nonsense. You know nothing about statutory construction. And not much more about spelling, by the way...", 
   {}, 
   12012, 
   null, 
   1058385000.0
  ], 
  [
   12040, 
   null, 
   "tarawa12", 
   "So when was it enacted?\n \n \n \n Nonsense. You know nothing about statutory construction. And not much more about spelling, by the way...\n\n \n \n I knew I could count on you to come back with a personal attack instead of any factual evidence. Typical with most gun haters.\n \n Show us where it says that you CANNOT own machineguns in the US.", 
   {}, 
   12036, 
   null, 
   1058415000.0
  ], 
  [
   12048, 
   null, 
   "tarawa12", 
   "Can you say a sentence about anything without mentioning \"gun haters\"?\n \n You have a psychological problem. You should seek professional help.\n\n Avoiding the question again???? Personal attacks???\n \n \"Show us where it says that you CANNOT own machineguns in the US.\"\n \n Go ahead....prove that it's illegal to own machineguns in the US.", 
   {}, 
   12040, 
   null, 
   1058473260.0
  ], 
  [
   12082, 
   null, 
   "kelvin90701", 
   "Of course it is possible that you can buy those things. I never said you could not. What I did say is: you may not. It is illegal.\n \n You can buy heroin, too. People do it all the time. Doesn't mean they may.\n\n \n Ah. All those things above? Are legal, except the two items I can not find sellers for. The explosives, armour piercing ammo, and chlorine gas, all can be bought on the internet and delivered to my door. The machine guns bought on the internet, but I need to have them shipped to a licensed dealer, then pick them up from the dealer.", 
   {}, 
   11956, 
   null, 
   1058638920.0
  ], 
  [
   12150, 
   null, 
   "tarawa12", 
   "Avoiding the question again???? Personal attacks???\n \n \"Show us where it says that you CANNOT own machineguns in the US.\"\n \n Go ahead....prove that it's illegal to own machineguns in the US.\n\n Well do you have any proof yet???", 
   {}, 
   12048, 
   null, 
   1059002520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Second Amendment", 
  "url": "http://www.4forums.com/political/gun-control-debates/56-second-amendment.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 56, 
  "discussion_files": [
   [
    "16028.html", 
    "http://www.4forums.com/political/gun-control-debates/56-second-amendment-print.html"
   ], 
   [
    "16029.html", 
    "http://www.4forums.com/political/gun-control-debates/56-second-amendment-7-print.html"
   ], 
   [
    "16030.html", 
    "http://www.4forums.com/political/gun-control-debates/56-second-amendment-5-print.html"
   ], 
   [
    "16031.html", 
    "http://www.4forums.com/political/gun-control-debates/56-second-amendment-4-print.html"
   ], 
   [
    "16032.html", 
    "http://www.4forums.com/political/gun-control-debates/56-second-amendment-6-print.html"
   ], 
   [
    "16033.html", 
    "http://www.4forums.com/political/gun-control-debates/56-second-amendment-3-print.html"
   ], 
   [
    "16034.html", 
    "http://www.4forums.com/political/gun-control-debates/56-second-amendment-2-print.html"
   ]
  ], 
  "identifier": 56
 }
]