[
 [
  [
   135011, 
   null, 
   "Missouri Mule", 
   "Hits a home run. All the bases were touched on the way as well.\n \n I thought this would be of interest to all real Americans here.\n ===================================\n CAN I HAVE MY COUNTRY BACK,\n PLEASE?\n \n By Don Feder\n Posted June 3, 2005\n \n It's times like these that I miss my country most.\n \n Holidays like Memorial Day, the Fourth of July and Thanksgiving remind me that once upon a time (long ago, in a galaxy far, far away), I had a country. It was called America.\n \n Perfect? Absolutely not. Nothing is in this world. But it represented something noble, brave and fine. Even if they couldn't quite articulate it, Americans understood what America meant - and cherished it. Once, we knew our nation's history. Once we spoke a national language. Once we controlled our borders. Once we knew what treason was and how to deal with it.\n \n But I'm getting ahead of myself.\n \n Of our three national holidays, for me, Memorial Day is the most significant. The Fourth of July celebrates our independence. Harkening back to our beginnings, Thanksgiving recalls our religious roots. But it's the blood and guts (the suffering and sacrifice) symbolized by Memorial Day, that made America possible. To make ideals real - and to protect and preserve them -- requires payment in the coin of strife and death.\n \n At the urging of my youngest son, I just finished watching the series \"Band of Brothers,\" based on the Stephen Ambrose history of one company of the 506th Regiment of the 101st Airborne, from Normandy to the Eagle's Nest. It's a stirring saga - all the more intense because it's told without the usual Hollywood hoopla.\n \n Each episode opens with commentary from the men whose story this is -- the veterans of Easy Company. Old men (most in their '80s) their faces are like a bomb-scarred landscape. There's an undercurrent of emotion in the quiet voices of men who went through hell so the rest of us have a safe, comfortable life as free men in a nation of free men.\n \n If I could speak with them, I'd ask: \"Are you happy with what your country has become? When you were a nervous kid waiting to jump out of a plane while shells peppered the sky, did you ever imagine it would come to this?\"\n \n Alienation - the sense of being severed from your roots. Waking up covered in bandages, in a hospital bed in a strange land (where no one understands a word you're saying) and wondering what happened to the world you once knew.\n \n Doom and gloom, you say? You wouldn't if you were paying attention.\n \n Less than 8 weeks ago, a brain-damaged woman was deliberately starved to death. (Her mother was not allowed to moisten her parched lips with drops of water.) A judge decided that hers was a life unworthy of life -- in the finest tradition of Nazi medicine.\n \n In Lexington, Massachusetts - where Minutemen first confronted the tyranny represented by redcoats - the father of a kindergartener was arrested recently for objecting to the indoctrination of his child in the homosexual lifestyle. (He had refused to leave his son's elementary school until administrators agreed to respect his parental rights.) Nothing is allowed to stand in the way of teaching kids the swellness of sodomy.\n \n In Nebraska, a federal judge overturned an amendment to the state constitution (enacted by over 70% of voters) recognizing the reality that a married couple is a man and a woman united in the bonds of matrimony - not two perverts playing house. Democracy and morality are dying together.\n \n On a cable TV reality-based show, a fat loudmouth with a ponytail and his dwarf companion repeatedly used a four-letter word to refer to Mother Teresa, who devoted her life to succoring the sick and dying. This loathsome display of vulgarity and disrespect is one example of the evil that passes for entertainment in 21st century America.\n \n Across the nation, pandering politicians rush to bestow benefits on illegal aliens - driver's licenses, in-state tuition at public colleges for their children, even workmen's compensation for injuries sustained at jobs they shouldn't have. We've become a people of misplaced compassion who are driven to show love for home invaders.\n \n In Massachusetts, Connecticut and elsewhere, bills advance to give addicts needles (supposedly to contain the spread of AIDS - a disease spawned by the Sexual Revolution). Thus have we gone from just-say-no, to just use a clean needle as you shoot junk into your arm and accelerate our evolution to Addict Nation. In California and a number of other Western states, physicians can prescribe pot - the drug that opens the gates to a life of addiction - for everything from the nausea accompanying chemotherapy to a bad back.\n \n Sometime in its current term, the U.S. Supreme Court will decide if Americans will be allowed to have public displays of the Ten Commandments (as long as they're constitutionally camouflaged with secular documents). It's reached the point where this is a real big deal - permitting any public acknowledgement of the ethos on which America was founded. The 9th Circuit Appeals Court nearly succeeded in taking \"one nation under God\" out of the Pledge of Allegiance. (Its decision was overturned by the Supreme Court - on a technicality.) What then of John Adams admonition: \"Our Constitution was made only for a moral and a religious people. It is wholly inadequate to the government of any other\"?\n \n And that's just an aerial overview of a nation in spiritual free-fall.\n \n If you approve of the above, read no further. You are hopeless, and deserve the fate which awaits you. On the other hand, if you hate what we've become in the past four decades, let me show you the not-so-distant past.\n \n Let me tell you what my America was like. For those of you under 40, it may come as a revelation.\n \n · In my America, there was prayer in the schools, crèches in public parks at Christmas (in fact, sales people actually wished you a \"Merry Christmas,\" instead of the generic, secularized \"happy holiday\"), and universal respect for individuals who were reverently referred to a \"men of the cloth.\" Hollywood celebrated faith with classics like \"The Song of Bernadette,\" \"Going My Way,\" \"The Ten Commandments\" and \"Heaven Knows, Mr. Allison.\"\n \n · Instead of half-naked, writhing celebrities and smirking savages with pistols larger than their brains, we had athletes, warriors, champions of justice and people of faith as heroes. (In terms of role models, we've gone from Audie Murphy to Edie Murphy.)\n \n · It was universally acknowledged that sex should be reserved for marriage. Those who lived together without the benefit of a marriage license weren't called a \"cohabitating couple.\" It was said they were \"shacking up\" or \"fornicating.\" The product of their \"illicit\" relationships weren't \"born out-of-wedlock;\" they were bastards (a judgment on the parents, not the children).\n \n · Pornography was limited to the shadow world - to paperbacks and magazines surreptitiously sold under the counter, or arriving in the mail in a plain-brown wrapper. Parents could be assured that children wouldn't encounter sex before the appropriate time. Society treated this volatile aspect of human nature cautiously and respectfully, not as a lurid national pastime that pervades every aspect of our lives. Virginity and fidelity were prized. Indiscretion, promiscuity and adultery were condemned.\n \n · Addiction too was limited to society's fringes, to social outcasts. Provisions were made for the treatment - or incarceration - of the unfortunates who became slaves to narcotics. But we didn't cater to them by facilitating their addiction, in the name of disease control or compassion.\n \n · Immigrants (who were here legally) were humbly grateful to reside in the greatest nation on earth. They understood that it was their responsibility to learn our language and history and identify with us - in short to Americanize. Instead of making demands, they accepted obligations.\n \n · In general, our society was more oriented toward responsibilities than rights. The mark of an American wasn't a hand outstretched, palm up, but a shoulder for bearing burdens. Instead of whiny demands, we gratefully accepted duties.\n \n · Crime was an anomaly. In small towns, people frequently went away for the weekend without locking their doors. Except for certain disreputable sections, the streets of our cities were safe for women, even at night Girls weren't abducted, raped and buried alive in landfills. The rights of the accused were minimal.\n \n · Expressions like \"no-fault divorce,\" \"casual sex,\" \"recreational drugs,\" \"undocumented workers,\" \"same-sex couples,\" \"trophy wives,\" \"gender-neutral,\" \"racial profiling,\" \"affirmative action,\" \"church-state separation,\" \"victimless crimes,\" \"sex-industry workers,\" \"symbolic speech,\" \"sexually transmitted diseases,\" \"non-judgmentalism,\" and \"revisionist history\" were blessedly unknown.\n \n · Homosexuality was treated as a grievous sin - or a mental disorder (depending on your perspective) - not as an innate characteristic conferring minority status. Before they became \"gay,\" homosexuals weren't hated; they were pitied. But they weren't allowed to turn the social order upside down to enhance their self-esteem.\n \n · The FBI. Boy Scouts, police, firemen, military and clergy were respected. Degenerates, parasites, misfits, mutants and whiners were not.\n \n · Americans knew their history, celebrated their past and revered their heroes. They weren't consumed with guilt for the mistakes of the past. Everyone knew that slavery was a great wrong and the Indians got a raw deal. We also knew that slavery was a universal institution and we weren't the first people to clash with an indigenous population. We understood that America's faults were minor and - on balance - the blessings we bestowed on humanity far outweighed our mistakes.\n \n · We weren't obsessed with our image abroad - whether foreigners loved us. We were willing to accept the animosity of the envious and the hatred of our enemies as part of the natural order. When the Japanese bombed Pearl Harbor, we didn't ask if we had brought this on ourselves by our ghastly treatment of a nation of ruthless warmongers. FDR didn't proclaim that our mission was to bring democracy to the Germans and Japanese (that was a side effect). It was to kill Japanese and Germans and to keep killing them until they stopped killing Chinese and Filipinos, and Jews and Poles and went back where they belonged. The idea of Americans agonizing over whether Mein Kampf was treated disrespectfully in a POW camp for Germans is ludicrous.\n \n · We weren't \"multi-cultural.\" There was one culture - Anglo-Saxon, Protestant - to which others were expected to conform. This didn't mean that Jews, Catholics, blacks or Asians, considered themselves less American than those of Mayflower descent. But it was universally acknowledged that America was founded on the heritage of Western civilization, as amplified and transmitted by England.\n \n My America worked. We saved civilization from repeated barbarian onslaughts. We were the arsenal of democracy - the workshop of the world. Our prosperity lifted boats across the globe. We were happy, self-confident and proud.\n \n And look at us now. We're like a dysfunctional family of 268 million, bordered by two oceans.\n \n Our salvation/resurrection lies in memory.\n \n In a novel of the end of the Roman Empire (\"The Last Legion\" by Valerio Manfredi), the boy emperor Romulus Augustus and his tutor are about to escape their barbarian captors. The elderly mentor stops to take a copy of the \"Aeneid\" (Virgil's epic poem of the founding of Rome).\n \n \"'That's useless weight,' protested Romulus.\"\n \n \"'On the contrary, it is the most precious thing I have in here, my son,' replied Ambrosinus. 'When we flee and leave everything behind us, the only resource that we can take with us is memory. The memory of our origins, of our roots, the stories of our ancestors. Only memory can allow us to be reborn. It doesn't matter where, it doesn't matter when. If we conserve the memory of our past greatness and the reasons we've lost it, we will rise again.'\"\n \n No one will give us back our country. We have to take it back - with our memory, our discernment, our capacity for struggle and sacrifice and our sheer will.\n \n These are thoughts to ponder while you're waiting to jump out of a plane onto the battlefield of the culture war.\n This article originally was published by GrasstopsUSA.com\n \n http://www.donfeder.com/", 
   {
    "post_info": {
     "post_title": "Can I Have My Country Back,"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1118335200.0
  ], 
  [
   135018, 
   null, 
   "gamehuis", 
   "I just love it when people think they're the last bastion of decency and morality...", 
   {}, 
   135011, 
   null, 
   1118336460.0
  ], 
  [
   135019, 
   null, 
   "daewoo", 
   "Wow, is this your brother? He, too, is desperatly clinging to a past that is dead and buried, and was not as great as he remembers it. \n \n the world has moved on. Move with it.\n \n At one time we all rode around on horses and shot indians. Great fun, but I don't think that going back is an option", 
   {}, 
   135011, 
   null, 
   1118336640.0
  ], 
  [
   135038, 
   null, 
   "Hydra", 
   "Wow, is this your brother? He, too, is desperatly clinging to a past that is dead and buried, and was not as great as he remembers it. \n \n the world has moved on. Move with it.\n \n At one time we all rode around on horses and shot indians. Great fun, but I don't think that going back is an option\n\n \n Daewoo;\n \n I agree with you; life goes on and changes around us. Sadly, people donot know how to adapt to the times, and recognize that the law protects all people.", 
   {}, 
   135019, 
   null, 
   1118338500.0
  ], 
  [
   135046, 
   null, 
   "Missouri Mule", 
   "I guess we will soon find out who the real Americans are here. We already have a preview.", 
   {}, 
   135038, 
   null, 
   1118338980.0
  ], 
  [
   135054, 
   null, 
   "daewoo", 
   "I guess we will soon find out who the real Americans are here. We already have a preview.\n\n \n \n If real american equates to idealistc fool stuck in the past, I will pass thanks.", 
   {}, 
   135046, 
   null, 
   1118339820.0
  ], 
  [
   135058, 
   null, 
   "Hydra", 
   "I guess we will soon find out who the real Americans are here. We already have a preview.\n\n \n Let me guess; unlike my husband, you were not at the Pentagon when the plane hit it on 9/11, and he had to answer the call to aid many out of the building, with no consideration given to how he was placing himself at risk, as a member of the 3rd company to answer the call. Unlike myself, you were not at one of the hospitals triaging people as they came into the hospital in multiple buses, and never giving a thought as to there political belifs, faith, etc. Just seeing many people in need of medical care.\n \n You pass judgement on people you donot even know, and think you are the ONLY American worthy of the title.", 
   {}, 
   135046, 
   null, 
   1118340300.0
  ], 
  [
   135060, 
   null, 
   "Hydra", 
   "If real american equates to idealistc fool stuck in the past, I will pass thanks.\n\n \n Imagine being stuck in that past, and untrained medical personnel not knowing how to perform the Heimlich Manuever, Mouth-to-Mouth, or CPR.", 
   {}, 
   135054, 
   null, 
   1118340480.0
  ], 
  [
   135064, 
   null, 
   "Dzeron", 
   "This guy is whining about how the last vestiges of Theocracy are withering away. \"I had a country\" really means \"I am part of the many-headed tyrant, the Majority, that is losing its despotic powers.\" Look at this BS:\n \n \n· We weren't \"multi-cultural.\" There was one culture - Anglo-Saxon, Protestant - to which others were expected to conform.\n\n \n Nativist totalitiarian swill, nothing else.\n \n The analogy of the Roman Empire at the end made me laugh. Guess what? It is the totalitarian Neocons who threaten to turn this Republic into an Empire and send us on the real cultural decline. Sure, when the power of the American Empire is broken 1000 years from now, people will carry books of the fading memory of Liberal Democracy that the Neocons destroyed.\n \n The half-freedom we have had in this country is what has made us half-great. We should not go on a moronic pursuit to \"return to the past\" for the past is the time of less freedom - especially when the Neocons only show signs of mixing the moralism of the past with the mixed economy of the present.\n \n If anything, we should be thankful that the civil libertarians had any influence on the recent developments of American history.", 
   {
    "unicode_changes_made": true
   }, 
   135046, 
   null, 
   1118340900.0
  ], 
  [
   135076, 
   null, 
   "Becca", 
   "In a novel of the end of the Roman Empire (\"The Last Legion\" by Valerio Manfredi), the boy emperor Romulus Augustus and his tutor are about to escape their barbarian captors. The elderly mentor stops to take a copy of the \"Aeneid\" (Virgil's epic poem of the founding of Rome).\n \n Great. A novel as a historical source. Are you aware of any late Roman history? \"Romanitas\" was the cultural currency of power for at least another 300 years, and Romulus Augustus had been put on the throne by the barbarians, and had no need to flee them. They let him live with relatives and gave him generous sums of money to live on. Oh wait, I guess its \"revisionism\" that came up with that, it must be untrue. \n Frankly, that use of history was so dishonest and stupid it completely discredits anything else this man has to say.", 
   {
    "unicode_changes_made": true
   }, 
   135064, 
   null, 
   1118342280.0
  ], 
  [
   135425, 
   null, 
   "Platypus", 
   "I'm not the ONLY real American but I certainly am firmly in their number. I'm not much of a flag waver but I know where my loyalties lie and it certainly is not with the maggot infested likes that comprise the Democratic party. The liberals who have dragged this country down into the cesspool of moral relativism, mindless materialism and personal aggrandizement are only in it for themselves. They are in no way, shape or form REAL Americans.\n\n Real Americans recognize that political diversity is inseparable from freedom of speech, and that both are necessary to prevent dictatorship. Therefore, you are the one who is being un-American. This is as much my country as yours, I have as much right to shape it as you do, I'm better at it and I'm going to outlive you. Get used to the idea that you're the one getting off the America bus as it rolls forward.", 
   {}, 
   135058, 
   null, 
   1118410500.0
  ], 
  [
   135433, 
   null, 
   "Truthsayer", 
   "I guess we will soon find out who the real Americans are here. We already have a preview.\n\n \n Mr. Missouri, who gets to decide who the \"Real\" Americans are here? Can I sign up? No wait....that would be unAmerican of me. Nevermind. emoticon_rolleyes \n \n :p :p", 
   {}, 
   135046, 
   null, 
   1118416620.0
  ], 
  [
   135434, 
   null, 
   "Truthsayer", 
   "Real Americans recognize that political diversity is inseparable from freedom of speech, and that both are necessary to prevent dictatorship. Therefore, you are the one who is being un-American. This is as much my country as yours, I have as much right to shape it as you do, I'm better at it and I'm going to outlive you. Get used to the idea that you're the one getting off the America bus as it rolls forward.\n\n \n Welcome Mr. (Ms.?) Platypus. I can see that you and Mr. Missouri are going to be a lot of fun. Just wait until you meet Voice of Reason. You're not going to believe it.\n \n Actually, Mr. Missouri is quite in tune (except, of course, for the obvious narcism,) should you take the time to read some of his other posts.", 
   {}, 
   135425, 
   null, 
   1118416980.0
  ], 
  [
   135437, 
   null, 
   "Platypus", 
   "Welcome Mr. (Ms.?) Platypus. I can see that you and Mr. Missouri are going to be a lot of fun. Just wait until you meet Voice of Reason. You're not going to believe it.\n\n Thanks, but we've met. They both know the feel of my foot on their behinds quite well.", 
   {}, 
   135434, 
   null, 
   1118417880.0
  ], 
  [
   135455, 
   null, 
   "Becca", 
   "\n Across the nation, pandering politicians rush to bestow benefits on illegal aliens - driver's licenses, in-state tuition at public colleges for their children, even workmen's compensation for injuries sustained at jobs they shouldn't have. We've become a people of misplaced compassion who are driven to show love for home invaders.\n \n Ok, the compensation idea is absolutely ridiculous. Some companies already knowingly take on illegal workers as they are cheaper in several ways. One of these is lower wages, another is lower safety requirements: illegals are not in a position to complain about unsafe condition. Not having to follow safety requirements is cheaper for the company. Ok, so illegals can undercut other workers already. Now, lets make it so companies don't have to compensate them for injures, making them potentially cheaper yet again. This isn't going to discourage hiring illegal workers, absolving companies from paying compensation actually gives them an incentive to hire the workers.", 
   {
    "unicode_changes_made": true
   }, 
   135437, 
   null, 
   1118421660.0
  ], 
  [
   135458, 
   null, 
   "Adept", 
   "The entire opening post is so much bigoted, homophobic, xenophobic, insubstantial trumped up tripe.\n \n People who support those kinds of opinions are a blight upon humanity. The poster has the gall to liken the judges presiding on the Terri Schiavo case to Nazis, before diving neck deep into a rant on how terrible the gays and the foreigners are, how the outcast fringe elements of society should be eliminated...\n \n Absolutely mind boggelingly stupid.", 
   {}, 
   135455, 
   null, 
   1118422440.0
  ], 
  [
   135487, 
   null, 
   "Missouri Mule", 
   "The entire opening post is so much bigoted, homophobic, xenophobic, insubstantial trumped up tripe.\n \n People who support those kinds of opinions are a blight upon humanity. The poster has the gall to liken the judges presiding on the Terri Schiavo case to Nazis, before diving neck deep into a rant on how terrible the gays and the foreigners are, how the outcast fringe elements of society should be eliminated...\n \n Absolutely mind boggelingly stupid.\n\n \n He's just wanting the America that we used to have when people were decent to one another and where the mindless and un American types are not controlling events. All real Americans want the same thing. To those who want to live in a cesspool, there are other places to live. I invite them to go there.", 
   {}, 
   135458, 
   null, 
   1118425320.0
  ], 
  [
   135514, 
   null, 
   "Truthsayer", 
   "He's just wanting the America that we used to have when people were decent to one another and where the mindless and un American types are not controlling events. All real Americans want the same thing. To those who want to live in a cesspool, there are other places to live. I invite them to go there.\n\n \n I, myself, wouldn't be opposed to going back to simpler times. When children addressed their elders respectfully. With the occassional \"thump\" sound of a baseball hitting the side of the house rather than the constant \"rat-a-tat-tat\" coming from nonstop video games.\n \n Back when people would pull over and help a distressed motorist without fear from being harmed. Back to the world before gangsta hip-hop and the glorification of urban violence.\n \n But there is only one thing in life that we can depend on and that is change. I may not always like the changes but I applaud our historic ability to adapt to our never ending changes and the freedom to allow those changes. Some would prefer that we lose those freedoms. But I do not want to go back to the days of segregation, oppression, and McCarthy like mentality. I think one can be a \"Real American\" without subscribing to such absurdities.\n \n I keep telling myself this is just a phase the nation is going through but by all appearances, hatred, oppression, bigotry is magnifying and is here to stay. I truly feel sorry for the generations of my decendents.\n \n Or, I have to wonder, if maybe these faults of ours didn't always exist and were just swept under the rug because decent people didn't talk about them or if that we are more aware of them these days due to the 999 television channels starving for negative news to present to us each day in our living rooms.\n \n I am all for positive social change. For this, I have been labeled a liberal on more than one occassion (imagine that! emoticon_rolleyes .) I can live with that if I have to. But the only social changes I see are mostly of the negative type and that has me concerned as well. But I see this coming from both sides. I see the liberals wanting a politically correct, feel good, \"pretend all is well\" society and I see the ultra-conservatives wanting a crew-cut, McCarthy style, oppressive society. I detest one as much as the other.\n \n Common sense tells us the answer is somewhere in between. Common sense seems to be lacking these days. And that's the truth because I am the Truthsayer.", 
   {}, 
   135487, 
   null, 
   1118427300.0
  ], 
  [
   135533, 
   null, 
   "Platypus", 
   "He's just wanting the America that we used to have when people were decent to one another and where the mindless and un American types are not controlling events.\n\n Spot the irony.", 
   {}, 
   135487, 
   null, 
   1118428440.0
  ], 
  [
   135535, 
   null, 
   "Adept", 
   "He's just wanting the America that we used to have when people were decent to one another\n\n \n Yeah, so long as you were white, male, middle class, protestant, and straight. \n \n \nand where the mindless and un American types are not controlling events.\n\n \n Un-American types? Mindless? Yes, heaven forbid we should yearn for equality and a life free from bigoted hatred.\n \n \nAll real Americans want the same thing. To those who want to live in a cesspool, there are other places to live. I invite them to go there.\n\n \n Yeah, lets put all those un-American types in the gulags where they belong! All those gays, muslims, jews, hindus, blacks and hispanics can go too!\n \n We don't want their kind around here!\n \n emoticon_rolleyes", 
   {}, 
   135487, 
   null, 
   1118428680.0
  ], 
  [
   135545, 
   null, 
   "Missouri Mule", 
   "I, myself, wouldn't be opposed to going back to simpler times. When children addressed their elders respectfully. With the occassional \"thump\" sound of a baseball hitting the side of the house rather than the constant \"rat-a-tat-tat\" coming from nonstop video games.\n \n Back when people would pull over and help a distressed motorist without fear from being harmed. Back to the world before gangsta hip-hop and the glorification of urban violence.\n \n But there is only one thing in life that we can depend on and that is change. I may not always like the changes but I applaud our historic ability to adapt to our never ending changes and the freedom to allow those changes. Some would prefer that we lose those freedoms. But I do not want to go back to the days of segregation, oppression, and McCarthy like mentality. I think one can be a \"Real American\" without subscribing to such absurdities.\n \n I keep telling myself this is just a phase the nation is going through but by all appearances, hatred, oppression, bigotry is magnifying and is here to stay. I truly feel sorry for the generations of my decendents.\n \n Or, I have to wonder, if maybe these faults of ours didn't always exist and were just swept under the rug because decent people didn't talk about them or if that we are more aware of them these days due to the 999 television channels starving for negative news to present to us each day in our living rooms.\n \n I am all for positive social change. For this, I have been labeled a liberal on more than one occassion (imagine that! emoticon_rolleyes .) I can live with that if I have to. But the only social changes I see are mostly of the negative type and that has me concerned as well. But I see this coming from both sides. I see the liberals wanting a politically correct, feel good, \"pretend all is well\" society and I see the ultra-conservatives wanting a crew-cut, McCarthy style, oppressive society. I detest one as much as the other.\n \n Common sense tells us the answer is somewhere in between. Common sense seems to be lacking these days. And that's the truth because I am the Truthsayer.\n\n \n Just for the record, I am not praising McCarthy or segretation. I had no use for either. But one would have had to lived in those times to know the difference between then and now when anything goes, the language is filthy, crime is rampant and respect for one's elders are gone. \n \n I remember when the Dodgers were in Brooklyn, when Coke cost 5 cents and comic books were a dime. A pleasant day was going into a small town nearby and looking at the latest comic books and then going to the ice cream parlor for a ice cream soda. In those days, they would box your groceries and take them out to your car. There was no rushing about. A movie was 25 cents and popcorn a nickle. Movies changed every two days at the local movie and all were \"G\" rated. Silly but not the blatant filth that passes for entertainment today. \n \n People respected the president. Eisenhower was a man of integrity and respect. We knew which side we were on and no one would think of speaking ill of the U.S. We had gone a long way to eliminating tyranny in the world having defeated Germany and Japan. We actually anticipated the new car models and when a neighbor got a new car everyone wanted to see it and smell the new interior. People actually ate together at dinner. We watched decent programming on television with Ozzie and Harriet, the Show of Shows, with Sid Ceasar and Imogene Coca. (their sidekick Howard Morris just died recently.) I love Lucy was still going strong. Who can forget her on the factory floor making those chocolate candies? A scandal was the $64,000 Question. Back in those days, we went to church and had a certain routine and people respected other people's rights and property. I never used to lock my cars or our house. But we never had anything stolen. \n \n Those days were better as anyone who lived there remembers well. What we have today is liberalism gone wild with its political correctness and a breakdown of society. The cities are unlivable; traffic jams everywhere. We have more but are enjoying it less. Let me have the America of my youth anytime.", 
   {}, 
   135514, 
   null, 
   1118429160.0
  ], 
  [
   135547, 
   null, 
   "Missouri Mule", 
   "Yeah, so long as you were white, male, middle class, protestant, and straight. \n \n Un-American types? Mindless? Yes, heaven forbid we should yearn for equality and a life free from bigoted hatred.\n \n \n Yeah, lets put all those un-American types in the gulags where they belong! All those gays, muslims, jews, hindus, blacks and hispanics can go too!\n \n We don't want their kind around here!\n \n emoticon_rolleyes\n\n \n You're the one naming names. I've simply said that real Americans should live in America. Those who hate America and tear it down should leave. That is a reasonable request. Would you allow someone to live in your house to would destroy you and your family and burn your house down?", 
   {}, 
   135535, 
   null, 
   1118429280.0
  ], 
  [
   135555, 
   null, 
   "Adept", 
   "You're the one naming names.\n\n \n No, the original post clearly labels the only acceptable culture as being white and protestant. It makes it plain that other cultures are inferior, that homosexuals are greivous sinners or mentally disabled (and indeed invented the AIDS virus, apparently).\n \n Sheesh, gimme a break.\n \n \nI've simply said that real Americans should live in America.\n\n \n Yes you have. I would say that real Americans live in Canada and Mexico as well. And that all decent people should revile such narrow, poorly informed, biased, selective, revisionist and bigoted views as expressed in the opening post.\n \n \nThat is a reasonable request. Would you allow someone to live in your house to would destroy you and your family and burn your house down?\n\n \n Arguing from a flawed analogy. The USA is not my house. In fact, no analogy is actually needed.", 
   {}, 
   135547, 
   null, 
   1118430240.0
  ], 
  [
   135573, 
   null, 
   "Jo Bennett", 
   "He's just wanting the America that we used to have when people were decent to one another and where the mindless and un American types are not controlling events. All real Americans want the same thing. To those who want to live in a cesspool, there are other places to live. I invite them to go there.\n\n \n Hitler just wanted the Germany they used to have...where the un-aryan types are not controlling events.\n \n Am I the only one seeing this parallel rather strongly in a lot of MM's posts?", 
   {}, 
   135487, 
   null, 
   1118432040.0
  ], 
  [
   135579, 
   null, 
   "Dzeron", 
   "I guess we will soon find out who the real Americans are here. We already have a preview.\n\n \n A real American is not some reactionary fascist who bemoans the freedom that \"them thar liberals\" are advancing.", 
   {}, 
   135046, 
   null, 
   1118432880.0
  ], 
  [
   135581, 
   null, 
   "Truthsayer", 
   "Hitler just wanted the Germany they used to have...where the un-aryan types are not controlling events.\n \n Am I the only one seeing this parallel rather strongly in a lot of MM's posts?\n\n \n Not necessarily in regard to Mr. Missouri, (as I find him on most occassion to be well informed and sensibly focused,) there are people on forums such as these, I have noticed, that do voice ideologies in regard to a plethra of societie's make-up, that doesn't adhere to their personal views of how the world should be, that are reminescent to words of Hitler and Mussolini. And they often cloak theirselves in Old Glory or an ACLU banner. They come from both sides of the tracks. Do not be fooled.\n \n Being only to imagine in my minds-eye as to how they might look like in person, I often visualize them at a keyboard, head shaved, with a swastika draping their political alter. But imagination does have a tendency to expand.\n \n So I can understand your curiosity in the quote above. But in reality, these out of touch extremists are usually just old harmless, disgruntled humans with nothing better to do than :xcensored and moan on an internet forum all day (I stand guilty :p ) and I doubt they will be shipping off any \"liberals\" to the gas chambers anytime soon.\n \n We are all so insignificant in the grand scheme of things. Forums like these are about the only thing we have to be able to let off some steam.", 
   {}, 
   135573, 
   null, 
   1118433060.0
  ], 
  [
   135704, 
   null, 
   "gnojek", 
   "Wow, amazing.\n \n Missouri Mule is so much like Michael Moore, they even want their country back.\n \n Dude! Where's My Country?\n \n Let's see, MM MM , yeah, makes sense.\n \n He he.", 
   {}, 
   135581, 
   null, 
   1118448000.0
  ], 
  [
   135713, 
   null, 
   "gnojek", 
   "Those who hate America and tear it down should leave. That is a reasonable request. \n\n \n C Ya!\n \n Do send a postcard from wherever it is you land!\n \n The original thread is indeed HATING america.\n \n You hate the america of today.\n You are an america hater.\n You hate america.\n \n Love it or leave it!\n \n \nHe's just wanting the America that we used to have when people were decent to one another \n\n God, if we can only bring back lynchings!\n I'll bet you'd stay here then!", 
   {}, 
   135547, 
   null, 
   1118448720.0
  ], 
  [
   135808, 
   null, 
   "Missouri Mule", 
   "No, the original post clearly labels the only acceptable culture as being white and protestant. It makes it plain that other cultures are inferior, that homosexuals are greivous sinners or mentally disabled (and indeed invented the AIDS virus, apparently).\n \n Sheesh, gimme a break.\n \n Arguing from a flawed analogy. The USA is not my house. In fact, no analogy is actually needed.\n\n \n I take it you are not familiar with the \"Prostestant Work Ethic\" which is well known in American history. \n \n The analogy was apt. It doesn't matter where you live. The principles are the same everywhere. America should be reserved for real Americans or those who aspire to be real Americans. Americans in name only ought to pack their bags and get out. Of course that is only my personal opinion and I'm sure that there are those who feel that anyone who holds citizenship here and wants to come here and then trash America is entitled to live here. But I wasn't brought up to believe that one ought to defecate in their own dwelling.", 
   {}, 
   135555, 
   null, 
   1118473620.0
  ], 
  [
   135809, 
   null, 
   "Missouri Mule", 
   "C Ya!\n \n Do send a postcard from wherever it is you land!\n \n The original thread is indeed HATING america.\n \n You hate the america of today.\n You are an america hater.\n You hate america.\n \n Love it or leave it!\n \n God, if we can only bring back lynchings!\n I'll bet you'd stay here then!\n\n \n That's a perfect example of a strawman argument. I never argued for nor did the author argue for bringing back lynchings. Now let me ask you a question. When did you stop beating your wife? Do you now see how ridiculous your question was?", 
   {}, 
   135713, 
   null, 
   1118473740.0
  ], 
  [
   135849, 
   null, 
   "Adept", 
   "I take it you are not familiar with the \"Prostestant Work Ethic\" which is well known in American history.\n\n \n No, I'm not. Living in Australia means that the history of the USA takes a back seat to a lot of other interests.\n \n \nThe analogy was apt. It doesn't matter where you live. The principles are the same everywhere.\n\n \n No, it wasn't. No-one 'owns' the USA. It is not your house, nor is it my house, or anyone elses house. Thus, no one can own it and no one can be a guest in it. So we can't have people 'tearing it down', all we can have is differing opinions.\n \n \n \nAmerica should be reserved for real Americans or those who aspire to be real Americans. Americans in name only ought to pack their bags and get out.\n\n \n 1 - I would say that real Americans live in Canada and Mexico as well. And that all decent people should revile such narrow, poorly informed, biased, selective, revisionist and bigoted views as expressed in the opening post.\n \n 2 - Given your dis-satisfaction with the USA today, I would say you are attempting to tear the USA down, and aspire to be some bigoted and narrow minded dinosaur from the past. Given your own logic, mayhap you should consider moving.", 
   {}, 
   135808, 
   null, 
   1118480520.0
  ], 
  [
   135853, 
   null, 
   "Nurglitch", 
   "We've become a people of misplaced compassion who are driven to show love for home invaders.\n Good point, when did America become a bunch of hippy christians?\n \n On a side note, I find it amusing that Americans are supposed to follow the example of a fictional character whose 'heritage' is the Aeneid, itself a piece of propaganda produced to give religious sanction to the gov't of the dictator Octavius Caesar - who took over after Republican rule crumbled under the excesses of power struggles between wealthy aristocrats.\n \n America, despite the strident accusations of clueless college kids, is no empire and remains a Republic.", 
   {
    "unicode_changes_made": true
   }, 
   135849, 
   null, 
   1118482560.0
  ], 
  [
   135891, 
   null, 
   "Missouri Mule", 
   "No, I'm not. Living in Australia means that the history of the USA takes a back seat to a lot of other interests.\n \n No, it wasn't. No-one 'owns' the USA. It is not your house, nor is it my house, or anyone elses house. Thus, no one can own it and no one can be a guest in it. So we can't have people 'tearing it down', all we can have is differing opinions.\n \n 1 - I would say that real Americans live in Canada and Mexico as well. And that all decent people should revile such narrow, poorly informed, biased, selective, revisionist and bigoted views as expressed in the opening post.\n \n 2 - Given your dis-satisfaction with the USA today, I would say you are attempting to tear the USA down, and aspire to be some bigoted and narrow minded dinosaur from the past. Given your own logic, mayhap you should consider moving.\n\n \n How would you like for me to start slamming Australia? I can do that. I could remind you that you would today be speaking Japanese if not for America. \n \n BTW, don't bother coming to America. We don't need your carping here either.", 
   {}, 
   135849, 
   null, 
   1118505180.0
  ], 
  [
   135900, 
   null, 
   "Adept", 
   "How would you like for me to start slamming Australia? I can do that. I could remind you that you would today be speaking Japanese if not for America.\n\n \n Am I slamming the USA? I don't recall slamming the USA at all. As far as I recall, I've only been slamming the narrow, poorly informed, biased, selective, revisionist and bigoted views as expressed in the opening post.\n \n Sure, we might be speaking Japanese right now. Although I believe any mention to a planned invasion of Australia is about as credible as the hypothetical plans to invade the USA were. Which is to say, not at all. \n \n Not only is this purely speculative, it is also innacurate and completely irrelevant. I fully respect the actions of all nations in WWII to halt the Nazis and their allies. Which really highlights the irony of the opening post, whose views closely match the early works of the Nazi propaganda machine. The very foes we all fought to stop, you seek to emulate.\n \n \nBTW, don't bother coming to America. We don't need your carping here either.\n\n \n I've been there, and thankfully found it very much a forward thinking country largely free from the opinions held by the original poster.", 
   {}, 
   135891, 
   null, 
   1118506140.0
  ], 
  [
   135913, 
   null, 
   "Obvious Child", 
   "Frankly, if it wasn't for good ol' Uncle Joe and the Soviets then it would be far more likely that Australia would be speaking Japanese. And Britain would be speaking German. But that doesn't mean I have to support Communism. The Soviets were the lesser of two evils, albeit only in that they didn't actually try and conquer us. I also think that Churchill's record is dodgy. But these people are needed. Defending the world from tyranny doesn't remove the need to reform.\n \n Oh, and saying that saying you don't own the US isn't slamming the US. What are you talking about?", 
   {}, 
   135900, 
   null, 
   1118507940.0
  ], 
  [
   135941, 
   null, 
   "Adept", 
   "Frankly, if it wasn't for good ol' Uncle Joe and the Soviets then it would be far more likely that Australia would be speaking Japanese. And Britain would be speaking German.\n\n \n Possibly. And as I said, I fully respect the sacrifices made by all nations in WWII.\n \n \nOh, and saying that saying you don't own the US isn't slamming the US. What are you talking about?\n\n \n The USA is not the property of any individual, or of any single political party or supporters thereof. It is not anyones 'house'. The closest analogy would be the Town Hall, where everyone in the town has an equal right to be there. The USA cannot be related to a persons private home. The analogy is critically flawed.", 
   {}, 
   135913, 
   null, 
   1118512980.0
  ], 
  [
   135996, 
   null, 
   "lord tammerlain", 
   "The good old days\n \n 1. When women couldnt vote, when men took responsiblity and women knew their place was in the home taking care of the childern.\n \n 2. When Indians were brutal savages and killed to protec the women and old folk\n \n 3. When African Americans were called ******* and were slaves. They didnt have no high falutin notions of being equals to white anglo saxons protestants who made America great.\n \n 4. When the protitutes were kept in brothels, and treated with scorn.\n \n 5. When the FBI, kept an eye out for subverisves like African Americans who wanted equal rights.\n \n 6. When clergy could molest little boys and the little boys would keep quiet.\n \n 7. When a man could beat his wife for disrespect and not worry about the police.\n \n 8. When drinking and driving was not a concern by the police.\n \n 9. When Mexicans were treated with disrespect and used for backbreaking work at subsitance(sp) wages, allowing the WASP farm owners to make a larger profit.\n \n 10. When America meant White anglo saxon protestant.", 
   {}, 
   135941, 
   null, 
   1118523000.0
  ], 
  [
   136024, 
   null, 
   "Obvious Child", 
   "Possibly. And as I said, I fully respect the sacrifices made by all nations in WWII.\n \n \n \n The USA is not the property of any individual, or of any single political party or supporters thereof. It is not anyones 'house'. The closest analogy would be the Town Hall, where everyone in the town has an equal right to be there. The USA cannot be related to a persons private home. The analogy is critically flawed.\n\n \n Sorry, neither of those were aimed at you, but at Missouri. I see its pretty unclear....\n And frankly, the sacrifices made by the USSR are slightly soiled by the fact that they used it to expand their empire, not to mention the rape, pillage and bad treatment of prisoners. But obviously many died and their sacrifice should be respected.", 
   {}, 
   135941, 
   null, 
   1118526420.0
  ], 
  [
   136120, 
   null, 
   "Missouri Mule", 
   "Am I slamming the USA? I don't recall slamming the USA at all. As far as I recall, I've only been slamming the narrow, poorly informed, biased, selective, revisionist and bigoted views as expressed in the opening post.\n \n Sure, we might be speaking Japanese right now. Although I believe any mention to a planned invasion of Australia is about as credible as the hypothetical plans to invade the USA were. Which is to say, not at all. \n \n Not only is this purely speculative, it is also innacurate and completely irrelevant. I fully respect the actions of all nations in WWII to halt the Nazis and their allies. Which really highlights the irony of the opening post, whose views closely match the early works of the Nazi propaganda machine. The very foes we all fought to stop, you seek to emulate.\n \n I've been there, and thankfully found it very much a forward thinking country largely free from the opinions held by the original poster.\n\n \n Gimme a break. No way you could have held off a Japanese invasion of Australia. You owe your independence to the lives of Americans who bled and died for your freedom.", 
   {}, 
   135900, 
   null, 
   1118538660.0
  ], 
  [
   136121, 
   null, 
   "Missouri Mule", 
   "Frankly, if it wasn't for good ol' Uncle Joe and the Soviets then it would be far more likely that Australia would be speaking Japanese. And Britain would be speaking German. But that doesn't mean I have to support Communism. The Soviets were the lesser of two evils, albeit only in that they didn't actually try and conquer us. I also think that Churchill's record is dodgy. But these people are needed. Defending the world from tyranny doesn't remove the need to reform.\n \n Oh, and saying that saying you don't own the US isn't slamming the US. What are you talking about?\n\n \n That's nonsense. Without the U.S. Hitler would have destroyed the USSR. Ever hear of Lend Lease?", 
   {}, 
   135913, 
   null, 
   1118538780.0
  ], 
  [
   136173, 
   null, 
   "Adept", 
   "Gimme a break. No way you could have held off a Japanese invasion of Australia. You owe your independence to the lives of Americans who bled and died for your freedom.\n\n \n 1 - There were no definate plans for an invasion of Australia\n \n 2 - How is this even remotely relevant?", 
   {}, 
   136120, 
   null, 
   1118557440.0
  ], 
  [
   136182, 
   null, 
   "Missouri Mule", 
   "1 - There were no definate plans for an invasion of Australia\n \n 2 - How is this even remotely relevant?\n\n \n It's relative because of Aussies like yourself coming on here to trash traditional patriotic American values. I'm not going to sit still for it.\n \n Australia was a goner without American involvement. Admit it.", 
   {}, 
   136173, 
   null, 
   1118561280.0
  ], 
  [
   136183, 
   null, 
   "Symbiote", 
   "Australia was a goner without America, \n \n therefore bigoted XXXXXX should control America.\n \n Nice argument Mule, you've really outdone yourself this time.\n \n \nWithout the U.S. Hitler would have destroyed the USSR.\n\n \n And all True Americans are justly proud that their aid allowed the Communists to rule much of the world for 40 years.", 
   {}, 
   136182, 
   null, 
   1118561940.0
  ], 
  [
   136196, 
   null, 
   "Missouri Mule", 
   "Australia was a goner without America, \n \n therefore bigoted XXXXXX should control America.\n \n Nice argument Mule, you've really outdone yourself this time.\n \n And all True Americans are justly proud that their aid allowed the Communists to rule much of the world for 40 years.\n\n \n I knew you would figure out a way to criticize America for helping the Soviets to defeat Hitler. We were damned if we do and damned if we don't. What I do know is that an inconsequential country like Australia wouldn't have been able to do anything with either Hitler or Stalin. But we did, with American blood and treasure. We should have let Tojo have you for all I care. Then you would really have something to bellyache about.", 
   {}, 
   136183, 
   null, 
   1118564220.0
  ], 
  [
   136198, 
   null, 
   "Symbiote", 
   "I knew you would figure out a way to criticize America for helping the Soviets to defeat Hitler.\n\n \n What do you mean criticise? You should be proud America allowed Uncle Joe to triumph. All True Americans are - are you some kind of hand-wringing liberal?", 
   {}, 
   136196, 
   null, 
   1118564640.0
  ], 
  [
   136201, 
   null, 
   "Adept", 
   "It's relative because of Aussies like yourself coming on here to trash traditional patriotic American values. I'm not going to sit still for it.\n\n \n 1 - You do realise that America is a continent, right? And that it incudes Canada and Mexico as north american countries? Please, try and get it right. You are referring to the USA, not America.\n \n 2 - Tradtional patriotic US virtues? If the narrow, poorly informed, biased, selective, revisionist and bigoted views as expressed in the opening post are indicative of traditional patriotic US views, then the world is a better place without them.\n \n I'm still not getting the link. The USA fought in WWII. Thus it has the right to become like Nazi germany?\n \n \nAustralia was a goner without American involvement. Admit it.\n\n \n I will, as soon as you admit that the USA would still be under English rule were it not for the French.\n \n The bottom line is, it doesn't matter who saved whose XXX in WWII. What matters is that the views expressed in the opening post are narrow, poorly informed, biased, selective, revisionist and bigoted. Who fought and who died for what causes doesn't change that.", 
   {}, 
   136182, 
   null, 
   1118565960.0
  ], 
  [
   136206, 
   null, 
   "Obvious Child", 
   "That's nonsense. Without the U.S. Hitler would have destroyed the USSR. Ever hear of Lend Lease?\nPossibly. But the point is that without the Soviets America would not have fought against the Nazis, as Britain would have been conquered and there would be no chance of Americans being able to fight Nazi Europe on its own. The Nazis, undefeated, would have threatened America from the east as Japan did from the west and America would have been too busy protecting itself to bother about what REAL AMERICANS obviously consider an 'incosequential country'.", 
   {}, 
   136121, 
   null, 
   1118570820.0
  ], 
  [
   136282, 
   null, 
   "Missouri Mule", 
   "What do you mean criticise? You should be proud America allowed Uncle Joe to triumph. All True Americans are - are you some kind of hand-wringing liberal?\n\n \n You're talking gibberish now. I have better things to do with my time.", 
   {}, 
   136198, 
   null, 
   1118601060.0
  ], 
  [
   136290, 
   null, 
   "Mucusaur", 
   "Is their any country who doesn't owe its freedom to The United States?", 
   {}, 
   136282, 
   null, 
   1118601960.0
  ], 
  [
   136292, 
   null, 
   "Missouri Mule", 
   "Is their any country who doesn't owe its freedom to The United States?\n\n \n Probably not. It is no accident that the thugs, gangsters and terrorists of the world have the U.S. in its gun sights. They know that we are the sole power that keeps them from running the insane asylum called the earth.", 
   {}, 
   136290, 
   null, 
   1118602080.0
  ], 
  [
   136294, 
   null, 
   "Mucusaur", 
   "(except of course those thugs, gangsters and terrorists that were helped by the US)", 
   {}, 
   136292, 
   null, 
   1118602200.0
  ], 
  [
   136297, 
   null, 
   "Missouri Mule", 
   "(except of course those thugs, gangsters and terrorists that were helped by the US)\n\n \n I didn't say we were perfect. We did business with Stalin in WWII knowing full well he was a mass murderer but Hitler was worse. We have to make choices even though the options are less than ideal.", 
   {}, 
   136294, 
   null, 
   1118602320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Can I Have My Country Back,", 
  "url": "http://www.4forums.com/political/society-debates/5600-can-i-have-my-country-back.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 5600, 
  "discussion_files": [
   [
    "26294.html", 
    "http://www.4forums.com/political/society-debates/5600-can-i-have-my-country-back-print.html"
   ], 
   [
    "26295.html", 
    "http://www.4forums.com/political/society-debates/5600-can-i-have-my-country-back-4-print.html"
   ], 
   [
    "26296.html", 
    "http://www.4forums.com/political/society-debates/5600-can-i-have-my-country-back-3-print.html"
   ], 
   [
    "26297.html", 
    "http://www.4forums.com/political/society-debates/5600-can-i-have-my-country-back-2-print.html"
   ]
  ], 
  "identifier": 5600
 }
]