[
 [
  [
   135680, 
   null, 
   "Bell", 
   "...it should be banned. \n \n \n However, in the course of banning the right the choose abortion allowances must be made. These are in regards to providing for the pregnant couple the services they need. I also think some \"PR\" work would need to be done to accomplish the destigmatization of unwed mothers so they really felt like they could unshamefully carry a child to term. \n Of course, I understand some folks think that they should  be ashamed to be having sex outside of marriage, but the point here is to decrease the need for abortions. Get rid of the reasons why people have abortions and then ban abortion.\n \n Anyone want to live in Utopia? :xbanghead", 
   {
    "post_info": {
     "post_title": "I've been through it, and..."
    }
   }, 
   null, 
   null, 
   1118444520.0
  ], 
  [
   135688, 
   null, 
   "Sigma", 
   "...it should be banned. \n\n \n I have had personal experience with abortion as well, and I do not think it should be banned.\n \n I feel as you do, that the reasons women have abortions need to be addressed for their number to drop. Trying to ban abortion without addressing those reasons would not help anyone or anything, and would be detrimental to women. However, why ban it if those reasons are addressed? At that point no abortions will be desired.", 
   {}, 
   135680, 
   null, 
   1118445240.0
  ], 
  [
   142421, 
   null, 
   "Clerisian", 
   "...it should be banned.\n\n \n Way to support your controversial assertion, Bell.", 
   {}, 
   135680, 
   null, 
   1120041480.0
  ], 
  [
   142635, 
   null, 
   "jitobear", 
   "Your bad experience does not grant you license to make decisions for other women.", 
   {}, 
   142421, 
   null, 
   1120084440.0
  ], 
  [
   142695, 
   null, 
   "Steeeeve", 
   "Your bad experience does not grant you license to make decisions for other women.\n\n No ones experience grants them license to kill someone..or \"make a decision for them\" (such as killing them).", 
   {}, 
   142635, 
   null, 
   1120088520.0
  ], 
  [
   142706, 
   null, 
   "Nurglitch", 
   "We need special licenses for abortions now?", 
   {}, 
   142695, 
   null, 
   1120089180.0
  ], 
  [
   142708, 
   null, 
   "Steeeeve", 
   "We need special licenses for abortions now?\n\n \n Only if you are making decisions....any decision you make requires a license from the UN. emoticon_xclown", 
   {}, 
   142706, 
   null, 
   1120089300.0
  ], 
  [
   142717, 
   null, 
   "Clerisian", 
   "No ones experience grants them license to kill someone..or \"make a decision for them\" (such as killing them).\n\n \n See Begging the Question", 
   {}, 
   142695, 
   null, 
   1120090140.0
  ], 
  [
   142724, 
   null, 
   "Voice Of Reason", 
   "...it should be banned. \n \n \n However, in the course of banning the right the choose abortion allowances must be made. These are in regards to providing for the pregnant couple the services they need. I also think some \"PR\" work would need to be done to accomplish the destigmatization of unwed mothers so they really felt like they could unshamefully carry a child to term. \n Of course, I understand some folks think that they should  be ashamed to be having sex outside of marriage, but the point here is to decrease the need for abortions. Get rid of the reasons why people have abortions and then ban abortion.\n \n Anyone want to live in Utopia? :xbanghead\n\n \n There are all kinds of social services, religious and otherwise available that will provide assistance to any woman who wants to carry her baby to term........\n \n When pro abortion people use that as and argument it is just a red herring and smoke screen........", 
   {}, 
   135680, 
   null, 
   1120090680.0
  ], 
  [
   142820, 
   null, 
   "Steeeeve", 
   "See Begging the Question\n\n \n What are you talking about? How was I begging the question?", 
   {}, 
   142717, 
   null, 
   1120103160.0
  ], 
  [
   142895, 
   null, 
   "Clerisian", 
   "\n Get rid of the reasons   why people have abortions  and then ban abortion.\n\n \n Yes, IF you conclude that abortion is wrong, then you still have a responsibility to address the social problems that cause it to occur before you can ban it. But if you don't think it's wrong, then you have no such responsibility. Also, Sigma makes a good point on this issue.", 
   {}, 
   142717, 
   null, 
   1120113540.0
  ], 
  [
   142935, 
   null, 
   "Winston Smith", 
   "I think you are also confused when it comes to 'begging the question'. One does not need to study classic logic to reason correctly, although we had to study it for our philosophy courses. \n Begging the question means in simple terms that a conclusion has been drawn based on a false or unproven premise. The problem in Forums such as this one is that a starting point that for someone is an axiom for another is a falsehood, therefore questions are begged left and right. \n If Steeeeve simply states something, he can not be begging the question. But if you say that no person is killed during an abortion, therefore no homicide has been committed. You are begging the question since you are assuming that everybody will accept as true that a foetus is not a person and that, is something disputed by many.\n Let me say it again you don't need to study formal logic to reason correctly, although it helps.", 
   {
    "post_info": {
     "post_title": "clerisian"
    }, 
    "unicode_changes_made": true
   }, 
   142895, 
   null, 
   1120126860.0
  ], 
  [
   142937, 
   null, 
   "Clerisian", 
   "\n I think you are also confused when it comes to 'begging the question'. \n \n\n \n No I'm not. Read the entry, and my explanation of it in the other thread:\n \n http://www.4forums.com/political/showthread.php?p=142914#post142914\n \n \n\n Begging the question means in simple terms that a conclusion has been drawn based on a false or unproven premise. \n \n\n \n Not exactly. It's a very specific type of unproven premise. Namely, one which is the sticking point of an argument.\n \n \n\n The problem in Forums such as this one is that a starting point that for someone is an axiom for another is a falsehood, therefore questions are begged left and right. \n If Steeeeve simply states something, he can not be begging the question. \n \n\n \n He certainly can be, if he states something that is being disputed as a sticking point. Read the entry.\n \n \n\n But if you say that no person is killed during an abortion, therefore no homicide has been committed. You are begging the question since you are assuming that everybody will accept as true that a foetus is not a person and that, is something disputed by many.\n \n\n \n I never stated that explicitly as the premise of an argument, as far as I recall. If I had used that as the premise of an argument for pro-choice, it would have been a fallacy, and someone should have called me on it. Again, whether you are arguing for pro-choice or pro-life, you can't assume your conclusion.", 
   {
    "unicode_changes_made": true
   }, 
   142935, 
   null, 
   1120129320.0
  ], 
  [
   142971, 
   null, 
   "Steeeeve", 
   "Only if you are making decisions....any decision you make requires a license from the UN. emoticon_xclown\n\n This is what I typed that some claim is \"begging the question\"...aside from the obvious clown face which might hint towards me kidding, I think it might be safe to say that any reasonable person would know that you really don't need a license from the UN for makign decisions.\n \n I guess sarcasm is not known here.", 
   {}, 
   142708, 
   null, 
   1120139040.0
  ], 
  [
   143108, 
   null, 
   "Clerisian", 
   "\n I think it might be safe to say that any reasonable person would know that you really don't need a license from the UN for makign decisions.\n \n\n \n But the fact that you don't need a license from the UN has nothing to do with what I accused you of begging the question for. It was for the phrase \"killing Someone.\" (Whether it is someone being killed, not something, is the sticking point of the abortion debate). I understand that you do not actually believe the part about the UN.", 
   {}, 
   142971, 
   null, 
   1120164840.0
  ], 
  [
   143123, 
   null, 
   "Bell", 
   "Way to support your controversial assertion, Bell.\n\n \n Way to miss the entire point, Clerisian. \n \n My point was that is it a horrible experience for many women, and that I wish we could strive towards a society where abortions were no longer needed. Wishful thinking by a midtwenties female who just went through the most horrifying experience of her life, forgive me if I didn't clarify well enough.\n \n I can't imagine that anyone would disagree with that.\n \n \nYour bad experience does not grant you license to make decisions for other women.\n\n \n Yeah, thanks for recapitulating my pro-choice position.\n \n Voice of Reason, it's too bad you're of the male gender. I've always had a hard time taking seriously into account the platforms of men regarding this issue, as they simply will not ever have to deal with it in the first person. Pretty emotional logic, I know. But it's a pretty emotional issue.\n \n Cheers", 
   {}, 
   142421, 
   null, 
   1120168020.0
  ], 
  [
   143133, 
   null, 
   "Clerisian", 
   "\n My point was that is it a horrible experience for many women, and that I wish we could strive towards a society where abortions were no longer needed. \n \n\n \n You should have said that. I might have agreed with you.\n \n \n\n Wishful thinking by a midtwenties female who just went through the most horrifying experience of her life, forgive me if I didn't clarify well enough.\n \n\n \n I forgive you.\n \n \n\n Pretty emotional logic, I know.\n \n\n \n Yeah, except for the \"logic\" part. How can you not take the positions of men on the abortion issue seriously? I take the positions of women very seriously with regards to, say, circumcision.", 
   {}, 
   143123, 
   null, 
   1120168500.0
  ], 
  [
   143245, 
   null, 
   "Steeeeve", 
   "But the fact that you don't need a license from the UN has nothing to do with what I accused you of begging the question for. It was for the phrase \"killing Someone.\" (Whether it is someone being killed, not something, is the sticking point of the abortion debate). I understand that you do not actually believe the part about the UN.\n\n my mistake I thought you quoted something else...either way..it is still not begging the question as my conclusion was not basis for my premise.", 
   {}, 
   143108, 
   null, 
   1120175040.0
  ], 
  [
   143254, 
   null, 
   "Clerisian", 
   "\n it is still not begging the question as my conclusion was not basis for my premise.\n \n\n \n What the hell are you talking about? Look, let me lay it out for you:\n \n 1. The critical sticking point between the two sides of the debate is, is the fetus a morally considerable thing? (or, a \"person,\" or a \"someone\")\n \n 2. To assume the sticking point of an argument to make that argument, or an argument in support of your side of the sticking point is called \"begging the question.\"\n \n 3. You assumed that a fetus was a someone when attempting to refute a point related to the abortion debate's sticking point.\n \n 4. Therefore, you begged the question.", 
   {}, 
   143245, 
   null, 
   1120175820.0
  ], 
  [
   143258, 
   null, 
   "Steeeeve", 
   "What the hell are you talking about? Look, let me lay it out for you:\n \n 1. The critical sticking point between the two sides of the debate is, is the fetus a morally considerable thing? (or, a \"person,\" or a \"someone\")\n \n 2. To assume the sticking point of an argument to make that argument, or an argument in support of your side of the sticking point is called \"begging the question.\"\n \n 3. You assumed that a fetus was a someone when attempting to refute a point related to the abortion debate's sticking point.\n \n 4. Therefore, you begged the question.\n\n \n with that poor standard of what \"begging the question\" means you do it all the time.\n \n You assume that the sticking point is what you said it is in your arguement so by your standard you begged the question yourself.", 
   {}, 
   143254, 
   null, 
   1120176000.0
  ], 
  [
   143261, 
   null, 
   "Steeeeve", 
   "No ones experience grants them license to kill someone..or \"make a decision for them\" (such as killing them).\n\n \n \n You also assumed I was talking about a fetus in my above statement.", 
   {}, 
   142695, 
   null, 
   1120176180.0
  ], 
  [
   143263, 
   null, 
   "Clerisian", 
   "\n with that poor standard of what \"begging the question\" means you do it all the time.\n \n\n \n That is the standard, and if I do it, you should call me on it.\n \n \n\n You assume that the sticking point is what you said it is in your arguement so by your standard you begged the question yourself.\n \n\n \n I understand that to be the sticking point. If you do not think that it is the sticking point, then I wish you would tell me what the actual sticking point is. If you cannot tell me what the actual sticking point is, then you are wrong in your assertion, and you should apologize.\n \n \n\n You also assumed I was talking about a fetus in my above statement.\n \n\n \n Were you not?", 
   {}, 
   143258, 
   null, 
   1120176480.0
  ], 
  [
   143338, 
   null, 
   "Steeeeve", 
   "I understand that to be the sticking point. If you do not think that it is the sticking point, then I wish you would tell me what the actual sticking point is. If you cannot tell me what the actual sticking point is, then you are wrong in your assertion, and you should apologize.\n Some believe a right to personal autonomy is over a right to life...so they believe it is a human but that is below the \"right\" to personal autonomy. So you are making an assumption about the sticking point being what you say it is. Either way, you are using \"begging the question\" incorrectly in my opinion so I am not gonna call you on it because that is not what it is. \n \n \nWere you not?\n You already assumed I was, so too late for corrections.", 
   {}, 
   143263, 
   null, 
   1120187760.0
  ], 
  [
   143363, 
   null, 
   "Clerisian", 
   "\n Some believe a right to personal autonomy is over a right to life...so they believe it is a human but that is below the \"right\" to personal autonomy. \n \n\n \n Good point. However, I think this approach is marginal at best.\n \n \n\n So you are making an assumption about the sticking point being what you say it is.\n \n\n \n That's true, I am. However, making an assumption is not the same thing as begging the question, which is a particular type of assumption.\n \n \n\n Either way, you are using \"begging the question\" incorrectly in my opinion so I am not gonna call you on it because that is not what it is. \n \n\n \n Then your opinion would be contrary to fact. If you want to call me on it, I suggest you reread the entry first.\n \n \n\n You already assumed I was, so too late for corrections.\n \n\n \n You didn't answer my question. You said I assumed X. If X is the case, then this is not a problem. The problem comes up when X is not the case, or X is under dispute. So I ask you again, was I wrong? Do you disagree?", 
   {}, 
   143338, 
   null, 
   1120189320.0
  ], 
  [
   143372, 
   null, 
   "Duo_Maxwell", 
   "\n Voice of Reason, it's too bad you're of the male gender. I've always had a hard time taking seriously into account the platforms of men regarding this issue, as they simply will not ever have to deal with it in the first person. Pretty emotional logic, I know. But it's a pretty emotional issue.\n \n Cheers\n\n \n Actually it should be easily to relate to VOR on this: he only argues with emotion. No facts, no evidence, no proof, just emotion.", 
   {}, 
   143123, 
   null, 
   1120190040.0
  ], 
  [
   143409, 
   null, 
   "Winston Smith", 
   "Actually it should be easily to relate to VOR on this: he only argues with emotion. No facts, no evidence, no proof, just emotion.\n\n \n Voice of Reason? Hmm...He used to be in Military Intelligence hence the debacle in Vietnam. He probably still thinks that the US won the war.", 
   {
    "unicode_changes_made": true
   }, 
   143372, 
   null, 
   1120198320.0
  ], 
  [
   143419, 
   null, 
   "Duo_Maxwell", 
   "Voice of Reason? Hmm...He used to be in Military Intelligence hence the debacle in Vietnam. He probably still thinks that the US won the war.\n\n \n Are you sure? VOR is a 14 year old kid from Florida. His IP is squarely from a ISP from Florida. If he is retired, he is the first person I have ever heard who was 60+ that used slang normally reserved for street gangs. Not to mention that his war stories place him in two different seas at the same time. Somehow 2 tours turned into 4, midlevel ship officer turned into high ranking military advisor. \n \n All in all, VOR is far more of a liability to any of his allies because of his lying, lack of education and reading comphrension problems.", 
   {
    "unicode_changes_made": true
   }, 
   143409, 
   null, 
   1120201140.0
  ], 
  [
   143667, 
   null, 
   "Bell", 
   "Yeah, except for the \"logic\" part. How can you not take the positions of men on the abortion issue seriously? I take the positions of women very seriously with regards to, say, circumcision.\n\n \n Like, I said, I can't take men's position on abortion seriously b/c they can spout off all they want; however their viewpoint must be affected somewhat by the fact that they will never actually have to make the decision themselves. \n \n As far as circumcision...um...who cares? :) J/k. I really don't know what to think about that. Never given it alot of thought, as I've never had a penis, don't plan on growing one, and therefore I can't have a valid point of view. Do whatever feels best to you. Get my drift?\n \n Hey, you two, Clerisian and Steeeve, quit arguing semantics. Geesh! emoticon_xclown", 
   {}, 
   143133, 
   null, 
   1120253040.0
  ], 
  [
   144334, 
   null, 
   "Winston Smith", 
   "Like, I said, I can't take men's position on abortion seriously b/c they can spout off all they want; however their viewpoint must be affected somewhat by the fact that they will never actually have to make the decision themselves. \n \n As far as circumcision...um...who cares? :) J/k. I really don't know what to think about that. Never given it alot of thought, as I've never had a penis, don't plan on growing one, and therefore I can't have a valid point of view. Do whatever feels best to you. Get my drift?\n\n Hmmm... so, barren women can not have a valid point of view nor women in the stage of menopause because it does not affect them personally. Perhaps you should tell the moderator to institute women only Forums, men only Forums, gays only Forums.... etc", 
   {
    "unicode_changes_made": true
   }, 
   143667, 
   null, 
   1120479600.0
  ], 
  [
   144886, 
   null, 
   "Bell", 
   "Hmmm... so, barren women can not have a valid point of view nor women in the stage of menopause because it does not affect them personally. Perhaps you should tell the moderator to institute women only Forums, men only Forums, gays only Forums.... etc\n\n \n I didn't say anything about other women. Haven't really given that one much thought, because the women I meet are primarily pro-choice and the ones that aren't are too 1. religious or 2. crazy to take seriously. It's an interesting thought; I'll dwell on it. \n \n I didn't say nor do I believe that people should be excluded from giving their opinions. I read these forums because I'm very interested in hearing what people, especially those I disagree with, have to say. I simply stated that I, that's me, myself, and I, cannot take seriously a man's  position on abortion. Other folks, please, I roll the welcome mat out to you and encourage you to think/say/write whatever you want to. \n \n A person interested in a debate may desire to come back with why I should take mens  position's seriously on abortion rather than write fiction.", 
   {
    "unicode_changes_made": true
   }, 
   144334, 
   null, 
   1120610100.0
  ], 
  [
   145027, 
   null, 
   "Winston Smith", 
   "A person interested in a debate may desire to come back with why I should take mens  position's seriously on abortion rather than write fiction.\n\n \n Sorry! I do not understand what are you trying to say, so I can not debate. And by all means write fiction.", 
   {}, 
   144886, 
   null, 
   1120649100.0
  ], 
  [
   145170, 
   null, 
   "Bell", 
   "Sorry! I do not understand what are you trying to say, so I can not debate. And by all means write fiction.\n\n \n My well repeated point was that I have a hard time taking men's position on abortion seriously. My question was why should I? \n Does anyone have anything to say about why men should be making laws regarding what a woman does with her body?\n \n As I grow as a person I am trying to understand and learn. I'm not being snide or sarcastic -I would just like to hear what people have to say about it[the above].", 
   {}, 
   145027, 
   null, 
   1120689180.0
  ], 
  [
   145177, 
   null, 
   "sinjin", 
   "My well repeated point was that I have a hard time taking men's position on abortion seriously. My question was why should I? \n Does anyone have anything to say about why men should be making laws regarding what a woman does with her body?\n \n As I grow as a person I am trying to understand and learn. I'm not being snide or sarcastic -I would just like to hear what people have to say about it[the above].\n\n \n Men are affected by the issue of abortion as well. Men pay the lion's share of support for children in the U.S. \n \n Would you not want to be consulted on the issue of circumcision if it were your child too?\n \n Men will continue to make laws that effect women with little contribution from women as long as the vast majority of women are politically illiterate.", 
   {}, 
   145170, 
   null, 
   1120690740.0
  ], 
  [
   145257, 
   null, 
   "Steeeeve", 
   "Seems interesting that the ones the scream \"you aren't treating women equally\" if we don't support abortion around the same ones that treat men unequally by saying we shouldn't have an opinion on abortion. It seems I have every right to talk about abortion because I was was a little unborn in the womb and I am glad I wasn't killed.", 
   {}, 
   145177, 
   null, 
   1120703640.0
  ], 
  [
   145408, 
   null, 
   "Winston Smith", 
   "My well repeated point was that I have a hard time taking men's position on abortion seriously. My question was why should I? \n Does anyone have anything to say about why men should be making laws regarding what a woman does with her body?\n \n As I grow as a person I am trying to understand and learn. I'm not being snide or sarcastic -I would just like to hear what people have to say about it[the above].\nIt seems to me you are asking a silly question or being disingenuous. Men are also human beings, men contribute to procreation, men have mothers, men have wives, men have girlfriends, men have sisters, men have daughters and we care about them, but all this is not enough for you. We have to provide you with better reasons to show you that we treat abortion seriously. Very reasonable of you.\n \n OK. So men ought not to pass laws that affect women only. Fine, and blacks can not decide on issues that affect white men only, and heterosexuals should not pass laws that affect gays and .....Good idea bell.", 
   {
    "unicode_changes_made": true
   }, 
   145170, 
   null, 
   1120740300.0
  ], 
  [
   145546, 
   null, 
   "Bell", 
   "Men are affected by the issue of abortion as well. Men pay the lion's share of support for children in the U.S. \n \n Would you not want to be consulted on the issue of circumcision if it were your child too?\n \n Men will continue to make laws that effect women with little contribution from women as long as the vast majority of women are politically illiterate.\n\n \n Thank you, Sinjin, for your post.\n \n Yes, men pay for child support. I see your point. But I'm still stuck on the whole 'it's not their body-it'll never be their personal issue so how could they assume the right to pass legislation on it' bandwagon. Help me get off.\n \n Kind of off the topic, should there be some kind of legislation passed that if a man wants an abortion, signs papers, et cetera, and a mother refuses, could he 'get out of' paying support?\n \n I really haven't given any thought to circumcision. No one's going around passing laws for/against it, and it's not life threatening. I'm thinking that if it's your child, you get to decide what to do. \n \n Yes, women are underrepresented in politics. I hope for change in the future.\n \n \nSeems interesting that the ones the scream \"you aren't treating women equally\" if we don't support abortion around the same ones that treat men unequally by saying we shouldn't have an opinion on abortion. It seems I have every right to talk about abortion because I was was a little unborn in the womb and I am glad I wasn't killed. .\n\n \n *sigh* I never said men shouldn't have an opinion on abortion. Nor did I say that men do not have the right to talk about abortion. Please reread my earlier posts. I'm having a hard time why I  should take men's position on abortion seriously. More specifically, men don't have the junk, why do they get a (legal) say? And, just to prove your point, women aren't treated equally. :) \n \n \nIt seems to me you are asking a silly question or being disingenuous. Men are also human beings, men contribute to procreation, men have mothers, men have wives, men have girlfriends, men have sisters, men have daughters and we care about them, but all this is not enough for you. We have to provide you with better reasons to show you that we treat abortion seriously. Very reasonable of you.\n \n OK. So men ought not to pass laws that affect women only. Fine, and blacks can not decide on issues that affect white men only, and heterosexuals should not pass laws that affect gays and .....Good idea bell.\n\n \n Man, knock off the sarcasm already. I've clearly stated that I'm trying to learn and figure out why I should take men's position on abortion seriously. I've come to the forums to learn, maybe change my positions. Not to just spout off how I feel. Blasting sarcasm is not conducive to open minded learning.\n \n Your quote highlighted in red confused me. I've never questioned that men take abortion seriously. I'm going to assume that you meant men's positions should be taken seriously because...etc....\n \n In response to your valid points using the assumption above, I have to say that men do not give birth, they do not have a baby grow inside them, and they do not have the option of terminating the pregnancy. I think they certainly should get their say in regards of what to do, but since the final choice is a woman's they ought not to be the conductors for the Orchestra of Law regarding abortion.\n \n I could not help but noticed that you used the term 'blacks' against the term 'white men'. Why did you not say either 'black men' or 'blacks' and 'whites'? \n What issues affect 'white men' only that 'blacks' should not be involved in? \n \n And no, I don't think that heterosexuals should be passing laws that limit  what homosexuals do only because of their sexual orientation. But this is not the place for that discussion.", 
   {
    "unicode_changes_made": true
   }, 
   145177, 
   null, 
   1120765260.0
  ], 
  [
   145605, 
   null, 
   "Steeeeve", 
   "*sigh* I never said men shouldn't have an opinion on abortion. Nor did I say that men do not have the right to talk about abortion. Please reread my earlier posts. I'm having a hard time why I should take men's position on abortion seriously. More specifically, men don't have the junk, why do they get a (legal) say? And, just to prove your point, women aren't treated equally.\n I don't think I was referring to you actually. I was just kinda posting a general comment. \n \n As for your \"women aren't treated equally\" thing...I don't think anyone is really treated equally...but we should probably shrive for it. I also don't understand why you have a hard time taking men's positions on abortion seriously. What is wrong with our position? As I said eariler, we were all once part of a pregnancy and we can all have a say. I think the most compelling people for abortion are they ones that were to be aborted but the abortion failed and they were born. When they give their story it seems to mean a lot more then anyone elses to me.", 
   {}, 
   145546, 
   null, 
   1120770900.0
  ], 
  [
   145705, 
   null, 
   "Winston Smith", 
   "I have given you enough reasons why men ought to have taken seriously when they give their opinion about abortion. But you keep coming with the samme tired line: men don't have babies therefore they can not be treated seriously. Fine, you are entitled to your opinion. And yes you can have the final word on the subject. Bye.", 
   {
    "post_info": {
     "post_title": "bell"
    }, 
    "unicode_changes_made": true
   }, 
   145605, 
   null, 
   1120792500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I've been through it, and...", 
  "url": "http://www.4forums.com/political/abortion-debates/5620-ive-been-through.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 5620, 
  "discussion_files": [
   [
    "14010.html", 
    "http://www.4forums.com/political/abortion-debates/5620-ive-been-through-print.html"
   ], 
   [
    "14011.html", 
    "http://www.4forums.com/political/abortion-debates/5620-ive-been-through-3-print.html"
   ], 
   [
    "14012.html", 
    "http://www.4forums.com/political/abortion-debates/5620-ive-been-through-2-print.html"
   ]
  ], 
  "identifier": 5620
 }
]