[
 [
  [
   136383, 
   null, 
   "Raastee", 
   "The Necessity of the Separation of Church and State\n \n Theocracies have never been a successful form of government. They usually start with the best intentions and quickly end in self -destruction. The American experiment is a result of people around the world seeking a better and more neutral form of government.\n The necessity of the separation of church and state can be found in the intent of the writers of our constitution. There are three primary positions in the debate; separationists, accomodationists and non-preferentialists. All evidence demonstrates that separation is a necessity. \n I. Three Primary Positions\n A. Separationists\n · Broad interpretation- prohibit government from supporting or promoting religious beliefs or practice.\n B. Accomodationists\n · Narrow interpretation- promoting and support, but no state church only. \n C. Non-preferentialists\n · Promoting and support\n · Favor no one religious sect or belief\n D. Questionnaire- over 60% said the principle was just\n E. Interview- Mr. Clark (Lawyer of 15 years) stated, \"The principle is very important to protect our religious freedom.\"\n II. The Constitution and its background\n A. The Europe they Left\n 1. Execution of the Mennonites (Foxe p.214)\n 2. Jesuit disembowelments- England and Scotland (Foxe p.236)\n 3. Expulsion of the Saluzburger- 20,000 froze to death\n 4. Persecution of Huguenots by Catholics- 30 year religious war, over 400,000 dead.\n 5. Drowning of Protestants- survivors shot. (Foxe p.351)\n B. Danbury Baptist letter (Story p.705)\n 1. Concern from the Baptist\n 2. Thomas Jefferson assures them of separation\n C. Debate about a national day of thanks for the Constitution (Gates pp. 914-915)\n 1. Mr. Boudinot (N.J.) -pro-national celebration\n 2. Mr. Tucker (S.C.) -\"...it is a business which congress have nothing to do...\"\n D. Washington's treaty with the Algeirians. (American p.154)\n · \"...the United States of America is not, in any sense, founded on the Christian religion...no enmity against the Mussalman.\"\n E. First Amendment (Cullop p.74)\n 1. Establishment clause- \"Congress shall make no law respecting an establishment of religion...\"\n 2. Free exercise clause- \"...or prohibiting the free exercise thereof;\"\n 3. Both in the negative\n III. Conclusion\n A. First Amendment is in the negative i.e. what the government cannot do.\n B. Founding Fathers had knowledge of failed theocracies.\n C. Frame of mind from letters and debates is clear.\n It is clear from the evidence that our founders favored a separation view and a broad interpretation.\n Religious passions tend to override reason- we have all seen it 9/11 and Pakistan. \n \n \n Reference:\n American State Paper Class I, Foreign Relations, Vol. II\n Cullop, Floyd; The Constitution, Mentor Book, 1984\n Foxe, John; Martyrs, Whitaker House, 1981\n Gales, Joseph; Debates in Congress Vol. I, published by Gates and Seaton, 1834\n Story, Joseph; Constitution Commentaries, Vol. III, 1833\n Telephone interview with Mr. Clark with the Atlanta ACLU branch on 12/12/04.", 
   {
    "post_info": {
     "post_title": "The Necessity of the Separation of Church and State"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1118617320.0
  ], 
  [
   136725, 
   null, 
   "Jo Bennett", 
   "There was an argument for separation of church and state 200 years ago. I would be interested to know what is so profoundly dangerous about the Church of England's current relationship with the British state (and the Church of Scotland's for that matter). Pointless and anachronistic it may be, but given the levels of fundamentalism in the US compared to the UK, it hardly seems like the separation is that big a deal.", 
   {}, 
   136383, 
   null, 
   1118696580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Necessity of the Separation of Church and State", 
  "url": "http://www.4forums.com/political/politics-debates/5639-necessity-separation-church-state.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 5639, 
  "discussion_files": [
   [
    "31446.html", 
    "http://www.4forums.com/political/politics-debates/5639-necessity-separation-church-state-print.html"
   ]
  ], 
  "identifier": 5639
 }
]