[
 [
  [
   136821, 
   null, 
   "Steeeeve", 
   "I'm sure we all have heard Deans comments in the past 2 weeks (or 6months for that matter). I was wondering if you all think they are way out there or if you agree with them. In case you are wondering he said things like all republicans are white, never worked a day in their lives, Christian and Fox News is run by the republican party. Things like that.\n \n My opinion, \n \n I think the republican party should pay Dean for doing a fine job of making the republicans seem moderate and the democrats seem crazy. :p", 
   {
    "post_info": {
     "post_title": "Is Dean crazier then Jackson?"
    }
   }, 
   null, 
   null, 
   1118709900.0
  ], 
  [
   136841, 
   null, 
   "snakespit", 
   "Dean has embarrased himself and the democratic party with his comments. The real test is too see how much damage these statements cause. My guess is that not too many people really care what Dr. Dean thinks or says, which is why he did not make it in his party's primary. I think the majority of Americans closed their ears during the Dean scream, and few have started to listen to him yet. Even the majority of the republican party is just laughing at Dean, as they should be. It seems that the only people trying to get a whole lot of mileage out of Dean's inane comments are the media, and I think a lot of people (republican and democrat) have stopped listening to the media as well. \n \n I think the only thing this shows is the desperate nature of the democratic party if it elects someone like Dean as the party chair. The democrats need someone strong, well spoken, and moderate as the chair if they desire to be a true threat in the next election. Dean does not fit this role. The democratic party of the past has had some great and noble leaders. Dean will never be counted among them. \n \n Maybe this will help the American people to realize that it is time to start thinking for itself, and we will stop listening to the garbage that comes from radicals and media on both side of the fence. At least it's a start.", 
   {}, 
   136821, 
   null, 
   1118713560.0
  ], 
  [
   136856, 
   null, 
   "jskufan", 
   "I'm sure we all have heard Deans comments in the past 2 weeks (or 6months for that matter). I was wondering if you all think they are way out there or if you agree with them. In case you are wondering he said things like all republicans are white, never worked a day in their lives, Christian and Fox News is run by the republican party. Things like that.\n \n My opinion, \n \n I think the republican party should pay Dean for doing a fine job of making the republicans seem moderate and the democrats seem crazy. :p\n\n \n What difference does it really make, Democrats will still vote for whoever gets nominated just as the Republicans have and will. Dean probably won't be that person so he's just doing what he was hired to do: keep the spotlight on the Democratic party. Getting Republicans riled up is just an additional benefit.", 
   {}, 
   136821, 
   null, 
   1118717580.0
  ], 
  [
   136858, 
   null, 
   "Steeeeve", 
   "What difference does it really make, Democrats will still vote for whoever gets nominated just as the Republicans have and will. Dean probably won't be that person so he's just doing what he was hired to do: keep the spotlight on the Democratic party. Getting Republicans riled up is just an additional benefit.\n\n \n I agree with the other poster...not you. I think that you are wrong because the only way the democrats will win will be to draw some moderate republicans and Dean being an extremist won't help this.", 
   {}, 
   136856, 
   null, 
   1118717880.0
  ], 
  [
   136863, 
   null, 
   "Voice Of Reason", 
   "Howard Dean is the best thing to happen to the Republican Party in years.....Every time he opens his mouth he inserts his foot..........Many prominent democrats like Joe Biden and Harold Ford are distancing themselves from him as fast as they can..........\n \n Talk about a loose canon.........", 
   {}, 
   136858, 
   null, 
   1118718840.0
  ], 
  [
   136866, 
   null, 
   "Nwarth", 
   "1- Voters don't pay attention to the party chairs... Their job is to raise money and make sure the party works, and state chairmen love Dean because he is paying more attention to them than TM did. In fact, in this time of grassroots campaigns Dean understands that politicians need to hit the ground and retail... not wholesale their message to be effective. Dean is fulfilling his major promise... to \"show up\" in traditionally red states. Regardless of what you believe, at least he is keeping his campaign promises.\n \n 2- Howard Dean is not as crazy as you all think. In fact compared to Delay, your leader in the House, and this administration, he makes a lot of sense. now you can try and squawk about some things he says, but when it comes to the issues Republicans are as vacuous as a hot air balloon: looks pretty but light on substance. Statistic after statistic comes out that makes republicans look bad, what is their damage control... attack HDean. Do you think that they would admit they made a mistake, or try and work within our TWO PARTY SYSTEM... of course not, they will cry like babies for more power -- exemplars include packing the court and the 'nuclear option'. \n \n Face it, You parade Dean around to try and move the spotlight from your own spotty, disgusting, and filthy record of alleged human rights abuses, mass outsourcing of jobs-including interrogation, your close relationship with Saudi's, your lack of funding on NCLB, Hydrogen Car initiative, AID's in Africa, well the list goes on... in fact the only thing that you do fund is the military war machine... billions wasted in a failed action, but an administration too blind to admit or care. Let us shed the focus to where it should go:\n \n What are you going to do now that it was uncovered that the administration official in charge of vetting scientific evidence was hiding evidence of global warming in a sleazy attempt to protect his oil interests... will we acknowledge that Global Warming... or Global Change is occurring?\n \n What are you going to do about Gitmo? A magnet and terrorist creating tool. You say that our criticisms of this administration are creating terrorists? Your own policies are doing that job without anyone else saying a thing. Terrorist recruitment has been going up while U.S. Army and Marine recruitment has been going down. What is your response to this major defeat in the war on Terror?\n \n Speaking of which how can we afford (both fiscally, militarily, and politically) to stay in iraq when over 12,000 Iraqi's were killed, their standard of living is down the toilet, dozens of our soldiers are dying every week, and troops on the ground are commenting that the situation is getting worse... not better. General Myers even admitted that every terrorist attack in that country is claiming more and more lives. Even the Congressman who sponsored the change from \"french fries\" to \"freedom fries\" is pulling his support for the Iraqi war saying that we aught to develop and exit strategy and get out there. What is your reaction to that?\n \n Speaking of which, how is the hunt for Bin Laden going? Representative Hunter now suggests he may be in Libya, said on Meet the Press this past weekend that Bin Laden maybe traveling between Libya, Afghanistan, and Pakistan... what do you propose to do about that.\n \n You used WMD as a reason to go to war with Iraq, well Mr. KJI of North Korea and the Shahs of Iran have developed WMD's under Bush's watch, what made Iraq a more tempting target than Iran or North Korea? Are we going to back down to Kim and pay him off? Or stand up to him and help our allies in any way possible?\n \n You speak of family values, well lets talk of family values. Who supports a better minimum wage for mom and pop? Who supports better public schools for little timmy and tiny? Who wants to care for our seniors by making sure that there is a nest egg for them at home. Mr. Bush's record on domestic issues is tanking faster than the Titanic, 33% on SS--- what do you plan to do about that?\n \n Here is what the Administration's response, and what every right wing republican response has been. They plan to blame the 'liberal press', pretend that none of these problems exist, and try and grab more power in the Senate and completely neuter the opposition and bog them down. I ask you, what should take up more time, this administration's blatant failures- or a few poorly worded comments by a figurehead.", 
   {}, 
   136856, 
   null, 
   1118719440.0
  ], 
  [
   136876, 
   null, 
   "Steeeeve", 
   "In fact compared to Delay, your leader in the House, and this administration, he makes a lot of sense.\n Huh? Who are you talking to here? My leader??...I thought the leader of the House was the speaker..but whatever.\n \n \nexemplars include packing the court and the 'nuclear option'.\n lol, packing the court. When will people realize that \"packing\" the court with people that actually believe in the consitution is not a bad thing. I would vote for a 1000 Scalias to run the courts.\n \n \nStatistic after statistic comes out that makes republicans look bad, what is their damage control... attack HDean.\nAnd why wasn't HDean talking about substance then? WHy was he attacking republicans for being a \"white party\"? Seems like he is doing the same things you accuse republicans of. \n \n \nFace it, You parade Dean around to try and move the spotlight from your own spotty, disgusting, and filthy record of alleged human rights abuses, mass outsourcing of jobs-including interrogation, your close relationship with Saudi's, your lack of funding on NCLB, Hydrogen Car initiative, AID's in Africa, well the list goes on... in fact the only thing that you do fund is the military war machine... billions wasted in a failed action, but an administration too blind to admit or care. Let us shed the focus to where it should go:\n I guess you could say Dean was doing the same...\n \n \n \nYou speak of family values, well lets talk of family values. Who supports a better minimum wage for mom and pop? Who supports better public schools for little timmy and tiny? Who wants to care for our seniors by making sure that there is a nest egg for them at home. Mr. Bush's record on domestic issues is tanking faster than the Titanic, 33% on SS--- what do you plan to do about that?\n lol, minimum wage...as if 5.15 an hour going up to 6 and hour (or whatever) will make the person go from poor to rich. Either way they will be poor...if you raise the minimum wage you just cause a shift...all the fast foods places charge more thus causing everyone to pay more and then their wages go up to pay for it (aka inflation). But who cares about economics when you can do something that sounds good...wait...weren't you complaining about that earlier? Better public schools, you actually have a point here. I think No Child Left Behind was garbage. SS, its a POS system that needs to be fixed. The president has idea whats the democrats......silence....\n \n \nSpeaking of which how can we afford (both fiscally, militarily, and politically) to stay in iraq when over 12,000 Iraqi's were killed, their standard of living is down the toilet, dozens of our soldiers are dying every week, and troops on the ground are commenting that the situation is getting worse... not better. General Myers even admitted that every terrorist attack in that country is claiming more and more lives. Even the Congressman who sponsored the change from \"french fries\" to \"freedom fries\" is pulling his support for the Iraqi war saying that we aught to develop and exit strategy and get out there. What is your reaction to that?\n How many countries has the US made stable in under 3 years? Oh wait, none. You think we just went into Japan and the next day everyone was having a party?\n \n \n \nwill we acknowledge that Global Warming... \n Until evidence is provided that there actually IS global warming then I will call it a bunch of BS. Considering we only have written temperatures and other data for 100 or so years it would be hard to say 1 million years ago what the temperature was.\n \n \n \n I suggest not reading things at face value and actually look into a situation. You seem to start with \"bush is no good so therefore ____\" then you will always say anythign he does is bad. However, I tend to take an idea...say social security...look into it, ask some people that would know (in this case some finance professors and accounting profs I know) and get the story. From this I concluded that the best solution would be to dissolve SS however, bushs plan aint that bad. Now, take No Child Left Behind. I did the same thing, asked some teachers I trusted from many states....I concluded that it was junk and this seems to be proving true now. So don't go by what Howard Dean says, he is nuts, go by real thinking.", 
   {}, 
   136866, 
   null, 
   1118721240.0
  ], 
  [
   136885, 
   null, 
   "Nwarth", 
   "Allright, If you don't want to acknowledge Global Warming, fine. But the amount of scientific evidence pointing in that direction is overwhelming, and until a better explanation can be found I will point you to some of those sources, sources which you will not doubt find some way to dispute, or undermine through strawmen.\n \n http://www.epa.gov/globalwarming/kids/ (doesn't get mores simple than this)\n \n http://yosemite.epa.gov/oar/globalwarming.nsf/content/index.html (the more complex version\n \n http://www.ucsusa.org/global_environment/global_warming/index.cfm\n \n http://www.npr.org/templates/story/story.php?storyId=1893089&sourceCode=gaw\n \n \n As for our failed attempted in Iraq, and your comment that \"it was only three years\" I remind you of Paul Wolfowitz' promises, sworn testimony in front of Congress, that the oil would practically pay for the reconstruction and that there would be virtually no resistance after we took the country over. Another example of this administration's failure. Yeah, it may take a couple of years to rebuild a country, but you see steady PROGRESS. What we have been seeing is a steady decline! More and people killed, each attack more lethal than the last... by Myers OWN admissions! We didn't have this in Japan, we didn't have this in Germany, we dont' even have these massive problems in Afghanistan. This was not a problem in countless other areas. The only other time this was a problem was, ohh yes i'm going there, Vietnam! \n \n I note you glossed over my evidence for foreign affairs, the strongest supports turning away from the administration, what about General Myer's quote? Where is Bin Laden?\n \n What about North Korea, Iran? Even Hagel is starting to mumble about closing gitmo.", 
   {}, 
   136876, 
   null, 
   1118723520.0
  ], 
  [
   136889, 
   null, 
   "Dzeron", 
   "Dean's pretty crazy, but last I checked he didn't live in a fantasy ranch, change races, or get surgery on his nose 1000 times.", 
   {}, 
   136885, 
   null, 
   1118724000.0
  ], 
  [
   136891, 
   null, 
   "Dzeron", 
   "Howard Dean is the best thing to happen to the Republican Party in years.....\n\n \n That's only a result of the limited choice of the two party system - the Republicans only win because the Democrats are so bad, and vice versa.", 
   {}, 
   136863, 
   null, 
   1118724120.0
  ], 
  [
   137036, 
   null, 
   "Steeeeve", 
   "Allright, If you don't want to acknowledge Global Warming, fine. But the amount of scientific evidence pointing in that direction is overwhelming, and until a better explanation can be found I will point you to some of those sources, sources which you will not doubt find some way to dispute, or undermine through strawmen.\n \n http://www.epa.gov/globalwarming/kids/ (doesn't get mores simple than this)\n \n http://yosemite.epa.gov/oar/globalwarming.nsf/content/index.html (the more complex version\n \n http://www.ucsusa.org/global_environment/global_warming/index.cfm\n \n http://www.npr.org/templates/story/story.php?storyId=1893089&sourceCode=gaw\n \n \n As for our failed attempted in Iraq, and your comment that \"it was only three years\" I remind you of Paul Wolfowitz' promises, sworn testimony in front of Congress, that the oil would practically pay for the reconstruction and that there would be virtually no resistance after we took the country over. Another example of this administration's failure. Yeah, it may take a couple of years to rebuild a country, but you see steady PROGRESS. What we have been seeing is a steady decline! More and people killed, each attack more lethal than the last... by Myers OWN admissions! We didn't have this in Japan, we didn't have this in Germany, we dont' even have these massive problems in Afghanistan. This was not a problem in countless other areas. The only other time this was a problem was, ohh yes i'm going there, Vietnam! \n \n I note you glossed over my evidence for foreign affairs, the strongest supports turning away from the administration, what about General Myer's quote? Where is Bin Laden?\n \n What about North Korea, Iran? Even Hagel is starting to mumble about closing gitmo.\n\n \n ok, if you want to go by your standard that if you say something and it turns out to be wrong that this makes your administration bad then we have never had a good administration. I'd hate to waste my time showing all the mistakes Clinton Made, Bush 1 made, Reagan made, Carter(a day for this one), etc... Steady progess is what we are making, however, I guess CNN doesn't tell you that. I even read this book by the insane liberal that said we were making good progress in Iraq. \n \n As for global warming...my problem is how do we know this is not a natural part of what earth does? how do we know the earth hasn't gotten warmer before? We have no clue what the world was like a few hundred, thousand years ago with regards to climate. For every website you give me, I could find one that says the opposite. The reality is global warming is at best a possibility but no evidence to show solidly show either way.\n \n \nI note you glossed over my evidence for foreign affairs, the strongest supports turning away from the administration, what about General Myer's quote? Where is Bin Laden?\n No, I read it.\n \n \nEven Hagel is starting to mumble about closing gitmo.\n and? Seems fine to me, we have armed force prisons all over the place what is wrong with one in Cuba?", 
   {}, 
   136885, 
   null, 
   1118773920.0
  ], 
  [
   137037, 
   null, 
   "Steeeeve", 
   "Dean's pretty crazy, but last I checked he didn't live in a fantasy ranch, change races, or get surgery on his nose 1000 times.\n\n \n \n Actually, I might debate Dean living in a Fantasy Ranch :p...but i get your point :)", 
   {}, 
   136889, 
   null, 
   1118773980.0
  ], 
  [
   137087, 
   null, 
   "Nwarth", 
   "Ok Steeeve, \n \n You are doing just what Bush and his administration has done, pushed evidence to the side. I gave you the EPA's website. Pushed aside. It wasn't mr. shucks website but a GOVERNMENT website. A GOVERNMENT website that discusses global warming. Now you can keep your head in the dirt like an ostrich if you wish. Your children can do the same. But when the Caps are melted, New York City is under water/ice and temperatures are six degrees above that of the next ice age where I live then we will see who is correct. Granted neither of us will live to see it.\n \n I wish you would go to the EPA website, here it is again.\n \n http://yosemite.epa.gov/oar/globalwarming.nsf/content/Climate.html\n \n In addition global climate: \n \n http://yosemite.epa.gov/oar/globalwarming.nsf/550d4b46b29f68a6852568660081f938/85256d7a00686a5a85256bfe0057a2be/Body/0.154A!OpenElement&FieldElemFormat=gif\n \n Note the trend., and the sub. to the chart is: \"Increasing concentrations of greenhouse gases are likely to accelerate the rate of climate change. Scientists expect that the average global surface temperature could rise 1-4.5°F (0.6-2.5°C) in the next fifty years, and 2.2-10°F (1.4-5.8°C) in the next century, with significant regional variation. Evaporation will increase as the climate warms, which will increase average global precipitation. Soil moisture is likely to decline in many regions, and intense rainstorms are likely to become more frequent. Sea level is likely to rise two feet along most of the U.S. coast.\"\n \n And urge you to look at them. Be a bigger man than Bush and look at the evidence instead of pretending that the problem doesn't exist. Take off the Rose colored glasses, and LOOK.\n \n As for steady progress, I would like to see your definition of progress, from my position Iraq seems to be in regress. Again, standard of life continuously declining, number of deaths rising per incident, troop moral dropping, terrorist recruitment up, American recruitment down. HOW IS THIS PROGRESS?", 
   {}, 
   137037, 
   null, 
   1118777280.0
  ], 
  [
   137143, 
   null, 
   "gnojek", 
   "OH! You meant MICHAEL Jackson!!\n \n I thought you meant JESSE Jackson.\n \n Yeah, MJ is a nutcase. :)", 
   {}, 
   137087, 
   null, 
   1118785560.0
  ], 
  [
   137163, 
   null, 
   "snakespit", 
   "Ok Steeeve,\n \n You are doing just what Bush and his administration has done, pushed evidence to the side. \n\n And you seem to be doing what most politicians do when backed into a corner with a real issue...change the subject, throw a little distraction into the mix, and talk about anything other than the issue at hand. You do it quite well actually. Ever thought of running for office? This thread was about H. Dean, and you failed to mention him in your last 2 posts. Let's get our cows over their buckets.", 
   {}, 
   137087, 
   null, 
   1118788440.0
  ], 
  [
   137174, 
   null, 
   "Nwarth", 
   "You seem to have missed my argument. Mr. Dean IS the distraction. Instead of worrying about the failed state of Iraq, instead of looking the failures of their science policy, instead of looking at their extremely low polling, 33% in SS, instead of talking straight to the American people, admitting their mystakes, and moving forward they have the gall to attack Howard Dean and make what Dean says an issue. I'm sorry, but our boys and and girls are over in Iraq dying for lie, a lie that has not stopped!", 
   {}, 
   137163, 
   null, 
   1118790180.0
  ], 
  [
   137190, 
   null, 
   "Steeeeve", 
   "Ok Steeeve, \n \n You are doing just what Bush and his administration has done, pushed evidence to the side. I gave you the EPA's website. Pushed aside. It wasn't mr. shucks website but a GOVERNMENT website. A GOVERNMENT website that discusses global warming. Now you can keep your head in the dirt like an ostrich if you wish. Your children can do the same. But when the Caps are melted, New York City is under water/ice and temperatures are six degrees above that of the next ice age where I live then we will see who is correct. Granted neither of us will live to see it.\n \n I wish you would go to the EPA website, here it is again.\n \n http://yosemite.epa.gov/oar/globalwarming.nsf/content/Climate.html\n \n In addition global climate: \n \n http://yosemite.epa.gov/oar/globalwarming.nsf/550d4b46b29f68a6852568660081f938/85256d7a00686a5a85256bfe0057a2be/Body/0.154A!OpenElement&FieldElemFormat=gif\n \n Note the trend., and the sub. to the chart is: \"Increasing concentrations of greenhouse gases are likely to accelerate the rate of climate change. Scientists expect that the average global surface temperature could rise 1-4.5°F (0.6-2.5°C) in the next fifty years, and 2.2-10°F (1.4-5.8°C) in the next century, with significant regional variation. Evaporation will increase as the climate warms, which will increase average global precipitation. Soil moisture is likely to decline in many regions, and intense rainstorms are likely to become more frequent. Sea level is likely to rise two feet along most of the U.S. coast.\"\n \n And urge you to look at them. Be a bigger man than Bush and look at the evidence instead of pretending that the problem doesn't exist. Take off the Rose colored glasses, and LOOK.\n \n As for steady progress, I would like to see your definition of progress, from my position Iraq seems to be in regress. Again, standard of life continuously declining, number of deaths rising per incident, troop moral dropping, terrorist recruitment up, American recruitment down. HOW IS THIS PROGRESS?\n\n \n 120-150yrs is but a point on the long timeline of the history of the Earth. Until you show some evidence that it was cooler 5000 years ago then I am not going to believe a trend of 120yrs. It could easily be explained as a natural warm up. What about the Ice Ages? It warmed up after that...is that global warming as defined today? \n \n \n As for Iraq, I don't see how it is not progess. Less death trends, infastructure going up, attacks down (trend). I am not sure where this troop moral dropping came from but whatever. lol, even Bill Maher says ther eis progress, and he is extreme left :p. Don't listen to the wacko left.\n \n \nAnd you seem to be doing what most politicians do when backed into a corner with a real issue...change the subject, throw a little distraction into the mix, and talk about anything other than the issue at hand. You do it quite well actually. Ever thought of running for office? This thread was about H. Dean, and you failed to mention him in your last 2 posts. Let's get our cows over their buckets.\n\n \n A good point...\n \n Why isn't Dean talking about these issues that Nwarth claims are so important? Why is he talking about republicans being all white instead of the \"failed iraq policy\".", 
   {}, 
   137087, 
   null, 
   1118793180.0
  ], 
  [
   137219, 
   null, 
   "snakespit", 
   "Why isn't Dean talking about these issues that Nwarth claims are so important? Why is he talking about republicans being all white instead of the \"failed iraq policy\".\n\n Could not have said that better myself. \n \n Again, it is not the republicans that are making such a big deal about this, it is the media.", 
   {}, 
   137190, 
   null, 
   1118795700.0
  ], 
  [
   137289, 
   null, 
   "Nwarth", 
   "Listen, yes temperature does vary, yes global warming is going on without humans doing a thing. What we most likely ARE doing is speeding it up and making it worse. I mean after looking at the evidence I can't see how any rational individual would come to an contrary opinion.\n \n I don't know what it was like back then (5000 years ago), but Earth started as a fireball that then slowly cooled down. Since the atmosphere formed and the core stabilized the earth has been moving between ice ages and being uncomfortably hot. Weather is factored by many things, from caldera and flood-basalt volcanoes, to the greenhouse effect. We shouldn't view temperature as linear by any means. It is a dynamic system where we can only see broad trends that occur over time and then change after some point.\n \n At this time we are seeing a broad trend that points to global warming. The evidence is there, since we started keeping accurate records. As the above graph suggests this rate of warming is increasing faster and faster. \n \n \nLess death trends, infastructure going up, attacks down (trend).\n \n \n Incorrect, again as Myers said the other day, while attacks are down... MORE PEOPLE ARE DYING! Just today At least 22 individuals were killed. Infrastructure is also going down, as well as troop moral. Our soldiers \"own\" a road as long as they are on it. They are basically ants in a fortress, secure, but step out to go from fortress to fortress and they are in danger because they can't hold a road. And for you to brush off American troop moral is speaks volumns. These are the people who are putting their lives on the line. They are the key individuals out there for the war. They are dying... and you simply say \nbut whatever\n shows your own moral clarity... or lack thereof!", 
   {}, 
   137219, 
   null, 
   1118807280.0
  ], 
  [
   137304, 
   null, 
   "Steeeeve", 
   "Listen, yes temperature does vary, yes global warming is going on without humans doing a thing. What we most likely ARE doing is speeding it up and making it worse. I mean after looking at the evidence I can't see how any rational individual would come to an contrary opinion.\n \n I don't know what it was like back then (5000 years ago), but Earth started as a fireball that then slowly cooled down. Since the atmosphere formed and the core stabilized the earth has been moving between ice ages and being uncomfortably hot. Weather is factored by many things, from caldera and flood-basalt volcanoes, to the greenhouse effect. We shouldn't view temperature as linear by any means. It is a dynamic system where we can only see broad trends that occur over time and then change after some point.\n \n At this time we are seeing a broad trend that points to global warming. The evidence is there, since we started keeping accurate records. As the above graph suggests this rate of warming is increasing faster and faster. \n \n So how do you know this isn't just a normal trend of the Earth since you only have 120 so years of data? Which is no more then one data point on the graph of the history of earth. I will grant you that the earth is warming as the graph obviously shows...however, I have no reason to believe this is not a normal occurance of the earth that could very easily reverse in 100 years.\n \n \nIncorrect, again as Myers said the other day, while attacks are down... MORE PEOPLE ARE DYING! Just today At least 22 individuals were killed. Infrastructure is also going down, as well as troop moral. Our soldiers \"own\" a road as long as they are on it. They are basically ants in a fortress, secure, but step out to go from fortress to fortress and they are in danger because they can't hold a road. And for you to brush off American troop moral is speaks volumns. These are the people who are putting their lives on the line. They are the key individuals out there for the war. They are dying... and you simply say \n Can you show me where troop moral is going down? As for your other claims...I assume you have been to Iraq to witness this. And attacks are down..that is a good thing is it not?", 
   {}, 
   137289, 
   null, 
   1118810880.0
  ], 
  [
   137305, 
   null, 
   "Voice Of Reason", 
   "That's only a result of the limited choice of the two party system - the Republicans only win because the Democrats are so bad, and vice versa.\n\n \n Well why don't you step up and start a 3rd party.....Hell I might even vote for you candidate.......", 
   {}, 
   136891, 
   null, 
   1118811300.0
  ], 
  [
   137306, 
   null, 
   "Voice Of Reason", 
   "Dean plays to the left wing base of the democratic party.......People like Hydra love his hate speech against Republicans..........Problem is the democrats can enver win only playing to their base.........That was proven in the 2004 elections..........", 
   {}, 
   137305, 
   null, 
   1118811480.0
  ], 
  [
   137316, 
   null, 
   "snakespit", 
   "Well why don't you step up and start a 3rd party.....Hell I might even vote for you candidate.......\n\n It has been tried, but the 2 party system will never allow it to seriously happen. Such a shame. I admire people who can think for themselves and don't blindly toe the party line like a bunch of sheep.", 
   {}, 
   137305, 
   null, 
   1118812920.0
  ], 
  [
   139012, 
   null, 
   "SymonTemplar", 
   " \n Incorrect, again as Myers said the other day, while attacks are down... MORE PEOPLE ARE DYING! Just today At least 22 individuals were killed. Infrastructure is also going down, as well as troop moral. Our soldiers \"own\" a road as long as they are on it. They are basically ants in a fortress, secure, but step out to go from fortress to fortress and they are in danger because they can't hold a road. And for you to brush off American troop moral is speaks volumns. These are the people who are putting their lives on the line. They are the key individuals out there for the war. They are dying... and you simply say shows your own moral clarity... or lack thereof!\n\n \n There have been no significant attacks agaisnt Iraqi infrastrucure in months, as the base of operations and means to plan, stage, and carry out that level of strike was denied the insurgents when they lost Fallujah. They have since shifted their targeting to essentially crowds of of unsuspecting civilains, because these are the easiest tragets to attack and then only ones they have the ability to attack any longer.\n \n In regards to troop morale, recruiting has slipped, however the army and marines are meeting their retention goals, which is a fairly good gauge of troop morale. In addition the only reserve and ARNG units that met their retention goals were units that had actually served in Iraq. Another good indicator of actual troop morale.", 
   {}, 
   137289, 
   null, 
   1119224040.0
  ], 
  [
   139018, 
   null, 
   "georged", 
   "\n \n In regards to troop morale, recruiting has slipped, however the army and marines are meeting their retention goals, which is a fairly good gauge of troop morale. In addition the only reserve and ARNG units that met their retention goals were units that had actually served in Iraq. Another good indicator of actual troop morale.\n\n \n Recruiting goals have more than slipped, even with federal funding now requiring recruiters be allowed access to student contact records, which has opened another can of Big Brother worms in the form of very upset parents. \n \n Why wouldn't they meet retention goals with involuntary extensions from Operation Stop Watch?", 
   {}, 
   139012, 
   null, 
   1119224880.0
  ], 
  [
   140581, 
   null, 
   "SymonTemplar", 
   "Recruiting goals have more than slipped, even with federal funding now requiring recruiters be allowed access to student contact records, which has opened another can of Big Brother worms in the form of very upset parents. \n \n Why wouldn't they meet retention goals with involuntary extensions from Operation Stop Watch?\n\n \n Retention goals are met by people re-enlisting, not being held through stop loss. You have the two confused.\n \n Recruiting has fallen short. No doubt.", 
   {}, 
   139018, 
   null, 
   1119588240.0
  ], 
  [
   140593, 
   null, 
   "Voice Of Reason", 
   "I was watching CSPAN today and was listening to Kennedy questioning Rummy and the Generals running the war...........Kennedy went into his usual garbage about Iraq being a quagmire........At that point Rummy and the Generals gave that clown who calls himself and American both barrels........It was so great to see him cower there in his seat like a little kid.......Its clowns like him amd Durbin who are hurting the morale of the troops in the field in Iraq.......\n \n I think JFK would turn over in his grave if he saw what a scumbag his brother has become................", 
   {}, 
   140581, 
   null, 
   1119591300.0
  ], 
  [
   140658, 
   null, 
   "georged", 
   "Retention goals are met by people re-enlisting, not being held through stop loss. You have the two confused.\n \n Recruiting has fallen short. No doubt.\n\n \n You didn't read the post. Retention has been satisfactory because of Stop Watch. Involuntary extensions of enlistments.", 
   {}, 
   140581, 
   null, 
   1119618480.0
  ], 
  [
   140659, 
   null, 
   "georged", 
   "I was watching CSPAN today and was listening to Kennedy questioning Rummy and the Generals running the war...........Kennedy went into his usual garbage about Iraq being a quagmire........At that point Rummy and the Generals gave that clown who calls himself and American both barrels........It was so great to see him cower there in his seat like a little kid.......Its clowns like him amd Durbin who are hurting the morale of the troops in the field in Iraq.......\n \n I think JFK would turn over in his grave if he saw what a scumbag his brother has become................\n\n \n Why does the US general in charge of Iraq military operations disagree with Cheney's statement that resistance is 'on its last leg'?", 
   {}, 
   140593, 
   null, 
   1119618660.0
  ], 
  [
   140735, 
   null, 
   "SymonTemplar", 
   "You didn't read the post. Retention has been satisfactory because of Stop Watch. Involuntary extensions of enlistments.\n\n \n Trust me partner, I read plenty of articles and retention isnt being maintained single handidly by stop loss. I have read articles about RE-ENLISTMENT numbers, and more than one article.\n \n http://www.globalsecurity.org/military/library/news/2005/05/mil-050503-army01.htm\n \n \"As of the end of March, the Active Army re-enlisted 34,382 Soldiers, 106 percent of its mission for the first two quarters of the fiscal year. The Army was at about 90 percent of mission at this time last year and finished at 107 percent, boding well for the Army's retention mission this year.\n \n The Army Reserve re-enlisted 8,291 Soldiers, 100 percent of its year-to-date mission, as of the end of March. The Army National Guard re-enlisted 15,689 Soldiers, 100 percent of its year-to-date mission.\"", 
   {
    "unicode_changes_made": true
   }, 
   140658, 
   null, 
   1119635400.0
  ], 
  [
   140750, 
   null, 
   "georged", 
   "Trust me partner, I read plenty of articles and retention isnt being maintained single handidly by stop loss. I have read articles about RE-ENLISTMENT numbers, and more than one article.\n \n http://www.globalsecurity.org/military/library/news/2005/05/mil-050503-army01.htm\n \n \"As of the end of March, the Active Army re-enlisted 34,382 Soldiers, 106 percent of its mission for the first two quarters of the fiscal year. The Army was at about 90 percent of mission at this time last year and finished at 107 percent, boding well for the Army's retention mission this year.\n \n The Army Reserve re-enlisted 8,291 Soldiers, 100 percent of its year-to-date mission, as of the end of March. The Army National Guard re-enlisted 15,689 Soldiers, 100 percent of its year-to-date mission.\"\n\n \n I stand corrected.", 
   {
    "unicode_changes_made": true
   }, 
   140735, 
   null, 
   1119637080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is Dean crazier then Jackson?", 
  "url": "http://www.4forums.com/political/current-events-debates/5655-dean-crazier-then-jackson.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 5655, 
  "discussion_files": [
   [
    "26802.html", 
    "http://www.4forums.com/political/current-events-debates/5655-dean-crazier-then-jackson-print.html"
   ], 
   [
    "26803.html", 
    "http://www.4forums.com/political/current-events-debates/5655-dean-crazier-then-jackson-3-print.html"
   ], 
   [
    "26804.html", 
    "http://www.4forums.com/political/current-events-debates/5655-dean-crazier-then-jackson-2-print.html"
   ]
  ], 
  "identifier": 5655
 }
]