[
 [
  [
   137689, 
   null, 
   "Batman", 
   "From Opinion Journal - Best of the web today by JAMES TARANTO \n \n Sen. Dick Durbin, an Illinois Democrat, took the Senate floor yesterday and likened American servicemen to Nazis:\n \n When you read some of the graphic descriptions of what has occurred here [at Guantanamo Bay]--I almost hesitate to put them in the [Congressional] Record, and yet they have to be added to this debate. Let me read to you what one FBI agent saw. And I quote from his report: \n \n On a couple of occasions, I entered interview rooms to find a detainee chained hand and foot in a fetal position to the floor, with no chair, food or water. Most times they urinated or defecated on themselves, and had been left there for 18-24 hours or more. On one occasion, the air conditioning had been turned down so far and the temperature was so cold in the room, that the barefooted detainee was shaking with cold. . . . On another occasion, the [air conditioner] had been turned off, making the temperature in the unventilated room well over 100 degrees. The detainee was almost unconscious on the floor, with a pile of hair next to him. He had apparently been literally pulling his hair out throughout the night. On another occasion, not only was the temperature unbearably hot, but extremely loud rap music was being played in the room, and had been since the day before, with the detainee chained hand and foot in the fetal position on the tile floor. \n \n If I read this to you and did not tell you that it was an FBI agent describing what Americans had done to prisoners in their control, you would most certainly believe this must have been done by Nazis, Soviets in their gulags, or some mad regime--Pol Pot or others--that had no concern for human beings. Sadly, that is not the case. This was the action of Americans in the treatment of their prisoners.\n \n We are fighting an enemy that murdered 3,000 innocent people on American soil 3 1/2 years ago and would murder millions more if given the chance--and according to Dick Durbin, our soldiers are the Nazis.\n\n That's it little Dicky, compare us to Nazis and don't apologize.\n It didn't work for dems with Abu Graib in '04, I doubt this will in '06.", 
   {
    "post_info": {
     "post_title": "Sen. Durbin likened American servicemen to Nazis"
    }
   }, 
   null, 
   null, 
   1118898300.0
  ], 
  [
   137702, 
   null, 
   "Voice Of Reason", 
   "That's it little Dicky, compare us to Nazis and don't apologize.\n It didn't work for dems with Abu Graib in '04, I doubt this will in '06.\n\n \n Another left wing Liberal putting our military down.......\n \n What is ironic is the Liberals in her like Hydra say they don't do that.......\n \n Go figure...... emoticon_rolleyes", 
   {}, 
   137689, 
   null, 
   1118900460.0
  ], 
  [
   137714, 
   null, 
   "snakespit", 
   "Another left wing Liberal putting our military down.......\n \n What is ironic is the Liberals in her like Hydra say they don't do that.......\n \n Go figure...... emoticon_rolleyes\n\n Lumping all democrats in with 1 liberal retard seeking media attention only drawls more attention to your own retarded state of mind. After all, since you are a republican, doesn't that make you a white, radical right wing religous zealot who has never worked a day in your life? If that describes one republican according to Dr. Dean, it must refer to all of them...right?", 
   {}, 
   137702, 
   null, 
   1118906220.0
  ], 
  [
   137716, 
   null, 
   "daewoo", 
   "Another left wing Liberal putting our military down.......\n \n What is ironic is the Liberals in her like Hydra say they don't do that.......\n \n Go figure...... emoticon_rolleyes\n\n \n \n Yes, he couldn't possibly have been commenting on the official policy here, he was obviously just bashing the military as a whole. Personally, I disagree with his assesment. Psychological torture, which is realy what we are talkign about here (and yes, there are physical aspects to psychological torture) is really a more stalinistic thing than a nazi ploy. sure the nazis dablled, but really stalins boys wrote the book on it.", 
   {}, 
   137702, 
   null, 
   1118908920.0
  ], 
  [
   137718, 
   null, 
   "Symbiote", 
   "I don't believe \"American servicemen\" were being called Nazis, rather the treatment of prisoners was being called Nazi-like.\n \n It speaks volumes that some could care less about these activities, but are deeply concerned when someone calls them a bad name. I think what's really being objected to is anyone speaking out against American misbehaviour - if someone doesn't support or at least turn a blind eye to mistreatment of prisoners they must be a traitor.\n \n Frankly I think this assessment;\n \nIf I read this to you and did not tell you that it was an FBI agent describing what Americans had done to prisoners in their control, you would most certainly believe this must have been done by Nazis, Soviets in their gulags, or some mad regime--Pol Pot or others--that had no concern for human beings\n\n \n is apt, and though it isn't a mirror image of Nazi treatment per se, the idea being expressed is that this is treatment usually conducted by \"evil\" regimes, the Nazis given as simply one example of such a regime.\n \n But by all means, if you think that this is appropriate treatment of prisoners for the US government to be conducting, come out and say so - don't hide behind attacks on dissidents as unpatriotic, let us know what you think yourself.", 
   {}, 
   137716, 
   null, 
   1118909700.0
  ], 
  [
   137719, 
   null, 
   "Voice Of Reason", 
   "Lumping all democrats in with 1 liberal retard seeking media attention only drawls more attention to your own retarded state of mind. After all, since you are a republican, doesn't that make you a white, radical right wing religous zealot who has never worked a day in your life? If that describes one republican according to Dr. Dean, it must refer to all of them...right?\n\n \n Who is a Republican? emoticon_confused", 
   {}, 
   137714, 
   null, 
   1118909820.0
  ], 
  [
   137732, 
   null, 
   "Duo_Maxwell", 
   "Who is a Republican? emoticon_confused\n\n \n Obviously you. You support most of the party line, are rabidly anti-conservative and parrot most of the republican radio talk.", 
   {}, 
   137719, 
   null, 
   1118915580.0
  ], 
  [
   137749, 
   null, 
   "Desaix", 
   "Sorry here but Durbin does not say that the US soldiers are Naazi's but that some US soldiers did things that were comparable to what the Nazi's did to POW's.And clearly he's right.Try and read things more clearly in future.", 
   {}, 
   137732, 
   null, 
   1118926560.0
  ], 
  [
   137759, 
   null, 
   "Wez", 
   "It speaks volumes that some could care less about these activities, but are deeply concerned when someone calls them a bad name. \n\n I agree entirely.:)\n \n -Wez", 
   {}, 
   137718, 
   null, 
   1118930280.0
  ], 
  [
   137775, 
   null, 
   "Batman", 
   "Quote from Durbin:\n \n..but extremely loud rap music was being played in the room, and had been since the day before..\n\n I really don't see that as being Nazi style torture, or even torture, unless they played Vanilla Ice. emoticon_xclown \n \n When you object to something as silly as rap music being played, what you're saying is you object to any discomfort for those who could have information about harm planned for Americans. That speaks volumes.", 
   {}, 
   137749, 
   null, 
   1118933940.0
  ], 
  [
   137776, 
   null, 
   "Symbiote", 
   "Did Durbin object to the use of music on the grounds that it was rap, or is that you attempting to trivialise the discussion because you are incapable of mounting a case for the methods used on their own merits, Mule?", 
   {}, 
   137775, 
   null, 
   1118934120.0
  ], 
  [
   137777, 
   null, 
   "Wez", 
   "When you object to something as silly as rap music being played, what you're saying is you object to any discomfort for those who could have information about harm planned for Americans. That speaks volumes.\n\n No it doesn't, because people aren't objecting specifically to the rap music; they're objecting to the other conditions.\n \n You selected the \"least worst\" aspect and claimed people are moaning about that specifically: They are not.\n \n -Wez", 
   {}, 
   137775, 
   null, 
   1118934120.0
  ], 
  [
   137778, 
   null, 
   "Batman", 
   "Did Durbin object to the use of music on the grounds that it was rap, or is that you attempting to trivialise the discussion because you are incapable of mounting a case for the methods used on their own merits, Mule?\n\n I think he objected to the use of it because it was a form of discomfort for those of the devoted Muslim culture. Do you think rap music is torture?", 
   {}, 
   137776, 
   null, 
   1118934420.0
  ], 
  [
   137781, 
   null, 
   "Symbiote", 
   "Torture is a process, rap music is a thing. So no, rap music isn't torture, neither is dripping water, a vat of acid or a red hot poker. Nevertheless, many objects can be used to torture prisoners, and it is the torture that is being objected to.\n \n You still have not said whether you support the torture of POWs or not. If you're ashamed of expressing your opinion, perhaps you should get a new one.", 
   {}, 
   137778, 
   null, 
   1118934600.0
  ], 
  [
   137784, 
   null, 
   "Batman", 
   "Torture is a process, rap music is a thing. So no, rap music isn't torture, neither is dripping water, a vat of acid or a red hot poker. Nevertheless, many objects can be used to torture prisoners, and it is the torture that is being objected to.\n \n You still have not said whether you support the torture of POWs or not. If you're ashamed of expressing your opinion, perhaps you should get a new one.\n\n If we are trying to obtain info that can save American lives, then no, I don't object to this type of \"torture\" described in this article.\n \n I guess we have different ideas as to what torture is. For me, it would be screaming in agony for 33 seconds as my head was being sawed off with a knife with hooded men chanting as they did it.", 
   {}, 
   137781, 
   null, 
   1118935020.0
  ], 
  [
   137785, 
   null, 
   "jim's trucking", 
   "As I understand it, the detainees at Guantanamo Bay are fattening up because they have been getting three hots and a cot, unlike at their previous accomodations in the caves. I would hardly consider their treatment as being cruel. These prisoners are being treated fairly and have better accomodations than some of our county jails around the country.\n \n It is likely that every country on earth has used psychological and physical persuasion to obtain information from prisoners.\n \n Had our soldiers been treating them like the Nazis did their prisoners, we'd be hearing stories of leg muscles being peeled off as the prisoner screamed, or of stomachs being pumped full of soapy water 'til they burst, or teeth being drilled without novocaine, or something similar. What Senator Turban Durbin is asking you to believe is ludicrous. Abu Graebe and Guantanamo Bay have shown nothing any more cruel than some college initiation pranks have been.\n \n Senator Turban Durbin is making a theatrical plea for sympathy toward some bastards who qualify as deadly enemies.\n \n As for the guy pulling his own hair out, that was his own doing. As for the temperature being made uncomfortable, at least it wasn't cranked up to incinerator temperatures...as the God-forsaken Nazis did. How comfortable do you think the WTC victims were as they died in a pile of rubble? How comfortable and pleasant do you think it is to be blown to pieces by a terrorist's bomb? As for the prisoners urinating and defecating on themselves, I have heard of this within US prisons where the prisoners purposely do it just so someone will have to clean it up. Defiance takes many strange turns when one is locked in a cell.\n \n Some of you people sound as if you think these prisoners are just innocent little school children. Get a grip on reality and realize that we are dealing with beasts here.\n \n And remember...kill all terrorists and those who support them!", 
   {}, 
   137759, 
   null, 
   1118935140.0
  ], 
  [
   137788, 
   null, 
   "snakespit", 
   " Do you think rap music is torture?\n\n \n I think listening to it is akin to torture...does that count?", 
   {}, 
   137778, 
   null, 
   1118935380.0
  ], 
  [
   137789, 
   null, 
   "Symbiote", 
   "hooded men chanting as they did it.\n\n \n I don't really see that as being torture, unless they were chanting Vanilla Ice.\n \n When you object to something as silly as chanting by hooded men, that just shows how much you hate foreigners.\n \n \nI don't object to this type of \"torture\" described in this article.\n\n \n But the word Nazi hurts your feelings.", 
   {}, 
   137784, 
   null, 
   1118935440.0
  ], 
  [
   137794, 
   null, 
   "Batman", 
   "I don't really see that as being torture, unless they were chanting Vanilla Ice.\n\n You miss the point.\n \n Chanting \"Allah is great\" while doing such a thing, tells what kind of people we're dealing with.", 
   {}, 
   137789, 
   null, 
   1118935740.0
  ], 
  [
   137796, 
   null, 
   "Wez", 
   "As for the temperature being made uncomfortable, at least it wasn't cranked up to incinerator temperatures...as the God-forsaken Nazis did. \n\n Doesn't justify anything. Being \"better\" than the Nazi's doesn't make you good.\n \n \nHow comfortable do you think the WTC victims were as they died in a pile of rubble?\n\n Still not relevant, unless you really believe in \"eye for an eye\".\n \nHow comfortable and pleasant do you think it is to be blown to pieces by a terrorist's bomb?\n\n See above.\n \n \nAs for the prisoners urinating and defecating on themselves, I have heard of this within US prisons where the prisoners purposely do it just so someone will have to clean it up. Defiance takes many strange turns when one is locked in a cell.\n\n They were unable to go to the toilet for 18-24 hours; that's not crapping yourself because you want to, that's crapping yourself because you don't have a toilet.\n \n \nSome of you people sound as if you think these prisoners are just innocent little school children. Get a grip on reality and realize that we are dealing with beasts here.\n\n Why are some released then?\n \n \nIf we are trying to obtain info that can save American lives, then no, I don't object to this type of \"torture\" described in this article.\n\n Why is nationality relevant?\n \n -Wez", 
   {}, 
   137785, 
   null, 
   1118935860.0
  ], 
  [
   137797, 
   null, 
   "Symbiote", 
   "Fanatics who blindly support their racial/national or religious cause without regard for morality? \n \n I guess they have them over there, too.", 
   {}, 
   137794, 
   null, 
   1118935920.0
  ], 
  [
   137807, 
   null, 
   "Batman", 
   "\n Why is nationality relevant?\n\n Because some want all Americans dead, and I'm an American, so I guess that's why I think it could be relevant. emoticon_wow", 
   {}, 
   137796, 
   null, 
   1118936640.0
  ], 
  [
   137808, 
   null, 
   "Wez", 
   "Because some want all Americans dead, and I'm an American, so I guess that's why I think it could be relevant. emoticon_wow\n\n You miss my point. Why is it relevant that an [innocent] American live can be saved, as opposed to an [innocent] life of another nationality (Iraqi for example...)\n \n -Wez", 
   {}, 
   137807, 
   null, 
   1118937120.0
  ], 
  [
   137811, 
   null, 
   "Batman", 
   "You miss my point. Why is it relevant that an [innocent] American live can be saved, as opposed to an [innocent] life of another nationality (Iraqi for example...)\n \n -Wez\n\n O.k. I see what you're saying. You're right, it's any innocent life that can be saved that's relevant. It's just that when dealing with terrorists, Americans tend to be #1 on the list and thus my thinking.", 
   {}, 
   137808, 
   null, 
   1118937660.0
  ], 
  [
   137812, 
   null, 
   "Symbiote", 
   "So do you support torturing Americans to save Iraqi lives?", 
   {}, 
   137811, 
   null, 
   1118937720.0
  ], 
  [
   137813, 
   null, 
   "daewoo", 
   "You miss my point. Why is it relevant that an [innocent] American live can be saved, as opposed to an [innocent] life of another nationality (Iraqi for example...)\n \n -Wez\n\n \n Obviously because America is the greatest country in the world, and tehrefore americans should be granted special status. They should be above being killed for the **** poor foreign policy that their politicians enacted (and incidentally, americans approved of by proxy be re-electing politicians more often than any other nation on the planet).\n \n GET WITH IT. Obviously Iraqis, or Spaniards, or Turks, or Australians, should be lining up to die so that American lives can be saved. After all, america DID single handedly win WWII. The fact that we have supproted countyless dictators and tyrants since then, and engaged in gun boat trade negotiations that have turned hundreds of million sof non americans into virtual slaves of american corporations does not even bear consideration.", 
   {}, 
   137808, 
   null, 
   1118937840.0
  ], 
  [
   137815, 
   null, 
   "jim's trucking", 
   "Doesn't justify anything. Being \"better\" than the Nazi's doesn't make you good.\nYou miss the point. Doing something that does not in any way approach what the Nazis did DOES NOT justify comparison with the Nazis...as Senator Turban Durbin implies. The Nazis are on the far end of the scale when it comes to mistreating prisoners.\n \n \n\n Still not relevant, unless you really believe in \"eye for an eye\".\n \n See above.\n \nOh, I see...you're one of those \"let's forever turn our other cheek\" believers. \"It's okay if they kill us, we shouldn't do anything to hurt their feelings.\"\n \n This attitude will gain us nothing but death.\n \n \n \n\n They were unable to go to the toilet for 18-24 hours; that's not crapping yourself because you want to, that's crapping yourself because you don't have a toilet.\nThat's not what the article said. Don't misrepresent the article in favor of your point. The article said:\n \n \nOn a couple of occasions, I entered interview rooms to find a detainee chained hand and foot in a fetal position to the floor, with no chair, food or water. Most times they urinated or defecated on themselves, and had been left there for 18-24 hours or more.\nWell, let's see...on a couple of occasions (that's two occasions, according to most interpretations of \"couple\")\n \n The article doesn't say when the prisoner soiled himself. It could have happened right after he was put in the room...he could have done it in an act of defiance...he could have been left to stew in his own juices, so to speak. \n \n The article doesn't say the prisoner had been denied food or water. It simply says there was no food or water in the interview room. I think I have never seen an interview room fitted with food and water.\n \n The author is pulling on your heart strings to make it seem the prisoner has been grossly mistreated. \n \n ..and what does \"most times\" mean when you're talking about a couple of times.\n \n It would be quite different had our soldiers pulled out the prisoner's hair. It would be quite different had our soldiers urinated and defecated on the prisoners.\n \n It would be quite different...but they didn't do these things. The prisoners did these things to themselves.\n \n \n\n Why are some released then?\nI suppose they've either been cleared of charges and found to be no longer a significant danger to our welfare.", 
   {}, 
   137796, 
   null, 
   1118938140.0
  ], 
  [
   137821, 
   null, 
   "Wez", 
   "You miss the point. Doing something that does not in any way approach what the Nazis did DOES NOT justify comparison with the Nazis...as Senator Turban Durbin implies. The Nazis are on the far end of the scale when it comes to mistreating prisoners.\n\n Point taken. I don't particularly agree with the comparison, however it still doesn't justify any actions taken that may be \"wrong\", because they aren't as bad as the Nazis'.\n \n \nOh, I see...you're one of those \"let's forever turn our other cheek\" believers. \"It's okay if they kill us, we shouldn't do anything to hurt their feelings.\"\n\n Clearly you don't see.\n \n How was your comment about the WTC relevant other than trying to play on peoples' emotions? Put simply it wasn't.\n \n \nThat's not what the article said. Don't misrepresent the article in favor of your point. The article said:\n\n Can you hold your bladder for 18-24 hours? Can the prisoner hold his bladder for 18-24 hours? If no, then locking someone up for that period of time seems to force them to XXXX themselves.\n \n \nThe author is pulling on your heart strings to make it seem the prisoner has been grossly mistreated. \n\n I agree the article contains a lot of needless rhetoric. That doesn't mean it's all baseless rhetoric.\n \n \nI suppose they've either been cleared of charges and found to be no longer a significant danger to our welfare.\n\n The question was more pointing out that it's supporting the torture of those that may be innocent.\n \n -Wez", 
   {}, 
   137815, 
   null, 
   1118939400.0
  ], 
  [
   137824, 
   null, 
   "Batman", 
   "So do you support torturing Americans to save Iraqi lives?\n\n Clearly trying to imply that our military is sweeping the streets killing only innocent Iraqis. Nice try. :p", 
   {}, 
   137812, 
   null, 
   1118940180.0
  ], 
  [
   137825, 
   null, 
   "Symbiote", 
   "That wasn't my intention. Just answer the question Mule, do you support torturing Americans to save Iraqi lives?", 
   {}, 
   137824, 
   null, 
   1118940300.0
  ], 
  [
   137830, 
   null, 
   "jim's trucking", 
   "\n \n ...\n \n How was your comment about the WTC relevant other than trying to play on peoples' emotions? Put simply it wasn't.\nThe WTC collapse was an act of war. It should be remembered as a cruel, heartless act against humanity and specifically against the USA (even though it killed people from many nations).\n \n \n\n Can you hold your bladder for 18-24 hours? Can the prisoner hold his bladder for 18-24 hours? If no, then locking someone up for that period of time seems to force them to XXXX themselves.\nAgain, you missed the point. Suppose a detainee decides to pee in his pants right after he is taken into the interview room? He didn't have to hold anything for 18 hours. Suppose that after he pees in his own pants, he is left in the interview room for 18 hours to soak in his own pee. There is no direct connection between the fact that he peed in his pants and the amount of time he spent in the room. The same applies for the defecation.\n \n \n\n I agree the article contains a lot of needless rhetoric. That doesn't mean it's all baseless rhetoric.\nNot just the article, but Senator Turban Durbin's acting it out on the Senate floor did also.\n \n \n\n The question was more pointing out that it's supporting the torture of those that may be innocent.\nFrom what I've heard, there has been no torture. There you go again with the inflammatory wording.\n \n If what these terrorists bastards have been exposed to is torture, then we are torturing people all around the world in jails and prisons every day.\n \n I don't see that any of them or totally innocent anyway. They are likely somehow connected with terrorism or they wouldn't have been put there to start with. The little bit of hurt feelings of the few of them that may be completely innocent can be considered collateral damage.\n \n \n Kill all terrorists and those who support them!", 
   {}, 
   137821, 
   null, 
   1118940900.0
  ], 
  [
   137840, 
   null, 
   "Batman", 
   " Just answer the question Mule.\n\n I'm not up on the forum lingo here. Is this some type of name calling? If so, refrain from it before I come up with an appropriate one for you.", 
   {}, 
   137825, 
   null, 
   1118942160.0
  ], 
  [
   137851, 
   null, 
   "Kronus", 
   "If we are trying to obtain info that can save American lives, then no, I don't object to this type of \"torture\" described in this article.\n \n I guess we have different ideas as to what torture is. For me, it would be screaming in agony for 33 seconds as my head was being sawed off with a knife with hooded men chanting as they did it.\n\n \n Why is it than whenever someone is trying to justify the American use of torture they bring that up? What ethical logic are you using that has you starting with \"some people act like animals\" and brings you to the conclusion \"it's ok for me to act like an animal\"? How is other people acting badly in any way a justification for us acting badly? Simply put, it isn't. If you're going to act morally then you have to act morally all the time, not just when it's convinient, or just when the other guy is playing nicely. Otherwise your morallity isn't worth squat.", 
   {}, 
   137784, 
   null, 
   1118943060.0
  ], 
  [
   137852, 
   null, 
   "Dono", 
   "..... Do you think rap music is torture?\n\n While I won't concede that it is \"music\", from my prospective having to endure listening to it is a form of torture.\n Dono", 
   {}, 
   137778, 
   null, 
   1118943180.0
  ], 
  [
   137854, 
   null, 
   "Wez", 
   "The WTC collapse was an act of war. It should be remembered as a cruel, heartless act against humanity and specifically against the USA (even though it killed people from many nations).\n\n It still doesn't justify any wrong-doing done because of the attack.\n \n \nFrom what I've heard, there has been no torture. There you go again with the inflammatory wording.\n\n \n Look at the context of the quote. Batman first mentioned \"torture\". I used his words.\n \n \nAgain, you missed the point. Suppose a detainee decides to pee in his pants right after he is taken into the interview room? He didn't have to hold anything for 18 hours. Suppose that after he pees in his own pants, he is left in the interview room for 18 hours to soak in his own pee. There is no direct connection between the fact that he peed in his pants and the amount of time he spent in the room. The same applies for the defecation.\n\n Fair enough.\n \n -Wez", 
   {}, 
   137830, 
   null, 
   1118943300.0
  ], 
  [
   138585, 
   null, 
   "Voice Of Reason", 
   "Sorry here but Durbin does not say that the US soldiers are Naazi's but that some US soldiers did things that were comparable to what the Nazi's did to POW's.And clearly he's right.Try and read things more clearly in future.\n\n \n The Nazis killed millions of innocent civilians...How many innocent Civilians have our military killed in GITMO.......\n \n The comparison is outrageous and Durbin is hearing about it big time..........", 
   {}, 
   137749, 
   null, 
   1119082020.0
  ], 
  [
   138587, 
   null, 
   "Duo_Maxwell", 
   "The Nazis killed millions of innocent civilians...How many innocent Civilians have our military killed in GITMO.......\n \n The comparison is outrageous and Durbin is hearing about it big time..........\n\n \n Wow, talk about a massive reading comprehension problem, but I suppose that comes along with the territory of the extreme trailing edge of the IQ bell curve eh VOr? \n \n Desaix wasn't talking about the number of people killed, but the acts. \n Learn to seperate things. It will help when you reach high school.", 
   {}, 
   138585, 
   null, 
   1119082260.0
  ], 
  [
   138711, 
   null, 
   "jim's trucking", 
   "While I won't concede that it is \"music\", from my prospective having to endure listening to it is a form of torture.\n Dono\nYes. Making them get in a naked pile, wear panties on their heads, shiver and sweat, etc are not forms of torture. \n \n Making them listen to rap XXXX is cruel and inhumane! Our soldiers should be spanked for that! emoticon_xclown", 
   {}, 
   137852, 
   null, 
   1119133800.0
  ], 
  [
   138716, 
   null, 
   "jim's trucking", 
   "Wow, talk about a massive reading comprehension problem, but I suppose that comes along with the territory of the extreme trailing edge of the IQ bell curve eh VOr? \n \n Desaix wasn't talking about the number of people killed, but the acts.  \n Learn to seperate things. It will help when you reach high school.\n...and NOBODY has died at Gitmo. Comparison of the acts is invalid. I doubt that anything done to the Gitmo detainees has been Nazi-like. So the poor little bastards got cold, then hot...so they were chained in a fetal position on the floor. Big frickin' deal! They weren't skinned alive. They weren't gassed. They weren't shot. They weren't starved 'til thier skeletons were completely visible through the skin.\n \n They're provided with clean facilities and meals prepared in accordance with their religious beliefs. The fact that some of them wet themselves or defecated on the floor is an unfortunate thing, but just as likely as not, was their own doing.\n \n It's really a crying shame that most young people and some deniers of history don't understand (or won't admit) just how ruthless and inhumane the XXXXXXned Nazi's were.", 
   {}, 
   138587, 
   null, 
   1119134160.0
  ], 
  [
   138725, 
   null, 
   "Batman", 
   "\n It's really a crying shame that most young people and some deniers of history don't understand (or won't admit) just how ruthless and inhumane the XXXXXXned Nazi's were.\n\n I think it's more of a willingness to believe the worst about our galant men and women in uniform than anything else. It seems \"hip\" to hate your country and those fighting for it.", 
   {}, 
   138716, 
   null, 
   1119134820.0
  ], 
  [
   138727, 
   null, 
   "gnojek", 
   "A soldier is a soldier. American soldiers are like british soldiers are like belgian soldiers are like russian soldiers are like german soldiers.\n \n So saying american soldiers are like Nazi soldiers is just stating the obvious.", 
   {}, 
   137784, 
   null, 
   1119134940.0
  ], 
  [
   138740, 
   null, 
   "jim's trucking", 
   "A soldier is a soldier. American soldiers are like british soldiers are like belgian soldiers are like russian soldiers are like german soldiers.\n \n So saying american soldiers are like Nazi soldiers is just stating the obvious.\n...couldn't be farther from the truth. Study history, especially that of warfare nations and you will find that some nations have good morals and others don't.", 
   {}, 
   138727, 
   null, 
   1119136140.0
  ], 
  [
   138741, 
   null, 
   "jim's trucking", 
   "I think it's more of a willingness to believe the worst about our galant men and women in uniform than anything else. It seems \"hip\" to hate your country and those fighting for it.\n...and some people seem to do this just because they have the freedom here to do so.", 
   {}, 
   138725, 
   null, 
   1119136200.0
  ], 
  [
   138749, 
   null, 
   "Jo Bennett", 
   "...couldn't be farther from the truth. Study history, especially that of warfare nations and you will find that some nations have good morals and others don't.\n\n \n That might be true of commanders, but soldiers have a tendency to follow orders regardless of the morality involved. That has to be the case or war would never get off the ground. There are plenty of massacres of civilians by US forces I can pull out as examples, but I don't think I need to.", 
   {}, 
   138740, 
   null, 
   1119136680.0
  ], 
  [
   138752, 
   null, 
   "Wez", 
   "...couldn't be farther from the truth. Study history, especially that of warfare nations and you will find that some nations have good morals and others don't.\n\n Leaders differ, but I expect your average soldier is pretty similar.\n \n -Wez", 
   {}, 
   138740, 
   null, 
   1119136860.0
  ], 
  [
   138759, 
   null, 
   "jim's trucking", 
   "That might be true of commanders, but soldiers have a tendency to follow orders regardless of the morality involved. That has to be the case or war would never get off the ground. There are plenty of massacres of civilians by US forces I can pull out as examples, but I don't think I need to.\nTheoretically, this is true. However, there have been nations with particularly violent eager-to-kill-others soldiers and nations with reluctant do-we-really-have-to soldiers.\n \n Mali warriors are likely more fierce and eager to kill than most others. There were differences between the warriors among the American Indian tribes.\n \n To say a soldier is a soldier is a soldier does not credit the genetic and historical differences between nations. \n \n I'd much rather have a Scots-Irishman fighting beside me than a Frenchman. The Scots-Irish give it their all..The French look for an easy way out!", 
   {}, 
   138749, 
   null, 
   1119137640.0
  ], 
  [
   138818, 
   null, 
   "Voice Of Reason", 
   "A soldier is a soldier. American soldiers are like british soldiers are like belgian soldiers are like russian soldiers are like german soldiers.\n \n So saying american soldiers are like Nazi soldiers is just stating the obvious.\n\n \n \n Unbelieveable logic even from a person who hates the U.S. Military.......\n \n Shame on you..........", 
   {}, 
   138727, 
   null, 
   1119161040.0
  ], 
  [
   138823, 
   null, 
   "Duo_Maxwell", 
   "...and NOBODY has died at Gitmo.\n\n \n You sure about that? I seriously disagree. \n \n \nI doubt that anything done to the Gitmo detainees has been Nazi-like.\n \n\n \n Was the following all that is Nazi-like?", 
   {}, 
   138716, 
   null, 
   1119163680.0
  ], 
  [
   139219, 
   null, 
   "gnojek", 
   "...couldn't be farther from the truth. Study history, especially that of warfare nations and you will find that some nations have good morals and others don't.\n\n Nations may not be nations, but soldiers are soldiers.", 
   {}, 
   138740, 
   null, 
   1119294420.0
  ], 
  [
   139221, 
   null, 
   "gnojek", 
   "Unbelieveable logic even from a person who hates the U.S. Military.......\n \n Shame on you..........\n\n That's right, I hate them. You called it. emoticon_rolleyes \n \n But now that I think about it, all soldiers throughout history are not the same.\n \n The modern american soldier isn't much like the raping pillaging japanese soldier pre-WWII. Nor are they like the Norse warriors raping and pillaging. But they are also not like the soldiers of 18th-19th century Europe.", 
   {}, 
   138818, 
   null, 
   1119294660.0
  ], 
  [
   141192, 
   null, 
   "Nurglitch", 
   "What did Durbin actually say? Well: \nFloor Statement by Senator Richard J. Durbin on\n \n Guantanamo Bay\n \n June 14, 2005\n \n Mr. President, there has been a lot of discussion in recent days about whether to close the detention center at Guantanamo Bay. This debate misses the point. It is not a question of whether detainees are held at Guantanamo Bay or some other location. The question is how we should treat those who have been detained there. Whether we treat them according to the law or not does not depend on their address. It depends on our policy as a nation.\n \n How should we treat them? This is not a new question. We are not writing on a blank slate. We have entered into treaties over the years, saying this is how we will treat wartime detainees. The United States has ratified these treaties. They are the law of the land as much as any statute we passed. They have served our country well in past wars. We have held ourselves to be a civilized country, willing to play by the rules, even in time of war.\n \n Unfortunately, without even consulting Congress, the Bush administration unilaterally decided to set aside these treaties and create their own rules about the treatment of prisoners.\n \n Frankly, this Congress has failed to hold the administration accountable for its failure to follow the law of the land when it comes to the torture and mistreatment of prisoners and detainees.\n \n I am a member of the Judiciary Committee. For two years, I have asked for hearings on this issue. I am glad Chairman Specter will hold a hearing on wartime detention policies tomorrow. I thank him for taking this step. I wish other members of his party would be willing to hold this administration accountable as well.\n \n It is worth reflecting for a moment about how we have reached this point. Many people who read history remember, as World War II began with the attack on Pearl Harbor, a country in fear after being attacked decided one way to protect America was to gather together Japanese Americans and literally imprison them, put them in internment camps for fear they would be traitors and turn on the United States. We did that. Thousands of lives were changed. Thousands of businesses destroyed. Thousands of people, good American citizens, who happened to be of Japanese ancestry, were treated like common criminals.\n \n It took almost 40 years for us to acknowledge that we were wrong, to admit that these people should never have been imprisoned. It was a shameful period in American history and one that very few, if any, try to defend today.\n \n I believe the torture techniques that have been used at Abu Ghraib and Guantanamo and other places fall into that same category. I am confident, sadly confident, as I stand here, that decades from now people will look back and say: What were they thinking? America, this great, kind leader of a nation, treated people who were detained and imprisoned, interrogated people in the crudest way? I am afraid this is going to be one of the bitter legacies of the invasion of Iraq.\n \n We were attacked on September 11, 2001. We were clearly at war.\n \n We have held prisoners in every armed conflict in which we have engaged. The law was clear, but some of the President's top advisers questioned whether we should follow it or whether we should write new standards.\n \n Alberto Gonzales, then-White House chief counsel, recommended to the President the Geneva Convention should not apply to the war on terrorism.\n \n Colin Powell, who was then Secretary of State, objected strenuously to Alberto Gonzales' conclusions. I give him credit. Colin Powell argued that we could effectively fight the war on terrorism and still follow the law, still comply with the Geneva Conventions. In a memo to Alberto Gonzales, Secretary Powell pointed out the Geneva Conventions would not limit our ability to question the detainees or hold them even indefinitely. He pointed out that under Geneva Conventions, members of al-Qaida and other terrorists would not be considered prisoners of war.\n \n There is a lot of confusion about that so let me repeat it. The Geneva Conventions do not give POW status to terrorists.\n \n In his memo to Gonzales, Secretary Powell went on to say setting aside the Geneva Conventions will reverse over a century of U.S. policy and practice... and undermine the protections of the law of war for our own troops... It will undermine public support among critical allies, making military cooperation more difficult to sustain.\n \n When you look at the negative publicity about Guantanamo, Secretary Colin Powell was prophetic.\n \n Unfortunately, the President rejected Secretary Powell's wise counsel, and instead accepted Alberto Gonzales' recommendation, issuing a memo setting aside the Geneva Conventions and concluding that we needed new thinking in the law of war.\n \n After the President decided to ignore Geneva Conventions, the administration unilaterally created a new detention policy. They claim the right to seize anyone, including even American citizens, anywhere in the world, including in the United States, and hold them until the end of the war on terrorism, whenever that may be.\n \n For example, they have even argued in court they have the right to indefinitely detain an elderly lady from Switzerland who writes checks to what she thinks is a charity that helps orphans but actually is a front that finances terrorism.\n \n They claim a person detained in the war on terrorism has no legal rights -- no right to a lawyer, no right to see the evidence against them, no right to challenge their detention. In fact, the Government has claimed detainees have no right to challenge their detention, even if they claim they were being tortured or executed.\n \n This violates the Geneva Conventions, which protect everyone captured during wartime. The official commentary on the convention states: Nobody in enemy hands can fall outside the law.\n \n That is clear as it can be. But it was clearly rejected by the Bush administration when Alberto Gonzales as White House counsel recommended otherwise.\n \n U.S. military lawyers called this detention system a legal black hole. The Red Cross concluded, U.S. authorities have placed the internees in Guantanamo beyond the law.\n \n Using their new detention policy, the administration has detained thousands of individuals in secret detention centers all around the world, some of them unknown to Members of Congress. While it is the most well-known, Guantanamo Bay is only one of them. Most have been captured in Afghanistan and Iraq, but some people who never raised arms against us have been taken prisoner far from the battlefield.\n \n Who are the Guantanamo detainees? Back in 2002, Secretary Rumsfeld described them as the hardest of the hard core. However, the administration has since released many of them, and it has now become clear that Secretary Rumsfeld's assertion was not completely true.\n \n Military sources, according to the media, indicate that many detainees have no connection to al-Qaida or the Taliban and were sent to Guantanamo over the objections of intelligence personnel who recommended their release. One military officer said: We're basically condemning these guys to a long-term imprisonment. If they weren't terrorists before, they certainly could be now.\n \n Last year, in two landmark decisions, the Supreme Court rejected the administration's detention policy. The Court held that the detainees' claims that they were detained for over two years without charge and without access to counsel unquestionably describe custody in violation of the Constitution, or laws or treaties of the United States.\n \n The Court also held that an American citizen held as an enemy combatant must be told the basis for his detention and have a fair opportunity to challenge the Government's claims. Justice Sandra Day O'Connor wrote for the majority: A state of war is not a blank check for the President when it comes to the rights of the Nation's citizens.\n \n You would think that would be obvious, wouldn't you? But yet, this administration, in this war, has viewed it much differently.\n \n I had hoped the Supreme Court decision would change the administration policy. Unfortunately, the administration has resisted complying with the Supreme Court's decision.\n \n The administration acknowledges detainees can challenge their detention in court, but it still claims that once they get to court, they have no legal rights. In other words, the administration believes a detainee can get to the courthouse door but cannot come inside.\n \n A Federal court has already held the administration has failed to comply with the Supreme Court's rulings. The court concluded that the detainees do have legal rights, and the administration's policies deprive the detainees of sufficient notice of the factual bases for their detention and deny them a fair opportunity to challenge their incarceration.\n \n The administration also established a new interrogation policy that allows cruel and inhuman interrogation techniques.\n \n Remember what Secretary of State Colin Powell said? It is not a matter of following the law because we said we would, it is a matter of how our troops will be treated in the future. That is something often overlooked here. If we want standards of civilized conduct to be applied to Americans captured in a warlike situation, we have to extend the same manner and type of treatment to those whom we detain, our prisoners.\n \n Secretary Rumsfeld approved numerous abusive interrogation tactics against prisoners in Guantanamo. The Red Cross concluded that the use of those methods was \"a form of torture.\"\n \n The United States, which each year issues a human rights report, holding the world accountable for outrageous conduct, is engaged in the same outrageous conduct when it comes to these prisoners.\n \n Numerous FBI agents who observed interrogations at Guantanamo Bay complained to their supervisors. In one e-mail that has been made public, an FBI agent complained that interrogators were using torture techniques.\n \n That phrase did not come from a reporter or politician. It came from an FBI agent describing what Americans were doing to these prisoners.\n \n With no input from Congress, the administration set aside our treaty obligations and secretly created new rules for detention and interrogation. They claim the courts have no right to review these rules. But under our Constitution, it is Congress's job to make the laws, and the court's job to judge whether they are constitutional.\n \n This administration wants all the power: legislator, executive, and judge. Our founding father were warned us about the dangers of the Executive Branch violating the separation of powers during wartime. James Madison wrote: The accumulation of all powers, legislative, executive, and judiciary, in the same hands may justly be pronounced the very definition of tyranny.\n \n Other Presidents have overreached during times of war, claiming legislative powers, but the courts have reined them back in. During the Korean war, President Truman, faced with a steel strike, issued an Executive order to seize and operate the Nation's steel mills. The Supreme Court found that the seizure was an unconstitutional infringement on the Congresss lawmaking power. Justice Hugo Black, writing for the majority, said: The Constitution is neither silent nor equivocal about who shall make the laws which the President is to execute ... The Founders of this Nation entrusted the lawmaking power to the Congress alone in both good times and bad.\n \n To win the war on terrorism, we must remain true to the principles upon which our country was founded. This Administrations detention and interrogation policies are placing our troops at risk and making it harder to combat terrorism.\n \n Former Congressman Pete Peterson of Florida, a man I call a good friend and a man I served with in the House of Representatives, is a unique individual. He is one of the most cheerful people you would ever want to meet. You would never know, when you meet him, he was an Air Force pilot taken prisoner of war in Vietnam and spent 6 1/2 years in a Vietnamese prison. Here is what he said about this issue in a letter that he sent to me. Pete Peterson wrote:\n \n From my 6 1/2 years of captivity in Vietnam, I know what life in a foreign prison is like. To a large degree, I credit the Geneva Conventions for my survival....This is one reason the United States has led the world in upholding treaties governing the status and care of enemy prisoners: because these standards also protect us....We need absolute clarity that America will continue to set the gold standard in the treatment of prisoners in wartime.\n \n Abusive detention and interrogation policies make it much more difficult to win the support of people around the world, particularly those in the Muslim world. The war on terrorism is not a popularity contest, but anti-American sentiment breeds sympathy for anti-American terrorist organizations and makes it far easier for them to recruit young terrorists.\n \n Polls show that Muslims have positive attitudes toward the American people and our values. However, overall, favorable ratings toward the United States and its Government are very low. This is driven largely by the negative attitudes toward the policies of this administration.\n \n Muslims respect our values, but we must convince them that our actions reflect these values. Thats why the 9/11 Commission recommended: We should offer an example of moral leadership in the world, committed to treat people humanely, abide by the rule of law, and be generous and caring to our neighbors.\n \n What should we do? Imagine if the President had followed Colin Powell's advice and respected our treaty obligations. How would things have been different?\n \n We still would have the ability to hold detainees and to interrogate them aggressively. Members of al-Qaida would not be prisoners of war. We would be able to do everything we need to do to keep our country safe. The difference is, we would not have damaged our reputation in the international community in the process.\n \n When you read some of the graphic descriptions of what has occurred here -- I almost hesitate to put them in the record, and yet they have to be added to this debate. Let me read to you what one FBI agent saw. And I quote from his report:\n \n On a couple of occasions, I entered interview rooms to find a detainee chained hand and foot in a fetal position to the floor, with no chair, food or water. Most times they urinated or defecated on themselves, and had been left there for 18-24 hours or more. On one occasion, the air conditioning had been turned down so far and the temperature was so cold in the room, that the barefooted detainee was shaking with cold....On another occasion, the [air conditioner] had been turned off, making the temperature in the unventilated room well over 100 degrees. The detainee was almost unconscious on the floor, with a pile of hair next to him. He had apparently been literally pulling his hair out throughout the night. On another occasion, not only was the temperature unbearably hot, but extremely loud rap music was being played in the room, and had been since the day before, with the detainee chained hand and foot in the fetal position on the tile floor.\n \n If I read this to you and did not tell you that it was an FBI agent describing what Americans had done to prisoners in their control, you would most certainly believe this must have been done by Nazis, Soviets in their gulags, or some mad regime -- Pol Pot or others -- that had no concern for human beings. Sadly, that is not the case. This was the action of Americans in the treatment of their prisoners.\n \n It is not too late. I hope we will learn from history. I hope we will change course.\n \n The President could declare the United States will apply the Geneva Conventions to the war on terrorism. He could declare, as he should, that the United States will not, under any circumstances, subject any detainee to torture, or cruel, inhuman, or degrading treatment. The administration could give all detainees a meaningful opportunity to challenge their detention before a neutral decisionmaker.\n \n Such a change of course would dramatically improve our image and it would make us safer. I hope this administration will choose that course. If they do not, Congress must step in.\n \n The issue debated in the press today misses the point. The issue is not about closing Guantanamo Bay. It is not a question of the address of these prisoners. It is a question of how we treat these prisoners. To close down Guantanamo and ship these prisoners off to undisclosed locations in other countries, beyond the reach of publicity, beyond the reach of any surveillance, is to give up on the most basic and fundamental commitment to justice and fairness, a commitment we made when we signed the Geneva Convention and said the United States accepts it as the law of the land, a commitment which we have made over and over again when it comes to the issue of torture. To criticize the rest of the world for using torture and to turn a blind eye to what we are doing in this war is wrong, and it is not American.\n \n During the Civil War, President Lincoln, one of our greatest presidents, suspended habeas corpus, which gives prisoners the right to challenge their detention. The Supreme Court stood up to the President and said prisoners have the right to judicial review even during war.\n \n Let me read what that Court said:\n \n The Constitution of the United States is a law for rulers and people, equally in war and in peace, and covers with the shield of its protection all classes of men, at all times, and under all circumstances. No doctrine, involving more pernicious consequences, was ever invented by the wit of man than that any of its provisions could be suspended during any of the great exigencies of government. Such a doctrine leads directly to anarchy or despotism.\n \n Mr. President, those words still ring true today. The Constitution is a law for this administration, equally in war and in peace. If the Constitution could withstand the Civil War, when our nation was literally divided against itself, surely it will withstand the war on terrorism.\n \n I yield the floor.\n", 
   {}, 
   139221, 
   null, 
   1119743520.0
  ], 
  [
   145029, 
   null, 
   "Ghost", 
   "...some US soldiers did things that were comparable to what the Nazi's did to POW's.And clearly he's right...\n\n \n You ever seen 'Schindler's List?' How about ever read a book about the Holocaust? I'm guessing not, because you have no clue what you're talking about. There is a HUGE difference between using psychological 'torture' if you wanna call it that for the purposes of extracting information and what the Nazis did. Not providing a detainee air conditioning is as bad as the Nazis? Playing rap music too loud? Hell, even chaining someone in a room for long periods of time...sure, it's unpleasant, perhaps to a great degree. But come on, I'd rather go through all of that than endure a Nazi POW or concentration camp.", 
   {}, 
   137749, 
   null, 
   1120649400.0
  ], 
  [
   145115, 
   null, 
   "Desaix", 
   "You ever seen 'Schindler's List?' How about ever read a book about the Holocaust? I'm guessing not, because you have no clue what you're talking about. There is a HUGE difference between using psychological 'torture' if you wanna call it that for the purposes of extracting information and what the Nazis did. Not providing a detainee air conditioning is as bad as the Nazis? Playing rap music too loud? Hell, even chaining someone in a room for long periods of time...sure, it's unpleasant, perhaps to a great degree. But come on, I'd rather go through all of that than endure a Nazi POW or concentration camp.\n\n \n emoticon_rolleyes \n \n Were dealing with what Durbin actually said here,not what you seem to think was implied.\n \n \nIf I read this to you and did not tell you that it was an FBI agent describing what Americans had done to prisoners in their control, you would most certainly believe this must have been done by Nazis, Soviets in their gulags, or some mad regime -- Pol Pot or others -- that had no concern for human beings. Sadly, that is not the case. This was the action of Americans in the treatment of their prisoners.\n\n \n What he says is that some of the American actions in Gitmo can be compared to Soviet actions in the Gulags or Nazi actions in POW camps.Those this mean that he thinks the American soldiers regurly go around beating up and killing prisoners in horrible ways in Gitmo like the Nazi's use to?No!!!", 
   {}, 
   145029, 
   null, 
   1120674720.0
  ], 
  [
   145136, 
   null, 
   "jim's trucking", 
   "emoticon_rolleyes \n \n Were dealing with what Durbin actually said here,not what you seem to think was implied.\n \n \n \n What he says is that some of the American actions in Gitmo can be compared to Soviet actions in the Gulags or Nazi actions in POW camps. Does this mean that he thinks the American soldiers regurly go around beating up and killing prisoners in horrible ways in Gitmo like the Nazi's use to?No!!!\nHere is the center point of his speech:\n \n \n...\n \n When you read some of the graphic descriptions of what has occurred here -- I almost hesitate to put them in the record, and yet they have to be added to this debate. Let me read to you what one FBI agent saw. And I quote from his report:\n \n On a couple of occasions, I entered interview rooms to find a detainee chained hand and foot in a fetal position to the floor, with no chair, food or water. Most times they urinated or defecated on themselves, and had been left there for 18-24 hours or more. On one occasion, the air conditioning had been turned down so far and the temperature was so cold in the room, that the barefooted detainee was shaking with cold....On another occasion, the [air conditioner] had been turned off, making the temperature in the unventilated room well over 100 degrees. The detainee was almost unconscious on the floor, with a pile of hair next to him. He had apparently been literally pulling his hair out throughout the night. On another occasion, not only was the temperature unbearably hot, but extremely loud rap music was being played in the room, and had been since the day before, with the detainee chained hand and foot in the fetal position on the tile floor.\n \n If I read this to you and did not tell you that it was an FBI agent describing what Americans had done to prisoners in their control, you would most certainly believe this must have been done by Nazis, Soviets in their gulags, or some mad regime -- Pol Pot or others -- that had no concern for human beings. Sadly, that is not the case. This was the action of Americans in the treatment of their prisoners.\n \n ...\n \n \nThat, my friend, is an unjust characterization. The rest of his speech says nothing to diminish the comparison to one between the mildest of Gulag, Nazi or Pol Pot torture and the actions of US soldiers at Gitmo. It was meant as a stinging theatrical argument to raise the ire of braindead Bushwhackers and enemies of the USA.\n \n Unfortunately, mistreatment of detainees is commonplace at every level, in every country. I would vote to see it stopped, but even when it's against the rules of the establishment, it happens anyway. There's little way to police it without 24 hour video surveillance which would be unwelcomed even by the prisoners being protected.", 
   {}, 
   145115, 
   null, 
   1120679460.0
  ], 
  [
   145154, 
   null, 
   "daewoo", 
   "Here is the center point of his speech:\n \n That, my friend, is an unjust characterization. The rest of his speech says nothing to diminish the comparison to one between the mildest of Gulag, Nazi or Pol Pot torture and the actions of US soldiers at Gitmo. It was meant as a stinging theatrical argument to raise the ire of braindead Bushwhackers and enemies of the USA.\n \n Unfortunately, mistreatment of detainees is commonplace at every level, in every country. I would vote to see it stopped, but even when it's against the rules of the establishment, it happens anyway. There's little way to police it without 24 hour video surveillance which would be unwelcomed even by the prisoners being protected.\n\n \n \n You can paint it however you want. The simple fact of the matter is we are torturing prisoners, and that is not behavior that is consistent with the image Americans like to pretend we hold. \n \n this is not a matter of prisoner mistreatment that needs to be policed. Thesse are the policies oru current administration has adopted, and they have gone out of their way to convince people that they are not illegal, when in fact they are.\n \n the primary problem with turning to torture is that the only protection Americans soldiers have against torture are the very laws that the Bush administration is seeking to redefine insuch a manner that torture, indeifnite imporsonment, etc... is somehow OK. Howe are you going to feel baout this 5 years down the line when US soldiers are being tortured and the opposition is claiming it is OK becuase the US changed the definition?\n \n You woul dthink they would have learned their lesson during the war when we accused the IRaqis of violating the geneva convention by showing POWS on tv. Nobody took any notice because we (the US) had been showing POWs on TV for weeks. \n \n Rules like the geneva convention, and laws against torture, serve to protect soldiers on boith sides fo the conflict. Breaking those rules, or materialy changing them, is an affront not only to the rule of law, but to your own soldiers as well.", 
   {}, 
   145136, 
   null, 
   1120684260.0
  ], 
  [
   145199, 
   null, 
   "Squawker", 
   "The fact remains that a US Senator made statements on the floor of the Senate that Al Jazeera is using as propaganda against us and our troops. He knew the camera was recording every word, and should have know better. He should resign IMO.", 
   {}, 
   145154, 
   null, 
   1120694100.0
  ], 
  [
   145201, 
   null, 
   "lord tammerlain", 
   "The fact remains that a US Senator made statements on the floor of the Senate that Al Jazeera is using as propaganda against us and our troops. He knew the camera was recording every word, and should have know better. He should resign IMO.\n\n \n \n Perhaps if the conditions that he talked about did not exist, he would not have commented on them, and Al Jazeera would not have reported it?\n \n Perhaps the people who allowed the conditions that he commented about should resign?", 
   {}, 
   145199, 
   null, 
   1120694400.0
  ], 
  [
   145235, 
   null, 
   "Squawker", 
   "Perhaps if the conditions that he talked about did not exist, he would not have commented on them, and Al Jazeera would not have reported it?\n \n Perhaps the people who allowed the conditions that he commented about should resign?\n Why should they? None of what he described would have happened in Nazi Germany or any other country. That wasn't even on the list of their torture techniques. Why would anyone think they would pander to their prisoners like Americans do? Do you think they used Rock music or turned the air conditioner off? That is funny. What is the temperature in Iraq where our troops are camped out eating sea rations?", 
   {
    "unicode_changes_made": true
   }, 
   145201, 
   null, 
   1120698660.0
  ], 
  [
   145238, 
   null, 
   "Voice Of Reason", 
   "emoticon_rolleyes \n \n Were dealing with what Durbin actually said here,not what you seem to think was implied.\n \n \n \n What he says is that some of the American actions in Gitmo can be compared to Soviet actions in the Gulags or Nazi actions in POW camps.Those this mean that he thinks the American soldiers regurly go around beating up and killing prisoners in horrible ways in Gitmo like the Nazi's use to?No!!!\n\n \n No prisoner has been murdered in GITMO.........Do I have to tell you how many Hitler and Stalin murdered?\n \n Why do you think apologized on the floor of the Senate? He knew he opened mouth and inserted foot...........Like \"Hanoi\" Jane Fonda we don't accept his apology..........", 
   {}, 
   145115, 
   null, 
   1120699440.0
  ], 
  [
   145302, 
   null, 
   "Voice Of Reason", 
   "Perhaps if the conditions that he talked about did not exist, he would not have commented on them, and Al Jazeera would not have reported it?\n \n Perhaps the people who allowed the conditions that he commented about should resign?\n\n \n What part of we have not murdered one terrorist in GITMO do you not understand??????......You want to know what real torture is? Ask John McCain, he can tell you what it feels like to be really tortured........You apologizers for Durbin and that scumbag in GITMO make me sick........They never had it so good.....Get a clue!!!!\n \n \n \nWhy should they? None of what he described would have happened in Nazi Germany or any other country. That wasn't even on the list of their torture techniques. Why would anyone think they would pander to their prisoners like Americans do? Do you think they used Rock music or turned the air conditioner off? That is funny. What is the temperature in Iraq where our troops are camped out eating sea rations?\n \n \n Right on, the Liberals in this forum wouldn't know real torture if it hit them right in the face....................", 
   {
    "unicode_changes_made": true
   }, 
   145201, 
   null, 
   1120710840.0
  ], 
  [
   145323, 
   null, 
   "daewoo", 
   "Why should they? None of what he described would have happened in Nazi Germany or any other country. That wasn't even on the list of their torture techniques. Why would anyone think they would pander to their prisoners like Americans do? Do you think they used Rock music or turned the air conditioner off? That is funny. What is the temperature in Iraq where our troops are camped out eating sea rations?\n\n \n Sorry, you are wrong. It seems to be a pattern. The psychological torture techniqes that we teach in the US were originally developed by Stalin. The barking dogs, loud music, temperature extremes, strobe lights, etc... were all developed by the soviets under stalin. I have said before that the comparison betweent he US and the nazis in this case is incorrect. Teh comparison btwn the US and stalin, though, is spot on.", 
   {
    "unicode_changes_made": true
   }, 
   145235, 
   null, 
   1120713840.0
  ], 
  [
   145668, 
   null, 
   "Squawker", 
   "Sorry, you are wrong. It seems to be a pattern. The psychological torture techniqes that we teach in the US were originally developed by Stalin. The barking dogs, loud music, temperature extremes, strobe lights, etc... were all developed by the soviets under stalin. I have said before that the comparison betweent he US and the nazis in this case is incorrect. Teh comparison btwn the US and stalin, though, is spot on.\n I expect it was in reverse. Stalin wrote a new Constitution that had parts similar to ours also. He didn't follow any part of it, and was responsible for killing tens of millions of his own people. To compare what our people are doing to any two bit dictator in the world is a national slap in the face.", 
   {
    "unicode_changes_made": true
   }, 
   145323, 
   null, 
   1120784880.0
  ], 
  [
   145714, 
   null, 
   "daewoo", 
   "I expect it was in reverse. Stalin wrote a new Constitution that had parts similar to ours also. He didn't follow any part of it, and was responsible for killing tens of millions of his own people. To compare what our people are doing to any two bit dictator in the world is a national slap in the face.\n\n \n \"Our People\" are using psychological torture techniqes that were developed by Stalin. I would say that comparing the two is natural, and inevitable. \n \n He ignored his constitution, we are starting to ignore our. Again, the comparison is inevitable.\n \n If you are going to express outrage that the US is being compared to stalinist russia, maybe the real outrage should be that we are borrowing their techniques and methodology, not that somebody has pointed out the fact.", 
   {
    "unicode_changes_made": true
   }, 
   145668, 
   null, 
   1120794120.0
  ], 
  [
   145730, 
   null, 
   "Squawker", 
   "If you are going to express outrage that the US is being compared to stalinist russia, maybe the real outrage should be that we are borrowing their techniques and methodology, not that somebody has pointed out the fact.\n I said Stalin is the one who borrowed ours. We wouldn't borrow anything from the likes of Stalin. He was a two bit dictator, (probably as insane as Hitler was) not some Intellectual or military genius that set US policy. Durbin compared us to Nazi's, not Russia. Nice try at diverting the topic. The bottom line is Durbin should to be removed.", 
   {}, 
   145714, 
   null, 
   1120797060.0
  ], 
  [
   145751, 
   null, 
   "daewoo", 
   "I said Stalin is the one who borrowed ours. We wouldn't borrow anything from the likes of Stalin. He was a two bit dictator, (probably as insane as Hitler was) not some Intellectual or military genius that set US policy. Durbin compared us to Nazi's, not Russia. Nice try at diverting the topic. The bottom line is Durbin should to be removed.\n\n \n No, he did not set US policy. We are just borrowing his torture techniques, and apparently his penchant for ignoring the constitution.\n \n Durbin didn't reference the russians?\n \n \nIf I read this to you and did not tell you that it was an FBI agent describing what Americans had done to prisoners in their control, you would most certainly believe this must have been done by Nazis, Soviets in their gulags, or some mad regime -- Pol Pot or others -- that had no concern for human beings. Sadly, that is not the case. This was the action of Americans in the treatment of their prisoners.\n \n\n \n Note....soviets in their gulags......the gulags were developed under stalin (duh).", 
   {}, 
   145730, 
   null, 
   1120801080.0
  ], 
  [
   145754, 
   null, 
   "Voice Of Reason", 
   "GITMO is like a country club............The scum there eat better then the guards...This so called torture is just a bunch of military haters mumbo jumbo.......I can tell you this, If on 9/10/01 we had one of those scum in custody and if it took torture to get the info out of him and prevent the attacks on 9/11/01 and save 3,000 innocent civilians lives BRING IT ON!!!!\n \n You people on the left want to know about real torture.......Ask John McCain and some of his fellow POWs in Nam..........\n \n They will tell you about real torture.........", 
   {}, 
   145751, 
   null, 
   1120802100.0
  ], 
  [
   145755, 
   null, 
   "daewoo", 
   "GITMO is like a country club............The scum there eat better then the guards...This so called torture is just a bunch of military haters mumbo jumbo.......I can tell you this, If on 9/10/01 we had one of those scum in custody and if it took torture to get the info out of him and prevent the attacks on 9/11/01 and save 3,000 innocent civilians lives BRING IT ON!!!!\n \n You people on the left want to know about real torture.......Ask John McCain and some of his fellow POWs in Nam..........\n \n They will tell you about real torture.........\n\n \n Guys like durbin, who spent plenty of time in a vietnamese POW camp, in fact, one operated under russian leadership, and was exposed to the same type of psychological torture we are using at gitmo?", 
   {}, 
   145754, 
   null, 
   1120802760.0
  ], 
  [
   145756, 
   null, 
   "zachvac", 
   "GITMO is like a country club............The scum there eat better then the guards...This so called torture is just a bunch of military haters mumbo jumbo.......I can tell you this, If on 9/10/01 we had one of those scum in custody and if it took torture to get the info out of him and prevent the attacks on 9/11/01 and save 3,000 innocent civilians lives BRING IT ON!!!!\n \n You people on the left want to know about real torture.......Ask John McCain and some of his fellow POWs in Nam..........\n \n They will tell you about real torture.........\n\n \n Well you supporting torture such as this will only bring up more torture against American soldiers, what part of this don't you understand? Again, you say you would torture people to save 3,000 innocent civilians? A lot more than that have been killed in the war, so why don't we just not go to war and save all those civilian lives? I saw a figure that more people were in car crashes on 9/11 than in the WTC. You are just letting your emotions get the best of you during decision making, not a good thing for those in government to do. And an FBI member describing the conditions he witnessed is hardly only \"military hater mumbo jumbo\".", 
   {}, 
   145754, 
   null, 
   1120802880.0
  ], 
  [
   145757, 
   null, 
   "zachvac", 
   "GITMO is like a country club............The scum there eat better then the guards...This so called torture is just a bunch of military haters mumbo jumbo.......I can tell you this, If on 9/10/01 we had one of those scum in custody and if it took torture to get the info out of him and prevent the attacks on 9/11/01 and save 3,000 innocent civilians lives BRING IT ON!!!!\n \n You people on the left want to know about real torture.......Ask John McCain and some of his fellow POWs in Nam..........\n \n They will tell you about real torture.........\n\n \n But no one there has gotten a trial so we must treat everyone there as if they could be innocent. The only things we should do is make sure they don't get away. If we have to do something to keep them from getting away, that's what we need to do. Under the Patriot Act they could take you to GITMO. Do you think you'd enjoy it there? You'd probably die at the site of another naked man anyway.", 
   {}, 
   145754, 
   null, 
   1120803060.0
  ], 
  [
   145850, 
   null, 
   "biccat", 
   "But no one there has gotten a trial so we must treat everyone there as if they could be innocent.\n\n Not true, they all have received military trials according to the Geneva Convention. Some individuals were released following these trials; while others were held for security reasons.\n \n As enemy combatants, they can be held until they no longer pose a threat. If they were prisoners of war, then they can be held until the other side negotiates for their release, or indefinately. That's part of Geneva too. The Vietnamese took advantage of that provision (even tho they ignored a lot of the rest of it)", 
   {}, 
   145757, 
   null, 
   1120840560.0
  ], 
  [
   145873, 
   null, 
   "zachvac", 
   "Not true, they all have received military trials according to the Geneva Convention. Some individuals were released following these trials; while others were held for security reasons.\n \n As enemy combatants, they can be held until they no longer pose a threat. If they were prisoners of war, then they can be held until the other side negotiates for their release, or indefinately. That's part of Geneva too. The Vietnamese took advantage of that provision (even tho they ignored a lot of the rest of it)\n\n \n I was under the impression that they could arrest anyone with no evidence, just for being a terrorist and imprisoning them indefinately without a trial.", 
   {}, 
   145850, 
   null, 
   1120845480.0
  ], 
  [
   145878, 
   null, 
   "daewoo", 
   "I was under the impression that they could arrest anyone with no evidence, just for being a terrorist and imprisoning them indefinately without a trial.\n\n \n Yes, that is what they are doing.\n \n The guys they have captured on the field of battle are subject to the geneva convention (EVERYBODY captured on a field of battle is subject tot he geneva convention). After the war is over, those who are being held without POW status are required to recieve a hearing to see if their detainment should be extended. This trial must be public. Those who they wish to detain must be charged with a crime, and recieve a normal criminal trial (generally from the nation where they were captured...in this case mostly afghanistan). \n \n There is no provision for \"holding them until they are no longer a danger\". This is illegal. The bush administration is holding the guys at Gitmo on the logic that they are prisoners not just in the war with afghanistan, but in the wider war against terrorism. The \"war\" on terrorism does nto fit the legal ddescription of a \"war\" however, and the US supreme court has ruled that the war on terror is not a \"war\" as described under the geneva convention. tihs is why they ruled that the detainees must have trials.\n \n The Bush administration responded bby giving them military trials. 3 supreme court justices are already on record as saying this is unconstitutional, and thet they made it clear that the detainees must be given access to the regular, civlian courts. Unfortunatly, they are going to have to take it back thoguh the maze of federal courts (the detainees tht is) and back tot he supreme court in order to change things. It will probably take another full year.", 
   {}, 
   145873, 
   null, 
   1120846380.0
  ], 
  [
   145884, 
   null, 
   "biccat", 
   "\n The guys they have captured on the field of battle are subject to the geneva convention (EVERYBODY captured on a field of battle is subject tot he geneva convention). After the war is over, those who are being held without POW status are required to recieve a hearing to see if their detainment should be extended. This trial must be public. Those who they wish to detain must be charged with a crime, and recieve a normal criminal trial (generally from the nation where they were captured...in this case mostly afghanistan). \n \n\n Just out of curiosity, I'm wondering where you get this information from. Looking at the Geneva Convention, it explicitly spells out who the convention applies to, giving a broad set of criteria for prisoners of war. The captured individuals from Afghanistan don't seem to fit any of them.\n \n Second, where are you getting the fact that these people are entitled to public trials if they don't have POW status? And where's this part about criminal trials?\n \n Funny, how the libs. first want these guys to be afforded the protection of Prisoners of War, then once they find out they've been given those protections, they insist on a criminal prosecution.\n \n If we're going with a criminal prosecution, I think these men should be detained in the US prison system.", 
   {}, 
   145878, 
   null, 
   1120847880.0
  ], 
  [
   145898, 
   null, 
   "daewoo", 
   "Just out of curiosity, I'm wondering where you get this information from. Looking at the Geneva Convention, it explicitly spells out who the convention applies to, giving a broad set of criteria for prisoners of war. The captured individuals from Afghanistan don't seem to fit any of them.\n \n Second, where are you getting the fact that these people are entitled to public trials if they don't have POW status? And where's this part about criminal trials?\n \n Funny, how the libs. first want these guys to be afforded the protection of Prisoners of War, then once they find out they've been given those protections, they insist on a criminal prosecution.\n \n If we're going with a criminal prosecution, I think these men should be detained in the US prison system.\n\n \n What the bush Administration are calling \"unlawful combatants\" are covered under convention IV, \"Relative to the Protection of Civilian Persons in Time of War\"\n \n Specifically, Aricle 5 \n \n \nArt. 5 Where in the territory of a Party to the conflict, the latter is satisfied that an individual protected person is definitely suspected of or engaged in activities hostile to the security of the State, such individual person shall not be entitled to claim such rights and privileges under the present Convention as would, if exercised in the favour of such individual person, be prejudicial to the security of such State.\n \n Where in occupied territory an individual protected person is detained as a spy or saboteur, or as a person under definite suspicion of activity hostile to the security of the Occupying Power, such person shall, in those cases where absolute military security so requires, be regarded as having forfeited rights of communication under the present Convention.\n \n In each case, such persons shall nevertheless be treated with humanity and, in case of trial, shall not be deprived of the rights of fair and regular trial prescribed by the present Convention. They shall also be granted the full rights and privileges of a protected person under the present Convention at the earliest date consistent with the security of the State or Occupying Power, as the case may be.\n \n\n \n \n Where the problem comes in is that the US is not an occupying power, so we have no right to hold them at all. The govenment of Afghanistan couldhold them, but even then they must be held on afghani soil. \n \n Additionally, an individual is never treated as a threat under the convention, except in situation where they may have sensitive information (spies).\n \n I get my information on this out of a little red book that says \"US Army field guide to the geneva conventions\" on the cover. Every army officer filed officer is given one. I kept mine when I got out.\n \n The problem with just looking at the geneva convention is that first of all, usually only convention III is offered. In reality, there are 4 conventions, 2 protocalls, and over 80 treaties either referenced or newly created which all fall under the heading of the \"geneva conventions\".\n \n I use to have a full copy. It was over 500 pages long.\n \n EVERYBODY is covered under the geneva convention. The problem is that we eitehr have to treat these prisoners as POWs (convention III) or treat them as civlians (convention IV). By moving them to Gitmo, we essentially declared them POWS, becuase you CAN NOT take convention IV detainees from tehir country of capture (in this case afghanistan) unless it is to return them to their country of citizenship. \n \n So, yes, we either have to treat them as POWS, or the governemtn of afghanistan has to charge them with crimes.", 
   {}, 
   145884, 
   null, 
   1120852020.0
  ], 
  [
   145902, 
   null, 
   "biccat", 
   "Where the problem comes in is that the US is not an occupying power, so we have no right to hold them at all. The govenment of Afghanistan couldhold them, but even then they must be held on afghani soil.\n\n Actually if the US isn't an occupying power, then it would suggest that the convention doesn't apply. But that's immaterial because...\n \n \nI get my information on this out of a little red book that says \"US Army field guide to the geneva conventions\" on the cover.\n\n My point was that a lot of lawyers have looked at both sides of this issue. And a lot of lawyers have come down on either side of this issue. Surprisingly enough, there seem to be a lot of legal twists and turns.\n \n Somehow I doubt that the army's field guide to the conventions covers all of these particular circumstances.", 
   {}, 
   145898, 
   null, 
   1120852800.0
  ], 
  [
   145905, 
   null, 
   "daewoo", 
   "Actually if the US isn't an occupying power, then it would suggest that the convention doesn't apply. But that's immaterial because...\n \n \n My point was that a lot of lawyers have looked at both sides of this issue. And a lot of lawyers have come down on either side of this issue. Surprisingly enough, there seem to be a lot of legal twists and turns.\n \n Somehow I doubt that the army's field guide to the conventions covers all of these particular circumstances.\n\n \n The US WAS an occupying power. The war is over, now the new afghani governetn is the occupyign power.\n \n The supreme court has already ruled on this. Noth under US law, and the geneva conventions, the detainees are required to be charged and given hearings. The bush administration counterd by giving them military hearings. 2 federal courts have already called these insufficient under both US law and the geneva conventions. Three supreme court justices have already gone on record saying the same thing. Unfortunatly, with tor legal system being what it is, the issue has to work its way all the way through the federal courts again and get back tot he supreme court in order for the court to toss out the rediculous military trials. The bush camp is using obstructionist legal tactics to try to delay this.", 
   {}, 
   145902, 
   null, 
   1120854600.0
  ], 
  [
   149475, 
   null, 
   "Winston Smith", 
   "Sorry, you are wrong. It seems to be a pattern. The psychological torture techniqes that we teach in the US were originally developed by Stalin. The barking dogs, loud music, temperature extremes, strobe lights, etc... were all developed by the soviets under stalin. I have said before that the comparison betweent he US and the nazis in this case is incorrect. Teh comparison btwn the US and stalin, though, is spot on.\n\n The interrogation techniques including torture of course used in Guantanamo were learned from the Soviets; and US military personnel such as Marines were trained to resist them. Now in Guantanamo the same people who used these techniques for training are using them for real. There no more good guys all guys wear black hats nowadays", 
   {}, 
   145323, 
   null, 
   1122024180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Sen. Durbin likened American servicemen to Nazis", 
  "url": "http://www.4forums.com/political/news-forum/5678-sen-durbin-likened-american-servicemen-nazis.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 5678, 
  "discussion_files": [
   [
    "24770.html", 
    "http://www.4forums.com/political/news-forum/5678-sen-durbin-likened-american-servicemen-nazis-print.html"
   ], 
   [
    "24771.html", 
    "http://www.4forums.com/political/news-forum/5678-sen-durbin-likened-american-servicemen-nazis-6-print.html"
   ], 
   [
    "24772.html", 
    "http://www.4forums.com/political/news-forum/5678-sen-durbin-likened-american-servicemen-nazis-4-print.html"
   ], 
   [
    "24773.html", 
    "http://www.4forums.com/political/news-forum/5678-sen-durbin-likened-american-servicemen-nazis-5-print.html"
   ], 
   [
    "24774.html", 
    "http://www.4forums.com/political/news-forum/5678-sen-durbin-likened-american-servicemen-nazis-3-print.html"
   ], 
   [
    "24775.html", 
    "http://www.4forums.com/political/news-forum/5678-sen-durbin-likened-american-servicemen-nazis-2-print.html"
   ]
  ], 
  "identifier": 5678
 }
]