[
 [
  [
   138262, 
   null, 
   "jim's trucking", 
   "Is this hypocracy or not? I wonder how PETA will explain why its own members do not comply with animal cruelty laws.\n \n \n \n http://www.foxnews.com/story/0,2933,159861,00.html\n \n PETA Workers Charged With Animal Cruelty \n Friday, June 17, 2005\n \n AHOSKIE, N.C. - Two employees of People for the Ethical Treatment of Animals (search) have been charged with animal cruelty after dumping dead dogs and cats in a shopping center garbage bin, police said. \n \n Investigators staked out the bin after discovering that dead animals had been dumped there every Wednesday for the past four weeks, Ahoskie police said in a prepared statement Thursday.\n \n PETA has scheduled a news conference for Friday in Norfolk, Va., where the group is based.", 
   {
    "post_info": {
     "post_title": "PETA are actually not all for it!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1119022020.0
  ], 
  [
   138312, 
   null, 
   "Batman", 
   "Liberals - \"do as we say, not as we do.\"\n \n You'll like this:\n \n \nPETA's Dirty Secret\n Hypocrisy is the mother of all credibility problems, and People for the Ethical Treatment of Animals (PETA) has it in spades. While loudly complaining about the \"unethical\" treatment of animals by restaurant owners, grocers, farmers, scientists, anglers, and countless other Americans, the group has its own dirty little secret\n \n Peta Kills Animals\n", 
   {}, 
   138262, 
   null, 
   1119027480.0
  ], 
  [
   138316, 
   null, 
   "jim's trucking", 
   "Like many other \"just causes\", I think PETA exists just for the money!", 
   {}, 
   138312, 
   null, 
   1119027960.0
  ], 
  [
   138338, 
   null, 
   "gamehuis", 
   "Aw XXXX, I just posted a new thread about the same subject. emoticon_cry", 
   {}, 
   138316, 
   null, 
   1119031320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  PETA are actually not all for it!", 
  "url": "http://www.4forums.com/political/news-forum/5695-peta-actually-not-all.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 5695, 
  "discussion_files": [
   [
    "31681.html", 
    "http://www.4forums.com/political/news-forum/5695-peta-actually-not-all-print.html"
   ]
  ], 
  "identifier": 5695
 }
]