[
 [
  [
   138580, 
   null, 
   "Duo_Maxwell", 
   "Not all Muslims may be terrorists, but all terrorists are Muslims. - Ann Coulter\n \n There should be absolutely no 'Separation of Church and State' in America - David Barton \n \n When the Christian majority takes over this country, there will be no satanic churches, no more free distribution of pornography, no more talk of rights for homosexuals. After the Christian majority takes control, pluralism will be seen as immoral and evil and the state will not permit anybody the right to practice evil. - Gary Potter (FASCIST ALERT) \n \n When science and the Bible differ, science has obviously misinterpreted its data - Henry Morris (considering he's a creationists and therefore a idiot, I'm not suprised) \n \n http://www.reandev.com/taliban/", 
   {
    "post_info": {
     "post_title": "Quotes from the The American Taliban"
    }
   }, 
   null, 
   null, 
   1119081120.0
  ], 
  [
   138588, 
   null, 
   "sanguinekane", 
   "More fringe right wing lunatics who want nothing more than to intiate a holocaust of their own on anyone who isn't like them. Nothing new really.", 
   {}, 
   138580, 
   null, 
   1119086820.0
  ], 
  [
   138612, 
   null, 
   "Alan Ryan", 
   "These people are not really conservative \"thinkers\". They're just rather brainless ejaculators of atavistic incantations.", 
   {}, 
   138588, 
   null, 
   1119101220.0
  ], 
  [
   138613, 
   null, 
   "gamehuis", 
   "I just love this one:\n \n \"I don't know that atheists should be considered citizens, nor should they be considered patriots. This is one nation under God.\" - George Bush Sr.", 
   {}, 
   138612, 
   null, 
   1119101580.0
  ], 
  [
   138838, 
   null, 
   "SymonTemplar", 
   "Right up there with the DNC chair saying that the Republican party is for white Christians. Plenty of retards on both sides of the aisle.", 
   {}, 
   138613, 
   null, 
   1119168060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Quotes from the The American Taliban", 
  "url": "http://www.4forums.com/political/current-events-debates/5703-quotes-american-taliban.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 5703, 
  "discussion_files": [
   [
    "20646.html", 
    "http://www.4forums.com/political/current-events-debates/5703-quotes-american-taliban-print.html"
   ]
  ], 
  "identifier": 5703
 }
]