[
 [
  [
   138877, 
   null, 
   "Nurglitch", 
   "It struck me, as I was trying to ignore my work today, that this community could do with some rules of engagement concerning 'bias', how it is identified and how it may be dealt with. \n \n The problem is that even a group of people like this forum is remarkably heterogeneous, with widely differing opinions as to what the facts on any particular issue are. \n \n When people challenge each other's command of the facts, they are often working from such different background assumptions that accusations of 'bias' are inevitable. \n \n Typically the accusation of bias is used to reject sources that are posted to 'prove' a poster's claim. In the gay rights forum, the conflict between the 'Being gay is a choice' position and the 'Being gay is not a choice' position is sustained by the fact there seems to be no agreeably neutral third parties hosting a set of facts that is position-neutral.\n \n This is bad because disinterested third parties are hard to find, leaving people to cite possibly biased resources, and posters then reject each other's citations purely on the basis of association. \n \n But bias does not render something false unless that bias is un-accounted for. If you have a good idea of how bias alters the information being cited then you have a clearer picture of the facts, and an explanation for how the information should be interpreted in the context of that bias.\n \n More to the point, when bias is accounted for, then a set of facts may be evaluated according to objective considerations technical merit, such as sample size, peer review, consistency, parsimony, number and severity of entailed antinomies. \n \n So here's what I suggest: When a poster cites some website for facts, particularly empirical facts, that poster must provide a summary discussing the methodology by which those facts are determined, so that other posters can review. This summary provides an account of bias, and in an objective and reviewable format. \n \n If people don't think a poster is posting an accurate summary of a website's information, they can always post a counter-proposal, so that other posters can compare summaries with counter-proposals, and determine which is the more accurate summary.", 
   {
    "post_info": {
     "post_title": "Dealing with Bias"
    }
   }, 
   null, 
   null, 
   1119183720.0
  ], 
  [
   138888, 
   null, 
   "fracas", 
   "i agree with an analysis of methodology.\n but in religion and politics that can be hard to obtain.", 
   {}, 
   138877, 
   null, 
   1119188700.0
  ], 
  [
   138926, 
   null, 
   "Obvious Child", 
   "I think that this is fair, but only if the original post can be challenged. Basically, if there is a plethora of info for one position and none for the other, then we don't need to study the details too much. But if one side doesn't provide any info (as is currently the case with VOR in gay rights), it seems pointless, especially as someone unwilling to support their case will also be unwilling to pay attention to a valid argument.", 
   {}, 
   138888, 
   null, 
   1119201600.0
  ], 
  [
   138989, 
   null, 
   "Duo_Maxwell", 
   "Disregarding a source because of alleged bias is clearly the fallacy of posioing the wells. It is a tactic used by the intellectually weak to avoid dealing with a potentially damaging source. Those who do regularly resort to the fraudulent behavior are often those who cannot make their point. If you are going to attack the source, pick apart the article paragraph by paragraph, line by line. But that of course takes effort and fraud is time saving. \n \n Even worse are those who disregard sources yet completely fail to provide a single one of their own. Quite pathetic to say the least.", 
   {}, 
   138926, 
   null, 
   1119219960.0
  ], 
  [
   139105, 
   null, 
   "Alan Ryan", 
   "@ Nurglitch:\n \n If the rigorous standards of debating procedure and source verification which you suggest were applied here, many posters would be virtually excluded from participating in these discussions. \n \n I cannot fault your rationale - but it's far too academic and demanding for a public discussion forum.", 
   {}, 
   138989, 
   null, 
   1119260700.0
  ], 
  [
   139637, 
   null, 
   "Nurglitch", 
   "Alan Ryan: I'm not sure how these procedures would be exclusionary, especially as they're intended to put a stop to the stonewalling and flame-baiting that these forums are plagued with. They give people a common ground on which to work. \n \n The only people I can think of being excluded by these measures would be trolls, and other people uninterested in productive engagement.", 
   {}, 
   139105, 
   null, 
   1119388680.0
  ], 
  [
   139841, 
   null, 
   "Alan Ryan", 
   "Alan Ryan: I'm not sure how these procedures would be exclusionary, especially as they're intended to put a stop to the stonewalling and flame-baiting that these forums are plagued with. They give people a common ground on which to work. \n \n The only people I can think of being excluded by these measures would be trolls, and other people uninterested in productive engagement.\n\n \n \n I agree that \"trolling\" should be discouraged - though it can be simply ignored. The others are pests that can be controlled by wit, scorn, irony, etc.\n \n If we consider standards of discussion generally, what does bother me a little is the tendency of some capable contributors to attack with contempt and mockery the posters who get clearly \"out of their depth\" in a particular topic. Many people are superficially articulate and think what they have to say makes sense, but when pushed into an examination of fundamentals or asked to justify the implications of their view, they stumble and bluster. It does no credit to the \"expert\" or a person of superior intellect to ridicule these people. In my view, the superciliousness involved is itself contemptible. \n \n In discussions where the contributors are evenly matched, the case is different; then I see no reason why the full rhetorical armoury should not be employed.", 
   {}, 
   139637, 
   null, 
   1119432120.0
  ], 
  [
   140058, 
   null, 
   "Nurglitch", 
   "Because rhetoric is a waste of time and bandwidth. Rhetorical appeals do nothing to enhance the effectiveness of an argument, and simply cloud the argument with jingoism. The fact is that no two discrete arguments are equal, and that comprehensive analysis of such arguments is an effective of scoring which argument is better. A lack of rhetoric promotes the clarity needed for objective scoring. \n \n If you want to judge which argument has the greater intuitive, or rhetorical, appeal then you need to post an opinion poll about the arguments in question.", 
   {}, 
   139841, 
   null, 
   1119482040.0
  ], 
  [
   140223, 
   null, 
   "Alan Ryan", 
   "Rhetoric is not merely the vulgar device of clouding an argument with \"jingoism\". I should describe jingoism as belligerent unthinking chauvinism. This, to any educated mind, is a very primitive form of rhetoric that is only likely to be used in discussions where national pride is at issue.\n \n What I meant by using the \"armoury of rhetoric\" was the practice of eloquence and the whole art of using language to persuade others.\n \n I do not see this as a waste of bandwidth. Anything that's said in a forum like this could be described as such.\n \n There is no such thing as \"objective scoring\" in respect of any argument's effectiveness, relevance, etc. All judgements about performance will be entirely subjective matters of opinion. Some opinions will be better informed than others, but that is all.", 
   {}, 
   140058, 
   null, 
   1119518640.0
  ], 
  [
   140234, 
   null, 
   "Iuris", 
   "Nurglitch, this isn't Portent. They don't play as nice here.", 
   {}, 
   140223, 
   null, 
   1119520380.0
  ], 
  [
   140253, 
   null, 
   "fracas", 
   "Nurglitch, this isn't Portent. They don't play as nice here.\n\n actually, they don't know how to play here.", 
   {}, 
   140234, 
   null, 
   1119533460.0
  ], 
  [
   140267, 
   null, 
   "Iuris", 
   "Hmm, hard to say. You may be right.", 
   {}, 
   140253, 
   null, 
   1119535500.0
  ], 
  [
   140388, 
   null, 
   "Nurglitch", 
   "What I meant by using the \"armoury of rhetoric\" was the practice of eloquence and the whole art of using language to persuade others.\n Yeah, and I meant to say that the practice of eloquence is alright for poetry and rabble-rousing, but pretty poor for technical discussion. Personally I'm not interested in persuading people of my position so much as I am interested in explaining and justifying my positions, and learning more about other positions and their justifications.\n \n And I'd just like to point out that the history of logic and argumentation theory suggests that we can indeed evaluate arguments according to objective technical merit.", 
   {}, 
   140267, 
   null, 
   1119554820.0
  ], 
  [
   140631, 
   null, 
   "Alan Ryan", 
   "Yeah, and I meant to say that the practice of eloquence is alright for poetry and rabble-rousing, but pretty poor for technical discussion. Personally I'm not interested in persuading people of my position so much as I am interested in explaining and justifying my positions, and learning more about other positions and their justifications.\n \n And I'd just like to point out that the history of logic and argumentation theory suggests that we can indeed evaluate arguments according to objective technical merit.\n\n \n I see you quote from Aristotle in your \"tag line\". Perhaps you should have taken a look at his treatise on Rhetoric before making snide remarks about eloquence, poetry, \"rabble-rousing\", and \"jingoism\". \n \n Your interests in \"technical discussion\" and evaluating arguments are hardly going to be satisfied here. The people who contribute to this forum are not members of a school taking a class in Reason and Logic.", 
   {}, 
   140388, 
   null, 
   1119603360.0
  ], 
  [
   140674, 
   null, 
   "georged", 
   " \n Your interests in \"technical discussion\" and evaluating arguments are hardly going to be satisfied here. The people who contribute to this forum are not members of a school taking a class in Reason and Logic.\n\n \n And it seems obvious that many viewed both as declined electives while in school as emotional nationalism, versus pride, dominates many opinions.", 
   {}, 
   140631, 
   null, 
   1119622260.0
  ], 
  [
   140873, 
   null, 
   "Nurglitch", 
   "I see you quote from Aristotle in your \"tag line\". Perhaps you should have taken a look at his treatise on Rhetoric before making snide remarks about eloquence, poetry, \"rabble-rousing\", and \"jingoism\".\n Actually I have read it, and of all of Aristotle's work I'd say that it's the one most relevant to the modern world. That's said Aristotle's Rhetoric is a fascinating text-book read on avoiding rational argument, making emotional appeals, and generally subverting people's ability to use their own reason.\n \nYour interests in \"technical discussion\" and evaluating arguments are hardly going to be satisfied here. The people who contribute to this forum are not members of a school taking a class in Reason and Logic.\n Actually I've had some rather good technical discussions with people on these forums. And since I'd like to enjoy more such discussions, and to read the results of other people's fruitful discussions, as a change from the usual clumsy exchanges of rhetoric, I thought I might try and encourage people.", 
   {}, 
   140674, 
   null, 
   1119654780.0
  ], 
  [
   141002, 
   null, 
   "Alan Ryan", 
   "Actually I have read it, and of all of Aristotle's work I'd say that it's the one most relevant to the modern world. That's said Aristotle's Rhetoric is a fascinating text-book read on avoiding rational argument, making emotional appeals, and generally subverting people's ability to use their own reason.\n\n At least we can agree on the accessibility of Aristotle's Rhetoric: not very many people seem to have heard of it, let alone read it. \n \n I also agree that among the methods of persuasion examined by Aristotle, the emotional contrivances by which a speaker/writer produces a favourable response (in an audience) to his point of view is of the first consequence. But I would remind you that Aristotle also pays attention to \"style\" - of which he says the leading characteristics are appropriateness, arrangement, and lucidity. Thus defined, \"style\" is not without advantage in advancing even the most rational of arguments. Style is a rhetorical device.\n \n You appear to believe that a \"technical discussion\" - by which I suppose you mean a reasoned discussion uncontaminated by emotions - is not just theoretically possible but something that can be actualised. Here, I part company from you. I don't believe it's possible to support our opinions by means of a purely technical apparatus of \"argument theory\". An exception in which a technical apparatus is necessary occurs under special conditions involving, for example, symbolic logic - but in that case, mere opinion is not relevant.\n \n OK, now for my reasons: You seem to assume a highly sterile intellectual environment in which a discourse of exchanges takes place with impersonal detachment. I am not convinced that is possible: I believe (unfortunately ?) that reason is passion's slave, and that there's an emotional investment lurking behind every point of vew that is seriously defended. Human beings are an amalgam of sense and sensibility - which is precisely why \"rhetoric\" makes its appearance in arguments. \n \n \n Actually I've had some rather good technical discussions with people on these forums. And since I'd like to enjoy more such discussions, and to read the results of other people's fruitful discussions, as a change from the usual clumsy exchanges of rhetoric, I thought I might try and encourage people.\n\n According to Plato's theory of ideas, there is a \"world of forms\" in which universals or abstract conceptions have an ideal existence outside the world of sense - i.e. the unchanging reality behind the mutability of appearances. No sarcasm intended, but perhaps your \"form of argument\" is really a Platonist ideal construct and belongs among his universals ?\n \n Finally, I will concede that if discussions were conducted subject to the criteria you set out in your original proposals, the level of debate would be indubitably higher. I only came into this thread because I doubt that some people could ever meet the standards you have in mind, and it is rather invidious to devalue them on that account or to expose their \"arguments\" to ridicule by the better educated.", 
   {}, 
   140873, 
   null, 
   1119701340.0
  ], 
  [
   141073, 
   null, 
   "Nurglitch", 
   "Thus defined, \"style\" is not without advantage in advancing even the most rational of arguments. Style is a rhetorical device.\n I agree, and as a rhetorical device it's still just window dressing to whichever argument it dresses up.\n \n I don't believe it's possible to support our opinions by means of a purely technical apparatus of \"argument theory\".\n I'm very curious about this claim. How do you figure it's impossible? I don't see how making propositional arguments to support claims of opinion is impossible.\n \nYou seem to assume a highly sterile intellectual environment in which a discourse of exchanges takes place with impersonal detachment.\n I assure you that is a false assumption. I'm assuming an environment in which people are willing to discuss opinions and issues fairly. \n \n I am not convinced that is possible: I believe (unfortunately ?) that reason is passion's slave, and that there's an emotional investment lurking behind every point of vew that is seriously defended.\n A Humean, I knew it! ;) Seriously though, I personally don't want to feel strongly about something that I'm wrong about - I'm just not interested in dogmatism for its own sake. As Hume pointed out, reason may be slave to the passions, but it's an extraordinarily powerful slave at that. I don't think you need to be emotionally detached from your opinions to critically examine them in an objective way, just not so committed to an opinion that you're dogmatic about it. \n \nHuman beings are an amalgam of sense and sensibility - which is precisely why \"rhetoric\" makes its appearance in arguments.\n Rhetoric is only useful if you're trying to convince people of something that can't stand on its own merits - my opinion, of course.\n \nAccording to Plato's theory of ideas, there is a \"world of forms\" in which universals or abstract conceptions have an ideal existence outside the world of sense - i.e. the unchanging reality behind the mutability of appearances. No sarcasm intended, but perhaps your \"form of argument\" is really a Platonist ideal construct and belongs among his universals ?\n Nothing so silly as Platonic forms, but rather the syntactic/semantic division of modern logics.\n \nFinally, I will concede that if discussions were conducted subject to the criteria you set out in your original proposals, the level of debate would be indubitably higher.\n I wouldn't say 'higher' so much as more more polite, friendlier, more productive, and more enjoyable.\n \nI only came into this thread because I doubt that some people could ever meet the standards you have in mind, and it is rather invidious to devalue them on that account or to expose their \"arguments\" to ridicule by the better educated.\n I think that everyone posting on these forums is capable of meeting these 'standards'.", 
   {}, 
   141002, 
   null, 
   1119725700.0
  ], 
  [
   141285, 
   null, 
   "Alan Ryan", 
   " I agree, and as a rhetorical device it's still just window dressing to whichever argument it dresses up.\n\n The use of lucid language appropriate to the subject matter and arranged in a logical structure is hardly mere \"window dressing\" (See what Aristotle has to say about \"style\").\n \n I'm very curious about this claim. How do you figure it's impossible? I don't see how making propositional arguments to support claims of opinion is impossible.\n\n I believe that supporting our opinions is never a completely value free activity. Sometimes we make our values explicit; sometimes they arise from intuition or are buried in hidden assumptions - but I believe they exist and influence all expressions of opinion no matter how \"balanced\" and well-informed they appear to be. \n \n A Humean, I knew it! ;) Seriously though, I personally don't want to feel strongly about something that I'm wrong about - I'm just not interested in dogmatism for its own sake. As Hume pointed out, reason may be slave to the passions, but it's an extraordinarily powerful slave at that. I don't think you need to be emotionally detached from your opinions to critically examine them in an objective way, just not so committed to an opinion that you're dogmatic about it.\n\n Yes, but not an uncritical \"disciple\" of Hume: I know I've learned from him. One of the prescriptions I've taken from him is an abjuration of dogmatism. \n \n Nothing so silly as Platonic forms, but rather the syntactic/semantic division of modern logics.\n\n I wouldn't describe Platonic forms as \"silly\": perhaps as metaphysical entities, analytical philosophers find them rather easy to reject/refute. (I'll come back to the rest of this sentence in a minute). \n \nI wouldn't say 'higher' so much as more more polite, friendlier, more productive, and more enjoyable.\n\n Had you pressed me on the implications of \"higher standard\", I should have added to the adjectives in your description, the word, intelligent.\n \n I think that everyone posting on these forums is capable of meeting these 'standards'.\n\n Everyone ? Consider what you say in respect of the reasoning in your \"form of argument\" - i.e. by referring to \"the synactic/semantic division of modern logics\". Do you seriously suppose that \"everyone\" in this forum will understand and apply such a conceptual scheme ? Again, I repeat, the level of intellectual capability you seem to expect is impossibly demanding in a public discussion chamber such as this place.", 
   {}, 
   141073, 
   null, 
   1119782640.0
  ], 
  [
   141313, 
   null, 
   "Nurglitch", 
   "The use of lucid language appropriate to the subject matter and arranged in a logical structure is hardly mere \"window dressing\"\n Yeah, it's window dressing. Clarity of presentation does nothing to enhance the truth-functional nature of an argument, and although it certainly helps avoid misunderstanding it's not necessary.\n \nI believe that supporting our opinions is never a completely value free activity. Sometimes we make our values explicit; sometimes they arise from intuition or are buried in hidden assumptions - but I believe they exist and influence all expressions of opinion no matter how \"balanced\" and well-informed they appear to be.\n Yes, that's generally one of the advantages to working formally is that you put as much on the table as possible. It's also why we discuss these things in public, so that unintentionally concealed factors may be brought forward and examined.\n \nI wouldn't describe Platonic forms as \"silly\": perhaps as metaphysical entities, analytical philosophers find them rather easy to reject/refute.\n Yes, as a student of analytic philosophy I do find them to be ontologically superfluous, and certainly one of Plato's sillier ideas. \n \nHad you pressed me on the implications of \"higher standard\", I should have added to the adjectives in your description, the word, intelligent.\n It's a pretty meaningless word, but sure, if you want to. \n \nEveryone ?\n Yes, everyone. \n \nConsider what you say in respect of the reasoning in your \"form of argument\" - i.e. by referring to \"the synactic/semantic division of modern logics\". Do you seriously suppose that \"everyone\" in this forum will understand and apply such a conceptual scheme ?\n I do seriously suppose that all of the posters on these discussion boards are capable of rigourously arguing their positions and those of others. Whether they will is their choice.", 
   {}, 
   141285, 
   null, 
   1119805860.0
  ], 
  [
   141316, 
   null, 
   "Alan Ryan", 
   "If you want formal debates with \"scholarly\" rules of \"objective scoring\" etc., you're probably posting in the wrong place.\n \n Most contributors here seem content to exhange opinions, join discussions, and perhaps argue a case on an informal basis. \n \n Whether \"everyone\" can rigorously argue a case is at least open to doubt. A minority can hardly communicate intelligibly at times.\n \n The fact that (so far) nobody else has contributed much to this thread suggests that it has aroused little interest: perhaps some people even detect a hint of pretentiousness in it ?", 
   {}, 
   141313, 
   null, 
   1119808920.0
  ], 
  [
   141336, 
   null, 
   "Nurglitch", 
   "I'm not asking for 'scholarly' debates, because I get those at work. \n \n I am suggesting a method of determining facts so that discussions here can move forward and be productive, rather than bog down in flame-wars, stone-walling, and childish bickering. \n \n If people find that pretentious, then they're missing out.", 
   {}, 
   141316, 
   null, 
   1119812760.0
  ], 
  [
   142001, 
   null, 
   "RedMoon", 
   "At least we can agree on the accessibility of Aristotle's Rhetoric: not very many people seem to have heard of it, let alone read it.\n\n \n Well one more person's heard of it and plans to read it now. emoticon_xgood \n \n Thanks! This looks like a great read.", 
   {}, 
   141002, 
   null, 
   1119985140.0
  ], 
  [
   282143, 
   null, 
   "minhan", 
   "This guide rocks!!", 
   {
    "post_info": {
     "post_title": "Nice job"
    }
   }, 
   140674, 
   null, 
   1188898260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Dealing with Bias", 
  "url": "http://www.4forums.com/political/debating-techniques-styles/5716-dealing-bias.html", 
  "breadcrumbs": [
   "Debating Techniques and Styles"
  ], 
  "id_number": 5716, 
  "discussion_files": [
   [
    "18656.html", 
    "http://www.4forums.com/political/debating-techniques-styles/5716-dealing-bias-print.html"
   ], 
   [
    "18657.html", 
    "http://www.4forums.com/political/debating-techniques-styles/5716-dealing-bias-2-print.html"
   ]
  ], 
  "identifier": 5716
 }
]