[
 [
  [
   139909, 
   null, 
   "Voice Of Reason", 
   "Senator Durbin apologized for his outrageous remarks against our military yesterday on the floor of the U.S. Senate... Its about time.......\n \n http://www.cnn.com/2005/POLITICS/06/21/guantanamo.durbin/index.html\n \n Durbin apologizes for Gitmo remarks\n No. 2 Democrat says he intended no disrespect to U.S. troops\n \n Wednesday, June 22, 2005; Posted: 3:31 a.m. EDT (07:31 GMT) \n \n Durbin: \"I offer my apologies to those that were offended by my words.\"WATCH Browse/Search .\n \n Sen. Dick Durbin of Illinois said he \"never intended any disrespect\" to U.S. troops with his June 14 comments, for which the minority whip has endured a week of criticism from Republicans and some Democrats.", 
   {
    "post_info": {
     "post_title": "Durbin apologizes for his outrageous remarks against the military..."
    }
   }, 
   null, 
   null, 
   1119462840.0
  ], 
  [
   139911, 
   null, 
   "Kronus", 
   "Durbin: \"I offer my apologies to those that were offended by my words.\"\n \n Now if we could just get Bush to apologise for making those words necessary we'll be all set. Despite mounting critisism from all quarters Gitmo remains a national embarassment, and Bush is doing nothing about it. Maybe if Bush would listen to reason people wouldn't have to resort to theatrics.", 
   {}, 
   139909, 
   null, 
   1119463500.0
  ], 
  [
   139936, 
   null, 
   "ScummyD", 
   "Notice Durbin has not taken his preposterously ignorant remarks back, and nor has he said that they were wrong. He has only apologized if he offended anybody.\n \n Durbin is anational embarassment. He should be prosecuted for sedition and expurgated from the senate.\n \n He has sided with America's enemies in a time of war and handed them vast opportunities for propaganda to stir up more anti-Americanism and fervent hatred among the Islamofascists.", 
   {}, 
   139911, 
   null, 
   1119467340.0
  ], 
  [
   139963, 
   null, 
   "Michele", 
   "First of all, I don't think Durbin needed to apologise. It is the Bush Administration who needs to apologise to the troops at these prisons for leaving them out to dry. They are the ones blaming the problem on a few \"rogue\" soldiers. They are the ones refusing to admit to creating an atmosphere where this seems like acceptable behavior.\n \n It was White House lawyers who wrote memos saying torture, within reason, was okay. Whatever that means. Now one of them is the Attorney General. What fun.\n \n It is Donald Rumsfeld who is protecting his Generals from responsibiltiy except for one poor woman who was a Reservist. He fired Pentagon people who tried to advice him when he didn't want to hear it. It is Rumsfeld who is sticking to his \"leaner, swifter Army.\" It is not working and it is encouraging \"short cuts.\" As in bad behavior.\n \n I thought Republicans were for individual responsibilty. Somebody better tell the Bushies.\n \n So don't look at the Dems as knocking the troops. It is their Commander in Chief.", 
   {}, 
   139936, 
   null, 
   1119473880.0
  ], 
  [
   139968, 
   null, 
   "ScummyD", 
   "First of all, I don't think Durbin needed to apologise. It is the Bush Administration who needs to apologise\n\n Typical leftist pap.\n \n They try to switch the emphasis unto Bush when it is Durbin in all his shining ignorance and tactless actions who handed the Islamofascists a gold mine of porpaganda that endangers our soldiers, and it is Durbin who made an outrageous, and totally preposterous, assertion in smearing and defaming the US soldier, much like Kerry did so many years ago.\n \n The Democrats have chosen to side with the Islamofascists and against their own country. their words and actions prove this fact every day.", 
   {}, 
   139963, 
   null, 
   1119474360.0
  ], 
  [
   139971, 
   null, 
   "Batman", 
   "Perhaps some won't be happy until we put these poor, innocent, peace loving detainees up in a Ramada or Holiday Inn.", 
   {}, 
   139963, 
   null, 
   1119474480.0
  ], 
  [
   139976, 
   null, 
   "Matthew S", 
   "Typical leftist pap.\n \n They try to switch the emphasis unto Bush when it is Durbin in all his shining ignorance and tactless actions who handed the Islamofascists a gold mine of porpaganda that endangers our soldiers, and it is Durbin who made an outrageous, and totally preposterous, assertion in smearing and defaming the US soldier, much like Kerry did so many years ago.\n \n The Democrats have chosen to side with the Islamofascists and against their own country. their words and actions prove this fact every day.\n\n \n \n Our soldiers wouldn't be in danger if Bush hadn't put them there. Just because someone disagrees with bush does not mean they have gone \"against their own country.\" If bush said you need to eat jellybeans, wear red on fridays, and shave your head would you do it? Why do you love this man so much?\n \n Also for the record I do not agree with dubin's comments. I do believe that the prisonors are being held humanly. I am concerned that you can not see that on the one hand the usa berates governments around the world for the imprisonment of people unfairly. Yet the prisonors in the camp are being imprisoned inperpatuity. Can you not see the hypocracy of the usa's stance?", 
   {}, 
   139968, 
   null, 
   1119474720.0
  ], 
  [
   139980, 
   null, 
   "Batman", 
   "Our soldiers wouldn't be in danger if Bush hadn't put them there.\nThe only way for them never to be in danger would be not having a military, since every military operation has potential dangers.", 
   {}, 
   139976, 
   null, 
   1119475020.0
  ], 
  [
   139981, 
   null, 
   "Kronus", 
   "\n The Democrats have chosen to side with the Islamofascists and against their own country. their words and actions prove this fact every day.\n\n \n You got that backwards. It's the duty of every American to speak out when the Administration is doing wrong. It's people who say we should keep silent when the government does wrong that are siding with fascism.", 
   {}, 
   139968, 
   null, 
   1119475020.0
  ], 
  [
   139984, 
   null, 
   "Matthew S", 
   "You got that backwards. It's the duty of every American to speak out when the Administration is doing wrong. It's people who say we should keep silent when the government does wrong that are siding with fascism.\n\n \n \n Agreed emoticon_xgood\n \n Some of the fanatical bush supporters were the some of the loudest to speak out when clinton was in office. I sear the man couldn't take a step without some conservative pundant screaming the sky is falling. They accuse us of being anti-american now that the shoe is on the other foot.", 
   {}, 
   139981, 
   null, 
   1119475380.0
  ], 
  [
   139988, 
   null, 
   "ScummyD", 
   "You got that backwards. It's the duty of every American to speak out when the Administration is doing wrong. \n\n I agree. But that is NOT what Durbin did. \n \n There is an honest and legitimate manner in which to accomplish that and Durbin acted in an irresponsible sedituous manner and should be expurgated from the senate. \n \n He slandered US soldiers as mass murdering genocidal savages. The same soldiers who enable vermin like himself to open their ignorant mouths in the first place.\n \n But on the other side, I hope he and the Democrats continue their absurdity, for it will only further their electoral thrashings that they have experienced over the course of the last decade. LOL\n \n\n It's people who say we should keep silent when the government does wrong that are siding with fascism.\n\n I agree.", 
   {}, 
   139981, 
   null, 
   1119475800.0
  ], 
  [
   139989, 
   null, 
   "daewoo", 
   "You got that backwards. It's the duty of every American to speak out when the Administration is doing wrong. It's people who say we should keep silent when the government does wrong that are siding with fascism.\n\n \n \n EXACTLY\n \n Frankly, I thik conditions at Gitmo are likely worse than (the absolutly horrid ones) that have already been described or the Bush administration would not be wqorking so hard to stonewall an investigation.", 
   {}, 
   139981, 
   null, 
   1119475920.0
  ], 
  [
   139992, 
   null, 
   "ScummyD", 
   "Durbin lied in his zealous quest to gain power for his floundering Party.\n \n Durbin's actions are just the latest manifestation of the Democratic Party's efforts to undermine the US war on terrorism. Their rhetoric is similar if not the same as the Islamofascists.\n \n In their seething rage and hate of Bush and Republicans the Democrats have sided with the Islamofascists and have put this country in danger and are actively working to undermine the war effort and are providing the Islamofascists aid and comfort. They will lose upcoming elections because of their traiterous and sedituous actions.", 
   {}, 
   139989, 
   null, 
   1119476340.0
  ], 
  [
   139998, 
   null, 
   "Symbiote", 
   "It was cowardly and stupid of him to apologise, in my view.\n \n There is no need to be on the defensive when pointing out the barbaric actions being undertaken by the US government, or any need to use language that doesn't offend the effeminate sensibilites of the pro-torture crowd.", 
   {}, 
   139992, 
   null, 
   1119477300.0
  ], 
  [
   140002, 
   null, 
   "ScummyD", 
   "It was cowardly and stupid of him to apologise, in my view.\n \n There is no need to be on the defensive when pointing out the barbaric actions being undertaken by the US government, or any need to use language that doesn't offend the effeminate sensibilites of the pro-torture crowd.\n\n I encourage you and your cohorts to contact your elected officials and tell them to continue their current tack i.e Dick Durbin, Ted Kennedy, and Howard Dean, and to voice their opinions louder and with more force.", 
   {}, 
   139998, 
   null, 
   1119477420.0
  ], 
  [
   140007, 
   null, 
   "Symbiote", 
   "I'm not an American, perhaps you could write to your representatives John Kerry and Howard Dean for me and ask them to speak truthfully about the Iraq war, since you also desire such a result.", 
   {}, 
   140002, 
   null, 
   1119477720.0
  ], 
  [
   140008, 
   null, 
   "ScummyD", 
   "I'm not an American, perhaps you could write to your representatives John Kerry and Howard Dean for me and ask them to speak truthfully about the Iraq war, since you also desire such a result.\n\n I already have.\n \n It will only help the right solidify their power.", 
   {}, 
   140007, 
   null, 
   1119477840.0
  ], 
  [
   140010, 
   null, 
   "daewoo", 
   "It was cowardly and stupid of him to apologise, in my view.\n \n There is no need to be on the defensive when pointing out the barbaric actions being undertaken by the US government, or any need to use language that doesn't offend the effeminate sensibilites of the pro-torture crowd.\n\n \n \n I agree. There was no apology needed. It seems that our politicians are caught up in playing politics. Frankly, the man should have gootten up and said \"If they don't want to be compared to nazis, we need to change military policies so they are not acting likle nazis\".\n \n A I said before, this is just a diversionary tactic by the republicans. they are trying to get atention re-focused from the call for an investigtion into exactly what DOES happen at Gitmo and an airing of the policies there regarding release and prisoner status.", 
   {}, 
   139998, 
   null, 
   1119477900.0
  ], 
  [
   140011, 
   null, 
   "ScummyD", 
   "I agree. There was no apology needed. It seems that our politicians are caught up in playing politics. Frankly, the man should have gootten up and said \"If they don't want to be compared to nazis, we need to change military policies so they are not acting likle nazis\".\n\n Have you voiced this opinion to your elected representatives?\n \n If not I whole heartedly urge that you do so as soon as possible!", 
   {}, 
   140010, 
   null, 
   1119478020.0
  ], 
  [
   140014, 
   null, 
   "Kronus", 
   "I agree. But that is NOT what Durbin did. \n \n There is an honest and legitimate manner in which to accomplish that ...\n\n \n The straightforward and reasonable approach has been tried, many times, by many people. Bush has ignored them all. Maybe theatrics was the correct next step, maybe not. But if the reasonable approach doesn't work, and it hasn't, then you must try an unreasonable approach. The blame here shouldn't be on Durbin. He's just trying to do what must be done to restore America to the moral high ground it once held. The blame should be on Bush, for forcing people to go to extreme measures to drive home a blindingly obvious point.", 
   {}, 
   139988, 
   null, 
   1119478140.0
  ], 
  [
   140016, 
   null, 
   "Symbiote", 
   "It seems odd to me that you would encourage irresponsible sedition, but I guess political power is more important to you. \n \n Personally I believe principle is more important and moral, but your capacity for hypocrisy is impressive.\n \n If you really want to make a difference, perhaps you could enlist, rape and mutilate some Iraqis and film it. That'd really stir the pot, get seditious democrats talking all over the place, and really solidify the chances for a fascist dictatorship of the right.\n \n That way everybody wins, and even if you're caught, you'll be a martyr for the cause.", 
   {}, 
   140008, 
   null, 
   1119478200.0
  ], 
  [
   140020, 
   null, 
   "ScummyD", 
   "It seems odd to me that you would encourage irresponsible sedition, but I guess political power is more important to you. \n \n Personally I believe principle is more important and moral, but your capacity for hypocrisy is impressive.\n \n If you really want to make a difference, perhaps you could enlist, rape and mutilate some Iraqis and film it. That'd really stir the pot, get seditious democrats talking all over the place, and really solidify the chances for a fascist dictatorship of the right.\n \n That way everybody wins, and even if you're caught, you'll be a martyr for the cause.\n\n Sounds good. I will get started right away.", 
   {}, 
   140016, 
   null, 
   1119478680.0
  ], 
  [
   140021, 
   null, 
   "ScummyD", 
   "The blame should be on Bush, for forcing people to go to extreme measures to drive home a blindingly obvious point.\n\n This represents the classic liberal line of thought. LOL Totally illogical and dismisses any sense of personal responsibility.", 
   {}, 
   140014, 
   null, 
   1119478800.0
  ], 
  [
   140023, 
   null, 
   "Truthsayer", 
   "\n There is no need to be on the defensive when pointing out the barbaric actions being undertaken by the US government, \n\n \n Barbaric? :p :p \n \n Puh-leeeeze...... emoticon_rolleyes", 
   {}, 
   139998, 
   null, 
   1119478980.0
  ], 
  [
   140025, 
   null, 
   "Symbiote", 
   "As I said, effeminate sensibilities, you'll gladly sanction mistreatment of prisoners halfway around the world, but the use of a harsh word on an internet forum is offensive to you. It is characteristic of the weakness of the Neocons and their supporters, who perhaps are so eager to endorse violence by others because they feel so impotent themselves.\n \n by the way;\n http://dictionary.reference.com/search?q=barbaric\n \n I gather you believe the treatment of Gitmo's detainees is tasteful, not crude in the slighest, and entirely civilised.\n \n \nSounds good. I will get started right away.\n\n \n A noble act indeed, you have the heart of a suicide bomber.", 
   {}, 
   140023, 
   null, 
   1119479220.0
  ], 
  [
   140043, 
   null, 
   "daewoo", 
   "Have you voiced this opinion to your elected representatives?\n \n If not I whole heartedly urge that you do so as soon as possible!\n\n \n Of course I did. In fat, I called my representative personally on the matter. He claimed that the comment was \"distateful\" regardless of what the underlying sentiment was. he claimed that the comment would be used to inf;lame anti american sentiment. I asked \"Don't you think that the rumors floating around about what goes on at Gitmo are doing that already? Why the hell dont't we let the investigation go through and we will jhave some transparency\".\n \n His answer was \"We are afraid of what the investigation might turn up. You haev to realise that during times of war, some people, particularly military people, can be prone to....excess...when dealing with prisoners.\n \n \n To me this is as good as an admission that things at Gitmo are far worse than we have been led by our government to believe.\n \n Needless to say that weasel will not be reciveing his annual campaign contribution from me this year, and I will speak with others who send similar funds and try to talk them out of it. While it is certainly nice in my line of work (where we work primarily on government contractors) to have a couple of congressmen in your corner, I am not willing to sell out the integrity of my nation to get them.", 
   {}, 
   140011, 
   null, 
   1119480960.0
  ], 
  [
   140047, 
   null, 
   "ScummyD", 
   "you'll gladly sanction mistreatment of prisoners\n\n Not true.\n \n \n \n\n I gather you believe the treatment of Gitmo's detainees is tasteful, not crude in the slighest, and entirely civilised.\n \n\n I do not believe that turning the air conditioning up and down and playing loud rap music is in anyway \"crude\" or \"uncivilized.\" \n \n Those things get Durbin's panties caught in wad.", 
   {}, 
   140025, 
   null, 
   1119481200.0
  ], 
  [
   140048, 
   null, 
   "Raastee", 
   "Notice Durbin has not taken his preposterously ignorant remarks back, and nor has he said that they were wrong. He has only apologized if he offended anybody.\n \n Durbin is anational embarassment. He should be prosecuted for sedition and expurgated from the senate.\n \n He has sided with America's enemies in a time of war and handed them vast opportunities for propaganda to stir up more anti-Americanism and fervent hatred among the Islamofascists.\n\n So...you hate free speech...?\n We get the picture.", 
   {}, 
   139936, 
   null, 
   1119481200.0
  ], 
  [
   140051, 
   null, 
   "Symbiote", 
   "I do not believe that turning the air conditioning up and down and playing loud rap music is in anyway \"crude\" or \"uncivilized.\"\n\n \n How about chaining someone to the floor such that they are forced to remain in their own excrement for a prolonged period? Is there some kind of mental block going on, where you only read about the less bad things and the worst ones you just kind of forget about? Or is it just the characteristic dishonesty we've come to expect from you.\n \n Like \"I don't think Nazism was barbaric, because a high stepping march isn't uncivilised\".\n \n If you don't think chaining someone in a fetal position and leaving them to sit in their own excrement for an extended period is crude, uncivilised or distasteful, that says nothing about the treatment and everything about you.", 
   {}, 
   140048, 
   null, 
   1119481680.0
  ], 
  [
   140105, 
   null, 
   "ScummyD", 
   "So...you hate free speech...?\n\n Not in the least.\n \n Just realize that there are repercussions for your \"free speech.\" The Democrats will see this come election day, again.\n \n \n\n We get the picture.\n\n You get a very warped picture, indeed.", 
   {}, 
   140048, 
   null, 
   1119486060.0
  ], 
  [
   140106, 
   null, 
   "ScummyD", 
   "How about chaining someone to the floor such that they are forced to remain in their own excrement for a prolonged period? Is there some kind of mental block going on, where you only read about the less bad things and the worst ones you just kind of forget about? Or is it just the characteristic dishonesty we've come to expect from you.\n \n Like \"I don't think Nazism was barbaric, because a high stepping march isn't uncivilised\".\n \n If you don't think chaining someone in a fetal position and leaving them to sit in their own excrement for an extended period is crude, uncivilised or distasteful, that says nothing about the treatment and everything about you.\n\n These savages are lucky they are not summarily shot in the head.", 
   {}, 
   140051, 
   null, 
   1119486120.0
  ], 
  [
   140111, 
   null, 
   "Kronus", 
   "\n I do not believe that turning the air conditioning up and down and playing loud rap music is in anyway \"crude\" or \"uncivilized.\" \n \n Those things get Durbin's panties caught in wad.\n\n \n You are either lying, or grossly misinformed. If American soldiers were being treated the way the prisoners in Gitmo were being treated, you wouldn't stand for it. And that's the real test, isn't it? Would you condone our own troops being treated the way the Gitmo prisoners are, if they had been captured?\n \n Let me clarify that, in case you really are grossly misinformed. Would you condone having our troops held, not as POW's or as criminals, but just held, without access to any sort of representation, without access to even the Red Cross. Shackled to the floor for hours or days, squatting in their own filth, freezing or baking at their jailers whim? Would you really be ok with our troops going through that? I didn't think so.\n \n Ethics 101: If you wouldn't want it to happen to you, don't do it to other people. Bush hasn't learned this yet. I don't know what it's going to take to get him to learn it, but learn it he must if we want to maintain any pretence of America being the proud nation it once was.", 
   {}, 
   140047, 
   null, 
   1119486720.0
  ], 
  [
   140121, 
   null, 
   "ScummyD", 
   "You are either lying, or grossly misinformed. If American soldiers were being treated the way the prisoners in Gitmo were being treated, you wouldn't stand for it. And that's the real test, isn't it? Would you condone our own troops being treated the way the Gitmo prisoners are, if they had been captured?\n\n That would be a violation of the Geneva Convention, so no.\n \n\n Let me clarify that, in case you really are grossly misinformed. Would you condone having our troops held, not as POW's or as criminals, but just heldwithout access to any sort of representation, without access to even the Red Cross. Shackled to the floor for hours or days, squatting in their own filth, freezing or baking at their jailers whim? Would you really be ok with our troops going through that? I didn't think so.\n\n No. Because that would be against the Geneva Convention. US military personnel are soldiers in uniform fighting for a nation state.\n \n Enemy combatants or battlefield combatants are NOT entitled to protection under the Geneva Convention and have no rights. It seems you need to educate yourself on the intricacies of this issue.\n \n\n Ethics 101: If you wouldn't want it to happen to you, don't do it to other people.\n\n Reality 101: Islamofascists don't give a rat's arse about laws/rules/regulations/treaties or any of the other form of battlefield guidelines.\n \n You are silly if you think that our treatement of battlefield combatants at the Gitmo resort in their plush confines being pampered with healthful food and ridiculous allowances for their religion is going to garner US soldiers anything of the like. The actions in Falujah told any rational person this, if it was previously in doubt.\n \n\n Bush hasn't learned this yet.\n\n Bush obviously knows more than you as CIC, and as you have proved in your post here you have had your brain warped by the leftist propaganda emanating from the Democratic Party.\n \n\n I don't know what it's going to take to get him to learn it, but learn it he must if we want to maintain any pretence of America being the proud nation it once was.\n\n Your line of thought represented in this above quote proves your ignorance and naivete.", 
   {
    "post_info": {
     "attachments": 2
    }
   }, 
   140111, 
   null, 
   1119487620.0
  ], 
  [
   140146, 
   null, 
   "gnojek", 
   "I already have.\n \n It will only help the right solidify their power.\n\n You wrote letters to John Kerry and Howard Dean? \n \n What did Wayne say? Shya! and monkeys will fly out of my butt!! emoticon_rolleyes", 
   {}, 
   140008, 
   null, 
   1119491700.0
  ], 
  [
   140147, 
   null, 
   "gnojek", 
   "He's just trying to do what must be done to restore America to the moral high ground it once held.\n\n When was this?", 
   {}, 
   140014, 
   null, 
   1119491760.0
  ], 
  [
   140148, 
   null, 
   "Voice Of Reason", 
   "The problem with what Durbin did is its to late for and apology.........His traitorous words are being used by all the media in the middle east as propaganda against our troops causing them to be in more harms way then they already were in......\n \n He should have never made those remarks.........", 
   {}, 
   140121, 
   null, 
   1119491940.0
  ], 
  [
   140149, 
   null, 
   "gnojek", 
   "That would be a violation of the Geneva Convention, so no.\n\n You care about those?\n \n \nNo. Because that would be against the Geneva Convention. US military personnel are soldiers in uniform fighting for a nation state.\n \n Enemy combatants or battlefield combatants are NOT entitled to protection under the Geneva Convention and have no rights. It seems you need to educate yourself on the intricacies of this issue.\n\n So an army has to be rich enough to afford uniforms before POWs are treated humanely?\n \n \n \n\n Reality 101: Islamofascists don't give a rat's arse about laws/rules/regulations/treaties or any of the other form of battlefield guidelines.\n\n But we do. This makes us better than them.\n Well, we pretend to.", 
   {}, 
   140121, 
   null, 
   1119492180.0
  ], 
  [
   140161, 
   null, 
   "ScummyD", 
   "So an army has to be rich enough to afford uniforms before POWs are treated humanely?\n\n There is a distinct difference between a POW and an enemy combatant that has nothing to do with being rich.", 
   {}, 
   140149, 
   null, 
   1119495600.0
  ], 
  [
   140171, 
   null, 
   "fracas", 
   "There is no need to be on the defensive when pointing out the barbaric actions being undertaken by the US government, or any need to use language that doesn't offend the effeminate sensibilites of the pro-torture crowd.\n\n \nHow about chaining someone to the floor such that they are forced to remain in their own excrement for a prolonged period? Is there some kind of mental block going on, where you only read about the less bad things and the worst ones you just kind of forget about? Or is it just the characteristic dishonesty we've come to expect from you.\n\n i'd like a link to this if you don't mind.\n \n \nIf you don't think chaining someone in a fetal position and leaving them to sit in their own excrement for an extended period is crude, uncivilised or distasteful, that says nothing about the treatment and everything about you.\n\n crude, uncivilized, and distasteful\n but is it barbaric?\n is it torture ?\n \n as you post the link, i'll post one for thoughts", 
   {}, 
   140051, 
   null, 
   1119497460.0
  ], 
  [
   140186, 
   null, 
   "Symbiote", 
   "http://4forums.com/political/showthread.php?t=5678 was the thread this was discussed in.\n \n \nThe Shabach (or Shabak) technique is an extremely controversial interrogation technique used by the Israeli government (specifically Shin Bet, also known as the General Security Service or SHABAK, after which the technique is named,) on Palestinian suspects. It involves forcing the subject to sit on a short stool or chair which is angled forward (so it's impossible to sit in a comfortable, stable position), and then tying their arms and legs behind them to the chair, while also covering their head with a bag and possibly subjecting them to extremely loud noise, such as music. The subject is then left in this condition for extended periods of time. Sleep is not allowed for the duration. It is generally believed that it should be considered a form of torture.\n - Wikipedia\n \n \nOn another occasion, not only was the temperature unbearably hot, but extremely loud rap music was being played in the room, and had been since the day before, with the detainee chained hand and foot in the fetal position on the tile floor.\n\n \n Dubin, on Guantanamo Bay.\n \n \"Sound\" at extremely high volume used to interfere with sleep is also listed there as a torture technique, sleep deprivation is also.\n \n So yes, I would say it falls generally within the range of things considered torture, though if you were to apply a particular precise definition you may be able to define it out.\n \n \n\n These savages are lucky they are not summarily shot in the head.\n\n \n Are you talking about the inmates or the people abusing them?", 
   {}, 
   140171, 
   null, 
   1119500820.0
  ], 
  [
   140204, 
   null, 
   "Voice Of Reason", 
   "I heard some testomoney by some of the guards at GITMO.........They said they had to be careful when walking by the cells because the scum would save up their urine and feces and throw it through the hole where their food is placed and try and hit the guards with it..........\n \n Real nice people you lefties want to cry over...... emoticon_rolleyes \n \n The 500 guys in GITMO are not covered by the rules of the Geneva Convention............They represent no country or wear no uniform which is a requirement to be eligible to be covered...........\n \n Some of the guys released said if they had their choice they would rather stay there....They said the treatment of 3 meals a day, showers, and clean clothes is the best they have ever been treated in their life.......\n \n A far cry from what POWs in past wars like WW2, Korea and Vietnam received.........Those guys can tell you about real torture.....\n Some of you Liberals are probably to young to remember when our POWs were released by the NVN in Nam.........I can still see those guys in my mind...........Broken bodies and minds........A shell of men... It was horrible.......", 
   {}, 
   140186, 
   null, 
   1119507960.0
  ], 
  [
   140245, 
   null, 
   "THEL", 
   "There is a distinct difference between a POW and an enemy combatant that has nothing to do with being rich.\n\n \n You are referring to unlawful combatants, but you're absolutely right.\n \n A uniform and a rifle isn't the privilege of 'rich' armies, it is the most basic elements that make up a military force. If you hide within a civilian population and don't act according to the Geneva conventions (and are also not covered by them) then why should you be treated according to the Geneva conventions.\n \n Certainly the question of how to treat prisoners which include terrorists and other paramilitary guys is far from simple, but let's not be naive either. These terrorists don't act according to any law and they therefore don't deserve all the rights of a lawful combatant (POW). They should be treated humanely and as far as I know they are being treated humanely. \n \n Terrorism is a great threat and unfortunately people don't write on their foreheads \"I'm a terrorist\", and since they don't belong in a regular army there is nothing to stop them from going back to their terrorist activity once they are released. They can live quietly for years in Pakistan or the U.K and meet with other extremists and then one day strike again. So if keeping them incarcerated saves even one life it's worth it.", 
   {}, 
   140161, 
   null, 
   1119529620.0
  ], 
  [
   140246, 
   null, 
   "Symbiote", 
   "It seems you're labelling as a terrorist everyone who is rounded up by the US military, as if the fact they're imprisoned proves it. Are you saying that if you pull someone at random off the street, and they happen to be unarmed and not in a uniform, that shows that they are a terrorist? Is any proof at all required, or is the fact they're muslim convincing evidence of their guilt?\n \n You speak of them \"striking again\" as if the people that are being rounded up have already been discovered to have been responsible for terrorist attacks. I think you're confusing yourself with the language you use, by arbitrarily labelling them \"terrorists\" and then concluding from the fact you call them \"terrorists\" that they have already conducted \"terrorist attacks\".\n \n Regardless of any international agreement, it seems both immoral and counterproductive to me to abuse prisoners who have not even been to trial, who it's never really been proved were actually involved in any sort of crime that would even begin to justify it.\n \n If there is proof, they can be brought to trial, and punished accordingly, instead of suffering from the arbitrary cruellty of whoever is running the show, if there is not proof, then on what grounds can you claim that they are \"terrorists\", is some informant's word good enough?\n \n How can you justify giving Saddam Hussein humane treatment, and bringing him to trial, while those accused of lesser crimes, with less evidence against them, are assumed guilty and punished in this manner? Does being a dictator elevate you above the status of \"terrorist\"?", 
   {}, 
   140245, 
   null, 
   1119530460.0
  ], 
  [
   140247, 
   null, 
   "THEL", 
   "It seems you're labelling as a terrorist everyone who is rounded up by the US military, as if the fact they're imprisoned proves it. Are you saying that if you pull someone at random off the street, and they happen to be unarmed and not in a uniform, that shows that they are a terrorist? Is any proof at all required, or is the fact they're muslim convincing evidence of their guilt?\n \n You speak of them \"striking again\" as if the people that are being rounded up have already been discovered to have been responsible for terrorist attacks. I think you're confusing yourself with the language you use, by arbitrarily labelling them \"terrorists\" and then concluding from the fact you call them \"terrorists\" that they have already conducted \"terrorist attacks\".\n \n Regardless of any international agreement, it seems both immoral and counterproductive to me to abuse prisoners who have not even been to trial, who it's never really been proved were actually involved in any sort of crime that would even begin to justify it.\n\n \n Are you aware that almost all the people held at Gitmo were picked up while fighting along side Taliban and Al-Qaeda members in Afghanistan?\n \n We're not talking about poor Abdul who lives in LA and is suddenly taken by the FBI. American citizens are arrested only with a warrant signed by a judge and if there is some evidence of terrorist activity.\n \n What do you think those boys were doing in Afghanistan?\n Were they just vacationing when they accidentally got into a gun fight along with dozens of Taliban fighters against U.S troops???\n Yeah, those Al-Qaeda run Hopliday-inns (a.k.a terrorist training camps) are a great place to stay while on vacation. After a nice breakfast you can enjoy learning to shoot a semi-automatic rifle, and later perhaps learn to build a bomb, right before lunch.\n And three times a day there is prayer time and hate propaganda to fill the soul.\n \n \nIf there is proof, they can be brought to trial, and punished accordingly, instead of suffering from the arbitrary cruellty of whoever is running the show, if there is not proof, then on what grounds can you claim that they are \"terrorists\", is some informant's word good enough?\n \n How can you justify giving Saddam Hussein humane treatment, and bringing him to trial, while those accused of lesser crimes, with less evidence against them, are assumed guilty and punished in this manner? Does being a dictator elevate you above the status of \"terrorist\"?\n\n \n No, please don't put words in my mouth.\n Saddam will be put on trial according to the laws of Iraq. They will decide how he is to be punished. I'm not saying it's simple. It's anything but simple, but you can't process unlawful enemy combatants in the same way you process shop-lifters and common criminals.", 
   {}, 
   140246, 
   null, 
   1119532260.0
  ], 
  [
   140249, 
   null, 
   "Symbiote", 
   "\n Are you aware that almost all the people held at Gitmo were picked up while fighting along side Taliban and Al-Qaeda members in Afghanistan?\n\n \n Since when does fighting an invading army, regardless of who you are fighting alongside, with a rifle, make you a \"terrorist\"? Does the fact US troops fought \"alongside\" those of the USSR in WW2 make US troops \"communists\"?\n \n Define \"terrorist\" for me, because you seem to be using it to refer to \"anyone who is imprisoned in Guantanamo Bay\".\n \n But then you say \"They can live quietly for years in Pakistan or the U.K and meet with other extremists and then one day strike again. \"\n \n What do you mean strike again? Have you any evidence the people in Guantanamo Bay have ever struck with terrorist attacks before? I would wager most of them never have, and probably never would have, and that you're throwing the word \"terrorist\" around like it means whatever you want it to mean.\n \n The Taliban are not a terrorist group, they're a bunch of religious nuts. How does being a religious nut, fighting invading troops in your own country, make you into a \"terrorist\" who might \"strike again?\".", 
   {}, 
   140247, 
   null, 
   1119532620.0
  ], 
  [
   140251, 
   null, 
   "fracas", 
   "http://4forums.com/political/showthread.php?t=5678 was the thread this was discussed in.\n\n Symbiote\n \n sure, that was in referrence to the actions of the israeli but how does that pertains to Gitmo?\n \n \n \nDubin, on Guantanamo Bay.\n \n \"Sound\" at extremely high volume used to interfere with sleep is also listed there as a torture technique, sleep deprivation is also.\n \n So yes, I would say it falls generally within the range of things considered torture, though if you were to apply a particular precise definition you may be able to define it out.\n\n i posted the wikipedia link as it is a relatively neutral site.\n \n and i will refer to it as well to keep a minimum of objectivity\n \nThe five sensory deprivation techniques\n \n In 1978 in the European Court of Human Rights trial \"Ireland v. the United Kingdom\" the facts were not in dispute and the court published the following in their judgement:\n These methods, sometimes termed \"disorientation\" or \"sensory deprivation\" techniques, were not used in any cases other than the fourteen so indicated above. It emerges from the Commission's establishment of the facts that the techniques consisted of:\n (a) wall-standing: forcing the detainees to remain for periods of some hours in a \"stress position\", described by those who underwent it as being \"spreadeagled against the wall, with their fingers put high above the head against the wall, the legs spread apart and the feet back, causing them to stand on their toes with the weight of the body mainly on the fingers\";\n (b) hooding: putting a black or navy coloured bag over the detainees' heads and, at least initially, keeping it there all the time except during interrogation;\n (c) subjection to noise: pending their interrogations, holding the detainees in a room where there was a continuous loud and hissing noise;\n (d) deprivation of sleep: pending their interrogations, depriving the detainees of sleep;\n (e) deprivation of food and drink: subjecting the detainees to a reduced diet during their stay at the centre and pending interrogations.\n It referred to the above as \"the five techniques\" and ruled:\n 167. ... Although the five techniques, as applied in combination, undoubtedly amounted to inhuman and degrading treatment, although their object was the extraction of confessions, the naming of others and/or information and although they were used systematically, they did not occasion suffering of the particular intensity and cruelty implied by the word torture as so understood. ...\n", 
   {}, 
   140186, 
   null, 
   1119532980.0
  ], 
  [
   140252, 
   null, 
   "fracas", 
   "Since when does fighting an invading army, regardless of who you are fighting alongside, with a rifle, make you a \"terrorist\"? Does the fact US troops fought \"alongside\" those of the USSR in WW2 make US troops \"communists\"?\n \n Define \"terrorist\" for me, because you seem to be using it to refer to \"anyone who is imprisoned in Guantanamo Bay\".\n \n But then you say \"They can live quietly for years in Pakistan or the U.K and meet with other extremists and then one day strike again. \"\n \n What do you mean strike again? Have you any evidence the people in Guantanamo Bay have ever struck with terrorist attacks before? I would wager most of them never have, and probably never would have, and that you're throwing the word \"terrorist\" around like it means whatever you want it to mean.\n \n The Taliban are not a terrorist group, they're a bunch of religious nuts. How does being a religious nut, fighting invading troops in your own country, make you into a \"terrorist\" who might \"strike again?\".\n\n \n the design of the GC was to\n 1. protect innocent civilians in a war zone\n 2. protect military personel of its signatories in a war zone\n \n when combatants pose as civilians or hide behind civilians (physically or masquerading as) civilians are unduely put at risk \n \n the taleban and especially al qaeda are in violation of this.\n in addition\n \nGeneva Convention IV exemptions\n GCIV provides an important exemption:\n \"Where in the territory of a Party to the conflict, the latter is satisfied that an individual protected person is definitely suspected of or engaged in activities hostile to the security of the State, such individual person shall not be entitled to claim such rights and privileges under the present Convention [ie GCIV] as would ... be prejudicial to the security of such State.\" (GVIV article 5)\n In a conflict like the U.S. War on Terrorism many so-called \"unlawful combatants\" have been controversially denied protection under the Geneva Conventions, because they are either excluded by their nationality (see below) or they are deemed to be so dangerous that Article 5 can be invoked.\n There are two further groups who are not protected by GCIV:\n 1. Nationals of a State which is not bound by the Convention are not protected by it.\n 2. Nationals of a neutral State in the territory of a combatant State, and nationals of a co-belligerent State, cannot claim the protection of GCIV if their home state has normal diplomatic representation in the State that holds them (article 4). Since nearly every state has diplomatic recognition of every other state, most citizens of neutral countries in a war zone are not able to claim any protection from GCIV.\n", 
   {}, 
   140249, 
   null, 
   1119533220.0
  ], 
  [
   140254, 
   null, 
   "Symbiote", 
   "sure, that was in referrence to the actions of the israeli but how does that pertains to Gitmo?\n\n \n That top link is a reference to American treatment of prisoners at the US's Cuban prison, with the Israeli quote, which is from Wikipedia, I'm trying to show that the treatment is very similar, though the 1978 ruling you cite is also very similar. So it is of course debatable whether it does or doesn't constitute torture, since torture is fairly loosely defined. I don't really think it's that important what the precise word used to refer to it is, the treatment is there for anyone to see what it is themselves, and I just wonder, is it moral, which is most important, remembering these people have not had a trial, are not guaranteed one, and can be detained indefinitely, and secondly, is it practical - does the fact US treats detainees badly help or hinder its cause - does it give others reason to fear it, or does it inspire hatred?\n \n Is it being done for really practical reasons, or is making someone sit in their own excrement just a kind of vindictiveness - and what place does that have in the military?\n \n And this is regardless of the legal technicalities of the issue. Clearly the fact someone isn't covered by the Geneva Convention doesn't establish that they are a \"terrorist\", unless you're using a very odd definition of terrorist.", 
   {}, 
   140251, 
   null, 
   1119533460.0
  ], 
  [
   140255, 
   null, 
   "THEL", 
   "Since when does fighting an invading army, regardless of who you are fighting alongside, with a rifle, make you a \"terrorist\"? Does the fact US troops fought \"alongside\" those of the USSR in WW2 make US troops \"communists\"?\n \n Define \"terrorist\" for me, because you seem to be using it to refer to \"anyone who is imprisoned in Guantanamo Bay\".\n \n But then you say \"They can live quietly for years in Pakistan or the U.K and meet with other extremists and then one day strike again. \"\n \n What do you mean strike again? Have you any evidence the people in Guantanamo Bay have ever struck with terrorist attacks before? I would wager most of them never have, and probably never would have, and that you're throwing the word \"terrorist\" around like it means whatever you want it to mean.\n \n The Taliban are not a terrorist group, they're a bunch of religious nuts. How does being a religious nut, fighting invading troops in your own country, make you into a \"terrorist\" who might \"strike again?\".\n\n \n First off, I'm not going to give you a definition of terrorist when the U.S and the U.N are still struggling to give a precise difinition (or at least the current difinitions are seen as vague and lacking). But I'm sure you can look it up. ;) \n \n An unlawful combatant is a person fighting outside of the laws of warfare and with no distinguishing marks. If someone shoots at U.S troops, or in any way participates in actions that threaten lives while ignoring the international laws of war, he is an unlawful combatant and is not covered by the third Geneva convention.\n \n And since these people you speak of participated in activity against U.S troops, as far as I'm concerned there is a danger that they will continue acting against U.S citizens and interests (home and abroad), including against U.S troops, once they are released. \n \n If you want proof about individual cases, go to the Pentagon, I don't have that information.\n \n http://www.unhchr.ch/html/menu3/b/91.htm  \n \n http://www.unodc.org/unodc/en/terrorism.html", 
   {}, 
   140249, 
   null, 
   1119533520.0
  ], 
  [
   140257, 
   null, 
   "Symbiote", 
   "First off, I'm not going to give you a definition of terrorist \n\n \n Then why use the word, if you don't have a clear idea of what it means? To claim that \"terrorists\" deserve mistreatment and then not know how to distinguish a terrorist from a non-terrorist seems pretty sloppy reasoning to me - it's just a buzzword designed to evoke images of 9/11 when most the people imprisoned have never been involved in any terrorist attack.\n \n \nIf someone shoots at U.S troops, or in any way participates in actions that threaten lives while ignoring the international laws of war, he is an unlawful combatant and is not covered by the third Geneva convention.\n\n \n Yes, but this would also cover, for example, a Kurd who rebelled against Saddam without a uniform. They aren't covered by the convention, but this doesn't imply that it's moral or practical to mistreat them.\n \n The geneva accord is what it is, it isn't a magic wand that justifies abuse of anyone who falls outside its coverage, or more accurately, anyone who is believe to fall outside its coverage.\n \n It doesn't appear to have been written with this kind of situation in mind, where non-state forces fight a guerrilla war in urban areas, so their exclusion shouldn't really be taken to mean there is some sort of international consensus that treating these fighters worse than regular troops is ok. There seems to me no moral reason for treating Saddam's Elite Troops better than some guy who picked up a rifle because he hates Americans in his country.", 
   {}, 
   140255, 
   null, 
   1119533760.0
  ], 
  [
   140261, 
   null, 
   "fracas", 
   "That top link is a reference to American treatment of prisoners at the US's Cuban prison, with the Israeli quote, which is from Wikipedia, I'm trying to show that the treatment is very similar, though the 1978 ruling you cite is also very similar. So it is of course debatable whether it does or doesn't constitute torture, since torture is fairly loosely defined. I don't really think it's that important what the precise word used to refer to it is, the treatment is there for anyone to see what it is themselves, and I just wonder, is it moral, which is most important, remembering these people have not had a trial, are not guaranteed one, and can be detained indefinitely, and secondly, is it practical - does the fact US treats detainees badly help or hinder its cause - does it give others reason to fear it, or does it inspire hatred?\n\n \n ok, i'll leave aside the association (which i think was both misleading and erroneous) and address the meat of your assertion i bolden.\n 1. is it moral. i think this slips into utilitarianism. the goal of torture is interrogation. the reason you interrogate is to get useful information, which could lead to innocent lives saved. thus you weigh actions against an alledged few to save a general population. certainly the ends does not justify the means if the means is wrong, but this is where it becomes thorny, are the means wrong? sensory depravation has not been deemed wrong thus far. but this technique too will pass, perhaps one day becoming illegal as more refined technique becomes available. thus the moral requestion will depend on whether you believe it is moral to take information from someone who is unwilling to give it.\n 2. is it practical? yes and no. the information you get can be very practical, but are the sequella worth it? i do not believe people react to the maltreatment of prisoners so much as to whether justice and fairness have been given. its injustice that cause hatred.\n \n \nIs it being done for really practical reasons, or is making someone sit in their own excrement just a kind of vindictiveness - and what place does that have in the military?\n\n certainly there is no role for vindictiveness but i do not believe that that is what it is about. it is about obtaining information\n \n \nAnd this is regardless of the legal technicalities of the issue. Clearly the fact someone isn't covered by the Geneva Convention doesn't establish that they are a \"terrorist\", unless you're using a very odd definition of terrorist.\n\n the legality does matter because it provides the framework in which people can agree to work by and discuss.\n we can ofcourse talk about what should be but as long as we talk about what is, we should stick with the current legal agreements.\n \n \nYes, but this would also cover, for example, a Kurd who rebelled against Saddam without a uniform. They aren't covered by the convention, but this doesn't imply that it's moral or practical to mistreat them.\n \n The geneva accord is what it is, it isn't a magic wand that justifies abuse of anyone who falls outside its coverage, or more accurately, anyone who is believe to fall outside its coverage.\n\n insurgents are covered as long as other aspects of the GC applies.", 
   {}, 
   140254, 
   null, 
   1119534360.0
  ], 
  [
   140268, 
   null, 
   "Symbiote", 
   "You weigh actions against an alledged few to save a general population.\n\n \n In my experience, sacrificing a few individuals to achieve a collective good rarely has the desired effect, and it is undeniably a characteristic activity of the sort of evil regimes Durbin has foolishly apologised for comparing what's happening down in Guantanamo to. Maybe it'll turn out ok, after all, the US's intentions are, some would say, noble (though judging from some of the posters on this board, maybe not)\n \n I don't think the legality of the issue is very important here. The US is the quickest draw in town, it can ultimately live by whatever law it wants to, illegal or not, its unenforceable, and unenforceable laws aren't really laws at all. It has to make its own decisions on a moral or practical basis, now that the USSR isn't around to rival its nuclear and military power.", 
   {}, 
   140261, 
   null, 
   1119535740.0
  ], 
  [
   140291, 
   null, 
   "simone", 
   "http://www.nytimes.com/2005/06/22/international/middleeast/22intel.html\n \n Iraq May Be Prime Place for Training of Militants, C.I.A. Report Concludes\n By DOUGLAS JEHL \n Published: June 22, 2005\n WASHINGTON, June 21 - A new classified assessment by the Central Intelligence Agency says Iraq may prove to be an even more effective training ground for Islamic extremists than Afghanistan was in Al Qaeda's early days, because it is serving as a real-world laboratory for urban combat. \n \n The assessment, completed last month and circulated among government agencies, was described in recent days by several Congressional and intelligence officials. The officials said it made clear that the war was likely to produce a dangerous legacy by dispersing to other countries Iraqi and foreign combatants more adept and better organized than they were before the conflict. \n \n Congressional and intelligence officials who described the assessment called it a thorough examination that included extensive discussion of the areas that might be particularly prone to infiltration by combatants from Iraq, either Iraqis or foreigners. \n \n They said the assessment had argued that Iraq, since the American invasion of 2003, had in many ways assumed the role played by Afghanistan during the rise of Al Qaeda during the 1980's and 1990's, as a magnet and a proving ground for Islamic extremists from Saudi Arabia and other Islamic countries.\n \n The officials said the report spelled out how the urban nature of the war in Iraq was helping combatants learn how to carry out assassinations, kidnappings, car bombings and other kinds of attacks that were never a staple of the fighting in Afghanistan during the anti-Soviet campaigns of the 1980's. It was during that conflict, primarily rural and conventional, that the United States provided arms to Osama bin Laden and other militants, who later formed Al Qaeda. \n \n The assessment said the central role played by Iraq meant that, for now, most potential terrorists were likely to focus their energies on attacking American forces there, rather than carrying out attacks elsewhere, the officials said. But the officials said Saudi Arabia, Jordan and other countries would soon have to contend with militants who leave Iraq equipped with considerable experience and training. \n \n Previous warnings of this kind have been less detailed, as when Porter J. Goss, the director of central intelligence, told Congress earlier in the year that jihadists who survive the continued fighting in Iraq would leave there \"experienced in and focused on acts of urban terrorism,\" and form \"a potential pool of contacts to build transnational terrorist cells, groups and networks in Saudi Arabia, Jordan and other countries.\"\n \n The officials who described the new assessment said they could not be identified by name because of the classified nature of the document. The officials came from three different government organizations, and all said they had read the document.\n \n The officials said the document did not address whether the anti-American insurgency in Iraq was indeed in the \"last throes,\" as Vice President Dick Cheney said recently. \n \n In an interview in the current issue of Time magazine, Mr. Goss is quoted as saying that he believed that the insurgents were \"not quite in the last throes, but I think they are very close to it,\" though he did not say such a view was based on a formal intelligence assessment. \n \n \"I think that every day that goes by in Iraq where they have their own government, and it's moving forward, reinforces just how radical these people are and how unwanted they are,\" Mr. Goss was quoted as saying of the insurgents. The interview was the first granted by Mr. Goss since he took over as C.I.A. chief last September.\n \n The officials who described the new intelligence report would not say specifically which regions of the world were described as particularly vulnerable to a spillover from Iraq. But they noted that the combatants in Iraq, whether Iraqis or foreign fighters, have primarily been Arabs who would fit in most easily in other Arab societies. Many of the combatants from Afghanistan came from South Asia and Central Asia, and many went on to campaigns in the 1990's in Chechnya, Uzbekistan, Pakistan and other locations.\n \n In an interview last week, Senator Joseph R. Biden Jr., Democrat of Delaware, said he had been told by American officials during a recent trip to Iraq that a \"disproportionate number\" of the foreign fighters now active there came from Saudi Arabia. A former American intelligence official who visited Saudi Arabia recently said officials there had grown increasingly worried that young Saudis who were leaving to fight Americans in Iraq, traveling by way of Damascus, the Syrian capital, would pose an increased threat to Saudi stability if and when they returned home.", 
   {
    "post_info": {
     "post_title": "Bush Opens University of Terrorism in Iraq"
    }
   }, 
   139909, 
   null, 
   1119542640.0
  ], 
  [
   140292, 
   null, 
   "simone", 
   "http://query.nytimes.com/mem/tnt.html?emc=tnt&tntget=2005/06/23/opinion/l23iraq.html&tntemail1\n \n Iraq as Magnet for Terror\n Published: June 23, 2005\n To the Editor:\n \n The Central Intelligence Agency reports that the United States invasion has made Iraq a source for anti-American action, a training ground for jihadists, who will \"build transnational terrorist cells, groups and networks\" throughout the region if not the world (news article, June 22). \n \n This reality undermines the last justification for the war - the geopolitical fantasy, still popular among neoconservatives inside and outside the administration, that regime change in Iraq would foster moderation and democracy (in other words, friendliness to our country) in other nations in the Middle East.\n \n \"Freedom is on the march,\" President Bush is fond of saying, but unfortunately his war has spawned clandestine battalions marching to a different drummer.\n \n Jay Livingston\n New York, June 22, 2005", 
   {}, 
   140291, 
   null, 
   1119542700.0
  ], 
  [
   140297, 
   null, 
   "THEL", 
   "Then why use the word, if you don't have a clear idea of what it means? To claim that \"terrorists\" deserve mistreatment and then not know how to distinguish a terrorist from a non-terrorist seems pretty sloppy reasoning to me - it's just a buzzword designed to evoke images of 9/11 when most the people imprisoned have never been involved in any terrorist attack.\n \n \n \n Yes, but this would also cover, for example, a Kurd who rebelled against Saddam without a uniform. They aren't covered by the convention, but this doesn't imply that it's moral or practical to mistreat them.\n \n The geneva accord is what it is, it isn't a magic wand that justifies abuse of anyone who falls outside its coverage, or more accurately, anyone who is believe to fall outside its coverage.\n \n It doesn't appear to have been written with this kind of situation in mind, where non-state forces fight a guerrilla war in urban areas, so their exclusion shouldn't really be taken to mean there is some sort of international consensus that treating these fighters worse than regular troops is ok. There seems to me no moral reason for treating Saddam's Elite Troops better than some guy who picked up a rifle because he hates Americans in his country.\n\n \n \n What the hell are you talking about??? Do I have to define every word you ask me to? I posted a U.N link that deals with the problem of the definition of terrorism for you. And the U.S Congress is also trying to improve the current definition of 'terrorist'. It's a problematic term, o.k so what, are you going to start telling people they're not allowed to use it??? \n \n What an ego...\n \n Well, when you come back down to earth then maybe we can continue this discussion. As for the treatment of prisoners, like I said there is no reason to treat them worse than anyone else, but they don't have the rights that lawful combatants have. They don't fight according to any law so they exclude themselves from the normal rights granted to any POW.\n It's a complicated business, but any reasonable person can see that you can't treat terrorists the same way you treat a U.S citizen who may have been caught stealing. It's simply not the same.", 
   {}, 
   140257, 
   null, 
   1119544200.0
  ], 
  [
   140302, 
   null, 
   "Symbiote", 
   "Do I have to define every word you ask me too?\n\n \n If you use a word with an unclear meaning, like terrorist, and use it to describe people who haven't actually committed any terrorist attacks, you should be prepared to explain what you mean. Of course you don't have to, but it might help me understand what you are saying.\n \n \nany reasonable person can see that you can't treat terrorists the same way you treat a U.S citizen who may have been caught stealing. It's simply not the same.\n\n \n I'd probably agree with you if I knew what you meant by terrorist. If you mean \"anyone who the US puts in Guantanamo Bay\", maybe I wouldn't.", 
   {}, 
   140297, 
   null, 
   1119544980.0
  ], 
  [
   140316, 
   null, 
   "ScummyD", 
   "In my experience, sacrificing a few individuals to achieve a collective good rarely has the desired effect, and it is undeniably a characteristic activity of the sort of evil regimes Durbin has foolishly apologised for comparing what's happening down in Guantanamo to.\n\n It is the ends justify the means rationale. And it is the same rationale which undergirded the Allied invasion and storming of the beaches of Normandy. It is the underlying logic of the military in general and reaches far beyond just solely \"evil regimes,\" as you say.", 
   {}, 
   140268, 
   null, 
   1119548580.0
  ], 
  [
   140321, 
   null, 
   "Truthsayer", 
   "As I said, effeminate sensibilities, you'll gladly sanction mistreatment of prisoners halfway around the world, but the use of a harsh word on an internet forum is offensive to you. It is characteristic of the weakness of the Neocons and their supporters, who perhaps are so eager to endorse violence by others because they feel so impotent themselves.\n \n \n I gather you believe the treatment of Gitmo's detainees is tasteful, not crude in the slighest, and entirely civilised.\n\n \n I have no clue as to the \"proper and tasteful\" way you think that we should treat people who would just as soon cut your head off as to look at you. However, that definition you provided, could apply to to a New York Taxi driver. Barbaric, in my opinion, is beheading prisoners, or burning them to a crisp and hanging them from a bridge for Al Jazeer to film. Wanna talk about effeminate sensibilities? Let's start with your sissy version barbarism. It appears that you would prefer we put them up at the Hilton with full room service and a valet. There is nothing tasteful about war. If your girly feelings are hurt because we are not offering these detainees (prisoners) a daily pedicure and a massage, go whine to your hairdresser. I could care less. You are an insult to everyone who has ever died at the hands of these terrorists. You should be ashamed of yourself. :xcensored", 
   {}, 
   140025, 
   null, 
   1119549180.0
  ], 
  [
   140323, 
   null, 
   "ScummyD", 
   "\n \n Terrorism is a great threat and unfortunately people don't write on their foreheads \"I'm a terrorist\", and since they don't belong in a regular army there is nothing to stop them from going back to their terrorist activity once they are released. They can live quietly for years in Pakistan or the U.K and meet with other extremists and then one day strike again. So if keeping them incarcerated saves even one life it's worth it.\n\n Precisely. And they do return to fight and kill coalition forces after being released, as I am sure you well know. \n \n Yet some around here seem to think they should be put up in the Ritz Carlton and then escorted back into the ranks of the terrorist forces. emoticon_rolleyes \n BRUSSELS (Reuters) - A dozen prisoners released from Guantanamo Bay have returned to \"the battlefield\" to fight against the United States, U.S. Attorney General Alberto Gonzales said on Wednesday.\n \n \"There are several people that we have released that we know have come back and fought against America because they have been recaptured or killed on the battlefield,\" he said after meetings in Brussels with European Union officials. \n \n (Source: Reuters)\n ", 
   {}, 
   140245, 
   null, 
   1119549300.0
  ], 
  [
   140326, 
   null, 
   "ScummyD", 
   " It appears that you would prefer we put them up at the Hilton with full room service and a valet. \n\n Whoa, that's funny. I did noteven read your post before I submitted my entry of \"Yet some around here seem to think they should be put up in the Ritz Carlton.\" That's funny. I was going to use the Hilton as an example too.", 
   {}, 
   140321, 
   null, 
   1119549540.0
  ], 
  [
   140333, 
   null, 
   "ScummyD", 
   "\"Sound\" at extremely high volume used to interfere with sleep is also listed there as a torture technique, sleep deprivation is also.\n\n Then I must have been \"tortured\" all through out my college career, what with all the ridiculously loud music blared into the wee hours of the morning, and the sleep deprivation I suffered through studying into the wee hours of the morning to obtain my credentials from the local university. \n \n And my wife must have been tortured by the UC system when she spent four years studying and suffering sleep deprivation to obtain her doctorate. emoticon_rolleyes emoticon_rolleyes emoticon_rolleyes \n \n Get the hell out of here with that tripe!!! What a ****ing joke!!! My gawd.\n \n \n \n\n \n How can you justify giving Saddam Hussein humane treatment, and bringing him to trial, while those accused of lesser crimes, with less evidence against them, are assumed guilty and punished in this manner? Does being a dictator elevate you above the status of \"terrorist\"?\n\n The answer to your qeustion lies in the difference between POWs and illegal battlefield combatants. The fact you ask such a questions illustrates your ignorance with respect to this issue. Saddam is the head of a state, er was. Warriors apprehended on the battlefield in Iraq are not affiliated with any state army and do not adhere to any sort of treaty such as the GC.", 
   {}, 
   140186, 
   null, 
   1119550140.0
  ], 
  [
   140347, 
   null, 
   "Truthsayer", 
   "I am beginning to think that Symbiote is a terrorist sympathizer. I also have to wonder to what lengths this poster is willing to go to, to bolster their cause? Anyone who defends these monsters as this poster does is nothing but traitorous in my humble opinion. I hope \"Big Brother\" is checking on the site once in a while. This person is worth checking into if you ask me.", 
   {}, 
   140333, 
   null, 
   1119550860.0
  ], 
  [
   140366, 
   null, 
   "ScummyD", 
   "I am beginning to think that Symbiote is a terrorist sympathizer. I also have to wonder to what lengths this poster is willing to go to, to bolster their cause? Anyone who defends these monsters as this poster does is nothing but traitorous in my humble opinion. I hope \"Big Brother\" is checking on the site once in a while. This person is worth checking into if you ask me.\n\n I share that sentiment about many posters I run into who ceaselessly defend Islamofascists and prop up these savages as if they are respectable human beings that harbor no ill will and are totally harmless.\n \n I agree. Since one never nows who one is dealing with on the net, these people could be sympathizers if not active participants.\n \n The NY Times is included in this list of suspects as are many other leftist bilge prints and tv media.", 
   {}, 
   140347, 
   null, 
   1119551940.0
  ], 
  [
   140470, 
   null, 
   "gnojek", 
   "There is a distinct difference between a POW and an enemy combatant that has nothing to do with being rich.\n\n Just wearing uniforms?\n You know during the Revolutionary War (the american one) a lot of soldiers didn't have uniforms. They weren't rich enough.\n \n I guess they were just enemy combatants and not soldiers.\n \n POW, in case you didn't know, stands for Prisoner of War.\n This is a prisoner taken during battle (in a war).\n \n Even though you're right. The legal definition of POW does not include a Franc-tireur.\n \n Under the Geneva Conventions a lot of soldiers in the American Revolutionary war would be classified as these. If they were being held at Camp X-Ray, they could \"legally\" be tortured all day long.", 
   {}, 
   140161, 
   null, 
   1119568080.0
  ], 
  [
   140476, 
   null, 
   "gnojek", 
   "You are referring to unlawful combatants, but you're absolutely right.\n\n So if someone was invading your country. Flying planes in, trucks driving in...etc. You're telling me that you are going to \"follow the law\" and go sign up at the Army Recruiting Station, or are you going to grab a gun and start shooting? You would wait until you're uniform and rank was issued?\n \n \nA uniform and a rifle isn't the privilege of 'rich' armies, it is the most basic elements that make up a military force. If you hide within a civilian population and don't act according to the Geneva conventions (and are also not covered by them) then why should you be treated according to the Geneva conventions.\n\n Would you be thinking about the Geneva Conventions when your village is under attack?\n \n Would you think \"Well, I'd better get to the recruiter and sign up for the military right now!\"\n \n \nCertainly the question of how to treat prisoners which include terrorists and other paramilitary guys is far from simple, but let's not be naive either. These terrorists don't act according to any law and they therefore don't deserve all the rights of a lawful combatant (POW). They should be treated humanely and as far as I know they are being treated humanely. \n\n What law were we following when we invaded Iraq?\n \n \nTerrorism is a great threat and unfortunately people don't write on their foreheads \"I'm a terrorist\", and since they don't belong in a regular army there is nothing to stop them from going back to their terrorist activity once they are released. They can live quietly for years in Pakistan or the U.K and meet with other extremists and then one day strike again. So if keeping them incarcerated saves even one life it's worth it.\n\n I think you may be confising the term geurilla with terrorist?\n Or are they the same thing to you?", 
   {}, 
   140245, 
   null, 
   1119568500.0
  ], 
  [
   140481, 
   null, 
   "Truthsayer", 
   "Just wearing uniforms?\n You know during the Revolutionary War (the american one) a lot of soldiers didn't have uniforms. They weren't rich enough.\n \n Absolutely. To the British they were. What we called gurilla warfare we now call terrorism. \n \n POW, in case you didn't know, stands for Prisoner of War.\n This is a prisoner taken during battle (in a war).\n \n Come to think of it, how could John McCain be a POW when Viet Nam was not, in fact, a war but rather a \"police action?\" \n \n Even though you're right. The legal definition of POW does not include a Franc-tireur.\n \n Under the Geneva Conventions a lot of soldiers in the American Revolutionary war would be classified as these. If they were being held at Camp X-Ray, they could \"legally\" be tortured all day long.\n \n Tortured how? Make them drink warm beer? :p", 
   {}, 
   140470, 
   null, 
   1119568800.0
  ], 
  [
   140496, 
   null, 
   "fracas", 
   "In my experience, sacrificing a few individuals to achieve a collective good rarely has the desired effect, and it is undeniably a characteristic activity of the sort of evil regimes Durbin has foolishly apologised for comparing what's happening down in Guantanamo to. Maybe it'll turn out ok, after all, the US's intentions are, some would say, noble (though judging from some of the posters on this board, maybe not)\n\n the basis of a nation going to war is predicated on sacrificing a few (relatively) individuals for a collective good. and the desired effect has frequently been achieve, but only the victor. which suggest that if you fight, you have to win.\n \n \nI don't think the legality of the issue is very important here. The US is the quickest draw in town, it can ultimately live by whatever law it wants to, illegal or not, its unenforceable, and unenforceable laws aren't really laws at all. It has to make its own decisions on a moral or practical basis, now that the USSR isn't around to rival its nuclear and military power.\n\n legality of the issue is very important. you cannot violate something that is not recognized.\n the worse thing in the 20th century was the cold war and the opposition without direct confrontation between the US and the Soviets.\n in ww2 millions died, but the war was over in 5 years. fascism defeated.\n with the cold war, 40+ years and as many if not more millions died. what is worse is even as the winner, the west was weaker for it ideologically and consequences are still being felt today in the middle east, in latin america, in africa, and central asia.", 
   {}, 
   140268, 
   null, 
   1119569820.0
  ], 
  [
   140501, 
   null, 
   "gnojek", 
   "Just wearing uniforms?\n You know during the Revolutionary War (the american one) a lot of soldiers didn't have uniforms. They weren't rich enough.\n \n Absolutely. To the British they were. What we called gurilla warfare we now call terrorism. \n \n POW, in case you didn't know, stands for Prisoner of War.\n This is a prisoner taken during battle (in a war).\n \n Come to think of it, how could John McCain be a POW when Viet Nam was not, in fact, a war but rather a \"police action?\" \n \n Even though you're right. The legal definition of POW does not include a Franc-tireur.\n \n Under the Geneva Conventions a lot of soldiers in the American Revolutionary war would be classified as these. If they were being held at Camp X-Ray, they could \"legally\" be tortured all day long.\n \n Tortured how? Make them drink warm beer? :p\n\n \n You heard it from Truthsayer first!\n We owe our freedom to terrorists!\n :)", 
   {}, 
   140481, 
   null, 
   1119570360.0
  ], 
  [
   140573, 
   null, 
   "Symbiote", 
   "If you support the mistreatment, abuse and indefinite internment of people who have never been convicted of any crime, you are no better than any terrorist yourself. You talk about \"these people who cut off heads\", but how many of them have actually cut off heads? You talk about \"terrorists\" but how many of them have conducted terrorist attacks? The people being punished have not been convicted of any crime, you take the fact that they have been accused and put in a prison as proof they are a \"terrorist\", which is just blind obedience to the government.\n \n An ends justifies the means morality justifies any and all actions undertaken, from torturing people not even convicted of any crime to blowing up a schoolbus full of children, or a couple of skyscrapers. The \"If you think the consequences will be good, it's ok to do it\" is such an extremely weak ethical line of thought, it's the opposite of any kind of morality.\n \n It's clear you are unable to defend such behaviour, since all you do is impugn the character of anyone who brings it up and demand they be silenced. Free speech is presumably another sacrifice that has to be made to achieve the ends - and what ends might those be?\n \n I sympathise with people treated as terrorists who have never been convicted of terrorist acts. I sympathise with innocent people suffering for someone's grand scheme.\n \n You call them terrorists so you do not have to think about the treatment, the reality is you don't even know what a terrorist is; you can't define it, so it's just a word to block out any sense of humanity about them. You use it the way the Nazis used the word \"Jew\".\n \n OMG HE's a jEW SYMPathiser, I Hope TEH THOGUHT police come and get this TRAITOrOUS persoN!", 
   {}, 
   140501, 
   null, 
   1119586380.0
  ], 
  [
   140663, 
   null, 
   "fracas", 
   "1. in a course of a civil society it is right that you assume innocence until proven guilty.\n this has never been and should never be so in a conduct of a war. we have never and will never ask questions first and shoot after.\n 2. the inmates at gitmo were captured on the fields of battle. they were captured violating the rules of war as declared by the geneva convention. the gc was set up to protect firstly civilians in a war zone so they would not be targetted and to protect legal combatants once they have been captured.\n there should be penalties to combatants who violate the rules of war. by the GC declarations they can be shot on sight, captured or otherwise, no trials necessary. it is interesting to think that it is a worse violation of human rights to capture them for interrogation, with or without torture, rather than summary execution in the field.\n 3. i do not condone torture. but i have yet to see credible evidence of torture at gitmo. strippers, pop music, sensory depravation, barking dogs and bad languages have not crossed the line into torture. and i do not give a damn about mishandling the koran.\n 4. it would be a farce to try any captured prisoners. in fact it is against the gc. example.\n plaintiff lawyer: have you shot at american soldiers?\n defense: yes\n judge: guilty.\n they should be kept alive, treated humanely without torture, until their home country request their return.", 
   {}, 
   140573, 
   null, 
   1119619800.0
  ], 
  [
   140679, 
   null, 
   "Kronus", 
   "\n 2. the inmates at gitmo were captured on the fields of battle. they were captured violating the rules of war as declared by the geneva convention. the gc was set up to protect firstly civilians in a war zone so they would not be targetted and to protect legal combatants once they have been captured.\n there should be penalties to combatants who violate the rules of war. by the GC declarations they can be shot on sight, captured or otherwise, no trials necessary. it is interesting to think that it is a worse violation of human rights to capture them for interrogation, with or without torture, rather than summary execution in the field.\n \n\n \n How do we know that they violated the GC? The administration has declared that they have, but what is that worth? By doing so Bush has thrust them into a legal limbo, where apparently no rules apply and he can do pretty much whatever he wants with them. That by itself is enough motivation for Bush to declare them in violation of the GC, whether or not they were. This makes his word suspect. \n \n I don't know international law, and I get the impression that we don't have any international lawyers here. I understand one country holding another country's citizens as POW's during war. I understand arresting criminals. We've done neither. We're just holding these people. How can that possibly be legal? By what right can one country go into another and just grab people, regardless of what they may or may not have done? If they were POW's then they should be released now that the war is over. If they are criminals then they should be tried and punished. If they are neither than how can we possibly justify holding them? Just because Bush says so?", 
   {}, 
   140663, 
   null, 
   1119625680.0
  ], 
  [
   140681, 
   null, 
   "fracas", 
   "How do we know that they violated the GC? The administration has declared that they have, but what is that worth? By doing so Bush has thrust them into a legal limbo, where apparently no rules apply and he can do pretty much whatever he wants with them. That by itself is enough motivation for Bush to declare them in violation of the GC, whether or not they were. This makes his word suspect. \n \n I don't know international law, and I get the impression that we don't have any international lawyers here. I understand one country holding another country's citizens as POW's during war. I understand arresting criminals. We've done neither. We're just holding these people. How can that possibly be legal? By what right can one country go into another and just grab people, regardless of what they may or may not have done? If they were POW's then they should be released now that the war is over. If they are criminals then they should be tried and punished. If they are neither than how can we possibly justify holding them? Just because Bush says so?\n\n no, not because Bushs says so. \n because i've read the GC.\n it is freely available online. try the wikipedia link i posted earlier.\n read it than discuss, rather than rail without knowing it.", 
   {}, 
   140679, 
   null, 
   1119625860.0
  ], 
  [
   140686, 
   null, 
   "Kronus", 
   "no, not because Bushs says so. \n because i've read the GC.\n it is freely available online. try the wikipedia link i posted earlier.\n read it than discuss, rather than rail without knowing it.\n\n \n It's a fairly lengthy document. You mind citing which sections support Bush just grabbing people?", 
   {}, 
   140681, 
   null, 
   1119627240.0
  ], 
  [
   140689, 
   null, 
   "fracas", 
   "It's a fairly lengthy document. You mind citing which sections support Bush just grabbing people?\n\n if you won't take bush's words, why would you take mine? \n read the wikipedia link. it is not that long.", 
   {}, 
   140686, 
   null, 
   1119628020.0
  ], 
  [
   140690, 
   null, 
   "Kronus", 
   "if you won't take bush's words, why would you take mine? \n read the wikipedia link. it is not that long.\n\n \n Because I know Bush is a liar but I don't know that about you? :)\n \n Seriously though, I can't find this link you're talking about. Can you either repost it or give me a more precise pointer to it?", 
   {}, 
   140689, 
   null, 
   1119628500.0
  ], 
  [
   140694, 
   null, 
   "fracas", 
   "Because I know Bush is a liar but I don't know that about you? :)\n \n Seriously though, I can't find this link you're talking about. Can you either repost it or give me a more precise pointer to it?\n\n this wikipedia link is about torture but it also has link to the GC and related topics.\n \nGeneva Conventions\n The four Geneva Conventions provide protection for people who fall into enemy hands. They envisage war in its traditional form, whereby people in uniforms fight clearly defined enemies in uniform, within a clearly defined arena. It therefore divides people into two explicit groups: combatants and non-combatants (civilians). There is a third group whose existence is implied, but whose treatment is not covered in detail. These are unlawful combatants, such as spies, mercenaries and other combatants who have broken the laws of war, for example by firing on an enemy while flying a white flag. Whilst combatants and non-combatants are provided substantial protection, a lesser level of protection is afforded to unlawful combatants.\n The third(GCIII) and fourth(GCIV) Geneva Conventions are the two most relevant for the treatment of the victims of conflicts. Both treaties state in their similarly worded article 3 that in a non-international armed conflict that \"Persons taking no active part in the hostilities, including members of armed forces who have laid down their arms... shall in all circumstances be treated humanely and that there must not be any \"violence to life and person, in particular murder of all kinds, mutilation, cruel treatment and torture.\" or \"outrages upon personal dignity, in particular humiliating and degrading treatment\".\n Under GCIV most enemy civilians in an international armed conflict will be \"Protected Persons\" under the meaning of GCIV, (see exemptions section immediatly after this for those who are not). Under article 32, protected persons have the right to protection from \"murder, torture, corporal punishments, mutilation and medical or scientific experiments...but also to any other measures of brutality whether applied by non-combatant or military agents.\"\n The treatment of prisoners of war (POWs) in an international armed conflict is covered by GCIII. In particular article 17 states that \"No physical or mental torture, nor any other form of coercion, may be inflicted on prisoners of war to secure from them information of any kind whatever. Prisoners of war who refuse to answer may not be threatened, insulted or exposed to unpleasant or disadvantageous treatment of any kind.\".\n GCIII POW status has far fewer exemptions than \"Protected Person\" status under GCIV. If a person is an enemy combatant in an international armed conflict, then they will have the protection of GCIII and be entitled to be regarded as POWs under GCIII unless they are an unlawful combatant. If there is a question of whether the combatant is an unlawful combatant, they must be treated as POW's \"until their status has been determined by a competent tribunal\" (GCIII article 5). If the tribunal decides that they are an unlawful combatant, and they are a Protected Person under GCIV, they will still have the some protections under GCIV Article 5. They must be \"treated with humanity and, in case of trial [for ], shall not be deprived of the rights of fair and regular trial prescribed by the present Convention\".\n A person, who is found guilty of war crimes in an international armed conflict, or is not protected by GCIV because of some other exemption, is no longer protected by the Geneva Conventions.\n\n the last part is the point of contention. are they illegal combatants for having violated the GC rule of war.\n \nGeneva Convention IV exemptions\n GCIV provides an important exemption:\n \n\"Where in the territory of a Party to the conflict, the latter is satisfied that an individual protected person is definitely suspected of or engaged in activities hostile to the security of the State, such individual person shall not be entitled to claim such rights and privileges under the present Convention [ie GCIV] as would ... be prejudicial to the security of such State.\" (GVIV article 5)\n\n In a conflict like the U.S. War on Terrorism many so-called \"unlawful combatants\" have been controversially denied protection under the Geneva Conventions, because they are either excluded by their nationality (see below) or they are deemed to be so dangerous that Article 5 can be invoked.\n There are two further groups who are not protected by GCIV:\n 1. Nationals of a State which is not bound by the Convention are not protected by it.\n 2. Nationals of a neutral State in the territory of a combatant State, and nationals of a co-belligerent State, cannot claim the protection of GCIV if their home state has normal diplomatic representation in the State that holds them (article 4). Since nearly every state has diplomatic recognition of every other state, most citizens of neutral countries in a war zone are not able to claim any protection from GCIV.\n\n afaik, the taleban were never confirm their adherence to the GC\n nor have the current afghan or saudi governments asked for these detainees back.", 
   {}, 
   140690, 
   null, 
   1119629400.0
  ], 
  [
   140705, 
   null, 
   "Kronus", 
   "\n afaik, the taleban were never confirm their adherence to the GC\n nor have the current afghan or saudi governments asked for these detainees back.\n\n \n I'll grant that the Gitmo detainees may not be entitiled to full GC protection, though I will call your attention to this later paragraph in Article 5.\n \n In each case, such persons shall nevertheless be treated with humanity and, in case of trial, shall not be deprived of the rights of fair and regular trial prescribed by the present Convention. They shall also be granted the full rights and privileges of a protected person under the present Convention at the earliest date consistent with the security of the State or Occupying Power, as the case may be.\n \n \n My point, however, is this. If they aren't protected by the GC, then what rules do apply? Are they criminals? If so then they should have been tried by now. If we're not calling them criminals then what are they? I can't believe that it's legal to simply hold people in legal limbo indefinately, with no legal recourse. That goes against the entire concept of \"rule of law\". If you can point to some international law that says what Bush is doing is permissable then I'd love to see it.", 
   {}, 
   140694, 
   null, 
   1119630480.0
  ], 
  [
   140709, 
   null, 
   "fracas", 
   "I'll grant that the Gitmo detainees may not be entitiled to full GC protection, though I will call your attention to this later paragraph in Article 5.\n \n In each case, such persons shall nevertheless be treated with humanity and, in case of trial, shall not be deprived of the rights of fair and regular trial prescribed by the present Convention. They shall also be granted the full rights and privileges of a protected person under the present Convention at the earliest date consistent with the security of the State or Occupying Power, as the case may be.\n \n \n My point, however, is this. If they aren't protected by the GC, then what rules do apply? Are they criminals? If so then they should have been tried by now. If we're not calling them criminals then what are they? I can't believe that it's legal to simply hold people in legal limbo indefinately, with no legal recourse. That goes against the entire concept of \"rule of law\". If you can point to some international law that says what Bush is doing is permissable then I'd love to see it.\n\n \n 1. they are not criminal. we have no civil jurisdiction in afghanistan to hold them as civil criminals.\n 2. they are not PoW as they did not meet the criteria set by the GC\n 3. they are in legal limbo until GC5 clarifies.\n 4. they will be released when Afghanistan or saudi ask for them, or when we declare victory, or when they renounce their past.\n 5. rule of law cannot cover all that exist. that there is no rule of law declaring this permissible cannot and should not be taken to make the current situation \"illegal\" or \"impermissible\". there should never be a time when what is permissible/impermissible is entirely defined by law. in this case, strict adherence to \"rule of law\" per GC could mean summary execution of all detained as spies and illegal combatants.", 
   {}, 
   140705, 
   null, 
   1119631560.0
  ], 
  [
   140722, 
   null, 
   "Kronus", 
   "1. they are not criminal. we have no civil jurisdiction in afghanistan to hold them as civil criminals.\n\n Some of them have been described as terrorists. Terrorism is a crime and legal channels exist that would allow us to prosecute.\n \n \n\n 2. they are not PoW as they did not meet the criteria set by the GC\n\n Granted.\n \n \n\n 3. they are in legal limbo until GC5 clarifies.\n\n What does that mean, exactly? Is there some body that does have jurisdition here and can make rulings as to the detainees status?\n \n \n\n 4. they will be released when Afghanistan or saudi ask for them, or when we declare victory, or when they renounce their past.\n\n Several of the detainees have had their home countries ask for them back, and have been refused. We have declared victory in both Afghanistan and Iraq. I don't believe that if the detainees said \"I give up terrorism\" that they would be released. Do you?\n \n \n\n 5. rule of law cannot cover all that exist. that there is no rule of law declaring this permissible cannot and should not be taken to make the current situation \"illegal\" or \"impermissible\". there should never be a time when what is permissible/impermissible is entirely defined by law. in this case, strict adherence to \"rule of law\" per GC could mean summary execution of all detained as spies and illegal combatants.\n\n If they are, in fact, in legal limbo then it would be to our credit to accord them more rights than required, rather than push the definition of torture and seeing how much we can get away with. A country shows its true colors when given free reign, and if Gitmo is our true face than we should be ashamed. But I refuse to believe that Gitmo is really an example of what America is about. I believe that it's Bush's warped vision of what this country needs, and I support any legal effort to get him to abandon that vision.", 
   {}, 
   140709, 
   null, 
   1119633660.0
  ], 
  [
   140727, 
   null, 
   "fracas", 
   "Some of them have been described as terrorists. Terrorism is a crime and legal channels exist that would allow us to prosecute.\n\n it is not about whether terrorism is a crime or not. it is about we have no legal jurisdiction at all to prosecute for actions taking place beyond our border.\n \n \nWhat does that mean, exactly? Is there some body that does have jurisdition here and can make rulings as to the detainees status?\n\n if their legal limbo status is a problem, then they need to set up a geneva convention #5 to address the issue of terrorists. i've no problem with that. then have the signatories be held accountable for their actions.\n until then and only until then would their detention at gitmo be illegal.\n \n \nSeveral of the detainees have had their home countries ask for them back, and have been refused. We have declared victory in both Afghanistan and Iraq. I don't believe that if the detainees said \"I give up terrorism\" that they would be released. Do you?\n\n countries that have asked for them have largely received them. link me the ones that have been denied. recently the Australian government has declined to take one of theirs back as they would not be able to prosecute.\n some have declared they will give up terrorism and have been released already.\n \n \n \nIf they are, in fact, in legal limbo then it would be to our credit to accord them more rights than required, rather than push the definition of torture and seeing how much we can get away with. A country shows its true colors when given free reign, and if Gitmo is our true face than we should be ashamed. But I refuse to believe that Gitmo is really an example of what America is about. I believe that it's Bush's warped vision of what this country needs, and I support any legal effort to get him to abandon that vision.\n\n we are keeping them alive, and treating them fairly well. we are not required to do so by the GC and have done so.\n but again, you are working under the US civil assumption of innocent until proven guilty. this is not the case world wide. this should not be the case with regard to war. in war we do not ask first shoot second. we shoot first. we have not shot these guys. we are now asking questions.\n can we be even nicer? certainly. but why should we other than for public relation points abroad?\n i am fine with this. and so are the majority of americans if that matters. \n as long as the government actions are supported by its populace, and there are no moral improprieties, i am fine with it.", 
   {}, 
   140722, 
   null, 
   1119634380.0
  ], 
  [
   140741, 
   null, 
   "THEL", 
   "If you use a word with an unclear meaning, like terrorist, and use it to describe people who haven't actually committed any terrorist attacks, you should be prepared to explain what you mean. Of course you don't have to, but it might help me understand what you are saying.\n \n \n \n I'd probably agree with you if I knew what you meant by terrorist. If you mean \"anyone who the US puts in Guantanamo Bay\", maybe I wouldn't.\n\n \n \n Well, since you won't stop whining about it and aren't going to actually address my arguments until I post a definition, how about this one from Answers.com (Although I did already post a relevant article from the UN.org which deals with exactly this question.) \n \n http://www.answers.com/topic/terrorism\n \n And this one from Wikipedia: Link \n \n But like I said, the fact that the people in Gitmo were unlawful combatants means that they are not covered by the third and fourth Geneva Conventions. Therefore you have nothing to complain about. Furthermore, since I already explained that they were picked up while engaging in hostile activity toward U.S forces, if they are released they could go back to attacking U.S citizens, or interests (both home and abroad). And the guy with the Patton avatar brought you an example of exactly that. Great avatar btw ScummyD.", 
   {}, 
   140302, 
   null, 
   1119635940.0
  ], 
  [
   140758, 
   null, 
   "Kronus", 
   "it is not about whether terrorism is a crime or not. it is about we have no legal jurisdiction at all to prosecute for actions taking place beyond our border.\n\n International legal bodies do exist for dealing with this sort of thing. If they are terrorists then we should prosecute them using these bodies.\n \n \n \n\n countries that have asked for them have largely received them. link me the ones that have been denied.\n\n http://www.heraldsun.news.com.au/common/story_page/0,5478,15568477%255E23109,00.html\n JudgeGarzon said Spain had recently received no response when it sought to extradite three Spaniards charged with crimes in Spain and being held at the US detention centre in Guantanamo Bay, Cuba.\n \n \n \n \n\n we are keeping them alive, and treating them fairly well. we are not required to do so by the GC and have done so.\n\n If we're treating them so well, then why has the camp been condemned by both AI and the Red Cross? Why won't Bush allow any sort of public inspection? Why the repeated claims of abuse? \n \n You say that as long as there are no moral improprieties, you're fine. We have an administration that has said in writing that they condone the use of turture, a camp where inspections and reports aren't allowed, and claims of abuse keep leaking out. How strong does the proof of improprieties need to be before you're not \"fine\". Do you need to see video of Bush turning the thumbscrews before you'll take action? For me the very idea of holding prosoners in limbo is bad enough, and not allowing a third party to inspect their condition and tell the world what is happening is well over the line. Nothing that this administration has done to date gives me any faith that they're showing any restraint. They will push the limits as far as they think they can get away with. If this isn't the case, then why won't they let the Red Cross say what conditions are like in there?", 
   {}, 
   140727, 
   null, 
   1119637380.0
  ], 
  [
   140776, 
   null, 
   "ScummyD", 
   "\n \n Under the Geneva Conventions a lot of soldiers in the American Revolutionary war would be classified as these. If they were being held at Camp X-Ray, they could \"legally\" be tortured all day long.\n\n So what. What is your point?", 
   {}, 
   140470, 
   null, 
   1119640500.0
  ], 
  [
   140781, 
   null, 
   "fracas", 
   "International legal bodies do exist for dealing with this sort of thing. If they are terrorists then we should prosecute them using these bodies.\n\n such as?\n and limit them to ones we are a party of.\n \n \nhttp://www.heraldsun.news.com.au/common/story_page/0,5478,15568477%255E23109,00.html\n JudgeGarzon said Spain had recently received no response when it sought to extradite three Spaniards charged with crimes in Spain and being held at the US detention centre in Guantanamo Bay, Cuba.\n\n interesting. consider this then.\n \nLast month Hamed Abderrahman Ahmad, the only Spaniard held in detention at the US prison camp Guantanamo Bay, was repatriated to Spain at the request of senior judge Baltasar Garzon.\n \n ...\n \n Garzon stated that the Spanish government was legally obliged to pursue extradition against Ahmad and three other men who are not Spanish citizens because evidence existed against them in Spain. Their alleged crimes, he said, were \"at least partly\" planned in Spain-strengthening the case for extradition. He argued that Guantanamo Bay, being under US control, fell within the 1971 extradition treaty between the two countries.\n\n this is from a Socialist News  source too ;)\n so Spain got its citizen back. but the other three are not. they wwanted the other three because they had evidence against them in spain. i wonder if their crimes occurred in spain as well. no matter, as they are not spanish citizens, i am reluctant to think without their national government consent the three should be sent to spain.\n \n \nIf we're treating them so well, then why has the camp been condemned by both AI and the Red Cross? Why won't Bush allow any sort of public inspection? Why the repeated claims of abuse? \n\n the only independent group with actually access to Gitmo is the red cross. amnesty internation has not even been there to make its own assessment. thus they are making condemnation based on hearsays. and using poor analogy at that. they have since admitted no first hand information and that the gulag comparison was essentially a publicity stunt\n thus that leave the red cross. from their web page for the Annual Report press conference dated June 17 2005\n \nReplying to questions about the US detention centre at Guantanamo Bay, President Kellenberger said the ICRC continued to carry out its visits on a regular basis. He said the ICRC pursued its confidential dialogue with the US authorities and that its recommendations had been implemented in part, as in many other contexts. \n\n and a search of their site with guantanamo found no condemnation. perhaps you can link me?\n \n \nYou say that as long as there are no moral improprieties, you're fine. We have an administration that has said in writing that they condone the use of turture, a camp where inspections and reports aren't allowed, and claims of abuse keep leaking out. How strong does the proof of improprieties need to be before you're not \"fine\". Do you need to see video of Bush turning the thumbscrews before you'll take action? For me the very idea of holding prosoners in limbo is bad enough, and not allowing a third party to inspect their condition and tell the world what is happening is well over the line. Nothing that this administration has done to date gives me any faith that they're showing any restraint. They will push the limits as far as they think they can get away with. If this isn't the case, then why won't they let the Red Cross say what conditions are like in there?\n\n 1. inspections and reports are made regullarly by the red cross. see above.\n 2. claims of abuses leaked out are largely fabricated by the media as was the case with the koran abuses. it also fascinate me that the words of terrorists imprisoned are more trust worthy than that of soldiers of the US. this selective bias is quite inexplicable.\n \nAs a recent veteran of Guantanamo Bay, I've been troubled by the willingness of some (namely this editorial page) to make uninformed inflammatory statements about the detention operations at GTMO. I believe that if any one of them had the opportunity to visit GTMO and witness the operation first hand, they would change their tone, if not their minds altogether.\n Not only are the detainees treated humanely (top-notch medical care, hearty meals, recreational facilities, full access to religious observance, etc..) but I personally witnessed instances when detainees did not want to leave. It was not uncommon for my platoon to guard an airfield for hours in preparation for sending a detainee home, only to turn around and bring him back to the detention facility - because he refused to leave! These detainees are not stupid-they know that real torture and inhumane treatment await them at home. And while I know they're not happy to be in GTMO, they rest assured that they will be treated well because Americans play by the rules.\n \n I feel sheepish even having to defend this issue. While our servicemen (and innocent Iraqi citizens) are being blown-up and tortured overseas, the media obsesses over a handful of \"mishandled\" Korans and excessive air conditioning. (It's also worth noting that these so-called instances of \"abuse\" at GTMO were all uncovered by internal Army investigations! It's not as if the Army is torturing people and covering it up. On the contrary, the minute the Army gets wind of minor misconduct it swiftly removes and prosecutes those involved. This is an institution upholding the highest moral traditions of our country.) Would the terrorists do the same? No, I think they'd just wink at us...and then cut our heads off.\n \n LT Peter Hegseth\n Forest Lake, MN\n U.S. Army National Guard, Infantry\n\n this actually has a name attached rather than un-named sources or vague \"prisoner reports\". link \n \n i am fine with pushing the limits inorder to extract information that could save the lives of actual innocents rather than the comforts of the guilty. as long as we do not cross the limit. and when we do, if it is not policy, than the individuals must be brought to justice. if it is policy than that is another matter. thus far no evidence toward this being policy. there was the Gonzales memo, but this is a legal analysis of options, not policy documentations for implementations. and i still don't see torture as being oked in the memo. see page 4 of the memo.", 
   {
    "unicode_changes_made": true
   }, 
   140758, 
   null, 
   1119640920.0
  ], 
  [
   140798, 
   null, 
   "Kronus", 
   "\n and a search of their site with guantanamo found no condemnation. perhaps you can link me?\n\n http://query.nytimes.com/gst/abstract.html?res=F30910FF3A5A0C738FDDA80994DC404482&incamp=archive:search\n \n ABSTRACT - International Committee of Red Cross charges in confidential reports to United States government that American military has intentionally used psychological and sometimes physical coercion 'tantamount to torture' on prisoners at Guantanamo Bay,\n \n Officially the Red Cross is only allowed to report straight to the Bush administration, so their official web site cannot back up these assertions. If they did they wouldn't be allowed in the camp anymore.\n \n \n\n 1. inspections and reports are made regullarly by the red cross. see above.\n 2. claims of abuses leaked out are largely fabricated by the media as was the case with the koran abuses. it also fascinate me that the words of terrorists imprisoned are more trust worthy than that of soldiers of the US. this selective bias is quite inexplicable.\n \n\n Anytime any government holds people without access to the law, and without letting the public see what's happening, then I will be suspicious of what the governement is doing. The fact that this administration has shown a consistent disdain for law and procedure only makes it worse. The reports from the prisoners is merely a small bit of corroborating evidence.\n \n \n \n\n i am fine with pushing the limits inorder to extract information that could save the lives of actual innocents rather than the comforts of the guilty. as long as we do not cross the limit. \n\n \n The mere act of their detention has crossed the limit. They're being held with no legal recource, and out of the public eye. That is ethically and morally wrong. You say they're guilty, how do you know that some of them weren't swept up by accident? You say they have information. How do you know, since the public has been given only limited information? Why are you so willing to turn your back on the rule of law. What have these detentions gained us that's worth ignoring the basic values that make this a great country?\n \n We are not a police state. We are not fascists. We don't just hold people because we think they might have information. We don't just \"disappear\" people. We are better than that, or at least we used to be.", 
   {}, 
   140781, 
   null, 
   1119642900.0
  ], 
  [
   140865, 
   null, 
   "fracas", 
   "http://query.nytimes.com/gst/abstract.html?res=F30910FF3A5A0C738FDDA80994DC404482&incamp=archive:search\n \n ABSTRACT - International Committee of Red Cross charges in confidential reports to United States government that American military has intentionally used psychological and sometimes physical coercion 'tantamount to torture' on prisoners at Guantanamo Bay,\n \n Officially the Red Cross is only allowed to report straight to the Bush administration, so their official web site cannot back up these assertions. If they did they wouldn't be allowed in the camp anymore.\n\n good link\n but not proof that torture is happening. tantamount to?\n psychological coercion?\n physical coercion?\n it all comes down to what is torture.\n \n \nAnytime any government holds people without access to the law, and without letting the public see what's happening, then I will be suspicious of what the governement is doing. The fact that this administration has shown a consistent disdain for law and procedure only makes it worse. The reports from the prisoners is merely a small bit of corroborating evidence.\n\n the administration disdain for law has only two vivid examples.\n 1. forgoing invasion of iraq without UN approval. absence of approval does not constitute violation of laws. i am in full support of never allowing foreigners to dictate when and what we can and cannot do to protect ourselves when it comes to military action.\n 2. forgoing classifying the illegal combatants as PoW eligible for GC protection. they have made credible justification for this interpretation. \n 3. when i weight the words of a captured terrorist with that of one of our soldiers, my credibility goes to the soldier. \n 4. rule of law. when the US supreme court ruled that the US citizen detaineeds have constitutional rights, they were delivered.\n \n so yes, there may be suspicions. no problem with that. but the speculation is becoming a witch hunt. that is unproductive.\n \n \nThe mere act of their detention has crossed the limit. They're being held with no legal recource, and out of the public eye. That is ethically and morally wrong. You say they're guilty, how do you know that some of them weren't swept up by accident? You say they have information. How do you know, since the public has been given only limited information? Why are you so willing to turn your back on the rule of law. What have these detentions gained us that's worth ignoring the basic values that make this a great country?\n\n you and many others may not like the detention, but there has been no objective legal limit crossed.\n in a war, information is vital to victory. and it should be guarded and solicited. the public does not have a right to know during a course of a war details of its conduct and this is specified by the rule of law. what ever happened to loose lips sink ships? they were not just for posters you know.\n i have not once been willing to turn my back on the rule of law. there has been no laws applicable.\n it is funny that we are less squimish about a battle where thousands are killed, but wince when a few are detained and kept alive.\n in war, they are guilty until proven otherwise. many have already been released. some in error as they have returned to the front to shoot and kill our troops again. kept in detention, they will not be killed or be able to kill.\n \n \nWe are not a police state. We are not fascists. We don't just hold people because we think they might have information. We don't just \"disappear\" people. We are better than that, or at least we used to be.\n\n police states and fascists are terminology so misapplied as to undermine your argument. no one has disappeared. allegations such as this, or Durbins, or AI only hurt your argument for change rather than generate any chances of improvement because they are so grossly wrong.\n both police state and fascist state apply more with how the government act against its own citizens. such terms have nothing to do with gitmo. we have no obligations to treat our enemies well in the conduct of war. they try to kill us; we try to kill them, as it should be in a war. we treat our enemies captured well because we want them to do the same for our troops, and because we promised to do so for all signatories of the GC. when faces with an enemy that neither respect the rule of war or the protection of innocents civilians as well as captured soldiers, my preference is to kill them rather than to coddle them.\n \n you have not made a case for violation of treaties or rule of law.\n perhaps you could explain to why we should be nicer to them to produce victory rather than appeasement for foreign public approval.\n \n \n edit: consider this as well", 
   {}, 
   140798, 
   null, 
   1119652800.0
  ], 
  [
   140939, 
   null, 
   "Kronus", 
   "good link\n \n but not proof that torture is happening. tantamount to?\n \n\n No, it's not proof. But the Red Cross is one of the most respected organizations in the world. If they don't apporve of what you're doing then that's a good sign that you might want to think about your approach. It's also a good sign that citizens might want to question what their government is doing a little more closely.\n \n \n\n you and many others may not like the detention, but there has been no objective legal limit crossed.\n\n No legal limit has been crossed because Bush refuses to define the detainees in such a way that any rules apply. And that, to my mind, crosses a moral limit.\n \n \n \n\n police states and fascists are terminology so misapplied as to undermine your argument. no one has disappeared. allegations such as this, or Durbins, or AI only hurt your argument for change rather than generate any chances of improvement because they are so grossly wrong.\n both police state and fascist state apply more with how the government act against its own citizens.\n\n Does the name Padilla ring a bell? The so called \"dirty bomber\"? He's a US citizen. Bush's administration decided that he was an \"enemy combatant\" and have locked him away in a navy brig for the last couple of years. He hasn't been charged with anything, and he's received no trial. Is that the sort of activity you mean when you talk about fascism and police states? Because frankly the fact that he's still in there, that his rights were stripped away so casually, scares the hell out of me.\n \n \nwe treat our enemies captured well because we want them to do the same for our troops, and because we promised to do so for all signatories of the GC. \n\n I would hope that that wouldn't be the only reason. I would hope that we would do it because it's the correct, moral thing to do. Even when we aren't forced to by treaty we should still do the correct, moral thing.\n \n \n\n you have not made a case for violation of treaties or rule of law.\n perhaps you could explain to why we should be nicer to them to produce victory rather than appeasement for foreign public approval.\n \n\n If we treated them better it might help convince some in the Middle East who are on the fence that we aren't their enemy, but that really isn't my point. We may not have broken any treaties or laws, I don't know enough to say for sure. That doesn't mean that what we are doing isn't wrong. You said yourself that laws don't cover every situation. We are detaining people with no legal recourse. If the GC applied our treatment of them would be in violation of it. The detainees have no way of demonstrating that they aren't a threat. And it's all being done in such a way that the public has no idea what's really happening. I don't care what the situation is, the governement should never be allowed to just lock people up, in secret, with no legal recourse. Because if we allow it to happen, it could happen to, for example, you. Your name matches some terrorists name on a list, or some clerk makes a typo, and you're disappeared too. Farfetched? Of course. But once you allow the government down that path, they will keep going. They've already locked up one US citizen that we know about. Are there more that we haven't heard about? How many more will follow? If we let our government deny the most basic legal rights to any one group, then it makes it that much easier for them to deny them to any other group. There may be no law that says we need to treat the detainees better. There may be no treaty saying they must have some sort of legal representation. But they should get it anyway, because it's the moral thing to do, and if we allow the governement to act immorally once, \"for our own good\", then you can count on then acting immorally again. And even if you think that what's happening in Gitmo is for our own good, you have no guarantee that whatever Bush's administation does next will be. The administration believes that \"national safety\" trumps morals, trumps ethics, trumps everything else. If too many citizens believe the same thing then we might as well throw the Bill of RIghts out the window, because we will see our rights stripped away one by one, for our own good.", 
   {}, 
   140865, 
   null, 
   1119669960.0
  ], 
  [
   140965, 
   null, 
   "daewoo", 
   "Does the name Padilla ring a bell? The so called \"dirty bomber\"? He's a US citizen. Bush's administration decided that he was an \"enemy combatant\" and have locked him away in a navy brig for the last couple of years. He hasn't been charged with anything, and he's received no trial. Is that the sort of activity you mean when you talk about fascism and police states? Because frankly the fact that he's still in there, that his rights were stripped away so casually, scares the hell out of me.\n\n \n And we have no idea how many others may be similarly confined. We know about Padilla only because thre happened to be a news crew there when he was apprehended and they got in on the story. \n \n That si the problem with some of the provisions of the patriot act. Nobody outside fo the justice departmetn knows if it is being abused or not, and for those inside the justice department who do know, it is a felony to say anything.", 
   {}, 
   140939, 
   null, 
   1119684660.0
  ], 
  [
   141010, 
   null, 
   "fracas", 
   "No, it's not proof. But the Red Cross is one of the most respected organizations in the world. If they don't apporve of what you're doing then that's a good sign that you might want to think about your approach. It's also a good sign that citizens might want to question what their government is doing a little more closely.\n\n then note that in an earlier link\n criticism by the red cross are being addressed\n \n \nNo legal limit has been crossed because Bush refuses to define the detainees in such a way that any rules apply. And that, to my mind, crosses a moral limit.\n\n no legal limits have been crossed because there are no appropriate legal limits in application.\n and are you confusing legal limits with moral limits?\n if you like, we can branch of a discussion on the morality of gitmo.\n \n \nDoes the name Padilla ring a bell? The so called \"dirty bomber\"? He's a US citizen. Bush's administration decided that he was an \"enemy combatant\" and have locked him away in a navy brig for the last couple of years. He hasn't been charged with anything, and he's received no trial. Is that the sort of activity you mean when you talk about fascism and police states? Because frankly the fact that he's still in there, that his rights were stripped away so casually, scares the hell out of me.\n\n padilla was a us citizen who commited an act of war\n in essence he loyalty is not to the US but to the islamofascist plotting destruction of the US. He is an enemy spy.\n never the less, the supreme court has granted him legal representation\n \n \nI would hope that that wouldn't be the only reason. I would hope that we would do it because it's the correct, moral thing to do. Even when we aren't forced to by treaty we should still do the correct, moral thing.\n\n and we have treated them well. probably better than anywhere else.\n but again, it is a war. what is the morality in a war when you kill strangers who just happens to wear a different uniform? owe allegiance to another.\n the detainees have been well treated even without GC protection. can you not acknowledge this? sure they could be even be better treated but that is another matter as to how well, not whether they are well treated.\n \n \nIf we treated them better it might help convince some in the Middle East who are on the fence that we aren't their enemy, but that really isn't my point. We may not have broken any treaties or laws, I don't know enough to say for sure. That doesn't mean that what we are doing isn't wrong. You said yourself that laws don't cover every situation. We are detaining people with no legal recourse. If the GC applied our treatment of them would be in violation of it. The detainees have no way of demonstrating that they aren't a threat. And it's all being done in such a way that the public has no idea what's really happening. I don't care what the situation is, the governement should never be allowed to just lock people up, in secret, with no legal recourse. Because if we allow it to happen, it could happen to, for example, you. Your name matches some terrorists name on a list, or some clerk makes a typo, and you're disappeared too. Farfetched? Of course. But once you allow the government down that path, they will keep going. They've already locked up one US citizen that we know about. Are there more that we haven't heard about? How many more will follow? If we let our government deny the most basic legal rights to any one group, then it makes it that much easier for them to deny them to any other group. There may be no law that says we need to treat the detainees better. There may be no treaty saying they must have some sort of legal representation. But they should get it anyway, because it's the moral thing to do, and if we allow the governement to act immorally once, \"for our own good\", then you can count on then acting immorally again. And even if you think that what's happening in Gitmo is for our own good, you have no guarantee that whatever Bush's administation does next will be. The administration believes that \"national safety\" trumps morals, trumps ethics, trumps everything else. If too many citizens believe the same thing then we might as well throw the Bill of RIghts out the window, because we will see our rights stripped away one by one, for our own good.\n\n 1. you are still working under the presumption of innocent until proven guilty. in a war this is not the case. thousands captured have already been released before ever making it to Gitmo. hundreds have already been released from gitmo. a few hundreds remain.\n 2. your next assumption is that if W is behind it, it must be nefarious and wrong.\n 3. then an argument for the slippery slope ... if this happens, then that will inevitably follow. there are sufficient check and balances in the government to arrest any rapid descent into a police state. that durbin, pelosi, kenedy, dean and any others continue to voice opposition is a testament to that. never been a fan of the slippery slope, not just because of the check and balance existing, but that it is an impractical concern. like gay marriage would mean bestiality.\n 4. the arabs do not really care about gitmo. read the arab press, they are following western liberal complaints, not mounting their own. \n \n lets leave aside all that and lets just focus on the morality of detention if you want.\n but remember, these detainees are the last few of thousands that have already been vetted.\n \n \n @Daewoo\n \n if you don't mind, we are having an adult conversation here.", 
   {}, 
   140939, 
   null, 
   1119709620.0
  ], 
  [
   141149, 
   null, 
   "Kronus", 
   "\n if you like, we can branch of a discussion on the morality of gitmo.\n \n\n Good idea, but see below.\n \n \n\n padilla was a us citizen who commited an act of war\n in essence he loyalty is not to the US but to the islamofascist plotting destruction of the US. He is an enemy spy.\n \n\n No. That's completely wrong, and I find the fact that you're defending his detention somewhat disturbing. He was not caught sabotaging a power plant or stealing files from the Pentagon. He wasn't caught in the act of doing anything. He was arrested in an airport. The administration simply accused him of treasonous activites, classified him as an \"enemy combatant\", and stripped him of all his rights. He's had no trial, so we have no way of knowing if a single accusation that the government has made is true. He is a US citizen, and he is innocent until proven guilty, especially if he wasn't actually doing anything when they grabbed him. \n \n I'd love to discuss the morallity of Gitmo with you, but perhaps this might be a better starting point? If I can't convince you that Padilla's detention is wrong, legally and more importantly ethically, then I have no hope of convincing you that Gitmo is a problem. Shall we start here?\n \n \n\n 1. you are still working under the presumption of innocent until proven guilty. in a war this is not the case.\n \n\n Of course in a war some things are simpler. If you capture someone on the battlefield, they're a POW, throw them in a POW camp. If they're sneaking around your base at night, they're a spy, shoot them. What were these people doing? Do you actually know, because I sure don't. I'm less concerned about whether they are innocent or guilty as the fact that they are nothing. They have no status, and there's no criteria for their release or punishment.\n \n \n\n 2. your next assumption is that if W is behind it, it must be nefarious and wrong.\n \n\n While it's true that I have no love for this administration, if any president were running a secret jail I'd be concerned.\n \n \n\n 3. then an argument for the slippery slope ... if this happens, then that will inevitably follow. there are sufficient check and balances in the government to arrest any rapid descent into a police state. that durbin, pelosi, kenedy, dean and any others continue to voice opposition is a testament to that. never been a fan of the slippery slope, not just because of the check and balance existing, but that it is an impractical concern. like gay marriage would mean bestiality.\n \n\n Is a police state inevitable? No, of course not. Is it a concern? Yes, I think so. We do have members of the government, like Durbin, speaking out against what's happening. We've also seen him blasted for what he said, and have had calls on the forum to have him arrested. There are checks and balances in the government, but the strongest check has always been public scrutiny. Recall McCarthyism. Fear of \"the Reds\" drove people to give the government freer reign than they should have had, and the result was one of the more shamefull periods of modern american history. I don't want to see fear of terrorism drive us to repeat those mistakes.\n \n \n\n lets leave aside all that and lets just focus on the morality of detention if you want.\n \n\n Fine, but see what I said above about Padilla.", 
   {}, 
   141010, 
   null, 
   1119736200.0
  ], 
  [
   141156, 
   null, 
   "fracas", 
   "flipping things around a bit for flow\n \n \nOf course in a war some things are simpler. If you capture someone on the battlefield, they're a POW, throw them in a POW camp. If they're sneaking around your base at night, they're a spy, shoot them. What were these people doing? Do you actually know, because I sure don't. I'm less concerned about whether they are innocent or guilty as the fact that they are nothing. They have no status, and there's no criteria for their release or punishment.\n\n they are not nothing.\n they are detained as illegal combatants per the GC, but not protected by the GC, but are never the less fairly well treated.\n is it the detention or the indeterminate length of detention that troubles you?\n and how long would you detain them for as PoW?\n has the taleban surrendered? al qaeda signed armistice?\n \n \nIs a police state inevitable? No, of course not. Is it a concern? Yes, I think so. We do have members of the government, like Durbin, speaking out against what's happening. We've also seen him blasted for what he said, and have had calls on the forum to have him arrested. There are checks and balances in the government, but the strongest check has always been public scrutiny. Recall McCarthyism. Fear of \"the Reds\" drove people to give the government freer reign than they should have had, and the result was one of the more shamefull periods of modern american history. I don't want to see fear of terrorism drive us to repeat those mistakes.\n\n then it is the people who act without reasons\n dispense justice from ignorance that you should fear, not the government.\n and as it happens, some of those targetted by the red scare were soviet spies.\n \n \nNo. That's completely wrong, and I find the fact that you're defending his detention somewhat disturbing. He was not caught sabotaging a power plant or stealing files from the Pentagon. He wasn't caught in the act of doing anything. He was arrested in an airport. The administration simply accused him of treasonous activites, classified him as an \"enemy combatant\", and stripped him of all his rights. He's had no trial, so we have no way of knowing if a single accusation that the government has made is true. He is a US citizen, and he is innocent until proven guilty, especially if he wasn't actually doing anything when they grabbed him. \n \n I'd love to discuss the morallity of Gitmo with you, but perhaps this might be a better starting point? If I can't convince you that Padilla's detention is wrong, legally and more importantly ethically, then I have no hope of convincing you that Gitmo is a problem. Shall we start here?\n\n \n lets start here then with this summary from the wikipedia , not quite a neutral source but close enough.\n \nJosé Padilla (also known as Abdullah al-Muhajir) (born October 18, 1970) is accused of being a terrorist by the United States government. He is currently being detained without charge in a South Carolina military prison under orders of President George W. Bush.\n \n The U.S. administration describes him as an illegal enemy combatant however this is not a legal definition because he has not been in front of a \"competent [military] tribunal\", as stipulated under Article 5 of the Third Geneva Convention, to ascertain if he is an enemy combatant who has broken the laws of war.\n Born in Brooklyn, New York City, New York, Padilla became a gang member after moving to Chicago, Illinois, and was arrested several times. During his gang years, he maintained several aliases, such as José Rivera, José Alicea, José Hernandez and José Ortiz. After serving his last jail sentence, he converted to Islam. He went to the Masjid Al-Iman mosque in Fort Lauderdale, Florida with Adham Amin Hassoun, who at that time was the registered agent for Benevolence International Foundation, a charity which U.S. investigators have accused of funding terrorist activities. Padilla and Hassoun became friends. U.S. authorities accuse Hassoun of consorting with radical Islamic fundamentalists, possibly including Al-Qaida. Hassoun was arrested in 2002 for overstaying his visa. [1]\n Padilla traveled to Egypt, Saudi Arabia, Afghanistan, and Pakistan. On his return, he was arrested by federal agents at Chicago's O'Hare International Airport on May 8, 2002 and held as material witness on the warrant issued in New York State about the 2001 9/11 attacks. On June 9, 2002 President Bush issued an order to Secretary Rumsfeld to detain Padilla as an \"enemy combatant\". The order legally justified the detention by leaning on the AUMF which authorized the President to \"...use all necessary force against ... such nations, organizations, or persons.\" and in the opinion of the administration a U.S. citizen can be an enemy combatant (This was decided by the United States Supreme Court in the case of ex parte Quirin)[2]. Padilla is currently being detained without charge in a naval brig at Hanahan in South Carolina and is accused by the Bush Administration of being an illegal enemy combatant and a nuclear terrorist planning to set off a dirty bomb. [3]\n On December 18, 2003, the U.S. Second Circuit Court of Appeals declared that the Bush Administration lacked the authority to designate a U.S. citizen arrested on U.S. soil an \"illegal enemy combatant\" without clear congressional authorization (per 18 U.S.C. § 4001(a)); it consequently ordered the government to release him from military custody within thirty days[4]. However, the court has stayed the order pending appeal.\n On February 20, 2004, the Supreme Court agreed to hear the government's appeal. The Supreme Court heard the case, Rumsfeld v. Padilla, in April 2004, but on June 28 it was thrown out on a technicality. The court declared that New York State, where the case was originally filed, was an improper venue and that the case should have been filed in South Carolina, where Padilla was being held.\n On February 28, 2005, in Spartanburg, South Carolina, U.S. District Judge Henry Floyd ordered the Bush administration to either charge Padilla or release him[5]. He relied on the Supreme Court's ruling in the parallel enemy combatant case of Yaser Hamdi (Hamdi v. Rumsfeld), in which the majority decision declared a \"state of war is not a blank check for the president when it comes to the rights of the nation's citizens.\"\n\n so that is the background and the time course\n lets then look at his \"crimes\". we can use this bit from Time (which isn't a mouthpiece for the administration).\n \nPadilla, 31, had prepped hard for his meeting, but his ambition outstripped his guile. Senior U.S. officials tell Time that Padilla, conducting research on the Internet, had come across instructions for building a nuclear bomb-\"an H-bomb,\" as a top official described it. The instructions were laughably inaccurate-more a parody than a plan-but not recognizing that, Padilla took them to Abu Zubaydah and other al-Qaeda planners and said he wanted to detonate such a weapon in the U.S. \"He was trying to build something that would attain a nuclear yield,\" says a senior Bush Administration official monitoring Padilla's case. In response, Abu Zubaydah apparently cautioned his eager job applicant to think smaller-to get some training and attack America with a so-called \"dirty bomb,\" a conventional explosive packed with radioactive waste that would spew when the bomb blew up. \"They sent him to the U.S. to see what he could do-plan and execute,\" the official says. What he did was get arrested as soon as he stepped off the plane on May 8, having come full circle, back to Chicago, the site of his first encounters with the law.\n ***\n And so Padilla began a 10-year odyssey, moving ever closer to radical elements within Islam. In South Florida, as many as 60,000 Muslims attend two dozen mosques and religious sites, spanning the spectrum of ideology. A subculture of extremism has taken hold in certain pockets. \"Hamas and Hizballah have a wide network here,\" says a prominent Islamic community leader. \"We have been taking a nap on this issue for far too long. These are people who are convinced that the West is evil and America is 'Darul Harb,'\" the Place of War. The community leader, who requested anonymity, describes a growing radicalized cadre of mostly Middle Eastern men who aggressively recruit young Muslims. These men often drive BMWs and Mercedes and lure followers with money, he says.\n \n Padilla attended at least two mosques in the Broward County area that have since been linked to extremist activity. One is the Darul Uloom Islamic Institute in Pembroke Pines. Last month two men in their 20s who had frequented the Darul Uloom mosque were arrested on federal charges of plotting to blow up electrical power stations in South Florida as part of a \"holy war\" against the U.S. Maulana Shafayat, imam of the Darul Uloom mosque, says he condemns extremist ideology. But, he concedes, \"a certain percentage [of converts] do get radical. They are mostly less educated, and they are the ones who feel they are oppressed.\"\n ***\n In March Abu Zubaydah was captured in Pakistan. A month later, he hinted to his FBI and CIA interrogators that he had talked to people who wanted to put together a dirty bomb, says a U.S. official. He provided no details, but agents started comparing intelligence as well as material from safe houses they had raided. Out popped Padilla's name, the official says. They then matched the name to a passport photo of Padilla and checked the identification with Abu Zubaydah, who confirmed it. The chase was on.\n\n here is a US citizen\n who plots with enemies of the US against the US\n confirmed by one enemy involved\n \n lets start here and proceed.\n and lets leave it in this thread to minimize interlopers.", 
   {
    "unicode_changes_made": true
   }, 
   141149, 
   null, 
   1119738240.0
  ], 
  [
   141170, 
   null, 
   "Kronus", 
   "\n they are detained as illegal combatants per the GC, but not protected by the GC, but are never the less fairly well treated.\n is it the detention or the indeterminate length of detention that troubles you?\n and how long would you detain them for as PoW?\n has the taleban surrendered? al qaeda signed armistice?\n \n\n It's the indeterminate length and the secrecy.\n You detain POW's until the war is over.\n I don't know if the taleban officially surrendered, and since we never recognized them as a governement I don't think it would have mattered. However, we have recognized the new Afghani government, and so the war there is technically over.\n Al Queda is not a government, so despite the rhetoric we are not actually at war with them. \n \n \n \n\n lets start here then with this summary\n\n Good links\n \n \n\n here is a US citizen\n who plots with enemies of the US against the US\n confirmed by one enemy involved\n \n under GC, he can be categorized as a spy posing as a civilian, and shot on sight.\n \n\n I've seen nothing in the GC that pertains to how you treat your own citizens, only spies from another country. The way US citizens are treated by the US government is covered by US law. And by US law he gets a trial. If this isn't the case, if your interpretation is correct, then what's to prevent Bush from going to Abu Zubaydah and saying \"Durbin is a terrorist, right? Good.\" Blam. \"And Howard Dean? Good.\" Blam. \"And fracas? Good.\" Blam. (nothing personal, your name just got on the wrong list somehow)\n \n One of the points behind having the Bill of Rights is that we, the people, shouldn't have blind faith in the government. We should suspect those in power. That's why we should never take the government's word that \"so-and-so is a terrorist and needs to be locked away.\" If Padilla is a threat than the government must prove it, we can't just take their word. That's one of the backbones (more than one backbone?) of our system of government, that it must be answerable to the people. Allegations must be proven, and trials must be public. The government can not, and must not, ever have the power to simply lock someone away with no trial, no matter what they've done. Their guilt must be proven in a court.", 
   {}, 
   141156, 
   null, 
   1119740100.0
  ], 
  [
   141195, 
   null, 
   "fracas", 
   "It's the indeterminate length and the secrecy.\n You detain POW's until the war is over.\n I don't know if the taleban officially surrendered, and since we never recognized them as a governement I don't think it would have mattered. However, we have recognized the new Afghani government, and so the war there is technically over.\n Al Queda is not a government, so despite the rhetoric we are not actually at war with them. \n\n thus because they have not been recognized as governments, they cannot surrender?\n and because they cannot surrender we cannot hold their operatives?\n well the fall back would be to ask their current governments if they want them ... and they don't\n should we just dump them at the border then?\n \n can we be at war with a non-government?\n yes, history support this.\n Rome fell to a non-government.\n \n \n \nI've seen nothing in the GC that pertains to how you treat your own citizens, only spies from another country. The way US citizens are treated by the US government is covered by US law. And by US law he gets a trial. If this isn't the case, if your interpretation is correct, then what's to prevent Bush from going to Abu Zubaydah and saying \"Durbin is a terrorist, right? Good.\" Blam. \"And Howard Dean? Good.\" Blam. \"And fracas? Good.\" Blam. (nothing personal, your name just got on the wrong list somehow)\n\n i've deleted the GC and spy thing as it really doesn't apply in the government decision to detain, at least as presented by their lawyers.\n \n it would be suspect to just take Abu Zubaydah's word for it\n but there are also collaborative evidence\n and what happens when you cannot provide collaborative evidence in a public trial because of their secrecy?\n \n the padilla case is going to trial on July 19.\n \n \nOne of the points behind having the Bill of Rights is that we, the people, shouldn't have blind faith in the government. We should suspect those in power. That's why we should never take the government's word that \"so-and-so is a terrorist and needs to be locked away.\" If Padilla is a threat than the government must prove it, we can't just take their word. That's one of the backbones (more than one backbone?) of our system of government, that it must be answerable to the people. Allegations must be proven, and trials must be public. The government can not, and must not, ever have the power to simply lock someone away with no trial, no matter what they've done. Their guilt must be proven in a court.\n\n \n my take is otherwise, that the bill of rights is an apriori set of limitations on government actions in order to highlight the individual citizens rights.\n \n more later", 
   {}, 
   141170, 
   null, 
   1119745080.0
  ], 
  [
   141232, 
   null, 
   "Kronus", 
   "\n it would be suspect to just take Abu Zubaydah's word for it\n but there are also collaborative evidence\n and what happens when you cannot provide collaborative evidence in a public trial because of their secrecy?\n \n the padilla case is going to trial on July 19.\n \n\n So the word of a terrorist is insufficient, but if there's other evidence then it's justified.\n What you're trying to do here is come up with a system of rules and conditions whereby it's premissable for the government to detain someone. The thing is, we already have that. Most of it's in the Constitution. It includes things like a trial by jury, legal representation, a prompt trial. I'm sure you're familiar with it all. These are the rules we have. Bush wants exceptions to these rules, and he wants to define what the excpetions are.\n You say Padilla goes to trial July 19. That's 3 years after he was arrested, and Bush has fought his going to trial the whole way. The courts seem to agree with my interpretation, that the Constitution and not Bush decides what a person's rights are. What I'd like to know from you is this: is it good that he's finally getting his day in court? Why or why not?\n \n Concerning secret evidence: It would take some research to confirm, which I will try to do later, but there must already be a system in place to present evidence without revealing its source. It would be an almost necessary tool for fighting organised crime, for example, so I'd have to guess (and I admit it's a guess at this point) that some method has been developed.\n \n \n \n\n my take is otherwise, that the bill of rights is an apriori set of limitations on government actions in order to highlight the individual citizens rights.\n \n\n That's only about a half step away from what I said. Ask yourself, why do we want limits on government actions? Why don't we just let them do whatever they want? The answer; because we don't/can't trust them not to abuse that power.", 
   {}, 
   141195, 
   null, 
   1119762360.0
  ], 
  [
   141302, 
   null, 
   "fracas", 
   "lets look at the last Supreme Court decision as agreed to as the facts:\n \nRUMSFELD, SECRETARY OF DEFENSE v. PADILLA ET AL. \n CERTIORARI TO THE UNITED STATES COURT OF APPEALS FOR THE SECOND CIRCUIT No. 03-1027. Argued April 28, 2004-Decided June 28, 2004 \n \n [i]Respondent Padilla, a United States citizen, was brought to New York for detention in federal criminal custody after federal agents apprehended him while executing a material witness warrant issued by the District Court for the Southern District of New York (Southern District) in connection with its grand jury investigation into the September 11, 2001, al Qaeda terrorist attacks. While his motion to vacate the warrant was pending, the President issued an order to Secretary of Defense Rumsfeld designating Padilla an \"enemy combatant\" and directing that he be detained in military custody. Padilla was later moved to a Navy brig in Charleston, S. C., where he has been held ever since. His counsel then filed in the Southern District a habeas petition under 28 U. S. C. §2241, which, as amended, alleged that Padilla's military detention violates the Constitution, and named as respondents the President, the Secretary, and Melanie Marr, the brig's commander. The Government moved to dismiss, arguing, inter alia, that Commander Marr, as Padilla's immediate custodian, was the only proper respondent, and that the District Court lacked jurisdiction over her because she is located outside the Southern District. That court held that the Secretary's personal involvement in Padilla's military custody rendered him a proper respondent, and that it could assert jurisdiction over the Secretary under New York's long-arm statute, notwithstanding his absence from the District. On the merits, the court accepted the Government's contention that the President has authority as Commander in Chief to detain as enemy combatants citizens captured on American soil during a time of war. The Second Circuit agreed that the Secretary was a proper respondent and that the Southern District had jurisdiction over the Secretary under New York's long-arm statute. The appeals court reversed on the merits, however, holding that the President lacks authority to detain Padilla militarily. [i]\n\n essentially the government is arguing that Padilla is a prisoner of war, even as a citizen of the US, and thus could be held as such. and as such, cannot be charged by the Geneva Convention, which has the stature of law.\n naturally there is disagreement.\n \n \n regarding the bill of right, it has little to do with mistrusting the government, rather the affirmation of inalienable rights and that the citizens are the foundation for government.", 
   {
    "unicode_changes_made": true
   }, 
   141232, 
   null, 
   1119795300.0
  ], 
  [
   141588, 
   null, 
   "Kronus", 
   "\n essentially the government is arguing that Padilla is a prisoner of war, even as a citizen of the US, and thus could be held as such. and as such, cannot be charged by the Geneva Convention, which has the stature of law.\n naturally there is disagreement.\n \n\n The administration is arguing. Since we're dealing with mulitple branches of the government we should try to be precise to avoid confusion. The administration argued one way, the higher courts have ruled otherwise.\n \n You still haven't said what you think of all this. You seem to be defending the administration, so I must assume you approve, but I'd like it if you would spell it out. Do you approve of the manner of Padilla's detention? Is it a good or bad thing that he's getting a trial?\n \n \n \n\n regarding the bill of right, it has little to do with mistrusting the government, rather the affirmation of inalienable rights and that the citizens are the foundation for government.\n\n You're right, I overstated my case. Most of the Bill of Rights is an affirmation of rights. However, the 4th, 5th, and 6th limit the powers of gevernment to protect the people. Protect them from the government.\n \n I guess I did this backwards. Before defending my point perhaps I should have simply presented it clearly, and seen if you even disagreed. So here it is: A certain distrust of the government is inherent in our form of government. We have three branches so that they can keep tabs on each other, and we the citizens must keep tabs on them. The government must be able to justify its actions to the people, and the actions of the government must be visible to the people. Any time the government hides its actions we the people should be suspicious.\n \n So what do you think? If the government is acting suspiciously should our first reaction be to trust them or doubt them?", 
   {}, 
   141302, 
   null, 
   1119886020.0
  ], 
  [
   141592, 
   null, 
   "fracas", 
   "1. that there is a disagreement within the government about padilla is proof that the system of check and balance remains intact and functional. a far cry from the totalitarian claims some have made.\n 2. my thoughts on the case? i do understand the concerns the administration has in this matter. i do believe in times of war we stretch the limits of constitutional powers as the balance of goal shifts for security over liberty. is padilla a traitor or an enemy combatant? i think it comes down to level of threat he posed, if it is just passing along information that is harmful to our interests, then he is simply a traitor. if he plans to attack and harm american civilians and infrastructure, then he is a combatant. as a traitor, he should be charged and tried. as a combatant he should be detained. i have no strong views either way actually, and what would swing me one way or the other is whether state secret may be involved. i do not believe the government has acted suspiciously with padilla or gitmo. \n 3. i do not inject nefarious scheme into the governments as some have. the government is made up of elected persons. their views may be different from mine, but as long as they act to preserve the nation within the bounds of the constitution i am fine with it. some ideals are better than others and thus worthy of support from me, others are less and should be criticized or even ridiculed. but to project conspiracy or distrust into the function of government i believe counter productive. the bill of rights is a reminder that we are the government, that the government serves us, without us there can be no government. this firstly and formost. secondarily to delineate powers and facilitate function, the three branches are constructed. it is a division of responsibility as well as check and balance.\n 4. i do believe the government has acted wrongly with the Kelo case. this should be raising alarms all over the country as it affects all of us and we have limited legal recourse right now due to the fact that it was a supreme court decision.", 
   {}, 
   141588, 
   null, 
   1119888420.0
  ], 
  [
   141618, 
   null, 
   "gamehuis", 
   "Bush vows to eliminate torture worldwide:\n \n http://www.abc.net.au/news/newsitems/200506/s1400972.htm\n \n \n US acknowledges torture at Guantanamo and Iraq, Afghanistan:\n \n http://news.yahoo.com/news?tmpl=story&u=/afp/20050624/pl_afp/unustortureguantanamo_050624195043\n \n \n Oh, the irony...", 
   {}, 
   141592, 
   null, 
   1119895620.0
  ], 
  [
   141644, 
   null, 
   "fracas", 
   "the UN says that the US said ...\n \n hearsay thus", 
   {}, 
   141618, 
   null, 
   1119899340.0
  ], 
  [
   141648, 
   null, 
   "Voice Of Reason", 
   "Bush vows to eliminate torture worldwide:\n \n http://www.abc.net.au/news/newsitems/200506/s1400972.htm\n \n \n US acknowledges torture at Guantanamo and Iraq, Afghanistan:\n \n http://news.yahoo.com/news?tmpl=story&u=/afp/20050624/pl_afp/unustortureguantanamo_050624195043\n \n \n Oh, the irony...\n\n \n You want to know what real torture is ask John McCain........", 
   {}, 
   141618, 
   null, 
   1119899460.0
  ], 
  [
   141653, 
   null, 
   "fracas", 
   "UN human rights experts seeking to visit the US base at Guantanamo Bay in Cuba said today they have reliable accounts of torture of suspected terror detainees being held there.\n \n The four experts said the US had not responded to their numerous requests to check on the conditions of terror suspects at the US Naval base.\n \n They said their request for a visit was \"based on information, from reliable sources, of serious allegations of torture, cruel, inhuman and degrading treatment of detainees, arbitrary detention, violations of their right to health and their due process rights.\"\n \n \"Many of these allegations have come to light through declassified (US) government documents,\" they said.\n \n The experts, who report to UN bodies on different human rights issues, said they had yet to hear back from Washington on their latest request - made in mid-April - to visit the detention facility.\n \n A US spokeswoman said the request was still being reviewed in Washington.\n\n link \n \n other than using better words than AI's \"gulag\"\n there isn't much more substance presented\n \n still awaiting \"proof\"", 
   {
    "unicode_changes_made": true
   }, 
   141648, 
   null, 
   1119899940.0
  ], 
  [
   141711, 
   null, 
   "Kronus", 
   "fracas, this is what I hear you saying. Let me know if I'm getting this right or not.\n \n You believe that there are lines that the government shouldn't cross. You also believe that the checks and balances built into the government are sufficient to prevent those lines from being crossed. Thus, there is no cause for the common citizen to be concerned about what the government does, because if something does go wrong in one branch, it will get fixed by the other two.\n \n Am I on target here?", 
   {}, 
   141592, 
   null, 
   1119909360.0
  ], 
  [
   141717, 
   null, 
   "fracas", 
   "fracas, this is what I hear you saying. Let me know if I'm getting this right or not.\n \n You believe that there are lines that the government shouldn't cross. You also believe that the checks and balances built into the government are sufficient to prevent those lines from being crossed. Thus, there is no cause for the common citizen to be concerned about what the government does, because if something does go wrong in one branch, it will get fixed by the other two.\n \n Am I on target here?\n\n \n almost\n 1. yes there are limits to what the government can or should do.\n 2. the system is designed with built in limits as well as check and balance and it functions well and still.\n 3. citizens must actively participate in the process of government.\n 4. the starting premis that government cannot be trusted leads to second guessing, partisan politics, and dysfunction and weakens #2 and #3.", 
   {}, 
   141711, 
   null, 
   1119910020.0
  ], 
  [
   141723, 
   null, 
   "Kronus", 
   "almost\n 1. yes there are limits to what the government can or should do.\n 2. the system is designed with built in limits as well as check and balance and it functions well and still.\n 3. citizens must actively participate in the process of government.\n 4. the starting premis that government cannot be trusted leads to second guessing, partisan politics, and dysfunction and weakens #2 and #3.\n\n \n Does #3 just mean vote, or something more proacitve? For example:\n \n I'm a citizen. I think someone in the government is doing something fishy. They say everything is fine. Would you recommend:\n A) Do nothing, and assume that if there is wrong doing it will be caught by some other branch of the government.\n B) Guess that the politician is lying, raise a stink, hope that more attention will force any wrong doing into the light.\n \n And for the record, I never meant to say that the government can't be trusted. Just that people in the government shouldn't be trusted, at least not implicitly.", 
   {}, 
   141717, 
   null, 
   1119911040.0
  ], 
  [
   141731, 
   null, 
   "fracas", 
   "1. pay attention to what is happening\n 2. confirm the reports\n 3. thinks about the pros and cons of each positions\n 4. make a decision on which is the better option\n 5. make a decision on which is the wrong option\n 6. observe what option will likely be actualized\n 7. take steps to influence the option to be actualized\n \n \n thus far, as pertains to this thread\n a. basic assumption that gitmo = unjust torture without credible proof.\n b. padilla unjustly detained\n c. bush cannot be trusted\n because of the suspicion bordering on hysteria and paranoia\n because of of bias leading to blindness and partisanship\n most people have started at #1 and went straight to #7, skipping #2, #3, #4, #5 and #6", 
   {}, 
   141723, 
   null, 
   1119913740.0
  ], 
  [
   141736, 
   null, 
   "Kronus", 
   "1. pay attention to what is happening\n 2. confirm the reports\n 3. thinks about the pros and cons of each positions\n 4. make a decision on which is the better option\n 5. make a decision on which is the wrong option\n 6. observe what option will likely be actualized\n 7. take steps to influence the option to be actualized\n \n \n thus far, as pertains to this thread\n a. basic assumption that gitmo = unjust torture without credible proof.\n b. padilla unjustly detained\n c. bush cannot be trusted\n because of the suspicion bordering on hysteria and paranoia\n because of of bias leading to blindness and partisanship\n most people have started at #1 and went straight to #7, skipping #2, #3, #4, #5 and #6\n\n \n I appreciate you're wanting to pull things back to the original topic, but I'm still trying to understand your position on trusting people in government. Which of A or B above would you advise? If you want to add an option C, then please feel free.", 
   {}, 
   141731, 
   null, 
   1119914460.0
  ], 
  [
   141751, 
   null, 
   "fracas", 
   "I'm a citizen. I think someone in the government is doing something fishy. They say everything is fine. Would you recommend:\n A) Do nothing, and assume that if there is wrong doing it will be caught by some other branch of the government.\n B) Guess that the politician is lying, raise a stink, hope that more attention will force any wrong doing into the light.\n\n \n C. confirm whether the government is actually doing something wrong before taking actions. (step #2)\n instead, you seem to want to make assumption that something is wrong (skipping step #2 and going straight to step #7)\n \n acquiessence to a wrong make you complicit (A)\n raising a stink without necessary facts is hysteria (B)", 
   {}, 
   141723, 
   null, 
   1119916080.0
  ], 
  [
   141778, 
   null, 
   "Kronus", 
   "\n 1. pay attention to what is happening\n 2. confirm the reports\n 3. thinks about the pros and cons of each positions\n 4. make a decision on which is the better option\n 5. make a decision on which is the wrong option\n 6. observe what option will likely be actualized\n 7. take steps to influence the option to be actualized\n \n C. confirm whether the government is actually doing something wrong before taking actions. (step #2)\n instead, you seem to want to make assumption that something is wrong (skipping step #2 and going straight to step #7)\n \n acquiessence to a wrong make you complicit (A)\n raising a stink without necessary facts is hysteria (B)\n\n \n Added in your previous list to the quote.\n \n There's a problem with your #2. It is, in most cases, impossible. Sure, there are often crank allegations made which a little research can dismiss. That isn't the general case, however. Taking Gitmo as an example, there is no way for us to support any of the allegations that anyone has made. I can't demonstrate mis-treatment, you can't demonstrate lack of mis-treatment. When it comes to the government it's often impossible for the average citizen to confirm anything, unless the government wants something confirmed.\n \n So where does that leave us? We either risk complicitcy or hysteria. In my experience good people doing nothing has allowed more harm than good people trying too hard. People standing up and demanding proof that no wrong doing is happening is seldom more than an inconvienence; and their demands should be easy to meet, if there is in fact no wrong doing. People not saying anything until too late can be blamed, at least in part, for many of the wrongs of modern history. A partial list would include McCarthism, the Japanese interment camps, and Hitler. I'm sure you can add to this list with little effort.\n \n You seem to invision a perfect world where all decision are informed decisions. That would be fantastic, but its not the world we live in. We must all act, or choose not to act, on incomplete data. Given that, it is my instinct to distrust those who could provide relevant data, but don't. Again using Gitmo as an example, Bush could prove that there's no mistreatment, without jepordising security. That fact that he won't makes me suspicious. It's impossible for me to prove any of my suspicions, so all I can do is point fingers and make a fuss. Given a choice between complicitsy in an immoral act and unfounded hysteria, I will always choose to be a nuicance rather than risk a wrong being done. If there is no wrong doing then there is little if any damage caused by demanding proof of this. If something immoral has occurred, if the line you talk about has been crossed, then the sooner it's brought to light the better. And the more people who demand proof, one way or the other, the quicker truth will be served.\n \n Edit:\n Just wanted to add what a pleasure it is to debate with a non-jingoistic conservative. People who can hold a lengthy debate with someone they disagree with on this board without resorting to insults or rhetoric are rare. Thanks for the good discussion.", 
   {}, 
   141751, 
   null, 
   1119921840.0
  ], 
  [
   141783, 
   null, 
   "fracas", 
   "it is foolish to ever expect to know all the facts. but it is reasonable to get enough of the facts to understand the opposing options (#3).\n i don't think that is an unreasonable expectations.\n most who criticize the current policies have not made a sufficient investigations of the facts (#2).\n even fewer have attempted #3.\n \n take gitmo. \n step #2. there are allegations from the detained, and the testimonies of the guards, and now the recently toured congress members. (AI has never been there, thus their report is second hand and when painted with hystrionoics, discredit them; while the guards are no longer employed in the military, thus reduced any influence the govenment may have on them) what do each have to gain by lying? what do each have to tell the truth? which is more credible? \n step #3. what does the government has to gain from torture?\n \n for me, the guards are more credible, especially in the absence of proof of torture.\n leading then to the perplexity of what the government would have to gain. pleasure from torture? info gained to win the war?\n \n it is interesting to note that while your assumption is that the detainees are innocent and must be proven guilty (despite my assertion that in war it should be the assumption of guilt, especially since these are the last few hundreds of a vetted more numerous starting collection)\n you instinctively assume the government is guilty in the absence of proof of innocence.\n interesting.\n how do you rationalize this?", 
   {}, 
   141778, 
   null, 
   1119922800.0
  ], 
  [
   141947, 
   null, 
   "Kronus", 
   "it is foolish to ever expect to know all the facts. but it is reasonable to get enough of the facts to understand the opposing options (#3).\n i don't think that is an unreasonable expectations.\n most who criticize the current policies have not made a sufficient investigations of the facts (#2).\n even fewer have attempted #3.\n \n take gitmo. \n step #2. there are allegations from the detained, and the testimonies of the guards, and now the recently toured congress members. (AI has never been there, thus their report is second hand and when painted with hystrionoics, discredit them; while the guards are no longer employed in the military, thus reduced any influence the govenment may have on them) what do each have to gain by lying? what do each have to tell the truth? which is more credible? \n step #3. what does the government has to gain from torture?\n \n for me, the guards are more credible, especially in the absence of proof of torture.\n leading then to the perplexity of what the government would have to gain. pleasure from torture? info gained to win the war?\n\n \n We have very few facts to go on here, and in the absense of facts people make assumptions based on their own personal bias, you included. Look at your above post. You dismiss, appropriately, AI's remarks, but ignore the Red Cross'. You can't think of a reason for the guards to lie? How about, they were ordered to, they didn't want to get in trouble, they have buddies in the jail that they don't want to get into trouble, they have buddies in Iraq/Afghanistan they want to avenge. And that's without even trying.\n \n My point here is this: in the absense of facts you tend to believe claims which support the administration, I tend to believe that the administration is more likely to hide wrong doing than come clean. Neither of these positions can be backed by logic. We quite simply don't have enough data to be able to come to any logically supported conclusion.\n \n So what do we do? Give up? No. We can look at the consequences of being wrong. If my concerns are proven to be unfounded then what happens? Well, that mean that the administration isn't doing anything unethical, the world would know it, everything's great. What if you're worng, and they are doing thing that are pushing, or even crossing, the line? If that's the case then we've lost our moral authority. Those responsible would need to be removed from their positions and we would have to take measures to be sure that it never happened again. In short, it would be a major problem, and the sooner we realized it the sooner we could fix it.\n \n In summary, if we suspect the government and are proven wrong, everyone wins. If you trust the government and are proven wrong, we lose. Looking at it that way the only logical approach is to harbor a certain level of suspicion.\n \n \n\n it is interesting to note that while your assumption is that the detainees are innocent and must be proven guilty (despite my assertion that in war it should be the assumption of guilt, especially since these are the last few hundreds of a vetted more numerous starting collection)\n you instinctively assume the government is guilty in the absence of proof of innocence.\n interesting.\n how do you rationalize this?\n\n I don't believe I ever said that the detainees are innocent until proven guilty. At best I pointed out that some of them may be innocent, and we'll never know. Likewise, I don't assume the administration is guilty. I'm merely suspicious. The rational for my suspicion is quite simple. Bush is running a secret jail. That's it, that's enough. Any time any government runs a secret jail, people should be concerned.", 
   {}, 
   141783, 
   null, 
   1119978720.0
  ], 
  [
   142006, 
   null, 
   "ScummyD", 
   "You dismiss, appropriately, AI's remarks, but ignore the Red Cross'.\n\n The Red Cross is just as mentally deficient and pathetic as Dick Durbin, the Red Cross should be ignored.\n \n Just as every other intellectually challenged leftist out to slander their adversaries for lack of an ability to confront them intellectually and win a debate, the Red Cross regurgitates the typical Democratic pap berating American officials over gitmo, \"You people are no better than and no different than the Nazi concentration camp guards.\" (Source: WallStreetJournal)", 
   {}, 
   141947, 
   null, 
   1119985860.0
  ], 
  [
   142007, 
   null, 
   "Nurglitch", 
   "Ah, but it makes such a nice change from you intellectually challenged rightists.", 
   {}, 
   142006, 
   null, 
   1119985980.0
  ], 
  [
   142041, 
   null, 
   "ScummyD", 
   "Ah, but it makes such a nice change from you intellectually challenged rightists.\n\n The Right is winning elections. \n \n The Left is floundering in the face of defeat, after defeat, after defeat and simply cannot compete in an honest debate without devolving into cheap talking points, empty platitudes, and slanderous ad hominem attacks.", 
   {}, 
   142007, 
   null, 
   1119990480.0
  ], 
  [
   142063, 
   null, 
   "gamehuis", 
   "the UN says that the US said ...\n \n hearsay thus\n\n A lot of things in this world are hearsay, like for example all media coverage. That doesn't mean that it's not true.", 
   {}, 
   141644, 
   null, 
   1119992700.0
  ], 
  [
   142083, 
   null, 
   "ScummyD", 
   "Straight from the liberal's mouth.\n \"My belief is we are running a facility at Guantanamo that has no unlawful activities.\"--Rep. Ellen Tauscher, Democrat East Bay, Walnut Creek\n (Source: SanFranciscoChronicle)\n \n Note the manner in which the piece begins.\n Tauscher satisfied with conditions at Guantanamo\n But she fears U.S. is sending suspects to other countries\n \n Washington -- East Bay Rep. Ellen Tauscher said Monday that she observed improved conditions for suspected terrorists at the Guantanamo Bay prison in Cuba but fears the improvements have come because the United States is turning over new suspects to be interrogated by countries with records of torture***\n When the wild accusations being thrown around by left wing wack jobs turn out to be false, they \"fear\" that the evil US is now outsourcing torture and \"sending suspects to other countries.\" emoticon_rolleyes\n \n These fools have been proven wrong time after time after time, and have ne shame in continuing to try and propagate their degenerate ideas about the world. They are ceaseless in their attempts to smear America.\n \n before we invaded Afghanistan we were feverishly warned and derated about how the mountains were too high, the winters too cold, the people too ruggedly tenacious and tougher than two dollar steaks, we were endlessly hounded about massive famine by the likes of Soros, and how we could never win in that Afghanistan proved the cemetary for the Russians and British and how the US would be ground up in a similar manner. \n \n Then when the Taliban ceased to be a governing body and was reduced to the likes of cockroaches scurrying about the countryside the same fools who offered the litany of dire predcitions and warnings moved on with no shame to casting the same stupid warnings about Iraq. And when the Iraqi military was routed in three weeks the crowd of bantering dooms day defeatists snarled that it was an ovbious outcome agaisnt a fifth rate military. \n \n And so it is that the flaming lib Rep. Tauscher finds nothing to bolster the ludicrous claims that Americans are no different than Nazis which has been coming from the frothing fringe of the wacko Left as well as the most prominent figures of the Democratic Party, and so rather than reassessing herself Tauscher continues on with her smear America first tack that is so typical of the Left. Sniffing out any way possible to embarrass, smear and besmirch America's image, and aid our enemies who are trying to murder as many Americans as possible.\n \n The Left has but one course of action and that is too smear, besmirch, defame, and destroy the image of their opponents because they cannot compete within the realm of honest intellectual debate and persuade people of the goodness of their ideas. Because their ideas and cultural values are antithetical to the United States of America as we know it. \n \n This is seen in the wholesale employment of the Hitlerian slur tactic that has become common place among Leftists, the talking point du jour, from Dick Durbin to Robert Bird to George Soros to Julian Bond to Al Gore, and is sympathisized and supported by the Democratic leadership as reflected in the deafening silence on the part of Democratic leaders to repudiate the grossly ignorant and demagogic tactics of their Democratic comrades.", 
   {
    "post_info": {
     "post_title": "From the Smear America First Files"
    }
   }, 
   142041, 
   null, 
   1119994500.0
  ], 
  [
   142131, 
   null, 
   "Kronus", 
   "Any chance you could go rant in another thread? farcas and I are trying to have an actual discussion here.", 
   {}, 
   142083, 
   null, 
   1119999720.0
  ], 
  [
   142220, 
   null, 
   "fracas", 
   "We have very few facts to go on here, and in the absense of facts people make assumptions based on their own personal bias, you included. Look at your above post. You dismiss, appropriately, AI's remarks, but ignore the Red Cross'. You can't think of a reason for the guards to lie? How about, they were ordered to, they didn't want to get in trouble, they have buddies in the jail that they don't want to get into trouble, they have buddies in Iraq/Afghanistan they want to avenge. And that's without even trying.\n \n My point here is this: in the absense of facts you tend to believe claims which support the administration, I tend to believe that the administration is more likely to hide wrong doing than come clean. Neither of these positions can be backed by logic. We quite simply don't have enough data to be able to come to any logically supported conclusion.\n \n So what do we do? Give up? No. We can look at the consequences of being wrong. If my concerns are proven to be unfounded then what happens? Well, that mean that the administration isn't doing anything unethical, the world would know it, everything's great. What if you're worng, and they are doing thing that are pushing, or even crossing, the line? If that's the case then we've lost our moral authority. Those responsible would need to be removed from their positions and we would have to take measures to be sure that it never happened again. In short, it would be a major problem, and the sooner we realized it the sooner we could fix it.\n \n In summary, if we suspect the government and are proven wrong, everyone wins. If you trust the government and are proven wrong, we lose. Looking at it that way the only logical approach is to harbor a certain level of suspicion.\n\n 1. i dismiss the AI report because it is a second hand report. i am skeptical of any second hand reports. by using inappropriate descriptives, the AI has only hurt their credibility. the red cross report i cannot find on the red cross site. thus it becomes a second hand report of the red cross report which reports on Gitmo. too far removed. as to the soldiers remark, i am willing to dismiss them in total, which then to remain objective i would dismiss the detainees remarks as well. leaving us at a null point.\n \n 2. correct that we have insufficient data and are unlikely to arrive at definitive conclusion. your assumption is that in the absence of proof of innocence, the government is acting maliciously. my assumption is that in the absence of proof of innocence and the absence of proof of guilt, is an absence of proof of any thing. to me to act at this point, to act out of absence of proof, is tantamound to acting out of ignorance, which means to act based on bias. which i try to minimize. \n \n 3. in the absence of proof, supposition can be made of consequences apart from motives. but wouldn't it be better to obtain more information rather than to pass judgement? let another branch of government investigate. but then didn't the court look at this and didn't perceive immediate wrongs? didn't congress just returned 16 members from an inspection tour? this is my major criticism of those who rail. instead of seeking more information many would prefer to fabricate meaningless comparisons. since the various branches of government do have access to gitmo, this information can be obtained. and has been obtained.\n \n 4. if we continually supposes the government to be doing wrong, it undermine the ability of our government to function when they are doing right, and we as a nation becomes even more divided. we all lose even when the government is right. and in a war we needs resolve and unity to ever hope for victory. \n \n 5. i would much prefer we act out of factual information rather than unsubstantiated fear. and in the absence of factual information i would rather we act out of unsubstantiated reasoning rather than unsubstantiable fears. (as was the case with invading iraq). \n \n 6. if we are detaining them unjustly without torture, they have lost a few years. if we are detaining them justly we are saving innocent lives without taking theirs (the detainees). net unsubstantiated reasoning favors continued detention with continued observation. unsubstantiable fears include illegality (see #8) and torture.\n \n \nI don't believe I ever said that the detainees are innocent until proven guilty. At best I pointed out that some of them may be innocent, and we'll never know. Likewise, I don't assume the administration is guilty. I'm merely suspicious. The rational for my suspicion is quite simple. Bush is running a secret jail. That's it, that's enough. Any time any government runs a secret jail, people should be concerned.\n\n 7. no, your point is that the bush administration is guilty until proven innocent. and in the absence of such proof he continues to be guilty.\n \n 8. Gitmo is not a secret jail by along shot.\n we all know about it, had people come and inspected, its in the press.\n so no, he is not running a secret jail, just one that alot people don't like. so why don't they like it?\n a. detaining people not as PoW but as illegal combatants, thus depriving them of GC protection. but this does not mean it is illegal. this does not mean they are being tortured.\n b. absence of charges. charging PoW is against the GC. and their status as illegal combatants have been vetted by the military, all that is required by the GC.\n c. indeterminate length of detention. but had they been accorded PoW status their detention would be indeterminate as well.\n d. inaccessible. all nationals whose government have requested them have been returned. and see #3 above\n \n 9. thus to me the unease is really because what is done seems to be a loophole of the GC. but this assumes that it is a loophole. the GC specified who should be protected, those who deserve to be protected. As should be as this was one of the stated goals. the GC is less precise about those who are not protected, that is because it was never the thrust of the GC to specify those who should not be protected (which would be perverse).", 
   {}, 
   141947, 
   null, 
   1120006080.0
  ], 
  [
   142224, 
   null, 
   "fracas", 
   "A lot of things in this world are hearsay, like for example all media coverage. That doesn't mean that it's not true.\n\n i hear your sister is a hottie. is this true? ;)\n \n the media reports events.\n those who made the events are the best sources, better than those who report it. (as in if i want to know what Bush says tonight, i will listen to him or read his speech, not what the media report he said)\n the events can be confirm and collaborated with other sources if those responsible for the events are not available.\n \n UN report of the allegations was first release on 6/23. nothing more has been made of it. why?\n one of their claims was documents obtained from the freedom of information act. why have these documents not been released? are they still looking for the right year and model typewriter?", 
   {}, 
   142063, 
   null, 
   1120006260.0
  ], 
  [
   142522, 
   null, 
   "simone", 
   "http://www.truthout.org/docs_2005/062705L.shtml\n \n Senator Durbin Defends America's Values\n By James J. Zogby\n t r u t h o u t | Perspective\n \n Monday 27 June 2005\n \n In recent weeks, controversy has mounted over the treatment meted out to detainees at US facilities in Guantánamo Bay and other locations around the world. In an effort to deal with the criticism and change the subject, the White House and their allies have responded, blasting critics like Amnesty International, charging that their comments damage the image of the US, endanger American troops and harm the war on terrorism. \n \n Watching the right wing's attack machine go into motion is really quite a spectacle. It targets its victim, strikes, and then launches into a multimedia, multi-day assault. Every medium is used: the White House comments, Senators and Congressmen issue releases. And then Fox News, radio talk shows, the Washington Times, web logs and web sites - all carry the \"story\" and add to it. The initial attack is then echoed and magnified. The goal is to bury the target and silence critics with overwhelming force. Senator Richard Durbin (D-IL) is their most recent target. Last week on the Senate floor, Durbin, who in the past has successfully led the effort to pass anti-torture legislation, read aloud a statement by an FBI agent describing the torture of prisoners at Guantánamo Bay. He said that the techniques described by the agent called to mind those used by repressive regimes, including the Nazis and Soviets. \n \n The response was quick and harsh, utilizing all the media noted above. Prominent among the attackers were former House Speaker Newt Gingrich and Senate Majority Leader Bill Frist. Gingrich said that Durbin's comments appeared on Al-Jazeera, and that, \"You cannot have a public official quoted throughout the world by our enemies describing the US in these terms - it puts every young American in uniform at risk.\"\n \n Frist went further, mischaracterizing Durbin's remarks, alleging that his statement was \"anti-American and only fuels the animus of our enemies ... It is this type of language that they use to recruit others to be car bombers, suicide attackers, hostage takers, and full-fledged jihadists.\" The assault went on for a week, frightening many from coming to Durbin's defense. \n \n Abandoned by his allies, Durbin went to the Senate floor and apologized for the inept historical references. But on the critical issues of torture and detention, he firmly stood his ground.\n \n The rhetorical excesses of Gingrich and Frist are dead wrong. What damages the US image and endangers us are not comments by Durbin and other critics of Guantánamo Bay. It is the Bush administration's detention and interrogation policies. Defense Secretary Rumsfeld explicitly authorized the use of abusive interrogation techniques at Guantánamo Bay. FBI agents and the Red Cross both concluded that the use of these techniques at Guantánamo constituted \"torture.\" In the past, the United States has always condemned the use of such techniques. Now, we apparently approve of them.\n \n According to polls we have conducted, Arab attitudes toward the United States have dropped to dangerously low levels. The treatment of Arab and Muslim prisoners is a big reason, rivaling regional disapproval of US policy toward the Israeli-Palestinian conflict and the war in Iraq.\n \n Buttressing these poll results are my experiences in the Arab world, where I travel frequently. In conversations with opinion leaders and average citizens across the region, they frequently note their deep disappointment with current state of our human rights policy. Many Arab reformers tell me that our behavior now mimics that of their own governments. \n \n President Bush has linked the spread of democracy to the war on terrorism. Unfortunately, the indefinite secret detention and highly coercive interrogation of Arab and Muslim detainees in Guantánamo Bay and other locations has harmed our ability to advocate credibly for democratic reforms. Indeed, some governments now point to American practices to justify their own human rights abuses. \n \n President Bush has suggested that anti-democratic practices and human rights abuses promote instability and create the conditions that can breed terrorism. Democratic reformers and human rights activists used to look to the US as an exemplar, as the city on a hill. Now they are dismissed by their countrymen when they point to the American experience.\n \n Once we set a high standard for the world; now we have lowered the bar. The damage to our image, to the values we have sought to project, and to our ability to deal more effectively with root causes of terror have been profound. Efforts to silence debate and the attacks against courageous opponents of torture like Dick Durbin are wrong and send the wrong message to our world. Comments by Durbin and other critics of torture help, not hurt, the US image in the Middle East. People there are already outraged about Guantánamo and Abu Ghraib. The fact that Durbin and others have demonstrated the courage to speak out and challenge these shameful and abusive practices demonstrates to the Arab world that not all Americans support what the world knows we have done. As their criticism makes clear, there are still Americans who hold high the values we call on others to emulate. At a time when we're trying to spread democracy, Durbin and other critics show people in the Arab world how a democracy works. The good new is that not only has Durbin not been silenced, but the controversy about Guantánamo and Abu Ghraib and the treatment of detainees, in general, is growing and will not be stopped until changes are made.", 
   {}, 
   142224, 
   null, 
   1120067100.0
  ], 
  [
   142526, 
   null, 
   "gamehuis", 
   "i hear your sister is a hottie. is this true? ;)\n \n the media reports events.\n those who made the events are the best sources, better than those who report it. (as in if i want to know what Bush says tonight, i will listen to him or read his speech, not what the media report he said)\n the events can be confirm and collaborated with other sources if those responsible for the events are not available.\n \n UN report of the allegations was first release on 6/23. nothing more has been made of it. why?\n one of their claims was documents obtained from the freedom of information act. why have these documents not been released? are they still looking for the right year and model typewriter?\n\n Meh, the Downing Street Memo's were released two months ago and none of the major networks have picked it up yet eventhough the British government hasn't denied the authenticity.\n I guess a lost teenager on Aruba or a shark attack are more important to the networks than verified torture at GITMO or lies about the war.", 
   {}, 
   142224, 
   null, 
   1120068180.0
  ], 
  [
   142540, 
   null, 
   "ScummyD", 
   "Any chance you could go rant in another thread? farcas and I are trying to have an actual discussion here.\n\n emoticon_cry No. What about you??? \"Trying?\"", 
   {}, 
   142131, 
   null, 
   1120069980.0
  ], 
  [
   142594, 
   null, 
   "Nurglitch", 
   "gamehuis: I think the media has been burned by so many attempts to make the Bush Administration look bad that they're hesitant to report anything that might explode in their faces. Think of it like the boy who cried wolf.\n \nThe Right is winning elections.\n \n The Left is floundering in the face of defeat, after defeat, after defeat and simply cannot compete in an honest debate without devolving into cheap talking points, empty platitudes, and slanderous ad hominem attacks.\n I agree that the political opposition to the Republican party (not necessarily \"The Right\") is fragmented, but for some reason I thought it had something to do with self-proclaimed rightists trying to score cheap points, make empty platitudes, and slanderous ad hominem attacks. \n \n In the meantime Gamehuis and Fracas are showing XXXXXX on all sides how it's done. Go Portent!", 
   {}, 
   142526, 
   null, 
   1120076700.0
  ], 
  [
   142602, 
   null, 
   "gamehuis", 
   "In the meantime Gamehuis and Fracas are showing XXXXXX on all sides how it's done. Go Portent!\n\n I aim to please.\n \n \n PIE!*\n \n \n \n \n \n *Portent Intelligent Expression", 
   {}, 
   142594, 
   null, 
   1120078080.0
  ], 
  [
   142674, 
   null, 
   "Kronus", 
   "fracas.\n \n You keep saying you would like more information. That's precisely my point. That's why everyone is complaining, because Bush isn't allowing anyone access to information. The Red Cross knows what's going on, but is forbidden to report to anyone but the administration. Congress went on a tour, but a scheduled tour isn't going to uncover anything. All anyone wants is for the administration to allow access to the info needed to make intelligent decisions, and the administration has been fighting that tooth and claw. That's why people keep ramping up the rhetoric and accusations. \n \n A couple of times now you've claimed that people doubting the government would be a bad thing, that it would be disruptive. Can you illustrate that? Can you show me a single historical instance where the people questioning their governement and demanding more openness has been a bad thing? This seems to be your main argument against my position; that when in doubt you should be suspicious. Can you show any instance when people holding my position has led to trouble? Because if you can't than I don't see how you can make that claim.", 
   {}, 
   142602, 
   null, 
   1120086720.0
  ], 
  [
   142979, 
   null, 
   "fracas", 
   "You keep saying you would like more information. That's precisely my point. That's why everyone is complaining, because Bush isn't allowing anyone access to information. The Red Cross knows what's going on, but is forbidden to report to anyone but the administration. Congress went on a tour, but a scheduled tour isn't going to uncover anything. All anyone wants is for the administration to allow access to the info needed to make intelligent decisions, and the administration has been fighting that tooth and claw. That's why people keep ramping up the rhetoric and accusations. \n\n \n more information would be good. but key people do have access to gitmo. the red cross does. congress does.\n we are waging a war. and during a war information matters. why don't we demand access to pentagon war room to make sure that their plans are legit? that minimal civilian casualties will occur? etc\n what i don't care for are the shrill and inappropriate comparison that have no basis in facts. this is counter productive imo.\n \n \nA couple of times now you've claimed that people doubting the government would be a bad thing, that it would be disruptive. Can you illustrate that? Can you show me a single historical instance where the people questioning their governement and demanding more openness has been a bad thing? This seems to be your main argument against my position; that when in doubt you should be suspicious. Can you show any instance when people holding my position has led to trouble? Because if you can't than I don't see how you can make that claim.\n\n \n actually i believing doubting the government is a good thing. but when doubt traverse mistrust and enters into distrust and paranoia, that is a bad thing. it applies to individual regard to another individual as much has toward the government. other than generating amusing conspiracy theories, paranoia is pathologic.\n \n but has those that have cross such path caused trouble? \n there was vocal opposition to all the wars we have fought, from the war of revolution, civil war, ww1, ww2, korean, vietnam, gulf 1, gulf 2. historically the majority of the population has held course and steady and allowed continued action by the government. the one time when the minority has altered the will of the majority during a war was vietnam. while that is another thread in itself, suffice to say that our military were winning the ground war, the north vietnamese admitted to losing the ground war, and instead focussed on undermining political will in the US. result, 50,000 US dead for no gains, 225,000 South Vietnamese soldiers, 500,000 refugees dead at sea, another million or so never made it to sea. A war that historical evidence suggested we snatched defeat from the jaws of victory. Had we stayed the course, South Vietnam probably would be similar to South Korea now. Beyond the dead servicemen, the consequences reverberated across our culture and society. Not to mention the global consequences of the US retreat that embolden islamofascist perception that the US would fold like a paper tiger. Weakness emboldens our enemies. And it is this that the islamofascist are counting on to win, as they lack the ability to defeat the US militarily.\n \n But again, i believe we should have an opposing voice. I'd much rather have one that are based on facts, not hysteria, and one predicated on construction, offering a better alternative, not destruction, how everything is wrong.\n i've yet to hear alternative on how to handle terrorist detentions other than to violate the GC, by trying them.\n \n \nScanning the commentary after President Bush's Fort Bragg speech on Iraq, our eyes were caught by a headline in The New York Times: \"Wanted: A Policy.\" True, the advice was dated 1861, not 2005, and the President at whom it was directed wasn't George W. Bush, but Abraham Lincoln. But you get the idea; plus ca change..\n\n this pertains to politicians more so than the general population.\n neither the media nor the current opposition are acting out or morality concern, rather than for political gains.", 
   {}, 
   142674, 
   null, 
   1120140000.0
  ], 
  [
   143090, 
   null, 
   "Kronus", 
   "more information would be good. but key people do have access to gitmo. the red cross does. congress does.\n \n what i don't care for are the shrill and inappropriate comparison that have no basis in facts. this is counter productive imo.\n \n\n The Red Cross has access, but they're forbidden to report to anyone outside the administration. And yes, Congress was given a tour. If, if , anything bad was happening there, don't you think they might stop doing it while congress was around? No one outside the administration has any real knowledge of what's happening in there. That's why people are getting shrill. It's not paranoia, it's frustration. \n \n \n\n actually i believing doubting the government is a good thing. but when doubt traverse mistrust and enters into distrust and paranoia, that is a bad thing. it applies to individual regard to another individual as much has toward the government. other than generating amusing conspiracy theories, paranoia is pathologic.\n \n\n You claim that doubting the government is a good thing, but I'm afraid I have to doubt your sincerity. You keep saying how much you'ld like the facts in this case, but every time I point out that the administration is withholding the very facts you want, you shrug it off. You say you trust the guards, or Congress will look into it, or that those who are asking quesitons are paranoid. You seem exteremly resistant to doubting anything the administration says. Even given the leaked Red cross report, the precedent of Abu Ghraib, and Bush's stonewalling you still see no cause to show the least bit of doubt. I've asked this before, and I don't think you've given a clear answer. What would it take? What would you have to see before you would say \"Hey, wait a minute, maybe something is going on there\"?\n \n \n \n \n\n but has those that have cross such path caused trouble? \n there was vocal opposition to all the wars we have fought, from the war of revolution, civil war, ww1, ww2, korean, vietnam, gulf 1, gulf 2. historically the majority of the population has held course and steady and allowed continued action by the government. the one time when the minority has altered the will of the majority during a war was vietnam. while that is another thread in itself, ... \n\n Heh. And I was going to cite Vietnam as a case where the people speaking up prevented a greater misfortune. I don't suppose you have anything a little less contentious? \n \n \n \n\n But again, i believe we should have an opposing voice. I'd much rather have one that are based on facts, not hysteria, and one predicated on construction, offering a better alternative, not destruction, how everything is wrong.\n \n\n As I said before, the accustations are not based on hysteria, but frustration. Everyone wants to act based on facts, and Bush is preventing that. If someone is hiding something, it's only natural to assume that it's for some reason, and self-interest is a prime candidate. National security doesn't cut it as an excuse. It would be easy to confirm that nothing bad was happening in Gitmo without jepordising security. There must be some other reason for hiding the info that everyone is asking for. And until the administration either comes clean or gives a legitimate reason the accusations and rhetoric are just going to escalate. It's not optimal, but the only other choice is to do nothing. And doing nothing in the face of potential wrong doing is not an option.", 
   {}, 
   142979, 
   null, 
   1120160160.0
  ], 
  [
   143259, 
   null, 
   "fracas", 
   "The Red Cross has access, but they're forbidden to report to anyone outside the administration. And yes, Congress was given a tour. If, if , anything bad was happening there, don't you think they might stop doing it while congress was around? No one outside the administration has any real knowledge of what's happening in there. That's why people are getting shrill. It's not paranoia, it's frustration. \n\n \n what is more important, that the right thing is done, or that the wrong are corrected, or publicity? the red cross has access. reports says its criticism has affected changes.\n yes it can be frustrating not to know. but in waging a war, there are limits to what shouild be public and what should not.\n \n \n \nYou claim that doubting the government is a good thing, but I'm afraid I have to doubt your sincerity. You keep saying how much you'ld like the facts in this case, but every time I point out that the administration is withholding the very facts you want, you shrug it off. You say you trust the guards, or Congress will look into it, or that those who are asking quesitons are paranoid. You seem exteremly resistant to doubting anything the administration says. Even given the leaked Red cross report, the precedent of Abu Ghraib, and Bush's stonewalling you still see no cause to show the least bit of doubt. I've asked this before, and I don't think you've given a clear answer. What would it take? What would you have to see before you would say \"Hey, wait a minute, maybe something is going on there\"?\n\n \n your starting premis is that something is wrong. which is a question i've asked you and yet received no response. how do you rationalize the assumption of guilt? this is manifested by the frustration of proof of guilt, which you fervently believe is waiting to be released. have you considered that this is really all there is to it? no tortures, no injustice, just detention? so that you will finally answer my question, i'll even answer yours first.\n \n what would it take for me to say \"Hey, wait a minute, maybe something is going on there!\"? For someone who is part of the process to step out and claim wrongs were commited. like abu graeb ... \n \n ... abu graeb. the military admitted wrong doings months before the press got a hold of it. by the time it made the headline, the military had already apppointed an independent commission to investigate, after a few months, charges were filed and the criticism levied. all before the headlines.\n \n \n \nHeh. And I was going to cite Vietnam as a case where the people speaking up prevented a greater misfortune. I don't suppose you have anything a little less contentious? \n\n \n nyah, i thought i get the most contentious thing out there and not piddle with the minor stuffs. ;)\n \n \nAs I said before, the accustations are not based on hysteria, but frustration. Everyone wants to act based on facts, and Bush is preventing that. If someone is hiding something, it's only natural to assume that it's for some reason, and self-interest is a prime candidate. National security doesn't cut it as an excuse. It would be easy to confirm that nothing bad was happening in Gitmo without jepordising security. There must be some other reason for hiding the info that everyone is asking for. And until the administration either comes clean or gives a legitimate reason the accusations and rhetoric are just going to escalate. It's not optimal, but the only other choice is to do nothing. And doing nothing in the face of potential wrong doing is not an option.\n\n \n let me restate myself.\n i do not believe it necessary to have all the facts. i do believe it reasonable to make an assesment with what is available and revise it later as more facts are discovered.\n has the administration been obstructionist? what are the evidence for this?\n \n you do realize that it is substantially easier to prove that something wrong has occured, rather than to prove that nothing wrong has occured, right? even so, there has been no evidence that something wrong has occurred. what would satisfy you that nothing wrong has occurred?\n \n would you know it if the administration come clean? why are you so sure that they haven't already.\n which gets us back to the question is why is your premis that the administration is guilty until proven otherwise?\n \n \n if i seem nonplus about the whole thing, it is partly because i don't think there have been cause for alarm. i expect a minimal of evidence which thus far have been wanting. and the more XXXX the AI, the MSM, and the UN spew about it, the less credible the allegations become. like a nagging wife, i tend to tune such things out! ;) and partly because i think we are being too soft in waging this war. but since i have no evidence that being tougher would lead to greater success, i keep it to myself (for lack of evidence).\n i know what my biases are and i keep mine in check, thus relying on facts to sway me rather than my own bias. but in case you are wondering, my mind has been changed before. i was initially against the war till i voted for it ;) no, seriously, i questioned why we should and found my answer surprisingly for it.", 
   {}, 
   143090, 
   null, 
   1120176120.0
  ], 
  [
   143314, 
   null, 
   "fracas", 
   "one more thing\n \n i find this amusing.\n \nA Muslim cleric formerly held at Guantanamo Bay prison said Tuesday that U.S. guards there regularly desecrated the Quran by putting it into a toilet, although he added he never witnessed it himself.\n \n Airat Vakhitov, who described himself as a former imam of a mosque in Tatarstan, a majority Muslim republic in southern Russia, is one of seven men released from Guantanamo in 2004 and returned to Russia. He and the six others were held in Russia for three months, then released a year ago.\n \n Vakhitov said at a news conference organized by the state RIA-Novosti news agency that guards in Cuba threw the Quran in the toilet. However, he later told The Associated Press he did not witness the actions.\n\n the Guardian \n as compared to before\n \nRFE/RL's North Caucasus Service recently spoke with the family members of two of the detainees. One is Amina Hasanova, the mother of Airat Vakhitov. Vakhitov was born in Tatarstan, and as an adult became the imam at a mosque in the republic. Hasanova said her son went to Chechnya in 1999 to study Islam, but was quickly detained by Chechen fighters, who suspected him of being a Russian spy. He was released after several months and returned to Tatarstan.\n \n At that point, Hasanova said, he began to experience harassment by the Russian security services, and fled to Afghanistan. Hasanova said she learned of his fate after receiving a letter from him last November. She said her son is feeling well and is satisfied with the conditions of his detention at Guantanamo.\n \n \"He writes that he is treated kindly and with respect, that he has good food, cleanliness, and as he says in his letter, he feels better than if he was at the best Russian sanatoriums,\" Hasanova said.\n \n Vakhitov's mother said he also writes that his fellow detainees are friendly toward him, and that they often lend each other copies of the Koran and pray together. Hasanova is aware of the Russian efforts to extradite the detainees for trial at home, and said the thought fills her with dread.\n \n \"I am terribly afraid that he may be returned to Russia and put into a Russian prison. It would be very terrible. It is terrible for me and for all Muslims. It is terrible,\" she said. \"I am afraid of everything in the Russian jails. It is better for me that he remains there than to be jailed in Russia.\"\n \n Nina Adizheva is the mother of Rasul Kudaev of Kabardino-Balkaria. She said her son left Russia for Afghanistan after being persecuted for his Muslim activities at home. But she said Rasul could not have fought in Afghanistan because of his weak health. Now, Rasul is in Guantanamo Bay and his mother said she fears he will be prosecuted, tortured, and killed if he is extradited to Russia.\n \n \"I appeal to the government of the United States: Do not extradite my son to Russia, because he went to Afghanistan before 11 September and he is not a terrorist, but a victim of political repression [at home]. I also appeal to the countries of the European Union and ask them to grant my son political asylum, because if he returns home his life will be in great danger,\" she said.\n\n Global Security 2003 \n ahhh, credibility!\n \n what will suffice as evidence that torture is not happening at Gitmo?\n \n \n was it wrong to honor the extradition and send them back i wonder.", 
   {}, 
   143259, 
   null, 
   1120181880.0
  ], 
  [
   143344, 
   null, 
   "daewoo", 
   "what will suffice as evidence that torture is not happening at Gitmo?\n\n \n If FBI agents would quit reportign that torture is happening there, that would go a long ways.\n \n AFIK, the FBI agents who reported it are reliable and nobody has questioned their story. \n \n You, as usual, will ocntinue to believe what you wish to believe and no amount of evidence will change your mind.", 
   {}, 
   143314, 
   null, 
   1120188240.0
  ], 
  [
   143377, 
   null, 
   "fracas", 
   "If FBI agents would quit reportign that torture is happening there, that would go a long ways.\n \n AFIK, the FBI agents who reported it are reliable and nobody has questioned their story. \n \n You, as usual, will ocntinue to believe what you wish to believe and no amount of evidence will change your mind.\n\n \n your word is about as good as georged.\n provide a link?\n \n ...\n \n \n what was i even thinking asking you for a link!?! emoticon_rolleyes\n don't worry, i'll do it for you. link \n so lets look at what i guess is your FBI \"report\"\n \nDetainees at the U.S. military prison at Guantanamo Bay, Cuba, were shackled to the floor in fetal positions for more than 24 hours at a time, left without food and water, and allowed to defecate on themselves, an FBI agent who said he witnessed such abuse reported in a memo to supervisors, according to documents released yesterday.\n \n In memos over a two-year period that ended in August, FBI agents and officials also said that they witnessed the use of growling dogs at Guantanamo Bay to intimidate detainees -- contrary to previous statements by senior Defense Department officials -- and that one detainee was wrapped in an Israeli flag and bombarded with loud music in an apparent attempt to soften his resistance to interrogation.\n \n In addition, several agents contended that military interrogators impersonated FBI agents, suggesting that the ruse was aimed in part at avoiding blame for any subsequent public allegations of abuse, according to memos between FBI officials.\n \n The accounts, gleaned from heavily redacted e-mails and memorandums, were obtained by the American Civil Liberties Union as part of an ongoing lawsuit. They suggest that extremely aggressive interrogation techniques were more widespread at Guantanamo Bay than was acknowledged by military officials.\n\n \n 1. for your benefit daewoo:\n redact = to select or adapt for publication : EDIT.\n interesting. so it is not the FBI's own testimony, but the ACLU version of the FBI report. and this is evidence? \n \n 2. are they torture?\n a. chained and soiled: humilating yes, torture?\n b. growling dogs ... oooh, scarry\n c. israeli flag wraps ... oh the shame\n d. loud music = torture ... well i guess so!\n \n 3. daewoo, i know you are trying to contribute, and i really appreciate that, so do keep trying. if you traverse back in the thread, there are definitions of what torture is, and what it is not. from post #47.\n \nThe five sensory deprivation techniques\n \n In 1978 in the European Court of Human Rights trial \"Ireland v. the United Kingdom\" the facts were not in dispute and the court published the following in their judgement:\n These methods, sometimes termed \"disorientation\" or \"sensory deprivation\" techniques, were not used in any cases other than the fourteen so indicated above. It emerges from the Commission's establishment of the facts that the techniques consisted of:\n (a) wall-standing: forcing the detainees to remain for periods of some hours in a \"stress position\", described by those who underwent it as being \"spreadeagled against the wall, with their fingers put high above the head against the wall, the legs spread apart and the feet back, causing them to stand on their toes with the weight of the body mainly on the fingers\";\n (b) hooding: putting a black or navy coloured bag over the detainees' heads and, at least initially, keeping it there all the time except during interrogation;\n (c) subjection to noise: pending their interrogations, holding the detainees in a room where there was a continuous loud and hissing noise;\n (d) deprivation of sleep: pending their interrogations, depriving the detainees of sleep;\n (e) deprivation of food and drink: subjecting the detainees to a reduced diet during their stay at the centre and pending interrogations.\n It referred to the above as \"the five techniques\" and ruled:\n 167. ... Although the five techniques, as applied in combination, undoubtedly amounted to inhuman and degrading treatment, although their object was the extraction of confessions, the naming of others and/or information and although they were used systematically, they did not occasion suffering of the particular intensity and cruelty implied by the word torture as so understood. ...\n\n \n 4. and finally, my thoughts on the ACLU credibility\n \nFounder , The American Civil Liberties Union\n I am for socialism, disarmament, and, ultimately, for abolishing the state itself... I seek the social ownership of property, the abolition of the propertied class, and the sole control of those who produce wealth. Communism is the goal\n\n it amuses me that you think it worthy of a post to say the ACLU's  heavily redacted reports of FBI reports constitute credible evidence.\n \n 5. or did you have another link in mind?", 
   {
    "unicode_changes_made": true
   }, 
   143344, 
   null, 
   1120190280.0
  ], 
  [
   143395, 
   null, 
   "daewoo", 
   "your word is about as good as georged.\n provide a link?\n\n \n http://www.cbsnews.com/stories/2005/04/28/60minutes/main691602.shtml\n http://www.globalpolicy.org/empire/terrorwar/liberties/2004/1221impersonators.htm\n http://www.cnn.com/2004/US/12/08/guantanamo.abuse/\n http://www.washingtonpost.com/wp-dyn/articles/A25962-2004Dec25.html\n http://www.washingtonpost.com/wp-dyn/articles/A14936-2004Dec20.html\n \n \n ...\n \n \n \n \n \n1. for your benefit daewoo:\n redact = to select or adapt for publication : EDIT.\n interesting. so it is not the FBI's own testimony, but the ACLU version of the FBI report. and this is evidence? \n\n \n You retard, it ws the FBI that edited the reports.\n \n http://www.ccmep.org/2005_articles/civil%20liberties/011005_fisher.htm\n http://newstandardnews.net/content/index.cfm/items/1350\n http://www.counterbias.com/305.html\n http://www.spitting-image.net/archives/002985.html\n http://www.smh.com.au/news/Global-Terrorism/FBI-agents-witnessed-music-and-flag-torture/2004/12/21/1103391753219.html?oneclick=true\n \n The records were obtained under a freedom of information lawsuit and FBI censors edited them (bklacked out portions). Try to keep up.\n \n \n \n2. are they torture?\n a. chained and soiled: humilating yes, torture?\n b. growling dogs ... oooh, scarry\n c. israeli flag wraps ... oh the shame\n d. loud music = torture ... well i guess so!\n\n \n These are all directly out of a 1983 CIA manual regarding torture techniques. They were modified from techniques developed in the soviet union under stalin. Psycholofgical torture is generally considered worse than physical torture becuase you cannot shut it off and your brain has no defensive mechanism against it (eventually in physical torture pain receptros simply fail to fire). The dogs (DIRECTLY from soviet practices) are a component of a methodology that breaks down a persons sense fo self and security. The loud music is used as part of sleep deprivation (same as the short shackeling on the floor). It is highly likely that they also use either strobe li9ghts or the lights in the cells are pulsed at specific frequencies that cause migrains (which also helps with the sleep deprivation). Most people do not realise it, but you will actually die from lack of sleep before you will starve to death.\n \n Wikpedia has a pretty good entry for psychological torture:\n \n http://en.wikipedia.org/wiki/Psychology_of_torture\n \n There is also a decent article abotu treating survivors at:\n \n http://www.survivorsintl.org/info/primarycare.html\n \n I used to teach people how to do this. You can trivilaise it all you want, but you are simply wrong. Personally I think it is hilarious that you are using the same (exact) arguments that Stalin used when he was accused of torturing people to obtain confessions. \n \n Is terrorising people with dogs torture? Probably not. Combine it with sleep deprivation, constant sensory stimulation, and add in some attacks on deeply held personal beliefs as well, and it is DEFINATLY torture, and it would be FAR kinder to rip out fingernails or shock them, or even cut them (cutting can keep them in agony a LONG time since pain receptors continue to fire due to incisions far longer than they would for electrical shocks, fingernail ripping, etc...)\n \n \n3. daewoo, i know you are trying to contribute, and i really appreciate that, so do keep trying. if you traverse back to the beginning of the thread, there are definitions of what torture is, and what it is not.\n\n \n Unbles syou can actually cite a creible source that would disagree that psychological torture is somehow more humane than physical torture, I will thank you to crawl ack in your hole.\n \n \"I have tortured nobody! Not one of these confessed traitors has a mark on them!\" - Josef Stalin\n \n \n4. and finally, my thoughts on the ACLU credibility\n \n it amuses me that you think it worthy of a post to say the ACLU's  heavily redacted reports of FBI reports constitute credible evidence.\n\n \n Again, idiot, it was the FBI that edited the report, not the ACLU. Google it. There are scans of the documents floating around online.\n \n \n BTW---IUf there is any doubt in your mind abotu whether psychological torture is legal or not, take a look at the Convention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment. It is available online at http://193.194.138.190/html/menu3/b/h_cat39.htm", 
   {}, 
   143377, 
   null, 
   1120192380.0
  ], 
  [
   143400, 
   null, 
   "daewoo", 
   "Here is a link to the actual documents:\n \n http://www.aclu.org/torturefoia/released/fbi.html\n \n Wow, strobe lights, sleep deprivation, the works. Even an account of the FBI being asked to run interference with the DOJ if an investgation came about. Are you feeling pretty stupid and gullible about now, bud? Thats ok, its not the first time.", 
   {}, 
   143395, 
   null, 
   1120193700.0
  ], 
  [
   143530, 
   null, 
   "fracas", 
   "http://www.cbsnews.com/stories/2005/04/28/60minutes/main691602.shtml\n http://www.globalpolicy.org/empire/terrorwar/liberties/2004/1221impersonators.htm\n http://www.cnn.com/2004/US/12/08/guantanamo.abuse/\n http://www.washingtonpost.com/wp-dyn/articles/A25962-2004Dec25.html\n http://www.washingtonpost.com/wp-dyn/articles/A14936-2004Dec20.html\n\n this amuses me daewoo, and i will tell you why.\n the CBS news is about sexual techniques of interogation.\n the globalpolicy, the cnn and the 2 WaPo articles are all reworking of the same story about the redacted reports. more at the bottom.\n \n do you read the links you post?\n or do you just swallow?\n \n \nYou retard, it ws the FBI that edited the reports.\n \n http://www.ccmep.org/2005_articles/civil%20liberties/011005_fisher.htm\n http://newstandardnews.net/content/index.cfm/items/1350\n http://www.counterbias.com/305.html\n http://www.spitting-image.net/archives/002985.html\n http://www.smh.com.au/news/Global-Terrorism/FBI-agents-witnessed-music-and-flag-torture/2004/12/21/1103391753219.html?oneclick=true\n \n The records were obtained under a freedom of information lawsuit and FBI censors edited them (bklacked out portions). Try to keep up.\n\n again these are all predicated on the redacted reports. more on that at bottom.\n \n daewoo, you do realize that reworking of the same stories do not make them independent data points right? so by posting 9 links over the same redacted documents are you trying to resort to an avalance defense style or are you incapable of appreciating that these are all the same with different flavors added?\n \n \nThese are all directly out of a 1983 CIA manual regarding torture techniques. They were modified from techniques developed in the soviet union under stalin. Psycholofgical torture is generally considered worse than physical torture becuase you cannot shut it off and your brain has no defensive mechanism against it (eventually in physical torture pain receptros simply fail to fire). The dogs (DIRECTLY from soviet practices) are a component of a methodology that breaks down a persons sense fo self and security. The loud music is used as part of sleep deprivation (same as the short shackeling on the floor). It is highly likely that they also use either strobe li9ghts or the lights in the cells are pulsed at specific frequencies that cause migrains (which also helps with the sleep deprivation). Most people do not realise it, but you will actually die from lack of sleep before you will starve to death.\n \n Wikpedia has a pretty good entry for psychological torture:\n \n http://en.wikipedia.org/wiki/Psychology_of_torture\n\n and apparently you also did not read the part where sensory depravation have not been considered as torture, as i posted in post #47, immediately above, and i will do again.\n \nThe five sensory deprivation techniques\n \n In 1978 in the European Court of Human Rights trial \"Ireland v. the United Kingdom\" the facts were not in dispute and the court published the following in their judgement:\n These methods, sometimes termed \"disorientation\" or \"sensory deprivation\" techniques, were not used in any cases other than the fourteen so indicated above. It emerges from the Commission's establishment of the facts that the techniques consisted of:\n (a) wall-standing: forcing the detainees to remain for periods of some hours in a \"stress position\", described by those who underwent it as being \"spreadeagled against the wall, with their fingers put high above the head against the wall, the legs spread apart and the feet back, causing them to stand on their toes with the weight of the body mainly on the fingers\";\n (b) hooding: putting a black or navy coloured bag over the detainees' heads and, at least initially, keeping it there all the time except during interrogation;\n (c) subjection to noise: pending their interrogations, holding the detainees in a room where there was a continuous loud and hissing noise;\n (d) deprivation of sleep: pending their interrogations, depriving the detainees of sleep;\n (e) deprivation of food and drink: subjecting the detainees to a reduced diet during their stay at the centre and pending interrogations.\n It referred to the above as \"the five techniques\" and ruled:\n 167. ... Although the five techniques, as applied in combination, undoubtedly amounted to inhuman and degrading treatment, although their object was the extraction of confessions, the naming of others and/or information and although they were used systematically, they did not occasion suffering of the particular intensity and cruelty implied by the word torture as so understood. ...\n\n \n are you so intent on making a point that you fail to read what has been posted. read what you are posting, or are you trying the quantity over quality slant?\n \n \nThere is also a decent article abotu treating survivors at:\n \n http://www.survivorsintl.org/info/primarycare.html\n \n I used to teach people how to do this. You can trivilaise it all you want, but you are simply wrong. Personally I think it is hilarious that you are using the same (exact) arguments that Stalin used when he was accused of torturing people to obtain confessions. \n\n LOL\n what argument have i made regarding torture other than that the reports thus far are not credible?\n please link?\n and the ones regarding sensory depravation was not my opinion but that of the European Court of Human Rights.\n \n \nIs terrorising people with dogs torture? Probably not. Combine it with sleep deprivation, constant sensory stimulation, and add in some attacks on deeply held personal beliefs as well, and it is DEFINATLY torture, and it would be FAR kinder to rip out fingernails or shock them, or even cut them (cutting can keep them in agony a LONG time since pain receptors continue to fire due to incisions far longer than they would for electrical shocks, fingernail ripping, etc...)\n \n \n \n Unbles syou can actually cite a creible source that would disagree that psychological torture is somehow more humane than physical torture, I will thank you to crawl ack in your hole.\n \n \"I have tortured nobody! Not one of these confessed traitors has a mark on them!\" - Josef Stalin\n\n wow! now i wonder if you know how to read English. i guess i will have to post that part where sensory depravation has not been interpreted as torture. again.\n \nThe five sensory deprivation techniques\n \n In 1978 in the European Court of Human Rights trial \"Ireland v. the United Kingdom\" the facts were not in dispute and the court published the following in their judgement:\n These methods, sometimes termed \"disorientation\" or \"sensory deprivation\" techniques, were not used in any cases other than the fourteen so indicated above. It emerges from the Commission's establishment of the facts that the techniques consisted of:\n (a) wall-standing: forcing the detainees to remain for periods of some hours in a \"stress position\", described by those who underwent it as being \"spreadeagled against the wall, with their fingers put high above the head against the wall, the legs spread apart and the feet back, causing them to stand on their toes with the weight of the body mainly on the fingers\";\n (b) hooding: putting a black or navy coloured bag over the detainees' heads and, at least initially, keeping it there all the time except during interrogation;\n (c) subjection to noise: pending their interrogations, holding the detainees in a room where there was a continuous loud and hissing noise;\n (d) deprivation of sleep: pending their interrogations, depriving the detainees of sleep;\n (e) deprivation of food and drink: subjecting the detainees to a reduced diet during their stay at the centre and pending interrogations.\n It referred to the above as \"the five techniques\" and ruled:\n 167. ... Although the five techniques, as applied in combination, undoubtedly amounted to inhuman and degrading treatment, although their object was the extraction of confessions, the naming of others and/or information and although they were used systematically, they did not occasion suffering of the particular intensity and cruelty implied by the word torture as so understood. ...\n\n \n \n \nAgain, idiot, it was the FBI that edited the report, not the ACLU. Google it. There are scans of the documents floating around online.\n \n \n BTW---IUf there is any doubt in your mind abotu whether psychological torture is legal or not, take a look at the Convention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment. It is available online at http://193.194.138.190/html/menu3/b/h_cat39.htm\n\n \n see the European Court of Human Rights judgement i posted ... oh 4+ times now.\n \n and regarding redactions, read below.", 
   {}, 
   143395, 
   null, 
   1120232040.0
  ], 
  [
   143531, 
   null, 
   "fracas", 
   "Here is a link to the actual documents:\n \n http://www.aclu.org/torturefoia/released/fbi.html\n \n Wow, strobe lights, sleep deprivation, the works. Even an account of the FBI being asked to run interference with the DOJ if an investgation came about. Are you feeling pretty stupid and gullible about now, bud? Thats ok, its not the first time.\n\n this was the only link that needed to be posted.\n too bad you wasted time getting to this.\n \n did you read it? \n \n 21 documents in total\n the following are nothing of consequence\n \n\n 2. \"We met with the medical staff re the detainees and the interview process. They gave us an insight into the outpatient clinic and the fleet hospital. They were very agreeable to working directly with the interviewers and the MP's on getting treatment to the detainees.\"\n \n 3. \"Attached are some documents that may be of interest to Spike Bowman who I understand is reviewing legal aspects of interviews here in GTMO. They were provided to me by one of the JAG lawyers working at CITF. One of these is a review of interrogation methods by a DOD lawyer. Basically, it appears that the lawyer worked hard to write a legal justification for the type of interviews they (the Army) want to conduct here.\"\n \n 4. \"After we got off the phone, I found the attached E-mail which we sent to General Miller last year. Also, there is a copy of the military's use of approved coercive techniques which are quite different I am sure from the Bureau guidelines you are preparing.\"\n \n 5. \"FBI operations in Afghanistan, Iraq, and GTMO have each been queried and all have reported back that they do not have any direct knowledge of any abusive interrogation techniques being used. Each location was aware of rumors of abuse which has surfaced as a direct result of pending Military investigations into abusive interrogation techniques.\"\n \n 6. \"On 07/27/2004, SAs from WFO met with members of U.S. Army Criminal Investigative Division regarding the alleged rape of juvenile male detainee at Abu Ghraib prison.\"{who rape him, another inmate?}\n \n 7. \"Be advised, we have already experienced what I would describe as an unfavorable contact with the EDVA regarding WFO's failure to more aggressively address pending allegations. Specifically, AUSA Rod Spencer, USAO-EDVA, has already berated an agent and I literally have a message on my desk to call him regarding these cases. . . .[T]here will soon come a time when WFO will no longer be able to hold the EDVA off on these matters before DOJ starts calling you. It would be of great benefit if HQ could run a little interference with DOJ. Less pressure on the EDVA would equate to less pressure on WFO.\"\n \n 8. \"REDACTED complained about treatment he has received for his leg injuries. He does not feel the Americans are giving him proper treatment for his injuries.\"{unable to determine cause of injury, or treatment rendered. but it was amusing to read that the prisoner admits to lying in interrogation.}\n \n 9. \"On several occasions, I did hear loud music being played and people yelling loudly from behind closed doors of interview rooms but I could not say that detainees were present in those rooms. I also observed strobe lights in interview rooms on several occasions but never observed these being used on detainees.\"\n \n 10. \"BAU personnel witnessed sleep deprivation, REDACTED and utilization of loud music/bright lights/growling dogs in the Detainee interview process by DOD representatives.\"\n \n 11. \"DIA has never advised the FBI that they were impersonating an FBI agent as part of their interrogation plan with REDACTED.\"\n \n 12. \"We had a meeting with TJ Harrington today and he inquired about the outcome of your meeting with DOD (General Miller) regarding REDACTED interrogations in June 2003 where an FBI agent was impersonated. Was that ever resolved? Is there any paper on your meeting we can provide to TJ?\"\n \n 13. \"Regarding the 'impersonation,' I'm still not sure what our issue is here. It's fairly clear to me that the \"FBI Agent\" wasn't successful in gaining the detainees cooperation. Thereafter, (months later) REDACTED carried the day with his ruse regarding REDACTED. Once again, this technique, and all of those used in these scenarios, was approved by the Dep Sec. Def.\" [Additionally, the specifically called into question in the EC were employed months after, and in a different environment, from the \"FBI Agent\" ruse.].{interesting that the ACLU redacted the last part from the paragraph on their website. maybe because it called into question the accuracy of the allegation?}\n \n 14. Describes Defense Department interrogation witnessed by FBI personnel. \"I saw [a] detainee sitting on the floor of the interview room with an Israeli flag draped around him, loud music being played and a strobe light flashing. I left the monitoring room immediately after seeing this activity. I did not see any other persons inside the interview room with the Israeli flag draped detainee, but suspect that this was a practice used by DOD DHS . . .\"[since the only other person inside the hallway near the interview room were dressed in green military fatigues, similar to the ones worn by DOD DHS and the DOD MP Uniformed Reservists At no time did I observe any physical assault of this detainee nor any others while asigned to GTMO ].{wondered why the ACLU redacted that last part}\n \n 15. [Please note that REDACTED has not mentioned the FBI or any of the agents discussed above in his abuse allegation. CID is pursuing interview with our agents since their names appear on the documents indicating they likely had contact with REDACTED while he was detained on the BIAP before he was transferred to the Abu Ghurayb prison REDACTED is alleging abuse during this period. In a written statement REDACTED claims] \"They tortured me and cuffed me in an act called the scorpion, and pouring cold water on me They tortured me from morning until the morning of the next day, and when I fell down from the severe torture I fell on the barbed wires, and then they dragged me from my feet and I was wounded and, and they punched me on my stomach.\"{so when you undo the ACLU redaction, what you get is an iraqi naming his torture technique before he even got to Abu Ghurayb. Since prisoners flow from the iraqi to abu ghurayb to gitmo, that likely his abuser were iraqi and regardless, did not occur at gitmo. in addition, the same memo stress \"detainee abuse investigations received their highest priority\" }\n \n 16. Several days ago a detainee arrive to the Temporary Holding Facility (THF) from one of the outstations. The outstations are used to gain tactical intelligence from detainees immediately after they are captured by the military, and are usually held there for several days. The outstations are manned by their own interrogators and interpreters. Upon arrival to the THF, all detainees are screened by medical personel and biometric information are collected. The detainee thata arrived several days ago appear to have] \"marks (burns) on him that seemed suspicious When questioned about the marks, the detainee stated that he had been tortured by his capt[ors]. Immediately this information was reported to the TF 6-26 Chain of Command, and there is currently a military 15-6 investigation initiated.\"{all before Gitmo}\n \n 17. \"The following information provides initial details from an individual REDACTED who observed serious physical abuses of civilian detainees in REDACTED Iraq during the period of REDACTED. . . . REDACTED observed numerous physical abuse incidents of Iraqi civilian detainees conducted in REDACTED Iraq. He described that such abuses included strangulation, beatings, placement of lit cigarettes into the detainees ear openings, and unauthorized interrogations. [REDACTED]\n REDACTED was providing this information to the FBI based on his knowledge that REDACTED cover-up of these abuses. He stated these cover-up efforts included REDACTED . . . .\"\n \n 18. Request for guidance regarding the OGC's EC regarding detainee abuse, referring to \"interrogation techniques made lawful\" by the \"President's Executive Order.\"\n [In sofar as DOSC REDACTED and I are aware, no BOC employee during our three rotation witnessed the abuse at Abu Gharayb that is now the subject of ongoing investigations, nor any conduct anywhere in theatre that went beyond the parameters set by the applicable Executive Order.]\n \n 20. \"Here is a brief summary of what I observed at GTMO. On a couple of occasions, I entered interview rooms to find a detainee chained hand a foot in a fetal position to the floor, with no chair, food, or water. Most times they had urinated or defecated on themselves and had been left there for 18 24 hours or more. On one occasion, the air conditioning had been turned down so far and the temperature was so cold in the room, that the barefooted detainee was shaking with cold. . . . On another occasion, the A/C had been turned off, making the temperature in the unventilated room probably well over 100 degrees. The detainee was almost unconscious on the floor with a pile of hair next to him. He had apparently been literally pulling his own hair out throughout the night. . . .\"\n \n\n since i, as well as the European Court of Human Rights, do not believe sensory depravation (#9,10, 20) constitute torture, none of these accounts support the claims of torture.\n \n \n\n 1. \"Of concern, DOD interrogators impersonating Supervisory Special Agents of the FBI told a detainee that REDACTED. These same interrogation teams then REDACTED. The detainee was also told by this interrogation team REDACTED. These tactics have produced no intelligence of a threat neutralization nature to date and CITF believes that techniques have destroyed any chance of prosecuting this detainee. If this detainee is ever released or his story made public in any way, DOD interrogators will not be held accountable because these torture techniques were done the \"FBI\" interrogators. The FBI will be left holding the bag before the public.\"\n \n 19. REDACTED stated that he had been beaten unconscious approximately three or four weeks ago when he was still at Camp X-Ray. According to REDACTED, an unknown number of guards entered his cell, unprovoked, and started spitting and curing at him. . . . REDACTED rolled onto his stomach to protect himself, REDACTED state a soldier named REDACTED jumped on his back and started beating him in the face REDACTED then choked him until he passed out. REDACTED stated that REDACTED was beating him because REDACTED was a Muslim . . . .\"\n \n 21. \"I am responding to your request for feedback on aggressive treatment and improper interview techniques used on detainees at GTMO. I did observe treatment that was not only aggressive, but personally very upsetting, although I can't say that this treatment was perpetrated by Bureau employees. It seemed that these techniques were being employed by the military, government contract employees and REDACTED.\"\n \n\n of 21 documents the ACLU felt best strengthened their case, only these 3 deserve a response to.\n #1. is a criticism of technique in sofar as its failure to produce desired information rather than the techniques being tortures.\n #19. is a translated report from a detainee. credible?\n #21. aggressive treatment and improper interview techniques do not equate torture.\n \n \n seriously daewoo, are you really so gullible as to take the words of the reporters (ACLU or MSM) at their word instead of reading the original pdf documents even when they are available? or maybe its just intellectual laziness. yet you did post the link so i am less likely to believe it is laziness rather than inability and lack of capacity for critical analysis. amazing really how you can swallow so much whole without any pearls coming out of your mouth.\n \n Kronus has made a far more convincing case for openess and accountability than you have daewoo. maybe it is a matter of maturity of debate techniques, a better grasp of the fundamentals, and the ability to independently analyze, all which you seem to lack. but you are, like a school yard bully, are good(?) at calling names. i guess if we were in grade school you would win. unfortunately daewoo, all bullies are inherently insecure in their capacity and position, whether it be on the playground or the debate forum. calling names only reveal you to be the little boy wimpering inside on his knees.", 
   {
    "unicode_changes_made": true
   }, 
   143400, 
   null, 
   1120232100.0
  ], 
  [
   143600, 
   null, 
   "daewoo", 
   "Again, idiot, the ACLU did not redact anything. The FBI did. You obviously have not bothered to download any of the sections or you would see this. \n \n Additionally, it does nto matter what the European Court of Human Rights judgement says . The definition of \"torture\" is covered under the Convention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment. Here is the pertinent section:\n \n \nFor the purposes of this Convention, the term \"torture\" means any act by which severe pain or suffering, whether physical or mental, is intentionally inflicted on a person for such purposes as obtaining from him or a third person information or a confession, punishing him for an act he or a third person has committed or is suspected of having committed, or intimidating or coercing him or a third person, or for any reason based on discrimination of any kind, when such pain or suffering is inflicted by or at the instigation of or with the consent or acquiescence of a public official or other person acting in an official capacity. It does not include pain or suffering arising only from, inherent in or incidental to lawful sanctions.\n\n \n The European Court of Human Rights exists soley to enforce the European Convention on Human Rights, which was enacted in 1953 and has absolutly no bearing on any state outside of those who signed it, including the US. the European convention on human rights contains no definition of torture, instead reading \"No one shall be subjected to torture or to inhuman or degrading treatment or punishment\".\n \n You have still failed to address the fact that in those memos there are several accounts, directly form FBI agents about psychological torture, or did you miss them becuase you failed to actually look at them, instead reading just the little blurb? \n \n Unless you want to question the honesty of those FBI agents, the memos make quite clear that torture IS being used at GITMO, and the FBI is apparently concerned that they will be implicated in its use. There is a lot of fluff (memos that do not really matter), but that is to be expected since what the ACLU is essentially doing is fishing for information since bushs policy is to release none. \n \n So, to sum it up,\n \n 1. Your definition of torture is incorrect and has absolutly nothing to do with this istuation.\n 2. The definition of torture that DOES apply to this situation clearly includes psychological torture\n 3. The ACLU has not edited or redacted anything, the FBI did that, which you would have caught on to if you had either read the articles I posted or looked at the memos (the PDF files are direct scans of them).\n \n \n \n And fracas, nobody spoon feeds me anything. You are the one who relies soley on media figures to do your thinking for you, not I. I will seek as many sources as possible, prefereably primary documents, and THEN form an opinion.", 
   {}, 
   143531, 
   null, 
   1120242660.0
  ], 
  [
   143621, 
   null, 
   "fracas", 
   "daewoo\n \n you really are getting slower (but more shrill) with each post.\n \n when you go to the ACLU website that list these pdfs, what their post on their web sites in the far right column are redacted version of (US) redacted original documents in pdf. and it is these same selection that they propagate to the media.\n yet you continue to rely on the ACLU summary of the documents instead of the pdf documents themselves. you don't appear to have read any of the 21 pdf the ACLU posted. thus you swallowed them whole.\n as i've already posted above, i've addressed each and every of the 21 pdfs.\n most of the accounts are political chatters\n some of the accounts of tortures appears before they got into US custodies, and definitely before Gitmo\n and what remains are sensory depravations that the european human rights court, taking into account the the Convention against torture, ruled it was not torture. you are the one trying to impose your personal definition and interpretation of what torture is, i went with a court ruling. get it? a court ruling! not mine, a court's. emoticon_rolleyes\n \n if you have read the 21 pdf files as i did you would realize the obvious.\n \nAgain, idiot, the ACLU did not redact anything. The FBI did. You obviously have not bothered to download any of the sections or you would see this. \n\n read my post above, it should be clear that what the ACLU posted were frequently not the whole of the pdf. and what they did not  i posted in [ ] could only have came from the pdfs themselves.\n problem reading? blinded by bias? or is it pearl droplets in your eyes? swallow!\n \nAnd fracas, nobody spoon feeds me anything. You are the one who relies soley on media figures to do your thinking for you, not I. I will seek as many sources as possible, prefereably primary documents, and THEN form an opinion.\n\n could have fooled me. besides, never suggested you were spoon fed, just that you more than willingly lap it up and swallow whole without an ounce of critical analysis.\n \n you posted 9 links to the same story. 9 reports of the ACLU report of their selective, i.e. redacted, version of the original FBI documents, and act as if they are independent data points. these are not independent sources. the same news release to be published in 9 different paper do not make 9 sources.\n \n and when you had a chance to read the original primary documents, failed to demonstrate that you did, otherwise you would have known that the ACLU redacted the original FBI document in what they posted on their own web site on the far right column as well in news release.\n for example\n \n14. Describes Defense Department interrogation witnessed by FBI personnel. \"I saw [a] detainee sitting on the floor of the interview room with an Israeli flag draped around him, loud music being played and a strobe light flashing. I left the monitoring room immediately after seeing this activity. I did not see any other persons inside the interview room with the Israeli flag draped detainee, but suspect that this was a practice used by DOD DHS . . .\"[since the only other person inside the hallway near the interview room were dressed in green military fatigues, similar to the ones worn by DOD DHS and the DOD MP Uniformed Reservists At no time did I observe any physical assault of this detainee nor any others while asigned to GTMO ]\n and\n 15. [Please note that REDACTED has not mentioned the FBI or any of the agents discussed above in his abuse allegation. CID is pursuing interview with our agents since their names appear on the documents indicating they likely had contact with REDACTED while he was detained on the BIAP before he was transferred to the Abu Ghurayb prison REDACTED is alleging abuse during this period. In a written statement REDACTED claims]  \"They tortured me and cuffed me in an act called the scorpion, and pouring cold water on me They tortured me from morning until the morning of the next day, and when I fell down from the severe torture I fell on the barbed wires, and then they dragged me from my feet and I was wounded and, and they punched me on my stomach.\"\n\n for both pdf #14 and #15, the italicized portion is what the ACLU posted on their web site and released to the media. but these were selection from within a paragraph that they selectively lifted out, disregarding the other portions. when i added them back, the portion in normal text within \"[]\", it significantly changed the character of their selected protion without their redacted parts.\n \n and i've quoted nothing from the media in this regard. your penchant for fabrication is rather sad.\n \n tell you what, why don't you run along and read the 21 pdfs and then we can talk.\n otherwise you are just getting more shrill and hysterical.", 
   {
    "unicode_changes_made": true
   }, 
   143600, 
   null, 
   1120245540.0
  ], 
  [
   143657, 
   null, 
   "daewoo", 
   "What is posted int he column on the right are excerpts from memos (we can assume for navigation purposes).\n \n What the ACLU released tot he press was not edited versions of the memo. They released the entire correspondance, except for the portions that the FBI edited. \n \n You are trying to backpedal here. \n \n \nfor both pdf #14 and #15, the italicized portion is what the ACLU posted on their web site and released to the media. but these were selection from within a paragraph that they selectively lifted out, disregarding the other portions. when i added them back, the portion in normal text within \"[]\", it significantly changed the character of their selected protion without their redacted parts.\n\n \n No, the protion inside the [] changes nothing. They descibe in some detail psychological torture techniques, then go on to say that physical torture is apparently not being employed.\n \n The last tow are particularly telling:\n \n http://www.aclu.org/torturefoia/released/FBI.121504.5053.pdf\n http://www.aclu.org/torturefoia/released/FBI.121504.5054.pdf\n \n \n Unfortunatly, your definiition of torture means nothing. There are 2 definitions of torture that matter. One has laready been shown. the other is the US definition of torture, which is defined under title 18, ch 113c, section 2340. It reads:\n \n \nAs used in this chapter -\n (1) ''torture'' means an act committed by a person acting under\n the color of law specifically intended to inflict severe physical\n or mental pain or suffering (other than pain or suffering\n incidental to lawful sanctions) upon another person within his\n custody or physical control;\n (2) ''severe mental pain or suffering'' means the prolonged\n mental harm caused by or resulting from -\n (A) the intentional infliction or threatened infliction of\n severe physical pain or suffering;\n (B) the administration or application, or threatened\n administration or application, of mind-altering substances or\n other procedures calculated to disrupt profoundly the senses or\n the personality;\n (C) the threat of imminent death; or\n (D) the threat that another person will imminently be\n subjected to death, severe physical pain or suffering, or the\n administration or application of mind-altering substances or\n other procedures calculated to disrupt profoundly the senses or\n personality; and\n (3) ''United States'' includes all areas under the jurisdiction\n of the United States including any of the places described in\n sections 5 and 7 of this title and section 46501(2) of title 49.\n\n \n You will note that pshychological tortuyre is definatly covered.\n \n Additionally, you will note that it includes \"all areas under the jurisdiction\n of the United States\". This specifically includes foreign military bases (this was a major issue several years ago in S America, and art fo the reason that the SOA was reorganised and reclassified). \n \n Penalties for torture:\n \n \n (a) Offense. - Whoever outside the United States commits or\n attempts to commit torture shall be fined under this title or\n imprisoned not more than 20 years, or both, and if death results to\n any person from conduct prohibited by this subsection, shall be\n punished by death or imprisoned for any term of years or for life.\n (b) Jurisdiction. - There is jurisdiction over the activity\n prohibited in subsection (a) if -\n (1) the alleged offender is a national of the United States; or\n (2) the alleged offender is present in the United States,\n irrespective of the nationality of the victim or alleged\n offender.\n (c) Conspiracy. - A person who conspires to commit an offense\n under this section shall be subject to the same penalties (other\n than the penalty of death) as the penalties prescribed for the\n offense, the commission of which was the object of the conspiracy.\n\n \n \n So, lets review once again:\n \n 1. your definition of torture does not mean spit. 2 definitons apply here, and they have both been presented now.\n 2. Unless you wish to argue that the FBI agents are lying (more on this in a minute), there is sabsolutly NO QUESTION that torture is being carried out at GITMO.\n \n any questions?\n \n As far as the FBI agents lying, I find it doubtful. Theya re clearly developing deniability here, no more, no less. Situation was observed, the agent left the room and immediatly reported it to their superiors. You do things liek this so later when youa re sitting in front of a congressional hearing you can say \"The FBI had nothing to do with it and tried to stop it thorugh normal channels\".\n \n Sorry, fracas, but your argument is pretty much worthless in all regards. \n \n Why should there be an investigation? becuase according to mroe than one eye witness, FBI agents no less, there is torture being carried out at GITMO which is not only prohibited by international law, but by the laws of the united states as well. Both laws were specifically wirtten to include psychological torture becuase franklly, people who are smarter than you wrote them and relaise that psychological torture is not a good thing.", 
   {}, 
   143621, 
   null, 
   1120252380.0
  ], 
  [
   143681, 
   null, 
   "fracas", 
   "lame\n \n read the 9 articles you linked to\n none of them relied on the pdf, just what the ACLU posted and released. its the ACLU redacted version alone.\n the parts the ACLU redacted in general suggested that any abuses occured before Gitmo and no actual reports of torture at gitmo has ever been witnessed by the FBI. not pertinent, eh? emoticon_rolleyes\n \n and i've already addressed the last two pdf in post #134.\n pdf#20 is a combination of sensory depravation that was ruled not torture by the ECHR\n pdf#21 speaks of aggressive and improper techniques. neither of which means torture has occurred. it was upsetting, but if he is like you, Elton John would have been torture.\n \n as i await your link to the US definition of torture, i'll address them anyway\n \n(2) ''severe mental pain or suffering'' means the prolonged\n mental harm caused by or resulting from -\n (A) the intentional infliction or threatened infliction of\n severe physical pain or suffering;\n (B) the administration or application, or threatened\n administration or application, of mind-altering substances or\n other procedures calculated to disrupt profoundly the senses or\n the personality;\n (C) the threat of imminent death; or\n (D) the threat that another person will imminently be\n subjected to death, severe physical pain or suffering, or the\n administration or application of mind-altering substances or\n other procedures calculated to disrupt profoundly the senses or\n personality; and\n\n 1. sexual taunting does not fit in A, B, C, or D.\n 2. loud music does not fit in A, B, C, or D.\n 3. wrapping a detainee in an israeli flag does not fit A, B, C, or D.\n 4. barking dogs does not fit in A, B, C, or D.\n 5. being chained does not fit in A, B, C, or D.\n 6. not having access to the toilet is not A, B, C, or D.\n 7. intemperate climate is not A, B, C, or D.\n as per the ECHR as well.\n \n there is room for what constitute \"to disrupt profoundly the senses or\n the personality\" for debate. but since the sensory depravation  (depravation, not distruption) techniques do not distrupt profoundly the senses, it hardly matters.\n \n the jurisdiction part is a red herring. i've made no comments on jurisdiction. this is fabrication #1 in your post #137.\n \n and so is the punishment part. never even once suggested those who commit torture should not be punished. this is fabrication #2 in your post #137.\n \n never made the claim the FBI is lying. this is fabrication #3 in your post #137.\n \n never was against an investigation either. you fabricated (this is fabrication #4 in post #137) this argument as well. in fact, i highlighted in my post #134 the parts where urgent and high priority was given to investigations to suggest that torture was not to be tolerated. \n \n again, my definition? i gave none. i relied on the ECHR's interpretation of the Convention against torture. this is fabrication #5 in your post #137.\n \n you should read my posts before responding to them. but then it seems to be in your nature to fabricate (a whopping 5 in one post!) in order to advance an argument. who cares about smarts when you can fabricate, eh?", 
   {}, 
   143657, 
   null, 
   1120254180.0
  ], 
  [
   143700, 
   null, 
   "daewoo", 
   "lame\n \n read the 9 articles you linked to\n none of them relied on the pdf, just what the ACLU posted and released. its the ACLU redacted version alone.\n the parts the ACLU redacted in general suggested that any abuses occured before Gitmo and no actual reports of torture at gitmo has ever been witnessed by the FBI. not pertinent, eh? emoticon_rolleyes\n\n \n The second clustering of articles I linked all refered to the fact that the memos had been blacked out by the FBI.\n \n \nand i've already addressed the last two pdf in post #134.\n pdf#20 is a combination of sensory depravation that was ruled not torture by the ECHR\n\n \n Which means absolutly nothign, since the ECHR does not deal with such things outside of the EHRC, which we have already established does nto include a definition of \"torture\"\n \n \npdf#21 speaks of aggressive and improper techniques. neither of which means torture has occurred. it was upsetting, but if he is like you, Elton John would have been torture.\n\n \n Correct, though it seems to confirm the allegations made earlier.\n \n \n \nas i await your link to the US definition of torture, i'll address them anyway\n\n \n Wghats wrong? Cant navigate findlaw on your own?\n http://caselaw.lp.findlaw.com/scripts/ts_search.pl?title=18&sec=2340\n \n \n1. sexual taunting does not fit in A, B, C, or D.\n 2. loud music does not fit in A, B, C, or D.\n 3. wrapping a detainee in an israeli flag does not fit A, B, C, or D.\n 4. barking dogs does not fit in A, B, C, or D.\n 5. being chained does not fit in A, B, C, or D.\n 6. not having access to the toilet is not A, B, C, or D.\n 7. intemperate climate is not A, B, C, or D.\n as per the ECHR as well.\n\n \n On their own, no they do not. together they indicate a system of psychological torture. In fact, they are directly out of the 1983 CIA field manual regarding psychological torture. The use of the digs is another thing borrowed directly from stalin. \n \n \nthere is room for what constitute \"to disrupt profoundly the senses or\n the personality\" for debate. but since the sensory depravation  (depravation, not distruption) techniques do not distrupt profoundly the senses, it hardly matters.\n\n \n Senosroy deprevation DOES profoundly disrupt the senses and personality. So does constant sensory overload. Sensory overload, such as the loud music and strobe lights are a much more effective method for doing so since sensory deprivation is actually difficult to achieve. \n \n Again, what has been outlined here is psychological torture, which by its very definition is a systematic series of ahhressive interrogation techniques designed to disrupt the senses and personality of the suspect.\n \n \nthe jurisdiction part is a red herring. i've made no comments on jurisdiction. this is fabrication #1 in your post #137.\n\n \n It is not a red herring. it is related to the definition of \"torture\". You are using a definition that was passed on based on a ruling by a court that has no jurisdiction in this matter, and has no legal definition of torture from whihc to work. I was illustrating the fact that not only is there a legal definition of torture that we use, the legal definition of torture is the same at gitmo as it is anywhere within the US.\n \n \nand so is the punishment part. never even once suggested those who commit torture should not be punished. this is fabrication #2 in your post #137.\n\n \n Again, not a red herring. Simply illustrating thatt he defintion is fully codified.\n \n \nnever made the claim the FBI is lying. this is fabrication #3 in your post #137.\n\n \n Never claimed you did. I simply said that unless you want to argue that they are lying then there is absolutly no question that torture is being carried out at GITMO. \n \n \nnever was against an investigation either. you fabricated (this is fabrication #4 in post #137) this argument as well. in fact, i highlighted in my post #134 the parts where urgent and high priority was given to investigations to suggest that torture was not to be tolerated. \n\n \n Again, didn't say that you were against an investigation, merely that one was needed.\n \n \nagain, my definition? i gave none. i relied on the ECHR's interpretation of the Convention against torture. this is fabrication #5 in your post #137.\n\n \n Wrong. You adopted the ECHRs defintion as \"proof\" that torture was nto taking place. There is no fabrication here. You advanced the definition, which pretty much makes it yours.\n \n I specifically addressed whatever definition of troture you may personally use seperatly from the ECHRs definition. Specifically I said:\n \n \nUnfortunatly, your definiition of torture means nothing. There are 2 definitions of torture that matter. One has laready been shown. the other is the US definition of torture, which is defined under title 18, ch 113c, section 2340. It reads:\n\n \n Earlier you had said:\n \n \nsince i, as well as the European Court of Human Rights, do not believe sensory depravation (#9,10, 20) constitute torture, none of these accounts support the claims of torture.\n\n \n So, essentially I am saying that neither one of the definitions you had put forth mean anything at all. While the ECHR is the only fully documented definition, you have revealed protions of your apparent personal definition, which is also worthless.\n \n \n \n \nyou should read my posts before responding to them. but then it seems to be in your nature to fabricate (a whopping 5 in one post!) in order to advance an argument. who cares about smarts when you can fabricate, eh?\n\n \n Sorry, I think maybe you need to go back and do some work on reading comprehension. There were no fabricaitons or red herrings there. I will admit that my rhetorical question (about why we need an investigation) was not clear as to its intent. It was nto meant to imply that you had argued against an investigation. It was more meant to imply that based ont he informaiton we have right now, there is absolutly no question as to whether or not there was torture, and without mroe informaiton, you are not going to be able to prove that there was not, since witness reports to date seem to conflict with your (rediculous) view here.\n \n Psychological torture is effective ebacuse.....well, the CIA explains it best in their Human Resource Exploitation Training Manual.\n \n \nThe purpose of all coercive techniques is to induce psychological regression in the subject by bringing a superior outside force to bear on his will to resist. Regression is basically a loss of autonomy, a reversion to an earlier behavioral level. As the subject regresses, his learned personality traits fall away in reverse chronological order. He begins to lose the capacity to carry out the highest creative activities, to deal with complex situations, or to cope with stressful interpersonal relationships or repeated frustrations.\"\n Inevitably, in the aftermath of torture, its victims feel helpless and powerless. This loss of control over one's life and body is manifested physically in impotence, attention deficits, and insomnia. This is often exacerbated by the disbelief many torture victims encounter, especially if they are unable to produce scars, or other \"objective\" proof of their ordeal. Language cannot communicate such an intensely private experience as pain.\n \n", 
   {}, 
   143681, 
   null, 
   1120257240.0
  ], 
  [
   143709, 
   null, 
   "fracas", 
   "The second clustering of articles I linked all refered to the fact that the memos had been blacked out by the FBI.\n\n fabricating another argument? never claimed the FBI did not redact.\n \n \nWhich means absolutly nothign, since the ECHR does not deal with such things outside of the EHRC, which we have already established does nto include a definition of \"torture\"\n\n xcept that they relied on the Convention against Torture, simiar source as the US laws. and its a legal anouncement.\n \n \nCorrect, though it seems to confirm the allegations made earlier.\n\n but not evidence of torture.\n you can have an innefective interrogation technique that is not torture.\n \n \nWghats wrong? Cant navigate findlaw on your own?\n http://caselaw.lp.findlaw.com/scripts/ts_search.pl?title=18&sec=2340\n\n why should i?\n good form mandate those who post provide the link.\n if good manners matter. but it doesn't appear in your mode of posting.\n \n \nOn their own, no they do not. together they indicate a system of psychological torture. In fact, they are directly out of the 1983 CIA field manual regarding psychological torture. The use of the digs is another thing borrowed directly from stalin. \n\n stalin hitler gulags pol pot, whatever.\n together it could be quite unpleasant the sensory depravation and humiliation. but does it constitute torture. note that the ECHR specified that even in combination it doesn't. provide a better legal reading if you don't like the ECHR's.\n \n \nSenosroy deprevation DOES profoundly disrupt the senses and personality. So does constant sensory overload. Sensory overload, such as the loud music and strobe lights are a much more effective method for doing so since sensory deprivation is actually difficult to achieve. \n \n Again, what has been outlined here is psychological torture, which by its very definition is a systematic series of ahhressive interrogation techniques designed to disrupt the senses and personality of the suspect.\n\n your interpretation. meaningless.\n as we are talking about legality. you yourself brought up the legal aspects with jurisdictions and punishments, i only care about the legal interpretation. \n \n \nIt is not a red herring. it is related to the definition of \"torture\". You are using a definition that was passed on based on a ruling by a court that has no jurisdiction in this matter, and has no legal definition of torture from whihc to work. I was illustrating the fact that not only is there a legal definition of torture that we use, the legal definition of torture is the same at gitmo as it is anywhere within the US.\n\n since there has not been a legal ruling on the matter in the US\n since the Convention against torture was the basis of its ruling\n since the US is a signatory to that convention, which make it US law\n i say iti will have to do as the best legal interpretation at this time.\n \n \nAgain, not a red herring. Simply illustrating thatt he defintion is fully codified.\n \n Never claimed you did. I simply said that unless you want to argue that they are lying then there is absolutly no question that torture is being carried out at GITMO. \n \n Again, didn't say that you were against an investigation, merely that one was needed.\n\n never made claims otherwise. thus arguments fabricated.\n \n \nWrong. You adopted the ECHRs defintion as \"proof\" that torture was nto taking place. There is no fabrication here. You advanced the definition, which pretty much makes it yours.\n \n I specifically addressed whatever definition of troture you may personally use seperatly from the ECHRs definition. Specifically I said:\n \n Earlier you had said:\n \n So, essentially I am saying that neither one of the definitions you had put forth mean anything at all. While the ECHR is the only fully documented definition, you have revealed protions of your apparent personal definition, which is also worthless.\n\n you should then address the validity of the ECHR ruling, instead of saying it is mine. but we have already talked about the validity of the ECHR ruling.\n so it comes to my agreement with the ECHR, and your disagreement with the ECHR, which you, in your intepretation, rule is worthless.\n sorry, but there is no credible basis for you to claim your interpretation superior to, or that the ECHR's ruling is worthless.\n might as well proclaim yourself king of cheese.\n \n btw, i rely on the ECHR to say that of the evidence presented, none have crossed the line into torture. no more, no less. i have not made the careless argument that no torture has happened.\n \n \nSorry, I think maybe you need to go back and do some work on reading comprehension. There were no fabricaitons or red herrings there. I will admit that my rhetorical question (about why we need an investigation) was not clear as to its intent. It was nto meant to imply that you had argued against an investigation. It was more meant to imply that based ont he informaiton we have right now, there is absolutly no question as to whether or not there was torture, and without mroe informaiton, you are not going to be able to prove that there was not, since witness reports to date seem to conflict with your (rediculous) view here.\n\n you constructed arguments and presented them as argument, as if i somehow oppose them. and this is not fabrication? revisionism is grand, eh?\n you may think it is a slam dunk. but i've already shown you that it isn't the case. the FBI per the pdf admits to never witnessing any instances of torture. the FBI did admit to witnessing sensory depravation. since there is legal precendence to suggest that this does not constitute torture, i am curious as to why you persist on declaring these pdfs as evidence of torture. wishful thinking do not make them so. biased belief do not make them so. \n my ridiculous view is predicated on a legal ruling, yours is just your opinion.\n \nPsychological torture is effective ebacuse.....well, the CIA explains it best in their Human Resource Exploitation Training Manual.\n\n why use torture other than to solicit information?", 
   {}, 
   143700, 
   null, 
   1120260000.0
  ], 
  [
   143778, 
   null, 
   "daewoo", 
   "fabricating another argument? never claimed the FBI did not redact.\n\n \n So you did not say\n \n \n1. for your benefit daewoo:\n redact = to select or adapt for publication : EDIT.\n interesting. so it is not the FBI's own testimony, but the ACLU version of the FBI report. and this is evidence? \n\n \n and\n \n \nit amuses me that you think it worthy of a post to say the ACLU's heavily redacted reports of FBI reports constitute credible evidence.\n\n \n Which was made in commenting to a section of an article that you cut and pasted:\n \n \nThe accounts, gleaned from heavily redacted e-mails and memorandums, were obtained by the American Civil Liberties Union as part of an ongoing lawsuit.\n\n \n You clearly were under the impression that it was tyhe ACLU that edited the reports. Don't try to weasle out from under it now. The original ACLU press release (which you can likely google....my link is dead) included full transcrpts of the messages. The ACLU page with the full scans of the messages was up less than 2 hours after they were originally handed over.\n \n Even the article that you seemed to hold as evidence to your viewpoint did not imply that the documents were redacted by the ACLU, but rather that the copies the ACLU recieved were heavily redacted.\n \n In order to avoid such embaressing mistakes in the future, you might try actually reading the article and see what it says, as opposed to reading it seeing what you wish to see\n \n \n \nxcept that they relied on the Convention against Torture, simiar source as the US laws. and its a legal anouncement.\n\n \n No, they didn't. The convention against torture is never once mentioned in the majority decision. It is only mentioned once in the entire decision, where one of the dissenting justices mentions that it should have been considered.\n \n The court in this case had the disadvantage of basically having no definition of torture available to them. \n \n Sorry, the opinion of a foreign court working from an entirely set of laws, and a different definition of \"torture\" has nothing to do with this discussion.\n \n \n \nwhy should i?\n good form mandate those who post provide the link.\n if good manners matter. but it doesn't appear in your mode of posting\n\n \n Generally if you care to refute something you do so. Otherwise you are essentially sucking your thumb and yelling \"prove it\". It might have worked on grade school play grounds, but does not play well here.\n \n \n \nstalin hitler gulags pol pot, whatever.\n together it could be quite unpleasant the sensory depravation and humiliation. but does it constitute torture. note that the ECHR specified that even in combination it doesn't. provide a better legal reading if you don't like the ECHR's.\n\n \n Again, the ECHR has no bearing in this conversation at all. In the 60'2, russian courts ruled that cutting off people fingers did not constitute torture.\n \n \n \nsince there has not been a legal ruling on the matter in the US\n since the Convention against torture was the basis of its ruling\n since the US is a signatory to that convention, which make it US law\n i say iti will have to do as the best legal interpretation at this time.\n\n \n It would be in Europe. Unfortunatly for you, this is not Europe. Again, not once is the convention against torture mentioned in the entire ruling. Additionally, rules of evidence are different in US courts. Sorry, citing a completley irrelevant court case on a different continent, especially where the court is ruling on entirely seperate laws, dos nothign for your argument.\n \n \n never made claims otherwise. thus arguments fabricated.\n \n \n \nyou should then address the validity of the ECHR ruling, instead of saying it is mine. but we have already talked about the validity of the ECHR ruling.\n so it comes to my agreement with the ECHR, and your disagreement with the ECHR, which you, in your intepretation, rule is worthless.\n sorry, but there is no credible basis for you to claim your interpretation superior to, or that the ECHR's ruling is worthless.\n might as well proclaim yourself king of cheese.\n\n \n Maybe you could find a legal justification for using the ruling of a foreign court, which was based on entirely seperate laws, for making such deteminations. I looked and could find none. The ECHR ruling is worthless in this situation. We are not bound by the rulings of the ECHR, nor are we signatories of the EHRC. As far as I have been able to find, ther eis absolutly no possible situation where the ECHR ruling would have any effect on the issue at hand any more than the russian decision that cutting off fingers is not torture would. \n \n \nyou constructed arguments and presented them as argument, as if i somehow oppose them. and this is not fabrication? revisionism is grand, eh?\n you may think it is a slam dunk. but i've already shown you that it isn't the case. the FBI per the pdf admits to never witnessing any instances of torture. the FBI did admit to witnessing sensory depravation. since there is legal precendence to suggest that this does not constitute torture, i am curious as to why you persist on declaring these pdfs as evidence of torture. wishful thinking do not make them so. biased belief do not make them so. \n my ridiculous view is predicated on a legal ruling, yours is just your opinion.\n\n \n No, they did not. \n \n \n\"I saw [a] detainee sitting on the floor of the interview room with an Israeli flag draped around him, loud music being played and a strobe light flashing. I left the monitoring room immediately after seeing this activity.\"\n\n \n This is a clear description of the use of sensory overload, a method employed in psychological torture. \n \n Unfortunatly for you, these PDFs are damning to your argument. At least one clearly states that torture was immeditly witnessed. Many (most) of the otehrs are highly indicitive of torture. Your argument is essentially that since a court in europe, ruling on entirely different laws than those of the united states, ruled that this was not torture, once in 1978 (unlike US courts, precedent set by the ECHR are in no way binding....not even to the ECHR or to EHRC signatories), that these actions, clearly psychological torture, are not torture.\n \n \n As an interesting side note, I think that the ACLUs next move needs to eb to go after documentation form WHISC/SOA. One fo the prisoners reported to the FBI agent that he was put in a position called \"the scorpion\". Interestingly enough, there is such a position explained in some lenghth in a manual on torture that is used at WHISC whcih is generally refered to as the \"blue book\" (becuase fo the color of its cover...following the SOA mess, when SOA was renamed WHISC, manuals were given colored covers and their names removed in order to make them more difficult to sopoena under FOI lawsuits). \n \n there is no way he could have properly named the torture technique unless he heard it from someboudy who had learned it out of the blue book. I have never seen the term anywhere else, despite the fact I have studied such things extensively.", 
   {
    "unicode_changes_made": true
   }, 
   143709, 
   null, 
   1120273500.0
  ], 
  [
   143914, 
   null, 
   "ScummyD", 
   "\n I agree that the political opposition to the Republican party (not necessarily \"The Right\") is fragmented, but for some reason I thought it had something to do with self-proclaimed rightists trying to score cheap points, make empty platitudes, and slanderous ad hominem attacks. \n \n \n\n No, you're \"thought\" is 180 degrees out of phase with reality.\n \n The Left in America is floundering due to their own inept and incompetent political efforts, their own lack of viable ideas, and their undermining of American national security, among a host of other self inflicted wounds that they continue to rub with salt.", 
   {}, 
   142594, 
   null, 
   1120336620.0
  ], 
  [
   145832, 
   null, 
   "fracas", 
   "daewoo\n \n you should read all the pdf the ACLU posted.\n it is far from evidence of torture at gitmo.\n \n my point regarding redaction is that\n 1. the aclu clearly edited in what it reports to the news. \n 2. there is difficulty to ascertain the truth from reports that have been redacted.\n \n \n the rest of your post was mostly your opinion, which means nothing to me. when we are in a debate regarding whether torture occurs or not at gitmo, as we must define what torture is legally and what is not torture legally. certainly you have a right to an opinion on that, as i do. but i'd rather debate on points of the law as it stand. had you initiated a discussion on what the law on torture should be, that is another matter. but as it stand the law permits what is happening at gitmo.", 
   {}, 
   143914, 
   null, 
   1120833480.0
  ], 
  [
   145875, 
   null, 
   "daewoo", 
   "daewoo\n \n you should read all the pdf the ACLU posted.\n it is far from evidence of torture at gitmo.\n\n \n Except for the eye witness accounts by the FBI agents who describe psychological torture techniques in use, and the reports that note the use of loud music and the presence of strobe lights in interrorgation rooms (both part of almost any psychological torture program)\n \n \n \nmy point regarding redaction is that\n 1. the aclu clearly edited in what it reports to the news. \n 2. there is difficulty to ascertain the truth from reports that have been redacted.\n\n \n 1. No they didn't, they issued the entire documentn as they recieved it. Only the FBI edited them.\n 2. Not especially. Most of what the FBI redacted was names. Eyewitness ccounts fo torture being carried out are intact.\n \n \n \nthe rest of your post was mostly your opinion, which means nothing to me. when we are in a debate regarding whether torture occurs or not at gitmo, as we must define what torture is legally and what is not torture legally. certainly you have a right to an opinion on that, as i do. but i'd rather debate on points of the law as it stand. had you initiated a discussion on what the law on torture should be, that is another matter. but as it stand the law permits what is happening at gitmo.\n \n\n \n No, it doesn't. Psychological torture is clearly covered under the convention against torture, which we are party too. It is also clearly prohibited under US domestic law, which I posted ehre for everybody to see. Your argument that it is permissibale becuase a foreign court, ruling under a different law, with a different definition of torture, found similar methods to be acceptable is frankly stupid. Once again, you have had your XXX handed to you.\n \n You want to head over and comment on the new thread about the Dawa party and their new strategic military alliance with Iran? I owuld be interested to see your comments on it, since you had previously claimed that they were not closely allied with Iran.", 
   {}, 
   145832, 
   null, 
   1120845840.0
  ], 
  [
   145876, 
   null, 
   "fracas", 
   "you view it as proof of torture because you define psychological duress and sensory depravation as torture. this is your opinion and perhaps it should be categorized as torture. but it has not been legally defined as torture.", 
   {}, 
   145875, 
   null, 
   1120846020.0
  ], 
  [
   145887, 
   null, 
   "daewoo", 
   "you view it as proof of torture because you define psychological duress and sensory depravation as torture. this is your opinion and perhaps it should be categorized as torture. but it has not been legally defined as torture.\n\n \n The US definition of troture has been posted.", 
   {}, 
   145876, 
   null, 
   1120849080.0
  ], 
  [
   145890, 
   null, 
   "fracas", 
   "but its interpretation of the activities of gitmo remains open.", 
   {}, 
   145887, 
   null, 
   1120850640.0
  ], 
  [
   147153, 
   null, 
   "fracas", 
   "A high-level military investigation into complaints by F.B.I. agents about the abuse of detainees at Guantánamo Bay, Cuba, concluded in a report released Wednesday that their treatment was sometimes degrading but did not qualify as inhumane or as torture.\n", 
   {}, 
   145890, 
   null, 
   1121345460.0
  ], 
  [
   147546, 
   null, 
   "fracas", 
   "A federal appeals court put the Bush administration's military commissions for terrorist suspects back on track today, saying a detainee at the Guantanamo Bay prison who once was Osama bin-Laden's driver can stand trial.\n \n A three-judge panel ruled 3-0 against Salim Ahmed Hamdan, whose case was halted by a federal judge on grounds that commission procedures were unlawful.\n \n \"Congress authorized the military commission that will try Hamdan,\" said the U.S. Court of Appeals for the District of Columbia Circuit.\n \n The protections of the 1949 Geneva Convention do not apply to al-Qaida and its members, so Hamdan does not have a right to enforce its provisions in court, the appeals judges said.\n \n pdf of actual court ruling available here", 
   {}, 
   147153, 
   null, 
   1121462400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Durbin apologizes for his outrageous remarks against the military...", 
  "url": "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 5743, 
  "discussion_files": [
   [
    "23445.html", 
    "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military-print.html"
   ], 
   [
    "23446.html", 
    "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military-10-print.html"
   ], 
   [
    "23447.html", 
    "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military-8-print.html"
   ], 
   [
    "23448.html", 
    "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military-6-print.html"
   ], 
   [
    "23449.html", 
    "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military-4-print.html"
   ], 
   [
    "23450.html", 
    "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military-5-print.html"
   ], 
   [
    "23451.html", 
    "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military-7-print.html"
   ], 
   [
    "23452.html", 
    "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military-9-print.html"
   ], 
   [
    "23453.html", 
    "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military-3-print.html"
   ], 
   [
    "23454.html", 
    "http://www.4forums.com/political/politics-debates/5743-durbin-apologizes-his-outrageous-remarks-against-military-2-print.html"
   ]
  ], 
  "identifier": 5743
 }
]