[
 [
  [
   140270, 
   null, 
   "Eddie", 
   "Most Europeans are aware of the Irish economic wonder. No doubt, many americans have heard about it as well. \n \n Ireland had long been the poorest country in western Europe. In fact, many still associate Ireland with poverty. Up until 1987, the Irish economy was under-performing, unemployment was around 15%, inflation was rampant and economic growth was stagnating. But something happened in 1987. Since then, the Irish economy has experienced a breathtaking economic growth, slashed unemployment figures in half, stabilised the inflationary pressure and paid off a significant portion of the governmental debt. \n \n Many analysts have tried to explain this remarkable progress with different aspects of the Irish economic and political life. Perhaps the most important development has been that Ireland has been able to attract a large amount of FDI`s (Foreign Direct Investments). Many multinational companies have opted to base their operations or move production to Ireland. This has slashed the unemployment figures as well as dramaticly increased the economic growth. But this in turn needs to be explained. \n \n The inflationary pressure has been pressed down and been kept low, even though the quick growth. This cannot be explained by the fact that Ireland has managed to attract foreign capital. In fact, these two developments are in stark contrast to one another.\n \n My idea for this thread is to discuss the reason for the Irish success and wether/how the rest of Europe could learn from the Irish experience.\n \n Here are a few arguments/explanations I`ve encountered so far (keep in mind that they are not exclusive to one another but are rather complementary):\n \n * Lower corporate and income tax than the rest of Europe has attracted alot of foreign companies that wants a piece of the EU market.\n \n This could also mean that much of Irelands economic growth has been at the expense of the rest of EU. Perhaps a good example of how EU could encourage a \"race-to-the-bottom\" if no attempts to harmonize certain crucial tax rates are being made. \n \n * A well educated and english speaking workforce has attracted foreign companies (ecpessially those from english speaking countries).\n \n This factor is also very interesting as Ireland can expect even more well-educated people to enter the workforce in just a few years. In fact, the dependancy ratio is expected to drop in the future due to large cohorts in the universities at the moment.\n \n * Substantial EU subsidies for investments in infrastructure has made Ireland internationally competative at the expense of the rest of EU. \n \n Critics have pointed out that it`s rather obscene that poorer EU members (like Germany and Sweden) should pay for further investments in rich Ireland.\n \n * Corporatism in the 21th century. By centrally negotiating wages between three parties; labour union, employers organisation and government the Irish wage increases have been kept low even during rapid economic growth. This can both explain the low inflationary pressure as well as Irelands attraction for foreign companies (lower labour costs). Instead of massive wage increases, the government has compensated the labour unions with lower income taxes for their members. \n \n An interesting paralell (at least to me :) ) could be drawn to Sweden in the 50ies and 60ies when the labour market parties in Sweden worked in unison to dampen the negative effects of expetionally high demand for labour.\n \n * The \"catching-up\" effect. As Ireland was (one of?) the poorest countries in western Europe in the 1970:ies, the explosive economic growth was not as remarkable at first. A developing economy naturally grows faster than a more matured economy. A simmiliar development during the nineties (albeit not as succesful) is Greece. The momentum of this \"catching-up\" effect may also make the living standards outpace more matured economies (Ireland is currently one of the richest western european countries). \n \n Recent slow-down of the Irish economy gives credit to this explenation, allthough I wouldn`t recomend dissmising the Irish wonder because of this.\n \n So what do you think? Are there cultural and political factors I`ve missed (admitedly I`ve mostly looked at economic factors). Which explanation do you think carry the most power? What will happen to Ireland in the future and could the rest of Europe (or perhaps even the US) learn something from all of this?\n \n - Eddie", 
   {
    "post_info": {
     "post_title": "The Celtic Tiger"
    }
   }, 
   null, 
   null, 
   1119537240.0
  ], 
  [
   140275, 
   null, 
   "wilted_laughter", 
   "That's a pretty thorough assessment of the \"celtic tiger\". \n \n What I might point out is that Ireland is now one of the three most globalised economies in the world now; we are heavily dependent on FDI and a global economic downturn would hit us much harder than other states with more home grown industries. The challenge facing Ireland now is to decrease its dependence on foreign investment and develop more of its own domestic industries with its new wealth; especially in the context of new EU members with an eye to following the Irish example and in the process could well steal our thunder.\n \n I cannot stress enough that EU membership in terms of the structural funding Ireland received and market access is crucial to Ireland's success. And the time has come for us to become net contributors to the EU budget.", 
   {}, 
   140270, 
   null, 
   1119539400.0
  ], 
  [
   140284, 
   null, 
   "georged", 
   "Not much I can add to your very thorough assessments other than stressing the impact of quality of education available within the work force:\n \n ~The quality of Ireland's education is exceptionally high. The independent IMD World Competitiveness Report ranks Ireland as the best in Europe for the quality of education which everyone receives. Six out of every 10 of Ireland's third level students major in engineering, science or business studies subjects.~ \n \n Combining that level of education with what's considered one of the highest quality of life countries in Europe makes for a very formidable combination.", 
   {}, 
   140275, 
   null, 
   1119541440.0
  ], 
  [
   140298, 
   null, 
   "Alan Ryan", 
   "Considering its long history of English oppression and exploitation, its lack of material resources, its historic poverty, and the baleful inertia of Catholicism over many centuries, Ireland has been wonderfully transformed into an economic success over the last couple of decades.\n \n I cannot add much to the economic observations of Eddie, except to say that increasing secularization in Ireland has probably been instrumental in preparing the psychological ground for the growth of the celtic tiger's prosperity.", 
   {}, 
   140284, 
   null, 
   1119544320.0
  ], 
  [
   140300, 
   null, 
   "wilted_laughter", 
   "\n I cannot add much to the economic observations of Eddie, except to say that increasing secularization in Ireland has probably been instrumental in preparing the psychological ground for the growth of the celtic tiger's prosperity.\n\n \n That's interesting, care to explain that more?", 
   {}, 
   140298, 
   null, 
   1119544620.0
  ], 
  [
   140307, 
   null, 
   "Alan Ryan", 
   "That's interesting, care to explain that more?\n\n \n \n Generally speaking, doesn't the conservatism of Catholicism seek to reconcile the poor with their meagre portion ? Is preaching the \"virtues\" of economic dynamism (or the pursuit of Mammon) likely to be heard in the pulpit ?\n \n My impression is that the Irish people are listening less to the inhibiting cautions of priests, and are embracing their new economic opportunities with zest. \n \n But I'm only a very occasional visitor to the place, and what I'm told (by relatives) may be a little la vie en rose. What do you think ?", 
   {}, 
   140300, 
   null, 
   1119545940.0
  ], 
  [
   140325, 
   null, 
   "wilted_laughter", 
   "Generally speaking, doesn't the conservatism of Catholicism seek to reconcile the poor with their meagre portion ? Is preaching the \"virtues\" of economic dynamism (or the pursuit of Mammon) likely to be heard in the pulpit ? \n\n \n I suppose you could say that the ideal of DeValera's self sustaining rural Ireland with maidens dancing at the crossroads and all that is joined at the hip with the idea of a Catholic Ireland. Certainly economic growth in Ireland has gone hand in hand with the decline of the Church.\n \n \n\n My impression is that the Irish people are listening less to the inhibiting cautions of priests, and are embracing their new economic opportunities with zest. \n\n \n Yes, but isn't that more of a result of rather than a cause of prosperity? Or can it be both?\n \n \n\n But I'm only a very occasional visitor to the place, and what I'm told (by relatives) may be a little la vie en rose. What do you think ?\n\n \n In a broad sense I suppose its true, but theres still plently of religious influences and people.", 
   {}, 
   140307, 
   null, 
   1119549360.0
  ], 
  [
   140480, 
   null, 
   "fracas", 
   "So what do you think? Are there cultural and political factors I`ve missed (admitedly I`ve mostly looked at economic factors). Which explanation do you think carry the most power? What will happen to Ireland in the future and could the rest of Europe (or perhaps even the US) learn something from all of this?\n \n - Eddie\n\n \n you are wrong in every way.\n so wrong that i won't even bother posting links to show you wrong.\n it is enough that i tell you you are wrong.\n 4Forums tradition all the way!\n \n \n 1. actually i think you got it right\n 2. i think that it is economic liberalization that carries the most power in the celtic blossoming prosperity. i am skeptical how much the EU contributed to it, as this was well underway 5-10 years ago ... and the EU prosperity plan per Lisbon was only about that time.\n 3. germany and france has much to learn from Ireland.", 
   {}, 
   140270, 
   null, 
   1119568740.0
  ], 
  [
   140498, 
   null, 
   "Big_Bear_Scot", 
   "you are wrong in every way.\n so wrong that i won't even bother posting links to show you wrong.\n it is enough that i tell you you are wrong.\n 4Forums tradition all the way!\n \n \n Nahh you are wrong you 5 year old, Nazi Neo-Fascist emoticon_xclown \n \n A lot of the Nationalist in Scotland often hold Ireland up as an example of what a small Independent country could do if they gained Independence form the UK. \n \n I am unsure if the Irish Example could be replicated or is it a purely Irish phenomenon ?\n \n BTW very good original post Eddie", 
   {}, 
   140480, 
   null, 
   1119570000.0
  ], 
  [
   140536, 
   null, 
   "fracas", 
   "Nahh you are wrong you 5 year old, Nazi Neo-Fascist emoticon_xclown \n \n A lot of the Nationalist in Scotland often hold Ireland up as an example of what a small Independent country could do if they gained Independence form the UK. \n \n I am unsure if the Irish Example could be replicated or is it a purely Irish phenomenon ?\n \n BTW very good original post Eddie\n\n 1. You don't know anything. Typical for a leftie marxist peacenik emoticon_frazzled \n 2. Prosperity follows proper policy.\n 3. And just to reiterate how wrong you are, Eddie's analysis was too good to generate heated discussion, thus he lose and i win!", 
   {}, 
   140498, 
   null, 
   1119574260.0
  ], 
  [
   140742, 
   null, 
   "RedMoon", 
   "A question for the OP or those knowledgable on the topic:\n \n I travelled to Dublin a few years ago (beautiful country, by the way--so much to see and I never made it out of the Dublin area!), and can recall talking with a lot of people about the economic and political developments. At the time, I believe, Ireland was approaching a vote on adopting the Euro as their currency, as I can recall a lot of posters around pro- and anti- the Euro currency.\n \n One thing I noticed a lot of people mentioning or complaining about with regards to the EU was the fact that it had opened the door for an influx of poor immigrants from Eastern Europe. I heard stories of people smuggling themselves into Ireland much as you might hear stories of people smuggling themselves into the US. Most of those noting the phenomenon blamed the generous social policies of the government (I'm not up on what such policies Ireland has, but I'd imagine healthcare and education were up on that list), and saying that such people were pouring in to \"freeload\" off of the government and Ireland's recent prosperity.\n \n Where does this fit into the picture, if at all?", 
   {}, 
   140536, 
   null, 
   1119636000.0
  ], 
  [
   141025, 
   null, 
   "wilted_laughter", 
   "Immigration is a relatively new phenomenon in Ireland, as we were emigrating large numbers of people until our economy turned around. \n \n As a result immigration has caused a large amount of illogical public hysteria and many Irish people have revealed themselves to be racist.\n \n We need immigration and its a good thing, unfortunately it has declined in recent years. Immigration isn't the problem; people's attitudes to it are.\n \n Generous social policies? I don't know about that!", 
   {}, 
   140742, 
   null, 
   1119712980.0
  ], 
  [
   141226, 
   null, 
   "mae", 
   "Ireland experienced a boom in the 1990's partly because of the Hi-tech industry (mainly software). But now those jobs are slowly migrating to Eastern europe , India, China because of cheaper labour costs. Plus it got generous amounts of money from the EU. But now with the expansion of the EU (new members from the poorer eastern european countries), Ireland share of the EU pie is going to be smaller. These two factors combined together will have an impact on Ireland's prosperity in the near future.", 
   {
    "post_info": {
     "post_title": "Ireland's prosperity ?"
    }
   }, 
   141025, 
   null, 
   1119760500.0
  ], 
  [
   141238, 
   null, 
   "Winston Smith", 
   "Ireland experienced a boom in the 1990's partly because of the Hi-tech industry (mainly software). But now those jobs are slowly migrating to Eastern europe , India, China because of cheaper labour costs. Plus it got generous amounts of money from the EU. But now with the expansion of the EU (new members from the poorer eastern european countries), Ireland share of the EU pie is going to be smaller. These two factors combined together will have an impact on Ireland's prosperity in the near future.\n\n You are right, lots of customer service jobs have migrated to India. It is funny when you call an Australian company and you get an Indian voice answering trying to sound 'aussie'. I saw a documentary recently about these Indian customer service centers. They are huge! And on the wall of one of them there was a list of western names for the operators to assume when taking calls. Once the standard living raises in South Asia though their competitiveness will decrease", 
   {
    "unicode_changes_made": true
   }, 
   141226, 
   null, 
   1119763260.0
  ], 
  [
   141241, 
   null, 
   "Winston Smith", 
   "I find Scottish nationalism as misguided as ETA's in Spain, but the Scotts being practical people only use it as leverage in their political dealings with the English. For centuries the Scotts have tolerated British rule in exchange for economic benefits, whereas the Irish had always got a rotten deal. Is it because they are Catholics? \n I don't know.", 
   {
    "post_info": {
     "post_title": "the luck of the Irish"
    }, 
    "unicode_changes_made": true
   }, 
   141238, 
   null, 
   1119764280.0
  ], 
  [
   141255, 
   null, 
   "mae", 
   "But Ireland is not part of the United kingdom now hence they cannot use independence as a leverage like the Scots. Northern Ireland is but thats all . Whereas Scotland is part of the UK.\n \n I didn't get your point about whether the Irish being catholic had anything to do with it. Not clear what you meant by it.\n \n The situation with the Basque region in Spain is quite different. Different history, maybe being supressed by Franco for so many years has something to do with ETA's nationalism. I understand the Basque language & culture is distinct and Basque nationalism is a desire to preserve that distinction. The same cannot be said about Scottish nationalism.", 
   {
    "post_info": {
     "post_title": "Luck of the Irish"
    }
   }, 
   141241, 
   null, 
   1119768120.0
  ], 
  [
   141264, 
   null, 
   "Winston Smith", 
   "I didn't get your point about whether the Irish being catholic had anything to do with it. Not clear what you meant by it.\n\n I wonder if the English have treated the Irish so badly for centuries because the Irish are Catholics. Or it was just because they could?", 
   {}, 
   141255, 
   null, 
   1119769620.0
  ], 
  [
   141266, 
   null, 
   "mae", 
   "Sad to say but the British like all other empires treated many countries 'badly' at one time or another during the centuries . I don't think Ireland was specifically singled out because it was catholic. It treated non catholic countries 'badly' too. But this is all ancient history.", 
   {
    "post_info": {
     "post_title": "Irish catholic"
    }
   }, 
   141264, 
   null, 
   1119770160.0
  ], 
  [
   141284, 
   null, 
   "Big_Bear_Scot", 
   "I find Scottish nationalism as misguided as ETA's in Spain, but the Scotts being practical people only use it as leverage in their political dealings with the English. For centuries the Scotts have tolerated British rule in exchange for economic benefits, whereas the Irish had always got a rotten deal. Is it because they are Catholics?\n \n \n I wouldn't really compare Scottish Nationalism to ETA's, mainly because the main stream Nationalists in Scotland have never been violent. They have always push for independence via the ballot box not the bomb.\n \n I actually was a Scottish Nationalist, I am more of an Internationalist now. \n The only reason I support Scottish Independence at the moment is that there would be more of a chance of a Socialist Government in an Independent Scotland than a UK wide Socialist Government.", 
   {
    "unicode_changes_made": true
   }, 
   141241, 
   null, 
   1119782340.0
  ], 
  [
   141443, 
   null, 
   "mae", 
   "What does socialism exactly mean to you ? Government control of all industries? Even 'socialist' Sweden does not have that - it has private industries because that is what works.", 
   {
    "post_info": {
     "post_title": "Big Bear Scot -Socialism"
    }
   }, 
   141284, 
   null, 
   1119835440.0
  ], 
  [
   141451, 
   null, 
   "Big_Bear_Scot", 
   "What does socialism exactly mean to you ? Government control of all industries? Even 'socialist' Sweden does not have that - it has private industries because that is what works.\n \n \n I am more relaxed than most Socialists towards private enterprise, but I believe key sectors should be directly controlled by the Government and hence directly democratically accountable to the people.\n \n An example of key industries or sectors that should be (or stay) nationalised would be Education, Health care, Transport such as Rail, Bus & ferry(to isolated communities) Network, Police, Air Traffic Control. Apart from that I am quite relaxed on private business involvement other sectors.\n \n As I have said I am quite relaxed and I realise that the market is here to stay in some sectors.", 
   {}, 
   141443, 
   null, 
   1119836880.0
  ], 
  [
   141525, 
   null, 
   "mae", 
   "sounds very similiar to the US. Government schools, Transportation (amtrak),\n etc... But it also gives the people CHOICE of private schools, transportation etc...... Socialism does not give choice.\n \n True socialism means government control of all industries because the theory behind it is that people work for the common good. Does not work in reality because human nature is basically selfish. Capitalism takes into account human nature but controls it to some extent by government intervention such as welfare etc...\n \n Socialists cannot have it both ways, some private and some government owned. This mixture of private and government ownership exits in all the countries of the world . It is not socialism by any means, just common sense.\n \n Can you tell me any country where 'socialism' has worked. ..... Cuba ?", 
   {
    "post_info": {
     "post_title": "Big bear scot"
    }
   }, 
   141451, 
   null, 
   1119856020.0
  ], 
  [
   141530, 
   null, 
   "Winston Smith", 
   "You threw everything in the pot: socialism, marxism, communism, mixed economy....\n Can you give us a clear definition of what socialism is, before we can argue about it?\n Thanks.", 
   {
    "post_info": {
     "post_title": "confucious"
    }
   }, 
   141525, 
   null, 
   1119857880.0
  ], 
  [
   141531, 
   null, 
   "Winston Smith", 
   "Sad to say but the British like all other empires treated many countries 'badly' at one time or another during the centuries . I don't think Ireland was specifically singled out because it was catholic. It treated non catholic countries 'badly' too. But this is all ancient history.\n\n \n \n how ancient is ancient? \n if It doesn't treat any country badly anymore,perhaps it is due to the unpalatable fact that the Empire's days are over.", 
   {}, 
   141266, 
   null, 
   1119858060.0
  ], 
  [
   141539, 
   null, 
   "mae", 
   "Winston Smith \"how ancient is ancient? \n if It doesn't treat any country badly anymore,perhaps it is due to the unpalatable fact that the Empire's days are over.\"\n \n \n What a nasty remark. The British empire did some good and some bad. \n Maybe you should read \" Empire - The rise and demise of the British world order\" by Neil Ferguson before making any more comments.", 
   {
    "post_info": {
     "post_title": "Sour grapes for kicking the Hun in WW2"
    }
   }, 
   141531, 
   null, 
   1119860100.0
  ], 
  [
   141552, 
   null, 
   "Alan Ryan", 
   "Ireland was not an imperial possession. English rule in Ireland predated the age of Imperialism and began in the time of Henry II (the 12th century). Though at first it was \"administered\" as a crown feoff from which grants of land and powers to dispense \"justice\" were made to the kings's followers, an English controlled government eventually emerged within the pale around Dublin.\n \n Ireland as a fully independent nation (less the counties in the North of Ireland which are still \"loyal\" to the British crown) was established by the constitution of 1937.", 
   {}, 
   141539, 
   null, 
   1119865020.0
  ], 
  [
   141558, 
   null, 
   "Big_Bear_Scot", 
   "sounds very similiar to the US. Government schools, Transportation (amtrak),\n etc... But it also gives the people CHOICE of private schools, transportation etc...... Socialism does not give choice.\n \n True socialism means government control of all industries because the theory behind it is that people work for the common good. Does not work in reality because human nature is basically selfish. Capitalism takes into account human nature but controls it to some extent by government intervention such as welfare etc...\n \n Socialists cannot have it both ways, some private and some government owned. This mixture of private and government ownership exits in all the countries of the world . It is not socialism by any means, just common sense.\n \n Can you tell me any country where 'socialism' has worked. ..... Cuba ?\n\n \n \n I will create another thread about Socialism, because I think it deserves to be explained detail.\n \n I most also add there many different types of Socialism, there are some that want total control of all industries and others that have a mixed model similar to what we have in most of the West. I am more in line with the Socialist Tradition of the UK where people like John MacLean, Keir Hardie and Nye Bevan. Rather than the branch directly influenced by Marx, Engels which was(is) more prevalent in main Land Europe.\n \n I will PM you will a link to the new thread, and I will explain in better detail on that thread.", 
   {}, 
   141525, 
   null, 
   1119868320.0
  ], 
  [
   141567, 
   null, 
   "Alan Ryan", 
   "I will create another thread about Socialism, because I think it deserves to be explained detail.\n \n\n \n Why don't you go for the \"full monty\", and argue for a Socialist Republic of Scotland ?", 
   {}, 
   141558, 
   null, 
   1119876660.0
  ], 
  [
   141569, 
   null, 
   "Winston Smith", 
   "Please use simple words and short sentences, sort of a 'Socialism forDummies'", 
   {
    "post_info": {
     "post_title": "lessons in socialism"
    }, 
    "unicode_changes_made": true
   }, 
   141558, 
   null, 
   1119877500.0
  ], 
  [
   141571, 
   null, 
   "Winston Smith", 
   "Why don't you go for the \"full monty\", and argue for a Socialist Republic of Scotland ?\n\n \n A \"Naked Socialist Republic of Scotland\" would be too much to bear", 
   {
    "unicode_changes_made": true
   }, 
   141567, 
   null, 
   1119877800.0
  ], 
  [
   141572, 
   null, 
   "Winston Smith", 
   "Winston Smith \"how ancient is ancient? \n if It doesn't treat any country badly anymore,perhaps it is due to the unpalatable fact that the Empire's days are over.\"\n \n \n What a nasty remark. The British empire did some good and some bad. \n Maybe you should read \" Empire - The rise and demise of the British world order\" by Neil Ferguson before making any more comments.\n\n \n Have YOU read it?", 
   {}, 
   141539, 
   null, 
   1119877920.0
  ], 
  [
   141573, 
   null, 
   "Alan Ryan", 
   "A \"Naked Socialist Republic of Scotland\" would be too much to bear\n \n \n Do you mean to \"bare\" ?", 
   {
    "unicode_changes_made": true
   }, 
   141571, 
   null, 
   1119878040.0
  ], 
  [
   141585, 
   null, 
   "RedMoon", 
   "Do you mean to \"bare\" ?\n\n \n *groan*\n \n Sheesh. Slap a warning label on posts like that, I need at least one cup of coffee in the morning before I can read something like that. :p", 
   {}, 
   141573, 
   null, 
   1119884700.0
  ], 
  [
   141587, 
   null, 
   "Alan Ryan", 
   "*groan*\n \n Sheesh. Slap a warning label on posts like that, I need at least one cup of coffee in the morning before I can read something like that. :p\n\n Pretty feeble heh ? Agreed.\n A man who would make so vile a pun, would not scruple to pick a pocket.", 
   {}, 
   141585, 
   null, 
   1119885120.0
  ], 
  [
   141720, 
   null, 
   "mae", 
   "Winston Smith - \"Have YOU read it\" ?\n \n \n \n Some parts of it.", 
   {
    "post_info": {
     "post_title": "Winston"
    }
   }, 
   141572, 
   null, 
   1119910440.0
  ], 
  [
   141810, 
   null, 
   "mae", 
   "Alan Ryan \" Why don't you go for the \"full monty\", and argue for a Socialist Republic of Scotland ? \"\n \n \n You might have unwittingly hit on something here.... you know what they say about those scottish kilts don't you ?", 
   {
    "post_info": {
     "post_title": "Quote :"
    }
   }, 
   141567, 
   null, 
   1119934380.0
  ], 
  [
   141815, 
   null, 
   "Winston Smith", 
   "Winston Smith - \"Have YOU read it\" ?\n \n \n \n Some parts of it.\n\n \n the dust cover?", 
   {}, 
   141720, 
   null, 
   1119935220.0
  ], 
  [
   141818, 
   null, 
   "mae", 
   "Winston Smith \"the dust cover ? \"\n \n \n \n Very funny. Didn't you know we don't have dust covers over here. Infact we don't even have covers over here. Did you even hear of this book ?", 
   {
    "post_info": {
     "post_title": "Quote:"
    }
   }, 
   141815, 
   null, 
   1119935760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Celtic Tiger", 
  "url": "http://www.4forums.com/political/european-politics-economics/5750-celtic-tiger.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 5750, 
  "discussion_files": [
   [
    "13212.html", 
    "http://www.4forums.com/political/european-politics-economics/5750-celtic-tiger-print.html"
   ], 
   [
    "13213.html", 
    "http://www.4forums.com/political/european-politics-economics/5750-celtic-tiger-3-print.html"
   ], 
   [
    "13214.html", 
    "http://www.4forums.com/political/european-politics-economics/5750-celtic-tiger-2-print.html"
   ]
  ], 
  "identifier": 5750
 }
]