[
 [
  [
   140306, 
   null, 
   "jim's trucking", 
   "Australian sugar will likely be more profitable in the near future as the sugar subsidies being severely decreased in EU countries will cause their sugar market to open up to more export.\n \n http://biz.yahoo.com/ap/050428/australia_wto_sugar_wars.html?.v=1", 
   {
    "post_info": {
     "post_title": "Australians going sweet on us!"
    }
   }, 
   null, 
   null, 
   1119545760.0
  ], 
  [
   140308, 
   null, 
   "Symbiote", 
   "It's a good thing it's gone, I don't know why you'd want to subsidise a sugar industry of all things, or understand why the sugar lobby has such power around the world.\n \n IIRC you still have large Tariffs on sugar in the US, dating back to the Hoover era, and they really destroyed Cuba's economy when they were implemented. Were it not for the sugar lobby, you might have avoided the whole missile crisis thing, and Castro's lengthy dictatorship.\n \n I must say though, I dislike the WTO and World Bank in principle, I think sometimes they do more harm than good, and may in the long run undermine the international trade they're currently trying to keep open.", 
   {}, 
   140306, 
   null, 
   1119546420.0
  ], 
  [
   140319, 
   null, 
   "georged", 
   "\n \n IIRC you still have large Tariffs on sugar in the US, dating back to the Hoover era, and they really destroyed Cuba's economy when they were implemented. Were it not for the sugar lobby, you might have avoided the whole missile crisis thing, and Castro's lengthy dictatorship.\n \n\n \n Still one of Florida's most powerful lobby groups and major destroyer of that state's fragile ecosystem.", 
   {}, 
   140308, 
   null, 
   1119548940.0
  ], 
  [
   140324, 
   null, 
   "Eddie", 
   "Nice! Hopefully we can get out of this pointless business of propping up our inefficient and pointless agricultural sector before this century is over.", 
   {}, 
   140319, 
   null, 
   1119549360.0
  ], 
  [
   140327, 
   null, 
   "wilted_laughter", 
   "Oh yes this is all over the news in Ireland. Irish farmers are having a canary that its the end of Ireland's sugar industry. And cereal too because of crop rotation.\n \n Nobody seems to have even thought of the question as to why exactly the EU should pay for an unsustainable industry as oppossed to farmers moving into something profitable.\n \n EDIT: Oh and its tied into something about sugar being one of Irelands few natural resources. :xbanghead", 
   {}, 
   140324, 
   null, 
   1119549720.0
  ], 
  [
   140337, 
   null, 
   "gamehuis", 
   "Nice! Hopefully we can get out of this pointless business of propping up our inefficient and pointless agricultural sector before this century is over.\n\n And let's hope that those French agricultural subsidies go away too.", 
   {}, 
   140324, 
   null, 
   1119550440.0
  ], 
  [
   140342, 
   null, 
   "wilted_laughter", 
   "And let's hope that those French agricultural subsidies go away too.\n\n \n We can only dream.", 
   {}, 
   140337, 
   null, 
   1119550560.0
  ], 
  [
   140359, 
   null, 
   "georged", 
   "And let's hope that those French agricultural subsidies go away too.\n\n \n The French can't hold a candle to politically insidious US subsidies. We still subsidize tobacco 'farmers' by issuing federal growing permits only to those who have historically grown it, creating a limited supply which controls market prices. While spending billions in public money advertising against smoking and medical research. \n \n Our most effective farm subsidy is still crop rotation. Farmers are paid to keep land fallow, effectively exercising market control by selective federal control over which crops will and won't be grown. For agribusiness, crop rotation is a direct margin improvement with no operating overhead. It doesn't get much sweeter than that.", 
   {}, 
   140337, 
   null, 
   1119551700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Australians going sweet on us!", 
  "url": "http://www.4forums.com/political/economic-advice/5753-australians-going-sweet-us.html", 
  "breadcrumbs": [
   "Economic Advice"
  ], 
  "id_number": 5753, 
  "discussion_files": [
   [
    "30185.html", 
    "http://www.4forums.com/political/economic-advice/5753-australians-going-sweet-us-print.html"
   ]
  ], 
  "identifier": 5753
 }
]