[
 [
  [
   141597, 
   null, 
   "Kronus", 
   "In a 5-4 ruling, the Supreme court ruled that framed copies of the 10 Commandments, displayed in Kentukey courthouses, violated the principle of seperation of church and state. The displays were ruled as being overtly religious, and therefore not permissable.\n \n http://news.yahoo.com/s/ap/20050627/ap_on_go_su_co/scotus_ten_commandments", 
   {
    "post_info": {
     "post_title": "No 10 Commandments in court"
    }
   }, 
   null, 
   null, 
   1119890520.0
  ], 
  [
   141605, 
   null, 
   "gamehuis", 
   "Yet courts and even president are sworn in by having their hand on the bible and saying the words \"so help me God\". emoticon_rolleyes \n \n Crazy XXX Supreme Court justices....*\n \n \n \n *See also my thread on another Supreme Court ruling regarding filesharing.", 
   {}, 
   141597, 
   null, 
   1119891900.0
  ], 
  [
   141643, 
   null, 
   "trebor", 
   "Yet courts and even president are sworn in by having their hand on the bible and saying the words \"so help me God\". emoticon_rolleyes \n \n Crazy XXX Supreme Court justices....*\n \n \n \n *See also my thread on another Supreme Court ruling regarding filesharing.\n\n \n A bible is not required. When I was sworn in at a court, there was no bible.", 
   {}, 
   141605, 
   null, 
   1119899340.0
  ], 
  [
   141657, 
   null, 
   "jitobear", 
   "A bible is not required. When I was sworn in at a court, there was no bible.\n\n \n God was not even mentioned when I went. I just had to swear to tell the truth and understand the penalties for not doing so.", 
   {}, 
   141643, 
   null, 
   1119900240.0
  ], 
  [
   141680, 
   null, 
   "Obvious Child", 
   "Yet courts and even president are sworn in by having their hand on the bible and saying the words \"so help me God\". emoticon_rolleyes \n \n Crazy XXX Supreme Court justices....*\n \nThe weird thing is, I would say 'crazy XXX president'. America was founded on religious tolerance but the head of state swears by a bible...", 
   {}, 
   141605, 
   null, 
   1119903840.0
  ], 
  [
   141686, 
   null, 
   "Jo Bennett", 
   "I does seem strange that here in the UK, where we have a state church, it is perfectly permissable to make a solemn affirmation (as it is called) instead of an oath ending \"so help me God\". In fact, given that the Bible forbids swearing by anything, and says that your word should be enough, Christians should surely choose the affirmation. As far as I am aware the US does not have a similar option.", 
   {}, 
   141680, 
   null, 
   1119905340.0
  ], 
  [
   141948, 
   null, 
   "Kronus", 
   "I does seem strange that here in the UK, where we have a state church, it is perfectly permissable to make a solemn affirmation (as it is called) instead of an oath ending \"so help me God\". In fact, given that the Bible forbids swearing by anything, and says that your word should be enough, Christians should surely choose the affirmation. As far as I am aware the US does not have a similar option.\n\n \n The US does have that option. Although it could be a state by state thing, I\"m not sure. In many courts if you don't want to swear on the Bible you can just raise your right hand.", 
   {}, 
   141686, 
   null, 
   1119978960.0
  ], 
  [
   141961, 
   null, 
   "Jo Bennett", 
   "I was more thinking of the president and justices, rather than jurors and witnesses. In the UK context I was thinking of MPs. The odd glitch with the UK system is that it is legally permissible to be an atheist MP, but not a republican. This is generally circumvented by keeping ones fingers crossed while taking the oath of allegiance if one is a republican.", 
   {}, 
   141948, 
   null, 
   1119981180.0
  ], 
  [
   142185, 
   null, 
   "Easyrider", 
   "The 10 Commandments are still permissible in courtrooms. They just have to be a part of an historical display rather than being set apart separately as a religious statement. That's why Moses giving the 10 C's is still going to stay in the Supreme Court.", 
   {}, 
   141961, 
   null, 
   1120003980.0
  ], 
  [
   142389, 
   null, 
   "zachvac", 
   "The 10 Commandments are still permissible in courtrooms. They just have to be a part of an historical display rather than being set apart separately as a religious statement. That's why Moses giving the 10 C's is still going to stay in the Supreme Court.\n\n \n I thought this was a stupid ruling. The ten commandments are not history, they are mythology. That said, I really have no problem with them displayed along with other religious symbols like in the historical display. They are mythology just like the Greek gods and Native American nature gods. Most people would have no problem with a winged horse for decoration but that is a religious symbol. I think the ruling was sort of right but for the wrong reason. The ten commandments are not history.", 
   {}, 
   142185, 
   null, 
   1120028700.0
  ], 
  [
   142727, 
   null, 
   "Easyrider", 
   "I thought this was a stupid ruling. The ten commandments are not history, they are mythology..... They are mythology just like the Greek gods and Native American nature gods.\n\n \n That is the myth (that the 10 C's are a myth).", 
   {}, 
   142389, 
   null, 
   1120090980.0
  ], 
  [
   142741, 
   null, 
   "Raastee", 
   "In a 5-4 ruling, the Supreme court ruled that framed copies of the 10 Commandments, displayed in Kentukey courthouses, violated the principle of seperation of church and state. The displays were ruled as being overtly religious, and therefore not permissable.\n \n http://news.yahoo.com/s/ap/20050627/ap_on_go_su_co/scotus_ten_commandments\n\n yeah...we are back on the right track....", 
   {}, 
   141597, 
   null, 
   1120092660.0
  ], 
  [
   142772, 
   null, 
   "gnojek", 
   "You don't have to put your hand on a Bible. You can put it on a Koran or whatever your book of faith is, unless I am totally misinformed.\n \n But the whole time, whether you are an athiest or not, there it is right over the judge's head (in higher courts, not in something like traffic court) the words \"In God We Trust.\" This means the \"we\" as in the court, \"trusts\" or has faith in God. They aren't specific to which God, but they are specific that there is only one.\n \n But this is a statement that the government has faith in God.\n \n So here's the deal.\n \n Even though it doesn't explicitly say that there is a separation of church and state in the constitution, the concept is a foundation to American principles of democracy.\n \n But here's the catch.\n \n We all say \"seperation of church and state\" but what does this mean?\n It doesn't mean \"seperation of state and faith.\"\n \n Look, I don't think there should be any mixing of religion and the state whatsoever, but if the right-wing loonies that want to dress up all our government buildings with religious symbols want to win this thing, they need to start with a cute little sound byte:\n \n \"Seperation of church and state does not mean the seperation of faith and state.\"\n \n There is a difference between \"church\" and \"faith.\"\n \n Congress would be making no law establishing a religion if an architect designed the new Capitol building in the shape of the star of david. They wouldn't be violating the 1st ammendment if they wrote the teachings of Mohammed on a plaque in the Oval Office. \n \n And since there's no particular church involved, only a general religion or \"faith\" then there would be no church to be seperated from the state.", 
   {}, 
   142741, 
   null, 
   1120096080.0
  ], 
  [
   143627, 
   null, 
   "maximus", 
   "Here is a relevant article to the thread. Amazing what the court allows and doesn't allow to be funded and sponsored by our government:\n \n http://www.townhall.com/columnists/anncoulter/ac20050629.shtml", 
   {}, 
   142772, 
   null, 
   1120246320.0
  ], 
  [
   143638, 
   null, 
   "Kronus", 
   "Here is a relevant article to the thread. Amazing what the court allows and doesn't allow to be funded and sponsored by our government:\n \n http://www.townhall.com/columnists/anncoulter/ac20050629.shtml\n\n \n When did Ann Coulter become relevant to anything? Don't you need some grounding in reality to be relevant?", 
   {}, 
   143627, 
   null, 
   1120248180.0
  ], 
  [
   143789, 
   null, 
   "maximus", 
   "When did Ann Coulter become relevant to anything? Don't you need some grounding in reality to be relevant?\n\n That's exactly what the article is about<b></b>: reality. She brought a real, balanced perspective of what the Court is doing and about what Free Speech and government funding in the public arena are about these days. Religion is in the limelight of the press, the distortion of art and decency she mentioned seems to have been missed to a certain degree.", 
   {}, 
   143638, 
   null, 
   1120275900.0
  ], 
  [
   143811, 
   null, 
   "zachvac", 
   "That is the myth (that the 10 C's are a myth).\n\n \n \n Until sufficient evidence is presented, the ten commandments are as much myth as any creation story every thought up by the native Americans, or any other relilgious group. Myth is defined as:\n \n \"A traditional, typically ancient story dealing with supernatural beings, ancestors, or heroes that serves as a fundamental type in the worldview of a people, as by explaining aspects of the natural world or delineating the psychology, customs, or ideals of society: the myth of Eros and Psyche; a creation myth. \n \n Such stories considered as a group: the realm of myth. \n A popular belief or story that has become associated with a person, institution, or occurrence, especially one considered to illustrate a cultural ideal: a star whose fame turned her into a myth; the pioneer myth of suburbia. \n \n A fiction or half-truth, especially one that forms part of an ideology. \n \n A fictitious story, person, or thing: \"German artillery superiority on the Western Front was a myth\" (Leon Wolff). \"\n \n \n This most definately goes with the first definition, even if it is true. But it also cannot be called history unless there is sufficient evidence that it happened. As of now it is a myth that must be dealt with by faith, not history.", 
   {
    "unicode_changes_made": true
   }, 
   142727, 
   null, 
   1120282920.0
  ], 
  [
   143830, 
   null, 
   "Kronus", 
   "That's exactly what the article is about<b></b>: reality. She brought a real, balanced perspective of what the Court is doing and about what Free Speech and government funding in the public arena are about these days. Religion is in the limelight of the press, the distortion of art and decency she mentioned seems to have been missed to a certain degree.\n\n \n A real, balanced perspective? The perspective of someone itching to take out the NEA is more like it. She somehow thinks that free speach and seperation of church and state are some how the same issue, which of course is ludicrous. She takes a bunch of quotes, most out of context, and a bunch of biased descriptions of art, and then makes the logical leap (7 league boots kind of leap) that because government money was somehow involoved, the government should be allowed to put up religious displays. \n \n If one believes that government money should not be used to promote certain ideas, that case could be argued. And it would have absolutely nothing to do with seperation of curch and state.\n \n Note the claims she makes:\n 10 commandment displays aren't allowed becasue they're offensive. Wrong!\n The states are allowed to establish a religion. Wrong!\n Sureme Court want's to take \"under God\" out of Pledge. Wrong!\n \n The editiorial is a pack of lies and distortions. Coulter is the poster child for the neo-cons philospohy: \"Ethics are for the other guy, just do what it takes to get the job done.\"", 
   {}, 
   143789, 
   null, 
   1120313880.0
  ], 
  [
   144040, 
   null, 
   "jitobear", 
   "Coulter is a tediously stupid and hateful woman - but not as bad as Dr. Laura. She is the one woman on this planet I would love to bitch-slap. I know that is wrong, and I would not do it - but one can dream.....", 
   {}, 
   143830, 
   null, 
   1120407840.0
  ], 
  [
   144430, 
   null, 
   "Easyrider", 
   "Coulter isn't have as bad as Barbara Boxer, Nancy Pelosi, or some of the other mouthy women liberals from the far left.", 
   {}, 
   144040, 
   null, 
   1120508880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  No 10 Commandments in court", 
  "url": "http://www.4forums.com/political/religion-debates/5795-no-10-commandments-court.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 5795, 
  "discussion_files": [
   [
    "20300.html", 
    "http://www.4forums.com/political/religion-debates/5795-no-10-commandments-court-print.html"
   ], 
   [
    "20301.html", 
    "http://www.4forums.com/political/religion-debates/5795-no-10-commandments-court-2-print.html"
   ]
  ], 
  "identifier": 5795
 }
]