[
 [
  [
   142059, 
   null, 
   "gamehuis", 
   "http://www.freestarmedia.com/hotellostliberty2.html\n \n Is this a case of cosmic justice? :p", 
   {
    "post_info": {
     "post_title": "Eminent domain ruling to bite a Supreme Court Justice in his ass?"
    }
   }, 
   null, 
   null, 
   1119992340.0
  ], 
  [
   142098, 
   null, 
   "RedMoon", 
   "It smells like satire to me, but if it's true, someone send them a cigar, this is beautiful!", 
   {}, 
   142059, 
   null, 
   1119996540.0
  ], 
  [
   142153, 
   null, 
   "Steeeeve", 
   "It won't happen but funny.\n \n I still don't understand why the liberals here are upset about the ruling. They never seem to be upset about any other \"living constitution\" rulings.", 
   {}, 
   142098, 
   null, 
   1120001760.0
  ], 
  [
   142414, 
   null, 
   "gamehuis", 
   "It won't happen but funny.\n \n I still don't understand why the liberals here are upset about the ruling. They never seem to be upset about any other \"living constitution\" rulings.\n\n I may come as a shock to you, but some people don't give a rats XXX about the scrap of paper you call the constitution, so those \"living constitution\" rulings are equally not of interest.\n \n The US is not the world, although many Americans view it that way.", 
   {}, 
   142153, 
   null, 
   1120038540.0
  ], 
  [
   142504, 
   null, 
   "SymonTemplar", 
   "If the US is not the world, why comment on it so much?", 
   {}, 
   142414, 
   null, 
   1120063260.0
  ], 
  [
   142509, 
   null, 
   "gamehuis", 
   "If the US is not the world, why comment on it so much?\n\n Because you're in everybodies face and people don't like that.\n Look at China for example, they're basically a dictatorial regime but because they're not in everybodies face (except Taiwans), people don't mind them and as such don't comment on them.", 
   {}, 
   142504, 
   null, 
   1120063740.0
  ], 
  [
   142704, 
   null, 
   "Steeeeve", 
   "I may come as a shock to you, but some people don't give a rats XXX about the scrap of paper you call the constitution, so those \"living constitution\" rulings are equally not of interest.\n \n The US is not the world, although many Americans view it that way.\n\n \n Are we not talking about the Eminent doman ruling by the Supreme Court IN THE UNITED STATES???? Nevertheless, you are right, many Americans, including some on the Supreme Court, do not care about the constitution...However, they should. And thus the \"living constitution\"", 
   {}, 
   142414, 
   null, 
   1120089120.0
  ], 
  [
   142751, 
   null, 
   "gnojek", 
   "Because you're in everybodies face and people don't like that.\n Look at China for example, they're basically a dictatorial regime but because they're not in everybodies face (except Taiwans), people don't mind them and as such don't comment on them.\n\n Their pollution is in our face.\n http://www.energybulletin.net/1252.html\n \n \nThe World Bank, however, estimates 400,000 people in China die each year from air pollution-related illnesses, mainly lung and heart diseases.\n \n Neighbouring countries, especially South Korea and Japan, as well as Hong Kong are also suffering.\n \n International experts estimate as much as 40 percent of the air pollution in Japan and South Korea originates from China, said Dan Millison, a Manila-based environment and energy specialist for the Asian Development Bank.\n\n \n Some of it is even spreading overseas to Canada and the US.\n \n \n Anyway, I hope it's not a joke.\n I hope they tear down his house and put up the museum/hotel.\n They might over turn the ruling.", 
   {}, 
   142509, 
   null, 
   1120093680.0
  ], 
  [
   142770, 
   null, 
   "georged", 
   "Are we not talking about the Eminent doman ruling by the Supreme Court IN THE UNITED STATES???? Nevertheless, you are right, many Americans, including some on the Supreme Court, do not care about the constitution...However, they should. And thus the \"living constitution\"\n\n \n As you age, you'll discover survival instincts which have everything to do with avoiding constitutional issues, SCOTUS, political fights and all matters of higher authority (political) unless you know you're on the winning side. If you expose yourself in an antagonistic manner to the whims of power, which are money and political clout, you'll always come out second best. Unless, of course, you enjoy a good fight and have nothing to lose, generally a strong sign of idealism and/or youth. If a member of SCOTUS wasn't aware of a development personally affecting him/her, I'd be very, very surprised.", 
   {}, 
   142704, 
   null, 
   1120095660.0
  ], 
  [
   142822, 
   null, 
   "Steeeeve", 
   "As you age, you'll discover survival instincts which have everything to do with avoiding constitutional issues, SCOTUS, political fights and all matters of higher authority (political) unless you know you're on the winning side. If you expose yourself in an antagonistic manner to the whims of power, which are money and political clout, you'll always come out second best. Unless, of course, you enjoy a good fight and have nothing to lose, generally a strong sign of idealism and/or youth. If a member of SCOTUS wasn't aware of a development personally affecting him/her, I'd be very, very surprised.\n\n What on earth are you talking about?", 
   {}, 
   142770, 
   null, 
   1120103520.0
  ], 
  [
   142865, 
   null, 
   "zachvac", 
   "It won't happen but funny.\n \n I still don't understand why the liberals here are upset about the ruling. They never seem to be upset about any other \"living constitution\" rulings.\n\n \n \n The Constitutin isn't written in absolutes. In this case the Constitution says that the government can seize property if they give compensation for it. It doesn't say anything about what they use for it, so this is not a case of a living Constitution. If it went the other way you could also argue that it was a living Constitution since the Constitution says the gov't can seize property but this is against that thus changing the Constitution. Interpretations are different than changes.\n \n But I still disaggree with the ruling. The spirit of the law wasn't to let the government give the property to big businesses, it was to use to benefit the general public with a service, not giving or selling land to a business.", 
   {}, 
   142153, 
   null, 
   1120107840.0
  ], 
  [
   142868, 
   null, 
   "Steeeeve", 
   "The Constitutin isn't written in absolutes. In this case the Constitution says that the government can seize property if they give compensation for it. It doesn't say anything about what they use for it, so this is not a case of a living Constitution. If it went the other way you could also argue that it was a living Constitution since the Constitution says the gov't can seize property but this is against that thus changing the Constitution. Interpretations are different than changes.\n \n But I still disaggree with the ruling. The spirit of the law wasn't to let the government give the property to big businesses, it was to use to benefit the general public with a service, not giving or selling land to a business.\n\n \n Ok, YOU think the spirit of the law wasn't to let the government give the property away...I actually agree with this. But this is actually an idea of a \"dead\" constitution where only the intentions of the document are used..for example cruel punishment means what it mean't when adopted by the people and has no business changing without the policy makers doing so (see rupert case 2005 slip opinions www.supremecourtus.gov). So when it comes to the amendment for eminent domain you would think we would use the intent of the adopted amendment....which was you can take land for schools and roads and what not...anything for total public use...in fact, it has been used for building stadiums too (which is sketchy). Anyway, the living constitution doesn't allow for this. The living constitution means we can bend the idea what the intention of the amendment is. With a living constitution you really can't say the judges made the wrong conlusion at all because they can't....it means whatever the judge wants it to mean. Sadly, this is the truth about the living constitution. This is why I don't believe in it. It creates cases like this which are clearly wrong and yet no one can do a thing about it. Maybe people will wake up to this wrong idea of our government", 
   {}, 
   142865, 
   null, 
   1120108440.0
  ], 
  [
   142903, 
   null, 
   "SymonTemplar", 
   "Because you're in everybodies face and people don't like that.\n Look at China for example, they're basically a dictatorial regime but because they're not in everybodies face (except Taiwans), people don't mind them and as such don't comment on them.\n\n \n Which only shows the hypocirisy and stupidity of those with that attitude.", 
   {}, 
   142509, 
   null, 
   1120115400.0
  ], 
  [
   142929, 
   null, 
   "gamehuis", 
   "Their pollution is in our face.\n http://www.energybulletin.net/1252.html\n \n \n \n Some of it is even spreading overseas to Canada and the US.\n\n Meh, here in Holland the only pollution that's in our face is coming from the Germans. Thanks to them the south of Holland is one of the three most airpolluted areas in the world.", 
   {}, 
   142751, 
   null, 
   1120125660.0
  ], 
  [
   142930, 
   null, 
   "gamehuis", 
   "Which only shows the hypocirisy and stupidity of those with that attitude.\n\n Why is it hypocritical? They're not in our face, so we don't comment on them, simple really.\n It works like that for everybody. For example, Zimbabwe is not in the face of the US, so nobody there comments on it.", 
   {}, 
   142903, 
   null, 
   1120125780.0
  ], 
  [
   142936, 
   null, 
   "SymonTemplar", 
   "Why is it hypocritical? They're not in our face, so we don't comment on them, simple really.\n It works like that for everybody. For example, Zimbabwe is not in the face of the US, so nobody there comments on it.\n\n \n It is hypocritical to whine about one country \"being in someone's face\" and saying China isn't, when in point of fact China has intervened everywhere China has chosen to. They took Tibet, they regularly intimidate Taiwan, they violate Japanese territorial waters, they stall actions against the likes of Sudan and the Darfur mess, but they aren't in anyone's face? The Tibetans, Taiwanese, Japanese, South Koreans, Philipines, Indians, would probably all beg to differ with your assessment.", 
   {}, 
   142930, 
   null, 
   1120126920.0
  ], 
  [
   142950, 
   null, 
   "gamehuis", 
   "It is hypocritical to whine about one country \"being in someone's face\" and saying China isn't, when in point of fact China has intervened everywhere China has chosen to. They took Tibet, they regularly intimidate Taiwan, they violate Japanese territorial waters, they stall actions against the likes of Sudan and the Darfur mess, but they aren't in anyone's face? The Tibetans, Taiwanese, Japanese, South Koreans, Philipines, Indians, would probably all beg to differ with your assessment.\n\n It's not hypocritical, it's called human nature. People whine about the things that are in their face first and not the other things.\n So the US whines about France but not Japan, Europe whines about the US but not China, China whines about Taiwan but not Zimbabwe, Japan whines about China but not the US etc.\n Everybody has a different agenda, and part of that agenda has to do with the things that are in ones face.", 
   {}, 
   142936, 
   null, 
   1120135140.0
  ], 
  [
   143054, 
   null, 
   "SymonTemplar", 
   "Just because it is human nature doesn't mean it isn't hypocritical, in fact hypocirisy is probably intimantly part of human nature. The fact that you have this issue because America is 'in your face' only leads me to the conclusion that your innate prejudice agaisnt it is even more irrational.", 
   {}, 
   142950, 
   null, 
   1120152780.0
  ], 
  [
   143626, 
   null, 
   "RedMoon", 
   "Looks like Congress isn't too keen on this decision either and is doing something about it:\n \n http://www.washingtonpost.com/wp-dyn/content/article/2005/06/30/AR2005063001082.html\n \n \nHouse Votes To Undercut High Court On Property\n Federal Funds Tied To Eminent Domain\n \n By Mike Allen and Charles Babington\n Washington Post Staff Writers\n Friday, July 1, 2005; A01\n \n The House voted yesterday to use the spending power of Congress to undermine a Supreme Court ruling allowing local governments to force the sale of private property for economic development purposes. Key members of the House and Senate vowed to take even broader steps soon.\n \n Last week's 5 to 4 decision has drawn a swift and visceral backlash from an unusual coalition of conservatives concerned about property rights and liberals worried about the effect on poor people, whose property is often vulnerable to condemnation because it does not generate a lot of revenue.\n \n The House measure, which passed 231 to 189, would deny federal funds to any city or state project that used eminent domain to force people to sell their property to make way for a profit-making project such as a hotel or mall. Historically, eminent domain has been used mainly for public purposes such as highways or airports.\n \n The measure, an amendment to an appropriations bill, would apply to funds administered by the departments of Transportation, Treasury, and Housing and Urban Development. House Majority Leader Tom DeLay (R-Tex.) and Majority Whip Roy Blunt (R-Mo.) said they will push for a more inclusive measure that would apply to all federal funds.\n \n A fact sheet said under the bill the locality or state would \"lose any federal funds that would contribute in any way to the project the property would be taken for.\"\n \n The vote marks the latest of several congressional moves to curb a judiciary that some lawmakers consider out of touch with average Americans. It came as conservative groups attacked a month-old bipartisan deal that ended Senate filibusters of several appellate court nominees and as some legislators anxiously watched for a possible Supreme Court retirement.\n \n Activists said the 5 to 4 ruling will be a centerpiece of their efforts to motivate conservatives and libertarians for a confirmation fight after a vacancy opens on the court. \"It's so bad, it's good,\" said Sean Rushton, executive director of the Committee for Justice, which works closely with the White House.\n \n DeLay called it \"a horrible decision\" and said lawmakers' intervention is part of an effort to \"assert the responsibility and the authority of the Congress to be a check on the judiciary.\"\n \n \"This Congress is not going to just sit by -- idly sit by -- and let an unaccountable judiciary make these kinds of decisions without taking our responsibility and our duty given to us by the Constitution to be a check on the judiciary,\" he said during a rare appearance in the House Radio-Television Gallery.\n \n Sen. John Cornyn (R-Tex.) introduced a similar measure and immediately drew a Democratic co-sponsor, Sen. Bill Nelson (Fla.), as well as Sen. Rick Santorum (R-Pa.), who is number three in his party's leadership. The House bill is sponsored by Judiciary Committee Chairman F. James Sensenbrenner Jr. (R-Wis.). Its Democratic co-sponsors include Reps. John Conyers Jr. (Mich.), Maxine Waters (Calif.) and Peter A. DeFazio (Ore.).\n \n The conservative Family Research Council sent an e-mail urging followers to contact their lawmakers to support the legislation. The council said the decision \"strips the rights of private citizens by granting the government power to seize your home and transfer it to a private developer.\"\n \n House Minority Leader Nancy Pelosi (D-Calif.) criticized the measure. \"When you withhold funds from enforcing a decision of the Supreme Court, you are in fact nullifying a decision of the Supreme Court,\" she told reporters. \"This is in violation of the respect of separation of powers in our Constitution.\"\n \n Sensenbrenner said last week's decision, Kelo v. City of New London , \"has the potential of becoming the Dred Scott decision of the 21st century.\" He was referring to the 1857 ruling that affirmed slaves as private property, even when they had escaped to non-slave states.\n \n Rhetoric was just as sharp at a gathering here of conservative activists urging the Senate to confirm U.S. appellate court nominee Henry W. Saad of Michigan. Victoria Toensing of the Committee for Justice accused Sen. Carl M. Levin (D-Mich.) of waging \"a vendetta\" against Saad, noting that the nominee is Arab American, as is his advocate, former senator Spencer Abraham (R-Mich.). Asked if she was suggesting that Levin's being Jewish had a role in his actions, Toensing replied: \"I don't know. I know these are two Arab Americans, and you'll have to ask that of Senator Levin.\" Levin had no immediate response.\n \n The Supreme Court ruling allows local governments to force property owners to sell and make way for private economic development when government officials decide it would benefit the public, even if the property is not blighted and the new project's success is not guaranteed. The ruling greatly broadened the types of projects for which the government may seize property to include not only bridges and highways but also slum clearance and land redistribution.\n \n Opponents say property owners should not be forced to sell to make way for private commercial projects.\n \n House Speaker J. Dennis Hastert (R-Ill.) praised the amendment, introduced by Rep. Scott Garrett (R-N.J.), as \"an important first step\" and said he is \"extremely disappointed and surprised that the House Democratic leadership voted against this amendment.\"\n \n Sensenbrenner said at the news conference with DeLay that federal money \"will not be used to finance taking somebody's property from them to build a strip mall or a hotel or something simply because more tax revenue will come in as a result of an improvement.\" He said the decision \"shows that the majority of the court had an utter disrespect for private property.\"\n \n Blunt said, \"Lots of members are hearing from the people they work for that this is an unacceptable intrusion.\"\n \n In the roll call on the House amendment, 192 Republicans voted for and 31 against, with 39 Democrats voting for and 157 against. The lone independent, Rep. Bernie Sanders (Vt.), voted against. Maryland and Virginia lawmakers voted with their parties except Rep. C.A. Dutch Ruppersberger (D-Md.), who voted in favor, and Reps. Frank R. Wolf (R-Va.) and Thomas M. Davis III (R-Va.), who voted against.\n", 
   {}, 
   143054, 
   null, 
   1120246140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Eminent domain ruling to bite a Supreme Court Justice in his ass?", 
  "url": "http://www.4forums.com/political/current-events-debates/5813-eminent-domain-ruling-bite-supreme-court-justice-his-ass.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 5813, 
  "discussion_files": [
   [
    "15848.html", 
    "http://www.4forums.com/political/current-events-debates/5813-eminent-domain-ruling-bite-supreme-court-justice-his-ass-print.html"
   ], 
   [
    "15849.html", 
    "http://www.4forums.com/political/current-events-debates/5813-eminent-domain-ruling-bite-supreme-court-justice-his-ass-2-print.html"
   ]
  ], 
  "identifier": 5813
 }
]