[
 [
  [
   142105, 
   null, 
   "Beowulf Lee", 
   "I didn't read the whole thing, but its a definite read for creationists. Don't know if anyone else posted it before.\n \n http://www.chem1.com/acad/sci/pseudosci.html", 
   {
    "post_info": {
     "post_title": "Well..."
    }
   }, 
   null, 
   null, 
   1119997560.0
  ], 
  [
   142225, 
   null, 
   "gnojek", 
   "Just to add an opinion I think it's really interesting.\n The story of Blonlot and N-Rays linked to is very interesting.", 
   {}, 
   142105, 
   null, 
   1120006560.0
  ], 
  [
   142234, 
   null, 
   "canadianman77", 
   "I saw two things on this link that are hogwash and shows that this person doesnt do there homework and therefore is a hypocrit. First is the fact that Ivory soap is pure. just because a substance is airrated doesnt make it less pure. and secondly there is a book shown on the page about homeopathic medicine that is thrown in with a bunch of fortune telling books, and homeopathic medicine is accepted as an alternative medicine, and has been proven to work.", 
   {}, 
   142225, 
   null, 
   1120007340.0
  ], 
  [
   142236, 
   null, 
   "gnojek", 
   " First is the fact that Ivory soap is pure. just because a substance is airrated doesnt make it less pure. \n\n What's your definition of pure?\n \n \nand secondly there is a book shown on the page about homeopathic medicine that is thrown in with a bunch of fortune telling books, and homeopathic medicine is accepted as an alternative medicine, and has been proven to work.\n\n Has it?\n \n This says different: http://skepdic.com/homeo.html\n \n I do know of recent studies that show that minute amounts of toxic substances are beneficial and therapeutic. I don't know if one can consider this homeopathic medicine though.\n \n I guess I don't know what's being called homeopathic medicine these days.\n If someone comes up with something that works can they just call it homeopathic medicine and say that homeopathic medicine works?", 
   {}, 
   142234, 
   null, 
   1120008000.0
  ], 
  [
   143496, 
   null, 
   "canadianman77", 
   "What's your definition of pure?\n \n \n Has it?\n \n This says different: http://skepdic.com/homeo.html\n \n I do know of recent studies that show that minute amounts of toxic substances are beneficial and therapeutic. I don't know if one can consider this homeopathic medicine though.\n \n I guess I don't know what's being called homeopathic medicine these days.\n If someone comes up with something that works can they just call it homeopathic medicine and say that homeopathic medicine works?\n Because of your question \" What is your definition of pure\", I now know how to make soap. I'll never stink again!!! And I think homeopathic medicine is all about using things like vitamin c to prevent colds, and making sure you ingest lots of calcium if you are worried about ostioperosis. Ya know stuff that makes sense.", 
   {}, 
   142236, 
   null, 
   1120224660.0
  ], 
  [
   143498, 
   null, 
   "canadianman77", 
   "Ok I just looked up homeopathy and do I ever feel stupid! But I still think that Ivory soap is pure! Thats my story, and I'm stickin to it!", 
   {}, 
   143496, 
   null, 
   1120225080.0
  ], 
  [
   143499, 
   null, 
   "Clive14", 
   "Ok I just looked up homeopathy and do I ever feel stupid!\nHey, it happens to all of us from time to time. Having the courage to stand up and say \"I goofed\" though sets you apart form the masses.", 
   {}, 
   143498, 
   null, 
   1120225320.0
  ], 
  [
   143577, 
   null, 
   "Symbiote", 
   "Nevertheless, homeopathy may still work, in the same way that any placebo works. I believe illness is psychological to a greater extent than modern medicine would have us believe.", 
   {}, 
   143499, 
   null, 
   1120240320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Well...", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5816-well.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 5816, 
  "discussion_files": [
   [
    "24551.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5816-well-print.html"
   ]
  ], 
  "identifier": 5816
 }
]