[
 [
  [
   142441, 
   null, 
   "Iuris", 
   "http://www.revisionism.nl/Moon/\n \n As proven by this site, there is no moon! With pictures! It's all just a hoax. Now, see the startling similarity between the moon hoax and the evolution conspiracy? How can you still believe in evolution after reading this?\n \n \n Really, the reasonong on the site certainly resembles the reasonong od of one side in another long going debate, doesn't it? emoticon_xclown", 
   {
    "post_info": {
     "post_title": "There is no moon! -&gt; Evolution is a hoax!"
    }
   }, 
   null, 
   null, 
   1120050840.0
  ], 
  [
   142449, 
   null, 
   "Clive14", 
   "http://www.revisionism.nl/Moon/\nBoo, webblocker blocks my access to this website. Now I'll never know about the moon fraud :(", 
   {}, 
   142441, 
   null, 
   1120054140.0
  ], 
  [
   142467, 
   null, 
   "Wez", 
   "LMAO. That's classic!\n \n \nYou can see it. But think about it - without the help of so-called \"experts\", how do you really know what you're looking at? It could be a hologram, projected from various government installations throughout the world. It could be a large, crudely painted balloon, held in place by helium and propelled by tiny sails and rudders (which is why it moves across the sky so slowly). Or, most likely, it could have been different things at different times and different places, depending on the technology available to the conspirators and the culture and beliefs of the population being deceived.\n \n The hoax could easily have been imposed on a gullible world at many points in human history. Perhaps it began as a collective hallucination or a religious myth, or perhaps an especially bright star that came to be exaggerated over time. However the moon story started, early proponents of the hoax were swift to recognize how it could be exploited for their benefit, and shrewdly devised a scheme to use it to their advantage.\n \n They began to spread rumors, falsify scientific observations, and invent new gods to represent this fictional celestial body. They ingeniously concocted the idea of \"cycles of the moon\", and as their resources increased, were able to create the illusion that this object in the sky actually went through such changes. To make their hoax more plausible to early, superstitious societies, they arranged for these cycles to coincide with the months of the year. \n\n I can't help but think it's a Mick-take. Then again, I originally thought Jack Chick was a Mick-take.:(\n \n -Wez", 
   {
    "unicode_changes_made": true
   }, 
   142449, 
   null, 
   1120056300.0
  ], 
  [
   142472, 
   null, 
   "Iuris", 
   "I'm 66% certain it's a Mick-take.\n \n And I'm 51% certain that a Mick-take is a kind of straw-man that illustrates a point by appearing to be a ridiculous counter-argument to the point...", 
   {}, 
   142467, 
   null, 
   1120058220.0
  ], 
  [
   142912, 
   null, 
   "canadianman77", 
   "I'm 66% certain it's a Mick-take.\n \n And I'm 51% certain that a Mick-take is a kind of straw-man that illustrates a point by appearing to be a ridiculous counter-argument to the point...\n\n So you're sayin that you are 34% sure that it is'nt a mick-take, and 49% certain that a mick-take isnt a kind of straw-man that illustrates a point by appearing to be a rediculous counter-argument to the point. Hmmm, this means that no matter how you look at it, you are 100% sure that this is a mick-take, wich is a straw man that illustrates a point by appearing to be a rediculous counter argument. Sounds like you think its 100% ********. lmao", 
   {}, 
   142472, 
   null, 
   1120118160.0
  ], 
  [
   143110, 
   null, 
   "Beowulf Lee", 
   "I'm pretty sure this is a joke.", 
   {}, 
   142912, 
   null, 
   1120165740.0
  ], 
  [
   143157, 
   null, 
   "RedMoon", 
   "Does that mean...I'm a hoax? emoticon_cry", 
   {}, 
   143110, 
   null, 
   1120169580.0
  ], 
  [
   143167, 
   null, 
   "pandion", 
   "I'm pretty sure this is a joke.\n\n Well, there is this at the bottom of the page.\n \nDISCLAIMER: All editorial content on this website is strictly not the writer's/author's opinion. THE MAD REVISIONIST, located on the moon, is owned and operated by accident. The content of this page is the copyrighted property of THE MAD REVISIONIST. Any illegal copying or circulating of this page, in whole or in part, without the expressed permission of THE MAD REVISIONIST will be taken as a compliment. And no, we're not really offering $100,000. What are you, crazy?\n", 
   {
    "unicode_changes_made": true
   }, 
   143110, 
   null, 
   1120169940.0
  ], 
  [
   143471, 
   null, 
   "Iuris", 
   "Pulling statistics on me, eh? You know, we should make an Unbreakables parody for these things...\n \n I did actually miss the disclaimer, but I was quite convinced that it was a comedy page. Only a complete idiot would believe the page. Still, we do have creationists, so absolute certainity is impossible...", 
   {}, 
   143167, 
   null, 
   1120214700.0
  ], 
  [
   143489, 
   null, 
   "canadianman77", 
   "Pulling statistics on me, eh? You know, we should make an Unbreakables parody for these things...\n \n I did actually miss the disclaimer, but I was quite convinced that it was a comedy page. Only a complete idiot would believe the page. Still, we do have creationists, so absolute certainity is impossible...\n\n Cm'on of course there is a moon! Where do you think all of the cheese comes from! Lmao! And take it easy on the creationist cracks eh.", 
   {}, 
   143471, 
   null, 
   1120221060.0
  ], 
  [
   144697, 
   null, 
   "unkerpaulie", 
   "i love the explanation about the tides! that really did it for me :D\n \n why is this XXXX here? and what the heck does this have to do with evolution?", 
   {}, 
   143489, 
   null, 
   1120580340.0
  ], 
  [
   144981, 
   null, 
   "canadianman77", 
   "i love the explanation about the tides! that really did it for me :D\n \n why is this XXXX here? and what the heck does this have to do with evolution?\n\n This XXXX is here because of the degenerate nature of the evolution of mankind. This thread just shows an accelerated model of the evolution of the human species. WERE DOOMED!!!!", 
   {}, 
   144697, 
   null, 
   1120625340.0
  ], 
  [
   144985, 
   null, 
   "zachvac", 
   "Well it's kind of funny because he starts out by saying there should be no biases and to approach it from an objective manner. Then he starts assuming that the government is sending a holographic image of the moon into the sky :)", 
   {}, 
   144981, 
   null, 
   1120628100.0
  ], 
  [
   144986, 
   null, 
   "zachvac", 
   "Actually that seems like a creationist argument. \"Evolution hasn't been tested, you need to prove it objectively\". A few bible passages later, they think they have an argument.", 
   {}, 
   144985, 
   null, 
   1120628160.0
  ], 
  [
   147832, 
   null, 
   "GuyWithNoBrain", 
   "emoticon_mad hey i'm suppose to be the guy with no brain, he stole my theory. he probably stole while i was asleep in my bed. why did i take my tin foil hat...i mean helmet off emoticon_frazzled \n \n well anyway this article was atleas to say very interesting. :) lmao", 
   {}, 
   144986, 
   null, 
   1121543700.0
  ], 
  [
   147841, 
   null, 
   "PoohBear", 
   "you guys are all looney if you believe that", 
   {}, 
   147832, 
   null, 
   1121544780.0
  ], 
  [
   149271, 
   null, 
   "Jacques", 
   "nice pun! Looney....... moon :)", 
   {}, 
   147841, 
   null, 
   1121976540.0
  ], 
  [
   154260, 
   null, 
   "PoohBear", 
   "well i cant believe the moon part but i sure can believe the second part.. yet another one who speaks the truth!!!", 
   {}, 
   149271, 
   null, 
   1123731300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  There is no moon! -> Evolution is a hoax!", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5823-there-no-moon-evolution-hoax.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 5823, 
  "discussion_files": [
   [
    "11202.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5823-there-no-moon-evolution-hoax-print.html"
   ], 
   [
    "11203.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5823-there-no-moon-evolution-hoax-2-print.html"
   ]
  ], 
  "identifier": 5823
 }
]