[
 [
  [
   143034, 
   null, 
   "Waxy", 
   "U.S. mad cow case was Texas-born   \n Last Updated Wed, 29 Jun 2005 21:09:40 EDT \n CBC News </news/credit.html< \n American officials say the second case of bovine spongiform encephalopathy (BSE), or mad cow disease, in the U.S. was a cow born, raised and slaughtered in Texas. \n \n The U.S. Department of Agriculture confirmed the diagnosis on Friday but had to wait for DNA analysis to confirm the cow's origin. \n \n The USDA says the cow was killed at a pet food plant after it was determined to be unfit for human consumption. \n \"The testing and traceback efforts may yield further information as to how this animal became infected,\" said USDA chief veterinarian John Clifford in a statement on the department's website. \n \n \"The safety of our food supply is not in question ... American beef is among the safest in the world.\" \n \n Officials say the 12-year-old cow couldn't stand on its own feet. \n At its age, the cow could have have contracted the disease before a regulation was introduced banning feed that included animal parts. \n \n The U.S. banned using cattle parts in such feed after 1997 following an outbreak of mad cow disease in Britain. \n \n The U.S. closed its borders to Canadian beef more than two years ago after BSE was confirmed in one cow in northern Alberta. Plans to reopen the border to live imports of Canadian cattle under 30 months were stymied by court injunctions from U.S. cattle lobbyists.\n ==========================================================\n \n I'm sure this won't be big news in the USA.\n \n After all, \"The safety of our food supply is not in question ... American beef is among the safest in the world.\" \n \n Gotta love a good hypocrite. emoticon_rolleyes \n \n Waxy", 
   {
    "post_info": {
     "post_title": "USA's Second Mad Cow Case in Texas"
    }
   }, 
   null, 
   null, 
   1120149660.0
  ], 
  [
   143065, 
   null, 
   "Jo Bennett", 
   "Soooo they're blocking Canadian beef over one case but 2 cases in the US don't merit a ban or even a restriction on beef on the bone like we had in the UK for a while?", 
   {}, 
   143034, 
   null, 
   1120155120.0
  ], 
  [
   143074, 
   null, 
   "Kronus", 
   "Soooo they're blocking Canadian beef over one case but 2 cases in the US don't merit a ban or even a restriction on beef on the bone like we had in the UK for a while?\n\n \n The thing is, the disease will occurr spontaneously. In humans it happens in about 1 in 1,000,000 people. I don't know what the rate is for cows, but it's bound to happen every once in a while. As long as sick cows aren't eaten, and no cow is fed to another cow, the occasional case shouldn't be a cause for concern. Of course, the blocking of Canadian beef is strictly a result of the US cattle lobby and has nothing to do with public safety at this point.", 
   {}, 
   143065, 
   null, 
   1120156320.0
  ], 
  [
   143512, 
   null, 
   "deathlord52", 
   "Soooo they're blocking Canadian beef over one case but 2 cases in the US don't merit a ban or even a restriction on beef on the bone like we had in the UK for a while?\n\n That first case was actually from the Canadian herd.\n \n I still do not get how some 'genius' started the animals fed to cattle thing. Given that they are 100% herbivore, would anyone expect anything but disease cropping up?", 
   {}, 
   143065, 
   null, 
   1120227780.0
  ], 
  [
   143521, 
   null, 
   "Kronus", 
   "\n I still do not get how some 'genius' started the animals fed to cattle thing. Given that they are 100% herbivore, would anyone expect anything but disease cropping up?\n\n \n Well, if you want thick, juicy steaks as quickly as possible, you're going to have to feed your cattle extra protien. Meat is a convienient source of protein. Economically it makes sense. \n \n That fact that cows are vegetarian doesn't have anything to do with it. The same thing can happen if people eat people for too long. Canabalism is just a risky idea, no matter what species you are. On the other hand, given the way prions work, it's not too surprising that no one aniticipated this particular problem.", 
   {}, 
   143512, 
   null, 
   1120229940.0
  ], 
  [
   143524, 
   null, 
   "georged", 
   "Japan and Mexico, the two top importers of US beef have banned imports of US beef and South Korea, the third biggest market for US beef, also followed Japan's lead, as did Australia, Brazil, Chile, Hong Kong, Malaysia, Singapore, Taiwan and Thailand. Those bans have been in place since 2003. Russia recently joined that group, as did Morocco, Vietnam and several others.\n \n As pointed out, the ban on Canadian beef being imported into the US is no longer a safety issue, but the result of the US beef industry lobby attempting to stabilize their market by increasing consumption of domestic feedlot product to offset reduced exports. Somewhat like our inefficient furniture industry using political clout in imposing tariffs on Chinese goods, the US consumer will pay a heavy price.", 
   {}, 
   143512, 
   null, 
   1120230540.0
  ], 
  [
   143526, 
   null, 
   "georged", 
   "\n \n I'm sure this won't be big news in the USA.\n \n After all, \"The safety of our food supply is not in question ... American beef is among the safest in the world.\" \n \n Gotta love a good hypocrite. emoticon_rolleyes \n \n Waxy\n\n \n We're more concerned with meatier issues, like spreading democracy at the point of a gun.", 
   {}, 
   143034, 
   null, 
   1120230960.0
  ], 
  [
   143552, 
   null, 
   "deathlord52", 
   "Well, if you want thick, juicy steaks as quickly as possible, you're going to have to feed your cattle extra protien. Meat is a convienient source of protein. Economically it makes sense. \n \n That fact that cows are vegetarian doesn't have anything to do with it. The same thing can happen if people eat people for too long. Canabalism is just a risky idea, no matter what species you are. On the other hand, given the way prions work, it's not too surprising that no one aniticipated this particular problem.\n\n It does have everything to do w/it, herbivore designs do not handle carnivorous introductions well. That will cause mutations and disease in the long run, as BSE shows.\n \n What these 'producers' had in mind was quick, CHEAP, increases (from scrap animal waste). Increasing growth rates and fat contents (where the 'juicy' comes from) can be handled thru vegetable-derived proteins. I had a neighbor who got excellent results from processed sugar additives.", 
   {}, 
   143521, 
   null, 
   1120236660.0
  ], 
  [
   143559, 
   null, 
   "georged", 
   "It does have everything to do w/it, herbivore designs do not handle carnivorous introductions well. That will cause mutations and disease in the long run, as BSE shows.\n \n What these 'producers' had in mind was quick, CHEAP, increases (from scrap animal waste). Increasing growth rates and fat contents (where the 'juicy' comes from) can be handled thru vegetable-derived proteins. I had a neighbor who got excellent results from processed sugar additives.\n\n \n One of the reasons US imports of range/pasture beef parts are mixed with feedlot stock processing for fast food burger production, much of the feedlot stuff being too fat laden from sugar beet feeding in both liquid and dried form. Anything with more than 20% fat content comes off the griddle at a very reduced size.", 
   {}, 
   143552, 
   null, 
   1120237440.0
  ], 
  [
   143564, 
   null, 
   "Kronus", 
   "It does have everything to do w/it, herbivore designs do not handle carnivorous introductions well. That will cause mutations and disease in the long run, as BSE shows.\n\n \n BSE is not a mutation, nor is it even a disease in the traditional sense of being caused by a virus or bacteria. It's caused by a mis-folded protein, a prion. You can either injest it, or it will happen spontaneously on rare occasions. \n \n I'm not saying that vegetarian species eating meat won't run into problems caused by that behavior, but BSE isn't one of them. BSE isn't caused by the cow's vegetarian system being unable to deal with meat. If you could somehow get a plant that had the prion in question and fed it to the cows they would still get BSE. It's the prion that causes the symptoms, not the cow's being unable to handle meat. Humans are omnivorous, we can handle meat just fine, and yet if we eat infected humans than we catch the human equivalent of BSE.", 
   {}, 
   143552, 
   null, 
   1120238100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  USA's Second Mad Cow Case in Texas", 
  "url": "http://www.4forums.com/political/news-forum/5839-usas-second-mad-cow-case-texas.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 5839, 
  "discussion_files": [
   [
    "11767.html", 
    "http://www.4forums.com/political/news-forum/5839-usas-second-mad-cow-case-texas-print.html"
   ]
  ], 
  "identifier": 5839
 }
]