[
 [
  [
   143810, 
   null, 
   "zachvac", 
   "\"COLUSA Quoting the Declaration of Independence and the United States Constitution, convicted cop killer Andrew Mickel said that he was profoundly affected by 9/11 and the war between Israel and Palestine, which for him, brought to light government oppression of liberties. \n \n Mickel took the stand Thursday and began his explanation as to why he felt the 2002 murder of Red Bluff Police Officer David Mobilio was necessary and justified as an act of patriotism. Among his reasons were the war on drugs, corporate irresponsibility, the government oppressing liberties including Second Amendment rights, the government using technology to track people and the aforementioned war. \n \n The former Army Ranger said that at the time of the murder, he was still under the military oath he took to defend and protect the Constitution against all enemies, \"foreign and domestic.\" \n \n Mickel was convicted on Tuesday of murdering Mobilio in the early morning hours of Nov. 19, 2002. Mobilio was shot twice in the back and once in the head while refueling his patrol car in north Red Bluff. Mickel has not talked about killing Mobilio, only the circumstances in which he claims he came to the conclusion that he had to kill a police officer. \n \n \"You can't resist government oppression by going out and killing civilians,\" he said. \"... You do have the right to resist government people who are armed to attack you.\" \n \n The 26-year-old Mickel, also known as Andrew McCrae, is representing himself in the trial and is making his argument of oppressed freedoms during the penalty phase of his trial. He did not present a defense in the first phase of the trial after the Colusa County judge ruled that his defense was not legally admissible. \n \n Mobilio's widow, mother and sister, who have all sat in the front row throughout the trial were noticeably absent from the courtroom for Mickel's testimony, which lasted most of Thursday and is set to continue Friday morning. Mobilio's father was present. \n \n Mickel began his testimony with a history lesson for jurors talking to them about the American Revolution and how the British Army did not want the colonists to be armed. He constantly referred to the colonists and Great Britain and said that if Britain had the same technology that the government had today, they would have been able to hunt down the colonists and prevent the revolution. \n \n He said that the Revolutionary War was proof that \"when the government does something wrong you get to resist ... you get to be a hero.\" \n \n He described his love for the country and said the Declaration of Independence is \"way cooler than the Constitution.\" \n \n Mickel also discussed the history of the cloth flag that he made and left beside Mobilio's body. The flag featured a snake with the words \"This was a political act\" and \"Don't tread on Us\" written on it. The flag was based on a flag which was used in the American Revolution, Mickel said, to ward off British troops. \"It told the British troops If you leave us alone and don't screw with our liberties we'll leave you alone.\"' \n \n Mickel insisted that he had no other option but to resort to violence. \"I thought I should try to do it peaceably and should try to do it within the system,\" he said. \"... But when your rights are threatened with violence, you don't have to defend them non-violently.\" \n \n Mickel showed pictures of him being arrested during what he called his peaceful protest. His hair was longer and his face was bloodied. \n \n \"No matter how bad the oppression gets in the United States, you're not allowed to resist. If you do anything you're labeled a terrorist,\" he said. \n \n Mickel brought Dr. Robert McWilliams, an adjunct professor and former Los Angeles County Sheriff lieutenant, to the stand to prove that he had a reasonable belief that he was justified in killing Mobilio, he said. \n \n McWilliams testified about different surveillance technologies available to the government including GPS chips in cell phones, information systems linked to various data, infrared and night vision goggles and implantable microchips. \n \n Mickel had a four-inch stack of folders labeled with various technologies used to track or monitor people. During McWilliam's testimony, District Attorney Gregg Cohen and Deputy District Attorney Lynn Strom objected multiple times to the relevance of the testimony. Mickel said that he needed to demonstrate that his beliefs were reasonable. \"Then the jury won't think I'm a nut case that needs to be wiped out,\" he told the judge. \n \n Mickel briefly touched on why he incorporated himself saying that he feels \"that personal responsibility throughout society has been eroded.\" In Internet chat rooms, Mickel claimed that he had corporate immunity.\"\n \n http://www.redbluffdailynews.com/Stories/0,1413,134~26762~2806102,00.html\n \n \n \n Would this be the fate of someone like George Washington if the revolution had failed?", 
   {
    "post_info": {
     "post_title": "What do you think of this?"
    }
   }, 
   null, 
   null, 
   1120282560.0
  ], 
  [
   143881, 
   null, 
   "daewoo", 
   "Would this be the fate of someone like George Washington if the revolution had failed?\n\n \n Of course it would. If you are going to war against the powers that be, you had better either win or be prepared to die trying. \n \n Unfortunatly we live in a country whre less than 20% of the citizens (17%-AP poll) feel their government actually represents them or that the justice system treats individuals fairly. Additionally, over 90% (pew) feel that our rights have been eroded to some degree in the last 50 years.\n \n Any time you have a society with numbers like that, you are going to get guys like Andy Mickel. Fortunatly, for the most part, our society has been indoctorinated to the point that we elevate those who enforce the status quo (police officers, etc...) to the point that killing one is still considered taboo. Mickels own parents turned him in. Apparently Mickel was not well enoguh indoctrinated.\n \n He was not allowed to present his defense, which to me is reprehensible. His defense essnetially relied on the fact that it is apparent in studying US history that US citizens have not only an implied right, but a definite responsibility to rise up against a tyrannical government. He essentially was putting the government on trial. I think that they should at least have allowed him to present his expert witnesses to establish whether such a right or responsibility does indeed exist, then the question of whether a government composed of corporate whores that does not represent its people is tyrannical or not could have been adressed.", 
   {}, 
   143810, 
   null, 
   1120328700.0
  ], 
  [
   143884, 
   null, 
   "Truthsayer", 
   "Those ladies and gentlemen that are armed and policing our streets are the last line of defense between anarchy and a civilized society based on the rule of law. Do not underestimate their patriotism. If it ever got so bad as to come to blows, I believe they would stand on the right side of the rebellion.\n \n This guy is a fruitcake. Plain and simple.\n \n Truth out. emoticon_cool", 
   {}, 
   143881, 
   null, 
   1120330320.0
  ], 
  [
   143906, 
   null, 
   "daewoo", 
   "Those ladies and gentlemen that are armed and policing our streets are the last line of defense between anarchy and a civilized society based on the rule of law. Do not underestimate their patriotism. If it ever got so bad as to come to blows, I believe they would stand on the right side of the rebellion.\n\n \n OR, those ladies and gentlemen whoa re armed and policing our streets are the front line enforcement branch of a tyrannical government. \n \n If it ever got so bad as to come to blows, which side they ended upo standing on is entirely up in the air. we know that they are willingto execute laws that they find personally objectionable, and we know that the fact they are policing the streets means they are not very bright (since most places have followed LAs lead in testing officers to esure that they are not too bright). \n \n History has shown us that governement stooges and law enforcement personell follow the government blindly. Nazi germany, fascist Italy, Japan, Argentina....all states that have fallen to a tyranical government, and I am unaware of a single case where their law enforcement personell stood with the people and refused to be instments of opression. IT simply does not happen. Currently in the US you have the FBI, with the endorsement of every major law enforcement organizattion in the country, recommending that the patriot act be revised so law enforcement agencies can gain access to your personal records without judicial review. \n \n Respect is earned, and frankly American law enforcement has done little or nothing to earn any from what I have seen. Blind respect for military and law enforcement is a fascist ideal.\n \n Law enfiorcement in this country has been a sham. Law enforcement agencies have been reduced to revenue generating organizations.", 
   {}, 
   143884, 
   null, 
   1120335060.0
  ], 
  [
   143971, 
   null, 
   "zachvac", 
   "Those ladies and gentlemen that are armed and policing our streets are the last line of defense between anarchy and a civilized society based on the rule of law. Do not underestimate their patriotism. If it ever got so bad as to come to blows, I believe they would stand on the right side of the rebellion.\n \n This guy is a fruitcake. Plain and simple.\n \n Truth out. emoticon_cool\n\n \n So was the British army. They were patriotic. While I disagree with the way he carried out this \"rebellion\" (killing someone), he takes all the points that seem to make America so great and they all don't seem to apply. The DOI and the New Hampshire Constitution says that if the government gets too powerful, citizens have the right and responsibility to establish a new government. His oath was to fight against enemies both foreign and domestic. He is finding out that these words aren't really real, they are just put there for show and to make it sound like this government rules on the principles of consent of the governed. Truth is that it does not.\n \n In government class this year one of the key words was \"consent of the governed\" along with \"social contract\". I asked my teacher why I don't have the option to give my consent or why I was never asked to sign the contract. In theory they say the people give up some natural rights to have a safe and orderly society. But the problem is that in practice, this isn't a choice, and the government has overstepped its bounds. You call him a fruitcake, is that what you think of George Washington and the rest of the revolutionaries? They were all traitors against England who overthrew the government with even less reason than Mickel has (Mickel has text that says he deserves these rights, the founding fathers just wanted these rights not granted by England's government). Our founding fathers are famous because they won. The victors write the history books, and George Washington won, Andrew Mickel lost. It's that simple, not much else different from them.", 
   {}, 
   143884, 
   null, 
   1120369200.0
  ], 
  [
   143982, 
   null, 
   "daewoo", 
   "So was the British army. They were patriotic. While I disagree with the way he carried out this \"rebellion\" (killing someone), he takes all the points that seem to make America so great and they all don't seem to apply. The DOI and the New Hampshire Constitution says that if the government gets too powerful, citizens have the right and responsibility to establish a new government. His oath was to fight against enemies both foreign and domestic. He is finding out that these words aren't really real, they are just put there for show and to make it sound like this government rules on the principles of consent of the governed. Truth is that it does not.\n\n \n I would have to disagree on part of this. I have seen armed insurgencies and tyrannical governments, and frankly if youare not killing people, you are just being politely ignored. Change without violence only happens so long as your governemtn is truly representative of the people. Once they cross that line where they are no longer representative of the people, but instead are representative of only a small portion ofthe people, or of corporate entities, or (in the case of a fascist nation) where they put the government or nation as an entity befor ehte people, there will be no change until you force it, and the only way to force it is to start killing people. \n \n It is unfortunate, but that is just the way it is. Those in power will do whatever is necessary to stay in power. In order to change things, you have to be willing to do whatever is necessary to remove them from power, or remove the ability to enforce their power. this guy did everythign rigth from a revolutionary standpoint, excpet getting caught. he is 100% correct that killing civilians as your primary target is a poor choice. HE chose a police officer instead....an individual who has made it their career to enforce the will of those in power. Had he not been caught, he likely could have continued with this plan, and possibly, or even likely, spurred others to follow his lead (there are over 25 million militants in the US).\n \n \nIn government class this year one of the key words was \"consent of the governed\" along with \"social contract\". I asked my teacher why I don't have the option to give my consent or why I was never asked to sign the contract. In theory they say the people give up some natural rights to have a safe and orderly society. But the problem is that in practice, this isn't a choice, and the government has overstepped its bounds. You call him a fruitcake, is that what you think of George Washington and the rest of the revolutionaries? They were all traitors against England who overthrew the government with even less reason than Mickel has (Mickel has text that says he deserves these rights, the founding fathers just wanted these rights not granted by England's government). Our founding fathers are famous because they won. The victors write the history books, and George Washington won, Andrew Mickel lost. It's that simple, not much else different from them.\n\n \n There is something different about him. The founding fatehrs got people to follow them. He failed to do sop, likely becuase he was caught too soon. In reality there is a huge fringe element in the US that is essentially waiting for a leader and a signal to GO. \n \n Beyond that, it would seem he was fighting for his rights, and the rights of other Americans. In that way he is very like the founding fathers.", 
   {}, 
   143971, 
   null, 
   1120373400.0
  ], 
  [
   144035, 
   null, 
   "zachvac", 
   "He wasn't really caught. He put on websites all over: \"My name is Andrew Mickels and I killed a cop to protest...\"", 
   {}, 
   143982, 
   null, 
   1120406760.0
  ], 
  [
   144048, 
   null, 
   "daewoo", 
   "He wasn't really caught. He put on websites all over: \"My name is Andrew Mickels and I killed a cop to protest...\"\n\n \n Actually he posted his internet messages under the name \"Andy McCrae\". HE got caught becuase he told his parents what he had done and they turned him in.", 
   {}, 
   144035, 
   null, 
   1120410240.0
  ], 
  [
   144583, 
   null, 
   "zachvac", 
   "Actually he posted his internet messages under the name \"Andy McCrae\". HE got caught becuase he told his parents what he had done and they turned him in.\n\n \n \"A well-chosen spot for an ambush. That is what investigators later concluded, especially when they learned the suspected assailant had Army Ranger training. A lonely crossroads. Poorly lit. No station attendant on duty. No witnesses. It was a killing that might have never been solved. \n \n That is, until a confession appeared on the Internet. Six days after the shooting, a manifesto appeared on more than a dozen Web sites operated by the left-leaning Independent Media Center. \n \n It began: \"Hello Everyone, my name's Andy. I killed a Police Officer in Red Bluff, California in a motion to bring attention to, and halt, the police-state tactics that have come to be used throughout our country. Now I'm coming forward, to explain that this killing was also an action against corporate irresponsibility.\" \n \n The tract -- which managed to mingle an almost chirpy tone with leftist cant -- was signed by \"Andrew McCrae,\" later found to be an alias for Andrew Mickel, a student at a liberal arts college who before enrolling had served three years stateside with the U.S. Army's 101st Airborne Division. \"\n \n \n from the Washington Post\n \n \n While he did use an alias it seems like he didn't exactly try to conceal it at all.", 
   {}, 
   144048, 
   null, 
   1120544760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What do you think of this?", 
  "url": "http://www.4forums.com/political/government-debates/5859-what-do-you-think.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 5859, 
  "discussion_files": [
   [
    "1276.html", 
    "http://www.4forums.com/political/government-debates/5859-what-do-you-think-print.html"
   ]
  ], 
  "identifier": 5859
 }
]