[
 [
  [
   7815, 
   null, 
   "Phat_Albert87", 
   "It seems to me that there's a lot of anti-Catholic sentiment on these forums. Just wanted to know why.", 
   {
    "post_info": {
     "post_title": "What's wrong with Catholicism?"
    }
   }, 
   null, 
   null, 
   1052348040.0
  ], 
  [
   7816, 
   null, 
   "thistownwilleat", 
   "I don't personally know, but the common opinion has to do with the Pope and the Virgin Mary.", 
   {}, 
   7815, 
   null, 
   1052350500.0
  ], 
  [
   7834, 
   null, 
   "gilligan8503", 
   "yeah, no one likes the pope. i am not anti-catholic, but there are a lot of things about this religion that are based on superstition that is so obviously false.\n \n such as: \n exorsism (all catholic churches have exorsist equipment... it is mostlikely hidden)", 
   {}, 
   7815, 
   null, 
   1052367660.0
  ], 
  [
   8589, 
   null, 
   "Sakata", 
   "The entire bible is filled with the truth of demons, the spirit world and demon possession. Jesus and his followers cast demons out of people all the time. If you ask me, it would see weird if they didn't believe that stuff.\n \n the problem I have is manly with the pope (never mention in the bible, just an invention by Catholics)\n \n and the fact that they have tons of ways in which they take the spotlight of Christ. I believe Christ + Nothing = Salvation, but the catholic church (an many of Christian churches as well) wants to throw in a bunch of works like baptism and conformation, etc. And dont forget praying to the virgin mary as their hope, etc", 
   {
    "unicode_changes_made": true
   }, 
   7815, 
   null, 
   1054344420.0
  ], 
  [
   8590, 
   null, 
   "Sakata", 
   "btw, gilligan, who is your avatar a pic of? it looks like tom hanks in cast away.. I was just wondering...", 
   {}, 
   7815, 
   null, 
   1054344540.0
  ], 
  [
   8604, 
   null, 
   "gilligan8503", 
   "obviously you agree that the catholic church holds on to too much tradition. i say they start a new program called 'catholisism WOW!' (some will know what i mean from that).\n \n my avatar is actually the god (no pun intended) among all directors, stanley kubrick. :)", 
   {}, 
   7815, 
   null, 
   1054356900.0
  ], 
  [
   8791, 
   null, 
   "Phat_Albert87", 
   "[QUOTE]Originally posted by Sakata \n the problem I have is manly with the pope (never mention in the bible, just an invention by Catholics)\n \n \nOriginally posted by gilligan8503 \n obviously you agree that the catholic church holds on to too much tradition. i say they start a new program called 'catholisism WOW!' (some will know what i mean from that).\n \n \n \n Well, I could say that Sola Scriptura (Scripture Alone) was never used by the first Christians, much less sanctioned in the bible. In fact, Peter speaks against this (2 Peter 1:21-21). \n \n Paul explicitly states all Christians to \"stand firm and hold to the traditions which you were taught by us, either by word of mouth or by letter\" (2 Thess. 2:15).", 
   {}, 
   7815, 
   null, 
   1054669140.0
  ], 
  [
   8881, 
   null, 
   "Debate_Queen615", 
   "they say the bread is his actual flesh and the wine is his actually blood and its obviously not\n \n and to many other things I'm not doing to mention", 
   {}, 
   7815, 
   null, 
   1054693020.0
  ], 
  [
   8897, 
   null, 
   "Phat_Albert87", 
   "Jesus said \"I am the living bread which came down from heaven; if any one eats of this bread, he will live for ever; and the bread which I shall give for the life of the world is my flesh.' The Jews then disputed among themselves, saying, 'How can this man give us his flesh to eat?'\" (John 6:51-52). \n \n The reason his disciples were stupefied was that they took his words literally. Jesus repeated this again, and he added \"Truly, truly, I say to you, unless you eat the flesh of the Son of man and drink his blood, you have no life in you; he who eats my flesh and drinks my blood has eternal life, and I will raise him up at the last day. For my flesh is food indeed, and my blood is drink indeed. He who eats my flesh and drinks my blood abides in me, and I in him\" (John 6:53-56). \n \n If Chirst was speaking metaphorically, he would have tried to clarify what he said. However, he did not. Plus, some could not accept this: \"After this, many of his disciples drew back and no longer went about with him\" (John 6:66). If it had all been a confusion, why didn't he call them back to straighten things out? This is the only record we have of Christ's followers forsaking him for doctrinal purposes.\n \n Finally, Paul himself confirms all this in his letters: \"The cup of blessing which we bless, is it not a participation in the blood of Christ? The bread which we break, is it not a participation in the body of Christ?\" (1 Cor. 10:16). \"Therefore whoever eats the bread and drinks the cup of the Lord unworthily will have to answer for the body and blood of the Lord. . . . For any one who eats and drinks without discerning the body, eats and drinks judgment on himself\" (1 Cor. 11:27, 29).", 
   {
    "unicode_changes_made": true
   }, 
   7815, 
   null, 
   1054698300.0
  ], 
  [
   9510, 
   null, 
   "in_lux_umbrae", 
   "From what I've seen, I think the anti-Catholic feeling comes about because of the 'extreme' Catholics - fundementalists e.t.c. who can be rude, attempt to convert people (e.g. You're going to Hell to suffer in eternal torment unless you seek salvation with Jesus!!!) and also refuse to listen in any way to the other sides point of view. Of course, most of these observations come from other places, but I imagine it would be the same in most boards. In some ways it's a shame, because it creates a lot of anger and discrimination, wheras most of the Catholics and other Christian groups, as well as other religious groups, are normal, balanced, kind and caring people.", 
   {}, 
   7815, 
   null, 
   1055444820.0
  ], 
  [
   9515, 
   null, 
   "Crim", 
   "The extreme hellfire and brimstone preachers are almost always protestants. Catholics, as I have known them, are pretty moderate.", 
   {}, 
   7815, 
   null, 
   1055448300.0
  ], 
  [
   9521, 
   null, 
   "in_lux_umbrae", 
   "As i said, it may be very different between here and other boards. Many of the ones I've known were Catholic.", 
   {}, 
   7815, 
   null, 
   1055453580.0
  ], 
  [
   9540, 
   null, 
   "gilligan8503", 
   "personally, i am offended by the pope's hat.", 
   {}, 
   7815, 
   null, 
   1055463720.0
  ], 
  [
   9586, 
   null, 
   "grayhawk", 
   "Lately with the molesting priests, the cover up by the church were all bad for the religion. I'm Catholic, I enjoy my religion. The Pope is the Pontifus Maximus, the bridge between Heaven and Earth. His job is meant to bring the word of God to those who are on Earth, the unknowing. The church is patriarchal, a heirarchy in which each level controls sections, and so on, much like a congolomorate. This all came about in order to keep the religion the same in all areas. So one area wouldn't have traditions that others didn't have etc. \n Why do people dislike Catholics, lots of reasons, but then again pick any religion and you'll find there are those who don't like it or don't like those those who follow it. To each his own I say. Does it really matter what religion someone follows? Doesn't it matter more what their actions are?", 
   {}, 
   7815, 
   null, 
   1055486340.0
  ], 
  [
   10855, 
   null, 
   "maximus", 
   "Sakata,\n See Matthew 16: 18-19 and compare it with Isaiah 22 for the scriptural foundation for the papacy. This scriptural papacy stuff is plentiful but sometimes not overt. I have tons more of references but I have already e-mailed you about this. If anyone else is interested I can e-mail a detailed attachment. Interesting to know where the wacky Catholics get this stuff. It is not out of thin air!", 
   {}, 
   7815, 
   null, 
   1056519060.0
  ], 
  [
   12188, 
   null, 
   "rapture", 
   "It seems to me that there's a lot of anti-Catholic sentiment on these forums. Just wanted to know why.\n\n \n \n \n ** Beyond the fact they virtually contradict everything in the Bible, \n they also put priest who don't follow Christ in collers( actions of a satanist?) and the results the abuse of children, and even after knowing this for centuries, they still put satanic paraphilic priest in ministeral postions-", 
   {}, 
   7815, 
   null, 
   1059102540.0
  ], 
  [
   12195, 
   null, 
   "Ness757", 
   "I have problems with Christianity in general.", 
   {}, 
   12188, 
   null, 
   1059105900.0
  ], 
  [
   12356, 
   null, 
   "Phat_Albert87", 
   "** Beyond the fact they virtually contradict everything in the Bible, \n they also put priest who don't follow Christ in collers( actions of a satanist?) and the results the abuse of children, and even after knowing this for centuries, they still put satanic paraphilic priest in ministeral postions-\n\n \n Okay, can you give me specific evidence of how the Catholic Church contradicts the bible, because I can give you all the evidence that the Bible supports the existence of this church.\n \n As to your second point, sure, I am outraged that the church has not done a good job ensuring that children are safe. However, I think that the media has focused way too heavily on just the Catholic Church, since other Christian Churches have the same problems (which are often unreported by the media)", 
   {}, 
   12188, 
   null, 
   1059544560.0
  ], 
  [
   12361, 
   null, 
   "rapture", 
   "[QUOTE]\nOkay, can you give me specific evidence of how the Catholic Church contradicts the bible, because I can give you all the evidence that the Bible supports the existence of this church.\n\n \n \n Now we take the apostle Paul when he found certain disciples that were wonderful people. I believe they were saved, and yet they had not been baptized in the Name of Jesus Christ, through they had been baptized (Acts 19). Paul passed through the upper coast of Ephesus; he finds certain disciples. And he said unto them,\" Have you receive the Holy Ghost since you believed.?\"\n \n And they said unto him , \" We don't know about the Holy Ghost, whether there be any Holy Ghost.\"\n \n He said, \" Then unto what were you baptized?\"\n \n \n They said, \" We've been baptized. John baptized us, the same man that baptized Jesus.\" That's a pretty good baptism.\n \n \n Watch this stern apostle though. He said, \" But John only baptized unto repentance,\" not for remission of sins, because the sacrifice had not been killed. And when they heard this, they were rebaptized in the Name of Jesus Christ, and the Holy Spirit came upon them.\n \n \n So I believe that the pattern had been laid down. Every person in the Bible was baptized in the Name of Jesus Christ. Never one time was anybody ever baptized in the name of the Father, Son, Holy Ghost. See? Never was anybody ever sprinkled; they were all immersed.\n \n \n Paul said in Galatians 1:8 , \" If a Angel from Heaven comes and preaches any other gospel than this I've preached unto you, let him be accursed. \n \n Excerpt by William Branham\n \n \n \n ** Does the R.C.C. dispute the teachings of Paul?\n \n \n \n \n \n \n \nAs to your second point, sure, I am outraged that the church has not done a good job ensuring that children are safe. However, I think that the media has focused way too heavily on just the Catholic Church, since other Christian Churches have the same problems (which are often unreported by the media)\n\n \n \n You should be outrage, exspecially, since they have no intentions of ridding the church of paraphilic satanic priest, and I agree some other denominations are purposely putting paraphilic at the pulpit, but not as many as the R.C.C.", 
   {
    "unicode_changes_made": true
   }, 
   12356, 
   null, 
   1059585300.0
  ], 
  [
   12370, 
   null, 
   "ApathySam", 
   "I love Catholics.. they have to be the cutest and most cuddly Christians out there. I just want to pick one up and put him in my pocket.", 
   {}, 
   9515, 
   null, 
   1059597180.0
  ], 
  [
   12538, 
   null, 
   "maximus", 
   "Rapture,\n \n I posted to you concerning the errors of Branham's historical and scriptural exegesis on the \"Satan in the form of a serpent\" thread and I must do so again.\n \n Check out these sites to learn the fullness of truth:\n \n Infant Baptism \n \n Immersion Only Baptism (Notice the discussion of Paul's baptism on this one).\n \n Trinitarian Baptism \n \n Peace.", 
   {}, 
   12370, 
   null, 
   1059799680.0
  ], 
  [
   12584, 
   null, 
   "rapture", 
   "Why do you baptize in the Name of Jesus in place of the name of the \"Father, Son, and Holy Ghost\"?\n \n \n \n \n Well, there is no such a thing as a name of \"Father, Son, Holy Ghost.\" That's is the reason. There was nobody in the Bible ever baptized in the Name of \"Father, Son, and Holy Ghost.\" Every person in the Bible , or three hundred years this side the Bible, was baptized in the Name of Jesus Christ.\n Not one apostle, not one Christian, not one time was the \"Father, Son, and the Holy Ghost\" ever used for baptism until the Catholic Church was organized at the Nicene Council, three hundred and six year's after the death of the last apostle.\n \n \n There is no such a thing as name of 'FATHER, SON, AND HOLY GHOST.\" Father is not a name, Son is not a name, Holy Ghost is not a name. It's three titles, three office titles to a Name: Jesus Christ. So therefore there is no such a thing as the name of \" Father, Son, Holy Ghost.\" There's no name to it so I baptize in the Name of Jesus Christ which is the Name of Father, Son, and Holy Ghost.\n \n \n \n \n By William Marrion Branham", 
   {
    "unicode_changes_made": true
   }, 
   12538, 
   null, 
   1059937020.0
  ], 
  [
   12586, 
   null, 
   "SilentPoet", 
   "Ness,\n \n I'll go with that answer.\n \n \n ApathySam,\n \n Thats funny. \n \n Always Stay Open Minded", 
   {}, 
   12584, 
   null, 
   1059938160.0
  ], 
  [
   12596, 
   null, 
   "maximus", 
   "Rapture,\n \n You are wrong. \n \n Read Matthew 28:19, \"Go therefore and make disciples of all nations, BAPTIZING THEM IN THE NAME OF THE FATHER AND OF THE SON AND OF THE HOLY SPIRIT, teaching them to observe all that I have commanded you; and lo, I am with you always, to the close of the age.\" Check your bible. These are the words of Jesus himself.\n \n Furthermore one can find that Christians were in fact baptized in the name of the Father, the Son, and the Holy Spirit BEFORE THE YEAR 300. It was written in the Didache. It is also in the writings of Hippolytus, Tertullian, Origen, Cyprian that dated before 300. (Let me know if you need me to cite specifics).\n \n I have 1 simple follow-up question:\n \n 1. Do you believe in the rapture, the event of your namesake?\n \n Peace.", 
   {}, 
   12586, 
   null, 
   1059951780.0
  ], 
  [
   12668, 
   null, 
   "Phat_Albert87", 
   "Thank you, Maximus. Furthermore, there are only four passages where people are baptized in the \"name of Jesus\" in the NT (Acts 2:38, 8:16, 10:48, and 19:5). If you notice, Luke does not use the same designation in each place (switches between Lord Jesus and Jesus Christ), indicating that they are simply discriptions. Luke also used this language to distinguish a Christian baptism from other types of baptisms of that era, such as John's and pagan cults.", 
   {}, 
   12584, 
   null, 
   1060050660.0
  ], 
  [
   12736, 
   null, 
   "Mysterium16", 
   "Apathy Sam, you make me laugh :p :p !\n \n \n It is more important to be baptized with the holy spirit of love.\n I think people get so caught up with religious ritual they forget the meaning of thier faith. \n The reason people baptize is to symbol death and ressurection that's why we immerse. What's the point of sprinkling water? What does it represent? \n The point of baptism is not just to get wet \n It's supposed to mean somehing. Christianity is a very practical religion. Everything we do is explained. It's for a purpose. \n I was raised catholic and tho they are weird, they are devoted. And I think Confession is fun. I like shocking people.\n A christian is a christian is a christian, Jesus loves all of us whether we're wet or not.", 
   {}, 
   12668, 
   null, 
   1060105200.0
  ], 
  [
   12767, 
   null, 
   "rapture", 
   "Rapture,\n \n \nYou are wrong. \n \n Read Matthew 28:19, \"Go therefore and make disciples of all nations, BAPTIZING THEM IN THE NAME OF THE FATHER AND OF THE SON AND OF THE HOLY SPIRIT, teaching them to observe all that I have commanded you; and lo, I am with you always, to the close of the age.\" Check your bible. These are the words of Jesus himself.\n\n \n The Holy spirit is God the Father, Christ was the Temple of the Holy Spirit on Earth. I don't believe in that trinity stuff, God is one, and no apostle that follwed the teachings of Christ was baptized in titles NONE.....so why should I?\n \n \nFurthermore one can find that Christians were in fact baptized in the name of the Father, the Son, and the Holy Spirit BEFORE THE YEAR 300. It was written in the Didache. It is also in the writings of Hippolytus, Tertullian, Origen, Cyprian that dated before 300. (Let me know if you need me to cite specifics).\n\n \n \n I'm sure people have been baptized in the name of Santa Clause, and will still claim to follow Christ, look at our churchs, anyways, it's the spiritual baptism(ACTS) that get's one in Heaven\n \n \nI have 1 simple follow-up question:\n\n \n 1. Do you believe in the rapture, the event of your namesake?\n\n \n Yep", 
   {}, 
   12596, 
   null, 
   1060138560.0
  ], 
  [
   12815, 
   null, 
   "maximus", 
   "The Holy spirit is God the Father, Christ was the Temple of the Holy Spirit on Earth. I don't believe in that trinity stuff, God is one, and no apostle that follwed the teachings of Christ was baptized in titles NONE.....so why should I\n \n \n I can think of one good reason. Jesus commanded it. Matthew 28\n \n Let me remind you of what you wrote, \n \nWell, there is no such a thing as a name of \"Father, Son, Holy Ghost.\" That's is the reason. There was nobody in the Bible ever baptized in the Name of \"Father, Son, and Holy Ghost.\" Every person in the Bible , or three hundred years this side the Bible, was baptized in the Name of Jesus Christ.Not one apostle, not one Christian, not one time was the \"Father, Son, and the Holy Ghost\" ever used for baptism until the Catholic Church was organized at the Nicene Council, three hundred and six year's after the death of the last apostle\n \n \n First you say that there was no such thing as a name of \"Father, Son, Holy Ghost.\" So I show you that there is in scripture. \n \n You say that everybody until 300 A.D. was baptized in the name of Jesus Christ and you say that the Catholic Church invented the practice of baptizing in the name of the Father, the Son, and the Holy Spirit. How did the Church invent it if Jesus commanded it right there in scripture? How does the Catholic Church go against the teaching of Christ by baptizing in the name of the Father, Son, and Holy Ghost if it is found in scripture that Jesus himself commanded this?\n \n Then you say no apostles were baptized in this manner but is this scriptural?\n \n Do you think if Jesus commanded the apostles to go out and baptize in the name of the Father, Son and Holy Spirit that they would not do so? You say that the apostles that \"followed the teachings of Christ\" were not baptized in titles. But if they were to follow the teaching of Christ then they would have to baptize others in this form as was commanded in Matthew 28:19. \n \n The other problem with this quote is that you imply that the Catholic Church was established in 300 A.D. when in actuality it was established in the time of Christ (Matthew 16:18). Your church on the other hand was not started until around 1913. That's a big gap from the time Christ was around. However, the heresy that your church promotes was condemned as sebelianism as far back as 217.\n \n \nI'm sure people have been baptized in the name of Santa Clause, and will still claim to follow Christ, look at our churchs, anyways, it's the spiritual baptism(ACTS) that get's one in Heaven\n \n \n I'm not making a wild, off-the-wall, hollow claim of following Christ. I'm not making up a name to be baptized in like Santa Clause. I am using THE names that Christ told us to use. Those who claim to follow Christ might want to look at Matthew 28:19  and make their claim valid. \n \n This \"rapture\" that you believe in, is this a scriptural name for the event?", 
   {
    "unicode_changes_made": true
   }, 
   12767, 
   null, 
   1060227180.0
  ], 
  [
   12818, 
   null, 
   "maximus", 
   "Rapture,\n I do acknowledge that the Trinity is sometimes a difficult concept.\n The one thing that we do agree on so far is the fact that God is one. But He is not one God holding three offices. He is one God in three persons. He is one God but distinct relationally in Father, Son, and Holy Spirit. But let's assume for now that he fits your view and holds three offices.\n \n 1. John 1:1, \"In the beginning was the Word, and the Word was with God, and the Word was God. He was in the beginning with God...\" Why was Jesus with God if Jesus is an office or mode that God assumed during the time of Christ?\n \n 2. John 17:1-5, \"When Jesus had spoken these words, he lifted up his eyes to heaven and said, \"Father, the hour has come; glorify thy Son   that the Son   may glorify thee, since thou hast given him  power over all flesh, to give eternal life to all whom thou  hast given him. And this is eternal life, that they know thee the only true God, and Jesus Christ  whom thou   hast sent. I glorified thee   on earth, having accomplished the work which thou gavest me to do; and now, Father, glorify thou me in thy own presence with the glory which I had with thee before the world was made.\" Is God talking to himself one office to another? \n \n In Luke 22:42  and the parallel passage in Matthew 26  why does Jesus say \"nevertheless not my will, but thine, be done.\" Why does he not say, \"not my will but mine be done?\" \n \n John 14:23, \"Jesus answered him, 'If a man loves me, he will keep my word, and my Father will love him, and we will come to him and make our   home with him.\" We and our denote distinct personalities.\n \n Peace.", 
   {}, 
   12815, 
   null, 
   1060228980.0
  ], 
  [
   12824, 
   null, 
   "rapture", 
   "[QUOTE]\nRapture,\n I do acknowledge that the Trinity is sometimes a difficult concept.\n The one thing that we do agree on so far is the fact that God is one. But He is not one God holding three offices. He is one God in three persons. He is one God but distinct relationally in Father, Son, and Holy Spirit. But let's assume for now that he fits your view and holds three offices.\n\n \n He just changes from Father( Isreal)....Son(atonement)....Holy Ghost and because of his infinite status he can still run the universe ( past, present and future.\n \n \n1. John 1:1, \"In the beginning was the Word, and the Word was with God, and the Word was God. He was in the beginning with God...\" Why was Jesus with God if Jesus is an office or mode that God assumed during the time of Christ?\n\n \n \n Read the last part as well the and the Word was God, anyways, HIS WORD(God).. of course it's going to be him\n \n \n2. John 17:1-5, \"When Jesus had spoken these words, he lifted up his eyes to heaven and said, \"Father, the hour has come; glorify thy Son   that the Son   may glorify thee, since thou hast given him  power over all flesh, to give eternal life to all whom thou  hast given him. And this is eternal life, that they know thee the only true God, and Jesus Christ  whom thou   hast sent. I glorified thee   on earth, having accomplished the work which thou gavest me to do; and now, Father, glorify thou me in thy own presence with the glory which I had with thee before the world was made.\" Is God talking to himself one office to another?\n\n \n Have you read those scripture I and my Father are one. There are alots of them, anyways, if I find where this is explain more throughly, I'll post but consider this,\n \n \n Rev. 1:5, \" Unto Him That loved us, and washed us from our sins in His own blood.\" The word \"washed\" is actually \"loosed\"- Loosed us from our sin in His own blood.\" isn't that wonderful? But are you spiritual minded? Did you catch it? It was His blood that loosed us completely from our sins. It was not human blood. It was the blood of God . Peter called it the blood of Christ. Paul called it the blood of the Lord, and the blood of Jesus. Not three persons, but ONE person. There is that revelation again.\n \n \n Excerpt by William Marrion Branham\n -Rev 1:5\n \n \n \n \nIn Luke 22:42  and the parallel passage in Matthew 26  why does Jesus say \"nevertheless not my will, but thine, be done.\" Why does he not say, \"not my will but mine be done?\" \n\n \n If one did God's will are they not following Christ(God)? Christ pointing the disciple towards himself , his real self, a spirit\n \n \nJohn 14:23, \"Jesus answered him, 'If a man loves me, he will keep my word, and my Father will love him, and we will come to him and make our   home with him.\" We and our denote distinct personalities.\n\n \n The Holy Spirit which is in Christ with those who love him\n \n \n I hope I helped some, I'm just a babe in learning, like I said, when I find more detail, which there definately is, I'll post. I have over 600 sermons of William Branham. I've only listen to approx 35 and haven't yet read all the Bible, but from my own spiritual experiences I met one God and one Satan.", 
   {
    "unicode_changes_made": true
   }, 
   12818, 
   null, 
   1060234140.0
  ], 
  [
   12825, 
   null, 
   "rapture", 
   "=maximus]I can think of one good reason. Jesus commanded it. Matthew 28\n\n \n \n \n He also stated unless a man be born again he can in no wise enter into the kingdom of heaven. I can be baptized in the Mississipi River under the name twinkle toes, but if I haven't received the spiritual conversion, no purgatory for me. Nothing but devil's and flames- peace\n \n \n \n \n \nFirst you say that there was no such thing as a name of \"Father, Son, Holy Ghost.\" So I show you that there is in scripture. \n\n \n Have you ever named a child FATHER, SON, OR HOLYGHOST? What about PHD or Gynacologist?\n \n \nYou say that everybody until 300 A.D. was baptized in the name of Jesus Christ and you say that the Catholic Church invented the practice of baptizing in the name of the Father, the Son, and the Holy Spirit. How did the Church invent it if Jesus commanded it right there in scripture? How does the Catholic Church go against the teaching of Christ by baptizing in the name of the Father, Son, and Holy Ghost if it is found in scripture that Jesus himself commanded this?\n\n \n I guess they didn't understand Jesus Christ is NOT MARY\n \n \nThen you say no apostles were baptized in this manner but is this scriptural?\n\n \n I haven't found it. Let me know if you do\n \n \n \nDo you think if Jesus commanded the apostles to go out and baptize in the name of the Father, Son and Holy Spirit that they would not do so? You say that the apostles that \"followed the teachings of Christ\" were not baptized in titles. But if they were to follow the teaching of Christ then they would have to baptize others in this form as was commanded in Matthew 28:19.\n \n \n They didn't because at least Peter( Rock) knew who Christ was. The Revelation was made known \n \n \nThe other problem with this quote is that you imply that the Catholic Church was established in 300 A.D. when in actuality it was established in the time of Christ (Matthew 16:18). Your church on the other hand was not started until around 1913. That's a big gap from the time Christ was around. However, the heresy that your church promotes was condemned as sebelianism as far back as 217.\n\n \n I don't really care when it was established and it's not my words, but I am curious what wicked Pope made up purgatory? Which century?\n \n \n \n \nI'm not making a wild, off-the-wall, hollow claim of following Christ. I'm not making up a name to be baptized in like Santa Clause. I am using THE names that Christ told us to use. Those who claim to follow Christ might want to look at Matthew 28:19  and make their claim valid.\n\n \n \n Just Pray about it, like I said before, without the conversion your going to HELL anyway \n \n This \"rapture\" that you believe in, is this a scriptural name for the event?\n\n \n Check out Revelations when the church is taken away before the tribulation.", 
   {
    "unicode_changes_made": true
   }, 
   12815, 
   null, 
   1060235700.0
  ], 
  [
   13093, 
   null, 
   "maximus", 
   "Rapture,\n \n \nHe just changes from Father( Isreal)....Son(atonement)....Holy Ghost and because of his infinite status he can still run the universe ( past, present and future. \n \n \n How do you reconcile this with Hebrews 13:8, \"Jesus is the same yesterday and today and forever.\"\n \n \nRead the last part as well the and the Word was God, anyways, HIS WORD(God).. of course it's going to be him \n (John 1:1)\n \n I have read the last part. \"He was in the beginning with God; all things were made through him, and without him was not anything made that was made.\" It says that Jesus was with God in the beginning and that all things were made through him. If Jesus was with God since the beginning. How does God change back and forth from Jesus to the Father. I agree with the fact that the Word was God. Jesus is divine and he is unified with God as one essence. But there are three distinct persons to this essence. There is not one essence mutating to three different offices. \n \n \nHave you read those scripture I and my Father are one. There are alots of them, anyways, if I find where this is explain more throughly, I'll post but consider this,\n \n \n Yes, I have read them and I agree with them. (Here are a few John 10:30-33, John 14:8-12)\n \n \nI hope I helped some, I'm just a babe in learning, like I said, when I find more detail, which there definately is, I'll post. I have over 600 sermons of William Branham. I've only listen to approx 35 and haven't yet read all the Bible, but from my own spiritual experiences I met one God and one Satan.\n \n \n From whom does William Branham derive his authority to teach and preach?\n \n \nI guess they didn't understand Jesus Christ is NOT MARY\n \n \n I don't follow. What are you implying?\n \n \n\"They didn't because at least Peter( Rock) knew who Christ was. The Revelation was made known\"\n \n \n Yes, Peter was at the Transfiguration. So was James and John. But remember that at the Transfiguration the Father said, \"This is my beloved Son with whom I am well pleased.\" It does not sound like God is changing from office to office when He makes this statement. \n \n \nI don't really care when it was established and it's not my words, but I am curious what wicked Pope made up purgatory? Which century?\n \n \n You should care when it was established because it is the Church shown to be established in scripture. It is the Church started by Jesus Christ himself. Why do you think that all popes are wicked? The existence of purgatory was not invented by a pope. It is scriptural.\n \n \nJust Pray about it, like I said before, without the conversion your going to HELL anyway \n \n \n Let's both pray about it. And remember John 16:12, \"When the Spirit of truth comes, he will guide you into all the truth; for he will not speak on his own authority, but whatever he hears he will speak, and he will declare to you the things that are to come.\"", 
   {
    "unicode_changes_made": true
   }, 
   12825, 
   null, 
   1060583400.0
  ], 
  [
   13125, 
   null, 
   "rapture", 
   "[QUOTE=maximus]Rapture,\n \n \n \n \nHow do you reconcile this with Hebrews 13:8, \"Jesus is the same yesterday and today and forever.\"\n\n \n \n Inifinite\n \n \n (John 1:1)\n \n I have read the last part. \"He was in the beginning with God; all things were made through him, and without him was not anything made that was made.\" It says that Jesus was with God in the beginning and that all things were made through him. If Jesus was with God since the beginning. How does God change back and forth from Jesus to the Father. I agree with the fact that the Word was God. Jesus is divine and he is unified with God as one essence. But there are three distinct persons to this essence. There is not one essence mutating to three different offices. \n\n \n So you don't believe God was the sacrifice for the Sin of Adam and Eve? \n \n \n \n \nYes, I have read them and I agree with them. (Here are a few John 10:30-33, John 14:8-12)\n\n \n Me too\n \n \n \n \nFrom whom does William Branham derive his authority to teach and preach?\n\n \n \n Not the Pope that's for sure\n \n \n \nI don't follow. What are you implying?\n\n \n The Mother is worshipped not the Son.. oh that's right, Mary has been given secretarial duties...running the prayers of the mortals to the Son?Correct?\n \n \n \nIYes, Peter was at the Transfiguration. So was James and John. But remember that at the Transfiguration the Father said, \"This is my beloved Son with whom I am well pleased.\" It does not sound like God is changing from office to office when He makes this statement.\n \n \n Some of the scriptures has also make statements of the seven spirits before the alter, of God. Anyways, comprend this, God is able to divide himself. How is that he is able to give the Holy Ghost(Infinitismals )and still rule in heaven \n \n \n \n \nYou should care when it was established because it is the Church shown to be established in scripture. It is the Church started by Jesus Christ himself.\n \n \n \n Yet  don't see God\n \n \n \nWhy do you think that all popes are wicked?\n \n \n Well reading the history, likewise,the scandle in the present of the church isn't a mirror to what God represents. A church like that...can only run out the sheep\n \n \n \n \n \nThe existence of purgatory was not invented by a pope. It is scriptural.\n \n \n \n There was a KET special done on this, I forget the name of the pope, but I'm sure a internet search might help. Anyways, from what I remeber this Pope not only charged for a wolf ticket but went as far as to say people had to continue paying fees to get the love ones out of purgatory. \n \n Lucifer is the MASTER of purgatory, where is it scriptural that one can live in sin with a safety Bin?\n \n \nLet's both pray about it. And remember John 16:12, \"When the Spirit of truth comes, he will guide you into all the truth; for he will not speak on his own authority, but whatever he hears he will speak, and he will declare to you the things that are to come.\"\n\n \n \n Capesh", 
   {
    "unicode_changes_made": true
   }, 
   13093, 
   null, 
   1060640520.0
  ], 
  [
   13209, 
   null, 
   "maximus", 
   "Rapture,\n \nSo you don't believe God was the sacrifice for the Sin of Adam and Eve? \n \n \n Why would you think I don't believe Jesus was the sacrifice for sin?\n \n \nFrom whom does William Branham derive his authority to teach and preach? \n \n \nNot the Pope that's for sure\n\n \n That's for sure! But from whom does he derive his authority?\n \n \nThe Mother is worshipped not the Son.. oh that's right, Mary has been given secretarial duties...running the prayers of the mortals to the Son?Correct?\n \n \n Mary is not worshipped in the Catholic Church. She is honored. \n A few questions concerning this: 1. Do you believe that Mary is your mother and the mother of the Church? 2. Do you believe in the 4th commandment? 3. Do you call Mary \"blessed?\" 4. Do you honor her? 5. Do you believe that has been the closest human to God in all of history past, present, and future?\n \n By the way, have you ever asked someone to pray for you? Has anyone ever asked you to pray for them?\n \n \nYet don't see God\n \n \n How do you know the hearts of these people?\n \n \nWell reading the history, likewise,the scandle in the present of the church isn't a mirror to what God represents. A church like that...can only run out the sheep \n \n \n Scandal has been with the Church since the beginning. Judas is the prime example.\n But you don't leave the truth of Jesus because of the sin of Judas.\n \n \nLucifer is the MASTER of purgatory, where is it scriptural that one can live in sin with a safety Bin? \n \n \n You misunderstand purgatory. Purgatory is a temporary state or process of purification for those who die in the state of grace and are already destined for heaven. Do you believe what is written in Revelation...that nothing unclean will enter heaven?", 
   {
    "unicode_changes_made": true
   }, 
   13125, 
   null, 
   1060743180.0
  ], 
  [
   13212, 
   null, 
   "XYOU", 
   "That Pope is too old to be a leader of a party claimed of having billions of members in the world ???", 
   {}, 
   10855, 
   null, 
   1060744380.0
  ], 
  [
   13213, 
   null, 
   "Broker", 
   "I think his aides are taking advantage of that... I really do. He has a lot to manage... there's no way he can do it properly. *COUGH*PRIEST ABUSE SCANDAL*COUGH*\n \n Now the Vatican Secret Police are going to get me for saying that... the Chirstopo with Bible dart guns.. :(", 
   {}, 
   13212, 
   null, 
   1060745040.0
  ], 
  [
   13216, 
   null, 
   "dreamweaver", 
   "Come on now people, let's keep this civil. We are forgetting one of the most important Bible verses:\n \n Galatians 3:28 :: New International Version (NIV)\n There is neither Jew nor Greek, slave nor free, male nor female, for you are all one in Christ Jesus.\n \n If this Bible verse had been updated, I strongly believe that they would have added \"Protestant nor Catholic, Orthodox nor Presbyterian\".", 
   {}, 
   13213, 
   null, 
   1060749480.0
  ], 
  [
   13274, 
   null, 
   "Phat_Albert87", 
   "I think his aides are taking advantage of that... I really do. He has a lot to manage... there's no way he can do it properly. *COUGH*PRIEST ABUSE SCANDAL*COUGH*\n \n Now the Vatican Secret Police are going to get me for saying that... the Chirstopo with Bible dart guns.. :(\n\n \n C'mon people, there is no such thing as a \"Pope Posse\" that hunts down critics of the church (no matter how ill-informed they are).", 
   {}, 
   13213, 
   null, 
   1060811940.0
  ], 
  [
   13276, 
   null, 
   "Broker", 
   "The Christopo exists... it must! And they are going to get me. And you! All of us!", 
   {}, 
   13274, 
   null, 
   1060812900.0
  ], 
  [
   13278, 
   null, 
   "Phat_Albert87", 
   "Its surprising that a conservative such as yourself is thinking with his heart rather than with his head.", 
   {}, 
   13276, 
   null, 
   1060813500.0
  ], 
  [
   13281, 
   null, 
   "gilligan8503", 
   "since we are tlaking about the pope. who here thinks the pope runs the catholic church? wrong. have you ever heard of the black pope? swedish guy... basically, the catholic church practices a lot of cover-ups.", 
   {}, 
   13278, 
   null, 
   1060816260.0
  ], 
  [
   13284, 
   null, 
   "maximus", 
   "Dreamweaver,\n Do not take this as ingratitude. I appreciate your diplomacy. I try to dialogue and interact with all Christians (and all humans) as brothers in Christ (or brothers). In debate, however, I do not mind exchanging stern words (though keeping it civil). The apostles would do no less. \n \n Now, Galatians makes a good statement on the universality of the Church. It is \"equal opportunity.\" It accepts from any nation, race, or ethnic group. \n \n But I don't think your revision of Galatians would have been accepted. I do not think Paul would have allowed some of the doctrinal diversion that occurs today. John 10:16  says that there shall be one fold and one shepherd and Philemon 2:2 says to be of the same mind, united in heart, thinking one thing. Paul told us to beware of someone preaching another Christ. The problem with the approximately 33,000 denominations of Christianity is that the truth does not remain intact. It is watered down, misunderstood, misrepresented, perverted, and even invented. The Church must be one. \n \n Peace.", 
   {}, 
   13281, 
   null, 
   1060822920.0
  ], 
  [
   13286, 
   null, 
   "rapture", 
   "Why would you think I don't believe Jesus was the sacrifice for sin?\n\n \n God\n \n \n \nThat's for sure! But from whom does he derive his authority?\n\n \n Holy Ghost\n \n \nMary is not worshipped in the Catholic Church. She is honored. \n A few questions concerning this: 1. Do you believe that Mary is your mother and the mother of the Church?\n\n \n No, sister in Christ\n \n \n \n 2. Do you believe in the 4th commandment? 3. Do you call Mary \"blessed?\" 4. Do you honor her?\n\n \n Well when I get to heaven I'm not going to kick her in the eye or anything, nor make a statue and fall down on my knees before her\n \n \n5. Do you believe that has been the closest human to God in all of history past, present, and future?\n\n \n No \n \n \nBy the way, have you ever asked someone to pray for you? Has anyone ever asked you to pray for them?\n\n \n \n Sure....but I know if I want sin forgiven I must Go before God, myself\n \n \n \n \n \nHow do you know the hearts of these people?\n\n \n \n When they call a man HOLY FATHER ( How depression) \n \n \n \nScandal has been with the Church since the beginning. Judas is the prime example.\n\n \n \n \nSBut you don't leave the truth of Jesus because of the sin of Judas.\n\n \n God is infinite how can I possibly leave?\n \n \n \nYou misunderstand purgatory. Purgatory is a temporary state or process of purification for those who die in the state of grace and are already destined for heaven. Do you believe what is written in Revelation...that nothing unclean will enter heaven?\n\n \n \n So the devil's wash right off? Doesn't sound like a state of Grace durning Death.", 
   {
    "unicode_changes_made": true
   }, 
   13284, 
   null, 
   1060827600.0
  ], 
  [
   13302, 
   null, 
   "maximus", 
   "Rapture,\n \nHoly Ghost\n\n Can your preacher trace himself back to the authority granted by Christ himself?\n \n \nNo, sister in Christ\n\n You may want to read your Bible. Mary is the Queen of heaven and your mother, the mother of the Church, the mother of us all. Mary is the Mother of Salvation. Read the entire 12th chapter of Revelation . Who do you think \"brought forth a male child, one who is to rule all the nations?\" (Rev 12:5) \"Then the dragon went off to make war on the rest of her offspring, on those who keep the commandments of God and bear testimony to Jesus.\" (Rev 12:17) Do you keep the commandments and bear testimony to Jesus? If so, then you are Mary's child.\n \n \nWell when I get to heaven I'm not going to kick her in the eye or anything, nor make a statue and fall down on my knees before her\n\n \n Refer to the 4th commandment: Honor your father and your mother. Jesus was without sin as it says in Hebrews. Jesus kept the commandments perfectly. If Jesus kept the commandments then he honored his mother. Can anyone keep the commandments better then Jesus? Then how must he have honored his mother? Do you honor YOUR mother, Mary? \n \n Mary \"is blessed among women.\" Mary states also that \"ALL generations shall call me blessed.\" (Luke 1:48) Does our generation call her blessed? Blessed among women? Yes. Blessed among any human past, present, or future? Yes. Why do I say this? Because Jesus was not created, he was begotten. He was not a human creation. Mary, on the other hand, was a human creation. However, she had a more intimate union with God than any human has experienced and will ever experience. No one has been closer to God than Mary. She held God in her womb. Consider this quotation, \"I have long recognized the unique vocation of our Lady, called to the highest honor among all created beings. It is a fact of history that, if true honor  is not paid to her as the Mother of God, people put our Lord in her place as the highest of creation  rather than adoring him as God Incarnate.\" Rev. Msgr. Graham Leonard from The Path to Rome (emphasis mine). \n \n \nDo you believe that Mary has been the closest human to God in all of history past, present, and future?\n \n \nNo \n \n \n Mary is not only the mother of God but also the bride of God. It is written in scripture that the Holy Spirit overshadowed her. Mary was betrothed to God.\n \n Mary is the ark of the New Covenant. The Old Testament Ark is only a type. It is a type that prefigures the perfection and reality of the New Testament ark. Consider the following parallels:\n \n David rose and went up to the hill country of Judea. (2 Sam 6:2-4)\n Mary rose and went up to the hill country of Judea. (Luke 1:39)\n \n David asked, \"Who am I that the ark of the Lord should come to me?\" (2 Sam 6:9) \n Elizabeth asked, \"Who am I that the mother of my Lord should come to me? (Luke 1:43)\n \n The Ark stayed in the House of Obededom for 3 months. (2 Sam 6:11)\n Mary (the new ark) stayed in Elizabeth's house for 3 months. (Luke 1:56)\n \n David's response to the Ark was to leap and dance. (2 Sam 6:14)\n John the Baptist responded to Mary by leaping in his mother's womb (Luke 1:41)\n \n The tabernacle that housed the Ark was covered or overshadowed by the glory cloud and the glory of the Lord filled the tabernacle. (Exodus 40:34-35)\n The Holy Spirit overshadowed Mary as told in the Annunciation. (Luke 1:35)\n \n The ark contained the Law/Lord of God in the Ten Commandments, the urn of manna, and the staff of the true priesthood of Aaron. (Deut 10:3-5, Heb 9:4)\n Mary contained the Law/Word of God in flesh, the bread of life, and the true priest. (Matthew 1:23, Luke 1:35, John 1:1, 14, John 6:31-33, Heb 3:1) \n \n Luke knew scripture! Do you know how sacred the Ark of the Covenant was in the Old Testament? If anyone but the high priest touched it or looked on it then they died (1 Samuel 6:19 and 2 Samuel 6:7)-a good reason that Joseph dared not touch the Ark of the New Covenant. Is it coincidence that John says he saw the ark of the covenant in Revelation 11:19  then he begins describing the portent of Mary? (based upon Mary: The Mother of God video from Steve Ray's Footprints of God series).\n \n Mary was the perfect disciple. She was stronger than Peter who denied Christ 3 times and the other apostles that fled at Christ's crucifixion. Her words show how willingly she followed God, \"Behold, I am the handmaid of the Lord; let it be to me according to your word.\" (Luke 1:38) Jesus gave her to the \"disciple whom he loved\" at the Cross. Why is he entrusting her to someone else's protection if he took her lightly? Why to the disciple whom he loved? Mary had an intimate relationship with the apostles as seen with her relationship with John and her presence with the apostles praying shortly after the death and appearance of Christ. (Acts 1:12)\n \n \nSure....but I know if I want sin forgiven I must Go before God, myself\n\n \n We ask Mary to intercede for us with her prayers. We ask her to pray to Jesus for us just as you ask someone here on earth to pray for you. Her ability to intercede is fact and can be seen in her intercession at the wedding of Cana. Jesus told her it was not his time but he ended up performing the miracle of turning water to wine at her request. This is concrete in scripture if you read 1 Timothy 2:1, \"First of all, then, I urge that supplications, prayers, intercessions, and thanksgivings be made for all men.\" This is written just before the line Protestants quote on the one mediator. Another concrete example of the acceptance of prayer for intercession can be found in Revelation 8:3 where it describes the prayers of saints being presented before God. So we ask the saints to pray for us. We do not pray to dead people because the saints are not dead, they are living in heaven.\n \n \nSo the devil's wash right off? Doesn't sound like a state of Grace durning Death\n\n \n Revelation 21:27, \"nothing unclean shall enter heaven\"\n \n 1 Corinthians 3:10-15  \"...each man's work will become manifest; for the Day will disclose it, because it will be revealed with fire, and the fire will test what sort of work each one has done. If the work which any man has built on the foundation survives, he will receive a reward. If any man's work is burned up, he will suffer loss, though he himself will be saved, but only as through fire.\"", 
   {
    "unicode_changes_made": true
   }, 
   13286, 
   null, 
   1060838700.0
  ], 
  [
   18858, 
   null, 
   "Stro777", 
   "Well, I could say that Sola Scriptura (Scripture Alone) was never used by the first Christians, much less sanctioned in the bible. In fact, Peter speaks against this (2 Peter 1:21-21). \n \n Paul explicitly states all Christians to \"stand firm and hold to the traditions which you were taught by us, either by word of mouth or by letter\" (2 Thess. 2:15).\n\n \n So which traditions did they have back then? Infant baptism? No. Praying to Mary and the saints? No. Confession to a priest? No. The candle tradition? No. Confirmation? No. So which traditions do YOU think they were talking about friend?", 
   {}, 
   8791, 
   null, 
   1065762720.0
  ], 
  [
   18861, 
   null, 
   "Stro777", 
   "Well Maximus...here we go.\n \n Quote:\n \"You may want to read your Bible. Mary is the Queen of heaven and your mother, the mother of the Church, the mother of us all. Mary is the Mother of Salvation. Read the entire 12th chapter of Revelation . Who do you think \"brought forth a male child, one who is to rule all the nations?\" (Rev 12:5) \"Then the dragon went off to make war on the rest of her offspring, on those who keep the commandments of God and bear testimony to Jesus.\" (Rev 12:17) Do you keep the commandments and bear testimony to Jesus? If so, then you are Mary's child.\"\n \n Well, buddy, I read Rev Chapter 12, and guess what? I believe it talks about Mary too. One problem with your thinking. No where does it say that anyone prayed to Mary, or that Mary prayed for anyone else. Isn't that interesting?\n \n Quote:\n \"Refer to the 4th commandment: Honor your father and your mother. Jesus was without sin as it says in Hebrews. Jesus kept the commandments perfectly. If Jesus kept the commandments then he honored his mother. Can anyone keep the commandments better then Jesus? Then how must he have honored his mother? Do you honor YOUR mother, Mary? \n \n Mary \"is blessed among women.\" Mary states also that \"ALL generations shall call me blessed.\" (Luke 1:48) Does our generation call her blessed? Blessed among women? Yes. Blessed among any human past, present, or future? Yes. Why do I say this? Because Jesus was not created, he was begotten. He was not a human creation. Mary, on the other hand, was a human creation. However, she had a more intimate union with God than any human has experienced and will ever experience. No one has been closer to God than Mary. She held God in her womb.\"\n \n Your first paragraph doesn't have any meaning of why we should pray to Mary. Duh, we are supposed to honor our father and mother. Are we supposed to WORSHIP our father and mother? I think not. They are human and sinners. Mary was a SINNER. How about the verses Romans 3:10 and 3:23? ALL have sinned and fall short of the glory of God. That includes Mary, but does not include Jesus. Jesus was God in the flesh. Mary was not.\n \n Secondly, yes Mary IS blessed among women. I called her blessed. That was quite a blessing, but I am not going to pray to a sinner, regardless of how blessed they are. Why would you?\n \n Quote:\n \"Consider this quotation, \"I have long recognized the unique vocation of our Lady, called to the highest honor among all created beings. It is a fact of history that, if true honor is not paid to her as the Mother of God, people put our Lord in her place as the highest of creation rather than adoring him as God Incarnate.\" Rev. Msgr. Graham Leonard from The Path to Rome (emphasis mine).\"\n \n Heh, it isn't scripture buddy. Why should we even consider it truth then? Back it up with scripture, then talk to me.\n \n Quote:\n \"Mary is not only the mother of God but also the bride of God. It is written in scripture that the Holy Spirit overshadowed her. Mary was betrothed to God.\n Mary is the ark of the New Covenant. The Old Testament Ark is only a type. It is a type that prefigures the perfection and reality of the New Testament ark. Consider the following parallels:\n David rose and went up to the hill country of Judea. (2 Sam 6:2-4)\n Mary rose and went up to the hill country of Judea. (Luke 1:39)\n David asked, \"Who am I that the ark of the Lord should come to me?\" (2 Sam 6:9) \n Elizabeth asked, \"Who am I that the mother of my Lord should come to me? (Luke 1:43)\n The Ark stayed in the House of Obededom for 3 months. (2 Sam 6:11)\n Mary (the new ark) stayed in Elizabeth's house for 3 months. (Luke 1:56)\n David's response to the Ark was to leap and dance. (2 Sam 6:14)\n John the Baptist responded to Mary by leaping in his mother's womb (Luke 1:41)\n The tabernacle that housed the Ark was covered or overshadowed by the glory cloud and the glory of the Lord filled the tabernacle. (Exodus 40:34-35)\n The Holy Spirit overshadowed Mary as told in the Annunciation. (Luke 1:35)\n The ark contained the Law/Lord of God in the Ten Commandments, the urn of manna, and the staff of the true priesthood of Aaron. (Deut 10:3-5, Heb 9:4)\n Mary contained the Law/Word of God in flesh, the bread of life, and the true priest. (Matthew 1:23, Luke 1:35, John 1:1, 14, John 6:31-33, Heb 3:1) \n \n Luke knew scripture! Do you know how sacred the Ark of the Covenant was in the Old Testament? If anyone but the high priest touched it or looked on it then they died (1 Samuel 6:19 and 2 Samuel 6:7)-a good reason that Joseph dared not touch the Ark of the New Covenant. Is it coincidence that John says he saw the ark of the covenant in Revelation 11:19 then he begins describing the portent of Mary? (based upon Mary: The Mother of God video from Steve Ray's Footprints of God series).\"\n \n Alright, here is where things get sticky. I'm not sure if Mary is the Ark of the New Covenant or not, but I do know one thing. Joseph did touch Mary and they did have children together. Check Matt. 13:55-56. Jesus had brothers and sisters. Also see Mark 6:3. And besides, what does it matter if Mary is the new Ark? Did the Jews pray to the Ark? Nope. They prayed to God.\n \n Quote:\n \"Mary was the perfect disciple. She was stronger than Peter who denied Christ 3 times and the other apostles that fled at Christ's crucifixion. Her words show how willingly she followed God, \"Behold, I am the handmaid of the Lord; let it be to me according to your word.\" (Luke 1:38) Jesus gave her to the \"disciple whom he loved\" at the Cross. Why is he entrusting her to someone else's protection if he took her lightly? Why to the disciple whom he loved? Mary had an intimate relationship with the apostles as seen with her relationship with John and her presence with the apostles praying shortly after the death and appearance of Christ. (Acts 1:12)\"\n \n First of all, lets get one thing straight. The verse is Acts 1:14, not Acts 1:12.\n Okay, now to your main points. So she didn't deny Christ like Peter did. Whoopdie do...did she sin even once? According to the book of Romans chapter 3 she did. That would mean she was going to hell like everyone else who sinned and had to accept Christ like everyone else to go to heaven. Was she blameless? No. If she was, she could have been crucified. Was she crucified for our sins? Thank goodness no. And besides, who cares if she had an intimate relationship with the apostles or not? Does that make her special? Special enough to pray to? I don't think so.\n \n Quote:\n \"We ask Mary to intercede for us with her prayers. We ask her to pray to Jesus for us just as you ask someone here on earth to pray for you. Her ability to intercede is fact and can be seen in her intercession at the wedding of Cana. Jesus told her it was not his time but he ended up performing the miracle of turning water to wine at her request. This is concrete in scripture if you read 1 Timothy 2:1, \"First of all, then, I urge that supplications, prayers, intercessions, and thanksgivings be made for all men.\" This is written just before the line Protestants quote on the one mediator. Another concrete example of the acceptance of prayer for intercession can be found in Revelation 8:3 where it describes the prayers of saints being presented before God. So we ask the saints to pray for us. We do not pray to dead people because the saints are not dead, they are living in heaven.\"\n \n True, Mary did intercede at the wedding. But let me ask you this? Should we pray to Jesus even? No. You were very close with 1 Timothy 2:1 to coming on to something very good. You should have looked down a few verses because right there in 1 Tim 2:5 it says, \"For there is one God, and one mediator between God and men, the man Christ Jesus;\" Oh my. That sounds like only Jesus mediates for us in heaven. I noticed Mary isn't mentioned anywhere in that passage. Jesus Himself said in John 16:23 \"And in that day ye shall ask me nothing. Verily, verily, I say unto you, Whatsoever ye shall ask the Father in my name, he will give it you.\" So tell me this, if we can receive things directly from the father by praying TO THE FATHER, why waste time by praying to Mary and other saints (assuming we should)? In essence, you are saying that instead of asking the head of the company for a job, even though he guaranteed it to you, you would ask his son's mom to ask the son who would, in turn, ask his dad? That is just plain silly.\n \n Also, the prayers of the saints in Rev 8:3 being poured out is talking about the end times. I don't know about you, but I would rather have my prayers answered by God before I get raptured up, wouldn't you?\n \n Quote:\n \"Revelation 21:27, \"nothing unclean shall enter heaven\"\n \n 1 Corinthians 3:10-15 '...each man's work will become manifest; for the Day will disclose it, because it will be revealed with fire, and the fire will test what sort of work each one has done. If the work which any man has built on the foundation survives, he will receive a reward. If any man's work is burned up, he will suffer loss, though he himself will be saved, but only as through fire.' \"\n \n I don't really understand what you are trying to say here. Are you trying to say you can work your way into heaven? Ephesians 2:8-9 blows that right out of the water. \"For by grace are ye saved through FAITH...\" That seems pretty straight forward to me.\n \n Anyway, bottom line is that Mary is a human. Humans sin. Sinners go to hell unless they accept Christ. The Bible doesn't want us to pray to sinners. The only way we are made perfect is by accepting the free gift of salvation through Jesus Christ our Lord. And by the way, that guy was right when he said, \"Sure....but I know if I want sin forgiven I must Go before God, myself\" Check the scriptures. Romans 10:9, 14:11, Phil 2:11 just to name a few. YOU must confess that Jesus is the Son of God, that he died for YOUR sins, that he rose on the third day, and that YOU accept his perfect sacrifice of himself to cover YOUR sins. Unless you do that, you will die and spend an eternity in hell. There are plenty of people who think they can confess to a priest and do good things to get into heaven. Jesus said in Matt 7:22-23 \"Many will say to me in that day, Lord, Lord, have we not prophesied in thy name? and in thy name have cast out devils? and in thy name done many wonderful works?\n And then will I profess unto them, I never knew you: depart from me, ye that work iniquity.\" They can't. If they live that way, they will die and spend eternity in hell. Only by accepting Christ can we have hope of eternal salvation. Think on that.\n \n One last issue. Mary statues. Two verses say that you should not make statues of Mary or Christ. Exodus 20:4-5.\n \n I will pray for you. I would appreciate any email form any of you that find this an encourgement or if you disagree totally. That is fine by me. I will disagree right back =). My email is killergerbil@hotmail.com. Thank you.", 
   {
    "unicode_changes_made": true
   }, 
   13302, 
   null, 
   1065769440.0
  ], 
  [
   18877, 
   null, 
   "montalban", 
   "So which traditions did they have back then? Infant baptism? No. Praying to Mary and the saints? No. Confession to a priest? No. The candle tradition? No. Confirmation? No. So which traditions do YOU think they were talking about friend?\n\n \n They had the Eucharist - see the Didache c.150AD. Most Protestant churches instead have just bread as a symbol. The first church was so adamant that it was the actual Body of Christ that many pagans accused them of being cannibals.\n \n Conversely, they lost some traditions, such as the prohibition on pork, preaching to the Gentiles, removing head-scarves from women and having women separated from the rest of the congregation - as Jesus empowered them to do.\n \n Infant Baptism...\n \"The first time the Gospel was ever proclaimed was on the day of Pentecost by the Apostle Peter. In his Spirit-inspired sermon he made it clear that the blessing and promise of salvation was not just for adults, but for children as well. \n \"And Peter said to them, 'Repent and let each of you be baptised in the name of Jesus Christ for the forgiveness of your sins; and you shall receive the gift of the Holy Spirit. For the promise is for you and your children, and for all who are far off as many as the Lord our God shall call to Himself \" (Acts 2:38,39). \n \n It is also interesting to note that this quote from Peter's Pentecostal sermon does not merely state \"... the promise is for you and children,\" but \"for you and your children,\" which makes it clear that the children mentioned here were young enough to still be considered under the protection and authority of their parents. This is underscored when one understands that it was common for women and men to marry at the very young ages of twelve and thirteen, respectively. From this it becomes reasonable to assume that these children to whom Peter refers were young juveniles or, at the very least, in their preadolescence. \"\n http://www.goarch.org/en/ourfaith/articles/article7067.asp\n \n Whole households were baptised...\n \"Although this is only indirect Scriptural evidence, the fact that the Bible mentions that entire \"households\" were baptised does make it seem probable that children and infants were included. \"Now I did baptise the household of Stephanas . . . \" (1 Corinthians 1:16) (An angel spoke to Cornelius saying) \"Send to Joppa, and have Simon, who is called Peter, brought here; and he shall speak words to you by which you will be saved, and all your household \" (Later, when Peter arrived at (Cornelius' household) \"... he ordered them to be baptised.\"(Acts 11:13b, 14; Acts 10:48a) \"And when she (Lydia of Thyatira) and her household had been baptised . . . \" (Acts 16:15a) \"Believe in the Lord Jesus, and you shall be saved, you and your household . . . and immediately he was baptised, he and all his household. \" (Acts 16:31, 33b) We know that the Greek word oikos, translated \"house\" or \"household,\" has traditionally included infants and children in its meaning for several reasons. There is no evidence of this word being used either in secular Greek, Biblical Greek,or in the writing of Hellenistic Judaism in a way which would restrict its meaning only to adults. The Old Testament parallel for \"house\" carries the sense of the entire family. The Greek translation of the original Hebrew manuscripts (completed in 250 B.C.) uses this word when translating the Hebrew word meaning the complete family (men, women, children, infants). Similarly, we know that the phrase \"he and his house\" refers to the total family; the Old Testament use of this phrase clearly demonstrates this by specifically mentioning the presence of children and infants at times. \"\n Ibid.\n \n Praying to Saints \n \"Paul, an apostle of Jesus Christ by the will of God, to the saints which are at Ephesus, and to the faithful in Christ Jesus.\" (Eph. 1:1 KJV) Here is St. Paul writing to the Ephesians. He calls them saints. At the end of the book of Ephesians (6:18-19), he tells these saints to pray for him: \"Praying always with all prayer and supplication in the Spirit, and watching thereunto with all perseverance and supplication for all saints; And for me, that utterance may be given unto me, that I may open my mouth boldly.?\" (KJV) \"\n http://www.catholicism.org/pages/praying.htm\n \n Tertullian (211) \n Wrote that Christians offered prayer and the Eucharist for the deceased on the anniversaries of their death. \n St. Augustine (354 - 430) \n Neither are the souls of the pious dead separated from the Church, which even now is the Kingdom of Christ. Otherwise there would be no remembrance of them at the altar of God in the communication of the Body of Christ. \n http://www.catholicapologetics.org/ap070600.htm\n \n Confession to a priest? Maximus covered that in another post - confessing our sins to one another is Biblical.\n \n Candles come from Jewish tradition.\n \n Confirmation or Chrismation as we call it in Orthodoxy is the coming of the Holy Spirit. This is clearly in Acts... at the time of Pentecost.\n \n Perhaps you might want to re-think your statement.", 
   {}, 
   18858, 
   null, 
   1065778080.0
  ], 
  [
   18916, 
   null, 
   "Stro777", 
   "First of all, the Didache was never accepted as canonical. Also, what are you saying about preaching to the Gentiles? Unless you are Jewish, you are a Gentile. The Bible talks about salvation being for the Gentiles also. See Romans 11:11 or Acts 28:28 to see that we are supposed to preach to the Gentiles. Be thankful of that seeing that you are one.\n \n In that time period, wives and children had to do as their father commanded. They lacked individuality. That would make sense then that when the father of the household did what Acts says, \"Repent and let each of you be baptized in the name of Jesus Christ for the forgiveness of your sins; and you shall receive the gift of the Holy Spirit. For the promise is for you and your children, and for all who are far off as many as the Lord our God shall call to Himself \" (Acts 2:38,39), that he would no doubt make his family do the same. But they weren't JUST baptized. They REPENTED and were baptised. They didn't just get sprinkled with water either. Any Biblical baptism was by complete immersion. I was saved and baptized when I was seven years old. I was still a child, but old enough to understand.\n \n When Paul was talking about saints, he was talking about the believers at Ephesus. And besides, the saints were still IN Ephesus at that time were they not? Anyway, I ask people to pray for me all the time. The Greek word used in Eph 1:1 is merely talking about religious, consecrated people. Believers.\n \n Confessing our faults to one another IS scriptural, but confessing to be forgiven must go directly to God. If you doubt me on this look it up in Romans 14:11. This clearly says that we confess to God. But, like I said before, it is good to confess our faults to other believers. James 5:16 tells us this. But that does not mean we confess to men and are forgiven by men. A priest has no power to forgive sins. Only God has that power. Check Mark 2:7.\n \n Candles do come from a Jewish tradition, but that is not the way the Catholics do it.\n \n And as for confirmation, the coming of the Holy Spirit happens when a person believes, repents, and is Baptized. Acts 2:38 tells us that one. So are you Baptized on your confirmation day?\n \n So maybe you want to re-think YOUR statements.", 
   {}, 
   18877, 
   null, 
   1065809160.0
  ], 
  [
   18944, 
   null, 
   "montalban", 
   "First of all, the Didache was never accepted as canonical.\n\n \n It is accepted as authorative by the same Church that decided not to include it in the Bible. You're being very selective in that you're accepting one decision by the Church, but not the others. (You accept the Bible as presented to you by the Orthodox Church).\n \n The Didache pre-dates the compilation of the Bible. Further, you didn't address the claims made by pagans. It was common for them to criticise early Christians as cannibals... because they partook of the Eucharist\n \n \n Also, what are you saying about preaching to the Gentiles? Unless you are Jewish, you are a Gentile. The Bible talks about salvation being for the Gentiles also. See Romans 11:11 or Acts 28:28 to see that we are supposed to preach to the Gentiles. Be thankful of that seeing that you are one.\n\n \n Jesus was a Jew. He preached to Jews. The early Church made a decision to spread teachings beyond Jews - to Gentiles. This decision is in the Bible - there was a meeting in Jerusalem. They made the decision because they had the authority to do so.\n \n \n \nIn that time period, wives and children had to do as their father commanded. They lacked individuality. That would make sense then that when the father of the household did what Acts says, \"Repent and let each of you be baptised in the name of Jesus Christ for the forgiveness of your sins; and you shall receive the gift of the Holy Spirit. For the promise is for you and your children, and for all who are far off as many as the Lord our God shall call to Himself \" (Acts 2:38,39), that he would no doubt make his family do the same. But they weren't JUST baptised. They REPENTED and were baptised. They didn't just get sprinkled with water either. Any Biblical baptism was by complete immersion. I was saved and baptised when I was seven years old. I was still a child, but old enough to understand.\n\n \n So, the infants were still baptised, whether they were able to understand it or not. You're not actually arguing against what I said at all. A moment ago you were arguing infant baptism was absolutely non-Biblical, now you're qualifying it.\n \n \nWhen Paul was talking about saints, he was talking about the believers at Ephesus. And besides, the saints were still IN Ephesus at that time were they not? Anyway, I ask people to pray for me all the time. The Greek word used in Eph 1:1 is merely talking about religious, consecrated people. Believers.\n\n \n So what? He asked the Saints to pray for him. Again you're not arguing against what I said, just presenting more evidence that agrees with me. Again you're now back-pedalling rather than admitting you were wrong to make a statement dealing with absolutes.\n \n \nConfessing our faults to one another IS scriptural, but confessing to be forgiven must go directly to God. If you doubt me on this look it up in Romans 14:11. This clearly says that we confess to God. But, like I said before, it is good to confess our faults to other believers. James 5:16 tells us this. But that does not mean we confess to men and are forgiven by men. A priest has no power to forgive sins. Only God has that power. Check Mark 2:7.\n\n \n You are asked by Jesus to forgive your brother, not seven times, but seven times seventy times. I'm not sure if you're familiar with the Bible... if you want I can provide the verse.\n \n \nCandles do come from a Jewish tradition, but that is not the way the Catholics do it.\n\n \n Isn't it. Tell me why then.\n \n \nAnd as for confirmation, the coming of the Holy Spirit happens when a person believes, repents, and is Baptised. Acts 2:38 tells us that one. So are you Baptised on your confirmation day?\n\n \n Look at Pentecost. They were not baptised then! They'd already been baptised.\n \n Look at Acts 19: Paul finds people who were baptised but hadn't even heard of the Holy Spirit!\n \n Dragging out a single passage won't help your cause. You've got to look at what was the rule and what was the exception - thus the thief on the cross was neither baptised nor confirmed, but still Jesus said that he was going to be with Jesus in heaven. Another case of looking at absolutes.\n \n I was not Baptised on my confirmation day.\n \n \nSo maybe you want to re-think YOUR statements.\n\n \n I have. But, you should actually present an argument - rather than just rattling off facts... especially if they don't help your case.\n \n The problem is you are just taking verses out of the Bible willy-nilly. I can, if I so desire do likewise. That is the weakness of the Bible - which is why it was never intended to be the only work to call upon. For when people interpret it for themselves, outside of the guides of Holy Tradition - the result is 100,000s of Christian churches. That is what is so wrong with the Protestant Churches - they present to the non-Christian world 'evidence' that Christianity has lost its way.\n \n Do you handle snakes? Do the women in your church cover their heads? It says to do so in the Bible.", 
   {}, 
   18916, 
   null, 
   1065833340.0
  ], 
  [
   19021, 
   null, 
   "Stro777", 
   "Quote:\n \n \"It is accepted as authorative by the same Church that decided not to include it in the Bible. You're being very selective in that you're accepting one decision by the Church, but not the others. (You accept the Bible as presented to you by the Orthodox Church).\n \n The Didache pre-dates the compilation of the Bible. Further, you didn't address the claims made by pagans. It was common for them to criticise early Christians as cannibals... because they partook of the Eucharist\"\n \n Which church would that be?\n \n I would suppose that if I had never heard of communion and someone quoted Jesus saying this is my body, I would have some concerns also. That doesn't mean anything however because the pagans obviously didn't know enough about it.\n \n Quote:\n \n \"Jesus was a Jew. He preached to Jews. The early Church made a decision to spread teachings beyond Jews - to Gentiles. This decision is in the Bible - there was a meeting in Jerusalem. They made the decision because they had the authority to do so.\"\n \n Wrong. Jesus made the decision in the great commission. Check Matt 28:19.\n \n Quote:\n \n \"So, the infants were still baptised, whether they were able to understand it or not. You're not actually arguing against what I said at all. A moment ago you were arguing infant baptism was absolutely non-Biblical, now you're qualifying it.\"\n \n No, I was saying that you have to believe before you can get baptized. I quoted Acts 2:38. It says, \"Then Peter said unto them, Repent, and be baptized every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost.\" That means that baptism alone doesn't save you. The repenting factor is listed first. Without it, you have nothing. So what exactly would the point of baptising an infant be if they can't repent? You can't be forgiven without repentance. Infant baptism does nothing, and it can not be proven that Jesus and his diciples taught such things.\n \n Quote:\n \n \"So what? He asked the Saints to pray for him. Again you're not arguing against what I said, just presenting more evidence that agrees with me. Again you're now back-pedalling rather than admitting you were wrong to make a statement dealing with absolutes.\"\n \n He asked the LIVING saints to pray for him. He didn't pray to ask the saints in heaven to pray for him. Is it ever written in scripture that anyone asked the saints in heaven to pray for them? I can't seem to find it. Probably because it isn't in there.\n \n Quote:\n \n \"You are asked by Jesus to forgive your brother, not seven times, but seven times seventy times. I'm not sure if you're familiar with the Bible... if you want I can provide the verse.\"\n \n Yes, we are asked to forgive our brother. No, our brother does not have the power to cleanse us of our sins. Only the power of the blood of Jesus can do that. On a side note, why did you have to get insulting? I wasn't insulting your intelligence. Obviously I quoted more scripture than you have. The biggest time you used scripture was a quote from someone else. It wasn't even your work. And by the way, since you obviously don't know the chapter and verse of that scripture off hand, it is in Matt 18:22.\n \n Quote:\n \n \"Isn't it. Tell me why then.\" (talking about the Jewish candle tradition.)\n \n The Catholics light candles in honor of saints. The Jews never did that.\n \n Quote:\n \n \"Look at Pentecost. They were not baptised then! They'd already been baptised.\n \n Look at Acts 19: Paul finds people who were baptised but hadn't even heard of the Holy Spirit!\n \n Dragging out a single passage won't help your cause. You've got to look at what was the rule and what was the exception - thus the thief on the cross was neither baptised nor confirmed, but still Jesus said that he was going to be with Jesus in heaven. Another case of looking at absolutes.\n \n I was not Baptised on my confirmation day.\"\n \n I am so gald you brought this point up. In Acts 19, they had been baptized wrongly. If you read it, they were baptised AGAIN in the correct fashion. I am even more happy that you brought up the thief on the cross. You don't actually need rituals to get you into heaven. There are verses that talk about salvation, but say nothing of baptism. The thief on the cross simply had faith in Christ and obviously turned from his sin, and that was enough to get him into heaven. Baptism in itself does not wash away sin. As I have said many times before, it takes repentance to be saved. Some of those verses I was talking about are 2 Thes:2:13, Romans 1:16, Romans 10:10, and 2 Tim 3:15. So thank you for siding with my point.\n \n Quote:\n \n \"I have. But, you should actually present an argument - rather than just rattling off facts... especially if they don't help your case.\n \n The problem is you are just taking verses out of the Bible willy-nilly. I can, if I so desire do likewise. That is the weakness of the Bible - which is why it was never intended to be the only work to call upon. For when people interpret it for themselves, outside of the guides of Holy Tradition - the result is 100,000s of Christian churches. That is what is so wrong with the Protestant Churches - they present to the non-Christian world 'evidence' that Christianity has lost its way.\n \n Do you handle snakes? Do the women in your church cover their heads? It says to do so in the Bible.\"\n \n You last statements greatly sadden me, friend. I was not just \"rattling off facts,\" but rather I was quoting Biblical truths. And from this post, I believe they have helped my cause.\n \n Also, for you to say there is a weakness in the Bible shows me that I am probably wasting my time with you. God's Word says in 2 Tim 3:16-17, \"All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness:\n That the man of God may be perfect, thoroughly furnished unto all good works.\" It also states in 2 Peter 1:21, \"For the prophecy came not in old time by the will of man: but holy men of God spake as they were moved by the Holy Ghost.\" For you to say that there is a flaw in God's Holy Word is to say that God does not know what He is doing. And about your interpretation line, 2 Peter 1:20 says, \"Knowing this first, that no prophecy of the scripture is of any private interpretation.\" Your treasured \"holy tradition\" you can keep. For quite some time, the Catholic church threw people in prision and killed them for even reading the scriptures. That is because they knew that many scriptures went against their teachings. My church never did that. My church gets their beliefs from the Bible alone. I belive that God's word is much better than any men's \"holy traditions\" don't you? Or would you prefer to put man's words above God's? Either way it is your choice I guess. Snake handling is not scriptural, but women covering their heads is. Sadly, many women do not cover their heads when they pray like it says to in 1 Cor 11:5. Bottom line is that I should not be arguing with someone who believes that the Word of the Lord is fallible. And one other thing about the insults you threw in. For someone that is *** years of age, you have a lot of growing up left to do.\n \n Matt 7:6 and Romans 1:22.", 
   {}, 
   18944, 
   null, 
   1065912720.0
  ], 
  [
   19027, 
   null, 
   "montalban", 
   "Firstly, you asked me in a private message about what I did for a living and how old I was. I told you two facts about me, but then stated I would tell you no more because I did not know what you would do with the information. For you now to use this private information in a public forum is absolutely despicable!\n \n It is disgusting that you would divulge information given to you in confidence!\n \n \n \n \n\"It is accepted as authorative by the same Church that decided not to include it in the Bible. You're being very selective in that you're accepting one decision by the Church, but not the others. (You accept the Bible as presented to you by the Orthodox Church).\n\n \n The Didache pre-dates the compilation of the Bible. Further, you didn't address the claims made by pagans. It was common for them to criticise early Christians as cannibals... because they partook of the Eucharist\"\n \n \nWhich church would that be?\n\n \n There was only one church at that time. What church do you think it was?\n \n \nI would suppose that if I had never heard of communion and someone quoted Jesus saying this is my body, I would have some concerns also. That doesn't mean anything however because the pagans obviously didn't know enough about it.\n\n \n Of course they didn't understand it! That's why they accused the Christians of cannibalism! We're not cannibals, but we do take Christ's body. You too obviously don't know enough about it... which is why you reject Jesus' words to \"Do this in memory of Me\"\n \n \n\"Jesus was a Jew. He preached to Jews. The early Church made a decision to spread teachings beyond Jews - to Gentiles. This decision is in the Bible - there was a meeting in Jerusalem. They made the decision because they had the authority to do so.\"\n\n \n \nWrong. Jesus made the decision in the great commission. Check Matt 28:19.\n\n \n Err.. no, you're wrong here... Your interpretation of Matt 28:19 is different because of hindsight. If it was so clear to the Apostles then why in Acts would there be such heated debate over it? They may later have interpreted Jesus' words to mean what you do, but there was a huge argument over it... in a meeting in Jerusalem. The Jerusalem branch decided to continue converting Jews, whilst Paul was all for converting Gentiles, and Peter took a cautious middle-way. This was the first ecumenical meeting of Bishops. They gathered together to decide.\n \n Taking one verse out of the context of the experience of the early church will always bring your argument undone.\n \n \n\"So, the infants were still baptised, whether they were able to understand it or not. You're not actually arguing against what I said at all. A moment ago you were arguing infant baptism was absolutely non-Biblical, now you're qualifying it.\"\n\n \n \nNo, I was saying that you have to believe before you can get baptised. I quoted Acts 2:38. It says, \"Then Peter said unto them, Repent, and be baptised every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost.\" That means that baptism alone doesn't save you. The repenting factor is listed first. Without it, you have nothing. So what exactly would the point of baptising an infant be if they can't repent? You can't be forgiven without repentance. Infant baptism does nothing, and it can not be proven that Jesus and his disciples taught such things.\n\n \n Fact: A whole household could be baptised.\n Fact: Infants could be part of that group being baptised.\n Therefore you really do need to ask yourself about what it means to allow infants to be baptised... because obviously the Apostles did it!\n \n Start with Matthew 19:13-14\n \n The fact that most Protestant denominations also practice it seems to have escaped you.(http://www.sundayschoolcourses.com/baptism/baptism.htm)\n \n \"... she [Lydia] and the members of her household were baptised...\"\n (Acts 16:15)\n \n \"... immediately he [the jailer] and all his family were baptised.\"\n (Acts 16:33)\n \n \"... I [the apostle Paul] also baptised the household of Stephanas...\"\n (I Corinthians 1:16)\n \n Peter replied, \"Repent and be baptised, every one of you, in the name of Jesus Christ for the forgiveness of your sins. And you will receive the gift of the Holy Spirit. The promise is for you and your children...\" (Acts 2:38-39)\n \n \n\"So what? He asked the Saints to pray for him. Again you're not arguing against what I said, just presenting more evidence that agrees with me. Again you're now back-pedalling rather than admitting you were wrong to make a statement dealing with absolutes.\"\n\n \n \nHe asked the LIVING saints to pray for him. He didn't pray to ask the saints in heaven to pray for him. Is it ever written in scripture that anyone asked the saints in heaven to pray for them? I can't seem to find it. Probably because it isn't in there.\n\n \n So? The Saints are still living! They are living with Christ.\n \n \n \n\"You are asked by Jesus to forgive your brother, not seven times, but seven times seventy times. I'm not sure if you're familiar with the Bible... if you want I can provide the verse.\"\n\n \n \nYes, we are asked to forgive our brother. No, our brother does not have the power to cleanse us of our sins. Only the power of the blood of Jesus can do that. \n\n \n Part of the reason for going to a priest is because (at least in Orthodoxy) he helps get to the bottom of things. Like people now go to a shrink (in Orthodoxy the priest is supposed to be a witness, not the one to forgive)\n \n \nOn a side note, why did you have to get insulting? I wasn't insulting your intelligence. \n\n \n It is a character fault with me. I don't mean to, but I always end rubbing people up the wrong way. All I can say is sorry.\n \n \nObviously I quoted more scripture than you have. The biggest time you used scripture was a quote from someone else. It wasn't even your work. And by the way, since you obviously don't know the chapter and verse of that scripture off hand, it is in Matt 18:22.\n\n \n Orthodoxy does not rely wholly on Scripture, I'm sort of having to work backwards to meet with you on common ground. I could quote heaps of things from Holy Tradition, but that'd be no good as you won't accept it\n \n Oh, and I have my Orthodox Study Bible with me during these debates, so I can just as easily find the verse.\n \n \n \n\"Isn't it. Tell me why then.\" (talking about the Jewish candle tradition.)\n\n \n \nThe Catholics light candles in honour of saints. The Jews never did that.\n\n \n This is news to me. I was a Catholic too!\n \n \n \"Look at Pentecost. They were not baptised then! They'd already been baptised. Look at Acts 19: Paul finds people who were baptised but hadn't even heard of the Holy Spirit!\n Dragging out a single passage won't help your cause. You've got to look at what was the rule and what was the exception - thus the thief on the cross was neither baptised nor confirmed, but still Jesus said that he was going to be with Jesus in heaven. Another case of looking at absolutes.\n I was not Baptised on my confirmation day.\"\n\n \n \nI am so glad you brought this point up. In Acts 19, they had been baptised wrongly. If you read it, they were baptised AGAIN in the correct fashion. I am even more happy that you brought up the thief on the cross. You don't actually need rituals to get you into heaven. There are verses that talk about salvation, but say nothing of baptism. The thief on the cross simply had faith in Christ and obviously turned from his sin, and that was enough to get him into heaven. Baptism in itself does not wash away sin. As I have said many times before, it takes repentance to be saved. Some of those verses I was talking about are 2 Thes:2:13, Romans 1:16, Romans 10:10, and 2 Tim 3:15. So thank you for siding with my point.\n\n \n Nice try. The thief on the cross, I believe I said, was an exception to the rule.\n \n If 'rituals' are meaningless, then all of Jesus' life is meaningless.\n \n He was born a Jew and died a practicing Jew.\n \n The very fact that he sacrificed His life (which is an 'act' or 'work') escapes many Protestants. He could well have just come to earth and asked for people to trust Him. But that was not enough! He performed works; miracles, and His ultimate sacrifice.\n \n \n \n\n \n \"I have. But, you should actually present an argument - rather than just rattling off facts... especially if they don't help your case.\n \n The problem is you are just taking verses out of the Bible wily-inly. I can, if I so desire do likewise. That is the weakness of the Bible - which is why it was never intended to be the only work to call upon. For when people interpret it for themselves, outside of the guides of Holy Tradition - the result is 100,000s of Christian churches. That is what is so wrong with the Protestant Churches - they present to the non-Christian world 'evidence' that Christianity has lost its way.\n \n Do you handle snakes? Do the women in your church cover their heads? It says to do so in the Bible.\"\n\n \n I note here you didn't mention the snakes, or the women covering their heads... if they do it in your church.\n \n \nYou last statements greatly sadden me, friend. I was not just \"rattling off facts,\" but rather I was quoting Biblical truths. And from this post, I believe they have helped my cause.\n \n Also, for you to say there is a weakness in the Bible shows me that I am probably wasting my time with you. God's Word says in 2 Tim 3:16-17, \"All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness:\n That the man of God may be perfect, thoroughly furnished unto all good works.\" It also states in 2 Peter 1:21, \"For the prophecy came not in old time by the will of man: but holy men of God spake as they were moved by the Holy Ghost.\" For you to say that there is a flaw in God's Holy Word is to say that God does not know what He is doing. And about your interpretation line, 2 Peter 1:20 says, \"Knowing this first, that no prophecy of the scripture is of any private interpretation.\" Your treasured \"holy tradition\" you can keep. For quite some time, the Catholic church threw people in prison and killed them for even reading the scriptures. That is because they knew that many scriptures went against their teachings. My church never did that. My church gets their beliefs from the Bible alone. I believe that God's word is much better than any men's \"holy traditions\" don't you? Or would you prefer to put man's words above God's? Either way it is your choice I guess. Snake handling is not scriptural, but women covering their heads is. Sadly, many women do not cover their heads when they pray like it says to in 1 Cor 11:5. Bottom line is that I should not be arguing with someone who believes that the Word of the Lord is fallible. And one other thing about the insults you threw in. For someone that is  ***  years of age, you have a lot of growing up left to do.\n \n Matt 7:6 and Romans 1:22.\n\n \n I didn't say there was a flaw in God's Holy Word. You're putting words in my mouth. I said that the flaw lies in looking at only the Bible.\n \n If you have a picture of the Mona Lisa, you don't just look at the signature (a word) you need to look at the whole picture. God gave you His Church. The same Church that produced the Bible had already produced a number of books, such as the Didache, the Epistles of Clement of Rome, and Ignatius of Antioch. The Church is offering all these to you, and you come along, pick up one book and say \"No, thanks, I'll just read this one by myself\", and then you also turn around and despise the people who gave you the book. If the Church did try and prevent people interpreting Scripture for themselves, you must be aware of the dangers.\n \n I can go to several web-sites run by Muslims who will use singular quotes from Scripture to give evidence that Muhammad was predicted by Christians! Anyone, I repeat anyone can wily-inly quote from the Bible.\n \n Why, just take a moment to ask yourself this, why are there continuing fractures in Christianity? Every day more and more churches appear. Where did Paul say \"You have faith in Jesus, now go and worship in your own way - because the type of worship you practice is meaningless'?\n \n You have me at a disadvantage when you talk about 'your church' because I don't know which church it is, therefore when you make blanket statements attacking Catholicism (which remember, I'm not a Catholic) and then say your church never did such and such, how do I know?\n \n Anyway, I've seen how a person from your church is prepared to mis-use information, both Biblical and personal!", 
   {}, 
   19021, 
   null, 
   1065916020.0
  ], 
  [
   19035, 
   null, 
   "Stro777", 
   "Quote:\n \n \"Firstly, you asked me in a private message about what I did for a living and how old I was. I told you two facts about me, but then stated I would tell you no more because I did not know what you would do with the information. For you now to use this private information in a public forum is absolutely despicable!\n \n It is disgusting that you would divulge information given to you in confidence!\"\n \n I am sorry, but you never did say you didn't want anyone knowing about it. All you had to do was ask.\n \n Well, I was going to go through and respond to every point you made, but as I was replying something occurred to me. We seem to both be very well grounded in our faiths, and nothing the other person says is going to change our minds. I guess when we get to heaven we will find out who was right, or we may be suprised to find that neither of us had it exactly right. You accept holy tradition. I don't. It's that simple. I say truce because these discussions were not going to go anywhere. I've already said my piece, and I don't feel the need to repeat myself. Well it was fun at my end, and I say if you have any questions or concerns regarding my faith (I am a Baptist by the way, but our chuch is quite different from a lot of Baptist churches as I've found out) please feel free to ask.\n \n I do have one last thing to respond to, however. You say that I was putting words in your mouth by saying you found the Bible flawed. Forgive me if I'm wrong, but when you said, \"That is the weakness of the Bible\" that struck me as saying the Bible has problems. Can you see how I could get that from that quote? Just wanted to clear that up.\n \n I will pray for you. God bless.", 
   {}, 
   19027, 
   null, 
   1065918540.0
  ], 
  [
   19037, 
   null, 
   "montalban", 
   "Quote:\n \n \"Firstly, you asked me in a private message about what I did for a living and how old I was. I told you two facts about me, but then stated I would tell you no more because I did not know what you would do with the information. For you now to use this private information in a public forum is absolutely despicable!\n \n It is disgusting that you would divulge information given to you in confidence!\"\n \n I am sorry, but you never did say you didn't want anyone knowing about it. All you had to do was ask.\n \n\n \n If you were sorry, you'd re-edit your post to remove it.", 
   {}, 
   19035, 
   null, 
   1065918780.0
  ], 
  [
   19039, 
   null, 
   "montalban", 
   "I do have one last thing to respond to, however. You say that I was putting words in your mouth by saying you found the Bible flawed. Forgive me if I'm wrong, but when you said, \"That is the weakness of the Bible\" that struck me as saying the Bible has problems. Can you see how I could get that from that quote? Just wanted to clear that up.\n\n \n It was not well put. The weakness of the Bible lies in the people reading it, not in itself.\n \n People who rely wholly on the Bible without\n a) wondering how it was put together\n b) why it was put together\n c) what other works go with it\n \n are trying to have faith through squinting eyes\n \n Further to this, until you remove that private information from your thread there is no point praying for me, look to the log in your own eye first!", 
   {}, 
   19035, 
   null, 
   1065919020.0
  ], 
  [
   19044, 
   null, 
   "Stro777", 
   "It was not well put. The weakness of the Bible lies in the people reading it, not in itself.\n \n People who rely wholly on the Bible without\n a) wondering how it was put together\n b) why it was put together\n c) what other works go with it\n \n are trying to have faith through squinting eyes\n \n Further to this, until you remove that private information from your thread there is no point praying for me, look to the log in your own eye first!\n\n \n Wow. Calm down. If you look at my post number, you would figure out that I am new at this, and I didn't know that you can edit out stuff. Thats definitely cool that you can though. Thank you for teaching me something new. I think you need to settle down and realize that I was trying to be nice by saying I would pray for you, and I APOLOGIZED! I believe it was you who brought up the passage in Matt 18:22 where Jesus said to forgive. Practice what you preach please.\n \n By the way, I edited it out. ;)\n \n P.S. Do you know how and why the Bible was put together? I do. I studied it myself. I know all about the antilegomena and the apocrypha and all the other nifty ways they decided to figure out which was pure enough to be considered scripture and what wasn't. Just remember you don't know everything okay? (I already know that I don't know everything, so you don't need to remind me)", 
   {}, 
   19039, 
   null, 
   1065919980.0
  ], 
  [
   19047, 
   null, 
   "montalban", 
   "Do you know how and why the Bible was put together? I do. I studied it myself. I know all about the antilegomena and the apocrypha and all the other nifty ways they decided to figure out which was pure enough to be considered scripture and what wasn't. Just remember you don't know everything okay? (I already know that I don't know everything, so you don't need to remind me)\n\n \n \n Then you will know that the Didache was almost included, and the book of Revalations almost excluded. That's how touch-and-go they both are.\n \n The same Church that had the right to give you the Bible, to referee which books to include, has the right to interpret them. If you disagree, that is up to you, but you're then just as able to include your own books in it then... what's stopping you?", 
   {}, 
   19044, 
   null, 
   1065924720.0
  ], 
  [
   19068, 
   null, 
   "maximus", 
   "Well, buddy, I read Rev Chapter 12, and guess what? I believe it talks about Mary too. One problem with your thinking. No where does it say that anyone prayed to Mary, or that Mary prayed for anyone else. Isn't that interesting?\n \n Your first paragraph doesn't have any meaning of why we should pray to Mary. Duh, we are supposed to honor our father and mother. Are we supposed to WORSHIP our father and mother? I think not. They are human and sinners. Mary was a SINNER. How about the verses Romans 3:10 and 3:23? ALL have sinned and fall short of the glory of God. That includes Mary, but does not include Jesus. Jesus was God in the flesh. Mary was not.\n\n \n Stro,\n You have some misconceptions of Catholic teaching. I'm sure it is not your fault. You have probably learned this from someone else who has their own misconceptions. Catholics DO NOT WORSHIP Mary. You must understand that when one says \"pray to\" it is only a figure of speech. We are actually asking those in heaven (and on earth) to pray for us as Paul instructed. We are joined with those who have gone from the physical world before us by the union of the mystical body of Christ as revealed in scripture. My comments below will further illustrate these ideas. \n \n But first, I must ask, why did you say you would pray for me? \nI will pray for you. I would appreciate any email form any of you that find this an encourgement or if you disagree totally. That is fine by me. I will disagree right back =). My email is killergerbil@hotmail.com. Thank you\n\n Are you trying to mediate and take the role of Christ? Why do I need your prayers if I have confessed my belief? Why are you trying to get between me and God?\n \n Well, in actuality you are doing the right thing in praying for me because scripture shows us this (Romans 15:30, Colossians 4:3, 1 Thessalonians 5:25, 2 Thessalonians 1:11, 3:1, Ephesians 6:18-19). You are not doing anything wrong. You are not trying to take Jesus' place. You are trying to intercede in a different way. The same thing goes for Catholics. Again, my comments below will further elaborate on this.\n \n Yes, there is one mediator. No one gets to the Father except through Jesus. But we can intercede for others in the body of Christ, we can pray for them, and God hears our prayers (Revelation 5:8). \n \n 1 Timothy 2:1, \"First of all, then, I urge that supplications, prayers, intercessions, and thanksgivings be made for all men, for kings and all who are in high positions, that we may lead a quiet and peaceable life, godly and respectful in every way. This is good and it is acceptable in the sight of God our Savior, who desires all men to be saved and to come to the knowledge of the truth.\" \n \n What did Paul mean by asking men to make prayers, intercessions, and supplications? \n \n Why can we intercede? Because we have been given the grace and knowledge of God through his son Jesus...because we are \"children of God, and if children, then heirs, heirs of God, FELLOW heirs with Christ, provided that we suffer with him in order that we may also be glorified with him.\" (Romans 8:16-17) \n \n Why? Because \"we are ambassadors of Christ, God making his appeal through us...Working together with him, then, we entreat you...\" (2 Corinthians 5:20 and 6:1) \n \n Why? Because Christ told us to take up our cross and follow him. We can participate in redemptive suffering and intercession because Christ has granted us this power by his all sufficient sacrifice and through baptism he has joined us to his body. (Colossians 1:24) \n \n This is the way Catholics intercede--as Paul intended, as Christ commanded. Our intercession takes away nothing from the glory of Christ.\n \n Furthermore,\n \n We do not pray to dead people. Our God is a God of the living, not of the dead. (Mk 12:26-27, Luke 16:19-30, luke 23:43, Mk 9:4). We are promised eternal LIFE. Do not forget the living presence of Elijah and Moses at the Transfiguration. And the elders in Revelation were living souls in heaven. They were not dead. They were not angels because the angels were mentioned separately. Who were they? Unless there is a species besides humans and angels that we have not heard of, then this seems to be evidence that human souls live and are in action in heaven. Remember also that we are united in the mystical body of Christ as believers.\n \n Now, it is true that the saints mentioned in Revelation are the living Christians on earth. But their prayers are submitted to God nonetheless. Why do they pray? They petition God, as Paul tells us to do (Rom 15:30, Col 4:3, 1 Thess 5:25, 2 Thess 3:1, Eph 6:18,19, 1 Tim 2:1-7). So, their prayer is intercessory whether they are asking the ones in heaven to pray for them or whether they are praying to God themselves. Even if they ask God for something for themselves they are interceding. This shows that we can take action in prayer and petition God. The fact that Paul asks us to intercede for others and the fact that there are animated human souls in heaven presents the implication that we may ask those in heaven for prayers just as we ask those on earth to pray for us. This also tells us something of the nature of intercession. We can intercede for one another without taking any of the glory away from the mediation of Christ. This is what Catholics do. When it is said that we pray \"to\" saints this is perhaps a misleading choice of words. In reality, Catholics ask the saints for their prayers so that they may intercede for us. Paul understood this, Catholics understand it.\n \n \nHeh, it isn't scripture buddy. Why should we even consider it truth then? Back it up with scripture, then talk to me.\n\n \n This is a dangerous statement--that there is no truth outside of scripture.\n \n \nAlright, here is where things get sticky. I'm not sure if Mary is the Ark of the New Covenant or not, but I do know one thing. Joseph did touch Mary and they did have children together. Check Matt. 13:55-56. Jesus had brothers and sisters. Also see Mark 6:3. And besides, what does it matter if Mary is the new Ark? Did the Jews pray to the Ark? Nope. They prayed to God.\n\n \n You may be interested in the other threads \"Theotokos\" and \"Calvinism.\" We are having a debate on the topic you bring up.\n \n \nTrue, Mary did intercede at the wedding. But let me ask you this? Should we pray to Jesus even? No. You were very close with 1 Timothy 2:1 to coming on to something very good. You should have looked down a few verses because right there in 1 Tim 2:5 it says, \"For there is one God, and one mediator between God and men, the man Christ Jesus;\" Oh my. That sounds like only Jesus mediates for us in heaven. I noticed Mary isn't mentioned anywhere in that passage. Jesus Himself said in John 16:23 \"And in that day ye shall ask me nothing. Verily, verily, I say unto you, Whatsoever ye shall ask the Father in my name, he will give it you.\" So tell me this, if we can receive things directly from the father by praying TO THE FATHER, why waste time by praying to Mary and other saints (assuming we should)? In essence, you are saying that instead of asking the head of the company for a job, even though he guaranteed it to you, you would ask his son's mom to ask the son who would, in turn, ask his dad? That is just plain silly.\n\n \n \"If we can receive things directly from the father by praying TO THE FATHER\" then why would you waste your time offering to pray for me?\n Why can't I get what I need myself? Your passage also seems to say in the beginning that we shouldn't pray to Jesus and then later that we should. Can you clarify your meaning? \n \n \nAnyway, bottom line is that Mary is a human. Humans sin. Sinners go to hell unless they accept Christ. The Bible doesn't want us to pray to sinners. The only way we are made perfect is by accepting the free gift of salvation through Jesus Christ our Lord. And by the way, that guy was right when he said, \"Sure....but I know if I want sin forgiven I must Go before God, myself\" Check the scriptures. Romans 10:9, 14:11, Phil 2:11 just to name a few. YOU must confess that Jesus is the Son of God, that he died for YOUR sins, that he rose on the third day, and that YOU accept his perfect sacrifice of himself to cover YOUR sins. Unless you do that, you will die and spend an eternity in hell. There are plenty of people who think they can confess to a priest and do good things to get into heaven. Jesus said in Matt 7:22-23 \"Many will say to me in that day, Lord, Lord, have we not prophesied in thy name? and in thy name have cast out devils? and in thy name done many wonderful works?\n And then will I profess unto them, I never knew you: depart from me, ye that work iniquity.\" They can't. If they live that way, they will die and spend eternity in hell. Only by accepting Christ can we have hope of eternal salvation. Think on that.\n\n \n You seem to refute yourself in this paragraph. You seem to imply that one need only profess his faith and he will be accepted into heaven and the you state that Jesus will not accept those who simply call on his name for salvation. You use a verse that supports the idea that faith and works are necessary to support a faith alone position. Look at Matthew 7: 21  just before the verse you quoted, \"Not everyone who says to me, 'Lord, Lord' shall enter the kingdom of heaven, but he who does the will   of my Father who is in heaven.\" Calling on the Lord is not enough. Look also at Matthew 25: 31-46  to see what Jesus requires of us.\n \n What do you think of these verses in relation to confession to a priest? John 20: 22-23\n \n Now, we disagree on Mary's sinfulness (not on the fact that she was saved by Christ) and the idea that Catholics participate in idol worship but for the sake of brevity I will take up these issues at another time.\n \n Peace.", 
   {
    "unicode_changes_made": true
   }, 
   18861, 
   null, 
   1065941940.0
  ], 
  [
   19069, 
   null, 
   "maximus", 
   "Stro,\n Let me just give you a couple of things to consider without getting too deep concerning Exodus 20:4-5:\n \n 1. Check out Exodus 25:18-19, 1 Kings 6:23-29, and 1 Kings 7:25-45. Aren't the cherubim described a \"likeness\" of that which is \"in heaven?\" What does God mean when he says in Exodus 20:4-5 that we can't make any images of things in earth or sea? Can we not have artwork, pictures? He is clearly outlawing worship of these images as a god--idolatry. He is not outlawing the images themselves. He is seeking to prevent a golden cow.\n \n 2. Have you ever watched a Passion Play/Christmas Pageant? Have you ever watched a movie about Jesus where an actor portrayed him? Did you think that you were doing anything wrong? Yet, was not an image of God portrayed?", 
   {}, 
   19068, 
   null, 
   1065943380.0
  ], 
  [
   19070, 
   null, 
   "Stro777", 
   "Quote:\n \n \"Stro,\n You have some misconceptions of Catholic teaching. I'm sure it is not your fault. You have probably learned this from someone else who has their own misconceptions. Catholics DO NOT WORSHIP Mary. You must understand that when one says \"pray to\" it is only a figure of speech. We are actually asking those in heaven (and on earth) to pray for us as Paul instructed. We are joined with those who have gone from the physical world before us by the union of the mystical body of Christ as revealed in scripture. My comments below will further illustrate these ideas.\"\n \n I know that you do not worship Mary. The line where I said that we don't \"WORSHIP our parents\" was actually not what I meant. What I meant to say was, \"Should we pray to our parents?\" I don't believe we should.\n \n Quote:\n \n \"But first, I must ask, why did you say you would pray for me? \n Quote:\n --------------------------------------------------------------------------------\n I will pray for you. I would appreciate any email form any of you that find this an encourgement or if you disagree totally. That is fine by me. I will disagree right back =). My email is killergerbil@hotmail.com. Thank you\n --------------------------------------------------------------------------------\n \n Are you trying to mediate and take the role of Christ? Why do I need your prayers if I have confessed my belief? Why are you trying to get between me and God?\n \n Well, in actuality you are doing the right thing in praying for me because scripture shows us this (Romans 15:30, Colossians 4:3, 1 Thessalonians 5:25, 2 Thessalonians 1:11, 3:1, Ephesians 6:18-19). You are not doing anything wrong. You are not trying to take Jesus' place. You are trying to intercede in a different way. The same thing goes for Catholics. Again, my comments below will further elaborate on this.\n \n Yes, there is one mediator. No one gets to the Father except through Jesus. But we can intercede for others in the body of Christ, we can pray for them, and God hears our prayers (Revelation 5:8). \n \n 1 Timothy 2:1, \"First of all, then, I urge that supplications, prayers, intercessions, and thanksgivings be made for all men, for kings and all who are in high positions, that we may lead a quiet and peaceable life, godly and respectful in every way. This is good and it is acceptable in the sight of God our Savior, who desires all men to be saved and to come to the knowledge of the truth.\" \n \n What did Paul mean by asking men to make prayers, intercessions, and supplications? \n \n Why can we intercede? Because we have been given the grace and knowledge of God through his son Jesus...because we are \"children of God, and if children, then heirs, heirs of God, FELLOW heirs with Christ, provided that we suffer with him in order that we may also be glorified with him.\" (Romans 8:16-17) \n \n Why? Because \"we are ambassadors of Christ, God making his appeal through us...Working together with him, then, we entreat you...\" (2 Corinthians 5:20 and 6:1) \n \n Why? Because Christ told us to take up our cross and follow him. We can participate in redemptive suffering and intercession because Christ has granted us this power by his all sufficient sacrifice and through baptism he has joined us to his body. (Colossians 1:24) \n \n This is the way Catholics intercede--as Paul intended, as Christ commanded. Our intercession takes away nothing from the glory of Christ.\n \n Furthermore,\n \n We do not pray to dead people. Our God is a God of the living, not of the dead. (Mk 12:26-27, Luke 16:19-30, luke 23:43, Mk 9:4). We are promised eternal LIFE. Do not forget the living presence of Elijah and Moses at the Transfiguration. And the elders in Revelation were living souls in heaven. They were not dead. They were not angels because the angels were mentioned separately. Who were they? Unless there is a species besides humans and angels that we have not heard of, then this seems to be evidence that human souls live and are in action in heaven. Remember also that we are united in the mystical body of Christ as believers.\"\n \n Yes, we do have eternal life in heaven, but there aren't any scriptures that even mention the believers that have passed on into heaven hearing our prayers. Whenever a disciple asked for prayer, did he also ask people to ask the expired believers for prayer? No, they didn't. It still doesn't answer where in scripture you find that those in heaven can even hear our prayers. He always asked the believers still living on this earth. Don't you find that a little strange?\n \n Also, about me praying for you, it follows two different paths. I am praying that if what I say is true, that God would show you this, BUT, I also pray that if I am wrong, that you would display the power and authority through scripture to show me the error of my ways. I hope you don't mind that.\n \n Quote:\n \n \"This is a dangerous statement--that there is no truth outside of scripture.\"\n \n How so? It seems to me that if you followed everything in scripture to the letter (which I fail to) that everything would be perfect because the Bible is, after all, God's Holy Word.\n \n Quote:\n \n \"\"If we can receive things directly from the father by praying TO THE FATHER\" then why would you waste your time offering to pray for me?\n Why can't I get what I need myself? Your passage also seems to say in the beginning that we shouldn't pray to Jesus and then later that we should. Can you clarify your meaning?\"\n \n We can get things by praying to the Father. The Bible says so. And, as you said before (and I am agreeing with you), the prayers of others help. But that still raises the question of the scriptures talking about praying to those who are already in heaven. I am saying that we ask the Father (not Jesus) for things in Jesus' name. And then the Bible tells us we can get it. Does that help clarify?\n \n Quote:\n \n \"You seem to refute yourself in this paragraph. You seem to imply that one need only profess his faith and he will be accepted into heaven and the you state that Jesus will not accept those who simply call on his name for salvation. You use a verse that supports the idea that faith and works are necessary to support a faith alone position. Look at Matthew 7: 21 just before the verse you quoted, \"Not everyone who says to me, 'Lord, Lord' shall enter the kingdom of heaven, but he who does the will of my Father who is in heaven.\" Calling on the Lord is not enough. Look also at Matthew 25: 31-46 to see what Jesus requires of us.\"\n \n Which verse supported salvation by works and faith? I don't recall using one of those. What I believe that verse in Matthew is saying is that many will say that they did all kinds of good works in the world, and the Father has to say that he never knew them because they never accepted His Son. I believe that working iniquity means that they did the works to try to get themselves into heaven. The Bible clearly states how easy it is to get into heaven. Romans 10:9 is just one of many examples of this. Ephesians 2:8-9 is another.\n \n Quote:\n \n \"What do you think of these verses in relation to confession to a priest? John 20: 22-23\"\n \n I think they are very vague and do not support that very well.\n \n I will look forward to your next responses.", 
   {}, 
   19068, 
   null, 
   1065944520.0
  ], 
  [
   19071, 
   null, 
   "montalban", 
   "The fact that people pray seems to me to undermine sola fide.\n \n If you have faith alone that you have been saved, then what need of you for prayer?\n \n Jesus' whole mission on Earth was a 'work'. He did things; prayer, fasting, missionary work, sacraments etc.\n \n \n \n Edited because I used 'underlie' instead of 'undermine'", 
   {}, 
   19068, 
   null, 
   1065944760.0
  ], 
  [
   19073, 
   null, 
   "Stro777", 
   "Stro,\n Let me just give you a couple of things to consider without getting too deep concerning Exodus 20:4-5:\n \n 1. Check out Exodus 25:18-19, 1 Kings 6:23-29, and 1 Kings 7:25-45. Aren't the cherubim described a \"likeness\" of that which is \"in heaven?\" What does God mean when he says in Exodus 20:4-5 that we can't make any images of things in earth or sea? Can we not have artwork, pictures? He is clearly outlawing worship of these images as a god--idolatry. He is not outlawing the images themselves. He is seeking to prevent a golden cow.\n \n 2. Have you ever watched a Passion Play/Christmas Pageant? Have you ever watched a movie about Jesus where an actor portrayed him? Did you think that you were doing anything wrong? Yet, was not an image of God portrayed?\n\n \n I do believe we can have artwork, but we should not worship it, like you said. I think that the statues of Mary and the Crucifixes are very misleading because they are most likely not what they looked like at all. Why would you have these then if not to worship them? I have heard a lot of catholics that actually DO worship them. I don't believe something should be placed in a church when the image it portrays is false. Jesus did not have a little trickle of blood on His head and that was pretty much (other than the spear wound) the only damage that could be seen. Look at the crucifixion story. You couldn't even tell He was human when they were done with Him. Why then do you place a false Christ at the front of your church? I don't understand why exactly you need them.\n \n In answer to Number 2, I don't believe anyone is worthy to act on behalf of Christ. I don't think we should. It seems to me as almost \"playing God\" if you will. I sure wouldn't do it.\n \n Just some thoughts.", 
   {}, 
   19069, 
   null, 
   1065945060.0
  ], 
  [
   19075, 
   null, 
   "Stro777", 
   "The fact that people pray seems to me to underlie sola fide.\n \n If you have faith alone that you have been saved, then what need of you for prayer?\n \n Jesus' whole mission on Earth was a 'work'. He did things; prayer, fasting, missionary work, sacraments etc.\n\n \n Yes His mission was a \"work\". Did Jesus need to be saved? Nope. He just set quite the good example. Many places in the New Testament it talks about faith bringing forth good works. True faith will yield works.", 
   {}, 
   19071, 
   null, 
   1065945240.0
  ], 
  [
   19082, 
   null, 
   "montalban", 
   "I do believe we can have artwork, but we should not worship it, like you said. I think that the statues of Mary and the Crucifixes are very misleading because they are most likely not what they looked like at all. Why would you have these then if not to worship them? I have heard a lot of catholics that actually DO worship them. I don't believe something should be placed in a church when the image it portrays is false. Jesus did not have a little trickle of blood on His head and that was pretty much (other than the spear wound) the only damage that could be seen. Look at the crucifixion story. You couldn't even tell He was human when they were done with Him. Why then do you place a false Christ at the front of your church? I don't understand why exactly you need them.\n \n In answer to Number 2, I don't believe anyone is worthy to act on behalf of Christ. I don't think we should. It seems to me as almost \"playing God\" if you will. I sure wouldn't do it.\n \n Just some thoughts.\n\n \n Icons are justified (at least in Orthodoxy) because we are living icons - made in the image of God.\n \n They help inspire us and remind us - just as people will keep a photo of their family on their office desk (I mean, they obviously know what their family looks like, don't they?)\n \n The Bible itself is an 'image' of the Word of God. It is the Word of God that is now to be seen by all.\n \n \"As the word of Holy Scripture is an image, so the image is also a word, for, according to St. Basil the Great (379 AD): \n \n By depicting the divine, we are not making ourselves similar to idolaters; for it is not the material symbol that we are worshipping, but the Creator, Who became corporeal for our sake and assumed our body in order that through it He might save mankind. We also venerate the material objects through which our salvation is effected -- the blessed wood of the Cross, the Holy Gospel, Holy Relics of Saints, and, above all, the Most-Pure Body and Blood of Christ, which have grace-bestowing properties and Divine Power. Orthodox Christians do not venerate an Icon of Christ because of the nature of the wood or the paint, but rather we venerate the inanimate image of Christ with the intention of worshipping Christ Himself as God Incarnate through it.\"\n http://www.ocf.org/OrthodoxPage/reading/catechism.html", 
   {}, 
   19073, 
   null, 
   1065963240.0
  ], 
  [
   19083, 
   null, 
   "montalban", 
   "Yes His mission was a \"work\". Did Jesus need to be saved? Nope. He just set quite the good example. Many places in the New Testament it talks about faith bringing forth good works. True faith will yield works.\n\n \n Exactly! Jesus did not need to be saved, but he did come to set us an example. He came to show us the Way to God!\n \n The Way to God is to follow Jesus. Jesus fasted, He prayed, He gave communion, He had faith, and He did works. He gave us many parables about works such as the Good Samaritan. As you know the Bible better than I you'd know the one about the man who goes before judgement and Jesus said 'you did not feed Me or clothe Me\"\n \n Jesus prayed and He fasted. Why would Jesus, the Perfect Man, a very part of the Living God, pray and fast? It was to show us the Way!\n \n Let me make this clear. Works do not get you to heaven. Faith does not get you to heaven. God's grace gets us to heaven. However we are called to act as Christians and to have faith. As the Bible says \"Faith without works is dead\"\n \n And as Jesus died for us, we too must die for Him.\n \n Jesus could have cast the first stone as He was without sin. He did not, so as to show us the way. His whole life was an example for us.\n \n As said by myself earlier, Luther broke with the teachings of the Church and came up with an innovative form of belief.\n \n Furthermore, many Protestants recognise that there is a Trinity, but there is no one passage of the Bible that points to there being a Trinity. It is implied... and it is taught by Holy Tradition that this is the interpretation to make.\n \n \n But back to sola fide...\n \n \"Sola fide cannot be a legitimate development, because it is different in essence from infused justification. If so many Reformed Protestants claim that our view is Pelagianism* or a false gospel of works, etc. because of its difference from the Reformed extrinsic, forensic, external, imputed righteousness, then how can their view be said to be merely a \"development\" of ours, via Augustine and others? \n A development cannot proceed from an entirely false view to a true one, or change in its essence. This violates the very definition of development, on any coherent theological view of what the word means. It is not simply random evolution or change, but consistent change: consistent with what has come before it, not radically divergent.\"\n http://ic.net/~erasmus/RAZ468.HTM\n \n Furthermore, the idea of sola scriptura (Bible only) condemns all those who had faith and only a traditional notion of the Word of God (that is, before it was set down).\n \n \n \n *Pelagius was a heretic from Britain who believed that salvation was totally through works.", 
   {
    "post_info": {
     "post_title": "Jesus set us an example"
    }
   }, 
   19075, 
   null, 
   1065964440.0
  ], 
  [
   19086, 
   null, 
   "Stro777", 
   "Quote:\n \n \"Exactly! Jesus did not need to be saved, but he did come to set us an example. He came to show us the Way to God!\n \n The Way to God is to follow Jesus. Jesus fasted, He prayed, He gave communion, He had faith, and He did works. He gave us many parables about works such as the Good Samaritan. As you know the Bible better than I you'd know the one about the man who goes before judgement and Jesus said 'you did not feed Me or clothe Me\"\n \n Jesus prayed and He fasted. Why would Jesus, the Perfect Man, a very part of the Living God, pray and fast? It was to show us the Way!\n \n Let me make this clear. Works do not get you to heaven. Faith does not get you to heaven. God's grace gets us to heaven. However we are called to act as Christians and to have faith. As the Bible says \"Faith without works is dead\"\n \n And as Jesus died for us, we too must die for Him.\n \n Jesus could have cast the first stone as He was without sin. He did not, so as to show us the way. His whole life was an example for us.\n \n As said by myself earlier, Luther broke with the teachings of the Church and came up with an innovative form of belief.\n \n Furthermore, many Protestants recognise that there is a Trinity, but there is no one passage of the Bible that points to there being a Trinity. It is implied... and it is taught by Holy Tradition that this is the interpretation to make.\n \n \n But back to sola fide...\n \n \"Sola fide cannot be a legitimate development, because it is different in essence from infused justification. If so many Reformed Protestants claim that our view is Pelagianism* or a false gospel of works, etc. because of its difference from the Reformed extrinsic, forensic, external, imputed righteousness, then how can their view be said to be merely a \"development\" of ours, via Augustine and others? \n A development cannot proceed from an entirely false view to a true one, or change in its essence. This violates the very definition of development, on any coherent theological view of what the word means. It is not simply random evolution or change, but consistent change: consistent with what has come before it, not radically divergent.\"\n http://ic.net/~erasmus/RAZ468.HTM\"\n \n So how to you explain Ephesians 2:8-9?? That says, \"For by grace are ye saved through faith; and that not of yourselves: it is the gift of God:\n Not of works, lest any man should boast.\"\n \n That verse clearly says that faith brings forth saving grace. Works are not a part of salvation because then man could say, \"I did it.\" True faith does bring forth works, but works are not needed to get into heaven. If we have to have faith AND do good works to get into heaven then Christ's death on the cross was not enough because He didn't die then for all our sins.\n \n Actually there is a verse about the Trinity. It is 1 John 5:7. It says, \"For there are three that bear record in heaven, the Father, the Word, and the Holy Ghost: and these three are one.\"\n \n Quote:\n \n \"Furthermore, the idea of sola scriptura (Bible only) condemns all those who had faith and only a traditional notion of the Word of God (that is, before it was set down).\"\n \n How so? Isn't your holy tradition also written down? And besides, they had the living apostles to guide them back then, and during that period they were writting down scripture. Be carefuly about your holy tradition also. At that time there were many churches that were teaching false doctrines and doing things wrong. That is why Paul had to write so many letters. No one seemed to be getting it right.", 
   {}, 
   19083, 
   null, 
   1065975600.0
  ], 
  [
   19089, 
   null, 
   "Stro777", 
   "The fact that people pray seems to me to undermine sola fide.\n \n If you have faith alone that you have been saved, then what need of you for prayer?\n \n Jesus' whole mission on Earth was a 'work'. He did things; prayer, fasting, missionary work, sacraments etc.\n \n \n \n Edited because I used 'underlie' instead of 'undermine'\n\n \n You need prayer because the battle isn't over when you get saved, it has just begun. Our mission isn't to recieve Christ and sit back and enjoy the show. Our mission is to bring as many to repentance in Christ as we can.", 
   {}, 
   19071, 
   null, 
   1065976500.0
  ], 
  [
   19127, 
   null, 
   "maximus", 
   "I know that you do not worship Mary. The line where I said that we don't \"WORSHIP our parents\" was actually not what I meant. What I meant to say was, \"Should we pray to our parents?\" I don't believe we should.\n\n \n Stro,\n The more appropriate question would be, \"Should we ask our parents to pray for us?\" I believe we should.\n \n \nYes, we do have eternal life in heaven, but there aren't any scriptures that even mention the believers that have passed on into heaven hearing our prayers. Whenever a disciple asked for prayer, did he also ask people to ask the expired believers for prayer? No, they didn't. It still doesn't answer where in scripture you find that those in heaven can even hear our prayers. He always asked the believers still living on this earth. Don't you find that a little strange?\n\n \n Those in heaven do hear our prayers. Revelation 5:8\n \n \n\"This is a dangerous statement--that there is no truth outside of scripture.\"\n \n How so? It seems to me that if you followed everything in scripture to the letter (which I fail to) that everything would be perfect because the Bible is, after all, God's Holy Word.\n\n \n It is dangerous to limit yourself to scripture because then you will miss the FULL revelation that God made to his people (Read John 21:25  and 2 Thessalonians 2:15  notice that Paul tells us to heed the oral  word and tradition) The Word of God is not limited to the pages of the Bible, the Word was made flesh and he will be with us until the end of time. The Word is a living, organic Word conveyed fully by the Church (Ephesians 3:10, 1 Timothy 3:15). \n \n It is dangerous to adhere to sola scriptura  because you end up rejecting parts of Christianity that have been there from the beginning but which you cannot see due to a new interpretation of scripture and a lack of adherence to Holy Tradition. Thus you do not accept the tradition of praying \"to\" the saints. But in rejecting this you deny the doctrine of the living body of Christ joined outside of time and temporal reality, joined in heaven and on earth. Things that early Christians had absolutely no problem with:\n \n Clement of Alexandria\n \n \"In this way is he [the true Christian] always pure for prayer. He also prays in the society of angels, as being already of angelic rank, and he is never out of their holy keeping; and though he pray alone, he has the choir of the saints standing with him [in prayer]\" (Miscellanies 7:12 [A.D. 208]). \n \n Origen\n \n \"But not the high priest [Christ] alone prays for those who pray sincerely, but also the angels . . . as also the souls of the saints who have already fallen asleep\" (Prayer 11 [A.D. 233]). \n \n \nThe Bible clearly states how easy it is to get into heaven. Romans 10:9 is just one of many examples of this. Ephesians 2:8-9 is another.\n\n \n Does it? Jesus says that it will be difficult: Mark 10:17-31, Matthew 10: 34-39, Matthew 7:21 \n \n The Bible also states how easy it is to lose one's salvation and miss getting into heaven: Matthew 7:21, Matthew 24:13, Romans 11:22, Philippians 2:12, 1 Corinthians 9:27, 1 Corinthians 10:11-12, Galatians 5:4, 2 Timothy 2:11-13, Hebrews 6:4-6, Hebrews 10:26-27\n Quote:\n \n \n\"What do you think of these verses in relation to confession to a priest? John 20: 22-23\"\n \n I think they are very vague and do not support that very well.\n\n \n What is vague about this? \n \n \"And when he had said this, he breathed on them, and said to them, 'Receive the Holy Spirit. If you forgive the sins of any, they are forgiven; if you retain the sins of any, they are retained.'\"", 
   {}, 
   19070, 
   null, 
   1066025160.0
  ], 
  [
   19128, 
   null, 
   "maximus", 
   "Why would you have these then if not to worship them? \n \n \n Do you have the pictures of your family hanging on your wall and in your wallet to worship them? No, you have them to remind you of those whom you are fond of but that are not present.\n \n Why do we have crucifixes? for a deeper meditation on and understanding of the pain and suffering Jesus went through to save us and with this a realization of how far we must actually go as Christians in living a Christian life\n \n Why do we have statues of saints? to embrace the models that the saints have given us walking in the pathway of Christ so that we may attempt to walk more suitably along that road \"I urge you, then, be imitators of me. Therefore I sent to you Timothy, my beloved and faithful child in the Lord, to remind you of my ways in Christ, as I teach them everywhere in every church\" (1 Cor. 4:16-17)\n \n Has a picture never helped increase your understanding or comprehension of something? Has a piece of artwork never stirred your heart? \n \n \n I have heard a lot of catholics that actually DO worship them.\n \n \n I seriously doubt your claim on this. No Catholic following his faith can be worshipping a statue. Especially since the Church has condemned idolatry (a long time ago):\n \n The Second Council of Nicaea (787),  which dealt largely with the question of the religious use of images and icons, said, \"[T]he one who redeemed us from the darkness of idolatrous insanity, Christ our God, when he took for his bride his holy Catholic Church . . . promised he would guard her and assured his holy disciples saying, 'I am with you every day until the consummation of this age.' . . . To this gracious offer some people paid no attention; being hoodwinked by the treacherous foe they abandoned the true line of reasoning . . . and they failed to distinguish the holy from the profane, asserting that the icons of our Lord and of his saints were no different from the wooden images of satanic idols.\" \n \n The Catechism of the Council of Trent (1566) taught that idolatry is committed \"by worshipping idols and images as God, or believing that they possess any divinity or virtue entitling them to our worship, by praying to, or reposing confidence in them\" (374). \n \n \"Idolatry is a perversion of man's innate religious sense. An idolater is someone who 'transfers his indestructible notion of God to anything other than God'\" (Catechism of the Catholic Church (CCC) 2114).*\n \n *www.catholic.com \n \n \nJesus did not have a little trickle of blood on His head and that was pretty much (other than the spear wound) the only damage that could be seen. Look at the crucifixion story. You couldn't even tell He was human when they were done with Him. Why then do you place a false Christ at the front of your church? I don't understand why exactly you need them.\n\n \n I do not understand you on this one. Are you saying that Christ looked unharmed? Or do you say that he was beyond recognition because of the harm he had suffered? I don't know that scripture tells us either of these.\n \n \nIn answer to Number 2, I don't believe anyone is worthy to act on behalf of Christ. I don't think we should. It seems to me as almost \"playing God\" if you will. I sure wouldn't do it.\n\n \n Are you telling me that you have never watched a movie or play with a Jesus character in it?", 
   {
    "unicode_changes_made": true
   }, 
   19073, 
   null, 
   1066026120.0
  ], 
  [
   19132, 
   null, 
   "montalban", 
   "You need prayer because the battle isn't over when you get saved, it has just begun. Our mission isn't to recieve Christ and sit back and enjoy the show. Our mission is to bring as many to repentance in Christ as we can.\n\n \n I agree totally! (with the first sentence ;) ). Life is a struggle. However that is it... our life isn't to bring as many people to repentance (isn't it odd, you're arguing for works, and I'm not!). Our life is the struggle!\n \n Our life is to become God. We were separated from Him by sin. Our whole life's work is to return to Him.\n \n How we do that might involve preaching to others, but that is a means, not an ends.", 
   {}, 
   19089, 
   null, 
   1066036080.0
  ], 
  [
   19133, 
   null, 
   "montalban", 
   "So how to you explain Ephesians 2:8-9?? That says, \"For by grace are ye saved through faith; and that not of yourselves: it is the gift of God:\n Not of works, lest any man should boast.\"\n \n That verse clearly says that faith brings forth saving grace. Works are not a part of salvation because then man could say, \"I did it.\" True faith does bring forth works, but works are not needed to get into heaven. If we have to have faith AND do good works to get into heaven then Christ's death on the cross was not enough because He didn't die then for all our sins.\n\n \n As I said, you can make a Bible verse mean whatever. I told you about the verse \"Faith without works is dead\"\n \n \n So which verse works? Well tradition comes in the side of both faith and works\n \n You need both.\n \n \nActually there is a verse about the Trinity. It is 1 John 5:7. It says, \"For there are three that bear record in heaven, the Father, the Word, and the Holy Ghost: and these three are one.\"\n\n \n I concede to this point.\n \n \n \n \"Furthermore, the idea of sola scriptura (Bible only) condemns all those who had faith and only a traditional notion of the Word of God (that is, before it was set down).\"\n\n \n \nHow so? Isn't your holy tradition also written down?\n\n \n Yes and no. Some Holy Tradition is written down. Some are not. Some have written commentary... or argument rather than a statement.\n \n \nAnd besides, they had the living apostles to guide them back then, and during that period they were writing down scripture.\n\n \n Not quite, the Apostles were long dead when the Bible was compiled. The Bible was compiled about 300 years after the fact.\n http://www.earlychristianwritings.com/\n gives a partial list of the books that the church had to work with. Some were written by the genuine article. Some were not. How to decide which ones? They used Holy Tradition.\n \n \nBe carefuly about your holy tradition also. \n\n \n I've no idea what this means.\n \n \nAt that time there were many churches that were teaching false doctrines and doing things wrong. That is why Paul had to write so many letters. No one seemed to be getting it right.\n\n \n Indeed Paul never said \"Go, you have faith, that is enough!\" He was always calling them back into line. I agree with you on this.", 
   {}, 
   19086, 
   null, 
   1066037340.0
  ], 
  [
   19225, 
   null, 
   "Parcum", 
   "Ah, I see what the topic is now.\n \n As Montalban has said, Holy Tradition is very important. If something is not clear in the bible or makes seemingly contradictions, what must a good tradition do? What many have done is take one definition and take it as truth. This must never be done. Simply because the bible seems to have contradictions of course does not mean we can choose one of the two that contradict. What is nessecary is a study of what the early Christians believed. We can all safely agree that the early christians knew their faith well- it was mere decades to around 300 years since Christ's death, and hence they know the faith right from the source- many of them knew the apostles. Thus, we conclude the bible through Holy Tradition- the writings of early Christians.", 
   {}, 
   19071, 
   null, 
   1066113360.0
  ], 
  [
   19234, 
   null, 
   "montalban", 
   "Ah, I see what the topic is now.\n \n As Montalban has said, Holy Tradition is very important. If something is not clear in the bible or makes seemingly contradictions, what must a good tradition do? What many have done is take one definition and take it as truth. This must never be done. Simply because the bible seems to have contradictions of course does not mean we can choose one of the two that contradict. What is nessecary is a study of what the early Christians believed. We can all safely agree that the early christians knew their faith well- it was mere decades to around 300 years since Christ's death, and hence they know the faith right from the source- many of them knew the apostles. Thus, we conclude the bible through Holy Tradition- the writings of early Christians.\n\n \n Just as one person can find a number of passages of the Bible to do with faith alone, I can find a great many that deal with the importance of both faith and works (see below).\n \n The problem then remains ... \"Who is right?\"\n \n \"It is important to understand that Scripture is, in and of itself, \"Of the Church.\" The final Canon of the New Testament, as we have it today, was approved in AD 397 by the Church and no other. For every Book of the New Testament that was accepted, one or another was rejected.\n http://www.unicorne.org/orthodoxy/articles/alex_roman/faithandworks.htm\n \n Thus I look to the early Church. I don't just read the Bible, I try to get inside the minds of the people who wrote it. There are other books that they wrote... the easiest collection you can find is \"Early Christian Writings\" in Penguin Classics.\n \n \n \"Among these books is the Epistle of St James. James states quite emphatically in the second chapter, beginning with verse 24: \"Ye see then how that by works a man is justified and not by faith only . . . For as the body without the spirit is dead, so faith without works is dead also.\" In verse 14, this is what James has to say as well: \"What doth it profit, my brethren, though a man say he hath faith, and have not works? can faith save him?\"\n (Ibid)\n \n \n \n \"What good is faith without works?\n James 2:14-26\n What doth it profit, my brethren, though a man say he hath faith, and have not works? Can faith save him? If a brother or sister be naked, and destitute of daily food, and one of you say unto them, \"Depart in peace, be ye warmed and filled;\" notwithstanding ye give them not those things which are needful to the body; what doth it profit? Even so faith, if it hath not works, is dead, being alone. Yea, a man may say, \"Thou hast faith, and I have works: shew me thy faith without thy works, and I will shew thee my faith by my works.\" Thou believest that there is one God; thou doest well: the devils also believe, and tremble. But wilt thou know, O vain man, that faith without works is dead? Was not Abraham our father justified by works, when he had offered Isaac his son upon the altar? Seest thou how faith wrought with his works, and by works was faith made perfect? And the scripture was fulfilled which saith, Abraham believed God, and it was imputed unto him for righteousness: and he was called the Friend of God. Ye see then how that by works a man is justified, and not by faith only. Likewise also was not Rahab the harlot justified by works, when she had received the messengers, and had sent them out another way? For as the body without the spirit is dead, so faith without works is dead also.\n We must avoid sin.\n Hebrews 10:26\n For if we sin wilfully after that we have received the knowledge of the truth, there remaineth no more sacrifice for sins.\n \"Earning\" forgiveness.\n James 5:20\n Let him know, that he which converteth the sinner from the error of his way shall save a soul from death, and shall hide a multitude of sins.\n We must do the will of God.\n Luke 6:46\n And why call ye me, \"Lord, Lord,\" and do not the things which I say?\n Matthew 7:21\n Not every one that saith unto me, \"Lord, Lord,\" shall enter into the kingdom of heaven; but he that doeth the will of my Father which is in heaven.\n Matthew 19:16-21\n And, behold, one came and said unto him, \"Good Master, what good thing shall I do, that I may have eternal life?\" And he said unto him, \"Why callest thou me good? there is none good but one, that is, God: but if thou wilt enter into life, keep the commandments.\" He saith unto him, \"Which?\" Jesus said, \"thou shalt do no murder, Thou shalt not commit adultery, Thou shalt not steal, Thou shalt not bear false witness, Honour thy father and thy mother: and, Thou shalt love thy neighbour as thyself.\" The young man saith unto him, \"All these things have I kept from my youth up: what lack I yet?\" Jesus said unto him, \"If thou wilt be perfect, go and sell that thou hast, and give to the poor, and thou shalt have treasure in heaven: and come and follow me.\"\n 1 Timothy 5:8\n But if any provide not for his own, and specially for those of his own house, he hath denied the faith, and is worse than an infidel.\n Hebrews 12:14\n Follow peace with all men, and holiness, without which no man shall see the Lord:\n We must strive to win salvation.\n 1 Corinthians 9:24-27\n Know ye not that they which run in a race run all, but one receiveth the prize? So run, that ye may obtain. And every man that striveth for the mastery is temperate in all things. Now they do it to obtain a corruptible crown; but we an incorruptible. I therefore so run, not as uncertainly; so fight I, not as one that beateth the air: but I keep under my body, and bring it into subjection: lest that by any means, when I have preached to others, I myself should be a castaway.\n Luke 13:24\n Strive to enter in at the strait gate: for many, I say unto you, will seek to enter in, and shall not be able.\n Works have merit.\n Philippians 2:12\n Wherefore, my beloved, as ye have always obeyed, not as in my presence only, but now much more in my absence, work out your own salvation with fear and trembling.\n 2 Corinthians 5:10\n For we must all appear before the judgment seat of Christ; that every one may receive the things done in his body, according to that he hath done, whether it be good or bad.\n Rom 2:5-10,13\n But after thy hardness and impenitent heart treasurest up unto thyself wrath against the day of wrath and revelation of the righteous judgment of God; who will render to every man according to his deeds: To them who by patient continuance in well doing seek for glory and honour and immortality, eternal life: But unto them that are contentious, and do not obey the truth, but obey unrighteousness, indignation and wrath, Tribulation and anguish, upon every soul of man that doeth evil, of the Jew first, and also of the Gentile; But glory, honour, and peace, to every man that worketh good, to the Jew first, and also to the Gentile: (For not the hearers of the law are just before God, but the doers of the law shall be justified).\n Rom 3:31\n Do we then make void the law through faith? God forbid: yea, we establish the law.\n Matthew 25:32-46\n And before him shall be gathered all nations: and he shall separate them one from another, as a shepherd divideth his sheep from the goats: And he shall set the sheep on his right hand, but the goats on the left. Then shall the King say unto them on his right hand, \"Come, ye blessed of my Father, inherit the kingdom prepared for you from the foundation of the world: for I was an hungred, and ye gave me meat: I was thirsty, and ye gave me drink: I was a stranger, and ye took me in: naked, and ye clothed me: I was sick, and ye visited me: I was in prison, and ye came unto me.\" Then shall the righteous answer him, saying, \"Lord, when saw we thee an hungred, and fed thee? or thirsty, and gave thee drink? When saw we thee a stranger, and took thee in? or naked, and clothed thee? Or when saw we thee sick, or in prison, and came unto thee?\" And the King shall answer and say unto them, \"Verily I say unto you, inasmuch as ye have done it unto one of the least of these my brethren, ye have done it unto me.\" Then shall he say also unto them on the left hand, \"Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels: for I was an hungred, and ye gave me no meat: I was thirsty, and ye gave me no drink: I was a stranger, and ye took me not in: naked, and ye clothed me not: sick, and in prison, and ye visited me not.\" Then shall they also answer him, saying, \"Lord, when saw we thee an hungred, or athirst, or a stranger, or naked, or sick, or in prison, and did not minister unto thee?\" Then shall he answer them, saying, \"Verily I say unto you, inasmuch as ye did it not to one of the least of these, ye did it not to me.\" And these shall go away into everlasting punishment: but the righteous into life eternal.\n Galatians 6:6-10\n Let him that is taught in the word communicate unto him that teacheth in all good things. Be not deceived; God is not mocked: for whatsoever a man soweth, that shall he also reap. For he that soweth to his flesh shall of the flesh reap corruption; but he that soweth to the Spirit shall of the Spirit reap life everlasting. And let us not be weary in well doing: for in due season we shall reap, if we faint not. As we have therefore opportunity, let us do good unto all men, especially unto them who are of the household of faith.\n 1 Timothy 6:17-19\n Charge them that are rich in this world, that they be not highminded, nor trust in uncertain riches, but in the living God, who giveth us richly all things to enjoy; That they do good, that they be rich in good works, ready to distribute, willing to communicate; Laying up in store for themselves a good foundation against the time to come, that they may lay hold on eternal life.\n Revelations 22:12\n And, behold, I come quickly; and my reward is with me, to give every man according as his work shall be.\n We must keep the commandments.\n 1 John 2:3-4\n And hereby we do know that we know him, if we keep his commandments. He that saith, \"I know him,\" and keepeth not his commandments, is a liar, and the truth is not in him.\n 1 John 3:24\n And he that keepeth his commandments dwelleth in him, and he in him. And hereby we know that he abideth in us, by the Spirit which he hath given us.\n 1 John 5:3\n For this is the love of God, that we keep his commandments: and his commandments are not grievous.\n http://www.globalserve.net/~bumblebee/ecclesia/solafide.htm", 
   {}, 
   19225, 
   null, 
   1066124460.0
  ], 
  [
   19292, 
   null, 
   "epaphras_faith", 
   "Ah, I see what the topic is now.\n \n As Montalban has said, Holy Tradition is very important. If something is not clear in the bible or makes seemingly contradictions, what must a good tradition do? What many have done is take one definition and take it as truth. This must never be done. Simply because the bible seems to have contradictions of course does not mean we can choose one of the two that contradict. What is nessecary is a study of what the early Christians believed. We can all safely agree that the early christians knew their faith well- it was mere decades to around 300 years since Christ's death, and hence they know the faith right from the source- many of them knew the apostles. Thus, we conclude the bible through Holy Tradition- the writings of early Christians.\n\n \n \n I know I am inserting myself in the middle of something. I disagree. It is not tradition that determines what is right but rather God. A relationship with God through development of contact with the Holy Spirit which indwells each believer is the only way to determine the reality of scripture. 1st, know that scripture absolutely does not contradict, 2nd where it seems to contradict, pray for guidance, 3rd examine what you absolutely know to be true about God. Interpret the scripture from that vantage point.\n \n eg: One might say that God was XXXXXX off at Adam and Eve for disobeying and therefore threw them out of Eden. However, this contradicts scripture which says that God is merciful, slow to anger, full of lovingkindness. Scripture cannot contradict.\n \n Therefore, given God's attributes one can see that it was for kindness sake that he drove them out of the garden. Now that they had sinned, he did not want them to live forever in that condition so he drove them out so that they would not also eat from the fruit of the tree of life. I did not use specific scripture but have seen this one before. \n \n You and I can determine what God says. Teachers are not there to tell us what to do. That is what the pharisees did. Teachers are there to help us maintain contact with God and direct us to Jesus.", 
   {}, 
   19225, 
   null, 
   1066170840.0
  ], 
  [
   19297, 
   null, 
   "Parcum", 
   " I know I am inserting myself in the middle of something. I disagree. It is not tradition that determines what is right but rather God. A relationship with God through development of contact with the Holy Spirit which indwells each believer is the only way to determine the reality of scripture.\n\n \n That's the way. The bible is the ultimate source of our faith. However, when dealing with difficult issues, how to we interpret it? Do we just pick sides? Of course not, there's obviously only one side. What do we do? What do you do when you have difficulty? You talk about it with somebody who knows. You talk to your pastor, theologian, et cetera. In the same way, we read what the theologians, Philosophers, and early Christians believed. They KNEW the faith.\n \n \n 1st, know that scripture absolutely does not contradict, 2nd where it seems to contradict, pray for guidance, 3rd examine what you absolutely know to be true about God. Interpret the scripture from that vantage point.[/\n\n \n As I said, the bible doesn't contradict, but it may seem like it does. Second, that's really nice that you want to pray about it for guidance, and although we should certainly pray about it, man is still corrupt. Catholics pray all the time for scriptural guidance. But, according to you, we're wrong. So that cannot be the ultimate answer. Finally, we always examine what we know about God. We don't just simply say \"Oh the bible says this, but tradition says this, so tradition is right\". The bible is always right. We look at the bible, and if something isn't explicit, we look into tradition for verification. \n \n \n You and I can determine what God says. Teachers are not there to tell us what to do. That is what the pharisees did. Teachers are there to help us maintain contact with God and direct us to Jesus.\n\n \n Jesus was a teacher. Maybe we shouldn't listen to Jesus, should we? Paul was a teacher. Hey, forget about Paul! Martin Luther was a teacher, Calvin was a teacher, they were all teachers, but you obviously listened to them, right?", 
   {
    "unicode_changes_made": true
   }, 
   19292, 
   null, 
   1066171800.0
  ], 
  [
   19302, 
   null, 
   "epaphras_faith", 
   "That's the way. The bible is the ultimate source of our faith. However, when dealing with difficult issues, how to we interpret it? Do we just pick sides? Of course not, there's obviously only one side. What do we do? What do you do when you have difficulty? You talk about it with somebody who knows. You talk to your pastor, theologian, et cetera. In the same way, we read what the theologians, Philosophers, and early Christians believed. They KNEW the faith.\n \n \n \n As I said, the bible doesn't contradict, but it may seem like it does. Second, that's really nice that you want to pray about it for guidance, and although we should certainly pray about it, man is still corrupt. Catholics pray all the time for scriptural guidance. But, according to you, we're wrong. So that cannot be the ultimate answer. Finally, we always examine what we know about God. We don't just simply say \"Oh the bible says this, but tradition says this, so tradition is right\". The bible is always right. We look at the bible, and if something isn't explicit, we look into tradition for verification. \n \n \n \n Jesus was a teacher. Maybe we shouldn't listen to Jesus, should we? Paul was a teacher. Hey, forget about Paul! Martin Luther was a teacher, Calvin was a teacher, they were all teachers, but you obviously listened to them, right?\n\n \n Actually I think we agree more than we disagree. I have been debating Montalban. His stance has been that Tradition was equal to scripture and in some ways superior as tradition gave us scripture. That is his argument not mine. The last inforamtion you just presented I agree with. I do listen to teachers for guidance. They can help me understand. \n \n However, tradition is not equal with scripture.\n \n That is my position.", 
   {
    "unicode_changes_made": true
   }, 
   19297, 
   null, 
   1066172820.0
  ], 
  [
   19306, 
   null, 
   "Parcum", 
   "\n Actually I think we agree more than we disagree. I have been debating Montalban. His stance has been that Tradition was equal to scripture and in some ways superior as tradition gave us scripture. That is his argument not mine. The last inforamtion you just presented I agree with. I do listen to teachers for guidance. They can help me understand. \n\n \n I don't believe the Orthodox Church believes that Holy Tradition and the Bible are equal (both were written by man, but the latter was influenced by God), but since he is Orthodox (and many Catholics believe the same), Holy Tradition is imperative to biblical study. The Orthodox have preserved their Holy Tradition for thousands of years, while the Catholic Church has changed, and many times have forgotten our own traditions, and yet the Orthodox still keep them. I wouldn't say that Montablin is saying that the two are absolutely equal, but more that they are equally important in that if several sources in tradition says one thing, and the bible says something different in one verse, that the verse should be studied and interpreted.", 
   {}, 
   19302, 
   null, 
   1066176060.0
  ], 
  [
   19307, 
   null, 
   "epaphras_faith", 
   "I don't believe the Orthodox Church believes that Holy Tradition and the Bible are equal (both were written by man, but the latter was influenced by God), but since he is Orthodox (and many Catholics believe the same), Holy Tradition is imperative to biblical study. The Orthodox have preserved their Holy Tradition for thousands of years, while the Catholic Church has changed, and many times have forgotten our own traditions, and yet the Orthodox still keep them. I wouldn't say that Montablin is saying that the two are absolutely equal, but more that they are equally important in that if several sources in tradition says one thing, and the bible says something different in one verse, that the verse should be studied and interpreted.\n\n \n I don't actually know what the church believes. I only report what was stated in various other threads with montalban.\n \n Montalban, if Parcum is representing you correctly please advise. if not also please advise. I thought it was clear that you believed tradition equally with scripture.\n \n Parcum: What about the argument that scripture was canonized through tradition and that tradition was superior as to this? What is your take on that. Again, I repeat an argument from another thread.", 
   {}, 
   19306, 
   null, 
   1066176360.0
  ], 
  [
   19309, 
   null, 
   "Parcum", 
   "Parcum: What about the argument that scripture was canonized through tradition and that tradition was superior as to this? What is your take on that. Again, I repeat an argument from another thread.\n\n \n I don't know what you mean, could you please be a bit more explicit on the philosophy of this statement? Remember, he's Orthodox and I'm a Roman, so we have different terms. \n \n Speaking of Terms, here is the Roman term for tradition and scripture.\n \n \"Saced Tradition and Sacred Scripture, then, are bound closely together and communicate one with the other. FOr both of them, flowing out of from the same divine well-spring, come together in some fashion to form one thign and move towards the same goal.Each of them makes present and fruitful in the Church the mystery of Christ, who promised to remain with his own 'always to the close of the age.'\"\n \n \"Hence there exists a close connection and communication between sacred Tradition and sacred Scripture. For both of them, flowing from the same divine wellspring, in a certain way merge into a unity and tend toward the same end. For sacred Scripture is the word of God inasmuch as it is consigned to writing under the inspiration of the divine Spirit. To the successors of the apostles, sacred Tradition hands on in its full purity God's word, which was entrusted to the apostles by Christ the Lord and the Holy Spirit. \n \n \"Thus, by the light of the Spirit of truth, these successors can in their preaching preserve this word of God faithfully, explain it, and make it more widely known. Consequently it is not from sacred Scripture alone that the Church draws her certainty about everything which has been revealed. Therefore both sacred Tradition and sacred Scripture are to be accepted and venerated with the same devotion and reverence.\" \n \n I suppose one could consider the two \"equal\", but the thing isn't that they are equal, but that they are both nessecary to interpret. We can't simply read the bible and assume what we interpret is true. Christ has revealed much to us, and I hope you also believe that he wants us to know all of his revelations, not only the ones that he directed influenced. Even John says \"There are many other things Christ said\" if you look at the end of his gospel. If there are many other things Christ said, shouldn't we know them all? THis is where Apostolic Tradition comes in, where the apostles said, basically, the rest of what Christ said.", 
   {
    "unicode_changes_made": true
   }, 
   19307, 
   null, 
   1066177800.0
  ], 
  [
   19313, 
   null, 
   "epaphras_faith", 
   "I don't know what you mean, could you please be a bit more explicit on the philosophy of this statement? Remember, he's Orthodox and I'm a Roman, so we have different terms. \n \n Speaking of Terms, here is the Roman term for tradition and scripture.\n \n \"Saced Tradition and Sacred Scripture, then, are bound closely together and communicate one with the other. FOr both of them, flowing out of from the same divine well-spring, come together in some fashion to form one thign and move towards the same goal.Each of them makes present and fruitful in the Church the mystery of Christ, who promised to remain with his own 'always to the close of the age.'\"\n \n \"Hence there exists a close connection and communication between sacred Tradition and sacred Scripture. For both of them, flowing from the same divine wellspring, in a certain way merge into a unity and tend toward the same end. For sacred Scripture is the word of God inasmuch as it is consigned to writing under the inspiration of the divine Spirit. To the successors of the apostles, sacred Tradition hands on in its full purity God's word, which was entrusted to the apostles by Christ the Lord and the Holy Spirit. \n \n \"Thus, by the light of the Spirit of truth, these successors can in their preaching preserve this word of God faithfully, explain it, and make it more widely known. Consequently it is not from sacred Scripture alone that the Church draws her certainty about everything which has been revealed. Therefore both sacred Tradition and sacred Scripture are to be accepted and venerated with the same devotion and reverence.\" \n \n I suppose one could consider the two \"equal\", but the thing isn't that they are equal, but that they are both nessecary to interpret. We can't simply read the bible and assume what we interpret is true. Christ has revealed much to us, and I hope you also believe that he wants us to know all of his revelations, not only the ones that he directed influenced. Even John says \"There are many other things Christ said\" if you look at the end of his gospel. If there are many other things Christ said, shouldn't we know them all? THis is where Apostolic Tradition comes in, where the apostles said, basically, the rest of what Christ said.\n\n \n Here I believe that scripture contains all that is necessary. I am unclear on how apostolic tradition works its way out. There a number of \"church fathers\" that I would not put a lot of stock in given their behavior as recorded in history. There are many who have the ability of writing that can enlighten what was already inspired in scripture. I will go with that. I personally have been very deeply touched by the writings of Augustine, Columba, Francis of Assisi (spelling?), and several others. I have also been influenced by C.S. Lewis, Dallas Willard, Bill Thrall, Nouen, tolstoy, and many others. They have assisted me and enlightened me. But scriptures are inspired. God breathed. I do not believe that is true of tradition. Tradition assists and provides instruction, on this I have no doubt and gladly submit to. I do not think them equal or superior. \n \n The bible also says woe to him who adds or takes away from the words of the scripture. Interesting that people came up with cannon. How do you read this passage. I am uncertain on reference. You may actually know.", 
   {
    "unicode_changes_made": true
   }, 
   19309, 
   null, 
   1066178340.0
  ], 
  [
   19370, 
   null, 
   "maximus", 
   "I don't believe the Orthodox Church believes that Holy Tradition and the Bible are equal (both were written by man, but the latter was influenced by God), but since he is Orthodox (and many Catholics believe the same), Holy Tradition is imperative to biblical study. The Orthodox have preserved their Holy Tradition for thousands of years, while the Catholic Church has changed, and many times have forgotten our own traditions, and yet the Orthodox still keep them. I wouldn't say that Montablin is saying that the two are absolutely equal, but more that they are equally important in that if several sources in tradition says one thing, and the bible says something different in one verse, that the verse should be studied and interpreted.\n\n \n Parcum,\n I believe you are confusing Tradition with a big T--Holy Apostolic Tradition and traditions with a small t--customs of the Church growing up from culture. Scripture and Tradition are to be held with equal reverence. Look in the Catechism of the Catholic Church paragraphs 80-83 and further. You can find an online catechism at www.newadvent.org and www.kofc.org. Tradition is not forgotten  and is not changed. It is part of the Revelation of God. Tradition develops but it does not change in the sense of becoming something new. Protestant convert John Henry Cardinal Newman wrote on this but I cannot remember what book.", 
   {}, 
   19306, 
   null, 
   1066191480.0
  ], 
  [
   19379, 
   null, 
   "lappster", 
   "\n \n The bible also says woe to him who adds or takes away from the words of the scripture. Interesting that people came up with cannon. How do you read this passage. I am uncertain on reference. You may actually know.\n\n \n \n Revelation 22:18-19\n \n 18 For I testify unto every man that heareth the words of the prophecy of this book, If any man shall add unto these things, God shall add unto him the plagues that are written in this book:\n 19 And if any man shall take away from the words of the book of this prophecy, God shall take away his part out of the book of life, and out of the holy city, and from the things which are written in this book.", 
   {}, 
   19313, 
   null, 
   1066195200.0
  ], 
  [
   19383, 
   null, 
   "Parcum", 
   "\n Parcum,\n I believe you are confusing Tradition with a big T--Holy Apostolic Tradition and traditions with a small t--customs of the Church growing up from culture. Scripture and Tradition are to be held with equal reverence. Look in the Catechism of the Catholic Church paragraphs 80-83 and further. You can find an online catechism at http://www.newadvent.org and http://www.kofc.org. Tradition is not forgotten and is not changed. It is part of the Revelation of God. Tradition develops but it does not change in the sense of becoming something new. Protestant convert John Henry Cardinal Newman wrote on this but I cannot remember what book.\n\n \n Yes, I realized this later on (by reading the catechism).", 
   {}, 
   19379, 
   null, 
   1066196160.0
  ], 
  [
   19459, 
   null, 
   "epaphras_faith", 
   "Revelation 22:18-19\n \n 18 For I testify unto every man that heareth the words of the prophecy of this book, If any man shall add unto these things, God shall add unto him the plagues that are written in this book:\n 19 And if any man shall take away from the words of the book of this prophecy, God shall take away his part out of the book of life, and out of the holy city, and from the things which are written in this book.\n\n \n Maximus:\n \n What do you think of these verses. How do they apply to anything? What does the catechism say?", 
   {}, 
   19379, 
   null, 
   1066264920.0
  ], 
  [
   19667, 
   null, 
   "montalban", 
   "I don't actually know what the church believes. I only report what was stated in various other threads with montalban.\n \n Montalban, if Parcum is representing you correctly please advise. if not also please advise. I thought it was clear that you believed tradition equally with scripture.\n \n Parcum: What about the argument that scripture was canonized through tradition and that tradition was superior as to this? What is your take on that. Again, I repeat an argument from another thread.\n\n \n Tradition is the Bible as best understood. This is something I've stated before.\n \n Parcum has touched upon this now when he said that people can read a passage of the Bible but need guidance. Without guidance, you get 100,000s of different Christian groups each saying \"we are right; we base our beliefs on the Bible\"\n \n In a sense Tradition is superior, in that it generated the Bible, and is older. But Tradition does not contradict the Bible. Tradition has also said that the Bible is the pinnacle of our Holy Books.\n \n Look at the 'Doctrine of the Trinity'. This was developed after the 12 Apostles moved on. It has its roots in the Bible. Using the Bible, we could have argued that God created Jesus.\n \n Or another argument that Jesus was not corporeal, but a phantom, because Arians claimed that God couldn't actually 'suffer' on the cross.\n \n If you believe in the Trinity, as existing co-eternally, and that Jesus was both Man and God together then you are accepting the Bible as interpreted through Holy Tradition.\n \n I agree with Parcum and not Maximus that Holy Tradition in the Catholic Church has changed.\n \n In Orthodoxy, we keep to the same Divine Liturgy as written in the 300s. In a Catholic Church there is probably musical instruments that accompany the chanting - or actually, Catholics don't so much chant anymore as sing. Catholics don't think it is an issue to have liturgical consistency, and neither do most Protestants. Thus on any particular Sunday you can go to any Catholic Church and hear a different service from the one down the road. Not so with Orthodoxy. For a particular date, the Liturgy is the same throughout the Orthodox world. And certainly we don't jump up and down in ecstasy as many Chaismatics do.\n \n We believe we keep to the ways of worship as first developed.\n \n \n \n \n \n Go méadaí Dia thú! (May God prosper you!)", 
   {}, 
   19307, 
   null, 
   1066389900.0
  ], 
  [
   19875, 
   null, 
   "maximus", 
   "I agree with Parcum and not Maximus that Holy Tradition in the Catholic Church has changed.\n \n In Orthodoxy, we keep to the same Divine Liturgy as written in the 300s. In a Catholic Church there is probably musical instruments that accompany the chanting - or actually, Catholics don't so much chant anymore as sing. Catholics don't think it is an issue to have liturgical consistency, and neither do most Protestants. Thus on any particular Sunday you can go to any Catholic Church and hear a different service from the one down the road. Not so with Orthodoxy. For a particular date, the Liturgy is the same throughout the Orthodox world. And certainly we don't jump up and down in ecstasy as many Chaismatics do.\n \n We believe we keep to the ways of worship as first developed.\n \n\n \n Montalban,\n \n Parcum agrees with me after reading the Catechism (he posted this). Actually and more importantly he agrees with the Church which is the duty of any Catholic. And everything I have stated is in submission to the Church. Tradition cannot \"change\" being that it is part of the revelation of God. It can develop however. (Tradition--\"the Church's lived understanding of the deposit of faith, handed on faithfully and completely from one generation of Christians to the next.\" Pat Madrid)\n \n You are mistaken if you think that Catholics do not believe in liturgical consistency. There are several rites but all of the essentials are preserved. What you have seen in modern Catholicism is liturgical abuse and priests taking free reign to change liturgy when they have no legitimate power to do so. This stems from misinterpretation and distortion of Vatican II. A \"reform\" of the \"reformed\" liturgy is under way.", 
   {}, 
   19667, 
   null, 
   1066461000.0
  ], 
  [
   19879, 
   null, 
   "Parcum", 
   "As Maximus has stated, Vatican II still continued our liturgical consistancy that we have had in the past. Although it is less consistant than the Trinitine Mass, it is still very consistant. However, musically, perhaps not. But Gregorian chant in the Vatican II mass is georgious. I know the mass in Latin, and absolutely love chant. When I was younger I was in the choir, and we sang gregorian chant. In fact I hope to rejoin a choir and continue to sing now that my voice is more predictable. :-)", 
   {}, 
   19875, 
   null, 
   1066463040.0
  ], 
  [
   19884, 
   null, 
   "maximus", 
   "Parcum,\n You might be interested to know that Vatican II actually encouraged Gregorian chant and I believe proclaimed it essential (I have the quote somewhere around here). This has gone unheeded for the most part.", 
   {}, 
   19879, 
   null, 
   1066464300.0
  ], 
  [
   19887, 
   null, 
   "epaphras_faith", 
   "Parcum,\n You might be interested to know that Vatican II actually encouraged Gregorian chant and I believe proclaimed it essential (I have the quote somewhere around here). This has gone unheeded for the most part.\n\n \n I have a CD of Celtic Daily prayer that I listen to. It includes things like Columba's Blessing, some complines, etc. I enjoy it greatly.", 
   {}, 
   19884, 
   null, 
   1066464540.0
  ], 
  [
   20912, 
   null, 
   "Drac", 
   "The entire bible is filled with the truth of demons, the spirit world and demon possession. Jesus and his followers cast demons out of people all the time. If you ask me, it would see weird if they didn't believe that stuff.\n \n the problem I have is manly with the pope (never mention in the bible, just an invention by Catholics)\n \n and the fact that they have tons of ways in which they take the spotlight of Christ. I believe Christ + Nothing = Salvation, but the catholic church (an many of Christian churches as well) wants to throw in a bunch of works like baptism and conformation, etc. And dont forget praying to the virgin mary as their hope, etc\n\n \n \n \n Sakata;\n Read Rev 21;27 on those who make up lie's, and your one of them who know nothing of the Catholic faith has I found with most Protestants.\n \n You think the stuff we practice is not in scripture maybe you people should go to the site, [ Defenders of the faith], this site would make your comments look stupid.and also show you the truth behind our beliefs not lie's that are spread from people like you.\n \n Go ahead and look at the site, or will you be to worried you will sink in sand with your false beliefs, it will open your eye,s which speaks of people like you who spread lie's.\n \n Are you one who follow's their own private beliefs from scripture as the millions out there who do and cannot agree from the word of God because you have no athority to guide you has the rest who are anti Catholic.\n \n You have lots to learn my friend, for you look like your only 17 years of age and think you know it all. take a peek. boo\n Peace Drac", 
   {
    "unicode_changes_made": true
   }, 
   8589, 
   null, 
   1067508540.0
  ], 
  [
   20947, 
   null, 
   "epaphras_faith", 
   "Sakata;\n Read Rev 21;27 on those who make up lie's, and your one of them who know nothing of the Catholic faith has I found with most Protestants.\n \n You think the stuff we practice is not in scripture maybe you people should go to the site, [ Defenders of the faith], this site would make your comments look stupid.and also show you the truth behind our beliefs not lie's that are spread from people like you.\n \n Go ahead and look at the site, or will you be to worried you will sink in sand with your false beliefs, it will open your eye,s which speaks of people like you who spread lie's.\n \n Are you one who follow's their own private beliefs from scripture as the millions out there who do and cannot agree from the word of God because you have no athority to guide you has the rest who are anti Catholic.\n \n You have lots to learn my friend, for you look like your only 17 years of age and think you know it all. take a peek. boo\n Peace Drac\n\n \n Drac:\n \n Do you know that you are responding to someone that hasn't posted since June 3, 2003?", 
   {}, 
   20912, 
   null, 
   1067557320.0
  ], 
  [
   20948, 
   null, 
   "Parcum", 
   "That's too bad. I liked Sakata.", 
   {}, 
   20947, 
   null, 
   1067557500.0
  ], 
  [
   23214, 
   null, 
   "Adrenalin30", 
   "I personally don't see why you guys have a problem with the Pope, The Catholic religion IMO is the only religion that is based on what Jesus taught us when he was on earth. You have John the Baptist that created his own version of what Jesus taught when he was here, and created the Baptist faith, and then you have Saint Luther that created the Lutheran faith. Saint Peter was the only one that took what Jesus taught when he was on earth and created what is known as the Catholic faith. I'm not saying that any of the other religions is wrong; I'm just saying that the Catholic religion is the only one that sticks to what Jesus taught.\n \n And as far as the Pope is concerned, again; the Pope is the God, the one who sets the rules, such as Jesus did here on earth. I mean don't get me wrong we don't worship the Pope; we only worship God and God only. The Pope is just the keeper of tradition and keeps the religion from changing outside of what the bible says.", 
   {
    "unicode_changes_made": true
   }, 
   10855, 
   null, 
   1069284780.0
  ], 
  [
   23220, 
   null, 
   "Charchuk", 
   "I personally don't see why you guys have a problem with the Pope, The Catholic religion IMO is the only religion that is based on what Jesus taught us when he was on earth. You have John the Baptist that created his own version of what Jesus taught when he was here, and created the Baptist faith, and then you have Saint Luther that created the Lutheran faith. Saint Peter was the only one that took what Jesus taught when he was on earth and created what is known as the Catholic faith. I'm not saying that any of the other religions is wrong; I'm just saying that the Catholic religion is the only one that sticks to what Jesus taught.\n \n And as far as the Pope is concerned, again; the Pope is the God, the one who sets the rules, such as Jesus did here on earth. I mean don't get me wrong we don't worship the Pope; we only worship God and God only. The Pope is just the keeper of tradition and keeps the religion from changing outside of what the bible says.\n\n \n The Catholic religion? And here I think that they were Christians. :)", 
   {
    "unicode_changes_made": true
   }, 
   23214, 
   null, 
   1069286460.0
  ], 
  [
   23224, 
   null, 
   "Benjamin", 
   "Traditions of men are NEVER to be held on the same level as the Inspired Word of God, that is taught strongly agianst in the Scriptures. WE are, as many as are led by the Holy Spirit, under the law of grace. Traditions of men, as practised in the old testament preisthood (the order thereof), is according to early church documents, the extreme sin of what we read to be the \"Nicolaitans\" (Revelation 2:6/ 15). This is the sin of putting men in a position above and beyond what is meant in the Holy Textbook. \n \n It is imortant to be completely reverent towards God.\n \n Much Love,\n Benjamin\n bensaved2001@hotmail.com", 
   {}, 
   23220, 
   null, 
   1069288920.0
  ], 
  [
   23230, 
   null, 
   "Adrenalin30", 
   "The Catholic religion? And here I think that they were Christians. :)\n\n \n Well if your Catholic your not evil, so I guess were christians to ;)", 
   {}, 
   23220, 
   null, 
   1069295820.0
  ], 
  [
   23232, 
   null, 
   "Adrenalin30", 
   "Traditions of men are NEVER to be held on the same level as the Inspired Word of God, that is taught strongly agianst in the Scriptures. WE are, as many as are led by the Holy Spirit, under the law of grace. Traditions of men, as practised in the old testament preisthood (the order thereof), is according to early church documents, the extreme sin of what we read to be the \"Nicolaitans\" (Revelation 2:6/ 15). This is the sin of putting men in a position above and beyond what is meant in the Holy Textbook. \n \n It is imortant to be completely reverent towards God.\n \n Much Love,\n Benjamin\n bensaved2001@hotmail.com\n\n \n Never said we held the same level, I just said that the Catholic faith is the closest thing to what Jesus taught when he was on earth.", 
   {}, 
   23224, 
   null, 
   1069296000.0
  ], 
  [
   23266, 
   null, 
   "Parcum", 
   "Traditions of men are NEVER to be held on the same level as the Inspired Word of God, that is taught strongly agianst in the Scriptures. WE are, as many as are led by the Holy Spirit, under the law of grace. Traditions of men, as practised in the old testament preisthood (the order thereof), is according to early church documents, the extreme sin of what we read to be the \"Nicolaitans\" (Revelation 2:6/ 15). This is the sin of putting men in a position above and beyond what is meant in the Holy Textbook.\n\n \n Why then do Jews keep traditions of men and the holy scripture on the same level?", 
   {}, 
   23232, 
   null, 
   1069319640.0
  ], 
  [
   23267, 
   null, 
   "montalban", 
   "The Catholic religion? And here I think that they were Christians. :)\n\n You seem remarkably unsure about terminologies.", 
   {}, 
   23220, 
   null, 
   1069321980.0
  ], 
  [
   23268, 
   null, 
   "montalban", 
   "Never said we held the same level, I just said that the Catholic faith is the closest thing to what Jesus taught when he was on earth.\n\n \n Oh, really? And where in your scheme of things is Orthodoxy?", 
   {}, 
   23232, 
   null, 
   1069322400.0
  ], 
  [
   23327, 
   null, 
   "maximus", 
   "Benjamin,\n I just posted this on another thread and I thought it might be relevant here:\n \n Concerning tradition:\n \n What do you think of these verses?\n \n 1 Cor 11:2, \"I commend you because you remember me in everything and maintain the traditions   even as I have delivered them to you.\" \n \n 2 Thess 2:15, \"So then, brethren, stand firm and hold to the traditions   which you were taught by us, either by word of mouth or by letter.\"\n \n It seems that the Bible approves of Tradition. \n \n the \"traditions of men\" and Holy Apostolic Tradition are two different things. The Catholic Church honors Holy Apostolic Tradition.\n \n Peace.", 
   {
    "unicode_changes_made": true
   }, 
   23268, 
   null, 
   1069365360.0
  ], 
  [
   24521, 
   null, 
   "slowj", 
   "Sakata,\n See Matthew 16: 18-19 and compare it with Isaiah 22 for the scriptural foundation for the papacy. This scriptural papacy stuff is plentiful but sometimes not overt. I have tons more of references but I have already e-mailed you about this. If anyone else is interested I can e-mail a detailed attachment. Interesting to know where the wacky Catholics get this stuff. It is not out of thin air!\n\n \n \n id like that document. thanks in advance!", 
   {
    "post_info": {
     "post_title": "cool."
    }
   }, 
   10855, 
   null, 
   1070089320.0
  ], 
  [
   28707, 
   null, 
   "montalban", 
   "Never said we held the same level, I just said that the Catholic faith is the closest thing to what Jesus taught when he was on earth.\n\n \n Suggested reading\n http://www.fatheralexander.org/booklets/english/sects1_e.htm", 
   {}, 
   23232, 
   null, 
   1072008120.0
  ], 
  [
   28778, 
   null, 
   "montalban", 
   "Why does the Catholic Church seek to destroy Orthodoxy?", 
   {}, 
   28707, 
   null, 
   1072083300.0
  ], 
  [
   29063, 
   null, 
   "montalban", 
   "Why does the Catholic Church seek to destroy Orthodoxy?\n\n \n A very good question :)\n \n (I had hoped to spur debate - but none's forth coming hence more releasing of cats amongst pigeons here...)\n \n The Catholic Church argues very doggedly on a number of issues\n \n a) a celibate clergy\n b) the filioque controversy*\n \n A number of Catholics will argue quite convincingly why their Church holds to these ideas.\n \n However, the Roman Catholic Church wanted to woo Orthodox Christians away. They offered them protection from the Turks and in order to sweeten the deal, allowed these groups to continue on with their own forms of worship.\n \n Thus the Maronite Catholic Church, the Greek Catholic Church, the Ukrainian Catholic Church and others were born.\n \n They all allow a married clergy, and they say the Creed in its original form - without the filioque. Even when the Pope pays visit to one of these churches, the Eastern Liturgy is used - so the Pope says the Creed in the original manner.\n \n Thus Catholic arguments fall through, because they are willing to make exceptions to their rulings - in order to undermine the Orthodox faith.\n \n \n \n \n \n \n \n \n \n \n \n \n \n *The Nicene Creed - a statement of what we believe, was drawn up in the 300s. One line states... \"We believe in the Holy Spirit, the Lord and giver of life... who proceeds from the Father.\"\n \n Some centuries later, the western churches (Roman ones) added to this line. After \"Father\" they added \"and the Son\" (in Latin this is Filioque). This suggests that the Holy Spirit proceeds from two sources which is theologically flawed. Further, the decision to add to the sentence was done out of the context of an eccumenical meeting.", 
   {}, 
   28778, 
   null, 
   1072338420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What's wrong with Catholicism?", 
  "url": "http://www.4forums.com/political/religion-debates/586-whats-wrong-catholicism.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 586, 
  "discussion_files": [
   [
    "11438.html", 
    "http://www.4forums.com/political/religion-debates/586-whats-wrong-catholicism-print.html"
   ], 
   [
    "11439.html", 
    "http://www.4forums.com/political/religion-debates/586-whats-wrong-catholicism-7-print.html"
   ], 
   [
    "11440.html", 
    "http://www.4forums.com/political/religion-debates/586-whats-wrong-catholicism-5-print.html"
   ], 
   [
    "11441.html", 
    "http://www.4forums.com/political/religion-debates/586-whats-wrong-catholicism-4-print.html"
   ], 
   [
    "11442.html", 
    "http://www.4forums.com/political/religion-debates/586-whats-wrong-catholicism-6-print.html"
   ], 
   [
    "11443.html", 
    "http://www.4forums.com/political/religion-debates/586-whats-wrong-catholicism-3-print.html"
   ], 
   [
    "11444.html", 
    "http://www.4forums.com/political/religion-debates/586-whats-wrong-catholicism-2-print.html"
   ]
  ], 
  "identifier": 586
 }
]