[
 [
  [
   144194, 
   null, 
   "The Skeptic", 
   "I would reccomend that you take a look at/research these links:\n \n A good overview of the issue:\n \n http://www.ghcaonline.com/CreationScience101.htm\n \n Databases of Creationist arguments. (Index's of topics)\n \n (General and widespread arguments)\n \n http://www.answersingenesis.org/home/area/qa.asp\n http://www.icr.org/index.php?module=home&action=sitemap\n http://www.designdynamics.org/faq.html\n http://www.users.bigpond.com/rdoolan/creationtips.html\n http://www.creationdefense.org/_vti_bin/shtml.dll/search.htm\n http://www.apologeticspress.org/cgi-bin/search/search.pl (specializing in evolutionist attacks on Christianity)\n http://nwcreation.net/\n \n (A wide spread of attacks on evolution)\n \n http://www.evolution-facts.org/Cruncher%20TOC.htm\n http://www.pathlights.com/ce_encyclopedia/Index.htm\n http://www.godandscience.org/evolution/index.html\n http://www.csama.org/CSA-LOCL.HTM\n \n (refutations to common evolutionist arguments)\n \n http://www.godandscience.org/apologetics/answers.html\n http://www.creationresearch.org/vacrc.html#CurrentProjects (A creationist, scientific research center.)\n \n (Additional)\n \n http://www.trueorigin.org/ (specializes in refuting talk.origins)\n \n Creationist Books:\n \n http://www.creationscience.com/onlinebook/IntheBeginningTOC.html\n http://www.answersingenesis.org/home/area/re1/index.asp\n http://www.answersingenesis.org/home/area/re2/index.asp\n http://www.answersingenesis.org/Home/Area/AnswersBook/index.asp\n \n Theistic evolution v. Creationism. (also in the general category)\n \n (general)\n \n http://www.godandscience.org/apologetics/creation.html\n \n (Bible accuracy: general.)\n \n http://www.godandscience.org/apologetics/authenticity.html\n http://home.earthlink.net/~ronrhodes/Inspiration.html \n http://www.secretmotive.com/articles/why_the_bible_is_the_true_inspired_infallible_word_of_god.asp\n \n (Bible accuracy: medical practices.)\n \n http://www.bibleevidences.com/medical.htm\n http://www.newhope.bc.ca/98-01-11.htm\n http://www.pytlik.com/observe/deliverus/signature-05.html\n http://www.answersingenesis.org/creation/v17/i1/medicine.asp\n http://www.answersingenesis.org/creation/v26/i1/hygiene.asp\n \n (Bible accuracy: archeology.)\n \n \n http://www.bibleevidences.com/archeology.htm\n http://www.myfortress.org/archaeology.html\n http://www.carm.org/evidence/evidence_archaeological.htm\n http://www.biblestudymanuals.net/quran7.htm\n http://faithfacts.gospelcom.net/maps_a.html\n http://vvv.com/~csnobelen/jericho.html\n http://www.irr.org/mit/bibarch1.html\n http://www.ucgstp.org/lit/booklets/true/archaeol.html\n http://isaalmasih.net/archaeology-isa/\n \n (Bible accuracy: other)\n \n http://www.bibleevidences.com/scientif.htm \n http://www.bibleevidences.com/transmission.htm \n http://www.bibleevidences.com/prophecy.htm\n \n Creationists debate victories:\n \n http://www.nwcreation.net/debates.html#anchorTranscripts", 
   {
    "post_info": {
     "post_title": "If your serious about defending creationism and attacking evolution..."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1120444500.0
  ], 
  [
   144204, 
   null, 
   "PoohBear", 
   "thanks so much for these sites. they help alot in the defense for creation.", 
   {}, 
   144194, 
   null, 
   1120445520.0
  ], 
  [
   144225, 
   null, 
   "Mucusaur", 
   "Pity you are hell bent on stifling america's scientific progress. If I were you,I would be watching out for the rise of large sector of scientifically literate Indians and Chinese - who will work for less than Americans. If I was CEO of a Medicine or biotech firm would I want to set up in a country hostile to scientific progress? \n \n Enjoy your second dark age boys!", 
   {}, 
   144204, 
   null, 
   1120450860.0
  ], 
  [
   144320, 
   null, 
   "Clive14", 
   "Pity you are hell bent on stifling america's scientific progress. If I were you,I would be watching out for the rise of large sector of scientifically literate Indians and Chinese - who will work for less than Americans. If I was CEO of a Medicine or biotech firm would I want to set up in a country hostile to scientific progress? \n \n Enjoy your second dark age boys!\nUnfortunately it is becoming apparent that many Americans do not just reject the science of evolution, but the science of global warming too. As they head toward their new Dark Age they could very well take the rest of the world with them.\n \n Thankfully the scientific community in America remains strong and continues to lead the world scientifically in many ways despite the appalling attitude toward science that much of the American public has. The American scientific community deserves our full priase therefore for putting up such a strong fight against such widespread ignorance and utter stupidity. Don't therefore write them off yet.", 
   {}, 
   144225, 
   null, 
   1120472040.0
  ], 
  [
   144326, 
   null, 
   "Alan Ryan", 
   "Without a regular supply of naive, incoherent, or asinine posters prepared to deny even the most well established scientific hypotheses, laws of physics, etc., other interested parties (e.g. the casual readers) would not get a chance to how scientific method and rational arguments are deployed to answer and refute nonsense. For this reason, the \"fruit and nutters\" should not be completely discouraged.", 
   {}, 
   144320, 
   null, 
   1120477020.0
  ], 
  [
   144338, 
   null, 
   "Winston Smith", 
   "Without a regular supply of naive, incoherent, or asinine posters prepared to deny even the most well established scientific hypotheses, laws of physics, etc., other interested parties (e.g. the casual readers) would not get a chance to how scientific method and rational arguments are deployed to answer and refute nonsense. For this reason, the \"fruit and nutters\" should not be completely discouraged.\n\n \n the problem is that the scientists don't rule the world but the fundamentalists do and since Global Warming does not appear in the Bible it can not be true. Right?\n By the way when the day comes that the fruity nutters are proved wrong it will be too late. And the fruity nutters will say: \"It was God's will \"\n We are doomed as the fundamentalist -capitalist axis in the USA will screw the world for good sooner or later.", 
   {
    "unicode_changes_made": true
   }, 
   144326, 
   null, 
   1120483860.0
  ], 
  [
   144798, 
   null, 
   "The Skeptic", 
   "the problem is that the scientists don't rule the world but the fundamentalists do and since Global Warming does not appear in the Bible it can not be true. Right?\n By the way when the day comes that the fruity nutters are proved wrong it will be too late. And the fruity nutters will say: \"It was God's will \"\n We are doomed as the fundamentalist -capitalist axis in the USA will screw the world for good sooner or later.\n\n \n (Why was this posted in Creation v. Evolution?)\n \n Can you please show me how you believe Global Warming is linked to Christians? I'm a Christian and a Creationist, and I, like all Federal elected politicians, believe that Global Warming would be a bad thing. I think that we should do what we can to stop that kind of thing from happening. The questions are this: can we stop it, what is neccesary to stop it, or does it even exist? Now, how did you all get the idea that Creationist Christians are anti-environment?", 
   {
    "unicode_changes_made": true
   }, 
   144338, 
   null, 
   1120601280.0
  ], 
  [
   144799, 
   null, 
   "Mucusaur", 
   "The point is that america is becoming hostile to science, and you are in the vangaurd of that assault.", 
   {}, 
   144798, 
   null, 
   1120601400.0
  ], 
  [
   144800, 
   null, 
   "Jenn", 
   "There are scientific impossibilities that still happen every day. Because science can or cannot expalin something does not make it true. Take for instance the bumblebee, there is a quote that was on posters in American briefing rooms during WW2 reading \" By all known laws which can be rpoved on papaer and in the wind tunnel, the bumblebee cannot fly. The size of his wings in relation to his body, according to aeronautical and mathematical science, simply means he cannot fly. It is impossibility! But of course the bumblebee doesnt know these rules so he goes ahead and flies anyway\" So do not rely too heavily on scientific fact, true and proven or still theory. Because there are excpetions to this rule in nature, how can we honestly say that we know creationism is false? or for evidence supporting creationism how can we say we know it is true? We cant we have facts, suspicons, and support, but since there are examples of exceptions we have 2 acknowlede the fact that we dont nkow all of them or why. We don't know, we just try.", 
   {}, 
   144338, 
   null, 
   1120601820.0
  ], 
  [
   144815, 
   null, 
   "Mucusaur", 
   "Creationists have never proved their theory. They push their agenda with propaganda, outright lies, and undermining the confidence of the public in science. Just look at the stuff that a creationist recently posted about darwin. Quite hate filled stuff.", 
   {}, 
   144800, 
   null, 
   1120603320.0
  ], 
  [
   144822, 
   null, 
   "The Skeptic", 
   "Creationists have never proved their theory. They push their agenda with propaganda, outright lies, and undermining the confidence of the public in science. Just look at the stuff that a creationist recently posted about darwin. Quite hate filled stuff.\n\n \n Evidence? The whole list of links that I presented in the first post of this thread prove that your idea is incorrect.", 
   {}, 
   144815, 
   null, 
   1120604040.0
  ], 
  [
   144825, 
   null, 
   "Mucusaur", 
   "Evidence for a creator? You're quite the scholar. \n \n In any case, your arguemants have been proven wrong time and time again. I am not inclined to rehash those again.", 
   {}, 
   144822, 
   null, 
   1120604280.0
  ], 
  [
   144835, 
   null, 
   "The Skeptic", 
   "Evidence for a creator? You're quite the scholar. \n \n In any case, your arguemants have been proven wrong time and time again. I am not inclined to rehash those again.\n\n \n Thats fine. Now, since you seem to have enough time to continue posting on this forum, I would reccommend that you try to defeat the proof that I posted in the creation and evolution thread. This thread was intended to be a resource for creationists.", 
   {}, 
   144825, 
   null, 
   1120605120.0
  ], 
  [
   144840, 
   null, 
   "Mucusaur", 
   "I simply cannot argue with your sig line\n \n \" Where there is an intelligent design, there is also an intelligent designer.\"\n \n Well, since evolution is the current paradigm, and I am feeling lazy,why dont you try to defeat evolution?", 
   {}, 
   144835, 
   null, 
   1120605480.0
  ], 
  [
   144852, 
   null, 
   "The Skeptic", 
   "I simply cannot argue with your sig line\n \n \" Where there is an intelligent design, there is also an intelligent designer.\"\n \n Well, since evolution is the current paradigm, and I am feeling lazy,why dont you try to defeat evolution?\n\n \n \n OK. I'll try to have some good points ready for you in about an hour.\n \n Heres something for you to think about in the mean time: you think the would is billions of years old, right? How do you know?", 
   {}, 
   144840, 
   null, 
   1120606380.0
  ], 
  [
   144856, 
   null, 
   "Waxy", 
   "Is anyone else struck by the amazing similarity of The Skeptic to Ray Martinez in particular, but stormboy, Nu Leader, HeavenBound, god_is_real, and others that claim \"proof\" and \"scientific evidence\"? \n \n It's like there's a factory out there just churning out clones. Spooky.\n \n Apparently, The Skeptic is in charge of collecting the raw materials for the factory. :p \n \n Waxy", 
   {}, 
   144840, 
   null, 
   1120606860.0
  ], 
  [
   144865, 
   null, 
   "Mucusaur", 
   "I dont want to getinto another creation vs evolution thread. But I will throw down a few lines here\n \n 1. Varves and ryhtmically depostied structures. Varves and ice cores show layers coresponding to time. These can stretch back 1000's of years, older than the bible claims anyway\n \n 2. K-Ar dating. Works on a foundation of nuclear decay- but I;m certain you will find soemthing that says all geologists are atheist frauds who made all this up, along with a healthy helping of errors of K-Ar\n \n 3. the magnetic striping along the ocean floor. Suffice to say the reversal in the poles leaves its mark in the crsatls of rocks, and as the ocean floor moves apart this leaves stipes of alternting polarity. Needless to say, this requires a faair few years, judging that ocean spreading rates are as fast your fingernails grow\n \n 4.since we have found several tens of massive meteorite craters- impacts of \"biblical proportions\", this does not fit into a 6000 year old earth, as there would be likely a cataclysm in the last century or so. 60 into 6000 is one every hundred years or so.\n \n 5. all them fossils 'n sh1t\n \n 6.evidences of glaciation, intrusions, contintal drift, metamorphism, diffusion in the mantle, isostasic rebound and countless other factors which operate on the million year scale.\n \n All this is off the top of my head, based on my ongoing studies of geology.", 
   {}, 
   144852, 
   null, 
   1120607580.0
  ], 
  [
   144876, 
   null, 
   "The Skeptic", 
   "(if you want to discuss these issues)\n \n Your going to have to explain them more thoroughly, provide evidence, and decide which one to discuss first. Do you want me to try to disprove evolution, or do you want me to defend creationism?", 
   {}, 
   144865, 
   null, 
   1120609380.0
  ], 
  [
   144878, 
   null, 
   "Mucusaur", 
   "You can do what ever you want - I am not geting involved in a debate with you. Goodbye", 
   {}, 
   144876, 
   null, 
   1120609500.0
  ], 
  [
   145021, 
   null, 
   "Clive14", 
   "(if you want to discuss these issues)\n \n Your going to have to explain them more thoroughly, provide evidence, and decide which one to discuss first. Do you want me to try to disprove evolution, or do you want me to defend creationism?\n\n \n Why not take me up on my challenge to any creationist (since peddler ran away) to formally debate an aspect of evolution. See http://4forums.com/political/showthread.php?t=5375 for more details.", 
   {}, 
   144876, 
   null, 
   1120646580.0
  ], 
  [
   145036, 
   null, 
   "Clive14", 
   "the problem is that the scientists don&#8217;t rule the world but the fundamentalists do and since Global Warming does not appear in the Bible it can not be true. Right?\nIt would appear that the fundamentalists are wrong-footing us on this one by supporting the call for action on global warming:\n \n http://news.bbc.co.uk/1/hi/world/americas/4642241.stm", 
   {}, 
   144338, 
   null, 
   1120655160.0
  ], 
  [
   145285, 
   null, 
   "The Skeptic", 
   "It would appear that the fundamentalists are wrong-footing us on this one by supporting the call for action on global warming:\n \n http://news.bbc.co.uk/1/hi/world/americas/4642241.stm\n\n \n Thank you, Clive. I realize it takes a lot of courage to debunk a straw man from your own side, and, at least for that, you have my respect. \n \n As to your challenge of debate, I need to have some things clarified. Are you offering me the choice of the resolution, AFF/NEG position, and time of debate?\n \n Before I get involved in any sort of official debate on this forum, I would need to know the rules involved, and have time to research the resolution, if that is necessary.", 
   {}, 
   145036, 
   null, 
   1120707360.0
  ], 
  [
   145292, 
   null, 
   "The Skeptic", 
   "Another question: can you provide me with a definition of your position?", 
   {}, 
   145285, 
   null, 
   1120708860.0
  ], 
  [
   145391, 
   null, 
   "Clive14", 
   "Another question: can you provide me with a definition of your position?\nMy position is that biblical creation has been utterly falsified, \"intelligent design\" is a joke of a psuedo-science with no evidence to support it at all and that biological evolution over a few billion years has been demonstrated to have occured beyond all sane, rational and sensible doubt. Also the \"big bang\", cosmic evolution, moon dust, abiogenesis and a range of other things that creationists try to lump together as evolution have nothing to do with biological evolution and biological evolution isn't dependent upon any of them.\n \n I'm happy to debate just about anything around this broad sweep of subjects, though I might have to refuse some aspects of the debate if it involves too much physics rather than biology for example. As to the rules on debating etc, check out the \"rules for debate\" thread in the Debate Tournaments section. I'd suggest adopting the 5/4 rounds idea suggested and that we each pick two judges and try and agree a 5th one between us. You pick the title of topic, I'm then happy for you to start or to ask me to start.\n \n Basically I've never indulged in a formal debate before, so I'm open to suggestions.", 
   {}, 
   145292, 
   null, 
   1120736700.0
  ], 
  [
   145399, 
   null, 
   "Winston Smith", 
   "It would appear that the fundamentalists are wrong-footing us on this one by supporting the call for action on global warming:\n \n http://news.bbc.co.uk/1/hi/world/americas/4642241.stm\n\n Yes, but not all of them. And I don't think they ride on donkeys", 
   {}, 
   145036, 
   null, 
   1120738320.0
  ], 
  [
   145401, 
   null, 
   "Clive14", 
   "Yes, but not all of them. And I don't think they ride on donkeys\nTrue, no one rides those asses any more. They drive SUVs these days.", 
   {}, 
   145399, 
   null, 
   1120738500.0
  ], 
  [
   146882, 
   null, 
   "canadianman77", 
   "My position is that biblical creation has been utterly falsified, \"intelligent design\" is a joke of a psuedo-science with no evidence to support it at all and that biological evolution over a few billion years has been demonstrated to have occured beyond all sane, rational and sensible doubt. Also the \"big bang\", cosmic evolution, moon dust, abiogenesis and a range of other things that creationists try to lump together as evolution have nothing to do with biological evolution and biological evolution isn't dependent upon any of them.\n \n I'm happy to debate just about anything around this broad sweep of subjects, though I might have to refuse some aspects of the debate if it involves too much physics rather than biology for example. As to the rules on debating etc, check out the \"rules for debate\" thread in the Debate Tournaments section. I'd suggest adopting the 5/4 rounds idea suggested and that we each pick two judges and try and agree a 5th one between us. You pick the title of topic, I'm then happy for you to start or to ask me to start.\n \n Basically I've never indulged in a formal debate before, so I'm open to suggestions.\nThere is evidence for intelligent design everywhere you look. Right down to the incredibly complex design of an atom. DNA is another marvel to behold. A person sees what they want to see. If you want to see a speck of dust in the universe with life on it and deny the possibility of life anywhere else, then that is your choice. If you never saw a computer before and came upon one, would you decide that the earth naturally formed it even after you disassembled it and saw that the cpu was millions of times more complex than anything you had ever seen before? Or would you have a sneaking suspicion that it just may have been designed and assembled by an intelligent creature? Ya know, Slap me and call me susan, but I think I would opt for a designer. On a side note, if you know a lot about biology? Could you give me a rundown on DNA?", 
   {}, 
   145391, 
   null, 
   1121245740.0
  ], 
  [
   146885, 
   null, 
   "Symbiote", 
   "If you step back and look at the economy, it is even more complex than any microchip or strand of DNA, and yet to try and plan such an economy would inevitably fail.\n \n I think it's a small mind that sees complexity and assumes it must have been designed, there is no appreciation there for the complexities generated by relatively simple interacting parts.", 
   {}, 
   146882, 
   null, 
   1121247780.0
  ], 
  [
   146886, 
   null, 
   "Clive14", 
   "There is evidence for intelligent design everywhere you look.\nNope. You may see \"design\" in everything, but that is not evidence for \"intelligent design\".\n \n \nRight down to the incredibly complex design of an atom.\nEh? Which is very good reason for not seeing an intelligent mind behind it: the atom is ludicrously complex, which makes it very poor \"design\".\n \n \nDNA is another marvel to behold. A person sees what they want to see.\nThat is why we use science, to overcome the problems of such subjectivity.\n \n \nIf you want to see a speck of dust in the universe with life on it and deny the possibility of life anywhere else, then that is your choice.\nIt is an inane choice though.\n \n \nIf you never saw a computer before and came upon one, would you decide that the earth naturally formed it even after you disassembled it and saw that the cpu was millions of times more complex than anything you had ever seen before?\nA million times more complex? I don't think so. \n \n But this whole \"if it looks designed, it must be designed\" argument has a huge gaping hole in it: natural stuff doesn't look designed. Niles Eldredge, biologist and cornet player, actually made the effort to test the ideas of intelligent design using cornets. He applied caldistical analysis to their \"evolution\". Guess what he found? Yep, the cornet - a blatantly designed object - just did not fit in any way shape or form into anything remotely like the clade diagrams that biologists can draw up for all life forms: the cornet didn't evolve, it was designed. Likewise his results (the only known piece of scientific research in existence into ID) clearly showed that life was not designed.\n \n \nYa know, Slap me and call me susan, but I think I would opt for a designer.\nConsider yourself well and trully slapped Susan.\n \n \nOn a side note, if you know a lot about biology? Could you give me a rundown on DNA?\nWhat do you want to know?", 
   {}, 
   146882, 
   null, 
   1121248920.0
  ], 
  [
   146905, 
   null, 
   "canadianman77", 
   "If you step back and look at the economy, it is even more complex than any microchip or strand of DNA, and yet to try and plan such an economy would inevitably fail.\n \n I think it's a small mind that sees complexity and assumes it must have been designed, there is no appreciation there for the complexities generated by relatively simple interacting parts.\n\n An economy is planned. Its planned by the millions and millions of people in the economic region in question from the CEO of the largest multinational corporation down to the welfare bum that plans to be a burden on society. And about complexities generated by relativley simple interacting parts. The fact that everything in the universe is made out of the same 24 particles (that we know of) 48 if you include there antiparticles. then yes you are right about the complexity of the simple. And thank you for that compliment on the size of my mind. You must be sooooo smart to be able to cut people down so well.", 
   {}, 
   146885, 
   null, 
   1121254140.0
  ], 
  [
   146906, 
   null, 
   "canadianman77", 
   "Nope. You may see \"design\" in everything, but that is not evidence for \"intelligent design\".\n \n Eh? Which is very good reason for not seeing an intelligent mind behind it: the atom is ludicrously complex, which makes it very poor \"design\".\n \n That is why we use science, to overcome the problems of such subjectivity.\n \n It is an inane choice though.\n \n A million times more complex? I don't think so. \n \n But this whole \"if it looks designed, it must be designed\" argument has a huge gaping hole in it: natural stuff doesn't look designed. Niles Eldredge, biologist and cornet player, actually made the effort to test the ideas of intelligent design using cornets. He applied caldistical analysis to their \"evolution\". Guess what he found? Yep, the cornet - a blatantly designed object - just did not fit in any way shape or form into anything remotely like the clade diagrams that biologists can draw up for all life forms: the cornet didn't evolve, it was designed. Likewise his results (the only known piece of scientific research in existence into ID) clearly showed that life was not designed.\n \n Consider yourself well and trully slapped Susan.\n \n What do you want to know?\nLike I said, you will see what you want to see. And why is an atom a poor design due to its complexity? Does this mean that a calculator is a poor design and we all should go back to using an abacus? And I want to know everything. But you could start by explaining to me how the sugar and phosporous form the polymers that the bases are attached to. How do they bond to each other?", 
   {}, 
   146886, 
   null, 
   1121254860.0
  ], 
  [
   146915, 
   null, 
   "Clive14", 
   "Like I said, you will see what you want to see.\nNope, I see what's there. I don't actually care what it is.\n \n \nAnd why is an atom a poor design due to its complexity? Does this mean that a calculator is a poor design and we all should go back to using an abacus?\nWhat do calculators have to do with atoms? Can you combine calculators in various ways to create washing machines and aeroplanes?\n \n The whole point of classic design is that one starts with simple building blocks (a transistor for example) and uses them in novel ways to make complex solutions. Atoms are not simple building blocks by any stretch of the imagination.\n \n \nAnd I want to know everything. But you could start by explaining to me how the sugar and phosporous form the polymers that the bases are attached to. How do they bond to each other?\nWe do not know everything and I know just a small subset of that. But I'll do my best.\n \n The polymer is formed from nucleotide monomers: a combination of one of the four \"bases\", a deoxyribose sugar and a phosphate group. The \"backbone\" by itself isn't the polymer. The key to how everything joins together is the deoxyribose sugar. The base attaches via a covalent bond to the C1' carbon atom in the sugar molecule. The phosphate group links the C3' carbon of one sugar to the C5' carbon of the next sugar, again via covalent bonds.", 
   {}, 
   146906, 
   null, 
   1121259000.0
  ], 
  [
   146935, 
   null, 
   "trebor", 
   "There is evidence for intelligent design everywhere you look. Right down to the incredibly complex design of an atom. DNA is another marvel to behold. A person sees what they want to see. If you want to see a speck of dust in the universe with life on it and deny the possibility of life anywhere else, then that is your choice. If you never saw a computer before and came upon one, would you decide that the earth naturally formed it even after you disassembled it and saw that the cpu was millions of times more complex than anything you had ever seen before? Or would you have a sneaking suspicion that it just may have been designed and assembled by an intelligent creature? Ya know, Slap me and call me susan, but I think I would opt for a designer. On a side note, if you know a lot about biology? Could you give me a rundown on DNA?\n\n \n \n That is the logical fallacy known as 'personal incredibilty'. I mean, the arguement that 'Oh, it's just too complex for me to understand how it could come about, so therefore something even MORE complex designed it'; is rather silly.", 
   {}, 
   146882, 
   null, 
   1121267940.0
  ], 
  [
   146970, 
   null, 
   "Symbiote", 
   "An economy is planned. Its planned by the millions and millions of people in the economic region in question from the CEO of the largest multinational corporation down to the welfare bum that plans to be a burden on society.\n\n \n Presumably then \"evolution\" is planned by the millions of animals that live and die producing future generations, or not. I thought you were putting forward the idea of intelligent design in contrast to evolution, but clearly not. When you say things appear to have been \"designed\" you merely mean they are the product of the interactions of disparate individuals without a single purpose.\n \n In other words, you're attempting to change your definition of \"designed\" to suit the situation - the economy is \"designed\" by the interactions of individuals, but present-day DNA can't have been produced by the interactions of individuals, because it was \"designed\".\n \n In either case there are individual actors playing parts, but the total result is unplanned, generated dynamically by their interactions, in both cases the result is complex.", 
   {}, 
   146935, 
   null, 
   1121275080.0
  ], 
  [
   146974, 
   null, 
   "notdakuningist", 
   "I volunteer to judge said debate! :)", 
   {}, 
   146970, 
   null, 
   1121276460.0
  ], 
  [
   147028, 
   null, 
   "canadianman77", 
   "That is the logical fallacy known as 'personal incredibilty'. I mean, the arguement that 'Oh, it's just too complex for me to understand how it could come about, so therefore something even MORE complex designed it'; is rather silly.\n\n So you are saying that because you didnt design the boeing 747 that you fly around in means that it could be a random formation from the earth? after all its a much simpler design that a human being, and we are random formations from the earth without design if what you say is true.", 
   {}, 
   146935, 
   null, 
   1121290860.0
  ], 
  [
   147034, 
   null, 
   "canadianman77", 
   "Nope, I see what's there. I don't actually care what it is.\n \n What do calculators have to do with atoms? Can you combine calculators in various ways to create washing machines and aeroplanes?\n \n The whole point of classic design is that one starts with simple building blocks (a transistor for example) and uses them in novel ways to make complex solutions. Atoms are not simple building blocks by any stretch of the imagination.\n \n We do not know everything and I know just a small subset of that. But I'll do my best.\n \n The polymer is formed from nucleotide monomers: a combination of one of the four \"bases\", a deoxyribose sugar and a phosphate group. The \"backbone\" by itself isn't the polymer. The key to how everything joins together is the deoxyribose sugar. The base attaches via a covalent bond to the C1' carbon atom in the sugar molecule. The phosphate group links the C3' carbon of one sugar to the C5' carbon of the next sugar, again via covalent bonds.\n\n Your silly, calculators have everything to do with atoms. Forst of all, they are made of atoms, and second of all they are one of the main tools used to discribe an atom and how the mechanics of an atom work. And I'm sure that if you had enough calculators and the proper technology, you could disassemble the mollecules and atoms and recombine them into any other atom you wanted and form whatever materials you needed to build a washing machine, or aeroplane, or whatever else you needed. As for transistors, are they not also made out of these incredibly complex atoms you speak of? In what way does that make transistors simple? This is for the DNA question. I thought that the sugar and the phospate were the polymer. Can you not link them without the bases?", 
   {}, 
   146915, 
   null, 
   1121291520.0
  ], 
  [
   147038, 
   null, 
   "canadianman77", 
   "Presumably then \"evolution\" is planned by the millions of animals that live and die producing future generations, or not. I thought you were putting forward the idea of intelligent design in contrast to evolution, but clearly not. When you say things appear to have been \"designed\" you merely mean they are the product of the interactions of disparate individuals without a single purpose.\n \n In other words, you're attempting to change your definition of \"designed\" to suit the situation - the economy is \"designed\" by the interactions of individuals, but present-day DNA can't have been produced by the interactions of individuals, because it was \"designed\".\n \n In either case there are individual actors playing parts, but the total result is unplanned, generated dynamically by their interactions, in both cases the result is complex.\nYes you could say that evolution is planned by the millions and millions of animals that have the choice to breed or not Wich are being constantly modified to exist on the planet as each of the creatures choose to change. An example, a virus mutates, and the animals wich it makes ill become modified to be able to continue to exist. Do computers modify themselves so that the next generation will be immune to the viruses that shut down the previous generation computers? Or is there design behind the modification that allows the computer to fend off these viruses? And the word Design can be used in many different ways. So do not put what I say in \"OTHER WORDS\".", 
   {}, 
   146970, 
   null, 
   1121292360.0
  ], 
  [
   147053, 
   null, 
   "Clive14", 
   "Your silly, calculators have everything to do with atoms. Forst of all, they are made of atoms, and second of all they are one of the main tools used to discribe an atom and how the mechanics of an atom work.\nOh dear, is that really the best you can do? Sorry, but that is pathetic. \n 1. Click on your \"Start\" button (assuming you use windows) and go to Programs-<Accessories-<Calculator. Tell me, which atoms is that calculator made of?\n 2. What century do you live in? Do you really see teams of theoretical physicists sitting around a table tapping away on their Casios working out the workings of the atom? Ever heard of Cern? It uses ever-so-slightly more than a calculator.\n \n \nAnd I'm sure that if you had enough calculators and the proper technology, you could disassemble the mollecules and atoms and recombine them into any other atom you wanted and form whatever materials you needed to build a washing machine, or aeroplane, or whatever else you needed.\nSo you take the calculator apart and use its parts to build a new device. This is not using the calculator as a building block to build a washing machine.\n \n \nAs for transistors, are they not also made out of these incredibly complex atoms you speak of? In what way does that make transistors simple?\nThey are simple as long as they are big enough. The \"building blocks\" from which they are built are weirdly complex. If I could tell you exactly how those complex little beasts can make something so simple, I'd call it \"the theory of everything\" and I would become very very famous...\n \n \nThis is for the DNA question. I thought that the sugar and the phospate were the polymer. Can you not link them without the bases?\nI'm sure you can, but you would have a bunch of carbons floating about that would form weak bonds between them and you'd have a sticky blob, not a nice polymer chain. The bases stabilize the whole structure whilst bonding to each other with only weak hydrogen bonds (rather than the much stronger covalent bonds) and so easily \"unzip\"", 
   {}, 
   147034, 
   null, 
   1121296260.0
  ], 
  [
   147096, 
   null, 
   "trebor", 
   "So you are saying that because you didnt design the boeing 747 that you fly around in means that it could be a random formation from the earth? after all its a much simpler design that a human being, and we are random formations from the earth without design if what you say is true.\n\n \n \n The difference between life and a boeing 747 is that an airplane is not made of self replicating self assembling molecules. Therefore, you are using the logical fallacy of 'false analogy'", 
   {}, 
   147028, 
   null, 
   1121307060.0
  ], 
  [
   147143, 
   null, 
   "canadianman77", 
   "Oh dear, is that really the best you can do? Sorry, but that is pathetic. \n 1. Click on your \"Start\" button (assuming you use windows) and go to Programs-<Accessories-<Calculator. Tell me, which atoms is that calculator made of?\n 2. What century do you live in? Do you really see teams of theoretical physicists sitting around a table tapping away on their Casios working out the workings of the atom? Ever heard of Cern? It uses ever-so-slightly more than a calculator.\n \n So you take the calculator apart and use its parts to build a new device. This is not using the calculator as a building block to build a washing machine.\n \n They are simple as long as they are big enough. The \"building blocks\" from which they are built are weirdly complex. If I could tell you exactly how those complex little beasts can make something so simple, I'd call it \"the theory of everything\" and I would become very very famous...\n \n \"\nYou're not so smart are you? The calculator in my computer would be my computer. As for cern, I said that calculators are an important tool in describing the workings of quantum mechanics. Just because cern has a supercollider doesnt make calculators any less important in mathematical equations Do you know what a calculator is? Denying a physicist a calculator would be like denying a lumberjack a chainsaw. He could get the job done with an axe, but that would just be crazy! And as for teams of theoretical physicists crunching numbers, someone has to be abble to do the math. and you are an idiot if you think that all of the math is done in peoples heads!", 
   {}, 
   147053, 
   null, 
   1121338680.0
  ], 
  [
   147146, 
   null, 
   "Ripskar", 
   "The creationists seem locked in the present, as if everything that exists just got dumped here within the last 50 years.\n Without an understanding of changing conditions and the reaction of organisms to changing conditions none of this makes sence.\n You need to see the start point of a biological structure to see what it has developed from. The jellyfish is a reasonable example a fairly simple \"design\" and barely above the the base line for multicellular orgasnisms.\n Once the basics of what a jellyfish needs to survive are in place there is huge room for radial evolution and today we see thousands of species exhibiting a vast range of forms.", 
   {}, 
   146906, 
   null, 
   1121339220.0
  ], 
  [
   147150, 
   null, 
   "Clive14", 
   "The calculator in my computer would be my computer.\nI tried uninstalling the calculator program. It now no longer works. I'm puzzled as to why as my computer is still there and that is the calculator after all emoticon_rolleyes\n \n \nDo you know what a calculator is? \nNo, I've never seen one in my life before emoticon_rolleyes emoticon_rolleyes\n \n \n...and you are an idiot if you think that all of the math is done in peoples heads!\nAnd you are an even bigger idiot of you think it's done by people tapping away at calculator keys. The maths is done by big ****-off computers. Hey let me guess though, your line is going to be \"but they do calculations, therefore they are calculators, hur hur hur\" emoticon_rolleyes emoticon_rolleyes emoticon_rolleyes emoticon_rolleyes", 
   {}, 
   147143, 
   null, 
   1121343300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  If your serious about defending creationism and attacking evolution...", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5870-if-your-serious-about-defending-creationism-attacking-evolution.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 5870, 
  "discussion_files": [
   [
    "4027.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5870-if-your-serious-about-defending-creationism-attacking-evolution-print.html"
   ], 
   [
    "4028.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5870-if-your-serious-about-defending-creationism-attacking-evolution-3-print.html"
   ], 
   [
    "4029.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/5870-if-your-serious-about-defending-creationism-attacking-evolution-2-print.html"
   ]
  ], 
  "identifier": 5870
 }
]