[
 [
  [
   145660, 
   null, 
   "simone", 
   "To: National and International desks \n \n Contact: Karen Finney of Democratic National Committee Communications, 202-863-8148 \n \n WASHINGTON, July 7 /U.S. Newswire/ -- Democratic National Committee Chairman Howard Dean issued the following statement: \n \n \"I join all Americans today in offering my condolences to the victims of today's vicious terrorist attacks in London. Our thoughts and prayers are with the victims, their friends and their families. We remain steadfast in our commitment to defeating those who threaten our freedom and values. At a time when world leaders were working together to help make our world a better place, these terrorists were plotting to disrupt that effort by killing and injuring innocent people. We will continue to stand with our allies around the world to defeat terrorism and protect our liberty and freedom.\"", 
   {
    "post_info": {
     "post_title": "Howard Dean Statement on London Attack"
    }
   }, 
   null, 
   null, 
   1120783560.0
  ], 
  [
   146091, 
   null, 
   "Batman", 
   "\"...We will continue to stand with our allies around the world to defeat terrorism and protect our liberty and freedom.\"\n\n Yet he ran on a \"cut and run\" platform during the primaries.", 
   {}, 
   145660, 
   null, 
   1120955220.0
  ], 
  [
   146096, 
   null, 
   "simone", 
   "What \"cut and run\" platform are you talking about? Or, are you just blowing hot air out of a certain aperture?", 
   {}, 
   146091, 
   null, 
   1120956180.0
  ], 
  [
   146101, 
   null, 
   "Kronus", 
   "What \"cut and run\" platform are you talking about? Or, are you just blowing hot air out of a certain aperture?\n\n \"Cut and run\" is conservativeese for \"fight actual terrorists instead of invading Iraq\".", 
   {}, 
   146096, 
   null, 
   1120957500.0
  ], 
  [
   146105, 
   null, 
   "jyoshu", 
   "\"Cut and run\" is conservativeese for \"fight actual terrorists instead of invading Iraq\".\n\n \n I think Iraq must be the only place in the world where a dictator can talk like a terrorist, act like a terrorist, commit acts of terror, and yet still not be called a terrorist. Anwhere else, Saddam certainly would be.\n \n Bizarre.", 
   {}, 
   146101, 
   null, 
   1120960860.0
  ], 
  [
   146110, 
   null, 
   "Matthew S", 
   "Yet he ran on a \"cut and run\" platform during the primaries.\n\n \n \n The difference you do not understand that Iraq had nothing to do with terrorism. Afganistan is where the terrorists that attacked us were located. Why did we go into Iraq, other then Bushs vendatta?\n \n You might understand this if you weren't listening to fox news and if you would take you haed out of bush's butt.", 
   {}, 
   146091, 
   null, 
   1120965660.0
  ], 
  [
   146120, 
   null, 
   "Kronus", 
   "I think Iraq must be the only place in the world where a dictator can talk like a terrorist, act like a terrorist, commit acts of terror, and yet still not be called a terrorist. Anwhere else, Saddam certainly would be.\n \n Bizarre.\n\n \n Pretty much by definition government rulers can't be terrorists. They can be brutal, evil tyrants, but not terrorists. Terrorists are independent groups that work outside the system; Saddam was the system. No one is saying he wasn't a bad man, but he wasn't a terrorist, and he most certainly had nothing to do with any terrorists acts commited against the US.", 
   {}, 
   146105, 
   null, 
   1120971420.0
  ], 
  [
   146192, 
   null, 
   "Batman", 
   "You might understand this if you weren't listening to fox news and if you would take you haed out of bush's butt.\n\n Perhaps you should take yours out of your own.", 
   {}, 
   146110, 
   null, 
   1121012580.0
  ], 
  [
   146261, 
   null, 
   "jyoshu", 
   "Pretty much by definition government rulers can't be terrorists. They can be brutal, evil tyrants, but not terrorists. Terrorists are independent groups that work outside the system; Saddam was the system. No one is saying he wasn't a bad man, but he wasn't a terrorist, and he most certainly had nothing to do with any terrorists acts commited against the US.\n\n \n The meaning of 'terrorist' is inherent in the term itself--terror.\n \n To really get a fair definition, I'd suggest you ask relatives of the children killed from his actions in Iraq--try telling them he's no terrorist. \n \n \nPerhaps you should take yours out of your own.\n\n \n LOL! :p", 
   {}, 
   146120, 
   null, 
   1121042640.0
  ], 
  [
   146263, 
   null, 
   "Eddie", 
   "The meaning of 'terrorist' is inherent in the term itself--terror.\n \n To really get a fair definition, I'd suggest you ask relatives of the children killed from his actions in Iraq--try telling them he's no terrorist. \n \n\n \n I wouldn`t call Bush a terrorist, but I bet there are some Iraqi orphants from the second Gulf War that where pretty terryfied by the US bombers and soldiers that took their parents away from them. Do you still thinks it`s a fair deifnition of a terrorist?", 
   {}, 
   146261, 
   null, 
   1121042940.0
  ], 
  [
   146271, 
   null, 
   "Kronus", 
   "The meaning of 'terrorist' is inherent in the term itself--terror.\n \n\n \n That is, of course, foolishness. Duh, the root of the word terrorist is terror. Etymology is not where we look to define words, however. We look to dictionaries. They define terrorism as the unlawful use of force or violence. Saddam was the law. What he did was evil, but as ruler of the country not illegal. Deal with it. Saddam was not a terrorist, and the war in Iraq had nothing to do with the war on terror.", 
   {}, 
   146261, 
   null, 
   1121045760.0
  ], 
  [
   146362, 
   null, 
   "Raastee", 
   "The difference you do not understand that Iraq had nothing to do with terrorism. Afganistan is where the terrorists that attacked us were located. Why did we go into Iraq, other then Bushs vendatta?\n \n You might understand this if you weren't listening to fox news and if you would take you haed out of bush's butt.\n\n \n Never mind the fact that Iraq was in no serious condition to wage a war of any kind, she had no military fly zone, she was getting no military aid and yet Bush thought she was a threat. \n It is amazing to see those who continue to support open war on Iraq never use any objective data in their support- break out the 9/11 report and read it. Sadly the truth of the matter is that we are in Iraq because of Bush and that is all folks. \n If I recall correctly the men on those plane during 9/11 were mostly Sandis, that brings up a good question- why did we not invade their homeland?\n The millions of dollars that were used to trian those men...Sandi money..hmmm.", 
   {}, 
   146110, 
   null, 
   1121100900.0
  ], 
  [
   146367, 
   null, 
   "biccat", 
   "Sadly the truth of the matter is that we are in Iraq because of Bush and that is all folks.\n\n My god, your ability to dip and weave is incredible. In the words of Trinity from the matrix:\n Dodge this\n \n \nLet me be clear on what the U.S. objectives are: The United States wants Iraq to rejoin the family of nations as a freedom-loving and law-abiding member. This is in our interest and that of our allies within the region.\n\n But yeah, a change in Iraq was completely because of Bush and right-wing whackjobs.", 
   {}, 
   146362, 
   null, 
   1121101560.0
  ], 
  [
   146371, 
   null, 
   "jyoshu", 
   "I wouldn`t call Bush a terrorist, but I bet there are some Iraqi orphants from the second Gulf War that where pretty terryfied by the US bombers and soldiers that took their parents away from them. Do you still thinks it`s a fair deifnition of a terrorist?\n\n \n To take that alone is to throw out the concept of intent. If civilians are hit by accident, it's unintentional (though still very tragic and should be a cause to reign in military action in many cases). If a dictator purposely kills a bunch of innocent people (not other soldiers in battle), I'd certainly call that terror.\n \n \nDuh, the root of the word terrorist is terror. Etymology is not where we look to define words, however. We look to dictionaries. They define terrorism as the unlawful use of force or violence. Saddam was the law. What he did was evil, but as ruler of the country not illegal. \n\n \n That's ridiculous--if we went by that definition, we should not have invaded the Taliban at all as they were the law there (yet I haven't seen you condemn that). I'm sure in a terrorist camp or area there are laws too by local leaders, but we still consider them terrorist. In the real world, terrorism is defined by the the fact that it terrorizes a populace and commits intentional acts of violence on innocent people.", 
   {}, 
   146263, 
   null, 
   1121102220.0
  ], 
  [
   146377, 
   null, 
   "Kronus", 
   "\n That's ridiculous--if we went by that definition, we should not have invaded the Taliban at all as they were the law there (yet I haven't seen you condemn that). I'm sure in a terrorist camp or area there are laws too by local leaders, but we still consider them terrorist. In the real world, terrorism is defined by the the fact that it terrorizes a populace and commits intentional acts of violence on innocent people.\n\n \n No. The real world uses real dictionaries, not ones made up on the spur of the moment to fit current political needs. Terrorism is not the use of force, it is the illegal use of force. I know you don't want to except this because it invalidates what you're are trying to prove. But what you are trying to prove is wrong. Deal with it and move on. And we didn't invade Afghanistan because the Taliban were terrorists, we invaded because they were shielding terrorists. If they weren't protecting Al-Queda we wouldn't have gone there.", 
   {}, 
   146371, 
   null, 
   1121103360.0
  ], 
  [
   146387, 
   null, 
   "jyoshu", 
   "No. The real world uses real dictionaries, not ones made up on the spur of the moment to fit current political needs. Terrorism is not the use of force, it is the illegal use of force. I know you don't want to except this because it invalidates what you're are trying to prove. But what you are trying to prove is wrong. Deal with it and move on. And we didn't invade Afghanistan because the Taliban were terrorists, we invaded because they were shielding terrorists. If they weren't protecting Al-Queda we wouldn't have gone there.\n\n \n If we used your twisted logic, we couldn't have invaded Afganistan because it was legal in their country for them to 'shield' those terrorists. Looks like you could use a dose of consistency. Better start dealing with it and move on.", 
   {}, 
   146377, 
   null, 
   1121104380.0
  ], 
  [
   146392, 
   null, 
   "Kronus", 
   "If we used your twisted logic, we couldn't have invaded Afganistan because it was legal in their country for them to 'shield' those terrorists. Looks like you could use a dose of consistency. Better start dealing with it and move on.\n\n \n Just keeping digging that hole, maybe you'll come out the other end eventually!\n \n We didn't invade Afghanistan to enforce the law. We're not cops. We invaded because they were sheltering our enemies, the terrorists. The ones who were using illegal force. \n \n I understand that this is all quite confusing for you. That's only to be expected when you get in the habit of changing the meanings of words at a whim. Allow me to summarize for you.\n \n terrorist: someone who uses, or threatens to use, illegal force\n Al-Queda: terrorists, because they use illegal force\n Taliban: sheltered terrorists who attacked us, so we attacked them\n Saddam: bad man, but not a terrorist\n \n I hope this is sinking in.", 
   {}, 
   146387, 
   null, 
   1121106000.0
  ], 
  [
   146401, 
   null, 
   "biccat", 
   "\n terrorist: someone who uses, or threatens to use, illegal force\n \n\n I don't think this definition fits, because then anyone who batters another person or kills another person is a terrorist.\n \n Wouldn't a better definition of a terrorist be \"Someone who uses force or threat of force to coerce public action through fear or apprehension\"?\n \n \nSaddam: bad man, but not a terrorist\n\n I doubt that everything Saddam did was legal in his country. In fact, I'm pretty sure rape and torture were illegal uses of force. But he did them, so under your definition, he was a terrorist.\n \n I suppose you can maybe say he didn't rape or torture directly, but then I'd have to counter that neither has Osama Bin Ladin. And I'm pretty sure he was a terrorist.", 
   {}, 
   146392, 
   null, 
   1121106660.0
  ], 
  [
   146411, 
   null, 
   "Kronus", 
   "I don't think this definition fits, because then anyone who batters another person or kills another person is a terrorist.\n \n Wouldn't a better definition of a terrorist be \"Someone who uses force or threat of force to coerce public action through fear or apprehension\"?\n \n\n \n Nope, that's too broad. The US government executes criminals, and that would qualify under your defintion. LIkewise the \"shock and awe\" campaign in Iraq would also qualify.\n \n A combination of the two works:\n \n Someone who illegally uses force or threat of force to coerce public action through fear or apprehension.\n \n You are right that trying to coerce the public is a key element.", 
   {}, 
   146401, 
   null, 
   1121107620.0
  ], 
  [
   146412, 
   null, 
   "RedMoon", 
   "Why aren't we invading Sudan?", 
   {}, 
   146411, 
   null, 
   1121107800.0
  ], 
  [
   146422, 
   null, 
   "biccat", 
   "Someone who illegally uses force or threat of force to coerce public action through fear or apprehension.\n\n OK, but switch \"illegal\" for \"unlawful.\"\n \n I still think that would classify Hussein as a terrorist.\n \n Sorry :P", 
   {}, 
   146411, 
   null, 
   1121109900.0
  ], 
  [
   146428, 
   null, 
   "Kronus", 
   "OK, but switch \"illegal\" for \"unlawful.\"\n \n I still think that would classify Hussein as a terrorist.\n \n Sorry :P\n\n \n Well, unless you have access to the Iraqi legal codes we can't really resolve the point. We do know that governments allow themselves to do things they don't let the people do, like executing people in the US. We also know it was government policy in Iraq to torture disidents. Was there a law on the books saying that the government wasn't allowed to use torture, but they did it anyway? I doubt it, but I don't know how we could demonstrate it one way or the other.", 
   {}, 
   146422, 
   null, 
   1121110800.0
  ], 
  [
   146438, 
   null, 
   "jyoshu", 
   "Just keeping digging that hole, maybe you'll come out the other end eventually!\n \n We didn't invade Afghanistan to enforce the law. We're not cops. We invaded because they were sheltering our enemies, the terrorists. The ones who were using illegal force. \n\n \n Dude, there's no hole--you're so desperate to oppose Bush and his war that you'll do anything to the point of acting like Saddam isn't really a terrorist. You're running in rhetorical circles. \n \n It's plain as day--if 'illegal' is the standard for who a terrorist and who's not (as you clearly seem to think), then you're a hypocrite for not opposing the invasion of Afganistan and overthrow the Taliban. Clearly the Taliban considered it quite legal to harbor Bin Laden. Give it up--you're completely desperate at this point and you've backed yourself into a corner.", 
   {}, 
   146392, 
   null, 
   1121113260.0
  ], 
  [
   146439, 
   null, 
   "jyoshu", 
   "I still think that would classify Hussein as a terrorist.\n\n \n Of course he's a friggin' terrorist! Good grief, if we're not going to consider him one, we might as well drop the moniker altogether for any one commiting acts of terror out there.", 
   {}, 
   146422, 
   null, 
   1121113380.0
  ], 
  [
   146446, 
   null, 
   "simone", 
   "The meaning of 'terrorist' is inherent in the term itself--terror.\n \n To really get a fair definition, I'd suggest you ask relatives of the children killed from his actions in Iraq--try telling them he's no terrorist.\nI wonder if all the various bodies of the persons murdered in Iraq could be piled up--sorry, I know this is a very ugly image--and you separated the bodies that Saddam Hussein murdered from the pile of bodies that George Walker Bush murdered and did an accurate count, I wonder which pile would be bigger.", 
   {}, 
   146261, 
   null, 
   1121114940.0
  ], 
  [
   146449, 
   null, 
   "biccat", 
   "I wonder if all the various bodies of the persons murdered in Iraq could be piled up--sorry, I know this is a very ugly image--and you separated the bodies that Saddam Hussein murdered from the pile of bodies that George Walker Bush murdered and did an accurate count, I wonder which pile would be bigger.\n\n Just out of curiosity, how many people has George W. Bush murdered?\n \n Oh wait, you're not going to come up with an inflated statistic about civilian casualties caused by Iraqi terrorists that are a consequence of the Iraq Liberation; rather than people who George W. Bush actually ordered to die, are you?", 
   {}, 
   146446, 
   null, 
   1121115780.0
  ], 
  [
   146457, 
   null, 
   "simone", 
   "Let's just count the bodies piled up before the current insurgents were allowed into the county by George Walker Bush because he doesn't know how to mount a damned war.", 
   {}, 
   146449, 
   null, 
   1121116980.0
  ], 
  [
   146461, 
   null, 
   "biccat", 
   "Let's just count the bodies piled up before the current insurgents were allowed into the county by George Walker Bush because he doesn't know how to mount a damned war.\n\n OK, but to be fair, we have to consider those that died during Hussein's rule and subtract those from the ones Bush \"murdered.\"\n \n If Hussein was killing 10 a year, and Bush invaded and killed 4 a year, then Bush isn't really increasing the dead by removing Hussein. That does make sense, right?", 
   {}, 
   146457, 
   null, 
   1121117220.0
  ], 
  [
   146470, 
   null, 
   "Kronus", 
   "\n It's plain as day--if 'illegal' is the standard for who a terrorist and who's not (as you clearly seem to think), then you're a hypocrite for not opposing the invasion of Afganistan and overthrow the Taliban. Clearly the Taliban considered it quite legal to harbor Bin Laden. Give it up--you're completely desperate at this point and you've backed yourself into a corner.\n\n \n You don't realise how little sense that makes, do you? Here's your sylogism simplified.\n \n Terrorism is illeagal.\n The Taliban protection of Bin Laden was within Taliban law.\n Therefore we shouldn't have invaded Afghanistan.\n \n How is that conclusion supposed to follow from the first two statements? I said it before so saying it again probably won't help, but here goes. We fought the Taliban because they were sheltering our enemies. That's it, and that's more than enough.", 
   {}, 
   146438, 
   null, 
   1121120100.0
  ], 
  [
   146478, 
   null, 
   "georged", 
   "\n Oh wait, you're not going to come up with an inflated statistic about civilian casualties caused by Iraqi terrorists that are a consequence of the Iraq Liberation; rather than people who George W. Bush actually ordered to die, are you?\n\n \n There's a debatable point, who is responsible for post-Saddam deaths, military and civilian? Taking both positions, one could say the signed executive order to invade and occupy Iraq is responsible, which means the US public, countered by..... give me a moment on this one, I need to sort and review official releases by date. Ah, here we are, I had to go through WMDs, Saddam was a bad guy, foreign fighters, humanitarianism, but the current answer is, those who resist democracy. Or does that sound too authoritarian in a nation building manner?", 
   {}, 
   146449, 
   null, 
   1121123580.0
  ], 
  [
   146481, 
   null, 
   "Michele", 
   "By your definition of terrorist, the Shah of Iran certainly fit. But he was our terrorist, just as Saddam was ours during the 80's, or rather Rummy's.", 
   {}, 
   146377, 
   null, 
   1121124180.0
  ], 
  [
   146489, 
   null, 
   "gnojek", 
   "My god, your ability to dip and weave is incredible. In the words of Trinity from the matrix:\n Dodge this\n \n \n But yeah, a change in Iraq was completely because of Bush and right-wing whackjobs.\n\n No, the WAR in Iraq was completely because of neocon nutjobs with the full idiocy of the US congress to back them up.\n \n This Act you link to says nothing about US involvement in a war or occupation.\n \n\n This Act makes clear that it is the sense of the Congress that the United States should support those elements of the Iraqi opposition that advocate a very different future for Iraq than the bitter reality of internal repression and external aggression that the current regime in Baghdad now offers.\n\n \nThe United States is providing support to opposition groups from all sectors of the Iraqi community that could lead to a popularly supported government.\n\n \n \nThat's ridiculous--if we went by that definition, we should not have invaded the Taliban\n\n We didn't invade the Taliban, we invaded Afghanistan.\n The Taliban weren't the terrorists, it was Al Qeada. \n We invaded because the Taliban was harboring the terrorists.\n If Saddam was harboring terrorists, we would have invaded Iraq too on that premise.\n \n \nIn the real world, terrorism is defined by the the fact that it terrorizes a populace and commits intentional acts of violence on innocent people.\n\n Right, you can be a \"legitimate\" leader and still harbor terrorists,\n or actually sanction and order terrorist attacks.\n \n Whether something is called \"terrorism\" though by this definition would be rather flexible depending on what one considers as \"innocent\" and \"intentional.\"", 
   {}, 
   146367, 
   null, 
   1121125200.0
  ], 
  [
   146492, 
   null, 
   "simone", 
   "OK, but to be fair, we have to consider those that died during Hussein's rule and subtract those from the ones Bush \"murdered.\"\n \n If Hussein was killing 10 a year, and Bush invaded and killed 4 a year, then Bush isn't really increasing the dead by removing Hussein. That does make sense, right?\nGeeze, let's give George Walker Bush a tad of credit.\n \n Hades! Bush was a far more efficient murderer than Hussein, he had bombers and planes at his disposition, all kinds of weaponry. Bush makes Hussein look like a wimpy piker in comparison, at least in regard to the killing machines each employed.", 
   {}, 
   146461, 
   null, 
   1121126280.0
  ], 
  [
   146616, 
   null, 
   "Ghost", 
   "They define terrorism as the unlawful use of force or violence. Saddam was the law. What he did was evil, but as ruler of the country not illegal. Deal with it.\n\n \n So what we all need to do is create our own laws and then we can do whatever we want. Great.\n \n And actually, what he did was illegal. Mass killings of people? I'm pretty damned sure that's a no-no in the realm of international law. After all, Saddam is up on war crimes...", 
   {}, 
   146271, 
   null, 
   1121154660.0
  ], 
  [
   146642, 
   null, 
   "biccat", 
   "Geeze, let's give George Walker Bush a tad of credit.\n \n Hades! Bush was a far more efficient murderer than Hussein, he had bombers and planes at his disposition, all kinds of weaponry. Bush makes Hussein look like a wimpy piker in comparison, at least in regard to the killing machines each employed.\n\n Now wait a minute, that's not being fair to Saddam. Bush had chemical weapons at his disposal and he never unleashed them onto the Iraqi public.\n \n He also had an entire government structure built around installing fear into the population.\n \n How many mass graves has the US filled in Iraq?", 
   {}, 
   146492, 
   null, 
   1121178240.0
  ], 
  [
   146662, 
   null, 
   "simone", 
   "Now wait a minute, that's not being fair to Saddam. Bush had chemical weapons at his disposal and he never unleashed them onto the Iraqi public.\nHmm, let me see here, so depleted uranium is not a chemical weapon?", 
   {}, 
   146642, 
   null, 
   1121183400.0
  ], 
  [
   146665, 
   null, 
   "georged", 
   "Hmm, let me see here, so depleted uranium is not a chemical weapon?\n\n \n Of course not. We're a very humanitarian military force in that none of our volunteers are allowed to shoot each other with depleted uranium projectiles. There is, of course, 'collateral damage' to careless citizens, opposing military forces and all infrastructure that gets in our way, but that's just an untidy means to the end when spreading the good of democracy to those who have strayed from a christian path.", 
   {}, 
   146662, 
   null, 
   1121183940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Howard Dean Statement on London Attack", 
  "url": "http://www.4forums.com/political/politics-debates/5909-howard-dean-statement-london-attack.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 5909, 
  "discussion_files": [
   [
    "30178.html", 
    "http://www.4forums.com/political/politics-debates/5909-howard-dean-statement-london-attack-print.html"
   ], 
   [
    "30179.html", 
    "http://www.4forums.com/political/politics-debates/5909-howard-dean-statement-london-attack-3-print.html"
   ], 
   [
    "30180.html", 
    "http://www.4forums.com/political/politics-debates/5909-howard-dean-statement-london-attack-2-print.html"
   ]
  ], 
  "identifier": 5909
 }
]