[
 [
  [
   145798, 
   null, 
   "gamehuis", 
   "http://news.bbc.co.uk/1/hi/world/middle_east/4659287.stm\n \n Well, this was bound to happen. I guess the people that said that the Dawa party had no ties with Iran have been proven dead wrong.\n \n I'm sure GW is cursing his XXX off right now.", 
   {
    "post_info": {
     "post_title": "Iraq and Iran getting in bed together"
    }
   }, 
   null, 
   null, 
   1120817880.0
  ], 
  [
   145804, 
   null, 
   "daewoo", 
   "http://news.bbc.co.uk/1/hi/world/middle_east/4659287.stm\n \n Well, this was bound to happen. I guess the people that said that the Dawa party had no ties with Iran have been proven dead wrong.\n \n I'm sure GW is cursing his XXX off right now.\n\n \n Well, you know, just because the dawa party is based in tehran, and funded by the iranian governemnt, and they (the iranian government) essentially have veto power over canidates, does not mean that the party has ties with iran.\n \n you had to be an idiot to buy that anyway.\n \n It will be interesting to see how the US reacts to this at an official level. It puts them in kind of a nasty situation since there are weapons manufacturers all over the planet, including from the US, to sell Iraq the newest, latest and greatest weapons. A strategic military allince between IRan and Iraq, which by proxy means syria, since syria and IRan already have a mutual defense pact, means that all those bright, shiny new goodies will be available to Iraq and Syria as well. I wonder what our chances are at invading syria if we have to deal with not only the russian anti tank systems that they are using, but the ?US made anti aircraft systems that shipped out of califonia last week, headed for Iraq?\n \n The only option would be for the Bush administration to say \"we screwed up, don't sell those guys any weapons\". Without the \"we screwed up\", it won't work because people will say \"you created that governetn, why shouldn't we sell them weapons?\"\n \n Military intervention in the ME just got very, very, very expensive.", 
   {}, 
   145798, 
   null, 
   1120820580.0
  ], 
  [
   145835, 
   null, 
   "georged", 
   "Could provide an easy solution for US withdrawal from Iraq. Current US administration is stating the only reason we have troops in Iraq is to train the Iraqi military to provide security within their own country and Iran certainly has the capability to do that. Considering that US administration has backed itself into a tiny corner, I wonder what type of deceptive spin will be applied to reject the new development? \n \n Looking at Iran's economic circumstances, Iraq should be so fortunate as to be aligned with Iran. A higher rate of economic growth than the US or Europe with a strong industrial GDP percentage, little debt, solid positive payment balance and energy resources being exported. As an Islamic nation, what better role model for Iraq?", 
   {}, 
   145804, 
   null, 
   1120834380.0
  ], 
  [
   145880, 
   null, 
   "fracas", 
   "silly\n \n \n Germany has promised to train iraqis as well. it does not make it any more than that.\n \n \nTehran has asked Baghdad not to allow the US to establish long-term military bases on its soil, fearing that it would consolidate what Iranians see as the American and Israeli military domination of the region.\n \n But Mr Dulaimi insisted that foreign troops were needed to ensure Iraqi security.\n \n He added: \"Iraq will not be a source of insecurity and instability for any of its neighbours. Nobody can use [Iraqi territory] to attack its neighbours.\"\n \n Sensitive issues\n \n Among other areas of co-operation, Mr Shamkhani listed mine clearance, anti-terrorism, identifying those still missing from the Iran-Iraq war and training and re-equipping the Iraqi army.\n \n The two ministers said more sensitive issues such as a full peace treaty and war reparations were still a long way from being resolved.\n\n \n 1. Iraq is keeping US bases and troops.\n 2. cooperation with clearing mines, MIA, and some equipment issues\n 3. full peace treaty a long way off. don't you think it is premature to form an alliance when you can't even declare peace nearly at hand?\n \n what ever.", 
   {}, 
   145835, 
   null, 
   1120846680.0
  ], 
  [
   145895, 
   null, 
   "Desaix", 
   "Who would have thought a Tehran thought and funded Iraqi Shia party was going to ally itself with Iran? :p \n \n The good thing about this is that Iran wants Jaafari to succeed,so they could become a vital ally to the US(not that they haven't helped the US out before with al-Sadr etc)in the short term.", 
   {}, 
   145880, 
   null, 
   1120851600.0
  ], 
  [
   145897, 
   null, 
   "lord tammerlain", 
   "silly\n \n \n Germany has promised to train iraqis as well. it does not make it any more than that.\n \n \n \n 1. Iraq is keeping US bases and troops.\n 2. cooperation with clearing mines, MIA, and some equipment issues\n 3. full peace treaty a long way off. don't you think it is premature to form an alliance when you can't even declare peace nearly at hand?\n \n what ever.\n\n \n Germany doesnt share a boarder, a religion and a couple of decades of supporting the current elected officials in Iraq.\n \n Iran/Iraq (Shia) cooperation unless stopped by the US government is going to increase over the coming years. It will be a far more important relationship then Iraq/EU including the UK. If the US was not planning on having permanent military bases in Iraq the Iran/Iraq relationship would be stronger then the US/Iraq relationship.\n \n The religous ties alone would assure that.", 
   {}, 
   145880, 
   null, 
   1120851960.0
  ], 
  [
   145901, 
   null, 
   "fracas", 
   "Germany doesnt share a boarder, a religion and a couple of decades of supporting the current elected officials in Iraq.\n \n Iran/Iraq (Shia) cooperation unless stopped by the US government is going to increase over the coming years. It will be a far more important relationship then Iraq/EU including the UK. If the US was not planning on having permanent military bases in Iraq the Iran/Iraq relationship would be stronger then the US/Iraq relationship.\n \n The religous ties alone would assure that.\n\n \n i have no problems with iraq and iran having good relationship. and it is inevitable since they are both shia dominated countries. and it would also be bad for the region should the opposite occur, another war between the two. the key for success with iraq is not whether it becomes a US puppette. the key for success with iraq is whether it can become a free and successful democracy. if so, even better if their relation with iran is good, because it means iraq will serve as both an example of a true democracy for iranians, as well as exert democratic influence on that of the government of iran.\n \n but it is way premature to hail a new iraq-iran alliance when they haven't even made peace yet. i repeat from the BBC article\n \nThe two ministers said more sensitive issues such as a full peace treaty and war reparations were still a long way from being resolved.\n", 
   {}, 
   145897, 
   null, 
   1120852500.0
  ], 
  [
   145904, 
   null, 
   "lord tammerlain", 
   "Iran is hedging it's bets when it come to the peace treaty. If Iran believed that Iraq is going to be \"non alligned\" or at least not pro US a peace treaty would be signed relatively quickly. Overall the reparations are the financial hammer Iran has over a pro US Iraq and a big hammer it is. Iran suffered far more damage from Saddam Iraq then did Kuwait, and will be entilted to far larger reparations.", 
   {}, 
   145901, 
   null, 
   1120853940.0
  ], 
  [
   145928, 
   null, 
   "daewoo", 
   "silly\n \n \n Germany has promised to train iraqis as well. it does not make it any more than that.\n\n \n http://www.latimes.com/news/nationworld/iraq/complete/la-fg-foes8jul08,1,5904364.story?coll=la-iraq-complete\n \n \nTEHRAN - Former foes Iran and Iraq said Thursday that they would sign a military cooperation agreement that would include Iranian help in training Iraq's armed forces, despite likely U.S. opposition.\n\n \n Wow, long ways off, but they are apparently ready to sign a military cooperation treaty now.\n \n \nIran last year offered to train Iraqi border guards, but Iraq declined the offer. Relations have steadily improved since Iraq's Shiite majority sealed its political dominance in elections this year.\n\n \n Yes....they refused Iranian involvement last year, but now that the Dawa party is running things, tehy are hopping right in bed with them.", 
   {
    "unicode_changes_made": true
   }, 
   145880, 
   null, 
   1120859160.0
  ], 
  [
   145976, 
   null, 
   "fracas", 
   "Dulaimi said Iran had offered $1 billion in aid to show its support for Iraq's quest for postwar recovery. He did not give further details. \n\n \n previously you argued that Jafarri was working with the US for the monetary support it got. perhaps they are doing the same now?\n \n \n sorry but you are reading more into events than there are.\n 1. training troops do not make them allies. as the germans and the jordanians are also training iraqi. not to mention the US.\n 2. as previously stated, i am not interested in a puppet iraqi government for the previously posted reasons.\n \n the LA times is XXX, well known for intentional and significant ommission.\n lets try Arabic News \n \nHowever, the two ministers admitted that pending issues are still there unsolved including the peace treaty and the war loses. Concerning the war loses, Iran asks to be compensated. Duleimi said \"We came to our Iranian brothers asking them for help and we did not tackle sensitive issues.\" He added \"our Iranian brothers promised us of USD one billion of aid in the forms of loans.\"\n\n \n you are very blinded by your bias daewoo.\n sad thing is it is by choice rather than by capacity.\n but that could be me making assumptions about ability.\n \n whatever. it is there in print. cry wolf all you want. feel free to have the last word on this fabricated strategic crisis.", 
   {}, 
   145928, 
   null, 
   1120869600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Iraq and Iran getting in bed together", 
  "url": "http://www.4forums.com/political/peace-middle-east/5915-iraq-iran-getting-bed-together.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 5915, 
  "discussion_files": [
   [
    "14134.html", 
    "http://www.4forums.com/political/peace-middle-east/5915-iraq-iran-getting-bed-together-print.html"
   ]
  ], 
  "identifier": 5915
 }
]