[
 [
  [
   146452, 
   null, 
   "The Shire", 
   "emoticon_xangel ok guys...I know you've probably seen enough polls similiar to this one...but...I just thought it would be cool to do another one... ...lol...thanks for your cooperation!!! So...give me your opinions towards LOTR and HP...make sure to talk both about the books and movies. Please do not use colourful languages (swear words). I want a clean debate!!!...thanks again!!! \n \n my opinion: LOTR all the way!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n reasons: better acting, awsome plot, beautiful story, very meaningful, original, and cuter actors...lol emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "Lord of the Rings vs. Harry Potter!!!"
    }
   }, 
   null, 
   null, 
   1121116140.0
  ], 
  [
   147845, 
   null, 
   "KM_Scharnhorst", 
   "Hmmmm....\n \n Time for...a Pointless Fictional Character Battle(PFCB) Edition #982314-A9C\n \n Aragorn Elessar vs. Harry Potter\n \n Harry: *picks up wand* Now you're going to get it! *starts saying some random spell*\n \n Aragorn: ...*takes Anduril, Flame of the West and stabs Harry* Too slow dude, too slow.\n \n Harry: ...Oh...damn it... *dies*\n \n -----\n \n Legolas, Prince of Mirkwood vs. Ron Weasley\n \n Ron: Heeeey, you're not like the elves where I come from!\n \n Legolas: And where's that?\n \n Ron: England\n \n Legolas: Well duh, those elves suck, and they're not nearly as pretty as me! Anyway.... *shoots Ron with arrow*\n \n Ron: Damn, J.K. Rowling, I'll bloody get your for making me a poor idiot if it's the last thing I-*dies*.\n \n ----\n \n The Witch-King of Angmar vs. Dementor #6\n \n WKoA: You cannot defeat me, all shall fall before the might of Sauron.\n \n Dementor #6:*tries to suck happiness out of The WKoA, but instead goes numb, cold, and lifeless*.\n \n WKoA: Fool, my soul belongs only to Sauron, you are powerless against me.\n \n Dementor #6: Before I die, I have to say, that's a pretty sweet helmet you've got there.\n \n WKoA: It was an office party gift from The Liutenant of the Black Lands.\n \n Dementor #6: *dies*\n \n ----\n \n Last Battle! \n \n Gandalf the White vs. Dumbledore\n \n Dumbledore: You may have defeated my friends and other assorted characters, but you will not defeat me!\n \n Gandalf: You call yourself a Wizard? You are nothing but a conjurer, a master of smoke and mirrors! You say you are wise? I have lived to see thousands of years of history go by. The fall of kings and tyrants. The rise and fall of great kingdoms, and battles more vast than you can imagine! I am the servant of the Secret Fire, wielder of the Flame of Arnor, your tricks will not save you Dumbledore!\n \n Dumbledore: *Loudly chants various spells and charms, and various shiney runes and symbols appeared and surrounded him like a shell*\n \n Gandalf: Yaaah! *And a great spear of lightning erupted from the white staff of Gandalf, and it smote the magic shell of Dumbledore, throwing him off his feet and launching him backwards approximately 40 feet*.\n \n Dumbledore: *Chants many more spells, long and complicated were they, many which were thought to be lost to all of human kind, save for a few individuals. And Dumbledore raised his hand, and it shone with a white flame. Thus, he struck Gandalf, who had managed to raise Glamdring just in time, to divert some of the force of Dumblefore's attack off it's mark, which still shook the ground with great force.*\n \n Gandalf: So it is, a great battle between two foes.\n \n Dumbledore: Indeed.\n \n Gandalf: nwalca Glamdring, nai yarvaxea rasselya; talhira notto-carrinar...! *And Gandalf's sword roared white, and fired a beam of piercing white directly at Dumbledore, who was blinded. Gandalf raised his staff into the air, and from the sky a mighty arrow of lightning, blazed with immeasurable speed, and it smote Dumbledore, who was left unconscious from the blow. The only thing that saved him from certain death, were his various charms, and incantations.* So it seems, that maybe you are a mightier man than I first thought, but a Wizard you are definitely not.\n \n ----\n \n Lord of the Rings: 4\n Harry Potter: 0", 
   {}, 
   146452, 
   null, 
   1121546640.0
  ], 
  [
   147872, 
   null, 
   "PoohBear", 
   "wow that was random. but i think lotr beats harry potter every time", 
   {}, 
   147845, 
   null, 
   1121554740.0
  ], 
  [
   147906, 
   null, 
   "Desaix", 
   "The LOTR films clearly wup the HP films.More importantly though i enjoy reading HP over LOTR.The first LOTR drags the whole way,as does the last book 50 pages from the end.\n \n I actually rather both the Simarillion and the Hobbit over both series's.", 
   {}, 
   147872, 
   null, 
   1121562180.0
  ], 
  [
   148612, 
   null, 
   "The Shire", 
   "cool...interesting thoughts everyone...i still personally perfer the LOTR movie over HP, however, I had tried to read LOTR but couldn't finished it completely because of JRR Tolkine's difficult language and word playings. JK Rowling writes in a kiddish sort of way, i'm not saying that it's bad, it's so much easier to understand and follow the entire plot and story unlike LOTR. btw guys...what are your thoughts on Harry Potter and the Half-Blood Prince, tat is, if you've read it. I thought it was pretty good. Rushed ending though, but i did like how it ended!", 
   {}, 
   147906, 
   null, 
   1121817960.0
  ], 
  [
   148648, 
   null, 
   "Desaix", 
   "Please use a \"spoiler alert\" before you start talking about HP's new book Shire,I now know the ending is a happy one(hate happy endings)\n \n Thanks. ;)", 
   {}, 
   148612, 
   null, 
   1121823240.0
  ], 
  [
   148925, 
   null, 
   "The Shire", 
   "sowie... emoticon_rolleyes and btw...the ending is NOT a happy one?????????...(spoiler)the most loving character died!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! how is that a happy ending????????????????????????????? emoticon_cry", 
   {}, 
   148648, 
   null, 
   1121900580.0
  ], 
  [
   148930, 
   null, 
   "Desaix", 
   "sowie... emoticon_rolleyes and btw...the ending is NOT a happy one?????????...(spoiler)the most loving character died!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! how is that a happy ending????????????????????????????? emoticon_cry\n\n \n Hey thats a good idea keep telling me more about the ending.Yeh!!! emoticon_rolleyes \n \n Half way through,very disapointing and boring.When i'm going to hear some gorey details?Seriously this book wants to make go back and read Cordesman painful Iraq:Sanctions and Beyond.Its that bad.\n \n BTW calm down i'm only screwing around with you. ;)", 
   {}, 
   148925, 
   null, 
   1121900940.0
  ], 
  [
   149438, 
   null, 
   "The Shire", 
   "lol...thankx... emoticon_rolleyes ...i guess...so..you've finished the book? what would u rate it on a scale of 1-10...10 being the awsome? my would be like 7-8ish...!", 
   {}, 
   148930, 
   null, 
   1122007140.0
  ], 
  [
   149492, 
   null, 
   "Matthew S", 
   "Movie 4 is only 120 days away friday november 18, 2005", 
   {}, 
   149438, 
   null, 
   1122032940.0
  ], 
  [
   149894, 
   null, 
   "The Shire", 
   "lol....i'm so excited about that movie! the teaser trailer looks pretty good and the still shots of certain scenes in the movie are cool too! you can check them out at < www.veritaserum.com <...btw...Daniel Radcliffe looks so cute/hot in the pictures! emoticon_rolleyes", 
   {}, 
   149492, 
   null, 
   1122144000.0
  ], 
  [
   150568, 
   null, 
   "Desaix", 
   "Nope afraid i didn't want to know that thanks. :p The movies have been a bit average so far,especially 1 and 3.\n \n I'd give the book 3 out of 10.", 
   {}, 
   149894, 
   null, 
   1122333540.0
  ], 
  [
   150600, 
   null, 
   "The Shire", 
   "all of the books? or a book in general? i thought that the books were ok...they weren't that well written...no offence to JK Rowling, but her writting style doesn't flow well...and the boring parts drag while the interesting parts are rushed! I HATE THAT! the 1-2 movie were awful!...horrible acting! the 3rd movie had better acting though i hated the director and the script was horribly written! i hope the 4th movie will be better than the last few...i have high expections for it! :p", 
   {}, 
   150568, 
   null, 
   1122341580.0
  ], 
  [
   151734, 
   null, 
   "Master_Shake", 
   "That's evil to make me choose between my children like that :) . I couldn't pick really.\n \n @The Shire- I have to say that I completely disagree with your assessment of the HP books and films. I have read up through the GoF now and I have a hard time ever putting any of them down. Personally, I never found anything boring. I think both the books and the films get better every time. I think the scripts have done a better job of translating from book to film than almost any other I have seen. As far as the acting goes, I don't think Maggie Smith, Alan Rickman, or Richard Harris have ever given a bad performance in their life, and I think the kids do a marvelous job.", 
   {}, 
   150600, 
   null, 
   1122670980.0
  ], 
  [
   151878, 
   null, 
   "The Shire", 
   "That's evil to make me choose between my children like that :) . I couldn't pick really.\n \n @The Shire- I have to say that I completely disagree with your assessment of the HP books and films. I have read up through the GoF now and I have a hard time ever putting any of them down. Personally, I never found anything boring. I think both the books and the films get better every time. I think the scripts have done a better job of translating from book to fime than almost any other I have seen. As far as the acting goes, I don't think Maggie Smith, Alan Rickman, or Richard Harris have ever given a bad performance in their life, and I think the kids do a marvelous job.\n\n ok...have u seen the 1st and 2nd harry potter movies?...the main characters (harry, ron, hermoine, neville, etc.) didn't have any sort of expression at all!...like the chamber of secret scene in movie 2, harry was not like even nervous or anything. The adults were awsome actors though.", 
   {}, 
   151734, 
   null, 
   1122753180.0
  ], 
  [
   154918, 
   null, 
   "tno7", 
   "LOTR is the standard by which all 'mythical fantasy' tales are judged, at least, here in Ohio. As an author myself, I can only be sceptical when I'm told that my story is better. I hear a lot of talk about LOTR, however, I think 'The Hobbit'  is the story that should be used! It, in my opinion, is better than LOTR!\n As for 'Harry Potter', I can say good things and bad things. The problem with that is: The story is not finished! By speculating, I might add that Neville Longbottom might prove to be Tom Riddle's bane! Ahh, but who knows at this point? I think that every story adds just enough information to make you realize that two things are happening: 1. JK is improving her skills, and, 2. this is a landmark story worthy of all the praise it might get!\n Although, as I have indicated, it is unfair to judge at this point, The Hobbit  remains my favorite story!", 
   {
    "post_info": {
     "post_title": "How Can You Judge An Unfinished Work?"
    }
   }, 
   151878, 
   null, 
   1123999860.0
  ], 
  [
   243393, 
   null, 
   "its_just_me", 
   "emoticon_xangel ok guys...I know you've probably seen enough polls similiar to this one...but...I just thought it would be cool to do another one... ...lol...thanks for your cooperation!!! So...give me your opinions towards LOTR and HP...make sure to talk both about the books and movies. Please do not use colourful languages (swear words). I want a clean debate!!!...thanks again!!! \n \n my opinion: LOTR all the way!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n reasons: better acting, awsome plot, beautiful story, very meaningful, original, and cuter actors...lol emoticon_rolleyes\n\n \n Personnally i think both movies are pretty rubbish, LOTR made me fall asleep and is way to long for a film and Harry Potter was better as a book.", 
   {}, 
   146452, 
   null, 
   1166134800.0
  ], 
  [
   243411, 
   null, 
   "Phunting", 
   "\n Legolas, Prince of Mirkwood vs. Ron Weasley\n \n Ron: Heeeey, you're not like the elves where I come from!\n \n Legolas: And where's that?\n \n Ron: England\n \n Legolas: Well duh, those elves suck, and they're not nearly as pretty as me! Anyway.... *shoots Ron with arrow*\n \n Ron: Damn, J.K. Rowling, I'll bloody get your for making me a poor idiot if it's the last thing I-*dies*.\nHmmm\n \n 1) Who the bloody hell is \"Ron Weasley\"?\n \n 2)We have elves?\n \n 3)I grew up with LoTR, and it's a damn site better than that JK gobshite. If you'll pardon my 'colourful languages'...", 
   {}, 
   147845, 
   null, 
   1166140260.0
  ], 
  [
   243420, 
   null, 
   "Judeau", 
   "Hmmm\n \n 1) Who the bloody hell is \"Ron Weasley\"?\n \n 2)We have elves?\n \n 3)I grew up with LoTR, and it's a damn site better than that JK gobshite. If you'll pardon my 'colourful languages'...\n\n \n Pardoned. I agree with you there. I am an LoTR all the way.", 
   {}, 
   243411, 
   null, 
   1166143740.0
  ], 
  [
   243474, 
   null, 
   "Matthew S", 
   "Personnally i think both movies are pretty rubbish, LOTR made me fall asleep and is way to long for a film and Harry Potter was better as a book.\n\n \n Not only that but the movies use the characters and the situations but the majority of LOTR movies, the 3rd being the worst, was nothing JRR Tolkien wrote. It was loosly based upon the books.", 
   {}, 
   243393, 
   null, 
   1166184660.0
  ], 
  [
   243478, 
   null, 
   "its_just_me", 
   "Not only that but the movies use the characters and the situations but the majority of LOTR movies, the 3rd being the worst, was nothing JRR Tolkien wrote. It was loosly based upon the books.\n\n \n emoticon_xgood \n Exactly, i totally agree. The books are a great read but neither of these films should have been made and it's really sad that they are releasing a movie for every book, it just gets worse and worse. the actors are XXXX too and have let all the fame go to their heads. It's all about myths, legends and witches and wizards, not my thing.", 
   {}, 
   243474, 
   null, 
   1166195280.0
  ], 
  [
   243757, 
   null, 
   "JPSartre12", 
   "Being a big fan of cinematography, there's no question that the LOTR movies were far superior to HP. The beautiful New Zealand landscape makes me want to pay the island a visit. emoticon_xgood", 
   {
    "post_info": {
     "post_title": "LOTR's Cinematography Wins"
    }
   }, 
   243478, 
   null, 
   1166320080.0
  ], 
  [
   243781, 
   null, 
   "ShadowPikachu", 
   " It's all about myths, legends and witches and wizards, not my thing.\n\n \n Sorry to tell you this, but that's what the books are about as well and you just said you liked them.\n \n On topic, I like the Lord of the Rings much more than Harry Potter (both the books and the movies).", 
   {}, 
   243478, 
   null, 
   1166327040.0
  ], 
  [
   249332, 
   null, 
   "lady x", 
   "lord of the rings alll the way.\n \n harry potter is just about some kid who has a death wish. he goes after trouble.\n \n LORD OF THE RINGS RULE", 
   {
    "post_info": {
     "post_title": "lady x"
    }
   }, 
   151878, 
   null, 
   1170431940.0
  ], 
  [
   249379, 
   null, 
   "Master_Shake", 
   "Hmmm\n \n 1) Who the bloody hell is \"Ron Weasley\"?\n \n 2)We have elves?\n \n 3)I grew up with LoTR, and it's a damn site better than that JK gobshite. If you'll pardon my 'colourful languages'...\n\n If you don't know who Ron Weasley is, how can you possibly make any kind of pronouncement about Harry Potter?\n \n (By the way, I'm not trudging this up, ladyx did :) )", 
   {}, 
   243411, 
   null, 
   1170453420.0
  ], 
  [
   250235, 
   null, 
   "GazzaElliott", 
   "Not only that but the movies use the characters and the situations but the majority of LOTR movies, the 3rd being the worst, was nothing JRR Tolkien wrote. It was loosly based upon the books.\n\n \n I'll go with that. The first two were OK, the third cut and changed too much. In terms of the books, I'm much more of a LotR fan, though Harry Potter actually made a decent impression (which kinda suprised me)", 
   {}, 
   249379, 
   null, 
   1170897660.0
  ], 
  [
   255042, 
   null, 
   "bloodyheart", 
   "i like them both.\n \n i do however think that lotr makes me think more than harry potter, which i watch purely for entertainment/fun value.", 
   {}, 
   250235, 
   null, 
   1174438020.0
  ], 
  [
   319967, 
   null, 
   "EchoR1", 
   "first off, lets do the books:\n \n personally i've read all of the harry potter books already and i honestly enjoyed them very much. i'm still reading lord of the rings: the fellowship of the ring after a year of having it. i just can't get into it, i think its because of all the overwhelming detail involved in the books themselves. i love detail, dont get me wrong, but it constantly throws me off beat of the story. there aren't as many details in harry potter as there is in the lord of the rings, but harry potter stays on a certain path that involves detail and plot; lord of the rings puts in way to much detail and hids the plot-after-plot focus.\n \n now onto the movies:\n \n the lord of the rings movies have tons more detail and better visual graphics in both the creatures and places then harry potter. most of the places in lord of the rings were not only built but scaled down digitally and using smaller models to create the epic visual of it. in harry potter, the places were built as an actual set or they used places that were already built so it doesn't have that 'ohhh ahhh' feel to it. not to mention that with lord of the rings, it keeps very well to the books (for the little i've read) but with harry potter, it started out that way but then ended up leaving out so much in movie five and four that it was dissapointing.\n \n characters and cast:\n \n for both movies i think they found the best people to play each roll, i honestly can't put any other person in their places so for this part: i love characters in both.\n \n emoticon_xgood", 
   {
    "post_info": {
     "post_title": "Ok here it goes"
    }
   }, 
   146452, 
   null, 
   1218490920.0
  ], 
  [
   322085, 
   null, 
   "applemacin", 
   "Have read the books and watched the movie adaptations. LOTR showed more depth and maturity. But I like HP's last 2 books.", 
   {}, 
   146452, 
   null, 
   1220258760.0
  ], 
  [
   323298, 
   null, 
   "Ryuuichi", 
   "LOTR owns Harry Potter. Honestly after HBP HP was trash emoticon_angry LOTR howver remained emoticon_xangel", 
   {}, 
   322085, 
   null, 
   1221092940.0
  ], 
  [
   330564, 
   null, 
   "jazyjason", 
   "The sheer depth and detail of Tolkiens work is far superior to Rowling. It took JRR years to write and literally create another world. I always get goosebumps when I read Return Of The King because I love the realm of Gondor so much. When I saw Minas Tirith in the third film I couldnt believe it!\n \n The battles were captured very well. Especially the seige of gondor and the battle of the pellenor fields. I was silently cheierng the whole time when the men of the west were fighting against mordor. As for HP well its got good and bad qualities but is in now way even close to ever being good as or surpassing lotr.\n \n And just to say I thought Vigo when he played Aragorn was hot!!!! emoticon_emb", 
   {}, 
   323298, 
   null, 
   1225456620.0
  ], 
  [
   371166, 
   null, 
   "badeth", 
   "Still a Harry potter fan, but both authors did a hit!", 
   {}, 
   151878, 
   null, 
   1253712180.0
  ], 
  [
   374600, 
   null, 
   "saffroncameller", 
   "I like them both. but lord of the rings the first one I like.emoticon_xgood..\n \n ________________\n please contact me\n Daniel@sycodas.am\n Danny@sycodas.co.ee\n Darcy@sycodas.gr\n Darian@sycodas.hu\n Darrell@sycodas.ru emoticon_xgoodemoticon_xgood", 
   {}, 
   323298, 
   null, 
   1255871280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Lord of the Rings vs. Harry Potter!!!", 
  "url": "http://www.4forums.com/political/entertainment-debates/5934-lord-rings-vs-harry-potter.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 5934, 
  "discussion_files": [
   [
    "13618.html", 
    "http://www.4forums.com/political/entertainment-debates/5934-lord-rings-vs-harry-potter-print.html"
   ], 
   [
    "13619.html", 
    "http://www.4forums.com/political/entertainment-debates/5934-lord-rings-vs-harry-potter-3-print.html"
   ], 
   [
    "13620.html", 
    "http://www.4forums.com/political/entertainment-debates/5934-lord-rings-vs-harry-potter-2-print.html"
   ]
  ], 
  "identifier": 5934
 }
]