[
 [
  [
   146929, 
   null, 
   "biccat", 
   "BBC edits out use of the word \"Terrorist\" in their newscasts.\n \n I find this more than mildly amusing.", 
   {
    "post_info": {
     "post_title": "&quot;terrorist&quot; carries &quot;value judgement&quot;"
    }
   }, 
   null, 
   null, 
   1121266440.0
  ], 
  [
   146961, 
   null, 
   "deathlord52", 
   "More pansification. 'understanding' of what? Why Islamist sheet-heads keep killing innocent people? \n \n The reason is clear: they are an embodiment of evil masquerading under the guise of a religion. These scum deserve nothing less than complete annihilation. They are a disservice to true Muslims.", 
   {}, 
   146929, 
   null, 
   1121271780.0
  ], 
  [
   146988, 
   null, 
   "Ghost", 
   "Yeah, I heard about this. Just makes you wanna shake your head in disbelief. But oh well, I can understand why they can't use certain words, ya know? I mean, there are a lot of terms I could use to describe 'people' (and I use that term very, verry loosely) who target and kill innocent civilians, but they're not really suitable for print, either. emoticon_cool \n \n And by the way, the terrorists themselves refer to them as terrorists, and they're proud of it. 'Strike terror into the hearts of infidels.'", 
   {}, 
   146961, 
   null, 
   1121279580.0
  ], 
  [
   146991, 
   null, 
   "wilted_laughter", 
   "Thats a bit pointless on the part of the bbc alright. \n \n \nMore pansification. 'understanding' of what? Why Islamist sheet-heads keep killing innocent people? \n\n \n Thats exactly what we need to understand. Otherwise they will keep coming.\n \n \n\n they are an embodiment of evil masquerading under the guise of a religion. \n\n \n I agree with these words; but not how you mean them.\n \n \n\n These scum deserve nothing less than complete annihilation.\n\n \n I prefer justice to revenge.\n \n \n\n They are a disservice to true Muslims.\n\n \n Indeed.", 
   {}, 
   146961, 
   null, 
   1121279820.0
  ], 
  [
   147001, 
   null, 
   "georged", 
   "Seems pretty simple; the word terrorist with various adjectives and verbs attached has replaced 'godless communists' as a political platform for keeping the sheep milling around in an endless circle for government purposes. Governments certainly aren't going to point out root causes of why this is happening and the public sheep are apathetic with attention spans so brief cause details are just a PITA which would sink media ratings.", 
   {}, 
   146991, 
   null, 
   1121282640.0
  ], 
  [
   147004, 
   null, 
   "deathlord52", 
   "I prefer justice to revenge.\n\n Terminating murderers is justice. Just like a rabid animal needs put down, so do these scum.", 
   {}, 
   146991, 
   null, 
   1121283540.0
  ], 
  [
   147040, 
   null, 
   "daewoo", 
   "This is no more or less rediculous than the US media stopping use fo the term \"suicide bombing\" in favor of \"homocide bombing\" att he urging of the israelis and the bush administration.", 
   {}, 
   147004, 
   null, 
   1121292540.0
  ], 
  [
   147110, 
   null, 
   "Diogenes99", 
   "This is no more or less rediculous than the US media stopping use fo the term \"suicide bombing\" in favor of \"homocide bombing\" att he urging of the israelis and the bush administration.\nDisagreed. The purpose of the bombing is homicide, and the perpetrator is merely negligible collateral damage. It's a more accurate term than \"suicide bomber\" since the perpetrator correctly values his own life at zero.", 
   {}, 
   147040, 
   null, 
   1121312820.0
  ], 
  [
   147113, 
   null, 
   "Symbiote", 
   "Since the term exclusively refers to those who kill themselves in the bombing, the term suicide bomber is appropriate. It is rediculous to term bombings where the bomber kills themselves \"homicide bombings\" and bombings detonated remotely simply \"bombings\". In both the intent is to kill people, or destroy property, or create panic, or whatever, in only one does the bomber die.\n \n Back to the original topic, leaving the word out may be for the best. It has been so perverted that it no longer has any meaning. Anyone in Guantanamo Bay is a \"terrorist\", Saddam Hussein is a \"terrorist\", insurgents shooting at American troops in Iraq are \"terrorists\" it's just a stupid buzz-word now used to generate an emotive response by linking all the enemies of the US admin to 9/11, it's used the way the Communists used Capitalist or Nazis used Jew, to demonise, with no regard for whether the term was an accurate descriptor or not.", 
   {}, 
   147110, 
   null, 
   1121313600.0
  ], 
  [
   147116, 
   null, 
   "daewoo", 
   "Disagreed. The purpose of the bombing is homicide, and the perpetrator is merely negligible collateral damage. It's a more accurate term than \"suicide bomber\" since the perpetrator correctly values his own life at zero.\n\n \n \n So, Us airmen who drop bombs are \"homicide bombers\"? \n \n They used the term \"suicide bombing\" to refer to a specific type of activity, namely an activity where the bomber blows themselves up along with everybody else. ALL bombings are \"homicide bombings\". It does not refer to any specific activity, jsut the very general activity of bombing with the intent to kill people.", 
   {}, 
   147110, 
   null, 
   1121313900.0
  ], 
  [
   147117, 
   null, 
   "daewoo", 
   "\n Back to the original topic, leaving the word out may be for the best. It has been so perverted that it no longer has any meaning. Anyone in Guantanamo Bay is a \"terrorist\", Saddam Hussein is a \"terrorist\", insurgents shooting at American troops in Iraq are \"terrorists\" it's just a stupid buzz-word now used to generate an emotive response by linking all the enemies of the US admin to 9/11, it's used the way the Communists used Capitalist or Nazis used Jew, to demonise, with no regard for whether the term was an accurate descriptor or not.\n\n \n Of course it is an accurate desciptor. The description just changes on a daily basis.", 
   {}, 
   147113, 
   null, 
   1121314080.0
  ], 
  [
   147207, 
   null, 
   "Diogenes99", 
   "Anyone in Guantanamo Bay is a \"terrorist\", Saddam Hussein is a \"terrorist\", insurgents shooting at American troops in Iraq are \"terrorists\" it's just a stupid buzz-word now used to generate an emotive response by linking all the enemies of the US admin to 9/11, it's used the way the Communists used Capitalist or Nazis used Jew, to demonise, with no regard for whether the term was an accurate descriptor or not.\nA terrorist is someone who kills innocent people at random to achieve a political goal. At Club Gitmo, the term is accurately applied to those inside the wire, and to Saddam. It has been inaccurately applied to US servicemen by those (all on the Left) who are too morally challenged to recognize that terrorism is an unacceptable tactic, and who wish to conceal their disability behind a cloud of smoke and mirrors.", 
   {}, 
   147113, 
   null, 
   1121367960.0
  ], 
  [
   147218, 
   null, 
   "sinjin", 
   "A terrorist is someone who kills innocent people at random to achieve a political goal. At Club Gitmo, the term is accurately applied to those inside the wire, and to Saddam. It has been inaccurately applied to US servicemen by those (all on the Left) who are too morally challenged to recognize that terrorism is an unacceptable tactic, and who wish to conceal their disability behind a cloud of smoke and mirrors.\n\n \n Terrorism an unacceptable tactic. That's pretty funny. Your enemy will always deem any resistance \"unacceptable\". When your enemy has overwhelming strength and control you have few options. Is there any real difference between targeting civilians directly and acknowledging the likelihood of civilian casualties? Hardly matters to the casualties themselves.\n Of course the U.S. has done both just like many others.", 
   {}, 
   147207, 
   null, 
   1121368920.0
  ], 
  [
   147223, 
   null, 
   "Ghost", 
   "This is no more or less rediculous than the US media stopping use fo the term \"suicide bombing\" in favor of \"homocide bombing\" att he urging of the israelis and the bush administration.\n\n \n Um, the US media still uses the term 'suicide bomber.' Quite often, as a matter of fact.\n \n \nSeems pretty simple; the word terrorist with various adjectives and verbs attached has replaced 'godless communists' as a political platform for keeping the sheep milling around in an endless circle for government purposes. Governments certainly aren't going to point out root causes of why this is happening and the public sheep are apathetic with attention spans so brief cause details are just a PITA which would sink media ratings.\n\n \n George, your posts always bring a smile to my face. Everybody is stupid except for you, right? If somebody thinks something you don't, regardless of how much they can back it up, they're 'public sheep.' Sometimes I just read your posts, shake my head, and smile. :p \n \n \nA terrorist is someone who kills innocent people at random to achieve a political goal.\n\n \n Close, but not quite on the mark. I do agree with your post, it's just that the killing doesn't have to be random, and actually they don't even need to kill. They can take hostages or kidnap. But it is for a political. How would you guys feel about adding 'for a political or religious' goal? It just seems to me that there is more and more a split between political terrorism and religious terrorism.", 
   {}, 
   147040, 
   null, 
   1121369640.0
  ], 
  [
   147224, 
   null, 
   "daewoo", 
   "A terrorist is someone who kills innocent people at random to achieve a political goal. At Club Gitmo, the term is accurately applied to those inside the wire, and to Saddam. It has been inaccurately applied to US servicemen by those (all on the Left) who are too morally challenged to recognize that terrorism is an unacceptable tactic, and who wish to conceal their disability behind a cloud of smoke and mirrors.\n\n \n This cannot be right. If your definition is correct, there have been no terrorist attacks int he last century. Nobody has been killing people randomly. Even the attacks of 9/11 were not random, they were targeting Americans. Saddm never killed people randomly (the ascertation that Saddam may hve been a \"terrorist\" is just moronic).\n \n Were the US colonists fighting the british terrorists? After all they killed people who were not in the military, and did it fairly frequently. Were the afghans fighting the russians, usingthe asme tactics that are being used now, terrorists, or did they just become terrorists when they quite attacking our enemies and started attacking us?\n \n \n Terrorism not an acceptable tactic? tEh term you are looking for is \"asymetrical warfare\" and it is how a small force fights, and (if history is any indicator) eventually beats a bigger force.", 
   {}, 
   147207, 
   null, 
   1121369700.0
  ], 
  [
   147228, 
   null, 
   "georged", 
   "\n George, your posts always bring a smile to my face. Everybody is stupid except for you, right? If somebody thinks something you don't, regardless of how much they can back it up, they're 'public sheep.' Sometimes I just read your posts, shake my head, and smile. :p \n \n\n \n Not all are stupid, but many follow paths devised by politicians and other self-interest parties to invoke emotion. Any ideology can be validated by those who emotionally support it.", 
   {}, 
   147223, 
   null, 
   1121370480.0
  ], 
  [
   147252, 
   null, 
   "marc9000", 
   "Not all are stupid, but many follow paths devised by politicians and other self-interest parties to invoke emotion. Any ideology can be validated by those who emotionally support it.\n\n \n And others follow paths devised by anti U.S. interests that invoke emotion. It really can go both ways.", 
   {}, 
   147228, 
   null, 
   1121377680.0
  ], 
  [
   147279, 
   null, 
   "Diogenes99", 
   "Terrorism an unacceptable tactic. That's pretty funny. Your enemy will always deem any resistance \"unacceptable\". When your enemy has overwhelming strength and control you have few options. Is there any real difference between targeting civilians directly and acknowledging the likelihood of civilian casualties? Hardly matters to the casualties themselves.\n Of course the U.S. has done both just like many others.\nSpoken like a true modern Democrat. As a matter of fact, there is a huge difference between the deliberate targeting of civilians and collateral damage - but, like I said, the morally challenged among us are too blinded by their disability to see it.\n \n \nThis cannot be right. If your definition is correct, there have been no terrorist attacks int he last century. Nobody has been killing people randomly. Even the attacks of 9/11 were not random, they were targeting Americans. Saddm never killed people randomly (the ascertation that Saddam may hve been a \"terrorist\" is just moronic).\nDisagreed. The terrorists of 9/11 didn't care who was in the WTC, why they were there, or what their citizenship was. The terrorists who blew up a bunch of Iraqi children last week didn't care that the kids had done them no harm, and didn't care what the parents might or might have done to them. The terrorists who blew up the London tube and bus didn't care who was in the vehicles, where they were from, or what their politics were. Saddam, like his Nazi forbears and his Syrian contemporary, destroyed entire villages in order to cow the populace.\n \n The whole point of terrorism is to win psychologically, and it certainly seems to be working among the morally damaged of the world. But don't worry ... the rest of us will protect you in spite of yourself.", 
   {}, 
   147218, 
   null, 
   1121382960.0
  ], 
  [
   147287, 
   null, 
   "georged", 
   "But don't worry ... the rest of us will protect you in spite of yourself.\n\n \n At any cost? That level of thought process, or lack of, has toppled most empires. When do you start lining up for execution those who disagree with your ideology, illegal immigrants and the wrong ethnic groups?", 
   {}, 
   147279, 
   null, 
   1121385420.0
  ], 
  [
   147290, 
   null, 
   "Symbiote", 
   "A terrorist is someone who kills innocent people at random to achieve a political goal. At Club Gitmo, the term is accurately applied to those inside the wire, and to Saddam.\n\n \n As I said, a meaningless buzz word. You provide a definition and then assert that \"those inside the wire\" at gitmo (whether they meet the definition or not) are \"terrorists\".\n \n Here's a better definition for you: \"Any declared enemy of the Bush regime\".\n \n \nSaddam, like his Nazi forbears and his Syrian contemporary, destroyed entire villages in order to cow the populace.\n\n \n Like Fallujah?", 
   {}, 
   147287, 
   null, 
   1121385900.0
  ], 
  [
   147293, 
   null, 
   "sinjin", 
   "Spoken like a true modern Democrat. As a matter of fact, there is a huge difference between the deliberate targeting of civilians and collateral damage - but, like I said, the morally challenged among us are too blinded by their disability to see it.\n\n Gee, I never expected that response. I helps to designate innocent families as collateral when trying to remain morally superior I suppose. How many collaterals before it would have been a morally reprehensible act? How many of your family members would you be willing to sacrifice to remove the thugs from your town? I'm an independent btw. Labeling does make things so much clearer though, doesn't it?\n \nThe whole point of terrorism is to win psychologically, and it certainly seems to be working among the morally damaged of the world. But don't worry ... the rest of us will protect you in spite of yourself. \n\n How will you personally protect me? You're full of hot air.", 
   {}, 
   147279, 
   null, 
   1121386380.0
  ], 
  [
   147301, 
   null, 
   "biccat", 
   "Terrorism not an acceptable tactic? tEh term you are looking for is \"asymetrical warfare\" and it is how a small force fights, and (if history is any indicator) eventually beats a bigger force.\n\n So you're saying flying an airplane into the side of a civilian building is an acceptable tactic?\n \n Why can't we bomb hospitals then?", 
   {}, 
   147224, 
   null, 
   1121387940.0
  ], 
  [
   147315, 
   null, 
   "daewoo", 
   "Gee, I never expected that response. I helps to designate innocent families as collateral when trying to remain morally superior I suppose. How many collaterals before it would have been a morally reprehensible act?\n\n \n Obviously an unlimited amount. Apparently the few thousand killed by \"terrorists\" do not comaper the the tens or hundreds of thousands killed by us. I can only assume that the ones we kill are less dead than the others???\n \n \nHow many of your family members would you be willing to sacrifice to remove the thugs from your town? I'm an independent btw. Labeling does make things so much clearer though, doesn't it?\n \n\n \n And I am a hard core conservative, as well as a registered republican for all of my adult life. Until bush and his happy band of neo fascists came along, I cannot recall ever voting for anybody but a republican, though I may have voted liberatarian in a school board election in 2000. I don't remember for sure.", 
   {}, 
   147293, 
   null, 
   1121389860.0
  ], 
  [
   147320, 
   null, 
   "daewoo", 
   "So you're saying flying an airplane into the side of a civilian building is an acceptable tactic?\n \n Why can't we bomb hospitals then?\n\n \n that depends on the country, why the person ins flying the plane intot he buildiung (grievance) and who is likely to be int he building (mostly adults vs children).\n \n If, for instance, somebody decided to fly a plane into the WTC becuase yesterday the president announced that we would be cutting all aid to some country or the other, then no, it is not an accpetable tactic.\n \n If, on the other hand, we step back into the real world, where people flew planes intot he sides of our buildings because fo long standing grievances with US foreign policy, a policy that most people in this country do not agree with when they actually bother to pay attention, then YES, it is an acceptable tactic.\n \n America is a democracy. We have had years and years and years of **** poor foreign policy, gunboat diplomacy, and trading \"humanitarian aid\" for concessions for US companies (generally exemption from minimum wage, child labor, safety, and environmental laws is the norm). we have supported tyrant like Hussein, totalitarians like the house of Saud, Lunatics like Pinochet and Noriega for years. The american public could have stepped up at any time during that and said NO. They did not. They continued to vote people into office that carreid out these same policies. \n \n With power comes responsibility. We vote, that is our power. Paying attention to what is going on int he world so we vote for the right people is the responsibility that comes with that power. Americans have failed in tehir responsibility.\n \n Unfortunatly in a democracy every voter bears some responsibility for those that are elected and the decisions they make. If we elect one lunatic president, I think that the responsibility we bear for his actions is minimal, so long as we vote him out of office the next time he is up. If we consistently vote people into office who behave badly and we fail to hold them responsible for their actions, then the blame for those acts falls squarely on the shoulders of the voting public.\n \n Those who hold the reigns of power have always been legitimate military targets. In the US, that is the American people. Ultimatly the longstandign policies of the United States are policies of the people of the United States. We have reinstituted them every time we go to the ballot box. Admittedly it may largely be due to the apathetic atitude of the American public, or it might simply be our greed (WHO CARES if the US supported governemtn of Saudi Arabia is bar none the most totalitarian the world has ever seen, as long as our gas is cheap). Regardless, for those in power apathy carries the same penalty as malice.", 
   {}, 
   147301, 
   null, 
   1121390820.0
  ], 
  [
   147375, 
   null, 
   "Tastyfish", 
   "Back to the point, I think it probably relates to the fact that it wasn't really known who did it at the time and 'terrorist' now would be interpreted as Islamic extremist (which it turned out to be in the end). \n \n However as there are other groups it could have been they went for bomber, wierdest thing I can remember is that in the morning they saying originally that the actual casulties were far lower than would have been expected and they wondered if they were actually accidental (or just incidental to the minor goal of shutting down the public transport).", 
   {}, 
   147320, 
   null, 
   1121399460.0
  ], 
  [
   147381, 
   null, 
   "biccat", 
   "If, on the other hand, we step back into the real world, where people flew planes intot he sides of our buildings because fo long standing grievances with US foreign policy, a policy that most people in this country do not agree with when they actually bother to pay attention, then YES, it is an acceptable tactic.\n\n Fair enough. So you would support me if I wanted to hijack a fuel truck, drive it into the center of Beijing, and detonate it, killing as many people as possible?\n \n Hypothetically speaking of course.", 
   {}, 
   147320, 
   null, 
   1121400780.0
  ], 
  [
   147382, 
   null, 
   "Diogenes99", 
   "When do you start lining up for execution those who disagree with your ideology, illegal immigrants and the wrong ethnic groups?\nWhenever they try to kill me, my family, or my neighbors.\n \n \nAs I said, a meaningless buzz word.\n\n \nGee, I never expected that response. I helps to designate innocent families as collateral when trying to remain morally superior I suppose.\nI've already explained why I don't expect you to understand the moral distinction.\n \n \nIf, on the other hand, we step back into the real world, where people flew planes intot he sides of our buildings because fo long standing grievances with US foreign policy, a policy that most people in this country do not agree with when they actually bother to pay attention, then YES, it is an acceptable tactic.\nIt is never an acceptable tactic to deliberately target civilians. Have you ever heard of the Geneva Conventions?\n \n \nBack to the point, I think it probably relates to the fact that it wasn't really known who did it at the time and 'terrorist' now would be interpreted as Islamic extremist (which it turned out to be in the end).\nThat is the case for now. In the past we have had the IRA in Britain and Timothy McVeigh in the US - and in the nineteenth century the anarchists created problems all over North America and Europe.\n \n \nHowever as there are other groups it could have been they went for bomber, wierdest thing I can remember is that in the morning they saying originally that the actual casulties were far lower than would have been expected and they wondered if they were actually accidental (or just incidental to the minor goal of shutting down the public transport).\nThe first plane was thought to possibly be an accident, but I very clearly remember the TV announcer saying when the second plane hit the other tower, \"This is no accident, folks!\"", 
   {}, 
   147287, 
   null, 
   1121401260.0
  ], 
  [
   147383, 
   null, 
   "Tastyfish", 
   "That is the case for now. In the past we have had the IRA in Britain and Timothy McVeigh in the US - and in the nineteenth century the anarchists created problems all over North America and Europe.\n \n\n However I strongly doubt the BBC is completely removing the word terrorist - just when it was dealing with this issue at the time.", 
   {}, 
   147382, 
   null, 
   1121401440.0
  ], 
  [
   147394, 
   null, 
   "daewoo", 
   "Fair enough. So you would support me if I wanted to hijack a fuel truck, drive it into the center of Beijing, and detonate it, killing as many people as possible?\n \n Hypothetically speaking of course.\n\n \n \n No.\n \n Regardless of your grievances with beijing in general, China is not a democratic nation. The people do not carry the same responsibility for their leadership that people in a democracy do. There are certian issues that might make your actions acceptable, if it was a case where the citizens of china were responsible for your grievances.\n \n Americans all seem real big on freedom and democarcy, but quickly become whiney babies when it comes to pay the price for democracy. It is kind of like writing a bad check. You write a bad check for $25, then your bank charges you $25 for the bad check, but they chgarge it twice since they will try to send the check thouhg twice. Plus you have to pay a $30 charge to whoever you wrote the check to, in addition to the face value of the check. Your $25 check ends up costing you $105. The price of freedom and self government is vigilance. We wrote a bad \"vigilance\" check, and the terrorists are hitting us with bad check fees.\n \n \nIt is never an acceptable tactic to deliberately target civilians. Have you ever heard of the Geneva Conventions?\n\n \n The geneva conventions only apply to nations. They do not apply to terrorists, freedom fighters, insurgents, guerillas, revolutionaries, or whatever else you want to call a small opposition force. \n \n You are missing the point. Since the power of government lies in the AMerican people,a dn we as a people have the right and ability to change it pretty much at whim, there is no such thing as an american of voting age who is a \"civilian\"", 
   {}, 
   147381, 
   null, 
   1121407380.0
  ], 
  [
   147403, 
   null, 
   "Ghost", 
   "No.\n \n Regardless of your grievances with beijing in general, China is not a democratic nation. The people do not carry the same responsibility for their leadership that people in a democracy do. There are certian issues that might make your actions acceptable, if it was a case where the citizens of china were responsible for your grievances.\n\n \n Well, I'm not feeling too hot about New Zealand lately. Hey wait, they're a democracy...I think I'll rig up a truck bomb or some such mischief and try to kill some people...and the more little kids I kill, the better!\n \n \nThe geneva conventions only apply to nations. They do not apply to terrorists, freedom fighters, insurgents, guerillas, revolutionaries, or whatever else you want to call a small opposition force.\n\n \n Then in that case, we're not bound by the Geneva Conventions when dealing with them, either. So really, anything we want to do at Club Gitmo is entirely legal...\n \n \nYou are missing the point. Since the power of government lies in the AMerican people,a dn we as a people have the right and ability to change it pretty much at whim, there is no such thing as an american of voting age who is a \"civilian\"\n\n \n What worries me about you, daewoo, is you're parroting EXACTLY what bin Laden said before the elections. I really never did expect to see the day where I would hear someone who should know better start DEFENDING the people that murdered 3000 innocent Americans in one morning. I normally try to avoid any sort of insulting comments about people I debate, but you really, truly disgust me.", 
   {}, 
   147394, 
   null, 
   1121414040.0
  ], 
  [
   147422, 
   null, 
   "biccat", 
   "No.\n \n Regardless of your grievances with beijing in general, China is not a democratic nation. The people do not carry the same responsibility for their leadership that people in a democracy do. There are certian issues that might make your actions acceptable, if it was a case where the citizens of china were responsible for your grievances.\n\n I think it's safe to say that we don't know the specific grievances that provoked the terrorist attacks on the WTC. It could have been many things:\n -perceived shortage of aid to Muslim nations\n -support of Isreal\n -backing Saudi Arabia\n -perceived moral & societal degredation\n -our lack of Islamic law\n -we're not followers of Mohammad\n \n If I did detonate a large bomb in downtown Beijing, you wouldn't know my motivations. People would speculate about them. Maybe I'm upset with how Chinese society has progressed over the last 50 years? That definately has something to do with the people of China. Or the fact that they've adopted a communist government, don't tell me that the people of China had nothing to do with that.\n \n You're rationalizing the actions of the 9/11 terrorists because you don't like what we have done in response. Ex post facto justification isn't a good logical argument. Anti-American sentiment probably has a lot to do with it as well.\n \n I heard an interesting quote the other day...\"What would happen if the country (US) was united behind the war on terror?\"", 
   {}, 
   147394, 
   null, 
   1121436060.0
  ], 
  [
   147437, 
   null, 
   "daewoo", 
   "Well, I'm not feeling too hot about New Zealand lately. Hey wait, they're a democracy...I think I'll rig up a truck bomb or some such mischief and try to kill some people...and the more little kids I kill, the better!\n\n \n There is a hell of a difference between \"not feeling too hot\" about New Zealand and responding to a long history of bad behavior by New Zealand, bad behavior that could have been stopped at any time by the people of New Zealand, and you know it. If you can't refute my take on things, stay silent. childish temper tantrums may work on the playground, they do not work here.\n \n \n \n \nThen in that case, we're not bound by the Geneva Conventions when dealing with them, either. So really, anything we want to do at Club Gitmo is entirely legal...\n \n\n \n Yes, we are. We are always bound by the Geneva conventions. We are bound by the geneva conventions because \n \n 1. we are a nation\n 2. We ratifed them, essentially agreeing to be bound by them \n \n \n \nWhat worries me about you, daewoo, is you're parroting EXACTLY what bin Laden said before the elections. I really never did expect to see the day where I would hear someone who should know better start DEFENDING the people that murdered 3000 innocent Americans in one morning. I normally try to avoid any sort of insulting comments about people I debate, but you really, truly disgust me.\n\n \n \n Bad news. If that was the case (which it is not), Bin Laden would have been right.", 
   {}, 
   147403, 
   null, 
   1121439900.0
  ], 
  [
   147442, 
   null, 
   "daewoo", 
   "I think it's safe to say that we don't know the specific grievances that provoked the terrorist attacks on the WTC. It could have been many things:\n -perceived shortage of aid to Muslim nations\n -support of Isreal\n -backing Saudi Arabia\n -perceived moral & societal degredation\n -our lack of Islamic law\n -we're not followers of Mohammad\n \n If I did detonate a large bomb in downtown Beijing, you wouldn't know my motivations. People would speculate about them. Maybe I'm upset with how Chinese society has progressed over the last 50 years? That definately has something to do with the people of China. Or the fact that they've adopted a communist government, don't tell me that the people of China had nothing to do with that.\n \n You're rationalizing the actions of the 9/11 terrorists because you don't like what we have done in response. Ex post facto justification isn't a good logical argument. Anti-American sentiment probably has a lot to do with it as well.\n \n I heard an interesting quote the other day...\"What would happen if the country (US) was united behind the war on terror?\"\n\n \n \n This is retarded. Sorry. \n \n How many speeches and statements from Bin Laden and others in his movement have discussed the motives behiund 9/11? \n \n 9/11 occured becuse of American meddling int he ME. It occured because we support totalitarians and despots like saddam and the sauds. Bin laden claims he originally thought of hitting US office buildings as he was surveying destroyed building in lebanon in 1982. \n \n Through all the public statements, you keep seeing the same things over and over, Us propping up corrupt governments, US inciting violence in the ME. \n \n Tehre are no questions as to \"why\". Bin Laden and others in his organization have answered those several times. Teh only question that is left is \"are their reasons valid\". I would suggest you take a look at recent (last 100 years) history int he ME and our involvement there.", 
   {}, 
   147422, 
   null, 
   1121440740.0
  ], 
  [
   147453, 
   null, 
   "georged", 
   "\n Someday you will grow up, move out of your parents house, and learn that there are consequences to your actions. I know that \"personal responsibility\" is a dirty word for most of America, but in the real world, we bear personal responsibility for our actions. Sorry, I know it is scary to think that you cannot just act without consequences and your parents cannot always save you.\n\n \n The trend is against that, personal responsibility and individual thought processes being in serious decline. We're now losing our leadership in research, design and development due to our youth avoiding the scholastic challenge of engineering and hard sciences. Europe and Asia have, for the first time, surpassed us in both undergrad and graduate degrees in those fields (we still churn out the most lawyers). Our trend is to services, medical, general management, etc., professions that feed on government and consumer spending. Much of our youth is staying closer to home because prior generations have accumulated wealth and security in varying degrees, making it far more desirable to remain in that security blanket rather than making it on their own. \n \n Throw in a deceptive government promising and failing to protect a populace on the basis of both physical and economical security while blaming our problems on anyone and everyone else for some real youth character building. I read many posts by young people who like blaming someone else for our problems with little or no knowledge of how those problems developed but blindly following whatever emotion, usually the newly defined patriotism, requires the least amount of effort. Blaming someone else for our problems is seemingly becoming our national pastime.", 
   {}, 
   147437, 
   null, 
   1121443020.0
  ], 
  [
   147476, 
   null, 
   "biccat", 
   "Blaming someone else for our problems is seemingly becoming our national pastime.\n\n My goodness...you're right!\n \n How could we possibly blame the people that flew airplanes into the World Trade Center for flying airplanes into the World Trade Center. I've been so blind!", 
   {}, 
   147453, 
   null, 
   1121450700.0
  ], 
  [
   147478, 
   null, 
   "georged", 
   "My goodness...you're right!\n \n How could we possibly blame the people that flew airplanes into the World Trade Center for flying airplanes into the World Trade Center. I've been so blind!\n\n \n That's because you ignore why they took that action.", 
   {}, 
   147476, 
   null, 
   1121451120.0
  ], 
  [
   147482, 
   null, 
   "daewoo", 
   "That's because you ignore why they took that action.\n\n \n you mena it wasn't just because they envied our wealth and freedom?", 
   {}, 
   147478, 
   null, 
   1121451840.0
  ], 
  [
   147485, 
   null, 
   "Diogenes99", 
   "However I strongly doubt the BBC is completely removing the word terrorist - just when it was dealing with this issue at the time.\nAgreed. I can't see the BBC referring to KKK militants as \"southern fighters\" - but it does demonstrate that they have a very selective (and agenda driven) morality that completely disqualifies them as an objective purveyor of news.\n \n \nRegardless of your grievances with beijing in general, China is not a democratic nation. The people do not carry the same responsibility for their leadership that people in a democracy do. There are certian issues that might make your actions acceptable, if it was a case where the citizens of china were responsible for your grievances.\nOh, WOW! So you're claiming that only citizens of a representative government are legitimate targets of terrorism?\n \n \nThe geneva conventions only apply to nations. They do not apply to terrorists, freedom fighters, insurgents, guerillas, revolutionaries, or whatever else you want to call a small opposition force.\nAgreed. Under the laws of war as specified by the Geneva Conventions, the animals who deliberately target civilians have no rights whatsoever.\n \n \nSince the power of government lies in the AMerican people,a dn we as a people have the right and ability to change it pretty much at whim, there is no such thing as an american of voting age who is a \"civilian\"\n<shaking head in disbelief< Don't us the word \"we\" when talking about the American people. You're definitely not one of us.\n \n \nI think it's safe to say that we don't know the specific grievances that provoked the terrorist attacks on the WTC.\nThat assumes that the attack of 9/11 was somehow a rational response directed against the offender, which is not necessarily the case. Mad dogs are not rational.", 
   {}, 
   147482, 
   null, 
   1121453280.0
  ], 
  [
   147495, 
   null, 
   "georged", 
   "\n That assumes that the attack of 9/11 was somehow a rational response directed against the offender, which is not necessarily the case. Mad dogs are not rational.\n\n \n Why was it not a rational response? Were we not offenders given the reasons presented for the attack? Is Bin Laden's statement 'Any nation that does not attack us will not be attacked' incorrect?. What is your definition of rationality, 'us or them' regardless of circumstances leading up to the attack?\n \n I'm not condoning the attack and feel Bin Laden should be brought to justice for that event. Someone attacks us, we strike back. I'm questioning your lack of understanding events which subsequently lead to the attack and your definition of rationality. \n \n Mad Dogs might be better applied to our unrelated (to 9/11) invasion and occupation of Iraq.", 
   {}, 
   147485, 
   null, 
   1121455020.0
  ], 
  [
   147499, 
   null, 
   "Ghost", 
   "If you can't refute my take on things, stay silent. childish temper tantrums may work on the playground, they do not work here.\n\n \n \nThis is retarded. Sorry.\n\n \n \n \nSomeday you will grow up, move out of your parents house, and learn that there are consequences to your actions. I know that \"personal responsibility\" is a dirty word for most of America, but in the real world, we bear personal responsibility for our actions. Sorry, I know it is scary to think that you cannot just act without consequences and your parents cannot always save you.\n\n \n \n I could respond to all this with a few :xcensored's and a couple of 'you's,' but the bad post button works just as well, plus it's much more civil.\n \n \nYes, we are. We are always bound by the Geneva conventions.\n\n \n When dealing with other nations, yes. When dealing with terrorists, no. The Geneva conventions only apply to wars between nations.", 
   {}, 
   147437, 
   null, 
   1121455980.0
  ], 
  [
   147500, 
   null, 
   "daewoo", 
   "Oh, WOW! So you're claiming that only citizens of a representative government are legitimate targets of terrorism?\n\n \n All squares are rectangles. Not all rectangles are squares.\n \n Why is it that people fall back on intentional misunderstanding when faced with the concept of responsibility for ones actions?\n \n \nAgreed. Under the laws of war as specified by the Geneva Conventions, the animals who deliberately target civilians have no rights whatsoever.\n\n \n Wrong. Under the geneva convention, everybody captured in an occupied country has rights. The geneva conventions does NOT apply to people that are captured who are NOT in a war zone.\n \n \n<shaking head in disbelief< Don't us the word \"we\" when talking about the American people. You're definitely not one of us.\n\n \n Sorry, I am. There are actually americans left who believe in their country and the principals is enshirnes, as opposed to just paying lip service.\n \n \nThat assumes that the attack of 9/11 was somehow a rational response directed against the offender, which is not necessarily the case. Mad dogs are not rational.\n\n \n As long as there are still folks who absolutly refuse to accept any form of responsibility for americas past actions, the attacks will continue. History has shown that we will eventually loose to the terrorists. Hopefully they will only kill those like yourself who have no sense of honor, morals or personal responsibility, then those of us who are left can rebuild america into a great naiton once again", 
   {}, 
   147485, 
   null, 
   1121456040.0
  ], 
  [
   147505, 
   null, 
   "daewoo", 
   "I could respond to all this with a few :xcensored's and a couple of 'you's,' but the bad post button works just as well, plus it's much more civil.\n\n \n Go for it. \n \n If you can't refute...throw a hissy fit. It works for my 2 yr old (though not as well as she would like). I keep seeing your posts get more and more desperate as your philosophy is systematically shredded. I have no problem with most of the younger set here. I even like most of them. If youa re going to play with the grown ups, tyhough, you have to learn to play like a grown up. IF we are going to debate, we can debate. If we are just going to throw hissy fits, there are forums out htere better suited.\n \n \nWhen dealing with other nations, yes. When dealing with terrorists, no. The Geneva conventions only apply to wars between nations.\n\n \n \n No, the geneva conventions apply to all armed conflicts that a nation involves itself in, civil wars included.", 
   {}, 
   147499, 
   null, 
   1121457060.0
  ], 
  [
   147507, 
   null, 
   "Ghost", 
   "Ah ha, daewoo, we're both wrong! There are some rules in the Geneva conventions which apply to all conflicts, regardless of the participants being signatories or independent states. Doesn't even have to be on a battlefield, it seems. Chief among them is execution of a prisoner or discrimination based on race, age, sex, religion, etc etc. So both we and our enemies are bound by them. Not the entirety of the Geneva conventions, mind you, just a few basic principles which apply to ALL conflicts.\n \n \nHopefully they will only kill those like yourself who have no sense of honor, morals or personal responsibility, then those of us who are left can rebuild america into a great naiton once again.\n\n \n That's too far, chief. You need to apologize to him.", 
   {}, 
   147500, 
   null, 
   1121457360.0
  ], 
  [
   147540, 
   null, 
   "daewoo", 
   "Ah ha, daewoo, we're both wrong! There are some rules in the Geneva conventions which apply to all conflicts, regardless of the participants being signatories or independent states. Doesn't even have to be on a battlefield, it seems. Chief among them is execution of a prisoner or discrimination based on race, age, sex, religion, etc etc. So both we and our enemies are bound by them. Not the entirety of the Geneva conventions, mind you, just a few basic principles which apply to ALL conflicts.\n\n \n Uh, no. No treaty is applicable to a state that has not ratified it. You can find the full text of them at http://www.genevaconventions.org/. Protocalls I and II relate to non international wars, wars of self determination, and protection against racist regimes, and armed oopposition that controls enough territory to carry out sustained military operations. \n \n \n \nThat's too far, chief. You need to apologize to him.\n\n \n No, I don't. If there are people in this country who are so blinded by false patriotism as to refuse to accept responsibility for our past actions, and that gets people killed, I sincerely hope that it is those folks who are killed, not those of us who recognize that there have been some \"problems\" in americas past that have to be dealt with. I owuld prefer that those who are not causing the problem not have to pay for the foolishness of those who are.", 
   {}, 
   147507, 
   null, 
   1121461680.0
  ], 
  [
   147545, 
   null, 
   "biccat", 
   "No, I don't. If there are people in this country who are so blinded by false patriotism as to refuse to accept responsibility for our past actions, and that gets people killed, I sincerely hope that it is those folks who are killed, not those of us who recognize that there have been some \"problems\" in americas past that have to be dealt with. I owuld prefer that those who are not causing the problem not have to pay for the foolishness of those who are.\n\n I'll bet you're glad that only Conservatives were killed in the WTC bombings.", 
   {}, 
   147540, 
   null, 
   1121462340.0
  ], 
  [
   147565, 
   null, 
   "jim's trucking", 
   "...\n \n \n \n \n ... I would prefer that those who are not causing the problem not have to pay for the foolishness of those who are.\nApparently, you misunderstand the cause. We did not bring 9-11 on ourselves. It or something similar would have happened without any input from the US. The radical Muslims (and it takes only a small percentage of the total Muslim population being radical to create a huge pool of madmen) want to kill all infidels and will attempt to do so throughout the future as they have done repeatedly in the past.\n \n You act like patriotism is a plague. Are you in favor of a one-world society or what?", 
   {}, 
   147540, 
   null, 
   1121465940.0
  ], 
  [
   147598, 
   null, 
   "georged", 
   "Apparently, you misunderstand the cause. We did not bring 9-11 on ourselves. It or something similar would have happened without any input from the US. The radical Muslims (and it takes only a small percentage of the total Muslim population being radical to create a huge pool of madmen) want to kill all infidels and will attempt to do so throughout the future as they have done repeatedly in the past.\n \n You act like patriotism is a plague. Are you in favor of a one-world society or what?\n\n \n JT, we did bring 9/11 on ourselves. The reasoning behind 9/11 was very clearly stated and a direct result of our self-serving ME foreign policy. I'm not siding with the perpetrators of 9/11 and would like Bin Laden punished, but if we don't take responsibility for our self-serving foreign policy of supporting dictatorships, Israel's real estate policies and CIA sponsored destabilization of ME countries to use their resources, we sound like total hypocrites trying to implement democracy in the ME. The ME will fight us to the ground and economically break us, just as Bin Laden desires. Why would they want to copy something that has done nothing but rearrange their borders and loot them? \n \n Patriotism seems to have new definitions. Anyone who wants to take responsibility for our actions is now unpatriotic? Our leadership had half the population believing 9/11 and Iraq were associated and a good number of people still believe that deception. If someone disagrees with our foreign policy that person is no longer a patriot? For a supposedly democratic nation, that's very scary ideology.", 
   {}, 
   147565, 
   null, 
   1121473860.0
  ], 
  [
   147676, 
   null, 
   "Symbiote", 
   "I've already explained why I don't expect you to understand the moral distinction.\n\n \n I guess the word terrorist can mean whatever you want it to then - everyone in Guantanamo Bay is a terrorist, Saddam is a terrorist, Iraqi insurgents are terrorists, even though they dont fit any reasoned definition of the word, if its convenient to call someone a terrorist, they're a terrorist.\n \n I just don't see the moral distinction, but if you feel hatred towards someone, they must be evil, and therefore a terrorist.", 
   {}, 
   147403, 
   null, 
   1121488560.0
  ], 
  [
   147677, 
   null, 
   "marc9000", 
   "Apparently, you misunderstand the cause. We did not bring 9-11 on ourselves. It or something similar would have happened without any input from the US. The radical Muslims (and it takes only a small percentage of the total Muslim population being radical to create a huge pool of madmen) want to kill all infidels and will attempt to do so throughout the future as they have done repeatedly in the past. \n\n \n That's it. The reason behind 9/11 is simple, as simple as the many smaller terrorist attacts against the U.S. before that. The very small percentage of radical Muslims that attack the U.S. hate us simply because we are friends of the Jews. The U.S. supports the right of the Jewish state to exist in the middle of what the Arab world views as Muslim territory. In the minds of many Muslims we are commiting crimes that require Muslims to wage war against us. Since Israel has become an independent Jewish state, Muslim extremists have been trying to destroy it, and they see the U.S. as the only reason Israel has survived for as long as it has. That's not true of course, as early as 1948 Israel clobbered Syria, Egypt, and Jordan simultaneously, simply outgunning and outclassing poorly trained, poorly equiped, and poorly led Arab forces. The U.S. had little to do with it. \n \n If one simply glances through the \"al qadea training manuel\", \n \n http://www.fas.org/irp/world/para/manualpart1.html\n \n it's easy to see that nothing the U.S. could do would stop extreme Muslims from attempting to kill Americans. But the job is easier for them if as many Americans as possible think that terrorists CAN really be appeased. Catch phrases like our \"self serving foreign policy\" spread on anti-American websites and news sources are useful to terrorists. What other foreign policy is there but \"self serving\"? Much of our foreign policy (that they claim as a reason to attack us) has been in response to previous terrorism. \n \n If the U.S. were more united in the war on terror, it would be more successful, and the rest of the world would respect us more. If anti-Americanism is spouted WITHIN America, it tends to grow outside America. I'm not advocating restricting free speech, I'm advocating my freedom to not like some of it. emoticon_xangel", 
   {}, 
   147565, 
   null, 
   1121488740.0
  ], 
  [
   147842, 
   null, 
   "Diogenes99", 
   "Why was it not a rational response? Were we not offenders given the reasons presented for the attack? Is Bin Laden's statement 'Any nation that does not attack us will not be attacked' incorrect?. What is your definition of rationality, 'us or them' regardless of circumstances leading up to the attack?\n \n I'm not condoning the attack and feel Bin Laden should be brought to justice for that event. Someone attacks us, we strike back. I'm questioning your lack of understanding events which subsequently lead to the attack and your definition of rationality. \n \n Mad Dogs might be better applied to our unrelated (to 9/11) invasion and occupation of Iraq.\nTerrorism is never a rational response, and the \"offenses\" stated as a reason are a shallow PR ploy that criminals have used from the beginning of time. I am surprised that anyone could take such obvious propaganda seriously, or that anyone could possibly start their reasoning with the premise that the terrorists are necessarily honest in their propaganda.\n \n Whether or not Saddam had any operational role in 9/11 (and there is no evidence that he did) is irrelevant. The correct way to deal with the threat of terrorism is not to have Vauban design a better fortress, as you suggest. The better way is to drain the cultural swamp that produces the mad dogs, and that process begins in Iraq.", 
   {}, 
   147495, 
   null, 
   1121545320.0
  ], 
  [
   147846, 
   null, 
   "Diogenes99", 
   "If you can't refute...throw a hissy fit.\nNo thanks. You're doing quite well on your own. emoticon_rolleyes \n \n \nWrong. Under the geneva convention, everybody captured in an occupied country has rights. The geneva conventions does NOT apply to people that are captured who are NOT in a war zone.\nI refer you to the Convention itself. Pay particular attention to Article 4, Paragraph A, Section 2. Prisoners of war must satisfy all conditions (a)-(d) in order to be eligible for the protections of the convention. Otherwise they have no rights other than what their captors graciously offer, and they are eligible for summary execution.\n \n \nHistory has shown that we will eventually loose to the terrorists. Hopefully they will only kill those like yourself who have no sense of honor, morals or personal responsibility, then those of us who are left can rebuild america into a great naiton once again\nThat sort of inverted reasoning cries out for professional help. Enjoy the kool-aid while it lasts.\n \n \nThat's too far, chief. You need to apologize to him.\nNo sweat. Like Eisenhower used to tell his bridge partners when they screwed up, \"No apology is necessary because none would be sufficient.\"", 
   {}, 
   147842, 
   null, 
   1121546820.0
  ], 
  [
   147855, 
   null, 
   "lord tammerlain", 
   "Terrorism is never a rational response, and the \"offenses\" stated as a reason are a shallow PR ploy that criminals have used from the beginning of time. I am surprised that anyone could take such obvious propaganda seriously, or that anyone could possibly start their reasoning with the premise that the terrorists are necessarily honest in their propaganda.\n \n Whether or not Saddam had any operational role in 9/11 (and there is no evidence that he did) is irrelevant. The correct way to deal with the threat of terrorism is not to have Vauban design a better fortress, as you suggest. The better way is to drain the cultural swamp that produces the mad dogs, and that process begins in Iraq.\n\n \n Terrorism is a rational response.\n \n Look at Southern Lebanon from 1982 to 2000.\n \n It was occupied by the US and Israel, much to the dismay of the Southern Lebanese. A couple of bombing vs US targets and the US leaves. The southern Lebanese had no other way of fighting the US military but through car bombing and the like. A rational and productive method for them to take.\n \n Then the Southern Lebanese continued such actions vs the Israeli forces and thier supporters. Making further Israeli occupation of Southern Lebanon untenable. The Israelis left in 2000. The southern lebanese did not have the military, economic or political power to force the Israelis out in any other way. A rational and pratical method to force the occupier out of their lands.", 
   {}, 
   147842, 
   null, 
   1121550360.0
  ], 
  [
   147867, 
   null, 
   "Ghost", 
   "It was occupied by the US and Israel, much to the dismay of the Southern Lebanese. A couple of bombing vs US targets and the US leaves. The southern Lebanese had no other way of fighting the US military but through car bombing and the like. A rational and productive method for them to take.\n\n \n There is a difference. In Lebanon, American soldiers were targeted. Soldiers are a valid target. Whether or not it was terrorism is debateable. Why people here are angry about terrorism is the fact that innocent civilians have become a target. If there are soldiers in a foreign country, and the natives want them out, then they can reasonably be expected to target those soldiers. That doesn't mean the natives are right, the soldiers are wrong, etc etc, it simply means that is how they are expected to fight back. The outrage is when people who are angry at a nation atempt to kill thousands of innocent civilians who have nothing to do with any occupation.\n \n If the insurgents in Iraq, for example, wanted to strictly target American and allied soldiers, that's one thing. But they aren't. They are also targeting civilians, who are not members of any military or militaristic faction or whatever.", 
   {}, 
   147855, 
   null, 
   1121553780.0
  ], 
  [
   147901, 
   null, 
   "georged", 
   "\n Whether or not Saddam had any operational role in 9/11 (and there is no evidence that he did) is irrelevant. The correct way to deal with the threat of terrorism is not to have Vauban design a better fortress, as you suggest. The better way is to drain the cultural swamp that produces the mad dogs, and that process begins in Iraq.\n\n \n And continue draining until surrounded by wasteland ensuring your ideology is the only remaining choice? If your intent is to eradiate all persons \n not in agreement with US ideology, policy and demands, why not start a world war right now and save yourself years of wear and tear with eventual financial ruin? That way you'd have a declaration of war which would also allow you to classify as unpatriotic and immediately remove those US citizens speaking out against your policies.", 
   {}, 
   147842, 
   null, 
   1121560380.0
  ], 
  [
   147902, 
   null, 
   "georged", 
   "There is a difference. In Lebanon, American soldiers were targeted. Soldiers are a valid target. Whether or not it was terrorism is debateable. Why people here are angry about terrorism is the fact that innocent civilians have become a target. If there are soldiers in a foreign country, and the natives want them out, then they can reasonably be expected to target those soldiers. That doesn't mean the natives are right, the soldiers are wrong, etc etc, it simply means that is how they are expected to fight back. The outrage is when people who are angry at a nation atempt to kill thousands of innocent civilians who have nothing to do with any occupation.\n \n If the insurgents in Iraq, for example, wanted to strictly target American and allied soldiers, that's one thing. But they aren't. They are also targeting civilians, who are not members of any military or militaristic faction or whatever.\n\n \n I hate to burst your bubble, but you're again rationalizing our actions while condemning the same actions by opponents of our occupation. We call killing civilians collateral damage.", 
   {}, 
   147867, 
   null, 
   1121560500.0
  ], 
  [
   147911, 
   null, 
   "marc9000", 
   "And continue draining until surrounded by wasteland ensuring your ideology is the only remaining choice? If your intent is to eradiate all persons \n not in agreement with US ideology, policy and demands, why not start a world war right now and save yourself years of wear and tear with eventual financial ruin? That way you'd have a declaration of war which would also allow you to classify as unpatriotic and immediately remove those US citizens speaking out against your policies.\n\n \n It's not the intent. To say it is, is merely emotional speak from anti U.S. sources. The intent is to eradicate TERRORISTS. No one else. \n \n \"Immediately remove those U.S citizens....\" - and you accuse others of emotion?", 
   {}, 
   147901, 
   null, 
   1121563140.0
  ], 
  [
   147952, 
   null, 
   "biccat", 
   "I hate to burst your bubble, but you're again rationalizing our actions while condemning the same actions by opponents of our occupation. We call killing civilians collateral damage.\n\n There's a different in intent, even if you take the position that there is no difference in consequence.", 
   {}, 
   147902, 
   null, 
   1121572560.0
  ], 
  [
   147966, 
   null, 
   "daewoo", 
   "I refer you to the Convention itself. Pay particular attention to Article 4, Paragraph A, Section 2. Prisoners of war must satisfy all conditions (a)-(d) in order to be eligible for the protections of the convention. Otherwise they have no rights other than what their captors graciously offer, and they are eligible for summary execution.\n\n \n That is only convention III. Maybe you should take a look at I, II, and IV, and maybe protocals I and II as well....you know, since they make up 83% of the geneva conventions. You can find them at http://www.genevaconventions.org/ \n \n Every person captured during a conflict has some priotecitons under the Geneva conventions, not just prisoners of war. Even spies and saboteurs have some rights.\n \n \nThat sort of inverted reasoning cries out for professional help. Enjoy the kool-aid while it lasts.\n\n \n Certainly...inverted reasoning....that those who have peed in their cheerios have to eat it as opposed to making all of us take a bite.", 
   {}, 
   147846, 
   null, 
   1121576280.0
  ], 
  [
   147984, 
   null, 
   "Ghost", 
   "I hate to burst your bubble, but you're again rationalizing our actions while condemning the same actions by opponents of our occupation. We call killing civilians collateral damage.\n\n \n The US tries not to kill civilians, the terrorists do. I refer you to the rules of engagement US soldiers have to act by; they require positive identification of an enemy target before they can open fire, they cannot fire into civilian-populated areas unless the enemy is using them or in self defense. In addition, they are not allowed to target hospitals, mosques, schools, etc unless in self defense.\n \n Contrast that to the terrorist last week who killed 26 innocent Iraqis, including 18 little kids, to kill 1 American. Or how about when they're not even targeting soldiers, just trying to kill Iraqi civilians?\n \n As others have said several times, there is a major difference in intent.", 
   {}, 
   147902, 
   null, 
   1121587560.0
  ], 
  [
   148042, 
   null, 
   "lord tammerlain", 
   "The US tries not to kill civilians, the terrorists do. I refer you to the rules of engagement US soldiers have to act by; they require positive identification of an enemy target before they can open fire, they cannot fire into civilian-populated areas unless the enemy is using them or in self defense. In addition, they are not allowed to target hospitals, mosques, schools, etc unless in self defense.\n \n Contrast that to the terrorist last week who killed 26 innocent Iraqis, including 18 little kids, to kill 1 American. Or how about when they're not even targeting soldiers, just trying to kill Iraqi civilians?\n \n As others have said several times, there is a major difference in intent.\n\n \n They do not always follow those procedures.\n \n Iraq has many instances of not having positive identification of an enemy target, and Afghanistan just recently has an example of a B52 bomber bombing a village \"suspected\" of having insurgents. Out of 17 killed and dozens injured not one was reported to be an insurgent.", 
   {}, 
   147984, 
   null, 
   1121623380.0
  ], 
  [
   148043, 
   null, 
   "Diogenes99", 
   "And continue draining until surrounded by wasteland ensuring your ideology is the only remaining choice?\nYou seem to be assuming that eliminating the hopelessness, ignorance and lack of opportunity that go with living under an oppressive dictatorship will create a wasteland in the ME. That is extremely racist, and not worth further discussion.", 
   {}, 
   148042, 
   null, 
   1121624040.0
  ], 
  [
   148045, 
   null, 
   "georged", 
   "The US tries not to kill civilians, the terrorists do. I refer you to the rules of engagement US soldiers have to act by; they require positive identification of an enemy target before they can open fire, they cannot fire into civilian-populated areas unless the enemy is using them or in self defense. In addition, they are not allowed to target hospitals, mosques, schools, etc unless in self defense.\n \n Contrast that to the terrorist last week who killed 26 innocent Iraqis, including 18 little kids, to kill 1 American. Or how about when they're not even targeting soldiers, just trying to kill Iraqi civilians?\n \n As others have said several times, there is a major difference in intent.\n\n \n Intent is defined motivation by all sides of a discussion. The US has claimed WMDs, removing Saddam, humanitarianism and instilling democracy for our actions. Civilians are being killed because we invaded and occupied Iraq, no other reason. Trying to rationalize intent, including air and ground strikes which have no means of controlling who's killed and leveling houses because of 'suspicion', simply means we've taken sides in a civil war within a sovereign nation as an occupying force. Please explain to me how that justifies anything, especially intent, when we're responsible for both the resistance and attempts to eradicate it.", 
   {}, 
   147984, 
   null, 
   1121624640.0
  ], 
  [
   148046, 
   null, 
   "georged", 
   "You seem to be assuming that eliminating the hopelessness, ignorance and lack of opportunity that go with living under an oppressive dictatorship will create a wasteland in the ME. That is extremely racist, and not worth further discussion.\n\n \n Racist? I'm not advocating draining the cultural swamp by force to instill new ideology, that's your plan.", 
   {}, 
   148043, 
   null, 
   1121624940.0
  ], 
  [
   148051, 
   null, 
   "daewoo", 
   "They do not always follow those procedures.\n \n Iraq has many instances of not having positive identification of an enemy target, and Afghanistan just recently has an example of a B52 bomber bombing a village \"suspected\" of having insurgents. Out of 17 killed and dozens injured not one was reported to be an insurgent.\n\n \n That is becuase we are fighting a cowardly and dishonorbale war. We are trading Iraqi civilians lives for american servicemens lives so the politicians back home do not have to deal with grieving widows and flag draped coffins on teh front page of every newspaper in the nation.\n \n If we were truly interested in protecting Iraqi civilain lives, we would send infantry into places like that and fight a ground battle. Our casuaties would be high, but ground battles fought at the infantry level, especially in towns and villages, has a MUCH, MUCH lower rate of casuaties for the civilian population that bombing, air attacks, or the use of armoured vehicles. \n \n We are not trying to minimize civilian casuatis, though, we are trying to pull off a massive PR stunt without upsetting the voters back at home. \n \n When I was in the military, if I had been ordered to facilitate such a strike, i would have refused that order, and done so without fear of reprisal, and with the full knowledge that of those up the chain of command wanted to push the issue, they would almost certainly be court martialed for even attempting it. Of course, when I was in the military, Bill Clinton was the commander in chief, before that it was Bush Sr, before that Regan. Most of these guys held the military under tight reign when it came to such things, and senior staff was not used to a \"damn the civilians\" approach. Even under Reagan, the US military was expected to act honorably (we trained local tyrants to do the dishonorable stuff).\n \n Under baby Bush, the rules have changed, and with them the perception of the US military. Trading civlian lives for politcal gain is the new SOP.", 
   {}, 
   148042, 
   null, 
   1121626740.0
  ], 
  [
   148054, 
   null, 
   "Ghost", 
   "Civilians are being killed because we invaded and occupied Iraq, no other reason.\n\n \n There were civilians dying in Iraq before we got there, may I remind you. There isn't a confirmed number yet, or even a close approximation, because of the whole mass grave thing.\n \n And the civilians are being killed because there are foreign terrorists killing them to try to cow the populace, allowing them to take control. The fact remains, we are not deliberately targeting civilians.", 
   {}, 
   148045, 
   null, 
   1121627160.0
  ], 
  [
   148066, 
   null, 
   "Diogenes99", 
   "Racist? I'm not advocating draining the cultural swamp by force to instill new ideology, that's your plan.\nYou are claiming that Middle Eastern people are incapable of governing themselves when you claim that draining the swamp will leave only a wasteland. That's racism. Please note that you are wrong, and the Iraqis are now governing themselves.", 
   {}, 
   148046, 
   null, 
   1121631600.0
  ], 
  [
   148072, 
   null, 
   "georged", 
   "You are claiming that Middle Eastern people are incapable of governing themselves when you claim that draining the swamp will leave only a wasteland. That's racism. Please note that you are wrong, and the Iraqis are now governing themselves.\n\n \n Wrong. I'm saying let them govern themselves without our interference. If they're governing themselves, why are we still there? Iraqi resistance is against our occupation and those sympathetic to our occupation. You're stating elimination of resistance is the solution, which is a form of genocide on those who resist our presence. Preparing Iraq security to eliminate that resistance is swapping one form of dictatorship for another. Let them fight it out among themselves instead of nation building.", 
   {}, 
   148066, 
   null, 
   1121633340.0
  ], 
  [
   148073, 
   null, 
   "georged", 
   "There were civilians dying in Iraq before we got there, may I remind you. There isn't a confirmed number yet, or even a close approximation, because of the whole mass grave thing.\n \n And the civilians are being killed because there are foreign terrorists killing them to try to cow the populace, allowing them to take control. The fact remains, we are not deliberately targeting civilians.\n\n \n That's past history. Saddam is no longer in power, we are. That means all violent civilian deaths in Iraq are our responsibility regardless of deliberation, intent or cause. You do understand the scope of responsibility in occupying a foreign nation? Foreign presence in Iraq resistance is what, 10% of the total? That one doesn't wash any better now than when it was first attempted as a cop out for resistance.", 
   {}, 
   148054, 
   null, 
   1121634120.0
  ], 
  [
   148149, 
   null, 
   "Diogenes99", 
   "Wrong. I'm saying let them govern themselves without our interference.\nThat's the plan. :) \n \n \nIf they're governing themselves, why are we still there? Iraqi resistance is against our occupation and those sympathetic to our occupation.\nWe are there because Iraq is being invaded by foreign terrorists, assisted by a few gangsters left over from the days of Saddam, and they are not yet prepared to go it alone.\n \n \nYou're stating elimination of resistance is the solution, which is a form of genocide on those who resist our presence.\nElimination of the terrorists is indeed the goal. The resistance is not to our presence, but to the idea of a free and self-governing Iraq. If you followed the news, you would know that most of the attacks are against Iraqis - but it doesn't seem to have slowed recruitment for the new Iraqi security forces.\n \n \nPreparing Iraq security to eliminate that resistance is swapping one form of dictatorship for another. Let them fight it out among themselves instead of nation building.\nSo the security forces of a freely elected government are just another form of dictatorship? That's bizarre. emoticon_rolleyes", 
   {}, 
   148072, 
   null, 
   1121656980.0
  ], 
  [
   148242, 
   null, 
   "georged", 
   "We are there because Iraq is being invaded by foreign terrorists, assisted by a few gangsters left over from the days of Saddam, and they are not yet prepared to go it alone.\n \n Elimination of the terrorists is indeed the goal. The resistance is not to our presence, but to the idea of a free and self-governing Iraq. If you followed the news, you would know that most of the attacks are against Iraqis - but it doesn't seem to have slowed recruitment for the new Iraqi security forces.\n \n So the security forces of a freely elected government are just another form of dictatorship? That's bizarre. emoticon_rolleyes\n\n \n Foreign terrorists? I suggest you do a little research on that one before sounding like a fool. Estimates of foreign support in Iraq resistance are:\n \n 2% - U.S. military command handling detention operations in Iraq\n http://www.usatoday.com/news/world/iraq/2004-07-05-detainees-usat_x.htm\n \n Of course security enlistment is up. In any country where unemployment is estimated at 27-40% people are going to try for any job, regardless of the dangers, to support their families. And attacks are on Iraqis, primarily those who support our occupation, because US military forces stay out of metropolitan areas that produce politically sensitive casualties. \n \n Iraqi is not an attractive example of the benefits of democratization. We've shown them noting but negatives; military occupation, ineffectual governance, economic stagnation, criminal chaos, ethnic-based politics, and social strife. That example is what will stick in the minds of all ME countries in our proclaimed effort to 'spread democracy'. \n \n While you feebly attempt to romanticize elections in Iraq as an all-encompassing solution to ME problems, the Iraqi people have rejected our puppet government, are aligning themselves with Iran and utilizing our military presence to dominate the minority population. All we've done is eliminate one iron fist (Saddam) and allow another to surface. \n \n I don't give one hoot about Iraq or any of the ME other than concern for the tremendous drain on our resources and loss of American lifes. I do recognize the mistake we made by invading Iraq and feel sadness for Americans who have been intellectually deceived into supporting such a grave injustice.", 
   {}, 
   148149, 
   null, 
   1121699580.0
  ], 
  [
   148343, 
   null, 
   "daewoo", 
   "Foreign terrorists? I suggest you do a little research on that one before sounding like a fool. Estimates of foreign support in Iraq resistance are:\n \n 2% - U.S. military command handling detention operations in Iraq\n http://www.usatoday.com/news/world/iraq/2004-07-05-detainees-usat_x.htm\n \n\n \n That can't be right. Donald Rumsfeld told us that Iraqis love us, and that the attacks are all the work of foreign fighters. If the 2% number is true, that would imply that Iraqis prefer self determination to a political system imposed on them at the end of a gun. Don't those foolish people know that WE know what is best for them because we are the all powerful United States?\n \n Personally I ifnd it amusing that everybody in America knows who Zarqawi is. His groups have been responsible for fewer than 5% of attacks in Iraq. I read a report the other day about an attack by his group...one of over 70 that day. They were not involved in any of the others, but it was their attack that was referenced by the Bush administration, in fact cited as evidence that foreign fighters were causing all the trouble", 
   {}, 
   148242, 
   null, 
   1121725320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  \"terrorist\" carries \"value judgement\"", 
  "url": "http://www.4forums.com/political/news-forum/5944-terrorist-carries-value-judgement.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 5944, 
  "discussion_files": [
   [
    "11570.html", 
    "http://www.4forums.com/political/news-forum/5944-terrorist-carries-value-judgement-print.html"
   ], 
   [
    "11571.html", 
    "http://www.4forums.com/political/news-forum/5944-terrorist-carries-value-judgement-5-print.html"
   ], 
   [
    "11572.html", 
    "http://www.4forums.com/political/news-forum/5944-terrorist-carries-value-judgement-4-print.html"
   ], 
   [
    "11573.html", 
    "http://www.4forums.com/political/news-forum/5944-terrorist-carries-value-judgement-3-print.html"
   ], 
   [
    "11574.html", 
    "http://www.4forums.com/political/news-forum/5944-terrorist-carries-value-judgement-2-print.html"
   ]
  ], 
  "identifier": 5944
 }
]