[
 [
  [
   147015, 
   null, 
   "Missouri Mule", 
   "What is the difference between a \"stop\" and a \"limit\" order? I want to put all my money into Ford Motor Company. What should I do?", 
   {
    "post_info": {
     "post_title": "I need some stock trading help."
    }
   }, 
   null, 
   null, 
   1121287800.0
  ], 
  [
   147020, 
   null, 
   "Waxy", 
   "What is the difference between a \"stop\" and a \"limit\" order? I want to put all my money into Ford Motor Company. What should I do?\n\n \n Consult a financial advisor, or perhaps, a psychologist. :p \n \n Waxy", 
   {}, 
   147015, 
   null, 
   1121288760.0
  ], 
  [
   147024, 
   null, 
   "Missouri Mule", 
   "You can't tell me the difference between a stop and a limit order? That should not require the services of a financial expert.", 
   {}, 
   147020, 
   null, 
   1121289780.0
  ], 
  [
   147026, 
   null, 
   "biccat", 
   "http://www.investopedia.com/ask/answers/04/022704.asp", 
   {}, 
   147024, 
   null, 
   1121290200.0
  ], 
  [
   147032, 
   null, 
   "Missouri Mule", 
   "http://www.investopedia.com/ask/answers/04/022704.asp\n\n \n That's very helpful. Thanks.", 
   {}, 
   147026, 
   null, 
   1121291460.0
  ], 
  [
   147037, 
   null, 
   "daewoo", 
   "A stop order is essentailly a standing order to buy or sell at a specified price.\n \n The limit order is essentially the same, but it is set to buy a security at or below a predetermied price, or sell at or above a predetermined price.\n \n \n Many people use them interchangably\n \n Yiou might wait before putting all your stock in ford until the next round of quarterly reports comes out. Their didiotic attemptt o match GMs sales promotion will move a lot of inventory for them, but will trash their bottom line, so their stock will likely drop. Lerts face it, their ROI is nothing anyway (1.7% last year) and most of the predicitons and numbers I see show an ROI below .75% in their next quarterly report. They will move a LOT of stock, but if you sell at a loss, you cannot make it up in volume.\n \n BTW...what exactly are you trying to do?", 
   {}, 
   147026, 
   null, 
   1121292360.0
  ], 
  [
   147045, 
   null, 
   "Dono", 
   "What is the difference between a \"stop\" and a \"limit\" order? I want to put all my money into Ford Motor Company. What should I do?\n\n How ironic that you who made such scurrilous remarks about the poor (back before your \"no post\" decision) are about to become one of them.\n Dono", 
   {}, 
   147015, 
   null, 
   1121294100.0
  ], 
  [
   147049, 
   null, 
   "gamehuis", 
   "MM, I know that we've had our differences here, but I don't like to see you lose a lot of money.\n Please reconsider buying Ford stock, or at least put it off till the Ford management has devised a better business strategy for the coming years other than 'match the GM discount'.\n \n I know that the Ford P/E ratio, which is currently at around 7-8, is good but unless the management finds a way to not just boost sales, but boost net income it could get a lot worse.", 
   {}, 
   147045, 
   null, 
   1121294700.0
  ], 
  [
   147102, 
   null, 
   "Missouri Mule", 
   "A stop order is essentailly a standing order to buy or sell at a specified price.\n \n The limit order is essentially the same, but it is set to buy a security at or below a predetermied price, or sell at or above a predetermined price.\n \n Many people use them interchangably\n \n Yiou might wait before putting all your stock in ford until the next round of quarterly reports comes out. Their didiotic attemptt o match GMs sales promotion will move a lot of inventory for them, but will trash their bottom line, so their stock will likely drop. Lerts face it, their ROI is nothing anyway (1.7% last year) and most of the predicitons and numbers I see show an ROI below .75% in their next quarterly report. They will move a LOT of stock, but if you sell at a loss, you cannot make it up in volume.\n \n BTW...what exactly are you trying to do?\n\n \n I sold some stock today and have some cash I want to move elsewhere. I am actually going to buy some more Dell stock but I am looking at Ford for future purchases.\n \n BTW, this is the response I received from the brokerage company via e-mail. I'm still not sure I understand the distinction. I guess I'm an idiot. All I'm trying to do is to buy Dell at 40.00 but I don't want to watch the ticker for the magic moment. \n \n Dear Investor,\n \n Thank you for your email. \n \n A limit order sets the maximum or minimum price at which you are willing to buy or sell. For example, if you wanted to buy a stock at $10, you could enter a limit order for this amount. This means that you would not pay a penny over $10 for the particular stock. It is still possible, however, that you buy it for less than the $10. \n \n A stop order is one of the most useful orders. This order is different because--unlike the limit and market orders, which are active as soon as they are entered--this order remains dormant until a certain price is passed, at which time it is activated as a market order. For instance, if a sell stop order were placed on the XYZ shares at $45 per share, the order would be inactive until the price reached or dropped below $45. The order would then be transformed into a market order, and the shares would be sold at the best available price. You should consider using this type of order if you don't have time to watch the market continually but need protection from a large downside move.\n \n Please let us know if you have any further questions.\n \n Sincerely,", 
   {}, 
   147037, 
   null, 
   1121308920.0
  ], 
  [
   147106, 
   null, 
   "georged", 
   "MM, I know that we've had our differences here, but I don't like to see you lose a lot of money.\n Please reconsider buying Ford stock, or at least put it off till the Ford management has devised a better business strategy for the coming years other than 'match the GM discount'.\n \n I know that the Ford P/E ratio, which is currently at around 7-8, is good but unless the management finds a way to not just boost sales, but boost net income it could get a lot worse.\n\n \n US auto manufacturers are notorious for low yield dividends. I just looked at Ford and they're around 4%. Most tax-free munis are at 5%, almost 8% for a mid-tax bracket, a no-brainer. I wondered if Kekorian was after some of GM's big cash stash as a special equity dividend.", 
   {}, 
   147049, 
   null, 
   1121311920.0
  ], 
  [
   147107, 
   null, 
   "daewoo", 
   "I sold some stock today and have some cash I want to move elsewhere. I am actually going to buy some more Dell stock but I am looking at Ford for future purchases.\n \n BTW, this is the response I received from the brokerage company via e-mail. I'm still not sure I understand the distinction. I guess I'm an idiot. All I'm trying to do is to buy Dell at 40.00 but I don't want to watch the ticker for the magic moment. \n\n \n What you want is a limit order. The biggest difference (as far as I know) is that a limit order is an active order, while a stop order is a triggered event, whcih means it is inactive until the triggering event takes place.\n \n You can look at it like this (though it is not exactly accurate)---\n \n Lets say you want to buy Dell stock. You put a sign in your yard that says \"Willing to pay $40 for Dell stock\" you have just palced a neiborghood limit order.\n \n If you look in the paper one day and see that dell stock is at $40, so go out and put a sign in your yard that says \"Want to buy dell stock\", you have just placed a stop order (though atop orders are generally used for sales).\n \n \n \n Are you trading with an active broker, or tradingh online? It makes a difference in how you play such things. Sometimes an active broker will charge higher for a limit order since they require more maintenance, and they sometimes get screwed on them. \n \n I am not a big stock trader, or when I do trade I do not shot for a narrow band, but rather the long haul, so I do not really have experience with stop or limit orders in the stock market in an online forum. I do trade currency online, and I know for currency trades, most stop orders are free, and limit orders sometimes cost a pip or two in the spread. I ahve not set an electronic limit order for a long time, though. The automated systems are so fast that stop loss orders do just fine.\n \n It really depends on how volatile the market is. If youa re talkign enough money tyo really worry about, watching the ticker may be a good idea, since additional comission for a limit order may be expensive enoguh to make a difference....assuming that they are still charging extra for them (gamehuis would be the man witht he answers on that one).\n \n \n \nI know that the Ford P/E ratio, which is currently at around 7-8, is good but unless the management finds a way to not just boost sales, but boost net income it could get a lot worse.\n\n \n This si my concern with ford. If GMs discounts are indeed the opening shots of a war with ford over domestic market share, I can certainly see a scenario where ford goes down the toilet rather quickly. It is not aquetion of customer loyalty, or styling, or even quality of vehicle. Ford simply does not have enough cash or credit lines for a protracted battle with GM for the domestic market. GM is sitting on one hell of a war chest. Ford is not. They spent their money buying brands like land rover, jaguar, etc....whose images they quickly drove into the ground.", 
   {}, 
   147102, 
   null, 
   1121311920.0
  ], 
  [
   147124, 
   null, 
   "Dono", 
   "How ironic that you who made such scurrilous remarks about the poor (back before your \"no post\" decision) are about to become one of them.\n Dono\n\n Oops, I made this post based on Post #1 (\"I want to put all my money into Ford Motor Company.\"), which is different from Post #9. With #9, it is unlikely you will have to join that hoard of malingerers after all.\n Dono", 
   {}, 
   147045, 
   null, 
   1121320380.0
  ], 
  [
   147136, 
   null, 
   "gamehuis", 
   "The online broker I have charges the same for stop and limit orders, so I've never had any use for stop orders. In fact, since stop orders are converted into market orders it can actually be unbeneficial for you as the client. A market order is basically an order to buy or sell at the current market price. But when taking into account the speed and volitility of the market it can sometimes mean that you lose an extra cent or two because the stockprice can change in the seconds that the order is placed.\n Limit orders don't have that problem, you always get the stock at the price you selected or better.\n \n And you don't have to continually watch the ticker for a limit order. Just punch it in and let it stay. Just be sure that you set the duration of your order to GTC (Good Till Cancelled) instead of DAY (order only stands this current trading day).\n I've had limit orders stand for many months for example when I was on holiday.", 
   {}, 
   147124, 
   null, 
   1121333100.0
  ], 
  [
   147180, 
   null, 
   "georged", 
   "\n I know that the Ford P/E ratio, which is currently at around 7-8, is good but unless the management finds a way to not just boost sales, but boost net income it could get a lot worse.\n\n \n While Ford/GM literally struggle for survival in the here and now (I also looked at some of their other ratios and ran a short spread based on declining market share with existing overhead percentages (including debt service which will actually increase) using COGS at 80% working backwards, which reaffirmed my position of staying out of manufacturing equity markets as a casual investor), Toyota is, as usual, looking down the road:\n \n http://today.reuters.com/business/newsArticle.aspx?type=ousiv&storyID=2005-07-14T120944Z_01_T309609_RTRIDST_0_BUSINESSPRO-AUTOS-TOYOTA-DC.XML\n \n Same old Marketing 101 philosophy they've always followed; find a need and fill it with the best possible product. With both Ford/GM now farming out design and production engineering to cut overheads, Toyota should easily become the GM of this century.", 
   {}, 
   147049, 
   null, 
   1121360040.0
  ], 
  [
   147709, 
   null, 
   "Missouri Mule", 
   "I'm taking away from this discussion that I merely need to put in a \"limit\" order and that will stay there until the desired price is reached. Is that about correct? I'm still a little confused by the brokerage's response. I know that I don't want to mess with a market order. I'd spend all my time looking at the stock price. I just want to park my money in cash and let it be triggered when the desired price is reached. Is a \"stop\" order mainly used for sell order? I have some tech stock I would dearly love to dump. I made that mistake when I thought investing in stocks was a licence to print money. Yes, I was a fool and an idiot.", 
   {}, 
   147180, 
   null, 
   1121497620.0
  ], 
  [
   147776, 
   null, 
   "daewoo", 
   "I'm taking away from this discussion that I merely need to put in a \"limit\" order and that will stay there until the desired price is reached. Is that about correct? I'm still a little confused by the brokerage's response. I know that I don't want to mess with a market order. I'd spend all my time looking at the stock price. I just want to park my money in cash and let it be triggered when the desired price is reached. Is a \"stop\" order mainly used for sell order? I have some tech stock I would dearly love to dump. I made that mistake when I thought investing in stocks was a licence to print money. Yes, I was a fool and an idiot.\n\n \n Yes, you can just park your money, put alimit order in, and be in good shape.\n \n As far as the tech stock, you could put a limit order on that, too. \n \n Again, I generally trade in currency, so there is a difference, but in currency trading you place a stop loss order at a lower number to sell (AFIK a stop order is generally used to sell). Currency crokers charge substantilly mroe for a limit order, and some do not even offer them, because the currency market is so volatile. I have seen it literally swing more than 100 pips in less than a minute. \n \n Assuming online stock services are all about the same, I would go with a limit order on that sale as well, since it won't cost you any extra.", 
   {}, 
   147709, 
   null, 
   1121535840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I need some stock trading help.", 
  "url": "http://www.4forums.com/political/economic-advice/5947-i-need-some-stock-trading-help.html", 
  "breadcrumbs": [
   "Economic Advice"
  ], 
  "id_number": 5947, 
  "discussion_files": [
   [
    "29625.html", 
    "http://www.4forums.com/political/economic-advice/5947-i-need-some-stock-trading-help-print.html"
   ], 
   [
    "29626.html", 
    "http://www.4forums.com/political/economic-advice/5947-i-need-some-stock-trading-help-2-print.html"
   ]
  ], 
  "identifier": 5947
 }
]