[
 [
  [
   147481, 
   null, 
   "biccat", 
   "Just saw an interesting article, here's a few excerpts. Seems that the journalist who wrote this didn't have a rosy view of what's going on post-war.\n \n\"It's what our boys have been doing that worries me.\"\n \n The lieutenant has been talking about the traffic in Army property, the leaking of gasoline into the black market . . . even while the fighting was going on, the way the Army kicks the civilians around, the looting.\n\n \nThe lieutenant comes out with his conclusion: \"Two wrongs don't make a right.\" You hear these two phrases again and again in about every bull session on the shop.\n\n \nThe troops returning home are worried. \"We've lost the peace,\" men tell you. \"We can't make it stick.\"\n\n \nFriend and foe alike, look you accusingly in the face and tell you how bitterly they are disappointed in you as an American. They cite the evolution of the word \"liberation.\" . . . Now it stands in the minds of the civilians for one thing, looting.\n\n \nNever has American prestige . . . been lower. People never tire of telling you of the ignorance and rowdy-ism of American troops, of out misunderstanding. . . . producing results opposite to those we planned. \"Have you no statesmen in America?\" they ask.\n\n \ninstead of coming in with a bold plan of relief and reconstruction we came in full of evasions and apologies.\n\n \nThe taste of victory had gone sour in the mouth of every thoughtful American I met. Thoughtful men can't help remembering that this is a period in history when every political crime and every frivolous mistake in statesmanship has been paid for by the death of innocent people.\n\n \nIn America we are still rich, we are still free to move from place to place and to talk to our friends without fear of the secret police. The time has come, for our own future security, to give the best we have to the world instead of the worst.\n\n \nsome also blame America because they expected so much more from her\n\n Quite telling, to be sure. I'm beginning to think this whole war thing was a bad idea.", 
   {
    "post_info": {
     "post_title": "Comments on the war"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1121451840.0
  ], 
  [
   147488, 
   null, 
   "Eddie", 
   "Haha... very funny. An article about americans in post World War II Germany. Was there any point besides trolling?", 
   {}, 
   147481, 
   null, 
   1121453580.0
  ], 
  [
   147491, 
   null, 
   "biccat", 
   "Haha... very funny. An article about americans in post World War II Germany. Was there any point besides trolling?\n\n Trolling? Not really. It's perfectly applicable to today.\n \n I was making a parrallel to the current media's views on the war in Iraq, the views of Americans at home, and how we are perceived by the people in the country (at least according to the media).\n \n A follow-up to this would be evidence of how successful Europe was (economically) following reconstruction, how democratic governments were established, and how easily Europeans forget.\n \n Another correlary to this would be finding pro-Nazi propaganda from the US and Europe and comparing it to modern terrorist sympathizers. From anti-semitism to appeasement and isolationism, the modern anti-war crowd has surely taken its lessons from history.", 
   {}, 
   147488, 
   null, 
   1121454000.0
  ], 
  [
   147494, 
   null, 
   "Eddie", 
   "Trolling? Not really. It's perfectly applicable to today.\n\n \n And yet you failed to mention that the article was from 1947 (or something like that) in your initial post in an attempt to get a certain reaction. Trolling might have been the wrong term. Dishonest and baiting would perhaps be more suitable.\n \n \n \nI was making a parrallel to the current media's views on the war in Iraq, the views of Americans at home, and how we are perceived by the people in the country (at least according to the media).\n\n \n That`s fine. But at least explain why you think there is a parallel and that this is the topic of debate in this partidcular thread.\n \n \nTrolling? Not really. It's perfectly applicable to A follow-up to this would be evidence of how successful Europe was (economically) following reconstruction, \n\n \n You plan on dishing out something in the line with the marshal help again? Boy, that is going to cost you. And this time, there are no obvious economic or political benefits for doing so...\n \n \nTrolling how democratic governments were established\n\n \n You mean re-established. This was Europe. Not Japan.\n \n \n and how easily Europeans forget.\n \n\n \n Forget what?\n \n \nAnother correlary to this would be finding pro-Nazi propaganda from the US and Europe and comparing it to modern terrorist sympathizers. \n\n \n That seems weird. Is there any such parallel?\n \n \nFrom anti-semitism to appeasement and isolationism, the modern anti-war crowd has surely taken its lessons from history.\n\n \n Hmmm... I can think of a few times when appeasment has wroked wonders and I can think of a few time when anti-war crowds have kept nations from going to war. History is full of events and learning from it is certainly an art.... Anti-semitism is on the other hand always ugly. Just like xeno-phobia, islamo-phobia and anti-muslimism (if there is such a word).", 
   {}, 
   147491, 
   null, 
   1121454840.0
  ], 
  [
   147498, 
   null, 
   "georged", 
   "\n A follow-up to this would be evidence of how successful Europe was (economically) following reconstruction, how democratic governments were established, and how easily Europeans forget.\n \n\n \n Do you have any comprehension of how and why the Marshall Plan (reconstruction) was developed? Or who was by far the largest beneficiary? Or is this one of your apples to oranges comparisons in an attempt to justify our actions in Iraq?", 
   {}, 
   147491, 
   null, 
   1121455680.0
  ], 
  [
   147502, 
   null, 
   "biccat", 
   "And yet you failed to mention that the article was from 1947 (or something like that) in your initial post in an attempt to get a certain reaction. Trolling might have been the wrong term. Dishonest and baiting would perhaps be more suitable.\n\n Mentioning the source would have made people miss the message. The first impact I intended was that people would react to the words, not try to put them in a seperate context.\n \n \nThat`s fine. But at least explain why you think there is a parallel and that this is the topic of debate in this partidcular thread.\n\n The parallel is inherent in the comments themselves. Do I really need to provide links to CNN and the BBC to show that journalists oppose American efforts in Iraq?\n \n \nYou plan on dishing out something in the line with the marshal help again? Boy, that is going to cost you. And this time, there are no obvious economic or political benefits for doing so...\n\n No obvious economic or political benefits? How about a democratic nation in the middle east, ruled by neither theocrats nor despots?\n \n \nYou mean re-established. This was Europe. Not Japan.\n\n I suppose if you want to get technical, Hitler's regime was democratic.\n \n However, following WWI, Germany went through a history of revolutions and counter revolutions, never really stabilizing until a heavy handed dictator came into power. Italy was likewise ruled by a dictator, again thanks to post-WWI turmoil.\n \n \nForget what?\n\n The fact that freedom sometimes comes with a price. And the brutality of living under a dictator. And having an insane dictator who kills those near him to protect himself.\n \n \nThat seems weird. Is there any such parallel?\n\n Maybe they have different perspectives (i.e. modern terrorist sympathisers think Hitler was a horrible person), but that doesn't change the fact that they are supporting a philosophy that devalues human life and seeks to take over the world and kill jews.\n \n [QUOTE=Eddie]Hmmm... I can think of a few times when appeasment has wroked wonders and I can think of a few time when anti-war crowds have kept nations from going to war. History is full of events and learning from it is certainly an art.... \n Very true, but there have also been times when war has been beneficial in the long run. The anti-war crowd wasn't going to stop concentration camp, and they weren't going to liberate France.\n \n \nAnti-semitism is on the other hand always ugly. Just like xeno-phobia, islamo-phobia and anti-muslimism (if there is such a word).\n\n I agree. Which is why we should take a hard stance against people who want to \"drive Isreal into the sea\" and those who support the indiscriminate taking of human life.", 
   {}, 
   147494, 
   null, 
   1121456280.0
  ], 
  [
   147549, 
   null, 
   "fracas", 
   "Eddie\n \n don't spoil the game. ;)", 
   {}, 
   147502, 
   null, 
   1121463060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Comments on the war", 
  "url": "http://www.4forums.com/political/government-debates/5956-comments-war.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 5956, 
  "discussion_files": [
   [
    "14769.html", 
    "http://www.4forums.com/political/government-debates/5956-comments-war-print.html"
   ]
  ], 
  "identifier": 5956
 }
]