[
 [
  [
   147642, 
   null, 
   "georged", 
   "This looks like it could be the next special interest bomb for current administration to embrace and fall on: \n \n http://www.usnews.com/usnews/biztech/articles/050715/15commerce.htm?track=rss\n \n If China is reclassified by US treasury as being guilty of currency manipulation and pending tariff legislation then becomes easy to move through both houses, consumers will experience a 27% increase in all goods imported from China. $72.5 billion for 5/05. China has already stated their product margins can absorb the tariff, eliminating potential inefficient US manufacturing (what's left) gains. \n \n That would make interest rates become very interesting to investors and hasten the US public socioeconomic division of have/have not status.\n \n Any opinions on this time bomb?", 
   {
    "post_info": {
     "post_title": "Chinese Yuan (again)"
    }
   }, 
   null, 
   null, 
   1121482440.0
  ], 
  [
   150115, 
   null, 
   "gamehuis", 
   "Well, China has just revalued the Yuan (if only by a mere 2%), so I think that the timer on the bomb has been stopped for now.\n \n But if the bomb does go off, it will have a severe negative impact on the US. The US consumer will just keep buying the stuff regardless of the price hike and this in turn will just keeping the consumer debt going up and up.\n Greenspan knows this and that's why he has made these statements that import tariffs will not help reduce the trade deficit and will only worsen the problem.\n \n And besides, when you look at the trade deficit that the US has with Europe ( $ 100+ billion) it's clear to see that a strong or weak currency has nothing to do with it. The Euro is stronger than the dollar, yet the US still has a massive trade deficit with Europe.\n \n The problem is that the US consumer is spending money it doesn't have and that the US as a whole has forsaken much of its manufacturing capability.", 
   {}, 
   147642, 
   null, 
   1122208740.0
  ], 
  [
   150151, 
   null, 
   "georged", 
   "Well, China has just revalued the Yuan (if only by a mere 2%), so I think that the timer on the bomb has been stopped for now.\n \n But if the bomb does go off, it will have a severe negative impact on the US. The US consumer will just keep buying the stuff regardless of the price hike and this in turn will just keeping the consumer debt going up and up.\n Greenspan knows this and that's why he has made these statements that import tariffs will not help reduce the trade deficit and will only worsen the problem.\n \n And besides, when you look at the trade deficit that the US has with Europe ( $ 100+ billion) it's clear to see that a strong or weak currency has nothing to do with it. The Euro is stronger than the dollar, yet the US still has a massive trade deficit with Europe.\n \n The problem is that the US consumer is spending money it doesn't have and that the US as a whole has forsaken much of its manufacturing capability.\n\n \n The American consumer will take it in the shorts one way or the other. Prices will go up through tariffs or currency revaluation. Most just aren't aware of how diminished our consumer manufacturing actually is, and, as you point out, will keep buying on debt. Without US isolationist tariffs, Chinese manufacturing margins will remain intact and create larger payment imbalance. \n \n I'm curious to know what currencies will be in the Chinese basket. That was a brilliant financial move. It will also make Taiwan, one of the largest single holders of US debt, take a very close look at their reserves.", 
   {}, 
   150115, 
   null, 
   1122221640.0
  ], 
  [
   150166, 
   null, 
   "lord tammerlain", 
   "The American consumer will take it in the shorts one way or the other. Prices will go up through tariffs or currency revaluation. Most just aren't aware of how diminished our consumer manufacturing actually is, and, as you point out, will keep buying on debt. Without US isolationist tariffs, Chinese manufacturing margins will remain intact and create larger payment imbalance. \n \n I'm curious to know what currencies will be in the Chinese basket. That was a brilliant financial move. It will also make Taiwan, one of the largest single holders of US debt, take a very close look at their reserves.\n\n \n \n China has kept the basket quiet, and is very likely to change the basket as required to maintain their targetted value to the USD.\n \n China's domestic economy will benifit quite a bit from this revaluation. Steel, oil, and other raw materials have just become cheaper for China's domestic need. As for China's exports a 2-3% adjustment in the USD-Yuan valuation is not going to effect current companies exporting from China, it may cause other's to choose Vietnam or India, but their currencies I believe have increased in value as well", 
   {}, 
   150151, 
   null, 
   1122227700.0
  ], 
  [
   150169, 
   null, 
   "georged", 
   "As noted, I think it was a brilliant move. And China has stated basket currencies will remain secret.\n \n Considering export/import pipelines run about 3-6-months from order to product delivery, US consumers will receive a holiday shopping season gift of price increases of at least 10%, possibly more, in a time of declining purchasing power. \n \n This lends credence to the old Chinese adage 'Don't wish too hard for something, it may come true and not be what was expected'.", 
   {}, 
   150166, 
   null, 
   1122228480.0
  ], 
  [
   150208, 
   null, 
   "gamehuis", 
   "Asian currencies all went up 2% after the Yuan revaluation. This leads to the situation where the Asian countries don't need to buy dollars as much anymore to keep their respective currencies low and might even lead to them not buying dollars anymore or even dumping them in the near future.\n \n \nThis lends credence to the old Chinese adage 'Don't wish too hard for something, it may come true and not be what was expected'.\n\n How very true indeed.", 
   {}, 
   150169, 
   null, 
   1122238500.0
  ], 
  [
   150341, 
   null, 
   "georged", 
   "Asian currencies all went up 2% after the Yuan revaluation. This leads to the situation where the Asian countries don't need to buy dollars as much anymore to keep their respective currencies low and might even lead to them not buying dollars anymore or even dumping them in the near future.\n \n\n \n Which will push crude oil prices up in line with the benchmark USD devaluation? Treasury interest rates could become interesting. I'm already seeing conventional CD and money market rates on the rise.", 
   {}, 
   150208, 
   null, 
   1122261120.0
  ], 
  [
   150388, 
   null, 
   "gnojek", 
   "This may be a stupid question, but would the increase in tariffs be an incentive for American companies to move out of China and back to the US? Like Nike, or Wal-Mart, companies like that?", 
   {}, 
   150341, 
   null, 
   1122274980.0
  ], 
  [
   150390, 
   null, 
   "gnojek", 
   "This lends credence to the old Chinese adage 'Don't wish too hard for something, it may come true and not be what was expected'.\n\n Funny how similar that is to \"Careful what you wish for...\"\n \n But it's also like an old Yiddish saying:\n \n \"When G-d wants to punish us, he answers our prayers.\"", 
   {}, 
   150169, 
   null, 
   1122275220.0
  ], 
  [
   150447, 
   null, 
   "georged", 
   "This may be a stupid question, but would the increase in tariffs be an incentive for American companies to move out of China and back to the US? Like Nike, or Wal-Mart, companies like that?\n\n \n It isn't a stupid question. For discussion purposes I'll use the furniture industry, one of the primary lobby groups pushing the tariff. A 27% tariff would make the cost of Chinese produced furniture landed in the US approximately equal to US production costs. Before addressing the feasibility of relocating furniture production to the US, keep in mind all furniture imported into the US has now gone up 27% to the consumer, who is also experiencing reduced buying power due to stagnant wages, etc.\n \n Most US (and other foreign companies) manufacturing in China do so on a joint venture basis, 50/50, with the Chinese entity retaining control and all assets should the venture be terminated. To assume a company is servicing only the US (generally not the actuality) and for that company to relocate to another country, and it wouldn't be the US due to our very high labor cost of goods sold and operating costs, they would be required to abandon that capital and furnish new capital for facilities in Vietnam, India, Malaysia or another low production cost country. \n \n The move to tariffs is a US political gambit prompted by party contributors (US manufacturers). The bulk of furniture in the US is purchased from mass merchandisers such as Wal-Mart and those high volume, low quality furniture chains and the furniture rental firms who use full-page ads to offer low prices and easy credit. They'll buy from whomever offers the lowest cost of goods. So we're left with the US consumer paying 27% more for furniture and seeking lower costs. If furniture production (or any other product) is then moved to say Malaysia do we then slap the tariffs on them? And every other country? \n \n Then China and other countries begin placing tariffs on US goods, a trade war, further diminishing our exports which will put our already massive trade imbalance and negative balance of payments in even more trouble. The simplistic explanation of the entire situation is that our high standard of living has made us uncompetitive in global markets. Tariffs will not remedy that circumstance, all they'll do is temporarily crutch inefficient US manufacturing and allow US consumers (briefly) to support overpaid workers in US facilities.", 
   {}, 
   150388, 
   null, 
   1122303480.0
  ], 
  [
   150451, 
   null, 
   "georged", 
   "Funny how similar that is to \"Careful what you wish for...\"\n \n But it's also like an old Yiddish saying:\n \n \"When G-d wants to punish us, he answers our prayers.\"\n\n \n I stand corrected, far more accurate.", 
   {}, 
   150390, 
   null, 
   1122303660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Chinese Yuan (again)", 
  "url": "http://www.4forums.com/political/policy-ideas/5965-chinese-yuan-again.html", 
  "breadcrumbs": [
   "Policy Ideas"
  ], 
  "id_number": 5965, 
  "discussion_files": [
   [
    "26946.html", 
    "http://www.4forums.com/political/policy-ideas/5965-chinese-yuan-again-print.html"
   ]
  ], 
  "identifier": 5965
 }
]