[
 [
  [
   147763, 
   null, 
   "billsco", 
   "I would never have taken into consideration how much more electricity it takes to power a big screen television. According to  this article, big screen televisions can account for as much as 10% of a household's demands. \n \n That doesn't bode well for the environment if big screens continue to become cheaper and more popular, and also larger. \n \n The electrical cost definitely will be a major consideration for me in my future purchases, and one I haven't heard discussed. Really, is a 19\" any less of a viewing experience? Does one get that much more enjoyment by seeing things so large that it offsets both the open and hidden cost?", 
   {
    "post_info": {
     "post_title": "Big Screen Electrical Usage"
    }
   }, 
   null, 
   null, 
   1121530200.0
  ], 
  [
   147787, 
   null, 
   "georged", 
   "I would never have taken into consideration how much more electricity it takes to power a big screen television. According to  this article, big screen televisions can account for as much as 10% of a household's demands. \n \n That doesn't bode well for the environment if big screens continue to become cheaper and more popular, and also larger. \n \n The electrical cost definitely will be a major consideration for me in my future purchases, and one I haven't heard discussed. Really, is a 19\" any less of a viewing experience? Does one get that much more enjoyment by seeing things so large that it offsets both the open and hidden cost?\n\n \n I just went through a process of totaling up our household wattage requirements by item for a back-up generator, an informative exercise. \n \n Depending on the size of a room, viewing distance from eye to screen and audio capability, IMO a larger screen (60+\") offers a far superior viewing/audio experience when compared to 19\" (our PC monitor sizes). The combination of high resolution on a larger scale with surround or near surround sound produces a theater effect that can't be duplicated by a small screen with standard sound.\n \n I'm primarily a reader and not a TV watcher (I don't follow spectator sports), so personally it doesn't make much difference to me. I consider most TV offerings as leaving a lot of surplus mental time and find it difficult to watch/listen to much of anything on TV without a book to absorb that free time but my wive is an avid TV watcher and I bow to her desires for visual entertainment. \n \n Regarding operating cost differences, it comes down to that old adage of getting what one pays for, a purely personal opinion of what one requires. On an environmental basis, I have to admit I don't allow that to influence my personal residence lifestyle. One long-past winter I burned coal in an antique stove and neighbors from a mile away were ready to run me out of town. They were more concerned about black coal dust from my stack than the environmental fact that I was using a cheap, almost endless supply of fuel.", 
   {}, 
   147763, 
   null, 
   1121537100.0
  ], 
  [
   147926, 
   null, 
   "billsco", 
   "Well I just took inventory of the TV shows I've watched this week: I watched Any Griffith Wednesday morning on UPN. Goober went on vacation and let his girlfriend take his job. Wouldn't you know it, she pumped more gas in her shorts than he did wearing his beanie hat. But Andy had the solution. He made her feel bad about not staying home and being a real woman.\n \n That was the extent of my viewing. My wife Joyce enjoys the reality shows but I can happily say I've yet to watch one. \n \n But why dismiss the environmental cost so readily?", 
   {}, 
   147787, 
   null, 
   1121566500.0
  ], 
  [
   148021, 
   null, 
   "georged", 
   "\n \n But why dismiss the environmental cost so readily?\n\n \n That's way down the list on my personal priorities. My primary hobbies are mostly in direct conflict with what would be considered environmental concern, so selfishness would be one definition.", 
   {}, 
   147926, 
   null, 
   1121614320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Big Screen Electrical Usage", 
  "url": "http://www.4forums.com/political/televisions/5969-big-screen-electrical-usage.html", 
  "breadcrumbs": [
   "Televisions"
  ], 
  "id_number": 5969, 
  "discussion_files": [
   [
    "17558.html", 
    "http://www.4forums.com/political/televisions/5969-big-screen-electrical-usage-print.html"
   ]
  ], 
  "identifier": 5969
 }
]