[
 [
  [
   8066, 
   null, 
   "sp00ky", 
   "I hereby invoke my right as a member of a nation that has been, for over 50 years, in an open and honest alliance with America known as the 'special relationship, to make the following statement of protestation of US foreign policy in relation to Saudi Arabia. \n \n The planned withdrawal of the US troops from Saudi Arabia is wrong, and should be being fought against vehmently by the Prime Minister, although for some reason he is not doing so.\n \n Bizarrely, Blair is standing idly by and saying nothing about the US moves to remove troops from Saudi Arabia? He has been accused in the past few years of being Bush's poodle, at times I have felt this might be the case, but I would say his apparent silence on this issue is the best example that shows he is a sycophant to Bush.... 'obsessed with his place in history' comments aside.\n \n Why is this evidence of poodling to Bush? Well, British foreign policy is and always has been about the national interest. We have always been about power over philosophy, and influence over ideology. America has that power. We want to have the influence. The Atlantic Alliance is essential to us maintaning both these things to the maximum possible amount. What has always been key though has been that we _never_ gave unconditional support to the US. Where our interests were common (generally the case for the most part) we supported the US, but when those interests were threatened, we made bloody sure they knew about it, and had no problem condemning them. Previous prime ministers from across the party divide have had no qualms about fighting it out with the Americans when it was in our national interest to do so. \n \n Thatcher was very close to Reagan, but she had no problem condemning outright the US invasion of Grenada, nor did she worry when she lectured George Bush Sr in the run up to the first Gulf War when she said 'this is no time to wobble Mr Bush'. She was also extremely critical of US attempts to put sanctions on British firms that were trading with the Soviet Union during the Cold War. Churchill was vocally opposed to Roosevelt allowing Stalin to occupy Eastern Europe as he did after the war. Harold Wilson refused to send troops to Vietnam. The same is true in reverse for the US relationship with us, take Suez as a prime example. There seems to be no evidence though that Blair has either the will, or balls, to make his voice heard in the Whitehouse on this point about Saudi Arabia. On this he seems unwilling to fight for the national interest at all. Some people may disagree with this assessment of British foreign policy. They may say it's all about believing in 'freedom' and the 'pursuit of liberty', to those people I can only point to the history of British foreign policy has evidence to the contrary.\n \n It seems to me that Blair has been swept away by this rather odious catchphrase labelled anti-americanism. In the same way that valid criticism of Israel is routinely labelled as anti-semetism (an act of intellectual laziness a lot of the time), valid critcism of America is labelled as anti-americanism. Blair's action, or more rightly inaction on the issue of Saudi Arabia and US troops, does seem to support the idea that he has been suckered by this \"if you criticise American foriegn policy then you are all about blind hate\" bollocks. The unique nature of the 'special relationship' has always been that we, that is Britain, have been above such charges, our relationship has been based not on blind servility, but mutual respect that we each have differing national interests and are not afraid to protest as loudly as possible when we think either is f*cking the other over in anyway. The Alliance has always been two ways, and Blair appears to be proving the naysayers right by making it entirely one way by not speaking out over Saudi Arabia.\n \n Saudi Arabia is essential, not only to the stability of that region, but also to the national interests of the UK. The UK has close to $50 billion worth of business interests and defence contracts with the House of Saud (this is a matter of public record, and I am pretty sure that the US has a lot of business interests there too equalt too, if not greater than ours). _That_ is the reason we (Britain) were worried about Saddam Hussein, and it always has been. US troops ensured that the House of Saud remained intact and alive and were a bullwark against a possible attack by Iraq. Now some may say 'Saddam is gone, no need for them anymore'. There is one problem with this. Saddam Hussein was not, and is not the only threat to the House of Saud. The internal threat is just as great, if not greater. Those US Troops also ensured against the potentiality for internal revolt. Now some may say 'but the House of Saud is an oppressive regime, it abuses human rights, and is ugly, we should be trying to bring them down!'. A very valid argument, but with one tiny flaw. You let the House of Saud crumble from within and what you will get will be _much_ worse. Saudi Arabia is ripe for am Islamic Revolution, do we really want that? Not only will we lose all those contracts and that vital revenue stream for both the US and UK economies, but we will be setting in place exactly the type of terrorist nation that we don't want. Human Rights are nice, they are a good thing to work for, but Rome was not built in a day. I'd rather have an oppresive regime that can be influenced plus secured interests, than an externally agressive regime and a completely loss of any influence and interests.\n \n Blair should be saying something and he should be saying something _now_. America must _not_ be allowed to withdraw it's forces from Saudi Arabia. It should certainly not be allowed to re-locate them into the newly 'liberated' Iraq. That would simply just shift the problem around in reverse. Iraq would become a bullwark against Saudi and the same XXXX will happen again in a few years time. Additionally, by removing US Troops you are effectively giving a concession to bin Laden. Whether you claim it as a reason or not, he will see it as a triumph over the infedels. This further legitimises the terrorist as a political actor instead of the international criminal that he is, and implies that 'terrorism can work'. If you want to be tough on terrorism, then you must not allow them to become legitimate political actors at such an early juncture. Eventually someone is going to have to talk to them and eventually they will talk, but until that occurs (which is remote in the case of islamic fundamentalism) you treat them as crminals and do not give them the satisfaction of believing they have scored a victory of any kind.\n \n The removal of US troops from Saudi Arabia is a bad idea. Its a bad idea for the US and it's 'war on terror', and it's certainly a bad idea for the national interest of the UK. Blair however, seems to have missed these points, as has the US.", 
   {
    "post_info": {
     "post_title": "The US must not pull it forces out of Saudi Arabia"
    }
   }, 
   null, 
   null, 
   1052910120.0
  ], 
  [
   8106, 
   null, 
   "DarKnight", 
   "Wow! you had alot to say!\n \n Anyway, even if Blair said something, Bush is still going to do what he wants to do. If I've learnt at least one thing from the US it's that it's very much an independant power.", 
   {}, 
   8066, 
   null, 
   1052997540.0
  ], 
  [
   8116, 
   null, 
   "Broker", 
   "US troops in Saudi Arabia were there for Operation Southern Watch. They were never there to maintain the stability of the Kingdom. \n \n The Saudis can defend themselves, and this move should actually improve things with their people. The Saudis bought a lot of tanks from us and they still have a large army and many followers. \n \n If the United States would assist the standing Saudi government if a revolt occured, thousands would probably flock to Saudi Arabia assist those revolting. And that would be a really bad thing. Middle Eastern news would make it look very bad, and more and more would come.", 
   {}, 
   8066, 
   null, 
   1053040020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The US must not pull it forces out of Saudi Arabia", 
  "url": "http://www.4forums.com/political/current-events-debates/598-us-must-not-pull-forces-out-saudi-arabia.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 598, 
  "discussion_files": [
   [
    "13147.html", 
    "http://www.4forums.com/political/current-events-debates/598-us-must-not-pull-forces-out-saudi-arabia-print.html"
   ]
  ], 
  "identifier": 598
 }
]