[
 [
  [
   148644, 
   null, 
   "georged", 
   "My last one was a new 1990 Honda 350, which did everything I wanted, survived a terrible beating and three years later brought $700 less than I had paid for it. \n \n Over the past three months I've done a lot of research on new ones, including lurking at several ATV forums, and am of the opinion that Honda has dropped behind the technical development curve over the last ten-years. That research has also shown people favor what ever brand they own, much like Ford/Chevy loyalty among vehicle owners, so owner reviews have been informative only to the point of experienced negatives. \n \n I believe several people on the forum, from limited lifestyle descriptions, own them, and thought I'd see if there were any opinions here on my choice of a new ATV. This will primarily be a utility machine; logging, hunting, forest roaming and a few times a year exploring beach dunes. Based on ATV magazine field testing comparisons, forums and specs, I've decided on a Suzuki King Quad. \n \n Comments appreciated.", 
   {
    "post_info": {
     "post_title": "ATVs"
    }
   }, 
   null, 
   null, 
   1121822760.0
  ], 
  [
   148794, 
   null, 
   "billsco", 
   "Honda definitely has not kept up. A friend of mine owns one and says he wanted to put a trailer hitch on, but the dealership wouldn't do it, saying the transmission wouldn't hold up. \n \n How many cc's is the King Quad?", 
   {}, 
   148644, 
   null, 
   1121870040.0
  ], 
  [
   148799, 
   null, 
   "georged", 
   "Honda definitely has not kept up. A friend of mine owns one and says he wanted to put a trailer hitch on, but the dealership wouldn't do it, saying the transmission wouldn't hold up. \n \n How many cc's is the King Quad?\n\n \n 695cc. Specs: http://www.suzukicycles.com/Products/LTA700XK5/Specs/Default.aspx\n \n I tried the link and it shows a server error. Here's another site with specs:\n \n http://www.powersportsnetwork.com/enthusiasts/new_vehicle_detail.asp?VehicleCode=13045", 
   {}, 
   148794, 
   null, 
   1121871540.0
  ], 
  [
   198599, 
   null, 
   "sglaine", 
   "Now heres my ride.\n \n \n \n http://www.keenemotorsports.com/new_vehicle_detail.asp?sid=6270999E-02X2K15K2006J6I45I04JPMQ2051R0&veh=3923&pov=281917", 
   {}, 
   148799, 
   null, 
   1140057960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  ATVs", 
  "url": "http://www.4forums.com/political/technology/6004-atvs.html", 
  "breadcrumbs": [
   "Technology"
  ], 
  "id_number": 6004, 
  "discussion_files": [
   [
    "30041.html", 
    "http://www.4forums.com/political/technology/6004-atvs-print.html"
   ]
  ], 
  "identifier": 6004
 }
]