[
 [
  [
   148665, 
   null, 
   "Steeeeve", 
   "www.foxnews.com\n www.cnn.com\n \n or any news channel..\n \n thoughts?\n \n announcement at 9pm EST", 
   {
    "post_info": {
     "post_title": "John Roberts is Bushs Supreme Court Nominee"
    }
   }, 
   null, 
   null, 
   1121827020.0
  ], 
  [
   148675, 
   null, 
   "gnojek", 
   "It's about time there was a white man on the Supreme Court! \n Hear Hear!! emoticon_rolleyes", 
   {}, 
   148665, 
   null, 
   1121828040.0
  ], 
  [
   148680, 
   null, 
   "Steeeeve", 
   "we could spray paint him blue and have the first blue man on the Supreme Court", 
   {}, 
   148675, 
   null, 
   1121829060.0
  ], 
  [
   148690, 
   null, 
   "jitobear", 
   "It's about time there was a white man on the Supreme Court! \n Hear Hear!! emoticon_rolleyes\n\n \n lol emoticon_xclown", 
   {}, 
   148675, 
   null, 
   1121832180.0
  ], 
  [
   148725, 
   null, 
   "Steeeeve", 
   "It appears the democrats missed it again..\n \n \nNow that he is nominated for a position where he can overturn precedent and make law...\n\n \n \nThis, the Supreme Court, is far different than the court of appeals. The Supreme Court makes law. We hope they do it by interpreting precedent and following the legislature.\n \n But they make law.\n \n\n http://www.foxnews.com/story/0,2933,163037,00.html\n \n Doesn't Schumer realize that the justices aren't supposed to make law? (note: read the article for context)", 
   {}, 
   148690, 
   null, 
   1121837580.0
  ], 
  [
   148751, 
   null, 
   "Ghost", 
   "I haven't had much time to read up on him yet, but I feel sorry for him. Everybody has been predicting this confirmation process is going to be a hellstorm, and if it is, it's gonna be directed straight at him.\n \n And the Supreme Court doesn't make law, despite what the oh-so-wise Schumer says. They're the judiciary, supposed to rule on the constitutionality of laws. They can overturn laws by declaring them unconstitutional, but they cannot make laws.", 
   {}, 
   148725, 
   null, 
   1121845440.0
  ], 
  [
   148782, 
   null, 
   "biccat", 
   "Doesn't Schumer realize that the justices aren't supposed to make law? (note: read the article for context)\n\n Not exactly true. The court does make law, but only through judicial precedent. It's complex.\n \n BTW, don't you know that posting articles from FoxNews instantly means you're a bigot and brainless?", 
   {}, 
   148725, 
   null, 
   1121867040.0
  ], 
  [
   148786, 
   null, 
   "Steeeeve", 
   "Not exactly true. The court does make law, but only through judicial precedent. It's complex.\n \n BTW, don't you know that posting articles from FoxNews instantly means you're a bigot and brainless?\n\n Are you calling me a bigot and brainless? It is a transcript from Fox News. The only blantent biased news network is CBS.\n \n Last time I checked they interpret law through judicial precedent. This is problem...Congress makes law. The judges just apply it to cases. Not that complex.", 
   {}, 
   148782, 
   null, 
   1121867760.0
  ], 
  [
   148789, 
   null, 
   "biccat", 
   "Are you calling me a bigot and brainless? It is a transcript from Fox News. The only blantent biased news network is CBS.\n\n No, some people think that Fox News is obviously biased and part of the vast right-wing conspiracy. Therefore, anyone who believes what they produce is either a bigot or stupid.\n \n \nLast time I checked they interpret law through judicial precedent. This is problem...Congress makes law. The judges just apply it to cases. Not that complex.\n\n Here's how it is. There are two parts to our law, common law (established by published judicial opinions) and statutory law. Congress and the various legislatures pass statutory law (which is often a codification of common law), which is then interpreted by the judges. However, law is also created by the courts.\n \n One example of this is libel by the press. The first amendment guarantees a free press; but federal law punishes libel. The Supreme Court had to rectify these two conflicting issues, so they created a standard (actual malice), completely outside of the laws themselves. There are actually two standards: one for public individuals, recognizing the right of the press to criticize people in the public eye, and one for private individuals, recognizing the rights of a private individual to protect themselves against libel.\n \n Again, none of this is in any statute, but it's sound law.", 
   {}, 
   148786, 
   null, 
   1121868180.0
  ], 
  [
   148795, 
   null, 
   "Steeeeve", 
   "No, some people think that Fox News is obviously biased and part of the vast right-wing conspiracy. Therefore, anyone who believes what they produce is either a bigot or stupid.\n I guess people can believe what they want. It is always fun to follow Howard Deans says blindly.\n \n As to your second part. Common law is from England and just means law that is unwritten but from is custom from the past (in general). A judge does not make this law because it really isn't law at all. Your example of the constitution doesn't really apply. Libel is a statue that was understood to be ok when the 1st amendment was written. the understanding of this is \"common law\". \n \n So I wouldn't say judges \"make law\"...as common law is not exactly a law as we know it. Besides, Shumer would still be wrong because they don't make statuory law...except for the abortion case, and property rights case.\n \n Edit: This site explains what I am trying to say better\n \n http://www.lectlaw.com/def/c070.htm\n \n notice the quotes such as 'creates' law\n Edit again: I thought common law was state to state anyway...so a Supreme Court judge wouldn't be \"creating\" that law would he?", 
   {}, 
   148789, 
   null, 
   1121870640.0
  ], 
  [
   148837, 
   null, 
   "biccat", 
   "So I wouldn't say judges \"make law\"...as common law is not exactly a law as we know it. Besides, Shumer would still be wrong because they don't make statuory law...except for the abortion case, and property rights case.\n \n Edit: This site explains what I am trying to say better\n \n http://www.lectlaw.com/def/c070.htm\n \n notice the quotes such as 'creates' law\n Edit again: I thought common law was state to state anyway...so a Supreme Court judge wouldn't be \"creating\" that law would he?\n\n Yes, that site explains what I was saying very well.\n \n I put up something elsewhere about the property law case, it wasn't really creating law as following the prior law (although the prior law was, IMO, unconstitutional).\n \n Also, common law is state to state as well as federal; although there are some areas where federal law spill over (Supreme Court first amendment laws supercede state laws infringing on the first amendment).", 
   {}, 
   148795, 
   null, 
   1121887740.0
  ], 
  [
   148842, 
   null, 
   "Clive14", 
   "No, some people think that Fox News is obviously biased and part of the vast right-wing conspiracy. Therefore, anyone who believes what they produce is either a bigot or stupid.\nYou have almost got it right. Fox News is blatantly right wing biased. There is no \"vast right-wing conspiracy\" to this though, it simply has a right wing bias. I certainly wouldn't go so far as to use \"bigot or stupid\" toward those that watch it, especially those that acknowledge, and like, it's bias position. Those that are oblivious to, or worse simply deny, Fox News it biased deserve a degree of ridicule however.", 
   {}, 
   148789, 
   null, 
   1121889060.0
  ], 
  [
   148862, 
   null, 
   "PoohBear", 
   "While Republicans are praising President Bush's Supreme Court nominee, Judge John G. Roberts Jr. ,most Democrats say they are \"keeping their powder dry\" until Roberts' background is thoroughly investigated. \n \n (foxnews.com)\n \n wow it sounds just like democrats to find somehting wrong with him and then you know whats going to happen next? theyre goin to start protesting and wont shut up until something happens.", 
   {}, 
   148842, 
   null, 
   1121891700.0
  ], 
  [
   148908, 
   null, 
   "gnojek", 
   "we could spray paint him blue and have the first blue man on the Supreme Court\n\n As long as he can do a clever Intel commercial, I'm all for it. emoticon_cool", 
   {}, 
   148680, 
   null, 
   1121898780.0
  ], 
  [
   148916, 
   null, 
   "Pravda", 
   "As I understand the metaphor of \"keeping powder dry\" doesn't that mean withholding judgment until appropriate? \n \n It seems to me that the Democrats, the more cautious ones at least, are waiting until they have investigated John Roberts and found him wanting before they blast him for being an unsuitable candidate and start stonewalling the process.\n \n I think it's commendable for them to ask questions first and shoot later depending on whether they find the candidate suitable. Makes a nice change from the usual knee-jerk politics.", 
   {}, 
   148908, 
   null, 
   1121899680.0
  ], 
  [
   148983, 
   null, 
   "jskufan", 
   "While Republicans are praising President Bush's Supreme Court nominee, Judge John G. Roberts Jr. ,most Democrats say they are \"keeping their powder dry\" until Roberts' background is thoroughly investigated. \n \n (foxnews.com)\n \n wow it sounds just like democrats to find somehting wrong with him and then you know whats going to happen next? theyre goin to start protesting and wont shut up until something happens.\n\n \n What do you expect, everyone should just lay down and rubber stamp anyone the standing President nominates? The system was designed to allow Congress to investigate and approve nominations so we have a checks and balance system set up like we do in every other branch of our government. You'd certainly be looking forward to the process if we had a Democratic President in office now. If his credentials stand up on their own, he'll be nominated, if they don't, he shouldn't be. These people serve for many years so I believe it's imperative that Americans know exactly who they're getting. Afterall, he will be in office long after Bush is gone.", 
   {}, 
   148862, 
   null, 
   1121907480.0
  ], 
  [
   148996, 
   null, 
   "Steeeeve", 
   "Yes, that site explains what I was saying very well.\n \n I put up something elsewhere about the property law case, it wasn't really creating law as following the prior law (although the prior law was, IMO, unconstitutional).\n \n Also, common law is state to state as well as federal; although there are some areas where federal law spill over (Supreme Court first amendment laws supercede state laws infringing on the first amendment).\n\n \n However, justices don't sit down and say \"lets make a law\"..they interpert law. Common law is for more torts and other law suits. for example there is no law saying you have to have a fence around a pool but if a kid jumps in and dies you could be sued for a type of negligance. \n \n I still would say Shumers comment is incorrect.", 
   {}, 
   148837, 
   null, 
   1121908800.0
  ], 
  [
   148997, 
   null, 
   "Steeeeve", 
   "You have almost got it right. Fox News is blatantly right wing biased. There is no \"vast right-wing conspiracy\" to this though, it simply has a right wing bias. I certainly wouldn't go so far as to use \"bigot or stupid\" toward those that watch it, especially those that acknowledge, and like, it's bias position. Those that are oblivious to, or worse simply deny, Fox News it biased deserve a degree of ridicule however.\n\n Ok then, CNN and CBS are biased and are blatantly left wing biased. \n \n You can say whatever you want, good luck proving either one is biased.", 
   {}, 
   148842, 
   null, 
   1121908920.0
  ], 
  [
   149051, 
   null, 
   "OccamsRazor", 
   "\n It seems to me that the Democrats, the more cautious ones at least, are waiting until they have investigated John Roberts and found him wanting before they blast him for being an unsuitable candidate and start stonewalling the process.\n \n I think it's commendable for them to ask questions first and shoot later depending on whether they find the candidate suitable. Makes a nice change from the usual knee-jerk politics.\n\n \n True, it helps to have some facts to back up the accusations of cronyism.\n \n I suppose it comes down to the matter of if this John Roberts chap is indeed the best qualified the potential candiates for this position.", 
   {}, 
   148916, 
   null, 
   1121913120.0
  ], 
  [
   149054, 
   null, 
   "OccamsRazor", 
   "Ok then, CNN and CBS are biased and are blatantly left wing biased. \n\n \n CNN and CBS Left wing? you wouldn't know left wing if it came up and socked you one with rolled up Socialist Worker!", 
   {}, 
   148997, 
   null, 
   1121913240.0
  ], 
  [
   149083, 
   null, 
   "biccat", 
   "I still would say Shumers comment is incorrect.\n\n Well yeah, but that's because Shumer is a bumbling idiot who has aides put his shoes on in the morning. And they've got Velcro straps. emoticon_smile \n \n I agree that the Senate shouldn't \"rubber-stamp\" Bush's nominees, but also the Republicans have a majority in the Senate, doesn't that mean that they should be allowed to nominate a conservative justice if they desire? Remember, Clinton got Ginsberg and Brenner through the Senate (when the Democrats were still in charge), both being pretty liberal.\n \n I'm not saying that the Republicans acted like angels, but they didn't use their minority position to try to exert control over the Senate, despite the fact that Clinton was nominating pretty liberal judges.", 
   {}, 
   148996, 
   null, 
   1121914560.0
  ], 
  [
   149123, 
   null, 
   "zachvac", 
   "While Republicans are praising President Bush's Supreme Court nominee, Judge John G. Roberts Jr. ,most Democrats say they are \"keeping their powder dry\" until Roberts' background is thoroughly investigated. \n \n (foxnews.com)\n \n wow it sounds just like democrats to find somehting wrong with him and then you know whats going to happen next? theyre goin to start protesting and wont shut up until something happens.\n\n \n I would guess that fox news doesn't give a citation on anyone who said they are \"keeping their powder dry\" and that this is just an example of bias by a news network.", 
   {}, 
   148862, 
   null, 
   1121924400.0
  ], 
  [
   149125, 
   null, 
   "zachvac", 
   "Ok then, CNN and CBS are biased and are blatantly left wing biased. \n \n You can say whatever you want, good luck proving either one is biased.\n\n \n I will prove that fox is biased, I have no doube CBS and CNN are biased, pretty much everything is biased. Most people I've talked to have said that PBS has the least bias and is always pretty balanced.\n \n I proved in my last post fox is biased, unless they can prove that \"most democrats\" said that they were \"keeping their powder dry\" then this is a biased statement.", 
   {}, 
   148997, 
   null, 
   1121924580.0
  ], 
  [
   149127, 
   null, 
   "Steeeeve", 
   "Well yeah, but that's because Shumer is a bumbling idiot who has aides put his shoes on in the morning. And they've got Velcro straps. emoticon_smile \n \n I agree that the Senate shouldn't \"rubber-stamp\" Bush's nominees, but also the Republicans have a majority in the Senate, doesn't that mean that they should be allowed to nominate a conservative justice if they desire? Remember, Clinton got Ginsberg and Brenner through the Senate (when the Democrats were still in charge), both being pretty liberal.\n \n I'm not saying that the Republicans acted like angels, but they didn't use their minority position to try to exert control over the Senate, despite the fact that Clinton was nominating pretty liberal judges.\n\n \n I will agree with all of the above.\n \n \n \n \nAs I understand the metaphor of \"keeping powder dry\" doesn't that mean withholding judgment until appropriate? \n \n It seems to me that the Democrats, the more cautious ones at least, are waiting until they have investigated John Roberts and found him wanting before they blast him for being an unsuitable candidate and start stonewalling the process.\n \n I think it's commendable for them to ask questions first and shoot later depending on whether they find the candidate suitable. Makes a nice change from the usual knee-jerk politics.\n\n You do realize he has already been before this committee. Not like they haven't had a chance to do this before.\n \n \nI would guess that fox news doesn't give a citation on anyone who said they are \"keeping their powder dry\" and that this is just an example of bias by a news network\n\n \n\"I will keep my powder dry until the due diligence is completed,\" Feinstein said.\n \n Added Sen. John Corzine, D-N.J.: \"I withhold personal judgment because I want to see how he responds to these questions.\"\n \n Sen. Edward Kennedy said several times Wednesday that he would not prejudge the nominee nor would he decide whether to support or oppose Roberts based on any single issue.\n \n But people need to know \"whether Judge Roberts respects the core value of the Constitution\" and falls within the mainstream, as O'Connor did, said the senior senator from Massachusetts. \"That is the important issue.\"\n \n Others, however, aren't being so congenial.\n \n Sen. Charles Schumer, D-N.Y., a member of the Senate Judiciary Committee who last week laid out a list of questions that a Supreme Court nominee should answer, said that Roberts has an obligation to answer those questions.\n \n \"I hope Judge Roberts, understanding how important this nomination is - particularly when replacing a swing vote on the court - will decide to answer questions about his views,\" Schumer said.\n\n \n This is why you don't listen to hype and actually look into the issue. Otherwise you end up making claims that you can't back up.\n \n To be honest, Fox News has more Conservative reporters, however, they do try and always get one republican and one democratic for each issue. CNN has more liberal reporters but they tend to have less guests. MSNBC is trying to copy FoxNews's format. CBS is probably the only one that is biast in my opinion. The whole thing with Dan Rather really showed that. The other networks just show biased in what they report, not how they report it. Look at CNNs front page for 30 days straight and then look at Fox News front page (internet) for 30 days and you will see what I mean.", 
   {
    "unicode_changes_made": true
   }, 
   149083, 
   null, 
   1121927460.0
  ], 
  [
   149151, 
   null, 
   "Clive14", 
   "Ok then, CNN and CBS are biased and are blatantly left wing biased. \n \n You can say whatever you want, good luck proving either one is biased.\nCNN always struck me as slightly right wing. So given it appears right wing from my left-wing perspective and left wing from your right-wing perspective, I'd say they have being neutral pretty much spot on. Can't comment on CBS as I've never watched it.", 
   {}, 
   148997, 
   null, 
   1121937180.0
  ], 
  [
   149171, 
   null, 
   "Steeeeve", 
   "CNN always struck me as slightly right wing. So given it appears right wing from my left-wing perspective and left wing from your right-wing perspective, I'd say they have being neutral pretty much spot on. Can't comment on CBS as I've never watched it.\n\n they have struck you as right wing emoticon_frazzled Thats pretty liberal mr kennedy", 
   {}, 
   149151, 
   null, 
   1121952420.0
  ], 
  [
   149196, 
   null, 
   "Clive14", 
   "they have struck you as right wing emoticon_frazzled Thats pretty liberal mr kennedy\nThank you. I try my best.", 
   {}, 
   149171, 
   null, 
   1121960160.0
  ], 
  [
   149275, 
   null, 
   "Steeeeve", 
   "Thank you. I try my best.\n\n haha, seriously, I was kinda taken back by you calling them right wing. It is like someone claiminng Osama Bin Laden is a gentle, peaceful man.", 
   {}, 
   149196, 
   null, 
   1121976840.0
  ], 
  [
   149283, 
   null, 
   "Michele", 
   "I'm not saying that the Republicans acted like angels, but they didn't use their minority position to try to exert control over the Senate, despite the fact that Clinton was nominating pretty liberal judges.\n\n \n Maybe not, but they have used it before. Remember Abe Fortas? they filibustered his nomination as Chief Justice.", 
   {}, 
   149275, 
   null, 
   1121977860.0
  ], 
  [
   149290, 
   null, 
   "Clive14", 
   "haha, seriously, I was kinda taken back by you calling them right wing.\nAre you that naive of other political views that you cannot grasp the idea of someone being to the left of CNN? I know you are young, but still. I get taken aback every time I read someone claiming Fox News isn't right wing. It is a matter of perspective: if you are so right wing you see Bush as a political moderate, rather than a rabid neo-facist, then Fox probably does look unbiased and CNN would thus seem left wing. From my perspective of left of centre, the plitical landscape looks very different.\n \n \nIt is like someone claiminng Osama Bin Laden is a gentle, peaceful man.\nNo Steve, it is nothing like claiming that Bin Laden is a gentle, peaceful man, for that would imply that the \"right wing\" were gentle, peaceful people. That would clearly be a fasical claim.", 
   {}, 
   149275, 
   null, 
   1121978640.0
  ], 
  [
   149317, 
   null, 
   "Big_Bear_Scot", 
   "I agree with Clive, CNN does seem a bit right wing to me. In fact Ted Kennedy seems a bit right wing to me.\n \n \n @Steeeeve\n Can I ask you does the left in America advocate the Nationalisation of the means of production ?\n \n Does the left in America advocate the abolition of private property ?\n \n American main stream politics seems to have been skewed to the right, I think it is because of circumstance in its History such as the Red Scare and McCarthy Witch Hunts.", 
   {}, 
   149290, 
   null, 
   1121985000.0
  ], 
  [
   149512, 
   null, 
   "biccat", 
   "Does the left in America advocate the abolition of private property ?\n\n Look at the judges who supported the decision in Kelo v. City of New London.", 
   {}, 
   149317, 
   null, 
   1122039660.0
  ], 
  [
   149514, 
   null, 
   "Clive14", 
   "Look at the judges who supported the decision in Kelo v. City of New London.\nYou do not appear to have answered the question. I assume it is such an alien concept to a right wing American that you simply didn't understand the question. \n \n Big_Bear_Scot was asking whether the left in the USA advocates removing property from private hands and putting it in public hands (ie the banning of private ownership with the people collectively owning everything), not the forced transfer of property from one private party to another (a wholely different concept).", 
   {}, 
   149512, 
   null, 
   1122040920.0
  ], 
  [
   149518, 
   null, 
   "biccat", 
   "Thanks for the lack of confidence.\n \nnot the forced transfer of property from one private party to another (a wholely different concept).\n\n forced transfer from one individual to another is the same as public control over the land. It's not wholly removing private ownership, but it's removing an important aspect of private ownership: the right to determine how to use land.\n \n A small minority of leftwingers in this country actually advocate removing private property and giving it to the public. Neo-nazis, Stalinists, Communists, and Hillary all have this sort of concept in mind, but they generally keep themselves occupied with other things.", 
   {}, 
   149514, 
   null, 
   1122042000.0
  ], 
  [
   149572, 
   null, 
   "Steeeeve", 
   "Are you that naive of other political views that you cannot grasp the idea of someone being to the left of CNN? I know you are young, but still. I get taken aback every time I read someone claiming Fox News isn't right wing. It is a matter of perspective: if you are so right wing you see Bush as a political moderate, rather than a rabid neo-facist, then Fox probably does look unbiased and CNN would thus seem left wing. From my perspective of left of centre, the plitical landscape looks very different.\n \n No Steve, it is nothing like claiming that Bin Laden is a gentle, peaceful man, for that would imply that the \"right wing\" were gentle, peaceful people. That would clearly be a fasical claim.\n\n \n Way to take a joke and turn into an arguement emoticon_rolleyes \n \n I forget if you are from England or not...however, in the US we have kind of a set \"center\"(in general) and right/left goes from there. So from the so called 'center' CNN would be slight left and Fox News would probably be slight right. I just happen to think that CNN makes it worse because of the whole \"guests\" thing I explained earlier. I'm convinced that the people that crack on Fox News never watch it...but ya never know. I happen to watch CNN, MSNBC, and Fox News..(and sadly CSPAN) fairly equally...with more weight leaning to MSNBC now.", 
   {}, 
   149290, 
   null, 
   1122059700.0
  ], 
  [
   149574, 
   null, 
   "Steeeeve", 
   "I agree with Clive, CNN does seem a bit right wing to me. In fact Ted Kennedy seems a bit right wing to me.\n \n \n @Steeeeve\n Can I ask you does the left in America advocate the Nationalisation of the means of production ?\n \n Does the left in America advocate the abolition of private property ?\n \n American main stream politics seems to have been skewed to the right, I think it is because of circumstance in its History such as the Red Scare and McCarthy Witch Hunts.\n\n \n well your history is incorrect but it probably does have something to do with history..mainly how and why we were founded though (in my opinon)\n \n However, America is skewed the right compared to other countries...thank God for that.", 
   {}, 
   149317, 
   null, 
   1122059880.0
  ], 
  [
   149576, 
   null, 
   "Steeeeve", 
   "You do not appear to have answered the question. I assume it is such an alien concept to a right wing American that you simply didn't understand the question. \n \n Big_Bear_Scot was asking whether the left in the USA advocates removing property from private hands and putting it in public hands (ie the banning of private ownership with the people collectively owning everything), not the forced transfer of property from one private party to another (a wholely different concept).\n\n \n Then yes, we can move property from private hands to build schools and roads which are public.", 
   {}, 
   149514, 
   null, 
   1122059940.0
  ], 
  [
   149634, 
   null, 
   "gnojek", 
   "I happen to watch CNN, MSNBC, and Fox News..(and sadly CSPAN) fairly equally...with more weight leaning to MSNBC now.\n\n What do you have against C-Span?\n \n If anything is non-biased, it's C-Span.\n \n I watch Washington Journal almost every morning while sipping me tea.", 
   {}, 
   149572, 
   null, 
   1122067200.0
  ], 
  [
   149662, 
   null, 
   "Steeeeve", 
   "What do you have against C-Span?\n \n If anything is non-biased, it's C-Span.\n \n I watch Washington Journal almost every morning while sipping me tea.\n I got nothing against C-Span, thats the problem...Most people call it boring and stupid..I sit there and watch monitone guys talk for hours. I like the Court in America series myself. Good stuff.", 
   {}, 
   149634, 
   null, 
   1122070080.0
  ], 
  [
   149738, 
   null, 
   "Big_Bear_Scot", 
   "\n well your history is incorrect but it probably does have something to do with history..mainly how and why we were founded though (in my opinon)\n \n However, America is skewed the right compared to other countries...thank God for that.\n \n \n Well I am really just thinking back to the end of the 19th century and the start of 20th Century. \n \n Just like most of the World, the US did not really have much in the way of workers rights. Then trade unions where setup and these Unions then campaigned and pushed for workers rights. I am not saying that Unions changed everything there where many Middle Class activists and Factory owners who advocated workers rights.\n \n Also during the great depression FDR introduced the New Deal, which was to totally simplify the description of the New Deal. It was Government Intervention in the market which could be seen as almost Socialist or Social Democratic in nature, in the fact there was increased Central Planning by the Federal Government.\n \n I would also point out to you that some famous singers and activists in the US are seen as very left wing, for example Woody Guthrie was a committed Socialist and his song 'This Land is Your Land' protested against Private Property and Class inequality in 30's America. \n \n It all seemed to change after World War 2, this was really the start of Cold War and the Red scare. This seemed to destroy the left in America, even the New Dealers who I would say where very close to being European Social Democrats moved to right and decided to call themselves Liberals.\n \n I think this shows that there was a 'left' in the US but because of the Cold War and the Red Scare the 'left' in the US was systematically destroyed, that is why it seems to me that American Politics is to the right of Europe.\n \n N.B. I am sorry for the very brief reply, I could expand on the points I have made. If anyone wants to continue the debate or create a new thread on the subject.\n \n \nThen yes, we can move property from private hands to build schools and roads which are public.\n \n \n Who builds the Roads is it the Public or Private Sector ?\n Who maintains and operates the Schools ?", 
   {}, 
   149662, 
   null, 
   1122084900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  John Roberts is Bushs Supreme Court Nominee", 
  "url": "http://www.4forums.com/political/current-events-debates/6007-john-roberts-bushs-supreme-court-nominee.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6007, 
  "discussion_files": [
   [
    "15545.html", 
    "http://www.4forums.com/political/current-events-debates/6007-john-roberts-bushs-supreme-court-nominee-print.html"
   ], 
   [
    "15546.html", 
    "http://www.4forums.com/political/current-events-debates/6007-john-roberts-bushs-supreme-court-nominee-3-print.html"
   ], 
   [
    "15547.html", 
    "http://www.4forums.com/political/current-events-debates/6007-john-roberts-bushs-supreme-court-nominee-2-print.html"
   ]
  ], 
  "identifier": 6007
 }
]