[
 [
  [
   148787, 
   null, 
   "biccat", 
   "Apparantly (according to this article) Washington is one of thirteen states where beasiality isn't a crime.\n \n Oh yeah, and the article is really disturbing. Nothing inappropriate...just disturbing.", 
   {
    "post_info": {
     "post_title": "Criminalize beasiality?"
    }
   }, 
   null, 
   null, 
   1121867760.0
  ], 
  [
   148814, 
   null, 
   "zachvac", 
   "Apparantly (according to this article) Washington is one of thirteen states where beasiality isn't a crime.\n \n Oh yeah, and the article is really disturbing. Nothing inappropriate...just disturbing.\n\n \n Wow, couldn't that be classified as animal cruelty?", 
   {}, 
   148787, 
   null, 
   1121877480.0
  ], 
  [
   148815, 
   null, 
   "deathlord52", 
   "The only lawful sex should be between consenting adult HUMANS. Children and animals should always be protected from the sickos. Neither have the capacity to know what is truly going on.\n \n It's pretty sad when the 'hoggin it' phrase has to be qualified by species.", 
   {}, 
   148787, 
   null, 
   1121877660.0
  ], 
  [
   148817, 
   null, 
   "Adept", 
   "Hey, if people wan't to screw around with animals, then they can knock themselves out, as far as I'm concerned.\n \n I mean, if we can kill 'em and eat 'em, surely it isn't so bad to f**k 'em, right?\n \n However, animal cruelty laws should remain strict.", 
   {}, 
   148815, 
   null, 
   1121878980.0
  ], 
  [
   148818, 
   null, 
   "Symbiote", 
   "The only lawful sex should be between consenting adult HUMANS.\n\n \n How about between dogs and dogs? If dogs are unable to \"consent\" to sex with humans, they are surely also unable to consent to have sex with other dogs. All non-human sex is therefore rape, and should be made illegal.\n \n How about sex between humans and inanimate objects, like rocks? Humans and sponges? Dogs and cats? Horses and rocks? Rats and sponges?\n \n I'm leaning towards; if you own it, you can have sex with it, nowdays.", 
   {}, 
   148817, 
   null, 
   1121879160.0
  ], 
  [
   149157, 
   null, 
   "Iuris", 
   "Far as I'm concerned, let them. I do not recognize animal rights (at least not insofar as \"per se\". If argued by citing consequences to humans, that can become relevant, but again, only because of the consequences to humans), and in a world where we allow killing of animals for food, prohibiting having sex with them due to lack of consent seems ridiculous.\n \n Oterwise, eew. I remember when we were kids, and we managed to get our mitts on a video tape porn collage, including a scene between a man and a sow. Not pretty. But then, to me, neither is transsexual or midget sex, but I'm not going to vote for laws prohibiting transsexuals or midgets from having sex...", 
   {}, 
   148818, 
   null, 
   1121940420.0
  ], 
  [
   149297, 
   null, 
   "snakespit", 
   "If someone requires a law to tell them that banging a german shepard is wrong, then perhaps they are to F'd up to exist in society anyway. These people belong in mental institutions, not jail.", 
   {}, 
   149157, 
   null, 
   1121980140.0
  ], 
  [
   149454, 
   null, 
   "zachvac", 
   "How about between dogs and dogs? If dogs are unable to \"consent\" to sex with humans, they are surely also unable to consent to have sex with other dogs. All non-human sex is therefore rape, and should be made illegal.\n \n How about sex between humans and inanimate objects, like rocks? Humans and sponges? Dogs and cats? Horses and rocks? Rats and sponges?\n \n I'm leaning towards; if you own it, you can have sex with it, nowdays.\n\n \n Well since we let dogs concent to sex with other dogs, that is consent. I'm guessing that humans don't usually ask first. Now if the dog makes the first advance, that makes all the difference :)", 
   {}, 
   148818, 
   null, 
   1122012300.0
  ], 
  [
   150456, 
   null, 
   "Adept", 
   "Now if the dog makes the first advance, that makes all the difference :)\n\n \n :p \n \n Next time a dog tries to hump my leg, it's in for a rude surprise!", 
   {}, 
   149454, 
   null, 
   1122304440.0
  ], 
  [
   171613, 
   null, 
   "butterflygirl", 
   "Hey, if people wan't to screw around with animals, then they can knock themselves out, as far as I'm concerned.\n \n I mean, if we can kill 'em and eat 'em, surely it isn't so bad to f**k 'em, right?\n \n However, animal cruelty laws should remain strict.\n\n \n \n How can animal cruelty laws remain strict if we are allowing people to engage in sexual acts with them? There are men and women on this world for a reason. emoticon_wow Just imagine if having sex with animals was legal and people did it all the time, but one time, one of the animals gets pregnant...gross. probably not possible, but still that's gross.", 
   {}, 
   148817, 
   null, 
   1129564800.0
  ], 
  [
   171642, 
   null, 
   "Adept", 
   "How can animal cruelty laws remain strict if we are allowing people to engage in sexual acts with them?\n\n \n You could say the same about breeding animals for slaughter, for working animals, or just for pets of irresponsible children. So long as the animal isn't being harmed, then go for it. It's extremely wierd, but if no-one is being hurt...\n \n \nJust imagine if having sex with animals was legal and people did it all the time, but one time, one of the animals gets pregnant...gross. probably not possible, but still that's gross.\n\n \n Without major mutations, either deliberate or not, that is impossible.", 
   {}, 
   171613, 
   null, 
   1129570500.0
  ], 
  [
   171653, 
   null, 
   "butterflygirl", 
   "You could say the same about breeding animals for slaughter, for working animals, or just for pets of irresponsible children. So long as the animal isn't being harmed, then go for it. It's extremely wierd, but if no-one is being hurt...\n \n \n \n Without major mutations, either deliberate or not, that is impossible.\n\n \n not really saying that it is possible, just saying think about how weird it would be.", 
   {}, 
   171642, 
   null, 
   1129571760.0
  ], 
  [
   171660, 
   null, 
   "Eddie", 
   "My take on the subject would be that sex with animals should be treated as any other type of behaviour towards animals. It is illegal if you can prove that the animal suffers (ie; it would potentially fall under the law against cruelty towards animals). But that would only apply if you can actually prove that the animal suffers physicly or mentally.", 
   {}, 
   171653, 
   null, 
   1129572900.0
  ], 
  [
   171665, 
   null, 
   "Master_Shake", 
   "If someone requires a law to tell them that banging a german shepard is wrong, then perhaps they are to F'd up to exist in society anyway.\n\n I'm with snakespit on this one. How can we even be debating this? Don't :xcensored animals. Is that so hard?", 
   {}, 
   149297, 
   null, 
   1129573440.0
  ], 
  [
   171671, 
   null, 
   "unkerpaulie", 
   "adept has a point tho. is it really that worse to screw your goat than to decapitate it and eat it (and mayb mount the head on your wall)? i dont think its more cruel. but it is \"abnormal\" by social standards. its funny how people think taboos are linked to mental illnesses", 
   {}, 
   171665, 
   null, 
   1129574100.0
  ], 
  [
   171672, 
   null, 
   "Master_Shake", 
   "adept has a point tho. is it really that worse to screw your goat than to decapitate it and eat it (and mayb mount the head on your wall)? i dont think its more cruel.\n\n Which, to me, does not get me thinking, \"Ok, well :xcensored ing and animal must be okay.\" To me, it then begs the question-Should we then be decapitating it and eating it?\n I'm not a vegeatarian, it just seems to me that it is less logical to justify something that is obviously messed up by saying \"it is no worse to do than something we already do,\" than to say \"Hey, maybe that thing we already do is messed up too.\"", 
   {}, 
   171671, 
   null, 
   1129574760.0
  ], 
  [
   171701, 
   null, 
   "butterflygirl", 
   "Which, to me, does not get me thinking, \"Ok, well :xcensored ing and animal must be okay.\" To me, it then begs the question-Should we then be decapitating it and eating it?\n I'm not a vegeatarian, it just seems to me that it is less logical to justify something that is obviously messed up by saying \"it is no worse to do than something we already do,\" than to say \"Hey, maybe that thing we already do is messed up too.\"\n\n \n if having sex with animals is just \"abnormal\" in our society, will it one day become a \"normal\" thing that people do. Will it be like when people first started coming out of the closet with being gay, it was abnormal to us then but is now socially accepted.\n in 10 or 15 years will it be acceptable for people to marry animals and have relations with them? but then you have 'man who marries cow' and now this man wants to petition that we shouldn't be eating hamburgers anymore because it is immoral to his cow...this is just ridicoulous.", 
   {}, 
   171672, 
   null, 
   1129578480.0
  ], 
  [
   171723, 
   null, 
   "unkerpaulie", 
   "if having sex with animals is just \"abnormal\" in our society, will it one day become a \"normal\" thing that people do. Will it be like when people first started coming out of the closet with being gay, it was abnormal to us then but is now socially accepted.\n in 10 or 15 years will it be acceptable for people to marry animals and have relations with them? but then you have 'man who marries cow' and now this man wants to petition that we shouldn't be eating hamburgers anymore because it is immoral to his cow...this is just ridicoulous.\n\n you never can tell. society is extremely fickle. you wont stop people from eating animals for food. we (meaning people in general) have already established animals as sources of food, so that probably wont change. and since animals are also considered private property. using them for personal pleasure probably cant be checked by the law\n \n if in 13 states bestiality is legal, how is it illegal in the other 37 states?wierd, but what influences what makes something legal or not?", 
   {}, 
   171701, 
   null, 
   1129582080.0
  ], 
  [
   171729, 
   null, 
   "Master_Shake", 
   "since animals are also considered private property. using them for personal pleasure probably cant be checked by the law\n\n Actually, it can. That was already established earlier when animal cruelty laws were brought up.\n \n \nif in 13 states bestiality is legal, how is it illegal in the other 37 states?\n\n I find this an odd question, but, to state the obvious, because states have decided these things on their own.", 
   {}, 
   171723, 
   null, 
   1129582680.0
  ], 
  [
   171730, 
   null, 
   "unkerpaulie", 
   "Which, to me, does not get me thinking, \"Ok, well :xcensored ing and animal must be okay.\" To me, it then begs the question-Should we then be decapitating it and eating it?\n I'm not a vegeatarian, it just seems to me that it is less logical to justify something that is obviously messed up by saying \"it is no worse to do than something we already do,\" than to say \"Hey, maybe that thing we already do is messed up too.\"\n\n animal flesh is a rich source of nutrients that we humans need in order to live. eating animals is also an important aspect of the food chain. i dont think thats going to change, and its not going to be made illegal anytime soon. \n \n there are lots of other things that by social standands are \"sick\", but are not illegal, like drinking animal blood. then there are cruel activities done to animals that are not only legal, but state and society endorsed, like using animals for biological tests. theres no real logical formula as to what makes something \"not f**ked up\" in society's eyes. usually the general public just thinks whatever the mass media tells them to think", 
   {}, 
   171672, 
   null, 
   1129582740.0
  ], 
  [
   171731, 
   null, 
   "unkerpaulie", 
   "I find this an odd question, but, to state the obvious, because states have decided these things on their own.\n\n the question really was what influences one state to make an act illegal, but not another state", 
   {}, 
   171729, 
   null, 
   1129582800.0
  ], 
  [
   171749, 
   null, 
   "Master_Shake", 
   "animal flesh is a rich source of nutrients that we humans need in order to live. eating animals is also an important aspect of the food chain. i dont think thats going to change, and its not going to be made illegal anytime soon.\n\n First of all, humans don't need  meat to survive, otherwise their wouldn't be vegetarians :) . Secondly, I didn't say that to get into a debate about eating meat, but to make a point about the logic involved.\n \n \nthere are lots of other things that by social standands are \"sick\", but are not illegal, like drinking animal blood. then there are cruel activities done to animals that are not only legal, but state and society endorsed, like using animals for biological tests. theres no real logical formula as to what makes something \"not f**ked up\" in society's eyes. usually the general public just thinks whatever the mass media tells them to think\n\n I understand your point, but none of those things are a decent argument for bestiality not classifying as animal cruelty or being something that should be legal.", 
   {}, 
   171730, 
   null, 
   1129584180.0
  ], 
  [
   171750, 
   null, 
   "Master_Shake", 
   "the question really was what influences one state to make an act illegal, but not another state\n\n This is more of a political science question than anything else.", 
   {}, 
   171731, 
   null, 
   1129584240.0
  ], 
  [
   171767, 
   null, 
   "butterflygirl", 
   "\n I understand your point, but none of those things are a decent argument for bestiality not classifying as animal cruelty or being something that should be legal.\n\n \n How can anyone possibly think that bestiality is not animal cruelty?? If anyone can explain that to me, please feel free.", 
   {}, 
   171749, 
   null, 
   1129587840.0
  ], 
  [
   171768, 
   null, 
   "Eddie", 
   "How can anyone possibly think that bestiality is not animal cruelty?? If anyone can explain that to me, please feel free.\n\n \n It is not up to the accused to prove his innocent. The contrary must always apply.", 
   {}, 
   171767, 
   null, 
   1129588080.0
  ], 
  [
   171771, 
   null, 
   "butterflygirl", 
   "It is not up to the accused to prove his innocent. The contrary must always apply.\n\n \n for the people who are for bestiality:\n since people should be able to engage in sexual acts with animals, why don't we give rights to these animals? \n \n but how can an animal say that it's rights were violated???\n \n so if the accused doens't have to prove his innocence, the accuser has to prove the accused's guilt. how can (oh lets say a sheep), this sheep tell people that they were violated and raped? it can't. rule of thumb should be... if it can't talk and it can't express itself and it can't engage in human activities, don't f**k it.", 
   {}, 
   171768, 
   null, 
   1129588920.0
  ], 
  [
   171772, 
   null, 
   "Jo Bennett", 
   "The \"interesting\" question here is what constitutes bestiality. For example harvesting sperm for artificial insemination could be considered a sexual act, as could the insemination itself. Where does farming stop and bestiality begin?", 
   {}, 
   171771, 
   null, 
   1129589280.0
  ], 
  [
   171774, 
   null, 
   "Master_Shake", 
   "The \"interesting\" question here is what constitutes bestiality. For example harvesting sperm for artificial insemination could be considered a sexual act, as could the insemination itself. Where does farming stop and bestiality begin?\n\n Bestiality is defined as sexual relations between a human and an animal. Harvesting sperm and artificial insemination do not constitute sexual relations. If you got artificially inseminated, would you be talking about the great time you had last night? :)", 
   {}, 
   171772, 
   null, 
   1129589820.0
  ], 
  [
   171775, 
   null, 
   "Jo Bennett", 
   "No, but neither does a rape victim, which was more the analogy I was making.", 
   {}, 
   171774, 
   null, 
   1129589940.0
  ], 
  [
   171779, 
   null, 
   "Bell", 
   "Found this, taken from Wikipedia's site on \"zoophilia\", interesting:\n \n \nIn the United Kingdom, it is illegal, with section 69 of the Sexual Offences Act 2003 reducing the sentence to a maximum of 2 years imprisonment for human penile penetration of or by an animal. \n \n \n Who's gonna tell?", 
   {}, 
   171772, 
   null, 
   1129591020.0
  ], 
  [
   171790, 
   null, 
   "butterflygirl", 
   "No, but neither does a rape victim, which was more the analogy I was making.\n\n \n Rape has nothing to do with bestiality.\n No raping of a person has nothing to do with bestiality.", 
   {}, 
   171775, 
   null, 
   1129592040.0
  ], 
  [
   171960, 
   null, 
   "Eddie", 
   "for the people who are for bestiality:\n since people should be able to engage in sexual acts with animals, why don't we give rights to these animals? \n \n\n \n As in legal rights? I don`t really think that`s a good idea. How can we excuse eating and killing them for fun then?\n \n \nso if the accused doens't have to prove his innocence, the accuser has to prove the accused's guilt. how can (oh lets say a sheep), this sheep tell people that they were violated and raped? it can't. rule of thumb should be... if it can't talk and it can't express itself and it can't engage in human activities, don't f**k it.\n\n \n But that would apply to any interaction with an animal. If you stumble upon on animal, chances are that it somehow felt \"violated\"... It`s just absurd to apply human notions of personal integrity, sexual identity and feelings of violations on animals. If the animal is hurt physicly or perhasps even has clear behavioural disorders caused by the rape, it can be proved. If not, then no crime.", 
   {}, 
   171771, 
   null, 
   1129639380.0
  ], 
  [
   171972, 
   null, 
   "unkerpaulie", 
   "I understand your point, but none of those things are a decent argument for bestiality not classifying as animal cruelty or being something that should be legal.\n\n thats why i asked the question \"what influences the state to make something illegal?\" barring acts of violence or any other acts that violate another's freedoms, how are laws decided? could it be that a large enough portion of society finds something revulsive enough? could it be that enough people petition against it? could it be that enough people threaten to take vigilante action if it not made illegal? i mean, this is supposed to be a democratic society. how is democracy executed?\n \n my point is that animal cruelty in and of itself does not make something illegal, because there are incidents of animal cruelty that are both legal and state funded, like the biological testing i mentioned. and there are actions that are repulsive to most of society, but are not illegal, perhaps because of the \"if its not hurting anyone\" clause. so why exactly should bestiality be considered as something to be made illegal, if it isnt hurting anybody, and if it isnt nearly as cruel as other things that are legal?", 
   {}, 
   171749, 
   null, 
   1129651020.0
  ], 
  [
   171979, 
   null, 
   "butterflygirl", 
   "As in legal rights? I don`t really think that`s a good idea. How can we excuse eating and killing them for fun then?\n\n \n it's not a good idea to give an animal legal rights, but it might come down to that. if bestality becomes legal everywhere, these people engaging in these acts will want more for their...significant other...it's human nature to want more. soon enough these people will think that all animals deserve rights and maybe killing and eating them for fun will be outlawed. you don't need to eat meat to survive. \n \n \n But that would apply to any interaction with an animal. If you stumble upon on animal, chances are that it somehow felt \"violated\"... It`s just absurd to apply human notions of personal integrity, sexual identity and feelings of violations on animals. If the animal is hurt physicly or perhasps even has clear behavioural disorders caused by the rape, it can be proved. If not, then no crime.\n\n \n how do you know if an animal has a behavorial disorder? it's impossible to tell.\n so to compare bestality to having sexual relations with a baby. the baby can't talk to defend itself or to even speak out about the act that had occured. does that make it right? or are you saying that the only way that rape is a crime is if someone speaks up about it? whose to say that these animals aren't being hurt by these acts?\n \n I'm not a very religious person and by no way to i live word for word by the bible, but in this case i do need to take a verse or two.\n \n Leviticus 18:23\n You shall not have intercourse with any animal to be defiled wit it, nor shall any woman stand before an animal to mate with it; it is a perversion.\n \n Leviticus 20:15\n If there is a man who lies with an animal, he shall surely be put to death; you shall also kill the animal.\n \n Leviticus 20:16 \n If there is a woman who approaches any animal to mate with it, you shall kill the woman and the animal; they shall surely be put to death. Their bloodguiltness us upon them.", 
   {}, 
   171960, 
   null, 
   1129652340.0
  ], 
  [
   171991, 
   null, 
   "unkerpaulie", 
   "it's not a good idea to give an animal legal rights, but it might come down to that. if bestality becomes legal everywhere, these people engaging in these acts will want more for their...significant other...it's human nature to want more. soon enough these people will think that all animals deserve rights and maybe killing and eating them for fun will be outlawed. you don't need to eat meat to survive. \n\n but meat is a source of food, and a rich source or nutrients that are not readily found in a vegetarian diet without suppliments. as far as wanting more for animals that people are having sex with, this is speculation, and not necessarily the case. having sex with an animal does not necessitate an emotional attachment, or the desire for a long term relationship. although the possibility exists, i cant see it being very likely.\n \n \nhow do you know if an animal has a behavorial disorder? it's impossible to tell.\n so to compare bestality to having sexual relations with a baby. the baby can't talk to defend itself or to even speak out about the act that had occured. does that make it right? or are you saying that the only way that rape is a crime is if someone speaks up about it? whose to say that these animals aren't being hurt by these acts?\n\n babies cannot be compared to animals because babies have rights. animals do not. once a baby is born, he/she is recognized by the state as a legal person and the state is obligated to protect that baby from whatever the state deems illegal, including statutory rape.", 
   {}, 
   171979, 
   null, 
   1129653960.0
  ], 
  [
   171992, 
   null, 
   "butterflygirl", 
   "babies cannot be compared to animals because babies have rights. animals do not. once a baby is born, he/she is recognized by the state as a legal person and the state is obligated to protect that baby from whatever the state deems illegal, including statutory rape.\n\n \n the point i was trying to make is if it can't be proven is it still a crime?", 
   {}, 
   171991, 
   null, 
   1129654140.0
  ], 
  [
   171997, 
   null, 
   "unkerpaulie", 
   "the point i was trying to make is if it can't be proven is it still a crime?\n\n the answer is yes", 
   {}, 
   171992, 
   null, 
   1129654800.0
  ], 
  [
   172006, 
   null, 
   "Eddie", 
   "it's not a good idea to give an animal legal rights, but it might come down to that. if bestality becomes legal everywhere, these people engaging in these acts will want more for their...significant other...it's human nature to want more. soon enough these people will think that all animals deserve rights and maybe killing and eating them for fun will be outlawed. you don't need to eat meat to survive. \n\n \n The slipery slope argument is a really bad one. You have been allowed to have sex with rocks and blow-up dolls for ages. And they haven`t got any special rights becasue of this ;). I don`t see the connection really. In that case we should forbid people to have pets at all since this could give rise to a slippery slope towards legal rights for animals...\n \n \nhow do you know if an animal has a behavorial disorder? it's impossible to tell. \n\n \n I honestly don`t kow. Nor do I know wether this should have any bearing on any sentacne. I just threw it in there since I don`t really know how \"cruelty towards animals\" law-type-thingie works...\n \n \n \nso to compare bestality to having sexual relations with a baby. the baby can't talk to defend itself or to even speak out about the act that had occured. does that make it right? or are you saying that the only way that rape is a crime is if someone speaks up about it? whose to say that these animals aren't being hurt by these acts?\n\n \n Can`t compare it to a baby. The day you can kill and eat babies legally, or killing and eating animals is outlawed you might have a point. Until then, it`s just pointless to compare the two.\n \n Oh, and regarding the bible quotes... I don`t take these kind of arguments serious. If you want to explain why you think it`s wrong, then fine. But considering I`m not a christian or believe in any parts of the bible, I doesn`t really affect my oppinion on the subject.", 
   {}, 
   171979, 
   null, 
   1129658100.0
  ], 
  [
   172010, 
   null, 
   "butterflygirl", 
   "The slipery slope argument is a really bad one. You have been allowed to have sex with rocks and blow-up dolls for ages. And they haven`t got any special rights becasue of this ;). I don`t see the connection really. In that case we should forbid people to have pets at all since this could give rise to a slippery slope towards legal rights for animals...\n\n \n \n rocks and blow up dolls are not living, they have no feeling towards anything, so therefore it doesn't matter what you do to it.", 
   {}, 
   172006, 
   null, 
   1129659600.0
  ], 
  [
   172012, 
   null, 
   "Eddie", 
   "rocks and blow up dolls are not living, they have no feeling towards anything, so therefore it doesn't matter what you do to it.\n\n \n It doesn`t really matter anyway. The slippery slope is a bad argument anyway as this would imply that animals and humans shouldn`t be allowed to interact at all...", 
   {}, 
   172010, 
   null, 
   1129660560.0
  ], 
  [
   172014, 
   null, 
   "Bell", 
   "but meat is a source of food, and a rich source or nutrients that are not readily found in a vegetarian diet without suppliments\n\n \n Albeit off the subject, this is not true. Or, you have to define \"suppliments\" [sic]. Every diet needs supplements because they lack some kind of vitamin and/or nutrient. To say that we will always need to eat animals because they are a source of nutrients that are hard to find anywhere else is not true at all. We eat animals because 1. to our seasoned tongues, they taste good and 2. it is a widely accepted practice.\n \n \nit's not a good idea to give an animal legal rights, but it might come down to that. if bestality becomes legal everywhere, these people engaging in these acts will want more for their...significant other...it's human nature to want more. soon enough these people will think that all animals deserve rights and maybe killing and eating them for fun will be outlawed. you don't need to eat meat to survive\n\n \n Why is it not a good idea to give an animal rights? Or can you define for me exactly what you mean by \"legal rights\"? \n \n I think animals do have rights, whether legal, recognized, or otherwise.", 
   {}, 
   171991, 
   null, 
   1129663380.0
  ], 
  [
   172015, 
   null, 
   "Sigma", 
   "rocks and blow up dolls are not living, they have no feeling towards anything, so therefore it doesn't matter what you do to it.\n\n \n Animals are pets, are property, have no rights and are killed and eaten for food and their skin, so therefore it doesn't matter what you do to it.", 
   {}, 
   172010, 
   null, 
   1129664940.0
  ], 
  [
   172022, 
   null, 
   "butterflygirl", 
   "\n Why is it not a good idea to give an animal rights? Or can you define for me exactly what you mean by \"legal rights\"? \n\n \n by legal rights i mean the rights that we as people have. what i was saying if people want to engage with animals the way that people engage with other people, where is it going to stop? are people going to push for rights for these animals that they engage with?\n \n \nI think animals do have rights, whether legal, recognized, or otherwise.\n\n \n and yes i think animals now do have very limited rights, the right to live, the right to eat, the right to reproduce...and that is the way it should be. imagine a world where a dog has a right to marry...\n \n \nAnimals are pets, are property, have no rights and are killed and eaten for food and their skin, so therefore it doesn't matter what you do to it.\n\n \n so what you mean when you say it doesn't matter what you do to animals, then we can torture, starve or beat them?", 
   {}, 
   172014, 
   null, 
   1129667460.0
  ], 
  [
   344510, 
   null, 
   "kiyota", 
   "How can animal cruelty laws remain strict if we are allowing people to engage in sexual acts with them? There are men and women on this world for a reason. emoticon_wow Just imagine if having sex with animals was legal and people did it all the time, but one time, one of the animals gets pregnant...gross. probably not possible, but still that's gross.\n\n \n Do you think before you speak? Apparently not. Animals, other than sheep, can not interbreed with humans. Dogs can not produce offspring with humans, either can cows, horses, pigs, snakes, eels or anything else. Sheep however can. That is the only animal known besides some primates that can produce offspring with humans, though most don't last through gestation. Honestly...think before you speak. As for it being animal cruelty... ask the dog the next time he tries to hump your leg if its cruelty. Most of those animals are more than willing to do what they are doing. I have yet to see a male dog complain about getting a piece of XXX or a stallion or a bull or anything else. I disagree with the snake and eel bit for the simple fact they would get suffocated. \n \n Funny how PETA hasn't made a huge fit about this. Leave them alone. What they do behind closed doors is their own business. What's next? Bitchin about gay guys and lesbians again?\n \n \n \n\n rocks and blow up dolls are not living, they have no feeling towards anything, so therefore it doesn't matter what you do to it.\n\n Again...seriously what do you know about animals? They don't have complex emotions like humans do. Yes they can feel pain, fear and nervousness, but most animals simply act on instinct. They don't rationalize what they are doing, they just do and react.\n \n And seriously how is it rape if the animal is willing mounting the human? If a dog has objection to the whole thing do you honestly think it would just lay back and allow it? No it would bite.", 
   {}, 
   171613, 
   null, 
   1235081820.0
  ], 
  [
   344511, 
   null, 
   "kiyota", 
   "I do not believe Bell meant that they can be starved, tormented or beaten on. There is the Animal Welfare Act to protect them against things like and organization like the SPCA to deal with animal abuse and cruelty. I work for one said agency and I have yet to have to arrest a man or woman for having sex with an animal. -shakes head-\n \n And yes animals do have rights. They have the right for proper living conditions, shelter, good food, clean water, proper housing and treatment.\n \n \nhow do you know if an animal has a behavorial disorder? it's impossible to tell.\n\n It is not impossible to tell if an animal has behavioral disorders. Its called Behaviorism. Behavior disorders such as aggression, fear biting, excessive hyperactivity and a handful of others can be pointed out by a behavioral expert.", 
   {}, 
   172010, 
   null, 
   1235081940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Criminalize beasiality?", 
  "url": "http://www.4forums.com/political/crime-debates/6011-criminalize-beasiality.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 6011, 
  "discussion_files": [
   [
    "24428.html", 
    "http://www.4forums.com/political/crime-debates/6011-criminalize-beasiality-print.html"
   ], 
   [
    "24429.html", 
    "http://www.4forums.com/political/crime-debates/6011-criminalize-beasiality-3-print.html"
   ], 
   [
    "24430.html", 
    "http://www.4forums.com/political/crime-debates/6011-criminalize-beasiality-2-print.html"
   ]
  ], 
  "identifier": 6011
 }
]