[
 [
  [
   149413, 
   null, 
   "DamEtel", 
   "Well ... is He?", 
   {
    "post_info": {
     "post_title": "Is God responsible for spontaneous abortions?"
    }
   }, 
   null, 
   null, 
   1121997300.0
  ], 
  [
   149416, 
   null, 
   "WhiteFalcon", 
   "Thats your personal belief...", 
   {}, 
   149413, 
   null, 
   1121997660.0
  ], 
  [
   149418, 
   null, 
   "DamEtel", 
   "Thats your personal belief...\n\n \n No, it's not.\n \n But the position that God is responsible for spontaneous abortions has indirect support in the Bible.", 
   {}, 
   149416, 
   null, 
   1121998020.0
  ], 
  [
   149535, 
   null, 
   "simone", 
   "Hmmm, is Almighty God the Mover of the Universe or not?", 
   {}, 
   149418, 
   null, 
   1122048060.0
  ], 
  [
   149582, 
   null, 
   "Cush", 
   "Ask a faith based question.. get a faith based answer.\n \n Yes.", 
   {}, 
   149535, 
   null, 
   1122060840.0
  ], 
  [
   149593, 
   null, 
   "Pravda", 
   "The Lord giveth, and the Lord taketh away.", 
   {}, 
   149582, 
   null, 
   1122062100.0
  ], 
  [
   149743, 
   null, 
   "OccamsRazor", 
   "Well ... is He?\n\n \n No.\n \n Dangit, \"No\" is too short to post!", 
   {}, 
   149413, 
   null, 
   1122085500.0
  ], 
  [
   149768, 
   null, 
   "NeoModernist", 
   "Spontaneous abortion are largely due to nonviability of the fetus, usually due to massive genetic abnormality. \n In the theological debate it could equally be interpreted as the Devil's corruption being cleansed by God.\n In the abortion debate it is a poor analogy as these fetus could not ever be an independently functional human life.", 
   {}, 
   149743, 
   null, 
   1122090120.0
  ], 
  [
   149772, 
   null, 
   "DamEtel", 
   "Spontaneous abortion are largely due to nonviability of the fetus, usually due to massive genetic abnormality.\n\n \n Yeah, that's the rational point of view. But what about the religious folk who, when feeling worthless, lift their spirits using logic like, \"I must be valuable, because God made me and God don't make no junk!\". The implication is that God makes ALL humans (either that, or He makes only those that will later become saved, which would indicate that being saved or not is predestined ...bye bye to free will). I guess one could try to say that God was trying to create a human in the womb, but Satan overpowered God's will and killed the fetus. But then God isn't all-powerful. Or, as you say later, that God was creating a human in the womb, but was then forced to clean out Satan's corruption of the fetus: but then that again has God killing the fetus ... after having lost the fight to Satan (who would again appear to be more powerful than God).\n \n Also, the Bible tells us that God oversees whether a woman's womb will bear fruit or not, and that He can make a woman barren at one point in her life and open her womb at another time. The Bible also tells us it is God who forms us in the womb. So God is responsible for which women can and which women can't give birth and He is also responsible for the forming of the human in the womb. Now, with the millions of human embryos that die yearly, isn't God doing an awful lot of killing?\n \n \n **********************************\n First, the Bible tells us that God opens or closes a woman's womb.\n \n \n\"And Isaac intreated the LORD for his wife, because she was barren: and the LORD was intreated of him, and Rebekah his wife conceived.\" (Genesis 25:21) \n\n \n \n\"And when the LORD saw that Leah was hated, he opened her womb: but Rachel was barren.\" (Genesis 29:31) \n\n \n \n\"And God remembered Rachel, and God hearkened to her, and opened her womb. And she conceived, and bare a son; and said, 'God hath taken away my reproach.\" (Genesis 30:22) \n\n \n \n\"So Boaz took Ruth, and she was his wife: and when he went in unto her, the LORD gave her conception, and she bare a son.\" (Ruth 4:13) \n\n \n \nFor the LORD had fast closed up all the wombs of the house of Abimelech, because of Sarah Abraham's wife.\" (Genesis 20:18)\n\n \n \n\"But unto Hannah [Elkanah] gave a worthy portion; for he loved Hannah: but the LORD had shut up her womb.\" (I Samuel 1:5) \n\n \n \n\"There was in the days of Herod, the king of Judaea, a certain priest named Zacharias, of the course of Abia: and his wife was of the daughters of Aaron, and her name was Elisabeth. And they were both righteous before God, walking in all the commandments and ordinances of the Lord blameless. And they had no child, because that Elisabeth was barren, and they both were now well stricken in years. And it came to pass, that while he executed the priest's office before God in the order of his course...there appeared unto him an angel of the Lord standing on the right side of the altar of incense. And when Zacharias saw him, he was troubled, and fear fell upon him. But the angel said unto him, 'Fear not, Zacharias: for thy prayer is heard; and thy wife Elisabeth shall bear thee a son, and thou shalt call his name John.'\" (Luke 1:5-13) \n\n \n \n \n\"And when Rachel saw that she bare Jacob no children, Rachel envied her sister; and said unto Jacob, 'Give me children, or else I die.' And Jacob's anger was kindled against Rachel: and he said, 'Am I in God's stead, who hath withheld from thee the fruit of the womb?'\" (Genesis 30:1, 2) \n\n \n Second, the Bible tells us that it is God who forms us in the womb.\n \n \n\"For you created my inmost being; you knit me together in my mother's womb. I praise you because I am fearfully and wonderfully made; your works are wonderful, I know that full well\" (Psalm 139:13,14) \n\n \n \n\"Did not he who made me in the womb make them? Did not the same one form us both within our mothers?\" (Job 31:15) \n\n \n \n\"Job said, \"Did not he that made me in the womb make him? and did not one fashion us in the womb?\" (Job 31:15) \n\n \n \n\"Before I formed you in the womb I knew you, before you were born I set you apart.\" (Jeremiah 1:5) \n\n \n \n\"Before I formed thee in the belly I knew thee; and before thou camest forth out of the womb I sanctified thee....\" (Jeremiah 1:5) \n\n \n \n\"Thus saith the LORD that made thee, and formed thee from the womb, which will help thee; Fear not, O Jacob, my servant; and thou, Jesurun, whom I have chosen.\" (Isaiah 44:2) \n\n \n \n\"Thus saith the LORD, thy redeemer, and he that formed thee from the womb, I am the LORD that maketh all things; that stretcheth forth the heavens alone; that spreadeth abroad the earth by myself.\" (Isaiah 44:24) \n\n \n \nSolomon said, \"As thou knowest not what is the way of the spirit, nor how the bones do grow in the womb of her that is with child: even so thou knowest not the works of God who maketh all.\" (Ecclesiastes 11:5) \n\n \n \n *********************\n \nIn the abortion debate it is a poor analogy as these fetus could not ever be an independently functional human life.\n\n \n For those people who base their position on abortion on religious/Biblical principles, then the question is quite relevant. If God kills millions of fetuses each year, and everything God does is 100% righteous, then why wouldn't killing fetuses be morally acceptable?", 
   {
    "unicode_changes_made": true
   }, 
   149768, 
   null, 
   1122091800.0
  ], 
  [
   149834, 
   null, 
   "Cush", 
   "Spontaneous abortion are largely due to nonviability of the fetus, usually due to massive genetic abnormality. \n In the theological debate it could equally be interpreted as the Devil's corruption being cleansed by God.\n In the abortion debate it is a poor analogy as these fetus could not ever be an independently functional human life.\n\n \n \n What are you talking about?\n \n The Devil's corruption? Are you for real?\n \n The theological debate would have nothing whatsoever to do with blaming the miscarriage on the Devil.\n \n I'm still in shock that you would think that.", 
   {}, 
   149768, 
   null, 
   1122113100.0
  ], 
  [
   149924, 
   null, 
   "PoohBear", 
   "God is not responsible for anything we do. were responsible for everything our human selves want to do.", 
   {}, 
   149834, 
   null, 
   1122151620.0
  ], 
  [
   149933, 
   null, 
   "DamEtel", 
   "God is not responsible for anything we do. were responsible for everything our human selves want to do.\n\n Do you not know what SPONTANEOUS abortion is? People don't choose to do anything in such a case: it happens without their approval or consent - decisions don't enter into it.", 
   {}, 
   149924, 
   null, 
   1122153540.0
  ], 
  [
   149962, 
   null, 
   "PoohBear", 
   "yah but its still humans doing it right? or is it some robot you call god?", 
   {}, 
   149933, 
   null, 
   1122161520.0
  ], 
  [
   149993, 
   null, 
   "NeoModernist", 
   "What are you talking about?\n \n The Devil's corruption? Are you for real?\n \n The theological debate would have nothing whatsoever to do with blaming the miscarriage on the Devil.\n \n I'm still in shock that you would think that.\n\n It is just as valid as believing God is responsible for spontaneous abortion.", 
   {}, 
   149834, 
   null, 
   1122169260.0
  ], 
  [
   150081, 
   null, 
   "Cush", 
   "It is just as valid as believing God is responsible for spontaneous abortion.\n\n \n Ah, I see. You just pick and choose whatever theology randomly. I mean, why stick to Christianity? Theology is theology right? (rolls eyes).\n \n I just amazed that you used some sort of Wicca theology. Like the following quote that has nothing to do with any theology that I'm used to. i.e \nSpontaneous abortion(s) are ... the Devil's corruption being cleansed by God.\n\n \n By stating that this idea is just as valid as ours.. doesn't make sense. Because you just made yours up. Our idea is part of our faith, globally. If you want to make up fake theology.. that is fine and good, but why stop there? Just make up a fake religion that you are always right.", 
   {}, 
   149993, 
   null, 
   1122189060.0
  ], 
  [
   150082, 
   null, 
   "Cush", 
   "yah but its still humans doing it right? or is it some robot you call god?\n\n \n \n Lost me on this one.", 
   {}, 
   149962, 
   null, 
   1122189180.0
  ], 
  [
   150100, 
   null, 
   "DamEtel", 
   "yah but its still humans doing it right?\n\n \n No, it's not.", 
   {}, 
   149962, 
   null, 
   1122196800.0
  ], 
  [
   150135, 
   null, 
   "NeoModernist", 
   "Ah, I see. You just pick and choose whatever theology randomly. I mean, why stick to Christianity? Theology is theology right? (rolls eyes).\n \n I just amazed that you used some sort of Wicca theology. Like the following quote that has nothing to do with any theology that I'm used to. i.e \n \n By stating that this idea is just as valid as ours.. doesn't make sense. Because you just made yours up. Our idea is part of our faith, globally. If you want to make up fake theology.. that is fine and good, but why stop there? Just make up a fake religion that you are always right.\n\n \n You seem confused.\n When the thread starter suggests that God is responsible for spontaneous abortions, I countered that that assertion is equally valid to an assertion that the Devil is responsible for spontaneous abortion. Both entitites are within the belief of Judeo-Christian-Muslim faith. I have made nothing up.\n \n If the original thread argument is predicated that abortion is wrong and God is responsible for spontaneous occurence, this is the same arguments asking why evil exist when God is omnipotent. This question in no way is capable of disproving the existence of God. This is a faulty argument as it can be countered as a multitude of ways it has always been, one of which is that the Devil is responsible and not God, who is omnipotent but permissive. \n \n If the original thread argument is to assert that abortion is OK because God does it with spontaneous abortion, then it is still a faulty argument as there is no proof that it is God that causes abortion rather than the Devil.\n \n Lets say then that it is not the Devil but God that causes the spontaneous abortion itself. Is this a bad thing? Spontaneous abortion is nothing new and the ideation that the aborted fetus is corrupt dates back long into the judeochristian belief. That we now know that most spontaneous aborted fetus are genetically mutants and rifled congenital abnormalities incompatible with life is a medical fact. If then you are a judeo-christian-muslim, both ideations remain compatible. If you believe in the Dedvil and God, by attributing the Devil to the mutations and abnormalities, then the Devil's corruption is corrected by God through the spontaneous abortion of such a fetus. If you do not believe in the Devil, just God, then still God did a good thing by causing the spontaneous abortion.\n \n All said, the argument of this thread is pathetically weak, whether it is meant to attack God or abortions. It fails to challenge the existence of God or his potency. That spontaneous abortion is not the same as abortion undermine the ideation that elective abortion of a viable fetus is somehow equivalent to spontaneous abortion caused by God.", 
   {}, 
   150081, 
   null, 
   1122215820.0
  ], 
  [
   150164, 
   null, 
   "DamEtel", 
   "If the original thread argument is predicated that abortion is wrong and God is responsible for spontaneous occurence, this is the same arguments asking why evil exist when God is omnipotent. This question in no way is capable of disproving the existence of God.\n\n \n I agree: disproving the existence of a God is not possible.\n \n That is, unless specific, testable claims are made about a God, such as His having created the Earth just 6 to 10 thousand years ago. Since that is a specific claim that can be checked by science, that claim can be falsified. And as all rational people now know, the young-Earth claim is completely false, and so that specific God has been disproved.\n \n As long as the numerous and various other religious groups leave their particular Gods ill defined, then they are safe from having their God refuted. Of course, though, that means that they can't claim their God did this or that verifiable thing in the real world, so their religious positions become more like fantasies and fairy tales than facts about the World.\n \n \nThis is a faulty argument as it can be countered as a multitude of ways it has always been, one of which is that the Devil is responsible and not God, who is omnipotent but permissive.\n\n \n Those generic counters don't necessarily apply here.\n \n I quoted the Bible showing that it is God specifically - not Satan - who determines whether a woman's womb will \"bear fruit\" or not, and also provided passages that show it is God specifically - not Satan - who is responsible for forming humans in the womb. \n \n \n \nIf the original thread argument is to assert that abortion is OK because God does it with spontaneous abortion, then it is still a faulty argument as there is no proof that it is God that causes abortion rather than the Devil.\n\n \n There's the Bible saying that it is God who determines whether a woman's womb will bear fruit or not. The Bible also says that it is God who is responsible for forming the human in the womb.\n \n \nLets say then that it is not the Devil but God that causes the spontaneous abortion itself. Is this a bad thing?\n\n \n God would be KILLLING a human fetus. Gee, isn't there some sort of holy commandment against killing? \n \n \nSpontaneous abortion is nothing new and the ideation that the aborted fetus is corrupt dates back long into the judeochristian belief. That we now know that most spontaneous aborted fetus are genetically mutants and rifled congenital abnormalities incompatible with life is a medical fact.\n\n \n So God decided to let this woman conceive, but while He was forming the human in the womb, God goofed horribly and so decided to get rid of His flawed 'piece of work'? So God's gross incompetence forces Him to kill millions of human fetuses each year. Okay, if you say so.\n \n \n \nIf then you are a judeo-christian-muslim, both ideations remain compatible. If you believe in the Dedvil and God, by attributing the Devil to the mutations and abnormalities, then the Devil's corruption is corrected by God through the spontaneous abortion of such a fetus.\n\n \n Guess Satan is just more powerful than God, since Satan can so easily corrupt God's work and force God to abort His attempt at forming a human in the womb.\n \n \nIf you do not believe in the Devil, just God, then still God did a good thing by causing the spontaneous abortion.\n\n \n Killing is a good thing? So I guess the 10 commandments are wrong, huh. If the 10 commandments don't hold up, well then, maybe we shouldn't believe anything the Bible has to \"teach\" us.", 
   {}, 
   150135, 
   null, 
   1122226920.0
  ], 
  [
   150180, 
   null, 
   "NeoModernist", 
   "God forms the fetus, Satan corrupts it, God cleanse it.\n As it is no longer viable, it cannot be human.\n There is no killing of a human.\n \n There is no evidence God goofed anymore than Satan corrupted.\n That Satan can corrupt God's work is not evidence of greater power for Satan. Afterall, Satan corrupted other angels and man aplenty.\n \n God's commandment is against human killing human.\n Judgement of life and death is not ours to make.\n \n \n DamEtel\n I consider it bad form to cut and quote a sentence apart from the paragraph in which it was placed.", 
   {}, 
   150164, 
   null, 
   1122230340.0
  ], 
  [
   150201, 
   null, 
   "DamEtel", 
   "There is no evidence God goofed anymore than Satan corrupted.\n\n \n Uhm, there is no evidence that God or Satan even exist! You're defending \"fairy tales\"!\n \n I could defend the existence of Santa Claus just as strongly as you can defend the existence of God and Satan. Doesn't make Santa Claus real.\n \n \nThat Satan can corrupt God's work is not evidence of greater power for Satan. Afterall, Satan corrupted other angels and man aplenty.\n\n \n So you're \"proving\" that Satan's power is not stronger than God's by pointing out that Satan actually overrides God's plans many, many more times than what I pointed out? Okay, I'll take you word for it: Satan is MUCH more powerful than God!\n \n [quote=NeoModernist]God's commandment is against human killing human.[/qutoe]\n \n So God's a hypocrit. He's allowed to kill humans, but forbids humans from doing so.\n \n \nJudgement of life and death is not ours to make.\n\n \n Right, it's God's ... and I guess Satan's too. You know, like when Satan convinced the clearly inferior-minded God to allow Satan to kill Job's servants and Job's family! Those were humans that were killed, you know. And why did God allow the slaughtering of so many humans? From what the Bible tells us, God wanted to prove a point to Satan ... basically, God did it on a dare ... essentially, it was God's pride that Satan used against Him.\n \n ***********************************\n \nDamEtel\n I consider it bad form to cut and quote a sentence apart from the paragraph in which it was placed.\n\n \n So what? Do you think that your personal opinion about how I should and should not respond to posts has any bearing on how I will respond? It doesn't.\n \n And, I don't consider it bad form (see below). \n \n And it's done all the time, by a vast number of people. \n \n The only time it is actually \"bad form\" is when one isolates a sentence from other sentences in the paragraph that provide context, and by so doing, misrepresents the isolated sentence. Can you show where I clearly did that?", 
   {}, 
   150180, 
   null, 
   1122233580.0
  ], 
  [
   150204, 
   null, 
   "NeoModernist", 
   "The presenting argument assumes that God exists. And it has made no attempts to suggest or prove otherwise. Nor have you. I merely worked within the context of the presented argument. You seem to have problems with doing similar.\n \n Again, that Satan acts against God is not proof that he is more powerful than God. Nor have I even suggested that Satan's action is outside of God's will.\n \n That the 10 commandments were edicts given to man for his behavior does not bound God to its limitation. That God may appear to slaughter thousands could merely mean they have been accepted to a better place of his choosing and creation.\n \n If you are attempting to disprove God's existence, demonstrate his impotence, or highlight contradictions, you should try again as you are flailing. \n \n \n Re: selective quoting.\n That it is done by lots of people do not make it good form to do so. To use such line of reasoning as a defense demonstrate immaturity.", 
   {}, 
   150201, 
   null, 
   1122235380.0
  ], 
  [
   150499, 
   null, 
   "PoohBear", 
   "No, it's not.\n\n \n then who is doing it!??!! FILL ME IN!", 
   {}, 
   150100, 
   null, 
   1122316920.0
  ], 
  [
   150503, 
   null, 
   "Big Orn", 
   "Because of political and religious ballooning, abortion seems to have grown a beard of thorns, numerous horns, has a red face, and forked tail.\n \n Abortion of a fetus can be as natural (and necessary) as purging one's stomach.", 
   {}, 
   150499, 
   null, 
   1122317640.0
  ], 
  [
   150509, 
   null, 
   "Bell", 
   "Because of political and religious ballooning, abortion seems to have grown a beard of thorns, numerous horns, has a red face, and forked tail.\n \n Abortion of a fetus can be as natural (and necessary) as purging one's stomach.\n\n \n Hold the phone a second. There's nothing natural about abortion. Purging one's uterus with a suction tube is a most unnatural act. Miscarriage is natural, vomiting (without inducement) is natural, but an abortion? Nah. Certainly doesn't feel natural!", 
   {}, 
   150503, 
   null, 
   1122319500.0
  ], 
  [
   150512, 
   null, 
   "Big Orn", 
   "Hold the phone a second. There's nothing natural about abortion. Purging one's uterus with a suction tube is a most unnatural act. Miscarriage is natural, vomiting (without inducement) is natural, but an abortion? Nah. Certainly doesn't feel natural!\n\n Actually, abortion in this topic and miscarriage is the same thing.", 
   {}, 
   150509, 
   null, 
   1122320760.0
  ], 
  [
   150516, 
   null, 
   "Michele", 
   "Hold the phone a second. There's nothing natural about abortion. Purging one's uterus with a suction tube is a most unnatural act. Miscarriage is natural, vomiting (without inducement) is natural, but an abortion? Nah. Certainly doesn't feel natural!\n\n \n Medically and legally, miscarriage is an abortion. Spontaneous abortion.\n \n Even in Catholic hospitals which upset my mother no end. She had several.", 
   {}, 
   150509, 
   null, 
   1122322140.0
  ], 
  [
   150545, 
   null, 
   "Bell", 
   "Actually, abortion in this topic and miscarriage is the same thing.\n\n \n Of course; sorry. I thought for a second you meant that medical abortion was natural. My bad.\n \n \nMedically and legally, miscarriage is an abortion. Spontaneous abortion.\n \n Even in Catholic hospitals which upset my mother no end. She had several.\n\n \n Sucks how they call it abortion which would rightly upset your mum. I think they need to rethink their use of the terminology. No woman who just went through an unintentional miscarriage needs the added grief.", 
   {}, 
   150512, 
   null, 
   1122329040.0
  ], 
  [
   150726, 
   null, 
   "simone", 
   ". . . . Sucks how they call it abortion which would rightly upset your mum. I think they need to rethink their use of the terminology. No woman who just went through an unintentional miscarriage needs the added grief.\nDepends upon how brainwashed one is.", 
   {}, 
   150545, 
   null, 
   1122393600.0
  ], 
  [
   150879, 
   null, 
   "Cush", 
   "God forms the fetus, Satan corrupts it, God cleanse it...\n There is no evidence God goofed anymore than Satan corrupted.\n That Satan can corrupt God's work is not evidence of greater power for Satan. Afterall, Satan corrupted other angels and man aplenty...\n \n\n \n \n I just don't believe that miscarriage is the work of Satan. There is nothing in the Bible that re-enforces that assumption. We all die. And we all die at different times. I don't see anything evil in a miscarriage. It is simply a natural fact of life. This is not saying that it is easy.. we've had four. But theologically granting Satan the power over genetic manipulation is a foreign concept to me, and to most Christians that I have ever known. Actually, you are the first person that I have ever known that has granted Satan that power in your mind.\n \n The type of corruption that Satan is responsible for is lies, deceit, etc. Very few times have I read in the Bible of Satan having a physical allowance in our lives, and usually it is with God's permission.", 
   {}, 
   150180, 
   null, 
   1122421320.0
  ], 
  [
   150910, 
   null, 
   "NeoModernist", 
   "I just don't believe that miscarriage is the work of Satan. There is nothing in the Bible that re-enforces that assumption. We all die. And we all die at different times. I don't see anything evil in a miscarriage. It is simply a natural fact of life. This is not saying that it is easy.. we've had four. But theologically granting Satan the power over genetic manipulation is a foreign concept to me, and to most Christians that I have ever known. Actually, you are the first person that I have ever known that has granted Satan that power in your mind.\n \n The type of corruption that Satan is responsible for is lies, deceit, etc. Very few times have I read in the Bible of Satan having a physical allowance in our lives, and usually it is with God's permission.\n\n You don't have to believe it. \n That miscarriage ala spontaneous abortion is a good thing when you consider spontaneous abortion involves a defective fetus. \n It was a counter argument, no more, no less. I'd take credit for its genesis but I am not responsible for it. Review the history of medieval christianity.", 
   {}, 
   150879, 
   null, 
   1122424140.0
  ], 
  [
   151452, 
   null, 
   "Cush", 
   "You don't have to believe it. \n That miscarriage ala spontaneous abortion is a good thing when you consider spontaneous abortion involves a defective fetus. \n It was a counter argument, no more, no less. I'd take credit for its genesis but I am not responsible for it. Review the history of medieval christianity.\n\n \n \n Yes, I believe that it was probably for the best.\n \n However, I am unfamiliar with this little bit of archaic christianity. Was this a prevalent idea of the past?", 
   {}, 
   150910, 
   null, 
   1122583620.0
  ], 
  [
   154656, 
   null, 
   "jimmyj", 
   "Well ... is He?\n\n \n Sometimes the mother is irresponsible, say she smokes, etc, etc.\n \n But if it is natural then I guess you can say it was God.\n \n It isn't a bad thing if God deems it right.", 
   {
    "unicode_changes_made": true
   }, 
   149413, 
   null, 
   1123874940.0
  ], 
  [
   154672, 
   null, 
   "zachvac", 
   "then who is doing it!??!! FILL ME IN!\n\n \n \n \"A spontaneous abortion is the loss of a fetus during pregnancy due to natural causes.\" It is also called a miscarriage. You probably should have found out what it was before posting that it was bad. A simple google search will do. It just makes you look stupid when you take a stance against something and later ask what it is.", 
   {}, 
   150499, 
   null, 
   1123876560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is God responsible for spontaneous abortions?", 
  "url": "http://www.4forums.com/political/abortion-debates/6028-god-responsible-spontaneous-abortions.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 6028, 
  "discussion_files": [
   [
    "7202.html", 
    "http://www.4forums.com/political/abortion-debates/6028-god-responsible-spontaneous-abortions-print.html"
   ], 
   [
    "7203.html", 
    "http://www.4forums.com/political/abortion-debates/6028-god-responsible-spontaneous-abortions-3-print.html"
   ], 
   [
    "7204.html", 
    "http://www.4forums.com/political/abortion-debates/6028-god-responsible-spontaneous-abortions-2-print.html"
   ]
  ], 
  "identifier": 6028
 }
]