[
 [
  [
   149508, 
   null, 
   "Matthew S", 
   "Yet another glimpse at homophobia. A view of what may come to pass here in the USA if religious fundimentalists continue to gain power.\n \n \n \n http://www.365gay.com/newscon05/07/072105iran.htm", 
   {
    "post_info": {
     "post_title": "Another idiotic country"
    }
   }, 
   null, 
   null, 
   1122038220.0
  ], 
  [
   149513, 
   null, 
   "biccat", 
   "Yet another glimpse at homophobia. A view of what may come to pass here in the USA if islamic religious fundimentalists continue to gain power.\n \n\n Sorry, just a slight correction. Carry on.", 
   {}, 
   149508, 
   null, 
   1122039960.0
  ], 
  [
   149515, 
   null, 
   "Matthew S", 
   "Sorry, just a slight correction. Carry on.\n\n \n \n Religious fundamentalists are religious fundamentalists I see no difference between Islamic or Christian. Many christian fundamentalists are calling for the reinstating sodomy laws.", 
   {}, 
   149513, 
   null, 
   1122041400.0
  ], 
  [
   149516, 
   null, 
   "Clive14", 
   "Sorry, just a slight correction. Carry on.\nA disingenuous correction at that. Both religions have a long history of intolerence expressed in terms of torture and killing and extreme violence conducted in their names. It is fair therefore to extrapolate behaviour seen in the likes of Iran to what could happen in the USA if the Christian fundamentalist power continues to grow there.", 
   {}, 
   149513, 
   null, 
   1122041400.0
  ], 
  [
   149517, 
   null, 
   "Matthew S", 
   "A disingenuous correction at that. Both religions have a long history of intolerence expressed in terms of torture and killing and extreme violence conducted in their names. It is fair therefore to extrapolate behaviour seen in the likes of Iran to what could happen in the USA if the Christian fundamentalist power continues to grow there.\n\n \n \n \n Very good point exactly emoticon_xgood Infact several christian fundamentalists, such as robertson and falwell, are wanting to make the usa a christian nation.", 
   {}, 
   149516, 
   null, 
   1122041700.0
  ], 
  [
   149520, 
   null, 
   "biccat", 
   "A disingenuous correction at that. Both religions have a long history of intolerence expressed in terms of torture and killing and extreme violence conducted in their names. It is fair therefore to extrapolate behaviour seen in the likes of Iran to what could happen in the USA if the Christian fundamentalist power continues to grow there.\n\n The Vatican is a type of \"Christian Theocracy,\" and Israel is mostly run on the basis of Jewish Law. Parts of India are run under Hindu law.\n \n And yet, we don't hear stories about these governments sentencing people to death for homosexuality.\n \n Either way, comparing a hypothetical Christian theocracy (as was clearly the intent of the original post) to a Muslim theocracy is disingenuous itself. The only similarity between the two is the rule of religion. \"Islamic Law\" doesn't follow the Koran directly, much like any Christian government wouldn't follow the Bible exactly.\n \n Extrapolating concepts from radicals such as Falwell and Robertson is speculation, at best.\n \n ---\n I think most of the problem isn't that these countries are run under a theocracy, rather they are third-world countries still struggling with basic human rights. Granted, a third-world Christian nation would probably do something similar.", 
   {}, 
   149516, 
   null, 
   1122042420.0
  ], 
  [
   149537, 
   null, 
   "jyoshu", 
   "Religious fundamentalists are religious fundamentalists I see no difference between Islamic or Christian. Many christian fundamentalists are calling for the reinstating sodomy laws.\n\n \n Maybe I just don't watch the news enough, but I just haven't seen too many Jerry-Falwell-think-alikes walking into crowded marketplaces blowing up themselves along with men, women, and children with body-strapped explosives; nor have I ever heard a fundie sermon calling for extermination if the infidels and a jihad.", 
   {}, 
   149515, 
   null, 
   1122048660.0
  ], 
  [
   149538, 
   null, 
   "joebrummer", 
   "Maybe I just don't watch the news enough, but I just haven't seen too many Jerry-Falwell-think-alikes walking into crowded marketplaces blowing up themselves along with men, women, and children with body-strapped explosives; nor have I ever heard a fundie sermon calling for extermination if the infidels and a jihad.\n\n \n \n That because the American version of such things works on blaming gays and lesbians for such events........", 
   {}, 
   149537, 
   null, 
   1122048840.0
  ], 
  [
   149553, 
   null, 
   "melsucceeds", 
   "That because the American version of such things works on blaming gays and lesbians for such events........\n\n \n \n In American, homosexuals are being mentally and physically exterminated. Some of the Christians in this country definitely behave in a Taliban like manner. Joe, did you hear about the 3-year-old boy who was killed by his father because he thought his son might be gay? The man was a \"christian\" who worshiped the bible. Now, I understand why some people don't believe in a God.", 
   {
    "post_info": {
     "post_title": "True"
    }
   }, 
   149538, 
   null, 
   1122055920.0
  ], 
  [
   149558, 
   null, 
   "joebrummer", 
   "In American, homosexuals are being mentally and physically exterminated. Some of the Christians in this country definitely behave in a Taliban like manner. Joe, did you hear about the 3-year-old boy who was killed by his father because he thought his son might be gay? The man was a \"christian\" who worshiped the bible. Now, I understand why some people don't believe in a God.\n\n \n \n Yes I did hear about that. I also heard about the lesbian couples beaten with a baseball bat in Kansas, I heard about the GOP in Chicago shunning the gay games that will bring 80 million into the city (stupid, really) I heard about Florida last week, were attempts to life the ban on having gay pride event failed. \n \n On the 18th of this month they torched a gay club in Arkansas.....\n \n anyone who doesn't see what is happening day to day with the violience that is excellerated by christian fundementalist almost moralizing such acts or at best helping people to rationalize them is blind. The cop out answer is usually that these acts are not committed by real christians anfd that is not the point, the point is that these people are using the so called christian message to rationalize their actions. Christian fundementalist like focus on the family and Exodus, and NARTH use old misguided studies to demonize gays. When any one group is demonize (by lies I might add) others hear that as a message to use violence and discrimination.\n \n The father of that child may not have killed his son if being gay was not so demonized by religious groups. Pope John Paul went as far as to call gay couples the axis of evil. Can't these people see the consequence of their words?", 
   {}, 
   149553, 
   null, 
   1122057180.0
  ], 
  [
   149569, 
   null, 
   "jyoshu", 
   "That because the American version of such things works on blaming gays and lesbians for such events........\n\n \n Again, where's the valid comparison? There is NO effort afoot among Christians to violently 'take out' gay people. You've been shown this over and over, yet you still insist on making the accusation (with no real evidence). I don't understand why you want you are trying so hard to vilify Christians.", 
   {}, 
   149538, 
   null, 
   1122059280.0
  ], 
  [
   149573, 
   null, 
   "joebrummer", 
   "Again, where's the valid comparison? There is NO effort afoot among Christians to violently 'take out' gay people. You've been shown this over and over, yet you still insist on making the accusation (with no real evidence). I don't understand why you want you are trying so hard to vilify Christians.\n\n \n \n You would understand just fine if you simply put yourself in my shoes. Whatch the tv with my eyes or any other gay person.\n \n Take off your blinders and look at where the majority of animosity towards gays and lesbians stems from. Go visit the website for Focus on the family and look at the amazing amounts of Paul Cameron research posted. I amazed you are so blind.\n \n I also need to point out again to you. I have no issues with Christians, I have a problem with fundementalist christians. Many christians are just fine. I was raised a christians. I just disagree with the misuse of the bible.\n \n I also never said there is a movement or plan by christians to take out the gays, but the christians don't seem to do much to stop the violence either!", 
   {}, 
   149569, 
   null, 
   1122059760.0
  ], 
  [
   149589, 
   null, 
   "jyoshu", 
   "I also never said there is a movement or plan by christians to take out the gays, but the christians don't seem to do much to stop the violence either!\n\n \n What could they do? I've heard numerous examples of Christians who condemn violence against gay people. This isn't a case where they could do anything about it among Christians, mostly because it doesn't happen as a Christian thing at all. Islamic fundamentalism CALLS for violence against people, and it's leaders actively promote, train, and engage in it. But in Christianity there is no movement at all of violence. None. There may be a few nutcases here and there like Fred Phelps (really he's the only one) that say it's fine but he's been condemned by others in Christianity. It's just not going to work to connect violence to Christianity in this day and age, no matter how much you want to do it. It's one thing to have a few cases here and there of violence at the hands of a few people who claim to be religious (most people are religious); it's another thing altogether to have an active system in place to perpetrate violence as in the case of islamic fundamentalism. There is no comparison here. By far most Christian fundamentalists simply disagree with you on gay marriage and view gay behavior as immoral. Violence is a whole other matter altogether, and it's a separate problem that has it's own roots (usually having little to do with religion, actually).", 
   {}, 
   149573, 
   null, 
   1122061440.0
  ], 
  [
   149617, 
   null, 
   "Dzeron", 
   "The Vatican is a type of \"Christian Theocracy,\" and Israel is mostly run on the basis of Jewish Law. Parts of India are run under Hindu law.\n \n And yet, we don't hear stories about these governments sentencing people to death for homosexuality.\n \n Either way, comparing a hypothetical Christian theocracy (as was clearly the intent of the original post) to a Muslim theocracy is disingenuous itself. The only similarity between the two is the rule of religion. \"Islamic Law\" doesn't follow the Koran directly, much like any Christian government wouldn't follow the Bible exactly.\n \n Extrapolating concepts from radicals such as Falwell and Robertson is speculation, at best.\n \n ---\n I think most of the problem isn't that these countries are run under a theocracy, rather they are third-world countries still struggling with basic human rights. Granted, a third-world Christian nation would probably do something similar.\n\n \n Do you want a Christian theocracy? If so, you condone violence in the name of God. Government is violence, you know.", 
   {}, 
   149520, 
   null, 
   1122065640.0
  ], 
  [
   149618, 
   null, 
   "joebrummer", 
   "What could they do? I've heard numerous examples of Christians who condemn violence against gay people. This isn't a case where they could do anything about it among Christians, mostly because it doesn't happen as a Christian thing at all. Islamic fundamentalism CALLS for violence against people, and it's leaders actively promote, train, and engage in it. But in Christianity there is no movement at all of violence. None. There may be a few nutcases here and there like Fred Phelps (really he's the only one) that say it's fine but he's been condemned by others in Christianity. It's just not going to work to connect violence to Christianity in this day and age, no matter how much you want to do it. It's one thing to have a few cases here and there of violence at the hands of a few people who claim to be religious (most people are religious); it's another thing altogether to have an active system in place to perpetrate violence as in the case of islamic fundamentalism. There is no comparison here. By far most Christian fundamentalists simply disagree with you on gay marriage and view gay behavior as immoral. Violence is a whole other matter altogether, and it's a separate problem that has it's own roots (usually having little to do with religion, actually).\n\n \n \n OH dude, take off your blinders really, we are nottalking abut phelps types. Nobody takes him as anything but hs family. We are talking about James dobsen, Fawell, the pope, many small christian churches.\n \n Look at the debate on marriage. Whay do the christians use as fire power but studies by Paul Cameron, who isn't even respected in science. Look at these ex-gay groups and their propaganda about gays and how inaccurate it is. Being gay is NOT a behavior. I don't know how many times I have proven that the thinking on that is illogical and really rather pathetic.\n \n Turn your focus from where you see it, and try to understand how gays see it. You are constantly saying how you don't under stand how gays think (fill in blank) well then take the time to learn and understand it before you critque it. YOu are babbkeing about something you, yourself have already stated you don't understand. If you took the time to understand it, perhaps you would see what your blinders are not alllowing you to see.\n \n we are also not talking about a few cases of violence.......", 
   {}, 
   149589, 
   null, 
   1122065700.0
  ], 
  [
   149624, 
   null, 
   "gnojek", 
   "Maybe I just don't watch the news enough, but I just haven't seen too many Jerry-Falwell-think-alikes walking into crowded marketplaces blowing up themselves along with men, women, and children with body-strapped explosives; nor have I ever heard a fundie sermon calling for extermination if the infidels and a jihad.\n\n Abortion clinic bombings?", 
   {}, 
   149537, 
   null, 
   1122066240.0
  ], 
  [
   149625, 
   null, 
   "joebrummer", 
   "It's one thing to have a few cases here and there of violence at the hands of a few people who claim to be religious \n\n \n \n In the six-year period between 1990 and 1996, the FBI recorded more than 25,000 gay bashing incidents in the U.S., and this number is on the rise\n \n \n \n a few cases?\n WHat planet do you live on?", 
   {}, 
   149618, 
   null, 
   1122066240.0
  ], 
  [
   149628, 
   null, 
   "wsm2506", 
   "In the six-year period between 1990 and 1996, the FBI recorded more than 25,000 gay bashing incidents in the U.S., and this number is on the rise\n \n \n \n a few cases?\n WHat planet do you live on?\n\n \n I would presume that to jyoshu, these are just 25,000 \"isolated incidents\". emoticon_frazzled", 
   {}, 
   149625, 
   null, 
   1122066480.0
  ], 
  [
   149631, 
   null, 
   "joebrummer", 
   "I would presume that to jyoshu, these are just 25,000 \"isolated incidents\". emoticon_frazzled\n\n I think it is profound enough to be my new signature......", 
   {}, 
   149628, 
   null, 
   1122066780.0
  ], 
  [
   149645, 
   null, 
   "jyoshu", 
   "Whay do the christians use as fire power but studies by Paul Cameron, who isn't even respected in science. Look at these ex-gay groups and their propaganda about gays and how inaccurate it is. Being gay is NOT a behavior. I don't know how many times I have proven that the thinking on that is illogical and really rather pathetic.\n\n \n \"Christians\" don't use them. A few Christians like Dobson have at times (who spends most of his efforts on issues not even related to homosexuality such as general parenting issues and healing broken marriages, BTW). These men don't speak for Christianity nor do they represent it as a whole. They are people that teach their views, that's it. You are taking the actions of a few highly visible people and generalizing.\n \n \nIn the six-year period between 1990 and 1996, the FBI recorded more than 25,000 gay bashing incidents in the U.S., and this number is on the rise\n\n \n And what is the nature of many of these gay \"bashing\" incidents? How many were things like a funny look or a comment that could be construed a different way? How many were truly acts of violence?", 
   {}, 
   149618, 
   null, 
   1122068400.0
  ], 
  [
   149661, 
   null, 
   "BobNelson2", 
   "Again, where's the valid comparison? There is NO effort afoot among Christians to violently 'take out' gay people. You've been shown this over and over, yet you still insist on making the accusation (with no real evidence). I don't understand why you want you are trying so hard to vilify Christians.\n\n \n Why do you keep saying this? There are groups of Christian white-supremacists in this country. They call themselves Chrisitian. Their theology, twisted as it is, falls with the range of Christian theology. You don't get to disown them because you don't approve of their views. (In the same sense, you can't disavow gay Christians, either.) They are Christian. \n \n It's interesting to see how you treat the groups differently. With gay Christians, you clearly believe that the groups exist, but you call their theology incorrect. With the extreme right-wing Christians, you refuse to admit they exist.\n \n Odd.", 
   {}, 
   149569, 
   null, 
   1122070020.0
  ], 
  [
   149665, 
   null, 
   "BobNelson2", 
   "The Vatican is a type of \"Christian Theocracy,\" and Israel is mostly run on the basis of Jewish Law. Parts of India are run under Hindu law.\n \n And yet, we don't hear stories about these governments sentencing people to death for homosexuality.\n\n \n ..... anymore.\n \n And due to whose efforts did that stop? What about imprisonment? Lobotomies? Who put an end to that? How long ago????\n \n \n \nEither way, comparing a hypothetical Christian theocracy (as was clearly the intent of the original post) to a Muslim theocracy is disingenuous itself. The only similarity between the two is the rule of religion. \"Islamic Law\" doesn't follow the Koran directly, much like any Christian government wouldn't follow the Bible exactly.\n \n Extrapolating concepts from radicals such as Falwell and Robertson is speculation, at best.\n \n ---\n I think most of the problem isn't that these countries are run under a theocracy, rather they are third-world countries still struggling with basic human rights. Granted, a third-world Christian nation would probably do something similar.\n\n \n First World Christian nations, until very, very recently criminalised homosexual behavior. There are poorer countries that accepted gay people (though many stopped once they were colonized by the West). \n \n The factor that carries the prejudice is not economic, it is religious.", 
   {}, 
   149520, 
   null, 
   1122070260.0
  ], 
  [
   149666, 
   null, 
   "BobNelson2", 
   "\"Christians\" don't use them. A few Christians like Dobson have at times (who spends most of his efforts on issues not even related to homosexuality such as general parenting issues and healing broken marriages, BTW). These men don't speak for Christianity nor do they represent it as a whole. They are people that teach their views, that's it. You are taking the actions of a few highly visible people and generalizing.\n\n \n You contradict yourself within one paragraph! How can you say they're not representative when they purport to be and are taken by this administration as representative????\n \n You could say they are disproportionately representative. Or dishonestly representative. Or incorrectly representative. But they most certainly DO seek to represent Christianity, and most of Christianity isn't very vocal about saying they're wrong.\n \n Except the left side of Christianity. You remember, that's the side you keep dismissing as un-Christian.", 
   {}, 
   149645, 
   null, 
   1122070560.0
  ], 
  [
   149667, 
   null, 
   "BobNelson2", 
   "And what is the nature of many of these gay \"bashing\" incidents? How many were things like a funny look or a comment that could be construed a different way? How many were truly acts of violence?\n\n \n You think the FBI keeps tracks of \"funny looks\"?", 
   {}, 
   149645, 
   null, 
   1122070620.0
  ], 
  [
   149671, 
   null, 
   "joebrummer", 
   "\"Christians\" don't use them. A few Christians like Dobson have at times .....\n \n\n So which is it? \n The fact is that James Dobsen is the head of a bery large chrsitian movement. Along with Exodus, NARTH and the Christian Coalition. Are you trying to say that christians are not responsible for the climate where such vioolence seems justified by the people who commit these acts? Sorry, not buying into it.\n Christians are clealy responsible for the climate that allows these people to feel justified. A small trip to any major christian site and read the page on homoseuxlaity and see that it doesn't aggree with science in the least......instead it is lies, lies and more lis.......\n \n Then try to tell me the christians have no responsiblity in this climate of violence.........\n \n Again I say take off your blinders and take the time to understand the world from a GLBT person's eyes. Your sense of understanding will greatly increase.  \n \n \n The fact of the matter is that researchers in the field of hate crimes clearly tell you that the average gay basher is an average, everyday person. What makes them think their actions are justifed? The climate that has been created by christian groups like Focus on the Family.", 
   {}, 
   149645, 
   null, 
   1122071760.0
  ], 
  [
   149674, 
   null, 
   "joebrummer", 
   "\"Christians\" don't use them. A few Christians like Dobson have at times (who spends most of his efforts on issues not even related to homosexuality such as general parenting issues and healing broken marriages, BTW). These men don't speak for Christianity nor do they represent it as a whole. They are people that teach their views, that's it. You are taking the actions of a few highly visible people and generalizing.\n \n\n \n \n The following is a list of christian groups and they all have anti-gay pages on their sites.........So just a few christians eh jyoshu?\n \n \n \n \n hristian Coalition\n 1-800-325-4746\n http://www.cc.org\n Founded by Pat Robertson after his unsuccessful 1988 Presidential Campaign, the Christian Coalition has become Americas most powerful special interest group. It contributes millions to candidates, and its less than evenhanded voters guides, distributed at friendly churches days before elections have swayed many major races. This is the public (read: mainstream) face of the Radical Right. The CC generally tones its rhetoric and says \"all the right things\" when covered in the media.\n \n Promise Keepers\n 1-800-888-7595\n http://www.promisekeepers.org\n Bill McCartney, former football coach for the University of Colorado founded this men's ministry in 1992. It has grown into an impressive force, and recently brought nearly 1 million men to Washington for a rally. The Promise Keepers eschew harsh rhetoric, and rather call for men to atone for their sins and treat their families well. Additionally, PK has a strong multi-ethnic flavor to it. PK is still a force to be concerned about, because its leader, McCartney, is one of the US's leading homophobes.\n \n Focus on the Family\n 1-719-531-3400\n http://www.fotf.org\n James Dobson's ministry has turned into a business empire which takes in hundreds of millions of dollars a year. Dobson's radio programs and his folksy advice are heard on thousands of radio stations. FOTF is perhaps the most influential but least well known of the radical right groups. Dobson himself is virulently homophobic and has used his large audience as a bully pulpit to pass along his anti-gay views to millions who listen to him for child-rearing and family tips.\n \n Family Research Council\n 1-202-393-2100\n http://www.frc.org\n Led by Gary Bauer, the FRC was a division of Focus on the Family until it split off for tax reasons. Today is is a major think tank and lobbying organization, always ready with an \"expert witness\" for Congressional testimony, or a quick press release condemning an advance in equal rights.\n \n Concerned Women for America\n 1-800-458-8797\n http://www.cwfa.org\n CWA is the nation's largest conservative Christian women's organization with chapters in 50 states. Led by Beverly LaHaye, this group is virulently anti-gay. Its web site features numerous attacks on \"the gay teen suicide myth\" same-sex marriage, and other issues of concern to gays and lesbians.\n \n American Family Association\n 1-601-844-5036\n http://www.afa.net\n Led by Donald Wildmon, the AFA specializes in leading corporate boycotts. The AFA's main interests are fighting pornography, depictions of sexuality, and positive portrayals of gays in art and in the media. They have led the attack on ABC for showing \"Ellen\" as well as any other company which dares acknowledge gay customers, such as American Airlines.\n \n Exodus International (and associates)\n 1-206-784-7799\n http://www.stonewallrevisted.com\n Located ironically enough in very gay-friendly Seattle, Exodus bills itself as the largest \"gay reclamation\" ministry. Exodus promotes the conversion of gay men and lesbians to heterosexuals through therapy and submission to Jesus Christ. Proving that turnabout is fair play, the founders of Exodus have since denounced their creation as a mistake and something which hurts thousands of very vulnerable people.\n \n The National Association for Research and Therapy of Homosexuality\n 1-818-789-4440\n http://www.narth.com\n NARTH is the leading pseudo-scientific group claiming to be able to \"cure\" gays and lesbians. Their mission statement reads: \"A Non-Profit Psychoanalytic, Educational Organization Dedicated to Research, Therapy and Prevention of Homosexuality.\" They are led by disbarred former psychiatrist Charles W. Socarides.\n \n The Eagle Forum\n 1-618-462-5415\n http://www.basenet.net/~eagle/eagle.html\n Founded and led by Phyllis Schlafly, its best known campaign was against the ERA. It is active across a wide variety of conservative causes, including opposition to equal rights for gays.\n \n Traditional Values Coalition\n 1-714-520-0300\n http://www.traditionalvalues.org/\n Lou Sheldon leads this organization. It places opposition to equal rights for gays high on its agenda.\n \n American Center for Law and Justice\n 1-804-579-2489\n http://www.aclj.org/\n The ACLJ is the conservative version of the ACLU. Founded by Pat Robertson, the ACLJ files nuisance suits against gay rights laws, and generally does as much as it can through the legal system to hold up the cause of equal rights. For example, in the Hawaii marriage case, it has files several \"friend of the court\" briefs against same-sex marriages, and has filed suit against San Francisco's gay rights ordinance.\n \n Heritage Foundation\n 1-202-546-4400\n http://www.heritage.org/\n The Heritage Foundation is the right's primary think tank. It boasts an enormous budget, and a ready supply of guest commentators on nearly every issue for America's opinion pages. Opposing equal rights for gays is one topic they are actively promoting.\n \n The Report\n 1-800-462-4700 and 1-800-452-NEWS\n http://www.americansfortruth.com/ plus opposing views at http://qrd.rdrop.com/qrd/religion/anti/the.lambda.report\n Peter LaBarbera leads this small but influential publishing house. They have produced the infamous \"Gay Agenda\" video, and put out a monthly magazine called \"The Lambda Report\" which is singularly vicious in how low it stoops with its attacks. For more on the Lambda Report's tactics, follow the second URL above.\n \n Westboro Baptist Church\n 1-785-273-0325\n http://www.godhatesfags.com and http://revwhite.bestsites.net\n Far from being a real church, Westoboro Baptist is actually a small cult consisting of the extended family of Fred Phelps, and are located in a compound in Topeka, KS. They are perhaps best known for flying around the country picketing the funerals of AIDS victims and gay pride parades holding signs saying \"God Hates Fags\" and other assorted witticisms. While it may be tempting to dismiss Phelps as a buffoon, he actually has considerable influence in the shadowy militia/reconstructionist underground.\n \n Rutherford Institute\n 1-804-978-3888\n http://www.rutherford.org/\n This is the primary institution behind a form of Christianity known as Reconstuctionism. The primary tenet of this faith is a belief that America must be remade as a pure white \"Christian\" nation with old-testament Biblical law as the law of the land. Reconstructionism is very influential amongst the milita movement. John Rushdooney is their patriarch. State-mandated executions of gays is amongst the Biblical law they wish to implement.\n \n Operation Rescue\n 1-407-259-9557\n http://www.operationrescue.org/\n Led by Randall Terry, Operation Rescue is perhaps best known for blockading abortion clinics; however, with the decline of abortion as a major issue, they are branching out into anti-gay activities as well. They advocate the use of force against gays and lesbians, including imprisonment and execution, and have considerable influence amongst the far, far right.\n \n American Life League\n 1-540-659-4171\n http://hebron.ee.gannon.edu/~frezza/plae/contents.html\n Another violent anti-abortion group that has added homosexuality to its list. Follow the link above to visit the Pro Life Encyclopedia, a guide to their complete beliefs system. It contains some very violently anti-gay material.", 
   {}, 
   149645, 
   null, 
   1122072420.0
  ], 
  [
   149676, 
   null, 
   "joebrummer", 
   "jyoshu,\n \n \n Di you still want to hang on to the ideation that christians have no balme to take for the current climate in the USA where gays are harrassed, beaten, fired from jobs, evicted, called the axis of evil by the pope? Really, can you continue with the lies or do you agree a lotof the blame belongs there? Cause I can gather way more than this if you need me to......", 
   {}, 
   149674, 
   null, 
   1122072600.0
  ], 
  [
   149679, 
   null, 
   "wsm2506", 
   "\"Christians\" don't use them. A few Christians like Dobson have at times (who spends most of his efforts on issues not even related to homosexuality such as general parenting issues and healing broken marriages, BTW). These men don't speak for Christianity nor do they represent it as a whole. They are people that teach their views, that's it. You are taking the actions of a few highly visible people and generalizing.\n\n \n It would seem that the media in general takes them as speaking for Christianity. Who made the media splash for claiming Sponge Bob is gay? Who made the media splash for blaming 9/11 on homosexuals? In the mind of the media,the general public, the world at large, and, indeed, these individuals themselves, these people DO represent Christianity! They even CLAIM they do!!!!!!!!!!!!!!!!!!!\n \n Odd, every time Dobson makes a media splash, it isnt about \"general parenting issues and healing broken marriages, BTW\", it is because he is bashing gays!!!!!!!!!!!!!!!!!!!!!!! And he is getting very RICH doing it!!!!!!!!!!!!!!!", 
   {}, 
   149645, 
   null, 
   1122073740.0
  ], 
  [
   149844, 
   null, 
   "Matthew S", 
   "Maybe I just don't watch the news enough, but I just haven't seen too many Jerry-Falwell-think-alikes walking into crowded marketplaces blowing up themselves along with men, women, and children with body-strapped explosives; nor have I ever heard a fundie sermon calling for extermination if the infidels and a jihad.\n\n \n \n Ever heard of Eric Rudolph, Christian terriost\n http://crime.about.com/od/current/a/rudolph.htm", 
   {}, 
   149537, 
   null, 
   1122117060.0
  ], 
  [
   150349, 
   null, 
   "biccat", 
   "Ever heard of Eric Rudolph, Christian terriost\n http://crime.about.com/od/current/a/rudolph.htm\n\n Isn't the US government working on prosecuting this guy?\n \n Enforcing the law and punishing this guy for a terrorist act. Seems like institutionalized right-wing Christian views are strong here...", 
   {}, 
   149844, 
   null, 
   1122263280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Another idiotic country", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6030-another-idiotic-country.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6030, 
  "discussion_files": [
   [
    "31137.html", 
    "http://www.4forums.com/political/gay-rights-debates/6030-another-idiotic-country-print.html"
   ], 
   [
    "31138.html", 
    "http://www.4forums.com/political/gay-rights-debates/6030-another-idiotic-country-2-print.html"
   ]
  ], 
  "identifier": 6030
 }
]