[
 [
  [
   149947, 
   null, 
   "joebrummer", 
   "There is some evidence to suggest (that I agree with) That Fundementalist chrsitians groups like Focus on the Family, Exodus, Christian Calues Coalition.....and others create a climate of violence for gays and lesbians. They do this by demonizing gays as diseased, dirty, immoral, and a danger to children. Do you agree that these groups contribute to the climate where bashing gays is acceptable.", 
   {
    "post_info": {
     "post_title": "Poll on Christian groups and their stance on Gays"
    }
   }, 
   null, 
   null, 
   1122155940.0
  ], 
  [
   149953, 
   null, 
   "Jaaaman", 
   "There is some evidence to suggest (that I agree with) That Fundementalist chrsitians groups like Focus on the Family, Exodus, Christian Calues Coalition.....and others create a climate of violence for gays and lesbians. They do this by demonizing gays as diseased, dirty, immoral, and a danger to children. Do you agree that these groups contribute to the climate where bashing gays is acceptable.\n\n No..... These Christian groups do not advocate violence against gays or lesbians. People do this on their own accord. It's sad, but that is the world we live in.", 
   {}, 
   149947, 
   null, 
   1122156780.0
  ], 
  [
   149956, 
   null, 
   "joebrummer", 
   "No..... These Christian groups do not advocate violence against gays or lesbians. People do this on their own accord. It's sad, but that is the world we live in.\n\n \n \n \n I didn't say they advocate violence. I said the contribute to the climate the makes such acts acceptable.......read first post again.", 
   {}, 
   149953, 
   null, 
   1122158460.0
  ], 
  [
   149977, 
   null, 
   "Jaaaman", 
   "I didn't say they advocate violence. I said the contribute to the climate the makes such acts acceptable.......read first post again.\n\n And violent video games like 'Grand Theft Auto' contribute to the climate to lead teens and young adults to commit theft and murder. Hogwash! emoticon_rolleyes \n Ultimately, we still make the choice to commit crimes of these sorts.", 
   {}, 
   149956, 
   null, 
   1122164880.0
  ], 
  [
   149983, 
   null, 
   "Jaxian", 
   "And violent video games like 'Grand Theft Auto' contribute to the climate to lead teens and young adults to commit theft and murder. Hogwash! emoticon_rolleyes \n Ultimately, we still make the choice to commit crimes of these sorts.\n\n \n Grand Theft Auto does not teach people that people different from themselves are inferior. Grand Theft Auto is a make-believe world where people can pretend to do things they'd never do in real life. That is very different from teaching a religious ideology that certain people are sinners who will face eternal punishment by God. How is any person supposed to respect someone else, when that same someone else would be condemned to suffering for all eternity by the most loving and perfect being in all existence?\n \n Grand Theft Auto doesn't teach that anyone else is inferior to the player. I don't think the analogy presented is appropriate.\n \n Though I do agree that neither Christians nor Christian organizations can be blamed or held responsible for the actions of individual murderers.", 
   {}, 
   149977, 
   null, 
   1122167220.0
  ], 
  [
   150064, 
   null, 
   "Jaaaman", 
   "Grand Theft Auto doesn't teach that anyone else is inferior to the player. I don't think the analogy presented is appropriate.\n \n \nWell, the analogy made by the OP is not appropriate either. I don't give a rats rearend if some 'climate of hate mongering' is produced by denouncing homosexuality and same sex relationships because ultimately the choice is made to commit the wrongs involved in violence against these groups. emoticon_rolleyes", 
   {}, 
   149983, 
   null, 
   1122182100.0
  ], 
  [
   150099, 
   null, 
   "JustineCredible", 
   "So, tell me Jaaaman, are these phrases incoraging and contributing to the \"climate of violence toward gays?\" \n \n SODOMY IS AN ABOMINABLE SIN, WORTHY OF DEATH.\n\n \n \nJESUS CHRIST DIED ONLY FOR THOSE WHO BELIEVE. \n\n \n \nGod Almighty killed Army Sgt. 1st Class Ronald Wood, in shame, and cast him into Hell, there to join his dishonorable soldier pals, ...\n\n \n \nThey turned America over to f*ags: They're coming home in Body Bags!\n \n \n \n Thank God for the bombing of London's subway today - July 7, 2005 - wherein dozens were killed and hundreds injured. Wish it was many more! \n ENGLAND: Island of Sodomite Damned\n \n Tony Blair and his B*itch Barrister Wife\n These two have led England to irreversable doom, pushing the *** agenda. \n\n \n \nGod Hates You!\n\n \nRepent or Parish!\n\n \nF*ag Troops\n\n \nTwo Gay rights: AIDS & HELL\n\n \nThank God for 9/11\n\n \n \n All of these phrases and signs are courtesy Westboro Baptist Church and Fred Phelps!", 
   {}, 
   150064, 
   null, 
   1122196620.0
  ], 
  [
   150123, 
   null, 
   "Jaaaman", 
   "\n All of these phrases and signs are courtesy Westboro Baptist Church and Fred Phelps!\n\n Fred Phelps is an example of extreme religous fundamentalism. He is on par with hate groups such as the kkk and white supremists. You are completely taking this out of context. Somebody going to a typical service in a baptist church is not going to be taught that gays are 'to be killed' or to be 'put to death'. Gays need our love and support, and they need to hear the truth concerning their sexuality and the wrongfulness of their lifestyle choice. Again, I say we need to do this out of love..... that is what Christ taught.", 
   {}, 
   150099, 
   null, 
   1122211620.0
  ], 
  [
   150132, 
   null, 
   "Matthew S", 
   "Fred Phelps is an example of extreme religous fundamentalism. He is on par with hate groups such as the kkk and white supremists. You have completely taking this out of context. Somebody going to a typical service in a baptist church is not going to be taught that gays are 'to be killed' or to be 'put to death'. Gays need our love and support, and they need to hear the truth concerning their sexuality and the wrongfulness of their lifestyle choice. Again, I say we need to do this out of love..... that is what Christ taught.\n\n \n \n I have been to those typical baptist church services and I can tell you they walk the line. The members sit there like sheep waiting to be told what to do. The preachers may not preach violence but I can see they imply violence. By saying GOD hates sin and sinners then defining gays as sinful. The weakminded bibilical brainwashed person may think he is doing Gods justice by hurting gay people because we do not see our lives sinful in anyway so there is nothing to repent about.", 
   {}, 
   150123, 
   null, 
   1122214020.0
  ], 
  [
   150134, 
   null, 
   "Jaaaman", 
   "Originally Posted by Jaaaman\n Fred Phelps is an example of extreme religous fundamentalism. He is on par with hate groups such as the kkk and white supremists. You have completely taking this out of context. Somebody going to a typical service in a baptist church is not going to be taught that gays are 'to be killed' or to be 'put to death'. Gays need our love and support, and they need to hear the truth concerning their sexuality and the wrongfulness of their lifestyle choice. Again, I say we need to do this out of love..... that is what Christ taught.\n\n \nThe weakminded bibilical brainwashed person may think he is doing Gods justice by hurting gay people because we do not see our lives sinful in anyway so there is nothing to repent about.\n\n \n Then that person is interpreting Scripture wrong and not listening to what the pastor is saying on the subject. This individual is likely to be a violent person anyway, and its only a matter of time before he becomes involved in some sort of crime. Just because we are being taught the information held in the Scriptures, and that it teaches that homosexuality is a sin, does not mean is should not be taught.", 
   {}, 
   150132, 
   null, 
   1122215700.0
  ], 
  [
   150158, 
   null, 
   "joebrummer", 
   "Then that person is interpreting Scripture wrong and not listening to what the pastor is saying on the subject. \n\n \n \n Really, I bet they are listening to the pastor......\n \n http://www.365gay.com/newscon05/07/072305wisconsin.htm", 
   {}, 
   150134, 
   null, 
   1122224340.0
  ], 
  [
   150162, 
   null, 
   "joebrummer", 
   "Maybe you need more evidence of this.....(these are quotes from christian groups) Some who are very influential.\n \n Jerry Falwell blamed the 911 attacks on gays.......on national TV. This is demonizing right? and he is a self proclaimed christian.\n \n AIDS is the wrath of a just God against homosexuals. To oppose it would be like an Israelite jumping in the Red Sea to save one of Pharoah's chariotters.\n -- Rev. Jerry Falwell (attributed: source unknown)\n \n \n \"...the acceptance of homosexuality is the last step in the decline of Gentile civilization.\" --Pat Robertson, of the Christian Broadcasting Network, warned that hurricanes could hit Orlando, Fla., because of gay events there. Time magazine, Oct 26, 1998\n \n \"David Caton, head of the Florida chapter of the American Family Association, has suggested that homosexuality be discouraged by photographing patrons entering Gay bars and posting these photos in public places such as the post office.\" - Mark E. Pietrzyk, News-Telegraph, March 10, 1995.\n \n \"Basically, the homosexual, let's say the political gay community, is out to destroy the traditional marriage, heterosexual marriage, that God has designed for us.\" - Anthony Falzarano http://www.frc.org/net/st96d2.html\n \n \n \n \n \"...wage the war against the homosexual agenda.\" - From the Web site of Bauer's Family Research Council, which calls homosexuality \"destructive\", source: Time magazine, Oct 26, 1998.\n (The FRC is a christian organization)\n \n \"Gaining access to children has been a long-term goal of the homosexual movement.\" - \"Homosexual Activists Work to Normalize Sex With Boys,\" FRC publication, July 1999, http://www.frc.org/misc/bl057.pdf \n \n \"In light of recent research on AIDS, it was discovered that the average homosexual who was interviewed had 550 different sexual partners. Those with AIDS, (I refuse to call them AIDS victims, because the vast majority received the disease by deviant sexual behavior and drug usage which they choose), when considered by themselves average 1,100 different sexual partners, and some reported as many as 20,000.\" - Paul Volle, Chairman, Christian Coalition of Maine, \"The Gay Agenda,\" October 1998\n \n \"Practicing homosexuals individually may come up against anti-gay societal sentiment in the form of denied jobs or housing. This is OK.\" - \"The Gay Agenda\", published by Paul Volle, Chairman, Christian Coalition of Maine, October 1998\n \n \"to the degree that the homosexual movement changes society in its favor...it will contribute to the overall decay of society\" - http://www.afa.net, Homosexuality in America: Exposing the Myths.\n \n \"The disgusting details of the homosexual lifestyle explain why so many diseases are present in the homosexual community.\" - http://www.afa.net, Homosexuality in America: Exposing the Myths.\n \n \n \n I could go for days on these quotes by christian groups but it is clear that the far right wing of christians are domonizing gays and lesbians as the main reason the world is wrong. When you demon a group of people, these groups are essentially saying it is OK to kill or hurt these people, they were a problem anyway.", 
   {
    "unicode_changes_made": true
   }, 
   150158, 
   null, 
   1122226500.0
  ], 
  [
   150228, 
   null, 
   "jyoshu", 
   "I didn't say they advocate violence. I said the contribute to the climate the makes such acts acceptable.......read first post again.\n\n \n This seems to be a favorite topic of yours.\n \n Why would you not want the people who commit violent acts to be the ones accoutable for their actions? You are harping on something that can't really be proven, and spending very little effort condemning those that actually do the crime. \n \n I also find it interesting that you single Christian groups out for this. Do you not realize that many more gay people experience problems from less tolerant groups such as Islamic fundamentalists than Christian ones? they actually advocate violence against gays, yet I've never read you say one word about Islamic fundamentalism in these forums; you always single out Christianity. Why are you so obsessed with using this to vilify Christians?", 
   {}, 
   149956, 
   null, 
   1122244620.0
  ], 
  [
   150234, 
   null, 
   "joebrummer", 
   "This seems to be a favorite topic of yours.\n \n Why would you not want the people who commit violent acts to be the ones accoutable for their actions? You are harping on something that can't really be proven, and spending very little effort condemning those that actually do the crime. \n \n I also find it interesting that you single Christian groups out for this. Do you not realize that many more gay people experience problems from less tolerant groups such as Islamic fundamentalists than Christian ones? they actually advocate violence against gays, yet I've never read you say one word about Islamic fundamentalism in these forums; you always single out Christianity. Why are you so obsessed with using this to vilify Christians?\n\n \n \n cause I have never met nor heard of a islamic fundie testifying before congress against my rights...I have seen christians do it!", 
   {}, 
   150228, 
   null, 
   1122245100.0
  ], 
  [
   150292, 
   null, 
   "JustineCredible", 
   "This seems to be a favorite topic of yours.\n\n \n Obviously yours as well, you keep returning to threads which may contain such matters. \n If you don't like it, don't reply to it. Fairly logical and simply actually. K.I.S.S. {Keep It Simply Stupid}\n \n \nWhy would you not want the people who commit violent acts to be the ones accoutable for their actions? You are harping on something that can't really be proven, and spending very little effort condemning those that actually do the crime.\n\n \n Convenient and plausible deniability again. \n \n How wonderful for you, you can sit comfortably at home, defending your own bigotry, but because you never said anything directly you can't be blamed for contributing to the climate of hate. \n How sweet and cozy...I hope it keeps you warm at night!", 
   {}, 
   150228, 
   null, 
   1122250620.0
  ], 
  [
   150339, 
   null, 
   "celtibero", 
   "There is some evidence to suggest (that I agree with) That Fundementalist chrsitians groups like Focus on the Family, Exodus, Christian Calues Coalition.....and others create a climate of violence for gays and lesbians. They do this by demonizing gays as diseased, dirty, immoral, and a danger to children. Do you agree that these groups contribute to the climate where bashing gays is acceptable.\n\n Yes i would be agree those groups bashing homosexuals, homosexuality does not bring nothing good to any society, that's a decadency symbol and frankly i would be quite glad those guys just disappeared all of them once and for all, it's quite disgusting for any straight man sees that beneath behaviour, homosexualism is in no way a genetic transmitted disease but what really means is promiscuity and degeneration.", 
   {}, 
   149947, 
   null, 
   1122260880.0
  ], 
  [
   150413, 
   null, 
   "Matthew S", 
   "Yes i would be agree those groups bashing homosexuals, homosexuality does not bring nothing good to any society, that's a decadency symbol and frankly i would be quite glad those guys just disappeared all of them once and for all, it's quite disgusting for any straight man sees that beneath behaviour, homosexualism is in no way a genetic transmitted disease but what really means is promiscuity and degeneration.\n\n \n \n This, of course, is only your opinion. I could say the same thing for hetrosexual relationships and generalize them based on womens shelters and say \" see if a women gets involved in a heterosexual relationship it only leads her to getting beat up and possibly killed.\"", 
   {}, 
   150339, 
   null, 
   1122284760.0
  ], 
  [
   150427, 
   null, 
   "JustineCredible", 
   "Yes i would be agree those groups bashing homosexuals,\n\n \n \n Um, is that to say, \"Yes, [you] would agree THAT those groups ARE bashing homosexuals? \n \n Or do you mean, \"Yes, [You] would agree WITH those groups bashing homosexuals? \n \n \n homosexuality does not bring nothing good to any society,\n\n \n Concidering that was a double negitive, once again your intent is unclear. But since double negitives use usually indicates that only a single negitive is implied, I would have to assume you meant that you THING homosexuality doesn't bring ANYTHING good to a society.\n Which would simply be you stating your opinion, not a fact.\n \n \n that's a decadency symbol and frankly i would be quite glad those guys just disappeared all of them once and for all,\n\n \n Hmmm a \"decedancy\" symbol, really? \n So it's like wearing diamonds or owning a jaguar? Hey, if that's the case, where's mine?! \n \n Also you mention that you'ld like to see them disappear, is that a threat? \n \n \n it's quite disgusting for any straight man sees that beneath behaviour,\n\n \n Well, you have two choices then. Don't watch or admit it facinates you! \n \n Also, what exactly is a \"beneath behavior?\" \n \n \n homosexualism is in no way a genetic transmitted disease\n \n \n You're right there. It's not a disease at all. \n It's simply a state of being. Something that is part of the person. \n \n \n but what really means is promiscuity and degeneration.\n\n Hmmm...this is a really big ASSUMPTION on your part. \n By saying this you assume that all homosexuals are sexually promiscuous which simply isn't the case. \n This is yet another personal opinion, not a fact you can back up.", 
   {}, 
   150339, 
   null, 
   1122293400.0
  ], 
  [
   150553, 
   null, 
   "joebrummer", 
   "The religious right says you're an \"anti-Christian bigot\" if you find their hate speech offensive. They argue that Matt's [shepard's] killers probably didn't read their anti-gay press releases, so it's unfair to say that their vocal bigotry led to violence.\n \n But the simple fact remains that religious extremists vilify gays on a regular basis, creating and feeding a culture that inadvertently gives comfort to those who choose to express their hate in violence. The religious right calls gays diseased, perverted, immoral, and abomination. They say on TV and radio that gays deserve to lose their jobs, their children, their families and their homes. They prepare studies for Congress \"proving\" gays are unfit teachers, parents, ambassadors, and soldiers. They liken gays to pedophiles, adulterers, murderers, kleptomaniacs, and alcoholics. And they accuse gays of being anti-family, anti-Christian, anti-America, and anti-God.\n \n It is simply not possible to constantly preach the inhumanity of man, then blithely skulk away when principle meets practice. It is simply not moral to give a child a gun, then feign ignorance when someone gets hurt.\n \n If words do not inspire actions, then why did the top religious right organizations spend $500,000 on an ad campaign to inspire gays to 'convert'? They know words have consequences, and their words are nothing less than the subjugation and dehumanization of gay and lesbian Americans. While most on the far-right don't preach violence, it is no wonder that decades of their disdain eventually led to murder. \n http://www.hatecrime.org/subpages/hatespeech/hate.html", 
   {}, 
   150427, 
   null, 
   1122330420.0
  ], 
  [
   150555, 
   null, 
   "joebrummer", 
   "Here is a link to a very complete comparison of religous right groups hate speech and nazi hate speech against the Jews. Look at the similar comments.\n \n http://www.hatecrime.org/subpages/hitler/hitler.html", 
   {}, 
   150553, 
   null, 
   1122330540.0
  ], 
  [
   150618, 
   null, 
   "celtibero", 
   "This, of course, is only your opinion. I could say the same thing for hetrosexual relationships and generalize them based on womens shelters and say \" see if a women gets involved in a heterosexual relationship it only leads her to getting beat up and possibly killed.\"\n\n The fact women themselves may be beaten by some brutal and mad men (they could not be considered otherwise and be noted that there i've striven to be polite using those light qualificatives), has nothing to do with homosexuality, on my view both things are so sharply reprobables as deeply condemnables to do, however very independents one from the other, thus women can be bitterly beaten independenly whether by men or women that's for me clear, that's just human violence to me another grave subject to be pointed out and condemned to, and i would in deed add to it that gaugeing its social specific weight and repercusion quite a lot more urgent to be addressed to be socialy dimminished as for what homosexuality could represent, after all and despite of that it does not like me if someone decides to be homosexual is not my business at all none the less what truly i don't accept is that the brute force be there used against the weakest one which in this case would be the women themselves, so on that point i'd be in accordance with you although it had not been the issue to start off debate that in this case was refered to homosexuality.", 
   {}, 
   150413, 
   null, 
   1122346500.0
  ], 
  [
   150635, 
   null, 
   "joebrummer", 
   "T after all and despite of that it does not like me if someone decides to be homosexual is not my business at all none .\n\n \n \n People don't decide to be homosexual......that is a illogical and rather silly remark...", 
   {}, 
   150618, 
   null, 
   1122351960.0
  ], 
  [
   150637, 
   null, 
   "JustineCredible", 
   "The fact women themselves may be beaten by some brutal and mad men (they could not be considered otherwise and be noted that there i've striven to be polite using those light qualificatives), has nothing to do with homosexuality, on my view both things are so sharply reprobables as deeply condemnables to do, however very independents one from the other, thus women can be bitterly beaten independenly whether by men or women that's for me clear, that's just human violence to me another grave subject to be pointed out and condemned to, and i would in deed add to it that gaugeing its social specific weight and repercusion quite a lot more urgent to be addressed to be socialy dimminished as for what homosexuality could represent, after all and despite of that it does not like me if someone decides to be homosexual is not my business at all none the less what truly i don't accept is that the brute force be there used against the weakest one which in this case would be the women themselves, so on that point i'd be in accordance with you although it had not been the issue to start off debate that in this case was refered to homosexuality.\n\n \n Wow, you sure took a lot of space to say very little. \n The point of what Matthew was saying wasn't so much about women or even subjugation of women, but more so he was comparring it to your comment about homosexuals disapprearing from the face of the planet because you specifically don't like them.", 
   {}, 
   150618, 
   null, 
   1122352320.0
  ], 
  [
   150659, 
   null, 
   "celtibero", 
   "People don't decide to be homosexual......that is a illogical and rather silly remark...\n\n should i say then for instances \"feels\"?????, there was said formerly that to me homosexualism does not set upon genetic transmittion grounds, so before reply please check out one's former sayings.", 
   {}, 
   150635, 
   null, 
   1122356880.0
  ], 
  [
   150660, 
   null, 
   "melsucceeds", 
   "should i say then for instances \"feels\"?????, there was said formerly that to me homosexualism does not set upon genetic transmittion grounds, so before reply please check out one's former sayings.\n\n \n \n \n A man killed his 3-year-old son because he thought his kid might be gay.", 
   {}, 
   150659, 
   null, 
   1122357120.0
  ], 
  [
   150666, 
   null, 
   "JustineCredible", 
   "A man killed his 3-year-old son because he thought his kid might be gay.\n\n \n Thank you, that is exactly the point of this and my other thread. It's amazing how things get so twisted out of shape when people simply don't want to deal with the matter at hand.", 
   {}, 
   150660, 
   null, 
   1122358920.0
  ], 
  [
   150667, 
   null, 
   "celtibero", 
   "A man killed his 3-year-old son because he thought his kid might be gay.\n\n What a brutal man and what a barbaric act!, what i have tried just as i can see unsuccessfuly to mean is that homosexuality is a deviation of the man right behave (that for me is undeniable and absolutle), whether there are people on this site who do not have enough critery to understand this point or strive to get out other scarcely associated stuffs to try to get into some debate that furthermore i'm not interested in, that is not the point which from the outset i wanted to put up on the table.", 
   {}, 
   150660, 
   null, 
   1122359400.0
  ], 
  [
   150695, 
   null, 
   "Raastee", 
   "What a brutal man and what a barbaric act!, what i have tried just as i can see unsuccessfuly to mean is that homosexuality is a deviation of the man right behave (that for me is undeniable and absolutle), whether there are people on this site who do not have enough critery to understand this point or strive to get out other scarcely associated stuffs to try to get into some debate that furthermore i'm not interested in, that is not the point which from the outset i wanted to put up on the table.\n\n \n I understand what you are saying. You are saying that homosexual behavior is deviant, but you use the words, \"deviation of the man right behave.\"\n You apparently and fervently believe that homosexuals are deviants because you write that your belief is, \" ...undeniable and absolutle.\"\n You go on to say that you are really not interested in debating that belief structure of yours; therefore you are close minded. You have already determined what you will believe, therefore contray views are not needed.\n \n I think you are only proving some of the points that the author of this trend has made. Your presuppositions are the problem with you and the father of this child.", 
   {}, 
   150667, 
   null, 
   1122379620.0
  ], 
  [
   150710, 
   null, 
   "joebrummer", 
   "What a brutal man and what a barbaric act!, what i have tried just as i can see unsuccessfuly to mean is that homosexuality is a deviation of the man right behave (that for me is undeniable and absolutle), whether there are people on this site who do not have enough critery to understand this point or strive to get out other scarcely associated stuffs to try to get into some debate that furthermore i'm not interested in, that is not the point which from the outset i wanted to put up on the table.\n\n \n I am asking in all seriousness with no, is English a seconf language for you? Your post's language are really rough. It is hard to figure what you are really saying and it doesn't seem to be on topic either........", 
   {}, 
   150667, 
   null, 
   1122388620.0
  ], 
  [
   150774, 
   null, 
   "Matthew S", 
   "I am asking in all seriousness with no, is English a seconf language for you? Your post's language are really rough. It is hard to figure what you are really saying and it doesn't seem to be on topic either........\n\n \n \n I think you are right after closly reading his, I assume he, english must be a second langauge\n \n \n\n what i have tried just as i can see unsuccessfuly to mean is that homosexuality is a deviation of the man right behave\n\n \n This above statement is backwards thinking as in many of the romance languages the subject of the sentence can be placed in any part of the sentence and still make sence, which is not the case with english.\n \n \n\n not have enough critery to understand this point\n \n\n \n the word critery got me to thinking I did a google search on the word and this is what I found\n \n http://www.englishforums.com/English/UnderDevelopedDevelopingCountries/xjqn/Post.htm#71668", 
   {}, 
   150710, 
   null, 
   1122405900.0
  ], 
  [
   150778, 
   null, 
   "wsm2506", 
   "While this is not a scientific poll, I think it gives a good indication how many of us preceive the fundamentalist Christian movement.", 
   {}, 
   150774, 
   null, 
   1122406500.0
  ], 
  [
   150782, 
   null, 
   "joebrummer", 
   "my next question would be what can we do about the climate of violence that exists. How do we make it not ok to target gays not only just in violence but bigotry in general......How do we get the extreme right to stop posting such lies, using flawed data, promoting hate and intolerance etc......\n \n How do you get James Dobsen to stop using Paul Camerons hate research and start teaching the truth.", 
   {}, 
   150778, 
   null, 
   1122406980.0
  ], 
  [
   150786, 
   null, 
   "wsm2506", 
   "my next question would be what can we do about the climate of violence that exists. How do we make it not ok to target gays not only just in violence but bigotry in general......How do we get the extreme right to stop posting such lies, using flawed data, promoting hate and intolerance etc......\n \n How do you get James Dobsen to stop using Paul Camerons hate research and start teaching the truth.\n\n \n The only way I can see is to publicly expose their lies and misinformation. It is a matter of getting the media involved to get the issue in from of all the people.", 
   {}, 
   150782, 
   null, 
   1122407220.0
  ], 
  [
   150787, 
   null, 
   "joebrummer", 
   "The only way I can see is to publicly expose their lies and misinformation. It is a matter of getting the media involved to get the issue in from of all the people.\n\n \n \n I say we go for a class action lawsuit for libel and slander, using it as a stepping stone to air their lies for the world to see......\n \n How would James Dobsen look then, or Jerry Falwell, or Throckmorton for that matter.......How about that Smid guy from Love in action....name them all in the suit for slander! Make them prove their claims about parents making their kids gay, make them prove we each have 500 parters. I had a hard time finding one partner let alone 500.", 
   {}, 
   150786, 
   null, 
   1122407340.0
  ], 
  [
   150788, 
   null, 
   "jyoshu", 
   "While this is not a scientific poll, I think it gives a good indication how many of us preceive the fundamentalist Christian movement.\n\n \n No one here is surprised by the poll results--passionate pro-gay rights people are in the majority in this forum. That majority/minority ratio isn't very representative of the way it is in society.\n \n \nmy next question would be what can we do about the climate of violence that exists.\n\n \n Don't you think that makes the quantum-leap assumption that just because the majority here lean the way they do in the poll that it automatically makes them right? Or perhaps more accurately, they are probably right that there is some culture of violence against gays to some degree, just not the pervasive degree they think? I don't see how the fact they poll this way means they are automatically correct in their opinion. In short, the poll simply proves they have that opinion; it does not prove that the opinion is right (or wrong).", 
   {}, 
   150778, 
   null, 
   1122407400.0
  ], 
  [
   150791, 
   null, 
   "wsm2506", 
   "No one here is surprised by the poll results--passionate pro-gay rights people are in the majority in this forum. That majority/minority ratio isn't very representative of the way it is in society.\n \n \n \n Don't you think that makes the quantum-leap assumption that just because the majority here lean the way they do in the poll that it automatically makes them right? Or perhaps more accurately, they are probably right that there is some culture of violence against gays to some degree, just not the pervasive degree they think? I don't see how the fact they poll this way means they are automatically correct in their opinion. In short, the poll simply proves they have that opinion; it does not prove that the opinion is right (or wrong).\n\n \n I'll ask you again, what level of pervasiveness is required?", 
   {}, 
   150788, 
   null, 
   1122407520.0
  ], 
  [
   150794, 
   null, 
   "joebrummer", 
   "No one here is surprised by the poll results--passionate pro-gay rights people are in the majority in this forum. That majority/minority ratio isn't very representative of the way it is in society.\n \n \n \n Don't you think that makes the quantum-leap assumption that just because the majority here lean the way they do in the poll that it automatically makes them right? Or perhaps more accurately, they are probably right that there is some culture of violence against gays to some degree, just not the pervasive degree they think? I don't see how the fact they poll this way means they are automatically correct in their opinion. In short, the poll simply proves they have that opinion; it does not prove that the opinion is right (or wrong).\n\n \n Simply put..of course they are right.....\n \n jyoshu, please go to some of the ex-gay websites and look at how they potray and demonize gays, do a google search on homosexuals and look at the anti-gay christian sites that come up. There are hundreds if not more. SOme very major christian organizations have amazing lies about homosexuals on their sites......Focus on the Family takes the cake, Stephen Bennett takes second place, the FRC take the booby prize....\n \n Then think to yourself, how would some people percieve this inforamtion? Would they use it to justify violence, discrimination, name calling, denila of rights.....\"why should we give those dirt, diseased people rights.....\"\n \n \n Take off your blinders, please try to understand. This is the truth...if you open your eyes it is right in front of you. I amazed someone as bright as you seem cannot see this one......\n \n You cannot demonize a group of people and then cry boo hoo when your words become anothers action. It is like crying Fire in a crowed theater and then say you didn't cause the guy to fall down on his way out the door.", 
   {}, 
   150788, 
   null, 
   1122407940.0
  ], 
  [
   150817, 
   null, 
   "joebrummer", 
   "jyoshu,\n Please read this article........\n \n http://www.splcenter.org/intel/intelreport/article.jsp?aid=522\n \n \n This is from a very respected civil rights groups that monitors hate groups.", 
   {}, 
   150794, 
   null, 
   1122411840.0
  ], 
  [
   150825, 
   null, 
   "jyoshu", 
   "Simply put..of course they are right.....\n \n do a google search on homosexuals and look at the anti-gay christian sites that come up. There are hundreds if not more\n\n \n Ok, Joe. I did the Google search you requested me to do. Here's my summary of this journey . . .\n - 1st page: On the first page, there were several hits about historical Nazi persecution of gay people in WWII. No surprise there, and no bearing on current culture of violence. So nothing really on page 1 that indicates a contribition of religion toward a culture of violence in our context.\n \n - 2nd page: Ah ha! 2 hits of possible relevance--a Salon article about churches supporting an anti-gay marriage amendment (though no comments about their feelings about gay people or calls of violence). And WorldNetDaily news article about some gay people planning harassment toward Christians. Possible 2 out of 10 links may contribute to a culture of violence (or may not). Wait, there's something about \"religion\" . . . oh, no that's \"religioustolerence.org.\" Not an anti-gay site at all.\n \n - 3rd page. Pay dirt! Yes, there is one article at some site called \"Etherzone.com\" linked here that has some very harsh things to say about homosexual living, calling the 'sodomizers' and so forth. I have to take issue with their comments and approach. One site. \n \n - 4th Page: There's one doc linked from something called \"leaderu\" that talks about how homosexuals can change. Well, maybe that would possibly fit the gay rights lobby criteria for contributing to a culture of violence. I don't know. Hey, it's a negative article to the gay rights message, right?? That we can agree on.\n \n - 5th page: Well, we're now 50 links deep in this Google excursion. One news article about the pope readying some document against gay marriage--it's not an \"anti-gay website,\" but I guess the report could contribute to a culture of violence, maybe. Hmm. Oh, there's another WorldNetDaily article. \"Judge rules against Christians who preached to homosexuals.\" I think that might be a blacklisted site by the gay lobby as \"anti-gay\", so we'll chalk it up as another definite.\n Ok, I think 5 pages of links ought to suffice as a good sampling. I went over 50 links in, and found that 2 definite anti-gay articles--yeah it could indeed contribute to a culture of violence, if there were many more to go with them. There were maybe 3 others that MAY possibly contribute to a 'culture of violence, but thety were simply reports and not anti-gay websites. \n \n Joe, I'm sorry dude, but you were simply wrong. There are not hundreds of anti-gay sites coming up in your search. Not even 50. Not even 10. Not even 5. No links to James Dobson, or Jerry Falwell. No mention of Paul Cameron. Only 2 WorldNetDaily links. And a 'LeaderU' article (whatever that is). The other 2 or 3 mention things in passing--they aren't anti-gay websites. In fact, a lot of what I saw come up were links to pro-gay sites. It seems you all have quite a showing on Google--a lot more than anti-gay ones for sure. I took your challenge, and you were wrong. How am I supposed to assume what you are telling me is true? I remain unconvinced.", 
   {}, 
   150794, 
   null, 
   1122413280.0
  ], 
  [
   150829, 
   null, 
   "joebrummer", 
   "I am reposting this from above.....\n \n \n \n jyoshu, please go to some of the ex-gay websites and look at how they potray and demonize gays, do a google search on homosexuals and look at the anti-gay christian sites that come up. There are hundreds if not more. SOme very major christian organizations have amazing lies about homosexuals on their sites......Focus on the Family takes the cake, Stephen Bennett takes second place, the FRC take the booby prize....\n \n \n Yes dude, there are hundred of these anti-gay christian sites......maybe you misunderstood my comment, I will rephrase it......\n \n There are hundreds of anti-gay, christian websites out there that demonize gays and lesbians.......I can list many if you would like, If I had the time to kill I would create a list....oh wait I posted a list for you and you didn't take that as evidence, I posted hatecrime.org and all their proof of demonizing, now I have posted the Southern Poverty Law Center's article as proof.\n \n \n How much freaking proof do you need or are you that blind......\n \n YOu are unconvinced because you do not want to believe in the truth.....", 
   {}, 
   150825, 
   null, 
   1122413820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Poll on Christian groups and their stance on Gays", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6040-poll-christian-groups-their-stance-gays.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6040, 
  "discussion_files": [
   [
    "6407.html", 
    "http://www.4forums.com/political/gay-rights-debates/6040-poll-christian-groups-their-stance-gays-print.html"
   ], 
   [
    "6408.html", 
    "http://www.4forums.com/political/gay-rights-debates/6040-poll-christian-groups-their-stance-gays-3-print.html"
   ], 
   [
    "6409.html", 
    "http://www.4forums.com/political/gay-rights-debates/6040-poll-christian-groups-their-stance-gays-2-print.html"
   ]
  ], 
  "identifier": 6040
 }
]