[
 [
  [
   150125, 
   null, 
   "billsco", 
   "This is a formal debate between The Skeptic and Clive14 in regard to the following: \n \n  Resolved: That irreducible complexity exists and proves Neo-Darwinism incorrect.  \n \n The Skeptic will argue for the affirmative, Clive14 for the negative. Both have agreed to a 5/4 post structure. This means The Skeptic will post first, then Clive14 will respond, each in alternating fashion, with the final post by The Skeptic. The last post from each will be a recap of their position and the reason why they believe they won the debate. Both have agreed to a 120 hour time limit between posts. No word limits have been discussed; however, the moderator reserves the right to impose a maximum limit if excessively long posts are encountered. \n \n The judges will be JP Sartre12, Waxy, and jskufan. Their decisions will be final.\n \n If your name does not appear above, please do not post to this thread, as it will be deleted. \n \n Good luck to both The Skeptic and Clive14.\n \n The Skeptic now has 120 hours to post his first argument.", 
   {
    "post_info": {
     "post_title": "The Skeptic vs Clive14--Irreducible Complexity"
    }
   }, 
   null, 
   null, 
   1122212760.0
  ], 
  [
   150284, 
   null, 
   "The Skeptic", 
   "First of all, I would like to thank my opponent for agreeing to this debate, and I hope the feeling is mutual. :) Regardless of who wins, I pray that we will both learn and grow. I also thank the judges for their time and effort.\n \n Let us start with a quote from Darwin, in the origin of the species:\n \n \nIf it could be demonstrated that any complex organ existed which could not possibly have been formed by numerous, successive, slight modifications, my theory would absolutely break down.\n\n \n So, if I can demonstrate that something could not have evolved by \"numerous, successive, slight modifications,\" evolution is in the dumpster according to Darwin himself. How will I do this? First of all, we need to define out terms for the resolution:\n \n Resolved: That irreducible complexity exists and proves neo-Darwinism incorrect.\n \n What is irreducible complexity? Michael Behe defines the term within Darwins Black Box, his book on the subject.\n \n \na single system composed of several well-matched, interacting parts that contribute to the basic function, wherein the removal of any one of the parts causes the system to effectively cease functioning\n\n \n We see that if I can demonstrate that an irreducibly complex system exists, I have won the debate and proven evolution incorrect. For the sake of simplicity, I will mirror Michael Behe's simplest irreducibly complex system as my first example. That example is the bacterial flagellum, which is essentially the motor that some bacteria use to move themselves.\n \n Behe did a good job of describing how the whole thing works in his book, Darwin's Black Box:\n \n \nThe flagellum is a long, hairlike filament embedded in the cell membrane. The external filament consists of a single type of protein, called \"flagellin.\" The flagellin filament is the paddle surface that contacts the liquid during swimming. At the end of the flagellin filament near the surface of the cell, there is a bulge in the thickness of the flagellum. It is here that the filament attaches to the rotor drive. The attachment material is comprised of something called \"hook protein.\" The filament of a bacterial flagellum, unlike a cilium, contains no motor protein; if it is broken off, the filament just floats stiffly in the water. Therefore the motor that rotates the filament-propeller must be located some somewhere else. Experiments have demonstrated that it is located at the base of the flagellum, where electron microscopy shows several rind structures occur. [He goes on to demonstrate that it must have a rotary device.]\n\n \n So... what does the above mean in common English?\n \n The bacterial flagellum is incredibly efficient and technologically advanced. It can spin at 10,000 rpm's in one direction, and start going 10,000 rpm's in the other direction in less than 1/4 of a turn. It requires 40 vital, moving parts to work. Please note, if it only has 20 parts, it will not go at only 5,000 rpm's. It will not work. The same goes with 30 parts, ect.\n \n But, I'm not done yet. Even if you could somehow \"simplify\" something as incredibly complex as the flagellum, it still has 3 base parts: the paddle, rotor, and motor. Even assuming that, say, a motor could evolve all by itself for some reason, it wouldn't do any good, because the motor by itself cannot do anything, and would not be selected by natural selection. The same goes with the rotor and the paddle.\n \n To note, this is only one example of irreducible complexity. I can produce many more on request, including cilium, blood clotting, the immune system, ect.\n \n In the end, we have a major problem for evolutionism.\n \n TS", 
   {
    "post_info": {
     "post_title": "First post by TS"
    }, 
    "unicode_changes_made": true
   }, 
   150125, 
   null, 
   1122248820.0
  ], 
  [
   150439, 
   null, 
   "Clive14", 
   "Irreducible complexity sounded impressive when coined nearly ten years ago, but it has had its day. It has been shown to be no more than a continuation of the age-old tradition of plugging the holes of human knowledge with a god. It isn't science, it poses no threat to evolution theory and it deserves to be consigned to the dustbin of history.\n \n These are bold words, especially given that my opponent believes that irreducible complexity not only has merit, but that it falsifies evolution theory. So how can I be so confident in my pronouncement? There are a series of reasons, the first of which is that no irreducibly complex system has yet to be identified. I shall address this first reason by showing how all six irreducibly complex systems proposed by Behe in his book, Darwin's Black Box, are far from being irreducibly complex. The six systems are:\n \n The Cilium\n Blood clotting\n Cellular transport systems\n The immune system\n Metabolic Pathways\n and finally, my opponent's chosen one and the \"icon\" of anti-evolution argument, the bacterial flagellum.\n \n The Cilium\n From Behe:\n \"Cilia are composed of at least a half dozen proteins: alpha-tubulin, beta-tubulin, dynein, nexin, spoke protein, and a central bridge protein. These combine to perform one task, ciliary motion, and all of these proteins must be present for the cilium to function ... But since the complexity of the cilium is irreducible, then it can not have functional precursors. Since the irreducibly complex cilium can not have functional precursors it can not be produced by natural selection, which requires a continuum of function to work. Natural selection is powerless when there is no function to select. We can go further and say that, if the cilium can not be produced by natural selection, then the cilium was designed.\"\n \n A very simple study of cilia found in various organisms shows this above statement to be plain false. Caddis fly sperm cells for example have a 9+7 arrangement of inner and outer ring microtubules, where as eel sperm completely lack the two central microtubules (having a 9+0 arrangement). The protozoan Diplauxis hatti has a very simple 3+0 arrangement that also lacks many of the other components of the \"standard\" cilium. All function just fine.\n \n Further the proteins found within the cilium are not restricted to the cilium. Microtubules exist throughout the cell. They act as \"highways\", for example, along which material is moved around the cell in an organised fashion. The protein dynein also exists within the cell: it's the protein that carries materials along microtubules. There are also many types of nexin proteins found within the cell, such as the \"sorting nexins\" that are involved in transporting proteins to and from the cell membrane. All the components for the cilium exist doing other functions: the \"precursors\" are there. The cilium works in a variety of configurations of proteins: not all the proteins must be present for the cilium to function. It is not irreducibly complex.\n \n Blood clotting\n Blood clotting in mammals is a highly complex cascade sequence. At each stage, yet another apparently specific protein does it's job to trigger the next event keeping the cascade going. Take one of these proteins away, so the argument goes, and the whole cascade grinds to a halt and the blood doesn't clot. It must therefore be irreducibly complex.\n \n To start with, the entire sequence cannot be viewed as irreducibly complex as Factor XII for example, one of the steps of the sequence, can be removed without affecting the clotting mechanism. Further the remaining parts have been shown to not be that distinct after all. For example the five proteases have near identical lengths polypeptide chains, have near identical cleave points and have a large number of homologous peptide sequences. It is very simple to construct biochemical models that show the evolution of blood clotting. It isn't irreducibly complex.\n \n Cellular transport systems\n Behe discusses transport of materials in and between cells using gated transport and vesicular transport systems in eukaryotes. These systems are complex. Behe even presents a simplified version of events, so these systems are even more complex than he describes. They involves hundred of highly specific proteins all working in unison. Once more the system cannot function with parts missing, so must be irreducibly complex.\n \n Notice something in the above? \"Eukaryotes\": these are big complex cells with membrane-bound nucleus, mitochondria and other organelles, with DNA formed into chromosomes etc. There are much simpler cells known as prokaryotes. You may have come across them by another name: bacteria. Bacteria have a much simpler cellular transport system, using what are termed ABC transporters. Simpler cells with a simpler transport system. Cellular transport systems clearly are anything but irreducibly complex.\n \n The immune system\n Behe describes the mammalian immune system in detail. Since I am trying to be brief her, I won't go into the full details as it is a vastly complex system with sophisticated cross coupling of events. At a first glance, it might seem fair to call this system irreducibly complex.\n \n Once again Behe makes the mistake of just looking at a complex system in complex organisms. Had he looked to moths, he might have realised his error over \"irreducible complexity\" much earlier on. Before I explain that though, a study of vertebrate immune systems show them to be diverse and of varying levels of complexity. Some primitive jawless fish have no adaptive immune response at all, sharks have lots of genome sequences already assembled for their adaptive immune response and we humans (along with other mammals) use gene splicing to achieve the same range of sequences as sharks using a much smaller starting base. But back to those moths. Some moths produce a chemical called hemolin. This binds to bacteria, aiding their removal from the moths body. Hemolin's peptide sequence has more than a passing resemblance to vertebrate antibodies. So we have a complex \"irreducible\" system reduced to one protein.\n \n Metabolic Pathways\n Behe makes the claim that \"There has never been a meeting, or a book, or a paper on details of the evolution of complex biochemical systems.\"\n \n The Kreb's cycle, pentose phosphate pathway, glycogen biosynthesis and amino acid synthesis, to name justa few have been studied, along with their likely evolutionary paths, in detail. These studies have been published. Looks like Behe is making a false claim here. But it gets worse, for Sphingomonas chlorophenolica, a lovely little \"eco-friendly\" bacteria, derives its carbon from PCP (the toxic chemical pentachlorophenol). The degrading of PCP to liberate carbon involves three enzymes and removing any kills the sequence and thus the bacteria. An obvious \"irreducibly complex\" system, no? But PCP is a man-made substance that was invented just seventy years ago. So this \"irreducibly complex\" system must have evolved, sorry been \"designed\", in the last 70 years!\n \n bacterial flagellum\n Since my opponent used this as his example, I have saved it until last as I will give it the most attention.\n \n Firstly Behe, and thus my opponent, claim that the bacterial flagellum requires all forty proteins to work. Treponema pallidum's flagellum is composed of 38 proteins. Borrelia burgdorferi has only 35 flagellum proteins. Helicobacter pylori requires just 33 proteins to get its flagellum working just fine. We do not know yet what the minimum number of proteins is in modern bacteria, but clearly the 40 protein model is not irreducibly complex.\n \n My opponent refers to three \"components\" of the flagellum: the motor, rotor and paddle and suggests that these too are irreducibly complex as a motor without a rotor and paddle is useless for example. I shall use his terms here even though it is more conventional to refer to four components (the \"paddle\" being made up of the hook and filament and the \"rotor\" being known as the rod). \n \n The paddle is a simple structure, save for one feature. It is hollow. This is an important clue as to the evolutionary origins of the flagellum, especially when we discover that the rotor too is hollow. Because it is hollow, the paddle is built up by adding sub-units to the tip (rather than growing from the base). So why might it be hollow? To understand that, one must take a closer look at the motor. It is a complex structure, as one would expect of a biological motor capable of spinning fast and driving a (relatively) large paddle to power it along. But for a motor, it has a high degree of similarity to a very different structure: a type III secretion system. This, coupled with the fact that the \"paddle\" is assembled by the motor secreting sub-units down the hollow tube of the rotor and paddle all point to an obvious conclusion: the flagellum motor precursor could have a purpose without a rotor and paddle: it's precursor was a secretion system.\n \n This is the problem with \"irreducible complexity\". Biochemical systems are complex, there is no doubt about that. But everywhere we look, we find homologous structures with completely different functions, precursors to these systems, and a great variety in the form and function of these structures and systems. These are everything that irreducibly complex systems must not have for them to be irreducibly complex. As I have hopefully shown here, it is easy to invoke the \"god of gaps\" approach and say \"this system looks way too complex to have evolved, it must have been designed\", but that doesn't make it designed. Just as once people didn't know how the sun worked and so invoked gods to explain it, so supporters of \"irreducible complexity\" do the same today with biochemical systems. But the march of human knowledge goes on and we find that a god isn't required to make the sun work, and nor is one required to explain the flagellum. There are no irreducibly complex systems, just ever smaller gaps in human knowledge, with ever smaller gods plugging those gaps until they are properly filled in.", 
   {
    "post_info": {
     "post_title": "First post by C14"
    }
   }, 
   150284, 
   null, 
   1122299340.0
  ], 
  [
   150754, 
   null, 
   "The Skeptic", 
   "I don't mean to be rude, but only honest: my opponent has missed the point, and doesn't seem to grasp the idea behind irreducible complexity. I will freely admit that I did not fully grasp the concept when I first ran across it, but thankfully Behe and others make the point very clear. I say thankfully, because otherwise evolutionists would get away with misrepresenting or misunderstanding the facts, and his argument.\n \n Understanding IC. (This is extremely important)\n \n First of all, we need to take a careful look at what irreducible complexity is, especially since it can be a very tricky term. I found the commentary that William A. Dembski had to offer at http://www.designinference.com/documents/2004.01.Irred_Compl_Revisited.pdf to be helpful. He wrote: \n \n \nA functional system is irreducibly complex if it contains a multipart subsystem (i.e., a set of two or more interrelated parts) that cannot be simplified without destroying the system's basic function. I refer to this multipart subsystem as the system's irreducible core.3 This definition is more subtle than it might first appear, so let's consider it closely. Irreducibly complex systems belong to the broader class of functionally integrated systems. A functionally integrated system consists of parts that are tightly adapted to each other and thus render the system's function highly sensitive to isolated changes of those parts. For an integrated system, a change in one place often shuts down the system entirely or else requires multiple changes elsewhere for the system to continue to function. We can therefore define the core of a functionally integrated system as those parts that are indispensable to the system's basic function: remove parts of the core, and you can't recover the system's basic function from the other remaining parts.\n\n \n In other words, we have several all-important issues that my opponent missed: \n \n 1) Irreducibly complex systems can only be simplified to a base system, which cannot be further simplified. This is called the core system, or minimal function. My opponent assumed that, just because something can be simpler than it is, it is not irreducibly complex. His idea has been falsified.\n \n 2) The core parts relate to the basic function of the system.\n \n To help the readers understand this and other, future points, I will use the same irreducibly complex example that Behe uses in his book: the common mouse trap. This came from http://www.discovery.org/scripts/viewDB/filesDB-download.php?id=60\n \n \n[Behe:]A good illustration of an irreducibly complex system from our every day world is a simple mechanical mousetrap. A common mousetrap has several parts, including a wooden platform, a spring with extended ends, a hammer, holding bar, and catch. Now, if the mousetrap is missing the spring, or hammer, or platform, it does not catch mice half as well as it used to, or a quarter as well. It simply does not catch mice at all. Therefore it is irreducibly complex.\n\n \n  What will I cover in this post?\n \n This second affirmative post will rebut essentially 2 issues. My opponent stated that irreducible complexity \"isn't science\" and \"poses no threat to evolutionary theory.\" I will address his arguments regarding variose irreducibly complex systems first, address specific arguments against specific systems second, and, third, I will address his philosophical objections to IC. I will then make some final points for clarification.\n \n Rebutting the simpler-systems-exist argument. (PLEASE MAKE CAREFUL NOTE)\n \n Clives most used argument can be summed up fairly well: \"There are simpler versions of irreducibly complex systems out there. Therefore, irreducibly complex systems can be simplified.\"\n He used this argument against the cilium, the cellular transport systems, the immune system, metabolic pathways, and, last but not least, the bacterial flagellum.\n \n This argument has been well documented, classified, and refuted by ID scientists everywhere. In fact, Behe addressed it in his book:\n \n From \"Darwins Black Box,\" pg. 43, by Behe.\n \nTo feel the full force of the conclusion that a system is irreducibly complex and therefore has no functional precursors, we need to distinguish between a physical precursor and a conceptual precursor. The [mouse] trap described above is not the only system that can immobilize a mouse. On other occasions my family has used a glue trap. In theory, at least, one can use a box propped open with a stick that could be tripped. Of one can simply shoot the mouse with a BB gun. These are not physical precursors to the standard mousetrap, however, since they cannot be transformed, step by Darwinian step, into a trap with a base, hammer, spring, catch, and holding bar. \n To clarify the point, consider this sequence: skateboard, toy wagon, bicycle, motorcycle, automobile, airplane, jet plane, space shuttle. It seems like a natural progression, both because it is a list of objects that all can be used for transportation and because they are lined up in order of complexity. They can be conceptually connected and blended together in a single continuum. But is, say, a bicycle a physical (and potentially Darwinian) precursor of a motorcycle? No. [...] to be a precursor in Darwin's sense we must show that a motorcycle can be built from \"numerous, successive, slight modifications\" to a bicycle.[he also mentions later that all modifications must improve the performance of the bike, not stop the performance.]\n\n \n Other scientific objections to this old argument:\n \n From: http://www.leaderu.com/science/disilvestro-dbb.html\n \n Criticism # 5. Some seemingly complex systems initially worked at a simpler level, which eventually evolved to a more complex, even an irreducibly complex system. This criticism often includes the gene duplication idea discussed above. So, blood clotting could work at a simple level with just a few proteins.\n Rebuttal to criticism # 5. These are just so stories (I'll tell you a story, but not give reasons why it happened). These stories require many jumps in complexity for which there is no rationale for how natural selection could work. Often, these stories are backed up by looking at interspecies variations in protein amino acid contents. Using this data, an evolutionary scenario is constructed for how these changes evolved. However, these scenarios do not typically provide evidence as to how and why these scenarios were likely to occur.\n\n Also from the same source:\n \nCriticism # 6. We have examples of criticism # 5 (simpler versions of more complex biological systems). For instance, simple eye-like visual structures are seen in lower life forms. Therefore, these simpler systems evolved into more complex versions.\n Rebuttal to criticism # 6. In nature, simpler versions of more advanced systems are structural dissimilar in many ways. Thus, primitive eye-like structures in lower life forms are not scaled down versions of human eyes, but are totally different systems.\n\n \n Please carefully read all of the above, because I will be referencing it often.\n \n Taking a look at specific arguments and systems.\n \n  The Cilium.\n \n \na very simple study of cilia found in various organisms shows this above statement to be plain false. Caddis fly sperm cells for example have a 9+7 arrangement of inner and outer ring microtubules, where as eel sperm completely lack the two central microtubules (having a 9+0 arrangement). The protozoan Diplauxis hatti has a very simple 3+0 arrangement that also lacks many of the other components of the \"standard\" cilium. All function just fine.\n\n \n This idea was refuted above in detail. Again, pointing out other kinds of mouse traps is conceptual evolution, a just so story. Clive needs to show that the cilium could have evolved by physical evolution ie, he needs to show how the cilium could have evolved \"by numerous, successive, slight modifications,\" not that other systems can do the cilium's job.\n \n \nFurther the proteins found within the cilium are not restricted to the cilium. Microtubules exist throughout the cell. They act as \"highways\", for example, along which material is moved around the cell in an organised fashion. The protein dynein also exists within the cell: it's the protein that carries materials along microtubules. There are also many types of nexin proteins found within the cell, such as the \"sorting nexins\" that are involved in transporting proteins to and from the cell membrane. All the components for the cilium exist doing other functions: the \"precursors\" are there. The cilium works in a variety of configurations of proteins: not all the proteins must be present for the cilium to function. It is not irreducibly complex.\n\n \n This was also addressed in detail above, when I was explaining irreducible complexity. Just because a system can become slightly less complex doesn't mean that it is not irreducibly complex. You still have the core, ie the parts that are absolutely necessary for it to work. They are irreducibly complex.\n \n Blood clotting\n \n Clive makes the same arguments under this point.\n \n \nTo start with, the entire sequence cannot be viewed as irreducibly complex as Factor XII for example, one of the steps of the sequence, can be removed without affecting the clotting mechanism.\n\n \n Here is probably the point were Clive demonstrates that he does not understand IC the most. In fact, I just addressed this argument 4 paragraphs upwards from this one. Again, there is a core necessary to the organism's survival, that cannot be reduced.\n \n \nFurther the remaining parts have been shown to not be that distinct after all. For example the five proteases have near identical lengths polypeptide chains, have near identical cleave points and have a large number of homologous peptide sequences.\n\n \n Your going to have to explain this further.\n \n \n It is very simple to construct biochemical models that show the evolution of blood clotting. It isn't irreducibly complex.\n\n \n Clive needs to construct such a \"simple\" model, starting from scratch. Just wondering, how do you suppose the animal survived with a blood clotting system in the first place?\n \n Cellular transport systems\n \n \nNotice something in the above? \"Eukaryotes\": these are big complex cells with membrane-bound nucleus, mitochondria and other organelles, with DNA formed into chromosomes etc. There are much simpler cells known as prokaryotes. You may have come across them by another name: bacteria. Bacteria have a much simpler cellular transport system, using what are termed ABC transporters. Simpler cells with a simpler transport system. Cellular transport systems clearly are anything but irreducibly complex.\n\n \n Again, addressed in detail above, under \"Rebutting the simpler-systems-exist argument.\"\n \n The immune system\n \n \nSome primitive jawless fish have no adaptive immune response at all, sharks have lots of genome sequences already assembled for their adaptive immune response and we humans (along with other mammals) use gene splicing to achieve the same range of sequences as sharks using a much smaller starting base. But back to those moths. Some moths produce a chemical called hemolin. This binds to bacteria, aiding their removal from the moths body. Hemolin's peptide sequence has more than a passing resemblance to vertebrate antibodies. So we have a complex \"irreducible\" system reduced to one protein.\n\n \n Yet again, this is addressed under \"Rebutting the simpler-systems-exist argument.\"\n \n Metabolic Pathways\n \n \nThe Kreb's cycle, pentose phosphate pathway, glycogen biosynthesis and amino acid synthesis, to name justa few have been studied, along with their likely evolutionary paths, in detail. These studies have been published. Looks like Behe is making a false claim here.\n\n \n I would especially like to see where you got that quote, since it looks very much like you took it out of context. Behe mentioned and refuted many documents on the topic area within his book. He spent an entire chapter in his book called \"publish or perish\" refuting and discussing evolutionary literature on biochemistry.\n \n \nBut it gets worse, for Sphingomonas chlorophenolica, a lovely little \"eco-friendly\" bacteria, derives its carbon from PCP (the toxic chemical pentachlorophenol). The degrading of PCP to liberate carbon involves three enzymes and removing any kills the sequence and thus the bacteria. An obvious \"irreducibly complex\" system, no? But PCP is a man-made substance that was invented just seventy years ago. So this \"irreducibly complex\" system must have evolved, sorry been \"designed\", in the last 70 years!\n\n \n You are going to have to explain this further, because I am not catching your point, proof, or impact.\n \n Bacterial flagellum\n \n First of all, I would like to correct something I said earlier: that the base parts of the flagellum would be the paddle, rotor, and motor. I also said that it could rotate at a maximum of 10,000 rpm. This is incorrect. According to Jonathan Sarafati, in his book \"Refuting Evolution 2,\" pg 168:\n \n \n [the bacterial flagellum has] the following features:\n \n Self assembly and repair\n Water-cooled rotary engine\n Proton motive force drive system\n Forward and reverse gears\n Operating speeds of up to 100,000 rpm\n Directional reverse capacity within 1/4 of a turn\n Hard wired signal transdction system with short-term memory.\n\n \n I hope that puts things in a more accurate light. Now, lets take a look at Clives objections.\n \n \nTreponema pallidum's flagellum is composed of 38 proteins. Borrelia burgdorferi has only 35 flagellum proteins. Helicobacter pylori requires just 33 proteins to get its flagellum working just fine. We do not know yet what the minimum number of proteins is in modern bacteria, but clearly the 40 protein model is not irreducibly complex.\n\n \n Again, Clive is demonstrating that he does not understand irreducible complexity. This would fall under the first point I made under \"Understanding IC.\"\n \n \nMy opponent refers to three \"components\" of the flagellum: the motor, rotor and paddle and suggests that these too are irreducibly complex as a motor without a rotor and paddle is useless for example. I shall use his terms here even though it is more conventional to refer to four components (the \"paddle\" being made up of the hook and filament and the \"rotor\" being known as the rod).\n\n \n For the sake of simplified accuracy, lets use Sarafati's terms.\n \n \nBut for a motor, it has a high degree of similarity to a very different structure: a type III secretion system. This, coupled with the fact that the \"paddle\" is assembled by the motor secreting sub-units down the hollow tube of the rotor and paddle all point to an obvious conclusion: the flagellum motor precursor could have a purpose without a rotor and paddle: it's precursor was a secretion system.\n\n \n An article I quoted earlier also refuted this point.\n \n From: http://www.leaderu.com/science/disilvestro-dbb.html\n \n Criticism # 3. Evolution can create systems from genes that are already around for other purposes. One example is a gene for a specialized function in insects, which is similar to a gene used for a different reason in mammalian systems. By analogy, this is like a third world mechanic scavenging parts from various types of machines to create a \"Rube Goldberg type\" of motorized vehicle.\n Rebuttal to criticism # 3. How did the genes evolve for the other purposes? This just pushes the question of irreducible complexity backwards from one system to some other. The machine analogy doesn't work because the original machine was designed, as is the new machine. Another problem with the insect/mammal example is that one gene doesn't equal a whole system. So what if one gene in an insect system looks like a gene in a different mammalian system? What about all the genes in the latter system that have no resemblance to genes from insect systems? Instead of the Third World mechanic analogy, I have an alternative analogy. An intelligent designer of nature is like a US engineer using a similar connector wire in both a lawn mower and a motorcycle.\n\n \n Behe also refuted this point in his book.\n \n God of the Gaps?\n \n \nAs I have hopefully shown here, it is easy to invoke the \"god of gaps\" approach and say \"this system looks way too complex to have evolved, it must have been designed\", but that doesn't make it designed. Just as once people didn't know how the sun worked and so invoked gods to explain it, so supporters of \"irreducible complexity\" do the same today with biochemical systems. But the march of human knowledge goes on and we find that a god isn't required to make the sun work, and nor is one required to explain the flagellum. There are no irreducibly complex systems, just ever smaller gaps in human knowledge, with ever smaller gods plugging those gaps until they are properly filled in.\n\n \n Please especially note the underlined. This response has also been categorized and refuted by scientists. \n \n From: http://www.leaderu.com/science/disilvestro-dbb.html\n \n Criticism # 1. This is a new version of the God of the gaps. Once, when science could not explain how something in nature worked, people would just say: \"God does it.\" Now, as science has progressed, we don't need God to explain such gaps.\n \n Rebuttal to criticism # 1. There is a difference between explaining ongoing natural processes and the origins of natural processes. To use an analogy, just because a software program runs without the creator being present doesn't mean we should say there was no personal creator. Also, evolutionary theory has its own gaps that are assumed to occur without support by direct evidence. This is not to say that a broad theory of science has to explain every detail before being accepted. However, when it comes to evolutionary theory, far more gaps are accepted than are typical for other scientific theories.\n \n There is another reason why Dr. Behe's ideas should not be equated to the God of the gaps idea. In the past, the gaps were generally due to lack of information about certain natural processes. In contrast, Dr. Behe's ideas involve processes where we do have information. That information, though not complete, is sufficient to indicate problems with postulating completely naturalistic explanations.\n\n \n A request of Clive\n \n I would greatly appreciate it if you would start citing your sources, so that our readers can look directly on the facts and make up their own minds. Instead, you have merely been asserting your beliefs without proof. If you continue to do this, I will simply point out that your only source is yourself, while I have backing from many scientists.\n \n Since I have refuted every point that you brought up, I look forward to reading your next post.\n \n TS  \n \n PS: I would like to point out for the moderator that Clive was the one that suggested expanding the amount being disgussed by 8x.", 
   {
    "post_info": {
     "post_title": "Post 2 from TS"
    }, 
    "unicode_changes_made": true
   }, 
   150439, 
   null, 
   1122401700.0
  ], 
  [
   151086, 
   null, 
   "Clive14", 
   "In my previous post, I made the claim that \"[Irreducible complexity] isn't science, it poses no threat to evolution theory and it deserves to be consigned to the dustbin of history.\". I stated that there were a series of reasons behind this claim. Having addressed the lack of an concrete examples of irreducible complexity in my previous post, I shall move on to the next reason: Irreducible complexity is poorly defined and unscientific in nature.\n \n In \"Darwin's Black Box\", Behe defines the idea of Irreducible complexity thus:\n \n \nBy irreducibly complex I mean a single system composed of several well-matched, interacting parts that contribute to the basic function, wherein the removal of any one of the parts causes the system to effectively cease functioning. An irreducibly complex system cannot be produced directly (that is, by continuously improving the initial function, which continues to work by the same mechanism) by slight, successive modifications of a precursor system, because any precursor to an irreducibly complex system that is missing a part is by definition nonfunctional. An irreducibly complex biological system, if there is such a thing, would be a powerful challenge to Darwinian evolution\nLet us take that a bit at a time:\n \n \n...a single system composed of several well-matched, interacting parts that contribute to the basic function, wherein the removal of any one of the parts causes the system to effectively cease functioning\nThis seems clear enough: find a system that stops working when a part is taken away and it is \"irreducibly complex\" (actually it is simply \"tightly coupled\", which is a big no-no in the design world - more on that in my next post, but we will stick to Behe's label of \"irreducibly complex\" here.)\n \n Next:\nAn irreducibly complex system cannot be produced directly ... by slight, successive modifications of a precursor system, because any precursor to an irreducibly complex system that is missing a part is by definition nonfunctional\n\n \n So an irreducibly complex system cannot evolve through natural selection as a \"half evolved\" system would be lacking parts and thus would be inherently non-functional.\n \n That all seems pretty clear to me, and I'm sure to most of you too. So why therefore does my opponent feel the need to claim:\n \n \nmy opponent has missed the point, and does not seem to grasp the idea behind irreducible complexity. I will freely admit that I did not fully grasp the concept when I first ran across it, but thankfully Behe and others make the point very clear. I say thankfully, because otherwise evolutionists would get away with misrepresenting or misunderstanding the facts, and his argument\n\n \n The reason my opponent makes that claim is because Behe's definition was too precise: it was a good hypothesis statement and was easily tested scientifically. Unfortunately for Behe all of his examples were shown not to be irreducibly complex by his own definition when tested! At this point, a true scientific hypothesis would have been disproven and the world would move on. Sadly for the world, the \"irreducible complexity\" baton wasn't binned after being dropped, it was picked up and carried to the finish line by cutting directly across the field. Behe's original precise definition suddenly needs \"clarifying\" to protect it from \"misrepresentations\" and \"misunderstandings\".\n \n Later versions of \"irreducible complexity\" (that I shall refer to as IC henceforth) react to the dismissal of Behe's original examples by putting extra requirements upon the scientific community. No longer is it sufficient to show a functioning precursor to explain why a system isn't an IC system, now it is necessary to offer an explanation of how every precursor step led to the extant system. Then it is no longer sufficient to offer an explanation of how every precursor step led to the extant system as such an explanation is a \"just so\" story. Now one must describe exactly how each step occurred, then one must prove every step occurred and so forth ad infinitum. \n \n This \"retreat and redefine\" strategy is neatly demonstrated by my opponent. I explained that the cilium is far from being an IC system as all the parts of the \"standard\" 9+2 microtubule are not required (for example, as described in http://www.ncbi.nlm.nih.gov/books/bv.fcgi?rid=mcb.section.5478, the 3+0 arrangement of Daplius, results in a slow beating cilium, rather than a non-functioning one (actually called a flagellum due to its length, but not to be confused with the bacterial flagellum which is a wholly different structure). I further explain that the proteins making up the cilium, far from \"combin[ing] to perform one task, ciliary motion\" as Behe claims, actually combine to perform multiple tasks within the cell (see http://cellbio.utmb.edu/cellbio/microtub.htm for details on microtubules and their various roles within cells). What response do I receive from showing that the components have multiple uses and that the 9+2 structure is reducible? I'm telling a \"just so\" story apparently.\n \n My opponent attempts to rebut most of my post by appealing to the idea that I present everything as &#8220;There are simpler versions of irreducibly complex systems out there. Therefore, irreducibly complex systems can be simplified.&#8221; This is a misrepresentation, but a necessary one for him to shoehorn someone else's \"argument and rebuttal\" set into addressing my points. It isn't a case of \"irreducibly complex systems can be simplified\". It is a case of biological systems being easily modified in function by changing the structure of proteins. This allows precursors to a system to have utterly different functions to their equivalents in the system in question. \n \n To talk in terms of \"simple\" and \"complex\" is misleading. A case in point is brown adipose tissue. This \"brown fat\" or BAT, found in mammals has a specific function: it generates heat. It does this by utilising the protein UCP-1 in its mitochondria. UCP-1 allows hydrogen (H+) ions to cross from the mitochondrial space into the matrix. Normally, as part of oxidative phosphorylation, the H+ ions are pumped through a highly complex structure called ATP synthase, producing ATP (the \"power source\" of just about all cell activity). UCP-1 has yet to have its structure fully worked out, but it is many orders of magnitude simpler than ATP synthase, for it is basically a hole in a membrane rather than a rotating pump and catalyst system. There are good reasons to suppose that UCP-1 arose after ATP synthase (the latter is found in all mitochondria of all eukaryotes, the former is only found in mammals), yet it is simpler in form and function. Which part of this overall system is the \"irreducibly complex\" part? Clearly the question makes no sense when thought of \"simple\" and \"complex\" terms.\n (http://www.gwu.edu/~mpb/oxidativephos.htm has a brief description of oxidative phosphorylation, http://www.cse.ucsc.edu/~hongwang/Images/ATP_synthase.jpg for example shows the structure of ATP Synthase and http://www.bio.davidson.edu/people/midorcas/animalphysiology/websites/2004/Ruble/functions.htm has a brief description of BAT)\n \n The rest of the \"rebuttals\" broadly fall into the \"your are telling a 'just so' story\" camp. This claim, that simply showing a system isn't irreducibly complex is insufficient to prove it isn't an IC system (a bizarre claim, I know), stems from Behe himself as my opponent quotes:\n \n \nTo clarify the point, consider this sequence: skateboard, toy wagon, bicycle, motorcycle, automobile, airplane, jet plane, space shuttle. It seems like a natural progression, both because it is a list of objects that all can be used for transportation and because they are lined up in order of complexity. They can be conceptually connected and blended together in a single continuum. But is, say, a bicycle a physical (and potentially Darwinian) precursor of a motorcycle? No. ... to be a precursor in Darwin&#8217;s sense we must show that a motorcycle can be built from \"numerous, successive, slight modifications\" to a bicycle.\nThis quote shows the sloppiness of Behe's thinking and research at times. Even a cursory examination of motorbike history shows that early motorbikes really were bicycles with a slight modification: they had an engine attached to the existing drive mechanism (see http://www.virginiawind.com/byways/history_01.asp and http://www.virginiawind.com/byways/history_02.asp for some fascinating pictures of these early \"motor bicycles\"): bicycles were the physical (and potentially Darwinian apparently) precursor of a motorcycle. Clearly they are not Darwinian precursors, for they were designed rather than evolving through natural selection, but this highlights another point: the IC brigade cannot even come up with coherent examples when trying to defend their position.\n \n On the subject of poor examples, most people will likely be familiar with Behe's use of the mousetrap as an IC system (he refers to it in my opponent's quoted document \"Answering Scientific Criticisms of Intelligent Design\" - http://www.discovery.org/scripts/viewDB/filesDB-download.php?id=60 for example). Even with this iconic example, the flaws in the ideas of IC are evident. He claims \"If any one of the components of the mousetrap (the base, hammer, spring, catch, or holding bar) is removed, then the trap does not function. In other words, the simple little mousetrap has no ability to trap a mouse until several separate parts are all assembled. Because the mousetrap is necessarily composed of several parts, it is irreducibly complex.\" I invite the reader to take a look at http://udel.edu/~mcdonald/mousetrap.html wherein the the \"irreducibly complex\" mousetrap is reduced to one functioning component and then \"evolves\" through \"numerous, successive, slight modifications\" into the normal trap. Further, http://answers.org/newlook/behe2.html contains a detailed, step by gradual step, of the \"evolution\" of a \"simple box and stick trap\" into a \"normal\" mousetrap. John McDonald and Don Stoner (a creationist, no less) obviously present genuine \"just so\" stories here as we know that the mousetrap was designed, but they clearly shows that it is possible, with a bit of ingenuity, to propose a possible evolutionary path to any suggested IC system. \n \n The inventiveness of humanity is a problem for IC. IC relies on the premise that no one can explain how the system arose through natural selection. If one can explain how it might have arisen, then believing the system designed becomes merely a personal incredulity fallacy. To escape from this and establish itself as science, IC has to be capable of being submitted to the scientific method. We make the observation: some systems appear irreducibly complex. We form a hypothesis: some systems are irreducibly complex because it is impossible (or highly improbable if you prefer, it makes no difference) that they evolved through natural selection. Next we need the prediction: if system x is an irreducibly complex system, it will be impossible to propose a route by which the system arose through natural selection. When we test this prediction though, we find it wanting as even obviously designed systems such as the mousetrap can be explained via the natural selection route. The prediction fails and so no evidence is gathered for the hypothesis. IC \"theory\" has singularly failed to gather any scientific evidence to its cause. Put another way, irreducible complexity is not a science.", 
   {
    "post_info": {
     "post_title": "Post 2 by C14"
    }
   }, 
   150754, 
   null, 
   1122477480.0
  ], 
  [
   151713, 
   null, 
   "The Skeptic", 
   "The repeated stroke will fell the oak. - German Proverb\n \n This apparently sums up my opponent's mindset or else I was not clear enough in my refutation of his ideas in my last post, because my opponent has merely repeated himself in several areas. Besides this, he has attacked Behe's character (as apposed to his argument), and, yet again, used thoroughly refuted arguments. I will try to be more clear. The topics covered in this post are as follows:\n \n 1) Clive's understanding of irreducible complexity (IC) is incorrect.\n 2) Getting a better understanding of why the \"simper-systems-exist\" argument doesn't cut the cheese.\n 3) Addressing attacks on Behe's character and metaphors.\n 4) IC is science.\n \n Now, lets take a careful look at what Clive thinks Behe and I mean when we say \"irreducible complexity\":\n \nThis seems clear enough: find a system that stops working when a part is taken away and it is \"irreducibly complex\" \n\n \n \n Behe cleared up this misconception in 1997, probably less than a year after he wrote his book. From: \n http://www.discovery.org/scripts/viewDB/index.php?command=view&id=47\n \n \nProfessor Orr has a mistaken notion of irreducible complexity. I thought I made that clear in my reply, but from his response I suppose I did not, so let me try again. I define irreducible complexity in Darwin's Black Box as \"a single system composed of several well-matched, interacting parts that contribute to the basic function, wherein the removal of any one of the parts causes the system to effectively cease functioning.\" Orr, however, uses the term loosely to mean something like \"if you remove a part, the organism will die.\" \n\n \n \n Here is one of the keys to understanding the concept: all of the parts work together for one purpose. Each core part is designed to work with each other part, each interacts with other parts. They are all necessary to complete that one vital, core function. \n \n As I stated in my second post, it can be tricky term.\n \n \nSo an irreducibly complex system cannot evolve through natural selection as a \"half evolved\" system would be lacking parts and thus would be inherently non-functional. \n\n \n This is a total misrepresentation of the subject at hand. A mutation could never create a \"half-organ\" in the first place. According to neo-darwinian theory, the organism must be built, protein by protein (ect...ect..), until we get what we have today. Remember, a huge leap of, say, 3 proteins, all built, moved, and positioned in exactly the right places, is effectively and mathematically impossible. So all mutations can do is make a very slight change, even assuming that such a change could be beneficial in the first place.\n \n Here is the point: Even if a mutation could cause a protein (or whatever) to be built, moved, and positioned in the correct place, Clive still has a major problem. In the IC system that he is trying to build, several other parts of the organism would have to simultaneously mutate in just the right way to accommodate the other mutations, perfectly. Why would they have to simultaneously mutate? Because natural selection does not select organisms with loose parts hanging around, waiting for other random mutations to make them useful.\n \n Getting a better understanding of why the \"simper-systems-exist\" argument doesn't cut the cheese.\n \n \nThis \"retreat and redefine\" strategy is neatly demonstrated by my opponent. \n\n \n \n We need to deal with this first. As I pointed out earlier this is how Behe has interpreted himself from the very beginning. If Clive thinks otherwise, he probably either hasn't read Behe's works, or is trying not to understand them. \n \n \nI explained that the cilium is far from being an IC system as all the parts of the \"standard\" 9+2 microtubule are not required (for example, as described in http://www.ncbi.nlm.nih.gov/books/b...cb.section.5478, the 3+0 arrangement of Daplius, results in a slow beating cilium, rather than a non-functioning one (actually called a flagellum due to its length, but not to be confused with the bacterial flagellum which is a wholly different structure). I further explain that the proteins making up the cilium, far from \"combin[ing] to perform one task, ciliary motion\" as Behe claims, actually combine to perform multiple tasks within the cell (see http://cellbio.utmb.edu/cellbio/microtub.htm for details on microtubules and their various roles within cells). What response do I receive from showing that the components have multiple uses and that the 9+2 structure is reducible? I'm telling a \"just so\" story apparently. \n\n \n \n In the light of what I explained in my last post, I see no reason why this matters. You were not only not explaining why things evolved the way that they did, but you also fail to recognize the fact of the core system: the base, were all parts, put together are IC. Unfortunately for evolutionists, chemicals don't just magically evolve. Those annoying little biochemical facts get in the way.\n \n In any case, the cilium is only one of 8 IC systems that have been presented.\n \n [quote]It is a case of biological systems being easily modified in function by changing the structure of proteins. This allows precursors to a system to have utterly different functions to their equivalents in the system in question. [/quiote]\n \n \n And, as I have shown, Clive has not demonstrated, proven, or even logically thought through this. These \"precursors\" were totally and prohibitively different systems. IC systems parts work together for one purpose: other, totally different systems can accomplish that purpose, but they are not logical steps in an evolutionary pathway. I will address this further under his attacks on Behe and his metaphors. \n \nTo talk in terms of \"simple\" and \"complex\" is misleading. \n\n \n \n What terms would you propose we use? Is not a hole in the ground less complex than a mouse trap?\n \n Addressing attacks on Behe's character and metaphors.\n \nThis quote shows the sloppiness of Behe's thinking and research at times. Even a cursory examination of motorbike history shows that early motorbikes really were bicycles with a slight modification: they had an engine attached to the existing drive mechanism (see http://www.virginiawind.com/byways/history_01.asp and http://www.virginiawind.com/byways/history_02.asp for some fascinating pictures of these early \"motor bicycles\"): bicycles were the physical (and potentially Darwinian apparently) precursor of a motorcycle. Clearly they are not Darwinian precursors, for they were designed rather than evolving through natural selection, but this highlights another point: the IC brigade cannot even come up with coherent examples when trying to defend their position. \n\n \n \n As Behe demonstrated in his book, this claim means nothing. Take a look: (from \"Darwin's Blackbox,\" pg 43)\n \nIt might easily be the case that a teenager on a Saturday afternoon could take an old bicycle, an old lawnmower engine, and some spare parts and (with a couple hours effort) build himself a functioning motorcycle. But this only shows that humans can design irreducibly complex systems, which we knew already. To be a precursor in Darwin's sense, we must show that a motorcycle can be built from \"numerous, successive, slight modifications\" to a bicycle. So let us attempt to evolve a bicycle into a motorcycle by the gradual accumulation of mutations. Suppose that a factory produced bicycles, but that occasionally there was a mistake in the manufacture. Let us further suppose that if the mistake led to an improvement in the bicycle, then the friends and neighbors of the lucky buyer would demand similar bikes, and the factory would retool to make the mutation a permanent feature. So, like biological mutations, successful mechanical mutations would reproduce and spread. If we are to keep our analogy relevant to biology, however, each change can only be a slight modification, duplication, or rearrangement of a preexisting component, and the change must improve the function of the bicycle. So if the factory mistakenly increased the size of a nut or decreased the diameter of a bolt, or added an extra wheel onto the front axle or left off the rear tire, or put a pedal on the handle bars or added extra spokes, and if any of these slight changes improved the bike ride, then the improvement would immediately be noticed by the buying public and the mutated bikes would, in true Darwinian fashion, dominate the market.Given these conditions, can we evolve a bicycle into a motorcycle? We can move in the right direction by making the seat more comfortable in small steps, the wheels bigger, and even (assuming our customers prefer the \"biker\" look) imitate the overall shape in various ways. But motorcycle depends on a source of fuel, and a bicycle has nothing that can be slightly modified to become a gasoline tank. And what part of the bicycle would be duplicated to begin building the motor? Even if a lucky accident brought a lawnmower engine from a neighboring factory, the motor would have to be mounted on the bike and be connected in the right way to the drive chain. How could this be done step-by-step from bicycle parts? ...A bicycle thus may be a conceptual precursor to a motorcycle, but it is not a physical one. Darwinian evolution requires physical precursors. \n\n \n \n I find it hard to see exactly how Clive will get around it this time.\n \n \nOn the subject of poor examples, most people will likely be familiar with Behe's use of the mousetrap as an IC system (he refers to it in my opponent's quoted document \"Answering Scientific Criticisms of Intelligent Design\" - http://www.discovery.org/scripts/vi...nload.php?id=60 for example). Even with this iconic example, the flaws in the ideas of IC are evident. He claims \"If any one of the components of the mousetrap (the base, hammer, spring, catch, or holding bar) is removed, then the trap does not function. In other words, the simple little mousetrap has no ability to trap a mouse until several separate parts are all assembled. Because the mousetrap is necessarily composed of several parts, it is irreducibly complex.\" I invite the reader to take a look at http://udel.edu/~mcdonald/mousetrap.html wherein the the \"irreducibly complex\" mousetrap is reduced to one functioning component and then \"evolves\" through \"numerous, successive, slight modifications\" into the normal trap. Further, http://answers.org/newlook/behe2.html contains a detailed, step by gradual step, of the \"evolution\" of a \"simple box and stick trap\" into a \"normal\" mousetrap. John McDonald and Don Stoner (a creationist, no less) obviously present genuine \"just so\" stories here as we know that the mousetrap was designed, but they clearly shows that it is possible, with a bit of ingenuity, to propose a possible evolutionary path to any suggested IC system. \n\n \n \n This is another categorized, labled, and long refuted argument. Behe refuted the \"evolved mouse trap\" that McDonald gave at http://www.discovery.org/scripts/viewDB/index.php?command=view&id=446\n \n Your other example suffers from many of the same problems. If you want to further pursue this, I can provide a list.\n \n IC is science.\n \nThe inventiveness of humanity is a problem for IC. IC relies on the premise that no one can explain how the system arose through natural selection. If one can explain how it might have arisen, then believing the system designed becomes merely a personal incredulity fallacy. \n\n \n Though it covers more than your issue, I hope that this will help clear this issue up for you. From: http://www.leaderu.com/science/disilvestro-dbb.html\n \nCriticism # 8. \"I don't know how it could happen\" doesn't equal \"It couldn't happen.\" Behe states that he can't imagine how some system evolved. However, that doesn't mean that the system couldn't have evolved. A scientist should not give up so easily on natural explanations, especially in light of powerful new technology.Rebuttal to criticism # 8. The technology issue is at best, a break even situation. We don't know whether new technology will give evidence for or against Behe's ideas. There is another problem with the basic assumption of criticism # 8. An \"I don't know how\" statement is sometimes considered impressive. For instance, I work with copper enzymes which take electrons from oxygen or superoxide. If someone proposed that some copper enzyme gives electrons to oxygen, I would say: \"I don't know how that could work.\" That's a reasonable response because the proposal has some theoretical problems, and it goes against current observational precedent. The same can be said for the origins of complex biological systems. Saying that these developed by chance goes against the precedents we have from every day life. For example, we can tell the difference between a painting of an alligator and a cloud pattern that looks a little like an alligator. The degree of complexity tells us one is designed and one is not. Similarly, we know a rock bridge can form by natural processes alone, but the Golden Gate Bridge was designed. \n\n \n \n Similarly to the technology issue, we don't know if there is a way that IC systems could have evolved. Remember, every part in the core system is working with every other part, if any part is slightly changed, the whole system doesn't work. Based upon the advanced technology and thought of our day, it looks very likely that they did not evolve. \n I admire your faith, but, frankly, I don't have enough faith to be an evolutionist.\n \nTo escape from this and establish itself as science, IC has to be capable of being submitted to the scientific method. We make the observation: some systems appear irreducibly complex. We form a hypothesis: some systems are irreducibly complex because it is impossible (or highly improbable if you prefer, it makes no difference) that they evolved through natural selection. Next we need the prediction: if system x is an irreducibly complex system, it will be impossible to propose a route by which the system arose through natural selection. When we test this prediction though, we find it wanting as even obviously designed systems such as the mousetrap can be explained via the natural selection route. The prediction fails and so no evidence is gathered for the hypothesis. IC \"theory\" has singularly failed to gather any scientific evidence to its cause. Put another way, irreducible complexity is not a science. \n\n \n \n I hope I have been clear enough to help my readers understand why this is extremely flawed logic, in that IC does meet the scientific method. I have refuted every attack made by Clive, again. And again, he outrageously claims that IC isn't science because of some of the very things that I refuted in my last post. IC is a reason that evolution doesn't meet the scientific method.\n \n In summary, every single one of my opponents attacks on IC do not stand up in the light of reason. Evolution has been exposed for what it is: blind faith in the impossible.\n \n TS ", 
   {
    "post_info": {
     "post_title": "3rd Post From TS"
    }, 
    "unicode_changes_made": true
   }, 
   150125, 
   null, 
   1122666180.0
  ], 
  [
   152267, 
   null, 
   "Clive14", 
   "In my first post, I made the claim that \"[Irreducible complexity] isn't science, it poses no threat to evolution theory and it deserves to be consigned to the dustbin of history.\". I stated that there were a series of reasons behind this claim. These reasons can be grouped, broadly speaking, into three categories. I have covered two of these already. Firstly I addressed the lack of an concrete examples of irreducible complexity. Next I covered why irreducible complexity is poorly defined and unscientific in nature. In my third post I shall cover the third and final part, namely that the very nature of \"irreducibly complex\" systems pose no threat to evolution theory and actually undermines that \"sheep in wolves' clothing\" of the creation world: intelligent design.\n \n There is a lot of misunderstanding surrounding what natural selection is amongst supports of IC and a lot of their mistaken beliefs about IC being scientific stem from this. This misunderstanding also leads to some rather odd claims. A case in point is the claim by my opponent that \"...natural selection does not select organisms with loose parts hanging around, waiting for other random mutations to make them useful\". To put it bluntly: my opponent doesn't know what he is talking about. Whether it be \"broken\" genes (more accurately called psuedogenes) such as for vitamin C synthesis in humans (http://wine1.sb.fsu.edu/BCH4053/Lecture33/Lecture33.htm), incredibly inefficient use of resources such as mass gene switching in tritryps (http://www.newscientist.com/article.ns?id=mg18725094.000 - please send me a personal message if you wish to read the full article) or \"chaperone\" proteins such as hsp90 suppressing mutation affects (http://www.hhmi.org/news/lindquist.html), the genone is littered with \"loose parts\" that really do \"[hang] around, waiting for other random mutations to make them useful\". The assumption that these loose parts cannot exist stems of course from failing to understand that natural selection will only select against a mutation if it reduces the organism's fitness (more precisely fecundity). If it has no affect upon fecundity, then there is no selection pressure upon it. It need not do anything useful, it simply needs to have no negative affect upon fecundity.\n \n This same lack of understanding of natural selection extends to Behe himself. His whole argument for irreducible complexity hinges around the claim that natural selection works through \"slight, successive modifications\". He gets this idea (apparently, judging by his quoting of the man), from Darwin. Our knowledge of evolution has moved on leaps and bounds since Darwin's day. These days we have plenty of evidence to suggest that evolution doesn't (always) occur in \"slight, successive modifications\" despite Behe's need for it to do so. As mentioned above, proteins such as hsp90 have been found to suppress the affects of many mutations and these mutations can suddenly be released, resulting in massive, concurrent modification. Further, natural selection quite probably isn't the whole story with evolution as there is evidence that random selection, also known as \"ecological fitting\" (http://www.mongabay.com/external/man-made_rainforest.htm) and punctuated equilibrium play their part in evolution for example.\n \n As if the realisation that evolution can progress through fits and starts with dramatic sudden changes wasn't enough, there is a further problem for IC and it is irreducible complexity itself that is the problem. As I briefly mentioned in my last post, an IC system is actually better described as a tightly coupled system. As explained by http://www.site.uottawa.ca:4321/oose/index.html#tightcoupling, a tightly coupled system is one where all the parts are dependent upon each other and changing or removing one of those parts causes the system to fail necessitating further changes. Tight coupling is an example of bad design, and though it tends to be inevitable in complex systems, a lot of effort is put into minimising it as it causes so many problems with safety critical systems (http://www.rednova.com/news/space/3586/nasa_may_have_grown_blind_to_shuttle_warnings/ for example). So why is life littered with these highly coupled, and thus badly \"designed\" systems? The conclusion is is probably obvious to you, but just in case you are in any doubt, consider the case of \"evolved\" electronic circuits, such as http://www.netscrap.com/netscrap_detail.cfm?scrap_id=73 .Allow evolution to run its course on a programmable logic array and we end up with a complex, highly coupled, system that has all the hallmarks of irreducible complexity. Coincidence? Yeah, right!\n \n The final nail though in the coffin of the claim that IC somehow threatens evolution is of course the vast mass of evidence in support of evolution that is unrelated to IC. Even Behe acknowledged this:\n \n \nFor the record, I have no reason to doubt that the universe is the billions of years old that physicists say it is. Further, I find the idea of common descent (that all organisms share a common ancestor) fairly convincing, and have no particular reason to doubt it.\n\n \n So the idea that life first appeared billions of years ago and has evolved, through common descent, into what we see today is seen as fitting alongside IC by the very man who proposed IC. My opponent however chooses to ignore this aspect of Behe's argument and claims that IC somehow \"proves neo-Darwinism incorrect\". He has two posts left, so I guess he is saving this \"proof\" up as his grande finale.", 
   {
    "post_info": {
     "post_title": "Post 3 by C14"
    }
   }, 
   151713, 
   null, 
   1122983100.0
  ], 
  [
   152952, 
   null, 
   "The Skeptic", 
   "I would like the judges to carefully note that Clive14 has, for almost all practical purposes, ignored my refutations of his first two posts. After this post, I will have refuted every argument that Clive14 has made, and he will not be allowed to bring up a whole new armada of arguments in his final post. Therefore, I believe that after this post I will have won the debate.\n \n Clive14's arguments from his 3rd post can be summarized under these points, which I will cover in this post:\n \n 1) Does natural selection select damaged organisms with useless parts? \n \n 2) Has natural selection selected organisms with useless parts?\n \n 3) Punctuated Equilibrium, ecological fitting, quantum mutational leaps, and computer simulations?\n \n 4) Does Behe advocate that an intelligent designer does not exist?\n \n  Does natural selection select damaged organisms with useless parts? \n \n \n...the genone is littered with \"loose parts\" that really do \"[hang] around, waiting for other random mutations to make them useful\". The assumption that these loose parts cannot exist stems of course from failing to understand that natural selection will only select against a mutation if it reduces the organism's fitness (more precisely fecundity). If it has no affect upon fecundity, then there is no selection pressure upon it. It need not do anything useful, it simply needs to have no negative affect upon fecundity.\n\n \n \n This is a misrepresentation of my argument. I did not state that they could not exist, but that natural selection does not select them, therefore they will not spread through the population. If they do not spread through the population, they cannot be built upon by future mutations. Behe says this well at http://www.discovery.org/scripts/viewDB/index.php?command=view&id=442: (He is specifically addressing the irreducible complexity of blood clotting)\n \n \n [Behe:] I argue that, while Robison's scenario does indeed build a new step in the cascade, it doesn't do it by Darwinian means. Rather, it does so by Robison's intelligent direction. Here are a couple pertinent quotes from the several steps of his scenario (Robison 1996): \"This arrangement is neutral; the species has gained no advantage.\"; \"Again, this genotype is neutral; it is neither beneficial nor detrimental.\"; \"The initial steps are neutral, neither advantageous nor disadvantageous.\" \"The final step locks in the cascade. It is potentially advantageous . . . .\" (my emphasis--the \"potentially\" advantageous final step would require a further mutation to make it actually advantageous, so before that happens it is neutral.).\n \n Thus his scenario postulates four successive, very specific steps: 1) gene duplication of the particular multi-talented enzyme; 2) the first loss of function step; 3) the second loss of function step; 4) a step to take advantage of the situation. As Robison emphasized, the first three steps are neutral; that is, they do the organism neither harm nor good. Only when the fourth step is completed is there a selective advantage. Now, it must be remembered that the Darwinian magic depends on natural selection. If a trait is advantageous, it will take over a population, thus providing a large base from which the next advantageous mutation might arise. However, if a trait is neutral, providing no advantage, it is far, far less likely to spread, so the odds of a second mutation appearing that depends on the first are not improved at all--they're pretty much the same as luckily getting the two specific mutations simultaneously. In the final analysis Robison's scenario is completely non-Darwinian. It postulates an already-functioning system that wasn't justified in Darwinian terms, and it then goes through three neutral, non-selected steps. Only at the very end is there a selectable property that wasn't postulated at the beginning.\n \n To get a flavor of the difficulties Robison's scenario faces, note that standard population genetics says that the rate at which neutral mutations become fixed in the population is equal to the mutation rate. Although the neutral mutation rate is usually stated as about 10^-6 per gene per generation, that is for any random mutation in the gene. When one is looking at particular mutations such as the duplication of a certain gene or the mutation of one certain amino acid residue in the duplicated gene, the mutation rate is likely about 10^-10. Thus the fixation of just one step in the population for the scenario would be expected to occur only once every ten billion generations. Yet Robison's scenario postulates multiple such events.\n\n \n Clearly, an IC system cannot originate from non-selected mutations without an intelligent designer.\n \n Has natural selection selected organisms with useless parts or \"Bad Design?\"\n \n \n [Clive:]Whether it be \"broken\" genes (more accurately called psuedogenes) such as for vitamin C synthesis in humans (http://wine1.sb.fsu.edu/BCH4053/Lecture33/Lecture33.htm), \n \n \n Clive has brought up the latest so called \"vestigial\" systems that supposedly explain evolution. Evolutionists have been embarrassed time and time again, as scientists found out that they really did have a function. Behe put the main objection well at: http://www.discovery.org/scripts/viewDB/index.php?command=view&id=1448\n \n \n [Behe:] The modern molecular example of poor design is pseudogenes. Why litter a genome with useless, broken copies of functional genes? It looks just like the aftermath of a blind, wasteful process. No designer would have done it that way.(2) Yet Hirotsune et al (3) show that at least one pseudogene has a function. If at least some pseudogenes have unsuspected functions, however, might not other biological features that strike us as odd also have functions we have not yet discovered? Might even the backwards wiring of the vertebrate eye serve some useful purpose?\n\n \n The remainder of Clives relative argument can be summed up in these two quotes:\n \n \nincredibly inefficient use of resources such as mass gene switching in tritryps (http://www.newscientist.com/article...=mg18725094.000 - please send me a personal message if you wish to read the full article) or \"chaperone\" proteins such as hsp90 suppressing mutation affects (http://www.hhmi.org/news/lindquist.html), \n\n \n \n As I briefly mentioned in my last post, an IC system is actually better described as a tightly coupled system. As explained by http://www.site.uottawa.ca:4321/oos...l#tightcoupling, a tightly coupled system is one where all the parts are dependent upon each other and changing or removing one of those parts causes the system to fail necessitating further changes. Tight coupling is an example of bad design, and though it tends to be inevitable in complex systems, a lot of effort is put into minimising it as it causes so many problems with safety critical systems (http://www.rednova.com/news/space/3...uttle_warnings/ for example). So why is life littered with these highly coupled, and thus badly \"designed\" systems?\n\n \n Behe also refuted this sort of idea in his book. From Darwin's Black Box, pgs 226-227\n \n \n [Behe:] I just cannot ignore the evidence for design. If I insert a letter into a photocopier, for instance, and it makes a dozen good copies and one copy that has a couple of large smears on it, I would be wrong to use the smeared copy as evidence that the photocopier arose by chance. \n Arguments based on perceived faults or vestigial genes and organs run the danger of the argument of Diogenes that the progression of seasons shows intelligent design. It is scientifically unsound to make any assumptions of the way that things ought to be. \n\n \n Behe also stated on pg 228:\n \n \n[Jay Gould] assumes that the designer would act as he would, that the panda's thumb \"ought\" to be arranged a different way. He then takes those assertions to be positive evidence for evolution. Gould has never done the science to support his idea: he has not shown or calculated what the minimum extension of the wristbone would have to be to help the panda; he has not justified the behavioral changes that would be necessary to take advantage of the change in bone structure; and he has not mentioned how panda's ate before acquiring a thumb. He has not done anything except spin a tale.\n\n \n Similar to the panda's thumb, we don't know that the designer would think exactly like Clive, or even humans for that matter. We might, as has been shown numerous times in the past, discover that the system does have a purpose, or is better at fulfilling its purpose than we thought. Also, according to creationism, we should see some systems that don't work perfectly, because of what happened after the Garden of Eden.\n \n 3) Punctuated Equilibrium, ecological fitting, quantum mutational leaps, and computer simulations?\n \n \n[Clive]Further, natural selection quite probably isn't the whole story with evolution as there is evidence that random selection, also known as \"ecological fitting\" (http://www.mongabay.com/external/ma..._rainforest.htm) and punctuated equilibrium play their part in evolution for example.\n\n \n The example of ecological fitting, aka microevolution, that you gave did not create any irreducibly complex organisms. Since the evolutionary interpretation of ecological fitting (to my knowledge) is governed by natural selection and mutation, it could not create an irreducibly complex system. Therefore, it is irrelevant. \n \n As to the punctuated equilibrium, it is a totally separate issue from the resolution, which specifically says \"Neo-Darwinism.\" I would be happy to give you a stack of problems with it when this debate is over. In any case, it still works on the ideas of natural selection and mutation, and could not build an irreducibly complex system. \n \n \nAs mentioned above, proteins such as hsp90 have been found to suppress the affects of many mutations and these mutations can suddenly be released, resulting in massive, concurrent modification.\n\n \n For the reader, I think it is necessary to translate what Clive is saying. Translation: \"Maybe, by sheer dumb luck, a lot of totally random distortions of an organisms genetic code, aka mutations, happened all at once, creating a new organism.\" This idea appears to be a modified version the \"Hopeful Monsters\" idea proposed in the 1930s. Behe spent a large portion of his book refuting this idea. From Darwin's Black Box, pg 40.\n \n \n [Behe:] In the abstract, it might be tempting to imagine that irreducible complexity simply requires multiple simultaneous mutations - that evolution might be far chancier than we thought, but still possible. Such an appeal to brute luck can never be refuted. Yet it is an empty argument. One may as well say that the world luckily popped into existence yesterday with all the features that it now has. Luck is a metaphysical speculation; scientific explanations invoke causes. It is almost universally conceded that such sudden events would be irreconcilable with the gradualism that Darwin envisioned.\n\n \n \n \nThe conclusion is probably obvious to you, but just in case you are in any doubt, consider the case of \"evolved\" electronic circuits, such as http://www.netscrap.com/netscrap_detail.cfm?scrap_id=73 .Allow evolution to run its course on a programmable logic array and we end up with a complex, highly coupled, system that has all the hallmarks of irreducible complexity. Coincidence? Yeah, right!\n\n \n This so called \"proof\" is, in reality, a misunderstanding on Clive's part. Though I do not claim to fully understand the entire article, it is very clear that the actual computer program used a totally different process from evolution, and did not build an irreducibly complex system by \"slight, successive modifications.\" Therefore, this also is irrelevant. \n \n 4) Does Behe advocate that an intelligent designer does not exist?\n \n \nSo the idea that life first appeared billions of years ago and has evolved, through common descent, into what we see today is seen as fitting alongside IC by the very man who proposed IC. My opponent however chooses to ignore this aspect of Behe's argument and claims that IC somehow \"proves neo-Darwinism incorrect\". He has two posts left, so I guess he is saving this \"proof\" up as his grande finale.\n\n \n Frankly, this is just funny. Clive needs to read Behe's book. It merely seems to Behe that an Intelligent Designer had to build the intelligently designed systems, not that Intelligently designed systems were not built. He's saying simply that an intelligent designer is necessary, which is different from Neo-Darwinism (note that he does not say that natural selection and mutations could not have built some systems, but simply that they could not have built all systems, as Neo-Darwinism requires.). Notice that he never said that he actually believes this, however. If you want just a taste of Behe's beliefs, go to his church. He is Catholic. Take a look at this quote, from pg 193 of his book:\n \n \n Imagine a room in which a body lies crushed, flat as a pancake. A dozen detectives crawl around, examining the floor with magnifying glasses for any clue to the identity of the perpetrator. In the middle of the room, next to the body, stands a large, gray elephant. The detectives carefully avoid bumping into the pachyderm's legs as they crawl, and never glance at it. Over time the detectives get frustrated with their lack of progress but resolutely press on, looking even more closely to the floor. You see, textbooks say detectives must \"get their man\" so they never consider elephants. \n There is an elephant in a roomful of scientists who are trying to explain the development of life. The elephant is labeled \"intelligent design.\" To a person who does not feel obligated to restrict his search to unintelligent causes, the straightforward conclusion is that many biochemical systems were designed.\n\n \n In the end, my opponent remains refuted on every point, yet again. Apparently, he thinks that by constantly changing the subject and asking for new refutations, he can prove some kind of point. Unfortunately for Clive, the facts don't support evolution. \n \n TS", 
   {
    "unicode_changes_made": true
   }, 
   152267, 
   null, 
   1123191840.0
  ], 
  [
   153101, 
   null, 
   "Clive14", 
   "This, my final post in this debate, will summarise my arguments as to why IC isn't science, why it poses no threat to evolution theory and why it deserves to be consigned to the dustbin of history. In addition, I shall address my opponent's arguments thus far, pointing out the flaws in his reasoning that leads him to the mistaken view that IC is something other than the well flogged dead horse that I have shown it to be.\n \n My opponent's central argument can be summed up as:\n 1. Darwin once claimed \"If it could be demonstrated that any complex organ existed which could not possibly have been formed by numerous, successive, slight modifications, my theory would absolutely break down.\" and that this still holds true today.\n 2. At a biochemical level, within cells and multicellular organisms, we have finally found these complex organs that \"could not possibly have been formed by numerous, successive, slight modifications\"\n 3. As we have found such \"complex organs\", the theory of evolution collapses.\n \n I have attempted to show that evolution has moved on from Darwin's day and is supported by huge amounts of evidence and thus the theory would not collapse (it would simply need an overhaul) if IC were shown to be true. Further when we find such apparently irreducibly complex systems in nature, they actually support evolution based upon our current knowledge of what makes good and bad design coupled with classic design versus design using evolution algorithms. Finally I have shown that human ingenuity always allows us to come up with plausible \"numerous, successive, slight modifications\" to any system (even ones we know were designed) and thus it is inherently impossible to ever test whether a system is truly IC. In summary, I have tried to show that my opponent's position is groundless and have attempted to demonstrate beyond reasonable doubt that IC is no threat to evolution, isn't science and is well past its \"use by\" date.\n \n One of the main responses of my opponent to these claims has been to insist I do not understand what IC is. He defines it in his first post as\n \n \na single system composed of several well-matched, interacting parts that contribute to the basic function, wherein the removal of any one of the parts causes the system to effectively cease functioning\nbut then starts to rapidly redefine it to keep his position alive. We see the introduction of the \"irreducible core\" for example. This \"irreducible core\" isn't formally defined though. This then allows it to be assigned to \"whatever is left\" every time a supposedly IC system is shown to be able to function with a subset of its parts. Further, demands that I must show exactly how every step of the evolution of a system occurred start to appear in my opponent's posts. Of course I need do no such thing, I need merely show that a part of an claimed IC isn't required for the system to be shown not to be one whereby \"...the removal of any one of the parts causes the system to effectively cease functioning\" and thus for it not to be an IC system. Anything further that I offer is of course a bonus in helping s understand how it might have evolved, but it isn't required to show the IC claim is false for that system.\n \n My opponent's other main tack has been to try and shoehorn my arguments into a set of \"rebuttals\" written by Dr DiSilvestro and Dr Behe. This intellectual laziness on the part of my opponent is made worse by the poor quality of the alleged \"rebuttals\". Dr DiSilvestro for example tries to claim that explanations of existing proteins being re-used in other ways are purely \"just so\" stories and insists that \"...these scenarios do not typically provide evidence as to how and why these scenarios were likely to occur.\" It is called natural selection powered by competition for resources Dr DiSilvestro, you might want to read up on it one day. I have, broadly speaking, ignored these \"rebuttals\" as I am debating my opponent, not Dr DiSilvestro or Dr Behe, and I have tried to instead address the parts of my opponent's posts that are his own work instead. My opponent has asked a few questions and made requests for clarification that I have largely ignored in my previous three posts as they did not fit neatly into the way I wished to present the three parts of my argument (or my \"changing the subject\" as he curiously refers to it as). The remainder of this post consists of these outstanding responses therefore.\n \n \nFurther the remaining parts have been shown to not be that distinct after all. For example the five proteases have near identical lengths polypeptide chains, have near identical cleave points and have a large number of homologous peptide sequences.\nYour going to have to explain this further.\n and \n \nClive needs to construct such a \"simple\" model, starting from scratch. Just wondering, how do you suppose the animal survived with a blood clotting system in the first place?\nPlease read http://www.millerandlevine.com/km/evol/DI/clot/Clotting.html for a detailed description of how an early chordate could have survived just fine without a blood clotting mechanism (using the same system that many living invertebrates use), how blood clotting may have evolved and for details of the homology of the proteases.\n \n \nBut it gets worse, for Sphingomonas chlorophenolica, a lovely little \"eco-friendly\" bacteria, derives its carbon from PCP (the toxic chemical pentachlorophenol). The degrading of PCP to liberate carbon involves three enzymes and removing any kills the sequence and thus the bacteria. An obvious \"irreducibly complex\" system, no? But PCP is a man-made substance that was invented just seventy years ago. So this \"irreducibly complex\" system must have evolved, sorry been \"designed\", in the last 70 years!\nYou are going to have to explain this further, because I am not catching your point, proof, or impact.\n\nPlease see http://www.talkdesign.org/faqs/icdmyst/ICDmyst.html#how2eatpcp for a more detailed explanation.\n \n \nWhat terms would you propose we use? Is not a hole in the ground less complex than a mouse trap?\nWhat sort of hole in the ground? How about http://asuwlink.uwyo.edu/~jimkirk/missile/drawing_underground_silo_complex.jpg ? Or did you have a simpler hole in mind? To reiterate the point I made that lead to this question from my opponent: precursors to a system are not necessarily less complex than the system itself. Precursors will likely have a similar, but not identical, function. Trying to put it in terms of \"simple and complex\" misses the point. \n \n \nIt might easily be the case that a teenager on a Saturday afternoon could take an old bicycle, an old lawnmower engine, and some spare parts and (with a couple hours effort) build himself a functioning motorcycle. But this only shows that humans can design irreducibly complex systems... A bicycle thus may be a conceptual precursor to a motorcycle, but it is not a physical one. Darwinian evolution requires physical precursors.\nI find it hard to see exactly how Clive will get around it this time.\nI have no intention of \"getting around\" anything: the argument is feebly weak and so I shall plough straight through the middle:\n 1. Sticking a lawnmower engine on a bicycle is not creating an irreducibly complex system. The bicycle works just fine without the lawnmower engine and lawnmower engines work just fine without the bicycle. Calling it an irreducibly complex system merely shows how poorly defined IC is and how its meaning changes for sentence to sentence when used by even Behe himself.\n 2. Early motorbikes were literally bicycles with an engine attached. The bicycle was a physical entity that existed prior to adding the engine to it. It was a physical precursor to the resultant motorcycle. To claim otherwise is nonsense.\n \n \n...the genone is littered with \"loose parts\" that really do \"[hang] around, waiting for other random mutations to make them useful\". The assumption that these loose parts cannot exist stems of course from failing to understand that natural selection will only select against a mutation if it reduces the organism's fitness (more precisely fecundity). If it has no affect upon fecundity, then there is no selection pressure upon it. It need not do anything useful, it simply needs to have no negative affect upon fecundity.\nThis is a misrepresentation of my argument. I did not state that they could not exist, but that natural selection does not select them, therefore they will not spread through the population. If they do not spread through the population, they cannot be built upon by future mutations... [Behe quote snipped for brevity]\nBoth my opponent and Behe show again that they do not really understand how natural selection works. Natural selection does not select genes, it selects organisms that best fit their niche, but it does it imperfectly. A classic example of this is with the disease sickle cell anaemia. The homozygous recessive form results in a disease that is highly debilitating and often proves lethal before maturity. If genetics and natural selection were as simple as my opponent claims, then this disease would not spread throughout the population and would die out. It isn't that simple though as the heterozygous form results in few, if any, symptoms but also offers protection against malaria. So why doesn't the beneficial version spread throughout the population if it offers this advantage? Because the benefits without the fatal disease occur in the heterozygous form, which implicitly cannot ever become fixed. This is the norm for mutations: they offer a complex mix of advantages and disadvantages and so partially spread, hanging around, often doing nothing useful, until a further mutations pushes it more toward an extreme.\n \n \nWhether it be \"broken\" genes (more accurately called psuedogenes) such as for vitamin C synthesis in humans...\nClive has brought up the latest so called \"vestigial\" systems that supposedly explain evolution. Evolutionists have been embarrassed time and time again, as scientists found out that they really did have a function.\nA small side note to my opponent here: to talk of \"evolutionists [having] been embarrassed\" due to \"scientists [finding] out that they really did have a function\" is disingenuous. The \"evolutionists\" and \"scientists\" are one and the same people. It is the nature of science to question and correct in this fashion.\n \n \nSimilar to the panda&#8217;s thumb, we don&#8217;t know that the designer would think exactly like Clive, or even humans for that matter. We might, as has been shown numerous times in the past, discover that the system does have a purpose, or is better at fulfilling its purpose than we thought. Also, according to creationism, we should see some systems that don&#8217;t work perfectly, because of what happened after the Garden of Eden.\nCan we please stick to discussing science and leave references to the \"garden of Eden\" Christian mythology for another debate? Thanks. If there is a designer of life, then it is valid point that it might not think in the same way as humans and so might design things in ways that seem sensible to it, but that are glaringly bad design to us. If that designer is intelligent enough to design all of life though, it really beggars belief that it is unaware of how bad \"tight coupling\" is in design terms. The other option of course is that if there is a designer, it used evolution to design life.\n \n \nThis so called &#8220;proof&#8221; is, in reality, a misunderstanding on Clive&#8217;s part. Though I do not claim to fully understand the entire article, it is very clear that the actual computer program used a totally different process from evolution, and did not build an irreducibly complex system by &#8220;slight, successive modifications.&#8221; Therefore, this also is irrelevant.\nYou admit to not fully understanding the article, yet you claim I am misunderstood it and you claim that \"evolution based algorithms\" uses a \"totally different process from evolution\" and that a system that generates a highly complex and tightly coupled system through thousands of \"make small change and select\" iterations is not building 'an irreducibly complex system by &#8220;slight, successive modifications.&#8221;'? Perhaps you should have stuck with just admitting you didn't understand the article, rather than then trying to comment upon something you didn't understand!\n \n \nFurther, natural selection quite probably isn't the whole story with evolution as there is evidence that random selection, also known as \"ecological fitting\" (http://www.mongabay.com/external/ma..._rainforest.htm) and punctuated equilibrium play their part in evolution for example.\nThe example of ecological fitting, aka microevolution, that you gave did not create any irreducibly complex organisms. Since the evolutionary interpretation of ecological fitting (to my knowledge) is governed by natural selection and mutation, it could not create an irreducibly complex system. Therefore, it is irrelevant. \n \n As to the punctuated equilibrium, it is a totally separate issue from the resolution, which specifically says \"Neo-Darwinism.\" I would be happy to give you a stack of problems with it when this debate is over. In any case, it still works on the ideas of natural selection and mutation, and could not build an irreducibly complex system.\nIt is unfortunate that I discover at this late stage that my opponent is unsure on what various evolutionary terms mean. For the record, I shall briefly explain them:\n \n Microevolution is concerned solely with genetic variation within a population of a single species.\n Macroevolution is concerned with variations in species within an environment. This includes ecological fixing and speciation.\n \n Punctuated equilibrium is the hypothesis that species morphology remains static for long periods and then rapidly changes in response to environmental changes. It is supported by recent experiments into how \"heat shock\" proteins behave under normal and stressed conditions for example.\n \n Neo-Darwinism is another term for modern evolution theory. It is simply a synthesis of Darwin et al.'s original theory along with genetics and a multitude of discoveries relating to both that have been made in the subsequent 100+ years. As such it covers punctuated equilibrium. If my opponent meant something else by \"Neo-Darwinism\", it would have helped it he had explained this earlier and had stuck to addressing just that, rather than predominantly using the word \"evolution\".\n \n Since I have repeatedly shown how evolution can give rise to an apparently IC system, my point above stands.\n \n I shall now hand over to my opponent for him to have the final word in this debate. Thank you all for reading my posts.", 
   {
    "post_info": {
     "post_title": "Post 4 by C14"
    }
   }, 
   152952, 
   null, 
   1123242840.0
  ], 
  [
   153518, 
   null, 
   "JPSartre12", 
   "I don't want to jump in and create any stress, but I'll be heading to Florida on Tuesday for a week in the sun. If TS's final post is done by then, I'll post my input. If not, I may have no, or little access while on vacation, so my input may be delayed a week. OK?", 
   {}, 
   153101, 
   null, 
   1123464120.0
  ], 
  [
   153625, 
   null, 
   "billsco", 
   "Thanks for the heads up, JP. We can await your decision until your return from vacation if necessary.", 
   {}, 
   153518, 
   null, 
   1123506420.0
  ], 
  [
   153937, 
   null, 
   "The Skeptic", 
   "Since this is my final post I will be summarizing the refutations to some of Clive's old arguments, and some of the rebuttals that he came up with in his last post. These can be summarized as follows:\n \n 1) Have I re-defined my position?\n 2) Quoting authorities: intellectual laziness or smart tactic?\n 3) Has evolution \"moved on\" since Darwin's days?\n 4) Can an irreducibly complex system by built? Proposed pathways and non-pathways by Clive.\n 5) \"Bad\" design?\n 6) Christian mythology vs. scientific atheism? Why this is incorrect.\n \n Have I re-defined my position?\n \n I would like to point out, first of all, that Behe defined irreducible complexity in his book as \"a single system composed of several well-matched, interacting parts that contribute to the basic function, wherein the removal of any one of the parts causes the system to effectively cease functioning\" I have used Behe's definition from the beginning of this debate.\n \n My opponent has missed the underlined during this debate. The parts of the flagellum are well matched, interact, and contribute to the basic function of the system. This is important to remember, especially if you propose \"hopeful monsters,\" like my opponent. Scroll down further for more information.\n \n Quoting authorities: intellectual laziness or smart tactic?\n \n In his last post, Clive made the claim that bringing up rebuttals written by Behe and DiSilvestro was \"intellectual laziness.\" I would like to point out that Clive has done the same, and did so, even in the post in which he called it \"intellectual laziness.\" Note the numerous times that he has posted only links as his response.\n \n I find nothing lazy about researching and reading for hours so that I can understand the issue. Frankly, Clive doesn't understand debate if he thinks quoting people who know more about the issue than either I do or he does is laziness.\n \n have, broadly speaking, ignored these \"rebuttals\" as I am debating my opponent, not Dr DiSilvestro or Dr Behe, and I have tried to instead address the parts of my opponent's posts that are his own work instead. My opponent has asked a few questions and made requests for clarification that I have largely ignored in my previous three posts as they did not fit neatly into the way I wished to present the three parts of my argument (or my \"changing the subject\" as he curiously refers to it as). The remainder of this post consists of these outstanding responses therefore.\n\n I find it very interesting that you attempted to salvage your bicycle argument, which was refuted by Behe, not me, after you made this claim. Since you don't possess some kind of magic wand that can refute any argument, I would say that you are finding yourself in the same predicament as the scientific community: unable to rebut Behe's responses.\n \n Has evolution \"moved on\" since Darwin's days?\n \n My opponent has, rather vaguely, repeatedly claimed that he is immune to many of my arguments because \"evolution has moved on.\" This \"moving on,\" however, has not been clearly represented by my opponent, other than to repeat refuted arguments, basically the hopeful monsters theory. He calls his idea \"punctuated equilibrium,\" although that term actually means something totally different. (Note that he defined it as \" the hypothesis that species morphology remains static for long periods and then rapidly changes in response to environmental changes.\" This is the same as hopeful monsters.) This whole idea was refuted earlier:\n \n \n[Behe:] In the abstract, it might be tempting to imagine that irreducible complexity simply requires multiple simultaneous mutations - that evolution might be far chancier than we thought, but still possible. Such an appeal to brute luck can never be refuted. Yet it is an empty argument. One may as well say that the world luckily popped into existence yesterday with all the features that it now has. Luck is a metaphysical speculation; scientific explanations invoke causes. It is almost universally conceded that such sudden events would be irreconcilable with the gradualism that Darwin envisioned.\n\n \n If, by Punctuated Equilibrium he meant something using natural selection acting on mutations, it has been proven that such a system could not produce an IC system. (Other objections to this will be answered later in this post)\n \n Can an irreducibly complex system by built? Proposed pathways and non-pathways by Clive.\n \n \n \njust in case you are in any doubt, consider the case of \"evolved\" electronic circuits, such as http://www.netscrap.com/netscrap_detail.cfm?scrap_id=73 .Allow evolution to run its course on a programmable logic array and we end up with a complex, highly coupled, system that has all the hallmarks of irreducible complexity.\n\n \n First of all, I would like to point out that, while I may be incorrect, I have a rising suspicion that my opponent wrote that article. Even if he did not, whoever wrote the article has no credentials on the issue. For that matter, anyone with access to a computer and the Internet could make a website and \"articles\" just like that one, regardless of whether or not they are truthful. It takes credentials and scientific attention to insure accuracy.\n \n Second of all, whoever wrote the article, the processed used to \"evolve\" the program is incredibly vague. It remains in question exactly how close the process used resembled evolution, because the only thing that we hear about it is \"it resembles evolution.\" Chances are, since only one programmer has been working on a program for only 1 year, the process was very simplified and did not take into account all factors.\n \n Third, my opponent has used a rather unfair debate tactic. He claimed that the process was exactly the same as evolution, and that it produced an irreducibly complex system, but refrained from showing how. This kind of vagueness is almost impossible to attack, and therefore only barely falsifiable.\n \n Lastly, Behe refuted various other computer simulations within his book. Since my opponent will not elaborate on exactly how his simulation worked, we cannot really have much of a discussion about it.\n \n \nPlease read http://www.millerandlevine.com/km/e...t/Clotting.html for a detailed description of how an early chordate could have survived just fine without a blood clotting mechanism (using the same system that many living invertebrates use), how blood clotting may have evolved and for details of the homology of the proteases.\n\n Behe has refuted Miller numerous times. If any of the people reading this would like to know the truth, I would encourage them to read through the relevant parts of this link:\n \n http://www.discovery.org/scripts/viewDB/index.php?command=view&id=442\n \n Other arguments made by Miller are refuted in these links:\n \n http://www.discovery.org/scripts/viewDB/index.php?command=view&id=579\n http://www.discovery.org/scripts/viewDB/index.php?command=view&id=441\n \n \n \nPlease see http://www.talkdesign.org/faqs/icdm...html#how2eatpcp for a more detailed explanation [of how an irreducibly complex system evolved].\n\n \n From Clives Link:\n \n \nThe second enzyme (called PcpC) is the most interesting one; the cell produces it in sufficient quantity to be effective all the time instead of just when it is needed in its normal metabolic role. Thanks to this unusual situation PcpC is available when it is needed to help eat PCP.\n\n \n Please note the underlined. First of all, I would like to point out that the IC system was already there. It did not suddenly appear, since all three enzymes were still required for the process, and were still vital before the mutation. Therefore, the IC system did not evolve, but was simply damaged by the mutation, as we will see in the next paragraph.\n \n Second of all, I would like to point out that the bacteria lost an ability due to that mutation: it lost the genetic information necessary to limit the amount of PcpC used to metabolize cholophenols. It happened that this loss of information was temporarily beneficial, because of a man made chemical. That bacteria would die if released into the wild, because it would constantly waste energy producing an unnecessary chemical - the part destroyed by the mutation limits the energy spent. What we have here is an example of natural selection, not evolution, because evolution requires a gain in information.\n \n \nI have no intention of \"getting around\" anything: the argument is feebly weak and so I shall plough straight through the middle:\n 1. Sticking a lawnmower engine on a bicycle is not creating an irreducibly complex system. The bicycle works just fine without the lawnmower engine and lawnmower engines work just fine without the bicycle. Calling it an irreducibly complex system merely shows how poorly defined IC is and how its meaning changes for sentence to sentence when used by even Behe himself.\n 2. Early motorbikes were literally bicycles with an engine attached. The bicycle was a physical entity that existed prior to adding the engine to it. It was a physical precursor to the resultant motorcycle. To claim otherwise is nonsense.\n\n \n I will choose to believe that you simply did not read the refutation that I posted, or are intentionally ignoring it. To have read it and to simply repeat your argument would be a falsehood. Now, I will state again: Behe has long refuted this by showing that a bicycle could not evolve into a motorcycle by Darwinian means. Again:\n \n \n[Behe:] It might easily be the case that a teenager on a Saturday afternoon could take an old bicycle, an old lawnmower engine, and some spare parts and (with a couple hours effort) build himself a functioning motorcycle. But this only shows that humans can design irreducibly complex systems, which we knew already. To be a precursor in Darwin's sense, we must show that a motorcycle can be built from \"numerous, successive, slight modifications\" to a bicycle. So let us attempt to evolve a bicycle into a motorcycle by the gradual accumulation of mutations. Suppose that a factory produced bicycles, but that occasionally there was a mistake in the manufacture. Let us further suppose that if the mistake led to an improvement in the bicycle, then the friends and neighbors of the lucky buyer would demand similar bikes, and the factory would retool to make the mutation a permanent feature. So, like biological mutations, successful mechanical mutations would reproduce and spread. If we are to keep our analogy relevant to biology, however, each change can only be a slight modification, duplication, or rearrangement of a preexisting component, and the change must improve the function of the bicycle. So if the factory mistakenly increased the size of a nut or decreased the diameter of a bolt, or added an extra wheel onto the front axle or left off the rear tire, or put a pedal on the handle bars or added extra spokes, and if any of these slight changes improved the bike ride, then the improvement would immediately be noticed by the buying public and the mutated bikes would, in true Darwinian fashion, dominate the market.\n Given these conditions, can we evolve a bicycle into a motorcycle? We can move in the right direction by making the seat more comfortable in small steps, the wheels bigger, and even (assuming our customers prefer the \"biker\" look) imitate the overall shape in various ways. But motorcycle depends on a source of fuel, and a bicycle has nothing that can be slightly modified to become a gasoline tank. And what part of the bicycle would be duplicated to begin building the motor? Even if a lucky accident brought a lawnmower engine from a neighboring factory, the motor would have to be mounted on the bike and be connected in the right way to the drive chain. How could this be done step-by-step from bicycle parts? \n ...A bicycle thus may be a conceptual precursor to a motorcycle, but it is not a physical one. Darwinian evolution requires physical precursors.\n\n \n \nThis is the norm for mutations: they offer a complex mix of advantages and disadvantages and so partially spread, hanging around, often doing nothing useful, until a further mutations pushes it more toward an extreme.\n\n \n And, in the Behe quote that you \"snipped for brevity,\" your idea was refuted. He wrote: \"Thus the fixation of just one step in the population for the scenario would be expected to occur only once every ten billion generations. Yet Robison's scenario postulates multiple such events.\" \n \n It is, for all practical mathematical purposes, impossible for such random, unselected mutations to build upon each other.\n \n \"Bad\" Design?\n \nIf there is a designer of life, then it is valid point that it might not think in the same way as humans and so might design things in ways that seem sensible to it, but that are glaringly bad design to us. If that designer is intelligent enough to design all of life though, it really beggars belief that it is unaware of how bad \"tight coupling\" is in design terms.\n\n On the contrary, the designer knows more about the efficiency of such systems than we do. What may be \"bad design\" according to us, might in fact be excellent design when all facts are known. \n \n Clive has not proposed a better system, since no such system is known to man. In fact, humans often copy such \"tightly coupled\" systems such as the motor that drives the flagellum because of their amazing efficiency and design {for more information, check out http://www.answersingenesis.org/tj/v12/i1/motors.asp and http://www.answersingenesis.org/docs/207.asp ). He has not worked out the math, checked the text books, or even seen if the so called \"tightly coupled\" systems could work without being such. Frankly, these questions need to be asked and answered before we declare something \"bad design.\"\n \n Christian mythology vs. scientific atheism? \n \n \nCan we please stick to discussing science and leave references to the \"garden of Eden\" Christian mythology for another debate? Thanks.\n\n \n To state it simply, I was amazed when I read the above quote. Clive has obviously not studied both sides of the issue, and is subscribing to the standard propaganda that evolutionists like to use. Allow me to make this clear: science is not the same thing as naturalism. In other words, science is not about finding the best natural explanation, it is about finding the best explanation, period. If that explanation means Intelligent Design, Christianity, or whatever, then it is our duty to pursue those explanations. If anyone reading this wants a more thorough refutation to his assertion, feel free to take a look at these links:\n \n \n About creationism:\n http://www.trueorigin.org/creatheory.asp\n http://www.answersingenesis.org/home/area/RE2/chapter1.asp\n \n About Intelligent Design:\n http://www.trueorigin.org/design01.asp\n \n \n Conclusion.\n \n I believe that I have won this debate, simply because I have refuted my opponent on every point. Though he always seems to find the time to lable creationists as unscientific, he very rarely manages to remain so himself by any reasonable definition. Irreducibly complexity remains an intriguing issue, based upon thorough scientific research - Behe and others have demonstrated that it is an amazing proof of intelligent design.\n \n Back in the 1930's, a flat earth advocate put out an add in a scientific journal, offering 50 pounds to anyone who could prove conclusively that the earth was round. One scientist took him up, and set up a telescope facing in the correct direction to demonstrate the roundness of the earth. The flat earth advocate refused to look through the telescope, afraid of what he might find. So, of course, the scientist had not proven to the flat earth advocate that the earth was round, and did not earn the 50 pounds.\n \n I urge all who have read this debate to look through the telescope of irreducible complexity... and see the truth.\n \n God Bless,\n \n TS", 
   {
    "post_info": {
     "post_title": "Final Post by TS"
    }, 
    "unicode_changes_made": true
   }, 
   153625, 
   null, 
   1123631880.0
  ], 
  [
   154000, 
   null, 
   "billsco", 
   "Thank you both for the debate.\n \n Now we'll turn it over to the judges and await their decision.", 
   {}, 
   153937, 
   null, 
   1123649520.0
  ], 
  [
   154088, 
   null, 
   "JPSartre12", 
   "First, I'd like to thank the participants for their efforts. As a scientist, I'm data driven, but as a Christian, I'm also faith-driven. This apparent dichotomy is both a blessing and a curse. :) \n I found the debate to have lots of personal relavence, therefore.\n \n In the debate of the specific statement:\n Resolved: That irreducible complexity exists and proves Neo-Darwinism incorrect.  \n \n I believe that Clive14 has failed to disprove the existence of irreducible complexity. Having read the accompanying argument and links, I believe that the presence of simpler functional equivalence doesn't preclude IR. Put another way, the fact that a simpler mousetrap exists isn't proof that a complex mousetrap is the result of evolution from the simpler design. A hole in the ground is a simple mousetrap, but it doesn't logically follow that a spring-loaded mousetrap evolved from a hole. Had Clive14 taken more time to explain that evolution can occur in ways other than \"incrementalism\", he would have made a much stronger argument against IC. IMO, forcing the reader to fill in the blanks worked against Clive14. I can easily see that, with more time and effort, a more cogent pro-evolution argument is possible.\n \n That said, I believe that The Skeptic relied very heavily on a very limited number of references, so I was only weakly convinced of the existence of IC.\n A more thorough search of the literature for more supporting documentation from a variety of credible sources would have increased this level of conviction. Using Behe almost exclusively allows the opposition to debate the source and not the content, thereby clouding the issue.\n \n From an overall debate standpoint, I make the following observations:\n 1. I saw the digression towards personal comments to be distracting. While I've done so myself, I do recognize the danger in this tactic. It is human nature to do so, but should be avoided in a formal debate.\n 2. As mentioned above, the heavy reliance on a small amount of sources is troubling.\n 3. I don't think that referencing an article that you, personally, authored is a good tactic to use in a debate. It causes the reader to question the veracity of other claims as well and opens up doubt about the intellectual honesty of the debater.\n 4. I think that the basic argument statement made it difficult for anyone arguing in the negative to convince non-scientists that IC doesn't exist. The argument against IC is a very technical one. It's much easier to say \"it's magic\". \n \n Again, please don't take my negative comments as anything but suggestions for future reference. I found the argument very thought-provoking and a worthwhile endeavor.\n Thank you.", 
   {}, 
   154000, 
   null, 
   1123691220.0
  ], 
  [
   154369, 
   null, 
   "Waxy", 
   "I've been giving this a lot of thought, to try and write my \"judgement\" in a clear and concise way. There are several points which I would like to make, and I'm not sure how to do that most effectively, so, I'm just going to pretty much wing it. :) \n \n To my mind, the simple matter of a technical winner and loser is fairly straight forward - \n \n The Skeptic (TS) was charged with proving that irreducible complexity exists and proves Neo-Darwinism is false. This was his own choice of debate topic, and the burden of proof was his. \n \n In my judgement, he failed to do so beyond a reasonable doubt, and therefore Clive14 won the debate. \n \n In terms of who did a better job of debating, it's a bit more of a toss up. Both participants did a great job, and obviously put in a significant amount of time and effort into the debate. \n \n I'll make individual comments below. \n \n The Skeptic:\n \n My single biggest complaint about the debate is your use of a single source - Behe, for your arguments. You might as well have just scanned his book and pasted it as your sole post to the debate. Sure, you supplemented him here and there with other links, but essentially all you've done is paraphrase, or in most instances, simply quote, Behe. For all intents and purposes, Clive was debating Behe, not you. IMHO, this makes for a very poor debate, as it doesn't involve any of your own reasoning or thought process. It's like you handed in thesis or a research paper with only a single reference - completely unacceptable in my experience.\n \n My second major complaint was your poisoning of the well and calling into question Clive's integrity regarding the article on electronic circuits, even going so far as to try and paint any internet based source as inherently flawed in order to imply weakness in your opponent's argument. An approach that's underhanded, and rather transparent. I'm surprised that JPSartre accepted your claims on face value.\n \n That said, you did present a very challenging case for IC. It was certainly thought provoking, and if anything, has left me wishing I had a much better understanding of biology than I do. To my mind, you broke it down to this - things are really complex, and therefore, either they were designed by a supreme being, or, they evolved against incredibly long odds in ways we don't fully understand. Either way, IMHO, all you've done is break the premise down to a choice between to potentially plausible beliefs, you have not proven one correct and the other false. \n \n Clive14:\n \n Had the burden of proof been reversed, the decision would not have been so straight forward. \n \n The task of proving IC false is immense, and requires a great deal of knowledge, very specialized and detailed knowledge, of biology, and is really not capable of being done within a debate format IMHO. In fact, I'm not sure it can be done at all, as it's ultimately impossible to prove a negative.\n \n My biggest issue with your posts was the slipping of your writing style from formal into a more \"Clive14 like\" style. :) Arrogance, rudeness, and general acidity are not the best means by which to get your point across, they only serve to turn the reader against you. I do however realize, that you were not alone in this, see below. \n \n Clive14 + The Skeptic:\n \n Like JPSarte, I was also disappointed with the tone of the debate and the lapse into personal attacks and rudeness. I was looking forward to debate without the typical forum antics. Although I know Clive14 is no emoticon_xangel and I have called him on it, IMHO, the tone was set by The Skeptic early in the debate, and he is every bit as guilty as, if not more so, Clive14, as well as being the instigator. \n \n My decision regarding a winner and loser won't change, but I'm open to discussing any thoughts that the two of you or others may have regarding the debate or my comments.\n \n Waxy", 
   {}, 
   154088, 
   null, 
   1123779900.0
  ], 
  [
   155750, 
   null, 
   "billsco", 
   "Just a quick note to update all readers:\n \n I'm unsure of the status of our final judge. He hasn't responded to PMs I've sent. \n \n I'm for exercising patience yet. No one is going anywhere I guess. I'll keep working with the involved parties to bring this debate to a conclusion.\n \n Thanks for your understanding.", 
   {}, 
   154369, 
   null, 
   1124422620.0
  ], 
  [
   156270, 
   null, 
   "billsco", 
   "Jskufan has contacted me by PM to say that he, like many of us, has not had a lot of time to ply the forum boards of late but is trying to find time to dedicate to rendering his verdict. It was welcome news to me and I'm hoping we can bring this debate to its conclusion soon. \n \n Thanks again for your patience.", 
   {
    "post_info": {
     "post_title": "Judge update"
    }
   }, 
   155750, 
   null, 
   1124730960.0
  ], 
  [
   157121, 
   null, 
   "billsco", 
   "I have decided in the interest of successfully concluding this debate to relieve jskufan from his role as judge. He has privately expressed to me his concern that he is not feeling comfortable weighing in on a subject quite foreign to him. Hopefully, we can all appreciate that.\n \n Instead of trying to bring in another judge at this late date, and waiting through another delay while he/she studys the debate and then considers a verdict, I'm going to assume the role of the third judge. \n \n I considered briefly leaving the debate as it is--tied--but blanched at the thought. \n \n I trust the two contestants find this new and unexpected arrangement satisfactory. It is my wish to bring this debate to a conclusion without further delay. Therefore, I will reexamine the arguments tonight and render a conclusion Friday morning before leaving for the weekend.\n \n Thanks again to everyone for their patience.", 
   {
    "post_info": {
     "post_title": "Debate conclusion"
    }
   }, 
   156270, 
   null, 
   1125030060.0
  ], 
  [
   157162, 
   null, 
   "billsco", 
   "First, I don't agree with JPSartre12 or Waxy about either of the contestant's tone in this debate. I didn't feel they crossed the line into personal attack. There were blows thrown, to be sure, but it was for the most part aimed at the issues, and also in challenging their opponent to improve or clarify certain aspects of their position. \n \n This was a well-defined resolution being debated. A congratulation to The Skeptic for proposing the wording, as it was crucial to understanding where both sides were coming from. I didn't fully understand what it meant initially, but I think both showed a good degree of empathy by explaining matters to the viewers. \n \n As for the specifics: \n \n The Skeptic quotes Darwin as saying:\n \n \"If it could be demonstrated that any complex organ existed which could not possibly have been formed by numerous, successive, slight modifications, my theory [evolution] would absolutely break down.\"\n \n We were then informed that if IC can be shown, neo-Darwinism is false. This was the reason for the specific wording of the resolution then. But it does not follow, IMO. For example, could not Darwin simply have been mistaken in his assumption, yet neo-Darwinism remain a viable, vibrant theory? Is it wise to endow Darwin with infallibility before attempting to destroy him?\n \n Clive14 began poorly, his first post had an autopilot feel to it, with no attributions, and was promptly called on it. He recovered nicely and became fully engaged in his second post. This is where I felt he grabbed the ball and never gave it back. \n \n I was puzzled by the use of the term \"neo-Darwinism\". I kept waiting to learn why The Skeptic chose that term in the wording of the resolution, but he never addressed it. Instead he used \"evolution\" throughout the debate. Clive14 defined it for us in his last post. \n \n An interesting sidebar developed over a thinking aloud comment by The Skeptic of his suspicion that Clive14 used his own web page writings to support a particular point. Clive14 has stated he is not the author, and it is well enough to leave it at that. \n \n The almost singular use of Behe by The Skeptic was disappointing, as both judges have already observed, and particularly damning to his case was when Clive14 pointed out Behe's own words on the matter regarding \"neo-Darwinism\" as it relates to IC:\n \n \n The final nail though in the coffin of the claim that IC somehow threatens evolution is of course the vast mass of evidence in support of evolution that is unrelated to IC. Even Behe acknowledged this:\n \n [I]'For the record, I have no reason to doubt that the universe is the billions of years old that physicists say it is. Further, I find the idea of common descent (that all organisms share a common ancestor) fairly convincing, and have no particular reason to doubt it.'[/]\n \n \"So the idea that life first appeared billions of years ago and has evolved, through common descent, into what we see today is seen as fitting alongside IC by the very man who proposed IC. My opponent however chooses to ignore this aspect of Behe's argument and claims that IC somehow \"proves neo-Darwinism incorrect\".\n\n \n \"The vast mass of evidence in support of evolution that is unrelated to IC.\" The resolution is doomed by this fact. It is a false bifurcation to declare that \"if this, then that\".\n \n This is indeed a final nail-a fatal flaw--and cannot be reconciled to the unambiguous wording of the resolution. \n \n My vote goes to Clive14, and by a 2-1 margin, he is the winner of this debate. \n \n ------------------------------------------\n Thanks to both participants for their effort in making this an outstanding debate. It is a nice addition to the Debate Room in our forum. I hope their example will encourage others to try their hand at it.\n \n For those who would like to comment on this debate, please feel free to do so here.", 
   {
    "unicode_changes_made": true
   }, 
   157121, 
   null, 
   1125068280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Skeptic vs Clive14--Irreducible Complexity", 
  "url": "http://www.4forums.com/political/debate-tournaments/6048-skeptic-vs-clive14-irreducible-complexity.html", 
  "breadcrumbs": [
   "Debate Tournaments"
  ], 
  "id_number": 6048, 
  "discussion_files": [
   [
    "27530.html", 
    "http://www.4forums.com/political/debate-tournaments/6048-skeptic-vs-clive14-irreducible-complexity-print.html"
   ], 
   [
    "27531.html", 
    "http://www.4forums.com/political/debate-tournaments/6048-skeptic-vs-clive14-irreducible-complexity-2-print.html"
   ]
  ], 
  "identifier": 6048
 }
]