[
 [
  [
   150962, 
   null, 
   "galton", 
   "When I was a child, I believed without the least doubt that there was a God. In my 20s I became convinced by atheistic arguments and have been a non-believer ever since. Disbelief, however, has caused in me a pervading sense of the pointlessness of life, so I would like very much to believe in God. What are the best arguments you know of in favor of the existence of a Supreme Being?", 
   {
    "post_info": {
     "post_title": "What are the best arguments in favor of the existence of God?"
    }
   }, 
   null, 
   null, 
   1122432840.0
  ], 
  [
   150964, 
   null, 
   "joebrummer", 
   "When I was a child, I believed without the least doubt that there was a God. In my 20s I became convinced by atheistic arguments and have been a non-believer ever since. Disbelief, however, has caused in me a pervading sense of the pointlessness of life, so I would like very much to believe in God. What are the best arguments you know of in favor of the existence of a Supreme Being?\n\n \n \n Sounds like cheesey yoda talk but do not look for the evidence of god anyplace but inside you. The evidence of it all isn't to be found in anything but you!", 
   {}, 
   150962, 
   null, 
   1122433200.0
  ], 
  [
   150969, 
   null, 
   "Easyrider", 
   "Galton -\n \n Do what millions of us have done with success: Pray sincerely and directly to Jesus Christ to be your Lord God and Savior for the remission of your sins. Surrender to him and ask him to live his life through you. It's that simple. In time he will answer you and give you the evidence you need. But be prepared for the ride of your life! \n \n In the meantime, here's something to tweak your interest:\n \n The Messiah Pages\n \n http://www.shalom.org.uk/Messiah/Atonement.htm\n \n God bless!", 
   {}, 
   150964, 
   null, 
   1122434160.0
  ], 
  [
   150970, 
   null, 
   "Symbiote", 
   "If you can cultivate a hatred of homosexuals, you will find that biblical passages provide you with a refuge of justification for your anger, and fundamentalist Christian groups supportive of your views. From there it should be relatively easy to at least pretend to believe in God.", 
   {}, 
   150969, 
   null, 
   1122434340.0
  ], 
  [
   150972, 
   null, 
   "Easyrider", 
   "Galton, Symbiote said: \"If you can cultivate a hatred of homosexuals, you will find that biblical passages provide you with a refuge of justification for your anger, and fundamentalist Christian groups supportive of your views. From there it should be relatively easy to at least pretend to believe in God.\"\n \n Jesus came to save gays, straights, and people like Symbiote. But it appears some just don't want to admit they're sinners in need of salvation.", 
   {}, 
   150970, 
   null, 
   1122434760.0
  ], 
  [
   150978, 
   null, 
   "joebrummer", 
   "be weary of hard core beliefs. I would suggest speaking to a UUC minister since they tend to be accpeting of many beliefs and will have knowledge of many beliefs to help you decide your beliefs. Just make your own decisions and don't let others tell you what to believe. You will be much happier in the end.", 
   {}, 
   150972, 
   null, 
   1122435120.0
  ], 
  [
   150984, 
   null, 
   "Easyrider", 
   "be weary of hard core beliefs.\n\n \n You mean hard core beliefs like that one? Are you saying to Galton that if he actually does find God and God tells him all about moral principles, everlasting life, etc., to not take God seriously? Just kind of be lukewarm? \n \n \nI would suggest speaking to a UUC minister since they tend to be accpeting of many beliefs and will have knowledge of many beliefs to help you decide your beliefs.\n\n \n I recommend reading the Bible for yourself all the way through, and then find a Biblically-based minister to talk to, as opposed to a UCC minister that might well have a non-biblical agenda.", 
   {}, 
   150978, 
   null, 
   1122435840.0
  ], 
  [
   150985, 
   null, 
   "Pravda", 
   "There are no good rational arguments for the existence of God, as the topic transcends rational understanding.\n \n It takes a blind leap of faith, of hope.", 
   {}, 
   150984, 
   null, 
   1122436020.0
  ], 
  [
   150988, 
   null, 
   "Easyrider", 
   "QUOTE: There are no good rational arguments for the existence of God, as the topic transcends rational understanding.\n \n Ah, but Christ is Risen! And there's nothing irrational about it (unless one posits an irrational, anti-supernatural bias).", 
   {}, 
   150985, 
   null, 
   1122436380.0
  ], 
  [
   150998, 
   null, 
   "Orion", 
   "When I was a child, I believed without the least doubt that there was a God. In my 20s I became convinced by atheistic arguments and have been a non-believer ever since. Disbelief, however, has caused in me a pervading sense of the pointlessness of life, so I would like very much to believe in God. What are the best arguments you know of in favor of the existence of a Supreme Being?\n\n \n Search for the divine. Investigate all paths: Judaism, Christianity, Islam, Hinduism, Wicca, whatever. Recognize that there exist divisions within each of these paths. Find that belief with which you feel most comfortable, or maybe none at all. Regardless, it's important for you to understand that whatever is right for you, whatever you eventually settle upon, may not be right for someone else. All of religion is nothing more than an attempt by man to discover the divine. There is no revealed truth, regardless of what some folks may attempt to sell you.", 
   {}, 
   150962, 
   null, 
   1122437760.0
  ], 
  [
   151006, 
   null, 
   "jitobear", 
   "All I know is that if Easyrider is in paradise - I AIN't GOING!\n \n \"Some effing sheet arse thinks he's Godly....\n Some effing sheet arse crashed my party!\"\n ~LSD", 
   {}, 
   150998, 
   null, 
   1122438840.0
  ], 
  [
   151009, 
   null, 
   "trebor", 
   "All I know is that if Easyrider is in paradise - I AIN't GOING!\n \n \"Some effing sheet arse thinks he's Godly....\n Some effing sheet arse crashed my party!\"\n ~LSD\n\n \n I would say that Easyrider is the best arguement against the Christian god that there is.", 
   {}, 
   151006, 
   null, 
   1122440100.0
  ], 
  [
   151011, 
   null, 
   "Pravda", 
   "Easyrider - \n \n While your faith in the resurrection is touching, it's safe to say that it is wholly irrational to believe that Jesus was resurrected. It's impossible. That's the point. \n \n Faith is required for belief in God, and in Her wisdom she has quite cleverly left no other option.", 
   {}, 
   151009, 
   null, 
   1122440820.0
  ], 
  [
   151022, 
   null, 
   "galton", 
   "Thank you to folks who gave reasons for believing, and no thank you to people who used my question as an excuse to attack religious people. \n \n Focusing on the non-gratuitous comments, doesn't anyone have arguments that would appeal to a rationalist like myself. I had many spiritual experiences as a boy that convinced me that God was there, but I came to be skeptical of them as evidence of anything. Does anyone know of arguments that would be admitted in a court of law? \n \n Lately I have read some C.S. Lewis and G.K. Chesterton, and while I find their arguments very refreshing and stimulating, so far they have not been compelling. Lewis writes that God is there because we see around us competing moral systems, and \"something\" tells us which are better, more refined, closer to perfection than others. For example, the mobster's ethic of being a good family man but exploiting all non-family is a moral system that is infererior to Kant's \"treat all others as ends, not means.\" How do we know that Kant is better than the mafioso? Because there is a completely perfect moral system--God's system--that we sense and in an intuitive way use as a standard to measure other moral systems. To me, this is interesting but not compelling. Chesteron, for all his colorful words, seems to only be saying that Christianity fits, it works, its leads to health, happiness, sanity, meaning, purpose, beauty. I have read a little of Kierkegard--not much--and his argument seems similar to Chesterton's but with a focus on the personal. This sort of argument--that religion gives a person good things--is valid but is not compelling as an argument that religion is true, only that it is useful. Let me know if I am missing something from these writers. \n \n Are there other writers of this sort that people are familar with? One often hears the spiritual kinds of answers given in this thread, but to a rationalist like myself, they sound like contrived arguments constructed because the strong arguments are simply not available--for example, that God is clearly demonstrated through the scientific method of observation.", 
   {}, 
   151011, 
   null, 
   1122449460.0
  ], 
  [
   151076, 
   null, 
   "trebor", 
   "Thank you to folks who gave reasons for believing, and no thank you to people who used my question as an excuse to attack religious people. \n \n Focusing on the non-gratuitous comments, doesn't anyone have arguments that would appeal to a rationalist like myself. I had many spiritual experiences as a boy that convinced me that God was there, but I came to be skeptical of them as evidence of anything. Does anyone know of arguments that would be admitted in a court of law? \n \n Lately I have read some C.S. Lewis and G.K. Chesterton, and while I find their arguments very refreshing and stimulating, so far they have not been compelling. Lewis writes that God is there because we see around us competing moral systems, and \"something\" tells us which are better, more refined, closer to perfection than others. For example, the mobster's ethic of being a good family man but exploiting all non-family is a moral system that is infererior to Kant's \"treat all others as ends, not means.\" How do we know that Kant is better than the mafioso? Because there is a completely perfect moral system--God's system--that we sense and in an intuitive way use as a standard to measure other moral systems. To me, this is interesting but not compelling. Chesteron, for all his colorful words, seems to only be saying that Christianity fits, it works, its leads to health, happiness, sanity, meaning, purpose, beauty. I have read a little of Kierkegard--not much--and his argument seems similar to Chesterton's but with a focus on the personal. This sort of argument--that religion gives a person good things--is valid but is not compelling as an argument that religion is true, only that it is useful. Let me know if I am missing something from these writers. \n \n Are there other writers of this sort that people are familar with? One often hears the spiritual kinds of answers given in this thread, but to a rationalist like myself, they sound like contrived arguments constructed because the strong arguments are simply not available--for example, that God is clearly demonstrated through the scientific method of observation.\n\n \n \n You won't find a RATIONAL answer for a reason to believe in God. I think if someone believes in god because it feels right to them. That is on the emotional/spiritual part, not a rational part. For those people who are good people, they find their beliefs can enhance their spirituality. For those people who are bigots it helps reinforce their bigotry. \n \n If you need a purpose, it is just as good to give yourself one, rather than believe in a god, and have that god supply a purpose. Try consider giving back to the community.Many people find great satisfaction in helping other people.", 
   {}, 
   151022, 
   null, 
   1122474840.0
  ], 
  [
   151080, 
   null, 
   "billsco", 
   " Disbelief, however, has caused in me a pervading sense of the pointlessness of life, so I would like very much to believe in God. \n\n \n Hi galton,\n \n Welcome back. \n \n Can you tell me why a new-found belief in God would infuse you with instant purpose? How are the two related, in that in combatting inanities you look for a god?\n \n regards", 
   {}, 
   150962, 
   null, 
   1122476400.0
  ], 
  [
   151083, 
   null, 
   "Kronus", 
   "Hi Galton.\n \n I think you pretty much answered your own question. You find comfort in the thought that there's a higher being, purpose, whatever. I think in the end that's always been the reason that people have believed in gods. \n \n However, that's not necessarily a reason to belive in the Christian God, per se. From the tone of your questions I think you might find the Tao Te Ching interesting. Have you ever read it? Even if you have no intention of becoming a Taoist it's a fascinating read, and may open you to some ideas you hadn't entertained before.", 
   {}, 
   151080, 
   null, 
   1122477240.0
  ], 
  [
   151093, 
   null, 
   "Big Orn", 
   "Galton,\n When trebor mentioned that you couldn't find a \"rational answer for a reason to believe in God\", he evidently was referring to \"logical or provable\" answer. There are many ways to find God and each one is rational when applying its definitions of: sound, balanced, and/or coherent. But God is a spirit and must be sought in that realm. No one, not even the most devout believer, can prove to you the existence of God, but one who is learned can help you find the right path. The Bible says, \" Strait is the gate and narrow the path that leads to life, and few there be that find it\". (Matthew 7:14).\n \n Finding Him is up to you.", 
   {
    "unicode_changes_made": true
   }, 
   151076, 
   null, 
   1122479340.0
  ], 
  [
   151147, 
   null, 
   "jitobear", 
   "First of all I apologize for poking Easyrider in your post. He is always a big meanie head so I take it upon myself to be mean to him whenever I see an open window. Petty, yes, but oh so fun for me.\n \n I actually do believe in God. I do so because of science. The complexeties of this creation are no accident.", 
   {}, 
   151093, 
   null, 
   1122495540.0
  ], 
  [
   151153, 
   null, 
   "jim's trucking", 
   "You might try studying the origin of the universe and the theories of Einstain and Hawking. They both concluded that there must be a supreme being, a Creator of this mess.\n \n I have no difficulty in believing. As Jito mentioned, the complexity of nature, the myriad of creatures and plants, the interdependence or most species on some or all of the others, the order of planatary motion...these things seem to have happened not by accident.", 
   {}, 
   151147, 
   null, 
   1122496860.0
  ], 
  [
   151161, 
   null, 
   "billsco", 
   "Do believers of God solve their listlessness problems? When they discover him does their sense of pointlessness vanish? Are they suddenly whole, or on the path to some form of wholeness, more so than non-believers?\n \n My observation of religious people would make me answer no to those questions. Their behavior and demeanor would seem to bear me out. They carry and display heavy baggage, and they are constantly looking for another \"revival\" to check the \"backsliding\" condition. \n \n One could conclude that the door they opened and looked in wasn't all that satisfying.", 
   {}, 
   151153, 
   null, 
   1122499020.0
  ], 
  [
   151171, 
   null, 
   "unkerpaulie", 
   "i think trebor's post certainly got the right idea. galton, i think your most pressing need is that of a purpose in life. to improve one's situation one needs to believe in something bigger than himself. believing in God works, because God is seen as the ultimate thing bigger than yourself. however, believing in a vision of yourself in a better future, or in a better world, works just as well, perhaps even better. you have a definite goal that is measureable and attainable, unlike the goal of living a life pleasing to God, which does not exist\n \n the other thing that trebor said, concerning a rational evidence for God, is that there simply is none, ecxept that which you invent in your mind. which means that there is both plenty rational evidence, and no rational evidence. if you want to believe that God exists, you can find many rational reasons to do so. yet there are none. sounds confusing, but its exactly the type of logic that believers must necessarily subscribe to in order to continue believing", 
   {}, 
   151161, 
   null, 
   1122500220.0
  ], 
  [
   151172, 
   null, 
   "Big Orn", 
   "Do believers of God solve their listlessness problems? \n\n In short? No. There are religions that believe in such, but they make one big mistake. Belief is only one of the elements of knowing God. You can't stop there.\n \nWhen they discover him does their sense of pointlessness vanish? Are they suddenly whole, or on the path to some form of wholeness, more so than non-believers?\n\n Yes. If not they have found something they thought to be God.\n \nMy observation of religious people would make me answer no to those questions. Their behavior and demeanor would seem to bear me out. They carry and display heavy baggage, and they are constantly looking for another \"revival\" to check the \"backsliding\" condition. \n\n Those are the ones that carry the title, but not the seal of Christ. These are the ones that love to create strife and confusion. They are nothing better than children of darkness, in one sense.\n \nOne could conclude that the door they opened and looked in wasn't all that satisfying.\n\n I agree. They should have closed it, sealed it, and remembered it.", 
   {}, 
   151161, 
   null, 
   1122500520.0
  ], 
  [
   151177, 
   null, 
   "trebor", 
   "i think trebor's post certainly got the right idea. galton, i think your most pressing need is that of a purpose in life. to improve one's situation one needs to believe in something bigger than himself. believing in God works, because God is seen as the ultimate thing bigger than yourself. however, believing in a vision of yourself in a better future, or in a better world, works just as well, perhaps even better. you have a definite goal that is measureable and attainable, unlike the goal of living a life pleasing to God, which does not exist\n \n \n\n \n I don't know if it has to be attainable.. but the pursuit of it should at least be emotionally satisfying.\n \n I mean, we can't make things in life perfect, but at leastwe can work to make things better.", 
   {}, 
   151171, 
   null, 
   1122501300.0
  ], 
  [
   151192, 
   null, 
   "galton", 
   "If you need a purpose, it is just as good to give yourself one, rather than believe in a god, and have that god supply a purpose. Try consider giving back to the community.Many people find great satisfaction in helping other people.\n\n I know there are people like me who believe that the only purpose for life is the one you create for yourself, and people often turn to loving humanity as their chosen purpose. To me, worshipping God is very satisfying; worshipping humanity is not. Neither is worshipping nature.", 
   {}, 
   151076, 
   null, 
   1122504540.0
  ], 
  [
   151194, 
   null, 
   "galton", 
   "Hi galton,\n \n Welcome back. \n \n Can you tell me why a new-found belief in God would infuse you with instant purpose? How are the two related, in that in combatting inanities you look for a god?\n \n regards\n\n \n Thanks. God changes my whole view of my place in the universe. If he is not there, I am a momentary speck of biology in an eternal, limitless ocean of dust. The same is true of my loved ones, my children. If he is there, then my children and I am part of an unimaginably grand scheme. Not only grand, but eternal.", 
   {}, 
   151080, 
   null, 
   1122505620.0
  ], 
  [
   151195, 
   null, 
   "galton", 
   "Hi Galton.\n \n I think you pretty much answered your own question. You find comfort in the thought that there's a higher being, purpose, whatever. I think in the end that's always been the reason that people have believed in gods. \n \n However, that's not necessarily a reason to belive in the Christian God, per se. From the tone of your questions I think you might find the Tao Te Ching interesting. Have you ever read it? Even if you have no intention of becoming a Taoist it's a fascinating read, and may open you to some ideas you hadn't entertained before.\n\n Thanks, I'll have to look into it. My preference is for Christianity, but I'll take pro-God arguments wherever I can find them.", 
   {}, 
   151083, 
   null, 
   1122505800.0
  ], 
  [
   151196, 
   null, 
   "Big Orn", 
   "I don't know if it has to be attainable.. but the pursuit of it should at least be emotionally satisfying.\n\n Let's look at it another way, outside the box, for a moment.\n What if we decide that life is not the way we like it? And what if we realize that it can never be perfect, at least we have never known, since the dawn of man, of any documents or through testimony that it has? What if, without a reachable goal, without an attainable destination, we work all our lives never having experienced personal peace or satisfaction? What then? Do we just curl up and die, saying, \"Life is hell...oh well.\"?\n \n What does one look for when they have no attainable goal? What is a reward for all that hard work and suffering, disappointment and misery that the person endures while trying ; not acquiring, but simply trying to attain until the day they die?\n \n With God we have abundant life here on earth; we have joy (not 24/7 happiness, but \"joy\"); we have peace, mercy, grace. And, after we die, we have eternal life where there is living going on that's beyond our imagination.\n \nI mean, we can't make things in life perfect, but at leastwe can work to make things better.\n\n I agree. We do not have the promise of tomorrow in this life, which is just a thin wisp of smoke. Working to make things better should be our daily objective.", 
   {
    "unicode_changes_made": true
   }, 
   151177, 
   null, 
   1122506040.0
  ], 
  [
   151197, 
   null, 
   "galton", 
   "Galton,\n No one, not even the most devout believer, can prove to you the existence of God, but one who is learned can help you find the right path. \n\n I am not looking for proof because absolute proof is impossible for any claim, even ones dealing with the material world. I just go with the best bet, and as I see it now, atheism is the best bet. I just wish it weren't.", 
   {}, 
   151093, 
   null, 
   1122506220.0
  ], 
  [
   151198, 
   null, 
   "Waxy", 
   "Thanks. God changes my whole view of my place in the universe. If he is not there, I am a momentary speck of biology in an eternal, limitless ocean of dust. The same is true of my loved ones, my children. If he is there, then my children and I am part of an unimaginably grand scheme. Not only grand, but eternal.\n\n \n I'm rather puzzled by this whole thread. emoticon_confused \n \n To my mind the entire premise is false - no god = meaningless, god equals meaning and eternity. It's like going to Baskin & Robbins and ordering a vanilla cone because it's all you've had and you like it, how do you know you it's the best?\n \n It's quite clear to me that you really want to believe in God, but you're looking for someone to provide you with a concrete, logical, scientific reason to do so. Why? I don't get it? \n \n You aren't going to find one, it really is that simple. You might as well be searching for a unicorn. \n \n To my mind you've reached the ultimate dichotomy - science vs. religion. The two are oil and water, they aren't really compatible, but if you shake them up real good, they can sort of work together. \n \n Ultimately IMHO, if you have to let go of one or the other.\n \n Waxy", 
   {}, 
   151194, 
   null, 
   1122506340.0
  ], 
  [
   151201, 
   null, 
   "galton", 
   "You might try studying the origin of the universe and the theories of Einstain and Hawking. They both concluded that there must be a supreme being, a Creator of this mess.\n\n I'll have to look for their writings on the issue. I have never picked that up from Hawkings, but I have only read a little of what he is written. As for Einstein, I get the impression he is saying that there is some sort of LAW that rules the universe. The kind of God he portrays does not seem to me to be much different than a pure atheistic view. His sort of God won't remember me when I'm dead. But maybe there is more to what he is saying, and I just need to find it.", 
   {}, 
   151153, 
   null, 
   1122506760.0
  ], 
  [
   151204, 
   null, 
   "galton", 
   "Do believers of God solve their listlessness problems? When they discover him does their sense of pointlessness vanish? Are they suddenly whole, or on the path to some form of wholeness, more so than non-believers?\n \n\n I cannot speak for others, but I did not suffer from feelings of nihilism or pointlessness in the least up to age 25 or so because I believed in God and felt He had a clearly laid out plan for me. My single greatest struggle since then has been to find a compelling life purpose. My case absolutely supports the view that belief is beneficial. In fact, the research says the same thing.", 
   {}, 
   151161, 
   null, 
   1122507540.0
  ], 
  [
   151205, 
   null, 
   "trebor", 
   "I know there are people like me who believe that the only purpose for life is the one you create for yourself, and people often turn to loving humanity as their chosen purpose. To me, worshipping God is very satisfying; worshipping humanity is not. Neither is worshipping nature.\n\n \n If worshipping god is satisfiying to you.. then.. does it matter of it is rational or not? How does that fullfill you? What purpose do you feel you accomlplish by worshipping god? Is that enough for you? How does helping your fellow human be 'worshipping humanity'? \n \n Do what is satisfying to you. If worshipping god is satisifying, and gives you purpose, then go right ahead and worship god. If there is a lack, well, give yourself a purpose.", 
   {}, 
   151192, 
   null, 
   1122507660.0
  ], 
  [
   151208, 
   null, 
   "trebor", 
   "I cannot speak for others, but I did not suffer from feelings of nihilism or pointlessness in the least up to age 25 or so because I believed in God and felt He had a clearly laid out plan for me. My single greatest struggle since then has been to find a compelling life purpose. My case absolutely supports the view that belief is beneficial. In fact, the research says the same thing.\n\n \n \n Question.. what purpose do you think god has for you?\n \n How is that different than having a purpose of your own? The desire for immortality??", 
   {}, 
   151204, 
   null, 
   1122508020.0
  ], 
  [
   151215, 
   null, 
   "galton", 
   "i think trebor's post certainly got the right idea. galton, i think your most pressing need is that of a purpose in life. to improve one's situation one needs to believe in something bigger than himself. believing in God works, because God is seen as the ultimate thing bigger than yourself. however, believing in a vision of yourself in a better future, or in a better world, works just as well, perhaps even better. you have a definite goal that is measureable and attainable, unlike the goal of living a life pleasing to God, which does not exist\n\n \n I think many people find satisfaction is this kind of thinking, but my response is, \"Okay, so I believe in a vision of something better, makes goals, and strive toward it. The fact is that even if I could achieve something great, which is unlikely, it won't make a damn bit of difference one hundred years from now.\" For example, my profession is sociology. Can anyone even name me the first president of the Amercan Sociological Association? I sure as hell don't know. The leading sociologist in the country 100 years ago, and practically nothing of him exists now. And how many of us can even get close to achieving that level of success?", 
   {}, 
   151171, 
   null, 
   1122509040.0
  ], 
  [
   151219, 
   null, 
   "galton", 
   "I have no difficulty in believing. As Jito mentioned, the complexity of nature, the myriad of creatures and plants, the interdependence or most species on some or all of the others, the order of planatary motion...these things seem to have happened not by accident.\n\n \"Argument from design\" is a good argument, but to me it is undercut by its own logic and by the evidence of evolution. The logic of the argument is that complexity implies a creator. Well the most complex thing in the universe is God, so the incredible complexity of God implies even more that something must have created God. Second, the evolutionary evidence seems to show that complexity can come into being without a creator. Evolution seems to rule out the need for a creator. I would appreciate references if people can steer me to writings that contradict this.", 
   {}, 
   151153, 
   null, 
   1122509520.0
  ], 
  [
   151229, 
   null, 
   "galton", 
   "To my mind the entire premise is false - no god = meaningless, god equals meaning and eternity.\n\n Of course individuals can impose meaning on their world all they like--you don't need a God to do it--but doing so seems totally arbitrary to me. The only meaning that I see that has real power and that really makes sense is for the Creator and Ruler of Everything to instruct us why He did all this and what our part is in it. \n \n \n\n It's quite clear to me that you really want to believe in God, but you're looking for someone to provide you with a concrete, logical, scientific reason to do so. Why? I don't get it? \n\n It is as I have been saying. In my experience, God gives meaning that cannot be found anywhere else, but I cannot believe something simply because I would like to. I am like you and respect evidence whether I like it or not. That is the scientific method.", 
   {}, 
   151198, 
   null, 
   1122510900.0
  ], 
  [
   151237, 
   null, 
   "Waxy", 
   "It is as I have been saying. In my experience, God gives meaning that cannot be found anywhere else, but I cannot believe something simply because I would like to. I am like you and respect evidence whether I like it or not. That is the scientific method.\n\n \n Then I'm afraid that your search for meaning will have to be focused on something other than religion or God.\n \n Unfortunately, you just can't have your cake and eat it too. \n \n Waxy", 
   {}, 
   151229, 
   null, 
   1122511560.0
  ], 
  [
   151238, 
   null, 
   "joebrummer", 
   "Of course individuals can impose meaning on their world all they like--you don't need a God to do it--but doing so seems totally arbitrary to me. The only meaning that I see that has real power and that really makes sense is for the Creator and Ruler of Everything to instruct us why He did all this and what our part is in it. \n \n\n \n I have pictured god as this little kid with an ant farm...He loves the ants. He builds them a nice place to live, make sure they have food. He may play with them here and there. They are a source of ammusement. When one dies he just makes more...he is god, why not! Sometimes the point of it all is that there is no point.", 
   {}, 
   151229, 
   null, 
   1122511620.0
  ], 
  [
   151241, 
   null, 
   "galton", 
   "If worshipping god is satisfiying to you.. then.. does it matter of it is rational or not? How does that fullfill you? \n\n I cannot make myself believe something because the belief would give me satisfaction. Belief must follow the evidence, regardless of what I want. Being rational and coming to the conclusion that there is no God is not fulfilling; I find it troubling. \n \n \n\n What purpose do you feel you accomlplish by worshipping god? Is that enough for you?\n\n It would be very satisfying to know that God has a purpose for me. The act of adoration would not be especially gratifying to me; rather, it's the knowledge of what it's all about, what my place is. \n \n \n\n How does helping your fellow human be 'worshipping humanity'?\n\n Well, one does not have to worship humanity to help others, of course, but in finding meaning, people seem to look around to find something to place special value on. The religious person is likely to see God as the most important thing there is. The \"people helper\" is likely to see the welfare of humanity as having ultimate value. My point was simply that having as one's highest value the betterment of humanity is unsatsifying to me.", 
   {}, 
   151205, 
   null, 
   1122511980.0
  ], 
  [
   151242, 
   null, 
   "galton", 
   "Then I'm afraid that your search for meaning will have to be focused on something other than religion or God.\n \n Unfortunately, you just can't have your cake and eat it too. \n \n Waxy\n\n I have agreed with your point for more than a decade and might for decades to come.", 
   {}, 
   151237, 
   null, 
   1122512100.0
  ], 
  [
   151247, 
   null, 
   "galton", 
   "I have pictured god as this little kid with an ant farm...He loves the ants. He builds them a nice place to live, make sure they have food. He may play with them here and there. They are a source of ammusement. When one dies he just makes more...he is god, why not! Sometimes the point of it all is that there is no point.\n\n Well, your point brings to mind that the mere existence of a God does not fix all my concerns. If the truth is that God is a jerk, and you and I mean nothing to Him or to His designs, or that His designs are meaningless or evil, well I would not be better off than I am now. I am reminded of a line from a Ingmar Bergman movie: \"If there is a God, He is a sh-t and p-ss God, and I'd love to kick Him in the -ss.\"", 
   {}, 
   151238, 
   null, 
   1122512640.0
  ], 
  [
   151267, 
   null, 
   "joebrummer", 
   "Well, your point brinds to mind that the mere existence of a God does not fix all my concerns. If the truth is that God is a jerk, and you and I mean nothing to Him or to His designs, or that His designs are meaningless or evil, well I would not be better off than I am now. I am reminded of a line from a Ingmar Bergman movie: \"If there is a God, He is a sh-t and p-ss God, and I'd love to kick Him in the -ss.\"\n\n \n \n Kicking his *** might be drastic and in reality I am still an athiest. I was raised Catholic and went to Catholic schools my whole life. It was a requirement to graduate to study the bible and I did. After graduation I went on my own search to find god. I looked at Wicca and Hinduism and a few otjher religions. I read a book called the history of religion (don't ask who write it, I don't remember). I kept search for purpose in life, and explaination of why I am here. Why I am not like everyone else...etc....\n \n I did a lot of soul searching. My sister was a born again fundementalist and she tried to convert me to that but I couldn't seem to buy into the bible and all it's major contradictions. I am a beatles fan and learned a little about George Harrison and his seach for god. What gives purpose and meaning to it all. The search for god is so important. I realized that the only true meaning in my life is the meaning I give it! A book that changed my life and really amde me see my own spirituality in a differnt way was: Living in the light: by Shakti Gawin. I am not saying you should read it, but I highly reccomend it. It changed my sense of spiritaulity and helped me through some dark times. \n \n God is ammused by his little ant farm like I am ammused by two awesome dogs: Nikita and Cody.....I do love my dogs with all my heart and if there is a god (which I doubt) He must love us in a similar way. I know many may critize my view, but my life has incredible meaning. I send so much good energy into the world as a mental health worker, a good partner to the love of my life (which is a challenge on anyday, but I enjoy the challenge) I have great friends who give me purpose and I know that I count into a larger world.\n \n No offense but.....\n \n As a mental health worker I recognize that some of your struggle has to do with self esteem, feeling like a you are part of a bigger picture. Not that I agree with giving online advice, I would think it great, if you decided to see a counselor for even a few sessions. NOT SAYING YOU ARE SICK. but you are seemingly not feeling good about your life and counselors are trained to listen and give unbiased feedback . One of the symptoms of low self esteem is when someone feels they are not part of a larger picture.........Understanding the large pic comes from the smaller picture of you is a great help in this struggle. If you had a tooth ache you would see a dentist. If you are feeling low or depressed, don't feel ashamed to go see a counselor. You would be amazed how good you could feel if you did!\n \n Feel free to PM me, if you need a referrral. I belong to an organization that in National and could find you a counselor in any state!", 
   {}, 
   151247, 
   null, 
   1122518340.0
  ], 
  [
   151271, 
   null, 
   "jitobear", 
   "\"Argument from design\" is a good argument, but to me it is undercut by its own logic and by the evidence of evolution. The logic of the argument is that complexity implies a creator. Well the most complex thing in the universe is God, so the incredible complexity of God implies even more that something must have created God. Second, the evolutionary evidence seems to show that complexity can come into being without a creator. Evolution seems to rule out the need for a creator. I would appreciate references if people can steer me to writings that contradict this.\n\n \n Evolution is simply about how life changes. It does not rule out a creator at all. It axes the seven literal days laid out in Genesis (which I really don't believe are meant to be literal anyway). Evolution is not about how it started, it's about how life progressed. I think the creator designed it to work this way. \n \n There are those who find that offensive to their faith. I don't get that. They keep looking for magic in a world that is already magical and a miracle.\n \n The idea that I may share a common ancestor with an ape or that birds share a common ancestor with birds or that this earth is billions of years old does not offend my religious sensibilities at all - it inspires them. Imagine it - planning all this! This amazing place to live, work and play - with all its mysteries - mysteries that work - and keep us from ever being bored.", 
   {}, 
   151219, 
   null, 
   1122519360.0
  ], 
  [
   151287, 
   null, 
   "Easyrider", 
   "Easyrider - While your faith in the resurrection is touching, it's safe to say that it is wholly irrational to believe that Jesus was resurrected. It's impossible. That's the point.\n\n \n What, no miracles? Most Americans (about 90-92%) believe there is a God. What tickles me is that some of them can believe in a magnificent supernatural being but then turn around and try to tell people he's too impotent to raise a dead person when he has already created an entire universe. LOL!\n \n You've got your own miracles you must then believe in - the mathematically improbable concept of abiogenesis, for instance. Or the belief that genetic mutations give rise to speciation (check out the odds on that one occurring). Or the miracle that \"poof\" - the uniiverse suddenly appeared out of nowhere. \n \n Christ is indeed Risen, and in my next post I'll give you some historical evidence for an improbable miracle.", 
   {}, 
   151076, 
   null, 
   1122522900.0
  ], 
  [
   151288, 
   null, 
   "Easyrider", 
   "A Miracle for Pravda\n \n THE SUN DARKENED AT NOON\n \n Circa 750 B.C.\n \n According to Amos 1:1, Amos prophesied during the reigns of Uzziah, king of Judah (767-739 B.C.), and Jeroboam, king of Israel (782-753 B.C.). The name \"Amos\" is derived from the Hebrew term meaning, \"lift a burden,\" or \"burden-bearer\" (note Isaiah 9:4, speaking of the coming Messiah as one who would carry our burdens, and also Matthew 11:28). His calling by God was to foretell of pending judgments upon a number of surrounding nations, and particularly of a coming judgment upon Israel. As is common with other Biblical prophets, along with the promise of impending judgment, God also gave Amos a glimpse of events that would soon occur in the life of the coming Messiah, though the significance of what was prophesied may or may not have been made known to Amos. And so it is in the Old Testament book of Amos that we find a prophecy that for many centuries was looked upon with wonder and curiosity:\n \n \"'In that day,' declares the Sovereign Lord, 'I will make the sun go down at noon and darken the earth in broad daylight....I will make that time like mourning for an only son, and the end of it like a bitter day.'\" (Amos 8:9-10)\n \n It probably wasn't until the day of the crucifixion of Jesus Christ in 32 A.D. that the prophecy of Amos took on clarity and meaning, for in Matthew 27:45 Jesus had just been nailed to the cross when the Bible records:\n \n \"From the sixth hour until the ninth hour darkness came over all the land.\"\n \n Just as the \"Star of Bethlehem\" marked the birth of Christ, so now God brought forth another celestial miracle to pronounce His death. This prophecy is one of those that is beyond the control of mortal man, and as such it dispels the theory that Christ could have manipulated events so as to make it appear that He was the Messiah. But is there any evidence that this really occurred? Did the sun go dark at noonday? In his book, Evidence That Demands a Verdict (Volume 1, pages 81-87), Josh McDowell provides the following historical evidence that what took place at Calvary was more that just fanciful mythology:\n \n Concerning the Samaritan-born historian Thallus, circa 52 A.D: (The writings of Thallus no longer exist, yet were alluded to by the historian Julius Africanus, as follows): \"Thallus, in the third book of his histories, explains away this darkness as an eclipse of the sun - unreasonably, as it seems to me - unreasonably, of course, because a solar eclipse could not take place at the time of a full moon, and it was at the season of the Paschal full moon that Christ died.\"\n \n Likewise, Africanus wrote concerning the writings of another first century historian by the name of Phlegon: \"....during the time of Tiberius Caesar an eclipse of the sun occurred during the full moon.\" \n \n Phlegon is also mentioned by the historian Origen in his work, \"Contra Celsum,\" book 2, sections 14, 39, and 59: \"Phlegon mentioned the eclipse that took place during the crucifixion of the Lord Christ....and this is shown by the historical account itself of Tiberius Caesar.\" Apparently at one time there were historical accounts of the strange darkness that came over the land that were kept in the official archives of Tiberius Caesar, though they are likely lost to history.\n \n Finally, the 2nd century Roman born jurist and theologian Tertullian referred to a Roman archives report of an \"unexplained darkness that took place during the reign of Tiberius Caesar, as can be seen in the archives of Pontius Pilate.\"\n \n The darkness spoken of in the book of Matthew occurred between noon and three P.M. in the afternoon (from the sixth to the ninth hours, as the Jews were noted as referring to the sixth and the ninth hours of daylight). Note that a solar eclipse will take less than an hour to complete, and a total solar eclipse lasts just a few minutes. This, coupled with the fact that a solar eclipse cannot occur during a full moon (the moon would be on the 'other' side of the earth), provides further evidence that what occurred was something other than an eclipse of the sun. Just what it was no one can say for sure, just that from recorded historical sources there was a strange darkness during the time of the crucifixion of Jesus Christ. From God's perspective, it surely was a time of mourning for His only begotten son. \n \n Jesus once said, \"I am the light of the world.\" So it shouldn't be surprising that during his death there might be a time of darkness over the land. \n \n REFERENCE: McDowell, Josh. Evidence That Demands A Verdict (Vol. 1). Thomas Nelson Publishers. Nashville. 1972.", 
   {}, 
   151287, 
   null, 
   1122523140.0
  ], 
  [
   151338, 
   null, 
   "trebor", 
   "A Miracle for Pravda\n \n THE SUN DARKENED AT NOON\n \n Circa 750 B.C.\n \n \n REFERENCE: McDowell, Josh. Evidence That Demands A Verdict (Vol. 1). Thomas Nelson Publishers. Nashville. 1972.\n\n \n \n Let's see, you are using as 'evidence' a quote from a mid second century appologist, who is alledgely quoting from a 1st century historian whose work no longer exists, and whose very words we don't know. \n \n So Easy me lad. How do we know that Africanus actually quoted Thallus in context, and was talking about the same timeframe at all? We got the words of someone who is a biased source written 100 years after the event.\n \n If the date of the alleged writing is anywhere near accurate (20 years after the alledged event), it certainly would be difficult to try to corrolate the eclipse event to the date the Jesus was alledged to have been executed. \n \n So much for evidence. WIshful thinking from an appologist at best.", 
   {}, 
   151288, 
   null, 
   1122569160.0
  ], 
  [
   151394, 
   null, 
   "unkerpaulie", 
   "I think many people find satisfaction is this kind of thinking, but my response is, \"Okay, so I believe in a vision of something better, makes goals, and strive toward it. The fact is that even if I could achieve something great, which is unlikely, it won't make a damn bit of difference one hundred years from now.\" For example, my profession is sociology. Can anyone even name me the first president of the Amercan Sociological Association? I sure as hell don't know. The leading sociologist in the country 100 years ago, and practically nothing of him exists now. And how many of us can even get close to achieving that level of success?\n\n i see from this reply and the others you wrote that your most pressing concern is accepting that god doesnt exist (and therefore there is no eternal soul, afterlife or holy destination) and not becoming overly depressed that life has no grand meaning and you will be uncerimoniously forgotten after you die\n \n one way to overcome this is to look at the alternatives. first of all, nobody will remember the founder of the asa whether god exists or not, so god's existence isnt going to help you leave a lasting legacy on earth. second, for the \"advantage\" of having a celestial purpose in life, believing in god comes with the frustrating restrictions of adhering to the biblical rules and commandments. third, believing in god necessitates a level of closed-mindedness that is extremely uncomfortable for any logical thinker.\n \n basically, weigh what you lose to what you gain. you may find that you are better off not believing in god after all", 
   {}, 
   151215, 
   null, 
   1122575340.0
  ], 
  [
   151516, 
   null, 
   "Easyrider", 
   "\"The parokhet in the Temple\": r.e. Matthew 27:51\n \n Exodus 26:31-35 describes this curtain as it existed in the desert Tabernacle in the Old Testament. It separated the Holy Place from the Holy of Holies. Only the cohen hagadol (High Priest) was allowed to pass through it into the Holy of Holies; and that he could do only once a year, on Yom-Kippur, to make an atonement sacrifice for his sins and for the sins of the Jewish people. When it was ripped in two from top to bottom during the crucifixion of Jesus Christ, it symbolized the fact that God was giving everyone access to the most holy place of all in heaven, as taught explicitly in Hebrews 10:19-20.\n \n The Jewish Talmud bears an amazing, unwitting witness to the work of Jesus in altering the system of atonement. The background is that on Yom-Kippur, when the cohen hagadol sacrificed a bull (Leviticus 16), a piece of scarlet cloth was tied between its horns. If it later turned white, it meant that God had forgiven Israel's sin in accordance with Isaiah 1:18, \"Though your sins be as scarlet, they will be white as snow.\"\n \n The Talmud provides some insightful evidence of what transpired during the time of Christ and the next forty years after his crucifixion:\n \n \"Our Rabbis taught that throughout the forty years that Shim'on the Tzaddik served,... the scarlet cloth would become white. From then on it would sometimes become white and sometimes not.... Throughout the last forty years before the Temple was destroyed (in 70 A.D.)... the scarlet cloth never turned white.\"  (Jewish Talmud - Yoma 39a-39b)\n \n Thus in the days of Shim'on Tzaddik the sacrificial system established by God in the Tanakh was observed, and it was effective. But afterwards Israel's spirituality declined, so that the sacrificial system was effective only sometimes. Finally, after Jesus' death, forty years before the destruction of the Temple, it was never effective. The Talmud does not say it, but what had become effective for forgiving Israel's sin was the sacrificial death of Jesus the Messiah.\"  \n http://www.christian-thinktank.com/dveil.html", 
   {
    "unicode_changes_made": true
   }, 
   151394, 
   null, 
   1122595800.0
  ], 
  [
   151526, 
   null, 
   "galton", 
   "....Living in the light: by Shakti Gawin. I am not saying you should read it, but I highly reccomend it. It changed my sense of spiritaulity and helped me through some dark times.\nThanks, I'll have to take a look at it. \n \n \nNo offense but.....\n As a mental health worker I recognize that some of your struggle has to do with self esteem, feeling like a you are part of a bigger picture. Not that I agree with giving online advice, I would think it great, if you decided to see a counselor for even a few sessions. NOT SAYING YOU ARE SICK. but you are seemingly not feeling good about your life and counselors are trained to listen and give unbiased feedback.\n\n I appreciate your thoughts, but my problem is not psychological. I don't feel badly about myself in any way; I feel simply feel badly that I believe when I die I will never see my kids again. It isn't that I don't see all the beauty and good things in life, or fail to enjoy those things or to find meaning in them. I could have easily started a thread titled, \"Let's enumerate all the good things in life.\" I simply thought that the well-informed people in this forum might have some arguments in favor of the existence of God because it would be an improvment to believe rather than not believe. The issue nags and troubles me at times, but it does not incapacitate me or throw me into fits of despair. If I need any kind of expert at all, it is the theologian or philosopher.", 
   {}, 
   151267, 
   null, 
   1122596700.0
  ], 
  [
   151529, 
   null, 
   "galton", 
   "one way to overcome this is to look at the alternatives. first of all, nobody will remember the founder of the asa whether god exists or not, so god's existence isnt going to help you leave a lasting legacy on earth.\n \n My point is the existence of God would make worldy achieivements (or the lack of them) unimportant. \n \n \n\n second, for the \"advantage\" of having a celestial purpose in life, believing in god comes with the frustrating restrictions of adhering to the biblical rules and commandments. third, believing in god necessitates a level of closed-mindedness that is extremely uncomfortable for any logical thinker.\n \n basically, weigh what you lose to what you gain. you may find that you are better off not believing in god after all\n\n This point is a very valid one. One thing I do like about my disbelief is the freedom I have to follow my own mind and to be the creator of myself. When you follow a religious system, your map is laid out for you, and it is simply your job to follow that map as closely as possible. As I am, I never have to say, \"Well, I can't think that way or consider a certain course of action because my religion says no.\" I am the Michelangelo over the sculpture that is me.", 
   {}, 
   151394, 
   null, 
   1122597180.0
  ], 
  [
   151538, 
   null, 
   "galton", 
   "Looks like I am going to have a conversation with myself over arguments concerning God. emoticon_rolleyes The first I ran across is the old argument that life is a long series of causes and effects, but it is inconceivable that this has been going on forever; therfore, there must be a First Cause that is that precedes the universe, and is uncaused and self-containing, and that entity is God. \n \n My response is maybe, but I don't really see why you could not have an endless stream with no beginning and no end. The stream of cause and effect could be endless in both directions--it simply is. That might be difficult to picture, but that may simply be because we are finite beings who find it hard to imagine infinite things.\n \n I also find this line of argument a bit unsatsifying like the earlier one about the complexity of the universe because they point to something we might call God, but that God is just as big a question mark as ever, if not bigger. God is the First Cause, God is complexity and complexity demands an origin. Well, these points don't leave me much better off than before I heard them. Some may say that the mystery is what makes the concept of God so great. I say, please, I'll take clarity any day. At least I get clarity from the evolutionary story.", 
   {}, 
   151529, 
   null, 
   1122598080.0
  ], 
  [
   151541, 
   null, 
   "Kronus", 
   "I am the Michelangelo over the sculpture that is me.\n\n \n Fantasticaly put!\n \n Here's my impression from what you've said so far. You would really like life to have some higher purpose or meaning. Your rational mind tells you that the existence of God is pretty unlikely, and yet you feel that God is the most likely source of higher meaning.\n \n If you don't believe in God, then you probably believe that any higher meaning gained from religion has as its source people. If you \"found religion\", I suspect that you would still feel, in your heart, that whatever purpose you'd gained had its source not in God, but in people. The fact that you're looking for rational reasons to believe in God tells me that your rational mind won't let go of this issue, and you'll always believe that people are the source of whatever purpose you find. If that's going to be the case anyway, then embrace that. There are many philosophies out there that speak of higher purpose without relying on the divine to justify them. I've often felt that religion is for people who want purpose spoon fed to them. You don't strike me as that sort. Go out and explore. Look around and see what strikes a chord with you. With luck you'll find a purpose that doesn't force you to turn off your rational mind.", 
   {}, 
   151529, 
   null, 
   1122598500.0
  ], 
  [
   151542, 
   null, 
   "galton", 
   "Evolution is simply about how life changes. It does not rule out a creator at all.\n\n My point is not the evolution rules out a creator. The \"Watchmaker\" argument says that the universe is so complex, we need to posit the existence of God to explain it. My point is that evolution does a good job of explaining all this complexity without reference to God; it obviates the need to posit a God to explain the complexity. I think you are right that the ideas God and evolution do not necessarily contradict each other.", 
   {}, 
   151271, 
   null, 
   1122598620.0
  ], 
  [
   151545, 
   null, 
   "galton", 
   "If you don't believe in God, then you probably believe that any higher meaning gained from religion has as its source people. If you \"found religion\", I suspect that you would still feel, in your heart, that whatever purpose you'd gained had its source not in God, but in people. The fact that you're looking for rational reasons to believe in God tells me that your rational mind won't let go of this issue, and you'll always believe that people are the source of whatever purpose you find. If that's going to be the case anyway, then embrace that. There are many philosophies out there that speak of higher purpose without relying on the divine to justify them. I've often felt that religion is for people who want purpose spoon fed to them. You don't strike me as that sort. Go out and explore. Look around and see what strikes a chord with you. With luck you'll find a purpose that doesn't force you to turn off your rational mind.\n\n These points are very good. I would add that the three major areas where one could find meaning seem to be: people, nature, or the supernatural. Well, I doubt very much the last one exists, so for the last 15 years I have explored around to find meaning that satisifies, but I have not been very successful, and it seems to me a pity if one is on his death bed, and he looks back on his life and says, \"Well that was 75 years of false starts.\"", 
   {}, 
   151541, 
   null, 
   1122599520.0
  ], 
  [
   151549, 
   null, 
   "trebor", 
   "\n \"Our Rabbis taught that throughout the forty years that Shim'on the Tzaddik served,... the scarlet cloth would become white. From then on it would sometimes become white and sometimes not.... Throughout the last forty years before the Temple was destroyed (in 70 A.D.)... the scarlet cloth never turned white.\"  (Jewish Talmud - Yoma 39a-39b)\n [/url]\n\n \n Considering Yoma 39A says\n \n \n\n \"Transgression stupefies the heart, as it is written: don't defile yourselves with them and become defiled. Don't ready venitmeitem (become defiled) but rather venitamtem\" (become stupefied - evidently from the same root).\n \n\n \n I would have to say that your source is using a forgery.", 
   {}, 
   151516, 
   null, 
   1122600180.0
  ], 
  [
   151569, 
   null, 
   "PoohBear", 
   "im lost what are yal trying to prove? cause youre getting nowhere with what you have now.", 
   {}, 
   151549, 
   null, 
   1122603000.0
  ], 
  [
   151573, 
   null, 
   "joebrummer", 
   "My point is the existence of God would make worldy achieivements (or the lack of them) unimportant. \n \n \n This point is a very valid one. One thing I do like about my disbelief is the freedom I have to follow my own mind and to be the creator of myself. When you follow a religious system, your map is laid out for you, and it is simply your job to follow that map as closely as possible. As I am, I never have to say, \"Well, I can't think that way or consider a certain course of action because my religion says no.\" I am the Michelangelo over the sculpture that is me.\n\n \n \n That is mostly where my first repsonse came from....Unitarian Ministers are usually open to all faiths and many beliefs. I am not saying you should become a UUC member, but I bet a talk with a UUC minister would be helpful. They just tend to know more about different religions. A big part of the UUC is being spiritual, without the rules of any one faith. You can be an athiest, a christian, a Quaker, a jew and the UUC welcomes you with love. UUC ministers need to know a bit about many faiths....and could answer questions about many faiths and denominations. Just a thought.\n \n I would also reccomend anything written by Ken Keyes JR. for books on spiritual thoughts without any specific doctorine. Just about spirituality.\n \n I just feel it is wrong to push any one faith onpeople. I feel you should find your own spirituality, that way you have \"faith\" in it without unanswered questions, alothough I suppose there are always unanswered questions about it all. A wise man once said...it is not about getting to the top of the mountain for the view, but the journey along the way!\n \n Good luck!", 
   {}, 
   151529, 
   null, 
   1122604200.0
  ], 
  [
   151574, 
   null, 
   "joebrummer", 
   "im lost what are yal trying to prove? cause youre getting nowhere with what you have now.\n\n \n \n it seems there are a few debates here, reading between the threads in the only way to see the true debate going on!\n \n \n ha ha ha!", 
   {}, 
   151569, 
   null, 
   1122604260.0
  ], 
  [
   151581, 
   null, 
   "Easyrider", 
   "Trebor's Follies\n \n \nConsidering Yoma 39A says...Quote: \"Transgression stupefies the heart, as it is written: don't defile yourselves with them and become defiled. Don't ready venitmeitem (become defiled) but rather venitamtem\" (become stupefied - evidently from the same root). I would have to say that your source is using a forgery.\n\n \n I suppose you are charging that my original quote was a Christian forgery?\n \n Seems like you are the one who could use some help on this.\n \n The following is from a JEWISH website (not a Christian website).\n \n In Tractate Yoma 39b, the Talmud quotes a Baraisa1 that discusses numerous remarkable phenomena that occurred in the Temple during the Yom Kippur service. More specifically, the Talmud states that there was a strip of scarlet-dyed wool tied to the head of the scapegoat2 which would turn white in the presence of the large crowd gathered at the Temple on the Day of Atonement. The Jewish people perceived this miraculous transformation as a heavenly sign that their sins were forgiven. The Talmud relates, however, that 40 years before the destruction of the second Temple the scarlet colored strip of wool did not turn white. \n \n Tractate Yoma4 is wholly given over to laws pertaining to Yom Kippur. Although missionaries cite the above statement which appears on page 39b, the discussion leading up to this quote begins on the previous page, 39a. \n \n http://www.outreachjudaism.org/Yomkippur.html\n \n By the way, Dr. Michael Brown decimates Rabbi Singer's anti-missionary arguments in Brown's book, \"Answering Jewish Objections to Jesus (volumes 1-3).\" \n \n Nice try, Trebor", 
   {}, 
   151574, 
   null, 
   1122606060.0
  ], 
  [
   151583, 
   null, 
   "trebor", 
   "Trebor's Follies\n \n \n \n I suppose you are charging that my original quote was a Christian forgery?\n \n Seems like you are the one who could use some help on this.\n \n The following is from a JEWISH website (not a Christian website).\n \n In Tractate Yoma 39b, the Talmud quotes a Baraisa1 that discusses numerous remarkable phenomena that occurred in the Temple during the Yom Kippur service. More specifically, the Talmud states that there was a strip of scarlet-dyed wool tied to the head of the scapegoat2 which would turn white in the presence of the large crowd gathered at the Temple on the Day of Atonement. The Jewish people perceived this miraculous transformation as a heavenly sign that their sins were forgiven. The Talmud relates, however, that 40 years before the destruction of the second Temple the scarlet colored strip of wool did not turn white. \n \n Tractate Yoma4 is wholly given over to laws pertaining to Yom Kippur. Although missionaries cite the above statement which appears on page 39b, the discussion leading up to this quote begins on the previous page, 39a. \n \n http://www.outreachjudaism.org/Yomkippur.html\n \n By the way, Dr. Michael Brown decimates Rabbi Singer's anti-missionary arguments in Brown's book, \"Answering Jewish Objections to Jesus (volumes 1-3).\" \n \n Nice try, Trebor\n\n \n \n Ah.. so the jewish source you quotes disagrees with your original source. I am so glad you admit that.\n \n \n And, I am sure you think that Dr Michael brown decimates you, but I am also sure that Dr Michael brown doesn't have a Jewish theology education, and therefore is biased.\n \n Other people are skepitcal about Dr Brown also. See Accusers of the Brethren or Good Bereans? by Debra Bouey", 
   {}, 
   151581, 
   null, 
   1122606660.0
  ], 
  [
   151588, 
   null, 
   "Easyrider", 
   "Trebor's Follies\n \n \nAh.. so the jewish source you quotes disagrees with your original source. I am so glad you admit that.\n\n \n Wrong. He disagreed with your allegations. Specifically, you argued Yoma 39a did not talk about the subject I originally mentioned. And the Jewish website made you out to be a liar on that.\n \n \nAnd, I am sure you think that Dr Michael brown decimates you, but I am also sure that Dr Michael brown doesn't have a Jewish theology education, and therefore is biased.\n\n \n More lies. \n \n Dr. Brown has a Ph.d. in Near Eastern Languages and Literature (which includes Jewish theological literature and scripture) from New York University.\n \n He has also authored 10 books and is a contributor to the Oxford Dictionary of Jewish Religion.\n \n Reckon he knows a little more than you do about these things, Trebor.", 
   {}, 
   151583, 
   null, 
   1122607260.0
  ], 
  [
   151594, 
   null, 
   "trebor", 
   "Trebor's Follies\n \n \n \n Wrong. He disagreed with your allegations. Specifically, you argued Yoma 39a did not talk about the subject I originally mentioned. And the Jewish website made you out to be a liar on that.\n \n \n \n More lies. \n \n Dr. Brown has a Ph.d. in Near Eastern Languages and Literature (which includes Jewish theological literature and scripture) from New York University.\n \n He has also authored 10 books and is a contributor to the Oxford Dictionary of Jewish Religion.\n \n Reckon he knows a little more than you do about these things, Trebor.\n\n \n Yes, it was not a Jewish univsersity. Let's see, he also talked about acid and heroin to Jesus. How very typical.\n http://testimonies.crossmap.com/story/301\n \n emoticon_rolleyes", 
   {}, 
   151588, 
   null, 
   1122608220.0
  ], 
  [
   151608, 
   null, 
   "galton", 
   "This is a very stimulating piece from the always interesting Stever Sailer posted today on his website (isteve.com):\n \n \"Darwin seems to lose out with the public primarily when his supporters force him into a mano-a-mano Thunderdome death match against the Almighty. Most people seem willing to accept Darwinism as long as they don't have to believe in nothing but Darwinism. Thus, the strident tub-thumping for absolute atheism by evolutionary biologists like Richard Dawkins, author of the great book \"The Selfish Gene,\" is counter-productive....\"\n \n \"The smug atheism rampant among prominent evolutionists today is reminiscent of that of the physicists in 1899, just before the 20th Century unleashed a host of unwelcome surprises upon them. Unfortunately, biologists don't know enough of the history of physics and cosmology to see how atheistic dogmatism can mislead and slow scientific progress...\"\n \n \"The two most scientifically fruitful theories in 20th Century cosmology -- the Big Bang and the Anthropic Principle of Intelligent Design -- were partially cribbed from theologians like St. Thomas Aquinas, much to the dismay of cosmologists.\"\n \n \"In 1927 Father Georges Lemaitre, a Belgian priest and mathematician, devised what's now called the Big Bang theory. Most scientists found its similarities to Genesis' \"Let there be light\" and the famous prime mover proof for the existence of God to be unsettling. Thus, they largely turned toward the less subversive Steady-State theory. This postulated that the creation of matter wasn't a one-shot cataclysm of Biblical proportions, but a routine, small-scale event. The 1964 discovery that you could watch the electro-magnetic static generated by the Big Bang on your TV disproved this comforting scenario, however, ushering in an era of rapid scientific advance.\"\n \n \"Then in 1974 cosmologist Brandon Carter revived the ancient Argument from Design for the existence of God. This had held that the existence of a well-designed item like a sword or a bird's wing implies the existence of a designer. Darwin's theory of natural selection had seemingly disposed of that chestnut by demonstrating that the differential reproduction rates of competing variations could eventually produce superbly engineered organisms without a designer. Carter, however, showed that our universe appears to be fine-tuned to support the evolution of intelligent life. A host of seemingly arbitrary physical parameters such as the strength of gravity, coincide superbly well to foster a stable, long-lived universe. The odds against such a coincidence happening by chance appear, well, astronomical.\"\n \n \"Once again, a quasi-religious notion did wonders for the fecundity of cosmological theory. To avoid admitting a Designer, cosmologists had to postulate that beyond our natural world, there must exist a, shall we say, \"supernatural\" world. Rather than a hairy thunderer shouting \"Let there be light,\" maybe, they say, there is a \"superuniverse\" comprising an infinite number of universes, all with different natural laws. And maybe life only emerges in the universes with the right law, like ours. And maybe, to make the Darwinian metaphor complete, universes compete somehow against each other.\"\n \n \"This infinite universes concept is a sensationally creative idea. Of course, in its utter untestability, it's not exactly science. In truth, it is theological speculation at its most grandiose. Philosopher Robert C. Koons notes, \"Originally, atheists prided themselves on being no-nonsense empiricists, who limited their beliefs to what could be seen and measured. Now, we find ourselves in a situation in which the only alternative to belief in God is belief in an infinite number of unobservable parallel universes! You've come along way, baby!\" At minimum, we now know that our natural world cannot account for its own existence. To do that, we need to assume the existence of some sort of supernatural word. And even if some enormous breakthrough let us validate the existence of this superuniverse, we'd probably end up having to assume that it was brought about by some sort of hyperuniverse beyond that, and on and on.\"", 
   {}, 
   151594, 
   null, 
   1122616260.0
  ], 
  [
   151656, 
   null, 
   "trebor", 
   "This is a very stimulating piece from the always interesting Stever Sailer posted today on his website (isteve.com):\n \n \"Darwin seems to lose out with the public primarily when his supporters force him into a mano-a-mano Thunderdome death match against the Almighty. Most people seem willing to accept Darwinism as long as they don't have to believe in nothing but Darwinism. Thus, the strident tub-thumping for absolute atheism by evolutionary biologists like Richard Dawkins, author of the great book \"The Selfish Gene,\" is counter-productive....\"\n \n \n\n \n The problem with that is that most supporters of the theory of evoltuion are not atheists. The ultra relgious make believe they are,and use that as an ad homenen attack to discredit evolution.", 
   {}, 
   151608, 
   null, 
   1122645000.0
  ], 
  [
   151670, 
   null, 
   "Kronus", 
   "These points are very good. I would add that the three major areas where one could find meaning seem to be: people, nature, or the supernatural. Well, I doubt very much the last one exists, so for the last 15 years I have explored around to find meaning that satisifies, but I have not been very successful, and it seems to me a pity if one is on his death bed, and he looks back on his life and says, \"Well that was 75 years of false starts.\"\n\n \n There are those that say that truth is a journey, and not a destination. A life spent looking for truth is a life well spent, even if you never quite get there.\n \n And personally, I would much rather have tried a million dead ends than have spent my whole life travelling down one road which I knew wasn't taking me where I wanted to go.", 
   {}, 
   151545, 
   null, 
   1122655380.0
  ], 
  [
   151673, 
   null, 
   "sinjin", 
   "IIRC the Greeks believed absolute truth existed but could never be closely approached by man.", 
   {}, 
   151670, 
   null, 
   1122656280.0
  ], 
  [
   151817, 
   null, 
   "galton", 
   "Here are two other classic arguments for God I just reviewed: \n \n Pascal's Wager: He is a saying it is prudent to believe in God because it does no harm to believe, but if we don't beleive and He indeed exists, we will be punished for our atheism. My response is that this point only applies to religions that claim you will be punished if you don't believe. It also implies that you would be wise to believe in ALL religions that argue that you will be punished just to cover your bets. This latter point highlights the non-serious nature of this argument. To a non-believer, it doesn't work to say believe or else.\n \n Ontological Argument: The idea of God implies the concept of perfection. An imperfect God is no God at all. Well one property of perfection is that it doesn't lack anything, and something imaginary lacks existing. So for a Being to be perfect, it must exist, so the very idea of God implies existence. To say \"imaginary God\" is nonsense. Well, c'mon guys, can't believers do better than this bad example of word play?", 
   {}, 
   151673, 
   null, 
   1122701940.0
  ], 
  [
   151819, 
   null, 
   "galton", 
   "The teleological argument that Sailer gets at above is more compelling. As this argument goes, natural forces have to be just so to produce the precise conditions which make life possible. There are a limitless number of outcomes possible, and the chance of it turning out as human beings and not something else is very slim. The right conditions don't seem unlikely at all if God had a particular outcome in mind and set up conditions to get specific outcome. \n \n I see this as being a fairly serious point. Two concerns come to mind. Experts tells us that the evolutionary evidence shows total blindness, messiness, inefficiencies, dead-ends--it doesn't look like something that was \"set up.\" Second, why would God ever choose this particular outcome? Life indeed has its beauties, no doubt, but it looks to me more like the result of something mindless.", 
   {}, 
   151817, 
   null, 
   1122703140.0
  ], 
  [
   151834, 
   null, 
   "trebor", 
   "Here are two other classic arguments for God I just reviewed: \n \n Pascal's Wager: He is a saying it is prudent to believe in God because it does no harm to believe, but if we don't beleive and He indeed exists, we will be punished for our atheism. My response is that this point only applies to religions that claim you will be punished if you don't believe. It also implies that you would be wise to believe in ALL religions that argue that you will be punished just to cover your bets. This latter point highlights the non-serious nature of this argument. To a non-believer, it doesn't work to say believe or else.\n \n\n \n That is also , of course, assuming that the god someone believes in is the god that actually exists. Pascal was assuming Catholism was correct.\n \n \n\n \n Ontological Argument: The idea of God implies the concept of perfection. An imperfect God is no God at all. Well one property of perfection is that it doesn't lack anything, and something imaginary lacks existing. So for a Being to be perfect, it must exist, so the very idea of God implies existence. To say \"imaginary God\" is nonsense. Well, c'mon guys, can't believers do better than this bad example of word play?\n\n \n Nope. They can't", 
   {}, 
   151817, 
   null, 
   1122731880.0
  ], 
  [
   151835, 
   null, 
   "trebor", 
   "The teleological argument that Sailer gets at above is more compelling. As this argument goes, natural forces have to be just so to produce the precise conditions which make life possible. There are a limitless number of outcomes possible, and the chance of it turning out as human beings and not something else is very slim. The right conditions don't seem unlikely at all if God had a particular outcome in mind and set up conditions to get specific outcome. \n \n I see this as being a fairly serious point. Two concerns come to mind. Experts tells us that the evolutionary evidence shows total blindness, messiness, inefficiencies, dead-ends--it doesn't look like something that was \"set up.\" Second, why would God ever choose this particular outcome? Life indeed has its beauties, no doubt, but it looks to me more like the result of something mindless.\n\n \n The problem with that is that the arguement looks at the result, and then trys to work backwards. It does not take into account that going forward was incremental, and it is also assuming that humanity is the goal and end result. It is sort of taking an arrow, shooting it up randomly in the air, and\n then creating a bullseye right around where it lands.", 
   {}, 
   151819, 
   null, 
   1122732120.0
  ], 
  [
   152076, 
   null, 
   "galton", 
   "It is sort of taking an arrow, shooting it up randomly in the air, and then creating a bullseye right around where it lands.\n\n Excellent point. And part of the allure of the teleological argument is that we humans naturally think we are so special and unique, like a one-in-a-million phenomenon, so God planning it seems more likely than the idea that we won the lottery against all odds. But it only seems like the lottery because we are the prize and feel we are so priceless. An alien might feel compelled to say, \"Those low-life humans totally look like an accident to me.\"", 
   {}, 
   151835, 
   null, 
   1122870420.0
  ], 
  [
   152080, 
   null, 
   "galton", 
   "I had a good discussion with a friend this weekend. I concluded that it is unhealthy (albeit accurate) to take the view that life is pointless because it is only a blip in in the midst of eternal nothingness. The romantic view is the healthy one (and is also accurate): by experiencing life's magic moments, often found with other people, we are saying, \"F*** you, you mindless, dead universe. With this moment, we forever win and you forever lose.\"", 
   {}, 
   152076, 
   null, 
   1122872160.0
  ], 
  [
   152326, 
   null, 
   "unkerpaulie", 
   "The teleological argument that Sailer gets at above is more compelling. As this argument goes, natural forces have to be just so to produce the precise conditions which make life possible. There are a limitless number of outcomes possible, and the chance of it turning out as human beings and not something else is very slim. The right conditions don't seem unlikely at all if God had a particular outcome in mind and set up conditions to get specific outcome. \n \n I see this as being a fairly serious point. Two concerns come to mind. Experts tells us that the evolutionary evidence shows total blindness, messiness, inefficiencies, dead-ends--it doesn't look like something that was \"set up.\" Second, why would God ever choose this particular outcome? Life indeed has its beauties, no doubt, but it looks to me more like the result of something mindless.\n\n could it be that life is created to fit into the nvironment, rather than the environment is just right for life? why do we assume that life only works in a particular way (the way we know it), and because life as we know it fits so perfectly with earth's environment, we assume that earth's environment is a prerequisite for life. life is actually a very dynamic and resilient thing. it adapts. life can be found in the most hostile environments on earth (sub-freezing temperatures, toxins, stomach acid, etc) yet we continue to assume that life could only exist because our environment perfectly facilitates our life\n \n the only reason why the assumption or idea that god exists is around is because humans have a quality called curiosity. we feel pain or joy, but rather than accept pain and joy as part of the process of life (like the rest of the animal kingdom does), we question the motives of pain and joy. other species also encounter situations that are beyond their control. but they dont need somebody to point a finger at when something unexpected happens to them, like humans do. we wonder how come such a thing could happen to us, we try to disect it to see how it works, we try to add or subtract from it to see if it could work differently. animals dont have this dilema.\n \n its interesting that good and evil exists nowhere else than where humans are or can be affected. the surface of jupiter is beset by horrific hurricanes and \"natural disasters\", yet nobody is around to consider if these things are good or bad, because it simply doesnt affect us. recently a natural fracture in the crust of the earth caused a tsunami that killed thousands of people. immediately the question of good and evil is raised,as well as the ramifications of religion and the supernatural. were that tsunami on jupiter at 100 times the magnitude, the issue would not even raise an eyebrow\n \n good and evil are man-made concepts. that doesnt mean that we should disregard them, because the fact is we still must interact with other humans regardless of gods presence. but the idea that these concepts are divinely established and governed is actually conterproductive rather than beneficial. imho, of course", 
   {}, 
   151819, 
   null, 
   1123000080.0
  ], 
  [
   152504, 
   null, 
   "johnhanks", 
   "The problem with that is that the arguement looks at the result, and then trys to work backwards. It does not take into account that going forward was incremental, and it is also assuming that humanity is the goal and end result. It is sort of taking an arrow, shooting it up randomly in the air, and\n then creating a bullseye right around where it lands.\n\n \n To paraphrase Douglas Adams: if a puddle of water had intelligence, it would know god existed. What else could explain there being a depression in the ground exactly the right shape for it to fit?", 
   {}, 
   151835, 
   null, 
   1123061160.0
  ], 
  [
   152987, 
   null, 
   "galton", 
   "To paraphrase Douglas Adams: if a puddle of water had intelligence, it would know god existed. What else could explain there being a depression in the ground exactly the right shape for it to fit?\n\n In other words, man being precisely what the laws of nature would make him is no evidence for a God. I am not sure this is the same argument that was made above in the quote. I think what the argument is saying is that man--the highest manifestation on Earth--is so impressive, he is very unlikely. A meteorite, for example, seems the sort of thing that would be likely. To produce something very unlikely, you need an unlikely combination of forces. What is against the odds doesn't seem so unlikely if God is posited to explain it.", 
   {}, 
   152504, 
   null, 
   1123197120.0
  ], 
  [
   152994, 
   null, 
   "galton", 
   "Here is Kant's \"argument from moral order\" (in my words and my interpetation):\n \n 1. When it comes to morality, seeking happiness through virtue makes sense--it is a compelling argument. \n 2. Seeking happiness through virtue does not make sense if the actions do not increase the amount of good in the world. \n 3. There is no evidence that the amount of goodness in the world is increasing through our moral actions. \n 4. Therefore we must assume their is some supernatural force that is on the side of good. \n \n This argument does not persuade me at all. He seems to be saying that moral law is real but the world is not living up to it so therefore God must be there to make up for the world's lack of morality. I see no reason to think that there is some moral law floating around out there that implies God's existence. And geez, people, this is KANT. If he can't come up with better arguments, I think the God cause is sunk.", 
   {}, 
   152987, 
   null, 
   1123197960.0
  ], 
  [
   153098, 
   null, 
   "johnhanks", 
   "I think what the argument is saying is that man--the highest manifestation on Earth--is so impressive, he is very unlikely.\n\n \n I haven't excavated the whole thread, so these points have probably been made before.\n 1 On objective criteria, is man qualitatively more impressive (or unlikely) than, say, a termite colony?\n 2 Just who is it who is calling man impressive? Why, it's -\n \n \nWhat is against the odds doesn't seem so unlikely if God is posited to explain it.\n\n \n Except that if the spontaneous existence of something as powerful and impressive as man is inherently unlikely, why doesn't the same objection apply to god? Invoking god does not explain anything: it simply gives the unknown cause a label.", 
   {}, 
   152987, 
   null, 
   1123237620.0
  ], 
  [
   153100, 
   null, 
   "galton", 
   "1 On objective criteria, is man qualitatively more impressive (or unlikely) than, say, a termite colony?\n\n I think it can be easily argued that a human colony is more impressive than a termite colony. They haven't put a fellow termite on the moon yet, as far as I know.;-) Not to say a termite colony is not impressive in its own right. \n \n \n\n Except that if the spontaneous existence of something as powerful and impressive as man is inherently unlikely, why doesn't the same objection apply to god? Invoking god does not explain anything: it simply gives the unknown cause a label.\n\n I agree completely.", 
   {}, 
   153098, 
   null, 
   1123239900.0
  ], 
  [
   153902, 
   null, 
   "galton", 
   "I reread the above-quoted argument again, and again I detectly something subtlely different. Sailer is saying that if universal laws were set at even slightly different levels, the Big Bang wouldn't have occurred (e.g. ig gravitation were stronger it would have collapsed, etc.). So physicists have to posit a limitless number of possible results, most of which would be failure, yet we see an orderly universe of endless size filled with amazing celestial bodies, the human body being the most celestial of the bunch. So he seems to be saying the universe itself is unlikely, yet the existence of a God removes that problem. \n \n But as was argued in the earlier post, even if the reality of God removes the confusion about the origin of the universe, we are not much better off since it tells us little about Him. It only tells us that that He is unbelievably capable to be able to pull something like this off.", 
   {}, 
   153100, 
   null, 
   1123623540.0
  ], 
  [
   154048, 
   null, 
   "johnhanks", 
   "But as was argued in the earlier post, even if the reality of God removes the confusion about the origin of the universe, we are not much better off since it tells us little about Him. It only tells us that that He is unbelievably capable to be able to pull something like this off.\n\n \n Or, of course, that the origin of the universe is beyond our understanding, so we've invented an anthropomorphic cause that we can be happy with. Small children do this instinctively.\n \n It's a bit like Chief Wiggum or his ilk, baffled by an apparently impossible jewel robbery, stating that it was obviously the work of Mr Big, who is sadly now beyond our jurisdiction and thus impossible to interrogate. Another case solved by our brilliant detective force! No further questions.", 
   {}, 
   153902, 
   null, 
   1123669140.0
  ], 
  [
   154066, 
   null, 
   "Raastee", 
   "Galton, Symbiote said: \"If you can cultivate a hatred of homosexuals, you will find that biblical passages provide you with a refuge of justification for your anger, and fundamentalist Christian groups supportive of your views. From there it should be relatively easy to at least pretend to believe in God.\"\n \n Jesus came to save gays, straights, and people like Symbiote. But it appears some just don't want to admit they're sinners in need of salvation.\n\n \n Just like a good salemen religion must convince you that you are missing something and need it...but we dont need it.", 
   {}, 
   150972, 
   null, 
   1123675680.0
  ], 
  [
   154069, 
   null, 
   "galton", 
   "Just like a good salemen religion must convince you that you are missing something and need it...but we dont need it.\n\n About 90 percent of Americans and most of human history contradict the view that religion can be done without. Overall, it seems to me that human experience demonstrates that most people do need religion. Even in my circle (academics) you would think you would finally find people who have grown beyond religion. I have never seen more pious people in my life. In place of God, they have simply put Man the Abstract, and they are zealots at His feet, and they show all the signs of religious extremists. They seethe with hatred, not for the homosexual, but for the bigot. They get hate fever in their brains, not for the atheist, but for the corporation. If you dare whsiper that the bigots occasionally have a point, or that Big Business is often good, you will be excommunicated from the fold. So even our supposedly most enlightened are \"believers\" just like everybody else.", 
   {}, 
   154066, 
   null, 
   1123677480.0
  ], 
  [
   154103, 
   null, 
   "johnhanks", 
   "About 90 percent of Americans and most of human history contradict the view that religion can be done without.\n\n \n Human brains are highly intolerant of unexplained / inexplicable phenomena: we have a very strong drive to find causes for effects. Arguably, this drive (strongly selected for during hominid evolution) is what enabled the early development of technology.\n \n There's good evidence that causal reasoning is hard-wired into our brains. Toddlers invent elaborate systems of cause-and-effect to account for their otherwise mystifying surroundings, and the causes are invariably anthropomorphic ones (they be hardly otherwise). \n \n To quote Lewis Wolpert:\n \n \nFurther evidence that our brains are programmed with causal reasoning, the need to tell a consistent story, comes from mental illness, such as confabulation. Caused by damage of the frontal lobe of the brain, confabulation results in a distortion of memory. A hospital patient may claim that he is in fact at work and the people in the ward work for him. When the doctor points out that they are all in bed he replies that he likes to keep his employees comfortable. Such patients have lost the mental machinery that tests reality, but illustrate how our drive to make sense of the world is strong, even if we do end up believing in nonsense.\n\n \n On this view, religions and animisms evolved largely to furnish explanations for the otherwise inexplicable, a function they still perform for many people ('90 percent of Americans and most of human history', as you put it).\n \n So, given our need for consistent narrative and plausible explanations for otherwise troubling questions (like, what happens to my mind when I die?), can religion 'be done without'? Scientific answers to such questions are inevitably incomplete, tentative and (in the after-death question, for example) for many too bleak and comfortless; on the other hand, the teachings of traditional religions are increasingly found to be flawed and threadbare in the face of scientific advance. Perhaps the rise of fuzzy pick-and-mix New Age-isms is a consequence of this - and a portent that our drive for religiosity will not be shaken off in a hurry.", 
   {}, 
   154069, 
   null, 
   1123697700.0
  ], 
  [
   154109, 
   null, 
   "Big Orn", 
   "Human brains are highly intolerant of unexplained / inexplicable phenomena: we have a very strong drive to find causes for effects. Arguably, this drive (strongly selected for during hominid evolution) is what enabled the early development of technology.\n \n There's good evidence that causal reasoning is hard-wired into our brains. Toddlers invent elaborate systems of cause-and-effect to account for their otherwise mystifying surroundings, and the causes are invariably anthropomorphic ones (they be hardly otherwise). \n \n To quote Lewis Wolpert:\n \n \n \n On this view, religions and animisms evolved largely to furnish explanations for the otherwise inexplicable, a function they still perform for many people ('90 percent of Americans and most of human history', as you put it).\n \n So, given our need for consistent narrative and plausible explanations for otherwise troubling questions (like, what happens to my mind when I die?), can religion 'be done without'? Scientific answers to such questions are inevitably incomplete, tentative and (in the after-death question, for example) for many too bleak and comfortless; on the other hand, the teachings of traditional religions are increasingly found to be flawed and threadbare in the face of scientific advance. Perhaps the rise of fuzzy pick-and-mix New Age-isms is a consequence of this - and a portent that our drive for religiosity will not be shaken off in a hurry.\n\n In the mind of Creationists, those that believe that the earth is 10 to 12 thousand years old, the Bible is a typical book, one to be reviewed as such. It is not taken as the spiritual work of God, to be read \"in the spirit\". This is what sets the precedence for those like you, johnhanks, that believes Christians, or anyone else that believes in God, as having some sort of brain disorder.\n \n It is a cult of sorts - those that think others have some disorder due to their beliefs - that spawns hate and indifference.", 
   {
    "unicode_changes_made": true
   }, 
   154103, 
   null, 
   1123700040.0
  ], 
  [
   154132, 
   null, 
   "galton", 
   "on the other hand, the teachings of traditional religions are increasingly found to be flawed and threadbare in the face of scientific advance. Perhaps the rise of fuzzy pick-and-mix New Age-isms is a consequence of this - and a portent that our drive for religiosity will not be shaken off in a hurry.\n\n I'm not sure that as science advances and discredits more tradtional beliefs that it will make any difference. Our understanding oh human evolution has grown substantially in the last 30 years; the evangelical Christianity movement has exploded in the same period.", 
   {}, 
   154103, 
   null, 
   1123706880.0
  ], 
  [
   154180, 
   null, 
   "Raastee", 
   "About 90 percent of Americans and most of human history contradict the view that religion can be done without. Overall, it seems to me that human experience demonstrates that most people do need religion. Even in my circle (academics) you would think you would finally find people who have grown beyond religion. I have never seen more pious people in my life. In place of God, they have simply put Man the Abstract, and they are zealots at His feet, and they show all the signs of religious extremists. They seethe with hatred, not for the homosexual, but for the bigot. They get hate fever in their brains, not for the atheist, but for the corporation. If you dare whsiper that the bigots occasionally have a point, or that Big Business is often good, you will be excommunicated from the fold. So even our supposedly most enlightened are \"believers\" just like everybody else.\n\n \n All humans need is an objective. They dont need to be lied too and religion is just that, but if religion helps someone so much the better...let them be happy.", 
   {}, 
   154069, 
   null, 
   1123717560.0
  ], 
  [
   154187, 
   null, 
   "Master_Shake", 
   "I think the problem comes in trying to make rationale arguments for the existance of God. No one will ever prove without a doubt that God exists. No one will ever prove without a doubt that God doesn't exist. That is why the only rationally defensible position is to accept this. You can believe  what you want from there, but that is what we know.", 
   {}, 
   154180, 
   null, 
   1123718100.0
  ], 
  [
   154229, 
   null, 
   "galton", 
   "All humans need is an objective. They dont need to be lied too and religion is just that, but if religion helps someone so much the better...let them be happy.\n\n I must say that I have never encountered a belief system, religious or otherwise, that did not involve some wilful blindness. And I don't think most religions lie. Lying implies that its proponents are saying things they know not to be true. Generally, they are sincere about everything they say.", 
   {}, 
   154180, 
   null, 
   1123724040.0
  ], 
  [
   154298, 
   null, 
   "Orion", 
   "I must say that I have never encountered a belief system, religious or otherwise, that did not involve some wilful blindness. And I don't think most religions lie. Lying implies that its proponents are saying things they know not to be true. Generally, they are sincere about everything they say.\n\n \n My experience has been quite different. I have observed that (for example) Christian fundamentalists will often go to extremes to 1) defend the inerrancy of the Bible, and 2) save souls for Jesus. And, in general, they don't consider the methods to be very important - it's the results that count. We generally refer to it as \"Lying for Jesus\". Getting someone to accept Jesus is the primary goal. How one, as a Christian fundamentalist, arrives at that goal is mostly irrelevant.", 
   {}, 
   154229, 
   null, 
   1123738500.0
  ], 
  [
   154300, 
   null, 
   "galton", 
   "My experience has been quite different. I have observed that (for example) Christian fundamentalists will often go to extremes to 1) defend the inerrancy of the Bible, and 2) save souls for Jesus. And, in general, they don't consider the methods to be very important - it's the results that count. We generally refer to it as \"Lying for Jesus\". Getting someone to accept Jesus is the primary goal. How one, as a Christian fundamentalist, arrives at that goal is mostly irrelevant.\n\n You know, Christian-fundamentalist-as-whipping-boy is really getting old at this forum. I am an atheist and think these guys get a bad wrap. Is there ANY other religion that EVER does anything wrong?", 
   {}, 
   154298, 
   null, 
   1123739100.0
  ], 
  [
   154305, 
   null, 
   "Orion", 
   "You know, Christian-fundamentalist-as-whipping-boy is really getting old at this forum.\n\n \n Should we keep quiet? Is that what you suggest? \n \n \nI am an atheist and think these guys get a bad wrap.\n\n \n A single tear rolls down my cheek. That's \"rap\", BTW. \n \n \nIs there ANY other religion that EVER does anything wrong?\n\n \n Start a thread.", 
   {}, 
   154300, 
   null, 
   1123740540.0
  ], 
  [
   154308, 
   null, 
   "galton", 
   "A single tear rolls down my cheek. That's \"rap\", BTW. \nYour pedanticism is much appreciated, Teach. \n \n \n \n\n Start a thread.\n\n I did--you're in the middle of it.", 
   {}, 
   154305, 
   null, 
   1123741620.0
  ], 
  [
   154309, 
   null, 
   "trebor", 
   "You know, Christian-fundamentalist-as-whipping-boy is really getting old at this forum. I am an atheist and think these guys get a bad wrap. Is there ANY other religion that EVER does anything wrong?\n\n \n \n Yes.. but when it comes to the ones that are 'in your face' to try to tell you how a bad you are, and how you should believe what they do, they tend to show up in places like this. \n \n I am sure that if an Islamic fundamentalist showed up and tryed the same tactics, they would treated the same. Same with bahi's , the ultra-conservative jews, or any. That includes any religion that trys to control or abuse others, or trys to use their influence to 'lighten the pockets' of their followers for the benefit of the leaders.", 
   {}, 
   154300, 
   null, 
   1123742640.0
  ], 
  [
   154314, 
   null, 
   "galton", 
   "I am sure that if an Islamic fundamentalist showed up and tryed the same tactics, they would treated the same. Same with bahi's , the ultra-conservative jews, or any.\n\n I doubt that very much. There would be some feeling that these people deserved some patience and respect because they are seen as the sympathetic other, while hardline Christians are thought of like trailer trash--someone who can be abused without hesitation.", 
   {}, 
   154309, 
   null, 
   1123743900.0
  ], 
  [
   154315, 
   null, 
   "Orion", 
   "Your pedanticism is much appreciated, Teach.\n\n \n No problem. I take it as a personal obligation to educate Christian fundies, especially those who appear to have been home-schooled.", 
   {}, 
   154308, 
   null, 
   1123744200.0
  ], 
  [
   154317, 
   null, 
   "galton", 
   "No problem. I take it as a personal obligation to educate Christian fundies, especially those who appear to have been home-schooled.\n\n So this knocking fundamentalist Christians thing is like a habit for you, kind of like a facial tick?", 
   {}, 
   154315, 
   null, 
   1123746660.0
  ], 
  [
   154323, 
   null, 
   "johnhanks", 
   "This is what sets the precedence for those like you, johnhanks, that believes Christians, or anyone else that believes in God, as having some sort of brain disorder.\n \n It is a cult of sorts - those that think others have some disorder due to their beliefs - that spawns hate and indifference.\n\n \n Where did I say that I believe 'Christians, or anyone else that believes in God, as having some sort of brain disorder'? I believe nothing of the sort. This is a very damaging charge; when you have read my post again, I trust you will have the grace to withdraw it.", 
   {
    "unicode_changes_made": true
   }, 
   154109, 
   null, 
   1123753980.0
  ], 
  [
   154332, 
   null, 
   "Tastyfish", 
   "I doubt that very much. There would be some feeling that these people deserved some patience and respect because they are seen as the sympathetic other, while hardline Christians are thought of like trailer trash--someone who can be abused without hesitation.\n\n Its because of their situation, we don't have the same problems with other fundamentalists mainly because they are not as common where we live. Part of the threat from Islamic fundamentalism that people are most worried about (suicide bombings, jihad against the west etc) are partially the fault of Islamic fundamentalism but also you can't ignore that the society and history have gone a long way to creating the problem (few people would really care if there was just one fundamentalist or if they kept to themselves).\n \n Christian fundamentalism is disliked so intensely is because it seems to have far more power here than it should, whilst most people have no problem with condemning islamic fundamentalism for its treatment of women, harsh penalties and intolerance, for some reason the threat of Christian fundamentalism doesn'y appear to be taken as seriously.", 
   {}, 
   154314, 
   null, 
   1123760040.0
  ], 
  [
   154345, 
   null, 
   "Orion", 
   "So this knocking fundamentalist Christians thing is like a habit for you, kind of like a facial tick?\n\n \n Umm...No. Got any other questions, little fella?", 
   {}, 
   154317, 
   null, 
   1123766100.0
  ], 
  [
   154353, 
   null, 
   "trebor", 
   "I doubt that very much. There would be some feeling that these people deserved some patience and respect because they are seen as the sympathetic other, while hardline Christians are thought of like trailer trash--someone who can be abused without hesitation.\n\n \n \n You might doubt that very much... but, I have seen that happen in places other than here... although I will admit I have not seen ultra-conservative Jews on a forum... but I have seen the extremists from hindu's, and muslims.. and in each case, their actions triggered off the same response as the fundy christian.", 
   {}, 
   154314, 
   null, 
   1123769580.0
  ], 
  [
   154383, 
   null, 
   "Big Orn", 
   "Where did I say that I believe 'Christians, or anyone else that believes in God, as having some sort of brain disorder'? I believe nothing of the sort. This is a very damaging charge; when you have read my post again, I trust you will have the grace to withdraw it.\n\n So you don't agree with the Lewis Wolpert quote you posted? If not, why post it?\n If you disagree, I would think you would state that. \n I did not see your disagreement, otherwise I would not have replied in such a manner.\n You said:\n \nOn this view...\n\n And \n \nSo, given our need for consistent narrative and plausible explanations for otherwise troubling questions (like, what happens to my mind when I die?), can religion 'be done without'? Scientific answers to such questions are inevitably incomplete, tentative and (in the after-death question, for example) for many too bleak and comfortless; on the other hand, the teachings of traditional religions are increasingly found to be flawed and threadbare in the face of scientific advance. Perhaps the rise of fuzzy pick-and-mix New Age-isms is a consequence of this - and a portent that our drive for religiosity will not be shaken off in a hurry.\n\n Are you in agreement with it or not?", 
   {
    "unicode_changes_made": true
   }, 
   154103, 
   null, 
   1123785600.0
  ], 
  [
   154399, 
   null, 
   "galton", 
   "Its because of their situation, we don't have the same problems with other fundamentalists mainly because they are not as common where we live. Part of the threat from Islamic fundamentalism that people are most worried about (suicide bombings, jihad against the west etc) are partially the fault of Islamic fundamentalism but also you can't ignore that the society and history have gone a long way to creating the problem (few people would really care if there was just one fundamentalist or if they kept to themselves).\n \n Christian fundamentalism is disliked so intensely is because it seems to have far more power here than it should....\n The estimates put the number of fundamental Christians in the U.S. in the many tens of millions. They SHOULD have a lot of power--it's called a democracy.", 
   {}, 
   154332, 
   null, 
   1123791900.0
  ], 
  [
   154401, 
   null, 
   "trebor", 
   "So you don't agree with the Lewis Wolpert quote you posted? If not, why post it?\n If you disagree, I would think you would state that. \n I did not see your disagreement, otherwise I would not have replied in such a manner.\n You said:\n \n And \n \n Are you in agreement with it or not?\n\n \n The Lewis Wolpert quote does not address any specific religion at all, traditional religion, real religion, or anything. It only explains why many people get a set of belief systems that are not neccesarily based on reason. Does that hit too close to home for you? I know a few atheists whose belief systems would match that claim (just because you don't believe in god doesn't mean you have beliefs that are based on science and rationality). \n Some of the devotees of objectivism are anything but objective. \n \n \n I personally think the second quote has some very valid points. If traditional religions were being providing the emotional needs of people, they would not \n be turning to new-ageism. If it doesn't have at least some kernal of truth in it, why do you think so many people are going to the new age religions?", 
   {
    "unicode_changes_made": true
   }, 
   154383, 
   null, 
   1123791960.0
  ], 
  [
   154414, 
   null, 
   "Big Orn", 
   "The Lewis Wolpert quote does not address any specific religion at all, traditional religion, real religion, or anything. It only explains why many people get a set of belief systems that are not neccesarily based on reason. Does that hit too close to home for you? I know a few atheists whose belief systems would match that claim (just because you don't believe in god doesn't mean you have beliefs that are based on science and rationality). \n Some of the devotees of objectivism are anything but objective. \n \n \n I personally think the second quote has some very valid points. If traditional religions were being providing the emotional needs of people, they would not \n be turning to new-ageism. If it doesn't have at least some kernal of truth in it, why do you think so many people are going to the new age religions?\n\n johnhanks linked that report with religion. That's what I was referring to. Does he link this to his post as an agreement?\n \n New-age religion is a cop-out. What is trying to emerge is a system that can straddle the fence - have their cake and eat it too, so to speak.\n \n Weak and pink at the gills, it will not take long to knock it to its knees. I would hope that after it happens, some will still remain that have the wisdom to return to the scriptures for Truth...but it will be a hard row to hoe.", 
   {}, 
   154401, 
   null, 
   1123795260.0
  ], 
  [
   154418, 
   null, 
   "trebor", 
   "johnhanks linked that report with religion. That's what I was referring to. Does he link this to his post as an agreement?\n \n New-age religion is a cop-out. What is trying to emerge is a system that can straddle the fence - have their cake and eat it too, so to speak.\n \n Weak and pink at the gills, it will not take long to knock it to its knees. I would hope that after it happens, some will still remain that have the wisdom to return to the scriptures for Truth...but it will be a hard row to hoe.\n\n \n \n It doesn't matter if it is a cop out or not. People would not be attracted to it if the traditional relgions met their needs. You claim that the scriptures are 'Truth' (what ever that is), but that does not expalin the fact the new age religions are increasing at the expense of traditional Christianity.\n \n I am sure that the newagers think they have the 'Truth' too.", 
   {}, 
   154414, 
   null, 
   1123796400.0
  ], 
  [
   154432, 
   null, 
   "Easyrider", 
   "It doesn't matter if it is a cop out or not. People would not be attracted to it if the traditional relgions met their needs. You claim that the scriptures are 'Truth' (what ever that is), but that does not expalin the fact the new age religions are increasing at the expense of traditional Christianity.\n\n \n There's not much that's \"new\" about new age religions. It's just the same old recycled lies that have been going around for thousands of years. \n \n As for \"traditional religions\" not meeting new ager needs, I'm afraid traditional religions like Judaism and Christianity are not real interested in revising Biblical truths for the sake of satanic, carnal indulgences.", 
   {}, 
   154418, 
   null, 
   1123799820.0
  ], 
  [
   154445, 
   null, 
   "Big Orn", 
   "It doesn't matter if it is a cop out or not. People would not be attracted to it if the traditional relgions met their needs. You claim that the scriptures are 'Truth' (what ever that is), but that does not expalin the fact the new age religions are increasing at the expense of traditional Christianity.\n\n You're right, it doesn't matter to religionists, those who require some sort of feel-good, five-minute, emotional high. Looking at it from where I'm standing (which still doesn't matter) it's just another scripture that's coming to light...the falling away.\n \nI am sure that the newagers think they have the 'Truth' too.\n\n And they will believe the lie and one will be taken from the field, and the one on the housetop will come down, gather his goods and go worship the liar.\n \n Again, scripture coming to light.", 
   {}, 
   154418, 
   null, 
   1123801500.0
  ], 
  [
   154446, 
   null, 
   "trebor", 
   "There's not much that's \"new\" about new age religions. It's just the same old recycled lies that have been going around for thousands of years. \n \n As for \"traditional religions\" not meeting new ager needs, I'm afraid traditional religions like Judaism and Christianity are not real interested in revising Biblical truths for the sake of satanic, carnal indulgences.\n\n \n \n No, those religions are not. However, those people who went to the new age religions did so for a reason. It is obvious it is because they found the traditionsl Christian /Jewish/Muslim religions lacking. Calling it 'recycled old lies', and proclaiming what you believe to be 'TRUTH' does not stop people from leaving the traditional religions for the alternative religions. \n \n Neither you or Big Orn have responded to WHY you think people left. You just attacked the new agers.. and proclaimed or implied you have the 'TRUTH'.\n \n I will note the avoidance of the question in favor of a blind statement of faith.", 
   {}, 
   154432, 
   null, 
   1123801560.0
  ], 
  [
   154448, 
   null, 
   "trebor", 
   "You're right, it doesn't matter to religionists, those who require some sort of feel-good, five-minute, emotional high. Looking at it from where I'm standing (which still doesn't matter) it's just another scripture that's coming to light...the falling away.\n \n And they will believe the lie and one will be taken from the field, and the one on the housetop will come down, gather his goods and go worship the liar.\n \n Again, scripture coming to light.\n\n \n All that means is that it was happening when the various scriptures were written. After all, if you asked teh Jews in the first century, they will say that the Christians were the ones falling away.", 
   {}, 
   154445, 
   null, 
   1123801620.0
  ], 
  [
   154457, 
   null, 
   "Master_Shake", 
   "You claim that the scriptures are 'Truth' (what ever that is), but that does not expalin the fact the new age religions are increasing at the expense of traditional Christianity.\n\n \n If what you mean is that the number of new-agers is increasing while the number of christians is decreasing, you would be incorrect. For better or worse, there are more and more converting to christianity.", 
   {}, 
   154418, 
   null, 
   1123803120.0
  ], 
  [
   154458, 
   null, 
   "Big Orn", 
   "Neither you or Big Orn have responded to WHY you think people left.\n\n Did you not read the part about<b></b>:\n \n...feel-good, five-minute, emotional high.\n\n \n If you don't study and try the scriptures, see if God is what He says He is, see if He keeps His promises, etc., etc., then you will get just what everyone else that turns aside gets: a blank look, an empty heart, and a craving for something that you can put your hands on.", 
   {}, 
   154446, 
   null, 
   1123803180.0
  ], 
  [
   154460, 
   null, 
   "Big Orn", 
   "All that means is that it was happening when the various scriptures were written. After all, if you asked teh Jews in the first century, they will say that the Christians were the ones falling away.\n\n Can't argue with that, but I can't say that I've heard of a \"feel-good\" religion back then. Christians weren't in on it either...they were dropping like flies.", 
   {}, 
   154448, 
   null, 
   1123803480.0
  ], 
  [
   154466, 
   null, 
   "trebor", 
   "Can't argue with that, but I can't say that I've heard of a \"feel-good\" religion back then. Christians weren't in on it either...they were dropping like flies.\n\n \n It is your claim that the new agers are 'new age' because of 'feel good'. \n \n I say that they dropped away mainly because of disastifactoin with the religion they grew up in.\n \n Martin Luthor was disastisfied with the RCC, and dropped away to become protestant. That fits the scripture of 'falling away' too. \n \n That piece of scripture wasn't a prophecy, it was an observation of what happens, over and over and over again.", 
   {}, 
   154460, 
   null, 
   1123804380.0
  ], 
  [
   154470, 
   null, 
   "Big Orn", 
   "It is your claim that the new agers are 'new age' because of 'feel good'. \n \n I say that they dropped away mainly because of disastifactoin with the religion they grew up in.\n \n Martin Luthor was disastisfied with the RCC, and dropped away to become protestant. That fits the scripture of 'falling away' too. \n \n That piece of scripture wasn't a prophecy, it was an observation of what happens, over and over and over again.\n\n Trebor, you are preaching to the choir. I can't blame anyone for leaving a religion that closes the Bible for its own sake.\n \n What I am saying is that these new-agers are looking for something that's not there. It's not all happy-go-lucky. The Bible says there will be real hard times, but that the joy and strength of God will see us through - not the happiness and *****-footing around.\n \n And besides, you think you hate us now? Wait until this new-age breathes down your neck, telling you that you're headed to a place they can't even grasp.\n \n On edit - that 5 star word above is a female cat...", 
   {}, 
   154466, 
   null, 
   1123805280.0
  ], 
  [
   154473, 
   null, 
   "trebor", 
   "Trebor, you are preaching to the choir. I can't blame anyone for leaving a religion that closes the Bible for its own sake.\n \n What I am saying is that these new-agers are looking for something that's not there. It's not all happy-go-lucky. The Bible says there will be real hard times, but that the joy and strength of God will see us through - not the happiness and *****-footing around.\n \n And besides, you think you hate us now? Wait until this new-age breathes down your neck, telling you that you're headed to a place they can't even grasp.\n \n On edit - that 5 star word above is a female cat...\n\n \n Of course, that is not the thrust of the new-age religion.... The new agers say similar things about hard times,.. but don't use the bible as their source.\n \n As far as I can see, the only two religions that have been threatening hell , or anything similar to people of other religions is Chrisitanity and Islam. That concept of Hell is not in the Jewish dogma... although there has been some minor leakage in the cross cultureal exchange over the centuries. The after life is very vaguely defined.. on purpose I believe.\n \n \n I just love these 'promises' for the future based on nothing.", 
   {}, 
   154470, 
   null, 
   1123805640.0
  ], 
  [
   154509, 
   null, 
   "Tastyfish", 
   "The estimates put the number of fundamental Christians in the U.S. in the many tens of millions. They SHOULD have a lot of power--it's called a democracy.\n\n Isn't that why you are a republic though, rather than a true democracy, to prevent the tyranny of the majority over a minority.\n \n Did equal rights for woman and blacks go to a public vote? What about freeing slaves?", 
   {}, 
   154399, 
   null, 
   1123811400.0
  ], 
  [
   154519, 
   null, 
   "Easyrider", 
   "However, those people who went to the new age religions did so for a reason. It is obvious it is because they found the traditionsl Christian /Jewish/Muslim religions lacking. Calling it 'recycled old lies', and proclaiming what you believe to be 'TRUTH' does not stop people from leaving the traditional religions for the alternative religions. Neither you or Big Orn have responded to WHY you think people left.\n\n \n \"For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear.\" 2 Timothy 4:3", 
   {}, 
   154509, 
   null, 
   1123814400.0
  ], 
  [
   154522, 
   null, 
   "Orion", 
   "\"For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear.\" 2 Timothy 4:3\n\n \n Listen to what I say. For if you disagree, you're a liar. And I'll laugh as you roast while I sit on the ivory throne next to Jesus. So there! -- Bob 7:11", 
   {}, 
   154519, 
   null, 
   1123815180.0
  ], 
  [
   154534, 
   null, 
   "galton", 
   "Isn't that why you are a republic though, rather than a true democracy, to prevent the tyranny of the majority over a minority.\n \n\n Christian fundamentalist are not going to tyrannize you with their majority because they are not the majority. \n \n \n\n Did equal rights for woman and blacks go to a public vote? What about freeing slaves?\n\n Yeah, they did indirectly through the 19th Amendment and the Voting Rights Act passed by Congress, presumably a body which reflects the will of the majority.", 
   {}, 
   154509, 
   null, 
   1123819620.0
  ], 
  [
   154570, 
   null, 
   "johnhanks", 
   "So you don't agree with the Lewis Wolpert quote you posted? If not, why post it?\n If you disagree, I would think you would state that. \n I did not see your disagreement, otherwise I would not have replied in such a manner.\n\n \n [Sigh]. Ron, read the Wolpert quote again.\n \n \nFurther evidence that our brains are programmed with causal reasoning, the need to tell a consistent story, comes from mental illness, such as confabulation. Caused by damage of the frontal lobe of the brain, confabulation results in a distortion of memory. A hospital patient may claim that he is in fact at work and the people in the ward work for him. When the doctor points out that they are all in bed he replies that he likes to keep his employees comfortable. Such patients have lost the mental machinery that tests reality, but illustrate how our drive to make sense of the world is strong, even if we do end up believing in nonsense.\n\n \n Wolpert is using observations about a particular kind of mental illness to reinforce his thesis that causal reasoning - the drive to find consistent cause-and-effect explanations for our experiences - is hard-wired into our brains. His point is that even when a patient's ability to analyse experience is awry, the patient still spins a story to make sense of it.\n \n There is nothing here about religious believers suffering brain disorders. To accuse me of holding such a view is defamatory: once again, I trust you will now withdraw the slur.", 
   {
    "unicode_changes_made": true
   }, 
   154383, 
   null, 
   1123831980.0
  ], 
  [
   154611, 
   null, 
   "Tastyfish", 
   "Christian fundamentalist are not going to tyrannize you with their majority because they are not the majority.\n Well, actually they aren't because I don't live in the states, but suppose they are a much smaller minority here.\n \n \n\n Yeah, they did indirectly through the 19th Amendment and the Voting Rights Act passed by Congress, presumably a body which reflects the will of the majority.\n Was actually a question, I don't really know how it was actually done. Presumably there arn't numbers showing the difference between support in congress and support among the population?\n \n This is the point though, these major issues are not really put out to the people to decide but instead entrusted to people 'who know best' (admittedy by the people they represent). Even if it was the will of the majority surely these people should be able and willing to override that in the cases where it is discriminating against a minority based purely on religion or some other personal belief.", 
   {}, 
   154534, 
   null, 
   1123861680.0
  ], 
  [
   155090, 
   null, 
   "Big Orn", 
   "Wolpert is using observations about a particular kind of mental illness to reinforce his thesis that causal reasoning - the drive to find consistent cause-and-effect explanations for our experiences - is hard-wired into our brains. His point is that even when a patient's ability to analyse experience is awry, the patient still spins a story to make sense of it.\n \n There is nothing here about religious believers suffering brain disorders. To accuse me of holding such a view is defamatory: once again, I trust you will now withdraw the slur.\n\n Not from Wolpert. But, from you. \n \n Again, do you deny linking this with belief in God or not?\n \n Let's see:\n The subject started with:\n \nJust like a good salemen religion must convince you that you are missing something and need it...but we dont need it.\n\n Then was replied with (partially):\n \nAbout 90 percent of Americans and most of human history contradict the view that religion can be done without.\n\n To which you stated from Wolpert:\n \nFurther evidence that our brains are programmed with causal reasoning, the need to tell a consistent story, comes from mental illness, such as confabulation. Caused by damage of the frontal lobe of the brain, confabulation results in a distortion of memory. A hospital patient may claim that he is in fact at work and the people in the ward work for him. When the doctor points out that they are all in bed he replies that he likes to keep his employees comfortable. Such patients have lost the mental machinery that tests reality, but illustrate how our drive to make sense of the world is strong, even if we do end up believing in nonsense.\n\n Do I read \"mental illness\" in Wolpert's report? If so, my post will stand.", 
   {
    "unicode_changes_made": true
   }, 
   154570, 
   null, 
   1124132580.0
  ], 
  [
   155184, 
   null, 
   "Tastyfish", 
   "All we know of the brain comes from mental illness, or injury. In medicine you can only really see how stuff works when it doesn't. Infact it actually says that a tendancy toward religion comes pretty much as standard - but then if it is true and we are designed by God, this kind of makes sense", 
   {}, 
   155090, 
   null, 
   1124150520.0
  ], 
  [
   155186, 
   null, 
   "Big Orn", 
   "All we know of the brain comes from mental illness, or injury. In medicine you can only really see how stuff works when it doesn't. Infact it actually says that a tendancy toward religion comes pretty much as standard - but then if it is true and we are designed by God, this kind of makes sense\n\n Ironic, huh?\n \n I would not rule out that a belief system is as much a requirement for life as is air and water. It doesn't have to be religious...", 
   {}, 
   155184, 
   null, 
   1124151300.0
  ], 
  [
   155189, 
   null, 
   "Tastyfish", 
   "Well, some belief system but not really in the way we would think of it. Even then does a completely logical being care if nothing is known to be real, would probably just work on the most probable things anyway (especially if it knows quantum).\n \n Still its a fine line between beleif and curiosity - and withoutthe latter you arn't going to be doing anything interesting", 
   {}, 
   155186, 
   null, 
   1124151660.0
  ], 
  [
   155230, 
   null, 
   "maximus", 
   "Galton,\n I think belief in God is our most basic instinct. \n \n Anyway, the following youdebate thread has some attempts at answering your question though it may not be worthy of the debate hall of fame:\n \n http://www.4forums.com/political/showthread.php?t=1166&highlight=silent+poet \n \n What did you read of Chesterton? The Everlasting Man? What of Lewis? Mere Christianity?", 
   {}, 
   155189, 
   null, 
   1124173920.0
  ], 
  [
   155238, 
   null, 
   "maximus", 
   "If you can cultivate a hatred of homosexuals, you will find that biblical passages provide you with a refuge of justification for your anger, and fundamentalist Christian groups supportive of your views. From there it should be relatively easy to at least pretend to believe in God.\n\n Christianity does not cultivate a hatred of homosexuality.\n \n \"Convincing the world of the existence of sin is not the same as condemning it for sinning. (John 3:16-17)\" John Paul II in Crossing the Threshold of Hope", 
   {}, 
   150970, 
   null, 
   1124177400.0
  ], 
  [
   155245, 
   null, 
   "johnhanks", 
   "Not from Wolpert. But, from you. \n \n Again, do you deny linking this with belief in God or not?\n\n \n Oh, for heaven's sake. Read for understanding, Ron.\n \n \nDo I read \"mental illness\" in Wolpert's report?\n\n \n Yes. You read\n \n \nFurther evidence that our brains are programmed with causal reasoning, the need to tell a consistent story, comes from mental illness, such as confabulation.\n\n \n Take out the subordinate clause and you get\n \n \nFurther evidence that our brains are programmed with causal reasoning ... comes from mental illness.\n\n \n The whole thrust of my original post - which used the Wolpert quote as part of its evidence base - was that human brains have a strong inbuilt drive to seek causes for phenomena and link them in a consistent narrative. The reference to a form of mental illness in the Wolpert quote was part of the evidence for this, pointing out that even when individuals can't analyse reality they still try to explain it to themselves, giving support to the notion that seeking cause-and-effect explanations is indeed deeply hard-wired. None of the rest of the post referred to mental illness at all.\n \n All of this was in the context of whether or not humans would ever do without religion, my point being that the strong drive to seek causes - to believe in causes - made this unlikely. And I meant in normally functioning brains.", 
   {
    "unicode_changes_made": true
   }, 
   155090, 
   null, 
   1124185200.0
  ], 
  [
   155253, 
   null, 
   "trebor", 
   "Christianity does not cultivate a hatred of homosexuality.\n \n \"Convincing the world of the existence of sin is not the same as condemning it for sinning. (John 3:16-17)\" John Paul II in Crossing the Threshold of Hope\n\n \n Hum. Tell that the Fred Phillips... Or Easyrider for that matter.", 
   {}, 
   155238, 
   null, 
   1124195520.0
  ], 
  [
   155397, 
   null, 
   "Easyrider", 
   "Trebor, if I really hated gays, I wouldn't bother advising them to repent and receive Jesus Christ as their Savior for the remission of their sins.\n \n I'd just pat them on the back and egg them on and defend their sin like you do, so they will wind up in the Pit.", 
   {}, 
   155253, 
   null, 
   1124239920.0
  ], 
  [
   155402, 
   null, 
   "Easyrider", 
   "The Israelites Rebel against God and Kill their Own Prophets\n \n Nevertheless they (the Israelites) were disobedient, and rebelled against Thee, and cast Thy law behind their back, and slew Thy prophets that did forewarn them to turn them back unto Thee, and they wrought great provocations. Therefore Thou didst deliver them into the hand of their adversaries, who distressed them; and in the time of their trouble, when they cried unto Thee, Thou heardest from heaven; and according to Thy manifold mercies Thou gavest them saviours who might save them out of the hand of their adversaries. But after they had rest, they did evil again before Thee; therefore didst Thou leave them in the hand of their enemies, so that they had the dominion over them; yet when they returned, and cried unto Thee, many times didst Thou hear from heaven, and deliver them according to Thy mercies; and didst forewarn them, that Thou mightest bring them back unto Thy law; yet they dealt proudly, and hearkened not unto Thy commandments, but sinned against Thine ordinances, which if a man do, he shall live by them, and presented a stubborn shoulder, and hardened their neck, and would not hear. Yet many years didst Thou extend mercy unto them, and didst forewarn them by Thy spirit through Thy prophets; yet would they not give ear; therefore gavest Thou them into the hand of the peoples of the lands..... neither have our kings, our princes, our priests, nor our fathers, kept Thy law, nor hearkened unto Thy commandments and Thy testimonies, wherewith Thou didst testify against them. For they have not served Thee in their kingdom, and in Thy great goodness that Thou gavest them, and in the large and fat land which Thou gavest before them, neither turned they from their wicked works. \n \n Now why would they recognize and receive their own Messiah when they killed and persecuted their own prophets who foretold their Messiah?", 
   {}, 
   155397, 
   null, 
   1124241000.0
  ], 
  [
   155409, 
   null, 
   "Symbiote", 
   "Christianity does not cultivate a hatred of homosexuality.\n\n \n Exactly. A hatred of homosexuality cultivates Christianity. People become so-called Christians so they can justify their hatred of \"fags\", not start hating on homosexuals because Jesus told them to. I'm glad we're in agreement.", 
   {}, 
   155402, 
   null, 
   1124243700.0
  ], 
  [
   155429, 
   null, 
   "Orion", 
   "Trebor, if I really hated gays, I wouldn't bother advising them to repent and receive Jesus Christ as their Savior for the remission of their sins.\n \n\n \n I don't think you hate gays, EZ. Rather, I think you despise them. Your previous posts on the subject betray your position (\"fudge packing\", etc.). People such as yourself always seem to need some group to denigrate, to look down upon, some group to whom you can feel superior. This is almost certainly why the mere mention of \"Gay Jesus\" infuriates you.", 
   {}, 
   155397, 
   null, 
   1124248800.0
  ], 
  [
   155441, 
   null, 
   "Easyrider", 
   "Your previous posts on the subject betray your position (\"fudge packing\", etc.). \n\n \n Why don't you show me ANY post where I said ANYTHING LIKE THAT, you pathetic liar?", 
   {}, 
   155429, 
   null, 
   1124251920.0
  ], 
  [
   155482, 
   null, 
   "unkerpaulie", 
   "I don't think you hate gays, EZ. Rather, I think you despise them. Your previous posts on the subject betray your position (\"fudge packing\", etc.). People such as yourself always seem to need some group to denigrate, to look down upon, some group to whom you can feel superior. This is almost certainly why the mere mention of \"Gay Jesus\" infuriates you.\n\n this isnt right either. there is no direct relationship between christianity and hatred for homosexuals. the one thing that can be said is that all bible-based religions oppose homosexuality. obviously, christianity is a bible based religion. but opposing homosexuality is different from hating homosexuals. even though most people will never allow themselves to see that there is a difference, the difference exists nevertheless.", 
   {}, 
   155429, 
   null, 
   1124291340.0
  ], 
  [
   155487, 
   null, 
   "Orion", 
   "this isnt right either. there is no direct relationship between christianity and hatred for homosexuals. the one thing that can be said is that all bible-based religions oppose homosexuality. obviously, christianity is a bible based religion. but opposing homosexuality is different from hating homosexuals. even though most people will never allow themselves to see that there is a difference, the difference exists nevertheless.\n\n \n What isn't \"right\"? Did I accuse Christians of hatred toward gays? Please read again what I posted...\n \n \nI don't think you hate gays, EZ. Rather, I think you despise them. Your previous posts on the subject betray your position (\"fudge packing\", etc.). People such as yourself always seem to need some group to denigrate, to look down upon, some group to whom you can feel superior. This is almost certainly why the mere mention of \"Gay Jesus\" infuriates you.\n\n \n And that's being kind and gentle. Or, did you forget, \"God hates fags\"?", 
   {}, 
   155482, 
   null, 
   1124292720.0
  ], 
  [
   155558, 
   null, 
   "Easyrider", 
   "Orion, the only one around here talking about \"fudge-packing\" and \"god hates fags\" is you.\n \n Grow up.", 
   {}, 
   155487, 
   null, 
   1124318280.0
  ], 
  [
   155565, 
   null, 
   "trebor", 
   "Orion, the only one around here talking about \"fudge-packing\" and \"god hates fags\" is you.\n \n Grow up.\n\n \n \n Are you that unaware of yourself, or are you just pulling legs?", 
   {}, 
   155558, 
   null, 
   1124321220.0
  ], 
  [
   155567, 
   null, 
   "Big Orn", 
   "I think most Christians, including preachers, are afraid to say anything about what the Bible says regarding homosexuality due to political and social pressures.\n \n I agree with what unkerpaulie said - there is a difference.\n \n God hates homosexuality, not His creation.", 
   {}, 
   155565, 
   null, 
   1124322840.0
  ], 
  [
   155570, 
   null, 
   "trebor", 
   "I think most Christians, including preachers, are afraid to say anything about what the Bible says regarding homosexuality due to political and social pressures.\n \n I agree with what unkerpaulie said - there is a difference.\n \n God hates homosexuality, not His creation.\n\n \n Since it appears that homosexuality is not a choice, but part of biology, why would god make someone homosexual then? After all, we can point throughout species in the animal kingdom, and show the same behaviors.", 
   {}, 
   155567, 
   null, 
   1124323680.0
  ], 
  [
   155573, 
   null, 
   "Big Orn", 
   "Since it appears that homosexuality is not a choice, but part of biology, why would god make someone homosexual then? After all, we can point throughout species in the animal kingdom, and show the same behaviors.\n\n We had this discussion the other day in another forum, but I can't remember which one.\n \n Anywho - Jesus stated that there are some things He tells us that have to be understood while He is present - meaning the Holy Spirit - and, paraphrasing, this is what He said:\n \n Some people are born without their gender specific characters, some are made that way by other people and some choose to be that way for the Kingdom's sake. \n \n After saying this He repeated that if you are able to understand this, then it is yours to accept.\n \n Who has the answers? I certainly don't. Does science, religion, etc.? I suppose not for if they did there would be a constant outpour for that finding. We are all created one way or the other, our physical beings are only temporary, but our spirits and souls live on - some to death forever, some to life forever. I believe that it's our choice which one to pursue. If we find that we want to believe in God - then by all means follow that path...all of it. If not, don't worry about what others have to say. Who is God to someone who doesn't believe in Him?", 
   {}, 
   155570, 
   null, 
   1124324220.0
  ], 
  [
   155579, 
   null, 
   "trebor", 
   "We had this discussion the other day in another forum, but I can't remember which one.\n \n Anywho - Jesus stated that there are some things He tells us that have to be understood while He is present - meaning the Holy Spirit - and, paraphrasing, this is what He said:\n \n Some people are born without their gender specific characters, some are made that way by other people and some choose to be that way for the Kingdom's sake. \n \n After saying this He repeated that if you are able to understand this, then it is yours to accept.\n \n Who has the answers? I certainly don't. Does science, religion, etc.? I suppose not for if they did there would be a constant outpour for that finding. We are all created one way or the other, our physical beings are only temporary, but our spirits and souls live on - some to death forever, some to life forever. I believe that it's our choice which one to pursue. If we find that we want to believe in God - then by all means follow that path...all of it. If not, don't worry about what others have to say. Who is God to someone who doesn't believe in Him?\n\n \n \n He did? Where is hte chapter and verse that it is claims he said that?\n \n Where did he specifically mention someones sexual preferences at all?", 
   {}, 
   155573, 
   null, 
   1124326260.0
  ], 
  [
   155596, 
   null, 
   "Easyrider", 
   "Since it appears that homosexuality is not a choice, but part of biology, why would god make someone homosexual then?\n\n \n Dropping trou for gay or illicit heterosexual sex is a BEHAVIORAL CHOICE. You either control your own zipper or you don't.\n \n If it isn't then warn the people in malls and elsewhere, because it might break out anytime.", 
   {}, 
   155579, 
   null, 
   1124336640.0
  ], 
  [
   155598, 
   null, 
   "Symbiote", 
   "So you're saying its only a sin to have sex with another man - its ok for instance to get an erection thinking about one or kiss one? Or get an erection while kissing one?", 
   {}, 
   155596, 
   null, 
   1124336820.0
  ], 
  [
   155599, 
   null, 
   "Easyrider", 
   "So you're saying its only a sin to have sex with another man - its ok for instance to get an erection thinking about one or kiss one? Or get an erection while kissing one?\n\n \n I'm convinced it's a sin to even lust after another man too, based on (1) gay sex being a sin in the Bible; (2) Jesus saying, in the Sermon on the Mount, that it's a sin to even lust in your heart after a married woman; (3) Romans 1:26-27.", 
   {}, 
   155598, 
   null, 
   1124337000.0
  ], 
  [
   155600, 
   null, 
   "Symbiote", 
   "How do you reconcile this with your previous claim that sinful homosexual behaviour is a choice?", 
   {}, 
   155599, 
   null, 
   1124337120.0
  ], 
  [
   155601, 
   null, 
   "Easyrider", 
   "How do you reconcile this with your previous claim that sinful homosexual behaviour is a choice?\n\n \n There's nothing to reconcile. Dropping trou for gay sex is a sin / choice (one can CHOOSE to be celibate), and lusting in one's heart after immoral sex is a sin. What you're doing is willfully letting temptation incubate until it becomes a lust.", 
   {}, 
   155600, 
   null, 
   1124337480.0
  ], 
  [
   155602, 
   null, 
   "Symbiote", 
   "1) What is a \"trou\"?\n \n 2) Are you saying that \"lusting in your heart\" is a choice? Or is it a sin of homosexuality that there is not choice with regards to?", 
   {}, 
   155601, 
   null, 
   1124337600.0
  ], 
  [
   155603, 
   null, 
   "Easyrider", 
   "trou is trousers, as in dropping one's pants for sex.\n \n And yes, lusting in one's heart is a choice. It takes time to get to the lust part. You have to focus and feed it willfully. You CHOOSE to do it.", 
   {}, 
   155602, 
   null, 
   1124338020.0
  ], 
  [
   155604, 
   null, 
   "Easyrider", 
   "James 1:14 - \"...but each one is tempted when, by his own evil desire, he is dragged away and enticed. 15 Then, after desire has conceived, it gives birth to sin; and sin, when it is full-grown, gives birth to death.\"\n \n There's the general progression.", 
   {}, 
   155603, 
   null, 
   1124338320.0
  ], 
  [
   155605, 
   null, 
   "Symbiote", 
   "Suppose I resist with all my heart the temptation of homosexuality, and pray to Jesus every day to help me not lust after men, but then I go to sleep and have a dream about gay sex, will I go to hell?\n \n And I gather we've confirmed erection alone doesn't qualify as sinful, the lust has to be in your heart, not just your pants, is that correct?", 
   {}, 
   155604, 
   null, 
   1124338860.0
  ], 
  [
   155607, 
   null, 
   "Orion", 
   " If we find that we want to believe in God - then by all means follow that path...all of it. If not, don't worry about what others have to say. Who is God to someone who doesn't believe in Him?\n\n \n Were it as simple as that, I might agree with you. However, one begins to worry about what others have to say when 1) they believe that they are speaking on behalf of the Judeo-Christian god, and 2) they attempt to enact laws which embody concepts taken from the Judeo-Christian Bible. Often, such laws, when enacted, have the effect of infringing on the otherwise legitimate rights of those who happen not to believe in either the Judeo-Christian god or that the KJV fell from the sky. \n \n We should remember that this very same Bible condones human slavery and relegates women to a notch or two above personal property. This suggests to me that those who are attempting to enact into law biblical concepts are being quite selective in terms of which of those concepts to take seriously. For example...\n \n 1tim 2:12 But I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence.\n \n Should we therefore prohibit women from serving as police officers, judges, legislators, workplace supervisors?\n \n IOW, I don't worry about the guy who stands on a street corner proclaiming that \"the end is near!\". But I do worry about the guy who gets elected to office with the intent to return America to its so-called Judeo-Christian roots.", 
   {}, 
   155573, 
   null, 
   1124339820.0
  ], 
  [
   155613, 
   null, 
   "Orion", 
   "I think most Christians, including preachers, are afraid to say anything about what the Bible says regarding homosexuality due to political and social pressures.\n\n \n I'll take that a step further and suggest that a considerable number of priests/ministers appear reluctant to tell their congregations as to what they actually learned in bible college. The idea seems to be \"why rock the boat?\". Case in point: the Bible alludes to the \"law\" or the \"books\" of Moses, suggesting that Moses authored the Torah. However, evidence contained with the Torah, itself, points inescapably to multiple authorship of that text. \n \n \nGod hates homosexuality, not His creation.\n\n \n This is exactly the type of bumper sticker mentality which I find to be so abhorrent. It fits in nicely with something like \"What do we need books for, anyway? Everything we need to know is already in the Bible!\".", 
   {}, 
   155567, 
   null, 
   1124344080.0
  ], 
  [
   155625, 
   null, 
   "trebor", 
   "Dropping trou for gay or illicit heterosexual sex is a BEHAVIORAL CHOICE. You either control your own zipper or you don't.\n \n If it isn't then warn the people in malls and elsewhere, because it might break out anytime.\n\n \n So, you are being totally celebrate yourself, I hope.", 
   {}, 
   155596, 
   null, 
   1124374560.0
  ], 
  [
   155627, 
   null, 
   "Big Orn", 
   "He did? Where is hte chapter and verse that it is claims he said that?\n \n Where did he specifically mention someones sexual preferences at all?\n\n I paraphrased Matthew 19:11 & 12 and maybe I should have said, \"...gender specific characterisitcs instead of ...gender specific characters.\n \n The word \"eunuch\" has many meanings and can be misconstrued to mean many other things, but what He was referring to was the joining of man and woman - or, if you can accept what he was saying - the spiritual union of man and God.", 
   {}, 
   155579, 
   null, 
   1124375880.0
  ], 
  [
   155637, 
   null, 
   "Big Orn", 
   "Were it as simple as that, I might agree with you. However, one begins to worry about what others have to say when 1) they believe that they are speaking on behalf of the Judeo-Christian god, and 2) they attempt to enact laws which embody concepts taken from the Judeo-Christian Bible. Often, such laws, when enacted, have the effect of infringing on the otherwise legitimate rights of those who happen not to believe in either the Judeo-Christian god or that the KJV fell from the sky.\n\n Belief in God is illogical, so is faith in Him. That's why our forefathers had our freedoms and rights placed under certain conditions - one being that the Church (not God) would not rule us. A person that proclaims he is speaking for God other than those things that will lead us to Him is only speaking from himself. Laws for the good of man are made by man and should reflect equally among men. Laws of God are those that direct our paths to Him. That's where religion breaks away from God and where all the trouble originated to begin with. No one can force a person to love God by enacting laws to that effect.\n \nWe should remember that this very same Bible condones human slavery and relegates women to a notch or two above personal property. This suggests to me that those who are attempting to enact into law biblical concepts are being quite selective in terms of which of those concepts to take seriously. For example...\n \n 1tim 2:12 But I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence.\n \n Should we therefore prohibit women from serving as police officers, judges, legislators, workplace supervisors?\n\n You have to look into Paul's life at the time and the urgency with which he preached. It was evident to him that in order to display God's initial arrangement in his teachings that he had to encourage the new church to seek God spiritually. So, when he could, he inserted, or tried to insert (which was not always acceptable) the spiritual things of God - especially the relationship of Christ to the church. The church is to be the bride of Christ and should not teach anything other than the Gospel. In other words he was alluding to the church (women) not to have authority over the man (Christ).\n \n I can only imagine Paul's frustration when this was taken literally on all points, watching as men stood and \"pounded their chests\" while looking down on women. And it's still taken literally today in some religions, which seem to have forgotten about the Samarian woman at the well, (John 4: 28 thru 30) who was one of the first to spread the news of Christ. \n \nIOW, I don't worry about the guy who stands on a street corner proclaiming that \"the end is near!\". But I do worry about the guy who gets elected to office with the intent to return America to its so-called Judeo-Christian roots.\n\n You cannot have a free nation under religion - it's been proven too many times before. And, which division of Judeo-Christianity would be the victor? I would say that civil war would be nipping at that administration's heels.\n \nI'll take that a step further and suggest that a considerable number of priests/ministers appear reluctant to tell their congregations as to what they actually learned in bible college. The idea seems to be \"why rock the boat?\". Case in point: the Bible alludes to the \"law\" or the \"books\" of Moses, suggesting that Moses authored the Torah. However, evidence contained with the Torah, itself, points inescapably to multiple authorship of that text.\n\n I have never dwelled too long on the authorship aspects, even though I have been asked by several friends to do so, because that particular attribute has never bothered me. It's the words and how they are conveyed through the Holy Spirit that matters most of all.\n I have seen grounds for debate on the subject - from both sides - but have never been interested in participating.\n \nThis is exactly the type of bumper sticker mentality which I find to be so abhorrent. It fits in nicely with something like \"What do we need books for, anyway? Everything we need to know is already in the Bible!\".\n\n But, why is it in the Bible? What harm is there in same-sex relationships? God had his reasons to setup this generation, as He deemed necessary, for it to fit into His plan of salvation. It is the God of the Holy Bible and no other that set this plan into motion in order to build His Kingdom by a particular set of rules. If we see this plan as faulty we have the power to disagree and live otherwise. However, it is not the duty of those who choose the live by those rules to judge those who exercise that free will to the contrary.\n Also, the Bible, as a mere book, is just that = a bunch of pages. Those who use those pages as ammunition will pay for it, one way or the other...they have their reward. They just as well use any other book if they use the Bible to push some agenda. Pouring out scripture for anything other than for reference will never bring about salvation...nor will it bring peace.", 
   {
    "unicode_changes_made": true
   }, 
   155627, 
   null, 
   1124380140.0
  ], 
  [
   155694, 
   null, 
   "Easyrider", 
   "Orion's Follies\n \n \nI'll take that a step further and suggest that a considerable number of priests/ministers appear reluctant to tell their congregations as to what they actually learned in bible college. The idea seems to be \"why rock the boat?\". Case in point: the Bible alludes to the \"law\" or the \"books\" of Moses, suggesting that Moses authored the Torah. However, evidence contained with the Torah, itself, points inescapably to multiple authorship of that text.\n\n \n Gutting the Documentary Hypothesis  \n \n http://www.geocities.com/k9ocu/DH.htm \n \n \"To sum up, it is very doubtful whether the Wellhausen hypothesis is entitled to the status of scientific respectability. There is so much of special pleading, circular reasoning, questionable deductions from unsubstantiated premises, that it is absolutely certain that its methodology would never stand up in a court of law. Scarcely any of the laws of evidence respected in legal proceedings are honored by the architects of this documentary theory. Any attorney who attempted to interpret a will or statute or deed of conveyance in the bizarre and irresponsible fashion of the source critics of the Pentateuch would find his case thrown out of court without delay [Archer, pages 108-109..].\" \n \n a priori anti-supernatural bias alleged  \n \n \"The documentary theory has been characterized by a subtle species of circular reasoning; it tends to posit its conclusion (the Bible is no supernatural revelation) as its underlying premise (there can be no such thing as supernatural revelation) [Archer, page 105].\" \n \n a priori anti-supernatural bias admitted  \n \n \"The German scholar Frank (Geshichte und Kritik der Neuren Theologie, p. 289) gives this exact summary of the presuppositions maintained by the documentary hypothesis: 'The representation of a course of history is a priori to be regarded as untrue and unhistorical if supernatural factors interpose in it  [New Evidence, page 355].\" \n \n Lack of Historical and Archaeological Evidence  \n \n \"Bruce K. Waltke, Ph.D., Harvard University and Fellow of the Hebrew University in Jerusalem, states firmly: 'Though one who has read only the popular literature advancing the conclusions of the literary analytical approach might not realize it, even the most ardent advocate of the theory must admit that we have as yet not a single scrap of tangible, external evidence for either the existence or the history of the sources J, E, D, P. [W. F. Albright, The Archeology of Palestine, revised, Baltimore: Penguin Books, 1960, pages 2, quoted by New Evidence, page 528, underlining added].'\" \n \n And there's tons more where all that came from.\n \n p.s. Orion - when you decide to come out of the closet and tell us who your so-called \"god\" is (you know, the one who approves of gay sex, fornication, Wiccanism, and the worship of Satan), and where it lives, etc., you will start to gain credibility around here for being knowledgeable and fair minded. It's not enough to constantly bark like a junkyard dog at other people's religions - if you want to run with the big dogs you have to be able to document your own beliefs. Which you are unable to do.", 
   {}, 
   155637, 
   null, 
   1124405580.0
  ], 
  [
   155760, 
   null, 
   "Orion", 
   "Orion's Follies\n \n Gutting the Documentary Hypothesis \n\n \n That was a mighty fine cut&paste, EZ. Mighty fine. I'll repeat my suggestion to you - learn to discuss. Cutting&pasting is a cheap and lazy substitute for discussion. Bone up on the subject of the Documentary Hypothesis, and I'd be happy to discuss it with you. \n \n Doubts about single authorship of the Torah go at least as far back as Baruch Spinoza (1632 &#8211; 1677). In the late nineteenth century, a group of German bible scholars led by Julius Wellhausen developed what we now refer to as the Documentary Hypothesis of the Torah. It remains in force today. \n \n I suggest you get a copy of Who Wrote The Bible?, Richard E. Friedman, Harper San Francisco Pub. (Amazon carries it). The author discusses the subject of Torah authorship in considerable detail. His basis, of course, is the DH. \n \n There is no need to fear scholarship, EZ.", 
   {
    "post_info": {
     "post_title": "EZ's Flatulence"
    }
   }, 
   155694, 
   null, 
   1124428800.0
  ], 
  [
   155761, 
   null, 
   "trebor", 
   "\n \n There is no need to fear scholarship, EZ.\n\n \n For EZ, there appears to be. When your faith is based on ignorance...", 
   {}, 
   155760, 
   null, 
   1124428860.0
  ], 
  [
   155765, 
   null, 
   "Orion", 
   "Belief in God is illogical, so is faith in Him. That&#8217;s why our forefathers had our freedoms and rights placed under certain conditions &#8211; one being that the Church (not God) would not rule us. A person that proclaims he is speaking for God other than those things that will lead us to Him is only speaking from himself. Laws for the good of man are made by man and should reflect equally among men. Laws of God are those that direct our paths to Him. That&#8217;s where religion breaks away from God and where all the trouble originated to begin with. No one can force a person to love God by enacting laws to that effect.\n \n You have to look into Paul&#8217;s life at the time and the urgency with which he preached. It was evident to him that in order to display God&#8217;s initial arrangement in his teachings that he had to encourage the new church to seek God spiritually. So, when he could, he inserted, or tried to insert (which was not always acceptable) the spiritual things of God &#8211; especially the relationship of Christ to the church. The church is to be the bride of Christ and should not teach anything other than the Gospel. In other words he was alluding to the church (women) not to have authority over the man (Christ).\n \n I can only imagine Paul&#8217;s frustration when this was taken literally on all points, watching as men stood and &#8220;pounded their chests&#8221; while looking down on women. And it&#8217;s still taken literally today in some religions, which seem to have forgotten about the Samarian woman at the well, (John 4: 28 thru 30) who was one of the first to spread the news of Christ. \n \n You cannot have a free nation under religion &#8211; it&#8217;s been proven too many times before. And, which division of Judeo-Christianity would be the victor? I would say that civil war would be nipping at that administration&#8217;s heels.\n \n I have never dwelled too long on the authorship aspects, even though I have been asked by several friends to do so, because that particular attribute has never bothered me. It&#8217;s the words and how they are conveyed through the Holy Spirit that matters most of all.\n I have seen grounds for debate on the subject &#8211; from both sides &#8211; but have never been interested in participating.\n \n But, why is it in the Bible? What harm is there in same-sex relationships? God had his reasons to setup this generation, as He deemed necessary, for it to fit into His plan of salvation. It is the God of the Holy Bible and no other that set this plan into motion in order to build His Kingdom by a particular set of rules. If we see this plan as faulty we have the power to disagree and live otherwise. However, it is not the duty of those who choose the live by those rules to judge those who exercise that free will to the contrary.\n Also, the Bible, as a mere book, is just that = a bunch of pages. Those who use those pages as ammunition will pay for it, one way or the other&#8230;they have their reward. They just as well use any other book if they use the Bible to push some agenda. Pouring out scripture for anything other than for reference will never bring about salvation&#8230;nor will it bring peace.\n\n \n Thank you for your response. We appear to disagree on a number of points, but I nevertheless enjoy the discussion.", 
   {}, 
   155637, 
   null, 
   1124435100.0
  ], 
  [
   159837, 
   null, 
   "neveragain", 
   "Galton,\n I can relate to your search for God and purpose. I am going through a similar search currently.\n I am still processing what I've read, but a well-written argument for the existence of God that I recently read was an assignment for my philosophy class. It is called \"The Kalam Cosmological Argument and the Anthropic Principle\" by William Lane Craig, Ph.D. in philosophy from the University of Birmingham (England) and a Th.D. from the University of Munich.\n \n His basic argument goes like this:\n \n 1. Whatever begins to exist has a cause.\n 2. The universe began to exist.\n 3. Therefore, the universe has a cause.\n \n It sounds like you've read this kind of argument before, but you may get something new from Craig's argument, and he makes an excellent argument for the impossibility of forming an actually infinite collection of things.\n Hope this helps your search.", 
   {}, 
   155765, 
   null, 
   1125957420.0
  ], 
  [
   159840, 
   null, 
   "trebor", 
   "Galton,\n I can relate to your search for God and purpose. I am going through a similar search currently.\n I am still processing what I've read, but a well-written argument for the existence of God that I recently read was an assignment for my philosophy class. It is called \"The Kalam Cosmological Argument and the Anthropic Principle\" by William Lane Craig, Ph.D. in philosophy from the University of Birmingham (England) and a Th.D. from the University of Munich.\n \n His basic argument goes like this:\n \n 1. Whatever begins to exist has a cause.\n 2. The universe began to exist.\n 3. Therefore, the universe has a cause.\n \n It sounds like you've read this kind of argument before, but you may get something new from Craig's argument, and he makes an excellent argument for the impossibility of forming an actually infinite collection of things.\n Hope this helps your search.\n\n \n \n There is one problem with that. We do have empirical evidence of non-causual events in quantum mechanics. \n \n Therefore, the premise (1) has empirical evidence to be wrong.", 
   {}, 
   159837, 
   null, 
   1125957840.0
  ], 
  [
   353990, 
   null, 
   "Chuz Life", 
   "When I was a child, I believed without the least doubt that there was a God. In my 20s I became convinced by atheistic arguments and have been a non-believer ever since. Disbelief, however, has caused in me a pervading sense of the pointlessness of life, so I would like very much to believe in God. What are the best arguments you know of in favor of the existence of a Supreme Being?\n\n \n Unfortunately, I can't posit an argument in favor of the existence of anything along the lines of a \"God\" or gods. I wish I could because that would be quite an accomplishment. I do linke challenges such as your question requires,... so I'll give my own 2 cents worth of observations.\n \n First of all, let me say that I am very much like you in my current \"practice\" of my faith. I was also raised to believe and then drifted away. Though I don't share your general sense of pointlessness. \n \n The next thing I'm willing to share is that I do believe that there is a lot of value in a religious belief system even in the absense of \"proof\" of \"God.\"\n \n Example, my mother died when I was only 18 months old. My little brother was only 9 DAYS old,... \"If there is no God, there is likely no after-life\" and no chance of ever knowing or seeing my Mom again\" Heaven to me is not a place with streets of Gold, 72 virgins or anything like that. My heaven would be a place where I could be with my loved ones without any pain or sorrow or time constraints, playing and listening to music and such as that.\n \n For all I know, I'm SOL and I really don't care if I am anymore. (I've seen about all I care to see of this world)\n \n As far as evidence of the \"existence\" of God, I have only one thing more to offer.\n \n There are things in our universe (Black Holes for example) that scientists have pretty much confirmed as \"existing\" even though they can't be visually verified or proven by any means other than by the observation of the \"affects\" the object is having on the planets moons and stars surrounding it.\n \n I think (PERSONALLY) the existence of \"God\" can be established in much the same way. \n \n Again, this is just my own opinion,.. I'm not much interested in debating it.\n \n Good luck in your quest.", 
   {
    "post_info": {
     "post_title": "A very personal question,..."
    }
   }, 
   150962, 
   null, 
   1242448740.0
  ], 
  [
   354043, 
   null, 
   "Anthony321", 
   "Easyrider\n Ah, but Christ is Risen! And there's nothing irrational about it (unless one posits an irrational, anti-supernatural bias).[/QUOTE]\n \n \n \n Anthony321\n There is nothing irrational about believing in a resurrection? You have to establish the existence of a supernatural before you can have anything that would qualify as anti-supernatural. Until you do anti-dillusional would be a much better term to work with.", 
   {}, 
   150988, 
   null, 
   1242503400.0
  ], 
  [
   354048, 
   null, 
   "Jo Bennett", 
   "Easyrider appears to be using irrational as a synonym for wrong, which is simply not the case.\n \n The resurrection is irrational. God's actions defy our reason, as do his powers. Just because Christian doctrine is not rational does not mean it is untrue. Our powers of reason break down when faced with God, just as general relativity breaks down when faced with quantum theory. Our powers of reason are of this world, bound by the normal parameters of our existence. God is above and beyond this world, and so his being is beyond our rationality.", 
   {}, 
   354043, 
   null, 
   1242504720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What are the best arguments in favor of the existence of God?", 
  "url": "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 6067, 
  "discussion_files": [
   [
    "2408.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-print.html"
   ], 
   [
    "2409.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-12-print.html"
   ], 
   [
    "2410.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-10-print.html"
   ], 
   [
    "2411.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-8-print.html"
   ], 
   [
    "2412.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-6-print.html"
   ], 
   [
    "2413.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-4-print.html"
   ], 
   [
    "2414.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-5-print.html"
   ], 
   [
    "2415.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-7-print.html"
   ], 
   [
    "2416.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-9-print.html"
   ], 
   [
    "2417.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-11-print.html"
   ], 
   [
    "2418.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-3-print.html"
   ], 
   [
    "2419.html", 
    "http://www.4forums.com/political/religion-debates/6067-what-best-arguments-favor-existence-god-2-print.html"
   ]
  ], 
  "identifier": 6067
 }
]