[
 [
  [
   150980, 
   null, 
   "snakespit", 
   "In another debate, someone recently stated that a dog is not a sentient being. Just wondered what everyone thinks about this.", 
   {
    "post_info": {
     "post_title": "Sentient Being?"
    }
   }, 
   null, 
   null, 
   1122435300.0
  ], 
  [
   151008, 
   null, 
   "Heads_On_Pikes", 
   "My 12 year old Lab most definitely has feelings, I know him quite well.\n \n I have a outdoor cat that sprints the length of the driveway to greet me when I come home from work each day.\n \n I've read through the thread you referred to and agree with your position. Anyone who advocates or turns a blind eye to a human raping an animal is just as sick in the head as the idiot committing the disgusting act. But, what does one expect, liberals and the ACLU will defend NAMBLA.", 
   {}, 
   150980, 
   null, 
   1122439680.0
  ], 
  [
   151020, 
   null, 
   "WhiteFalcon", 
   "Your darn right a dog(or any other animal) is a \"sentient being\".", 
   {}, 
   151008, 
   null, 
   1122447300.0
  ], 
  [
   151027, 
   null, 
   "gamehuis", 
   "I don't know if all dogs are sentient beings, but mine sure was. He was happy, sad, jealous and even displayed self-pity when he broke his toe and tried to milk the situation for all its worth.", 
   {}, 
   151020, 
   null, 
   1122453240.0
  ], 
  [
   151051, 
   null, 
   "Iuris", 
   "By the definition I am aware of, yes, dogs are sentient. They are self aware (almost every animal is) and perceive the environment.\n \n Whether they are sapient is a different matter. Intellectual capabilities develop gradually and along multiple paralell lines.\n \n For the purposes of this thread, however, I would point out that humanity has only ever cared about itself. How we treat dogs is determined not by the dogs' sentience but by what the dogs can do for humanity and what humanity can do to them and still get away with.\n \n Personally, I'm all for ethical treatment of animals, minimizing suffering, as it promotes general human empathy for other humans which we seem to lack lately. Still, new medicines, safe products and similar are worth a certain amount of suffering. I just hope the people doing these things do them with a tear in their eye.\n \n For the specific point of dog consent and rape, I don't think it is (much of) a problem. Apparently, dogs don't have all the emotional baggage related to sexuality that our society implants in humans, so it is apparently not a question of forcing them, but rather of teaching them. Especially since kept dogs are rather sexually frustrated. Actual rape, though probably only possible for male humans, however, is possible, but its consequences for humans are no different from the consequences of other forms of abuse - either a broken dog or a dangerous dog.", 
   {}, 
   151027, 
   null, 
   1122462660.0
  ], 
  [
   151297, 
   null, 
   "snakespit", 
   "By the definition I am aware of, yes, dogs are sentient. They are self aware (almost every animal is) and perceive the environment.\n \n Whether they are sapient is a different matter. Intellectual capabilities develop gradually and along multiple paralell lines.\n \n For the purposes of this thread, however, I would point out that humanity has only ever cared about itself. How we treat dogs is determined not by the dogs' sentience but by what the dogs can do for humanity and what humanity can do to them and still get away with.\n \n Personally, I'm all for ethical treatment of animals, minimizing suffering, as it promotes general human empathy for other humans which we seem to lack lately. Still, new medicines, safe products and similar are worth a certain amount of suffering. I just hope the people doing these things do them with a tear in their eye.\n \n For the specific point of dog consent and rape, I don't think it is (much of) a problem. Apparently, dogs don't have all the emotional baggage related to sexuality that our society implants in humans, so it is apparently not a question of forcing them, but rather of teaching them. Especially since kept dogs are rather sexually frustrated. Actual rape, though probably only possible for male humans, however, is possible, but its consequences for humans are no different from the consequences of other forms of abuse - either a broken dog or a dangerous dog.\n\n This thread was started in response to the Terri Schiavo case thread. Someone stated that dogs were not sentient beings, and even went as far as saying that the only other beings that could possibly be considered sentient were dolphins and whales. I have no idea what this special person is thinking, but clearly it is wrong. \n \n As for raping dogs, I really never thought about it, although I think it is pretty sick. But on that note...you go boy! emoticon_xclown", 
   {}, 
   151051, 
   null, 
   1122527820.0
  ], 
  [
   151298, 
   null, 
   "snakespit", 
   "Also, I wold really like to know who voted no, and see your reasoning behind this. As well, for the people who did not know what it means:\n \n sen·tient (s&#277;n'sh&#601;nt, -sh&#275;-&#601;nt) \n adj.\n 1. Having sense perception; conscious: \"The living knew themselves just sentient puppets on God's stage\" (T.E. Lawrence).\n 2. Experiencing sensation or feeling.\n [Latin senti&#275;ns, sentient-, present participle of sent&#299;re, to feel.]\n \n sen'tient·ly adv.", 
   {
    "unicode_changes_made": true
   }, 
   151297, 
   null, 
   1122528060.0
  ], 
  [
   151316, 
   null, 
   "Iuris", 
   "But on that note...you go boy! \n\n \n Humm, a dog has indeed tried to hump my leg once, but I found the experience unsatisfactory and have lost interest in sex with animals afterwards emoticon_rolleyes", 
   {}, 
   151298, 
   null, 
   1122545880.0
  ], 
  [
   151318, 
   null, 
   "Clive14", 
   "Also, I wold really like to know who voted no, and see your reasoning behind this. As well, for the people who did not know what it means:...\nYes, but what does that mean? Is an insect sentient as it has sense perceptions? There again so does a bacteria, so is that sentient too? Or is consciousness required too and if so, what is consciousness? \n \n Sentience is a black-and-white word applied to a grey world. Different organisms display different amounts and types of sentience. Asking that question \"is a dog sentient?\" is like asking \"is a dog big?\" Sentient relative to what? Sentient in what way?", 
   {}, 
   151298, 
   null, 
   1122546420.0
  ], 
  [
   151322, 
   null, 
   "snakespit", 
   "Yes, but what does that mean? Is an insect sentient as it has sense perceptions? There again so does a bacteria, so is that sentient too? Or is consciousness required too and if so, what is consciousness? \n\n If you look at the definition above, it says \"having sense perception, conscious\". Did you miss that part? \n \n \nSentience is a black-and-white word applied to a grey world. Different organisms display different amounts and types of sentience. Asking that question \"is a dog sentient?\" is like asking \"is a dog big?\" Sentient relative to what? Sentient in what way?\n\n I was looking on a general sense. Obviously there are degrees of sentience, but in general, I was inquiring if animals possess the quality of sentience.", 
   {}, 
   151318, 
   null, 
   1122550560.0
  ], 
  [
   151328, 
   null, 
   "Clive14", 
   "If you look at the definition above, it says \"having sense perception, conscious\". Did you miss that part? \nNo I clearly saw that part. It would be a little difficult for me to query it if I hadn't seen it after all. Does \"having sense perception, conscious\" mean it must be concious to be sentient? Does it mean has sense perception and conciousness, does it mean has sense perception or conciousness? What is sense perception in this context? What is conciousness in this context? Perhaps my question is a little clearer now?\n \n Please do not accuse me of missing things when I not only didn't miss it, I thought about it too and thus felt the need to question its vagueness. Thank you.\n \n \nI was looking on a general sense. Obviously there are degrees of sentience, but in general, I was inquiring if animals possess the quality of sentience.\nWhich quality of sentience?", 
   {}, 
   151322, 
   null, 
   1122554880.0
  ], 
  [
   151618, 
   null, 
   "snakespit", 
   "No I clearly saw that part. It would be a little difficult for me to query it if I hadn't seen it after all. Does \"having sense perception, conscious\" mean it must be concious to be sentient? Does it mean has sense perception and conciousness, does it mean has sense perception or conciousness? What is sense perception in this context? What is conciousness in this context? Perhaps my question is a little clearer now?\n \n Please do not accuse me of missing things when I not only didn't miss it, I thought about it too and thus felt the need to question its vagueness. Thank you.\n \n Which quality of sentience?\n\n Funny, nobody else seemed to have difficulty answering the question. If you need to know what these terms mean, look in a dictionary...I am too tired to look them up for you. If you cannot add these terms up to form an impression in your head, I cannot help you.", 
   {}, 
   151328, 
   null, 
   1122619860.0
  ], 
  [
   151637, 
   null, 
   "Clive14", 
   "Funny, nobody else seemed to have difficulty answering the question...\nI cannot take responsiblity for everyone else failing to think about it. I add the terms up and they equal extreme vagueness. If everyone else wants to ignore this and simply assume it means an arbitary specific thing, then that is their chocie.\n \n I am not interested in dictionary definitions BTW. I prefer to actually understand what things mean, rather than learning to parrot someone else's summary.", 
   {}, 
   151618, 
   null, 
   1122634620.0
  ], 
  [
   151645, 
   null, 
   "snakespit", 
   "I cannot take responsiblity for everyone else failing to think about it. I add the terms up and they equal extreme vagueness. If everyone else wants to ignore this and simply assume it means an arbitary specific thing, then that is their chocie.\n \n I am not interested in dictionary definitions BTW. I prefer to actually understand what things mean, rather than learning to parrot someone else's summary.\n\n It is called critical thinking. \n \n The word conscious is pretty cut and dried.\n The word aware is pretty cut and dried. \n As is sense, perception, and feeling.\n These words are used to define sentient. Look each one up, find what they have in common, add them up to one idea, and you get an understanding of sentient. The others seemed to completely understand this, they even provided examples of why they felt their dogs or other animals were sentient. Somehow, I am getting the feeling that you are just looking to be difficult. emoticon_frazzled", 
   {}, 
   151637, 
   null, 
   1122637380.0
  ], 
  [
   151650, 
   null, 
   "Clive14", 
   "It is called critical thinking. \n \n The word conscious is pretty cut and dried.\n The word aware is pretty cut and dried. \n As is sense, perception, and feeling.\nNope, it is called sloppy thinking.\n \n We have next to no idea what conciousness is, how we measure and quantify it, how we judge whether other species are concious, how the brain creates conciousness, how it interacts with the subconcious etc. It is as \"cut and dried\" as a puddle of very wet mud.\n \n We likewise have next to no idea what awareness actually is beyond our own personal perceptions of it, how the brain creates it, whether other people experience it in the same way we do, let alone whether other species have any form of awareness.\n \n What is a sense? How many senses do you have? 5? 6? 21? Is your body's ability to measure blood pressure in your aorta a sense? Is the ability of a single celled organism to turn toward light a sense? Is the ability of a photoresistor to change resistance in the presence of light a sense? Explain what a \"feeling of dread\" is in objective terms? How do you feel it? How do you know if you feel it the same way as others? How do you know if you have ever felt it or simply liked the sound of it and decided a feeling of slight unease you had was a feeling of dread? How do you perceive \"green\"? Is it the same way as I do? How do bats perceive ultrasound sona \"images\"? How do butterflies perceive ultraviolet light?\n \n The only reason you think your cut-and-dried simplistic assumptions as to what these things are is critical thinking is because you haven't a clue what critical thinking is!\n \n \nThese words are used to define sentient. Look each one up, find what they have in common, add them up to one idea, and you get an understanding of sentient. The others seemed to completely understand this, they even provided examples of why they felt their dogs or other animals were sentient. Somehow, I am getting the feeling that you are just looking to be difficult. emoticon_frazzled\nNope, I just happen to have discussed the topic at great length with people in the past and know it is way more complex than the simplistic \"I just know my cat loves me because it runs up to me when I come home\" stuff seen here. Since you like dictionaries so much, try looking up the word \"anthropomorphize\" and you might begin to understand.", 
   {}, 
   151645, 
   null, 
   1122639000.0
  ], 
  [
   188732, 
   null, 
   "Santafeur", 
   "how do you define 'sentient'?\n \n I don't define it as 'having feelings'. I defne it as \"able to resist those feelings to achieve some more lasting end\"- and while some dogs are indeed capable of this (for example resisting the feeling of fear when going into a burning building to rescue a master) the majority of dogs I've seen are not.\n \n I guess every species has it's 'heroes'.", 
   {}, 
   150980, 
   null, 
   1135897740.0
  ], 
  [
   188871, 
   null, 
   "simone", 
   "Sentience is a state of mind.", 
   {}, 
   151650, 
   null, 
   1135957380.0
  ], 
  [
   189185, 
   null, 
   "Matthew S", 
   "If you view a Sentient creature as one who has a sence of self and can recognise themself in a mirror. A dog can not do this. Dolphins, whales and the great apes are the only other creatures onther then humans who can do this. Dog have a great intellengce but can not see past the moment.", 
   {}, 
   150980, 
   null, 
   1136126280.0
  ], 
  [
   189191, 
   null, 
   "Wraith", 
   "If you view a Sentient creature as one who has a sence of self and can recognise themself in a mirror. A dog can not do this. Dolphins, whales and the great apes are the only other creatures onther then humans who can do this. Dog have a great intellengce but can not see past the moment.\n\n \n I'd argue some can, and some can't... the animal is on 'the boarder' IMHO.", 
   {}, 
   189185, 
   null, 
   1136128740.0
  ], 
  [
   189324, 
   null, 
   "snakespit", 
   "how do you define 'sentient'?\n \n I don't define it as 'having feelings'. I defne it as \"able to resist those feelings to achieve some more lasting end\"- and while some dogs are indeed capable of this (for example resisting the feeling of fear when going into a burning building to rescue a master) the majority of dogs I've seen are not.\n \n I guess every species has it's 'heroes'.\n\n sen·tient (s&#277;n'sh&#601;nt, -sh&#275;-&#601;nt) \n adj.\n 1. Having sense perception; conscious: \"The living knew themselves just sentient puppets on God's stage\" (T.E. Lawrence).\n 2. Experiencing sensation or feeling.\n [Latin senti&#275;ns, sentient-, present participle of sent&#299;re, to feel.]\n \n sen'tient·ly adv.\n \n While I have my own definition which adds up to relatively the same thing, I got one from an online dictionary. This one was chosen at random, as all of the definitions I found basically said the same thing.", 
   {
    "unicode_changes_made": true
   }, 
   188732, 
   null, 
   1136177760.0
  ], 
  [
   189427, 
   null, 
   "Ooaman", 
   "I vote Yes with a resounding \"Well Duh!\" IMO, a sentient being is any living thing that can think for itself, even to the point of disobedience. Now I'm not saying that disobedience is a good thing. But it's proof that a dog can think for itself.", 
   {}, 
   189324, 
   null, 
   1136235120.0
  ], 
  [
   190270, 
   null, 
   "snakespit", 
   "I vote Yes with a resounding \"Well Duh!\" IMO, a sentient being is any living thing that can think for itself, even to the point of disobedience. Now I'm not saying that disobedience is a good thing. But it's proof that a dog can think for itself.\n\n Sadly, the obvious tends to elude some of these people.", 
   {}, 
   189427, 
   null, 
   1136584320.0
  ], 
  [
   198282, 
   null, 
   "Cheesejoff", 
   "I was confused with Sentient and Sapient, sorry.\n \n Yes I think they are sentient as they definitely have feelings and perceptions.", 
   {}, 
   190270, 
   null, 
   1139925180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Sentient Being?", 
  "url": "http://www.4forums.com/political/society-debates/6068-sentient-being.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 6068, 
  "discussion_files": [
   [
    "31300.html", 
    "http://www.4forums.com/political/society-debates/6068-sentient-being-print.html"
   ], 
   [
    "31301.html", 
    "http://www.4forums.com/political/society-debates/6068-sentient-being-2-print.html"
   ]
  ], 
  "identifier": 6068
 }
]