[
 [
  [
   8169, 
   null, 
   "Debate_Queen615", 
   "Give your thoughts about which movies are better\n \n \n LORD OF THE RINGS \n \n because\n \n The special look WAY more real \n better location <----- NEW ZEALAND RULES!!!!!!!!!!!!!\n better actors \n better actresses\n it makes you feel like your their (if you are at the theaters or have a big screen tv)\n they sell SPECIAL EDDITION <---- WHICH IS SO COOL!!!!!!\n \n Harry Potter sux\n awful plot line\n boring \n effects SUCK!", 
   {
    "post_info": {
     "post_title": "Lord of the Rings vs. Harry Potter"
    }
   }, 
   null, 
   null, 
   1053283800.0
  ], 
  [
   8232, 
   null, 
   "SparkleSocks22", 
   "How can you say Harry Potter sucks?! I think Harry Potter is much better!\n \n HARRY POTTER\n \n because\n \n They are magical baby! yesh!!! :p \n Harry, Ron, Hermoine (sp?) are much better than whatever the lord of the rings charcters names are\n The Harry Potter BOOKS are MUCH better than the Lord of the Rings books....\n This movie also appeals more to the people who don't like sci fi or fantasy because it's not TO out there and it could happen...it takes you off into another world that you can visulize as the lord of the rings is like way out there like star trek.\n \n THE LORD OF THE RINGS\n BOOOORING\n snooze\n zzZzzZzzZZZZzzz", 
   {}, 
   8169, 
   null, 
   1053481680.0
  ], 
  [
   8233, 
   null, 
   "Crim", 
   "The LotR books are superior and so are the movies.\n No aspect of the Harry Potter movies even competes with LotR.", 
   {}, 
   8169, 
   null, 
   1053481860.0
  ], 
  [
   8234, 
   null, 
   "SparkleSocks22", 
   "Maybe because you like to read sci fi books? Me on the other hand I hate to read sci fi and fantasy...Harry Potter is as fantasy as I can go...I have never really cared for them that is probably why...I never got into the Lord Of The Rings books....Plus we watched that AWFUL cartoon hobbit movie! Now I know that you will have to agree with me that the Harry Potter movies are MUCH better than the cartoon hobbit movie~ ;)", 
   {}, 
   8169, 
   null, 
   1053482100.0
  ], 
  [
   8236, 
   null, 
   "Crim", 
   "Never saw it.", 
   {}, 
   8169, 
   null, 
   1053482700.0
  ], 
  [
   8237, 
   null, 
   "Debate_Queen615", 
   "Originally posted by Debate_Queen615 \n Give your thoughts about which movies are better\n \n \n LORD OF THE RINGS \n \n because\n \n The special look WAY more real \n better location <----- NEW ZEALAND RULES!!!!!!!!!!!!!\n better actors \n better actresses\n it makes you feel like your their (if you are at the theaters or have a big screen tv)\n they sell SPECIAL EDDITION <---- WHICH IS SO COOL!!!!!!\n \n Harry Potter sux\n awful plot line\n boring \n effects SUCK! \n \n \n ok wait a sec have you seen the movie.... \n \n are you Erin McGrath???????\n \n and hell no the actors are actually HOTTTT and GOOD at acting in Lord of the Rings\n \n Harry Potter could never happen.... Lord of the Rings could happen in like 1 million years cause there isn't a hell of a lot of magic all it is, is little people traveling with big people to destroy a ring... now does that sound like \"way out there\" no I don't think so.... the way I described it IT COULD HAPPEN TOMORROW!!!!!!!!!! \n \n so this is what I think of you! emoticon_angry emoticon_xkill :xbanghead :xcensored emoticon_mad", 
   {
    "post_info": {
     "post_title": "Re: Lord of the Rings vs. Harry Potter"
    }
   }, 
   8169, 
   null, 
   1053482940.0
  ], 
  [
   8238, 
   null, 
   "Debate_Queen615", 
   "Originally posted by SparkleSocks22 \n Maybe because you like to read sci fi books? Me on the other hand I hate to read sci fi and fantasy...Harry Potter is as fantasy as I can go...I have never really cared for them that is probably why...I never got into the Lord Of The Rings books....Plus we watched that AWFUL cartoon hobbit movie! Now I know that you will have to agree with me that the Harry Potter movies are MUCH better than the cartoon hobbit movie~ ;) \n \n \n ok... your thinking of the Hobbit babe TOTALLY dif than Lord of the Rings get it right plz\n \n and yeah me, the biggest fan of LOTR HATES the cartoon Hobbit movie", 
   {}, 
   8169, 
   null, 
   1053483060.0
  ], 
  [
   8239, 
   null, 
   "Debate_Queen615", 
   "Originally posted by SparkleSocks22 \n How can you say Harry Potter sucks?! I think Harry Potter is much better!\n \n HARRY POTTER\n \n because\n \n They are magical baby! yesh!!! :p \n Harry, Ron, Hermoine (sp?) are much better than whatever the lord of the rings charcters names are\n The Harry Potter BOOKS are MUCH better than the Lord of the Rings books....\n This movie also appeals more to the people who don't like sci fi or fantasy because it's not TO out there and it could happen...it takes you off into another world that you can visulize as the lord of the rings is like way out there like star trek.\n \n THE LORD OF THE RINGS\n BOOOORING\n snooze\n zzZzzZzzZZZZzzz \n \n \n and antoher thing there is magic in LOTR \n \n mellon: the pass to get in the gates at where the trolls used to work but is now inhabited my orcs and goblins\n \n the fireworks!!!!!! thoses thing couldn't be made today \n \n and more.....", 
   {}, 
   8169, 
   null, 
   1053483480.0
  ], 
  [
   8408, 
   null, 
   "SparkleSocks22", 
   "OOOooookkkkkaaayyy whoa sorry to mess with ya'll Lord of the Rings freaks SHEESH u dont have to bite my head off! I still think Harry Potter is better though. The Lord Of The Rings--The Hobbit...they are BOTH written by the same person! I know that they are not the same series or whatever but still I never really liked them...", 
   {}, 
   8169, 
   null, 
   1053916320.0
  ], 
  [
   8499, 
   null, 
   "katie5890", 
   "sparklesocks(ur name is messed up first of all) second of all lotr is way more mature and sofisticated, harry potter is YUCK BAD GUYS!!emoticon_xbouncer", 
   {}, 
   8169, 
   null, 
   1054142040.0
  ], 
  [
   8594, 
   null, 
   "SparkleSocks22", 
   "Yea katie like I give a flip what the hell you think about my name! I like it and it's a WHOLE lot better than some stupid katie XXXX! I mean seriously thats not original! Whatever Harry Potter is still better.", 
   {}, 
   8169, 
   null, 
   1054349520.0
  ], 
  [
   8729, 
   null, 
   "baby_blue", 
   "ok it seems you guys have started a little cult against sparkle socks i hope you dont mind if i join it she sounds gay. i do agree with the majority of you Lord of the Rings is waaaaaaaaaaay better than Harry Potter. harry potter has to be the WORST movie i have ever seen, not kidding you. its just retarded. \n \n out-- babyblue;)", 
   {}, 
   8169, 
   null, 
   1054608780.0
  ], 
  [
   8732, 
   null, 
   "SparkleSocks22", 
   "This is hilarious! GET A LIFE YOU FRICKEN LOSERS! PPUUULEASE! I sound gay? What you guys sound what 12? Nice come backs there ;) I have friends you ****en *******! Some of them even are on here. What the hell? Numbers? Does that make you gay? WHAT THE HELL IS WRONG WITH YOU PEOPLE?! And I'm glad I may sound dorky to you, I'd rather be dorky then a fricken prep! At least I HAVE a brain, y'all on the other hand I'm not so sure of. WHOOPIE! U HATE ME! BOO FRICKETY HOO! Honey I'm not the bitch you and your little YANKIE group are the bitch's. HELLO?! ALL OF YOU ARE FROM WISCONSIN!? I'm not stupid, you all know each other and just hate me. It's good to be hated. Harry Potter is not for 2 year olds, what the hell? They wouldn't even understand it. Who gives a XXXX if Harry Potter or Lord Of The Rings is better? THEY ARE FRICKEN MOVIES! Some cliques up in Wisconsin I can see are PMSing. Oh yea and Katie? BEFORE YOU DISH OUT THAT NUMBERS SOUND GAY, CHECK YOUR ON FRICKEN NICKNAME! YOU HAVE NUMBERS TOO SO LEAVE ME THE HELL ALONE!", 
   {
    "post_info": {
     "post_title": "WHO'S BAD?"
    }
   }, 
   8169, 
   null, 
   1054609680.0
  ], 
  [
   8736, 
   null, 
   "baby_blue", 
   "oooooooooooooooooooh my god !! first of all i knoe none of the peoplr on youdebate!! second, TWO YEAR OLDS WOULD UNDERSTAND HARRY POTTER !!! we took my little cousin to the movie shes 2 and a half and i love her to death shes the only one ive ever heard say good things about that movie.. so U GET A LIFE B**CH!!!", 
   {}, 
   8169, 
   null, 
   1054610160.0
  ], 
  [
   8737, 
   null, 
   "katie5890", 
   "Sparkles i gotta say im proud of u! i was beginning to think u were brainless too, u just reminded me of this girl Erin in my class shes SOO obsessed one time i said hey look a pic of harry potter is in this book AND SHE FLIPPED! she reached over the table going OMG! !! ARE U SERIOUS!! GIVE ME IT I WANNA C IT!!! it was great! shes even got harry potter sheets.", 
   {}, 
   8169, 
   null, 
   1054610220.0
  ], 
  [
   8738, 
   null, 
   "baby_blue", 
   "are you serious? some girl actually did that?! how can someone be that obsessed ?", 
   {}, 
   8169, 
   null, 
   1054610520.0
  ], 
  [
   8770, 
   null, 
   "DarKnight", 
   "As is the nature of fan euphoric hysteria. Lets just hope Potter doesn't start drinking or mugging people other wise there will be a REAL problem.", 
   {}, 
   8169, 
   null, 
   1054651440.0
  ], 
  [
   8802, 
   null, 
   "SparkleSocks22", 
   "lol I am SO not obsessed with Harry Potter! Ya know both movies were great...I just have a friend who is TOTALLY obsessed with Harry Potter and she is like if you don't stand up for it then I will kick your XXX (me being scared because she is an 8th degree black belt in karate ;)) I myself really don't have a preference...they both are great movies and books. Sci fi and fantasy really aren't my thing anyways.", 
   {}, 
   8169, 
   null, 
   1054677060.0
  ], 
  [
   8806, 
   null, 
   "Striel", 
   "Lord of the Rings is MUCH better than Harry Potter. The LOTR movies are more entertaining and have a better storyline.", 
   {}, 
   8169, 
   null, 
   1054677480.0
  ], 
  [
   8880, 
   null, 
   "Debate_Queen615", 
   "Originally posted by SparkleSocks22 \n  you guys sound what 12\n you all know each other and just hate me. \n \n \n \n actually I am 12 \n \n \n and I don't hate you I just don't agree with some ofthe stuff you like\n \n Katie I think your over reacting it was funny at first but its honestly get a little old", 
   {
    "post_info": {
     "post_title": "Re: WHO'S BAD?"
    }
   }, 
   8169, 
   null, 
   1054692420.0
  ], 
  [
   8940, 
   null, 
   "SparkleSocks22", 
   "lol wow you really are 12? thats hilarious. (not that that is your age but that I guessed it...unless you were saying that to be \"funny\")\n \n If you didn't agree with what I said, then say that instead of f you.", 
   {}, 
   8169, 
   null, 
   1054757640.0
  ], 
  [
   8951, 
   null, 
   "katie5890", 
   "haha:) i noticed that im 13...if n e one cares:):)emoticon_xbouncer emoticon_rolleyes :)", 
   {}, 
   8169, 
   null, 
   1054766700.0
  ], 
  [
   8955, 
   null, 
   "Debate_Queen615", 
   "Originally posted by SparkleSocks22 \n lol wow you really are 12? thats hilarious. (not that that is your age but that I guessed it...unless you were saying that to be \"funny\") \n \n \n \n dead serious I'm 12 but about 11 more days and I'm 13", 
   {}, 
   8169, 
   null, 
   1054770000.0
  ], 
  [
   8974, 
   null, 
   "SparkleSocks22", 
   "lol that's cool. Happy early birthday.", 
   {}, 
   8169, 
   null, 
   1054783740.0
  ], 
  [
   9166, 
   null, 
   "Habbit", 
   "Lord of the Rings vs. Harry Potter... what kind of comparison is that?", 
   {}, 
   8169, 
   null, 
   1054956060.0
  ], 
  [
   9339, 
   null, 
   "katie5890", 
   "are we still debating this cuz im thinking most of us agree except sparkles that lotr is betteremoticon_xchicken emoticon_xangel", 
   {}, 
   8169, 
   null, 
   1055114520.0
  ], 
  [
   9379, 
   null, 
   "SilentPoet", 
   "I don't know how anyone over the age of 10, who has read and watched both series can perfer Harry Potter over Lord of the Rings...\n Can someone enlighten me on this?\n \n (Some 12 year olds I can make an exception for)", 
   {}, 
   8169, 
   null, 
   1055145120.0
  ], 
  [
   9389, 
   null, 
   "katie5890", 
   "i really dont think its possible for anyone to explain that!emoticon_xdonno", 
   {}, 
   8169, 
   null, 
   1055174400.0
  ], 
  [
   9440, 
   null, 
   "SparkleSocks22", 
   "It's just your preference. I am WAY over 10 and older than 12. Really guys chill it's JUST a movie. Personally I didn't like either but that black belt is gonna kick my a$$ so Harry Potter is great.", 
   {}, 
   8169, 
   null, 
   1055276160.0
  ], 
  [
   9488, 
   null, 
   "katie5890", 
   "okay wait! u were getting in a little hissy fit b 4 and now u say u like neither?? way to stand by your opinion and if i understand correctly, its not even your opinion its ur friends. Cant u think for yourself??", 
   {}, 
   8169, 
   null, 
   1055435640.0
  ], 
  [
   9605, 
   null, 
   "Debate_Queen615", 
   "Originally posted by katie5890 \n okay wait! u were getting in a little hissy fit b 4 and now u say u like neither?? way to stand by your opinion and if i understand correctly, its not even your opinion its ur friends. Cant u think for yourself?? \n \n \n I agree if you are telling the truth you need to tell us YOUR opinion not your friends and if your friends can't accept that then maybe you shouldn't let them accept you", 
   {}, 
   8169, 
   null, 
   1055489820.0
  ], 
  [
   9607, 
   null, 
   "Debate_Queen615", 
   "Originally posted by SilentPoet \n I don't know how anyone over the age of 10, who has read and watched both series can perfer Harry Potter over Lord of the Rings...\n Can someone enlighten me on this?\n \n (Some 12 year olds I can make an exception for) \n\n \n I agree, but the you pass the 40 mark and you'll watch ne movie lol no I'm jut kidding", 
   {}, 
   8169, 
   null, 
   1055490000.0
  ], 
  [
   9895, 
   null, 
   "SparkleSocks22", 
   "Hon, let me tell you this. I don't have an opinion on this I am just kinda like whatever I don't like sci fi or fantasy. BUT my friend who is a Harry Potter freak, doesn't have a name on this website and wanted to get HER opinion across so I let her use my name. Jeez y'all, I am NOT the one in the hissy fit, it's you.", 
   {}, 
   8169, 
   null, 
   1055727900.0
  ], 
  [
   9898, 
   null, 
   "katie5890", 
   "then ur friend should say its her not u...im not in a hissy fit i just would love to XXXX u off", 
   {}, 
   8169, 
   null, 
   1055728200.0
  ], 
  [
   10210, 
   null, 
   "Debate_Queen615", 
   "you are JUST telling us this now \n \n sorry but I don't beleive you", 
   {}, 
   8169, 
   null, 
   1055967540.0
  ], 
  [
   10222, 
   null, 
   "katie5890", 
   "Yea really she probably would have specified that it wasnt u i dont knoe whats going on but im just confused", 
   {}, 
   8169, 
   null, 
   1055976540.0
  ], 
  [
   10232, 
   null, 
   "SilentPoet", 
   "Debate_Queen,\n \n \n \"I agree, but the you pass the 40 mark and you'll watch ne movie lol no I'm jut kidding\"\n \n - Alright, lol....\n I still stand firmy that Lord of the Rings is far superior to Harry Potter. Although I like Harry Potter and I plan to eventually read the 5th book, but I'm not one of those people who are going to reserve there very own copy so I can grab it from the shelves the first day it comes out. I'll get around to reading it..\n Can anyone please explain why they perfer Harry Potter to LOTR.\n \n \n Always Stay Open Minded", 
   {}, 
   8169, 
   null, 
   1055980020.0
  ], 
  [
   10233, 
   null, 
   "katie5890", 
   "I do believe it would be incredibly hard to explain that. Well i guess if u dont like action...and are more into the mystery kinda thing u might like it. i think its okay i mean i agree with silentpoet", 
   {}, 
   8169, 
   null, 
   1055980680.0
  ], 
  [
   10238, 
   null, 
   "SilentPoet", 
   "Katie,\n \n Yes mystery vs. action prefrence could come in at some point. The movies though are mainly for the general children audience (10 and under, with exceptions). (The mystery always focusses around the dark arts teacher, so everyone already knows who the \"bad guy\" is.)\n Mystery is good, in fact I love mystery with suspense but not with witches, at a place called Hogwarts with flying cars and angry trees.\n \n \n Always Stay Open Minded", 
   {}, 
   8169, 
   null, 
   1055981520.0
  ], 
  [
   10473, 
   null, 
   "Habbit", 
   "Don't get me wrong, I love the Harry Potter series, but, Harry Potter is the five year old's version of Lord of the Rings. The Lord of the Rings series isn't just a few books. It's a mythology. It's the history of Middle-Earth and the land of Arda. There's more to it than some guys fighting a big, bad villian.", 
   {}, 
   8169, 
   null, 
   1056217260.0
  ], 
  [
   10536, 
   null, 
   "SilentPoet", 
   "I didn't realize how many people were ABSOLUTELY obsessed with Harry Potter... Even over the age of 10.\n \n http://www.cnn.com/2003/SHOWBIZ/books/06/21/sprj.cas03.potter.us/index.html\n \n \"In Hudson, Ohio, Nicole Rosales, 15, was the first person in line at the Learned Owl Bookshop and cried when she got her copy, according to the AP. \n \"We're not going to sleep tonight,\" she told the AP.\"\n \n - A 15 year old girl cried out of joy of getting the new Harry Potter book. A 15 year old. Not a 10 year old. A 15 year old.... Thats a bit disturbing. \n Well I just thought I'd point this out\n \n Thanks for reading this\n \n Always Stay Open Minded", 
   {}, 
   8169, 
   null, 
   1056266100.0
  ], 
  [
   10913, 
   null, 
   "SparkleSocks22", 
   "Why is that disturbing? People can like whatever they want...geez can't you people be open to other ideas? LOTS of people can be obsessed with Harry Potter just as with Lord of the rings...i mean it's JUST a few movies and books. I'm not a Harry Potter freak but I did reserve my own copy of the 5th..it's just a book GEEZ!", 
   {}, 
   8169, 
   null, 
   1056579780.0
  ], 
  [
   10923, 
   null, 
   "SilentPoet", 
   "SparkleSocks,\n \n \"it's just a book GEEZ!\"\n \n - Thats whats so disturbing. Of course the girl has the right to enjoy the book and cry at the turn of every page, but that doesn't make it any less \"sickening\" to me.\n \n Thanks for reading this\n \n Always Stay Open Minded", 
   {}, 
   8169, 
   null, 
   1056580920.0
  ], 
  [
   10939, 
   null, 
   "katie5890", 
   "lol u got that right", 
   {}, 
   8169, 
   null, 
   1056586200.0
  ], 
  [
   11120, 
   null, 
   "Debate_Queen615", 
   "Originally posted by SparkleSocks22 \n Why is that disturbing? People can like whatever they want...geez can't you people be open to other ideas? LOTS of people can be obsessed with Harry Potter just as with Lord of the rings...i mean it's JUST a few movies and books. I'm not a Harry Potter freak but I did reserve my own copy of the 5th..it's just a book GEEZ! \n \n \n \n SparkleSocks was that your friend again?", 
   {}, 
   8169, 
   null, 
   1056782040.0
  ], 
  [
   11122, 
   null, 
   "Debate_Queen615", 
   "Originally posted by SparkleSocks22 \n Why is that disturbing? People can like whatever they want...geez can't you people be open to other ideas? LOTS of people can be obsessed with Harry Potter just as with Lord of the rings...i mean it's JUST a few movies and books. I'm not a Harry Potter freak but I did reserve my own copy of the 5th..it's just a book GEEZ! \n \n \n \n In my opinion people who cry and scream over a movie or book need help. I mean they have the right to be excited about this book (expecially since they've waited about 2 years) but that sort of behavior is that of a 5 year old's when their mother gives them their first kit of play make up.", 
   {}, 
   8169, 
   null, 
   1056782280.0
  ], 
  [
   11388, 
   null, 
   "SparkleSocks22", 
   "In my opinion people who cry and scream over a movie or book need help. I mean they have the right to be excited about this book (expecially since they've waited about 2 years) but that sort of behavior is that of a 5 year old's when their mother gives them their first kit of play make up.\n\n \n Yea I see where you are coming from. I mean I got my book the other day and just started reading as some other people cried and screamed and stayed up all night and day to finish it. I don't think they need help for crying and screaming over a movie or book. It's just what they like and makes them happy. I mean probably all of you know by now I am a Michael Jackson fan. I mean he makes me happy, his music, his dancing it just makes me smile. And uhhh for y'all who don't know me that is a big deal. That is why though I go off so much on you guys because he makes me so happy and I just want to spread the love. You don't have to love the guy, but his music his just out of this world. and that is my how my friend Jennifer* loves Harry Potter so much. It makes her smile, I don't think she cried and screamed over it she just loves the books that's all. It's just her preference.\n \n *= name has been changed", 
   {}, 
   11122, 
   null, 
   1057259460.0
  ], 
  [
   12129, 
   null, 
   "goldylocks77", 
   "I love harry potter so deal with it. I also like lord of the rings. so deal with it. i dont care what you pathetic people think about that because if you really care what i think than you should see a shrink. have a lovely day!", 
   {}, 
   8169, 
   null, 
   1058912580.0
  ], 
  [
   12131, 
   null, 
   "katie5890", 
   "Hey goldy i think ur missing the point of this website we dont deal with things we debate them (hence the name youdebate) and after we've debated we may come to a conclusion and then deal with it. So sont just come on here and think everyones gonna deal with your opinion. Right now u seem very arrogant...but keep in mind im saying SEEM not are i dont know u that well so i wont judge its just how ur comming off.", 
   {}, 
   12129, 
   null, 
   1058926440.0
  ], 
  [
   12142, 
   null, 
   "goldylocks77", 
   "fine, we lets 'debate' on it, i was just stating my opinion. and by the way after reading some of the conversation, some of you guys seem a tad bit arogant too, but I dont know either so i wont say anything more!", 
   {
    "post_info": {
     "post_title": "ok"
    }
   }, 
   12131, 
   null, 
   1058978640.0
  ], 
  [
   12143, 
   null, 
   "SparkleSocks22", 
   "Well, hello all....I haven't been here for quite a while but I see now the umm should i say \"cult\" dare I say may be moving on to goldy and not me? emoticon_idea lol j/k j/k goldy isn't an arrogant person Katie she's actually very nice....but I know my opinion is a tad bit different from urs judging from our \"debates\" Anyways it looks like this debate isn't over after all, we seem to have more than one person here who likes Harry Potter better....Let's actually DEBATE this time and not cuss eachother out.", 
   {}, 
   12142, 
   null, 
   1058979420.0
  ], 
  [
   12148, 
   null, 
   "katie5890", 
   "I agree completely...from now on, no more making fun of the debaters...sorry for those who i have done it to..but i think we all can agree we've done it at one point or another. anyway, no more fighting about that stuff only the subject....truce everyone?", 
   {}, 
   12143, 
   null, 
   1058997420.0
  ], 
  [
   12149, 
   null, 
   "SparkleSocks22", 
   "alright katie, truce.", 
   {}, 
   12148, 
   null, 
   1058997540.0
  ], 
  [
   12693, 
   null, 
   "Carman", 
   "This is hilarious! GET A LIFE YOU FRICKEN LOSERS! PPUUULEASE! I sound gay? What you guys sound what 12? Nice come backs there ;) I have friends you ****en *******! Some of them even are on here. What the hell? Numbers? Does that make you gay? WHAT THE HELL IS WRONG WITH YOU PEOPLE?! And I'm glad I may sound dorky to you, I'd rather be dorky then a fricken prep! At least I HAVE a brain, y'all on the other hand I'm not so sure of. WHOOPIE! U HATE ME! BOO FRICKETY HOO! Honey I'm not the bitch you and your little YANKIE group are the bitch's. HELLO?! ALL OF YOU ARE FROM WISCONSIN!? I'm not stupid, you all know each other and just hate me. It's good to be hated. Harry Potter is not for 2 year olds, what the hell? They wouldn't even understand it. Who gives a XXXX if Harry Potter or Lord Of The Rings is better? THEY ARE FRICKEN MOVIES! Some cliques up in Wisconsin I can see are PMSing. Oh yea and Katie? BEFORE YOU DISH OUT THAT NUMBERS SOUND GAY, CHECK YOUR ON FRICKEN NICKNAME! YOU HAVE NUMBERS TOO SO LEAVE ME THE HELL ALONE!\n\n WOW.............", 
   {}, 
   8732, 
   null, 
   1060064880.0
  ], 
  [
   13257, 
   null, 
   "katie5890", 
   "lol:):):):)", 
   {}, 
   12693, 
   null, 
   1060788960.0
  ], 
  [
   14068, 
   null, 
   "debategirl88", 
   "HAHAHAAHAHAHAHAHAHAHA!!!!!! That was the most humorous thing ive seen on this debate site...im still cracking up. Wow, that was a very interesting debate, and I think some of yall need to grow up juuuuust a tad. No Offense...oh, and if anyone really care...im 15\n Anywho, I prefer LOTR...the only reason i do is cuz of my religion...plus my parents band me from ever seeing Harry Potter...yes...i know...weird. Even the commercials for lotr look better there is more maturity in lotr and more excitement and more stunts, effects, and pretty much everything else....no contest....cased closed.....\n \n Oh and Sparkly or whatever the heck her name is is right....chill...its a flick emoticon_rolleyes...dont think im not a movie lover....trust me....I LOVE MOVIES, but i dont call ppl names like that over them...\n \n \n Oh and uh Sparkly, good luck with that black belt chik....ur gonna need it... emoticon_xangel", 
   {}, 
   9440, 
   null, 
   1062463020.0
  ], 
  [
   14074, 
   null, 
   "katie5890", 
   "They band you? thats stupid", 
   {}, 
   14068, 
   null, 
   1062473580.0
  ], 
  [
   14171, 
   null, 
   "debategirl88", 
   "Yeah, but ya get used to livin a kinda sheltered life...", 
   {}, 
   14074, 
   null, 
   1062557520.0
  ], 
  [
   14182, 
   null, 
   "katie5890", 
   "that sucks im only semi sheltered.... My friend katie can like do w/e anytime she can walk around at like 10 pm and like 11 so yea its fun going to her house that and her parents go to bed at like 8", 
   {}, 
   14171, 
   null, 
   1062560880.0
  ], 
  [
   16011, 
   null, 
   "Draco78", 
   "I dont care what this supposed ***** thinks im just here to post my opinion. I think harry potter is good for younger kids, but overall lotr is much better. Not only is there better special effects and a better location (i agree, New Zealand very cool), but the books and the movies have morals in them, such as honour, selflessness, courage, and loyalty. Some of the younger audiences can't grasp those yet. Plus theres also the eternal battle of good vs. evil. You can't argue against a classic like that.", 
   {}, 
   8736, 
   null, 
   1063934820.0
  ], 
  [
   16014, 
   null, 
   "SilentPoet", 
   "Draco,\n \n Don't use that kind of language \n (Censored)\n \n - Moderator", 
   {}, 
   16011, 
   null, 
   1063935300.0
  ], 
  [
   16112, 
   null, 
   "Draco78", 
   "O sorry, i just assumed from how my fellow debaters were speaking that i could. No offense to anyone.", 
   {}, 
   16014, 
   null, 
   1063956840.0
  ], 
  [
   16228, 
   null, 
   "katie5890", 
   "wait does it automatically do that now?", 
   {}, 
   16112, 
   null, 
   1064018340.0
  ], 
  [
   17562, 
   null, 
   "LedZeppelin", 
   "In my opinion, Lord of the Rings is obviously better literature, and Lord of the Rings is without a doubt better then the Harry Potter movies.", 
   {}, 
   16228, 
   null, 
   1064627160.0
  ], 
  [
   17564, 
   null, 
   "SilentPoet", 
   "Lord of the Rings is obviously better literature,\n \n \n If you haven't read Harry Potter how can you know its better literature?\n \n \nand Lord of the Rings is without a doubt better then the Harry Potter movies.\n \n \n Agreed.", 
   {}, 
   17562, 
   null, 
   1064627400.0
  ], 
  [
   17565, 
   null, 
   "LedZeppelin", 
   "[QUOTE=SilentPoet]If you haven't read Harry Potter how can you know its better literature?\n I agree, I can't fully be sure that Lord of the Rings is better literature then Harry Potter since I haven't read the books. Although, if you ask an English major, I believe, he/she would tell you that Lord of the Rings are classics, that it is better written then Harry Potter, and in general, better literature then Harry Potter.", 
   {}, 
   17564, 
   null, 
   1064628480.0
  ], 
  [
   17566, 
   null, 
   "SilentPoet", 
   "Although, if you ask an English major, I believe, he/she would tell you that Lord of the Rings are classics,\n \n \n No doubt LOTR is filled with some much more detail and imagination.\n \n \nand in general, better literature then Harry Potter.\n \n \n That would probably depend on the readers opinions.", 
   {}, 
   17565, 
   null, 
   1064629080.0
  ], 
  [
   17928, 
   null, 
   "gilligan8503", 
   "true, either or is opinionated, but without lord of the rings, there would be no harry potter (in a sense).\n \n think, harry potter is just random ideas, written on napkins.\n \n lord of the rings was planned out and actually had an entire history, language, cultures, maps, and everything BEFORE the books were written. the lord of the rings is modern-day mythology.", 
   {}, 
   17566, 
   null, 
   1065034080.0
  ], 
  [
   25769, 
   null, 
   "Debate_Queen615", 
   " think, harry potter is just random ideas, written on napkins. \n\n \n \n This is true. Although it is kind of impressive to right a whole book on napkins and keep it organized. I couldn't do it, could you?\n \n \n Lord of the Rings definately had more effort put towards it. Think about it, Tolkien made up languages for his books and carefully wrote the very long, detailed books.", 
   {}, 
   17928, 
   null, 
   1070692500.0
  ], 
  [
   26684, 
   null, 
   "SparkleSocks22", 
   "lol WOW I have not been on this thread for a VERY long time... lol the stuff \"I\" posted is hilarious... ANYWAYS yall want my opinion? Not my friend's opinion but mine? Well I know the answer is no... but I'll give it to u anyways ;)\n \n LOTR is alright... Potter is alright... I don't like fantasy. *shrugs* no use in debating this, I'm neutral... as for Jennifer* who posted obviously likes Potter better... and so does goldy. There isn't a problem with it. It's just a preference. Most people here though seem to like LOTR better... this should probably be put in the 'fun debates' i dont see what it has to do with entertainment... *shrugs* and its not much of a debate...", 
   {}, 
   25769, 
   null, 
   1071100200.0
  ], 
  [
   27963, 
   null, 
   "Memu2", 
   "I like the Lord of the Rings movies better, but I think the Harry Potter books are more entertaining.\n \n Star Trek Rules!", 
   {
    "post_info": {
     "post_title": "Lord of the Rings vs. Harry Potter"
    }
   }, 
   26684, 
   null, 
   1071641100.0
  ], 
  [
   28756, 
   null, 
   "katie5890", 
   "lol star trek? that just seems like a really cheesey show/movie thing...was it a movie and a show or was it a show not a movie or was it a movie not a show?", 
   {}, 
   27963, 
   null, 
   1072071840.0
  ], 
  [
   29401, 
   null, 
   "SparkleSocks22", 
   "I thought it was a movie and a TV show... my parents used to watch it all the time.", 
   {}, 
   28756, 
   null, 
   1072674900.0
  ], 
  [
   29518, 
   null, 
   "goldylocks77", 
   "true, either or is opinionated, but without lord of the rings, there would be no harry potter (in a sense).\n \n think, harry potter is just random ideas, written on napkins.\n \n lord of the rings was planned out and actually had an entire history, language, cultures, maps, and everything BEFORE the books were written. the lord of the rings is modern-day mythology.\n\n \n \n actually lotr is sort of random because if you watch the extra stuff on JRR Tolkein on the extended dvd it seems like a sort of random idea in a sense. i'm not saying its bad though. i actually love the movies i have to defend hp too though! lol! and the books weren't all written on napkins maybe the idea's but not the actual books.", 
   {}, 
   17928, 
   null, 
   1072814340.0
  ], 
  [
   29519, 
   null, 
   "goldylocks77", 
   "I thought it was a movie and a TV show... my parents used to watch it all the time.\n\n \n it is my dad loves the show. it's ok, i personally don't really get into it but it is pretty good.", 
   {}, 
   29401, 
   null, 
   1072814400.0
  ], 
  [
   32081, 
   null, 
   "lol man", 
   "The loard of the rings kicks the XXXX out of harry potter", 
   {}, 
   8237, 
   null, 
   1074660240.0
  ], 
  [
   32925, 
   null, 
   "Debate_Queen615", 
   " and the books weren't all written on napkins maybe the idea's but not the actual books.\n\n \n \n actually she said her self the ONE of the was written on napkins because at one time she was very poor, she would take her daughter to some coffee place and she would sit down and write on napkins because she couldn't afford paper. after the first book was published she made money and Walla! She could afford paper to write the second one.", 
   {}, 
   29518, 
   null, 
   1075344540.0
  ], 
  [
   34884, 
   null, 
   "Warrior", 
   "Hail everyone...I am new here. Geez! That whole argument back there was just...plain ridiculous...I like them both...Lord of the rings maybe a bit better than Harry Potter, But, still, Harry Potter is just great! The spells they cast in the movie are awesome.", 
   {
    "post_info": {
     "post_title": "Hail!"
    }
   }, 
   32925, 
   null, 
   1076929560.0
  ], 
  [
   37816, 
   null, 
   "goldylocks77", 
   "actually she said her self the ONE of the was written on napkins because at one time she was very poor, she would take her daughter to some coffee place and she would sit down and write on napkins because she couldn't afford paper. after the first book was published she made money and Walla! She could afford paper to write the second one.\n\n \n \n ok, but there is still nothing wrong with writing on napkins... if anybody was saying that was bad, i don't remember...", 
   {}, 
   32925, 
   null, 
   1078367880.0
  ], 
  [
   39242, 
   null, 
   "Leg0nd", 
   "Ffs Harry Potter wishes it was as gd as Lotr...Harry potter books were gd...movie sucked end of.", 
   {}, 
   37816, 
   null, 
   1079044860.0
  ], 
  [
   45008, 
   null, 
   "Valthonis", 
   "We'll I think they both are really stupid. The Lord of the rings movies are really repetative.", 
   {}, 
   39242, 
   null, 
   1082568360.0
  ], 
  [
   55094, 
   null, 
   "dcptherock", 
   ":xcensored :xcensored :xcensored :xcensored emoticon_angry emoticon_angry emoticon_xbangheadxdonno: Lord of the rings is much better than harry potter (HP copied LOTR in so many ways there are way too many ways zzzzzZZZZZZZzzzz) And lord of the rings won 11 oscars in the last 1 best film of all time harry potter may be liked,but the facts are lord of the rings is much better its like comparing a mouse to a 70 foot snake", 
   {
    "post_info": {
     "post_title": "oh come on!!!!"
    }
   }, 
   8737, 
   null, 
   1087956600.0
  ], 
  [
   55331, 
   null, 
   "katie5890", 
   "i dont understand why these are being compared, they are too diffrent genres and as so should not ever be seen as better or worse, they were ment for two diffrent audiences. ---extreme change of opinion from me i know.", 
   {}, 
   55094, 
   null, 
   1088046660.0
  ], 
  [
   146282, 
   null, 
   "The Shire", 
   "Oh my god...this is the funniest forum debating about Harry Potter and Lord of the Rings!!!!!!!!!!!!...so much swearing...so much tears...so much madness!!!...Always remember to be open minded guys... :) ...tat's the key emoticon_xangel ...lol...nyhoo...my personal opinion towards this debate topic is probably well enough stated from the title...lol...but i have to admit...I was such a HP freak before actually reading and watching LOTR...for all those who love HP...I advise them to give LOTR a chance...and then see for yourself!!! Because that's exactly what happened to me. after seeing the movies of LOTR...I instantly became their #1 fan!!!!!!!!!!!!!!!!!!!!!!...though HP books aren't tat bad...only it's too long of a series to keep my interested in...ok...so overall...LOTR is the best!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!book wise and movie wise...btw..the actors/actresses are sooooooooooooo much better in LOTR!!!!!!!!!!!!! emoticon_xlove", 
   {
    "post_info": {
     "post_title": "LOTR rules them all!!!!!!!!!!!!!!"
    }
   }, 
   55331, 
   null, 
   1121052240.0
  ], 
  [
   146301, 
   null, 
   "jazyjason", 
   "LOTR ROCKS!! HP sucks pigs feet.", 
   {}, 
   146282, 
   null, 
   1121061960.0
  ], 
  [
   146306, 
   null, 
   "Adept", 
   "We'll I think they both are really stupid. The Lord of the rings movies are really repetative.\n\n \n So what sort of movies (or stories) do you like?", 
   {}, 
   45008, 
   null, 
   1121063340.0
  ], 
  [
   146320, 
   null, 
   "snakespit", 
   "Wow, way to revive a dead thread. \n \n LOTR is fantastic. Loved the books, and was really glad to see that the movie was done very well. Usually after reading something, I think the movie just doesn't do it any justice. But in this case, I would say: well done. Never saw HP, never read HP, probably never will. Prefer to keep it that way. What little I have heard and seen about HP seemed childish.", 
   {}, 
   146306, 
   null, 
   1121076780.0
  ], 
  [
   146321, 
   null, 
   "Iuris", 
   "The basic problem here is that the two books have very different purposes.\n \n At first, I disliked Harry Potter, as the idea seemed childish. However, I eventually decided I'd better read it so as to be at least able to discuss it with others, and once I read it, it turned out as a very refreshing experience. While the gothic Warhammer universes have their attractive points, the constant mix of demons preying on wizards, ultracruelty and mass warfare does begin to brood a bit, and HP is just the counter for it. It's similar with epics like LOTR.\n \n Sometimes, you are in the mood for some epic grandness, and LOTR fits in perfectly. Sometimes, you're in a lighter mood, and you can really enjoy Potter. Mostly, you are simply bored and just want to read something to while away the time, and the better of the two is the one you have read fewer times so far...\n \n In the end, such universe versus universe arguments often forget one thing: one universe is not enough. You can get too much of it, and then, you turn to alternatives for a while.", 
   {}, 
   146306, 
   null, 
   1121076960.0
  ], 
  [
   146453, 
   null, 
   "The Shire", 
   "well said IURIS!!!!!!!!!!!!!!!!!!!!!!!! :p", 
   {}, 
   146321, 
   null, 
   1121116260.0
  ], 
  [
   146507, 
   null, 
   "wilted_laughter", 
   "In what parallel hell dimension does harry potter have a patch on the lord of the rings?", 
   {}, 
   146453, 
   null, 
   1121128020.0
  ], 
  [
   146537, 
   null, 
   "The Shire", 
   "do u always say that?????????????????...what valid point are you making from stating that?????????", 
   {
    "post_info": {
     "post_title": "to Wilted Laughter"
    }
   }, 
   146507, 
   null, 
   1121131740.0
  ], 
  [
   146563, 
   null, 
   "wilted_laughter", 
   "I posted in the other thread before I saw this one. Copy and paste seemed simplest thing to do. I'm simply voicing my opinion that Lord of the Rings far surpasses Harry Potter.", 
   {}, 
   146537, 
   null, 
   1121135160.0
  ], 
  [
   146751, 
   null, 
   "The Shire", 
   "lol...nice... :p", 
   {}, 
   146563, 
   null, 
   1121201220.0
  ], 
  [
   146880, 
   null, 
   "Iuris", 
   "To each his own, I say.\n \n I like even bad movies like Alien versus Predator, I just put myself in the author's mentality, which lets me recognize what the authors wanted to do.\n \n Rationally, I consider myself better off that way. So many more things to have fun with...", 
   {}, 
   146751, 
   null, 
   1121244540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Lord of the Rings vs. Harry Potter", 
  "url": "http://www.4forums.com/political/entertainment-debates/607-lord-rings-vs-harry-potter.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 607, 
  "discussion_files": [
   [
    "24497.html", 
    "http://www.4forums.com/political/entertainment-debates/607-lord-rings-vs-harry-potter-print.html"
   ], 
   [
    "24498.html", 
    "http://www.4forums.com/political/entertainment-debates/607-lord-rings-vs-harry-potter-7-print.html"
   ], 
   [
    "24499.html", 
    "http://www.4forums.com/political/entertainment-debates/607-lord-rings-vs-harry-potter-5-print.html"
   ], 
   [
    "24500.html", 
    "http://www.4forums.com/political/entertainment-debates/607-lord-rings-vs-harry-potter-4-print.html"
   ], 
   [
    "24501.html", 
    "http://www.4forums.com/political/entertainment-debates/607-lord-rings-vs-harry-potter-6-print.html"
   ], 
   [
    "24502.html", 
    "http://www.4forums.com/political/entertainment-debates/607-lord-rings-vs-harry-potter-3-print.html"
   ], 
   [
    "24503.html", 
    "http://www.4forums.com/political/entertainment-debates/607-lord-rings-vs-harry-potter-2-print.html"
   ]
  ], 
  "identifier": 607
 }
]