[
 [
  [
   151131, 
   null, 
   "billsco", 
   "Recently, pharmacists have been begun dispensing more than just pills. Some now are dispensing large doses of personal morality.\n \n Pharmacists For Life International is a fairly new organization comprised of professional men and women who have taken a moral stand against new prescription drugs such as Preven and Micronon, better known as \"morning after\" pills. They object to these pills largely because of the belief that they are nothing more than \"chemical abortions\". Some also object to selling birth control pills.\n \n One never knows when an encounter with a pharmacist will be met with a smile or rejection, whether they will have another on-duty pharmacist help the customer or simply be met with stony silence. \n \n Illinois Governor Rod Blagojevich has jumped into the fray  by signing an emergency rule requiring pharmacies to dispense, without delay, all legally prescribed medications and pills. He was promptly sued by Americans United for Life. \n \n What is your opinion on the matter? For my part, let me offer an analogy. Let's say I work in a butcher shop selling meat cuts to customers. The owner of the shop decides to offer a new line of veal products. A customer comes in and orders two veal chops. I refuse to help her, citing my conviction that slaughtering young calves is morally reprehensible and must be stopped. \n \n I would hope my boss would show me to the door. I would also hope to learn to keep my nose in its proper location.", 
   {
    "post_info": {
     "post_title": "Pharmacists Prescibing Morality"
    }
   }, 
   null, 
   null, 
   1122491100.0
  ], 
  [
   151135, 
   null, 
   "WhiteFalcon", 
   "I think these people have no buisness to give customers pills at what they think they should be. They(pharmcists) dont agree with it, too bad, its perfectly legal, and since when are they able to control what medications other people are to recieve, based on what they feel. Thats absurb.", 
   {}, 
   151131, 
   null, 
   1122492000.0
  ], 
  [
   151142, 
   null, 
   "sinjin", 
   "Can pharmacies reserve the right to \"refuse service to anyone\" just like other businesses? If yes and there are other pharmacies I don't see the problem.\n One cannot demand that their local store stock a certain item just because it is available at another store in the area.", 
   {}, 
   151135, 
   null, 
   1122494160.0
  ], 
  [
   151148, 
   null, 
   "Big Orn", 
   "Can pharmacies reserve the right to \"refuse service to anyone\" just like other businesses? If yes and there are other pharmacies I don't see the problem.\n One cannot demand that their local store stock a certain item just because it is available at another store in the area.\n\n I agree with you, sinjin. It depends on the owner of that company. For instance, if Jack's Drug Store does not believe in selling birth control products, including condoms and sponges, then no one should force Jack into doing so.\n \n On the other hand, if Ajax Drugs (a ficticious large company) had no such policy, but Jack was the pharmacist and refused to sell them, then corrective action should be taken. If he still refused - he should be terminated.", 
   {}, 
   151142, 
   null, 
   1122495540.0
  ], 
  [
   151149, 
   null, 
   "billsco", 
   "Can pharmacies reserve the right to \"refuse service to anyone\" just like other businesses? If yes and there are other pharmacies I don't see the problem.\n\n \n I suppose they can. That ubiquitous phrase has never been used in this context however. Aren't pharmacists also \"at will\" employees for the most part, working for national chain stores, who do indeed stock the items in question?\n \n Supposing there are no other pharmacies nearby, which is nearly always the case in rural communities. Does this pose a problem IYO? \n \n \n\n One cannot demand that their local store stock a certain item just because it is available at another store in the area. \n\n \n No, no one is demanding that either. They are being denied access to a substance which was prescribed by their doctor. The pharmacists are injecting themselves right in the middle of that sacred doctor/patient relationship. \n \n I guess the question should be, why does the pharmacist think he knows what's better for the patient than the doctor does?", 
   {}, 
   151142, 
   null, 
   1122495960.0
  ], 
  [
   151151, 
   null, 
   "Big Orn", 
   "I guess the question should be, why does the pharmacist think he knows what's better for the patient than the doctor does?\n\n He don't, billsco, and better not try to, imo.\n \n If I were to base my job on some religion(s), then I wouldn't be manufacturing bombs and ammo.\n \n But, these people need to check in with their religion a little closer. If they use The Holy Bible as a guide, then they better read it a little closer. The Bible says that if you're sick, seek a doctor.\n \n If you don't like what a doctor says, go to another. If he gives you a prescription, go get it filled. If Jack's Drug Store won't fill it, go to Ajax Drugs, etc, etc.\n \n You can't force morality on anyone, anyway. At least that's what I've found...and I don't do it for a living.\n \n On edit: How do you edit a poll? I meant to click on \"NO\", but I hit \"Don't Know\"\n \n I feel like one of Bill Cosby's kids.... :)", 
   {}, 
   151149, 
   null, 
   1122496740.0
  ], 
  [
   151152, 
   null, 
   "OccamsRazor", 
   "I guess the question should be, why does the pharmacist think he knows what's better for the patient than the doctor does?\n\n \n In all fairness the Pharmacist does serve an important vetting role in the supply of medication to patients- they check what has been prescribed by the doctor against they know about and correct errors that are made (which do happen... I was once given a 7 week course of anti-malarials which turned out to be suitable for taking no more than 28 days at a time).\n \n That aside I'd agree with sinjin.", 
   {}, 
   151149, 
   null, 
   1122496740.0
  ], 
  [
   151157, 
   null, 
   "Steeeeve", 
   "yeah, shouldn't it be up to the pharmacy as a company? If it is their policy then go somewhere else. Same way a c-store doesn't have to carry Pepsi products if they don't want to.", 
   {}, 
   151152, 
   null, 
   1122497880.0
  ], 
  [
   151170, 
   null, 
   "billsco", 
   "I just want to make sure we're all on the same page. As far as I know all pharmacy chains carry the two pills mentioned in the OP ( I don't know about mom and pop pharmacies; they're so few and far between). We can safely assume therefore these chains condone the selling of the product. It is the individual pharmacists working for these companies who are making a morality pitch--a quite ineffective grandstanding one--that is what I'm arguing against.\n \n We're also not arguing about the usefulness of a pharmacist. Yes, they can act as a check against a doctor's mistake. \n \n But other than that, they take a big container of pills, count vewy carefully, and put them in a little container, hand them to the customer and say \"Thank you for shopping at Ajax.\" Keep their personal opinions to themselves!", 
   {}, 
   151157, 
   null, 
   1122500040.0
  ], 
  [
   151178, 
   null, 
   "sinjin", 
   "I just want to make sure we're all on the same page. As far as I know all pharmacy chains carry the two pills mentioned in the OP ( I don't know about mom and pop pharmacies; they're so few and far between). We can safely assume therefore these chains condone the selling of the product. It is the individual pharmacists working for these companies who are making a morality pitch--a quite ineffective grandstanding one--that is what I'm arguing against.\n \n We're also not arguing about the usefulness of a pharmacist. Yes, they can act as a check against a doctor's mistake. \n \n But other than that, they take a big container of pills, count vewy carefully, and put them in a little container, hand them to the customer and say \"Thank you for shopping at Ajax.\" Keep their personal opinions to themselves!\n\n \n If the pharmacist is an employee then it's a company issue as Big Orn said although you could sue the company. If no other pharmacy is available and the pharmacist owns the pharmacy I'd say sue him/her and buy online. Those Canadians will sell you anything.", 
   {}, 
   151170, 
   null, 
   1122501720.0
  ], 
  [
   151874, 
   null, 
   "Mach", 
   "Can pharmacies reserve the right to \"refuse service to anyone\" just like other businesses? If yes and there are other pharmacies I don't see the problem.\n One cannot demand that their local store stock a certain item just because it is available at another store in the area.\n\n \n Is this not illegal?\n \n Both federal and state laws prohibit businesses from denying public accommodation to citizens on the basis of race, color, religion or national original. The Federal Civil Rights Act guarantees all people the right to \"full and equal enjoyment of the goods, services, facilities, privileges, advantages, and accommodations of any place of public accommodation, without discrimination or segregation on the ground of race, color, religion, or national origin.\"  \n \n If the reason a pharmacy kook is refusing service based on their belief that doing so is contrary to their religious beliefs (or that they are supporting a behavior that is considered bad in their religion), then is it not clearly illegal?\n \n The grey area is of course if they lie and say it's not religion, it's just \"ethics\", or \"whim\". In that case it may not be illegal, but if I got that in writing, that my employee was refusing to take customers based on their own person ethics or on a whim, it makes it easy to fire them since it's already established that they are being fired for reasons other than illegal reasons (race/religion/color, etc.)\n \n Up to the courts I suppose. Personally I would feel discriminated against, and \"morality\" is easily linked to religion (especially in these cases). If I were discriminated against on religious grounds I'd feel I have a pretty good case (not necessarily a good chance of winning in this christian/ignorant nation).\n \n -Mach", 
   {}, 
   151142, 
   null, 
   1122752400.0
  ], 
  [
   151924, 
   null, 
   "daewoo", 
   "Is this not illegal?\n \n Both federal and state laws prohibit businesses from denying public accommodation to citizens on the basis of race, color, religion or national original. The Federal Civil Rights Act guarantees all people the right to \"full and equal enjoyment of the goods, services, facilities, privileges, advantages, and accommodations of any place of public accommodation, without discrimination or segregation on the ground of race, color, religion, or national origin.\"  \n \n If the reason a pharmacy kook is refusing service based on their belief that doing so is contrary to their religious beliefs (or that they are supporting a behavior that is considered bad in their religion), then is it not clearly illegal?\n\n \n No, and your classification here is rediculous. This is not a matter of refusing to serve sombody based on their religon. This is about refusing to carry and or sell a specific product AT ALL. Wal Mart does not carry playboy. tjhat is their right. You should not have the rigth to sue them and force them to carry playboy. If a particular pharmacist in a particular company is uwilling to dispense certain medicaitos, that is betweeen the pharmacy and their employee (though witht he shortage of pharmacists, I seriosuly doubt any pharmacy is going to do anything about it). \n \n \nThe grey area is of course if they lie and say it's not religion, it's just \"ethics\", or \"whim\". In that case it may not be illegal, but if I got that in writing, that my employee was refusing to take customers based on their own person ethics or on a whim, it makes it easy to fire them since it's already established that they are being fired for reasons other than illegal reasons (race/religion/color, etc.)\n \n\n \n It doesn't matter whether it is religous or not. The odds of anyboy being fired over such a thing are slim to none. Morning after pills can not possibly make up eough of any given pharmacys revenue to make it worth the expense of replacing a skilled employee. \n \n \nUp to the courts I suppose. Personally I would feel discriminated against, and \"morality\" is easily linked to religion (especially in these cases). If I were discriminated against on religious grounds I'd feel I have a pretty good case (not necessarily a good chance of winning in this christian/ignorant nation).\n\n \n Maybe you need to take a hard look at where your rights start infringing on the rights of others. A pretty good case? Dream on. Sure, you have the rigth to take the morning after pill. you do not have the right to force another individual to sell you that pill, any mroe than you have the right to walk into your local ford dealer and demand that they provide your with a chevy. Its just not the way the world works. People can go to another pharmacy or, not. It really does ntoy matter. Retail establichments are able to decide fro themselves what they carry, the governemtn has no place in such decisions. If they decide not to carry the pill, or the pharmacist simply decides they are not going to dispense it, that is their right. It is entirely an issue between employers and their employees and witht he The American Pharmacists Associations policy that allows pharmacists to refuse to fill presciptions on moral grounds, it is hardly an issue there, either.\n \n \n \n \n \nIf the pharmacist is an employee then it's a company issue as Big Orn said although you could sue the company. If no other pharmacy is available and the pharmacist owns the pharmacy I'd say sue him/her and buy online. Those Canadians will sell you anything.\n\n \n Just out of curiosity, what do you feel you could sue the company for? Descrimination? Could I sue Wal Mart or Dillons for not carrying a line of adult movies and sex toys? After all, I have a right to own adult movies and sex toys. Doesn't that mean that Wal Mart automatically has the responsibillity to provide those goods? After all, they are the biggest retailer in my area.", 
   {}, 
   151874, 
   null, 
   1122771300.0
  ], 
  [
   151935, 
   null, 
   "jitobear", 
   "What is even more upsetting is that some pharmacists are refusing to despense dirth control pills or dispense them to some people (i.e. single women).\n \n This is tyrannical action. The imposition of their moral code upon another person. If it is legal and the customer has a prescription that should be where it ends. Nobody in this country has a right to impose their faith and right wing fundies are up to it big time these days. Christian fundamentalism is no less dangerous than Islam fundamentalism. Stick to the laws of the land - anything outside of that is unconstitutional by my book.\n \n How dare some pharmacist refuse me the pill because it is against his/her religion??!! How dare he/she think they have that right? Do they not appreciate their freedom? - or do they think only people like them should have it?\n \n Bottom line - this ticks me off.", 
   {}, 
   151924, 
   null, 
   1122772380.0
  ], 
  [
   151940, 
   null, 
   "OccamsRazor", 
   "Just out of curiosity, what do you feel you could sue the company for? Descrimination? Could I sue Wal Mart or Dillons for not carrying a line of adult movies and sex toys? After all, I have a right to own adult movies and sex toys. Doesn't that mean that Wal Mart automatically has the responsibillity to provide those goods? After all, they are the biggest retailer in my area.\n\n \n I wonder where they would put them in store. The less sexually liberated customers might get a shock when they visit the electrical goods department emoticon_xangel", 
   {}, 
   151924, 
   null, 
   1122773160.0
  ], 
  [
   151944, 
   null, 
   "daewoo", 
   "What is even more upsetting is that some pharmacists are refusing to despense dirth control pills or dispense them to some people (i.e. single women).\n \n This is tyrannical action. The imposition of their moral code upon another person. If it is legal and the customer has a prescription that should be where it ends. Nobody in this country has a right to impose their faith and right wing fundies are up to it big time these days. Christian fundamentalism is no less dangerous than Islam fundamentalism. Stick to the laws of the land - anything outside of that is unconstitutional by my book.\n\n \n Imposition of their moral code upon another person? You seem to have that backwards. Refusing to provide a good or service based on your moral code is not imposing it on anybody else. You are more than welcome to go to another pharmacy and have your prescription filled. Nobody is advocating outlawing birth control pills. Forcing a pharmicist to abandon their moral code to provide you with ANYTHING is certainly an abridgement of their rights. \n \n anything outside the las of the land is unconstitutional by your book? THen why would you advocate legislaitng what goods private businesses must stock, or what goods private citizens must dispense? That is so far outside the \"laws of the land\" that it is rediculous. \n \n \nHow dare some pharmacist refuse me the pill because it is against his/her religion??!! How dare he/she think they have that right? Do they not appreciate their freedom? - or do they think only people like them should have it?\n \n\n \n But somehow you feel you have the right to force them to abandon their morals in order to provide you with goods and services that you want? You go on about freedom, but your entire post here is about removing the freedom of individuals and private businesses to conduct business as they see fit. This is not a totalitarian state where we force individuals or businesses to do business against their will. In china, they do. In the Soviet union they did. In Saudi Arabia they do. Here we do not. I have refused to do business in the past with organizations or individuals that I fid objectionable. That is my right. Nobody has the right to force my hand on such things.\n \n Youahve the right to take birth control. You have the right to an abortion. You do NOT have the right to force others to asssits you to either of those ends if they do not wish to do so....and your right to swing your fist ends at another persons nose (just thought IU would toss that last little pearl of wisdom in there).\n \n Freedom. What a joke. Your entire post is about forcing people to do things that do not want to do...under the guise of freedom.", 
   {}, 
   151935, 
   null, 
   1122774300.0
  ], 
  [
   151945, 
   null, 
   "daewoo", 
   "I wonder where they would put them in store. The less sexually liberated customers might get a shock when they visit the electrical goods department emoticon_xangel\n\n \n Right up front, by God. After all, you have the god given right to buy playboys, hustlers, strawberry flavored sex gel, electronically controlled vibrators, and huge purple dildos until your heart is content. No reason that you should have to go all the way to the back of the store to find them. Put the spinning sex machine next tot he nerf footballs. After all, they are all just toys.", 
   {}, 
   151940, 
   null, 
   1122774660.0
  ], 
  [
   151973, 
   null, 
   "jitobear", 
   "Imposition of their moral code upon another person? You seem to have that backwards. Refusing to provide a good or service based on your moral code is not imposing it on anybody else. You are more than welcome to go to another pharmacy and have your prescription filled. Nobody is advocating outlawing birth control pills. Forcing a pharmicist to abandon their moral code to provide you with ANYTHING is certainly an abridgement of their rights. \n \n anything outside the las of the land is unconstitutional by your book? THen why would you advocate legislaitng what goods private businesses must stock, or what goods private citizens must dispense? That is so far outside the \"laws of the land\" that it is rediculous. \n \n \n \n But somehow you feel you have the right to force them to abandon their morals in order to provide you with goods and services that you want? You go on about freedom, but your entire post here is about removing the freedom of individuals and private businesses to conduct business as they see fit. This is not a totalitarian state where we force individuals or businesses to do business against their will. In china, they do. In the Soviet union they did. In Saudi Arabia they do. Here we do not. I have refused to do business in the past with organizations or individuals that I fid objectionable. That is my right. Nobody has the right to force my hand on such things.\n \n Youahve the right to take birth control. You have the right to an abortion. You do NOT have the right to force others to asssits you to either of those ends if they do not wish to do so....and your right to swing your fist ends at another persons nose (just thought IU would toss that last little pearl of wisdom in there).\n \n Freedom. What a joke. Your entire post is about forcing people to do things that do not want to do...under the guise of freedom.\n\n \n Balls I am.\n \n They chose to be pharamcists. A pharmacist fills prescriptions from a physician. It is not the job of the pharmacist to determine whether a patient should take a certian medication. That, frankly, would be none of the pharmacist's damned business.\n \n If the birth control pill is against their moral code - then they have the right to deny or try to deny it to only ONE individual - their sorry XXX self. Other than that they can either shut up and do their job, or find another.\n \n The medical care of women is meddled with enough. This is disgusts me thoroughly. It's like the manager at the furniture store deciding that people under 25 can't own brown leather couches. \n \n It's true - those of us in big cities could flip the ******* the bird and go to another store, but this is truly impacting women in small communities who do not have that option. \n \n There is also debate whether or not it is LEGAL for a pharamacist to deny a prescription based on their own personal belief - something to do with an oath or agreement that comes with the job.\n \n I am sick and tired of the fundies in this country trying to impose their faith wherever they can - via business practice or law. It's out of line in a secular society - and not only that - it isn't even supported by the Bible.\n \n I have said it before - nothing drives me away from churches like the church-going.", 
   {}, 
   151944, 
   null, 
   1122800460.0
  ], 
  [
   151988, 
   null, 
   "daewoo", 
   "They chose to be pharamcists. A pharmacist fills prescriptions from a physician. It is not the job of the pharmacist to determine whether a patient should take a certian medication. That, frankly, would be none of the pharmacist's damned business.\n\n \n And Sam Walton chose to open a chain of retail stores. They chose not to sell porn, or even music with questionable lyrics. \n \n I used to own abusiness that provided prototypes and did some short run manufacturing. Some people wanted things built that I was just not willing to do, so I refused. Thats life, and it is my right to decide what I am and am not willing to produce or sell.\n \n \nThe medical care of women is meddled with enough. This is disgusts me thoroughly. It's like the manager at the furniture store deciding that people under 25 can't own brown leather couches. \n\n \n No, its not. It is more like the owner of a furniture store deciding \"brown couches are just ugly and I am not going to sell them\".\n \n \nIt's true - those of us in big cities could flip the ******* the bird and go to another store, but this is truly impacting women in small communities who do not have that option. \n\n \n And exactly how many communities do you know of that only have one pharmacy? H0ow many of those do not have another pharmacy withing 30 miles?\n \n \nThere is also debate whether or not it is LEGAL for a pharamacist to deny a prescription based on their own personal belief - something to do with an oath or agreement that comes with the job.\n\n \n Maybe you should have read the article a little more closely. There is no debate about whether it is legal or not. In many states there are laws that allow health care professionals to refuse to provide services or procedures that they are uncomfortable with, and it appears that soon there will be a federal law that covers the same ground.\n \n \nI am sick and tired of the fundies in this country trying to impose their faith wherever they can - via business practice or law. It's out of line in a secular society - and not only that - it isn't even supported by the Bible.\n \n\n \n Funides trying to impose their faith? Maybe, but not in this case. In this case, the pro abortion crowd is trying to impose THEIR beliefs on others, not the other way around. you have the right to an abortion, you do not have the right to force people who do not wish to help you with that abortion do so. You can walk into planned parenthood and demand an abortion and they will be more than happy to assist you. If you go to your family doctor and they are not willing to do the procedure, you do not have the right to demand that they do it. If you want to take the morning after pill, you are more than welcome to do so. You do not have the right to force another individual to sell it to you.", 
   {}, 
   151973, 
   null, 
   1122822600.0
  ], 
  [
   151994, 
   null, 
   "Eddie", 
   "This is one of the reasons why you need to nationalise your pharmacies. Or at least regulate them heavily if you have that irrational fear of anything that smells like socialism. ;)\n \n Oh, and I voted no on the poll. But that`s probably because I don`t consider pharmacies to be private bussineses (nor do I think they should be). Naturally an ordinary private bussines has the right to choose what items they want to carry.", 
   {}, 
   151944, 
   null, 
   1122828180.0
  ], 
  [
   151998, 
   null, 
   "Mach", 
   "No, and your classification here is rediculous. This is not a matter of refusing to serve sombody based on their religon. \n\n \n What's ridiculous is your mis-reading of the argument. I'm both discussing individual pharmacists, and their refusal of service to individuals based on the drug the individual wants, which is already assumed to be dispensed at that pharmacy or chain.\n \n \nOne never knows when an encounter with a pharmacist will be met with a smile or rejection, whether they will have another on-duty pharmacist help the customer or simply be met with stony silence. \n \n \n \nIt doesn't matter whether it is religous or not. The odds of anyboy being fired over such a thing are slim to none. Morning after pills can not possibly make up eough of any given pharmacys revenue to make it worth the expense of replacing a skilled employee. \n \n Doesn't matter? If you're still on your straw man, whatever, if you are referring to an individual pharmacists not servicing based ON religion (Which is the case in many instances), then it's in black and white as against the law.\n \n Regarding firing, if it's not in the press or if it's good/neutral press sure, some minority groups don't get equal treatment under the law, that's nothing new to America. Yet if it's national bad press that builds up, no, businesses distance themsleves from such nonsnese. They have on gay rights/health benefits, they will on drugs. Their business is to serve customers, not to promote religious mumbo jumbo. A few companies may indeed choose to not carry, who cares, that's your straw man. I'm talking about individual pharmacists in the large chains (wal mart, grocery stores, etc.) making a choice based on discrimination, refusal to service an individual.\n \n \nJust out of curiosity, what do you feel you could sue the company for? Descrimination? Could I sue Wal Mart or Dillons for not carrying a line of adult movies and sex toys? After all, I have a right to own adult movies and sex toys. Doesn't that mean that Wal Mart automatically has the responsibillity to provide those goods? After all, they are the biggest retailer in my area.\n\n \n You're off on the wrong argument, clearly stated above is the issue of an indivudal pharmacists refusing service, a service that the pharmacy offers. If the employee picks and chooses who to service, based on religious reasons, it looks in black and white to violate the law, state and federal:\n \n The Federal Civil Rights Act guarantees all people the right to \"full and equal enjoyment of the goods, services, facilities, privileges, advantages, and accommodations of any place of public accommodation, without discrimination or segregation on the ground of race, color, religion, or national origin.\"  \n \n Are you suggesting that's not how the law reads? Or are you still attacking the straw man you set up i.e. forcing a pharmacy to stock specific goods....which is indeed ridiculous, both to bring up and to defend, neither of which I'm doing.\n \n The law will of course be interpereted, as will the actions of indivudals, but it's clear that if discrimination is involved on the basis of religion, it is a legal issue.\n \n -Mach", 
   {}, 
   151924, 
   null, 
   1122829200.0
  ], 
  [
   152000, 
   null, 
   "simone", 
   "Undoubtedly, these pharmacists who refuse birth control to women are the demned same people who would give Viagra and the like to male sex criminals. The superiority of the male sex, ya know, can't deny them any pleasure in life.", 
   {}, 
   151998, 
   null, 
   1122829920.0
  ], 
  [
   152002, 
   null, 
   "Adept", 
   "What is even more upsetting is that some pharmacists are refusing to despense dirth control pills or dispense them to some people (i.e. single women).\n \n This is tyrannical action. The imposition of their moral code upon another person.\n\n \n I disagree. I see it as them exercising their right to behave in any manner they wish, within reason. Even if it does inconvenience people. I would no more mandate that they be required to sell those products against their will any more than I would mandate a woman be required to carry a pregnancy to term against her will.\n \n Sure, if I, as a pharmacist, employed someone who refused to sell the morning after pill, or the birth control pill, I'd sack him. And if I was a customer, I'd make sure to take my business elsewhere.\n \n But I wouldn't attempt to pass a legislation requiring these people to act against their wishes in this way.", 
   {}, 
   151935, 
   null, 
   1122830340.0
  ], 
  [
   152016, 
   null, 
   "jitobear", 
   "I disagree. I see it as them exercising their right to behave in any manner they wish, within reason. Even if it does inconvenience people. I would no more mandate that they be required to sell those products against their will any more than I would mandate a woman be required to carry a pregnancy to term against her will.\n\n \n I could almost agree with that - except it's often not even a matter of not carrying or selling the product as much as refusing to dispense it some people.", 
   {}, 
   152002, 
   null, 
   1122839400.0
  ], 
  [
   152017, 
   null, 
   "daewoo", 
   "What's ridiculous is your mis-reading of the argument. I'm both discussing individual pharmacists, and their refusal of service to individuals based on the drug the individual wants, which is already assumed to be dispensed at that pharmacy or chain.\n\n \n As am I. If the individual pharmacist refuses to dispense a medication that the firm generally carries, there are not going to be any penalties to the pharmacist, and that is their right. If the firm in quesiton wants to take it up with the pharmacist, they may, but I find it highly unlikely. \n \n \n \nDoesn't matter? If you're still on your straw man, whatever, if you are referring to an individual pharmacists not servicing based ON religion (Which is the case in many instances), then it's in black and white as against the law.\n\n \n How so? Are you implying that a catholic pharmacist would dispense the pills in question to another catholic, but not a non catholic? If you do not dispense the pill to anybody, you cannot be acused fo discrimination (duh). \n \n \nRegarding firing, if it's not in the press or if it's good/neutral press sure, some minority groups don't get equal treatment under the law, that's nothing new to America. Yet if it's national bad press that builds up, no, businesses distance themsleves from such nonsnese. They have on gay rights/health benefits, they will on drugs. Their business is to serve customers, not to promote religious mumbo jumbo. A few companies may indeed choose to not carry, who cares, that's your straw man. I'm talking about individual pharmacists in the large chains (wal mart, grocery stores, etc.) making a choice based on discrimination, refusal to service an individual.\n\n \n And I am daying it is not going to make any differece. Again, you sem to be one of those commenting on an article you have not read. Did you miss that many states already have laws allowing pharmacists to refuse to fill prescriptions that find personally objectionable? Pharmacists are hard to come by. People needing medicaiton are all over the place. Have you not learned yet that there is no such thing as bed press? \n \n \nYou're off on the wrong argument, clearly stated above is the issue of an indivudal pharmacists refusing service, a service that the pharmacy offers. If the employee picks and chooses who to service, based on religious reasons, it looks in black and white to violate the law, state and federal\n \n The Federal Civil Rights Act guarantees all people the right to \"full and equal enjoyment of the goods, services, facilities, privileges, advantages, and accommodations of any place of public accommodation, without discrimination or segregation on the ground of race, color, religion, or national origin.\"  \n\n \n Again, we are talking primarily about a pharmacist refusing to issue the pills in question to anybody. IF you simply refuse to issue them at all, discimination is a moot point. \n \n \nAre you suggesting that's not how the law reads? Or are you still attacking the straw man you set up i.e. forcing a pharmacy to stock specific goods....which is indeed ridiculous, both to bring up and to defend, neither of which I'm doing.\n \n\n \n I am saying your interpetation of the law is rediculous and childish. Do people have the right to take birth control or morning after pills? Sure. Do they have the right to force another idnividual to sell them to them? No, they do not. Whether you are forcing the pharmacy to sell certian good, or forcing the individual responsible for dispensing goods to dispense those goods, it is the same thing. \n \n \nThe law will of course be interpereted, as will the actions of indivudals, but it's clear that if discrimination is involved on the basis of religion, it is a legal issue.\n\n \n You have failed to show that religon is even a primary motivator here. Abortion is not a religous issue, it is a moral one. I know many people who are not religous who are uncomfortable with the idea of abortion, myself included. You have also failed to show that any discrimination based on religon is occuring. In order for discrimination to be occuring here, you would essentially have to show that they are selling these pills to some folks, but not others. I am not seeing anything in the article that indicates that is the case. \n \n I think Adam Sonfield says it well:\n \n \"The more health care items you have that people feel are controversial, some people are going to object and want to opt out of being a part of that\" \n \n you seem to be implying that opting out on moral grounds is somehow discriminatory to the perosn seeking the service or product in question, but forcing an individual to abandon their moral views to proviude a service or good they find objectionable is not???", 
   {}, 
   151998, 
   null, 
   1122840360.0
  ], 
  [
   152023, 
   null, 
   "Dzeron", 
   "This is one of the reasons why you need to nationalise your pharmacies. Or at least regulate them heavily if you have that irrational fear of anything that smells like socialism. ;)\n\n \n So it is irrational to fear robbery and slavery now?", 
   {}, 
   151994, 
   null, 
   1122842940.0
  ], 
  [
   152027, 
   null, 
   "Eddie", 
   "So it is irrational to fear robbery and slavery now?\n\n \n No. But it`s irrational to equate robbery and slavery with socialism ;)", 
   {}, 
   152023, 
   null, 
   1122844020.0
  ], 
  [
   152029, 
   null, 
   "Dzeron", 
   "No. But it`s irrational to equate robbery and slavery with socialism ;)\n\n \n Socialism implies insane taxation, which is robbery.\n Socialism also implies forcing people to cooperate against their will, which is slavery.", 
   {}, 
   152027, 
   null, 
   1122845220.0
  ], 
  [
   152032, 
   null, 
   "Eddie", 
   "Socialism implies insane taxation, which is robbery.\n\n \n Taxation is really no more theft than rent.\n \n \nSocialism also implies forcing people to cooperate against their will, which is slavery.\n\n \n Just like any type of legislation or activity protected by legislation, for example property rights, contracts, laws against violence, murder and rape etc, etc", 
   {}, 
   152029, 
   null, 
   1122845760.0
  ], 
  [
   152034, 
   null, 
   "Dzeron", 
   "Taxation is really no more theft than rent.\n\n \n Rent charged for using raw land is also theft.\n \n \n \nJust like any type of legislation or activity protected by legislation, for example property rights, contracts, laws against violence, murder and rape etc, etc\n\n \n Well, I don't know about you, but I see a clear distinction between a law against murder and a law arbitrarily assigning everybody to collective farms.", 
   {}, 
   152032, 
   null, 
   1122846480.0
  ], 
  [
   152036, 
   null, 
   "Eddie", 
   "Rent charged for using raw land is also theft.\n\n \n Because raw land is different from any other resource (and by extension, any material good)?\n \n \nWell, I don't know about you, but I see a clear distinction between a law against murder and a law arbitrarily assigning everybody to collective farms.\n\n \n Distinction, yes. But not regarding forcing people to do something against their will.\n \n Edit:\n \n I also find your definition of slavery rather peculiar... Forcing people to cooperate against their will is rather common occurance. Ecpecially if we consider the option to leave a country, just like you can leave a company, school or social circle...", 
   {}, 
   152034, 
   null, 
   1122846780.0
  ], 
  [
   152125, 
   null, 
   "Steeeeve", 
   "There is also debate whether or not it is LEGAL for a pharamacist to deny a prescription based on their own personal belief - something to do with an oath or agreement that comes with the job.\n \n\n \n So we don't like people breaking oaths huh? Interesting...", 
   {}, 
   152036, 
   null, 
   1122911280.0
  ], 
  [
   152159, 
   null, 
   "jitobear", 
   "So we don't like people breaking oaths huh? Interesting...\n\n \n Like schmike. I simply had heard that there was debate as to whether it is legal. Don't try to read more into my post than what is there because I know EXACTLY what you are implying here.", 
   {}, 
   152125, 
   null, 
   1122926880.0
  ], 
  [
   152203, 
   null, 
   "billsco", 
   "There's a reason why they're called morning after pills. They must be taken as soon as possible. Denying any woman --especially a rural woman--that cushion of time is unthinkable IMO. I mean, she's already had to see a doctor, who has made an educated decision about what's best for the woman. \n \n And, oddly enough, the morning after pill in no way causes an abortion. It prevents a pregnancy, not unlike birth control pills, which they are. \n \n I think there's a huge difference between a pharmacy offering products for sale and the pharmacists refusing to sell them, and a store deciding not to stock certain items.", 
   {}, 
   152159, 
   null, 
   1122942120.0
  ], 
  [
   152296, 
   null, 
   "Steeeeve", 
   "There's a reason why they're called morning after pills. They must be taken as soon as possible. Denying any woman --especially a rural woman--that cushion of time is unthinkable IMO. I mean, she's already had to see a doctor, who has made an educated decision about what's best for the woman. \n \n And, oddly enough, the morning after pill in no way causes an abortion. It prevents a pregnancy, not unlike birth control pills, which they are. \n \n I think there's a huge difference between a pharmacy offering products for sale and the pharmacists refusing to sell them, and a store deciding not to stock certain items.\n\n \n I suggest you re-read things on the morning after pill....It will do three things; prevent the sperm from reaching the egg, stop the release of the egg, of if the egg is fertiziled it will keep it from attaching. The third is an abortion.", 
   {}, 
   152203, 
   null, 
   1122995760.0
  ], 
  [
   152305, 
   null, 
   "Symbiote", 
   "As a strong believer in a woman's right to choose whether to carry a child or not, I must vote yes. Just as a woman should not be enslaved to a fetus, nor should a pharmacist be enslaved to a woman.", 
   {}, 
   152296, 
   null, 
   1122997140.0
  ], 
  [
   152328, 
   null, 
   "simone", 
   "Well, if pharmacists can preach morality shouldn't preachers be allowed to preach medicine and medical therapy?\n \n Actually, I think some of them do, claiming to be able to perform miracles and the like.\n \n Actually, this pharmacist scenario is beginning to sound like a Tom Cruise Scientology rant about the evils of using meds to treat postpartum depression.", 
   {}, 
   152305, 
   null, 
   1123000320.0
  ], 
  [
   152335, 
   null, 
   "billsco", 
   "I suggest you re-read things on the morning after pill....It will do three things; prevent the sperm from reaching the egg, stop the release of the egg, of if the egg is fertiziled it will keep it from attaching. The third is an abortion.\n\n \n Well, if that is your definition of abortion we don't have much to discuss.\n \n Oddly, delaying a woman her right to morning after pills makes option three more likely, doesn't it? Shouldn't we be doing all we can to make sure she receives her legal prescription without delay? What good does it do a pharmacist to glare at her when time is of the essence?\n \n Shouldn't we be truly happy that abortions are down over 10 percent in the last decade in part because morning after pills have become available?", 
   {}, 
   152296, 
   null, 
   1123002720.0
  ], 
  [
   152376, 
   null, 
   "Steeeeve", 
   "Well, if that is your definition of abortion we don't have much to discuss.\n \n Oddly, delaying a woman her right to morning after pills makes option three more likely, doesn't it? Shouldn't we be doing all we can to make sure she receives her legal prescription without delay? What good does it do a pharmacist to glare at her when time is of the essence?\n \n Shouldn't we be truly happy that abortions are down over 10 percent in the last decade in part because morning after pills have become available?\n\n \n yeeeeeah, once again, it is an abortion...and a forced one at that. abortion really just means the ending of a pregnancy, however, for what we use it for it really kinda means the unnatural ending of a pregnancy.\n \n So for those that believe life begins at conception then the morning after pill would be the killing of a human life and thus that person would believe it to be wrong. Whether it is killed 1 day after or 5 months after is irrelevant as it is the same result. So for the pharmacist that believes abortion to be murder, he would not prescribe it.\n \n so abortions aren't down 10 percent...just abortions at clinics are...not only that, I don't believe abortions have gone down that much", 
   {}, 
   152335, 
   null, 
   1123014540.0
  ], 
  [
   152385, 
   null, 
   "daewoo", 
   "As a strong believer in a woman's right to choose whether to carry a child or not, I must vote yes. Just as a woman should not be enslaved to a fetus, nor should a pharmacist be enslaved to a woman.\n\n \n Whoa...so you are saying that pharmacists have rights, too, and that was should do our best to ensure that everybodies rights are protected? Wild concept.", 
   {}, 
   152305, 
   null, 
   1123015740.0
  ], 
  [
   152386, 
   null, 
   "billsco", 
   "yeeeeeah, once again, it is an abortion...and a forced one at that. abortion really just means the ending of a pregnancy, however, for what we use it for it really kinda means the unnatural ending of a pregnancy.\n \n So for those that believe life begins at conception then the morning after pill would be the killing of a human life and thus that person would believe it to be wrong. Whether it is killed 1 day after or 5 months after is irrelevant as it is the same result. So for the pharmacist that believes abortion to be murder, he would not prescribe it.\n \n so abortions aren't down 10 percent...just abortions at clinics are...not only that, I don't believe abortions have gone down that much\n\n \n Like I said, we don't have much to discuss, especially since you didn't answer my questions.", 
   {}, 
   152376, 
   null, 
   1123016400.0
  ], 
  [
   152404, 
   null, 
   "Steeeeve", 
   "Whoa...so you are saying that pharmacists have rights, too, and that was should do our best to ensure that everybodies rights are protected? Wild concept.\n\n \n Whoah there, he surely did not say everybody has rights...he only said pharmacists and women. The unborn still has no rights to him emoticon_rolleyes probabaly babies born with handicaps too", 
   {}, 
   152385, 
   null, 
   1123022400.0
  ], 
  [
   152412, 
   null, 
   "Steeeeve", 
   "Like I said, we don't have much to discuss, especially since you didn't answer my questions.\n\n oh they were answered...but if you wish me to rephrase...\n \n \nOddly, delaying a woman her right to morning after pills makes option three more likely, doesn't it?\n No, as they are not options..it does them all. Either way, since the pharamcist doesn't know, it still might be an abortion.\n \n \nShouldn't we be doing all we can to make sure she receives her legal prescription without delay?\n No, once again, if it kills a person then that kinda defeats the purpose of a pharmacists (assuming the pharamacist is pro-life)\n \n \nWhat good does it do a pharmacist to glare at her when time is of the essence?\n \n What's done is done...only thing the pharmacist can do is have a chance at killing a human. \n \n You seem to be missing the point with all of these. The pharamicists that don't believe in the morning after pill think it might give the women an abortion and thus don't want to take the chance of being morally responsible for the death of another. Same reason Wal-Mart doesn't sell certain CDs and Magazines..they don't want to be a part of that.\n \n \nShouldn't we be truly happy that abortions are down over 10 percent in the last decade in part because morning after pills have become available?\n Already answered.", 
   {}, 
   152386, 
   null, 
   1123022760.0
  ], 
  [
   152414, 
   null, 
   "Michele", 
   "A pharmacist's job is to dispense medicine in response to a legal perscription, period. A good one will note any interference of one medication with another and notify the physician.\n \n He is not supposed to judge medications. Or the patient/doctor relationship.\n \n If he doesn't want to abide by this, he should not be a pharmacist.", 
   {}, 
   152412, 
   null, 
   1123023060.0
  ], 
  [
   152442, 
   null, 
   "Symbiote", 
   "A pharmacist's job is whatever the pharmacist owner employs them to do. It may include cleaning windows, restocking shelves, checking for biker gangs purchasing methamphetamine precursors and refusing to sell morning after pills, as well as dispensing medicines.\n \n If he isn't doing the job he is supposed to be doing, that is the pharmacy owners' business, not the government's.", 
   {}, 
   152414, 
   null, 
   1123029480.0
  ], 
  [
   152508, 
   null, 
   "Eddie", 
   "@ Symbiote\n \n But isn`t pharmacies allready based on privilege? I mean, not everyone is allowed to sell prescripted drugs, are they? And if it is a privilege, why shouldn`t the government require them to serve all and sell everything availiable?\n \n And I know that you would probably much rather do away with the whole privilge-thing and allow everyone to sell the drugs, but if we assume that the current system continues, don`t you think that protected businesses also should be prepared to be subjected to rules or regulations?", 
   {}, 
   152442, 
   null, 
   1123064640.0
  ], 
  [
   152515, 
   null, 
   "Symbiote", 
   "I don't believe more regulation is justified by existing regulation, no. From a utilitarian perspective we may, or may not, as the case may be, have expectations about this improving manners, from my perspective it is better to consider the old adage, \"two wrongs don't make a right\".\n \n Though the privilege (which could alternately be described as a restriction, rather than privilege, on pharmaceutical sales in general) is lamentable, it is neither fixed by nor justifies further restrictions on pharmacies. Equally well it would not justify a law prohibiting sales of morning after pills.", 
   {}, 
   152508, 
   null, 
   1123068720.0
  ], 
  [
   152548, 
   null, 
   "billsco", 
   "\n You seem to be missing the point with all of these. The pharamicists that don't believe in the morning after pill think it might give the women an abortion and thus don't want to take the chance of being morally responsible for the death of another. Same reason Wal-Mart doesn't sell certain CDs and Magazines..they don't want to be a part of that.\n \n \n\n \n It's you who's missing the point--two of them.\n \n By witholding a legal prescription from a woman, a pharmacist is greatly increasing the chance that the woman does indeed become pregnant, with the remedy becoming a clinical abortion. All his high and mighty \"principles\" are accomplishing is to increase the number of abortions needed. \n \n Second, Wal-Mart can decline to sell anything, at anytime and anywhere it so wishes. I don't know how to make that any clearer, but if I need to continue to stress that red herring, I will. If you are an employee your moral responsibility is to not work for the company if you disagree with their policies or with what they sell, not to discriminate against its customers.\n \n What kind of a lily-livered movement is this? Pharmacists pretending to stand firm in their personal convictions, with the only result being an increase in the behavior they claim to be against, but unwilling to do the right, principled thing: quit. It's called grandstanding, and it comes at the expense of a frightened woman in need.", 
   {}, 
   152412, 
   null, 
   1123083060.0
  ], 
  [
   152564, 
   null, 
   "Steeeeve", 
   "If you are an employee your moral responsibility is to not work for the company if you disagree with their policies or with what they sell, not to discriminate against its customers.\n So a pharamicist that is running is own shop would be ok to do it then. Haven't I said this the whole time? If Walgreens says \"you have to sell what the customer wants\" then if the pharamcists doesn't do it then they should be able to fire them for not doing their job. If the Walgreens says \"it is up to the best judgement of the pharamicist\" then I see no problem with him/her refusing to serve. When I was working at a gas station some years ago I could refuse to sell cigarettes to people over 18 if I wanted.\n \n \nBy witholding a legal prescription from a woman, a pharmacist is greatly increasing the chance that the woman does indeed become pregnant, with the remedy becoming a clinical abortion. All his high and mighty \"principles\" are accomplishing is to increase the number of abortions needed. \n It would be the women getting the abortion though and not the pharmacist wouldn't have \"blood\" on his hands. Remember, the morning after pill still can abort and really that is the main point.", 
   {}, 
   152548, 
   null, 
   1123086120.0
  ], 
  [
   152581, 
   null, 
   "billsco", 
   "I hope you didn't sell cigarettes to anyone. You're killing them with that product, with their blood on your hands.\n \n Is there an end to this type of thinking? Better yet, is there a moral hidden in there somewhere?", 
   {}, 
   152564, 
   null, 
   1123088640.0
  ], 
  [
   152587, 
   null, 
   "Steeeeve", 
   "I hope you didn't sell cigarettes to anyone. You're killing them with that product, with their blood on your hands.\n \n Is there an end to this type of thinking? Better yet, is there a moral hidden in there somewhere?\n\n \n Yeha, the thinking is correct when you use it in a rational manner. Seriously, read about strawman arguements and get back to me.\n \n Selling cigarettes to someone is not the same as selling a product to someone so they can possibably kill someone. Not only that, I don't think smoking is \"wrong\". One can smoke if they want to, however, if it effects me then it is wrong.", 
   {}, 
   152581, 
   null, 
   1123090140.0
  ], 
  [
   153495, 
   null, 
   "billsco", 
   " So a pharamicist that is running is own shop would be ok to do it then. Haven't I said this the whole time? \n\n \n No. \n \n \nYeha, the thinking is correct when you use it in a rational manner. \n \n\n \n I don't know what you mean by 'it'. \n \n \nSelling cigarettes to someone is not the same as selling a product to someone so they can possibably kill someone. \n\n \n I don't understand your position. Are you saying you would, say, never sell a gun to another person because they can possibly kill someone?\n \n This pathetic movement has as its legal defense team the American Center for Law and Justice, which is Pat Robertson's pocket lawyers, bought and paid for. They argue in the case I referred to involving the Illinois governor: \n \n \"\"The Governor's directive continues to cause concern for a growing number of pharmacists who don't believe they should have to put their religious beliefs aside to keep their jobs,\" said Francis J. Manion, Senior Counsel of the ACLJ, which is representing the pharmacists. \"The law is clear: pharmacists should not be punished for adhering to their religious beliefs. A growing number of pharmacists believe the Governor's directive forces them to dispense abortion producing drugs - something that violates their deeply held religious beliefs. We're hopeful that the court will recognize that the Governor's directive is legally flawed and will move to protect the constitutional rights of pro-life pharmacists.\"\n \n Throw reason and concern and charity out the window. The religious right pitbull has got a hold of the jugular. Too bad the only one to feel the teeth is the woman.", 
   {
    "unicode_changes_made": true
   }, 
   152564, 
   null, 
   1123458120.0
  ], 
  [
   153829, 
   null, 
   "Steeeeve", 
   "I would never sell a gun to someone that told me he might kill someone.", 
   {}, 
   153495, 
   null, 
   1123594800.0
  ], 
  [
   153830, 
   null, 
   "Symbiote", 
   "What if he told you he wanted a gun for self-defence and to protect his property?", 
   {}, 
   153829, 
   null, 
   1123594920.0
  ], 
  [
   153834, 
   null, 
   "Steeeeve", 
   "probably would..assuming he passed all the background checks :)", 
   {}, 
   153830, 
   null, 
   1123600500.0
  ], 
  [
   153836, 
   null, 
   "Steeeeve", 
   "I don't see why this is not clear cut...especially for the \"pro-choice\" people...or choice for the women only I guess. The pharmacist shouldn't do anything he doesn't want to do...if this is against company policy then can him. Otherwise, let him/her do what him/her wanna do...it isn't illegal to not sell someone a drug.", 
   {}, 
   153834, 
   null, 
   1123600680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Pharmacists Prescibing Morality", 
  "url": "http://www.4forums.com/political/abortion-debates/6070-pharmacists-prescibing-morality.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 6070, 
  "discussion_files": [
   [
    "23894.html", 
    "http://www.4forums.com/political/abortion-debates/6070-pharmacists-prescibing-morality-print.html"
   ], 
   [
    "23895.html", 
    "http://www.4forums.com/political/abortion-debates/6070-pharmacists-prescibing-morality-4-print.html"
   ], 
   [
    "23896.html", 
    "http://www.4forums.com/political/abortion-debates/6070-pharmacists-prescibing-morality-3-print.html"
   ], 
   [
    "23897.html", 
    "http://www.4forums.com/political/abortion-debates/6070-pharmacists-prescibing-morality-2-print.html"
   ]
  ], 
  "identifier": 6070
 }
]