[
 [
  [
   151273, 
   null, 
   "gnojek", 
   "http://www.cnn.com/2005/WORLD/meast/07/27/iraq.main/index.html\n \n \nGeneral: U.S. could start Iraq pullout in spring\n Depends on political, security progress, commander says\n \n Wednesday, July 27, 2005; Posted: 4:54 p.m. EDT (20:54 GMT)\n \n \n BAGHDAD, Iraq (CNN) -- The top U.S. military commander in Iraq said Wednesday that the U.S. military could begin a substantial troop pullout as early as next spring.\n \n Gen. George Casey, who spoke to reporters during Defense Secretary Donald Rumsfeld's unannounced trip to Iraq, said some conditions would have to be met for the withdrawal to take place.\n \n \"I do believe that if the political process continues to go positively and if the development of the security forces continues to go as it is going, I do believe we'll still be able to take some very substantial reductions after these elections in the spring and summer of next year.\"\n \n Elections in Iraq are scheduled for the end of this year.\n \n Casey said he could not say how many of the approximately 135,000 American troops would be withdrawn.\n \n At the same time, transitional Prime Minister Ibrahim al-Jaafari, who met with Rumsfeld, said it was time for a coordinated plan to transition from the American to the Iraqi military and urged that it be done in a speedy fashion.\n \n Casey said there was no agreement on how many insurgents are battling coalition forces.\n \n \"The level of attacks they've been able to generate has not increased substantially here over what we've seen in the last year,\" Casey said. \"This insurgency is not progressing.\"\n \n Referring to the large-scale attacks mounted in recent weeks and months, Casey said \"what you are seeing is a change in tactics to more violent, more visible attacks against civilians and that is a no-win strategy for the insurgency.\"\n \n Last week, national security adviser Mowaffak al-Rubaie told CNN that he'd be \"very surprised if the coalition forces will not start pulling out by middle of next year.\"\n \n Rubaie said he believed the withdrawing coalition forces would be \"in sizable numbers.\"\n \n Rumsfeld said Iraq needs to be more aggressive in its stance against interference from neighbors such as Syria and Iran, and the borders with those countries should be closed to stem the flow of insurgents into Iraq.\n \n \"They need to be aggressively communicating with their neighbors to see that foreign terrorists stop coming across those borders and that their neighbors do not harbor insurgents and finance insurgents in a way that is destructive of what the Iraqi people are trying to accomplish,\" Rumsfeld said.\n \n Rumsfeld's comments echo those of Iraq's defense minister who criticized Syria on Tuesday for ignoring Iraqi demands \"to stop the infiltration of terrorists.\"\n \n Rumsfeld also encouraged the Iraqi constitution committee to meet its August 15 deadline to come up with a draft of the country's constitution. If the draft is approved by the transitional National Assembly, it will be put before voters in an October 15 referendum.\n \n Rumsfeld's visit coincides with polls that cite declining support for the U.S.-led war in Iraq and a lack of confidence in the United States' ability to help establish a permanent Iraqi government and train Iraqi security forces to defend the country without coalition support.\n \n According to a recent CNN poll, 60 percent of Americans say they don't believe the United States will be able to establish a permanent government in Iraq. In addition, a Pentagon report issued last week said 171,000 Iraqi security forces are now trained and equipped but that only 2,500 are capable of mounting counter-insurgency operations on their own without Coalition Forces help.\n Algeria says 2 diplomats killed\n \n The Algeria government Wednesday said that its two diplomats abducted last week in Iraq were killed by their kidnappers.\n \n Algerian charge d' affaires, Ali Belarouci, and colleague Azzedine Belkadi were seized Thursday in Baghdad's Mansour neighborhood, which is home to a number of Arab embassies.\n \n An Internet statement posted Wednesday said the group al Qaeda in Iraq, the Islamic militant group led by terrorist Abu Musab al-Zarqawi, had killed the diplomats.\n \n The office of Algeria's president said the men \"are considered martyrs because they were killed while they were serving their country as diplomats.\"\n \n Threats to kill the men were posted Tuesday on several Web sites.\n Other developments\n \n # A suicide car bomber attacked an Iraqi army convoy near a hospital in northern Baghdad on Wednesday, killing two civilians and wounding 10 people, including five Iraqi soldiers, police told CNN.\n \n # Gunmen ambushed a car carrying three Trade Ministry employees Wednesday in Baghdad, killing one and wounding the others, police told CNN.\n \n # An improvised explosive device detonated near a combat patrol Wednesday, killing a Task Force Liberty soldier and wounding five others, the U.S. military said. The incident, which took place in Salaheddin province, brings the number of U.S. troops killed in the war to 1,780.\n \n # A mortar round struck a parking lot of a bus terminal in Baghdad on Wednesday, killing a civilian and wounding 20 people. Yarmouk Hospital officials provided the casualty figures and police gave the account of incident, in which 25 cars were damaged.\n \n # A police commando died and four others were wounded Wednesday when a car bomb exploded in the Shurta al-Khamsa section of southwestern Baghdad, according to sources in Yarmouk Hospital.\n \n # Gunmen abducted three Baghdad International Airport employees Wednesday morning in a neighborhood on the western side of the city, police told CNN. Maher Yaseen Jasim, head of the airport's telecommunications department, was seized along with an employee and a driver when three cars with eight gunmen intercepted Jasim's car, police said. The gunmen took a female employee's bag and told her to get out of the car.\n \n CNN's Aneesh Raman, Enes Dulami, Mohammed Tawfeeq and Cal Perry contributed to this report.\n\n \n \n Well, it depends, but we might start to see the end of this thing.\n \n Do you think we can accually start to pull out troops next year?\n What about the bases?\n What about reconstruction?\n \n What do you think?\n \n \n (Alternatively, would you offer 20 cows and 40 goats for a dog? :))\n http://www.cnn.com/2005/WORLD/africa/07/27/clinton.kenya.ap/index.html", 
   {
    "post_info": {
     "post_title": "US pullout to start in spring"
    }
   }, 
   null, 
   null, 
   1122519900.0
  ], 
  [
   151290, 
   null, 
   "Dono", 
   "Yes, I think we will begin to remove troops as stated. I think that Dubya, Rummy and cohorts are seeking some way to put some lipstick on this pig and get the hell out. The framers of Iraq's constitution have stated, \"Islam is the official religion of the state and the main source of legislation. No law that contradicts with its rules can be promulgated\". This is in no way the model put down by U.S authorities who, while living in some dreamworld, sought to impose a western style democracy . The draft constitution also grants the Shiite in An Najaf a \"guiding role\" in recognition of its \"high national and religious symbolism\". It appears that we have sacrificed over 1700 American lives, over 13,000 wounded, billions of dollars to produce another Islamic state. We are supposed to believe that this somehow makes us safer.\n I am amused by \"a Pentagon report issued last week said 171,000 Iraqi security forces are now trained and equipped but that only 2,500 are capable of mounting counter-insurgency operations on their own without Coalition Forces help\". Seems to me that if they are \"trained and equipped\", then they should be ready to do the job. Am I missing something?\n When the troops start the evacuation, I wonder if Dubya will don his flight suit, fly out to an incoming carrier and announce victory again.\n Dono", 
   {}, 
   151273, 
   null, 
   1122523740.0
  ], 
  [
   151293, 
   null, 
   "lord tammerlain", 
   "\n I am amused by \"a Pentagon report issued last week said 171,000 Iraqi security forces are now trained and equipped but that only 2,500 are capable of mounting counter-insurgency operations on their own without Coalition Forces help\". Seems to me that if they are \"trained and equipped\", then they should be ready to do the job. Am I missing something?\n When the troops start the evacuation, I wonder if Dubya will don his flight suit, fly out to an incoming carrier and announce victory again.\n Dono\n\n \n \n Quite a bit of disinformation here but as I understand it coming straight from Rummies mouth\n \n 171 000 or so Iraqi security personal are trained and equipped. The 171 000 is going to be quite a bit lower due to \" Ghost \" personel, meaning those that are on the payroll but do not actually exist. Padding ones bankaccount has to happen somehow. These forces are capable of \"normal security operation\" ie Mall or Bank Security guards. \n \n The 2500 number are members of the Iraqi army who are fully capable troops that can mount offensive operations by themselves. Now I understand that they are either Kurdish Peshmerga's or members of the Wolf Bridgade, which includes quite a few of Saddam's old thugs.\n \n None of the more official reports makes much of a mention of the size of the Kurdish Peshmerga's who are only loyal to the Kurdish leadership, of which I understand about 55 000 are members of the Iraqi government forces. There are another 100 000 Peshmerga's or so that are operating only in Kurdish areas..\n \n The Shia have their own official militia's the most notable is the Badr Brigade, which originally numbered 5000 and has increased in size quite dramatically. \n \n \n Overall the only place that it looks like the US may be able to place some permanent military bases is going to be in the Kurdish areas", 
   {}, 
   151290, 
   null, 
   1122524580.0
  ], 
  [
   151307, 
   null, 
   "gamehuis", 
   "The whole US pullout is just a dog and pony show, afterall, the administration has to look good for the 2006 elections.", 
   {}, 
   151293, 
   null, 
   1122542640.0
  ], 
  [
   151329, 
   null, 
   "NeoModernist", 
   "The whole US pullout is just a dog and pony show, afterall, the administration has to look good for the 2006 elections.\n\n term limits.", 
   {}, 
   151307, 
   null, 
   1122554880.0
  ], 
  [
   151331, 
   null, 
   "Symbiote", 
   "2006 elections.", 
   {}, 
   151329, 
   null, 
   1122556560.0
  ], 
  [
   151531, 
   null, 
   "daewoo", 
   "Yes, I think we will begin to remove troops as stated. I think that Dubya, Rummy and cohorts are seeking some way to put some lipstick on this pig and get the hell out. The framers of Iraq's constitution have stated, \"Islam is the official religion of the state and the main source of legislation. No law that contradicts with its rules can be promulgated\". This is in no way the model put down by U.S authorities who, while living in some dreamworld, sought to impose a western style democracy . The draft constitution also grants the Shiite in An Najaf a \"guiding role\" in recognition of its \"high national and religious symbolism\". It appears that we have sacrificed over 1700 American lives, over 13,000 wounded, billions of dollars to produce another Islamic state. We are supposed to believe that this somehow makes us safer.\n \n\n \n \n You underestimate our accomplishment. We did not just produce another islamic state. we destroyed a secular state in the middle east (somewhere that secular states do not just grow on trees) and created an islamic state...An islamic state that just signed a mutual defense treaty with Iran that ensures that Iraq will use military force if needed to ensure that the US does not use bases in Iraq in military campaigns against any other naiton in the ME. \n \n This will make us safer since we have now lost all influence and credibility in the ME, but our military blunder has driven disillusioned young people to terrorist organizations by the busload. Once they carry nukes across the mexican border, since we spent all our money in Iraq and can't afford to secure our borders, and take out the east and west coast, the midwest will be easy to secure since the nuclear wastelands on either side will make any approach more difficult.", 
   {}, 
   151290, 
   null, 
   1122597240.0
  ], 
  [
   151664, 
   null, 
   "georged", 
   "http://www.cnn.com/2005/WORLD/meast/07/27/iraq.main/index.html\n \n \n \n \n Well, it depends, but we might start to see the end of this thing.\n \n Do you think we can accually start to pull out troops next year?\n What about the bases?\n What about reconstruction?\n \n What do you think?\n \n \n (Alternatively, would you offer 20 cows and 40 goats for a dog? :))\n http://www.cnn.com/2005/WORLD/africa/07/27/clinton.kenya.ap/index.html\n\n \n More smoke and mirrors in an attempt to improve plummeting US public approval of our occupation before 2006 US election BS promises begin. In order to greatly reduce the number of US troops in Iraq all or part of these areas would have to be abandoned:\n \n The Green Zone (reminiscent of the Saigon US Embassy compound)\n Oil pipelines and pumping stations in Shia and Kurd sectors\n Port facilities handling oil exports\n Major highways\n Major Airports\n Rural reconstruction projects (propaganda value for reconstruction)\n Most US contractor oil reconstruction\n \n Guarding those areas are the primary function of US troops. I say US because UK troops, 8,500, are also kept away from metropolitan areas to reduce exposure to resistance and politically sensitive casualties. Which area(s) would be abandoned is the real question. \n \n I see pre-election (US) politically driven reductions of maybe 10,000 US troops in the Kurd oil sector primarily because Emperor Bremer handed autonomy to the Kurds, who are building their own substantial forces to retain their oil rights desired as a 'national' resource by the Shia majority. The remainder of the areas US troops guard are intertwined to the extent that if one is abandoned the others will eventually fall to resistance. \n \n To 'partially' occupy Iraq is something only US politicians would dream up in another attempt to refocus the US public. How long Iraq will let us remain in Iraq is a more important consideration.", 
   {}, 
   151273, 
   null, 
   1122650040.0
  ], 
  [
   151829, 
   null, 
   "SymonTemplar", 
   "Depends on how much effort AQ wants to put into causing problems. If the Constitution actually gets drafted and the politcal process keeps going forward, we probably can bring some out. All depends on AQ. There's a large number of Sunnis now saying boycotting the elections was a mistake. How fast or slowly this goes is not something the US was ever in control of. We can choose to throw more resources at one goal or another to speed it up, but the whole thing still depends on the Iraqis and what the AQ elements do.", 
   {}, 
   151664, 
   null, 
   1122707760.0
  ], 
  [
   151865, 
   null, 
   "Alan Ryan", 
   " The framers of Iraq's constitution have stated, \"Islam is the official religion of the state and the main source of legislation. No law that contradicts with its rules can be promulgated\". This is in no way the model put down by U.S authorities who, while living in some dreamworld, sought to impose a western style democracy . The draft constitution also grants the Shiite in An Najaf a \"guiding role\" in recognition of its \"high national and religious symbolism\". \n Dono\n\n \n It's amazing that this outcome does not seem to have been anticipated. There was never any \"guarantee\" that the election of a \"democratic\" government in Iraq would turn out to America's advantage. That was always an unexamined assumption. \n \n The idea of \"nation building\" by means of a US quick fix is utterly preposterous.", 
   {}, 
   151290, 
   null, 
   1122748920.0
  ], 
  [
   151872, 
   null, 
   "daewoo", 
   "Depends on how much effort AQ wants to put into causing problems. If the Constitution actually gets drafted and the politcal process keeps going forward, we probably can bring some out. All depends on AQ. There's a large number of Sunnis now saying boycotting the elections was a mistake. How fast or slowly this goes is not something the US was ever in control of. We can choose to throw more resources at one goal or another to speed it up, but the whole thing still depends on the Iraqis and what the AQ elements do.\n\n \n \n Besiudes the fact that AQ cells in Iraq are responsible for less than 10% of attacks, you might have a point. As is, you are just displaying the inability of Americans to differentiate between enemies and political propoganda.", 
   {}, 
   151829, 
   null, 
   1122752100.0
  ], 
  [
   151873, 
   null, 
   "daewoo", 
   "It's amazing that this outcome does not seem to have been anticipated. There was never any \"guarantee\" that the election of a \"democratic\" government in Iraq would turn out to America's advantage. That was always an unexamined assumption. \n \n The idea of \"nation building\" by means of a US quick fix is utterly preposterous.\n\n \n Obviously a freely elected governmetn would be to our advantage, since our system is so much better than any other out there, and obviosly everybody on the planet recognises this and wishes to duplicate it, right?\n \n \n Btw, I do believe that \"I'll pull out\" may be the oldest lie. I'll believe it when I see it.", 
   {}, 
   151865, 
   null, 
   1122752280.0
  ], 
  [
   151888, 
   null, 
   "SymonTemplar", 
   "Besiudes the fact that AQ cells in Iraq are responsible for less than 10% of attacks, you might have a point. As is, you are just displaying the inability of Americans to differentiate between enemies and political propoganda.\n\n \n Yes, but that is total numbers of attacks, not body count. The large car bombs going off and slaughtering huge numbers of innocent civilains with no regard are being carried out by that very small number of foreign terror cells. The majoirty of the Sunni insurgency are the ones setting off IEDs on coalition convoys and dropping mortar rounds into bases and the green zone. That pretty clearly points out that it is the AQ thugs and sympathizers carrying out the most heinous attacks causing the most problems and disruption to the timetable. The Sunnis are engaging in a more typical insurgency, whearas the AQ nutters are the ones hell bent to just cause Iraq to fall apart.", 
   {}, 
   151872, 
   null, 
   1122756600.0
  ], 
  [
   151926, 
   null, 
   "daewoo", 
   "Yes, but that is total numbers of attacks, not body count. The large car bombs going off and slaughtering huge numbers of innocent civilains with no regard are being carried out by that very small number of foreign terror cells. The majoirty of the Sunni insurgency are the ones setting off IEDs on coalition convoys and dropping mortar rounds into bases and the green zone. That pretty clearly points out that it is the AQ thugs and sympathizers carrying out the most heinous attacks causing the most problems and disruption to the timetable. The Sunnis are engaging in a more typical insurgency, whearas the AQ nutters are the ones hell bent to just cause Iraq to fall apart.\n\n \n Wrong answer. The non AQ insurgents (which you have incorerectly limited to sunni...there are still plenty of Sha militias out there, probably mroe than sunnis accroding to all the numbers I have seen, blowing things up) are using the same tactic as the AQ forces. They are attacking police stattions, setting off ombs in civilain areas targeting collaborators.", 
   {}, 
   151888, 
   null, 
   1122771480.0
  ], 
  [
   151964, 
   null, 
   "SymonTemplar", 
   "Wrong answer. The non AQ insurgents (which you have incorerectly limited to sunni...there are still plenty of Sha militias out there, probably mroe than sunnis accroding to all the numbers I have seen, blowing things up) are using the same tactic as the AQ forces. They are attacking police stattions, setting off ombs in civilain areas targeting collaborators.\n\n \n The areas of instability are Sunni areas. There have been few incidents in Shia areas attributed to Shia for the better part of a year. There are recent reports of Zarqawi meeting with certain leaders of some of the Sunni insurgency groups. There has been an uptick of car bombs being used in the last 3 or 4 months attributed possibly with some Sunni cooperating with AQ. In any case the driving force behind the car bombings is still Zarqawi ala AQ. There have also been indications of other Sunni elements wanting to talk and a movement towards wanting to participate in the next elections.\n \n This is where I get my information and analysis, feel free to post where you get facts that refute what I have read.\n \n http://www.globalsecurity.org/index.html", 
   {}, 
   151926, 
   null, 
   1122789360.0
  ], 
  [
   153026, 
   null, 
   "gnojek", 
   "All I can say, which seems to stem from deawoo's post, is that we live in a country that thinks we need a Department of Defense and a separate department for Homeland Security.", 
   {}, 
   151964, 
   null, 
   1123202640.0
  ], 
  [
   153058, 
   null, 
   "georged", 
   "All I can say, which seems to stem from deawoo's post, is that we live in a country that thinks we need a Department of Defense and a separate department for Homeland Security.\n\n \n Military volunteers at the cannon fodder level are getting scarce enough to require serious and very expensive recruitment. Ever take a close look at say airport security employed/managed by the federal department of transportation with windfall 'Homeland Security' funding? Those people know they have a cush federal job. May whatever supreme being people believe in, or fate, provide them with lots of luck detecting any terrorists not detected by mechanical means. New, extremely well-funded federal bureaucracy that drives GDP by debt with people standing in line to join, recruited by a simple newspaper ad and word-of-mouth. Political savvy when debt isn't a concern and one's national guard is deployed out of the country.", 
   {}, 
   153026, 
   null, 
   1123211880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  US pullout to start in spring", 
  "url": "http://www.4forums.com/political/peace-middle-east/6073-us-pullout-start-spring.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 6073, 
  "discussion_files": [
   [
    "11211.html", 
    "http://www.4forums.com/political/peace-middle-east/6073-us-pullout-start-spring-print.html"
   ], 
   [
    "11212.html", 
    "http://www.4forums.com/political/peace-middle-east/6073-us-pullout-start-spring-2-print.html"
   ]
  ], 
  "identifier": 6073
 }
]