[
 [
  [
   151761, 
   null, 
   "joebrummer", 
   "It appears in the past few weeks the number of anti-gay hate crimes has been going nuts....It appears to be a new trend to burn stuff to the ground with gay slurs......What fuels this? (beside flamables) Who is doing this and why? It makes me sick to read this stuff and hear some posters here say they are isolated incidents.....maybe if I point out some of the ongoing violence I can show that these are daily, weekly incidents....not isolated.....\n \n Slur Painted On Gay Fla. Couple's Home, Then Torched  \n by 365Gay.com Newscenter Staff \n \n Posted: July 29, 2005 3:00 pm ET \n \n exert....This summer has seen a number of arson attacks across the country attributed to homophobia. \n \n Last week a gay club in Brownsville, Texas was gutted by arson. (story) The week before, fire destroyed the only gay club in Fayetteville, Arkansas in what police there also are calling arson. (story) \n \n On July 9, fire damaged a gay-positive church in Middlebrook, Virginia. Police said the arsonist had scrawled a message on the exterior of St. John's Reformed United Church of Christ saying that UCC members were sinners.\n \n The United Church of Christ endorsed a resolution days earlier endorsing same-sex marriage. The resolution was not binding on the denomination's 1.3 million members. (story)\n \n add this to the lesbians beaten with a baseball bats, man beaten to coma in NY, and a fwe I can't recall and I am thinking this is messed up!", 
   {
    "post_info": {
     "post_title": "Hate Crimes Rising in recent 6 weeks"
    }
   }, 
   null, 
   null, 
   1122675660.0
  ], 
  [
   151763, 
   null, 
   "tonybrown74", 
   "It makes me sick to read this stuff and hear some posters here say they are isolated incidents.....maybe if I point out some of the ongoing violence I can show that these are daily, weekly incidents....not isolated.....\n \n \n By their logic, lynchings were \"isolated incidents\" .. emoticon_rolleyes", 
   {}, 
   151761, 
   null, 
   1122676560.0
  ], 
  [
   151764, 
   null, 
   "MrWriteLA", 
   "By their logic, lynchings were \"isolated incidents\" .. emoticon_rolleyes\n You could call virtually any  violent crime a \"rare, isolated incident.\" The OJ killing, the kidnapping of Samantha Runyon, the assassinations of the Kennedy brothers... I didn't see anyone complaining that people made too big a deal about those.\n \n One can be snidely dismissive about anything, if that is one's goal: \n \n \"9/11? Don't make such a big deal about it! How many jets fly into buildings in how many cities each year? 2,000 deaths--out of how many million U.S. citizens? Quit your bellyachin'!\"", 
   {}, 
   151763, 
   null, 
   1122677400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hate Crimes Rising in recent 6 weeks", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6086-hate-crimes-rising-recent-6-weeks.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6086, 
  "discussion_files": [
   [
    "6500.html", 
    "http://www.4forums.com/political/gay-rights-debates/6086-hate-crimes-rising-recent-6-weeks-print.html"
   ]
  ], 
  "identifier": 6086
 }
]