[
 [
  [
   152084, 
   null, 
   "GRINGO", 
   "\"It only has to happen once--you look out your kitchen window and see guys carrying AK-47s--to make you realize there's a new force in your life, a controlling force, and it's not American law.\" [Leo W. Banks, Under Siege]\n \n This is Arizona, USA, east of the Huachuca Mountains. Drug dealers, other criminals, and desperate illegals from Mexico cross American ranches by the thousands daily. And there is no one to stop them.\n \n All of you who thought that George Bush would listen to your pleas to close the border with Mexico and stop illegal immigration-forget about it.\n \n On March 23, 2005, Bush and the leaders of Canada and Mexico met in Waco, Texas and committed their nations to the Security and Prosperity Partnership of North America (SPPNA- a North American Community).This plan, essentially a blueprint designed to benefit big business, is focused on the economies of the three nations and would affect every person in the Community. The task force responsible for this dramatic change in the way we will be governed (without the knowledge or consent of the people) are sponsored by: the Council on Foreign Relations, the Canadian Council of Chief Executives (CEOs), and the Consejo Mexicano de Asuntos Internacionales. This new North American economic and security community is slated to be in place by 2010 and open borders is an important part of it.\n \n Bush Jr. and Bush Senior have been on board with this plan for some time. On August 15, 2001, George Bush made it perfectly clear where he stands on open borders when he addressed the Hispanic Chamber of Commerce in Albuquerque, New Mexico: \"Oh, I know there's some voices who want to wall us off from Mexico\"...\"...it's so importantant for us to tear down barriers and walls that might separate Mexico from the U.S.\"\n \n And his actions have been consistent toward this goal. He has done nothing to stop the millions of illegals coming to America. In fact, he has cut back on the border patrol. He is also trying to push through congress an amnesty bill for millions of illegal Mexicans already here. And he has agreed to include Mexico in a Totalization of Social Security progam that would have the United States paying benefits to many of those same illegals. All he has to do is sign the agreement. Totalization has been endorsed by the CFR Task Force.\n \n The reasons why Bush wants open borders are:easy access to cheap labor for big business and to have more workers paying into the Social Security System in order to support the huge number of baby boomers about to retire. Members of the European Union are also considering the same \"solution\" of importing millions of foreign workers to support their retirees, a formula for the extinction of any nation whose majority population is in decline.\n \n In building a North American Community, the CFR Independent Task Force has put forth a number of \"recommendations\" which seem to have found favor with the three leaders at Waco.\n \n One of the objectives that the task force recommends is that Canada, Mexico, and the United States establish a common security perimeter for North America by 2010.\n \n \"The three governments should commit themselves to the long-term goal of dramatically diminishing the need for the current intensity of the governments' physical control of cross-border traffic, travel, and trade within North America. A long-term goal for a North American border action plan should be joint screening of travelers from third countries at their first point of entry into North America and the ELIMINATION of most controls (open borders) over the temporary movement of these travelers within North America.\" (Sounds like what we have now)\n \n Another objective for 2010 is full labor mobility between Canada and the United States, and later to Mexico, when the wage differentials between it and the other two nations have diminished considerably. Does that mean the wages for American and Canadian workers will be lowered?\n \n The task force mentions the need for government structures to be strengthened. Some suggestions: minister-led working groups, a North American Advisory Council, a North American Inter-Parliamentary Group as well as private groups that meet annually, like the Bilderberg conferences. (Bilderberg is an odd comparison since it has been defined as \"an elite coterie of western thinkers and power brokers,\"... accused of fixing the fate of the world behind closed doors.\") Well, maybe not so odd. \n \n Only five years. So get ready for a new experiment in supra-national government. Vicente Fox, President of Mexico and close amigo of George Bush, had this to say about the big changes on the horizon: \"In recent years a new international system has been developing, oriented toward the establishment of norms and principles of universal jurisdiction (globalization), above national sovereignty, in the areas of what is called the New Agenda... we have to confront... what I dare to call the Anglo-Saxon prejudice against the establishment of supra-national organizations.\" \n \n Is that in the Constitution? \n \n I think of that old Chinese curse: \"May you live in interesting times.\"", 
   {
    "post_info": {
     "post_title": "George Bush Agrees To Open Borders"
    }
   }, 
   null, 
   null, 
   1122878160.0
  ], 
  [
   152107, 
   null, 
   "georged", 
   "\n Another objective for 2010 is full labor mobility between Canada and the United States, and later to Mexico, when the wage differentials between it and the other two nations have diminished considerably. Does that mean the wages for American and Canadian workers will be lowered?\n \n\n \n If we're (US) lucky. Until our general standard of living comes down to levels that offer product COGS competitiveness in a global market and subsequent increases in exports/tax base we're living on borrowed money in a false economy. How long we can perpetuate that game is solely dependent on our creditors need for our consumer markets. The only question is if circumstances will allow a cushioned decline or something very abrupt.", 
   {}, 
   152084, 
   null, 
   1122906600.0
  ], 
  [
   152139, 
   null, 
   "sinjin", 
   "The agricultural sector of the western states could not survive without labor coming from Latin America. Opening the borders poses no threat unless you want a career in yard work for your children. Thinly veiled racism is what most opposition amounts to.", 
   {}, 
   152107, 
   null, 
   1122915120.0
  ], 
  [
   152141, 
   null, 
   "georged", 
   "The agricultural sector of the western states could not survive without labor coming from Latin America. Opening the borders poses no threat unless you want a career in yard work for your children. Thinly veiled racism is what most opposition amounts to.\n\n \n True. The ease of a high school education (or less) offering wages adequate to live in a self-sustaining manner has about disappeared. Our 'poverty' level is higher than the average income of many developed world countries. And this year, for the first time, we've become a net importer of food even with low cost Latin America labor being utilized in the US.", 
   {}, 
   152139, 
   null, 
   1122916020.0
  ], 
  [
   152158, 
   null, 
   "sinjin", 
   "True. The ease of a high school education (or less) offering wages adequate to live in a self-sustaining manner has about disappeared. Our 'poverty' level is higher than the average income of many developed world countries. And this year, for the first time, we've become a net importer of food even with low cost Latin America labor being utilized in the US.\n\n \n Did you get a good look at those vigilantes patroling the border when they were in the news some weeks ago? Beer guts and lamb chop sideboards. Pathetic. Play Freebird!", 
   {}, 
   152141, 
   null, 
   1122926700.0
  ], 
  [
   152163, 
   null, 
   "georged", 
   "Did you get a good look at those vigilantes patroling the border when they were in the news some weeks ago? Beer guts and lamb chop sideboards. Pathetic. Play Freebird!\n\n \n One would assume they're all independently wealthy to volunteer for border patrol? Or is that a 'personal time off' allowance for vigilante duty? A redneck is a redneck.", 
   {}, 
   152158, 
   null, 
   1122927720.0
  ], 
  [
   152284, 
   null, 
   "biccat", 
   "One would assume they're all independently wealthy to volunteer for border patrol? Or is that a 'personal time off' allowance for vigilante duty? A redneck is a redneck.\n\n Hm, isn't it true that these \"vigilantes\" reduced the number of illegals crossing the borders? And didn't they provide food and water to those crossing that needed it? And they didn't actually stop anyone from crossing, they just notified the border crossing agents?\n \n Man, I hate people who operate security cameras, they're just a bunch of rogue vigilante bigots!", 
   {}, 
   152163, 
   null, 
   1122993540.0
  ], 
  [
   153022, 
   null, 
   "gnojek", 
   "The agricultural sector of the western states could not survive without labor coming from Latin America. Opening the borders poses no threat unless you want a career in yard work for your children. Thinly veiled racism is what most opposition amounts to.\n\n Come on!\n \n You're telling me that these huge factory farms owned by ADM etc wouldn't survive without underpaid workers?\n \n Would they survive by practicing \"sustainable\" agriculture or organic farming?\n \n Or are we just supposed to eat hormone pumped, antibiotic laden meat that came from animals crammed together in pools of their own filth in huge CAFO's because otherwise we couldn't afford food? Are we supposed to eat genetically modified (sounds expensive) insecticide laden vegetables because otherwise our agricultural industry would survive at all?", 
   {}, 
   152139, 
   null, 
   1123202100.0
  ], 
  [
   153024, 
   null, 
   "gnojek", 
   "Man, I hate people who operate security cameras, they're just a bunch of rogue vigilante bigots!\n\n Mall security guards are the worst. :)", 
   {}, 
   152284, 
   null, 
   1123202280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  George Bush Agrees To Open Borders", 
  "url": "http://www.4forums.com/political/politics-debates/6096-george-bush-agrees-open-borders.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 6096, 
  "discussion_files": [
   [
    "26313.html", 
    "http://www.4forums.com/political/politics-debates/6096-george-bush-agrees-open-borders-print.html"
   ]
  ], 
  "identifier": 6096
 }
]