[
 [
  [
   152499, 
   null, 
   "Terje", 
   "There have been some bold promises made in the history of religions. The boldest I know of is the one Avalokiteshvara made, it goes way beyond the one made by Jesus (which is also pretty bold) and borders on the insane. Yet, as a buddhist, I find Avalokiteshvara's promise easier to understand and actually believe in. \n \n Avalokiteshvara's promise is that anyone who says his name once will be taken by him at the time of death and brought to \"the Holy Paradise in The West\" from which the path to nirvana is straight and one way. \n \n Now, he never said anything about believing in him (or if he's a she, the sex is a little ambigous), just say the name once and you're in the clear. That means that you can say the name now, once, and then forget about it, pray to Jesus or whomever you like, ask for forgiveness that you for one split second prayed to another God, curse that other God the rest of your life... and if, when you die, the promise made to you by Jesus fails for some reason and if the one made by Avalokiteshvara still stands you're safe anyway. \n \n Avalokiteshvara doesn't mind that you hated him the rest of your life, that you prayed to another all that time, he's above that. You said the name once so you're on the list. Pretty long list by now, but you'll be on it. In fact, it's often described this way in its own tradition \"Pray to everyone else first and if they come to help you then that's good. If they don't, call on me and I'll come!\". To me that sounds more like a higher being talking to us than the idea of God demanding that we believe in Him. \n \n I'm not saying this to be stupid or make fun of it, on a deeper level I can accept this idea. If I explained it you'd think it was really silly so maybe I shouldn't, but let's just say that if you accept a worldview where the individual person does not really exist in the ultimate sense, things like these are easier to accept.", 
   {
    "post_info": {
     "post_title": "The boldest promise in the history of religions"
    }
   }, 
   null, 
   null, 
   1123054680.0
  ], 
  [
   152529, 
   null, 
   "Big Orn", 
   "According to God, we never even have to say His name before we are listed in the Book of Life. Because religion has run roughshod over the Truth for so many years, we assume that we must perform some sort of deed for God to jot down our name - but it's not scriptural.\n \n What would Avalokiteshvara do if a person is born mentally ill and incapable of uttering a single word, much less understanding a word and/or phrase?\n \n Looks like Jesus wins again... :)", 
   {
    "unicode_changes_made": true
   }, 
   152499, 
   null, 
   1123080480.0
  ], 
  [
   152535, 
   null, 
   "trebor", 
   "According to God, we never even have to say His name before we are listed in the Book of Life. Because religion has run roughshod over the Truth for so many years, we assume that we must perform some sort of deed for God to jot down our name - but it's not scriptural.\n \n What would Avalokiteshvara do if a person is born mentally ill and incapable of uttering a single word, much less understanding a word and/or phrase?\n \n Looks like Jesus wins again... :)\n\n \n \n No, it doesn't. Brahma wins.\n \n Just because something is not written down doesn't mean there isn't a oral traditiion. That tradition can be as important or more important than the written one. \n \n That is what the 'sola scriptura' people can not understand, particularly when it refers to either Judaism or Catholism. While I can appreciate the desire by Martin Luthor to break with the RCC, I think the concepts of 'Sola Scriptura' , and 'Sola Fide' that he promoted are very much to the detrement of Christianity. It actually promotes some very bad behaviors.", 
   {
    "unicode_changes_made": true
   }, 
   152529, 
   null, 
   1123081200.0
  ], 
  [
   152554, 
   null, 
   "Big Orn", 
   "No, it doesn't. Brahma wins.\n\n The one in my granpa's pasture usually did... He was huge and swift. When he chased us, one slip on a layer of pine straw would have been the end of it.\n \nJust because something is not written down doesn't mean there isn't a oral traditiion. That tradition can be as important or more important than the written one. \n \n That is what the 'sola scriptura' people can not understand, particularly when it refers to either Judaism or Catholism. While I can appreciate the desire by Martin Luthor to break with the RCC, I think the concepts of 'Sola Scriptura' , and 'Sola Fide' that he promoted are very much to the detrement of Christianity. It actually promotes some very bad behaviors.\n\n Despite all that - actions speak louder than words, whether spoken or written.\n Religion and a cracker: You'll have nothing in your stomach or your heart either one...", 
   {}, 
   152535, 
   null, 
   1123083540.0
  ], 
  [
   152584, 
   null, 
   "Terje", 
   "According to God, we never even have to say His name before we are listed in the Book of Life. \n\n \n Given the Indian perspective on this your question doesn't really matter, does it? If you can't speak in this life maybe you can in your next. Or in your next. Or the one after that. Or maybe... :)\n \n I think it's OK to think the name too. Writing it and even reading it is also OK so if his promise is true you're saved as well. \n \n The trick is the \"once is enough\". And the fact that you don't have to believe in it. That's one big fat promise. Might be a total lie but if it is you haven't wasted more than 3 seconds on it.", 
   {}, 
   152529, 
   null, 
   1123089600.0
  ], 
  [
   152588, 
   null, 
   "Truthsayer", 
   "According to God, we never even have to say His name before we are listed in the Book of Life. Because religion has run roughshod over the Truth for so many years, we assume that we must perform some sort of deed for God to jot down our name - but it's not scriptural.\n \n\n \n Well, actually Big O, it's hard to get around Romans 10:9. Which states:\n \n That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved. 10 For with the heart man believeth unto righteousness; and with the mouth confession is made unto salvation. \n \n A clear-cut scriptual mandate (deed) that anyone who hopes for \"salvation\" must adhere to. It leaves no room for intrepretation. You have to \"profess\" Christ verbally, before men, in order to have your name \"jotted\" down amongst the \"saved.\"\n \n Just thought I'd help ya out here. :p", 
   {
    "unicode_changes_made": true
   }, 
   152529, 
   null, 
   1123090440.0
  ], 
  [
   152608, 
   null, 
   "Big Orn", 
   "Just thought I'd help ya out here. :p\n\n Thanks, Truthsayer, but with friends like you, who needs enemies... :) \n \n If you look at what I posted again, you'll see that I said \"Book of Life\". That's a whole different ballgame.", 
   {}, 
   152588, 
   null, 
   1123092600.0
  ], 
  [
   152637, 
   null, 
   "Eddie", 
   "Hmmm.. I think I`ll give it a go then\n \n Achrovil... no, Avolakek... Avoklake... Avolakak... Bratisla.. no that`s not it... Avalokitshesvara... close? Avalokiteshvark...\n \n Ah, XXXX.. I fold.\n \n \n \n Hehe.. sorry It just had to be done (I actually tried to read the damn name aloud to my brother... it wasn`t all to different from the text above) :p", 
   {}, 
   152608, 
   null, 
   1123096080.0
  ], 
  [
   152648, 
   null, 
   "Truthsayer", 
   "Thanks, Truthsayer, but with friends like you, who needs enemies... :) \n \n If you look at what I posted again, you'll see that I said \"Book of Life\". That's a whole different ballgame.\n\n \n I realize that. Is it your position that the individual \"soul,\" if you will, is predetermined as to whether or not they shall gain access into heaven as registered in the Lambs Book of Life? I never quite understood that viewpoint. I mean, if either you are, or you are not, getting into heaven and there's not much you can do about it either way, whats the point? Why the \"invitation\" in so many protestant churches? Why even consider the passage of Romans 10:9 as a way to accomplish salvation if it's already a done deal?\n \n I know the Jahovah's Witnesses profess to believe that only a certain number of souls are predetermined to access heaven.\n \n I realize we are debating semantics to something that doesn't amount to much more than a fairy tale (and for that, I do feel rather silly I must admit emoticon_xclown ) but enquiring minds want to know. Could you possibly explain to me the \"believers\" viewpoint on this matter? I'd be much obliged.\n \n Peace,\n Truthsayer", 
   {}, 
   152608, 
   null, 
   1123097580.0
  ], 
  [
   152656, 
   null, 
   "Big Orn", 
   "The trick is the \"once is enough\". And the fact that you don't have to believe in it. That's one big fat promise. Might be a total lie but if it is you haven't wasted more than 3 seconds on it.\n\n Where have I heard that before? \"Once saved, always saved...\" It looks like that strange religion isn't the only one trying to corner the market.", 
   {
    "unicode_changes_made": true
   }, 
   152584, 
   null, 
   1123098720.0
  ], 
  [
   152672, 
   null, 
   "Big Orn", 
   "I realize that. Is it your position that the individual \"soul,\" if you will, is predetermined as to whether or not they shall gain access into heaven as registered in the Lambs Book of Life?\n\n No, I didn't say that. I said that we, as humans, never have to say, or do, for that matter, anything to have our names written in the Book of Life. \n I know very well that no one can enter into Heaven accept he comes to Christ. \n \n I think the big misconception is: When did we get our names written in that book, since there's nothing we can do or say to have it done? The Bible says, \"...before the foundation of the world.\"\n That's the reason I replied as I did. All those unborn children that die due to complications, due to danger to the mother, and those that are deliberately murdered don't have to worry about calling a name, reading the scriptures, etc. They're already slated for Life. Also those that are born, but are so retarded that they know nothing but what their deformed brains allow them to know - which is almost nothing in the normal world - have that promise of Life. All children that die so young that they didn't have the time to seek God and know Him - they also are saved.\n \nI realize we are debating semantics to something that doesn't amount to much more than a fairy tale (and for that, I do feel rather silly I must admit emoticon_xclown ) but enquiring minds want to know. Could you possibly explain to me the \"believers\" viewpoint on this matter? I'd be much obliged.\n \n Peace,\n Truthsayer\n\n Can you hear me now? :)", 
   {
    "unicode_changes_made": true
   }, 
   152656, 
   null, 
   1123100700.0
  ], 
  [
   152709, 
   null, 
   "Truthsayer", 
   " \n Can you hear me now? :)\n\n \n Yes. Loud and clear. Thank you for your most informative and civil reply.\n \n I know that The Catholic religion used to teach something called \"limbo\" that all of the aforementioned afflicted and underaged children would go in the event of their untimely death. But I think they did away with this somewhere in the 1940's. It must be nice to be human and yet be able to establish or change \"heavenly\" rules such as they did regarding \"Limbo.\"\n \n I never recall anything mentioning \"limbo\" in the bible. Can someone enlighten me here?", 
   {}, 
   152672, 
   null, 
   1123105260.0
  ], 
  [
   152713, 
   null, 
   "Pravda", 
   "Jesus offers us eternal life after death.\n \n Mohammed offers us eternal life after death with chicks.\n \n Moses was in favour of chicks in this life. \n \n Not really a tough choice eh? emoticon_xclown", 
   {}, 
   152709, 
   null, 
   1123105620.0
  ], 
  [
   152723, 
   null, 
   "sinjin", 
   "Jesus offers us eternal life after death.\n \n Mohammed offers us eternal life after death with chicks.\n \n Moses was in favour of chicks in this life. \n \n Not really a tough choice eh? emoticon_xclown\n\n \n What do Muslim women get after death, a Sun tan?", 
   {}, 
   152713, 
   null, 
   1123106460.0
  ], 
  [
   152744, 
   null, 
   "PoohBear", 
   "[QUOTE=Terje]\n Avalokiteshvara's promise is that anyone who says his name once will be taken by him at the time of and brought to \"the Holy Paradise in The West\" from which the path to nirvana is straight and one way.[QUOTE]\n \n \n now thats if you can say his name ha!", 
   {}, 
   152499, 
   null, 
   1123109280.0
  ], 
  [
   152757, 
   null, 
   "trebor", 
   "What do Muslim women get after death, a Sun tan?\n\n \n No.. to get revirginized 72 times.", 
   {}, 
   152723, 
   null, 
   1123110300.0
  ], 
  [
   152774, 
   null, 
   "Big Orn", 
   "No.. to get revirginized 72 times.\n\n You and sinjin ought to be ashamed. You're not being politcally correct, you know that, right?\n \n Is being revirginized better than being \"pasturized\"? I had a mare that had to be put out to pasture. Never saw a more miserable animal in my life... emoticon_cool \n \n PS - I think there's more to the \"Sun tan\" than either of us see, trebor. emoticon_idea", 
   {}, 
   152757, 
   null, 
   1123111800.0
  ], 
  [
   152782, 
   null, 
   "trebor", 
   "You and sinjin ought to be ashamed. You're not being politcally correct, you know that, right?\n \n\n Yes, I know.\n \n \n\n \n Is being revirginized better than being \"pasturized\"? I had a mare that had to be put out to pasture. Never saw a more miserable animal in my life... emoticon_cool \n \n PS - I think there's more to the \"Sun tan\" than either of us see, trebor. emoticon_idea\n\n \n Depends on what you mean by 'pasturized'. Ask some milk.\n \n Trivia. In the victorian times, some of the younger prostitutes were revirginised (had their hyman sown back on) , because men would pay much more money for a virgin. (I wonder what that says about the culture)", 
   {}, 
   152774, 
   null, 
   1123113420.0
  ], 
  [
   152813, 
   null, 
   "Easyrider", 
   "Photos / Evidence of Chariot Wheels in the Red Sea? \n \n Evidence for the Exodus?\n \n http://jude3.info/view_topic.php?id=661&forum_id=11", 
   {}, 
   152744, 
   null, 
   1123126740.0
  ], 
  [
   152814, 
   null, 
   "Easyrider", 
   "\"For any person interested in the Exodus of Israel in 1400 B.C. from Egypt, Dr. Lennert Moller's book, THE EXODUS CASE is by far the most complete work on this miraculous subject. The most striking single element is the photographic proof of chariots from the 18th Egyptian Dynasty strewn across the 120 foot deep ocean floor between Nuweiba beach on the east coast of the Sinai Peninsula, and stretching 8 miles to the west coast of Saudi Arabia. The chariots are spread evenly across the 8 miles, and include the bones of both humans and horses. Dr. Moller's book takes the serious inquirer step by step from the ancient Egypt of Imhotep (actually Joseph with the coat of many colors), through the 430 years of hebrew slavery, the 10 plagues, the Exodus route, and finally the arrival at the true Mount Sinai in the ancient land of Midian. There are 500 photos on glossy paper (better than National Geographic) including detailed satellite photos of the entire route. How does Dr. Moller know it's the true Mount Sinai? Because every artifact named in the Bible is there...exactly as it should be...as if the events happened a year ago. The top of the mountain is burned with intense heat, melting the solid granite into obsidian. The Gold Calf Altar is at the base of the mountain. The 60 foot tall Split Rock at Horeb is there with compelling evidence of substantial hydraulic shaping inside the split and then down the hill to a dry river bed finally to the ancient dry lake bed that measures two miles by one mile. All of the solid rock along the waterway is deeply eroded by the hydraulic action of the water flow. The Altar of 12 Pillars is there. The markers to hold the people back from the mountain are there. The bush that burned is there. Elijah's cave is there. The graves of the 3,000 men who were put to the sword for worshipping the Gold Calf are there. Once again, if you want a complete study of this miraculous period in Biblical history, Dr. Lennert Moller's, 'The Exodus Case' is your book.\" (book review - Amazon.com)", 
   {}, 
   152813, 
   null, 
   1123126860.0
  ], 
  [
   152816, 
   null, 
   "trebor", 
   "\"For any person interested in the Exodus of Israel in 1400 B.C. from Egypt, Dr. Lennert Moller's book, THE EXODUS CASE is by far the most complete work on this miraculous subject. The most striking single element is the photographic proof of chariots from the 18th Egyptian Dynasty strewn across the 120 foot deep ocean floor between Nuweiba beach on the east coast of the Sinai Peninsula, and stretching 8 miles to the west coast of Saudi Arabia. The chariots are spread evenly across the 8 miles, and include the bones of both humans and horses. Dr. Moller's book takes the serious inquirer step by step from the ancient Egypt of Imhotep (actually Joseph with the coat of many colors), through the 430 years of hebrew slavery, the 10 plagues, the Exodus route, and finally the arrival at the true Mount Sinai in the ancient land of Midian. There are 500 photos on glossy paper (better than National Geographic) including detailed satellite photos of the entire route. How does Dr. Moller know it's the true Mount Sinai? Because every artifact named in the Bible is there...exactly as it should be...as if the events happened a year ago. The top of the mountain is burned with intense heat, melting the solid granite into obsidian. The Gold Calf Altar is at the base of the mountain. The 60 foot tall Split Rock at Horeb is there with compelling evidence of substantial hydraulic shaping inside the split and then down the hill to a dry river bed finally to the ancient dry lake bed that measures two miles by one mile. All of the solid rock along the waterway is deeply eroded by the hydraulic action of the water flow. The Altar of 12 Pillars is there. The markers to hold the people back from the mountain are there. The bush that burned is there. Elijah's cave is there. The graves of the 3,000 men who were put to the sword for worshipping the Gold Calf are there. Once again, if you want a complete study of this miraculous period in Biblical history, Dr. Lennert Moller's, 'The Exodus Case' is your book.\" (book review - Amazon.com)\n\n \n http://www.algonet.se/~arador/rec/exoduscase_2000.html\n \n \n\n Lennart Möller specializes in the health hazards of air pollutants and the DNA damage that they cause. Since 2001 he is a professor of environmental medicine at the department of bioscience at Karolinska Institutet, one of Europe's largest medical universities and Sweden's main centre for medical training and research. Beside his academic duties, Möller is an active member of Evangeliska Fosterlands-Stiftelsen, founded in 1856, a missionary organization within the Church of Sweden. He has edited and authored books on ethics and Gospels exegesis, and recently a volume on Biblical archaeology, The Exodus Case (2000).\n \n This book is the fruit of extensive travels in the Near East and Egypt. Its stated main purpose is to test a hypothesis: that the biblical texts of Genesis 11:27 through Exodus 40:38 are historically correct (pp. 14, 16). A secondary purpose (p. 13) is to evaluate and expand upon the works of the late Ron Wyatt (1933-1999). The work is presented with an explicitly scientific ambition. Möller wishes to subject his hypothesis to an unprejudiced test and encourages the reader to be critical but keep an open mind.\n \n So far, so good, it may appear. But there are disturbing signs already in the book's introduction. First, it is naïve to judge these long texts, preserved through thousands of years of oral and textual tradition, as either true or false in their entirety. Academic historians evaluate discrete factual statements, not entire books at one go. But Möller emphasizes that he is neither a theologian, a historian nor an archaeologist. In fact, he underlines that he does not know what these disciplines believe regarding the questions he takes on. Möller feels that he can thereby offer a fresh perspective.\n \n Then there are the references to Ron Wyatt. If ever there was a true native of Däniken Land, it was him. Wyatt's writings on Biblical archaeology are such extreme flights of fancy that even many creationist debaters dismiss them as wild imaginings.\n \n\n \n More at link : :p", 
   {
    "unicode_changes_made": true
   }, 
   152814, 
   null, 
   1123128420.0
  ], 
  [
   152856, 
   null, 
   "Terje", 
   "now thats if you can say his name ha!\n\n \n Reading it here once will be enough, Im sure of it. The pronounciation isn't important. \n \n You're saved dude, whether you want to or not :)", 
   {}, 
   152744, 
   null, 
   1123141800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The boldest promise in the history of religions", 
  "url": "http://www.4forums.com/political/religion-debates/6112-boldest-promise-history-religions.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 6112, 
  "discussion_files": [
   [
    "26708.html", 
    "http://www.4forums.com/political/religion-debates/6112-boldest-promise-history-religions-print.html"
   ], 
   [
    "26709.html", 
    "http://www.4forums.com/political/religion-debates/6112-boldest-promise-history-religions-2-print.html"
   ]
  ], 
  "identifier": 6112
 }
]