[
 [
  [
   152865, 
   null, 
   "Raastee", 
   "What does \"Gay Liberation\" mean?", 
   {
    "post_info": {
     "post_title": "Gay Liberation?"
    }
   }, 
   null, 
   null, 
   1123156860.0
  ], 
  [
   152868, 
   null, 
   "melsucceeds", 
   "Gay Liberation means to become free from a society which discriminates against someone or people because of their sexual orientation.", 
   {
    "post_info": {
     "post_title": "My Definition"
    }
   }, 
   152865, 
   null, 
   1123160400.0
  ], 
  [
   152871, 
   null, 
   "biccat", 
   "Members of the Gay Liberation Army seek to create an independent, gay-run state on the west coast between San Francisco and Los Angeles. It will be called \"Homotopia\" and it's government would be run a lot like Quebec wants theirs: all the benefits of being part of the larger country, but the ability to make their own laws and regulations. The problem is that there will be no internal population growth.\n \n I suppose melsucceeds has a good definition too. :p", 
   {}, 
   152868, 
   null, 
   1123163880.0
  ], 
  [
   152876, 
   null, 
   "wsm2506", 
   "Members of the Gay Liberation Army seek to create an independent, gay-run state on the west coast between San Francisco and Los Angeles. It will be called \"Homotopia\" and it's government would be run a lot like Quebec wants theirs: all the benefits of being part of the larger country, but the ability to make their own laws and regulations. The problem is that there will be no internal population growth.\n \n I suppose melsucceeds has a good definition too. :p\n\n \n Your attempt at humor eludes me. emoticon_rolleyes", 
   {}, 
   152871, 
   null, 
   1123166460.0
  ], 
  [
   152877, 
   null, 
   "biccat", 
   "Your attempt at humor eludes me. emoticon_rolleyes\n\n That's OK, I didn't write it for you.", 
   {}, 
   152876, 
   null, 
   1123166580.0
  ], 
  [
   152879, 
   null, 
   "joebrummer", 
   "Members of the Gay Liberation Army seek to create an independent, gay-run state on the west coast between San Francisco and Los Angeles. It will be called \"Homotopia\" and it's government would be run a lot like Quebec wants theirs: all the benefits of being part of the larger country, but the ability to make their own laws and regulations. The problem is that there will be no internal population growth.\n \n I suppose melsucceeds has a good definition too. :p\n\n \n \n I get the joke, but it isn't funny. It is very offensive. You should go back to burning swatikas somewhere instead of comedy!", 
   {}, 
   152871, 
   null, 
   1123166940.0
  ], 
  [
   152881, 
   null, 
   "biccat", 
   "I get the joke, but it isn't funny. It is very offensive. You should go back to burning swatikas somewhere instead of comedy!\n\n I wouldn't want to offend you by burning a symbol of your ideology.", 
   {}, 
   152879, 
   null, 
   1123167420.0
  ], 
  [
   152883, 
   null, 
   "joebrummer", 
   "I wouldn't want to offend you by burning a symbol of your ideology.\n\n You have no clue about my idealogy, so don't make comments on what you do not know!", 
   {}, 
   152881, 
   null, 
   1123167540.0
  ], 
  [
   152890, 
   null, 
   "Jaxian", 
   "Well, the joke wasn't the funniest thing in the world, but I did smile after it dawned on me that it was a joke. I don't really see how it was offensive, though maybe confusing to someone who doesn't realize it's a joke.", 
   {}, 
   152883, 
   null, 
   1123170060.0
  ], 
  [
   153032, 
   null, 
   "Raastee", 
   "lol...jokes aside....do u believe in gay liberation...\n should gay people feel they are free....totally\n ???\n and in what sense??????\n e.g. should they be free in the work station????", 
   {}, 
   152890, 
   null, 
   1123204200.0
  ], 
  [
   153044, 
   null, 
   "wsm2506", 
   "lol...jokes aside....do u believe in gay liberation...\n should gay people feel they are free....totally\n ???\n and in what sense??????\n e.g. should they be free in the work station????\n\n \n I think we should be free from discrimination in all legal matters; housing, employment, civil rights. Yes, that includes marriage.", 
   {}, 
   153032, 
   null, 
   1123209540.0
  ], 
  [
   153051, 
   null, 
   "emoreno2292", 
   "Do you even need to ask? We're people too. Why should we have to hide, why should we be discriminated against? We are American citizens; we deserve all of the rights that everyone else has. \n Which is sad that we don't yet; but hopefully we will soon.", 
   {}, 
   153044, 
   null, 
   1123210620.0
  ], 
  [
   153919, 
   null, 
   "Raastee", 
   "Do you even need to ask? We're people too. Why should we have to hide, why should we be discriminated against? We are American citizens; we deserve all of the rights that everyone else has. \n Which is sad that we don't yet; but hopefully we will soon.\n\n \n Well the reason I ask is because I am attempting to see how you guys think on this matter.\n Now...I included work or career in this for a good reason, because a change at work would be a major change in culture...or do you agree?\n But I think a change at work would also be very difficult, because it involves money which many are not willing to give up.", 
   {}, 
   153051, 
   null, 
   1123629420.0
  ], 
  [
   153922, 
   null, 
   "Big Orn", 
   "Well the reason I ask is because I am attempting to see how you guys think on this matter.\n Now...I included work or career in this for a good reason, because a change at work would be a major change in culture...or do you agree?\n But I think a change at work would also be very difficult, because it involves money which many are not willing to give up.\n\n Are gays at your employment not treated as equal? I don't get it...\n \n All of them here are treated just like everyone else...but, they're not extremists at all. Maybe that's what you're referring to?", 
   {}, 
   153919, 
   null, 
   1123629780.0
  ], 
  [
   154063, 
   null, 
   "Raastee", 
   "Are gays at your employment not treated as equal? I don't get it...\n \n All of them here are treated just like everyone else...but, they're not extremists at all. Maybe that's what you're referring to?\n\n \n No gays are not treated equally at work...not at my job. They have zero partner benefits, zero medical benefits, zero educational benefits for their child, zero chances of moving up once they hit a cetian level because the mood is that they cannot be trusted with childern...all gays are child molesters....you know and they have zero benefits in retirement for their partner...that money would go to their other family but his/her partner is not considered a member of that family.", 
   {}, 
   153922, 
   null, 
   1123674840.0
  ], 
  [
   154073, 
   null, 
   "Matthew S", 
   "Gay liberation will be reached when we reach equality in all aspects of life marriage, equal housing, and equal employment. When there are NO laws and NO ONE willing to make them againist us then we will have gay liberation. When the F'ag jokes and name calling has ended then we will have gay liberation. When the violence against us and those precieved to be gay ends then we will have gay liberation. When we get to legally decide who are family is then we will have gay liberation.", 
   {}, 
   154063, 
   null, 
   1123681440.0
  ], 
  [
   154077, 
   null, 
   "jyoshu", 
   "I think as much as possible should be done to ensure gays are given equal opportunity in the workplace. At the same time, gays need to realize that this is as much a behavioral issue as anything. Businesses have to protect their profits because it helps eveyone, including the gay person who works there. I think if a gay person can go to work, do his job, get along with his co-workers and work a normal productive work day without presenting a lot of distractions for everyone because he is gay then that's great, and there shouldn't be a problem. But gay pride as a political movement has no business in the workplace. If an employer was upset that a gay employee was using the workplace for that sort of thing, I can't say I would blame him for being upset. In an ideal situation, no one would be able to really tell who was gay and who was not at first impression with anyone at work.", 
   {}, 
   154073, 
   null, 
   1123686840.0
  ], 
  [
   154082, 
   null, 
   "Jaxian", 
   "I think as much as possible should be done to ensure gays are given equal opportunity in the workplace. At the same time, gays need to realize that this is as much a behavioral issue as anything. Businesses have to protect their profits because it helps eveyone, including the gay person who works there. I think if a gay person can go to work, do his job, get along with his co-workers and work a normal productive work day without presenting a lot of distractions for everyone because he is gay then that's great, and there shouldn't be a problem. But gay pride as a political movement has no business in the workplace. If an employer was upset that a gay employee was using the workplace for that sort of thing, I can't say I would blame him for being upset. In an ideal situation, no one would be able to really tell who was gay and who was not at first impression with anyone at work.\n\n \n Well, who cares whether anyone can tell that you're gay? Why would it be more ideal if you didn't know? I happen to feel that the more you know about your coworkers, the stronger your bond between them, and the more you convey in your first impression, the better someone can understand you.\n \n I also also have gay rights stickers in my cube at work. If anyone complained, I'd take them down, but no one has done that so far. I don't find it harmful or wrong at all though.", 
   {}, 
   154077, 
   null, 
   1123687440.0
  ], 
  [
   154083, 
   null, 
   "jyoshu", 
   "Well, who cares whether anyone can tell that you're gay? Why would it be more ideal if you didn't know? I happen to feel that the more you know about your coworkers, the stronger your bond between them, and the more you convey in your first impression, the better someone can understand you.\n\n \n Why should it be anyone's business what one's romantic and sex life is like?\n \n \nI also also have gay rights stickers in my cube at work.\n\n \n Well, each employer is entitled to his or her own rules of course. But I wouldn't want political ads or stickers of any kind if I were the employer. (Republican, Democrat, gay pride, religious political groups, etc.) That's just me.", 
   {}, 
   154082, 
   null, 
   1123687920.0
  ], 
  [
   154085, 
   null, 
   "Jaxian", 
   "Why should it be anyone's business what one's romantic and sex life is like?\n\n \n Well, it doesn't have to be. But generally, it is. Do you know who your friends are dating? What about your coworkers? I can say that I know the marital and dating status of just about every person in my department. People here talk about their significant others all the time. Even those that I don't work often give away their relationships with pictures of their spouses, girlfriends, or boyfriends in their cubes. It's just part of getting to know someone.\n \n I don't mean that I should be butting my head into other people's business, and relationships are other people's business, but if they make this information known to me, I see no problem with that.\n \n \nWell, each employer is entitled to his or her own rules of course. But I wouldn't want political ads or stickers of any kind if I were the employer. (Republican, Democrat, gay pride, religious political groups, etc.) That's just me.\n\n \n Hmm, interesting. People talk about politics all the time at my work. The people in the cube closest to mine are always complaining about Democrats and making gay jokes. During the elections, some people were even spamming my e-mail here with political links and opinions, which I am amazed was allowed. But I find all of this very interesting. Are you worried that it would divide the workforce?", 
   {}, 
   154083, 
   null, 
   1123689300.0
  ], 
  [
   154108, 
   null, 
   "JustineCredible", 
   "What an amazingly tyrrany jyoshu must work in. Complete oppression, zero expressionism. Truly sad. \n \n No family photos, no personal items whatsoever. \n \n Good thing I don't work with him! \n \n emoticon_frazzled \n \n Personally, I'm all for family photos, personal expression and even political bumperstickers hung by tape in one's cubical. Every company I've ever worked for has alway encouraged their workers to have personal items in their cubicals. It allowes for a more comfortable workspace and a sence of security as well as community within the company. \n Any company that doesn't allow this, also doesn't get my business as a client.", 
   {}, 
   154085, 
   null, 
   1123699740.0
  ], 
  [
   154116, 
   null, 
   "jyoshu", 
   "What an amazingly tyrrany jyoshu must work in. Complete oppression, zero expressionism. Truly sad. \n\n \n Oh please. I don't know an employer around that lets their employers put up political signs and stickers everywhere in their office or cubicle. THAT'S what we're talking about. You must work for a gay rights group if it's allowed where you are.", 
   {}, 
   154108, 
   null, 
   1123701360.0
  ], 
  [
   154118, 
   null, 
   "Jaxian", 
   "Oh please. I don't know an employer around that lets their employers put up political signs and stickers everywhere in their office or cubicle. THAT'S what we're talking about. You must work for a gay rights group if it's allowed where you are.\n\n \n I work for an automotive marketting company, and it is allowed. Well, maybe not everywhere, but in many of places. And I don't have a lot of stickers, just a few small ones tacked to my pinboard along side a pink triangle. If I were to get a boyfriend or girlfriend at some point in the future, I'd probably bring in pictures of us, like most of the other people here.", 
   {}, 
   154116, 
   null, 
   1123702080.0
  ], 
  [
   154125, 
   null, 
   "joebrummer", 
   "Oh please. I don't know an employer around that lets their employers put up political signs and stickers everywhere in their office or cubicle. THAT'S what we're talking about. You must work for a gay rights group if it's allowed where you are.\n\n I work for a Mental Health and substance abuse trade organization. I not only have a sign in my cube that says \"social workers support marriage equality\" Next to that I have pictures of my partner and I cuddling up on the grass at a bbq. We are not a gay rights organization, nor would such things be appropriate in my work. I am still free to have what I want on my desk!", 
   {}, 
   154116, 
   null, 
   1123704540.0
  ], 
  [
   154134, 
   null, 
   "tonybrown74", 
   "I think as much as possible should be done to ensure gays are given equal opportunity in the workplace. At the same time, gays need to realize that this is as much a behavioral issue as anything. Businesses have to protect their profits because it helps eveyone, including the gay person who works there. I think if a gay person can go to work, do his job, get along with his co-workers and work a normal productive work day without presenting a lot of distractions for everyone because he is gay then that's great, and there shouldn't be a problem. But gay pride as a political movement has no business in the workplace. If an employer was upset that a gay employee was using the workplace for that sort of thing, I can't say I would blame him for being upset. In an ideal situation, no one would be able to really tell who was gay and who was not at first impression with anyone at work.\n\n \n Unless I am a whore, I don't understand what my behavior in the workplace has to do with my being a homosexual.\n \n Sleeping with the boss would be unacceptable regardless of sexuality. Slapping a coworker would be unacceptable regadless of sexuality. Theft would be unacceptable regardless of sexuality. Describing graphic details of sexual encounters or even violent actions would be unacceptable behavior regardless of sexuality. Cussing out a coworker would be unacceptable regadless of sexuality.\n \n Etc. ...\n \n Can you point out something specific to homosexuality that would be an issue in the workplace (outside of working as a prostitute, of course)?", 
   {}, 
   154077, 
   null, 
   1123709460.0
  ], 
  [
   154136, 
   null, 
   "Big Orn", 
   "Describing graphic details of sexual encounters or even violent actions would be unacceptable behavior regardless of sexuality. Cussing out a coworker would be unacceptable regadless of sexuality.\n\n But, that's as American as Apple Pie and Baseball.... emoticon_rolleyes \n \n Behavior in the workplace is acceptable as the workers are going to allow it to be. This could change from job to job, whether it be next door or across the country.\n \n Extremism is what you're looking at, right tonybrown74? If so, I think that's what everyone else is describing.\n \n I don't think Gay Liberation means freedom to display that sexuality or the aspects thereof.", 
   {}, 
   154134, 
   null, 
   1123710120.0
  ], 
  [
   154146, 
   null, 
   "tonybrown74", 
   "But, that's as American as Apple Pie and Baseball.... emoticon_rolleyes \n \n Behavior in the workplace is acceptable as the workers are going to allow it to be. This could change from job to job, whether it be next door or across the country.\n \n Extremism is what you're looking at, right tonybrown74? If so, I think that's what everyone else is describing.\n \n I don't think Gay Liberation means freedom to display that sexuality or the aspects thereof.\n\n \n I am not looking at extremism at all. Jyoshu has implied that there is some action/s specific to homosexuality that would be a problem in the workplace.\n \n I just want to know what that/they would be.\n \n And all the examples I have provided are actual improper \"behaviors\" that happen way too frequently. And looking over the list, I still don't see one that is exclusive to homosexuality.\n \n Can you point one out to me?", 
   {}, 
   154136, 
   null, 
   1123711680.0
  ], 
  [
   154155, 
   null, 
   "jyoshu", 
   "I am not looking at extremism at all. Jyoshu has implied that there is some action/s specific to homosexuality that would be a problem in the workplace.\n\n \n Bull. I made it very clear I was talking about political statements in the form of stickers, signs, etc.\n \n Now you're just making things up.", 
   {}, 
   154146, 
   null, 
   1123713000.0
  ], 
  [
   154156, 
   null, 
   "JustineCredible", 
   "I work for a Mental Health and substance abuse trade organization. I not only have a sign in my cube that says \"social workers support marriage equality\" Next to that I have pictures of my partner and I cuddling up on the grass at a bbq. We are not a gay rights organization, nor would such things be appropriate in my work. I am still free to have what I want on my desk!\n\n \n I do collections for a medical billing finance office. Here's the kicker...\n \n It's a Christian Organization!  \n \n I'll bet dollars to donuts jyoshu wasn't expecting that.", 
   {}, 
   154125, 
   null, 
   1123713060.0
  ], 
  [
   154159, 
   null, 
   "jyoshu", 
   "Besides, even if we do get into the area of displaying sexuality in the workplace, I don't know of ONE employer who would want a heterosexual to flaunt his sexuality, so why would he want a gay person to do it? \n \n When it comes to basic pictures of one's family in the office, that's fine. I don't think most people would care about that.", 
   {}, 
   154155, 
   null, 
   1123713180.0
  ], 
  [
   154161, 
   null, 
   "Jaxian", 
   "Besides, even if we do get into the area of displaying sexuality in the workplace, I don't know of ONE employer who would want a heterosexual to flaunt his sexuality, so why would he want a gay person to do it? \n \n When it comes to basic pictures of one's family in the office, that's fine. I don't think most people would care about that.\n\n \n But are any of us talking about flaunting? We were really just saying political stickers, family photos, and maybe casual conversation with friends. Those aren't flaunting, are they?", 
   {}, 
   154159, 
   null, 
   1123713660.0
  ], 
  [
   154166, 
   null, 
   "tonybrown74", 
   "Bull. I made it very clear I was talking about political statements in the form of stickers, signs, etc.\n \n Now you're just making things up.\n\n \n Oh really?\n \n So why did you say this?\n \n \nAt the same time, gays need to realize that this is as much a behavioral issue as anything. \n\n \n So I ask again: what specific behavior related to homosexuality would be an issue in the workplace?", 
   {}, 
   154155, 
   null, 
   1123714320.0
  ], 
  [
   154168, 
   null, 
   "jyoshu", 
   "Oh really?\n \n So why did you say this?\n \n \n \n So I ask again: what specific behavior related to homosexuality would be an issue in the workplace?\n\n \n As I said, displaying political statements in regard to gay rights.", 
   {}, 
   154166, 
   null, 
   1123714500.0
  ], 
  [
   154169, 
   null, 
   "jyoshu", 
   "But are any of us talking about flaunting? We were really just saying political stickers, family photos, and maybe casual conversation with friends. Those aren't flaunting, are they?\n\n \n I'd say political stickers are flaunting, to a degree. Family photos are not, as that's just a matter of displaying those that are close to us. Regarding conversation, I guess it depends on what is said.", 
   {}, 
   154161, 
   null, 
   1123714620.0
  ], 
  [
   154170, 
   null, 
   "wsm2506", 
   "As I said, displaying political statements in regard to gay rights.\n\n \n What about political statements AGAINST gay rights?", 
   {}, 
   154168, 
   null, 
   1123714620.0
  ], 
  [
   154171, 
   null, 
   "jyoshu", 
   "What about political statements AGAINST gay rights?\n\n \n Yes, those would be inappropriate on signs and stickers at work as well. It's still a political statement and it's using company space to adverstise a non-company stance.", 
   {}, 
   154170, 
   null, 
   1123714740.0
  ], 
  [
   154172, 
   null, 
   "tonybrown74", 
   "As I said, displaying political statements in regard to gay rights.\n\n \n Why is that qualifier necessary?", 
   {}, 
   154168, 
   null, 
   1123714860.0
  ], 
  [
   154179, 
   null, 
   "Big Orn", 
   "And all the examples I have provided are actual improper \"behaviors\" that happen way too frequently. And looking over the list, I still don't see one that is exclusive to homosexuality.\n \n Can you point one out to me?\n\n Only the ones where men (and some women - not many, though) stand around and talk about detailed sex acts...and the cussing. Even though, to me, it is unacceptable, it happens everyday.", 
   {}, 
   154146, 
   null, 
   1123717440.0
  ], 
  [
   154185, 
   null, 
   "JustineCredible", 
   "I don't know what ultra tyrranical companies jyoshu has worked for, but NO company I have ever worked for has ever denied it's workers to express political views. \n Unless they are in direct opposition from the views of the company itself, would be the only reason I could suspect a company would have a problem with what it's employees put up in their cubicals. Besides, most companies don't really pay all that much attention to what an employee puts up. \n If they are so hardnosed that they ack like \"Big Brother\" and order an employee to put away his/her personal items for such a reason, I would seriously reconcider who I was working for. \n \n I have three buttons I put up at any \"work place.\" \n One is a Darwin fish\n Another reads: \"What do I look like a Freaking information desk?\" (it's actually quite small) \n and the last one simply says: \"Hate is NOT a Family Value\" \n \n If any employer ever had a problem with these I would question what the problem was before submitting to the request. Not one of them uses objectionable language and none are overtly political. They're more subliminal.\n \n I find creeping vines and beanie baby collections WAY more offencive and Distracting than an ocassional political sticker or button. You can ignore the little buttons, but those vines that grow over a work station...that just sends the message that this worker needs 24hr suicide watch.\n And don't get me started on the Beanie babies...Grow Up already!!!", 
   {}, 
   154172, 
   null, 
   1123717860.0
  ], 
  [
   154223, 
   null, 
   "jyoshu", 
   "Why is that qualifier necessary?\n\n \n I already said in a previous email that it would apply to any political movement. Please try to keep up.", 
   {}, 
   154172, 
   null, 
   1123722660.0
  ], 
  [
   154269, 
   null, 
   "joebrummer", 
   "Besides, even if we do get into the area of displaying sexuality in the workplace, I don't know of ONE employer who would want a heterosexual to flaunt his sexuality, so why would he want a gay person to do it? \n \n When it comes to basic pictures of one's family in the office, that's fine. I don't think most people would care about that.\n\n \n \n It depends what you consider fluanting sexuality....\n \n If a heteroseuxal puts a wedding pic up....it is cute...\n \n If a gay man puts a wedding pic up....it is flaunting their homosexuality! My job may not be like that but I know that would be the case for many others..", 
   {}, 
   154159, 
   null, 
   1123733040.0
  ], 
  [
   154290, 
   null, 
   "Matthew S", 
   "It depends what you consider fluanting sexuality....\n \n If a heteroseuxal puts a wedding pic up....it is cute...\n \n If a gay man puts a wedding pic up....it is flaunting their homosexuality! My job may not be like that but I know that would be the case for many others..\n\n \n \n True so true.\n \n I also have to put up with listening to heteros talking about the products of their sexuality, namely children yet we are not free to freely discuss aspects of gay life. They also need a lot time off due to these products of the heterosexul lifestyle which we gay people and hetero singles are not accorded.", 
   {}, 
   154269, 
   null, 
   1123737420.0
  ], 
  [
   154318, 
   null, 
   "JustineCredible", 
   "True so true.\n \n I also have to put up with listening to heteros talking about the products of their sexuality, namely children yet we are not free to freely discuss aspects of gay life. They also need a lot time off due to these products of the heterosexul lifestyle which we gay people and hetero singles are not accorded.\n\n \n Not true. Heterosexual single parents as well as homosexual parents are usually allowed the exact same \"time off\" to deal with family issues as partnered heterosexual parents. Now you're just going off half-cocked.\n \n It simply isn't true. I never had a problem taking time off to deal with a family issue or child care issue. It didn't matter what my sexuality is/was. I was/am a parent. Plain and simple. \n \n I have always put up photos of my son at EVERY job/workplace. I have NEVER been asked to remove them because I'm a lesbian...one has NOTHING to do with the other! \n \n Or is it that you have conveniently forgotten, simply for the sake of your argument, that in fact MANY homosexuals are INDEED PARENTS? \n Now who's being seperatist and hypocritical? \n \n Stop and think before opening your mouth on that one dear, you don't help yourself or anyone else when you make false blanket statements like that.", 
   {}, 
   154290, 
   null, 
   1123748460.0
  ], 
  [
   154355, 
   null, 
   "Matthew S", 
   "Not true. Heterosexual single parents as well as homosexual parents are usually allowed the exact same \"time off\" to deal with family issues as partnered heterosexual parents. Now you're just going off half-cocked.\n \n It simply isn't true. I never had a problem taking time off to deal with a family issue or child care issue. It didn't matter what my sexuality is/was. I was/am a parent. Plain and simple. \n \n I have always put up photos of my son at EVERY job/workplace. I have NEVER been asked to remove them because I'm a lesbian...one has NOTHING to do with the other! \n \n Or is it that you have conveniently forgotten, simply for the sake of your argument, that in fact MANY homosexuals are INDEED PARENTS? \n Now who's being seperatist and hypocritical? \n \n Stop and think before opening your mouth on that one dear, you don't help yourself or anyone else when you make false blanket statements like that.\n\n \n \n I envy your luck to work in such a place of tolerance and equlity. This is not the case everywhere. I work in a place that it is ok if I am gay but I better not talk about it. I have seen many of my more out spoken gay work peers get terminated, never for being gay or being outspoken. The company just finds an excuse or some obscure company policy, that never gets inforced untill needed. My company is one of the more progressive ones out there. It is true, as you say, there are gay and lesbian couples out there that have children and I am sorry I offened you. Not one gay or lesbian couple I know has chrildren. My comment was to jyoshu who doesn't see the hetrosexual privledge he /she enjoys.\n \n \n Do singles or childless couples get the same equlity when it comes to time off as people with children? If a person with children and a person without children ask for the same time off and they have the same work senority but only one of them can have the time off. Who do you think would get the time off? I would bet it would be the the one with children.", 
   {}, 
   154318, 
   null, 
   1123772100.0
  ], 
  [
   154382, 
   null, 
   "JustineCredible", 
   "I envy your luck to work in such a place of tolerance and equlity. This is not the case everywhere. I work in a place that it is ok if I am gay but I better not talk about it.\n\n \n I never talked about it at my place of employment either. I was speaking about person's with children. In which cirucumstances gays and straights are alike. I never used my being gay as an excuse for getting work done. I find those who do, extremely offencive. Just as I find anyone who uses any racial, religious, sexual, or gender issue as an excuse, offencive. \n \n \n \n I have seen many of my more out spoken gay work peers get terminated, never for being gay or being outspoken. The company just finds an excuse or some obscure company policy, that never gets inforced untill needed. My company is one of the more progressive ones out there.\n\n \n \n And this is where we agree. I don't tollerate fools well. And any company who pulls that kind of XXXX on a supposedly valued employee is a fool. \n \n \n \n It is true, as you say, there are gay and lesbian couples out there that have children and I am sorry I offened you. Not one gay or lesbian couple I know has chrildren.\n\n \n Well get used to us, we're everywhere!\n \n Yes, even gay and lesbian couples/singles are BREEDERS TOO! \n \n \n My comment was to jyoshu who doesn't see the hetrosexual privledge he /she enjoys.\n\n \n Oh don't fool yourself, jyoshu sees it and revels in it. He may protest and say that he doesn't or that he doesn't believe there should be any discrimination at the workplace, until it benefits him. \n Trust me, I 've seen his kind many times over. They're all alike, they look different, speak differently, but inevedibly...they're all the same. \n \n \n \n \nDo singles or childless couples get the same equlity when it comes to time off as people with children? If a person with children and a person without children ask for the same time off and they have the same work senority but only one of them can have the time off. Who do you think would get the time off? I would bet it would be the the one with children.\n\n \n No, and it's federally protected to. It's called FMLA (Family and Medical Leave Act).", 
   {}, 
   154355, 
   null, 
   1123785540.0
  ], 
  [
   154389, 
   null, 
   "jyoshu", 
   "Oh don't fool yourself, jyoshu sees it and revels in it. He may protest and say that he doesn't or that he doesn't believe there should be any discrimination at the workplace, until it benefits him. \n Trust me, I 've seen his kind many times over. They're all alike, they look different, speak differently, but inevedibly...they're all the same. \n\n \n You have such an imagination! But hey, I'll play along!\n \n MWAA HAA HAA HAA!!! [evil villainous laugh] Yes Justine you have discovered us--clones taking over the world!!! The conspiracy is so deep you could never imagine it--why, we're everywhere and nothing can protect you. Even now we're engaging in mental contact scheming how we can replace gay people everywhere with straight clones!!!!!!! [GASP]\n \n LOL!!! :p", 
   {}, 
   154382, 
   null, 
   1123787940.0
  ], 
  [
   154392, 
   null, 
   "Matthew S", 
   "\n \n \n \n No, and it's federally protected to. It's called FMLA (Family and Medical Leave Act).\n\n \n \n I am not talking about FMLA\n \n I am saying that if a person with out children and a person with children ask for a certain day off and they have the same work standing regaurding senority. Only one of them can have the time or day off. The one with children to attend a childrens activity and the to attend say a concert. I am saying it is usally the person with childern that are favored.", 
   {}, 
   154382, 
   null, 
   1123789080.0
  ], 
  [
   154405, 
   null, 
   "tonybrown74", 
   "Only the ones where men (and some women - not many, though) stand around and talk about detailed sex acts...and the cussing. Even though, to me, it is unacceptable, it happens everyday.\n\n \n You still have not answered the question. \n \n What behavior specific to homosexuality would be unacceptable in the workplace?", 
   {}, 
   154179, 
   null, 
   1123792920.0
  ], 
  [
   154407, 
   null, 
   "tonybrown74", 
   "I already said in a previous email that it would apply to any political movement. Please try to keep up.\n\n \n Indeed. You change your stance now that you have been called on your \"error\".\n \n I'm still curious as to why you would have put in the qualifier in the first place.", 
   {}, 
   154223, 
   null, 
   1123793100.0
  ], 
  [
   154408, 
   null, 
   "Jaxian", 
   "Hmm, Jyoshu, if you do not condone political signs, do you condone religious symbols in people's cubes?", 
   {}, 
   154389, 
   null, 
   1123793220.0
  ], 
  [
   154413, 
   null, 
   "jyoshu", 
   "Indeed. You change your stance now that you have been called on your \"error\".\n\n \n No change at all, and no error . . . I said back on post 19 of this thread: \"Well, each employer is entitled to his or her own rules of course. But I wouldn't want political ads or stickers of any kind if I were the employer. (Republican, Democrat, gay pride, religious political groups, etc.) That's just me.", 
   {}, 
   154407, 
   null, 
   1123794900.0
  ], 
  [
   154420, 
   null, 
   "tonybrown74", 
   "No change at all, and no error . . . I said back on post 19 of this thread: \"Well, each employer is entitled to his or her own rules of course. But I wouldn't want political ads or stickers of any kind if I were the employer. (Republican, Democrat, gay pride, religious political groups, etc.) That's just me.\n\n \n I would take this at face value, if this post was in a vacuum. The problem for you, however, is that it was not. I happened to be addressing post http://4forums.com/political/showpost.php?p=154077&postcount=17\n \n I'll even repost it in it's entirety.\n \n \nI think as much as possible should be done to ensure gays are given equal opportunity in the workplace. At the same time, gays need to realize that this is as much a behavioral issue as anything. Businesses have to protect their profits because it helps eveyone, including the gay person who works there. I think if a gay person can go to work, do his job, get along with his co-workers and work a normal productive work day without presenting a lot of distractions for everyone because he is gay then that's great, and there shouldn't be a problem. But gay pride as a political movement has no business in the workplace. If an employer was upset that a gay employee was using the workplace for that sort of thing, I can't say I would blame him for being upset. In an ideal situation, no one would be able to really tell who was gay and who was not at first impression with anyone at work.\n\n \n The way I read that is that there would be a specific action (behavior was your word) that would be unacceptable. If that is not what you meant, then why include this phrase in the first place?", 
   {}, 
   154413, 
   null, 
   1123796700.0
  ], 
  [
   154423, 
   null, 
   "joebrummer", 
   "IN other words, as long as you pretend you aren't gay at work everything should be just dandy! Is that the jist of it...\n \n This also begs the question..what is gay pride. Are you saying if I were a piece of jewlery with the pride colors to work that it is contraversial? I don't get that part...\n \n It is amazing how much jyoshu doesn't get how prejudice he really is........I would guess he saw nothing wrong with what he said....didn't see it for the insulting rubbish that it is...", 
   {}, 
   154420, 
   null, 
   1123797720.0
  ], 
  [
   154454, 
   null, 
   "Raastee", 
   "Hmm, Jyoshu, if you do not condone political signs, do you condone religious symbols in people's cubes?\n\n \n Tolerance is the virtue here...or at least it should be.", 
   {}, 
   154408, 
   null, 
   1123802880.0
  ], 
  [
   154463, 
   null, 
   "jitobear", 
   "Oh please. I don't know an employer around that lets their employers put up political signs and stickers everywhere in their office or cubicle. THAT'S what we're talking about. You must work for a gay rights group if it's allowed where you are.\n\n \n I work for one of the largest financial services companies in the world. We have openly gay employees and leaders, a gay employee network, and we are the largest spnosor of Pride in my city every year.", 
   {}, 
   154116, 
   null, 
   1123803780.0
  ], 
  [
   154524, 
   null, 
   "joebrummer", 
   "I work for one of the largest financial services companies in the world. We have openly gay employees and leaders, a gay employee network, and we are the largest spnosor of Pride in my city every year.\n\n That sounds cool.......You must have a cool job! Not as cool as mine, but I am biased to my own little world....keep in mind my wedding planners are my co-workers....all 3 of em! It is cool to work in a small office......", 
   {}, 
   154463, 
   null, 
   1123815660.0
  ], 
  [
   154544, 
   null, 
   "jyoshu", 
   "I work for one of the largest financial services companies in the world. We have openly gay employees and leaders, a gay employee network, and we are the largest spnosor of Pride in my city every year.\n\n \n Would they let you put up a big \"W\" sign in the door of your office (assuming you have one), or a pro-life message sign? Or are they just one-sided in what they allow with their politics?", 
   {}, 
   154463, 
   null, 
   1123821420.0
  ], 
  [
   154549, 
   null, 
   "jyoshu", 
   "IN other words, as long as you pretend you aren't gay at work everything should be just dandy! Is that the jist of it...\n\n \n Depends on how far you take it. Being \"out\" at work is one thing, flaunting it is something altogether different. Would you want a straight employee putting signs up everywhere about \"straight pride\" or making sure everybody knows he's straight by wearing it on his sleeve? Wouldn't you rather that employee make his priorities on his work time be the priorities of the company? I don't think that's unreasonable. After all, they are the ones paying the employee.\n \n \nIt is amazing how much jyoshu doesn't get how prejudice he really is........I would guess he saw nothing wrong with what he said....didn't see it for the insulting rubbish that it is...\n\n \n I think that because you are so sensitive on this topic you sometimes see prejudice where it doesn't always exist. I'm for FULL non-discrimination in hiring, and that includes hiring gay people. But once someone takes a job, they operate under the rules of their employer. That's the way it works. If an an employer doesn't want you to use the workplace for political advertising, then you shouldn't do it. Otherwise find another employer. That's not prejudice, it's living in the real world.", 
   {}, 
   154423, 
   null, 
   1123822080.0
  ], 
  [
   154561, 
   null, 
   "JustineCredible", 
   "jito and Joe: You guys are really quite lucky. \n \n I happen to do some consulting for an ultra conservative religious run healthcare organization. \n Most of my co-workers know I'm gay, heck my partner works there full-time as a finance manager...but it's simply not talked about. Neither my partner or I get \"domestic partner\" benefits, which sucks because my position at the company doesn't offer benefits of anykind. We don't have a \"gay network\" and we don't sponsor any \"pride events.\" \n As a matter of fact they're so conservative that they actually observe the \"Sabbath.\" \n In the winter everyone in non-patient contact positions must be out of their offices no later than one hour before sunset. \n It's kinda strange that way, but at least their fairly liberal with their \"eto\" or \"pto\" which includes sick-days an vacation time. But it still sucks when they have \"family\" events and my son and I have to actually PAY because we're not legally seen as \"family.\" Sometimes my partner's boss will toss an occassional cookie her way and let her put my son down as her \"dependent\" for some of these events. \n \n But it's still not completely fair. She or I could infact be fired at anytime if anyone at corporate level found out about our relationship. Even though it's not legal to do so in our state, this company is actaully exempt because it's a religious run organization. They can fein the excuse that their religion prohibits them from employing gays and/or lesbians. Granted, I don't think it would happen, but it is always a possibility we are all too aware of.", 
   {}, 
   154549, 
   null, 
   1123827780.0
  ], 
  [
   154601, 
   null, 
   "jyoshu", 
   "Even though it's not legal to do so in our state, this company is actaully exempt because it's a religious run organization. They can fein the excuse that their religion prohibits them from employing gays and/or lesbians. Granted, I don't think it would happen, but it is always a possibility we are all too aware of.\n\n \n If they are exempt, then they aren't a company. They have to be non-profit. They probably ARE religious-affiliated. The bottom line is that if you don't like it badly enough, you don't have to do work for them. They are free to run it as they see fit, and you are free to not work for them.\n \n Re. politics, employers not allowing political work to be done on company time is not something limited to conservatives. It's simply a matter of expecting your employees to not use the workplace for political advertising.", 
   {}, 
   154561, 
   null, 
   1123858800.0
  ], 
  [
   154652, 
   null, 
   "JustineCredible", 
   "\n If they are tax exempt, then they aren't a company. They have to be \n non-profit. They probably ARE religious-affiliated. The bottom line is \n that if you don't like it badly enough, you don't have to do work for \n them. They are free to run it as they see fit, and you are free to not \n work for them.\n\n \n I'm well aware of this, you aren't posting any great revelations here, althought I'm sure you think you are. \n My use of the term \"company\" was quite liberal indeed, but it did NOT call for you to berate me over it. Your reaction simply shows your immaturity, which of course also does not suprise me any. \n \n \nRe. politics, employers not allowing political work to be done on \n company time is not something limited to conservatives.\n\n \n Who ever said anything about \"political work to be done?\" Simply having a political type sticker or sign doesn't quite constitute \"work\" for such cause. It's simply showing something which is of a personal nature. \n If you actually believe the two are the same, well that answers quite a bit about you and your thought processes. Not to mention the transparency of your supposed \"support\" for gay/lesbian employees. \n Yet another item which comes as no suprise to anyone here.\n \n \n It's simply a \n matter of expecting your employees to not use the workplace for political \n advertising.\n\n \n Putting a political sticker up in one's cubicle is a FAR CRY from putting up a political pettition in a common area. Again, you show your bigotry in small enough doses to fool only you.\n \n \n ...and yes, I still have you on ignore, I used the email delivery notification that was sent as my quotes.", 
   {}, 
   154601, 
   null, 
   1123873620.0
  ], 
  [
   154655, 
   null, 
   "jyoshu", 
   "...and yes, I still have you on ignore, I used the email delivery notification that was sent as my quotes.\n\n \n Kinda defeats the purpose, huh?", 
   {}, 
   154652, 
   null, 
   1123874400.0
  ], 
  [
   154713, 
   null, 
   "jitobear", 
   "Would they let you put up a big \"W\" sign in the door of your office (assuming you have one), or a pro-life message sign? Or are they just one-sided in what they allow with their politics?\n\n \n Honestly I have no idea. Political messages are pretty nuetral around here. But they don't consider Pride and the open acceptance of homosexuals a political comment. It is part of my company's very serious committment to diversity. They also offer domestic partner benefits and treat the homosexual community as a market group - and one they try to target.\n \n For the record there are also Latino, Women, Black, Native, Christian, and Jewish employee networks. Any group can form a network - they just have provide proof of interest and a senior sponsor. We frequently win awards as one of the top companies to work at for women, people of color and homosexuals.\n \n Justine - I am lucky.", 
   {}, 
   154544, 
   null, 
   1123887360.0
  ], 
  [
   154733, 
   null, 
   "JustineCredible", 
   "Honestly I have no idea. Political messages are pretty nuetral around here. But they don't consider Pride and the open acceptance of homosexuals a political comment. It is part of my company's very serious committment to diversity. They also offer domestic partner benefits and treat the homosexual community as a market group - and one they try to target.\n \n For the record there are also Latino, Women, Black, Native, Christian, and Jewish employee networks. Any group can form a network - they just have provide proof of interest and a senior sponsor. We frequently win awards as one of the top companies to work at for women, people of color and homosexuals.\n \n Justine - I am lucky.\n\n \n You truly are, and honestly, I'm jealous as anything...GOOD FOR YOU!!! That's Awesome!", 
   {}, 
   154713, 
   null, 
   1123896780.0
  ], 
  [
   154971, 
   null, 
   "wsm2506", 
   "The total hyprocisy of jyoshu posting here, attempting to castigate others for their posting methods is truly astounding.\n \n Let's look at some facts:\n \n Who is the most prolific poster here, day and night, pro or con?\n \n From the amount of time and the times of the day that jyoshu devotes to spreading the anti-gay industry propoganda, one can only assume that:\n \n A) jyoshu is unemployed and has LOTS of free time on his hands. (If so, how can he afford the expense of 24/7/365 Internet connection, month after month after month?)\n \n or\n \n B) jyoshu is employed and using his employer's resources (hardware, software, and Internet connection) to post his personal political / religious beliefs (which is exactly what he is railing against!!!!!!!!!!!!!!).\n \n or\n \n C) jyoshu is a paid shill for the anti-gay industry.\n \n I leave it to the gentle reader to draw their own conclusions. emoticon_xangel \n \n I am also amazed that someone, months ago, claimed to know jyoshu's history on another bulletin board / forum, predicted jyoshu's tactics and approach, and was 100 % accurate with their predictions. Were they physic? emoticon_frazzled", 
   {}, 
   154733, 
   null, 
   1124056680.0
  ], 
  [
   155013, 
   null, 
   "jyoshu", 
   "The total hyprocisy of jyoshu posting here, attempting to castigate others for their posting methods is truly astounding.\n \n Let's look at some facts:\n \n Who is the most prolific poster here, day and night, pro or con?\n \n From the amount of time and the times of the day that jyoshu devotes to spreading the anti-gay industry propoganda, one can only assume that\n\n \n Like I've said elsewhere, I agree I probably post here more than I should, just because I could be doing something more productive. It's just a hobby sort of, as I enjoy debating. I don't see why that's bad. What I wonder is why are you so worried over it? Who cares what anyone's posting numbers are or the times of day they post? I've never looked up anything like that on anyone here and can't imagine why anyone would possibly be obsessed enough to worry about the times of day someone posts.\n \n If you don't like the things I post, then respond to them rather than trying to lie or vilify me. This is a debate forum, after all. Be a man and debate instead of taking a coward's tactic.\n \n \nI am also amazed that someone, months ago, claimed to know jyoshu's history on another bulletin board / forum, predicted jyoshu's tactics and approach, and was 100 % accurate with their predictions.\n\n \n Who? I've never been on another bulletin board other than this one.", 
   {}, 
   154971, 
   null, 
   1124083560.0
  ], 
  [
   155048, 
   null, 
   "wsm2506", 
   "If you don't like the things I post, then respond to them rather than trying to lie  or vilify me. This is a debate forum, after all. Be a man and debate instead of taking a coward's tactic.\n\n If you are going to accuse me of lying, point out what lie I told in the above post.", 
   {}, 
   155013, 
   null, 
   1124121360.0
  ], 
  [
   155626, 
   null, 
   "wsm2506", 
   "I am waiting, jyoshu. You accused me of being a liar in the post above. Now it is time for you to define the lie I supposedly stated.\n \n Typical jyoshu. emoticon_rolleyes Make some wild, outlandish accusation, and then just walk away. Talk about a \"coward's tactic\".", 
   {}, 
   155048, 
   null, 
   1124374800.0
  ], 
  [
   155631, 
   null, 
   "MrWriteLA", 
   "I am waiting, jyoshu. You accused me of being a liar in the post above. Now it is time for you to define the lie I supposedly stated.\n \n Typical jyoshu. emoticon_rolleyes Make some wild, outlandish accusation, and then just walk away. Talk about a \"coward's tactic\".\n Shhh... he's trying to make his embarrassingly high post-per-day average go down...", 
   {}, 
   155626, 
   null, 
   1124378040.0
  ], 
  [
   155647, 
   null, 
   "jyoshu", 
   "Shhh... he's trying to make his embarrassingly high post-per-day average go down...\n\n \n As normal, this poster continues his usual immature chain yanking. I'll post when and as much as I d@mn well please, thank you. At least I can say that many of my posts don't follow one particular poster around these threads pretending to ignore him.\n \n WSM, I'm not responding because your response didn't address the issue of the post. You picked out one thing in the post and think that it gets you off the hook from the issue of my post by not addressing the broader issue, and I don't play that game. The point is that it's ridiculous to make an issue out of someone's posting time and numbers. If you aren't going to address the heart of the post then as far as I'm concerned you are backing down.", 
   {}, 
   155631, 
   null, 
   1124387160.0
  ], 
  [
   155663, 
   null, 
   "wsm2506", 
   "As normal, this poster continues his usual immature chain yanking. I'll post when and as much as I d@mn well please, thank you. At least I can say that many of my posts don't follow one particular poster around these threads pretending to ignore him.\n \n WSM, I'm not responding because your response didn't address the issue of the post. You picked out one thing in the post and think that it gets you off the hook from the issue of my post by not addressing the broader issue, and I don't play that game. The point is that it's ridiculous to make an issue out of someone's posting time and numbers. If you aren't going to address the heart of the post then as far as I'm concerned you are backing down.\n\n \n jyoshu, I personally could care less how much you post. But when you castigate people for expressing political opinions while on company time, I find that highly hypocritical of you, given your own posting habits. THAT was my point!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! And you think that expressing outrage over your misinterprutation of my post gets you off the hook for your hypocrisy? emoticon_rolleyesI didn't accuse you of ANYTHING. I merely presented posibilities. You, on the otherhand, accused me of lying!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", 
   {}, 
   155647, 
   null, 
   1124395080.0
  ], 
  [
   155670, 
   null, 
   "jyoshu", 
   "jyoshu, I personally could care less how much you post. But when you castigate people for expressing political opinions while on company time, I find that highly hypocritical of you, given your own posting habits. THAT was my point!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n \n No, I'm not on anyone's company time but my own.", 
   {}, 
   155663, 
   null, 
   1124399460.0
  ], 
  [
   155679, 
   null, 
   "JustineCredible", 
   "No, I'm not on anyone's company time but my own.\n\n \n Fine, then grow the F* up and quit whining about this. Enough already. I don't really give a rats behind who's time you're on. Just as long as my tax dollars aren't going to support it.", 
   {}, 
   155670, 
   null, 
   1124403180.0
  ], 
  [
   155683, 
   null, 
   "jyoshu", 
   "Fine, then grow the F* up and quit whining about this. Enough already. I don't really give a rats behind who's time you're on\n\n \n What you don't get is that it's not, nor rarely is, about YOU or what YOU think. I'll post about this and anything else all I want. Deal with it.", 
   {}, 
   155679, 
   null, 
   1124404380.0
  ], 
  [
   155772, 
   null, 
   "JustineCredible", 
   "What you don't get is that it's not, nor rarely is, about YOU or what YOU think. I'll post about this and anything else all I want. Deal with it.\n\n \n Temper, temper little j.j.\n \n Did you miss feeding time?", 
   {}, 
   155683, 
   null, 
   1124445600.0
  ], 
  [
   155789, 
   null, 
   "wsm2506", 
   "No, I'm not on anyone's company time but my own.\n\n Then you are unemployed? Or self employed?", 
   {}, 
   155670, 
   null, 
   1124461740.0
  ], 
  [
   155969, 
   null, 
   "wsm2506", 
   "Come on jyoshu!!!!!!!!!!!!!!! You accused me of posting a lie in a public forum. Either point out to us all, the lie I posted or apologize publicly.\n \n You gutless wonder. emoticon_rolleyes", 
   {}, 
   155789, 
   null, 
   1124551800.0
  ], 
  [
   155990, 
   null, 
   "jyoshu", 
   "Come on jyoshu!!!!!!!!!!!!!!! You accused me of posting a lie in a public forum. Either point out to us all, the lie I posted or apologize publicly.\n \n You gutless wonder. emoticon_rolleyes\n\n \n Nah. Like I said I'll discuss with you the issue of the post but I'm not going to waste time on your diversions.", 
   {}, 
   155969, 
   null, 
   1124566560.0
  ], 
  [
   155995, 
   null, 
   "joebrummer", 
   "Nah. Like I said I'll discuss with you the issue of the post but I'm not going to waste time on your diversions.\n\n \n \n jyoshu is incapable of saying those majouc words.....I am sorry, that wasn't the correct thing for me to say....or even a simple..maybe I phrased that wrong....I am sorry.....\n \n I think he is emotionally childish.", 
   {}, 
   155990, 
   null, 
   1124569080.0
  ], 
  [
   156000, 
   null, 
   "JustineCredible", 
   "Nah. Like I said I'll discuss with you the issue of the post but I'm not going to waste time on your diversions.\n\n \n Ah I see, it's one thing when YOU divert a thread, but when anyone else does it suddenly we're held to a higher standard? \n \n You're just full of yourself today I see.", 
   {}, 
   155990, 
   null, 
   1124571960.0
  ], 
  [
   156016, 
   null, 
   "jyoshu", 
   "jyoshu is incapable of saying those majouc words.....I am sorry, that wasn't the correct thing for me to say....or even a simple..maybe I phrased that wrong....I am sorry.....\n\n \n I don't feel there is any reason for apology. WSM didn't want to have to answer the post, and instead centered one thing in the post to the exclusion of the post's issue. If he addresses the issue, we'll move on. The ball's in his court.\n \n \nI think he is emotionally childish.\n\n \n Aw . . . Joe, are you getting your feathers ruffled? :p", 
   {}, 
   155995, 
   null, 
   1124578860.0
  ], 
  [
   156064, 
   null, 
   "JustineCredible", 
   "I don't feel there is any reason for apology. WSM didn't want to have to answer the post, and instead centered one thing in the post to the exclusion of the post's issue. If he addresses the issue, we'll move on. The ball's in his court.\n \n \n \n Aw . . . Joe, are you getting your feathers ruffled? :p\n\n \n If stating the obvious is a sign of having one's \"feathers ruffled.\" \n \n It's quite obvious you feel it's your God given right to say whatever you wish, regardless of truth or feelings of anyone save yourself...but when it's someone else, you hold them to a much higher standard. \n You play both sides of the fence.", 
   {}, 
   156016, 
   null, 
   1124605680.0
  ], 
  [
   156075, 
   null, 
   "joebrummer", 
   "I don't feel there is any reason for apology. WSM didn't want to have to answer the post, and instead centered one thing in the post to the exclusion of the post's issue. If he addresses the issue, we'll move on. The ball's in his court.\n \n \n \n Aw . . . Joe, are you getting your feathers ruffled? :p\n\n I don't have any feathers to ruffle.....", 
   {}, 
   156016, 
   null, 
   1124637180.0
  ], 
  [
   156112, 
   null, 
   "wsm2506", 
   "Nah. Like I said I'll discuss with you the issue of the post but I'm not going to waste time on your diversions.\n\n \n The issue of MY post was, and is, the fact that in previous post in this thread, you attempt to castigate other people for using their employer's time and resources to post personal political / religious beliefs, when, in fact, from the FACTS in evidence, you would seem to be the WORST  offender of that!!!!!!!!!!! \n \n Which \"issue of the post\" are you refering to? I did not even quote you in the post I made!!!!!!!!!!!!!!!!!!!!!!!!!!!! I was merely making a general observation about your character ( or more precisely; lack thereof).\n \n I submit that your response was merely to accuse me of being a liar. You offered no explaination for you hypocritical diatribe against other posters. I ask you again, how did I lie? \n \n Typical jyoshu response; deflect from the real issue at hand and feign being attacked. Poor jyoshu!!!!!!!! emoticon_cry emoticon_cry emoticon_cry\n \n emoticon_rolleyes emoticon_rolleyes \n \n Jyoshu, do you have ANY INTEGRITY AT ALL? (Sorry, that was a retorical question :) )", 
   {}, 
   155990, 
   null, 
   1124669460.0
  ], 
  [
   156899, 
   null, 
   "wsm2506", 
   "I see you refuse to face the real issue, jyoshu. emoticon_xangel", 
   {}, 
   156112, 
   null, 
   1124942040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gay Liberation?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6126-gay-liberation.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6126, 
  "discussion_files": [
   [
    "5058.html", 
    "http://www.4forums.com/political/gay-rights-debates/6126-gay-liberation-print.html"
   ], 
   [
    "5059.html", 
    "http://www.4forums.com/political/gay-rights-debates/6126-gay-liberation-6-print.html"
   ], 
   [
    "5060.html", 
    "http://www.4forums.com/political/gay-rights-debates/6126-gay-liberation-4-print.html"
   ], 
   [
    "5061.html", 
    "http://www.4forums.com/political/gay-rights-debates/6126-gay-liberation-5-print.html"
   ], 
   [
    "5062.html", 
    "http://www.4forums.com/political/gay-rights-debates/6126-gay-liberation-3-print.html"
   ], 
   [
    "5063.html", 
    "http://www.4forums.com/political/gay-rights-debates/6126-gay-liberation-2-print.html"
   ]
  ], 
  "identifier": 6126
 }
]