[
 [
  [
   152912, 
   null, 
   "jim's trucking", 
   "I want to thank all of you who have taken the time and trouble to send\n me your chain letters over the past few years. Yes, thank you, thank\n you, thank you from the bottom of what's left of my heart for making me\n feel safe, secure, blessed, and wealthy.\n \n Because of your concern...I no longer can drink Coca Cola because it can\n remove toilet stains. \n \n I no longer drink anything out of a can because I will get sick from the\n rat feces and urine. \n \n I no longer use Saran wrap in the microwave because it causes cancer. \n \n I no longer check the coin return on pay phones because I could be\n pricked with a needle infected with AIDS. \n \n I no longer use cancer-causing deodorants even though I smell like a\n water buffalo on a hot day \n \n I no longer use margarine because it's one molecule away from being\n plastic. \n \n I no longer go to shopping malls because someone will drug me with a\n perfume sample and rob me. \n \n I no longer receive packages from UPS or FedEx since they are actually\n Al Qaeda in disguise. \n \n I no longer answer the phone because someone will ask me to dial a\n stupid number for which I will get the phone bill from hell with calls\n to Jamai! ca, Uganda, Singapore, and Uzbekistan. \n \n I no longer eat KFC because their chickens are actually horrible mutant\n freaks with no eyes or feathers. \n \n I no longer date the opposite sex because they will take my kidneys and\n leave me taking a nap in a bathtub full of ice. \n \n I no longer buy expensive cookies from Neiman Marcus since I now have\n their recipe. \n \n I no longer worry about my soul because I have 363,214 angels looking\n out for me and St. Theresa's n! ovena has granted my every wish. \n \n Thanks to you, I have learned that God only answers my prayers if I\n forward an email to seven of my friends and make a wish within five\n minutes. (Geez, the BIBLE did not mention it works that way!) \n \n I no longer have any savings because I gave it to a sick girl who is\n about to die in the hospital (for the 1,387,258th time). \n \n I no longer have any money at all, but that will change once I receive\n the $15,000 that Microsoft and AOL are sending me for participating in\n their special e-mail program. \n \n Yes, I want to thank all of you soooooooo much for looking out for me!\n \n \n I will now return the favor. \n \n If you don't send this e-mail to at least 1200 people in the next 60\n seconds, a large bird with diarrhea will XXXX on your head at 5:00 PM\n this afternoon and the fleas of a thousand camels will infest your\n armpits. I know this will occur because it actually happened to a friend\n of a friend of a friend of a friend of a friend of a friend of a friend\n of my next door neighbor's ex-mother-in-law's 8th husband's 2nd cousin's\n 3rd husband's ex-wife's mother's beautician! \n \n \n \n Anonymous", 
   {
    "post_info": {
     "post_title": "Thanks for nothing!"
    }
   }, 
   null, 
   null, 
   1123183020.0
  ], 
  [
   152918, 
   null, 
   "Big Orn", 
   "Shoot! I tried to send to 1200 other people, most of them are members here, and my server shut down.\n \n Thanks, for the post, Jim. I'll send them again here shortly... emoticon_rolleyes", 
   {}, 
   152912, 
   null, 
   1123185240.0
  ], 
  [
   155791, 
   null, 
   "Kuato", 
   "\n \n I no longer use cancer-causing deodorants even though I smell like a\n water buffalo on a hot day \n \n \n\n \n \n :) Me, too.", 
   {}, 
   152912, 
   null, 
   1124461920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Thanks for nothing!", 
  "url": "http://www.4forums.com/political/fun-debates/6127-thanks-nothing.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 6127, 
  "discussion_files": [
   [
    "13625.html", 
    "http://www.4forums.com/political/fun-debates/6127-thanks-nothing-print.html"
   ]
  ], 
  "identifier": 6127
 }
]