[
 [
  [
   153133, 
   null, 
   "gnojek", 
   "There is a story circulating around that Bush, Cheney, and possibly others in the Administration have been indicted on charges of perjury and obstruction of justice. The only \"reporters\" of this story I have seen are Tom Flocco and Greg Szymanski. The rumor mill has also generated \"articles\" by others looking into whether secret indictments of presidents are possible and they make reference to Nixon being secretely indicted in the Watergate case. They even talk about Tony Blair being indicted too, if that's possible.\n \n Here are the articles I can find:\n \n http://portland.indymedia.org/en/2005/08/322473.shtml\n http://multigraphic.dk/lounge/wordpress/?p=1661\n http://www.indybay.org/news/2005/08/1757509.php\n http://www.arcticbeacon.citymaker.com/articles/article/1518131/30722.htm\n http://benito.dailykos.com/story/2005/7/16/16828/1838\n \n \n Do you think these are just rumors or are we going to be hearing about this in the near future?", 
   {
    "post_info": {
     "post_title": "Bush and Cheney indicted?"
    }
   }, 
   null, 
   null, 
   1123264260.0
  ], 
  [
   153142, 
   null, 
   "biccat", 
   "Grand juries can't indict a sitting president for crimes committed while in office, the only recourse against a sitting president is impeachment.\n \n They may, if they desire, suppoena a president, but he is under no obligation to answer. Although a failure to respond could support an impeachment trial for obstruction of justice.", 
   {}, 
   153133, 
   null, 
   1123267860.0
  ], 
  [
   153151, 
   null, 
   "Eddie", 
   "I don`t know anything about the actual topic but those articles linkes where full of wild speculation and paranoia. It sounded sometimes like something taken from a James bond movie or a crazy rant from a mad-man. Not to mention the factual errors.", 
   {}, 
   153142, 
   null, 
   1123272840.0
  ], 
  [
   153178, 
   null, 
   "gnojek", 
   "Jeez, you had to ruin it that quickly huh?", 
   {}, 
   153151, 
   null, 
   1123282020.0
  ], 
  [
   153180, 
   null, 
   "gnojek", 
   "http://www.uexpress.com/tedrall/\n \n \nGOT EMPATHY?\n Americans Cheer Fictional Insurgents, Real-Life Invaders\n \n Sounds like a movie, huh? \"Red Dawn\" is a classic document of Reagan-era jingoism filtered through Cold War paranoia. Audiences cheered American nationalist insurgents as they blew holes through onscreen Soviet conscripts in 1984. Rent it today and you will too.\n \n The mid-'80s were good for fictional American resistance movements. The miniseries \"V,\" which premiered in 1983, was followed by a 1985 sequel and eventually a full-fledged weekly TV series, focused on a cell of underground resistance fighters who bombed police stations, government offices and important infrastructure--including an oil refinery!--in the course of a long, brutal and desperate war against reptilian invaders from outer space. (The clever creatures disguise themselves in human form to get the locals to cooperate.) The series' writers kept things interesting by writing lots of moral ambiguity into their scripts. Some aliens form a \"fifth column\" allied with the human resistance movement while some earthlings sell out their neighbors and relatives, but none of that matters in the end. You still root for the men and women the government and official media call \"terrorists.\"\n \n 1985 saw the widescreen release of a remake of the '50s Red Scare flick \"Invasion, U.S.A.,\" this time with mullet-tressed action hero Chuck Norris deploying heavy weaponry against fiendish commie saboteurs wreaking havoc in the streets of, inexplicably, south Florida.\n \n The more stuff Chuck blows up, the louder we applaud. After all, he ain't no terrorist--he's a freedom fighter, albeit a poorly-directed one clumsily reading incredibly stupid lines.\n \n Cheering for the underdog is as American as fatty food. In the movies we love heroes who simply want to be left alone--but are willing, like Charles Bronson in \"Death Wish,\" to dish out double-sized portions of blazing revenge when the baddies cross the line. Why, then, don't we pull for the Iraqi insurgents? They are, like Clint Eastwood in his '70s and '80s action flicks, fighting back against overwhelming odds. And most, like Patrick Swayze and Charlie Sheen in \"Red Dawn,\" are high school kids who, at first resigned to the U.S. invasion, take up arms in disgust at an increasingly abusive and hostile army of occupation. Americans play opposite roles in the two scenarios, yet we identify with Americans in both. Where the heck is our sense of empathy? Why can't we see ourselves in the faces of those kids firing RPGs at convoys of Halliburton trucks stealing Iraqi oil?\n \n Here's the rub: Iraq's resistance fighters are breaking a lot of eggs to cook their omelet of liberation. They kill other Iraqis. They kidnap and execute foreign aid workers, truck drivers, businessmen, even diplomats and children. Americans, we tell ourselves, would never resort to that kind of terrorism--not even to free ourselves from occupation.\n \n Wouldn't we?\n \n Imagine America under the jackboot of, say, Icelandic occupation. At first many Americans are happy to see Bush arrested and put on trial, but it doesn't take long before we start to miss him. Promises of rapid rebuilding evaporate. Two years after saturation bombing has leveled Washington, Los Angeles, New York and other major cities, the rubble is overrun with rats and wild dogs. America's natural resources--coal, lumber, oil--are shipped back to Iceland without recompense. Unmarked checkpoints spring up everywhere, transforming a drive to the 7-11 to get water--faucets are dry--into a potentially lethal exercise. Icelandic troops conduct house raids to take away Americans' guns. Since there's no electricity for streetlights, the night belongs to gangs, who rape and hold women for ransom. There are no jobs, unless you count working for the hated police force of the puppet regime, the Unified Nordic Republic of Icelanderica. UNRI lackeys ride alongside Icelandic storm troopers to point out the homes of \"terrorists,\" who are bagged, beaten and dragged off into the night, never to be seen again. Most of the victims are innocent civilians, of course, but the Icelandics don't speak English. They mistakenly trust their toadies, who use their authority to act on personal grudges.\n \n These collaborators, as Karl Rove would point out, are fair game--for attacks by American resistance fighters. As in \"V.\" And \"Red Dawn.\"\n \n A few years pass. The Icelandic government turns over nominal \"sovereignty\" to its puppet American regime, but nothing changes on the ground. The checkpoint shootings, mass arrests and chaos continue unabated. Almost everyone has lost a friend or family member to the war. There's an \"election,\" but members of the prewar Democratic and Republican parties are barred from participating. America as we know it has been rubbed out.\n \n The humiliation is total. Icelandic forces pass out decks of cards depicting the faces of former senators, governors and generals. They shoot deposed leader George W. Bush's twin daughters and air images of their bloody, mutilated faces on state television. They print photos of Bush, haggard and obviously abused in his secret prison, wearing nothing but underwear.\n \n Adding to the anger of patriotic Americans is the willingness of the rest of the world to forget what has happened. Other nations, including former prewar allies like Great Britain and Italy, reopen their embassies and post ambassadors to the \"new America.\" The United Nations recognizes the collaborationist regime as legitimate and meets with its appointed leader, a man unknown in America because he spent his entire life in exile in Iceland. Carpetbaggers (the collaborationist press calls them \"entrepreneurs\") pour in from abroad, scheming to line their pockets by prolonging Americans' misery and poverty. Aid groups and other NGOs seeking to help hungry and homeless Americans mean well, but their presence reinforces a sense that things are back to normal--and the collaborationist media points to their presence as tacit endorsement of the occupation.\n \n Obviously the U.S. nationalist insurgents don't want to kill civilians. They prefer that foreigners stay out of occupied America so they can focus on driving out the Icelandics, but naive and greedy intruders ignore their warning not to associate with the puppet regime. Leaders of the resistance are forced to make a brutal choice. They can kill a few diplomats here, a few aid workers there, but since executions serve no purpose as warnings unless their horror is publicized, the American patriots choose to distribute videotapes of the killings. Similarly, they warn their countrymen not to join the collaborationist police forces. But there's only one way to ensure that the jobless won't sell out their country in order to feed their families: suicide bombers who take out as many traitors as possible.\n \n Yes, there would be an alternative to these brutal tactics. The conquered Americans could simply accept that there will never, ever again be a land of the free and home of the brave where the United States used to be. But that would hardly be a Hollywood ending.\n \n CORRECTION: Last week I described Feminists for Life, with which Supreme Court nominee John Roberts' wife has been associated, as a Catholic group. Feminists for Life says it is \"a nonsectarian organization, not affiliated with any religion.\"\n \n COPYRIGHT 2005 TED RALL\n", 
   {
    "post_info": {
     "post_title": "O well, just read this cool article."
    }
   }, 
   153178, 
   null, 
   1123282320.0
  ], 
  [
   153182, 
   null, 
   "gnojek", 
   "I don`t know anything about the actual topic but those articles linkes where full of wild speculation and paranoia. It sounded sometimes like something taken from a James bond movie or a crazy rant from a mad-man. Not to mention the factual errors.\n\n Ok, then. Please be specific. Show me which parts are examples of paranoia and which ones sound like something from James Bond or a crazy rant from a madman.", 
   {}, 
   153151, 
   null, 
   1123284000.0
  ], 
  [
   153260, 
   null, 
   "Eddie", 
   "Ok, then. Please be specific. Show me which parts are examples of paranoia and which ones sound like something from James Bond or a crazy rant from a madman.\n\n \n How about<b></b>: \n \n \"Two weeks ago Heneghen said he had talked to sources just ten minutes prior to French and U.S. intelligence agents intercepting British intelligence agents who were attempting to bomb the subway underneath the Dirksen Federal Building where Fitzgerald was presiding over grand jury hearings. \"\n \n Brittish inteligence planning to bomb a US federal building? Sounds like a James Bond movie.. Or perhaps not, the UK inteligence tend to be the good guys in that one, but how about \"Enemy of the State\" or some-such.\n \n or \n \n \"Serious questions can also be raised as to whether intelligence forces linked to President Bush and Tony Blair had participated in a failed attempt to scuttle the Fitzgerald probe by literally blowing it up--at a time when UK reports reveal that military-grade explosives were used to blow up the London subway on July 7. \"\n \n Oh, so Bush and Blair where the masterminds behind the 7/7 bombings? Paranoia... Also interestingly enough, the bombs where allegedly produced with products bought at ordinary stores. \n \n \"Sources say the alleged Chicago subway bombing attempt has been attributed to an underground and closeted enmity involving warring intelligence and military factions within the United States government. \"\n \n A covert civil war in the US government that uses terrorism as a tool and weapon? How about area 51 and the aliens. Which sides and what roles do they play ;)\n \n Furthermore, I`m pretty certain that the US parliament ca not indict (sp?) other heads of state. They have diplomatic immunity that is being recognized by every civilized country.", 
   {}, 
   153182, 
   null, 
   1123330500.0
  ], 
  [
   153274, 
   null, 
   "simone", 
   "But, we can dream, can't we???\n \n The problem is, isn't Rummy next in line if Bush and Cheney are out?", 
   {}, 
   153260, 
   null, 
   1123347480.0
  ], 
  [
   153736, 
   null, 
   "biccat", 
   "But, we can dream, can't we???\n \n The problem is, isn't Rummy next in line if Bush and Cheney are out?\n\n http://bensguide.gpo.gov/9-12/government/national/succession.html\n \n After Cheney would be Dennis Hasturt, then Ted Stevens, then Rice.", 
   {}, 
   153274, 
   null, 
   1123541100.0
  ], 
  [
   153782, 
   null, 
   "gnojek", 
   "But, we can dream, can't we???\n \n The problem is, isn't Rummy next in line if Bush and Cheney are out?\n\n No, next would be Dennis Hastert.", 
   {}, 
   153274, 
   null, 
   1123555560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush and Cheney indicted?", 
  "url": "http://www.4forums.com/political/politics-debates/6130-bush-cheney-indicted.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 6130, 
  "discussion_files": [
   [
    "11277.html", 
    "http://www.4forums.com/political/politics-debates/6130-bush-cheney-indicted-print.html"
   ]
  ], 
  "identifier": 6130
 }
]