[
 [
  [
   8284, 
   null, 
   "Debate_Queen615", 
   "I think this season of American Idol was perfect. I thought that Ruben should win the competition since the first time I heard him. I hadn't heard about half of the contestants but I knew he would win.\n \n Who do you think should have won? (out of any of the 10 finalists\n \n emoticon_xbouncer emoticon_xbouncer emoticon_xbouncer emoticon_xbouncer emoticon_xbouncer emoticon_xbouncer emoticon_xlove emoticon_xlove", 
   {
    "post_info": {
     "post_title": "Should the American Idol have been Ruben like it was?"
    }
   }, 
   null, 
   null, 
   1053576180.0
  ], 
  [
   8409, 
   null, 
   "SparkleSocks22", 
   "I think Clay should have won! Clay was much better... But actually Clay got the best out of the competition! I mean now Ruben has to work with Simon's company that no one has heard of and sing everything he tells him to sing it's a shame really...with all that talent *shakes head* but Clay got signed with RCA records which EVERYONE has heard of and Clay can sing whatever he wants to! YEA!!! GO CLAY!!!!!!!\n ~Biggest Michael Jackson and Clay Aiken fan~", 
   {}, 
   8284, 
   null, 
   1053916500.0
  ], 
  [
   8413, 
   null, 
   "Debate_Queen615", 
   "Originally posted by SparkleSocks22 \n I think Clay should have won! Clay was much better... But actually Clay got the best out of the competition! I mean now Ruben has to work with Simon's company that no one has heard of and sing everything he tells him to sing it's a shame really...with all that talent *shakes head* but Clay got signed with RCA records which EVERYONE has heard of and Clay can sing whatever he wants to! YEA!!! GO CLAY!!!!!!!\n ~Biggest Michael Jackson and Clay Aiken fan~ \n \n \n \n WOA Clay is gay.... he can't sing loud he does that squeaking thing.... he flutters his eyes (which is just plane ol' scary!!!! if a guy does it\n \n Ruben gets the better of the competition he is going to be more known\n \n just because he is being signed with a NEW record company doesn't mean its bad\n \n all record companies have to start SOMEWHERE.... right RCA wasn't a booming company the a week after it came out\n \n and where did you hear that he has to sing what Simon wants him to sing (by the way bitch Simon tells the truth!!!!! Ruben got no bad words from him [which he wouldn't have] except for needing to sing different kinds of songs)\n \n Simon: tells the plain old truth\n Paula: only says \"that blew me away\"\n Randy: \"I'm feeling it dawg\"\n \n so kiss my fat white XXX bitch\n \n look down at my signature!~emoticon_angry emoticon_angry", 
   {}, 
   8284, 
   null, 
   1053921060.0
  ], 
  [
   8414, 
   null, 
   "Broker", 
   "Did you hear about the people who called numbers that were one digit off the numbers for the show? Controversy is brewing...they had... like 150,000 people call those numbers.\n \n (I don't watch the show, I just heard them discussing it on the news)", 
   {}, 
   8284, 
   null, 
   1053921960.0
  ], 
  [
   8464, 
   null, 
   "Debate_Queen615", 
   "Originally posted by Broker \n Did you hear about the people who called numbers that were one digit off the numbers for the show? Controversy is brewing...they had... like 150,000 people call those numbers.\n \n (I don't watch the show, I just heard them discussing it on the news) \n \n \n Ya that one lady got like tons of phone calls from people trying to vote!!! That was so funny", 
   {}, 
   8284, 
   null, 
   1054055460.0
  ], 
  [
   8593, 
   null, 
   "SparkleSocks22", 
   "Sheesh! WHOA! Touchy are we! I was just stating MY freaken opinion? THAT IS WHAT THE SITE IS FOR! U and no one else can change my fandom for Clay! Clay is not gay! YOU ARE THE GAY ONE! He has that sparkle in his eyes that Ruben just DOES NOT have! Don't get me wrong I do like Ruben I just think Clay is better! Ruben has amazing talent but I just think Clay is better! Clay is an all around performer, he draws you in with that stare and it gives me shivers...Don't you EVER, EVER tell me to kiss ur fricken XXX because I would rather KICK it then kiss it.", 
   {}, 
   8284, 
   null, 
   1054349340.0
  ], 
  [
   8777, 
   null, 
   "Striel", 
   "I was rooting for Ruben the whole time, I am so glad he won over that awful Clay Aiken.", 
   {}, 
   8284, 
   null, 
   1054664940.0
  ], 
  [
   8799, 
   null, 
   "SparkleSocks22", 
   "HEY! Clay Aiken was not awful! He could make it much farther than any of you! Ruben was good but I still like Clay better.", 
   {}, 
   8284, 
   null, 
   1054676760.0
  ], 
  [
   8805, 
   null, 
   "Striel", 
   "Clay should sing on broadway. He should not be a pop singer. He doesn't have the right look or sound to be successful in the pop industry.", 
   {}, 
   8284, 
   null, 
   1054677420.0
  ], 
  [
   8809, 
   null, 
   "SparkleSocks22", 
   "Clay would do great on broadway...besides the fact that he DOESN'T DANCE and that's what broadway is about! (mostly) He can be a pop singer if he wants...who cares if he doesn't have the \"look\"?! Ruben doesn't have the \"look\" and neither does Kimberly but they all 3 have tremendous talent!!!", 
   {}, 
   8284, 
   null, 
   1054677660.0
  ], 
  [
   8811, 
   null, 
   "Striel", 
   "Ruben may not be a gorgeous man, but It's different for him. With that deep voice he is more likely to be an R&b singer (if they do what they should with him) and being a big black man in that industry is not a big deal (look at Luther Vandross for one example). Clay looks like a total nerd. Those hideous faces he made at the camera made me cringe. I don't think his voice is enough to make him a success.", 
   {}, 
   8284, 
   null, 
   1054678260.0
  ], 
  [
   8816, 
   null, 
   "SparkleSocks22", 
   "It shouldn't be the look, it should be the talent. Clay does not look like a total nerd! Sure he may not be the pin up calender guy with all those muscles but he is still adorable. Back to your comment on broadway...you said that Clay doesn't have the talent to carry him as a pop singer but in broadway you have WAY more talent then MOST of the pop singers today! I mean just look at Britney Spears! She could NEVER survive on broadway because of lack of talent.", 
   {}, 
   8284, 
   null, 
   1054678560.0
  ], 
  [
   8818, 
   null, 
   "Striel", 
   "I am not saying Clay cannot sing, I am just saying his voice isn't the type of voice that would make him a popular pop singer. The same goes for his looks.", 
   {}, 
   8284, 
   null, 
   1054678620.0
  ], 
  [
   8822, 
   null, 
   "SparkleSocks22", 
   "Yea he doesn't look like the normal pop singer but who cares? I don't care about the image of my idol's, it's always the talent first. Your right he shouldn't sing pop, his voice is to good for it. He could though do well in it.", 
   {}, 
   8284, 
   null, 
   1054678920.0
  ], 
  [
   8875, 
   null, 
   "Debate_Queen615", 
   "Originally posted by SparkleSocks22 \n HEY! Clay Aiken was not awful! He could make it much farther than any of you! Ruben was good but I still like Clay better. \n \n \n yeah we are pretty bad singers, wait you haven't head us well jeez I guess you don't have the authority to make that decision do you!", 
   {}, 
   8284, 
   null, 
   1054691700.0
  ], 
  [
   8935, 
   null, 
   "SparkleSocks22", 
   "I have the authority to do whatever the hell I want.", 
   {}, 
   8284, 
   null, 
   1054757160.0
  ], 
  [
   9493, 
   null, 
   "katie5890", 
   "I think Kimberly Cawdwell should have won she had a good rich deep voice. and do u know what i dont get? How is it that if a black guy (not being racist) like ruben is huge then hes cool but if a white man or woman or black woman were to be fat it would be a big deal.", 
   {}, 
   8284, 
   null, 
   1055436180.0
  ], 
  [
   9587, 
   null, 
   "Debate_Queen615", 
   "yeah its weird you see a fat white guy walking down the road and he passes you and your friends you might ya know giggle and maybe even make fun of him, but you see a black guy thats overweight and you just keep on walkin\n \n maybe its cause you more often find aoverweight black guy in a gang, opposed to a white man who is overwieght\n \n maybe people are scared of big black guys \n \n which is hilarious (I'm not)\n \n although you would think making fun of an overweight black male would be more popular because it more rare than a fat white man\n \n I'm sorry if I have arroused any feelings\n \n \n good point Katie", 
   {}, 
   8284, 
   null, 
   1055486520.0
  ], 
  [
   11393, 
   null, 
   "SparkleSocks22", 
   "Kimberly was REALLY good. I think it was anybody's game. Ruben, Clay, and Kimberly were all VERY talented. The image again comes in to play. Kimberly was a bit overweight (which I had NO problem with) but some people would rather have Carmen as their idol cause she looks like Britney (well sorta, i think britney has a better voice than Carmen.) Carmen always sounded like a dying sheep. And for Clay's image, he didn't look like the typical guy singer. There is an image that is expected and none of them had it. Ruben was the closest one to having an image, because there are a lot of overweight black guys in rap music so...but debate you have a point, black overweight guys are feared and not laughed at whereas white overweight guys are laughed at but not feared one bit. I myself think it's stupid to be afraid of anyone.", 
   {}, 
   9587, 
   null, 
   1057261680.0
  ], 
  [
   11456, 
   null, 
   "katie5890", 
   "girl, you know that if u seee a dude with a knife in his hand and guns in his pocket you WOULD bw scared emoticon_ic", 
   {}, 
   11393, 
   null, 
   1057437240.0
  ], 
  [
   12144, 
   null, 
   "goldylocks77", 
   "I thought Clay had the better voice out of all of the finalist. I think he should have won.", 
   {}, 
   11456, 
   null, 
   1058979960.0
  ], 
  [
   27031, 
   null, 
   "Debate_Queen615", 
   "Again I have changed me stand on this topic. A few weeks ago I bought the Clay Aiken CD and I'm obsessed with listening to it. Wether or not he sounds, dresses, looks, or acts gay he has a great voice and thats all that matters. I mean think about it if you were blind folded and you had to pick the better voice between Clay Aiken and.... Nick Carter (gag) who would you chose as the better singer. (Well I'm hoping that you'd pick Clay) And this is because you like his voice, but once the blind fold is taken off you may change your mind because Clay winked at you and is dressed like a metrosexual.", 
   {}, 
   8935, 
   null, 
   1071206940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Should the American Idol have been Ruben like it was?", 
  "url": "http://www.4forums.com/political/entertainment-debates/614-should-american-idol-have-been-ruben-like.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 614, 
  "discussion_files": [
   [
    "19660.html", 
    "http://www.4forums.com/political/entertainment-debates/614-should-american-idol-have-been-ruben-like-print.html"
   ], 
   [
    "19661.html", 
    "http://www.4forums.com/political/entertainment-debates/614-should-american-idol-have-been-ruben-like-2-print.html"
   ]
  ], 
  "identifier": 614
 }
]