[
 [
  [
   153436, 
   null, 
   "simone", 
   "http://www.nytimes.com/2005/08/07/international/europe/07russia.html\n \n All 7 Men Alive as Russian Submarine Is Raised\n By C. J. CHIVERS and CHRISTOPHER DREW\n Published: August 7, 2005\n MOSCOW, Sunday, Aug. 7 - A small Russian submarine was freed on Sunday from its undersea entanglement off the Far East coast by an unmanned British rescue vehicle that cut away the nets that had ensnared it. \n \n All seven crew members were alive and rushed aboard a Russian surface vessel, where they were being reviewed by a medical team, Russian news agencies and the United States Navy said.\n \n The vessel rose to the surface before 4:30 p.m. local time, ending the crew's ordeal in the cold and darkness more than 600 feet below the surface off the Kamchatka Peninsula. There remained uncertainties about how the submersible, a 44-foot rescue vessel, became disabled, and what exactly immobilized it. \n \n Throughout the rescue operation, Russian officers spoke of cables and hoses that had held the craft fast, while Western naval officials said fishing nets had trapped it. The disentanglement and ascent of the small submarine, trapped since Thursday, was an utterly different outcome from Russia's last prominent submarine crisis, in 2000, when the nuclear submarine Kursk sank after onboard explosions in shallow water in the Barents Sea. \n \n Russia resisted international assistance in that crisis and made a series of false statements about its problems. Although many of the 118 crew members survived the blasts and sinking, all ultimately died. Since then Russia has participated in international undersea rescue exercises with Western nations, and after the mishap on Thursday it quickly sought aid from Britain, Japan and the United States.\n \n But even as the small submarine rose to the Pacific surface, the rescue underscored the persistent limits of Russia's Navy, which was unable to muster either a second rescue vessel or the advanced divers or unmanned vessels to free the trapped submarine on its own.\n \n Its naval officers also issued a series of contradictory statements about what had entrapped the vessel and often seemed uncertain how much air remained onboard. \n \n The ascent ended a tense race against time, with British sailors operating their unmanned vehicle, which had been hastily secured to a Russian ship and had steamed for six hours from a nearby port to the scene. The unmanned vessel, known as a Scorpio 45, then worked for several hours, trimming the material that ensnared the submarine.\n \n The Scorpio had to be briefly resurfaced after it developed a technical problem, and then it descended again and freed the Russian vehicle within an hour, according to Cmdr. Mark McDonald, a spokesman for the United States Pacific Fleet. The vessel then quickly rose to the surface. \n \n Shortly before the snag developed, Commander McDonald said, the British submersible had clipped one of possibly five sections of a discarded fishing net that had fouled the propeller of the Russian submarine.\n \n Commander McDonald also said British and American officials at the scene indicated that it was just the fishing net that had ensnared the vessel, and that it was not caught on the antenna and cables of an antisubmarine surveillance system, as the Russians had announced.\n \n Even before the British sailors set to work, Russian officials had said the submarine's crew of seven men were alive. They had donned thermal suits and huddled together in a single compartment, and were minimizing their movements to conserve their remaining air.\n \n Power had been all but shut down inside the sunken vessel, and its heater had been turned off to save its dwindling energy reserves, rendering the titanium-hulled craft a chilled, dark tube.\n \n Two other Scorpio craft sent by the American Navy were still sitting on a ship in port on the Kamchatka peninsula when the Russian submarine was freed. Commander McDonald said Russian officials had been waiting for other advanced American diving gear to arrive before setting out on the six-hour voyage to the spot where the submarine was trapped.\n \n The British reached the scene first in part because they had a shorter flight to get their Scorpio to Russia. But it also took the Americans four hours longer than expected Friday to load the Scorpios onto a cargo plane in San Diego, with both the Air Force and the Navy citing each other for contributing to the delay. \n \n Still, American officials said the rescue was a testament to the intense efforts that had been made to increase cooperation among navies since the Kursk sank.", 
   {
    "post_info": {
     "post_title": "The Russians Are Safe!"
    }
   }, 
   null, 
   null, 
   1123432680.0
  ], 
  [
   153437, 
   null, 
   "simone", 
   "\"The close teamwork and global coordination between our navies to rescue these sailors in such a short time is testimony to the spirit and determination of our nations,\" said Adm. Gary Roughead, commander of the United States Pacific Fleet. \n \n It appeared that time could hardly have been shorter. Adm. Viktor D. Fyodorov, commander of Russia's Pacific fleet, had said Saturday night on national television that he thought the air supply and quality would allow the crew to survive throughout Sunday. \n \n And although estimates by Russian officials of the air supply had changed every few hours, and Admiral Fyodorov's estimate appeared less optimistic than another he had made only hours earlier, the air supply proved to be enough. \n \n Worsening weather, with fog settling in and seas rising to seven feet, also did not prevent the rescue. Before the British vessel made its dive, signs of confusion had become more apparent. \n \n Admiral Fyodorov was quoted by Interfax on Saturday as saying a decision had been made to try to blow up some of the material that had immobilized the submarine. A duty admiral at Russia's naval headquarters in Moscow later said in a telephone interview that the navy was not planning to use explosives; he declined to give his name.\n \n Details of how the submarine, a 44-foot-long rescue craft known as an AS-28 Priz, became disabled also emerged, although much remained uncertain. The Russian Navy initially said the submarine had fallen to the sea floor after its propeller had snagged on a fishing net. \n \n By late Friday, however, when Admiral Fyodorov was pressed by Russian journalists on live television, he said the vehicle had in fact become entangled on an undersea military antenna. Late on Saturday the admiral appeared with a diagram displaying a complex undersea grid anchored by four huge anchors. \n \n Russian naval officials described that apparatus as part of a coastal monitoring system used to track the movements of foreign submarines. It is not clear what the Priz was doing at the site or when it became disabled. Different reports had said Thursday morning and night, but Russia had been trying to free it for part of at least four days.\n \n A surface vessel was able to hook either the submarine or the monitoring system and then dragged the entangled objects a short distance before they became immobilized again. \n \n With American and British rescue services arriving from distant points on the globe, the accident underscored anew the decline of Russia's military. Once feared and respected, it has deteriorated sharply since the late Soviet period. \n \n Some naval ports are so short of cash that the Russian news media occasionally reports of electricity blackouts on bases because their administrators cannot pay the bills.\n \n The uncertainties and contradictions in the Russian Navy's descriptions of the accident also bore faint reminders of the Kremlin's handling of the sinking of the nuclear submarine Kursk five years ago. President Vladimir V. Putin, publicly stung by the crisis, vowed to modernize the navy and overhaul the Russian military. \n \n The limits of that effort have been illustrated by the Priz accident and the urgent calls for foreign help. Mr. Putin, publicly silent through the operation, made no immediate statement after the rescue.\n \n The Priz had been launched from a Russian naval vessel that usually carried two such rescue craft, according to the newspaper Kommersant. But the other Priz had been left on shore for repairs, the newspaper reported, and the Russian Navy had been unable to bring any others to the aid of the stranded craft. \n \n Russia reacted more quickly in this mishap than it did during the Kursk crisis. The United States Embassy was swiftly asked for help, and on Saturday morning, Mr. Putin ordered Defense Minister Sergei B. Ivanov to fly to the region to supervise the rescue effort, the Kremlin press service said.\n \n Officials had said little about the crewmen, other than that they had intermittent communication with them, sometimes describing the communication as acoustic and other times mentioning radio contact. Their condition after the ordeal was described as satisfactory; a naval spokesman told Interfax that the men would be transferred to a nearby missile ship to meet Mr. Ivanov. \n \n Risks to the men had abounded, and American submarine experts said the dwindling oxygen supply was not the only serious threat. The Russian Navy said it would not take long for the inside of the vessel to fall to the temperature of the surrounding sea, about 41 to 45 degrees.\n C. J. Chivers reported from Moscow for this article and Christopher Drew from New York. Don Van Natta Jr. contributed reporting from London.", 
   {
    "post_info": {
     "post_title": "Continued"
    }
   }, 
   153436, 
   null, 
   1123432740.0
  ], 
  [
   153438, 
   null, 
   "simone", 
   "Whoever woulda thunk up such a GOOD IDEA?\n \n \n\"The close teamwork and global coordination between our navies to rescue these sailors in such a short time is testimony to the spirit and determination of our nations,\" said Adm. Gary Roughead, commander of the United States Pacific Fleet.\nI wunner if ol' Bushy Boy is gonna can Admiral Roughhead for saying the unsayable:\n \n global coordination", 
   {
    "post_info": {
     "post_title": "International Teamwork?"
    }
   }, 
   153437, 
   null, 
   1123432920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Russians Are Safe!", 
  "url": "http://www.4forums.com/political/politics-debates/6142-russians-safe.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 6142, 
  "discussion_files": [
   [
    "15998.html", 
    "http://www.4forums.com/political/politics-debates/6142-russians-safe-print.html"
   ]
  ], 
  "identifier": 6142
 }
]