[
 [
  [
   153517, 
   null, 
   "DamEtel", 
   "\"Philosophy is questions that may never be answered. Religion is answers that may never be questioned.\" \n -- unknown \n \n \"The philosopher has never killed any priests, whereas the priest has killed a great many philosophers.\"\n -- Denis Diderot", 
   {
    "post_info": {
     "post_title": "Just a couple quotes I ran across"
    }
   }, 
   null, 
   null, 
   1123463940.0
  ], 
  [
   153519, 
   null, 
   "JPSartre12", 
   "\"Philosophy is questions that may never be answered. Religion is answers that may never be questioned.\" \n -- unknown \n \n \"The philosopher has never killed any priests, whereas the priest has killed a great many philosophers.\"\n -- Denis Diderot\n\n \n More anti-religious drivel. Thanks. emoticon_rolleyes", 
   {}, 
   153517, 
   null, 
   1123464300.0
  ], 
  [
   153530, 
   null, 
   "wsm2506", 
   "More anti-religious drivel. Thanks. emoticon_rolleyes\n\n Beats the heck out of religious drivel!!!!!!!!!!!!!!!!!!!! :)", 
   {}, 
   153519, 
   null, 
   1123465920.0
  ], 
  [
   153534, 
   null, 
   "JPSartre12", 
   "Beats the heck out of religious drivel!!!!!!!!!!!!!!!!!!!! :)\n\n \n in YOUR opinion, that is. emoticon_rolleyes", 
   {}, 
   153530, 
   null, 
   1123466340.0
  ], 
  [
   153538, 
   null, 
   "DamEtel", 
   "Oh, I've got more!\n \n \n \"Is God willing to prevent evil, but not able? Then he is not omnipotent. \n Is he able, but not willing? Then he is malevolent. \n Is he both able and willing? Then whence cometh evil? \n Is he neither able nor willing? Then why call him God?\"\n - Epicurus\n \n \n \"Men never commit evil so fully and joyfuly as when they do it for religious convictions\" \n -- Blaise Pascal \n \n \n \"In Christianity neither morality nor religion come into contact with reality at any point.\"\n --Friedrich Nietzsche\n \n \n \"Of all religions the Christian is without doubt the one which should inspire tolerance most, although up to now the Christians have been the most intolerant of all men.\"\n --Voltaire\n \n \n \"Why should I allow that same God to tell me how to raise my kids, who had to drown His own?\" \n -Robert G. Ingersoll\n \n \n \"As people become more intelligent they care less for preachers and more for teachers\"\n -Robert G. Ingersoll \n \n \n \"Religion is excellent stuff for keeping common people quiet.\" \n -- Napoleon Bonaparte", 
   {
    "unicode_changes_made": true
   }, 
   153534, 
   null, 
   1123466580.0
  ], 
  [
   153539, 
   null, 
   "JPSartre12", 
   "Oh, I've got more!\n\n Is there a purpose for this or are you just trolling? emoticon_confused", 
   {}, 
   153538, 
   null, 
   1123467000.0
  ], 
  [
   153544, 
   null, 
   "JPSartre12", 
   "Abraham Lincoln: \n That I am not a member of any Christian Church, is true; but I have never denied the truth of the Scriptures; and I have never spoken with intentional disrespect of religion in general, or of any denomination of Christians in particular.\n \n Abraham Lincoln: \n When I do good, I feel good; when I do bad, I feel bad. That's my religion.\n \n Adlai E. Stevenson: \n What do I believe? As an American I believe in generosity, in liberty, in the rights of man. These are social and political faiths that are part of me, as they are, I suppose, part of all of us. Such beliefs are easy to express. But part of me too is my relation to all life, my religion. And this is not so easy to talk about. Religious experience is highly intimate and, for me, ready words are not at hand. \n \n Albert Einstein: \n All religions, arts and sciences are branches of the same tree. All these aspirations are directed toward ennobling man's life, lifting it from the sphere of mere physical existence and leading the individual towards freedom.\n \n Albert Einstein: \n True religion is real living; living with all one's soul, with all one's goodness and righteousness.\n \n Anne Frank: \n The best remedy for those who are afraid, lonely or unhappy is to go outside, somewhere where they can be quiet, alone with the heavens, nature and God. Because only then does one feel that all is as it should be and that God wishes to see people happy, amidst the simple beauty of nature.\n \n Benjamin Franklin: \n The moral and religious system which Jesus Christ transmitted to us is the best the world has ever seen, or can see.", 
   {
    "post_info": {
     "post_title": "Turnaround is fair play"
    }
   }, 
   153517, 
   null, 
   1123468440.0
  ], 
  [
   153764, 
   null, 
   "DamEtel", 
   "\n Albert Einstein: \n All religions, arts and sciences are branches of the same tree. All these aspirations are directed toward ennobling man's life, lifting it from the sphere of mere physical existence and leading the individual towards freedom.\n \n Albert Einstein: \n True religion is real living; living with all one's soul, with all one's goodness and righteousness.\n \n\n \n Wow, if one took your word for it, one might get the impression that Einstein was deeply religious person who worshipped God. Not so.\n \n These are from http://www.atheistempire.com/greatminds/index.html (follow the Einstein link on the left: it's a bit difficult to match up the source with the quote on that page, so I don't guarantee I have it right).\n \n \nFrom a correspondence between Ensign Guy H. Raner and Albert Einstein in 1945 and 1949. Einstein responds to the accusation that he was converted by a Jesuit priest: \n \n \"I have never talked to a Jesuit prest in my life. I am astonished by the audacity to tell such lies about me. From the viewpoint of a Jesuit priest I am, of course, and have always been an atheist.\"\n\n \n \n\"I have repeatedly said that in my opinion the idea of a personal God is a childlike one.You may call me an agnostic, but I do not share the crusading spirit of the professional atheist whose fervor is mostly due to a painful act of liberation from religious indoctrination received in youth.\" Freethought Today, November 2004\n\n \n \n\"It was, of course, a lie what you read about my religious convictions, a lie which is being systematically repeated. I do not believe in a personal God and I have never denied this but have expressed it clearly. If something is in me which can be called religious then it is the unbounded admiration for the structure of the world so far as our science can reveal it.\" From a letter Einstein wrote in English, dated 24 March 1954. It is included in Albert Einstein: The Human Side, edited by Helen Dukas and Banesh Hoffman, published by Princeton University Press. Albert Einstein, Out of My Later Years (New York: Philosophical Library, 1950), p. 27.\n \n\n \n \n\"Thus I came...to a deep religiosity, which, however, reached an abrupt end at the age of 12. Through the reading of popular scientific books I soon reached a conviction that much in the stories of the Bible could not be true....Suspicion against every kind of authority grew out of this experience...an attitude which has never left me.\" The Quotable Einstein\n", 
   {}, 
   153544, 
   null, 
   1123550580.0
  ], 
  [
   154002, 
   null, 
   "DamEtel", 
   "Benjamin Franklin: \n The moral and religious system which Jesus Christ transmitted to us is the best the world has ever seen, or can see.\n\n \n I guess Ben didn't share the same views on religion and Christianity as Thomas Jefferson and John Adams.\n \n \n\"The day will come when the mystical generation of Jesus, by the Supreme Being as His father, in the womb of a virgin will be classed with the fable of the generation of Minerva in the brain of Jupiter.\" (Thomas Jefferson, in a letter to John Adams, April 11, 1823) \n\n \n \n\"This would be the best of all possible worlds, if there were no religion in it.\" (John Adams, in a letter to Thomas Jefferson) \n", 
   {}, 
   153544, 
   null, 
   1123649940.0
  ], 
  [
   154076, 
   null, 
   "JPSartre12", 
   "I guess Ben didn't share the same views on religion and Christianity as Thomas Jefferson and John Adams.\n\n \n \n \"Our particular principles of religion are a subject of accountability to God alone. I inquire after no man's, and trouble none with mine.\" --Thomas Jefferson to Miles King, 1814. ME 14:198 \n \n Jefferson believed that the teachings of Christ represented the best set of moral guidelines ever written, but didn't subscribe to the normal religious mysticism. \n \n\n And the day will come when the mystical generation of Jesus, by the supreme being as his father in the womb of a virgin will be classed with the fable of the generation of Minerve in the brain of Jupiter. But may we hope that the dawn of reason and freedom of thought in these United States will do away with this artificial scaffolding, and restore to us the primitive and genuine doctrines of this most venerated reformer of human errors.\n \n -Thomas Jefferson, Letter to John Adams, April 11, 1823\n \n", 
   {}, 
   154002, 
   null, 
   1123685580.0
  ], 
  [
   154162, 
   null, 
   "gnojek", 
   "Abraham Lincoln: \n That I am not a member of any Christian Church, is true; but I have never denied the truth of the Scriptures; and I have never spoken with intentional disrespect of religion in general, or of any denomination of Christians in particular.\n \n Abraham Lincoln: \n When I do good, I feel good; when I do bad, I feel bad. That's my religion.\n \n Adlai E. Stevenson: \n What do I believe? As an American I believe in generosity, in liberty, in the rights of man. These are social and political faiths that are part of me, as they are, I suppose, part of all of us. Such beliefs are easy to express. But part of me too is my relation to all life, my religion. And this is not so easy to talk about. Religious experience is highly intimate and, for me, ready words are not at hand. \n \n Albert Einstein: \n All religions, arts and sciences are branches of the same tree. All these aspirations are directed toward ennobling man's life, lifting it from the sphere of mere physical existence and leading the individual towards freedom.\n \n Albert Einstein: \n True religion is real living; living with all one's soul, with all one's goodness and righteousness.\n \n Anne Frank: \n The best remedy for those who are afraid, lonely or unhappy is to go outside, somewhere where they can be quiet, alone with the heavens, nature and God. Because only then does one feel that all is as it should be and that God wishes to see people happy, amidst the simple beauty of nature.\n \n Benjamin Franklin: \n The moral and religious system which Jesus Christ transmitted to us is the best the world has ever seen, or can see.\n\n The last quote is the only pro-christian quote in there.\n The second Lincoln quote is basically saying that he's got no problem with religion, just that he wouldn't participate himself.\n \n All the others are, if not anti-religion, not pro-religion.", 
   {}, 
   153544, 
   null, 
   1123713840.0
  ], 
  [
   154189, 
   null, 
   "Master_Shake", 
   "Thomas Jefferson was not a believer. At any rate, throwing quotes at each doesn't make God exist or not exist.", 
   {}, 
   154162, 
   null, 
   1123718460.0
  ], 
  [
   154294, 
   null, 
   "DamEtel", 
   "Thomas Jefferson was not a believer.\n\n \n Yes, I guess JPS doesn't realize that someone can speak of God and it NOT be Christ. \n \n From what I've read, Jefferson was a Deist, not a Christian.", 
   {}, 
   154189, 
   null, 
   1123737960.0
  ], 
  [
   154306, 
   null, 
   "DamEtel", 
   "Jefferson believed that the teachings of Christ represented the best set of moral guidelines ever written, but didn't subscribe to the normal religious mysticism.\n\n \n Hmmm, are you sure about that?\n \n \n\"Millions of innocent men, women, and children, since the introduction of Christianity, have been burned, tortured, fined, and imprisoned, yet we have not advanced one inch toward uniformity. What has been the effect of coercion? To make one half of the world fools and the other half hypocrites.\" \n (Thomas Jefferson, Notes on Virginia) \n", 
   {}, 
   154076, 
   null, 
   1123741260.0
  ], 
  [
   154489, 
   null, 
   "gnojek", 
   "http://rescomp.stanford.edu/~cheshire/EinsteinQuotes.html", 
   {
    "post_info": {
     "post_title": "A page of Einstein quotes"
    }
   }, 
   154306, 
   null, 
   1123808160.0
  ], 
  [
   154493, 
   null, 
   "Master_Shake", 
   "Yes, I guess JPS doesn't realize that someone can speak of God and it NOT be Christ. \n \n From what I've read, Jefferson was a Deist, not a Christian.\n\n \n No, I meant he didn't believe in God. Period. Some of what he said may look otherwise, but that was merely for public appearances. Read deeper into his stuff and a different picture emerges.\n I don't have anything to prove here, it's just my opinion.", 
   {}, 
   154294, 
   null, 
   1123808460.0
  ], 
  [
   154502, 
   null, 
   "JPSartre12", 
   "Hmmm, are you sure about that?\n\n Yep. \n http://www.pbs.org/wgbh/pages/frontline/shows/religion/jesus/jefferson.html", 
   {}, 
   154306, 
   null, 
   1123810380.0
  ], 
  [
   154647, 
   null, 
   "gnojek", 
   "Yep. \n http://www.pbs.org/wgbh/pages/frontline/shows/religion/jesus/jefferson.html\n\n I'm just giving this this a skim right now and ther are certain clues that would lead me to believe that Jefferson was NOT a christian whatsoever.\n \n I think Jefferson believed that Jesus of Nazareth (not Jesus Christ) was a great philosopher and statesman, but that his teachings had been hijacked and transformed by the Church. \n \n Here's another obvious \"clue\":\n \nWho was the Jesus that Jefferson found? He was not the familiar figure of the New Testament. In Jefferson's Bible, there is no account of the beginning and the end of the Gospel story. There is no story of the annunciation, the virgin birth or the appearance of the angels to the shepherds. The resurrection is not even mentioned.\n\n \n continuing\n \n \nJefferson discovered a Jesus who was a great Teacher of Common Sense. His message was the morality of absolute love and service. Its authenticity was not dependent upon the dogma of the Trinity or even the claim that Jesus was uniquely inspired by God. Jefferson saw Jesus as\n \n a man, of illegitimate birth, of a benevolent heart, (and an) enthusiastic mind, who set out without pretensions of divinity, ended in believing them, and was punished capitally for sedition by being gibbeted according to the Roman law.\n\n \n Nowhere in the passage does it say that jefferson thought that Jesus's teachings were the ideal moral system.", 
   {}, 
   154502, 
   null, 
   1123871760.0
  ], 
  [
   154700, 
   null, 
   "Alan Ryan", 
   "\n I think Jefferson believed that Jesus of Nazareth (not Jesus Christ) was a great philosopher and statesman, but that his teachings had been hijacked and transformed by the Church. \n \n\n \n Is it a mistake to suppose that Jesus Christ and Jesus of Nazareth were one and the same person ?", 
   {}, 
   154647, 
   null, 
   1123880580.0
  ], 
  [
   154711, 
   null, 
   "JPSartre12", 
   "Is it a mistake to suppose that Jesus Christ and Jesus of Nazareth were one and the same person ?\n\n \n They are one in the same. Jefferson didn't believe the \"mysticism\" as he called it, but thought that the Gospels were an excellent body of writings on how humans should behave. I never claimed that he was a Christian, only that he admired the teachings of Jesus enough to rewrite the Gospels in his words.", 
   {}, 
   154700, 
   null, 
   1123886460.0
  ], 
  [
   154794, 
   null, 
   "DamEtel", 
   "Alan Ryan: Is it a mistake to suppose that Jesus Christ and Jesus of Nazareth were one and the same person ? \n\n \n \nJPSartre12: They are one in the same.\n\n \n Not to Jefferson. He did not consider Jesus to be The Christ: he rejected Jesus's virgin birth and resurrection, for example. Jefferson viewed Jesus's - that is, the HUMAN's - philosophy as presented in the Gospels quite favorably.\n \n \n *****************\n \n \n\"I have recently been examining all the known superstitions of the world, and do not find in our particular superstition [i.e., Christianity] one redeeming feature. They are all alike, founded upon fables and mythologies.\" (Thomas Jefferson, letter to Dr. Woods (undated), referring to \"our particular superstition,\" Christianity, from John E. Remsburg, Six Historic Americans: Thomas Jefferson, quoted from Franklin Steiner, Religious Beliefs of Our Presidents (1936), \"Thomas Jefferson, Freethinker\", http://www.positiveatheism.org/hist/quotes/jefframe.htm) \n\n \n \n\"Fix reason firmly in her seat, and call to her tribunal every fact, every opinion. Question with boldness even the existence of a god; because, if there be one, he must approve the homage of reason rather than of blind-folded fear. Do not be frightened from this inquiry by any fear of its consequences.... If it end in a belief that there is no god, you will find incitements to virtue in the comfort and pleasantness you feel in its exercise and in the love of others it will procure for you.\" (Thomas Jefferson, letter to Peter Carr, 10 Aug. 1787, \n http://www.positiveatheism.org/hist/quotes/jefframe.htm) \n\n \n \n\"One day the dawn of reason and freedom of thought in the United States will tear down the artificial scaffolding of Christianity. The day will come when the mystical generation of Jesus, by the Supreme Being as His father, in the womb of a virgin will be classed with the fable of the generation of Minerva in the brain of Jupiter.\" (Letter to John Adams, April 11, 1823, http://www.deism.org/foundingfathers.htm) \n", 
   {
    "unicode_changes_made": true
   }, 
   154711, 
   null, 
   1123920300.0
  ], 
  [
   154990, 
   null, 
   "JPSartre12", 
   "Not to Jefferson. He did not consider Jesus to be The Christ: he rejected Jesus's virgin birth and resurrection, for example. Jefferson viewed Jesus's - that is, the HUMAN's - philosophy as presented in the Gospels quite favorably.\n *****************\n\n \n I wasn't answering the question for Jefferson. I was answering it from a Christian's viewpoint. Jesus of Nazareth = Jesus Christ", 
   {}, 
   154794, 
   null, 
   1124070780.0
  ], 
  [
   155040, 
   null, 
   "Alan Ryan", 
   "I wasn't answering the question for Jefferson. I was answering it from a Christian's viewpoint. Jesus of Nazareth = Jesus Christ\n\n Did Jefferson believe that Jesus Christ and Jesus of Nazareth were two separate persons who happened to be living in Galilee at the same time ? Or is this just a sort of \"philosophical\" distinction without a difference ? Or does everything depend on what is meant by \"Christ\" - which I was taught refers to the idea of an \"annointed one\" or a Messiah ?", 
   {}, 
   154990, 
   null, 
   1124113440.0
  ], 
  [
   155068, 
   null, 
   "gnojek", 
   "Is it a mistake to suppose that Jesus Christ and Jesus of Nazareth were one and the same person ?\n\n Yes it is. Jesus Christ is lord and savior, Jesus of Nazareth was just a man.\n \n \n Just this morning I had to listen to Newt try to confuse people as to what Jefferson believed. He said things like \" the secularists will try to tell you that Jefferson didn't believe in religion, but what does the DoI say? It says Creator so...\"\n \n I think it's obvious what the difference between faith and religion is...", 
   {}, 
   154700, 
   null, 
   1124129640.0
  ], 
  [
   155069, 
   null, 
   "Alan Ryan", 
   "Yes it is. Jesus Christ is lord and savior, Jesus of Nazareth was just a man.\n\n Are we talking about two men here, or two aspects of the same person ?", 
   {}, 
   155068, 
   null, 
   1124129760.0
  ], 
  [
   155070, 
   null, 
   "gnojek", 
   "Are we talking about two men here, or two aspects of the same person ?\n\n It's two interpretations as to who a certain person actually was.\n \n Isn't it obvious?\n \n If you call him Christ, you are saying that he is the savior.\n If you do not call him that you are saying that he is not the savior.\n Being a messiah would make you a different person, no?", 
   {}, 
   155069, 
   null, 
   1124129820.0
  ], 
  [
   155074, 
   null, 
   "Alan Ryan", 
   "It's two interpretations as to who a certain person actually was.\n \n Isn't it obvious?\n \n If you call him Christ, you are saying that he is the savior.\n If you do not call him that you are saying that he is not the savior.\n Being a messiah would make you a different person, no?\n\n \n Excuse me if I appear rather dense on this one: but as I understand Christian doctrine on this point, Jesus Christ was ONE man with TWO natures - i.e. both human and divine.\n I assume, not having read much about Jefferson's views on religion, that he regarded Jesus as merely a man (whom he identified as Jesus of Nazareth) and he rejected the idea that he was also the Christ - the expected Messiah and \"son\" of God ?", 
   {}, 
   155070, 
   null, 
   1124130360.0
  ], 
  [
   155192, 
   null, 
   "DamEtel", 
   "Excuse me if I appear rather dense on this one: but as I understand Christian doctrine on this point, Jesus Christ was ONE man with TWO natures - i.e. both human and divine.\n I assume, not having read much about Jefferson's views on religion, that he regarded Jesus as merely a man (whom he identified as Jesus of Nazareth) and he rejected the idea that he was also the Christ - the expected Messiah and \"son\" of God ?\n\n \n Which is essentially what I said above. ...\n \n \n \nDamEtel: Not to Jefferson. He did not consider Jesus to be The Christ: he rejected Jesus's virgin birth and resurrection, for example. Jefferson viewed Jesus's - that is, the HUMAN's - philosophy as presented in the Gospels quite favorably.\n\n \n Jefferson was not a Christian, he was a Deist. Jefferson spoke very negatively about Christianity and the myths (virgin birth, trinity, resurrection, etc.) associated with it.\n \n However, Jefferson certainly believed that a man named Jesus lived, and that that man's teachings were of great value.", 
   {}, 
   155074, 
   null, 
   1124152500.0
  ], 
  [
   155194, 
   null, 
   "JPSartre12", 
   "Excuse me if I appear rather dense on this one: but as I understand Christian doctrine on this point, Jesus Christ was ONE man with TWO natures - i.e. both human and divine.\n I assume, not having read much about Jefferson's views on religion, that he regarded Jesus as merely a man (whom he identified as Jesus of Nazareth) and he rejected the idea that he was also the Christ - the expected Messiah and \"son\" of God ?\n\n \n According to Christian doctrine, Jesus was the Son of God, made man and crucified for our sins as a man. He then was resurected from the dead. Jefferson made the distinction between Jesus, the man and Jesus the Christ.", 
   {}, 
   155074, 
   null, 
   1124155440.0
  ], 
  [
   155243, 
   null, 
   "Alan Ryan", 
   "Which is essentially what I said above. ...\n \n \n \n \n Jefferson was not a Christian, he was a Deist. Jefferson spoke very negatively about Christianity and the myths (virgin birth, trinity, resurrection, etc.) associated with it.\n \n However, Jefferson certainly believed that a man named Jesus lived, and that that man's teachings were of great value.\n\n Yes: I did notice that you had made the same point. The other poster (gnojek) gave me the strong impression that Jefferson had two separate people in mind rather than one with \"two natures\". I was just trying to clarify the matter with him.\n \n From my limited knowledge of Jefferson's religious perspective, I would say that you are correct in describing him as a Deist. While the secular enlightenment opened the way for at least the intelligentsia to \"come out\" as atheists, many prudent scholars (Jefferson among them) opted for a Deist position that would not expose them to reactionary ecclesiasticism.", 
   {}, 
   155192, 
   null, 
   1124184120.0
  ], 
  [
   155244, 
   null, 
   "Alan Ryan", 
   "According to Christian doctrine, Jesus was the Son of God, made man and crucified for our sins as a man. He then was resurected from the dead. Jefferson made the distinction between Jesus, the man and Jesus the Christ.\n\n This is the kernel of what I was taught about Jesus the Christ at my (Catholic) school. \n \n I thought one of the other posters was rather ambiguous and seemed to have been suggesting that Jefferson had two separate human beings in mind for the distinction being discussed. I seem to have been mistaken and I accept the explanation given by DamEtel.", 
   {}, 
   155194, 
   null, 
   1124184480.0
  ], 
  [
   167864, 
   null, 
   "Ringu", 
   "\"The philosopher has never killed any priests, whereas the priest has killed a great many philosophers.\"\n -- Denis Diderot\n\n Well not literally. But yes, some philosophers kill priests. Yet many save them.\n \n Also, what kind of priests is this quote talking about?\n \n Moreover, even though philosophers didn't kill priests, result of their philosophy was sometimes quite massive... take Nitzsche and Hitler as example.", 
   {}, 
   153517, 
   null, 
   1128402480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Just a couple quotes I ran across", 
  "url": "http://www.4forums.com/political/philosophy-debates/6145-just-couple-quotes-i-ran-across.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 6145, 
  "discussion_files": [
   [
    "26558.html", 
    "http://www.4forums.com/political/philosophy-debates/6145-just-couple-quotes-i-ran-across-print.html"
   ], 
   [
    "26559.html", 
    "http://www.4forums.com/political/philosophy-debates/6145-just-couple-quotes-i-ran-across-3-print.html"
   ], 
   [
    "26560.html", 
    "http://www.4forums.com/political/philosophy-debates/6145-just-couple-quotes-i-ran-across-2-print.html"
   ]
  ], 
  "identifier": 6145
 }
]