[
 [
  [
   153667, 
   null, 
   "emoreno2292", 
   "Has anyone noticed nowadays how powerful Christian coalitions have become? Not only have they forced intelligent design to be taught in science classes, but now they impose their christian morality upon us all? What are your opinions on this?", 
   {
    "post_info": {
     "post_title": "Dag nabbit, does seperation of church and state mean anything anymore?"
    }
   }, 
   null, 
   null, 
   1123526640.0
  ], 
  [
   153670, 
   null, 
   "georged", 
   "Has anyone noticed nowadays how powerful Christian coalitions have become? Not only have they forced intelligent design to be taught in science classes, but now they impose their christian morality upon us all? What are your opinions on this?\n\n \n Mental inbreeding is always a numerically powerful political tool with limited intellectual requirements.", 
   {}, 
   153667, 
   null, 
   1123527540.0
  ], 
  [
   153682, 
   null, 
   "sinjin", 
   "Has anyone noticed nowadays how powerful Christian coalitions have become? Not only have they forced intelligent design to be taught in science classes, but now they impose their christian morality upon us all? What are your opinions on this?\n\n \n It was worse in the 17th century. Cheer up.", 
   {}, 
   153667, 
   null, 
   1123529280.0
  ], 
  [
   153739, 
   null, 
   "Kronus", 
   "It was worse in the 17th century. Cheer up.\n\n \n Yeah, but it was better 20 years ago. If we put some effort into it now we can insure that the cycle only takes a couple of decades to swing back, and not a couple of centuries.", 
   {}, 
   153682, 
   null, 
   1123542300.0
  ], 
  [
   153776, 
   null, 
   "marc9000", 
   "Has anyone noticed nowadays how powerful Christian coalitions have become? Not only have they forced intelligent design to be taught in science classes, but now they impose their christian morality upon us all? What are your opinions on this?\n\n \n It's merely a reaction to today's unprecidented anti-Christian movements.\n \n Separation of church & state never did mean much, since it's not in the Constitution.", 
   {}, 
   153667, 
   null, 
   1123553220.0
  ], 
  [
   153809, 
   null, 
   "emoreno2292", 
   "It was worse in the 17th century. Cheer up.\n\n \n Well, you've got a point there...", 
   {}, 
   153682, 
   null, 
   1123566480.0
  ], 
  [
   153832, 
   null, 
   "Matthew S", 
   "It's merely a reaction to today's unprecidented anti-Christian movements.\n \n Separation of church & state never did mean much, since it's not in the Constitution.\n\n \n \n What are these groups? Why is the christians religious freedom more important then those who wish to be left alone and not wish to particpate in christian activities?\n \n \n Do you mean the people who want to be free of having their children forced to stand and patipate in christian prayers?\n \n \n It seems to me that christians want the freedom to practice their religion any where any time, in any ones face, have the government sponsor christian activities, and make laws to enforce their brand of morality. Then when someone complains that they don't want to have to watch, participate, or have the government, which they pay taxes to support, force them to live by a christian set of morals and sue. The christians feel that their religion is under attack when it wouldn't be if they kept their religion in their churches and homes and out of peoples faces in the first place.", 
   {}, 
   153776, 
   null, 
   1123597560.0
  ], 
  [
   153872, 
   null, 
   "Kronus", 
   "It's merely a reaction to today's unprecidented anti-Christian movements.\n \n Separation of church & state never did mean much, since it's not in the Constitution.\n\n \n There is no anti-Christian movement; that's a myth generated by the religious right to justify their efforts to force their beliefs on others. If you disagree, if you really think there is such a movement, then please show me any evidence you have that it's real, I'd love to see it. And please note that scattered incidents don't qualify as a movement. Please show evidence of a co-ordinated effort, and if you can spell out exactly what this movements goals precisely are.\n \n As for seperation of church and state not being in the Consititution, of course it is, as I'm sure you well know. Not using those exact words of course, but that's what's guaranteed in the first amendment.", 
   {}, 
   153776, 
   null, 
   1123615080.0
  ], 
  [
   153881, 
   null, 
   "biccat", 
   "As for seperation of church and state not being in the Consititution, of course it is, as I'm sure you well know. Not using those exact words of course, but that's what's guaranteed in the first amendment.\n\n Actually the first amendment has two parts regarding religion:\n Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\n \n Pretty clear that there's no guarantee of seperation between the two.", 
   {}, 
   153872, 
   null, 
   1123617420.0
  ], 
  [
   153884, 
   null, 
   "georged", 
   "Actually the first amendment has two parts regarding religion:\n Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\n \n Pretty clear that there's no guarantee of seperation between the two.\n\n \n I'm not a member of any bar but in contract law congress being restrained from legislation of religious establishment (to condone) and prohibition of religious exercise is very effective separation between religion and state. As most of the founding fathers were dietists with a few agnostics, I can't even imagine agreement among them to combine government with mythical belief systems.", 
   {}, 
   153881, 
   null, 
   1123618980.0
  ], 
  [
   153888, 
   null, 
   "gnojek", 
   "Not only have they forced intelligent design to be taught in science classes, but now they impose their christian morality upon us all? What are your opinions on this?\n\n \n Where has ID ever been introduced in a classroom?\n Or more realistically, which school district has ID as part of its cirriculum?\n I've never heard of one.\n \n Maybe this cartoon will explain things: :)", 
   {
    "post_info": {
     "attachments": 1
    }
   }, 
   153667, 
   null, 
   1123619880.0
  ], 
  [
   153889, 
   null, 
   "Kronus", 
   "Actually the first amendment has two parts regarding religion:\n Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\n \n Pretty clear that there's no guarantee of seperation between the two.\n\n \n If Congress can't prohibit the exercise of religion, that means they can't muck with religion. If Congress can't respect an establishment of religion, that means that a religion can't muck with the government. If two things can't muck with each other, then they're seperate. I'd have to say that it's utterly clear that there is a guarantee, so would you mind expanding on how there isn't one? I trully don't see how you started with your opening sentence and reached your conclusion.", 
   {}, 
   153881, 
   null, 
   1123620120.0
  ], 
  [
   153890, 
   null, 
   "gnojek", 
   "I'm not a member of any bar but in contract law congress being restrained from legislation of religious establishment (to condone) and prohibition of religious exercise is very effective separation between religion and state. As most of the founding fathers were dietists with a few agnostics, I can't even imagine agreement among them to combine government with mythical belief systems.\n\n Yes, but I think that the specific wording of the establishment clause leaves some room for interpretation, and under the pre-civil war (pre 14th ammendment) constitution there was some room for states to \"establish\" or \"regulate\" religion since Congress would not be involved. But the way it's interpreted now, the 14th ammendment means, in effect, that the states also cannot establish religion.\n \n If there was originally meant to be a true seperation of church and state, then the establishment clause would have read more like the other ammendments in the bill of rights. For instance, the 4th ammendment: \"The right of the people... shall not be violated...\" \n \n If there was originally intended to be a solid seperation of church and state then the establishment clause would have read something more like:\n \"The right to free exercise of religion shall not be abrigded...\"", 
   {}, 
   153884, 
   null, 
   1123620600.0
  ], 
  [
   153899, 
   null, 
   "Kronus", 
   "\n If there was originally meant to be a true seperation of church and state, then the establishment clause would have read more like the other ammendments in the bill of rights. For instance, the 4th ammendment: \"The right of the people... shall not be violated...\" \n \n If there was originally intended to be a solid seperation of church and state then the establishment clause would have read something more like:\n \"The right to free exercise of religion shall not be abrigded...\"\n\n \n By that reasoning freedom of speech and the press would also not be solid rights, since they use exactly the same wording, and in fact are part of the same sentence, as the establishment clause. All of the amendments in the Bill of Rights use slightly different turns of phrase; I really don't think the intention there was to say that they really really meant it with some of the amendments, and only sort of meant it on others, based soley on subtelties of wording.", 
   {}, 
   153890, 
   null, 
   1123622760.0
  ], 
  [
   153949, 
   null, 
   "biccat", 
   "If Congress can't prohibit the exercise of religion, that means they can't muck with religion. If Congress can't respect an establishment of religion, that means that a religion can't muck with the government. If two things can't muck with each other, then they're seperate. I'd have to say that it's utterly clear that there is a guarantee, so would you mind expanding on how there isn't one? I trully don't see how you started with your opening sentence and reached your conclusion.\n\n Free exercise clause:\n - The government cannot pass laws, for example, prohibiting people from wearing symbols of their religious beliefs, such as a cross, burqa, or pentagram.\n \n Establishment clause:\n - The government cannot require you to join a particular religion, nor can they adopt a state religion.\n \n Both clauses are a restriction on the activities of the government. The Constitution's purpose is to limit government's ability. It has no effect on entities outside of the government.\n \n The Constution very well could have stated that the church and government could, in no way, interfere with eachother. However, this would have resulted in some fairly absurd results, and religions would have nearly complete freedom to do whatever they want without fear of government intervention.", 
   {}, 
   153889, 
   null, 
   1123634160.0
  ], 
  [
   153961, 
   null, 
   "GuyWithNoBrain", 
   "Where has ID ever been introduced in a classroom?\n Or more realistically, which school district has ID as part of its cirriculum?\n I've never heard of one.\n \n Maybe this cartoon will explain things: :)\n\n My school teaches it. I live in texas which is a big christian state. If you try to tell off any christian person, 500 christian people will come to \"cleanse\" your soul. My school teaches ID in its curriculum even though though its not suppose to be there. the teachers just simply drop it into the evolution chapter. Even after i complain to the vice principal, all he said is \" hey kid this is texas...nothing you can do about.\" What I did was debate my teacher in the subject of evolution vs ID. In the end i won the debate but he won the argument by giving me detention. :xcensored", 
   {}, 
   153888, 
   null, 
   1123638300.0
  ], 
  [
   153982, 
   null, 
   "emoreno2292", 
   "I feel for you... I live in small town Delaware, and whenever I would raise objections to christianity people would immediately bite my head off. Around here it's bad if you're an atheist; what's worse still is if you're gay.\n Pity I'm both. I have to get out of here.", 
   {}, 
   153961, 
   null, 
   1123644360.0
  ], 
  [
   153984, 
   null, 
   "marc9000", 
   "There is no anti-Christian movement; that's a myth generated by the religious right to justify their efforts to force their beliefs on others. If you disagree, if you really think there is such a movement, then please show me any evidence you have that it's real, I'd love to see it. And please note that scattered incidents don't qualify as a movement. Please show evidence of a co-ordinated effort, and if you can spell out exactly what this movements goals precisely are. \n\n \n I think the \"movements\" don't attempt to identify themselves as anti-Christian or satanic, they simply try to invoke activities into our society that have never traditionally been there, to cheapen Christianity. Things like state lotteries, casino gambling, gay marriage, smut on the internet and cable television - all things that were all but completely absent \"20 years ago\". \"Movements and goals\" that go back a little further than 20 years would be Hollywood and the music industry's largely subliminal jabs at things like parental authority and morals in general. \n \n \nAs for seperation of church and state not being in the Consititution, of course it is, as I'm sure you well know. Not using those exact words of course, but that's what's guaranteed in the first amendment.\n\n \n Those exact words were written by Thomas Jefferson to the Danbuy Baptists in 1802, and have been debated and discussed ever since. A few liberal Supreme Court justices along with our liberal news media have done an amazing job of convincing many uninformed people that they are in the Constitution.", 
   {}, 
   153872, 
   null, 
   1123645920.0
  ], 
  [
   153988, 
   null, 
   "marc9000", 
   "I'm not a member of any bar but in contract law congress being restrained from legislation of religious establishment (to condone) and prohibition of religious exercise is very effective separation between religion and state. As most of the founding fathers were dietists with a few agnostics, I can't even imagine agreement among them to combine government with mythical belief systems.\n\n \n Can you imagine the first president proclaiming a national day of Thanksgiving to Almighty God within days of the vote on the Bill of Rights? Why didn't all these \"diests\" object? \n \n Can you imagine the very effective separation between religion and state originally applying ONLY to Congress, and not to the states? They did not prohibit states from establishing religions, and several of them did. That has changed since the days of all those \"diests\", and I think it's a good thing. You'd think athiests would be satisfied with that. But it seems that those who seek to destroy Christianity are never satisfied.", 
   {}, 
   153884, 
   null, 
   1123646640.0
  ], 
  [
   154015, 
   null, 
   "Kronus", 
   "Free exercise clause:\n - The government cannot pass laws, for example, prohibiting people from wearing symbols of their religious beliefs, such as a cross, burqa, or pentagram.\n \n Establishment clause:\n - The government cannot require you to join a particular religion, nor can they adopt a state religion.\n \n Both clauses are a restriction on the activities of the government. The Constitution's purpose is to limit government's ability. It has no effect on entities outside of the government.\n \n\n We seem to agree that the free excercise clause means that the government can't mess with religion. The establishment clause, while it does do what you say, also means that the government can't make laws based solely on religion. \n They can not, for example, pass a law forbidding you to take the lord's name in vain, or forbidding you to eat pork, or requiring that women wear veils. Laws must have a secular purpose, they can't be solely religious. That's what I meant when I said that religion can't mess with government.\n \n \n \n\n The Constution very well could have stated that the church and government could, in no way, interfere with eachother. However, this would have resulted in some fairly absurd results, and religions would have nearly complete freedom to do whatever they want without fear of government intervention.\n\n Clearly the seperation wasn't meant to be absolute, any more than freedom of speech means you can yell fire in a theater, or the right to bear arms means you can own a nuke. Common sense still applies; you can't kill someone and say that your religion demands human sacrifice, for example. The fact that the seperation wasn't meant to be absolute doesn't mean that it wasn't meant to be. Like everything else in the Bill of Rights it's meant to be taken seriously, but tempered with common sense.", 
   {}, 
   153949, 
   null, 
   1123652100.0
  ], 
  [
   154023, 
   null, 
   "Kronus", 
   "I think the \"movements\" don't attempt to identify themselves as anti-Christian or satanic, they simply try to invoke activities into our society that have never traditionally been there, to cheapen Christianity. Things like state lotteries, casino gambling, gay marriage, smut on the internet and cable television - all things that were all but completely absent \"20 years ago\". \"Movements and goals\" that go back a little further than 20 years would be Hollywood and the music industry's largely subliminal jabs at things like parental authority and morals in general. \n \n\n \n That's not a movement! And it certainly isn't anti-christian. That's just people living their lives the way they choose to. Don't like lotteries? Then don't play them. Don't subscribe to cable if you don't like what's on there. Absolutely nothing you describe prevents you from following your religion in the way that you wish. It only means that others aren't living their lives in the way that you would wish. And that's the way it should be. Just as no one should tell you to stop acting the way you feel your religion requires, you shouldn't expect people to live a certain way, based on your beliefs. People may not be following your religious standards, but that isn't an attack on Christianity. As long as you personally can follow your religion then talk of an anti-christian movement is just scare tactics.\n \n \n\n A few liberal Supreme Court justices along with our liberal news media have done an amazing job of convincing many uninformed people that they are in the Constitution.\n\n There's no liberal conspiracy to make people think those words are in the Constitution! That's just silliness. The concept is in there, that's clear. And given that the concept is there what would be the point of this campaign to fool people into thinking that the actual words are there?", 
   {}, 
   153984, 
   null, 
   1123652820.0
  ], 
  [
   154051, 
   null, 
   "Big_Bear_Scot", 
   "I don't understand all the fuss about separation between State and Religion, in the UK our Head of State is also the Head of the Church of England. The Bishops in the Church of England are appointed by Royal Prerogative by the Prime Minister .\n \n Also those Bishops then can sit in the House of Lords, which is our Upper Chamber which revises and scrutinises bills created in the House of Commons. So in effect the State Religion has a say in the passage of Laws in my Country.\n \n Now I am not entirely happy about Unelected Bishops having a say in the running of the Country, but I have seen no evidence of Christians forcing their views on the population of the UK. \n \n I am more unhappy that the second chamber is unelected than Bishops of Church England siting in it.", 
   {}, 
   154023, 
   null, 
   1123670580.0
  ], 
  [
   154055, 
   null, 
   "Clive14", 
   "...Now I am not entirely happy about Unelected Bishops having a say in the running of the Country, but I have seen no evidence of Christians forcing their views on the population of the UK. ..\nMost shops have restricted opening times on Sundays and cannot open at all on Easter Sunday. This is a direct result of Christians forcing their views on the population of the UK. \n \n Admitedly it is the only example I can think of though.", 
   {}, 
   154051, 
   null, 
   1123672260.0
  ], 
  [
   154059, 
   null, 
   "Big_Bear_Scot", 
   "Most shops have restricted opening times on Sundays and cannot open at all on Easter Sunday. This is a direct result of Christians forcing their views on the population of the UK.\n \n \n Not in Scotland though, I am sure that only applied in England & Wales.\n \n The only other thing I can think of is that shops and pubs are not allowed to sell alcohol before 1230 on a Sunday(in Scotland). But I am unsure if that is because of Religious Reasons or to stop us Scots binge drinking( ;) ). Also I don't think it was becasue of the Bishops of the CoE sitting in the House of Lords .\n \n edit found this http://www.nationmaster.com/encyclopedia/Sunday-shopping Scroll down to the UK. It seems in Scotland it was left up to the local Council, it seems like the Western Isles do not permit shopping on Sundays.", 
   {}, 
   154055, 
   null, 
   1123673700.0
  ], 
  [
   154090, 
   null, 
   "zachvac", 
   "What are these groups? Why is the christians religious freedom more important then those who wish to be left alone and not wish to particpate in christian activities?\n \n \n Do you mean the people who want to be free of having their children forced to stand and patipate in christian prayers?\n \n \n It seems to me that christians want the freedom to practice their religion any where any time, in any ones face, have the government sponsor christian activities, and make laws to enforce their brand of morality. Then when someone complains that they don't want to have to watch, participate, or have the government, which they pay taxes to support, force them to live by a christian set of morals and sue. The christians feel that their religion is under attack when it wouldn't be if they kept their religion in their churches and homes and out of peoples faces in the first place.\n\n \n What they are doing is fine up to the point where the government sponsors it. They may \"practice their religion any where any time, in any ones face\" as long as it doesn't impede on anyone else's rights. So burning someone to the stake in the name of religion is clearly violating the right to life. The problem is that the entire country pays money to the government in the form of taxes and these taxes shouldn't be used to sponsor religion. This is a representative democracy, and I don't like it when the people representing me publicly denounce my religious views (when they say \"in God we trust\" and such)\n \n If they would keep religion in the churches where they belong, that would be ideal. Even if they want to take it into public, that's fine too. But we draw the line at government, that was made clear in the very first amendment of the Constitution. Religion doesn't belong in government.", 
   {}, 
   153832, 
   null, 
   1123692900.0
  ], 
  [
   154091, 
   null, 
   "SymonTemplar", 
   "To me it entirely depends on the manner in which it is presented. I remember learning the basics of belief and such of the Islamic religion in high school. It was taught in world civ. How exactly is simply learning about another perspective on something in an instituton that is supposed to promote objectivity and open mindedness a bad thing precisely?", 
   {}, 
   154059, 
   null, 
   1123693020.0
  ], 
  [
   154092, 
   null, 
   "zachvac", 
   "Where has ID ever been introduced in a classroom?\n Or more realistically, which school district has ID as part of its cirriculum?\n I've never heard of one.\n \n Maybe this cartoon will explain things: :)\n\n \n \n Montgomery County Public schools in Maryland has ID as part of the biology curriculum.\n \n Now to be fair pretty much all they said was that some people believe it and that it had no scientific evidence, but that it was possible.", 
   {}, 
   153888, 
   null, 
   1123693140.0
  ], 
  [
   154098, 
   null, 
   "biccat", 
   "They can not, for example, pass a law forbidding you to take the lord's name in vain, or forbidding you to eat pork, or requiring that women wear veils. Laws must have a secular purpose, they can't be solely religious. That's what I meant when I said that religion can't mess with government.\n\n Again, you're not really saying that religion can't mess with government, you're saying that the government cannot establish religious laws.\n \n I don't think you really get the way laws are passed, there is no innate secular purpose. What is the 'secular purpose' behind allowing states to limit alcohol sales on Sunday? Or the 'secular purpose' behind prohibiting murder and drug use? How about prostitution laws, or laws that permit marriages?\n \n There's an inherent morality behind all laws. We prohibit murder because it's morally wrong. We prohibit prostitution for a similar reason. The modern trend is towards a secular humanist morality, as opposed to the traditional Christian morality.\n \n A good question would be: why do we permit a secular humanist morality to drive our laws, but ban Christian laws on the basis of \"separation of church and state\"?", 
   {}, 
   154015, 
   null, 
   1123695300.0
  ], 
  [
   154101, 
   null, 
   "Kronus", 
   "Again, you're not really saying that religion can't mess with government, you're saying that the government cannot establish religious laws.\n\n In what other way could a religion mess with the government, if not by having its doctrine be made into law? Aside from armed rebellion of course. :) \n \n \n\n I don't think you really get the way laws are passed, there is no innate secular purpose. What is the 'secular purpose' behind allowing states to limit alcohol sales on Sunday? Or the 'secular purpose' behind prohibiting murder and drug use? How about prostitution laws, or laws that permit marriages?\n \n There's an inherent morality behind all laws. We prohibit murder because it's morally wrong. We prohibit prostitution for a similar reason. The modern trend is towards a secular humanist morality, as opposed to the traditional Christian morality.\n\n Morals can be, and often are, secular. People are capable of telling right from wrong without having to base their reasoning on \"God said so.\" For example, some of the secular purposes behind prohibiting murder are that if murder were allowed chaos would ensue, and nobody wants to be murdered and so it shouldn't be allowed.\n \n \n\n A good question would be: why do we permit a secular humanist morality to drive our laws, but ban Christian laws on the basis of \"separation of church and state\"?\n\n That's an easy one. If a person comes up and says \"I think such and such is wrong, and here are my reasons.\" you can examine those reasons, discuss them, and if you don't fully agree then perhaps a compromise postion can be found. If someone say \"I think such and such is wrong , because God said so.\" then there's no room for debate or compromise, you either believe in that God and in that person's interpretation of that God's will or you don't. If you try to base laws on religion then you either force everyone to follow the same religion or nothing gets done. If you base laws on secular reasoning than you can have honest debate and actually get some good law written.", 
   {}, 
   154098, 
   null, 
   1123696980.0
  ], 
  [
   154104, 
   null, 
   "biccat", 
   "In what other way could a religion mess with the government, if not by having its doctrine be made into law? Aside from armed rebellion of course.\n\n Religions could provide funding to certain politicians, they could publicly support a politician, they could voice their opinions on certain laws and decisions, or encourage their members to vote a certain way.\n \n All of these are permitted, despite the fact that \"religions can't mess with government.\"\n \n \nMorals can be, and often are, secular. People are capable of telling right from wrong without having to base their reasoning on \"God said so.\" For example, some of the secular purposes behind prohibiting murder are that if murder were allowed chaos would ensue, and nobody wants to be murdered and so it shouldn't be allowed.\n\n What about selling alcohol on Sunday, or anti-prostitution laws?\n \n \nThat's an easy one. If a person comes up and says \"I think such and such is wrong, and here are my reasons.\" you can examine those reasons, discuss them, and if you don't fully agree then perhaps a compromise postion can be found.\n\n But we do this all the time. Why do medical researchers have an ethical code that prohibits experiments on humans except in carefully controlled situations? The fact is that there is an underlying morality, based on more than weighing the pros and cons of a certain course of action. There are certain issues on which (historically) there can be no compromise, even if people disagree with the issue (drug use, prostitution, euthenasia, human experimentation, etc.).", 
   {}, 
   154101, 
   null, 
   1123698420.0
  ], 
  [
   154110, 
   null, 
   "Kronus", 
   "Religions could provide funding to certain politicians, they could publicly support a politician, they could voice their opinions on certain laws and decisions, or encourage their members to vote a certain way.\n \n All of these are permitted, despite the fact that \"religions can't mess with government.\"\n \n\n Sure they're permitted, as examples of freedom of speech. As I said, the enforcement of the bill of rights must be tempered with common sense. According to the first amendment people are allowed to say, \"write this law based on my religion.\" And the government is then required to say no, also due to the first amendment.\n \n \n\n What about selling alcohol on Sunday, or anti-prostitution laws?\n \n\n What about them? You were saying that laws are based on morals, and are therefore religious and not secular. I gave a counter example to show that your claim was incorrect. The fact that some laws, like no booze on sunday, do have a religious basis just shows that the system is imperfect and things slip through, not that laws aren't or shouldn't be secular.\n \n \n\n But we do this all the time. Why do medical researchers have an ethical code that prohibits experiments on humans except in carefully controlled situations? The fact is that there is an underlying morality, based on more than weighing the pros and cons of a certain course of action. There are certain issues on which (historically) there can be no compromise, even if people disagree with the issue (drug use, prostitution, euthenasia, human experimentation, etc.).\n\n I agree that there is an underlying morallity. However, I don't belive, as you seem to imply, that religion provides that morallity. Rather I think that religions have tapped into and codified that morality. The principle came first, and religions adopted it. And what is this basic moral principle? Simply put, things that hurt people are bad and things that help people are good. Vastly oversimplified of course, and with lots of room for discussion, but I believe that that is the esssence of any succesful moral system, including the religious ones. So to use your first example, why does the medical code of ethics strictly regulate human experimentation? Not because God told them to do it that way, but because they want to insure as much as possible that they do more good than harm. The risk of harm to the individuals being experimented on must be outweighed by the good the experiments are expected to do.", 
   {}, 
   154104, 
   null, 
   1123700280.0
  ], 
  [
   154150, 
   null, 
   "gnojek", 
   "By that reasoning freedom of speech and the press would also not be solid rights, since they use exactly the same wording, and in fact are part of the same sentence, as the establishment clause.\n\n Right.\n \n At one point in our history it wasn't clear that a person was guaranteed free speech and press.\n \n The federal government, or really only Congress, was the only body restricted from infringing upon these rights.\n \n State legislatures could make some law (not after the equal protection clause) or a governor could give an executive order to restrict speech or press or religion.\n \n In court they couls argue that Congress wasn't involved so it was constitutional.\n \n That's my take on it, anyway (I wasn't there.)\n \n \nAll of the amendments in the Bill of Rights use slightly different turns of phrase; I really don't think the intention there was to say that they really really meant it with some of the amendments, and only sort of meant it on others, based soley on subtelties of wording.\n\n The Constitution is very carefully worded.\n Each wording is slightly different based on how those words could be interpreted.\n \n The \"subtleties\" are programmed in from the get go.", 
   {}, 
   153899, 
   null, 
   1123712340.0
  ], 
  [
   154151, 
   null, 
   "gnojek", 
   "My school teaches it. I live in texas which is a big christian state. If you try to tell off any christian person, 500 christian people will come to \"cleanse\" your soul. My school teaches ID in its curriculum even though though its not suppose to be there. the teachers just simply drop it into the evolution chapter. Even after i complain to the vice principal, all he said is \" hey kid this is texas...nothing you can do about.\" What I did was debate my teacher in the subject of evolution vs ID. In the end i won the debate but he won the argument by giving me detention. :xcensored\n\n You're making that up? You have to be.\n Wow, this country has changed...", 
   {}, 
   153961, 
   null, 
   1123712460.0
  ], 
  [
   154152, 
   null, 
   "gnojek", 
   "Montgomery County Public schools in Maryland has ID as part of the biology curriculum.\n \n Now to be fair pretty much all they said was that some people believe it and that it had no scientific evidence, but that it was possible.\n\n This is amazing to me.\n It totally blows my mind.\n \n They're slipping it in anyway.\n Sort of stealth creationism education...\n \n Little by little they'll get the Bible into public schools...\n \n It's a MOVEMENT...", 
   {}, 
   154092, 
   null, 
   1123712640.0
  ], 
  [
   154186, 
   null, 
   "biccat", 
   "State legislatures could make some law (not after the equal protection clause) or a governor could give an executive order to restrict speech or press or religion.\n\n Quite early in the country's history certain of the basic freedoms were determined to extend to the states, explicitly freedom of religion, speech, and the press, mainly because these rights were inalienable, and citizens of the US were entitled to them, and the individual states couldn't circumvent them.\n \n After the 14th amendment was passed, section 5 only applied to the provisions of the 14th amendment: namely equal protection, etc. Since the 14th amendment concerned the duties of states, and Congress was explicitly given authority to enforce the provisions of the 14th amendment, this was a backdoor for Congress to have absolute authority over the states.\n \n Since then, most of the provisions of the Constitution and Bill of Rights have been incorporated into the 14th amendment, so that the Federal Government has nearly absolute authority over the states. Particularly the Seventh and parts of the Fifth amendments haven't yet been incorporated, and it's unlikely that they will be.", 
   {}, 
   154150, 
   null, 
   1123718040.0
  ], 
  [
   154241, 
   null, 
   "marc9000", 
   "That's not a movement! And it certainly isn't anti-christian. That's just people living their lives the way they choose to. Don't like lotteries? Then don't play them. Don't subscribe to cable if you don't like what's on there. Absolutely nothing you describe prevents you from following your religion in the way that you wish. \n\n \n The opening post of this thread didn't specify any certain threats from Christian Coalitions that insist that you be religious. Can you name any? If you can, we'll compare them to some threats by the ACLU, and AU. (Americans United) We'll also compare the political influence of the sources of the threats.\n \n \n \n It only means that others aren't living their lives in the way that you would wish. And that's the way it should be. Just as no one should tell you to stop acting the way you feel your religion requires, you shouldn't expect people to live a certain way, based on your beliefs. People may not be following your religious standards, but that isn't an attack on Christianity. As long as you personally can follow your religion then talk of an anti-christian movement is just scare tactics. \n\n \n Not everything can be broken down into three neat catagories. (Christian, anti-Christian, and neutral.) Neutrality often isn't an issue in a society full of humans, humans who often have problems with purpose, failure, loss, sickness, disability, birth, and death. Neutrality and anti-Christianity are indistinguishable in many cases - they have the same non-answers. Life is meaningless, if it feels good do it. Live for the moment. And society is jeapordized by it. The framers and yesterdays general public knew it, judging from the almost countless times public money funded religious organizations in the U.S. first 150 years of existance.\n \n \nThere's no liberal conspiracy to make people think those words are in the Constitution! That's just silliness. The concept is in there, that's clear. And given that the concept is there what would be the point of this campaign to fool people into thinking that the actual words are there?\n\n \n The concept is NOT there, not in the Constitution. It IS in judicial activism. I think you're confusing the two.", 
   {}, 
   154023, 
   null, 
   1123725960.0
  ], 
  [
   154268, 
   null, 
   "Kronus", 
   "The opening post of this thread didn't specify any certain threats from Christian Coalitions that insist that you be religious. Can you name any? If you can, we'll compare them to some threats by the ACLU, and AU. (Americans United) We'll also compare the political influence of the sources of the threats.\n\n Of course it did, what post were you reading? It specifically talked about religious activists trying to replace science with religious dogma. Now name one single thing that the ACLU has done that prevents you from worshipping in the way that you like. \n \n \n \n\n Not everything can be broken down into three neat catagories. (Christian, anti-Christian, and neutral.) Neutrality often isn't an issue in a society full of humans, humans who often have problems with purpose, failure, loss, sickness, disability, birth, and death. Neutrality and anti-Christianity are indistinguishable in many cases - they have the same non-answers. Life is meaningless, if it feels good do it. Live for the moment. And society is jeapordized by it. The framers and yesterdays general public knew it, judging from the almost countless times public money funded religious organizations in the U.S. first 150 years of existance.\n\n Don't you see what you're saying here? You're insisting that you, and only you, have the right answers on how to live life. And you want to impose those answers on everyone else. Sorry, but you don't get to. Everyone gets to decide for themselves which religious path, if any, to follow. You're not asking for the freedom to practice your own religion, you're looking for the authority to cram it down other people's throats. You wouldn't stand for it if someone tried to forceably convert you, why are you trying to do the same thing to others? Can't you see how hypocritical that is?\n \n \n \n\n The concept is NOT there, not in the Constitution. It IS in judicial activism. I think you're confusing the two.\n\n It is there. If you won't believe me than ask any Constitutional lawyer. I'll do some googling on my own just in case you don't happen to know any and get back to you.\n In the mean time, what do you think the first amendment is saying?", 
   {}, 
   154241, 
   null, 
   1123732980.0
  ], 
  [
   154275, 
   null, 
   "biccat", 
   "It is there. If you won't believe me than ask any Constitutional lawyer.\n\n Here's a good one, if you're interested. He specializes in law and religion, and was a commentator on the Constitutional issue during the 2000 election. I'd be curious as to what he has to say on the issue.\n \n And FYI: the Supreme Court has said that seperation is inherent in the establishment clause, but that doesn't necessarily mean that it is. Heck, they somehow found a right to abortion in the Constitution.", 
   {}, 
   154268, 
   null, 
   1123735500.0
  ], 
  [
   154276, 
   null, 
   "zachvac", 
   "This is amazing to me.\n It totally blows my mind.\n \n They're slipping it in anyway.\n Sort of stealth creationism education...\n \n Little by little they'll get the Bible into public schools...\n \n It's a MOVEMENT...\n\n \n Well we already have a religious studies teacher who describes atheism as a phase all teens go through before they discover God. I have decided that if I want to study religion, I can do my own research.\n \n But even worse, and to GuyWithNoBrain, our biology teacher told us that there are 2 versions of the tape she showed us, the normal one, discussing evolution, and the Texas version.\n \n The Texas version never used the word evolution, but it used words like change and such, to try to convince kids that species changing (they couldn't refute that) wasn't evolution, but ID, which God created. Pretty much our biology teacher just told us that it was required that she mention it and there was a whole unit on arguments against evolution and their flaws.\n \n But regardless, ID in science class has just as much merit as an \"I created the world\" claim. It's a non-provable claim with no place in science. It belongs in a religion class, not science. Science is involved with observation and testing, neither of which can be done with ID. It could be true, but it is not science.", 
   {}, 
   154152, 
   null, 
   1123735560.0
  ], 
  [
   154282, 
   null, 
   "Dono", 
   ", our biology teacher told us that there are 2 versions of the tape she showed us, the normal one, discussing evolution, and the Texas version.\n\n zachvac, my young friend, I am pleased to learn you are from Texas.\n Dono", 
   {}, 
   154276, 
   null, 
   1123736400.0
  ], 
  [
   154284, 
   null, 
   "zachvac", 
   "zachvac, my young friend, I am pleased to learn you are from Texas.\n Dono\n\n \n emoticon_confused I didn't say that, our teacher didn't show us the Texas version, just jokingly told us about it. I stated earlier I am from Maryland.", 
   {}, 
   154282, 
   null, 
   1123736520.0
  ], 
  [
   154362, 
   null, 
   "georged", 
   "emoticon_confused I didn't say that, our teacher didn't show us the Texas version, just jokingly told us about it. I stated earlier I am from Maryland.\n\n \n Having been raised in Texas as a child and teen, with many relatives still residing there, I'm surprised their educational system hasn't gone to the bible as its primary textbook. Perhaps things have changed, but fundamentalist hypocrisy was at one time the law of the land in Texas. Maybe since Texans are no longer served by Oklahoma and Louisiana bootleggers the fire and brimstone circuit has relaxed, but I'd find that difficult to believe as religion is a very effective control technique.", 
   {}, 
   154284, 
   null, 
   1123775640.0
  ], 
  [
   154364, 
   null, 
   "Truthsayer", 
   "Believe it or not, there are still plenty of folks walking around in Texas wearing that big hair with that \"space cadet glow\" that are still \"keeping the faith.\" emoticon_rolleyes \n \n Looking back on my youth in Texas, remembering the days of high school and the oppressive socialogical atmosphere that we kids were subjected to (read: backwooded religious mumbo jumbo) it's a wonder I am not traumatized. But it's all we knew. It's the way it was. Once I left and had a chance to explore the world, I found myself a bit embarassed actually. Don't get me wrong, I love Texas and I always will. Especially these days. But back in the 60's, it was pure insanity. There are still some lingerings of that archaic mindset there.", 
   {}, 
   154362, 
   null, 
   1123777020.0
  ], 
  [
   154450, 
   null, 
   "gnojek", 
   "Well we already have a religious studies teacher who describes atheism as a phase all teens go through before they discover God. I have decided that if I want to study religion, I can do my own research.\n \n But even worse, and to GuyWithNoBrain, our biology teacher told us that there are 2 versions of the tape she showed us, the normal one, discussing evolution, and the Texas version.\n \n The Texas version never used the word evolution, but it used words like change and such, to try to convince kids that species changing (they couldn't refute that) wasn't evolution, but ID, which God created. Pretty much our biology teacher just told us that it was required that she mention it and there was a whole unit on arguments against evolution and their flaws.\n \n But regardless, ID in science class has just as much merit as an \"I created the world\" claim. It's a non-provable claim with no place in science. It belongs in a religion class, not science. Science is involved with observation and testing, neither of which can be done with ID. It could be true, but it is not science.\n\n \n \n Jesus TF Christ, you are really freaking me out right now.\n \n I was even more freaked out when all in the same day Washington Journal (C-span) talked about intellegent design and then in the evening on CNN, on Newsnight with Aaron Brown. On that show they talked about ID as if it WERE actually science. They said things like \"Critics say it's like dressing God up in a lab coat.\" Critics don't say that. They wouldn't even give it that much credit. Then they kept calling it a science over and over again. I was shitting on myself.\n \n Here is an exerpt from  the transcript\n \n I've underlined the parts that made me want to hurl...\n \n \n \n \nKansas, now, and the culture wars. The Kansas Board of Education voting, today, to diminish the role of evolution in the state's science curriculum. The ballot in preliminary, the board expected to make its final decision in the next couple of months. This is round two for the state of Kansas and about round 102 for the country.\n \n But unlike prior battles, strict biblical creationism barely gets a mention. Instead, even though critics call it a way of dressing God up in a lab coat, opponents of evolution say they're fighting science with science. Here's CNN's Ed Lavendera.\n \n ED LAVENDERA, CNN CORRESPONDENT: The battle over how to teach science is erupting in Kansas.\n \n UNIDENTIFIED MALE: Leave the room, sir.\n \n UNIDENTIFIED MALE: I'm not going to leave the room.\n \n LAVENDERA: It's the latest fight to bring the theory of intelligent design to a classroom near you. The Kansas State Board of Education is considering new science curriculum standards that offer a more critical view of evolution. Supporters don't understand why many scientists aren't open to this debate.\n \n JOHN CALVERT, INTELLIGENT DESIGN SUPPORTER: They also are favoring a set of standards that do not allow or comprehend criticisms of evolution. LAVENDERA: Many teachers are angry to see what they call bad science make it into the classroom.\n \n STEVEN CASE, INTELLIGENT DESIGN OPPONENT: Those are inappropriate changes. Some for educational reasons, some for scientific reasons.\n \n LAVENDERA: Intelligent design, or I.D., as it's often called, is the idea that the universe is so complicated that some things cannot be explained by science alone, that there must be some intelligent source behind the world's creation.\n \n Intelligent design theory does not say God is responsible, that's where it differs from creationism. But skeptics say intelligent design simply disguises religion in a shroud of science. Critics often call it science fiction.\n \n STEPHEN MEYER, DISCOVERY INSTITUTE: If we put intelligent design into our biology textbooks, based on the misrepresentation of real scientific fact and the conjecture that its proponents rely on, then we may as well add the study of flying saucers and aliens from outer space to our biology and physics books.\n \n LAVENDERA: A recent Harris Interactive poll found 64 percent of Americans believe in creationism, that human beings were created directly by God. 22 percent believe in the theory of evolution. And 10 percent support intelligent design. But when it comes to the question facing hundreds of school districts around the country, 55 percent of Americans believe all three ideas should be taught in school together.\n \n Intelligent design even has President Bush's support. He says it should be taught in schools along with evolution. Supporters argue intelligent design is a legitimate science worthy of debate as an alternative to what they see as the flawed theory of evolution.\n \n JOHN COURAGE, HIGH SCHOOL SCIENCE TEACHER: We've had 150 years of one dogma ruling biology. What we're asking for is that Darwinian evolution be taught to students, but also the current scientific criticisms of the theory.\n \n LAVENDERA: Like the proverbial elephant in the room, intelligent design is roaming through classrooms and school board meetings around the country. Everyone knows it's there, but many scientists still don't want to talk to it, for fear of giving it too much credibility. But it appears intelligent design may might already be gaining in the war of acceptance.\n \n\n \n The poll numbers CANNOT be right.\n They just can't.", 
   {}, 
   154276, 
   null, 
   1123802520.0
  ], 
  [
   154485, 
   null, 
   "SymonTemplar", 
   "Funny though that you find many stellar physicists are religious. Saw one interview once with an expert on the big bang. He said science will only ever get us within micro fractions of milliseconds after the big bang. What came before will probably always be a matter of faith in his opinion.", 
   {}, 
   154450, 
   null, 
   1123807140.0
  ], 
  [
   154496, 
   null, 
   "gnojek", 
   "Funny that you'll find that most scientists in general are religious.", 
   {}, 
   154485, 
   null, 
   1123809000.0
  ], 
  [
   154506, 
   null, 
   "marc9000", 
   "Of course it did, what post were you reading? It specifically talked about religious activists trying to replace science with religious dogma. Now name one single thing that the ACLU has done that prevents you from worshipping in the way that you like. \n\n \n Post #1. Why do you insist that evolution be taught 100% and creation be taught 0%? How in the world does evening the percentages in any slight way FORCE a student to be religious? If more than half of the taxpayers who fund education believe in creation, why shouldn't it be taught? You imply that evolution with no creator involved is a proven fact. It is not.\n \n The Supreme court, (often influenced by the ACLU and other anti-Christians) recently ruled that private property can be taken (with compensation, but without owner consent) by government and transferred to another private interest, for the public good. (increased tax revenue = public good) Churches are one of the lowest generators of tax revenue compared to for-profit business. Churches WILL BE seized, and it's members will be prevented from worshiping the way they like.\n \n \n \nDon't you see what you're saying here? You're insisting that you, and only you, have the right answers on how to live life. \n\n \n Please read it again. I DIDN'T say me and only me, I said the framers and the general public.\n \n \n And you want to impose those answers on everyone else. Sorry, but you don't get to. Everyone gets to decide for themselves which religious path, if any, to follow. You're not asking for the freedom to practice your own religion, you're looking for the authority to cram it down other people's throats. You wouldn't stand for it if someone tried to forceably convert you, why are you trying to do the same thing to others? Can't you see how hypocritical that is? \n\n \n I'm not trying to forceably convert anyone. I'm saying that the general public, the text of the constitution, and the intent of the framers should be able to HOLD THE LINE in newly legalizing reckless, selfish behaviors that statistics and history show will lead to more and more unproductive people that will have to be propped up by taxpayers.\n \n \n \n \nIt is there. If you won't believe me than ask any Constitutional lawyer. I'll do some googling on my own just in case you don't happen to know any and get back to you. \n\n \n I know of several without searching. Ann Coulter is a constitutional attorney.\n \n \n \nIn the mean time, what do you think the first amendment is saying?\n \n \n It says that Congress can't establish ONE religion (like the Church of England of that era - 1791) nor prohibit the free exersise therof. That's what it says, and it took effect on 12-15-1791. TWO WEEKS LATER, George Washington proclaimed the next 26th of November as a day to be \"devoted by the people of these States to the service of that great and glorious Being\".... If you can't find any historical evidence showing a huge uproar about it, then it's clear what the framers thought the first amendment said.\n \n Why don't you just say that you don't agree with the framers?", 
   {}, 
   154268, 
   null, 
   1123811100.0
  ], 
  [
   154513, 
   null, 
   "Kronus", 
   "Post #1. Why do you insist that evolution be taught 100% and creation be taught 0%? \n \n\n Evolution is science, creation is religion. If you want to teach creation, teach it in a religious studies class, or philosphy, or something in that vein. To teach creation in science class is to elevate a religious view to the realm of scientific truth. And that is clearly establishing a religion.\n \n \n \n\n Please read it again. I DIDN'T say me and only me, I said the framers and the general public.\n \n\n I think you need to read your own post again. You are saying that your view on how to lead your life is correct, and the view of anyone who feels differently is wrong. And you want your religious views given the weight of law to enforce your morality. If the \"general public\" did in fact share your views then we wouldn't be having this discussion, would we? No one would be engaging in these so called \"anti-christian\" activities that you feel we need protection from. But they are, and so you want to stop them by having your religious views elevated to law.\n \n \n\n I'm not trying to forceably convert anyone. I'm saying that the general public, the text of the constitution, and the intent of the framers should be able to HOLD THE LINE in newly legalizing reckless, selfish behaviors that statistics and history show will lead to more and more unproductive people that will have to be propped up by taxpayers.\n \n\n Again you are saying that you need to impose your religion on others. You're pretending that you're trying to save them from \"immorality\", but your definition of immorality is simply that which doesn't agree with your religion. There are social problems, but they won't be solved by forcing others to worship the way you do, or making them march in lock step with your dogma. \n \n \n \n\n It says that Congress can't establish ONE religion (like the Church of England of that era - 1791) nor prohibit the free exersise therof. That's what it says, and it took effect on 12-15-1791. TWO WEEKS LATER, George Washington proclaimed the next 26th of November as a day to be \"devoted by the people of these States to the service of that great and glorious Being\".... If you can't find any historical evidence showing a huge uproar about it, then it's clear what the framers thought the first amendment said.\n \n Why don't you just say that you don't agree with the framers?\n\n Let's quote a framer then, shall we? This is from the letter you mention.\n Thomas Jefferson:\n \"I contemplate with sovereign reverence that act of the whole American people which declared that their legislature should make no law respecting an establishment of religion, or prohibiting the free exercise thereof, thus building a wall of separation between church and state.\"\n \n Please explain to me how that can mean anything other than that the first amendment was meant to ensure a seperation of church and state.\n \n And your assertion that the first amendment merely prohibits the establishment of one state religion is ludicrious, and completely without justification. It says \"respecting an establishment of religion\". Not one religion, or a religion, but religion in general.\n \n I think the problem here is that you don't really understand what the phrase \"seperation of church and state\" means, and that's why you're so afraid of it. What does it mean to you?", 
   {}, 
   154506, 
   null, 
   1123812480.0
  ], 
  [
   154649, 
   null, 
   "Truthsayer", 
   "George Washington proclaimed the next 26th of November as a day to be \"devoted by the people of these States to the service of that great and glorious Being\".... \n \n \n Reading this, I see that George Washington was keeping in line with his Masonic tenents that endorse a Supreme Being but do not, as a group, endorse any particular diety (Jesus, Allah, Buddah, etc..) or religion, persay. In other words, he was saying, \"devoted by the people of these States to the service of that great and glorious <fill in the blanks<\" ....\n \n George Washington, the \"Father of our country\", was a Freemason as were a lot of our founding fathers. No one wanted to keep religion and government seperate any more than they did. They laid the groundwork, or the \"cornerstone,\" if you will, for our nation and, bad or good, it still stands. As does the fraternity. There's a lesson in there somewhere's. Add religion to any institution and havoc will follow. Harmony and strength are the support of all institutions, more especially of ours. That is why it is so important to keep religion at arms length and never take your eye off of it. It can be deadlier than a tornado.", 
   {}, 
   154513, 
   null, 
   1123872720.0
  ], 
  [
   154755, 
   null, 
   "marc9000", 
   "Evolution is science, creation is religion. If you want to teach creation, teach it in a religious studies class, or philosphy, or something in that vein. To teach creation in science class is to elevate a religious view to the realm of scientific truth. And that is clearly establishing a religion. \n\n \n You're putting evolution and creation on completely different levels, based only on your own views, and you're in the minority. The theory of evolution has gaping holes, requiring faith to fill them, and some of creationism has scientific credibility.\n \n \n \n \nI think you need to read your own post again. You are saying that your view on how to lead your life is correct, and the view of anyone who feels differently is wrong. And you want your religious views given the weight of law to enforce your morality. If the \"general public\" did in fact share your views then we wouldn't be having this discussion, would we? No one would be engaging in these so called \"anti-christian\" activities that you feel we need protection from. But they are, and so you want to stop them by having your religious views elevated to law.\n\n \n A minority is engaging in anti-Christian activities. Anti-Christians seem to claim the first amendment as their own exclusive property. From post 44, (not written by me);\n \n \n A recent Harris Interactive poll found 64 percent of Americans believe in creationism, that human beings were created directly by God. 22 percent believe in the theory of evolution. And 10 percent support intelligent design. But when it comes to the question facing hundreds of school districts around the country, 55 percent of Americans believe all three ideas should be taught in school together.\n\n \n \nAgain you are saying that you need to impose your religion on others. You're pretending that you're trying to save them from \"immorality\", but your definition of immorality is simply that which doesn't agree with your religion. There are social problems, but they won't be solved by forcing others to worship the way you do, or making them march in lock step with your dogma. \n\n \n I'm not talking about worship, I'm talking about morality that makes sense to the majority in a democratic republic. I'm not advocating laws because they are religious, but because the majority thinks they make sense. (and they don't violate rights guaranteed by the TEXT of the Constitution) The words, \"thou shalt not steal\" are in the Bible. Should laws against stealing be repealed? - is prohibiting stealing forcing religion on everyone? \n \n \n \n \nLet's quote a framer then, shall we? This is from the letter you mention.\n Thomas Jefferson:\n \"I contemplate with sovereign reverence that act of the whole American people which declared that their legislature should make no law respecting an establishment of religion, or prohibiting the free exercise thereof, thus building a wall of separation between church and state.\"\n \n Please explain to me how that can mean anything other than that the first amendment was meant to ensure a seperation of church and state. \n\n \n I'll let Justice William Rehnquist do it.\n \n \n It is impossible to build sound constitutional doctrine upon a mistaken understanding of constitutional history, expresssly freighted with Jefferson's misleading metaphor for nearly forty years. Thomas Jefferson was of course in France at the time the constitutional amendments known as the Bill of Rights were pressed by Congress and ratified by the States. His letter to the Danbury Baptist Association was a short note of courtesy, written fourteen years after the amendments were passed by Congress. He would seem to any detached observer as a less than ideal source of contemporary history to the meaning of the Religious Clauses of the first Amendment. \n\n \n More from Rehnquist;\n \n The Establishment Clause did not require government neutrality between religion and irreligion nor did it prohibit the Federal Government from providing nondiscriminatory aid to religion. There is simply no historical foundation for the proposition that the Framers intneded to build the \"wall of seperation\".....\n \n ....The \"wall of seperation between church and State\" is a metaphor based on bad history, a metaphor which has proved useless as a guide to judging. It should be frankly and explicitly be abandoned. \n\n \n Rehnquist again;\n \n [since 1947] our Establishment Clause cases have been neither principaled nor unified. Our recent opinions, many of them hopelessly divided pluralities, have with embarrassing candor conceded that the \"wall of separation\" is merely a blurred, indistinct, and variable barrier, which is not wholly accurate, and can only be dimly perceived.\" \n\n \n \n \n \n \nAnd your assertion that the first amendment merely prohibits the establishment of one state religion is ludicrious, and completely without justification. It says \"respecting an establishment of religion\". Not one religion, or a religion, but religion in general.\n\n \n They based how they set up our government by what they experienced in Europe. They were worried about conflicting religions, not inconvieniences to non-believers. \n \n \n \nI think the problem here is that you don't really understand what the phrase \"seperation of church and state\" means, and that's why you're so afraid of it. What does it mean to you?\n\n \n Since it's not in the Constitution, it means NOTHING to me. Now that you've read Rehnquist's words, do you understand it better?", 
   {}, 
   154513, 
   null, 
   1123903080.0
  ], 
  [
   154757, 
   null, 
   "marc9000", 
   "Reading this, I see that George Washington was keeping in line with his Masonic tenents that endorse a Supreme Being but do not, as a group, endorse any particular diety (Jesus, Allah, Buddah, etc..) or religion, persay. In other words, he was saying, \"devoted by the people of these States to the service of that great and glorious <fill in the blanks<\" ....\n \n George Washington, the \"Father of our country\", was a Freemason as were a lot of our founding fathers. No one wanted to keep religion and government seperate any more than they did. They laid the groundwork, or the \"cornerstone,\" if you will, for our nation and, bad or good, it still stands. As does the fraternity. There's a lesson in there somewhere's. Add religion to any institution and havoc will follow. Harmony and strength are the support of all institutions, more especially of ours. That is why it is so important to keep religion at arms length and never take your eye off of it. It can be deadlier than a tornado.\n\n \n Here's the entire proclaimation;\n \n \nWhereas it is the duty of all Nations to acknowledge the providence of Almighty God, to obey his will, to be grateful for his benefits, and humbly to implore his protection and favor-- and whereas both Houses of Congress have by their joint Committee requested me to recommend to the People of the United States a day of public thanksgiving and prayer to be observed by acknowledging with grateful hearts the many signal favors of Almighty God especially by affording them an opportunity peaceably to establish a form of government for their safety and happiness. \n \n Now therefore I do recommend and assign Thursday the 26th day of November next to be devoted by the People of these States to the service of that great and glorious Being, who is the beneficent Author of all the good that was, that is, or that will be-- That we may then all unite in rendering unto him our sincere and humble thanks--for his kind care and protection of the People of this Country previous to their becoming a Nation--for the signal and manifold mercies, and the favorable interpositions of his Providence which we experienced in the course and conclusion of the late war--for the great degree of tranquility, union, and plenty, which we have since enjoyed--for the peaceable and rational manner, in which we have been enabled to establish constitutions of government for our safety and happiness, and particularly the national One now lately instituted--for the civil and religious liberty with which we are blessed; and the means we have of acquiring and diffusing useful knowledge; and in general for all the great and various favors which he hath been pleased to confer upon us.\n \n and also that we may then unite in most humbly offering our prayers and supplications to the great Lord and Ruler of Nations and beseech him to pardon our national and other transgressions-- to enable us all, whether in public or private stations, to perform our several and relative duties properly and punctually--to render our national government a blessing to all the people, by constantly being a Government of wise, just, and constitutional laws, discreetly and faithfully executed and obeyed--to protect and guide all Sovereigns and Nations (especially such as have shewn kindness unto us) and to bless them with good government, peace, and concord--To promote the knowledge and practice of true religion and virtue, and the encrease of science among them and us--and generally to grant unto all Mankind such a degree of temporal prosperity as he alone knows to be best.\n \n Given under my hand at the City of New York the third day of October in the year of our Lord 1789.\n \n Go: Washington \n\n \n I agree that he wasn't singling out any particular religion. But this statement near the end, \"To promote the knowledge and practice of true religion and virtue\" hardly tells me he was implying the need to keep religion at arms length.", 
   {}, 
   154649, 
   null, 
   1123903500.0
  ], 
  [
   154769, 
   null, 
   "biccat", 
   "Evolution is science, creation is religion. If you want to teach creation, teach it in a religious studies class, or philosphy, or something in that vein. To teach creation in science class is to elevate a religious view to the realm of scientific truth. And that is clearly establishing a religion.\n\n If we're only going to teach scientific truths, why do we teach that interspecies evolution occurs, when there is no evidence (repeatable experiments) showing a crossing over from one family to another? There's no fossile records showing bird/mammels, nor any evidence that such things are even possible. All we have to rely on is genetic evidence. So why teach that animal X evolved into animals Y & Z when we can't actually show that this occurred?\n \n Evolution teaches a conclusion, this is the evidence, and this is a rational extrapolation of the evidence. But that's not what anti-creationists want to teach, they just want to teach the conclusion without demonstrating the evidence or the fact that the theory itself is an extrapolation of evidence.\n \n I don't see anything wrong with saying that there is an alternative viewpoint (creationism), but that it isn't supported by scientific fact.", 
   {}, 
   154513, 
   null, 
   1123906620.0
  ], 
  [
   154775, 
   null, 
   "zachvac", 
   "Funny though that you find many stellar physicists are religious. Saw one interview once with an expert on the big bang. He said science will only ever get us within micro fractions of milliseconds after the big bang. What came before will probably always be a matter of faith in his opinion.\n\n \n \n Of course, which is why science doesn't address this issue. Science deals with observation and experimentation. That's why evolution doesn't go back to how life was created, but how they change. ID doesn't have a single bit of evidence, observation or experimentation supporting it, which is why it should never be considered science. It could be true, but it's not science.", 
   {}, 
   154485, 
   null, 
   1123909860.0
  ], 
  [
   154777, 
   null, 
   "zachvac", 
   "You're putting evolution and creation on completely different levels, based only on your own views, and you're in the minority. The theory of evolution has gaping holes, requiring faith to fill them, and some of creationism has scientific credibility.\n \n\n \n 1% or 99% the rights of everyone, including the minority, must be protected. This has nothing to do with the minority or majority. And if evolution has gaping holes, please present them here, I would like to see them.\n \n \n \n\n A minority is engaging in anti-Christian activities. Anti-Christians seem to claim the first amendment as their own exclusive property. From post 44, (not written by me);\n \n\n minority or majority doesn't matter, but the first amendment is a right everyone has, not just the majority, and not just the minority.\n \n \n \n \n \nI'm not talking about worship, I'm talking about morality that makes sense to the majority in a democratic republic. I'm not advocating laws because they are religious, but because the majority thinks they make sense. (and they don't violate rights guaranteed by the TEXT of the Constitution) The words, \"thou shalt not steal\" are in the Bible. Should laws against stealing be repealed? - is prohibiting stealing forcing religion on everyone? \n \n\n Of course not, Kronus already cleared this up. If a law is based on religion but also has a secular purpose, it should be considered (but the reason to put it into place can't be religious) which is why \"thou shalt not steal\" is a law. It is to protect the right to property of people. Religion doesn't own this law, it would be a law regardless of religion.\n \n \n \n Since it's not in the Constitution, it means NOTHING to me. Now that you've read Rehnquist's words, do you understand it better?\n\n Well how can you know something is or isn't in the Constitution if you don't understand it?", 
   {}, 
   154755, 
   null, 
   1123910400.0
  ], 
  [
   154845, 
   null, 
   "Kronus", 
   "Marc9000,\n \n Zachvac answered your post about as well as I would have. I only have a couple of points to add.\n \n Your assertion that most people follow \"christian activities\" is, in general, unfounded. You list among anti-christian activities gambling and watching smut on cable. If only a minority of people engaged in those activites, than there wouldn't be enough of a market to support those activites. Clearly there is a market, which gives the lie to your claim. Not everyone agrees with everything your definitions.\n \n Second point. You say you aren't trying to have religious laws passed; just laws based on agreed upon morality. To quote, \"I'm not advocating laws because they are religious, but because the majority thinks they make sense.\" If this is true, than why are you opposed to seperation of church and state? Basing laws on common morality and not religion is exactly what I'm calling for, so what's your objection?\n \n Finally, you say \"Since it's not in the Constitution, it means NOTHING to me. \" That's just silly. Of course it mean something to you, otherwise you wouldn't be against it. What does the phrase trigger in you that you oppose it so much, despite its \"lack of meaning\"?", 
   {}, 
   154777, 
   null, 
   1123957800.0
  ], 
  [
   154850, 
   null, 
   "Truthsayer", 
   "Here's the entire proclaimation;\n \n \n \n I agree that he wasn't singling out any particular religion. But this statement near the end, \"To promote the knowledge and practice of true religion and virtue\" hardly tells me he was implying the need to keep religion at arms length.\n\n \n After reading the entire proclaimation, I'd have to agree. He may not have endorsed a particular religion but it is obvious that he felt the nation should acknowlege the presence of the Judeo/Christian dieties when he says:\n \n \nWhereas it is the duty of all Nations to acknowledge the providence of Almighty God, to obey his will, to be grateful for his benefits, and humbly to implore his protection and favor-- \n \n \n I find that rather surprising. As we all know the nation was formed by our forefathers who were entrenched in Masonic teachings. When Masons today \"invoke diety\" they refer to that diety as \"The Great Architech of the Universe.\" (Which is generic for \"place the name of your personal diety here.\") Religion and politics are taboo topics of discussion within the Masonic lodges today, for the sake of harmony.", 
   {}, 
   154757, 
   null, 
   1123959660.0
  ], 
  [
   154864, 
   null, 
   "marc9000", 
   "1% or 99% the rights of everyone, including the minority, must be protected. This has nothing to do with the minority or majority. And if evolution has gaping holes, please present them here, I would like to see them. \n\n \n There is a difference between protecting rights, and satisfying every discomfort that Athiests find in our society. \n \n The main gaping hole is this; Untill about the time of Einstein, Athiests could comfort themselves with the belief that the universe is eternal, and thus did not need a cause. But since then, five lines of scientific evidence have been discovered that prove beyond a reasonable doubt that the universe did indeed have a beginning. Science has proven, by it's own methods, that the world began abruptly in an act of creation to which you can trace the seeds of every star, every planet, every living thing in this cosmos and on the earth. And it has found that all this happened as a product of forces that man cannot hope to discover - supernatural forces. It takes every bit as much faith to be an evolutionist as it does to be a creationist.\n \n \n \n \nminority or majority doesn't matter, but the first amendment is a right everyone has, not just the majority, and not just the minority. \n\n \n I agree. Interpretation is the problem. The Supreme Court is supposed to do it, and more and more of the general public seems to think they're doing a pretty lousy job of it.\n \n \n \n \n \nOf course not, Kronus already cleared this up. If a law is based on religion but also has a secular purpose, it should be considered (but the reason to put it into place can't be religious) which is why \"thou shalt not steal\" is a law. It is to protect the right to property of people. Religion doesn't own this law, it would be a law regardless of religion. \n\n \n Atheism is arguably a religion. As I showed above, science can't hope to prove that the universe began without a supernatural creator. Why should their assumption that there is no creator be taught as fact, with no other (at least equal) assumptions not be permitted to be taught in our schools?\n \n \n \nWell how can you know something is or isn't in the Constitution if you don't understand it?\n\n \n What kind of a question is that? :) I didn't admit to not understanding it, I questioned his understanding of it. Even if I didn't understand something, chances are I'd know where it wasn't. I don't understand how the Athiest mind works, but I know for sure there isn't one in my house right now. emoticon_xangel", 
   {}, 
   154777, 
   null, 
   1123969860.0
  ], 
  [
   154865, 
   null, 
   "marc9000", 
   "Marc9000,\n \n Zachvac answered your post about as well as I would have. I only have a couple of points to add.\n \n Your assertion that most people follow \"christian activities\" is, in general, unfounded. You list among anti-christian activities gambling and watching smut on cable. If only a minority of people engaged in those activites, than there wouldn't be enough of a market to support those activites. Clearly there is a market, which gives the lie to your claim. Not everyone agrees with everything your definitions. \n\n \n You must be kidding. A tiny minority of people use hard illegal drugs. Yet markets that sell hard illegal drugs thrive. Just because there's a market for something doesn't mean it's untouchable according to the constitution.\n \n \nSecond point. You say you aren't trying to have religious laws passed; just laws based on agreed upon morality. To quote, \"I'm not advocating laws because they are religious, but because the majority thinks they make sense.\" If this is true, than why are you opposed to seperation of church and state? Basing laws on common morality and not religion is exactly what I'm calling for, so what's your objection? \n\n \n My objection is when you take it so far as to call for the elimination of balance in the teaching of creation / evolution in our schools. There is faith and science involved in both.\n \n \nFinally, you say \"Since it's not in the Constitution, it means NOTHING to me. \" That's just silly. Of course it mean something to you, otherwise you wouldn't be against it. What does the phrase trigger in you that you oppose it so much, despite its \"lack of meaning\"?\n\n \n It means nothing to me as far as how much credibility I give it. What the phrase triggers in me is thoughts of judicial activism and a somewhat uninformed general populace allowing the foundation of this country to be twisted and distorted into something it's not.\n \n Come up with a resolution on it - I may do defense in a debate tournament with you, let me know. :)", 
   {}, 
   154845, 
   null, 
   1123971360.0
  ], 
  [
   154866, 
   null, 
   "marc9000", 
   " \n I find that rather surprising. As we all know the nation was formed by our forefathers who were entrenched in Masonic teachings. When Masons today \"invoke diety\" they refer to that diety as \"The Great Architech of the Universe.\" (Which is generic for \"place the name of your personal diety here.\") Religion and politics are taboo topics of discussion within the Masonic lodges today, for the sake of harmony.\n\n \n Harmony is important. Much of today's Clergy stays away from politics as much as possible. Nothing wrong with that. emoticon_xangel", 
   {}, 
   154850, 
   null, 
   1123971780.0
  ], 
  [
   154867, 
   null, 
   "Kronus", 
   "You must be kidding. A tiny minority of people use hard illegal drugs. Yet markets that sell hard illegal drugs thrive. Just because there's a market for something doesn't mean it's untouchable according to the constitution.\n\n I hardly think the economics of illegal drugs is comprable to the economics of cable television. The former has very low overhead and a huge profit margin, the latter is just the opposite. You can't run a cable channel without a very large market.\n And where did your last sentence come from? That made no sense what so ever. Who said anything about market size equalling constitutional protection?\n \n \n\n My objection is when you take it so far as to call for the elimination of balance in the teaching of creation / evolution in our schools. There is faith and science involved in both.\n \n\n Trully there isn't, but it's far too broad a topic to cover here. I'll gladly take up the particulars of this issue with you in the creation/evolution forum. All I'll say here is that if your only objection is trully that you want creation taught along side evolution than you could have said so far sooner than this. Are you sure that's what your objection is? Nothing else?\n \n \n\n It means nothing to me as far as how much credibility I give it. What the phrase triggers in me is thoughts of judicial activism and a somewhat uninformed general populace allowing the foundation of this country to be twisted and distorted into something it's not.\n \n Come up with a resolution on it - I may do defense in a debate tournament with you, let me know. :)\n\n \n You voice your opposition to it, but you're still not saying what you think it is. Here's my take. Seperation of church and state means that the government should not:\n A) Suppress the free excercise of religion, within reasonable bounaries (no human sacrifice for example)\n B) Endorse one religion over another, or endorse religion over non religion. (IE, the government shouldn't pressure your religious decisions)\n C) Enact laws which have a strictly religious purpose.\n You seem to agree with me on A, but I've gotten the impression that you've come down on both sides of B and C.", 
   {}, 
   154865, 
   null, 
   1123973700.0
  ], 
  [
   154870, 
   null, 
   "SymonTemplar", 
   "Of course, which is why science doesn't address this issue. Science deals with observation and experimentation. That's why evolution doesn't go back to how life was created, but how they change. ID doesn't have a single bit of evidence, observation or experimentation supporting it, which is why it should never be considered science. It could be true, but it's not science.\n\n \n I suppose, but it doesn't address the question of the thread. Why is it simply a belief can't be taught? There are any number of theories lacking proof taught in science classes. There are any number of philosophies about a host of issues taught in classes. How am I too believe that public schools are indeed institutions of objective learning and oopen mindedness if a single issue belonging to one religion is excluded?", 
   {}, 
   154775, 
   null, 
   1123977720.0
  ], 
  [
   154871, 
   null, 
   "Big_Bear_Scot", 
   "I suppose, but it doesn't address the question of the thread. Why is it simply a belief can't be taught? There are any number of theories lacking proof taught in science classes. There are any number of philosophies about a host of issues taught in classes. How am I too believe that public schools are indeed institutions of objective learning and oopen mindedness if a single issue belonging to one religion is excluded?\n\n \n \n Isn't the problem is that they(Creationists) are trying to get Intelligent Design taught in a Science class room ? \n \n I think if ID was taught in a philosophy class or a Religious class there would not be a problem.", 
   {}, 
   154870, 
   null, 
   1123977960.0
  ], 
  [
   154876, 
   null, 
   "SymonTemplar", 
   "Isn't the problem is that they(Creationists) are trying to get Intelligent Design taught in a Science class room ? \n \n I think if ID was taught in a philosophy class or a Religious class there would not be a problem.\n\n \n So what about the science taught in science class rooms that can't be or hasn't been proven?\n \n You have more 'faith' than I do, in the thought of anything regarding it being taught anywhere in US public schools.\n \n Mind you I am no bible thumper, it is just the issue leaves the taste of hypocrisy in my mouth. Given that I learned far more about Islamic history than Christian history in high school.", 
   {}, 
   154871, 
   null, 
   1123980120.0
  ], 
  [
   154883, 
   null, 
   "Kronus", 
   "So what about the science taught in science class rooms that can't be or hasn't been proven?\n\n \n Can you give any examples of this? Particularly of things that can't be proven, since by definition they're outside the realm of sicence.", 
   {}, 
   154876, 
   null, 
   1123984140.0
  ], 
  [
   154923, 
   null, 
   "Big_Bear_Scot", 
   "So what about the science taught in science class rooms that can't be or hasn't been proven?\n \n \n I am not sure what you mean ?\n \n \n \nMind you I am no bible thumper, it is just the issue leaves the taste of hypocrisy in my mouth. Given that I learned far more about Islamic history than Christian history in high school.\n \n \n I have no problem with this considering you live in a Christian Country and you can learn Christian History from the Church. I don't know how it works in the US but in the Scottish School System you have a Religious Education class, in this class we focused on the 4 main faiths(Islam, Christianity, Hinduism and Judaism), the school year was then equally divided to accommodate each of the Religions. On top of this I went to a Bible studies class at my local Church.", 
   {}, 
   154883, 
   null, 
   1124018100.0
  ], 
  [
   154965, 
   null, 
   "marc9000", 
   "I hardly think the economics of illegal drugs is comprable to the economics of cable television. The former has very low overhead and a huge profit margin, the latter is just the opposite. You can't run a cable channel without a very large market.\n And where did your last sentence come from? That made no sense what so ever. Who said anything about market size equalling constitutional protection? \n\n \n You implied that if gambling and cable porn were supported by the free market, then it can't be legislated against. I guess I didn't make it clear. Here's what you said;\n \n \nYou list among anti-christian activities gambling and watching smut on cable. If only a minority of people engaged in those activites, than there wouldn't be enough of a market to support those activites. Clearly there is a market, which gives the lie to your claim. \n\n \n Your (italicized by me) statement is wrong. Another example; a tiny percentage of people work on old Ford trucks, yet companies that sell nothing but parts for old Ford trucks survive - there's enough of a market to support them.\n \n \n \nTrully there isn't, but it's far too broad a topic to cover here. I'll gladly take up the particulars of this issue with you in the creation/evolution forum. All I'll say here is that if your only objection is trully that you want creation taught along side evolution than you could have said so far sooner than this. Are you sure that's what your objection is? Nothing else? \n\n \n It's not my only objection, but it was in post #1 - I've been referring to it throughout this entire thread. My objections all fall into one simple catagory - the mis-interpretation of the first amendment.\n \n \n \n \nYou voice your opposition to it, but you're still not saying what you think it is. Here's my take. Seperation of church and state means that the government should not:\n A) Suppress the free excercise of religion, within reasonable bounaries (no human sacrifice for example)\n B) Endorse one religion over another, or endorse religion over non religion. (IE, the government shouldn't pressure your religious decisions)\n C) Enact laws which have a strictly religious purpose.\n You seem to agree with me on A, but I've gotten the impression that you've come down on both sides of B and C.\n\n \n Here's what I think it is ~ IRRELEVANT, because it's not in the Constitution. Now lets apply your A, B, & C to the TEXT of the First Amendment.\n \n A. I agree\n \n B. The word \"endorse\" is not in the first amendment. The word \"establishment\" is. Those two words definitions may be slightly similar, but only slightly. The word \"endorse\" is much more vague. I can claim that public funding \"endorses\" the study of evolution, therefore the government endorses atheism. We can do a lot of arguing about what's endorsed, that's the reason the word \"endorse\" isn't in the first amendment. Compared to all the documentation and politics that went into the development of them, the Constitution and Bill of Rights themselves are amazingly short. The words used in them were chosen VERY CAREFULLY.\n \n C. I would agree, if a law FORCED a person to be religious. We have no laws, present or past, that have even come close to that.", 
   {}, 
   154867, 
   null, 
   1124053260.0
  ], 
  [
   154981, 
   null, 
   "Kronus", 
   "\n Here's what I think it is ~ IRRELEVANT, because it's not in the Constitution. \n\n I know that the phrase isn't in the constitution. Allow me to emphasize that:\n I know that the phrase isn't in the constituion! However, I believe that the concept embodied by the phrase is, and have made efforts to demonstrate that. Now here's the part that's most important to this discussion, so please read carefully:\n \n If you won't commit to saying what you think the phrase means, than you are in no position to say that the meaning isn't embodied in the constitution.\n \n \n \nNow lets apply your A, B, & C to the TEXT of the First Amendment.\n \n A. I agree\n \n B. The word \"endorse\" is not in the first amendment. The word \"establishment\" is. Those two words definitions may be slightly similar, but only slightly. The word \"endorse\" is much more vague. I can claim that public funding \"endorses\" the study of evolution, therefore the government endorses atheism. We can do a lot of arguing about what's endorsed, that's the reason the word \"endorse\" isn't in the first amendment. Compared to all the documentation and politics that went into the development of them, the Constitution and Bill of Rights themselves are amazingly short. The words used in them were chosen VERY CAREFULLY.\n \n C. I would agree, if a law FORCED a person to be religious. We have no laws, present or past, that have even come close to that.\n\n \n A: We agree on something!\n \n B: You're picking nits to no purpose here. The summary of my postion works regardless of whether of not I use the word \"endorse\". I'll reiterate:\n \"the government shouldn't pressure your religious decisions\"\n Now; agree or disagree?\n \n C: So if we had laws that said you couldn't eat red meat on Friday, had to wear a veil if you're a woman, and had to fast during a certain month, you wouldn't have a problem with that? Those laws would all be based on religions, but they aren't forcing you to be religious per se, so in your book that's ok? Just trying to understand you here.", 
   {}, 
   154965, 
   null, 
   1124063940.0
  ], 
  [
   154992, 
   null, 
   "marc9000", 
   "I know that the phrase isn't in the constitution. Allow me to emphasize that:\n I know that the phrase isn't in the constituion! However, I believe that the concept embodied by the phrase is, and have made efforts to demonstrate that. Now here's the part that's most important to this discussion, so please read carefully:\n \n If you won't commit to saying what you think the phrase means, than you are in no position to say that the meaning isn't embodied in the constitution. \n\n \n Here's my commitment; the phrase is a metaphor based on bad history, a metaphor which has proved useless as a guide to judging. It should be frankly and explicitly abandoned. \n \n \n \n \n \nA: We agree on something! \n\n \n That's right, \"prohibit\" / \"suppress\", close enough! :) \n \n \nB: You're picking nits to no purpose here. The summary of my postion works regardless of whether of not I use the word \"endorse\". I'll reiterate:\n \"the government shouldn't pressure your religious decisions\"\n Now; agree or disagree? \n\n \n Disagree. The word \"pressure\" isn't in the first amendment.\n \n \nC: So if we had laws that said you couldn't eat red meat on Friday, had to wear a veil if you're a woman, and had to fast during a certain month, you wouldn't have a problem with that? Those laws would all be based on religions, but they aren't forcing you to be religious per se, so in your book that's ok? Just trying to understand you here.\n\n \n We have had no laws that even come close to that, and if we did I would oppose them. I believe they would be unconstitutional even with a popular vote. They are too much of an \"establishment\". \n \n Traditions like celebrating Thanksgiving day, balancing evolution with creationism in schools, public displays of the Ten Commandments, outlawing gay marriage, outlawing abortion, and dozens of other things newly under attack by the AU & ACLU, I believe to be constitutional if they're supported by the public.", 
   {}, 
   154981, 
   null, 
   1124071320.0
  ], 
  [
   154996, 
   null, 
   "Kronus", 
   "Here's my commitment; the phrase is a metaphor based on bad history, a metaphor which has proved useless as a guide to judging. It should be frankly and explicitly abandoned. \n \n\n That's not a commitment, that's a judgement. And since you still won't say what you think the phrase means, the judgement is useless. It's a really simple question, and this debate is pointless if you won't answer it. What do you think the phrase means? Why are you so stubbornly refusing to say?\n \n \n \n\n Disagree. The word \"pressure\" isn't in the first amendment.\n \n\n Excuse my bluntness, but that's really stupid. You're going to disagree with any interpretation of the first amendment that uses words that aren't in the first amendment? What does that leave but quoting it? You can do better than that.\n \n \n\n We have had no laws that even come close to that, and if we did I would oppose them. I believe they would be unconstitutional even with a popular vote. They are too much of an \"establishment\". \n \n\n You're contradicting yourself here. Before you just wanted laws to not force you to be religious. Now you agree that even if a law doesn't force you to be religious, it can establish a religion, and is therefore no good. Great. Now, what was your guideline? Why were those hypothetical laws no good? I'm sticking with what I said before; they had no secular purpose, only religious.\n \n \n \n\n Traditions like celebrating Thanksgiving day, balancing evolution with creationism in schools, public displays of the Ten Commandments, outlawing gay marriage, outlawing abortion, and dozens of other things newly under attack by the AU & ACLU, I believe to be constitutional if they're supported by the public.\n\n That's quite a hodge-podge there! Since when is outlawing gay marriage a tradition? How about we finish with what the first amendment says before we go into specifc cases?", 
   {}, 
   154992, 
   null, 
   1124075460.0
  ], 
  [
   155004, 
   null, 
   "marc9000", 
   "That's not a commitment, that's a judgement. And since you still won't say what you think the phrase means, the judgement is useless. It's a really simple question, and this debate is pointless if you won't answer it. What do you think the phrase means? Why are you so stubbornly refusing to say? \n\n \n The phrase means that the 1802 Danbury Baptists didn't have to worry about a national religion being established. How's that? \n \n \n \n \nExcuse my bluntness, but that's really stupid. You're going to disagree with any interpretation of the first amendment that uses words that aren't in the first amendment? What does that leave but quoting it? You can do better than that. \n\n \n Quoting it works really well.\n \n \n \nYou're contradicting yourself here. Before you just wanted laws to not force you to be religious. Now you agree that even if a law doesn't force you to be religious, it can establish a religion, and is therefore no good. Great. Now, what was your guideline? \n\n \n Don't know what you're referring too. You'll have to show me my contradicting quotes.\n \n \n \n \n Why were those hypothetical laws no good? I'm sticking with what I said before; they had no secular purpose, only religious.\n\n \n I'm sticking with what I already said, they are too much of an establishment.\n \n \n \n \nThat's quite a hodge-podge there! Since when is outlawing gay marriage a tradition? How about we finish with what the first amendment says before we go into specifc cases?\n\n \n Just a response to YOUR hodge-podge of veils, fasting, and red meat. (gay marriage has almost always been outlawed in the U.S.) You're about to get the last word here :) your substance is all but completely gone.", 
   {}, 
   154996, 
   null, 
   1124077740.0
  ], 
  [
   155012, 
   null, 
   "Kronus", 
   "The phrase means that the 1802 Danbury Baptists didn't have to worry about a national religion being established. How's that? \n \n\n Horrible.\n \n I've been about as patient as I can be. I've been desperately trying to get you to say what the phrase means to you, and you've done nothing but dodge. Since you won't give me your actual words to address, you force me to address what you seem to be saying.\n \n I believe that you won't pin down a definition of \"seperation of church and state\" because you agree with my definition of it, you believe that that is what is intended in the first amendment, and you don't like it. You want your religious values given the weight of law. That's the reason for your perpetual dodging.\n \n \n\n Quoting it works really well.\n \n\n No, quoting is a really, really horrible way of explaining what something means. \n It just means that you have decided on a meaning, but you're not going to share it. Again I'm left guessing, so here goes. You agree that the first amendment doesn't allow the government to pressure people's religious decisions, but you want them to. Specifically, you want the government to push your religion.\n \n \n \n\n I'm sticking with what I already said, they are too much of an establishment.\n \n\n But why? What makes them too much of an establishment? Since you won't define any terms I'm going to have to make a guess once again. A law is too much of an establishment if it establishes a religion you don't follow. If it espouses a religious view that you agree with, then it's fine.\n \n \n I've based these guesses on what you've said in this thread so far. Since you won't define your terms, that's all I have to go on. Don't like it? Don't agree with my assesment? Then define your terms! Until you're willing to take an actual stand on what you're trying to say, you force me to guess.", 
   {}, 
   155004, 
   null, 
   1124083260.0
  ], 
  [
   155444, 
   null, 
   "zachvac", 
   "Atheism is arguably a religion. As I showed above, science can't hope to prove that the universe began without a supernatural creator. Why should their assumption that there is no creator be taught as fact, with no other (at least equal) assumptions not be permitted to be taught in our schools?\n \n\n \n \n Of course atheism is a religion, I have shown this many times quoting dictionary.com on the definition of religion, I will do so again if necesssary.\n \n The assumption that there is no creator is not taught as fact, or in school. If it is taught that there is no creator, then they are just as guilty of violating the first ammendment as people trying to institute prayer in schools. The government isn't supposed to involve itself in religion either way. It can't say there is a god and it can't say there isn't. If you can show me where atheism is being taught in schools, I would be glad to see it, because I doubt it happens.", 
   {}, 
   154864, 
   null, 
   1124252460.0
  ], 
  [
   155445, 
   null, 
   "zachvac", 
   "I suppose, but it doesn't address the question of the thread. Why is it simply a belief can't be taught? There are any number of theories lacking proof taught in science classes. There are any number of philosophies about a host of issues taught in classes. How am I too believe that public schools are indeed institutions of objective learning and oopen mindedness if a single issue belonging to one religion is excluded?\n\n \n \n I have no problems with beliefs being taught, as long as they stay as beliefs. At my high school we have many religious studies classes. Religion belongs in those classes, not science class.", 
   {}, 
   154870, 
   null, 
   1124252520.0
  ], 
  [
   155446, 
   null, 
   "zachvac", 
   "So what about the science taught in science class rooms that can't be or hasn't been proven?\n \n You have more 'faith' than I do, in the thought of anything regarding it being taught anywhere in US public schools.\n \n Mind you I am no bible thumper, it is just the issue leaves the taste of hypocrisy in my mouth. Given that I learned far more about Islamic history than Christian history in high school.\n\n \n Please give me a topic taught in science class that can't be or hasn't been proven, besides ID.", 
   {}, 
   154876, 
   null, 
   1124252640.0
  ], 
  [
   155479, 
   null, 
   "Kronus", 
   "Of course atheism is a religion, I have shown this many times quoting dictionary.com on the definition of religion, I will do so again if necesssary.\n \n\n \n I'll bite. How did you get from these defintions to the conclusion that athiesm is a religion? They seem to pretty much make athiesm out to be the antonym of religion.\n \n Religion\n 1.\n 1. Belief in and reverence for a supernatural power or powers regarded as creator and governor of the universe.\n 2. A personal or institutionalized system grounded in such belief and worship.\n 2. The life or condition of a person in a religious order.\n 3. A set of beliefs, values, and practices based on the teachings of a spiritual leader.\n 4. A cause, principle, or activity pursued with zeal or conscientious devotion.", 
   {}, 
   155444, 
   null, 
   1124290440.0
  ], 
  [
   155729, 
   null, 
   "ctaylors", 
   "I've always said there is a simple answer to everything. It may not be easy to swallow, but it's there if you look.\n \n To this question, it's this. \"Congress shall make no law respecting an establishment of RELIGION or prohibiting the free exercise thereof\". Period, end of story. If I want to pray, pray. If I want to wear a yamaka, I should be able to wear one. If schools want to teach about creation (notice I didn't say creation science, because it is by defintion not a science), so be it. Follow it up with talk about other competing \"beliefs\". \"Origin of Species\" evolution isn't really a science either because it cannot be tested, so it's also a belief. But there are new adaptations of evolution which can be tested. Those are the only ones that can be taught in a science class.\n \n But I have to go back to the \"congress shall make no law bit.\" I am, after all, a strict interpretionalist, and don't go in for the Supreme Court just making up things as they go along...like the supposed separation of church and state. It's supposed to be freedom OF religion, not freedom FROM religion.\n \n No one has the right not to be offended.", 
   {
    "post_info": {
     "post_title": "simple answer..."
    }
   }, 
   155479, 
   null, 
   1124411220.0
  ], 
  [
   155796, 
   null, 
   "Kronus", 
   "..like the supposed separation of church and state. It's supposed to be freedom OF religion, not freedom FROM religion.\n \n No one has the right not to be offended.\n\n \n That depends on what you mean by freedom from religion. There is certainly no right to be free from exposure to religion, but I don't believe anyone is claiming that there is. However, there is a right to not be religious if one chooses, and to not have to live by other's religious standards. That's what I would call freedom from religion.\n \n As for the offended thing, I think that's a smokescreen, a strawman. Religious radicals have mined the papers searching for anyone saying that they're offended by such and such a religion, and are presenting these scattered examples as a mainstream argument supporting seperation of church and state. That's just silliness. The mainstream argument is that how I run my religious life should be my choice, not the governments.", 
   {}, 
   155729, 
   null, 
   1124463000.0
  ], 
  [
   155832, 
   null, 
   "ctaylors", 
   "You're right, and I agree with you on many points. Your right to practice or not to practice religion is and should be up to you and you alone, not the government. But when Christian values (and other religions use them, too) \"infiltrate\" government in the form of \"thou shalt not kill\", you don't get the right to not live by that standard and kill indescriminantly. \n \n Of course, murder is wrong. Where that come from is not the debate here. The 10 commandments has it in it. But being told not to kill is not preaching of Christianity. By that, it shouldn't matter that the 10 commandments are displayed because everybody believes it's wrong to kill. And just because there is a line in there about not having any other Gods before Me, there are no statutory laws that say that, so you don't have to believe that if you don't want to, and you won't be arrested if you don't.\n \n I am, of course, using the 10 commandments as just an example of a broader confusion.", 
   {
    "post_info": {
     "post_title": "religious freedom"
    }
   }, 
   155796, 
   null, 
   1124474100.0
  ], 
  [
   155847, 
   null, 
   "Kronus", 
   "You're right, and I agree with you on many points. Your right to practice or not to practice religion is and should be up to you and you alone, not the government. But when Christian values (and other religions use them, too) \"infiltrate\" government in the form of \"thou shalt not kill\", you don't get the right to not live by that standard and kill indescriminantly. \n \n Of course, murder is wrong. Where that come from is not the debate here. The 10 commandments has it in it. But being told not to kill is not preaching of Christianity. By that, it shouldn't matter that the 10 commandments are displayed because everybody believes it's wrong to kill. And just because there is a line in there about not having any other Gods before Me, there are no statutory laws that say that, so you don't have to believe that if you don't want to, and you won't be arrested if you don't.\n \n I am, of course, using the 10 commandments as just an example of a broader confusion.\n\n \n You touch on two important points here. The first is that we need to be able to distinguish Christian values, or any relgion's for that matter, from what you might call generic values. Simply because something appears in the BIble does not make it Christian, or at least not exclusively Christian. Some version of \"Thou shall not kill\" is found in most religions, and in most cultures. It's a basic tenant of any moral structure, and so does not \"belong\" to Christianity. And therefore having laws against killing in no way should be construed as endorsing a religious creedo. If you tried to have a law saying that you couldn't eat red meat on Friday, that would be a religious law.\n \n The second point you bring up concerns the government coercing people's religious choices. You speak of laws and arrests, and seem to suggest that their lack is sufficient to ensure freedom of religion. I would disagree. For people to really have religious freedom, they must believe that they have religious freedom. As a hypothetical example, if a government says you have religious freedom, but social services in an area where people of religion A lived were always better then in the religion B neighborhoods, and religion B people always seemed to lose in court, and religion A holidays were state holidays, but none of religion B, then you couldn't really say that there was religious freedom, right? There's definite pressure to be of religion A, even if there's no laws to that effect. This sort of thing has happened often enought throughout history that people are right to be concerned about it. And so it's not enough for our government to simply not pressure people, it's their responsibility to not give the appearance of pressuring people. And having a big old plaque in the middle of the courthouse saying \"worship this God and no other\" most definately gives the impression of pressure. It may not be forcing people by law to become Christians, but it does give the impression that the government prefers Judeo/Christianity, and if the people believe that the government is biased towards one religion then they won't feel as free to follow another.", 
   {}, 
   155832, 
   null, 
   1124479080.0
  ], 
  [
   155849, 
   null, 
   "georged", 
   " And having a big old plaque in the middle of the courthouse saying \"worship this God and no other\" most definately gives the impression of pressure. It may not be forcing people by law to become Christians, but it does give the impression that the government prefers Judeo/Christianity, and if the people believe that the government is biased towards one religion then they won't feel as free to follow another.\n\n \n Be difficult for a Muslim, atheist or other non-Christian/Jew to successfully run for most public offices in the US.", 
   {}, 
   155847, 
   null, 
   1124480760.0
  ], 
  [
   156063, 
   null, 
   "DamEtel", 
   "If schools want to teach about creation (notice I didn't say creation science, because it is by defintion not a science), so be it. Follow it up with talk about other competing \"beliefs\". \"Origin of Species\" evolution isn't really a science either because it cannot be tested, so it's also a belief. But there are new adaptations of evolution which can be tested. Those are the only ones that can be taught in a science class.\n\n \n So you don't know science. Maybe they should have spent more time teaching it when you were in school.\n \n \n \nctaylors: But I have to go back to the \"congress shall make no law bit.\" I am, after all, a strict interpretionalist, and don't go in for the Supreme Court just making up things as they go along...like the supposed separation of church and state.\n\n \n Okay, so you don't know science or about the founding fathers' statements about the Constitution. Do you really think that the Supreme Court just made up \"separation of church and state\"? Really? \n \n No. Thomas Jefferson was asked by a religious group to explain a bit more about the First Ammendment, and part of his response was ...\n \n \n\"Believing that religion is a matter which lies solely between man and his God, that he owes account to none other for his faith or his worship, that the legitimate powers of government reach actions only, and not opinions, I contemplate with sovereign reverence that act of the whole American people which declared that their legislature should make no law 'respecting an establishment of religion, or prohibiting the free exercise thereof,' thus building a wall of separation between church and state.\" \n (President Thomas Jefferson, 1802 letter to the Baptists of Danbury, Connecticut) \n\n \n Do you see Jefferson's explicit link between the First Ammendment and the separation between church and state? Can you see that he is explaining the intent of the establishment clause?\n \n \n Oh, and Jefferson mentioned the separation of church and state on more than one occassion ...\n \n \n\"Because religious belief, or non-belief, is such an important part of every person's life, freedom of religion affects every individual. State churches that use government power to support themselves and force their views on persons of other faiths undermine all our civil rights. Moreover, state support of the church tends to make the clergy unresponsive to the people and leads to corruption within religion. Erecting the \"wall of separation between church and state,\" therefore, is absolutely essential in a free society.\n \n We have solved ... the great and interesting question whether freedom of religion is compatible with order in government and obedience to the laws. And we have experienced the quiet as well as the comfort which results from leaving every one to profess freely and openly those principles of religion which are the inductions of his own reason and the serious convictions of his own inquiries.\"\n (Thomas Jefferson, to the Virginia Baptists, 1808)\n This is his second use of the term \"wall of separation,\" here quoting his own use in the Danbury Baptist letter. This wording was several times upheld by the Supreme Court as an accurate description of the Establishment Clause: Reynolds (98 U.S. at 164, 1879); Everson (330 U.S. at 59, 1947); McCollum (333 U.S. at 232, 1948)\n http://www.positiveatheism.org/hist/quotes/jefframe.htm \n\n \n \n \n \n \n ********************************\n \n Here, let me give you a bit more on Jefferson's views on separation of church and state.\n \n \n\"The legitimate powers of government extend to such acts only as are injurious to others. But it does me no injury for my neighbor to say there are twenty gods, or no god. It neither picks my pocket nor breaks my leg.\"\n -- Thomas Jefferson, Notes on the State of Virginia, 1781-82 \n http://www.positiveatheism.org/hist/quotes/jefframe.htm \n\n \n \n \n\"[N]o man shall be compelled to frequent or support any religious worship, place, or ministry whatsoever, nor shall be enforced, restrained, molested, or burthened in his body or goods, nor shall otherwise suffer, on account of his religious opinions or belief; but that all men shall be free to profess, and by argument to maintain, their opinions in matters of religion, and that the same shall in no wise diminish, enlarge, or affect their civil capacities.\n -- Thomas Jefferson, Virginia Statute for Religious Freedom (1779), quoted from Merrill D. Peterson, ed., Thomas Jefferson: Writings (1984), p. 347 \n http://www.positiveatheism.org/hist/quotes/jefframe.htm \n\n \n \n\"Our civil rights have no dependence upon our religious opinions more than our opinions in physics or geometry.\"\n -- Thomas Jefferson, Statute for Religious Freedom, 1779. Papers, 2:545\n http://www.positiveatheism.org/hist/quotes/jefframe.htm \n\n \n \n And though not one of the founding fathers, we have the separation of church and state mentioned by other historical figures.\n \n \n\"Encourage free schools and resolve that not one dollar appropriated for their support shall be appropriated to the support of any sectarian schools. Resolve that neither the state nor nation, nor both combined, shall support institutions of learning other than those sufficient to afford every child growing up in the land of opportunity of a good common school education, unmixed with sectarian, pagan, or atheistical dogmas. Leave the matter of religion to the family altar, the church and the private school supported entirely by private contributions. Keep the church and state forever separate.\"\n -- Ulysses S. Grant, address to the Army of the Tennessee, Des Moines, Iowa, September 25, 1875, from Albert J. Menendez and Edd Doerr, The Great Quotations on Religious Freedom\n http://www.positiveatheism.org/hist/quotes/jefframe.htm \n", 
   {
    "unicode_changes_made": true
   }, 
   155729, 
   null, 
   1124605200.0
  ], 
  [
   156077, 
   null, 
   "marc9000", 
   "Do you see Jefferson's explicit link between the First Ammendment and the separation between church and state? Can you see that he is explaining the intent of the establishment clause? \n\n \n The Constitution was a product of time consuming hard work by a lot of people. It was established 11 years before Jefferson wrote his letter to the Danbury Baptists, which was nothing more than a short note of courtesy. Jefferson was one of the most secular of all the founders. He didn't have authority to make changes in wording and interpretation of the country's foundation, and I don't think he wanted to.\n \n \n \n \n \nAnd though not one of the founding fathers, we have the separation of church and state mentioned by other historical figures.\n\n \n Grant's accomplishments, (or lack of them) don't make his words one bit more significant than countless other forgotten politicians.", 
   {}, 
   156063, 
   null, 
   1124637660.0
  ], 
  [
   156088, 
   null, 
   "DamEtel", 
   "DamEtel: Do you see Jefferson's explicit link between the First Ammendment and the separation between church and state? Can you see that he is explaining the intent of the establishment clause?\n \n \n \nMarc9000: The Constitution ... was established 11 years before Jefferson wrote his letter to the Danbury Baptists, which was nothing more than a short note of courtesy.\n\n \n Wrong. It was an explanation of the establishment clause, helping to clarify its intent. \n \n Gee, now do you think that that might be why the Supreme Court has used Jefferson's statements about building a wall of separation between church and state as their means of understanding the intent of the establishment clause? Huh?\n \n \n \n And if you'll note, again, Jefferson repeated his phrase \"wall of separation between church and state\" in another letter to a religious group to help explain the intent. \n \n \n \n \n Now, is there anything else about the Constitution that helps confirm that it's a secular document, meant to separate church and state? Yep.\n \n First, neither the word God nor the word Jesus appear anywhere in either the Constitution or the Bill of Rights. It's a secular document. This is important because it was the first time that a national government was founded without promoting a state religion. You'd have to understand how out of place for the time a secular Constitution really was to understand the importance of leaving God and Jesus out such an important document; and how doing so clearly shows an intent to not go along with the then universal act of mixing church and state.\n \n Second, the only references to religion in the Constitution and the Bill of Right are EXCLUSIONARY. One forbids the government from mandating religious 'tests' in order for someone to serve as a public official. For a bit of context, Delaware was requiring a person to swear an oath that he believed in the Holy Trinity in order to hold a public office, and other states had similar religious requirements for holding government offices. Jefferson and the other founders of our nation said that they would have none of that - which mixes church and state - for the national goverment.\n \n The other is, of course, the First Ammendmant, which forbids -- not allows -- the government from doing certain things related to religion. You would need to know the historical context - the conditions prevailing in that day - to know just how anti-status quo this was too, and how therefore just by saying \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; . . .\" showed that the intention was to do away with the then universal union of church and state.\n \n Now, it is EVERYONE who ratified the Constitution and agreed to the Bill of Rights - not just Jefferson - who understood, because of the obvious change from the status quo that was in place at the time, that the documents were meant to do away with the then standard practice of mixing church and state, and therefore, to separate church and state.\n \n \n \n \n \nmarc9000: Jefferson was one of the most secular of all the founders.\n\n \n And yet, funny enough, it wasn't Jefferson alone who made the Constitution our governing document, seeing as how every state ratified the SECULAR Constitution.\n \n \n \nmarc9000: He didn't have authority to make changes in wording and interpretation of the country's foundation, and I don't think he wanted to.\n\n \n And he didn't change anything! He EXPLAINED the INTENT. That's not changing the wording of the Constitution, nor is it changing the interpretation. \n \n Quite the opposite. Any Supreme Court justice who interprets the First Ammendent as other than intending to build a wall of separation between church and state is the one who is changing the intent of it.\n \n \n \nmarc9000: Grant's accomplishments, (or lack of them) don't make his words one bit more significant than countless other forgotten politicians.\n\n \n Uhm, pay attention to context. \n \n The person I was responding to thought that the Supreme Court just made up this notion of \"separation of church and state\", and my quotes of Jefferson - and Grant - showed him to be wrong. \n \n Look, I'm sorry if you don't like the fact that our nation was founded on a secular document, part of which was intended to build a wall of separation between church and state ... but if you despise this government's very foundations so much, you can always move to a country that was founded on a state religion ... like one in the middle east.", 
   {}, 
   156077, 
   null, 
   1124647740.0
  ], 
  [
   156099, 
   null, 
   "marc9000", 
   "Wrong. It was an explanation of the establishment clause, helping to clarify its intent. \n \n Gee, now do you think that that might be why the Supreme Court has used Jefferson's statements about building a wall of separation between church and state as their means of understanding the intent of the establishment clause? Huh? \n\n \n Gee, I don't think so. Because they waited 150 years to even think much about it. Can you cite any examples of political battles over \"separation of church & state\" before the last 60 years? Why do you suppose George Washington's proclaimation of Thanksgiving day went politically unchallanged?\n \n \n \n \nAnd if you'll note, again, Jefferson repeated his phrase \"wall of separation between church and state\" in another letter to a religious group to help explain the intent. \n\n \n Was Jefferson the only one entrusted with interpreting the Constitution for us?\n \n \n \n \n \nNow, is there anything else about the Constitution that helps confirm that it's a secular document, meant to separate church and state? Yep.\n \n First, neither the word God nor the word Jesus appear anywhere in either the Constitution or the Bill of Rights. It's a secular document. This is important because it was the first time that a national government was founded without promoting a state religion. You'd have to understand how out of place for the time a secular Constitution really was to understand the importance of leaving God and Jesus out such an important document; and how doing so clearly shows an intent to not go along with the then universal act of mixing church and state. \n \n \n Second, the only references to religion in the Constitution and the Bill of Right are EXCLUSIONARY. One forbids the government from mandating religious 'tests' in order for someone to serve as a public official. For a bit of context, Delaware was requiring a person to swear an oath that he believed in the Holy Trinity in order to hold a public office, and other states had similar religious requirements for holding government offices. Jefferson and the other founders of our nation said that they would have none of that - which mixes church and state - for the national goverment.\n \n The other is, of course, the First Ammendmant, which forbids -- not allows -- the government from doing certain things related to religion. You would need to know the historical context - the conditions prevailing in that day - to know just how anti-status quo this was too, and how therefore just by saying \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; . . .\" showed that the intention was to do away with the then universal union of church and state. \n\n \n Any comments on the Thanksgiving day holiday? How about Jefferson's treaty with the Kaskaskia Indians, which provided annual cash support for the tribe's Roman Catholic Priest and church? Congress appropraited public money time and time again for Indian education carried on by religious organizations, in the 19th century. Why is all this \"separation of church & state\" outcry happening only today?\n \n \nNow, it is EVERYONE who ratified the Constitution and agreed to the Bill of Rights - not just Jefferson - who understood, because of the obvious change from the status quo that was in place at the time, that the documents were meant to do away with the then standard practice of mixing church and state, and therefore, to separate church and state. \n\n \n Then why are those words not in there - EVERYONE who ratified it DID NOT SEE those words.\n \n \n \n \nAnd yet, funny enough, it wasn't Jefferson alone who made the Constitution our governing document, seeing as how every state ratified the SECULAR Constitution. \n\n \n And yet, funny enough, without the words \"separation of church & state\".\n \n \n \n \n \nAnd he didn't change anything! He EXPLAINED the INTENT. That's not changing the wording of the Constitution, nor is it changing the interpretation. \n\n \n It can be when you add words, that are not in the text.\n \n \nQuite the opposite. Any Supreme Court justice who interprets the First Ammendent as other than intending to build a wall of separation between church and state is the one who is changing the intent of it.\n\n \n No, the ones intent on changing it are the ones who ADD WORDS, not ones who leave the wording as it is.\n \n \n \n \n \nUhm, pay attention to context. \n \n The person I was responding to thought that the Supreme Court just made up this notion of \"separation of church and state\", and my quotes of Jefferson - and Grant - showed him to be wrong. \n\n \n Well they didn't make them up, but they sure had to blow the dust off of a lot of trivial, forgotten documentation to find them. \n \n \nLook, I'm sorry if you don't like the fact that our nation was founded on a secular document, part of which was intended to build a wall of separation between church and state ... but if you despise this government's very foundations so much, you can always move to a country that was founded on a state religion ... like one in the middle east.\n\n \n Those who claim to be loyal to the foundation of this country seem to be very particular about what parts of the foundation they want to address. They want to add words in some places, and disregard actual text in others. Several phrases come to mind;\n \n \"...shall not be infringed\"\n \n \"...probable cause.....particularly describing the place to be searched...\"\n \n \"...shall not be taken for public use without just compensation.\"\n \n \"...nor execssive fines imposed...\" (ever hear of Merck Pharmaceuticals?)\n \n \"...are reserved to the states respectively, or to the people.\"\n \n Many originalists think that paying almost no attention to the above actual text is far more dangerous to the health of our country than separating church & state. Are these no longer relavent? Are you really an originalist, or are you a non-originalist (activist), as almost all of the \"separation of church & state\" crowd are? I don't think you're on very firm footing to advise other people to move.", 
   {}, 
   156088, 
   null, 
   1124659680.0
  ], 
  [
   156100, 
   null, 
   "Dzeron", 
   "I have come to the conclusion that the separation of church and state is impossible as long as the state exists. Given that anything can be worshipped, the state endorses religion merely by owning things. What should be done if a cult decides to worship the Capitol building?\n \n The \"freedom of [peaceful] religion\" also implies total freedom. To put constrictions on any peaceful action is to put constrictions on peaceful worship, since any action can be a form of worship. Similarly, to compel anyone to do anything is to support a certain form of worship.\n \n The state is a cult, and statism is a religion - a barbaric religion, worshipping aggressive violence as a means to every end. The Nazional Anthem is its mantra, the Flag is its idol, Elections are its rituals, the Rulers are its priests.\n \n This gang cannot protect our religious freedom.", 
   {}, 
   156099, 
   null, 
   1124661540.0
  ], 
  [
   156114, 
   null, 
   "Jenn", 
   "Everyone has the choice and the capability to learn and live what they want. How they go about doing it determines the success and consequences. Things may be taught and learned in the schools, but do the youth learning these things accept what is taught? No, and last i checked the local schools taught conflicting theories on creationism/evolutionism etc., etc. and were to make clear that all of the things taught are theories and/or beliefs and were unable to say anything more. I have heard that where you live determines how you live and i think that is true. Those who work to run countries have influence on the societal values. Abortion, gay rights, and many of the 'hot' issues are moral issues which each individual should have the right to choose for themselves what actions they take. This isnt meant to be a rambling lecture honestly. I have noticed the ever increasing instances of Christian beliefs in everyday life. Seperation of church and state has become a fragile grey line. it is up to each person in how they live each day to make thier views known without monopolizing society. I have my beliefs and will share them but i believe that each person has the right to make choices for themselves according to what they believe, not what i believe. Openmindedness is becoming increasingly scarce. Most people do not take kindly to everything they do being checked and restricted because of someone elses beliefs. Before you try to go around 'converting' people imagine what your reaction would be. In the way you spread your ideas remember that philosophy to one person may be religion to another.", 
   {
    "post_info": {
     "post_title": "Societal grey lines"
    }
   }, 
   153667, 
   null, 
   1124669760.0
  ], 
  [
   156121, 
   null, 
   "zachvac", 
   "I have come to the conclusion that the separation of church and state is impossible as long as the state exists. Given that anything can be worshipped, the state endorses religion merely by owning things. What should be done if a cult decides to worship the Capitol building?\n \n The \"freedom of [peaceful] religion\" also implies total freedom. To put constrictions on any peaceful action is to put constrictions on peaceful worship, since any action can be a form of worship. Similarly, to compel anyone to do anything is to support a certain form of worship.\n \n The state is a cult, and statism is a religion - a barbaric religion, worshipping aggressive violence as a means to every end. The Nazional Anthem is its mantra, the Flag is its idol, Elections are its rituals, the Rulers are its priests.\n \n This gang cannot protect our religious freedom.\n\n No, the point is laws and such should not be based on religion. The capital has a secular purpose no matter who choses to worship it. Putting the ten commandments in courthouses and such has no secular purpose whatsoever. That's the difference.", 
   {}, 
   156100, 
   null, 
   1124672580.0
  ], 
  [
   156141, 
   null, 
   "Kronus", 
   "\n Then why are those words not in there - EVERYONE who ratified it DID NOT SEE those words.\n \n And yet, funny enough, without the words \"separation of church & state\".\n \n It can be when you add words, that are not in the text.\n \n No, the ones intent on changing it are the ones who ADD WORDS, not ones who leave the wording as it is.\n \n\n \n So you're still insisting that you can't explain a phrase by using words not in the phrase? I'd really like to see you write a dictionary. Proofreading it would be the easiest job in the world...\n \n a: a\n aardvark: aardvark\n abacus: an abacus (proofreader's note, 'an' not allowed, delete)", 
   {}, 
   156099, 
   null, 
   1124679420.0
  ], 
  [
   156145, 
   null, 
   "marc9000", 
   "So you're still insisting that you can't explain a phrase by using words not in the phrase? \n\n \n I've never said it isn't possible to explain a phrase by using words not in the phrase, only that it's not uncommon for someone to intentionally get it wrong, by using the wrong words, for political purposes.\n \n \n I'd really like to see you write a dictionary. Proofreading it would be the easiest job in the world...\n \n a: a\n aardvark: aardvark\n abacus: an abacus (proofreader's note, 'an' not allowed, delete)\n\n \n Dictionary's are used to define single words, not phrases - there is a big difference. A well thought out phrase doesn't need additional words. Every phrase in the Constitution was well thought out.", 
   {}, 
   156141, 
   null, 
   1124680440.0
  ], 
  [
   156202, 
   null, 
   "zachvac", 
   "I've never said it isn't possible to explain a phrase by using words not in the phrase, only that it's not uncommon for someone to intentionally get it wrong, by using the wrong words, for political purposes.\n \n \n \n Dictionary's are used to define single words, not phrases - there is a big difference. A well thought out phrase doesn't need additional words. Every phrase in the Constitution was well thought out.\n\n \n there are a couple of phrases you used, let's see if I can rephrase them.\n \n #1. I didn't say it was impossible to explain a group of words with other words, but it's common for people to incorrectly misiniterpret the phrase for political puurposes\n \n #2. Single words are defined in dictionaries, not groups of words. There is a colossal difference. An intelligent phrase needs no addition. The Constitution is filled with such thought-out phrases.\n \n No doubt your phrases were thought out, but I rewrote them and they mean more or less the same.", 
   {}, 
   156145, 
   null, 
   1124689920.0
  ], 
  [
   156266, 
   null, 
   "Kronus", 
   "I've never said it isn't possible to explain a phrase by using words not in the phrase, only that it's not uncommon for someone to intentionally get it wrong, by using the wrong words, for political purposes.\n \n A well thought out phrase doesn't need additional words. Every phrase in the Constitution was well thought out.\n\n \n That's an utterly ludicrous statement, for multiple reasons. If every phrase in the Constitution is so perfect, we wouldn't need a Supreme court to interpret it. English is an imprecise language; almost any sentence can have multiple interpretations, with changes in meaning both subtle and gross. And most importantly, the Constitution was meant to be interpreted! It's not a legal straightjacket, it's a set of guidelines and principles. Every single provision in the Bill of Rights has tomes written about it, delving into meaning, exceptions, interpretations, provisions, you name it. Your assertion that the Bill of Rights can stand utterly on it's own, and that no further discussion or interpretation is allowed, is baseless, and is shown to be false by over 200 years of history.", 
   {}, 
   156145, 
   null, 
   1124729460.0
  ], 
  [
   156331, 
   null, 
   "ctaylors", 
   "I seem to have moved this thread in a direction [almost] entirely unanticipated. The original poster countering my thought suggested that I didn't know science. Exactly what part of so-called \"Creation Science\" is a science? If you can prove to me that it is a science, I will be inclined to acquiesce.", 
   {
    "post_info": {
     "post_title": "whew!"
    }
   }, 
   156202, 
   null, 
   1124746260.0
  ], 
  [
   156451, 
   null, 
   "marc9000", 
   "there are a couple of phrases you used, let's see if I can rephrase them.\n \n #1. I didn't say it was impossible to explain a group of words with other words, but it's common for people to incorrectly misiniterpret the phrase for political puurposes\n \n #2. Single words are defined in dictionaries, not groups of words. There is a colossal difference. An intelligent phrase needs no addition. The Constitution is filled with such thought-out phrases.\n \n No doubt your phrases were thought out, but I rewrote them and they mean more or less the same.\n\n \n Your rephrasing used words that were very comparable to my words.\n \n didn't / never\n isn't possible / impossible\n intentionally get wrong / incorrectly misinterpret\n groups of words / phrases\n big / colossal\n well thought out / intelligent\n \n Yet in the part of the first amendment that we're discussing, we have the main words \"establishment of religion\", and \"prohibiting the free exercise thereof\". No similarities at all to \"wall of separation\".", 
   {}, 
   156202, 
   null, 
   1124766120.0
  ], 
  [
   156454, 
   null, 
   "marc9000", 
   "That's an utterly ludicrous statement, for multiple reasons. If every phrase in the Constitution is so perfect, we wouldn't need a Supreme court to interpret it. English is an imprecise language; almost any sentence can have multiple interpretations, with changes in meaning both subtle and gross. And most importantly, the Constitution was meant to be interpreted! It's not a legal straightjacket, it's a set of guidelines and principles. Every single provision in the Bill of Rights has tomes written about it, delving into meaning, exceptions, interpretations, provisions, you name it. Your assertion that the Bill of Rights can stand utterly on it's own, and that no further discussion or interpretation is allowed, is baseless, and is shown to be false by over 200 years of history.\n\n \n Has it been shown to be false, or shown to be debatable? Is it a fact that the Constitution is ever-changing and flexible, or has it been \"interpreted\" that way in some controversial cases? \"Interpreting\" all too often means \"changing\" to arrive at a desired outcome. The ends justify the means. It's called judicial activism.\n \n The Constitution is meant to be APPLIED. That is what the Supreme Court's job is.", 
   {}, 
   156266, 
   null, 
   1124767080.0
  ], 
  [
   156459, 
   null, 
   "Kronus", 
   "Has it been shown to be false, or shown to be debatable? Is it a fact that the Constitution is ever-changing and flexible, or has it been \"interpreted\" that way in some controversial cases? \"Interpreting\" all too often means \"changing\" to arrive at a desired outcome. The ends justify the means. It's called judicial activism.\n \n The Constitution is meant to be APPLIED. That is what the Supreme Court's job is.\n\n \n Has the meaning of the Constitution ever been debated? Are you serious? Does the right to bear arms mean you can have an assault rifle? Does freedom of the press mean that reporters never need to reveal their sources? Is flag burning covered under freedom of speech? Any of these debates ring a bell?\n \n The Bill of Rights is a guideline, it simply isn't specific enough to stand on its own. It must be interpreted, and that is the job of the Supreme Court. This country, which once condoned slavery and denied women the vote, has grown morally over the years, and so we must re-examine what the Constitution means in light of that growth. Sometimes new decisions as to how to interpret the Bill of Rights must be made. You call certain decisions 'judicial activism', I call them interpretations you don't like. Unless you're willing to take the stance that every single re-interpretation was judicial activism? Is that your claim? If not then I don't see how your claim holds any water.", 
   {}, 
   156454, 
   null, 
   1124770140.0
  ], 
  [
   156501, 
   null, 
   "DamEtel", 
   "Kronus: Has the meaning of the Constitution ever been debated? Are you serious? Does the right to bear arms mean you can have an assault rifle? Does freedom of the press mean that reporters never need to reveal their sources? Is flag burning covered under freedom of speech? Any of these debates ring a bell?\n\n \n You nailed him on that one!\n \n \nKronus: The Bill of Rights is a guideline, it simply isn't specific enough to stand on its own. It must be interpreted, and that is the job of the Supreme Court.\n\n \n Yes, and lucky for us all, the Supreme Court has Jefferson's explanations, dataing back to just after the Bill of Rights was created, of what the First Ammendment's religious restrictions were originally intended to do: to build a \"wall of separation between church and state\".", 
   {}, 
   156459, 
   null, 
   1124779380.0
  ], 
  [
   156503, 
   null, 
   "DamEtel", 
   "marc9000: Gee, I don't think so. Because they waited 150 years to even think much about it.\n\n \n And? When they DID think about it, they referenced Jefferson's explanatory statements, penned shortly after the Bill of Rights itself was written, by one of the primary founding fathers of our nation.\n \n \n \nmarc9000: Can you cite any examples of political battles over \"separation of church & state\" before the last 60 years?\n\n \n Sure. The 'template' for the Constitution, Virginia's 1786 Act for Establishing Religious Freedom. There was much political - which at the time also meant religious! - debate about Jefferson's proposal, which is one reason it took until 1786 to pass.\n \n \n \nmarc9000: Why do you suppose George Washington's proclaimation of Thanksgiving day went politically unchallanged?\n\n \n I'd imagine that in those days, when Washington was a god, he could have done all sorts of questionable things, without being questioned about them.\n \n I mean, come on, consider what our current George W - XXXXX and hypocrite - gets away with ... and he, sir, is no Washington!\n \n Also, opposing religious things in those days was virtual political suicide. Just ask Jefferson!\n \n And let's not forget how Jefferson handled this issue...\n \n \n\"Jefferson, unlike Washington and Adams, refused to issue presidential proclamations of thanksgiving to God, often requested on official occassions by the evangelical churches that had played such an important role in passage of the Virginia religious freedom act and ratification of the Constitution.\" (Freethinkers, Susan Jacoby, Owl Books, 2004, p43) \n\n \n Washington's thanksgiving proclamations may have gone officially unchallenged, but Jefferson - as president - refused to do it and considered it a violation of the First Amendment.\n \n \nmarc9000: Was Jefferson the only one entrusted with interpreting the Constitution for us?\n\n \n He's one hell of a lot more authoritative on the matter than you are!\n \n Can you show us a founding father's statements, made just after the Consistution and Bill of Rights were written, that says the First Amendment is NOT supposed to build a wal of separationg between chruch and state?\n \n \n \nmarc9000: Why is all this \"separation of church & state\" outcry happening only today?\n\n \n Probably because freethinkers these days don't risk the same kind of retaliation as they did back then. Hell, just about 10 years ago an atheist who put a stop to school prayer - Madalyn Murray O'Hair - was brutally murdered. Kind of tough for freethinkers to speak out against religious wrongs when those who do get killed, are mistreated, or face destroying their own political careers.\n \n Religious persecution still occurs in America today! The religous persecute those who as not religious.\n \n Over the years, the opposition to freethough has risen and subsided and risen and .... When it's on an upswing, we shouldn't expect to see much protesting of religious actions.\n \n \n \nmarc9000: Then why are those words not in there - EVERYONE who ratified it DID NOT SEE those words.\n\n \n What words? And what is the it that people ratified? Gee, am I supposed to be able to figure out what your intent is just by reading some words? :-)\n \n \nmarc9000: It can be when you add words, that are not in the text.\n\n \n Jefferson didn't add words to the text, and he didn't change the interpretation ... he explained the original intent.\n \n \nmarc9000: No, the ones intent on changing it are the ones who ADD WORDS, not ones who leave the wording as it is.\n\n \n No, those who interpret the First Amendment in a manner other than the original intent - as spelled out by Jefferson - are those who are changing it.\n \n \n \nmarc9000: Are you really an originalist, or are you a non-originalist (activist), as almost all of the \"separation of church & state\" crowd are?\n\n \n Are you an undereducated religious fundamentalist, as almost all of the bashers of \"separation of church and state\" are?", 
   {}, 
   156099, 
   null, 
   1124782680.0
  ], 
  [
   156531, 
   null, 
   "DamEtel", 
   "I'd love to hang out here and continue to show you why you're wrong, but as I said this past Saturday...\n \n \nDamEtel: Well, the next semester starts Monday, so it'll be back to college for me (in addition to working full time). So I won't be able to post here as much as I have been.\n (http://www.4forums.com/political/showthread.php?t=6228)\n \n\n \n Simply not enough time now. I already did a no-no, on my first day back to school, and deprived myself of sleep by replying to you above (and now that I'm back in school I won't be able to catch up on missed sleep until the weekends). It's not something I can continue to do.\n \n What little time I can spare here and there for posting on the Net I will devote to my primary concern, the Creation/Evolution debates; the section where I have spent the vast majority of my time here, and the only one I mentioned when stating I was going back to school...\n \n \nI've been involved heavily in a lot of different threads in this Evolution/Creationism forum. For me to make my \"back to college\" comment on the last page of one thread would not let everyone I've been debating know, and they may mistakenly take my sudden lack of responding to mean I can't counter their arguments. So I'm letting everyone know ahead of time, in one spot, that is clearly seen by all.\n (http://www.4forums.com/political/showthread.php?t=6228)\n \n\n \n TTFN", 
   {
    "unicode_changes_made": true
   }, 
   156503, 
   null, 
   1124805600.0
  ], 
  [
   156664, 
   null, 
   "marc9000", 
   "Has the meaning of the Constitution ever been debated? Are you serious? Does the right to bear arms mean you can have an assault rifle? Does freedom of the press mean that reporters never need to reveal their sources? Is flag burning covered under freedom of speech? Any of these debates ring a bell? \n\n \n The constitution is not about such details. The constitution defines and establishes the distribution, authority, and structure of Government. The process by which decisions are made.\n \n \nThe Bill of Rights is a guideline, it simply isn't specific enough to stand on its own. \n\n \n The Constitution is principles, not specifics, and it stands on it's own just fine, to those who halfway understand it.\n \n \n It must be interpreted, and that is the job of the Supreme Court. \n\n \n And it's the job of legislatures, states and people, to determine specifics about things like assault rifles, news sources, and flag burning. \n \n \nThis country, which once condoned slavery and denied women the vote, has grown morally over the years, and so we must re-examine what the Constitution means in light of that growth. \n\n \n And there is a process to do it, without eliminating or changing it's principles in the slightest. Slavery was outlawed by the 13th amendment, NOT by judicial order. Women were given the right to vote by the 19th amendment, not by judicial order.\n \n \n Sometimes new decisions as to how to interpret the Bill of Rights must be made. You call certain decisions 'judicial activism', I call them interpretations you don't like. \n\n \n No, I call them political decisions made by the wrong people according to the Constitution.\n \n \n Unless you're willing to take the stance that every single re-interpretation was judicial activism? Is that your claim? If not then I don't see how your claim holds any water.\n\n \n I do take that stance, every single re-interpretation when the legislatures, states, or people didn't have the slightest say in the matter.", 
   {}, 
   156459, 
   null, 
   1124847420.0
  ], 
  [
   156666, 
   null, 
   "marc9000", 
   "You nailed him on that one! \n\n \n He did? emoticon_confused I didn't notice.\n \n \n \n \nYes, and lucky for us all, the Supreme Court has Jefferson's explanations, dataing back to just after the Bill of Rights was created, of what the First Ammendment's religious restrictions were originally intended to do: to build a \"wall of separation between church and state\".\n\n \n If his letter to the Danbury Baptists 11 years later is all you've got on that, sorry - it's just not there.", 
   {}, 
   156501, 
   null, 
   1124847960.0
  ], 
  [
   156671, 
   null, 
   "marc9000", 
   "And? When they DID think about it, they referenced Jefferson's explanatory statements, penned shortly after the Bill of Rights itself was written, by one of the primary founding fathers of our nation. \n\n \n Do you really believe a courtesy note to a religious group can by used as an all-encompassing, last word analyzation of the entire first amendment?\n \n \n \n \n \nSure. The 'template' for the Constitution, Virginia's 1786 Act for Establishing Religious Freedom. There was much political - which at the time also meant religious! - debate about Jefferson's proposal, which is one reason it took until 1786 to pass. \n\n \n I was asking about the period AFTER the Constitution and Bill of Rights were established and ratified, not before.\n \n \n \nI'd imagine that in those days, when Washington was a god, he could have done all sorts of questionable things, without being questioned about them. \n\n \n I'd imagine he couldn't have done any more questionable things than any president in any other time, possibly less. He was the first president, probably a lot of jealousy. And a very fresh Constitution. Just think, a decent percentage of people and politicians probably actually understood it! \n \n \nI mean, come on, consider what our current George W - XXXXX and hypocrite - gets away with ... and he, sir, is no Washington!\n \n Also, opposing religious things in those days was virtual political suicide. Just ask Jefferson! \n \n \n I can't communicate with the dead.\n \n \nAnd let's not forget how Jefferson handled this issue...\n\n \n He was outvoted on that one two to one, wasn't he? Why do you hold Jefferson's views so much higher than the other founding fathers? Why do you expect everyone else to?\n \n \n \n \nWashington's thanksgiving proclamations may have gone officially unchallenged, but Jefferson - as president - refused to do it and considered it a violation of the First Amendment. \n\n \n He didn't have to do it because it was already done. He specifically considered Thanksgiving day a violation of the First Amendment? Can you reference that, or did you just make it up?\n \n \n \n \nHe's one hell of a lot more authoritative on the matter than you are!\n\n \n That's true. And it's equally true that you aren't qualified to speak for him.\n \n \nCan you show us a founding father's statements, made just after the Consistution and Bill of Rights were written, that says the First Amendment is NOT supposed to build a wal of separationg between chruch and state?\n\n \n No. I can't find anything by them that says we can't change to communism in 50 years either, but I think it's safe to say they didn't want it. But I can show you a statement by Jefferson about judicial activism, written in 1825, after he had a chance to see how the U.S. system of government worked.\n \n \n This member of Government [the judiciary] was at first considered as the most harmless and helpless of all it's organs. But it has proved that the power of declaring what the law is...by sapping and mining slyly and without alarm the foundations of the Constitution, and do what open force would not dare to attempt.\n(letter from Jefferson to Edward Livingston, 1825)\n \n \n Kind of reminds you of the recent eminent domain law, doesn't it?\n \n \n \n \nProbably because freethinkers these days don't risk the same kind of retaliation as they did back then. Hell, just about 10 years ago an atheist who put a stop to school prayer - Madalyn Murray O'Hair - was brutally murdered. Kind of tough for freethinkers to speak out against religious wrongs when those who do get killed, are mistreated, or face destroying their own political careers. \n Religious persecution still occurs in America today! The religous persecute those who as not religious.\n \n Over the years, the opposition to freethough has risen and subsided and risen and .... When it's on an upswing, we shouldn't expect to see much protesting of religious actions.\n\n \n O,Hair's murder \"political retaliation\" emoticon_rolleyes / Religious persecution - give me a break. \n \n \n \n \n \nWhat words? And what is the it that people ratified? Gee, am I supposed to be able to figure out what your intent is just by reading some words? :-) \n \n \n The words, \"separation of church and state\". Please concentrate.\n \n \n \n \nJefferson didn't add words to the text, and he didn't change the interpretation ... he explained the original intent\n \n \n \n No, those who interpret the First Amendment in a manner other than the original intent - as spelled out by Jefferson - are those who are changing it.\n\n \n The Danbury letter was not intended to \"spell it out\". If you want to see things spelled out, check out the Federalist Papers sometime. \n \n \n \nAre you an undereducated religious fundamentalist, as almost all of the bashers of \"separation of church and state\" are?\n\n \n I'm an originalist. I see you responded to my question with a question, and ducked mine. Maybe this will help you. I honestly believe it's non partisan.\n \n http://www.law.umkc.edu/faculty/projects/ftrials/conlaw/interp.html\n \n Read the eight reasons for each, Originalist and Non-Originalist, and let me know which one describes you best. I'll hold my breath. :p", 
   {}, 
   156503, 
   null, 
   1124850660.0
  ], 
  [
   156673, 
   null, 
   "marc9000", 
   "I'd love to hang out here and continue to show you why you're wrong, but as I said this past Saturday...\n\n \n These threads stay up here for years - there'll be time. You'll have some breaks coming up this fall & winter (Thanksgiving & Christmas emoticon_xclown ) I'll be here. :)", 
   {
    "unicode_changes_made": true
   }, 
   156531, 
   null, 
   1124851140.0
  ], 
  [
   156736, 
   null, 
   "Kronus", 
   "\n I do take that stance, every single re-interpretation when the legislatures, states, or people didn't have the slightest say in the matter.\n\n \n I don't suppose you want to give a few examples here? For example, can you give one instance of where a supreme court ruling was based on what the legislature said? No, you can't, because that isn't how the system works, and never was. The Supreme Court rules based on their interpretation of the law and the Constitution, and nothing else. If the legislature et.al. don't like the ruling they're free to try to amend the Constitution. That's how the system works. All you're trying to do here is invent a responsibility for the SC which never existed. The SC aren't beholden to the people, they're beholden to the law. You're just want them to be beholden to the people because you don't like some of their recent rulings. And that's exactly why they're not. They rule based on legal principles, not whatever political trend is popular this week.", 
   {}, 
   156664, 
   null, 
   1124897280.0
  ], 
  [
   156885, 
   null, 
   "marc9000", 
   "I don't suppose you want to give a few examples here? For example, can you give one instance of where a supreme court ruling was based on what the legislature said? No, you can't, because that isn't how the system works, and never was. \n\n \n How about two examples, one where there was re-interpretation, and one where there was correct interpretation.\n \n A re-interpretation one was McCain-Feingold, where the Supreme Court found the words \"shall make no law abridging the freedom of speech....\" to be not as important as their personal opinions that Congress has broad authority in acting against the corrupting power of money in politics. To be fair, I must admit that Bush signed it, and IMO Bush was wrong to do that. I believe he signed it to avoid a media onslaught. No excuse, but I think he's far less guilty than the Supreme Court.\n \n A correct interpretation one was the Railroad Retirement Act of 1934. This was legislation passed by Congress (citing the commerce clause), establishing compulsory retirement plans for railroad workers. The Supreme Court invalidated it in 1935 because it interpreted NO Constitutional authority to regulate a business relationship between employer and employee. THAT is how the system is supposed to work.\n \n \nThe Supreme Court rules based on their interpretation of the law and the Constitution, and nothing else. \n\n \n Not when they subtract words, like \"shall make no law\", or when they add words, like \"separation of church & state\". \n \n \n If the legislature et.al. don't like the ruling they're free to try to amend the Constitution. That's how the system works. \n\n \n That is true. There are no well defined steps in the Constitution to correct their errors, or control their adjudications. The framers thought that those on the Supreme court would have integrity enough to repect the strict language of the Constitution, or at least would be intimidated by a populace that didn't have their heads in the sand. They were wrong about that. \n \n \n All you're trying to do here is invent a responsibility for the SC which never existed. \n\n \n What responsibility would that be? I'm trying to show that they DON'T have responsibilities that they claim to have. Try this one; Justice Anthony Kennedy, speaking to the American Bar Association in 2003;\n \n \n I can accept neither the necessity nor the wisdom of federal mandatory minimum [prison] sentences. In too many cases, mandatory minimum sentences are unwise and unjust. \n\n \n Since it's federal law, and not prohibited by the Constitution, no one should care what he \"personally accepts\" about it. Maybe I'm wrong, but I'd bet you won't find GOOD Supreme Court justices like Clarence Thomas or Antonin Scalia pubicly spouting off about what they can or can't personally accept, if it hasn't to do with constitutional law. \n \n \n The SC aren't beholden to the people, they're beholden to the law. You're just want them to be beholden to the people because you don't like some of their recent rulings. And that's exactly why they're not. They rule based on legal principles, not whatever political trend is popular this week.\n\n \n They're beholden to LIBERALS, and that's important to a lot of people right now, since the Presidency, House, and Senate aren't beholden to liberals these days.", 
   {}, 
   156736, 
   null, 
   1124936400.0
  ], 
  [
   156918, 
   null, 
   "zachvac", 
   "\n Not when they subtract words, like \"shall make no law\", or when they add words, like \"separation of church & state\". \n \n\n The first amendment says they shall make no law RESPECTING an establishment of religion which means it can't even recognize religion when making laws (what Congress does, or is supposed to do). If you really think the Constitution should be interpreted to the letter I'm sure you also agree that I can yell \"fire\" in a crowded theatre because they can't abridge the freedom of speech. Period. I may also lie under oath, sell secrets to enemy governments, etc. because otherwise that would be abridging my freedom of speech.\n \n \n\n That is true. There are no well defined steps in the Constitution to correct their errors, or control their adjudications. The framers thought that those on the Supreme court would have integrity enough to repect the strict language of the Constitution, or at least would be intimidated by a populace that didn't have their heads in the sand. They were wrong about that. \n \n\n Whether they were right or wrong they did outline a process to correct the errors. It's called the amendment process.", 
   {}, 
   156885, 
   null, 
   1124953380.0
  ], 
  [
   156958, 
   null, 
   "Kronus", 
   "How about two examples, one where there was re-interpretation, and one where there was correct interpretation.\n \n A re-interpretation one was McCain-Feingold, where the Supreme Court found the words \"shall make no law abridging the freedom of speech....\" to be not as important as their personal opinions that Congress has broad authority in acting against the corrupting power of money in politics. To be fair, I must admit that Bush signed it, and IMO Bush was wrong to do that. I believe he signed it to avoid a media onslaught. No excuse, but I think he's far less guilty than the Supreme Court.\n \n A correct interpretation one was the Railroad Retirement Act of 1934. This was legislation passed by Congress (citing the commerce clause), establishing compulsory retirement plans for railroad workers. The Supreme Court invalidated it in 1935 because it interpreted NO Constitutional authority to regulate a business relationship between employer and employee. THAT is how the system is supposed to work.\n \n\n \n You have proved my point far more elegantly than I ever could. Both cases you site are examples of the SC expressing legal opinions. However, you don't like the first decision, and so you claim the SC acted incorrectly. You have no problem with the second decision, so that's a case where the SC acted \"correctly\". Clearly your definition of a correct/incorrect ruling is one which you agree/disagree with. At least that's consistent with your \"reasoning\" throughout this debate, I'll grant you that.", 
   {}, 
   156885, 
   null, 
   1124981220.0
  ], 
  [
   165724, 
   null, 
   "DamEtel", 
   "Are you an undereducated religious fundamentalist, as almost all of the bashers of \"separation of church and state\" are?\n\n \n Seems marc9000 is.", 
   {}, 
   156503, 
   null, 
   1127616540.0
  ], 
  [
   165727, 
   null, 
   "DamEtel", 
   "DamEtel: And? When they DID think about it, they referenced Jefferson's explanatory statements, penned shortly after the Bill of Rights itself was written, by one of the primary founding fathers of our nation. \n\n \n \nmarc9000: Do you really believe a courtesy note to a religious group can by used as an all-encompassing, last word analyzation of the entire first amendment?\n\n \n No, but I believe Jefferson's letter to the Danbury Baptists explaining the intent of the First Amendment is a founding father's explanation of the intent of the First Amendment.\n \n And, gee, my belief seems to be quite in line with the Supreme Court's!\n \n \n\"The appeal to Thomas Jefferson's separationist interpretation goes back much further, as far as 1878 in the Supreme Court decision Reynolds vs. United States, which quoted Jefferson's \"Letter to the Danbury Baptists\" containing the phrase \"wall of separation\" and then stated:\n \n Coming as this does from an acknowledged leader of the advocates of the measure, it may be accepted almost as an authoritative declaration of the scope and effect of the amendment.\n (The Myth of Christian America: What You Need to Know about the Separation of Church and State, Mark Weldon Whitten, Amyth & Helwys, 1999m p23) \n", 
   {}, 
   156671, 
   null, 
   1127617200.0
  ], 
  [
   166276, 
   null, 
   "Easyrider", 
   "No, but I believe Jefferson's letter to the Danbury Baptists explaining the intent of the First Amendment is a founding father's explanation of the intent of the First Amendment.\n\n \n Thomas Jefferson regularly attended church services in government buildings and continued to do so even after his Danbury \"Separation\" letter. I hardly think he wanted to evict the name of God from the government square.", 
   {}, 
   165727, 
   null, 
   1127794500.0
  ], 
  [
   166333, 
   null, 
   "Matthew S", 
   "Thomas Jefferson regularly attended church services in government buildings and continued to do so even after his Danbury \"Separation\" letter. I hardly think he wanted to evict the name of God from the government square.\n\n \n \n Which only goes to prove that you can go to church yourself and hold personal beliefs but respect the rights of others to make the same choice not to be forced to look at, attend, or even recognise a church. Many conservates and evangelicals want a state religion no matter if it offends, and abridges peoples right to not believe or attend religious services other then christian. Why can't your admit it EZ you want a National Protastant Christian Church with forced conversion centers, and military men with rifiles forcing people to attend church.", 
   {}, 
   166276, 
   null, 
   1127821860.0
  ], 
  [
   166404, 
   null, 
   "Diogenes99", 
   "Many conservates and evangelicals want a state religion no matter if it offends, and abridges peoples right to not believe or attend religious services other then christian.\nThe same accusation could reasonably be levelled at the secular left which insists that their brand of \"religion\" (i.e., atheism) be acknowledged and observed by all.\n \n A logical extension of \"no public acknowledgment of religion\" would require that a number of cities change their names: San Francisco, San Diego, Los Angeles, Las Cruces, San Antonio, Corpus Christi, St. Charles, and St. Paul to name a few.", 
   {}, 
   166333, 
   null, 
   1127846640.0
  ], 
  [
   166489, 
   null, 
   "Mucusaur", 
   "Perhaps Bushigrad would be better?", 
   {}, 
   166404, 
   null, 
   1127863680.0
  ], 
  [
   166522, 
   null, 
   "Steeeeve", 
   "Which only goes to prove that you can go to church yourself and hold personal beliefs but respect the rights of others to make the same choice not to be forced to look at, attend, or even recognise a church. Many conservates and evangelicals want a state religion no matter if it offends, and abridges peoples right to not believe or attend religious services other then christian. Why can't your admit it EZ you want a National Protastant Christian Church with forced conversion centers, and military men with rifiles forcing people to attend church.\n\n \n Who is pushing this? seperation of church in state doesn't mean that a church can't try to influence the government. A Church has every right to try to get their views into law as NOW or anyother group in the US. Just because it happens to be a Church shouldn't limit anything. So I am not sure where the government is establishing a religion or proventing the free exercise of it.", 
   {}, 
   166333, 
   null, 
   1127869080.0
  ], 
  [
   166577, 
   null, 
   "Kronus", 
   "Who is pushing this? seperation of church in state doesn't mean that a church can't try to influence the government. \n\n \n Quite right. Freedom of speech gives them the right to try. Seperation of church and state means it's the government's job to not give in, at least if the church is advocating something that would infringe on the rights of others.", 
   {}, 
   166522, 
   null, 
   1127881320.0
  ], 
  [
   166594, 
   null, 
   "DamEtel", 
   "So I am not sure where the government is establishing a religion or proventing the free exercise of it.\n\n \n Well, should the government pay to build churches? That would be taking taxpayers' money and funneling it into religious institutions. Remember, 14% of US taxpayers' are atheists (or at least are not religious), and they have no choice but to pay their taxes (there is no option to opt out paying the monies that would go to the churches).\n \n And as Jefferson said:\n \n \n\"To compel a man to furnish contributions of money for the propagation of opinions which he disbelieves and abhors, is sinful and tyrannical.\"\n \n (Thomas Jefferson, Statute for Religious Freedom, 1779. Papers, 1:545\n http://www.positiveatheism.org/hist/quotes/jefframe.htm) \n\n \n and...\n \n \n\"[N]o man shall be compelled to frequent or support any religious worship, place, or ministry whatsoever ...\"\n \n (Thomas Jefferson, Virginia Statute for Religious Freedom (1779), quoted from Merrill D. Peterson, ed., Thomas Jefferson: Writings (1984), p. 347 \n http://www.positiveatheism.org/hist/quotes/jefframe.htm) \n", 
   {
    "unicode_changes_made": true
   }, 
   166522, 
   null, 
   1127882700.0
  ], 
  [
   166598, 
   null, 
   "Bassman", 
   "\"Positive\" atheism? Now there's a contradiction of terms if I ever saw one.", 
   {}, 
   166594, 
   null, 
   1127883240.0
  ], 
  [
   166608, 
   null, 
   "DamEtel", 
   "\"Positive\" atheism? Now there's a contradiction of terms if I ever saw one.\n\n \n No, it makes sense.\n \n Scientific Creationism, on the other hand, is a true oxymoron.", 
   {}, 
   166598, 
   null, 
   1127884320.0
  ], 
  [
   166638, 
   null, 
   "Phunting", 
   "Well, should the government pay to build churches? That would be taking taxpayers' money and funneling it into religious institutions. Remember, 14% of US taxpayers' are atheists (or at least are not religious), and they have no choice but to pay their taxes (there is no option to opt out paying the monies that would go to the churches).\nAs a devout atheist myself, I wouldn't have a problem with it. As long as it were across the board and not just for Protestants. Few people are literate to any great degree either, but I still support the building of libraries...", 
   {}, 
   166594, 
   null, 
   1127918640.0
  ], 
  [
   166639, 
   null, 
   "Phunting", 
   "\"Positive\" atheism? Now there's a contradiction of terms if I ever saw one.\nIn what sense?", 
   {}, 
   166598, 
   null, 
   1127918820.0
  ], 
  [
   166734, 
   null, 
   "sinjin", 
   "In what sense?\n\n \n Y'know, like there's no point in living without the promise of pie in the sky.", 
   {}, 
   166639, 
   null, 
   1127936880.0
  ], 
  [
   166887, 
   null, 
   "DamEtel", 
   "As a devout atheist myself, I wouldn't have a problem with it. As long as it were across the board and not just for Protestants. Few people are literate to any great degree either, but I still support the building of libraries...\n\n \n Any \"atheist\" who:\n \n 1) professes to be a DEVOUT atheist (devout being a term that is usually seen being applied to a religion, such as \"Tom is a devout Christian\")\n \n and\n \n 2) states he has no problem with the US goverment building churches using taxpayer funds\n \n automatically has his claim to be an atheist doubted. I don't know what kind of atheist you claim to be, or think you are, but you sure don't appear to hold a rather standard atheist view, and you also used religious terminology where non-religious terminology would do just as well.", 
   {}, 
   166638, 
   null, 
   1128003480.0
  ], 
  [
   166898, 
   null, 
   "Phunting", 
   "Any \"atheist\" who:\n \n 1) professes to be a DEVOUT atheist (devout being a term that is usually seen being applied to a religion, such as \"Tom is a devout Christian\")\n \n and\n \n 2) states he has no problem with the US goverment building churches using taxpayer funds\n \n automatically has his claim to be an atheist doubted. I don't know what kind of atheist you claim to be, or think you are, but you sure don't appear to hold a rather standard atheist view, and you also used religious terminology where non-religious terminology would do just as well.\nIndeed. I almost put devout in quotation marks, but in the end left it. It was meant to be humourous. Oh well. \n \n As to what kind I claim or think I am: I am a Gnostic Atheist, or Strong Atheist as it is sometimes called in that I believe, not just surmise, that there is no god.\n \n I have no problem with the government supporting anything that can be useful to society. If a community can benefit from a church/ mosque/ synagogue then why should my personal belief conflict with that? Unlike many that follow those religions I am secure enough in my own beliefs to be able to accept that not everyone follows them, and I don't need to convert people to the true path!\n \n Of course if the government was pushing one particular religion, or attempting to convert then I would have a very big problem with it.", 
   {}, 
   166887, 
   null, 
   1128005940.0
  ], 
  [
   166976, 
   null, 
   "Diogenes99", 
   "I have no problem with the government supporting anything that can be useful to society. If a community can benefit from a church/ mosque/ synagogue then why should my personal belief conflict with that? Unlike many that follow those religions I am secure enough in my own beliefs to be able to accept that not everyone follows them, and I don't need to convert people to the true path!\nSociety would benefit greatly if more folks (religious and non-religious) had your kind of open-mindedness and tolerance. I salute you.", 
   {}, 
   166898, 
   null, 
   1128034920.0
  ], 
  [
   167574, 
   null, 
   "Phunting", 
   "Society would benefit greatly if more folks (religious and non-religious) had your kind of open-mindedness and tolerance. I salute you.\nWell thanks, but I think you do me too much credit. I feel most people have similar views, it's just that the fanatics tend to be more noticeable.", 
   {}, 
   166976, 
   null, 
   1128340740.0
  ], 
  [
   173959, 
   null, 
   "GreenMtnBoy", 
   "I have no problem with the government supporting anything that can be useful to society. If a community can benefit from a church/ mosque/ synagogue then why should my personal belief conflict with that? Unlike many that follow those religions I am secure enough in my own beliefs to be able to accept that not everyone follows them, and I don't need to convert people to the true path!\n\n \n Except whom decides which religion is \"useful to society\"? What would happen if the government started supporting a single faith and not others? They could practically tax the people into being a certain faith.\n \n This is why government needs to be kept far away from religion, the people can decide for themselves, the government doesn't need to \"help\".", 
   {}, 
   166898, 
   null, 
   1130236740.0
  ], 
  [
   203944, 
   null, 
   "FredVonFlash", 
   "Has anyone noticed nowadays how powerful Christian coalitions have become? Not only have they forced intelligent design to be taught in science classes, but now they impose their christian morality upon us all? What are your opinions on this?\n\n \n My opinion is that the government has no moral or legal authority whatsoever over the duty that we owe to our Creator. The Constitution was intended to leave the religion of the people as free as the air they breathe from government influence.", 
   {}, 
   153667, 
   null, 
   1143260520.0
  ], 
  [
   205000, 
   null, 
   "simone", 
   "It's merely a reaction to today's unprecidented anti-Christian movements.\n \n Separation of church & state never did mean much, since it's not in the Constitution.\nUm, do you choose to ignore the First Amendment to the United States Constitution, enacted on December 15, 1791?\n \n Just to refresh your memory, or acquaint you with the Amendment in case you didn't know about it before, after all it's only been around for two centuries:\n \nAmendment I.\n Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press, or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\nNow, I suppose I'm going to have to explain to you precisely what the First Amendment means.\n \n It means that the State shall be separate from the Church and will do nothing to establish the Chuch, nor shall the State do anything to hinder the Church.\n \n As to freedom of speech, it means that the people of the United States of America shall not be prevented from free expression.\n \n As to freedom of the press, it means that the press shall operate separately from the State, not as an agent of the State, the press shall be a separate agent, the Fourth Estate--have you heard about the term \"Fourth Estate\" before?--meaning that the press shall have the freedom to be critical of the Government.\n \n As to the freedom to peaceable assemble, to petition the Government for redress of grievances, it means that the people of the United States of America shall have the freedom to peaceably gather to demonstrate and protest what they consider to be the illicit conduct of Government and to demand redress for that conduct.\n \n Understand what the United States is about now, marc?", 
   {}, 
   153776, 
   null, 
   1143914940.0
  ], 
  [
   205086, 
   null, 
   "marc9000", 
   "Um, do you choose to ignore the First Amendment to the United States Constitution, enacted on December 15, 1791?\n \n Just to refresh your memory, or acquaint you with the Amendment in case you didn't know about it before, after all it's only been around for two centuries:\n Now, I suppose I'm going to have to explain to you precisely what the First Amendment means.\n \n It means that the State shall be separate from the Church and will do nothing to establish the Chuch, nor shall the State do anything to hinder the Church.\n \n As to freedom of speech, it means that the people of the United States of America shall not be prevented from free expression.\n \n As to freedom of the press, it means that the press shall operate separately from the State, not as an agent of the State, the press shall be a separate agent, the Fourth Estate--have you heard about the term \"Fourth Estate\" before?--meaning that the press shall have the freedom to be critical of the Government.\n \n As to the freedom to peaceable assemble, to petition the Government for redress of grievances, it means that the people of the United States of America shall have the freedom to peaceably gather to demonstrate and protest what they consider to be the illicit conduct of Government and to demand redress for that conduct.\n \n Understand what the United States is about now, marc?\n\n \n I understand that you just discovered my post #5 here (almost 8 months old), and skipped the rest of the thread. Behind in your reading are you? I just enjoyed the whole thing again. If you'll check post #47, #50, (please note Rehnquists words carefully here) and post #84, then let me know if you have any relevent questions.", 
   {}, 
   205000, 
   null, 
   1143951360.0
  ], 
  [
   209383, 
   null, 
   "FredVonFlash", 
   " Separation of church & state never did mean much, since it's not in the Constitution.\n\n \n During the first half century of the Republic, the separation of church and state meant no stamping \"In God We Trust\" on the nation's coins, no pledge with an affirmation of belief in \"one Nation under God\" and no Ten Commandments in the courts or the public schools. It also meant the mail was transported on Sunday even if it violated the commandment to remember the Sabbath and to keep it holy. It further meant that Congress did not ask the President to issue religious recommendations to the people regarding prayer, fasting and the giving of thanks; and that the President did not issue religious advice even if Congress, or the Dutch Reformed Church, asked him to. \n \n FVF", 
   {}, 
   153776, 
   null, 
   1145894280.0
  ], 
  [
   242049, 
   null, 
   "freejoe1", 
   "emoticon_confused \nWhat are these groups? Why is the christians religious freedom more important then those who wish to be left alone and not wish to particpate in christian activities?\n \n \n Do you mean the people who want to be free of having their children forced to stand and patipate in christian prayers?\n\n \n people who want to be free of having their children forced to stand and patipate in christian prayers? are the ones who wonder why ther children\n end up braken the law in the future and going to jail.emoticon_confused", 
   {}, 
   153832, 
   null, 
   1165194900.0
  ], 
  [
   242060, 
   null, 
   "zachvac", 
   "emoticon_confused \n \n people who want to be free of having their children forced to stand and patipate in christian prayers? are the ones who wonder why ther children\n end up braken the law in the future and going to jail.emoticon_confused\n\n \n Right, because people who are forced to stand and participate in Christian prayers never break laws and people who aren't do it all the time. Prayers have been proven to keep kids out of jail. Oh wait, no they haven't.", 
   {}, 
   242049, 
   null, 
   1165199640.0
  ], 
  [
   242713, 
   null, 
   "Shooterandproud", 
   "I think the \"movements\" don't attempt to identify themselves as anti-Christian or satanic, they simply try to invoke activities into our society that have never traditionally been there, to cheapen Christianity. Things like state lotteries, casino gambling, gay marriage, smut on the internet and cable television - all things that were all but completely absent \"20 years ago\". \"Movements and goals\" that go back a little further than 20 years would be Hollywood and the music industry's largely subliminal jabs at things like parental authority and morals in general.\n\n \n You mean personal liberties and freedoms? You're right, god forbid we have any personal liberties or freedoms, we must have the government and the pope decide everything for us!\n \n \n \n \n \nThose exact words were written by Thomas Jefferson to the Danbuy Baptists in 1802, and have been debated and discussed ever since. A few liberal Supreme Court justices along with our liberal news media have done an amazing job of convincing many uninformed people that they are in the Constitution.\n\n \n At least its not as bad a conservative nutjobs trying to legislate their own religion.", 
   {}, 
   153984, 
   null, 
   1165703460.0
  ], 
  [
   242714, 
   null, 
   "Shooterandproud", 
   "Can you imagine the first president proclaiming a national day of Thanksgiving to Almighty God within days of the vote on the Bill of Rights? Why didn't all these \"diests\" object? \n \n Can you imagine the very effective separation between religion and state originally applying ONLY to Congress, and not to the states? They did not prohibit states from establishing religions, and several of them did. That has changed since the days of all those \"diests\", and I think it's a good thing. You'd think athiests would be satisfied with that. But it seems that those who seek to destroy Christianity are never satisfied.\n\n \n Actually, atheists only advocate freedom. Christians conservative zealots try to legislate their own beliefs. We're lucky we have atheists, I can't imagine where we'd be without them.", 
   {}, 
   153988, 
   null, 
   1165703640.0
  ], 
  [
   242716, 
   null, 
   "Matthew S", 
   "emoticon_confused \n \n people who want to be free of having their children forced to stand and patipate in christian prayers? are the ones who wonder why ther children\n end up braken the law in the future and going to jail.emoticon_confused\n\n \n Why would a Wiccan or a non believer want their children forced to pray to something the believe doesn't exist", 
   {}, 
   242049, 
   null, 
   1165703820.0
  ], 
  [
   242717, 
   null, 
   "Shooterandproud", 
   "The opening post of this thread didn't specify any certain threats from Christian Coalitions that insist that you be religious. Can you name any? If you can, we'll compare them to some threats by the ACLU, and AU. (Americans United) We'll also compare the political influence of the sources of the threats.\n \n \n \n \n Not everything can be broken down into three neat catagories. (Christian, anti-Christian, and neutral.) Neutrality often isn't an issue in a society full of humans, humans who often have problems with purpose, failure, loss, sickness, disability, birth, and death. Neutrality and anti-Christianity are indistinguishable in many cases - they have the same non-answers. Life is meaningless, if it feels good do it. Live for the moment. And society is jeapordized by it. The framers and yesterdays general public knew it, judging from the almost countless times public money funded religious organizations in the U.S. first 150 years of existance.\n \n \n \n The concept is NOT there, not in the Constitution. It IS in judicial activism. I think you're confusing the two.\n\n \n How come you paint all of that as a bad thing? Thank god for the ACLU, as if it weren't for them, we'd be living in a conservative utopia, with religion running wild destroying our society, the inquisition being reinstated, i can't imagine it. Religion is a major obstacle in peace. Why do you insist people believe your religion? Why are you not happy that we are at least allowing you to practice your religion. What more do you want? Do you want radical conservativism implimented into law? Thats just silly.", 
   {}, 
   154241, 
   null, 
   1165704060.0
  ], 
  [
   242723, 
   null, 
   "Bassman", 
   "How come you paint all of that as a bad thing? Thank god for the ACLU, as if it weren't for them, we'd be living in a conservative utopia, with religion running wild destroying our society, the inquisition being reinstated, i can't imagine it. Religion is a major obstacle in peace. Why do you insist people believe your religion? Why are you not happy that we are at least allowing you to practice your religion. What more do you want? Do you want radical conservativism implimented into law? Thats just silly.\n\n As a matter of fact, it was Liberal policies that did more damage to this country. Starting with FDR and his \"New Deal\" to LBJ and the very destructive \"war on Poverty\". You've seen the results, but I guess as an avowed Socialist, you still insist that pumping more and more money into thes failed programs, they'll work better.", 
   {}, 
   242717, 
   null, 
   1165713840.0
  ], 
  [
   246100, 
   null, 
   "pandion", 
   "emoticon_confused \n \n people who want to be free of having their children forced to stand and patipate in christian prayers? are the ones who wonder why ther children\n end up braken [sic] the law in the future and going to jail.\nNonsense. My children haven't broken the law. Both are adults, one an attorney and the other an Army NCO (who also has a master's degree). Good tax paying citizens and they were not forced to stand and recite christian prayers.\n \n By the way, are you aware that the population of our prisons is overwhelmingly christian? Did you know that the percentage of atheists in prison is less than the percentage in the population over all? Why do you thini that is?", 
   {}, 
   242049, 
   null, 
   1168036440.0
  ], 
  [
   284871, 
   null, 
   "Tdkocher", 
   "Nonsense. My children haven't broken the law. Both are adults, one an attorney and the other an Army NCO (who also has a master's degree). Good tax paying citizens and they were not forced to stand and recite christian prayers.\n \n By the way, are you aware that the population of our prisons is overwhelmingly christian? Did you know that the percentage of atheists in prison is less than the percentage in the population over all? Why do you thini that is?\n\n \n I say that that is because there are christian prison ministries that go in and the criminals are converted. I noticed you just said how many are christian not how many became criminals and were christians. Are you also impling that there are more christians in jail than in the overal population?\n \n Also, I would just like to say that just becuase my opinions are based of my understanding of my religion doesn't mean that it is a violation of \"seperation of church and state\".", 
   {}, 
   246100, 
   null, 
   1190419680.0
  ], 
  [
   284872, 
   null, 
   "Tdkocher", 
   "As a matter of fact, it was Liberal policies that did more damage to this country. Starting with FDR and his \"New Deal\" to LBJ and the very destructive \"war on Poverty\". You've seen the results, but I guess as an avowed Socialist, you still insist that pumping more and more money into thes failed programs, they'll work better.\n\n \n Thank goodness someone gets that putting more money in something that has failed will not make it better automaticly.", 
   {}, 
   242723, 
   null, 
   1190419740.0
  ], 
  [
   285549, 
   null, 
   "Shooterandproud", 
   "As a matter of fact, it was Liberal policies that did more damage to this country. Starting with FDR and his \"New Deal\" to LBJ and the very destructive \"war on Poverty\". You've seen the results, but I guess as an avowed Socialist, you still insist that pumping more and more money into thes failed programs, they'll work better.\n\n \n Thats right, we should just let the less fortunate starve, so we can keep our money. Right. Just because I'm not a right-wing nut-job, doesn't mean I'm a socialist.\n \n \n \n Liberals have had a nasty habit of being right in history. Whether it was abolishing slavery to women's rights, the conservatives were the oppressors. We were right then and we are right now.", 
   {}, 
   242723, 
   null, 
   1190953080.0
  ], 
  [
   288140, 
   null, 
   "Antibogotes", 
   "Funny though that you find many stellar physicists are religious. Saw one interview once with an expert on the big bang. He said science will only ever get us within micro fractions of milliseconds after the big bang. What came before will probably always be a matter of faith in his opinion.\n\n \n You find lots of every kind of scientist who are religious. I'm a Buddhist. In Buddhism it is explicitly taught (Malunkyaputtasutta) that religion has nothing to say about the origin of the universe. It can only address human error and human suffering, their causes and cures. Also, you shouldn't believe that just because scripture says so. Belief is not faith, particularly belief in nonsense. Belief doesn't make you a better person. That takes work.\n \n Your numbers are off. A milli-microsecond is a nanosecond, 10^-9 sec, or 0.000000001 second. We have electric circuits that operate faster than that. Our understanding of physics takes us back to within 10^-44 (0.00000000000000000000000000000000000000000001) seconds after the Big Bang. However, there are a number of theories of the time before the Big Bang, with quite odd names such as the False Vacuum. I'm afraid I can't explain the math, but this theory proposes that there were large numbers of Big Bangs starting in extremely small regions of space (but not singularities), and still are, outside the region of spacetime that we and our galaxies inhabit.", 
   {
    "post_info": {
     "post_title": "Once upon a time there was nothing, which exploded"
    }
   }, 
   154485, 
   null, 
   1192693920.0
  ], 
  [
   291854, 
   null, 
   "PoliticalRef", 
   "Do you desire that Christians cease making their opinions on public policy known? Or that they stop attempting to advocate their views?", 
   {
    "post_info": {
     "post_title": "Question Your Definition of Separation"
    }
   }, 
   153667, 
   null, 
   1196318100.0
  ], 
  [
   291926, 
   null, 
   "jitobear", 
   "Do you desire that Christians cease making their opinions on public policy known? Or that they stop attempting to advocate their views?\n\n \n No - I support the first ammendment. But I do fully expect my government to operate as a secular entity and disregard any requests to law that serve no purpose outside of appeasing religion.", 
   {}, 
   291854, 
   null, 
   1196355420.0
  ], 
  [
   291996, 
   null, 
   "foundit66", 
   "You find lots of every kind of scientist who are religious. I'm a Buddhist. In Buddhism it is explicitly taught (Malunkyaputtasutta) that religion has nothing to say about the origin of the universe. It can only address human error and human suffering, their causes and cures. Also, you shouldn't believe that just because scripture says so. Belief is not faith, particularly belief in nonsense. Belief doesn't make you a better person. That takes work.\n\n That is incredibly profound. emoticon_xagree", 
   {}, 
   288140, 
   null, 
   1196376000.0
  ], 
  [
   292288, 
   null, 
   "pandion", 
   "I say that that is because there are christian prison ministries that go in and the criminals are converted.\nI doubt it. I think that ratio of christian criminals to atheist criminals in our population is higher than the ration of christians to atheists. Thus, the ration holds in our prison populations.\n \nI noticed you just said how many are christian not how many became criminals and were christians.\nProbably most. I haven't found that christians are particularly honest or moral.\n \nAre you also impling that there are more christians in jail than in the overal population?\nAs a percentage, yes.\n \nAlso, I would just like to say that just becuase my opinions are based of my understanding of my religion doesn't mean that it is a violation of \"seperation of church and state\".\nNo. No one has said that. The point is that the laws that you advocate because of your religion would be a violation of the 1st Amendment principle of separation of church and state.", 
   {}, 
   284871, 
   null, 
   1196622000.0
  ], 
  [
   292826, 
   null, 
   "irishlass3399", 
   "Originally Posted by georged \n ...As most of the founding fathers were dietists with a few agnostics, \n I can't even imagine agreement among them to combine government \n with mythical belief systems.\n\n \n The Founders were not diests. Our country was founded by religious people, and the Consitution is intended for a good and moral people. Where do your morals come from? Religion, either directly in indirectly. They never intended for religion to be pushed out of out lives to please the minority.", 
   {}, 
   153961, 
   null, 
   1196919900.0
  ], 
  [
   292828, 
   null, 
   "Archangel", 
   "Originally Posted by georged \n ...As most of the founding fathers were dietists with a few agnostics, \n I can't even imagine agreement among them to combine government \n with mythical belief systems.\n\n \n The Founders were not diests. Our country was founded by religious people, and the Consitution is intended for a good and moral people. Where do your morals come from? Religion, either directly in indirectly. They never intended for religion to be pushed out of out lives to please the minority.\n\n \n Welcome to the forum irishlass3399, but good luck convincing the atheist majority around here that the righteous and moral foundation the founding fathers designed was actually intended by them based on absolute moral and religious principles found in their personal beliefs in a living God.", 
   {}, 
   292826, 
   null, 
   1196920740.0
  ], 
  [
   295663, 
   null, 
   "Matthew S", 
   "Originally Posted by georged \n ...As most of the founding fathers were dietists with a few agnostics, \n I can't even imagine agreement among them to combine government \n with mythical belief systems.\n\n \n The Founders were not diests. Our country was founded by religious people, and the Consitution is intended for a good and moral people. Where do your morals come from? Religion, either directly in indirectly. They never intended for religion to be pushed out of out lives to please the minority.\n\n \n Yes that is why they kept slaves, did not allow women to vote or own property. The good old moral institution of slavery.", 
   {}, 
   292826, 
   null, 
   1199110380.0
  ], 
  [
   295780, 
   null, 
   "NiteGuy", 
   "Originally Posted by georged \n ...As most of the founding fathers were dietists with a few agnostics, \n I can't even imagine agreement among them to combine government \n with mythical belief systems.\n\n \n The Founders were not diests. Our country was founded by religious people, and the Consitution is intended for a good and moral people. Where do your morals come from? Religion, either directly in indirectly. They never intended for religion to be pushed out of out lives to please the minority.\n\n \n And what, exactly, is your definition or understanding of what a \"deist\" is?", 
   {}, 
   292826, 
   null, 
   1199233680.0
  ], 
  [
   296108, 
   null, 
   "The_Wizard", 
   "DEISTS, term commonly applied to those thinkers in the 17th and 18th cent. who held that the course of nature sufficiently demonstrates the existence of God. For them formal religion was superfluous, and they scorned as spurious claims of supernatural revelation. Their tenets stemmed from the rationalism of the period, and though the term is not now generally used, the tenor of their belief persists. The term freethinkers is almost synonymous. Voltaire and J. J. Rousseau were deists, as were Benjamin Franklin, Thomas Jefferson, and George Washington.\n See E. R. Pike, Slayers of Superstition (1931, repr. 1970); G. A. Koch, Religion of the American Enlightenment (1933, repr. 1968).\n \n The Columbia Electronic Encyclopedia Copyright © 2004, Columbia University Press.\n Licensed from Columbia University Press\n\n \n From what I know of our Founding Fathers, they were a bunch a grog drinking whore slapping womanizers. In his memiors, Franklin states he was smashed for 5 years in France in his early 20's and dipped his pen in many ink wells.\n \n Sounds like us today.", 
   {}, 
   295780, 
   null, 
   1199502300.0
  ], 
  [
   304096, 
   null, 
   "Tdkocher", 
   "\n No. No one has said that. The point is that the laws that you advocate because of your religion would be a violation of the 1st Amendment principle of separation of church and state.\n\n \n Can you please show me where the words \"Seperation of Church and State\" are in the constitution? No, you can't because they aren't. They were found in a letter written by Thomas Jefferson to the Danbury Baptist Association in 1802. It is a political idea that has come from that letter as the base but has been used by the left to justify their war on religion, Christians' in particular, and now Christians' have had enough and are fighting back. Good thing we have the ACLJ.", 
   {}, 
   292288, 
   null, 
   1204389960.0
  ], 
  [
   304097, 
   null, 
   "Tdkocher", 
   "Yes that is why they kept slaves, did not allow women to vote or own property. The good old moral institution of slavery.\n\n \n You are jugging them to our standards in their time. That is like critisizing all army persons' in the British army when they controlled India and treated them in a degrading and rasist manner. Then didn't know any better and were following orders. At that time the British expansion ideal was seen in the community as aprpriate. We now know otherwise but it wouldn't be fair to hold this knowledge over them and say they wern't moral. At that time so where and some were not moral but we cannot hold them to standards that have changed since then.", 
   {}, 
   295663, 
   null, 
   1204390320.0
  ], 
  [
   304104, 
   null, 
   "CUNxTime", 
   "Can you please show me where the words \"Seperation of Church and State\" are in the constitution? No, you can't because they aren't. They were found in a letter written by Thomas Jefferson to the Danbury Baptist Association in 1802. It is a political idea that has come from that letter as the base but has been used by the left to justify their war on religion, Christians' in particular, and now Christians' have had enough and are fighting back. Good thing we have the ACLJ.\n\n \n \n What the constitution says and what the intent of the founding fathers was that the GOVERNMENT is to remain secular. It should play no role is supporting or hindering the free excises of religious beliefs. The government was to be run according to the principals of LAW. The founding fathers wanted to make sure that the government never obstructed religion on one hand but more importantly, they wanted religion to play NO PART in the government (they were particularly speaking to the Catholic religion and the way the Vatican influenced the government of many Catholic countries). That is what the \"Separation of Church and State\" is, it wasn't spelled out under that specific title in the constitution, but it was spelled out.", 
   {}, 
   304096, 
   null, 
   1204394820.0
  ], 
  [
   354669, 
   null, 
   "Chuz Life", 
   "What the constitution says and what the intent of the founding fathers was that the GOVERNMENT is to remain secular. It should play no role is supporting or hindering the free excises of religious beliefs. The government was to be run according to the principals of LAW. The founding fathers wanted to make sure that the government never obstructed religion on one hand but more importantly, they wanted religion to play NO PART in the government (they were particularly speaking to the Catholic religion and the way the Vatican influenced the government of many Catholic countries). That is what the \"Separation of Church and State\" is, it wasn't spelled out under that specific title in the constitution, but it was spelled out.\n\n \n Amendment 1 - Freedom of Religion, Press, Expression. Ratified 12/15/1791. Note\n \n \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\"\n \n Question; \"Seeing as the Constitution itself (1st. Amendment) specifically says that religious people have a right to their views, to speak their views, to peaceably assemble with others who share those views,... and to petition the Government for a redress of their grievances,... Ummmm how do you conclude that the founders \"wanted religion to play NO PART in the government?\"\n \n Your absolute claim runs contradictory to the founders wording of the very amendment you are trying to support it with.", 
   {
    "post_info": {
     "post_title": "And so, the 1st amendment,..."
    }
   }, 
   304104, 
   null, 
   1243022280.0
  ], 
  [
   354671, 
   null, 
   "simone", 
   "Has anyone noticed nowadays how powerful Christian coalitions have become? Not only have they forced intelligent design to be taught in science classes, but now they impose their christian morality upon us all? What are your opinions on this?\n\n The monied ruling class has determined that religion is an effective tool in its ongoing class warfare against the lower-income classes.\n \n The ruling principle of human value is how much money you have, not your goodness and decency.", 
   {}, 
   153667, 
   null, 
   1243023360.0
  ], 
  [
   354723, 
   null, 
   "CUNxTime", 
   "Amendment 1 - Freedom of Religion, Press, Expression. Ratified 12/15/1791. Note\n \n \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\"\n \n Question; \"Seeing as the Constitution itself (1st. Amendment) specifically says that religious people have a right to their views, to speak their views, to peaceably assemble with others who share those views,... and to petition the Government for a redress of their grievances,... Ummmm how do you conclude that the founders \"wanted religion to play NO PART in the government?\"\n \n Your absolute claim runs contradictory to the founders wording of the very amendment you are trying to support it with.\n\n \n \n LOL...I'm a fairly strict constitutionalist but you're trying to make it look like the 1st amendment is ALL about religion. Only the first part is and it says (basically what I said), that the govt. shouldn't be in the business of supporting OR hindering religious exercise. It's pretty strait forward. Now, that said, I want to make it clear that I support religious (or non religious) people 'petitioning the govt.', assembling, any kind of free speech, all that. But I'll not have the pope or Billy Gramm setting govt. policy anymore than I want Michael Moore doing it.", 
   {}, 
   354669, 
   null, 
   1243047960.0
  ], 
  [
   354815, 
   null, 
   "Chuz Life", 
   "LOL...I'm a fairly strict constitutionalist but you're trying to make it look like the 1st amendment is ALL about religion. Only the first part is and it says (basically what I said), that the govt. shouldn't be in the business of supporting OR hindering religious exercise. It's pretty strait forward.\n\n \n The 1st Amendment says what it says;\n \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances. \"\n \n \n Now, that said, I want to make it clear that I support religious (or non religious) people 'petitioning the govt.', assembling, any kind of free speech, all that. But I'll not have the pope or Billy Gramm setting govt. policy anymore than I want Michael Moore doing it.\n\n \n \nWhat the constitution says and what the intent of the founding fathers was that the GOVERNMENT is to remain secular. It should play no role is supporting or hindering the free excises of religious beliefs. The government was to be run according to the principals of LAW. The founding fathers wanted to make sure that the government never obstructed religion on one hand but more importantly, they wanted religion to play NO PART in the government (they were particularly speaking to the Catholic religion and the way the Vatican influenced the government of many Catholic countries). That is what the \"Separation of Church and State\" is, it wasn't spelled out under that specific title in the constitution, but it was spelled out.\n\n \n Yeah,... thanks for clearing that up CUNx", 
   {
    "post_info": {
     "post_title": "Parts is parts,..."
    }
   }, 
   354723, 
   null, 
   1243144080.0
  ], 
  [
   354823, 
   null, 
   "CUNxTime", 
   "I don't see what's unclear about any of that...the govt. should leave churches alone and church doctrine shouldn't be adopted by govt. Shouldn't be hard to understand. The first amendment says 2 things about religion. That the govt. should be secular and that it should leave people to practice in peace...kinda what I said.", 
   {}, 
   354815, 
   null, 
   1243150740.0
  ], 
  [
   354855, 
   null, 
   "Chuz Life", 
   "I don't see what's unclear about any of that...the govt. should leave churches alone and church doctrine shouldn't be adopted by govt. Shouldn't be hard to understand. The first amendment says 2 things about religion. That the govt. should be secular and that it should leave people to practice in peace...kinda what I said.\n\n \n And,... it also says that those peacfully practicing people have a rightful role to play in petitioning that government for redress of their grievances.\n \n Correct?", 
   {
    "post_info": {
     "post_title": "And,..."
    }
   }, 
   354823, 
   null, 
   1243185720.0
  ], 
  [
   354857, 
   null, 
   "CUNxTime", 
   "And,... it also says that those peacfully practicing people have a rightful role to play in petitioning that government for redress of their grievances.\n \n Correct?\n\n \n Yes, of course, everyone does. There's quite a difference between a church lobbying for tax-exempt status and establishing a theocracy.", 
   {}, 
   354855, 
   null, 
   1243186020.0
  ], 
  [
   354859, 
   null, 
   "Chuz Life", 
   "Yes, of course, everyone does. There's quite a difference between a church lobbying for tax-exempt status and establishing a theocracy.\n\n \n When the Reverend Dr. Martin Luther King was down for the struggle for civil rights,... organizing protests, sitins and the like,... as he (a religious leader) petitioned our government for the righting of the wrongs of race discrimination OFTEN times from pulpit,.... was he \"establishing a theocracy?\" \n \n Were you to have been around during those days,... would you have opposed his use of the church and other religious organizations to affect the government in changing the way HE did?\n \n Cunx?", 
   {
    "post_info": {
     "post_title": "What about Reverend Dr. Martin Luther King,..."
    }
   }, 
   354857, 
   null, 
   1243186440.0
  ], 
  [
   354862, 
   null, 
   "CUNxTime", 
   "I think you know better.... I want citizens to have MORE input, not less. I want less govt. not more. MLK wasn't trying to curtail people's rights based on church doctrine...he was trying to EXPAND them. And as you know, I want more freedom, not less.", 
   {}, 
   354859, 
   null, 
   1243186740.0
  ], 
  [
   354863, 
   null, 
   "Chuz Life", 
   "I think you know better.... I want citizens to have MORE input, not less. I want less govt. not more. MLK wasn't trying to curtail people's rights based on church doctrine...he was trying to EXPAND them. And as you know, I want more freedom, not less.\n\n \n Religious people, civil rights, when life begins, elective abortion,.... neurons firing yet?", 
   {
    "post_info": {
     "post_title": "And when the Church opposes abortion,..."
    }
   }, 
   354862, 
   null, 
   1243186920.0
  ], 
  [
   354865, 
   null, 
   "CUNxTime", 
   "Religious people, civil rights, when life begins, elective abortion,.... neurons firing yet?\n\n \n Yes, I've seen your point all along. However, you are trying to substitute your religious values for those of the woman, her doctor, and medical science. Abortion is horrid, but so is forcing a woman to be a slave to her uterus.", 
   {}, 
   354863, 
   null, 
   1243187640.0
  ], 
  [
   354866, 
   null, 
   "Chuz Life", 
   "Yes, I've seen your point all along. However, you are trying to substitute your religious values for those of the woman, her doctor, and medical science. Abortion is horrid, but so is forcing a woman to be a slave to her uterus.\n\n \n Wrong, CUNx... I have no religious basis for my views on abortion. How many posts would you like for me to link you to where I have fought against the injection of religion into the issue? \n \n Question,.. if abortion is not a denial of a child's rights,.. what is so \"horrid\" about it? If it's only about the rights and freedoms of the woman (as you claim),.. why wouldn't an abortion be cause for celebration?\n \n Ahh I digress,... the race is about to start!\n \n emoticon_xagree", 
   {
    "post_info": {
     "post_title": "Completely to the contrary,..."
    }
   }, 
   354865, 
   null, 
   1243187820.0
  ], 
  [
   354907, 
   null, 
   "Collin", 
   "Wrong, CUNx... I have no religious basis for my views on abortion. How many posts would you like for me to link you to where I have fought against the injection of religion into the issue? \n \n Question,.. if abortion is not a denial of a child's rights,.. what is so \"horrid\" about it? If it's only about the rights and freedoms of the woman (as you claim),.. why wouldn't an abortion be cause for celebration?\n \n Ahh I digress,... the race is about to start!\n \n emoticon_xagree\n\n \n Just because a tree has no rights and you're free to cut it down without it ever feeling any pain doesn't mean it's a cause for celebration whenever someone cuts down a tree. Yeesh, talk about a strange dichotomy.", 
   {}, 
   354866, 
   null, 
   1243215840.0
  ], 
  [
   354919, 
   null, 
   "Chuz Life", 
   "Just because a tree has no rights and you're free to cut it down without it ever feeling any pain doesn't mean it's a cause for celebration whenever someone cuts down a tree. Yeesh, talk about a strange dichotomy.\n\n \n Yeah,... so,... Is it generally considered to be \"horrid\" when someone cuts down a tree?", 
   {
    "post_info": {
     "post_title": "Is it Horrid?"
    }
   }, 
   354907, 
   null, 
   1243230480.0
  ], 
  [
   354942, 
   null, 
   "simone", 
   "It's quite horrid when there aren't very many trees left, when the entire earth has been so rapaciously deforested.", 
   {}, 
   354919, 
   null, 
   1243270440.0
  ], 
  [
   354966, 
   null, 
   "Chuz Life", 
   "It's quite horrid when there aren't very many trees left, when the entire earth has been so rapaciously deforested.\n\n \n There are no such shortages of people on the planet. If anything, we have overpopulation in many regions,... so why then would it be considered \"horrid\" by someone like CUNx,.... for a woman to abort an assumed to be \"non-person\" hinderence to her life, health and well being?\n \n CUNx said it was \"horrid\" and I think we all know the true reason why.", 
   {
    "post_info": {
     "post_title": "You bolster my point,...."
    }
   }, 
   354942, 
   null, 
   1243279020.0
  ], 
  [
   354984, 
   null, 
   "CUNxTime", 
   "It's horrid because it ends possibilities and causes trauma the those who have them (and potentially their partner). Not many people 'celebrate' abortions. But a woman has a right to control her body.", 
   {}, 
   354966, 
   null, 
   1243305300.0
  ], 
  [
   354999, 
   null, 
   "Chuz Life", 
   "Yes (Chuz),... Abortion is horrid, but so is forcing a woman to be a slave to her uterus.\n\n \n \n Question (CUNx),.. if abortion is not a denial of a child's rights,.. what is so \"horrid\" about it? If it's only about the rights and freedoms of the woman (as you claim),.. why wouldn't an abortion be cause for celebration? \n\n \n \nIt's horrid because it ends possibilities and causes trauma the those who have them (and potentially their partner). Not many people 'celebrate' abortions. But a woman has a right to control her body.\n\n \n Oh,... I thought that you were going to say that abortions are horrid because of your sentiments that you expressed when you said; \n \n \n,... Intellectually, I think that abortion is terminating a human life. However, I think a woman should have that choice. I think that heroic efforts should be made to prevent pregnancy when it is unwanted but ultimately it is up to the person who'd have to have the child. On a selfish note, there are already too many people here and I'd love to see the birth rate decrease. But don't guild the Lilly, when you abort a baby, you abort a baby. We should at least be honest with ourselves about that.\n\n \n See,... now that's what I consider to be the reasons abortions are \"Horrid.\"", 
   {
    "post_info": {
     "post_title": "Horrid is as Horrid does,..."
    }
   }, 
   354865, 
   null, 
   1243314900.0
  ], 
  [
   355002, 
   null, 
   "CUNxTime", 
   "Yes, I think its all of that. But I still think a woman should have a choice.", 
   {}, 
   354999, 
   null, 
   1243316460.0
  ], 
  [
   355005, 
   null, 
   "Chuz Life", 
   "Yes, I think its all of that. But I still think a woman should have a choice.\n\n \n Yeah,... you've made that abundantly clear.\n \n Tell me something CUNx,.... \"do you believe a child's basic rights should begin when their life does?\"", 
   {
    "post_info": {
     "post_title": "What about people,..."
    }
   }, 
   355002, 
   null, 
   1243316640.0
  ], 
  [
   355006, 
   null, 
   "CUNxTime", 
   "Yeah,... you've made that abundantly clear.\n \n Tell me something CUNx,.... \"do you believe a child's basic rights should begin when their life does?\"\n\n \n If their mother wants to keep it, yes. If someone murders a preg. woman, I think they should be charged with double murder. However, a woman is more than her uterus and must have an option to control her body.", 
   {}, 
   355005, 
   null, 
   1243321740.0
  ], 
  [
   355018, 
   null, 
   "Chuz Life", 
   "If their mother wants to keep it, yes. If someone murders a preg. woman, I think they should be charged with double murder. However, a woman is more than her uterus and must have an option to control her body.\n\n \n Should a child's right to their life begin when their life does, CUNx? \n \n Or not?", 
   {
    "post_info": {
     "post_title": "That wasn't my question,..."
    }
   }, 
   355006, 
   null, 
   1243347540.0
  ], 
  [
   355025, 
   null, 
   "CUNxTime", 
   "Should a child's right to their life begin when their life does, CUNx? \n \n Or not?\n\n \n The mother has a right to have her baby (or not). I'm not as blind to say the baby isn't alive until birth (or 3rd trimester, or whatever). I feel though the mother has a RIGHT to chose how to use her body.", 
   {}, 
   355018, 
   null, 
   1243355520.0
  ], 
  [
   355059, 
   null, 
   "Chuz Life", 
   "The mother has a right to have her baby (or not). I'm not as blind to say the baby isn't alive until birth (or 3rd trimester, or whatever). I feel though the mother has a RIGHT to chose how to use her body.\n\n \n Again, you dodge the question and instead answer one that I didn't ask.\n \n So, I'll ask one more time with the follow up question of \"how do you think it makes you look when you have to avoid direct questions by giving evasive answers this way?\"\n \n CUNX, \"Do you believe a child's basic rights should begin when their life does?\" Yes or no.\n \n For reference; \n \nIf their mother wants to keep it, yes. If someone murders a preg. woman, I think they should be charged with double murder. However, a woman is more than her uterus and must have an option to control her body.\n\n \n I can't imagine how you can conceive (per your comments in that earlier post) that killing a pregnant woman can be prosecuted as \"TWO MURDERS;\" Yet, the \"murdered\" (your word) pre-birth child had no rights to be violated ?!?\n \n \n Do you care enough to explain how that works?", 
   {
    "post_info": {
     "post_title": "Again, CUNx...."
    }
   }, 
   355025, 
   null, 
   1243373700.0
  ], 
  [
   355192, 
   null, 
   "CUNxTime", 
   "Again, you dodge the question and instead answer one that I didn't ask.\n \n So, I'll ask one more time with the follow up question of \"how do you think it makes you look when you have to avoid direct questions by giving evasive answers this way?\"\n \n CUNX, \"Do you believe a child's basic rights should begin when their life does?\" Yes or no.\n \n For reference; \n \n \n I can't imagine how you can conceive (per your comments in that earlier post) that killing a pregnant woman can be prosecuted as \"TWO MURDERS;\" Yet, the \"murdered\" (your word) pre-birth child had no rights to be violated ?!?\n \n \n Do you care enough to explain how that works?\n\n \n \n I think I've been pretty clear... but I'll try again. The mother's right to control her body supersede any rights the baby has. The mother has the right to bring her baby to term or she has the right to terminate in the early stages of pregnancy.", 
   {}, 
   355059, 
   null, 
   1243439400.0
  ], 
  [
   355194, 
   null, 
   "Chuz Life", 
   "I think I've been pretty clear... but I'll try again. The mother's right to control her body supersede any rights the baby has. The mother has the right to bring her baby to term or she has the right to terminate in the early stages of pregnancy.\n\n \n \n CUNx, You said that it is a \"double murder\" when someone murders a pregnant woman.\n \n How can you \"murder\" a child that has no rights?\n \n You have not explained how this can be. \n \n Please be clear on the Constitutional basis for claiming that when a stranger kills the baby it's MURDER,... but when the mother kills the baby (for any reason she wants) it's not.\n \n Sorry, but I need something more than \"because I said so.\"", 
   {
    "post_info": {
     "post_title": "You said it's a double &quot;murder&quot; when,...."
    }
   }, 
   355192, 
   null, 
   1243440000.0
  ], 
  [
   355195, 
   null, 
   "CUNxTime", 
   "CUNx, You said that it is a \"double murder\" when someone murders a pregnant woman.\n \n How can you \"murder\" a child that has no rights?\n \n You have not explained how this can be. \n \n Please be clear on the Constitutional basis for claiming that when a stranger kills the baby it's MURDER,... but when the mother kills the baby (for any reason she wants) it's not.\n \n Sorry, but I need something more than \"because I said so.\"\n\n \n The baby does have rights...they are superseded by the mother's right not to be pregnant if she chooses. A third party doesn't have the right to terminate someone else's pregnancy forceably...hence double murder. And I'm pretty sure that's how the law works as well in many states, so while its my opinion (because I said so), there is also a basis for this legally.", 
   {}, 
   355194, 
   null, 
   1243440300.0
  ], 
  [
   355198, 
   null, 
   "Chuz Life", 
   "The baby does have rights...they are superseded by the mother's right not to be pregnant if she chooses. A third party doesn't have the right to terminate someone else's pregnancy forceably...hence double murder. And I'm pretty sure that's how the law works as well in many states, so while its my opinion (because I said so), there is also a basis for this legally.\n\n \n \"Pretty sure\" just isn't going to get it, CUNx. \n \n Some-one needs to explain how a woman can \"consent\" to have sex, risk pregnancy, create what you agree is a child WITH rights and then have the right themself to deny those rights to her child and to kill it for any reason she deems necessary; However, if and when someone else intentionally kills that same child? THEY are liable for \"murder.\"\n \n What's that make an abortionist?", 
   {
    "post_info": {
     "post_title": "Pretty sure doesn't get it,..."
    }
   }, 
   355195, 
   null, 
   1243440900.0
  ], 
  [
   355213, 
   null, 
   "sinjin", 
   "A demeaning term for a medical doctor?", 
   {}, 
   355198, 
   null, 
   1243446900.0
  ], 
  [
   355236, 
   null, 
   "Chuz Life", 
   "A demeaning term for a medical doctor?\n\n \n My bad,...\n \n I certainly wouldn't want to demean a guy/gal who kills babies for a living.", 
   {
    "post_info": {
     "post_title": "Well,..."
    }
   }, 
   355213, 
   null, 
   1243452180.0
  ], 
  [
   355248, 
   null, 
   "CUNxTime", 
   "[QUOTE]\n\"Pretty sure\" just isn't going to get it, CUNx. \n\n \n You were asking my opinion, which I gave you. But if you want to check my legal opinion...research it.\n \n \nSome-one needs to explain how a woman can \"consent\" to have sex, risk pregnancy, create what you agree is a child WITH rights and then have the right themself to deny those rights to her child and to kill it for any reason she deems necessary; However, if and when someone else intentionally kills that same child? THEY are liable for \"murder.\"\n\n \n Consent of the woman..kinda like the difference between having sex and rape.\n \n \nWhat's that make an abortionist?\n\n \n A doctor", 
   {}, 
   355198, 
   null, 
   1243456380.0
  ], 
  [
   355249, 
   null, 
   "CUNxTime", 
   "Top Cause of Death for Pregnant Women is Murder - Strollerderby\n \n \n Wow, its actually only double murder if after 6 months....I'm sure other states make it earlier than that (and I agree).", 
   {}, 
   355248, 
   null, 
   1243456560.0
  ], 
  [
   355251, 
   null, 
   "Chuz Life", 
   "url=http://www.babble.com/CS/blogs/strollerderby/archive/2009/05/14/top-cause-of-death-for-pregnant-women-is-murder.aspx]Top Cause of Death for Pregnant Women is Murder - Strollerderby[/url]\n \n \n Wow, its actually only double murder if after 6 months....I'm sure other states make it earlier than that (and I agree).\n\n \n \"According to Baltimore TV station WJZ, \"Murder is the leading cause of death for pregnant women.\"\n \n The story mentions a number of murders, and makes the following even more depressing statement: \"In each case, police say the killer was the unborn baby's father. Ending the pregnancy was the motive.\"\n \n How can this be? Isn't this one of the things that abortion on demand is supposed to be intended to reduce?\n \n Bah!\n \n I'm done with you CUNx, your duplicity has been exposed enough.", 
   {
    "post_info": {
     "post_title": "What?"
    }
   }, 
   355249, 
   null, 
   1243457100.0
  ], 
  [
   355258, 
   null, 
   "CUNxTime", 
   "\"According to Baltimore TV station WJZ, \"Murder is the leading cause of death for pregnant women.\"\n \n The story mentions a number of murders, and makes the following even more depressing statement: \"In each case, police say the killer was the unborn baby's father. Ending the pregnancy was the motive.\"\n \n How can this be? Isn't this one of the things that abortion on demand is supposed to be intended to reduce?\n \n Bah!\n \n I'm done with you CUNx, your duplicity has been exposed enough.\n\n \n \n You wanted to know about the LAW concerning the killing of pregnant women...that article stated the laws of several states. That was for your benifit...personally, what the different states say about it doesn't change my OPINION (what you were originally asking about). \n \n I don't know what is duplicitous about any of it.", 
   {}, 
   355251, 
   null, 
   1243458480.0
  ], 
  [
   355332, 
   null, 
   "sinjin", 
   "How can this be? Isn't this one of the things that abortion on demand is supposed to be intended to reduce?\n \nThe pregnant woman's demand, not the baby-daddy.", 
   {}, 
   355251, 
   null, 
   1243543020.0
  ], 
  [
   355333, 
   null, 
   "Lakrite", 
   "The pregnant woman's demand, not the baby-daddy.\n\n Why is it that the father has absolutely no say about whether or not his child lives or dies?", 
   {}, 
   355332, 
   null, 
   1243543140.0
  ], 
  [
   355344, 
   null, 
   "sinjin", 
   "My bad,...\n \n I certainly wouldn't want to demean a guy/gal who kills babies for a living.\nDoctor, not guy/gal. Say the words...... A doctor. \n \n Baby is synonymous with infant. Is fetus synonymous with infant? Strange, isn't it?", 
   {}, 
   355236, 
   null, 
   1243551060.0
  ], 
  [
   355356, 
   null, 
   "Chuz Life", 
   "Doctor, not guy/gal. Say the words...... A doctor. \n \n Baby is synonymous with infant. Is fetus synonymous with infant? Strange, isn't it?\n\n \n A doctor that kills babies for a living,... is still just a guy/ gal who kills babies for a living.\n \n Don't like seeing them called babies?\n \n Children then.\n \n I used the word \"babies\" because CUNx did. And I happen to agree with him that they are babies. However, I didn't introduce the word. \n \n He did.", 
   {
    "post_info": {
     "post_title": "Same face, fingers, toes, heart, eyes, skin,..."
    }
   }, 
   355344, 
   null, 
   1243563180.0
  ], 
  [
   355425, 
   null, 
   "CUNxTime", 
   "I personally don't get caught up in the semantics of baby/fetus. I think it is a baby, I think its sad to abort it, I think that right (up to a certain point in the pregnancy) remains with the woman who'd have to carry it to term.", 
   {}, 
   355356, 
   null, 
   1243644480.0
  ], 
  [
   355451, 
   null, 
   "Chuz Life", 
   "I personally don't get caught up in the semantics of baby/fetus. I think it is a baby, I think its sad to abort it, I think that right (up to a certain point in the pregnancy) remains with the woman who'd have to carry it to term.\n\n \n Yeah,... we know that's how you feel.\n \n :xbanghead", 
   {
    "post_info": {
     "post_title": "Yeah,... we know"
    }
   }, 
   355425, 
   null, 
   1243663740.0
  ], 
  [
   356051, 
   null, 
   "Ryuuichi", 
   "Why is it that the father has absolutely no say about whether or not his child lives or dies?\n\n \n Nope he only has to fork up child support if the women decides to let it live. \n \n Which to me is complete BS but that's men's rights for you.", 
   {}, 
   355333, 
   null, 
   1244002800.0
  ], 
  [
   356106, 
   null, 
   "simone", 
   "You dislike women very much, Ryuuichi. In fact, you seem to hate women. Why is that?", 
   {}, 
   356051, 
   null, 
   1244051700.0
  ], 
  [
   356573, 
   null, 
   "chester", 
   "You dislike women very much, Ryuuichi. In fact, you seem to hate women. Why is that?\n\n \n I wonder whether hatred or FEAR is the operative emotion.", 
   {}, 
   356106, 
   null, 
   1244302920.0
  ], 
  [
   356953, 
   null, 
   "Ryuuichi", 
   "I wonder whether hatred or FEAR is the operative emotion.\n\n \n *facepalms* \n \n Once again my views are skewered by pro-choicers. Its hard to tell whose worse you pro-choicers or those pro-lifers. You almost make me ashamed to say I am pro-choice. \n \n Wow I value men's rights so I'm against women O_o There's just...no words.", 
   {}, 
   356573, 
   null, 
   1244587320.0
  ], 
  [
   357180, 
   null, 
   "DrNo", 
   "You dislike women very much, Ryuuichi. In fact, you seem to hate women. Why is that?\n\n \n You seem to hate men, especially white men. Why is that?", 
   {}, 
   356106, 
   null, 
   1244748420.0
  ], 
  [
   358686, 
   null, 
   "Steamroller", 
   "Why is it that the father has absolutely no say about whether or not his child lives or dies?\n\n \n Because we let women vote.\n \n JUST KIDDING LADIES!!!", 
   {}, 
   355333, 
   null, 
   1245996000.0
  ], 
  [
   358733, 
   null, 
   "JPSartre12", 
   "You seem to hate men, especially white men. Why is that?\n\n \n She doesn't hate all men, just those that can think for themselves. ;)", 
   {}, 
   357180, 
   null, 
   1246043040.0
  ], 
  [
   381661, 
   null, 
   "OldSarge", 
   "She doesn't hate all men, just those that can think for themselves. ;)\n\n \n Well all conservative men.", 
   {}, 
   358733, 
   null, 
   1260149520.0
  ], 
  [
   383508, 
   null, 
   "BKS01", 
   "It,s my opinion that the seperation of church and state was intended to keep state out of church not to keep church out of state. I miss the days of morality we used to enjoy.", 
   {}, 
   381661, 
   null, 
   1261676400.0
  ], 
  [
   383511, 
   null, 
   "Chuz Life", 
   "It,s my opinion that the seperation of church and state was intended to keep state out of church not to keep church out of state. I miss the days of morality we used to enjoy.\n\n \n Your comments reminded me of this;\n \n Are the State's Constitutions.... Un-Constitutional?", 
   {
    "post_info": {
     "post_title": "If you are interested."
    }
   }, 
   383508, 
   null, 
   1261679280.0
  ], 
  [
   383823, 
   null, 
   "jim's trucking", 
   "It,s my opinion that the seperation of church and state was intended to keep state out of church not to keep church out of state. I miss the days of morality we used to enjoy.\n\n I agree. All the amendment says is that the government shall pass no law...", 
   {}, 
   383508, 
   null, 
   1261996740.0
  ], 
  [
   383901, 
   null, 
   "jitobear", 
   "It,s my opinion that the seperation of church and state was intended to keep state out of church not to keep church out of state. I miss the days of morality we used to enjoy.\n\n \n I fail to see how you can have one without the other. Morality is subjective and should not be the busines sof the state. The state should defend the state, people's rights and the law.", 
   {}, 
   383508, 
   null, 
   1262035020.0
  ], 
  [
   384420, 
   null, 
   "jazyjason", 
   "It,s my opinion that the seperation of church and state was intended to keep state out of church not to keep church out of state. I miss the days of morality we used to enjoy.\n\n \n Yes segregation, beating and killing of LGBT people and the lack of woman's rights and minority rights... I suppose to privileged white men in the 50's those days would be missed but for everyone else it's a different story....\n \n And Morality is subject to the believer... Government should not be influenced by anyone's faith period especially law... There is such a thing as separation of church and state.\n \n I myself am a person of faith, but I would never want my belief imposed on this entire country or it's elements because it defeats the true meaning of freedom and democracy.... There is a freedom of religion and a freedom FROM religion in this country...", 
   {}, 
   383508, 
   null, 
   1262489520.0
  ], 
  [
   384444, 
   null, 
   "Easyrider", 
   "Originally Posted by BKS01: It's my opinion that the seperation of church and state was intended to keep state out of church not to keep church out of state. I miss the days of morality we used to enjoy.\n \n \nYes segregation, beating and killing of LGBT people and the lack of woman's rights and minority rights... I suppose to privileged white men in the 50's those days would be missed but for everyone else it's a different story....\n \n\n \n <Sigh<\n \n I guess everyone is deranged except for the unrepentant, militant gay sex crowd, huh, Jazy? Sure. Give us a break.", 
   {}, 
   384420, 
   null, 
   1262535720.0
  ], 
  [
   384500, 
   null, 
   "jazyjason", 
   "Originally Posted by BKS01: It's my opinion that the seperation of church and state was intended to keep state out of church not to keep church out of state. I miss the days of morality we used to enjoy.\n \n \n \n <Sigh<\n \n I guess everyone is deranged except for the unrepentant, militant gay sex crowd, huh, Jazy? Sure. Give us a break.\n\n \n Oh please nutcracker.... GO find a few more squirrels in your stash to talk to... You know darn well what he is referring to which was in the 50's laws were passed to make public schools more secular....\n \n And at that time all those things were going on. You know I'm right on this because sadly you cannot change FACT and history except in your own deranged mind...", 
   {}, 
   384444, 
   null, 
   1262598720.0
  ], 
  [
   384848, 
   null, 
   "OldSarge", 
   "Oh please nutcracker.... GO find a few more squirrels in your stash to talk to... You know darn well what he is referring to which was in the 50's laws were passed to make public schools more secular....\n \n And at that time all those things were going on. You know I'm right on this because sadly you cannot change FACT and history except in your own deranged mind...\n\n \n Would that be tape the family jewels on the anvil and hit them with a sledgehammer?", 
   {}, 
   384500, 
   null, 
   1262821620.0
  ], 
  [
   384885, 
   null, 
   "jazyjason", 
   "Would that be tape the family jewels on the anvil and hit them with a sledgehammer?\n\n \n Umm what? emoticon_wow", 
   {}, 
   384848, 
   null, 
   1262839440.0
  ], 
  [
   384947, 
   null, 
   "OldSarge", 
   "Umm what? emoticon_wow\n\n \n The ultimate nutcracker!!!emoticon_xagree", 
   {}, 
   384885, 
   null, 
   1262891160.0
  ], 
  [
   388762, 
   null, 
   "jazyjason", 
   "The ultimate nutcracker!!!emoticon_xagree\n\n \n Oh I get it. Ouch man! That would be the most painful thing ever! emoticon_cry", 
   {}, 
   384947, 
   null, 
   1265224440.0
  ], 
  [
   393015, 
   null, 
   "Easyrider", 
   " Morality is subjective and should not be the busines sof the state. \n\n \n For most Americans morality is objective and comes from God. It's for all people in all places at all points in time. \n \n Liberal morality is subjective. It changes like people change their shorts. It's not enduring and seldom endearing.\n \n In the end, God rules. \n \n Liberals are an embarrassment and a scourge to humanity. They ought to be deported with a hefty, wallet clearing deportation tax placed on them.", 
   {}, 
   383901, 
   null, 
   1267500840.0
  ], 
  [
   393022, 
   null, 
   "jitobear", 
   "For most Americans morality is objective and comes from God. It's for all people in all places at all points in time. \n \n Liberal morality is subjective. It changes like people change their shorts. It's not enduring and seldom endearing.\n \n In the end, God rules. \n \n Liberals are an embarrassment and a scourge to humanity. They ought to be deported with a hefty, wallet clearing deportation tax placed on them.\n\n \n Point in case. It is outside of my morality to take punitive measures against those who disagree with me, but apparently for you it isn't. Personally I find the idea of everyone sharing my udeas/faith/culture/taste in music all rather dull. Welcome to the borg collective.... But, hey, you share the company of many despots Easy. They in heaven waiting for you?", 
   {}, 
   393015, 
   null, 
   1267512180.0
  ], 
  [
   393473, 
   null, 
   "Easyrider", 
   "Point in case. It is outside of my morality to take punitive measures against those who disagree with me, but apparently for you it isn't. Personally I find the idea of everyone sharing my udeas/faith/culture/taste in music all rather dull. Welcome to the borg collective.... But, hey, you share the company of many despots Easy. They in heaven waiting for you?\n\n \n If you ever get born again you'll discover a new morality - not the San Francisco bath house variety you're apparently accustomed to.\n \n As for the despots, they'll be waiting for you. (John 3:36)", 
   {}, 
   393022, 
   null, 
   1267838820.0
  ], 
  [
   394175, 
   null, 
   "jitobear", 
   "If you ever get born again you'll discover a new morality - not the San Francisco bath house variety you're apparently accustomed to.\n\n \n I am not gay. I am not male. I do not live in San Francisco. I don't lie, steal, engage in violence. Hell, I don't even XXXX. I work, pay my taxes, and love my son. I simply do not share your religion or engage in your coward's hobby of condeming everyone who does not share the values of the individual I see in the mirror. \n \n \nAs for the despots, they'll be waiting for you. (John 3:36)\n\n \n As long as you aren't.\n \n \"Go to heven for the climate. Go to hell for the company.\"\n ~ Mark Twain", 
   {}, 
   393473, 
   null, 
   1268325300.0
  ], 
  [
   394325, 
   null, 
   "Easyrider", 
   " I don't lie, steal, engage in violence. \n\n \n 1 John 2:22 - \"Who is the liar? It is the person who denies that Jesus is the Christ.\"", 
   {}, 
   394175, 
   null, 
   1268400360.0
  ], 
  [
   394329, 
   null, 
   "Penfold", 
   "1 John 2:22 - \"Who is the liar? It is the person who denies that Jesus is the Christ.\"\n\n \n The Devil quotes scripture for his own ends. Get thee behind us!", 
   {}, 
   394325, 
   null, 
   1268406120.0
  ], 
  [
   403558, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider  \n 1 John 2:22 - \"Who is the liar? It is the person who denies that Jesus is the Christ.\"\n\n \n \nThe Devil quotes scripture for his own ends. Get thee behind us!\n\n \n He didn't quote or twist that one.", 
   {}, 
   394329, 
   null, 
   1275344100.0
  ], 
  [
   403612, 
   null, 
   "simone", 
   "For most Americans morality is objective and comes from God. It's for all people in all places at all points in time. \n \n Liberal morality is subjective. It changes like people change their shorts. It's not enduring and seldom endearing.\n \n In the end, God rules. \n \n Liberals are an embarrassment and a scourge to humanity. They ought to be deported with a hefty, wallet clearing deportation tax placed on them.\n\n Are you sure that God is objective?\n \n The chap seems rather unbalanced and testy most of the time.\n \n As though he were plagued by raging hormones or something on that order.", 
   {}, 
   393015, 
   null, 
   1275412860.0
  ], 
  [
   404429, 
   null, 
   "Easyrider", 
   "Are you sure that God is objective?\n \n The chap seems rather unbalanced and testy most of the time.\n \n As though he were plagued by raging hormones or something on that order.\n\n \n Simone, you don't have a clue on that. But here's something just for you:\n \n Dear American liberals, leftists, social progressives, socialists, race-baiters, Christ-deniers, gay flesh abusers, Marxists and Obama supporters, et al:\n \n Conservative Americans don't want to be associated with you dimwits anymore.\n \n Here is a model separation agreement:\n \n Our two groups can equitably divide up the country by landmass each taking a portion. You can have the areas you're currently bankrupting and we'll take the rest.\n \n We don't like redistributive tax schemes so you can keep those. You are welcome to the liberal judges, CNN, MSNBC, the New York Times (etc.) and the ACLU. Since you hate guns and war, we'll take our firearms, the cops, the NRA and the military. You can keep Oprah, Michael Moore, and Rosie O' Donnell (You are, however, responsible for finding a bio-diesel vehicle big enough to haul their radical, cellulite-infested carcasses away).\n \n We'll keep capitalism, greedy corporations, people who work for a living, pharmaceutical companies, Wal-Mart and Wall Street. You can have your cherished homeless, homeboys, addicts, hippies, perverts, Ward Churchill, and your beloved illegal aliens. We'll keep the hot Alaskan hockey moms, the NFL, greedy CEO's and rednecks. We'll also keep our Bibles and give you Hugo Chavez and Hollywood .\n \n You can make nice with Iran and Palestine and we'll retain the right to invade and hammer places like that when they threaten us. You can have the peaceniks, the yellow-bellied draft dodgers, and the uncouth, unwashed war protesters. When our allies or our way of life are under assault, we'll help provide them security.\n \n We'll keep our Judeo-Christian values. You are welcome to Islam, Scientology, Pig Latin, Saul Alinsky's Rules for Radicals, Humanism, Al Gore, the nose pickers, the Kool Aid drinkers, and Shirley McClain. You can also have the U.N.. but we will no longer be paying the bill.\n \n We'll keep the SUVs, pickup trucks, Indy cars, Hot Rods and oversized luxury cars. You can have the Cash for Clunkers wrecks, all with Obama stickers. \n \n You can give everyone healthcare if you can find enough practicing doctors and nurses who will do it, and that's supposing you also will have some money to pay for it (knowing your government will be bankrupt in no time with all your drunken-sailor spending programs). We'll continue to earn our own healthcare. We'll keep The Battle Hymn of the Republic and the National Anthem. I'm sure you'll be happy to substitute Imagine, I'd Like to Teach the World to Sing, Kum Ba Ya, the Soviet National Anthem, or We Are the World.\n \n We'll practice trickle down economics and you can give your trickle up poverty your best shot. Since it often so offends you, we'll also keep our history, our name and our flag. More later.\n \n P.S. Oh yeah, please take Barbara Streisand, Harry Reid, Nanci Pelosi, Jessee Jackson, Al Sharpton, Barbara Boxer, Jane Fonda, Obama, and all the other radical, left wing loons with you. And don't come back.\n \n emoticon_xbouncer", 
   {
    "unicode_changes_made": true
   }, 
   403612, 
   null, 
   1276299000.0
  ], 
  [
   404920, 
   null, 
   "jazyjason", 
   "Simone, you don't have a clue on that. But here's something just for you:\n \n Dear American liberals, leftists, social progressives, socialists, race-baiters, Christ-deniers, gay flesh abusers, Marxists and Obama supporters, et al:\n \n Conservative Americans don't want to be associated with you dimwits anymore.\n \n Here is a model separation agreement:\n \n Our two groups can equitably divide up the country by landmass each taking a portion. You can have the areas you're currently bankrupting and we'll take the rest.\n \n We don't like redistributive tax schemes so you can keep those. You are welcome to the liberal judges, CNN, MSNBC, the New York Times (etc.) and the ACLU. Since you hate guns and war, we'll take our firearms, the cops, the NRA and the military. You can keep Oprah, Michael Moore, and Rosie O' Donnell (You are, however, responsible for finding a bio-diesel vehicle big enough to haul their radical, cellulite-infested carcasses away).\n \n We'll keep capitalism, greedy corporations, people who work for a living, pharmaceutical companies, Wal-Mart and Wall Street. You can have your cherished homeless, homeboys, addicts, hippies, perverts, Ward Churchill, and your beloved illegal aliens. We'll keep the hot Alaskan hockey moms, the NFL, greedy CEO's and rednecks. We'll also keep our Bibles and give you Hugo Chavez and Hollywood .\n \n You can make nice with Iran and Palestine and we'll retain the right to invade and hammer places like that when they threaten us. You can have the peaceniks, the yellow-bellied draft dodgers, and the uncouth, unwashed war protesters. When our allies or our way of life are under assault, we'll help provide them security.\n \n We'll keep our Judeo-Christian values. You are welcome to Islam, Scientology, Pig Latin, Saul Alinsky's Rules for Radicals, Humanism, Al Gore, the nose pickers, the Kool Aid drinkers, and Shirley McClain. You can also have the U.N.. but we will no longer be paying the bill.\n \n We'll keep the SUVs, pickup trucks, Indy cars, Hot Rods and oversized luxury cars. You can have the Cash for Clunkers wrecks, all with Obama stickers. \n \n You can give everyone healthcare if you can find enough practicing doctors and nurses who will do it, and that's supposing you also will have some money to pay for it (knowing your government will be bankrupt in no time with all your drunken-sailor spending programs). We'll continue to earn our own healthcare. We'll keep The Battle Hymn of the Republic and the National Anthem. I'm sure you'll be happy to substitute Imagine, I'd Like to Teach the World to Sing, Kum Ba Ya, the Soviet National Anthem, or We Are the World.\n \n We'll practice trickle down economics and you can give your trickle up poverty your best shot. Since it often so offends you, we'll also keep our history, our name and our flag. More later.\n \n P.S. Oh yeah, please take Barbara Streisand, Harry Reid, Nanci Pelosi, Jessee Jackson, Al Sharpton, Barbara Boxer, Jane Fonda, Obama, and all the other radical, left wing loons with you. And don't come back.\n \n emoticon_xbouncer\n\n \n Isn't this like your sick twisted version of heaven on earth or something? Is this what you actually believe it will be like when Jesus comes back?", 
   {
    "unicode_changes_made": true
   }, 
   404429, 
   null, 
   1276932240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Dag nabbit, does seperation of church and state mean anything anymore?", 
  "url": "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 6149, 
  "discussion_files": [
   [
    "1146.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-print.html"
   ], 
   [
    "1147.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-15-print.html"
   ], 
   [
    "1148.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-13-print.html"
   ], 
   [
    "1149.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-12-print.html"
   ], 
   [
    "1150.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-10-print.html"
   ], 
   [
    "1151.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-8-print.html"
   ], 
   [
    "1152.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-6-print.html"
   ], 
   [
    "1153.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-4-print.html"
   ], 
   [
    "1154.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-7-print.html"
   ], 
   [
    "1155.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-9-print.html"
   ], 
   [
    "1156.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-5-print.html"
   ], 
   [
    "1157.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-14-print.html"
   ], 
   [
    "1158.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-11-print.html"
   ], 
   [
    "1159.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-3-print.html"
   ], 
   [
    "1160.html", 
    "http://www.4forums.com/political/government-debates/6149-dag-nabbit-does-seperation-church-state-mean-anything-anymore-2-print.html"
   ]
  ], 
  "identifier": 6149
 }
]