[
 [
  [
   155227, 
   null, 
   "thebootfitter", 
   "In another thread, toby made an assertion with which I disagree. I responded to toby's comments on that thread, but toby has indicated that s/he is unwilling to continue our discussion there \"because you [meaning 'thebootfitter'] seem to be hypocritical.\" So, I am attempting to move the discussion here in the hopes that toby views me as less hypocritical and more interested in a healthy debate. We'll see if it works...\n \n Here is the particular exchange to which I was responding:\n \n \n \nThe idea that God exists is not supported by science or reasoning; it is supported only by faith.\n\n The same thing could be said for the idea that god does not exist.\n\n \n And here is how I responded:\n \nNope. The idea that God does not exist is the logical default position given the lack of any positive evidence.\n\n \n \nYou appear to be asserting above that it takes faith to believe in the non-existence of X. (If I misinterpret your position, feel free to clarify.) My position is that if there is no evidence of X, then it is reasonable to conclude that there is no logical reason to believe in the existence of X. This takes no faith. (Consider definition #2 at Dictionary.com: \"2. Belief that does not rest on logical proof or material evidence.\") Rather, it takes reason and logic.\n \n Now, if one were to claim that \"It is 100% certain that X does not exist!\" then we would ask them to produce evidence to back up that statement. I think this is probably where you are coming from. As far as I can see, no one on this thread has suggested that it is 100% certain that X does not exist. As far as I can see, others are saying essentially the same thing that I'm saying: \"There is no logical reason to conclude that X exists if there is no evidence that X exists.\" It is still possible that X exists. But not logical. Nor reasonable. In the realm of the imagination, anything is possible. But in the realm of the physical universe, there appears to be some limitations as to what is possible.\n\n \n Now, can toby (or anyone else, for that matter) support this position: \"The idea that God does not exist is not supported by science or reasoning; it is supported only by faith.\"\n \n If so, please do so here. \n \n Note: Yes, I realize that this has been discussed time and time again both on these forums and elsewhere. But obviously, there is still disagreement.", 
   {
    "post_info": {
     "post_title": "Faith &amp; Non-existence of God (For toby)"
    }
   }, 
   null, 
   null, 
   1124173380.0
  ], 
  [
   155236, 
   null, 
   "maximus", 
   "In another thread, toby made an assertion with which I disagree. I responded to toby's comments on that thread, but toby has indicated that s/he is unwilling to continue our discussion there \"because you [meaning 'thebootfitter'] seem to be hypocritical.\" So, I am attempting to move the discussion here in the hopes that toby views me as less hypocritical and more interested in a healthy debate. We'll see if it works...\n \n Here is the particular exchange to which I was responding:\n \n And here is how I responded:\n \n Now, can toby (or anyone else, for that matter) support this position: \"The idea that God does not exist is not supported by science or reasoning; it is supported only by faith.\"\n \n If so, please do so here. \n \n Note: Yes, I realize that this has been discussed time and time again both on these forums and elsewhere. But obviously, there is still disagreement.\n\n Bootfitter,\n What do you consider positive evidence? If I'm told by someone I trust that my Aunt Gwyneth lives in Baltimore but I have never met her then I would probably still believe in her. Evidence? As Chesterton wrote, \"But absence  does not mean non-existence; and a man drinking the toast of absent friends does not mean that from his life all friendship is absent. It is a void  but not a negation; it is something as positive as an empty chair...Gazing at some detail like a bird or a cloud, we can all ignore its awful blue background; we can neglect the sky; and precisely because it bears down on us with an annihiliating force it is felt as nothing...there is a presence of the absence of God.\"\n \n I would contest that there is positive evidence of God. This evidence is, however, controversial and contested--as is much evidence/theory/hypotheses in science. The most stark evidence might be staring you in the face though...in the mirror, that is. After all, we were created in His image. :)\n \n God sent his son to earth to tell us of his existence--evidence. Many say, \"Why would God not squash this controversy? If there is a God why does he let us rage on in controversy and wondering? Why does he not make it crystal clear?\" He will make it crystal clear again at some point. He did make it crystal clear already at a previous point in history. As John Paul II says in Crossing the Threshold of Hope, \"It is not that God has given us too little evidence...it is that he gave us too much. He gave us his son and it was too much for the world to handle--so they crucified him.\" (paraphrased) Chesterton would put it like this, \"Christianity is too good to be true, except that it is.\" \n \n If science cannot prove God's existence then I am not sure that it can disprove it either. Therefore \"the idea that God does not exist is not supported by science.\" It could offer clues either way, I suppose. Now, I know I have run off into the poetical a bit with this response--away from the logical ever so slightly-- but even that capacity is evidential for me. Peace. I hope all is well.", 
   {}, 
   155227, 
   null, 
   1124176800.0
  ], 
  [
   155247, 
   null, 
   "johnhanks", 
   "With thebootfitter's indulgence:\n \n \nWhat do you consider positive evidence? If I'm told by someone I trust that my Aunt Gwyneth lives in Baltimore but I have never met her then I would probably still believe in her. Evidence?\n\n \n Hearsay evidence, certainly. On the other hand, I have good reasons within my own experience to believe that such things as Aunt Gwyneths and Baltimore do exist, and if there were equally good reasons to believe that the person telling me has indeed been to Baltimore and met Aunt Gwyneth it would be distrustful verging on paranoid to suspect that she did not.\n \n However, if I'm told by someone I trust that god exists, I still have no good reasons within my own experience to believe that such things as supernatural beings exist, nor that my friend has actually met one.\n \n As evidence for X, 'other people believe X to be true' is very weak if unsupported.\n \n \nGod sent his son to earth to tell us of his existence--evidence.\n\n \n More accurately, 'we have ancient documents claiming that God sent his son to earth to tell us of his existence'. If this is evidence, then so are the equally extravagant claims of other religions' scriptures. Will you give them the same weight?\n \n \nIf science cannot prove God's existence then I am not sure that it can disprove it either.\n\n \n Of course not, nor should it seek to. But I suspect we will disagree about where, in the absence of evidence either way, presumption should lie. Conventionally, in the absence of evidence that X exists, we presume that X does not exist. This works very well for Santa, the tooth fairy, pixies and so on. Why do so many Christians insist that it does not apply to god?\n \n Cordially,\n \n JH", 
   {}, 
   155236, 
   null, 
   1124187300.0
  ], 
  [
   155261, 
   null, 
   "toby", 
   " \n Nope. The idea that God does not exist is the logical default position given the lack of any positive evidence.\n \n\n What do you mean: default? Do you mean that a statement asserting the existence of something for which there is no evidence is False?", 
   {}, 
   155247, 
   null, 
   1124201400.0
  ], 
  [
   155263, 
   null, 
   "trebor", 
   "What do you mean: default? Do you mean that a statement asserting the existence of something for which there is no evidence is False?\n\n \n If there is not evidence for the existance of something, the default positions for that is that something does not exist. For example, we do not have hard evidence that there was ever life on Mars. The default position is that Mars did not have life. We have some indications that conditions were there that might have promoted life, but no evidence that life actually was on mars. \n \n So, the default position is that life did not exist on mars.. until we find better evidence that it did. That does not mean that the position can not change with \n the introduction of evidence.", 
   {}, 
   155261, 
   null, 
   1124203140.0
  ], 
  [
   155268, 
   null, 
   "Kronus", 
   "\n Nope. The idea that God does not exist is the logical default position given the lack of any positive evidence.\n\n \n\n Now, can toby (or anyone else, for that matter) support this position: \"The idea that God does not exist is not supported by science or reasoning; it is supported only by faith.\"\n \n If so, please do so here. \n \n\n \n I'm afraid your position doesn't hold water. Given a lack of evidence, the only position one can logically hold is to claim \"I don't know.\" If one states a definitive belief, either for or against the existence of something, without having evidence to back up that claim, then the claim is based on faith. In logic there is no \"default position\" for the veracity of a claim, it's not false until proven true. Everything starts as unknown, and you proceed from there.", 
   {}, 
   155227, 
   null, 
   1124204400.0
  ], 
  [
   155299, 
   null, 
   "johnhanks", 
   "I'm afraid your position doesn't hold water. Given a lack of evidence, the only position one can logically hold is to claim \"I don't know.\"\n\n \n I suppose technically you're correct: we don't know whether or not pink unicorns rule the Andromeda galaxy, as we have no evidence either way. But in the absence of evidence that they do, the presumption is that they don't. It's an application of Occam's Razor.\n \n OK, you're going to tell me that logically I ought to be open-minded about the possibility of Andromedan pink unicorns; I contend that any such profession of open-mindedness on the issue would be a pose. I also contend that there is a difference between these two statements:\n \n 'I assert as a fact that there are no pink unicorns in the Andromeda galaxy'\n \n and\n \n 'In the absence of evidence to the contrary, I will decline to believe that there are pink unicorns in the Andromeda galaxy.'", 
   {}, 
   155268, 
   null, 
   1124213400.0
  ], 
  [
   155302, 
   null, 
   "thebootfitter", 
   "Given a lack of evidence, the only position one can logically hold is to claim \"I don't know.\" \n\n I agree.\n \n \nIf one states a definitive belief, either for or against the existence of something, without having evidence to back up that claim, then the claim is based on faith.\n\n I agree.\n \n \nIn logic there is no \"default position\" for the veracity of a claim, it's not false until proven true. Everything starts as unknown, and you proceed from there. \n\n I agree.\n \n Perhaps I should have said the default position by 'reason' instead of by 'logic.' As pure logic goes, your statements above are valid. However, if we are to use reason to determine the more likely conclusion, lack of evidence points to non-existence. Note that I am not saying it proves non-existence. Rather, it is the most reasonable position until evidence is found.", 
   {}, 
   155268, 
   null, 
   1124213940.0
  ], 
  [
   155305, 
   null, 
   "thebootfitter", 
   "What do you mean: default? Do you mean that a statement asserting the existence of something for which there is no evidence is False?\n\n No, of course not. I explained this quite clearly in my OP. I'm saying that a statement asserting the existence of something for which there is no evidence is not a reasonable assertion. It may be true. That something may exist and we just do not yet have evidence for it's existence. But lacking any evidence, there is no logical reason to assert the existence of something.\n \n I clarify the meaning of default somewhat in post #8. If you would like me to further clarify, I will be happy to do so.\n \n Does my position make sense yet?", 
   {}, 
   155261, 
   null, 
   1124214180.0
  ], 
  [
   155336, 
   null, 
   "toby", 
   "No, of course not. I explained this quite clearly in my OP. I'm saying that a statement asserting the existence of something for which there is no evidence is not a reasonable assertion. It may be true. That something may exist and we just do not yet have evidence for it's existence. But lacking any evidence, there is no logical reason to assert the existence of something. \n\n Is there anybody claiming that something exists? Certainly not me. I already posted in the other thread that if I had to guess, then I would guess that our notional god does not exist. The seemingly simplest solution is that our notional god does not exist (Occam's Razor). \n \nDoes my position make sense yet? \n\n No, it doesn't. I'm afraid that you are generalizing into dangerous waters. Let's say you were presented with the following equation: A^2+B^3=C^5, where A, B, C are counting numbers. Does the equation have any solutions? If you try A=B=C=1 and it fails, then at that moment there is no evidence that there are any solutions. Therefore should you give (at least) even money odds that no solution exists (since that's the default position)? Suppose you checked all the A, B, C's less than 1000 or 2000 or 3000 and you still found no evidence. Would you then take the position that it has no solutions (would you wager, and what odds would you give)?", 
   {
    "unicode_changes_made": true
   }, 
   155305, 
   null, 
   1124218860.0
  ], 
  [
   155354, 
   null, 
   "Kronus", 
   "\n Perhaps I should have said the default position by 'reason' instead of by 'logic.' As pure logic goes, your statements above are valid. However, if we are to use reason to determine the more likely conclusion, lack of evidence points to non-existence. Note that I am not saying it proves non-existence. Rather, it is the most reasonable position until evidence is found.\n\n \n I would say that you could only say that in certain cases. If something ought to leave evidence, like bigfoot for example, then lack of evidence could reasonably lead you to believe that it doesn't exist. If we have no access to evidence, like the Pink Unicorns, or have no reason to expect evidence to have been left, like with Mr. Works-In-Mysterious-Ways God, then again I think the only reasonable postion one can hold is to say \"I don't know\", and if one does take a definite stand, then it's based on faith.\n \n Of course this assumes that God doesn't want to leave evidence of his existence. Naturally that is an entirely debatable point.", 
   {}, 
   155302, 
   null, 
   1124222400.0
  ], 
  [
   155357, 
   null, 
   "thebootfitter", 
   "Is there anybody claiming that something exists? Certainly not me. I already posted in the other thread that if I had to guess, then I would guess that our notional god does not exist. The seemingly simplest solution is that our notional god does not exist (Occam's Razor). \n\n Okay. It appears that we agree here. And, as you point out, this is not the real issue we are discussing anyway.\n \n We are discussing the following position, which appears to be your position: \"The idea that God does not exist is not supported by science or reasoning; it is supported only by faith.\"\n \n I disagree. Why? Because given lack of any evidence whatsoever, it is reasonable to conclude that X does not exist. That doesn't mean we cannot continue to search for evidence of X, but it is still reasonable to conclude that X does not exist given the current lack of evidence. It would, of course, be different if there were reasonable inferences based on existing evidence that X may exist. But this introduces evidence to the equation. With evidence to the contrary, it would take faith to assert that X does not exist. Without that evidence, it takes no faith to come to the reasonable conclusion that based upon our current knowledge, X does not exist.\n \n Make sense now? (Or is it just becoming more muddled?) :p \n \n \n \nNo, it doesn't. I'm afraid that you are generalizing into dangerous waters. Let's say you were presented with the following equation: A^2+B^3=C^5, where A, B, C are counting numbers. Does the equation have any solutions? If you try A=B=C=1 and it fails, then at that moment there is no evidence that there are any solutions. Therefore should you give (at least) even money odds that no solution exists (since that's the default position)? Suppose you checked all the A, B, C's less than 1000 or 2000 or 3000 and you still found no evidence. Would you then take the position that it has no solutions (would you wager, and what odds would you give)? \n\n Perhaps I am missing your point, but this appears to be a poor analogy to the issue of physical evidence for the existance of something. An equation is conceptual. We already have all the parameters of the equation. There is nothing within this example that is outside of the realm of what is already known. If you attempt to solve the problem with trial-and-error as you describe above, then after you have tried and failed with A=B=C=1, it is still reasonable to conclude that there may be a solution that fits within the parameters of the problem, because there are other known entities that have not yet been tested. (i.e. numbers from 2 to infinity)\n \n If the number '1' were the only known whole number, and there was no evidence to suggest that any number other than '1' existed, then it would be reasonable to conclude that the equation does not have a solution that fits the parameters of the problem. \n \n In the realm of the physical universe, evidence is not neatly defined into whole numbers with known definitions as in an equation. Therefore, we generally use existing knowledge and existing evidence to develop new hypotheses -- not an infinite number of unknown variables from left field for which there is no evidence to suggest even the possibility that something might be worth exploring. \n \n \n Note: Thus far in this discussion, we haven't even considered this issue of defining 'evidence' for 'supernatural' entities. And that's okay. That could be another thread on it's own. I don't feel a need to start one, though, as it's been discussed many times already.", 
   {
    "unicode_changes_made": true
   }, 
   155336, 
   null, 
   1124225160.0
  ], 
  [
   155359, 
   null, 
   "toby", 
   "Following up on what Kronus said, the probability that something exists for which there is no evidence is a function of how likely that thing is to leave evidence. Furthermore, it is a function of the a priori probability that that thing exists prior to any evidence having been collected.\n \n Bayes Rules says:\n P[X|N]= P[N|X] P[X]/( P[N|X] P[X]+ P[N|~X] P[~X]),\n Where X= Exists, \n ~X= Does not exist\n N=No Evidence\n Example 1: Suppose you look around your room and see no piano, what is the probability that there is no piano?\n P[N|X]=the prob'y that there would be no evidence of an existing piano =.000005 \n P[X]= the a priori probability that a piano is in your room= .05\n P[N|~X]= the prob'y that there would be no evidence of a non-existing piano=.999999\n P[~X] the a priori probability that a piano is not in your room= .95\n \n P[X|N]= P[N|X] P[X]/( P[N|X] P[X]+ P[N|~X] P[~X])= \n .000005 \u0095.05/(.000005\u0095.05+.999999\u0095.05) = .000000263158\n \n Example 2: Suppose you look around your room and see no mold spores, what is the probability that there are no mold spores?\n P[N|X]=the prob'y that there would be no evidence of existing mold spores =.9999 \n P[X]= the a priori probability that mold spores are in your room= .999\n P[N|~X]= the prob'y that there would be no evidence of non-existing mold spores=.999999\n P[~X] the a priori probability that mold spores are not in your room= .001\n \n P[X|N]= P[N|X] P[X]/( P[N|X] P[X]+ P[N|~X] P[~X])= \n .9999 \u0095.999/(.9999\u0095.999+.999999\u0095.001) = .9989999\n \n Note that the probability that mold spores exist changes very little from the a priori probability that they exist, since your failure to observe them means essentially nothing.", 
   {
    "unicode_changes_made": true
   }, 
   155357, 
   null, 
   1124225400.0
  ], 
  [
   155362, 
   null, 
   "thebootfitter", 
   "I would say that you could only say that in certain cases. If something ought to leave evidence, like bigfoot for example, then lack of evidence could reasonably lead you to believe that it doesn't exist. If we have no access to evidence, like the Pink Unicorns, or have no reason to expect evidence to have been left, like with Mr. Works-In-Mysterious-Ways God, then again I think the only reasonable postion one can hold is to say \"I don't know\", and if one does take a definite stand, then it's based on faith.\n \n Of course this assumes that God doesn't want to leave evidence of his existence. Naturally that is an entirely debatable point.\n\n Kronus, I see your point. \n \n And it really ties into the note at the bottom of my most recent post. It is conceivable that a supernatural world exists for which we have no evidence. And given that anything supernatural -- by definition -- cannot produce physical evidence, we have no way to make a logical conclusion within the confines of the physical universe as to the existence of a supernatural realm. But anything that is within the physical realm must -- at some point in time -- produce physical evidence of it's existence. Therefore, back to the topic at hand, if a 'god' ever manifested itself in the physical universe, 'god' would have produced physical evidence of this manifestation.\n \n Physical evidence (or lack thereof) can be used to make reasonable conclusions. But if we remove the possibility of any physical evidence ('god' being purely supernatural and never manifesting itself in the physical world), then the issue becomes entirely conceptual. Without even the possibility of physical evidence, then science and reason cannot be used to support the existance or non-existance of anything.", 
   {}, 
   155354, 
   null, 
   1124226180.0
  ], 
  [
   155364, 
   null, 
   "toby", 
   " \n We are discussing the following position, which appears to be your position: \"The idea that God does not exist is not supported by science or reasoning; it is supported only by faith.\"\n \n I disagree. Why? Because given lack of any evidence whatsoever, it is reasonable to conclude that X does not exist. \n\n Please quantify this. What does reasonable mean? Known with confidence .999? \n Taking Bayes from before and applying it here:\n Example 3: Suppose you look around your world and see no god, what is the probability that there is no god? All things being equal:\n P[N|X]=the prob'y that there would be no evidence of an existing god =.5 \n P[X]= the a priori probability that there is a god = .5\n P[N|~X]= the prob'y that there would be no evidence of a non-existing god=.999999\n P[~X] the a priori probability that there is no god= .5\n P[X|N]= P[N|X] P[X]/( P[N|X] P[X]+ P[N|~X] P[~X])= \n .5 \u0095.5/(.5\u0095.5+.999999\u0095.5) = .333333556\n Based on that, I can't reasonably conclude that there is no god. In order to conclude that there is no god, I want to see .001 (not .333).\n \n \n That doesn't mean we cannot continue to search for evidence of X, but it is still reasonable to conclude that X does not exist given the current lack of evidence. It would, of course, be different if there were reasonable inferences based on existing evidence that X may exist. But this introduces evidence to the equation. With evidence to the contrary, it would take faith to assert that X does not exist. Without that evidence, it takes no faith to come to the reasonable conclusion that based upon our current knowledge, X does not exist. \n\n Yes, it takes faith. It just takes less than to believe in god. \n \n \n Make sense now? (Or is it just becoming more muddled?) \n\n \n \n Perhaps I am missing your point, but this appears to be a poor analogy to the issue of physical evidence for the existance of something. An equation is conceptual. We already have all the parameters of the equation. There is nothing within this example that is outside of the realm of what is already known. \n\n Your objection appears to be fallacious. You have not shown why your heuristic should not be applied. \n \n \n If you attempt to solve the problem with trial-and-error as you describe above, then after you have tried and failed with A=B=C=1, it is still reasonable to conclude that there may be a solution that fits within the parameters of the problem, because there are other known entities that have not yet been tested. (i.e. numbers from 2 to infinity) \n\n Maybe god can be found by sticking yourself in the eye with a pencil. Maybe it takes 1 poke, or maybe it takes 2 pokes, or maybe it takes 3 pokes. Everything you can say, I can throw right back at you.\n \n \n If the number '1' were the only known whole number, and there was no evidence to suggest that any number other than '1' existed, then it would be reasonable to conclude that the equation does not have a solution that fits the parameters of the problem. \n\n Again, maybe god can be found by sticking yourself in the eye with a pencil. Maybe it takes 1 poke, or maybe it takes 2 pokes, or maybe it takes 3 pokes. There are an uncountably infinite number of thing to try. Do you want more things to try after you're through with sticking yourself in the eye a countably infinite number of times?\n \n \n \n In the realm of the physical universe, evidence is not neatly defined into whole numbers with known definitions as in an equation. Therefore, we generally use existing knowledge and existing evidence to develop new hypotheses -- not an infinite number of unknown variables from left field for which there is no evidence to suggest even the possibility that something might be worth exploring. \n\n Just because there is no evidence that sticking yourself in the eye with a pencil will reveal god, doesn't mean that it won't. Maybe you need to sit in hut in Nepal for 1000 days and ponder your navel. There are an uncountably infinite number of things to try. Get busy.\n (Keep in mind that even if you try everything and see nothing, god may yet still exist. Above I assumed that god would only reveal himself with probability .5.)", 
   {
    "unicode_changes_made": true
   }, 
   155362, 
   null, 
   1124227500.0
  ], 
  [
   155385, 
   null, 
   "sinjin", 
   "Toby,\n \n Forgive my lack of formal education but let me ask: Do all propositions automatically get a priori probability of 1:1?", 
   {}, 
   155364, 
   null, 
   1124233800.0
  ], 
  [
   155391, 
   null, 
   "toby", 
   "Toby,\n \n Forgive my lack of formal education but let me ask: Do all propositions automatically get a priori probability of 1:1?\n\n No problem. Please note: 1:1 are \"odds\" of successes to failures (for success related odds). A probability is the ratio of successes to trials. 1:1 odds is the same as a probability of .5.\n No, the a priori probability is the probability of something prior to taking any (more) evidence. When you first wake up in the morning, there is a probability that a tiger is in your living room. The probability doesn't appear to be anywhere near .5, at least in my experience. I've awakened 1000's of times and it hasn't happened yet (as far as I'm aware).* When you go and look in your living room, you collect further evidence as too whether a tiger is there, and the probability either goes up or down (from the a priori) based on whatever evidence you collect. \n I've used .5 (as the a prioiri probability that god exists, for example), because I have no evidentiary basis, and to assume something other than .5 would seem to indicate some kind of bias.\n *The actual a priori probability may still be .5 or greater, but with exceedingly low confidence.", 
   {
    "unicode_changes_made": true
   }, 
   155385, 
   null, 
   1124236020.0
  ], 
  [
   155393, 
   null, 
   "sinjin", 
   "No problem. Please note: 1:1 are \"odds\" of successes to failures (for success related odds). A probability is the ratio of successes to trials. 1:1 odds is the same as a probability of .5.\n No, the a priori probability is the probability of something prior to taking any (more) evidence. When you first wake up in the morning, there is a probability that a tiger is in your living room. The probability doesn't appear to be anywhere near .5, at least in my experience. I've awakened 1000's of times and it hasn't happened yet (as far as I'm aware).* When you go and look in your living room, you collect further evidence as too whether a tiger is there, and the probability either goes up or down (from the a priori) based on whatever evidence you collect. \n I've used .5 (as the a prioiri probability that god exists, for example), because I have no evidentiary basis, and to assume something other than .5 would seem to indicate some kind of bias.\n *The actual a priori probability may still be .5 or greater, but with exceedingly low confidence.\n\n \n Thank you. I was researching Bales and came upon the kid with the white and black rocks analogy. \n \n Would not the assignment of a priori probability of .5 also represent a bias if as in your example, the tiger actually being in your living room cannot be said to be as likely as not? I would contend that man's ability to assign the priori probability as it pertains to the existence of God to be contaminated by anecdotal evidence across millenia. Almost as if to allow that God might exist is a form of political correctness for doubters or outright unbelievers.\n \n Are there propositions for which a priori probability of zero is warranted?", 
   {
    "unicode_changes_made": true
   }, 
   155391, 
   null, 
   1124237340.0
  ], 
  [
   155401, 
   null, 
   "thebootfitter", 
   "I have never seen Bayes' Theorem applied in this manner. It sounds like toby is fairly well educated, so I'll need to brush up on my statistics. However, I'm not yet convinced this is a valid application of Bayes' Theorem. My understanding is that in order to apply the theorem, one must first actually have a priori knowledge. Regarding the existence of God or gods, we do not have a priori knowledge. Therefore, my understanding is that Bayes' Theorem cannot be applied to the situation. \n \n If I am not seeing the complete picture, feel free to educate me. I plan to do a bit of reading up to see if I can determine for myself if it's a valid application, though.\n \n This reminds me of the following:\n Bob: \"What do you suppose the odds are of me winning the lottery today\"\n Joe: \"Oh, I'd say about 50/50.\"\n Bob: \"Really? How do you figure?\"\n Joe: \"Well... either you will or you won't! 50/50!\"\n \n Obviously, the above is invalid reasoning. We can use lottery statistics to determine a priori probabilities. However, if we have no a priori knowledge of a given situation, we cannot assume that the probability is 50/50.", 
   {}, 
   155393, 
   null, 
   1124241000.0
  ], 
  [
   155404, 
   null, 
   "toby", 
   "Thank you. I was researching Bales and came upon the kid with the white and black rocks analogy. \n \n Would not the assignment of a priori probability of .5 also represent a bias if as in your example, the tiger actually being in your living room cannot be said to be as likely as not? \n\n Yes, that would be a bias.\n \n \nI would contend that man's ability to assign the priori probability as it pertains to the existence of God to be contaminated by anecdotal evidence across millenia. Almost as if to allow that God might exist is a form of political correctness for doubters or outright unbelievers. \n\n I don't think the a priori probability of god existing can reasonably be assumed anything other than .5. However, the debate would be about how likely we would see what we do if there was no god versus there was. We have been assuming here (because that's what the debate is about) that there is no evidence. In general, the parameter N would be whatever evidence we do see. For example, a believer's P[N|X], P[N|~X] might be 1 and 0, respectively. That forces god to exist with probability of 1 (almost regardless of the a priori probabilities).\n \n \nAre there propositions for which a priori probability of zero is warranted? \n\n Certainly in the theoretical sense the a priori probability of an event can be zero. As in your black and white rocks case, suppose there are 3 black rocks and 2 white rocks in an urn. The a priori probability of pulling a green rock is zero.", 
   {
    "unicode_changes_made": true
   }, 
   155393, 
   null, 
   1124241420.0
  ], 
  [
   155405, 
   null, 
   "toby", 
   "I have never seen Bayes' Theorem applied in this manner. It sounds like toby is fairly well educated, so I'll need to brush up on my statistics. However, I'm not yet convinced this is a valid application of Bayes' Theorem. My understanding is that in order to apply the theorem, one must first actually have a priori knowledge. Regarding the existence of God or gods, we do not have a priori knowledge. Therefore, my understanding is that Bayes' Theorem cannot be applied to the situation. \n \n If I am not seeing the complete picture, feel free to educate me. I plan to do a bit of reading up to see if I can determine for myself if it's a valid application, though.\n \n This reminds me of the following:\n Bob: \"What do you suppose the odds are of me winning the lottery today\"\n Joe: \"Oh, I'd say about 50/50.\"\n Bob: \"Really? How do you figure?\"\n Joe: \"Well... either you will or you won't! 50/50!\"\n \n Obviously, the above is invalid reasoning. We can use lottery statistics to determine a priori probabilities. However, if we have no a priori knowledge of a given situation, we cannot assume that the probability is 50/50.\n\n \n Suppose as in the other thread trebor is the sort of character that plays Parcheesi with the gods. In trebor's \"world\" there might be 39 gods who have created a total of 1000 universes. In trebor's \"world\", there are 9000 other universes that spontaneously sprang into existence without the assistance of any god. Trebor is now in position to say that in his \"world\" the a priori probability that a universe was created by god is .1 (i.e., 1000 out of 10000).\n We lack the experiential data of trebor, therefore our best guess (indicating the most amount of uncertainty) is that the a priori probability of a god created universe is .5. Is it actually .5? No: It is actually .1. But we just can't know that. Please note that selecting something other than .5 indicates a preference for one version over the other. Not being trebor, I can see no possible reason for preferring (preferring a priori--prior to any evidence seen in this universe) one version over the other. I will certainly entertain that the evidence tends to show either a god or no god, but unless you are trebor, I can't see any reason to accept anything other than .5 as the a priori probability.\n The upshot of the probability resulting from Bayes is our confidence in picking one version correctly other the other.", 
   {
    "unicode_changes_made": true
   }, 
   155401, 
   null, 
   1124242620.0
  ], 
  [
   155406, 
   null, 
   "Symbiote", 
   "If we have no idea what the probability is, that does not suggest a \"best guess\" of 0.5, it suggests that any guess is as good as any otherd, doesn't it?", 
   {}, 
   155405, 
   null, 
   1124242800.0
  ], 
  [
   155407, 
   null, 
   "thebootfitter", 
   "Please quantify this. What does reasonable mean? \n\n Reasonable means \"arrived at through the process of reason.\" I don't mean it in any subjective sense.\n \n \nTaking Bayes from before and applying it here:\n Example 3: Suppose you look around your world and see no god, what is the probability that there is no god? All things being equal:\n P[N|X]=the prob'y that there would be no evidence of an existing god =.5 \n P[X]= the a priori probability that there is a god = .5\n P[N|~X]= the prob'y that there would be no evidence of a non-existing god=.999999\n P[~X] the a priori probability that there is no god= .5\n P[X|N]= P[N|X] P[X]/( P[N|X] P[X]+ P[N|~X] P[~X])= \n .5 \u0095.5/(.5\u0095.5+.999999\u0095.5) = .333333556\n Based on that, I can't reasonably conclude that there is no god. In order to conclude that there is no god, I want to see .001 (not .333).\n\n Where do you get your a priori probabilities? Even if we assume your a priori assumptions are valid and that we can apply Bayes' Theorem to the situation, we get less than a 50% chance that God exists. Kronus is correct... we don't know. However, given the option of concluding that God exists or God does not exist, your application of Bayes' Theorem suggests that it is more reasonable to conclude that God does not exist.\n \n \nYes, it takes faith. It just takes less than to believe in god. \n\n It takes faith if there is no evidence or contrary evidence for a position, yet one still holds to that position. To believe that X does not exist takes faith. To recognize that there is no known evidence for X; therefore there is no reason to suggest that X exists; therefore it is possible but unlikely based on known evidence that X exists -- this does not take faith. It simply takes reason.\n \n \nYour objection appears to be fallacious. You have not shown why your heuristic should not be applied. \n\n On the contrary. We know exactly what will happen if we plug any positive integer into the equation. There are no unknown parameters to this problem. \n \n \nMaybe god can be found by sticking yourself in the eye with a pencil. Maybe it takes 1 poke, or maybe it takes 2 pokes, or maybe it takes 3 pokes. Everything you can say, I can throw right back at you.\n\n We don't know what will happen if we poke our eyes with a pencil in relation to God. (We know what is possible in terms of the physical world, though... \"You'll poke your eye out! You'll poke your eye out!\") :) \n \n \nAbove I assumed that god would only reveal himself with probability .5.\n\n Right. And I question your assumption.", 
   {
    "unicode_changes_made": true
   }, 
   155364, 
   null, 
   1124242920.0
  ], 
  [
   155408, 
   null, 
   "toby", 
   "If we have no idea what the probability is, that does not suggest a \"best guess\" of 0.5, it suggests that any guess is as good as any other.\n\n If we don't put in the right a priori probability then we won't really know the probability that this universe was created by god. However, it does have a meaning independent of that. Specifically, it does represent our confidence in selecting one version versus the other. In that respect, selecting .5 as the a priori probability is exactly the right thing to do.\n If the Parcheesi playing trebor used Bayes theorem, he would not use .5, and his confidence would be different.", 
   {
    "unicode_changes_made": true
   }, 
   155406, 
   null, 
   1124243640.0
  ], 
  [
   155410, 
   null, 
   "Symbiote", 
   "Suppose I propose the existence of a supernatural being called \"Being X\". \"Being X\" is not a God, however, his existence precludes the existence of a God or Gods - that's his power. He is also very shy.\n \n Will you give the probability of Being X's existence as 0.5 and reduce the probability of a God created universe proportionally?", 
   {}, 
   155408, 
   null, 
   1124243940.0
  ], 
  [
   155415, 
   null, 
   "thebootfitter", 
   "If we don't put in the right a priori probability then we won't really know the probability that this universe was created by god. However, it does have a meaning independent of that. Specifically, it does represent our confidence in selecting one version versus the other. In that respect, selecting .5 as the a priori probability is exactly the right thing to do.\n If the Parcheesi playing trebor used Bayes theorem, he would not use .5, and his confidence would be different.\n\n I agree that it is valid for Trebor to use Bayes' Theorem, as Trebor has a priori knowledge. Can you explain why it would be valid for an individual without a priori knowledge to apply Bayes' Theorem?", 
   {
    "unicode_changes_made": true
   }, 
   155408, 
   null, 
   1124244780.0
  ], 
  [
   155416, 
   null, 
   "toby", 
   "Reasonable means \"arrived at through the process of reason.\" I don't mean it in any subjective sense. \n\n You're not answering the question: What kind of confidence does one need to reasonably conclude something? If there is no confidence, then what makes it reasonable? You're evading the problem. There is no acceptance of what the process of reason is. If I reason that 1+1 is 3, is that okay? What are the standards? Is it basically whatever you say is reasonable, and whatever the other guy says is not reasonable? At some point it comes down to confidence. \n \n \n Where do you get your a priori probabilities? Even if we assume your a priori assumptions are valid and that we can apply Bayes' Theorem to the situation, we get less than a 50% chance that God exists. Kronus is correct... we don't know. However, given the option of concluding that God exists or God does not exist, your application of Bayes' Theorem suggests that it is more reasonable to conclude that God does not exist. \n\n Yes, if one was going to conclude one way or the other. Based on the numbers, I don't see either conclusion being very reasonable. (And there may be other reasons to believe something other than confidence.)\n \n \n It takes faith if there is no evidence or contrary evidence for a position, yet one still holds to that position. To believe that X does not exist takes faith. To recognize that there is no known evidence for X; therefore there is no reason to suggest that X exists; therefore it is possible but unlikely based on known evidence that X exists -- this does not take faith. It simply takes reason. \n\n I've already shown you that your confidence in believing there is no god is low. Your \"reason\" is not backed by anything. You say it is unlikely. Well, how unlikely is it? \n Consider once again my equation (A^2+B^3=C^5). Parroting you back: \"To recognize that there is no known evidence for X; therefore there is no reason to suggest that X exists; therefore it is possible but unlikely based on known evidence that X exists -- this does not take faith. It simply takes reason.\"\n Therefore, we can conclude that my equation has no solutions, based on the fact that we have no evidence for any.\n \n \n On the contrary. We know exactly what will happen if we plug any positive integer into the equation. There are no unknown parameters to this problem. \n\n How can that possibly be an objection? The problem is better defined, therefore your heuristic doesn't work? How convenient. It only works when the situation is muddled? That's completely irrational. What you're saying is that you'd rather not defend it in a clear situation.\n \n \n We don't know what will happen if we poke our eyes with a pencil in relation to God. \n\n So then you admit just as with my equation, you haven't tried every conceivable thing to find god (or find a solution to my equation). \n \n \n Right. And I question your assumption. \n\n Grand. I've already quite thoroughly explained the assumption. It merely means we have no confidence in our ability to select between the alternatives (prior to seeing any evidence). If you have a rational argument against .5, present it.", 
   {
    "unicode_changes_made": true
   }, 
   155364, 
   null, 
   1124245740.0
  ], 
  [
   155418, 
   null, 
   "Easyrider", 
   "The Mathematical Odds of Jesus Fulfilling Prophecy  \n \n \"The following probabilities are taken from Peter Stoner in Science Speaks (Moody Press, 1963) to show that coincidence is ruled out by the science of probability. Stoner says that by using the modern science of probability in reference to eight prophecies, 'we find that the chance that any man might have lived down to the present time and fulfilled all eight prophecies is 1 in 1017.\" That would be 1 in 100,000,000,000,000,000. In order to help us comprehend this staggering probability, Stoner illustrates it by supposing that \"we take 1017 silver dollars and lay them on the face of Texas. They will cover all of the state two feet deep. Now mark one of these silver dollars and stir the whole mass thoroughly, all over the state. Blindfold a man and tell him that he can travel as far as he wishes, but he must pick up one silver dollar and say that this is the right one. What chance would he have of getting the right one? Just the same chance that the prophets would have had of writing these eight prophecies and having them all come true in any one man.\"\n \n Stoner considers 48 prophecies and says, \"we find the chance that any one man fulfilled all 48 prophecies to be 1 in 10157, or 1 in 10,00,000,000,000,000,000,000,000,000, 000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000, 000, 000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000 000,000,000.\" \n \n (This information was taken from the book Evidence that Demands a Verdict, by Josh McDowell.)", 
   {
    "unicode_changes_made": true
   }, 
   155416, 
   null, 
   1124246880.0
  ], 
  [
   155419, 
   null, 
   "Symbiote", 
   "It's interesting to lay two \"Christian\" arguments side by side.\n \n The odds of life occurring naturally are very small, therefore life did not occur naturally.\n \n The odds of someone fulfilling biblical prophecy are very small, therefore someone fulfilled biblical prophecy.", 
   {}, 
   155418, 
   null, 
   1124247240.0
  ], 
  [
   155422, 
   null, 
   "Easyrider", 
   "The odds of someone fulfilling biblical prophecy are very small, therefore someone fulfilled biblical prophecy.\n\n \n It's a matter of perspective. From God's standpoint the odds of Jesus fulfilling the 1st Advent Prophecies was 100%.", 
   {}, 
   155419, 
   null, 
   1124247420.0
  ], 
  [
   155423, 
   null, 
   "Easyrider", 
   "And if the odds of abiogenesis occurring by natural means is 1 over ten to the 160th power, then the odds of it occurring by divine means must then be the reverse.", 
   {}, 
   155422, 
   null, 
   1124247540.0
  ], 
  [
   155424, 
   null, 
   "Symbiote", 
   "I just rolled a die. It landed on a 6. The odds of my die landing on a 6 is 1 in 6. Therefore the odds that my die was divinely guided to land on a 6 are 5 in 6\n \n In fact, God intervenes in 5 out of 6 of all 6 sided dice rolls, but only 50% of times a coin is tossed.", 
   {}, 
   155423, 
   null, 
   1124247600.0
  ], 
  [
   155428, 
   null, 
   "toby", 
   "Suppose I propose the existence of a supernatural being called \"Being X\". \"Being X\" is not a God, however, his existence precludes the existence of a God or Gods - that's his power. He is also very shy. \n \n Will you give the probability of Being X's existence as 0.5 and reduce the probability of a God created universe proportionally? \n\n \n No. I wouldn't change anything. Remember that the output of Bayes is my confidence. Your supposition hasn't diminished my complete uncertainty (increased my confidence). The Parcheesi playing trebor would change his numbers if Being X actually existed, but I don't know what trebor does.", 
   {
    "unicode_changes_made": true
   }, 
   155422, 
   null, 
   1124247960.0
  ], 
  [
   155432, 
   null, 
   "trebor", 
   "It's interesting to lay two \"Christian\" arguments side by side.\n \n The odds of life occurring naturally are very small, therefore life did not occur naturally.\n \n The odds of someone fulfilling biblical prophecy are very small, therefore someone fulfilled biblical prophecy.\n\n \n Too bad for Josh McDowell, and all those christians that buy into his fraudulant odds is that the new testament was written as IF Jesus fullfilled prophecies.\n \n Fiction, shoe horning phrases out of context, and mistranslations bring the odds way way down.", 
   {}, 
   155419, 
   null, 
   1124249340.0
  ], 
  [
   155433, 
   null, 
   "toby", 
   " I agree that it is valid for Trebor to use Bayes' Theorem, as Trebor has a priori knowledge. Can you explain why it would be valid for an individual without a priori knowledge to apply Bayes' Theorem? \n\n I've already explained: The result of Bayes is my confidence in selecting the correct alternative. In the absence of any evidence (that is we haven't even open our eyes yet), my confidence in selecting the correct alternative is .5, which is to say that I have no confidence in selecting one alternate versus the other. \n Let's look at an example. You have a True-False test in front of you with 10 questions. You have absolutely no idea what the answers are. On question 1, you flip a coin, and mark question 1 True based on the coin's result. What is the probability that you got the answer correct? Well, it depends. If the test's constructor made all the answers True, then you got the right answer with probability 1. If the test's constructor, made half the answers True and half False, then the probability you got it right is .5. So much for probability. What about your confidence that you answered the question correctly? From that point of view, your confidence is .5. It is totally immaterial how the test's constructor constructed the test (all Trues, all Falses, or any kind of mixture). From your point of view, you have a 50-50 shot at getting the right answer.", 
   {
    "unicode_changes_made": true
   }, 
   155428, 
   null, 
   1124249400.0
  ], 
  [
   155434, 
   null, 
   "trebor", 
   "And if the odds of abiogenesis occurring by natural means is 1 over ten to the 160th power, then the odds of it occurring by divine means must then be the reverse.\n\n \n \n Except, of course, the odds of abiogenesis could very well be much much higher, and in the universe, there might be that many chances.. so, your statement is irrelavent/", 
   {}, 
   155423, 
   null, 
   1124249460.0
  ], 
  [
   155442, 
   null, 
   "Easyrider", 
   "Wishful thinking there, Trebor.", 
   {}, 
   155434, 
   null, 
   1124252040.0
  ], 
  [
   155469, 
   null, 
   "johnhanks", 
   "And if the odds of abiogenesis occurring by natural means is 1 over ten to the 160th power...\n\n \n Are you still using that August 1954 Sci Am article as the source of this figure? (More accurately, I suppose I should ask, does the fundy website from which you copied it use that source?)\n \n Either way, the figure is derived from a model of enzyme formation that does not form any part of current theories for the origin of life.", 
   {}, 
   155423, 
   null, 
   1124272620.0
  ], 
  [
   155490, 
   null, 
   "unkerpaulie", 
   "thebootfitter, the answer to your question is no: the idea that God does not exist is supported only by faith.\n \n faith is defined as the belief in the truth of something in the absence of evidence that the thing is true. the position that God does not exist is a position of belief in something ine the absence of evidence that supports that position. therefore it is supported only by faith. qed\n \n i think there's a stigma attached to the word \"faith\" that every \"reasoner\" tries thier best to avoid. faith is not a negative thing. there are statements we take as true in the absence of positive evidence everyday, even in the pursuit of scientific knowledge. \n \n as kronus pointed out, the only \"default\" position to adapt in the absence of evidence is \"i dont know\". if no evidence to support either the existence or non-existence of God is available, then any conclusion based on the existence or non-existence of God is being made in the absence of supporting evidence, and is therefore a faith-based conclusion", 
   {}, 
   155469, 
   null, 
   1124293020.0
  ], 
  [
   155501, 
   null, 
   "trebor", 
   "Are you still using that August 1954 Sci Am article as the source of this figure? (More accurately, I suppose I should ask, does the fundy website from which you copied it use that source?)\n \n Either way, the figure is derived from a model of enzyme formation that does not form any part of current theories for the origin of life.\n\n \n I am sure that figure is probably quoted out of context too. After all, it fails to take into account that a creation of an enzyme was a gradual, incremental process. \n \n start out with 2 to the 160th power coins, and then toss them.. and eliminate all the tails.. After 160 times.. , you have a coin that landed heads 160 times in a row.", 
   {}, 
   155469, 
   null, 
   1124296500.0
  ], 
  [
   155530, 
   null, 
   "johnhanks", 
   "I am sure that figure is probably quoted out of context too. After all, it fails to take into account that a creation of an enzyme was a gradual, incremental process.\n\n \n If I remember rightly, the article in question hypothesised an enzyme being formed by all the amino acids happening to come together in the right sequence in a single event. Not surprisingly, the odds were absurd. No-one today envisages enzymes or other biological molecules arising in such a manner; but that doesn't stop creationists quoting this 50-year-old article as though it were a damning indictment of modern theories of abiogenesis.", 
   {}, 
   155501, 
   null, 
   1124304840.0
  ], 
  [
   155560, 
   null, 
   "Easyrider", 
   "Hanks, you guys can't even create life in a test tube yet, so the odds of it occurring by chance must still be astronomical. \n \n Of course you have to take abiogenesis by FAITH, since you don't have a clue how it happened. \n \n <chuckle<", 
   {}, 
   155530, 
   null, 
   1124318640.0
  ], 
  [
   155561, 
   null, 
   "sinjin", 
   "Hanks, you guys can't even create life in a test tube yet, so the odds of it occurring by chance must still be astronomical. \n \n\n I'm not sure what the test tube comment has to do with it but as luck would have it, we live in a universe of astronomical proportions. Infinite possibilities are pretty common in infinity.\n \n <chortle<", 
   {}, 
   155560, 
   null, 
   1124319600.0
  ], 
  [
   155563, 
   null, 
   "Kronus", 
   "Hanks, you guys can't even create life in a test tube yet, so the odds of it occurring by chance must still be astronomical. \n \n Of course you have to take abiogenesis by FAITH, since you don't have a clue how it happened. \n \n <chuckle<\n\n \n Ah yes, if we can't make it happen in a test tube in a month, then it couldn't possbily have happened anywhere on an entire planet in 500 million years.\n \n And if we don't know how something happened, then we can't know that it did happen? I don't know how my parents met, I guess that must mean I was never born!\n \n I hope that was a self-depricating chuckle EZ. :p", 
   {}, 
   155560, 
   null, 
   1124319840.0
  ], 
  [
   155597, 
   null, 
   "Easyrider", 
   "Kronus,\n \n Like I said, you have to accept that (abiogenesis) BY FAITH, don't you, since no one has ever seen it take place? And it can't be REPLICATED either, can it? \n \n Oh ye of GREAT FAITH!\n \n LOL!", 
   {}, 
   155563, 
   null, 
   1124336820.0
  ], 
  [
   155610, 
   null, 
   "Kronus", 
   "Kronus,\n \n Like I said, you have to accept that (abiogenesis) BY FAITH, don't you, since no one has ever seen it take place? And it can't be REPLICATED either, can it? \n \n\n \n You're really only making yourself look more foolish here, quit while you're ahead. And might I suggest that you stop bolding your more stupid comments?\n \n Do we need to observe an event to know that it took place? Of course not, as any fool (with some exceptions) knows. There was no life, and then there was single celled life. Doesn't take a genius to figure out that something happened in there, and that something is called abiogenesis. (You're not going to abandon your stance that every word in the Bible is the literal truth and claim God did it, are you?) And can it be replicated? Of course! Any event which has ever occurred in nature can be duplicated, given the right conditions. The fact that we haven't done it right off the bat may hold great meaning to you, but then you know pretty much nothing about science, so your opinion on the subject isn't worth a whole lot. Abiogenesis is a very young science, and the fact that it hasn't answered every single question yet surprises no one, and is only found to be worthy of comment among the ignorant who wish to mock instead of learn.", 
   {}, 
   155597, 
   null, 
   1124340420.0
  ], 
  [
   155618, 
   null, 
   "Orion", 
   "And if the odds of abiogenesis occurring by natural means is 1 over ten to the 160th power, then the odds of it occurring by divine means must then be the reverse.\n\n \n Assuming for the moment your stated probabilities to be accurate, the question nevertheless remains; how do you discern the difference between 'natural' and 'divine' means? Remember, this is YOUR stated dichotomy. Are you suggesting that your god is incapable of using natural means in order to accomplish his objectives? Putting your god into a box, are you? Yet another example of your worship of the Bible?", 
   {}, 
   155423, 
   null, 
   1124348220.0
  ], 
  [
   155620, 
   null, 
   "johnhanks", 
   "Hanks, you guys can't even create life in a test tube yet, so the odds of it occurring by chance must still be astronomical.\n\n \n A fully functional polio virus was synthesised from scratch in 2002. Viruses aren't strictly alive, but it's a major step on the way.\n \n 'Occurring by chance' is a very loaded phrase. Creationists love it, because it sounds as though scientists modelling the origin of life are relying on some wildly improbable mass collision of elemental components. It's well known that the fundamental molecules of life - sugars, amino acids, nucleotides - form naturally in the right conditions; so do phospholipid bilayers, the basis of cellular membranes. An incremental process, each step being chemically not only possible but energetically favourable, and each development being subject to a kind of pre-biotic selection, would make the emergence of life an entirely unremarkable event; perhaps an inevitable one.\n \n Creationists, of course, hate incremental processes, preferring the straw man of 'chance'.\n \n \nOf course you have to take abiogenesis by FAITH, since you don't have a clue how it happened.\n\n \n As I've indicated, we do in fact have a number of rather large clues. But even if we ignore those, ez, when we get down to basics you don't have a clue how it happened either. Saying 'god did it' explains nothing; it's a substitute for an explanation.", 
   {}, 
   155560, 
   null, 
   1124357460.0
  ], 
  [
   155703, 
   null, 
   "Easyrider", 
   "Do we need to observe an event to know that it took place? Of course not, as any fool (with some exceptions) knows. There was no life, and then there was single celled life. Doesn't take a genius to figure out that something happened in there, and that something is called abiogenesis.\n\n \n Now in order to believe in evolution, people have to swallow whole the unlikely concept of spontaneous generation - the highly improbable and scientifically unexplainable precept that living organisms suddenly came to life in the midst of a primordial organic \"soup.\" Dr. George Wald, a Nobel Prize-winning laureate from Harvard University, had this to say concerning spontaneous generation: \"One has only to contemplate the magnitude of this task to concede that the spontaneous generation of a living organism is impossible. Yet here we are - as a result, I believe, of spontaneous generation\". That kind of a statement surely demonstrates a much greater faith than a religious creationist can possibly muster. Dr. Wald categorically states that it could not possibly have happened - yet he believes it did. A Christian who professes to so great a faith would be labeled as naive and gullible. What a difference a cloak of higher education makes to those who are so easily impressed!  \n \n What is this evolutionary doctrine that inspires so much faith in its disciples, and what are the odds that an event such as spontaneous generation can actually occur? A Swiss mathematician by the name of Charles Eugene Guye computed the odds of such an occurrence (of abiogenesis) at one chance in 10 to the 160th power. That's one over ten followed by 160 zeros! Your chances of winning the Florida Lottery are one in fourteen million, and people say you're a fool for spending your money on such an improbability, but these same people will turn right around and put their eternal faith in an event that is millions and millions of times less likely to occur. Folks, that's not called science, that's called blind faith. The odds against spontaneous generation alone are enough for a reasonable individual to give up on the theory of evolution, but that's the kind of thing you have to believe in when you don't believe in God.", 
   {}, 
   155620, 
   null, 
   1124406420.0
  ], 
  [
   155704, 
   null, 
   "Easyrider", 
   "Let's look at some of the other improbable events that must come to pass for evolution to be true. Let's take a look at the transitional fossil record and listen to what die-hard evolutionists themselves say about it. To begin with, S. M. Stanley of Johns Hopkins University tells us how important the transitional fossil record is to the theory of evolution: \"It is doubtful whether, in the absence of (transitional) fossils, the idea of evolution would represent anything more than an outrageous hypothesis....the fossil record and only the fossil record provides direct evidence of major sequential changes...\" (Evolutionary Timetable, 1981, page 72.). Now regarding whether or not these transitional fossils exist, Colin Patterson, Senior Paleontologist for the British Museum of Natural History remarks, \"You say I should at least show a photo of a fossil from which each type of organism was derived. I will lay it on the line - there is not one such fossil for which we can make a watertight argument\" (Harper's, Feb. 1984, page 56). Niles Elidridge of Columbia University and a former paleontologist with the American Museum of Natural History categorically states, \"Darwin prophesied that future generations of paleontologists would fill in these (transitional fossil) gaps by diligent research....One hundred and twenty years of paleontological research later, it has become abundantly clear that the fossil record will not confirm this part of Darwin's predictions....The fossil record simply shows that this prediction was wrong\" (The Myths of Human Evolution, pages 45-46). Professor D. B. Kitts from the University of Oklahoma echoes what Elidredge said when he states, \"Despite the bright promise that paleontology provides a means of 'seeing' evolution, it has presented some rather nasty difficulties for evolutionists, the most notorious of which is the presence of 'gaps' in the fossil record. Evolution requires intermediate forms between species, and paleontology does not provide them\" (Evolution, Vol. 28, page 467). And let me give you just one or two more before I move on to some of the other absurdities found in Darwinian evolution. Professor Mark Ridley of Oxford University wrote this in the New Scientist Journal (1981, p. 831): \"A lot of people just do not know what evidence the theory of evolution stands upon. They think that the main evidence is the gradual descent of one species from another in the fossil record....In any case, no real evolutionist, whether gradualist or punctuationist, uses the fossil record as evidence in favor of the theory of evolution as opposed to special creation.\" \n \n Remarkable. People, these are not fundamentalist Christians who are speaking - these are university paleontologists and evolutionary scientists who are commenting on their own theory. Darwin himself wrote in the Origin of Species, \"If in the future these transitional fossils are not found, then my theory will have been proven to be wrong.\" By the way, many of the top evolutionary scientists have summarily given up on supporting the theory of evolution by virtue of the transitional fossil record, and they have graduated to new models of evolution known as \"Punctuated Equilibrium\" or \"Special Creation,\" which may not require transitional fossils as supporting evidence. To this, Colin Patterson of the British Museum of Natural History concludes (paraphrasing), \"Well, it seems to me that they have accepted that the fossil record doesn't give them the support they would value so they had to search around for another model....When they haven't got the evidence they need to support their theory, they come up with another theory to explain their lack of evidence\" (Quoted in Darwin's Enigma, p. 100). And this is exactly what you're seeing in science today. These are some of the remarkable intellectual foundations that masquerade as \"truth and science\" that people have to swallow whole when they don't believe in God. There may well be some variation within species since God's creation of life (microevolution), but there's no convincing evidence of any new species (macroevolution). Many people do not understand this distinction.", 
   {}, 
   155703, 
   null, 
   1124406540.0
  ], 
  [
   155706, 
   null, 
   "Easyrider", 
   "Okay, on to the next \"problem child\" of evolution - \"Natural Selection\" - as a means of generating new species. The assumption of Natural Selection is that since only the strongest and \"most fit\" species survive to father the next generation, the species will gradually improve, even to the point of advancing into other more \"highly\" developed states on the evolutionary scale. Darwin looked upon natural selection as the most important factor in the development of his theory. Another evolutionist by the name of Sir Julian Huxley said, \"So far as we know....natural selection is the only effective agency of evolution\" (Evolution in Action, p. 36). Huxley goes on to state, \"On the basis of our present knowledge natural selection is bound to produce genetic adaptations; and genetic adaptations are thus presumptive evidence for the efficacy of natural selection.\" Did you catch that gem of twisted logic? Huxley's proof for natural selection is genetic adaptations within the species, but these genetic adaptations are at the same time the result of natural selection. So which is it? Does natural selection give rise to genetic adaptation, or does genetic adaptation give rise to natural selection? Huxley contends that both of these things are true at the same time! Surely this is one of the most vacuous examples of circular reasoning to ever be perpetrated in the name of science. \n \n Huxley continues with his defense of natural selection by saying, \"....(natural selection) operates with the aid of time to produce improvements in the machinery of life, and in the process generates results of a more than astronomical improbability which could have been achieved in no other way\" (Evolution in Action, p. 54-55). Don't miss the force of that last statement. Huxley states that the odds of natural selection occurring are \"astronomically improbable,\" but because Huxley sees no other way for it to have occurred, he believes in the astronomically improbable! God help us! Huxley even calculated the odds of natural selection occurring in nature as 1 over 10 followed by three million zeros.  \n \n OH YE OF GREAT FAITH!!!\n \n Now listen to what another evolutionist says regarding natural selection: Dr. Ernst Mayr, considered to be one of the heavyweights in the field of evolution, contends that, \"Natural Selection is no longer regarded as an all-or-none process, but rather as a purely statistical concept\" (Animal Species, p. 7). It is statistical because there is a lack of physical evidence to support it! And G. G. Simpson, another highly regarded interpreter of evolutionary theory, remarks, \"It might be argued that the theory is quite unsubstantiated and has status only as a speculation\" (Major Features, p. 118-119). \n \n Just one more - the concept of genetic mutation. Genetic mutations are perceived to be abnormal changes in the living organism caused by chemical damage, unusual pairings, or other influences, which supposedly give rise to changes in an offspring and possibly new species. The evolutionist assumes that, due to genetic mutations, amoebas turned into invertebrates, which magically evolved into amphibians, then reptiles, quadrupeds, ape man, and finally into modern man. \n \n You all may remember the evolution charts in science classes when you were growing up, where you saw the drawings of Australopithecus, Peking man, Java man, Cro-Magnum man, the Neanderthal man, and modern man - they were all neatly lined up there on the charts. Come to find out that in 1997 scientists conducted genetic testing on the Neanderthal man and came to the scientific conclusion that it was genetically impossible for the Neanderthal man to be our direct ancestor! In addition, no genetic testing on any of the other \"missing links\" has yet to identify any vertebrate species as being our direct-line ancestor. When I asked one university professor to identify for me which species is it that is man's direct-line ancestor, or which species is it that we can look to as the \"missing-link,\" he couldn't do it. In fact he said I was presenting a \"straw man\" argument - asking him to identify something that doesn't need to exist in order for evolution to be true. It's only a \"straw-man\" argument in his eyes. Does anyone have any doubt whatsoever that if they found the so-called \"missing link\" they would not parade him around like their missing messiah? Anyway, what we are able to conclude from the genetic testing of the Neanderthal man was that the evolution charts were just an exercise in pseudoscience, where anatomical and physiological similarities were used to infer that the Neanderthal man was once our forefather. It's obvious now that the initial inference was baseless. And if that inference was wrong, how many of the other evolutionary inferences that we've been force-fed since the first grade are also wrong? We can study science in the form of physiology, paleontology, and biology, but it ceases to become good science when ill-advised inferences are made.\n \n Anyway, getting back to genetic mutations - Professor Ernst Mayr stated, \"(Genetic) mutation is the ultimate source of all genetic variation found in natural populations, and the only raw material for natural selection to work on\" (Evolution, p. 170). Well, to begin with, all scientists agree that genetic mutations are very rare. Secondly, when they do occur, they are almost certain to be harmful or deadly to the organism. Huxley admits that, \"The great majority of mutant genes are harmful in their effect on the organism.\" Other scientists, including Darwin himself, conceded that most mutants are recessive and degenerative - they would therefore be more likely to cause the death or extinction of the species than to cause the emergence of a new species. Professor G.G. Simpson, one of the top spokesmen for evolution, reports that the mathematical likelihood of getting good evolutionary results through mutations would only tend to occur once every 274 billion years. And that would be assuming 100 million individuals reproducing a new generation every day. Simpson concludes by saying that, \"Obviously...such a process has played no part whatever in evolution\" (The Major Features of Evolution, p. 96). \n \n OH YE OF GREAT FAITH!!!\n \n Evolutionists say that genetic mutations are necessary to make the changes required by their theory, yet when they do the calculations they confess that it is scientifically improbable for multiple mutations to effect the required changes that are needed.", 
   {}, 
   155704, 
   null, 
   1124406780.0
  ], 
  [
   155708, 
   null, 
   "Easyrider", 
   "So let's do a quick review of what we've learned from the evolutionists - and keep in mind that the quotations and mathematical probabilities that I've given you today are from the archives of the evolutionists and the scientific community itself: First, they advocate the improbable proposition of spontaneous generation, which the odds against it occurring are 1 over 10 to the 160th power. Second, they profess the belief that transitional fossils exist to substantiate their theory - that they are fundamentally necessary to support their theory, all the while admitting that there is an overwhelming absence of these same transitional fossils, and that no viable evolutionary scientist uses these fossils as evidence to support their theory. Third, they promote natural selection and genetic mutations as the vehicles by which evolutionary change is brought about, while admitting that the odds against these things occurring are astronomically impossible. I think once you put all these things together in your mind, you have to concede that long ago you stopped talking about rational thought, much less scientific evidence in support of evolution. These theories remain in the halls of academia because of the separation of church and state - they're not allowed to teach creationism. If you can't teach creation science in our schools and universities, then the evolution show, however implausible and contradictory it becomes, must go on. \n \n There is good science, but evolutionary theory does not play a part in it. It's time to bury the corpse of evolution and go on.  People think that God is an improbable proposition, yet they'll buy into the pseudoscientific farce of evolution that masquerades as science. But these are the things that one must believe in when people don't believe in God.", 
   {}, 
   155706, 
   null, 
   1124407080.0
  ], 
  [
   155711, 
   null, 
   "Kronus", 
   "That was pretty thorough. You must have grabbed pretty much every misquote, misrepresentation, and outright lie from every Creationist site out there! I've never seen someone put in so much concentrated effort to preserve their ignorance. If you put a fraction of that effort into actually trying to learn something you'ld be a force to reckon with. As it is... :p", 
   {}, 
   155708, 
   null, 
   1124407680.0
  ], 
  [
   155713, 
   null, 
   "Easyrider", 
   "Get Christ, Kronus, before you dry up. There's more evidence for him than there is for your abiogenesis.", 
   {}, 
   155711, 
   null, 
   1124407800.0
  ], 
  [
   155739, 
   null, 
   "marc9000", 
   ".......but then you know pretty much nothing about science, so your opinion on the subject isn't worth a whole lot. \n\n \n Could the same not be said about you and your knowledge of the Bible?\n \n \n \n \nThat was pretty thorough. You must have grabbed pretty much every misquote, misrepresentation, and outright lie from every Creationist site out there!  I've never seen someone put in so much concentrated effort  to preserve their ignorance. If you put a fraction of that effort into actually trying to learn something you'ld be a force to reckon with. As it is... :p\n\n \n But we've seen PLENTY of concentrated effort put into evolution study & propaganda to preserve it's FUNDING. Tax money supports evolution study far more than it supports creation study.", 
   {}, 
   155711, 
   null, 
   1124416380.0
  ], 
  [
   155748, 
   null, 
   "trebor", 
   "Could the same not be said about you and your knowledge of the Bible?\n \n\n \n I am sure many people who are 'non-believers' know more about the bible than many believers. That is why some 'beleivers' have to restort to the rationalisation of 'spiritual discerning'\n \n \n\n But we've seen PLENTY of concentrated effort put into evolution study & propaganda to preserve it's FUNDING. Tax money supports evolution study far more than it supports creation study.\n\n \n And for math, and for chemistry, and many other fields of education. On the other hand, 'creation study' is pure religion, and funding that is against the establishment clause of the constitution.", 
   {}, 
   155739, 
   null, 
   1124421720.0
  ], 
  [
   155769, 
   null, 
   "johnhanks", 
   "Dr. George Wald, a Nobel Prize-winning laureate from Harvard University, had this to say concerning spontaneous generation: \"One has only to contemplate the magnitude of this task to concede that the spontaneous generation of a living organism is impossible. Yet here we are - as a result, I believe, of spontaneous generation\".\n\n \n Precisely the 50-year-old source I referred to in post #38. This quote is trotted out time and again in creationist literature, though never in context - and certainly never with a date attached. It dates from August 1954.\n \n In the remark quoted, Wald was underlining the inadequacy of the molecular biology of his time to provide a viable model for the origin of life. Bear in mind that in 1954 Watson and Crick had only just published their work on DNA structure: understanding the details of its replication, transcription and translation lay in the future.\n \n A few posts later ez goes on to say \n \n \nthey [scientists working on the origin of life] advocate the improbable proposition of spontaneous generation, which the odds against it occurring are 1 over 10 to the 160th power\n\n \n These odds come from the same August 1954 article as the first quote. I have pointed out to easyrider several times, here and elsewhere, that they are calculated from a hypothetical event which forms no part of any contemporary model of abiogenesis. Either he does not understand this, or he has chosen to ignore it.\n \n The rest, as others have pointed out, is the usual mish-mash of out-of-context quotes and distortions.", 
   {}, 
   155703, 
   null, 
   1124444640.0
  ], 
  [
   155797, 
   null, 
   "Orion", 
   "Evangelical scientists refute gravity with new 'Intelligent Falling' theory!\n \n http://www.theonion.com/news/index.php?issue=4133&n=2", 
   {}, 
   155769, 
   null, 
   1124463120.0
  ], 
  [
   155798, 
   null, 
   "Kronus", 
   "Could the same not be said about you and your knowledge of the Bible?\n \n\n No, it couldn't. At least not with any veracity.\n \n \n \n\n But we've seen PLENTY of concentrated effort put into evolution study & propaganda to preserve it's FUNDING. Tax money supports evolution study far more than it supports creation study.\n\n \n Interesting segue. :)\n \n That's because evolutiuon is a legitimate science, and creation isn't. Even if creation didn't have a religious underpinning it wouldn't receive funding, because it has no basis in reality. In fact, it contradicts reality. We know creation is false, and we know evolution is correct, so we spend money studying evolution and not creationism.", 
   {}, 
   155739, 
   null, 
   1124463720.0
  ], 
  [
   155816, 
   null, 
   "unkerpaulie", 
   "Get Christ, Kronus, before you dry up. There's more evidence for him than there is for your abiogenesis.\n\n lol is this a challenge? wheres the evidence for christ?", 
   {}, 
   155713, 
   null, 
   1124471220.0
  ], 
  [
   155824, 
   null, 
   "trebor", 
   "lol is this a challenge? wheres the evidence for christ?\n\n \n \n He's gong to trot out all that 'evidence' that is in Josh McDowels 'case for christ' again , even though it has been refuted again and again and again.", 
   {}, 
   155816, 
   null, 
   1124472660.0
  ], 
  [
   155828, 
   null, 
   "Kronus", 
   "He's gong to trot out all that 'evidence' that is in Josh McDowels 'case for christ' again , even though it has been refuted again and again and again.\n\n \n How about we get a pool going? I say he's just going to say it's all in the Bible, and call anyone who thinks otherwise a degenerate homo liberal.", 
   {}, 
   155824, 
   null, 
   1124473800.0
  ], 
  [
   155833, 
   null, 
   "trebor", 
   "How about we get a pool going? I say he's just going to say it's all in the Bible, and call anyone who thinks otherwise a degenerate homo liberal.\n\n \n \n what do we get? A vacation in the bbq pit?", 
   {}, 
   155828, 
   null, 
   1124474220.0
  ], 
  [
   155834, 
   null, 
   "Liminus", 
   "So let's do a quick review of what we've learned from the evolutionists...First, they advocate the improbable proposition of spontaneous generation, which the odds against it occurring are 1 over 10 to the 160th power.\n \n \n I don't know where the alleged scientists you quote get these probabilities from, but recent research has shown that if molecules resembling primitive amino acids are as common as we now think they are (they have been found in the remains of meteorites which were orbiting the sun before the earth was fully formed) then it is in fact quite likely that the great and complex chemical reaction we call life would have taken place on earth. We still don't know the mechanics behind it, but that fact does not lead me to stop thinking about it and just accept \"oh, well, it must have been an all-powerful deity\". Just because something seems to be beyond our understanding now, doesn't mean we have to attribute it to God as our primitive ancestors did to phenomena they didn't understand such as floods, plagues, volcanoes etc\n \n \nSecond, they profess the belief that transitional fossils exist to substantiate their theory - that they are fundamentally necessary to support their theory, all the while admitting that there is an overwhelming absence of these same transitional fossils, and that no viable evolutionary scientist uses these fossils as evidence to support their theory.\n\n \n Fossils are in fact incredibly rare finds considering how many creatures have lived in the history of the planet, and paleontology is a colossal field, the extent of which has barely been probed:\n \n \" * We have already listed one bias - soft bodied organisms are rarely preserved.\n *Only organisms living in areas of active deposition will be preserved. Erosional or non-depositional environments are not accounted for. Terrestrial environments are usually erosional and thus poorly preserved. Marine environments are preserved much more frequently.\n * Rocks deposited in deep sea environments are eventually destroyed by subduction. Rocks deposited on continental shelves are destroyed by metamorphism during continental collisions. Sediments with the highest degree of survivability over the long term are those deposited in depositional basins on continental interiors.\n * The vast majority of paleontologists have lived and worked in North American and Europe. \n So, our knowledge of the history of life is heavily biased toward marine, hard shelled fossils from marine, cratonic sediments of North America and Europe. These biases must be taken into consideration when studying patterns in the history of life on earth.\"\n -http://people.hofstra.edu/faculty/J_B_Bennington/137notes/taphonomy.html\n \n \nThird, they promote natural selection and genetic mutations as the vehicles by which evolutionary change is brought about, while admitting that the odds against these things occurring are astronomically impossible.\n\n \n Well, your argument here is a glorious piece of misrepresentation. You say that\n \n \nHuxley continues with his defense of natural selection by saying, \"....(natural selection) operates with the aid of time to produce improvements in the machinery of life, and in the process generates results of a more than astronomical improbability which could have been achieved in no other way\" (Evolution in Action, p. 54-55). Don't miss the force of that last statement. Huxley states that the odds of natural selection occurring are \"astronomically improbable,\" but because Huxley sees no other way for it to have occurred, he believes in the astronomically improbable!\n\n \n He is quite clearly not saying in this statement that natural selection is astronomically improbable. He is in fact saying that natural selection achieves results which would otherwise be astronomically improbable.\n \n Your other quote from the same scientist merely demonstrates your lack of understanding:\n \n \nDoes natural selection give rise to genetic adaptation, or does genetic adaptation give rise to natural selection? Huxley contends that both of these things are true at the same time! Surely this is one of the most vacuous examples of circular reasoning to ever be perpetrated in the name of science.\n\n \n Well, if you study evolutionary theory, you find that indeed both of these things are true at the same time. This is what is termed a \"positive feedback loop\": In evolution, genetic adaptation (or rather, mutation) causes the changes which allow natural selection to weed out whichever changes do not work in that particular environment. The two phenomena are two sides of the same coin.\n \n [QUOTE]what we are able to conclude from the genetic testing of the Neanderthal man was that the evolution charts were just an exercise in pseudoscience, where anatomical and physiological similarities were used to infer that the Neanderthal man was once our forefather. It's obvious now that the initial inference was baseless. And if that inference was wrong, how many of the other evolutionary inferences that we've been force-fed since the first grade are also wrong? We can study science in the form of physiology, paleontology, and biology, but it ceases to become good science when ill-advised inferences are made.[/QUOTE}\n \n Indeed, the idea that Neanderthal man was our ancestor was a mistake, but of course this was only a THEORY at the time, which is the marvellous thing about science, it quite happily changes tack when enough evidence is presented to the contrary. However, while there is only a very disparate collection of sources of evidence FOR evolution, there is no evidence directly AGAINST it, no matter what creationists would have us believe. This is why we go on studying it.\n \n You also mention in passing the \"punctuated equilibrium\" theory. This is the theory that in any extremely complex system, things go along pretty much as they are, with continuous small changes, then suddenly you get a massive change which redefines the entire system, which you cannot predict. This has been proven to be the case in countless experiments, both in pure maths and in the real world (for example populations of wild animals, stock market crashes etc). It is not hard to see how this relates to evolution, and even (dare I speculate?) the transition from the chemical environment on early earth to evolving life.\n \n Finally, you keep saying things like \"Well evolution is the sort of thing you have to believe in when you don't believe in God.\"\n No one BELIEVES in evolution, it is a scientific THEORY which at the moment is the best way we have of describing what available evidence we have. It does not involve belief, it involves looking at facts and proposing ideas. \n The reason people defend it so passionately when the religious community tries to disprove it, is because the religious community never has any good evidence to show that evolution HAS NOT happened, they just rely on poking holes in a very new and very complex science.", 
   {
    "post_info": {
     "post_title": "Response to Easyrider"
    }
   }, 
   155833, 
   null, 
   1124474280.0
  ], 
  [
   155862, 
   null, 
   "johnhanks", 
   "I don't know where the alleged scientists you quote get these probabilities from...\n\n \n Welcome Liminus. Excellent post.\n \n The probablilty easyrider quotes comes from Scientific American, August 1954. George Wald calculated the probability of an enzyme forming spontaneously by all of its amino acids happening to collide in the right order: absurdly small, obviously. Easyrider cannot apparently grasp the notion that no contemporary theory of abiogenesis incorporates such an event.", 
   {}, 
   155834, 
   null, 
   1124489220.0
  ], 
  [
   155894, 
   null, 
   "Liminus", 
   "Aha, I suspected it would be something like that. It usually is with the new breed of religious \"scientists\". I once had an argument with a guy in the street who was trying to tell me there was evidence in the bible that man coexisted with dinosaurs! The sad thing was, he was a really intelligent, knowlageable guy, but everything he said was skewed toward proving his religion.\n Cheers for the info!", 
   {}, 
   155862, 
   null, 
   1124501700.0
  ], 
  [
   155927, 
   null, 
   "DamEtel", 
   "Welcome Liminus. Excellent post.\n \n The probablilty easyrider quotes comes from Scientific American, August 1954. George Wald calculated the probability of an enzyme forming spontaneously by all of its amino acids happening to collide in the right order: absurdly small, obviously. Easyrider cannot apparently grasp the notion that no contemporary theory of abiogenesis incorporates such an event.\n\n \n I've argued against Creationists who quote scientists saying that hemoglobin could not have formed naturally - or more precisely, that the odds against hemoglobin forming by chance is 1 in 10 to some ungodly number. They can offer multiple such calculations against the chance arising of hemoglobin. \n \n Now read Behe: he says that the case for design in hemoglobin is weak. Why? Because Behe knows that nature got to start with a very similar protein, myoglobin. Going from myoglobin to hemoglobin is not insurmountable for evolution, according to Behe.\n \n Picking a particular extant protein and calculating the probability of it arising by chance is meaningless. Modern proteins didn't spring into existence de novo by pure random chance. They evolved from similar, less complex proteins. And that step is not too large for evolution, and neither is the preceeding one, and so on.", 
   {}, 
   155862, 
   null, 
   1124518620.0
  ], 
  [
   155937, 
   null, 
   "johnhanks", 
   "Modern proteins didn't spring into existence de novo by pure random chance. They evolved from similar, less complex proteins. And that step is not too large for evolution, and neither is the preceeding one, and so on.\n\n \n As I said in an earlier post: creationists hate incremental processes. They blow their ridiculous probability calculations out of the water.", 
   {}, 
   155927, 
   null, 
   1124526540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Faith & Non-existence of God (For toby)", 
  "url": "http://www.4forums.com/political/religion-debates/6196-faith-non-existence-god-toby.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 6196, 
  "discussion_files": [
   [
    "21982.html", 
    "http://www.4forums.com/political/religion-debates/6196-faith-non-existence-god-toby-print.html"
   ], 
   [
    "21983.html", 
    "http://www.4forums.com/political/religion-debates/6196-faith-non-existence-god-toby-5-print.html"
   ], 
   [
    "21984.html", 
    "http://www.4forums.com/political/religion-debates/6196-faith-non-existence-god-toby-4-print.html"
   ], 
   [
    "21985.html", 
    "http://www.4forums.com/political/religion-debates/6196-faith-non-existence-god-toby-3-print.html"
   ], 
   [
    "21986.html", 
    "http://www.4forums.com/political/religion-debates/6196-faith-non-existence-god-toby-2-print.html"
   ]
  ], 
  "identifier": 6196
 }
]