[
 [
  [
   155495, 
   null, 
   "pandion", 
   "Evangelical Scientists\n \n More evidence that scientists are flocking away from the lie of evolutionism! :)", 
   {
    "post_info": {
     "post_title": "New research by evangelical scientists"
    }
   }, 
   null, 
   null, 
   1124293440.0
  ], 
  [
   155500, 
   null, 
   "joebrummer", 
   "Evangelical Scientists\n \n More evidence that scientists are flocking away from the lie of evolutionism! :)\n\n \n \n Intelligent Falling? Is this a joke? These people cannot be serious?\n \n I drop my coffee on my lap, and it falls because god pushed it there......that is hilarious.", 
   {}, 
   155495, 
   null, 
   1124295060.0
  ], 
  [
   155507, 
   null, 
   "Kronus", 
   "Intelligent Falling? Is this a joke? These people cannot be serious?\n \n I drop my coffee on my lap, and it falls because god pushed it there......that is hilarious.\n\n \n Yes, it's a joke. The Onion is a satire paper.", 
   {}, 
   155500, 
   null, 
   1124298660.0
  ], 
  [
   155508, 
   null, 
   "joebrummer", 
   "Yes, it's a joke. The Onion is a satire paper.\n\n \n \n Thank god, somebody told me that.....I was starting to lose faith in reality for a second.", 
   {}, 
   155507, 
   null, 
   1124298660.0
  ], 
  [
   155516, 
   null, 
   "gnojek", 
   "I love The Onion. \n They've done it again! emoticon_smile", 
   {}, 
   155508, 
   null, 
   1124301900.0
  ], 
  [
   155582, 
   null, 
   "OccamsRazor", 
   "Yes, it's a joke. The Onion is a satire paper.\n\n \n *phew* And I thought there really were dolphins with opposable thumbs emoticon_xclown", 
   {}, 
   155507, 
   null, 
   1124330940.0
  ], 
  [
   155594, 
   null, 
   "Matthew S", 
   "I actually was going to comment on this until I saw the onion website tag. \n \n If you like this Type of satire here is another site to get the giggles from.\n \n http://www.landoverbaptist.org/\n \n \n Love this site emoticon_xgood", 
   {}, 
   155582, 
   null, 
   1124334540.0
  ], 
  [
   155879, 
   null, 
   "gnojek", 
   "Oh, i must agree.\n \n The hilarity!\n \n I love LandoverBaptist!!\n \n Everyone MUST browse the forum:\n http://www.landoverbaptist.net/forums/", 
   {}, 
   155594, 
   null, 
   1124493960.0
  ], 
  [
   155880, 
   null, 
   "gnojek", 
   "http://www.landoverbaptist.org/news0605/flyingdinos.html\n \n\n New Evidence Suggests Noah's Sons Rode Flying Dinosaurs\n \n For years, Creation Scientists have disputed how Noah was able to quickly collect millions of indigenous animals from remote, inaccessible regions of the world for a 40-day ride in his ark. New evidence from an archeological find in China supports the long held Christian belief that Noah's sons rode giant flying dinosaurs to transport duck billed platypuses from Australia, and penguins and polar bears from the Antarctic, to name a few. \"Those must have been some mighty big flying dinosaurs,\" says Pastor Deacon Fred. \"Imagine the look on Noah's face when his sons flew in for a landing with a pair of Hippos strapped to the back of one of them things! Glory to God!\" \n \n \"The Lord is just amazing,\" says Creation Scientist, Dr. Jonathan Edwards. \"Whenever Atheist scientists make a new find, they think it will hack away at our Christian beliefs. They must get pretty peeved at how sneaky our Lord is, because whenever they unearth something, it only provides more support for the historical accuracy of the Holy Bible And these flying dinosaurs they keep finding are no exception!\"\n \n Dr. Edwards explains that it would have been impossible for Noah's sons to travel to the four corners of the earth to areas that were previously inaccessible on foot. \"Noah and his sons had to collect two of every single creature on the face of the planet,\" he says. \"We're talking about a big haul here. At first we just attributed it to what Creation Scientists call, the Holy Finger Snapping Theory. That's where God snaps his fingers and just makes it so.\" Edwards points out that Creation Scientists are still unanimous in attributing the fact that Noah was able to load 100 million plus animals onto a 450 foot ark \"in the selfsame day\" (Genesis 7:13-14) to the Finger Snapping Theory. In the case of how the animals were collected from remote regions of the world in the first place however, recent archeological finds indicate that Noah's sons were able to tame giant flying dinosaurs and in turn, load them up with food supplies and hitch rides for long trips around the world to China, South America, Australia, Greenland, and the North Pole. \n \n Creation Scientists estimate that since the Earth is only ten-thousand years old, human beings were living among dinosaurs and had plenty of time to tame them. \"I would have loved to have been around to see Cain and Abel rolling around in the grass outside the Garden of Eden playing with the pet raptors their father, Adam, gave them for their birthdays,\" says Pastor Deacon Fred. \"What a glorious time that must have been!\"\n \n Through tithing donations from Landover Baptist Church members, the Center for Creation Research was able to secure several fossilized remains of flying dinosaurs valued at over $14 million. The remains will be studied exhaustively for evidence of the leather harnessing used to secure Noah's sons for their long transcontinental journeys.\n", 
   {}, 
   155879, 
   null, 
   1124494680.0
  ], 
  [
   156017, 
   null, 
   "Nidder1", 
   "A post to the Onion, how hilarious.\n I suppose one of you jokers can tell me what came first then, the chicken or the egg?", 
   {
    "post_info": {
     "post_title": "Hilarious"
    }
   }, 
   155880, 
   null, 
   1124579460.0
  ], 
  [
   156020, 
   null, 
   "DamEtel", 
   "A post to the Onion, how hilarious.\n I suppose one of you jokers can tell me what came first then, the chicken or the egg?\n\n \n The egg, of course.", 
   {}, 
   156017, 
   null, 
   1124580840.0
  ], 
  [
   156021, 
   null, 
   "Nidder1", 
   "The egg, of course.\n\n \n LOL. Layed by a lizard I suppose.", 
   {
    "post_info": {
     "post_title": "Egg?"
    }
   }, 
   156020, 
   null, 
   1124581320.0
  ], 
  [
   156023, 
   null, 
   "DamEtel", 
   "LOL. Layed by a lizard I suppose.\n\n \n Eggs predate even reptiles. \n \n There's no contest ... the egg came way before the chicken.", 
   {}, 
   156021, 
   null, 
   1124581620.0
  ], 
  [
   156026, 
   null, 
   "Nidder1", 
   "Yes, I was being sarcastic of course.\n \n You failed to mention where this miraculous egg came from?", 
   {
    "post_info": {
     "post_title": "egg?"
    }
   }, 
   156023, 
   null, 
   1124583000.0
  ], 
  [
   156037, 
   null, 
   "Symbiote", 
   "Clearly the only rational explanation is that it was laid by God.", 
   {}, 
   156026, 
   null, 
   1124588100.0
  ], 
  [
   156044, 
   null, 
   "trebor", 
   "Yes, I was being sarcastic of course.\n \n You failed to mention where this miraculous egg came from?\n\n \n And where do YOU say this miraculaos egg came from?? From GOd??\n \n Where did god come from?", 
   {}, 
   156026, 
   null, 
   1124589600.0
  ], 
  [
   156053, 
   null, 
   "DamEtel", 
   "You failed to mention where this miraculous egg came from?\n\n \n I didn't fail to do anything ... you failed to ask the question!\n \n \n \n What you DID ask was \"which came first, the chicken or the egg?\" I answered that question.\n \n Now you are moving the goalposts. As you should be well aware, I have absolutely no obligation, responsibility, or burden - by answering one question you asked - to follow your logic all over the place and answer every question you can dream up.", 
   {}, 
   156026, 
   null, 
   1124597340.0
  ], 
  [
   156069, 
   null, 
   "johnhanks", 
   "I suppose one of you jokers can tell me what came first then, the chicken or the egg?\n\n \n Posters in another thread have queried whether you actually understand anything about evolution. Since your follow-up posts to the above suggest that you meant the question seriously, I have to conclude that you do not. The\n \n \nLOL. Layed by a lizard I suppose.\n\n \n smacks of good old-fashioned creationist 'argument', along the lines of 'Show me a bird hatching from a lizard egg and I'll believe in evolution'. (Lizards are not, btw, ancestral to birds.)\n \n If you seriously want a biological answer to your question - or more accurately an explanation as to why it is biologically meaningless - say so and I will provide one. I am reluctant to waste board-space otherwise.", 
   {}, 
   156017, 
   null, 
   1124618880.0
  ], 
  [
   156076, 
   null, 
   "joebrummer", 
   "Clearly the only rational explanation is that it was laid by God.\n\n \n \n god lays eggs? The is interesting. Wouldn't that be painful?", 
   {}, 
   156037, 
   null, 
   1124637540.0
  ], 
  [
   156089, 
   null, 
   "Kronus", 
   "god lays eggs? The is interesting. Wouldn't that be painful?\n\n \n So could God create an egg so large that even he couldn't lay it?", 
   {}, 
   156076, 
   null, 
   1124649780.0
  ], 
  [
   156115, 
   null, 
   "wsm2506", 
   "I love The Onion. \n They've done it again! emoticon_smile\n\n \n Unfortunatley, there are many neanderthals here that do not understand \"satire\" and take it as \"gospel\": emoticon_rolleyes \n \n Several months ago, some neanderthal posted an atricle from \"The Onion\" about an awards ceremony for top producer in \"gay recruitment\". He ACTUALLY believed it!!!!!!!!!!!!!!!!!!!!!!!!!!  emoticon_rolleyes emoticon_rolleyes", 
   {}, 
   155516, 
   null, 
   1124670060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  New research by evangelical scientists", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6207-new-research-evangelical-scientists.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 6207, 
  "discussion_files": [
   [
    "31066.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6207-new-research-evangelical-scientists-print.html"
   ], 
   [
    "31067.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6207-new-research-evangelical-scientists-2-print.html"
   ]
  ], 
  "identifier": 6207
 }
]