[
 [
  [
   155624, 
   null, 
   "jsaid2009", 
   "Leaflets ridicule democracy, ask for Islamic rule\n \n Thursday August 18 2005 09:28:46 AM BDT\n \n \n Bombers under the letterhead of outlawed Jama'atul Mujahideen Bangladesh (JMB) spread leaflets during serial bombings across the country yesterday with a demand for establishing Islamic rule, failing of which they will go for counteroffensive against the authorities.\n \n \"We're the soldiers of Allah. We've taken up arms for the implementation of Allah's law the way Prophet, Sahabis and heroic Mujahideen have done for centuries,\" the so-called Islamist outfit said in the leaflets circulated at the bombing sites.\n \n It is one of the two extremist organisations recently banned by the government in the wake of violent acts allegedly committed by their activists, the other one being Jagrata Muslim Janata Bangladesh (JMJB) of so-called Bangla Bhai, now hiding. \n \n Chief of the JMB, Asadullah-al-Galib, a teacher at the Rajshahi University, is now in jail. \n \n One of the handbills procured from the Rajshahi city reads: we want to earn Almighty's satisfaction by establishing Khalis Tauhid (pure monotheism) by putting an end to bida't and want to make the people happy in the world here and hereafter.\n \n The leaflet says the JMB urged the government twice earlier to establish Islamic Hukumat (Islamic order), but every time the government arrested their workers. However, JMB did not resort to any retaliation. \n \n \"But this is the third appeal from JMB,\" the group said. If the government does not establish Islamic laws in the country after this third warning and, rather, it goes to arrest any Muslim on charge of seeking Allah's laws or it resorts to repression on Alem-Ulema, the JMB would go for counteraction, \"Inshallah\", the group warned.\n \n The JMB appealed to the members of parliament from both the treasury and the opposition benches to immediately introduce Islamic rule in the country burying all partisan disputes.\n \n They called the present democratic system a creation of 'kafer' (infidels) producing two groups--the government and the opposition, dividing the nation thereby. And this system gives right to enforce hartal and blockade to assume power, causing damage to public interest.\n \n \"Those who want to give institutional shape to democracy are the enemies of Islam,\" says the leaflet, adding that if they want 'hedayet (blessings) of Allah', both the government and the opposition should unitedly introduce Islamic law immediately by burying party conflicts.\n \n They called for shunning the evil Constitution and removing all 'shirks, bida't' and obscenity to implement Islamic rule in the country and allowing the people to perform Islam the correct way.\n \n \"But if you, being scared of Bush-Blair clique, don't have the courage to establish Islamic rule, quit the evil politics of democracy,\" they said. And then \"the Tauhidee janata will establish Islamic laws following the system of Sura (highest Islamic Consultative Committee) comprising Alem, Ulema, Masaek and Islamic scholars\".\n \n In an appeal to bureaucrats and judges, the JMB called for stopping administrative and judicial activities under what they called evil laws of democracy, constitution and the government that did not establish Islamic rule. \" Make your life worthy by gaining Allah's blessings by extending your all-out cooperation in establishing Islamic laws.\"\n \n \"Because, democracy is the product of evil power,\" it said. \"Democracy is the main weapon to establish evil forces in the world. This evil order allows the arrest of Mujahideen who are on Allah's path.'\n \n The leaflet also carries a call for all members of the armed forces, including army, BDR, police and Rab, to protect the laws of Allah instead of \"evil laws\" now prevailing in the country under the present constitution. \" Don't abide by evil laws, obey the laws of Allah,\" it says.\n \n \"Don't take arms under the evil laws against the soldiers of Allah. Give up your loyalty to evil power and join the force of Allah's soldiers,\" the self-styled sentinels of religion said with a note of caution that steps would be taken against those who would not cease loyalty to 'evil power.' \n \n \"Allah says those who are faithful fight for the cause of Allah. On the contrary, the kafers fight for evil forces,\" the JMB said.\n \n In a separate appeal to world Muslims, they said the \"biggest terrorist\" of present world is George W Bush who launches attack on innocent Muslims by resorting to terrorism and tries to make the Muslim nonbelievers by forcibly imposing \"Kufri (evil) Constitution\".\n \n \"They want to bring the whole world under their control through a new world order by establishing Kufri concept of democracy. It seems to be a neo-Pheraoni ambition,\" the leaflet stated, \" but soldiers of Allah will not allow their ambition to come true and establish Kufri concept of democracy. \n \n They lamented that those who take arms for the cause of Allah are branded as militants and terrorists. But Almighty Allah says \"Hey believers! Pick up your own arms and come out in battalions separately or unitedly\".\n \n \"Therefore, it is our appeal to world Muslims, you compel your government in your respective Muslim country to implement Allah's rules. Quit Kufri United Nations and form Muslim United Nations and strengthen the Muslim ummah.\"\n \n Administering a note of caution for 'Kafers and Mushriks', the JMB urged the Bush-Blair duo to quit their occupation of Muslim countries. \"The Muslims across the world are rising up. If you don't stop repression forthwith, you will not be allowed to live in safety anywhere in the world.\"\n \n The group asked anti-Islam NGOs to stop activities against Islam. \"Otherwise, you will be uprooted.\" \n \n http://www.bangladesh-web.com/news/view.php?hidDate=2005-08-18&hidType=TOP&hidRecord=57090\n \n See also: http://groups.yahoo.com/group/khilafism/message/1294 \n The Fascism of Sharia: Imrana rape case sparks outrage over Islamic laws \n \n See also: http://groups.yahoo.com/group/khilafism/message/1312 \n The Myth of Islamic olerance \n See also: http://groups.yahoo.com/group/khilafism/message/1290 Ayodhya Temple Attack: 6 Terrorists Killed in Failed Terror Attack \n \n See also: http://groups.yahoo.com/group/khilafism/message/1288 The Fascism of Sharia: Fatwa Against Rape Victim Angers Secular India \n \n See also: http://groups.yahoo.com/group/khilafism/message/1279 The Fascism of Shariah: Courageous Woman raped by father-in-law refuses to obey Shariah ruling \n \n See also: http://groups.yahoo.com/group/khilafism/message/1276 The Fascism of Sharia: Secular outcry results in arrest of father-in-law rapist \n \n See also: http://groups.yahoo.com/group/khilafism/message/1275 The Fascism of Sharia: Rape victim forced to marry her father-in-law rapist \n \n See also: http://groups.yahoo.com/group/khilafism/message/1272 Major Terror Attack at IGI Airport Averted with minutes to spare \n \n See also: http://groups.yahoo.com/group/khilafism/message/1261 Tolerance and Pluralism: Muslim converts to Christianity face persecution and death in Bangladesh \n \n See also:\n http://groups.yahoo.com/group/khilafism/message/1256\n Terrorists Target Christian School in Kashmir\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/1129\n Exploding dog in Kashmir wounds four\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/951\n 22 Hindu houses torched, robbed\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/937\n Rape victim marries her rapist to avoid Muslim shun\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/887\n Woman beheaded in Kashmir by Islamic Terrorists\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/885\n The Fascism of Sharia: Indian Muslim women fight\n instant divorce\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/859\n Woman's ears and nose chopped off by Kashmiri\n terrorists\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/850\n Kashmir Terrorists Bomb Hospital, Behead Three\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/845\n Indian Muslims fight for shariah law to allow pre-teen\n marriages\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/804\n Muslims sliced off the nose, ears and tongue of a\n 14-year-old girl\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/750\n Brave Mujahadeen kill sleeping women and children in\n Kashmir\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/627\n Muslim bigots continue pressure to ban Ahmadiyyans in\n Bangladesh\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/434\n Actions against India to continue: Jihad Council\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/34\n Pakistan's Terror Economy accounts for 6.6 per cent of\n GDP\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/27\n Islamism: Dirty little secrets", 
   {
    "post_info": {
     "post_title": "The Fascism of Shariah: Serial Bombers Distribute leaflets ridiculing democracy"
    }
   }, 
   null, 
   null, 
   1124373660.0
  ], 
  [
   155628, 
   null, 
   "gamehuis", 
   "The Founding Fathers didn't like democracy either, because democracy is basically mob rule and has nothing to do with freedom, liberty or happiness...", 
   {}, 
   155624, 
   null, 
   1124376120.0
  ], 
  [
   155640, 
   null, 
   "Eddie", 
   "Soooo... what do you want to discuss?", 
   {}, 
   155624, 
   null, 
   1124381940.0
  ], 
  [
   155641, 
   null, 
   "gamehuis", 
   "Soooo... what do you want to discuss?\n\n Probably the usual: Islam is teh evil!!!1@22111!one!1@@2", 
   {}, 
   155640, 
   null, 
   1124382660.0
  ], 
  [
   155653, 
   null, 
   "Eddie", 
   "Probably the usual: Islam is teh evil!!!1@22111!one!1@@2\n\n \n Yeah, I guess... To bad. These type of posts are getting a bit of boring (posting of an article with no \"personal\" questions or claims attached)", 
   {}, 
   155641, 
   null, 
   1124389080.0
  ], 
  [
   155690, 
   null, 
   "Raastee", 
   "Yeah, I guess... To bad. These type of posts are getting a bit of boring (posting of an article with no \"personal\" questions or claims attached)\n\n i dont know ...have you read the Koran lately...evil.", 
   {}, 
   155653, 
   null, 
   1124405160.0
  ], 
  [
   155701, 
   null, 
   "gnojek", 
   "Yeah, the Bible gives me the willies too.", 
   {}, 
   155690, 
   null, 
   1124406240.0
  ], 
  [
   155709, 
   null, 
   "Eddie", 
   "i dont know ...have you read the Koran lately...evil.\n\n \n I don`t think it has changed that much in the past few years ;)\n \n Allthough I fail to see the relevance. My comment was regarding the style of posting. If the thread creator wanted to discuss the alledged evil-ness of the Koran, he could at least have made a claim about it (or better yet, thrown out a couple of questions).", 
   {}, 
   155690, 
   null, 
   1124407140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Fascism of Shariah: Serial Bombers Distribute leaflets ridiculing democracy", 
  "url": "http://www.4forums.com/political/current-events-debates/6213-fascism-shariah-serial-bombers-distribute-leaflets-ridiculing-democracy.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6213, 
  "discussion_files": [
   [
    "13240.html", 
    "http://www.4forums.com/political/current-events-debates/6213-fascism-shariah-serial-bombers-distribute-leaflets-ridiculing-democracy-print.html"
   ]
  ], 
  "identifier": 6213
 }
]