[
 [
  [
   8428, 
   null, 
   "kelvin90701", 
   "Brady Website:\n \n Not a single suit against the gun industry has been deemed frivolous; many have been successful. Even if someone were to file a frivolous lawsuit, the case would be dismissed and the lawyers could be sanctioned for abusing the legal system under current law.\n \n http://www.gunlawsuits.org/immunity/truth.asp\n \n Check yourself if the above statement holds water:\n \n http://www.freedom.org/prc/news/19991201/15.html\n http://www.ci.chi.il.us/Mayor/news_speeches_judge.html\n \n This one is a real winner:\n http://www.ralphdsherman.com/Press%20archive/2000-06-26%20Hartford%20Courant.htm\n \n Pointed a weapon at a person and pulled the trigger and he claimes it was not his fault.", 
   {
    "post_info": {
     "post_title": "A lie or truth?  You judge."
    }
   }, 
   null, 
   null, 
   1053993960.0
  ], 
  [
   8560, 
   null, 
   "Stormin Norman", 
   "Would you expect the Brady Center to do anything but lie to you Kelvin? Just as I hate and fear socialists/communists, I hate those gun-grabbers that try to persuade me into giving up a right as important as the 2nd amendment, with such weak argumentation, I might add. Logically, those socialists that wish to destroy property rights, and the legal system that upholds such values, are often the same people who suggest that you relinquish your right to bear arms. The reason for this is simple. Without an armed population, it will be much easier to apply the totalitarian measures that they promote. Fear anyone who claims to have your best interest in mind, unless it's yourself.", 
   {}, 
   8428, 
   null, 
   1054280160.0
  ], 
  [
   8658, 
   null, 
   "kelvin90701", 
   "Originally posted by Stormin Norman \n  Without an armed population, it will be much easier to apply the totalitarian measures that they promote. Fear anyone who claims to have your best interest in mind, unless it's yourself. \n\n \n Until a few days ago I thought communist had learned thier lesson from Stalin and would try to prevent authoritarian governments. No, modern communist still recognize the need for strong authority to establish a communist state. Not only that, but there are stil Stalinist alive that not only want the return of brutal authority, and who dream of being at the top of a brutal government.", 
   {}, 
   8428, 
   null, 
   1054492020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A lie or truth?  You judge.", 
  "url": "http://www.4forums.com/political/gun-control-debates/622-lie-truth-you-judge.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 622, 
  "discussion_files": [
   [
    "9331.html", 
    "http://www.4forums.com/political/gun-control-debates/622-lie-truth-you-judge-print.html"
   ]
  ], 
  "identifier": 622
 }
]