[
 [
  [
   156253, 
   null, 
   "jyoshu", 
   "I found this to be an interesting article by a Democrat on religion and politics--a problem for the Democratic party that they have yet to solve.\n \n Dems Must Regain Faith of Religious Voters \n The premise of the Democracy Corps report is that many white, non-college voters have closed their minds to Democrats because of religious issues, and that the party can reach them only by changing the subject. I disagree. Following such a strategy will ensure that Democrats remain a minority party for a long time.\n \n To quote the study released by Democracy Corps, \"These focus groups (conducted in Appleton, Wis., Little Rock, Ark., Louisville, Ky., and Golden, Colo.) powerfully demonstrated that as Democrats seek to redefine their party...they face some hard truths. No matter how disaffected they are over Republican failures in Iraq and here at home, a large chunk of white non-college voters, particularly in rural areas, will remain simply unreachable for Democrats at the national level.\"\n \n The study continues, \"Furthermore, Republicans and their allies on the right have very effectively used their bully pulpit and their media echo chamber to define Democrats as weak on defense and security issues, hostile to religious faith and the role it plays in most Americans' lives, enamored with big government solutions to every problem, and obstructionists with no positive agenda or new ideas of their own.\" There is truth in what they say on all these issues, but their solution to the problem is very questionable.The Washington Post ran a story about this study the next day and Rush Limbaugh devoted a lengthy monologue to the report on his daily radio program. Just about everyone else yawned.As a Democrat who wants to see his party once again regain majority status, I'm not yawning. I'm paying very close attention. Democrats must find a way to speak to people of faith in this country. We aren't there yet, but we need to keep trying.\n \n During the time I have been writing this column, no subject has generated as many e-mails as the role of religion and morality in contemporary politics. Democrats believe in God and lead moral lives every bit as much as Republicans do. To suggest the contrary is simply a lie. But somehow, Republicans have equated any support for gay rights and a woman's right to choose an abortion with immorality.\n There's a lot that still isn't true in the article, but at least Democrats (particularly the gay-rights far-left variety) are starting to realize that they are going to have to stop giving religious people the impression that they hate them, and start admitting that there are other views in this country besides the gay rights one. There's no doubt gay lobbyists would just as soon not have to deal with religion, but they don't get that luxury. Religious people are here to stay, and they might as well get used to it.\n \n I think this issue goes even farther really--I think gay lobbyists are going to have to come to peace with the realization that not only democrats need to make peace with the Religious voters, but the gay lobby as well.", 
   {
    "post_info": {
     "post_title": "Dems (and gay lobby) Must Regain Faith of Religious Voters"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1124724780.0
  ], 
  [
   156261, 
   null, 
   "Wez", 
   "There's a lot that still isn't true in the article, but at least Democrats (particularly the gay-rights far-left variety) are starting to realize that they are going to have to stop giving religious people the impression that they hate them, and start admitting that there are other views in this country besides the gay rights one.\n\n *splutters*\n \n Democrats aren't trying to give \"religious people\" (many democrats are Christian, but don't let facts get in the way of things) the impression Democrats hate them. If \"religious people\" think the Democrats hate them, why is this so? Where are they getting that impression from? They're certainly not getting it from the mainstream democratic politicians.\n \n \nThere's no doubt gay lobbyists would just as soon not have to deal with religion, but they don't get that luxury. Religious people are here to stay, and they might as well get used to it.\n\n You can be gay and \"religious\". I expect most gays in the US are Christians in fact. Why wouldn't they want to deal with religion? It's part of their life.\n \n \nI think this issue goes even farther really--I think gay lobbyists are going to have to come to peace with the realization that not only democrats need to make peace with the Religious voters, but the gay lobby as well.\n\n Being gay and being religious aren't mutually exclusive.\n \n -Wez", 
   {}, 
   156253, 
   null, 
   1124727960.0
  ], 
  [
   156263, 
   null, 
   "Jaxian", 
   "It is politics, to be certain. In order to gain support in a democracy, you must appeal to as many people as possible, and you must not offend them, no matter how much they offend you. It is easier when you enter with the outlook that almost everyone is a good person; almost everyone wants to help people and do the right thing. It's just that people do not always understand what the right thing is.", 
   {}, 
   156261, 
   null, 
   1124728380.0
  ], 
  [
   156284, 
   null, 
   "Matthew S", 
   "I found this to be an interesting article by a Democrat on religion and politics--a problem for the Democratic party that they have yet to solve.\n \n Dems Must Regain Faith of Religious Voters \n The premise of the Democracy Corps report is that many white, non-college voters have closed their minds to Democrats because of religious issues, and that the party can reach them only by changing the subject. I disagree. Following such a strategy will ensure that Democrats remain a minority party for a long time.\n \n To quote the study released by Democracy Corps, &#8220;These focus groups (conducted in Appleton, Wis., Little Rock, Ark., Louisville, Ky., and Golden, Colo.) powerfully demonstrated that as Democrats seek to redefine their party&#8230;they face some hard truths. No matter how disaffected they are over Republican failures in Iraq and here at home, a large chunk of white non-college voters, particularly in rural areas, will remain simply unreachable for Democrats at the national level.&#8221;\n \n The study continues, &#8220;Furthermore, Republicans and their allies on the right have very effectively used their bully pulpit and their media echo chamber to define Democrats as weak on defense and security issues, hostile to religious faith and the role it plays in most Americans&#8217; lives, enamored with big government solutions to every problem, and obstructionists with no positive agenda or new ideas of their own.&#8221; There is truth in what they say on all these issues, but their solution to the problem is very questionable.The Washington Post ran a story about this study the next day and Rush Limbaugh devoted a lengthy monologue to the report on his daily radio program. Just about everyone else yawned.As a Democrat who wants to see his party once again regain majority status, I&#8217;m not yawning. I&#8217;m paying very close attention. Democrats must find a way to speak to people of faith in this country. We aren&#8217;t there yet, but we need to keep trying.\n \n During the time I have been writing this column, no subject has generated as many e-mails as the role of religion and morality in contemporary politics. Democrats believe in God and lead moral lives every bit as much as Republicans do. To suggest the contrary is simply a lie. But somehow, Republicans have equated any support for gay rights and a woman&#8217;s right to choose an abortion with immorality.\n There's a lot that still isn't true in the article, but at least Democrats (particularly the gay-rights far-left variety) are starting to realize that they are going to have to stop giving religious people the impression that they hate them, and start admitting that there are other views in this country besides the gay rights one. There's no doubt gay lobbyists would just as soon not have to deal with religion, but they don't get that luxury. Religious people are here to stay, and they might as well get used to it.\n \n I think this issue goes even farther really--I think gay lobbyists are going to have to come to peace with the realization that not only democrats need to make peace with the Religious voters, but the gay lobby as well.\n\n \n \n So where do gay people go to have their voices heard? Oh thats right we are to be seen and not heard go back into our closets. The days of the closets are over. Give liberty or give me death I will not comprimise my life. \n \n I would be very carefull in what you ask for you could find yourself in a christian nation. Remember the last time witch trials, inquistions. You say it could not happen here wrong. The republicans are toying with the idea of court stripping which means that they pass acts that federal courts can not hear certain cases, or they do away with the federal courts. So here is a senerio for you. Democrats and Republicans make up to these \"religious people\" and the religious people want a law passed saying that all people in the nation have to be christian and must attend a christian church. All the congress people think this is a good idea, after all they have made up to and want the christians support and because the majority of americans are christians.. The congress seeing seeing that say a muslim or a buhdist may not be too happy having to worship in a christian church pass a judcial review act saying this type of case can not behaerd in the federal courts. There is no place for the muslim or the buhdist to turn even though the constitution garentees their religious freedom. \n \n \n Btw this has just recently happend on a different subject.\n http://thomas.loc.gov/cgi-bin/query/z?c108:H.R.3313:\n \n DOMA the congress seeks to take away my rights to sue in federal court.", 
   {}, 
   156253, 
   null, 
   1124736600.0
  ], 
  [
   156311, 
   null, 
   "Captain America banned", 
   "\n \n There's a lot that still isn't true in the article, but at least Democrats (particularly the gay-rights far-left variety) are starting to realize that they are going to have to stop giving religious people the impression that they hate them, and start admitting that there are other views in this country besides the gay rights one. \n\n \n My observations lead me to conclude that it is the intolerant religious right that is capitolizing on and spreading the hate. The dems are just trying to get a little love and acceptance spread around and that really pl$$es those religious people off. I have to agree that the dems could sure use their votes but if I was a democrat, I would distance myself as far away from these religious nuts as I possibly could. Let the republicans pander to them. The religious are only being used to begin with. They have been played like a predictable fiddle. I'd rather see that placed on the shoulders of the republicans. It won't be long until those religious voters realize they were duped by the rightwing republicans. In fact, every day we read more and more about how the religious are finally waking up to what the Bush administration is all about. And they aren't too happy about it.\n \n I think it's poetic justice myself. Neener, neener! :p :p", 
   {}, 
   156253, 
   null, 
   1124742480.0
  ], 
  [
   156318, 
   null, 
   "biccat", 
   "Btw this has just recently happend on a different subject.\n http://thomas.loc.gov/cgi-bin/query/z?c108:H.R.3313:\n \n DOMA the congress seeks to take away my rights to sue in federal court.\n\n Care to explain how you came to that conclusion?", 
   {}, 
   156284, 
   null, 
   1124744040.0
  ], 
  [
   156337, 
   null, 
   "Matthew S", 
   "Care to explain how you came to that conclusion?\n\n \n Below is the act. \n \n \n A BILL\n \n To amend title 28, United States Code, to limit Federal court jurisdiction over questions under the Defense of Marriage Act. \n \n Be it enacted by the Senate and House of Representatives of the United States of America in Congress assembled,\n \n SECTION 1. SHORT TITLE.\n \n This Act may be cited as the `Marriage Protection Act of 2003'.\n \n SEC. 2. LIMITATION ON JURISDICTION.\n \n (a) IN GENERAL- Chapter 99 of title 28, United States Code, is amended by adding at the end the following:\n \n `Sec. 1632. Limitation on jurisdiction\n \n `No court created by Act of Congress shall have any jurisdiction, and the Supreme Court shall have no appellate jurisdiction, to hear or determine any question pertaining to the interpretation of section 1738c of this title or of this section. Neither the Supreme Court nor any court created by Act of Congress shall have any appellate jurisdiction to hear or determine any question pertaining to the interpretation of section 7 of title 1.'.\n \n (b) AMENDMENT TO TABLE OF SECTIONS- The table of sections at the beginning of chapter 99 of title 28, United States Code, is amended by adding at the end the following new item:\n \n `1632. Limitation on jurisdiction.'.\n \n \n This means that if I get married to a man in a state that currently alows same sex marriage I can not sue in federal court to challenge DOMA. Hence if I can not sue in federal court I can not bring a DOMA challenge to the SCOTUS. My 1st admendment rights are being denied\n \n Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.", 
   {}, 
   156318, 
   null, 
   1124747520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Dems (and gay lobby) Must Regain Faith of Religious Voters", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6235-dems-gay-lobby-must-regain-faith-religious-voters.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6235, 
  "discussion_files": [
   [
    "6910.html", 
    "http://www.4forums.com/political/gay-rights-debates/6235-dems-gay-lobby-must-regain-faith-religious-voters-print.html"
   ]
  ], 
  "identifier": 6235
 }
]