[
 [
  [
   156756, 
   null, 
   "billsco", 
   "Recently, the huge labor union AFL-CIO was unable to avoid rending itself in two over what direction to pursue for its future viability. One faction wanted to continue to focus its energy and resources in the political sphere, the dissenting faction wanted new recruitment to be the primary thrust.\n \n This latter faction is what interests me, since by \"new recruitment\" it means specifically an attempt to unionize Wal-Mart workers. \n \n What should we make of this renegade movement? Is it short-lived, or is it a force to be reckoned with? \n \n Let me say here that I am not very keen on the concept of unions.\n \n As for the split, in my opinion it is a huge error in judgement to have left the fold. Wal-Mart has effectively sliced its \"enemy\" in two before the battle is engaged. I don't think the fight to unionize the top retailer is one that can be won, nor will the tactic ingratiate itself with most most Americans. Why would it? What's in it for me except higher prices for everyday household items?\n \n This is the trouble with unions to my way of thinking. It tries to give an unfair advantage to its members at the direct expense of non-union wage earners. I would effectively be paying their higher wages, would I not? Are we not all better off with the current scheme of things, having a store where the lowest prices for basic necessities are available to everyone?\n \n Parenthetically, unions have benefitted handsomely from the rise of Wal-Mart. All the stores it has built and will build are union contracted.\n \n Your thoughts about the split and about the new direction and emphasis?", 
   {
    "post_info": {
     "post_title": "Labor Unions New Direction?"
    }
   }, 
   null, 
   null, 
   1124901900.0
  ], 
  [
   156806, 
   null, 
   "jim's trucking", 
   "Recently, the huge labor union AFL-CIO was unable to avoid rending itself in two over what direction to pursue for its future viability. One faction wanted to continue to focus its energy and resources in the political sphere, the dissenting faction wanted new recruitment to be the primary thrust.\n \n This latter faction is what interests me, since by \"new recruitment\" it means specifically an attempt to unionize Wal-Mart workers. \n \n What should we make of this renegade movement? Is it short-lived, or is it a force to be reckoned with? \n \n Let me say here that I am not very keen on the concept of unions.\nLet me say here that I am not very keen on the existence of unions. Thanks for getting my blood pressure up a bit. I needed some excitement today.\n \n Labor unions SUCK! They have fulfilled their basic worthwhile cause of defeating child labor practices and raising the pay scales of the working masses, but their methods now seem to damage the economy and individual businesses rather than help the overall labor situation.\n \n Today's unions are no better than the Evangelical Preacher Programs wherein people contribute to the high-on-the-hog living standards of the fundraisers. Union fat cats ride around in Cadillacs, wearing $1000 Armani suits, telling the working masses that they are benefitting from union activities and that they are getting their money's worth from the union dues they pay to be a member of the chosen ones. In truth, unions have cost this country more than most people can imagine. Work stoppages for stupid reasons cost industries billions of dollars. Strikes (during which the union members get some of their own money back) cost billions of dollars. Stupid union practices akin to railroad featherbedding cost billions of dollars.\n \n The idiotic baseball strike some time back and the idiotic hockey strike (lockout) recently are just two examples of union's abilities to hurt all people connected to certain businesses. How many hotdog vendors, tee-shirt salesmen, ticket scalpers, concession workers, parking attendants, stadium works, hotel workers, taxi drivers, policemen, etc were financially hurt by these two idiotic strikes? Here we have baseball players making millions of dollars a year striking for more benefits, overpayed hockey players striking for more benefits.\n \n And all the while, the union fat cats are fighting for power so they have the Cadillacs and the suits at the worker's expense.\n \n \n \n \n\n As for the split, in my opinion it is a huge error in judgement to have left the fold. Wal-Mart has effectively sliced its \"enemy\" in two before the battle is engaged. I don't think the fight to unionize the top retailer is one that can be won, nor will the tactic ingratiate itself with most most Americans. Why would it? What's in it for me except higher prices for everyday household items?\n \n This is the trouble with unions to my way of thinking. It tries to give an unfair advantage to its members at the direct expense of non-union wage earners. I would effectively be paying their higher wages, would I not? Are we not all better off with the current scheme of things, having a store where the lowest prices for basic necessities are available to everyone?\n \n Parenthetically, unions have benefitted handsomely from the rise of Wal-Mart. All the stores it has built and will build are union contracted.\n \n Your thoughts about the split and about the new direction and emphasis?\nThe split is welcomed by me. Any split in the union machine is welcomed by me. The disappearance of the unions would be welcomed by me. Not only do we pay higher prices because of unions, we suffer complete shutdowns of some parts of local economies when the unions become even greedier.\n \n Unions have outlived their usefulness and should disappear from the earth. The government has established minimum wages and has laws to punish child labor users. This is all we need in the way of labor protection.\n \n A fair day's pay for a fair day's work is not that hard to get...even without the help of some highly paid representative and his unnecessary staff.", 
   {}, 
   156756, 
   null, 
   1124916540.0
  ], 
  [
   156879, 
   null, 
   "gnojek", 
   "Come on!\n \n We need to unionize the illegal immigrants!!\n \n They're being exploited!! \n \n \n :)", 
   {}, 
   156806, 
   null, 
   1124933880.0
  ], 
  [
   156884, 
   null, 
   "lord tammerlain", 
   "Unions are a sign of capitalism and free market economics.\n \n Assume each union member is a small business person/capitaltists ( after all they have invested in themselves have they not) with the service being offered is his/her labour. By \"paying\" for an agent to negotiate prices for his/her labour, in cooperation with other small business people, each business person can possible increase their revenues and profit for their services.\n \n Making Unions a usefull tool for millions of small time capitalists,", 
   {}, 
   156879, 
   null, 
   1124936040.0
  ], 
  [
   156996, 
   null, 
   "Eddie", 
   "I don`t know much about the US labour unions or movement so I`m probably not in position to comment on the specific situation. However, I find the US attitude towards labour unions very interesting and I think it just might be one of the more important explanations of the economic and political differences between continental europe (inlcuding Scandinavia) and the anglo-saxon countries (most specificly the US). Heck, the difference in attitude and the power position of labour unions might even explain crucial differences between the US and the UK ,the most immediate difference that comes to mind would be the lack of a (strong) social democratic party in the US.\n \n Personally, I regard (strong) labour unions as vital economic and political institions, responsible for migating and counteracting the worst aspects of capitalism (wealth concentration). To me, it is apparant that the massive wealth- and income disparity, unprecedented in any other western economy, is predominantly caused by anti-union legislation/lack of pro-union legislation that has resulted in a virtually powerless union movement. The attempts to curb this through a steeply progressive taxation and minimum wages seem to me like political illusions crafted in order to placate the US working class. Roughly like the myth of the \"american dream\".", 
   {}, 
   156884, 
   null, 
   1124990520.0
  ], 
  [
   157043, 
   null, 
   "Bassman", 
   "Boy, am I so glad someone brought up this subject. I agree that unions have long been problematic. Not only have they gotten too powerful too fast but they are definately not politically neutral. I am particularly disgusted by the situation here in New York State. The State's largest Union, SEIU 1199 has a stranglehold on the Politicians in Albany. They oppose any reform of the state's Medicaid program, and, to top it off, the Albany Clowns authorized an $80 million payout to the union. Boy, talk about serious payola.", 
   {
    "post_info": {
     "post_title": "Unions and Municipal Governments"
    }
   }, 
   156996, 
   null, 
   1125005400.0
  ], 
  [
   157071, 
   null, 
   "Jo Bennett", 
   "I find all this bile against unions bizarre. Unions may be a bit different in the US but I find that difficult to believe. The low level of the minimum wage in the US and the number of people working for or marginally above it speaks to me of the need for strong trade unions. Raising wages for the low paid is more beneficial to the economy that almost anything else, because the money goes back into the economy almost instantly, it also removes some of the need for state benefits, as wages are actually livable on. If wages are not livable on then the government is forced to effectively subsidise those companies who refuse to pay a living wage, or people end up in debt or working themselves to death to try and pay the bills.\n \n I'm not so keen on amalgamated trade unions, I think smaller unions are much more responsive to the needs of their members. I think the US needs legislation like we have in the UK forcing companies to recognise trade unions where their employees want it, and forbidding firing people for undertaking lawful trade union activity.", 
   {}, 
   157043, 
   null, 
   1125010020.0
  ], 
  [
   157107, 
   null, 
   "lord tammerlain", 
   "Boy, am I so glad someone brought up this subject. I agree that unions have long been problematic. Not only have they gotten too powerful too fast but they are definately not politically neutral. I am particularly disgusted by the situation here in New York State. The State's largest Union, SEIU 1199 has a stranglehold on the Politicians in Albany. They oppose any reform of the state's Medicaid program, and, to top it off, the Albany Clowns authorized an $80 million payout to the union. Boy, talk about serious payola.\n\n \n \n Why should unions be politically neutral?\n \n Are large corporations politically neutral? Is Boeing politically neutral, or the drug industry?", 
   {}, 
   157043, 
   null, 
   1125016980.0
  ], 
  [
   157153, 
   null, 
   "Alan Ryan", 
   "Unions are a sign of capitalism and free market economics.\n \n \n \n The impartial observer recognises that the \"balance of power\" in the contract between employer and worker is weighted in favour of the former. Corporate America would be happy to benefit from a workforce that can be hired and fired at will, and with minimal compensation, as market conditions change. Unless there is some protection by unionization, the individual employee is at a gross bargaining disadvantage, and has little chance of resisting the caprice of an employer who recognises no obligation towards him beyond the cash nexus.\n \n Doctors, lawyers, teachers, etc., have professional associations through which (they claim) they maintain standards and police the behaviour of their members: few protest that these are self-serving unions in all but name. It is difficult to see why similar protection should be thought problematic when it's extended to the low-paid worker.\n \n We are all familiar with the irresponsibility which some labour unions exhibit from time to time: that has to be placed in the context of the grossly unequal power relationships to which I've already referred.", 
   {}, 
   156884, 
   null, 
   1125053040.0
  ], 
  [
   157155, 
   null, 
   "Big_Bear_Scot", 
   "I don't know what Unions are like in the US, but I am member of GMB Union(the General Workers Union) they provide many services apart from the collective bargaining during wage negations. For example I can get free legal advice about Industrial Relations and Health & Safety Laws, Free Legal representation if I need to take my Employer to court and advice about Pension Scheme. I get all these services for about £2.97($5) a week.\n \n I would imagine in the US Unions might provide some extra benefits such as dental or medical insurance at a competitive rate(if the employer doesn't provide such insurance schemes).\n \n This might sound like a Socialist slogan but workers are in a stronger bargaining position with employers when they are united, a Union is a best way to provide a united front against the exploiter(ahhh sorry employer ;)).", 
   {}, 
   157153, 
   null, 
   1125054420.0
  ], 
  [
   157182, 
   null, 
   "jim's trucking", 
   "Come on!\n \n We need to unionize the illegal immigrants!!\n \n They're being exploited!! \n \n \n :)\nIt's already been done. The ACLU and other bleeding heart liberals are their union leaders. ...and the members don't have to pay dues.", 
   {}, 
   156879, 
   null, 
   1125072180.0
  ], 
  [
   157246, 
   null, 
   "Bassman", 
   "Why should unions be politically neutral?\n \n Are large corporations politically neutral? Is Boeing politically neutral, or the drug industry?\n\n I'll tell you why. Because most of the rank and file do not espouse the communist-socialist indoctrination of the left-wing unions!!!! emoticon_xangel", 
   {}, 
   157107, 
   null, 
   1125093300.0
  ], 
  [
   157271, 
   null, 
   "Jo Bennett", 
   "So unions should be politically neutral because you don't agree with their politics? Surely if their members don't like their leadership they should elect someone else.", 
   {}, 
   157246, 
   null, 
   1125098160.0
  ], 
  [
   157299, 
   null, 
   "lord tammerlain", 
   "So unions should be politically neutral because you don't agree with their politics? Surely if their members don't like their leadership they should elect someone else.\n\n \n \n Quite right, if you dont like the leadership of the union, use your membership voting rights ( which equates to the voting rights of shareholders) to vote in different union leadership.", 
   {}, 
   157271, 
   null, 
   1125103500.0
  ], 
  [
   157418, 
   null, 
   "Bassman", 
   "So unions should be politically neutral because you don't agree with their politics? Surely if their members don't like their leadership they should elect someone else.\n\n I'm not just saying union shoul be politically neutral, they should be eliminated!!!\n As I have also stated, they became too powerful too fast. Back in '81 the air traffic controllers went on an ILLEGAL STRIKE!! President Reagan had every right to can each and every one of those people. In '90 Greyhound suffered from one of its worst strikes ever. Unions hurt businesses and municipalities with their unreasonable demands. I agree that there was a need to enact and enforce labor laws that benefit workers. However, there is also a need for businesses to flourish. That would never happen if unions always had their way (think of the steel industry). If I ever start a business, I would treat my emplyees in such a way that there would never, and I mean never be a need for a union. And I would still make a nice profit. Because that's what businesses are supposed to do, make money; not be a social service group!! emoticon_xgood emoticon_xgood", 
   {}, 
   157271, 
   null, 
   1125163080.0
  ], 
  [
   157424, 
   null, 
   "Jo Bennett", 
   "I don't know much about the US steel industry, so your reference doesn't mean a lot to me. Illegal strike as a term always makes me a bit suspicious, the right to strike is absolute, the only question is whether an employer is allowed to sack someone for going on strike. Businesses exist to make money, which is precisely why unions are essential - businesses cannot be trusted to look after their employees, collective action by employees is the only way to ensure equitable treatment. Could you give specific examples of what you consider to be unreasonable demands by unions?", 
   {}, 
   157418, 
   null, 
   1125165840.0
  ], 
  [
   157425, 
   null, 
   "Eddie", 
   "I'm not just saying union shoul be politically neutral, they should be eliminated!!!\n\n \n Eliminated through legislation, extermination or whishful thinking?\n \n \nAs I have also stated, they became too powerful too fast. Back in '81 the air traffic controllers went on an ILLEGAL STRIKE!! President Reagan had every right to can each and every one of those people. In '90 Greyhound suffered from one of its worst strikes ever. Unions hurt businesses and municipalities with their unreasonable demands. I agree that there was a need to enact and enforce labor laws that benefit workers. However, there is also a need for businesses to flourish. That would never happen if unions always had their way (think of the steel industry). \n\n \n Your labour unions are not powerful and they never have been. Illegal strikes are more common in countries with weak and decentralised labour unions. There is no absolute contrast between flourishing businesses and powerful unions.\n \n \nI If I ever start a business, I would treat my emplyees in such a way that there would never, and I mean never be a need for a union. And I would still make a nice profit. Because that's what businesses are supposed to do, make money; not be a social service group!! emoticon_xgood emoticon_xgood\n\n \n Businesses prime target sould be to maximize profits. And this is why it is so important that the workers are organised in order to pursue their prime target. The workers should never be dependant on the good graces of their employers. And employers should not be expected to be saints. Everyone should be expected to maximize their own interests. That`s the basis for a well functioning market economy. As is the freedom of association that allows individuals to form companies, and workers to organize labour unions", 
   {}, 
   157418, 
   null, 
   1125165900.0
  ], 
  [
   157442, 
   null, 
   "georged", 
   "\n Businesses prime target sould be to maximize profits. And this is why it is so important that the workers are organised in order to pursue their prime target. The workers should never be dependant on the good graces of their employers. And employers should not be expected to be saints. Everyone should be expected to maximize their own interests. That`s the basis for a well functioning market economy. As is the freedom of association that allows individuals to form companies, and workers to organize labour unions\n\n \n The major problem affecting US corporations with margin dominated by union contracts was and is poor management. Beginning in ww2, when wages were frozen and couldn't be used to attract workers, benefits were utilized to sidestep the wage issue. Post ww2 the practice was continued as management viewed non-taxable benefits and job security as concessions preferable to company tax exposure on wages. Especially when senior bonuses and incentives have traditionally been based on operating margin and ROI to placate equity markets. The accumulation of benefits including job security combined with high wage scales was and is a major influence in offshore relocation of US industry. US vehicle manufacturers are now caught in that very trap. Due to dependence on trading markets determining equity values, standing up to labor demands based on profitability, as should be the circumstances, no longer affords management resistance. \n \n US civil service is the next financial dilemma associated with labor demands not being effectively managed. Exporting those jobs offshore being more politically sensitive due to our system of government currently being based on political popularity of who can spend more public funds.", 
   {}, 
   157425, 
   null, 
   1125169320.0
  ], 
  [
   157450, 
   null, 
   "Alan Ryan", 
   " Everyone should be expected to maximize their own interests. That`s the basis for a well functioning market economy. As is the freedom of association that allows individuals to form companies, and workers to organize labour unions\n\n \n Freedom of association is a key point: business interests often present a united front behind Chambers of Commerce, Institutes of Directors, etc., it is absurd and unjust to deny workers a similar liberty to protect their collective interests.", 
   {}, 
   157425, 
   null, 
   1125171420.0
  ], 
  [
   157497, 
   null, 
   "Bassman", 
   "I don't know much about the US steel industry, so your reference doesn't mean a lot to me. Illegal strike as a term always makes me a bit suspicious, the right to strike is absolute, the only question is whether an employer is allowed to sack someone for going on strike. Businesses exist to make money, which is precisely why unions are essential - businesses cannot be trusted to look after their employees, collective action by employees is the only way to ensure equitable treatment. Could you give specific examples of what you consider to be unreasonable demands by unions?\n\n Plenty!! Let's start with the Buffalo Teachers' Federation. They are unwilling to switch to a single health care provider from three providers. This, in turn, will lead to further layoffs in the Buffalo Public School district. How about Bethlehem Steel? Once the largest employer in Lackawanna, unreasonable demands for over $20-25/hr salary increases in an industry that was struggling to survive? Come on! Unions do more harm to business and municipalities than you think!!!", 
   {}, 
   157424, 
   null, 
   1125193500.0
  ], 
  [
   157503, 
   null, 
   "georged", 
   "Plenty!! Let's start with the Buffalo Teachers' Federation. They are unwilling to switch to a single health care provider from three providers. This, in turn, will lead to further layoffs in the Buffalo Public School district. How about Bethlehem Steel? Once the largest employer in Lackawanna, unreasonable demands for over $20-25/hr salary increases in an industry that was struggling to survive? Come on! Unions do more harm to business and municipalities than you think!!!\n\n \n Our migration from a creditor, industrial economy to service status was accompanied by a defined lack of product competitiveness in global markets. $25/hr labor increases would probably put the steel company out of business unless they have a guaranteed demand for their steel with acceptable margins that can include additional labor/benefit expense, like the federal government defense department or the tooth fairy, and the union is aware of it. \n \n As mentioned, the public sector has no economic barrier to benefits and wages demand other than taxpayer ability. Politicians are going to let the now 48% of unionized public workers go on strike and risk losing that splendid, powerful, well-compensated office for public inconvenience in a more is better society? Maybe, but I wouldn't bet on it.", 
   {}, 
   157497, 
   null, 
   1125197340.0
  ], 
  [
   157543, 
   null, 
   "Jo Bennett", 
   "Plenty!! Let's start with the Buffalo Teachers' Federation. They are unwilling to switch to a single health care provider from three providers. This, in turn, will lead to further layoffs in the Buffalo Public School district. How about Bethlehem Steel? Once the largest employer in Lackawanna, unreasonable demands for over $20-25/hr salary increases in an industry that was struggling to survive? Come on! Unions do more harm to business and municipalities than you think!!!\n\n \n The real question is what is the other side of the story. Trade Union members are thinking people, they're not going to demand something without a good reason. For example, were the steel workers being paid less than comparable workers elsewhere in the industry? Were they being asked to make other adjustments to their conditions or benefits? Was this just a starting bargaining position, knowing that negotitation would force the eventual figure down? A similar situation occured recently in the UK with firefighters, who were being paid less than the average wage for a dangerous and difficult job. Their pay demand was 40%. However, this would only have given them parity with similarly skilled workers in the other emergency services, the police and ambulance service. Also, they were being asked to make significant adjustments to the shift system. They had agreed a 16% deal with their employers, the local councils, but the central government blocked it. There is usually a lot more to these stories than meets the eye, the media usually only deals in headlines.", 
   {}, 
   157497, 
   null, 
   1125240840.0
  ], 
  [
   157547, 
   null, 
   "Bassman", 
   "The real question is what is the other side of the story. Trade Union members are thinking people, they're not going to demand something without a good reason. For example, were the steel workers being paid less than comparable workers elsewhere in the industry? Were they being asked to make other adjustments to their conditions or benefits? Was this just a starting bargaining position, knowing that negotitation would force the eventual figure down? A similar situation occured recently in the UK with firefighters, who were being paid less than the average wage for a dangerous and difficult job. Their pay demand was 40%. However, this would only have given them parity with similarly skilled workers in the other emergency services, the police and ambulance service. Also, they were being asked to make significant adjustments to the shift system. They had agreed a 16% deal with their employers, the local councils, but the central government blocked it. There is usually a lot more to these stories than meets the eye, the media usually only deals in headlines.\n\n \n The answer to the first half of your question is no, no, and no!! on the issue of municipal unions, my point is that we do not have the tax base anymore to support such lavish benefits or wages. The population in New york State has dropped substantially over the past few decades because New York is the highest taxed state in the country,as well as the most overregulated. Therefore, New York State is very hostile to businesses.", 
   {}, 
   157543, 
   null, 
   1125241500.0
  ], 
  [
   157552, 
   null, 
   "Jo Bennett", 
   "Come on Bassman, lets have some specifics. I very much doubt the steel workers woke up one morning and decided to demand USD25/hour more without rhyme or reason. What's the background? In any case, no matter how low US steel companies push wages and conditions, they won't be albe to compete with chinese and other imports. Labour costs are a red herring, western manufacturing companies have to work smart, be constantly innovating and doing things that can't be done cheaply overseas. If the problem was caused by trade unions don't you think UK steel production would have survived, given what Thatcher did to British trade unions in the 80s?\n \n The other key issue the US has is the lack of public healthcare. When companies are left with major healthcare commitments, rather than just having taxes that are based on ability to pay for both businesses and workers, then you will always get the situation BS found itself in where you can't afford the benefits you signed contracts for.", 
   {}, 
   157547, 
   null, 
   1125243600.0
  ], 
  [
   157554, 
   null, 
   "georged", 
   "The real question is what is the other side of the story. Trade Union members are thinking people, they're not going to demand something without a good reason. For example, were the steel workers being paid less than comparable workers elsewhere in the industry? Were they being asked to make other adjustments to their conditions or benefits? Was this just a starting bargaining position, knowing that negotitation would force the eventual figure down? A similar situation occured recently in the UK with firefighters, who were being paid less than the average wage for a dangerous and difficult job. Their pay demand was 40%. However, this would only have given them parity with similarly skilled workers in the other emergency services, the police and ambulance service. Also, they were being asked to make significant adjustments to the shift system. They had agreed a 16% deal with their employers, the local councils, but the central government blocked it. There is usually a lot more to these stories than meets the eye, the media usually only deals in headlines.\n\n \n I don't know about the UK, but in the US public worker unionization has developed a new method of collective bargaining. Prior to large scale unionization, public pay and benefit scales were calculated on comparable positions in private industry within the immediate economic area. The union bargaining standard for wage and benefit scale now uses comparable city populations with no other considerations, encluding private industry compensation and municipal financial health. \n \n This has presented a financial dilemma to many municipalities in that city/county X, the bargaining example, is normally in one of the US areas with high domestic construction growth and subsequent service industry stimulation resulting in adequate tax revenue, at this time, to meet union demands. The union target city/county Y is inevitably in an area where declining manufacturing and other conditions have reduced tax revenue. The options are facing a strike or raising local tax rates to meet labor demands, not a good circumstance.\n \n This has led to the creation of two public work forces in many areas (political refusal to face reality and negotiate union demands based on available tax revenue). Work force A consists of unionized workers with work force B being non-union. Job descriptions are updated to eliminate the overheads of union workers by cutting those positions from a budget and/or using private contractors to perform the work (at much lower costs with greater efficiency). \n \n Locally, we've had three recall elections to remove elected officials who conceded to what the local population considers excessive pay for unionized public workers. When the local newspaper points out that most public positions are paying far more actual salary and offering a guaranteed retirement at a upper-middle class level that greatly exceeds a comparable job in private industry, local taxpayers do take heed. This will not happen in larger cities or states due to voter apathy until excessive taxation gets their attention. At the federal level, there seems to be no cap on union demands regardless of fiscal circumstances. \n \n You used public safety as an example in your post. Fire fighter unions, due to their rise to heroic status from 9/11, are actually putting themselves out of a job in our county with what are considered excessive wage and benefit demands. Private industry is taking over the county fire department functions station by station, using former county standards for training, equipment and procedures. Costs are at 70% of public worker salary and benefits with response time actually improving by as much as 50% in most areas. Local agricultural cooperatives and homeowners have actually received insurance rate reductions with improved reaction times. \n \n While I'm in agreement that unionization is a necessary ingredient of any successful capitalistic society, we in the US have a situation where political leaders have been using the same poor judgment exhibited by our industry captains in not forecasting costs in terms of future value exposure of expenses to projected revenue streams. After ten-years of progressively higher costs far beyond normal economic expansion (or reduction), those compounded operating and legacy costs are now showing up in current budgets and shocking the public. Municipalities and states face serious operating deficiencies in the coming years with little hope of reconciliation as unions seldom agree to reduction of salary and benefits to meet existing economic conditions.", 
   {}, 
   157543, 
   null, 
   1125244980.0
  ], 
  [
   157557, 
   null, 
   "Jo Bennett", 
   "In the UK there have been a number of instances where unionised employees, when faced with a company in financial difficulty, have agreed to pay cuts. I suspect, bizarre as it may seem, the more direct nature of US democracy and federalism is to blame. Here, while a local council does levy taxes to fund local services, most of their money coems from central government and there is a massive redistribution from richer to poorer areas. It's imperfectly calculated, but it does mean that you get broadly equal pay for equal work across the country in the public sector. The fire services, though employed separately by local authorities, negotiate pay nationally. The problems of local economies collapsing are much less keenly felt here than in the US.\n \n It does sound like the unions in the US are being pretty stupid in some cases, but it also sounds like the system itself is rotten, and it is middle class workers who are unionised, not those at the bottom who most need it. It seems to me to be another symptom of the inequality inherent in the US economic system, those at the very bottom get screwed. We have some of the same issues here, but at least our minimum wage, with strong union support and against CBI crying wolf, is pushing past £5/hour.", 
   {}, 
   157554, 
   null, 
   1125245880.0
  ], 
  [
   157563, 
   null, 
   "georged", 
   "\n It does sound like the unions in the US are being pretty stupid in some cases, but it also sounds like the system itself is rotten, and it is middle class workers who are unionised, not those at the bottom who most need it. It seems to me to be another symptom of the inequality inherent in the US economic system, those at the very bottom get screwed. We have some of the same issues here, but at least our minimum wage, with strong union support and against CBI crying wolf, is pushing past £5/hour.\n\n \n I agree the system, private and public, is rotten. IMO the problem with both lies in short attention span of leadership, public and private, where normal motivation is self-preservation and enrichment. I'm certainly not a champion of the little people, but without costs, including legacy costs (the most volatile factor) tied to profitability (or tax revenue) even semi-efficient public service will eventually face insolvency and/or taxpayer rebellion. \n \n Minimum wage levels are another subject. Most studies have proven that increases in US minimum wage levels have harmed the recipients through increases in their cost of living. If the wage increases $.25 USD, the consumable products and services derived from their production rise that much plus the margin requirement, leaving them at a net loss.", 
   {}, 
   157557, 
   null, 
   1125247800.0
  ], 
  [
   157570, 
   null, 
   "Jo Bennett", 
   "I'd be interested to see those studies, because simple logic would conclude that for that to happen the minimum wage labour costs of the goods and services they buy would have to be more than 100% of the total cost; unless I'm missing something.", 
   {}, 
   157563, 
   null, 
   1125249960.0
  ], 
  [
   157591, 
   null, 
   "georged", 
   "I'd be interested to see those studies, because simple logic would conclude that for that to happen the minimum wage labour costs of the goods and services they buy would have to be more than 100% of the total cost; unless I'm missing something.\n\n \n 100% of cost passed to consumer plus 15% pre-tax profit.", 
   {}, 
   157570, 
   null, 
   1125257940.0
  ], 
  [
   157596, 
   null, 
   "Bassman", 
   "Come on Bassman, lets have some specifics. I very much doubt the steel workers woke up one morning and decided to demand USD25/hour more without rhyme or reason. What's the background? In any case, no matter how low US steel companies push wages and conditions, they won't be albe to compete with chinese and other imports. Labour costs are a red herring, western manufacturing companies have to work smart, be constantly innovating and doing things that can't be done cheaply overseas. If the problem was caused by trade unions don't you think UK steel production would have survived, given what Thatcher did to British trade unions in the 80s?\n \n The other key issue the US has is the lack of public healthcare. When companies are left with major healthcare commitments, rather than just having taxes that are based on ability to pay for both businesses and workers, then you will always get the situation BS found itself in where you can't afford the benefits you signed contracts for.\n\n Socialised medicine is another boondoggle and another way for an already big government to expand.", 
   {}, 
   157552, 
   null, 
   1125258360.0
  ], 
  [
   157604, 
   null, 
   "Alan Ryan", 
   "Socialised medicine is another boondoggle and another way for an already big government to expand.\n\n Do you mean that socialised medicine has no purpose other than presenting an opportunity for political patronage ?", 
   {}, 
   157596, 
   null, 
   1125259440.0
  ], 
  [
   157610, 
   null, 
   "Eddie", 
   "100% of cost passed to consumer plus 15% pre-tax profit.\n\n \n I`m assuming these studies are concerned with the long-run implications of raised minimum wages. In the short-run, a raised minimum wage should lead to higher real wages and higher unemployment due to sticky prices.\n \n Other interesting studies in NY have shown that raised minimum wages leads to lower unemployment in certain bussineses, if these bussineses wield monopsomy power in hiring certain groups. The studies examined the ramifications of a raised minimum wage in fast-food resturant and came to the conclusion that the minimum wage counteracted the monopsomy power to a certain degree and actually increased employment as well as real wages (in the short-run).\n \n Personally, I`m not very fond of legislated minimum wages. I think this should be covered by collective bargains between unions and employers rather than legislators due to the relationship between minimum wages and unemployment (ecp. youth unemployment). Allthough I guess that if you lack strong unions to counteract employers potential monopsomy power, it might be justified to legislate a minimum wage.\n \n \nSocialised medicine is another boondoggle and another way for an already big government to expand.\n\n \n Take a look at US expenditures on health care and compare this to other western democracies with populations with a socialized healthcare system. Then compare the indicators of the populations general health of the same countries. I think you will be amazed how inefficient your system really is...", 
   {}, 
   157591, 
   null, 
   1125260040.0
  ], 
  [
   157612, 
   null, 
   "georged", 
   "I`m assuming these studies are concerned with the long-run implications of raised minimum wages. In the short-run, a raised minimum wage should lead to higher real wages and higher unemployment due to sticky prices.\n \n\n \n Short term, yes, which is the political objective.", 
   {}, 
   157610, 
   null, 
   1125260340.0
  ], 
  [
   157625, 
   null, 
   "Jo Bennett", 
   "The UK experience of the minimum wage has been that unemployment has fallen dramatically since its intorduction, not least because it means there is more of a gap between benefits and working. Also, the vast majority of low paid jobs are service sector, and not vulnerable to being exported, as you can't sell groceries from offshore, or care for the elderly, and this is where the lowest paid jobs are. Collective bargaining, while preferable, is usually not possible because low paid workers are the least likely to be unionised, and the ones who can least afford to lose their job, even if their dismissal might later be overturned in court.\n \n Public healthcare is the most efficient means of provision, this is why up until a few years ago the UK spent 6.5% of GDP to the US 13.5%. The UK spend has increased in the last 5 years or so, but is still nowhere near the US level, and coverage is much more consistent. Big government is not a bad thing when it does things better than the private sector.\n \n On the youth unemployment issue, in the UK the minimum wage is lower if you're under 21, though I'm not to keen on this.", 
   {}, 
   157612, 
   null, 
   1125261660.0
  ], 
  [
   157631, 
   null, 
   "georged", 
   "\n \n Public healthcare is the most efficient means of provision, this is why up until a few years ago the UK spent 6.5% of GDP to the US 13.5%. The UK spend has increased in the last 5 years or so, but is still nowhere near the US level, and coverage is much more consistent. Big government is not a bad thing when it does things better than the private sector.\n \n\n \n Other than as a component of private human resource management and both COGS and operating expenses, I've never followed cost comparisons between public and private systems. When I left the corporate world some years ago health care cost was a looming issue with partial costs beginning to be pushed down to the employee level and caps being reduced at a rapid clip. From $1mm (USD) cap being common in the 1980s, by mid 1990s $250k was the norm to reduce escalating employer costs.\n \n Dental plans were the first US employer benefit to become abused, with mothers actually having braces installed on children's birth teeth. The US quickly became known as the country with perfect appearing teeth, driving plan costs to a point of general abandonment of employer paid plans. \n \n Medical plans are now so abused by parents insisting on doctor visits for a child's slight cold and other, similar instances approaching hypochondriac mindset with complete medical profession compliance to avoid our well-known lawsuits. MD malpractice insurance, all specialties, now constitutes about one-third of the overhead for a typical private medical practice. Add that to the fact US medical doctors and their fees are enshrined by the US public right up there with their Christian God and I'm not surprised at the cost difference between public and private medical care.", 
   {}, 
   157625, 
   null, 
   1125263700.0
  ], 
  [
   157695, 
   null, 
   "Bassman", 
   "Do you mean that socialised medicine has no purpose other than presenting an opportunity for political patronage ?\n\n Definately!!! ;) ;)", 
   {}, 
   157604, 
   null, 
   1125283860.0
  ], 
  [
   157746, 
   null, 
   "billsco", 
   "Only about 15-20% of the workforce here in the U.S. is unionized, perhaps even less. I believe that is exactly what the unions want. I believe the split in the AFL-CIO was a tacit understanding by the part which wanted a political remedy over increased membership that too much unionization is counter-productive.\n \n If an everyday Wal-Mart worker--say the store greeter--is suddenly empowered with a higher wage, where does that leave the average trade union worker? Doesn't he see his advantage disappear in the economic sphere? Why would he welcome that development of general wage increases and the concomitant rise in the cost of living? The very idea of unions is to convince its members they are somehow special, they are so much more important, that they deserve a better wage than the rest of the luckless society. \n \n Seeing a store greeter joining their ranks of vaunted privilege would be a bitter pill for them to swallow, IMO.", 
   {}, 
   157695, 
   null, 
   1125318660.0
  ], 
  [
   157751, 
   null, 
   "Alan Ryan", 
   "O The very idea of unions is to convince its members they are somehow special, they are so much more important, that they deserve a better wage than the rest of the luckless society. \n \n \n\n I think you see a labor union as an instrument for extracting economic advantages for its members - which is true. However, this view should be balanced by the protection which a union member seeks from perhaps capricious and oppressive employers. You have to remember that there are only 4 aces in the deck, and the employer holds three of them.\n \n Members of unions are also members of society, and many are just as much concerned about the fate of the luckless as any other thoughtful person.", 
   {}, 
   157746, 
   null, 
   1125320700.0
  ], 
  [
   157754, 
   null, 
   "billsco", 
   "I think you see a labor union as an instrument for extracting economic advantages for its members - which is true. However, this view should be balanced by the protection which a union member seeks from perhaps capricious and oppressive employers. You have to remember that there are only 4 aces in the deck, and the employer holds three of them.\n \n Members of unions are also members of society, and many are just as much concerned about the fate of the luckless as any other thoughtful person.\n\n \n I've been reading the responses to this thread from our overseas contributors and have found them instructive, with many valid points.\n \n I just see my role as presenting another picture, of stripped down idealism--of real life union hostility--that can hopefully be as instructive to you guys across the pond. \n \n Hostility is something quite natural in a union shop. It is apparent the moment one walks through the door. A stranger is eyed suspiciously, as an enemy they haven't yet met. And indeed, anyone who is not a union member is an enemy. It is inculcated from the top down, and fed to the members at every opportunity. Management is the conniving enemy and one must NEVER approach them without the fearless, resolute protection of the union. In that sense, relationships are poisoned, and unions become permanently necessary. Rather than simply address a concern about some trivial matter, two or three workers will huddle together and conspire to file a written \"grievance\" against the employer. \n \n Employees' jobs, after so many years of union protection, are so well-defined that if a scrap of paper is lying on the floor, it is not to be picked up and thrown away. That is not in their job description after all, and if one were to perform such an act, it only would demonstrate how much employers take advantage of their work force. \n \n All in all, it is an unhealthy, unnatural environment, and one I wish to have no part in. I am not looking forward to the Wal-Mart greeter eying me stonily when I walk in.", 
   {}, 
   157751, 
   null, 
   1125324000.0
  ], 
  [
   157768, 
   null, 
   "Alan Ryan", 
   "I've been reading the responses to this thread from our overseas contributors and have found them instructive, with many valid points.\n \n I just see my role as presenting another picture, of stripped down idealism--of real life union hostility--that can hopefully be as instructive to you guys across the pond. \n \n Hostility is something quite natural in a union shop. It is apparent the moment one walks through the door. A stranger is eyed suspiciously, as an enemy they haven't yet met. And indeed, anyone who is not a union member is an enemy. It is inculcated from the top down, and fed to the members at every opportunity. Management is the conniving enemy and one must NEVER approach them without the fearless, resolute protection of the union. In that sense, relationships are poisoned, and unions become permanently necessary. Rather than simply address a concern about some trivial matter, two or three workers will huddle together and conspire to file a written \"grievance\" against the employer. \n \n Employees' jobs, after so many years of union protection, are so well-defined that if a scrap of paper is lying on the floor, it is not to be picked up and thrown away. That is not in their job description after all, and if one were to perform such an act, it only would demonstrate how much employers take advantage of their work force. \n \n All in all, it is an unhealthy, unnatural environment, and one I wish to have no part in. I am not looking forward to the Wal-Mart greeter eying me stonily when I walk in.\n\n \n I guess you might have owned a business and perhaps experienced, as an employer, some of the egregious behaviours associated with the unreflecting unionised mindset ? I will concede that your doubts and suspicions are not unreasonable.\n \n Discussions like this are usually conducted at a high level of generality and a personal anecdote is tolerated only for the sake of interest and/or contrast, rather than as a substantive point in a valid argument. However, as an illustration of the value of unions - take the case of my father, who was never in one. He was employed as a bartender for many years. He worked conscientiously at one hotel for 22 years: his employer was decent enough, and always behaved above and beyond the call of duty as far as my father was concerned. Then came the day when the place was sold to a large chain of hotels: my Dad became superfluous to requirements, and he was given a week's notice before finding himself out of work. Had he belonged to a union, there might have been some chance of at least a little compensation...... My conclusion: there is only strength in numbers and the individual is of little account in a situation such as I've described. \n \n If we generalise my anecdote, which is a commonplace really, the case for labor unions becomes compelling.", 
   {}, 
   157754, 
   null, 
   1125327120.0
  ], 
  [
   157774, 
   null, 
   "billsco", 
   " Could you give specific examples of what you consider to be unreasonable demands by unions?\n\n \n Northwest Airlines is taking an aggressive stance against the mechanics' union. I believe the union has requested its members to commit suicide. Calling for a strike rather than bargaining through this rough period in airline history is bad advice, and apparently other unions agree with my assessment, seeing they have left the mechanics twisting in the wind.\n \n Unable to raise ticket prices due to fierce competition, full airplanes yet unprofitable flights, and union concessions with other airline companies makes the mechanics' union strike puzzling. The union is protecting the mechanics best interests?", 
   {}, 
   157424, 
   null, 
   1125329460.0
  ], 
  [
   157777, 
   null, 
   "jim's trucking", 
   "... The union is protecting the mechanics best interests?\n\n The only people the unions really protect these days are the union leaders!", 
   {}, 
   157774, 
   null, 
   1125329820.0
  ], 
  [
   157781, 
   null, 
   "billsco", 
   "If we generalise my anecdote, which is a commonplace really, the case for labor unions becomes compelling.\n\n \n If we were all in a union, what would it benefit us? \n \n Would it not lead to a straight-jacketed world of business, where few cost-saving initiatives would be tolerated? Would our wages be substantially higher, but the cost of living more higher yet? Would new jobs be rare because old jobs were protected at all costs?\n \n I'm not trying to pretend I understand the economics of it all, far from it. I simply view unions as a select group--us vs them mentality--who have no real wish to become the voice of the masses, but only attempting to gain an immediate advantage for their members. \n \n It just seems to me if practiced on a large scale, unionization loses its effectiveness.", 
   {}, 
   157768, 
   null, 
   1125330900.0
  ], 
  [
   157802, 
   null, 
   "Waxy", 
   "I guess you might have owned a business and perhaps experienced, as an employer, some of the egregious behaviours associated with the unreflecting unionised mindset ? I will concede that your doubts and suspicions are not unreasonable.\n \n Discussions like this are usually conducted at a high level of generality and a personal anecdote is tolerated only for the sake of interest and/or contrast, rather than as a substantive point in a valid argument. However, as an illustration of the value of unions - take the case of my father, who was never in one. He was employed as a bartender for many years. He worked conscientiously at one hotel for 22 years: his employer was decent enough, and always behaved above and beyond the call of duty as far as my father was concerned. Then came the day when the place was sold to a large chain of hotels: my Dad became superfluous to requirements, and he was given a week's notice before finding himself out of work. Had he belonged to a union, there might have been some chance of at least a little compensation...... My conclusion: there is only strength in numbers and the individual is of little account in a situation such as I've described. \n \n If we generalise my anecdote, which is a commonplace really, the case for labor unions becomes compelling.\n\n \n First off, I don't want to offend in any way here, so let's stick to the general rather than your father specifically.\n \n Why is compensation in order in a scenario such as that above?\n \n Do you feel a worker is owed something simply on the basis of seniority or length of tenure? If so, why?\n \n If all of the laws were met by the corporation taking over, should they be forced to go above and beyond those laws?\n \n I have a real problem with the sense of entitlement that people develop in today's work force. \"I've put in 20 years of service, I deserve X and Y.\" \n \n Why? \n \n 1. Were you paid properly and received proper benefits during those 20 years? Treated right so to speak?\n \n Did you have the opportunity to go elsewhere for employment should you have chosen to do so? \n \n If the answer is #1 is no, why did you stay there?\n \n If the answers to #1 and #2 are yes, then why does that company owe you anything? IMHO, their gratitude for 20 years of a job well done is more than enough on their part. Anything else is purely of their own discretion and good will.\n \n If they decide they no longer need you, that's their choice, just as it was yours to go elsewhere.\n \n Needless to say, I've had more than my share of very negative run-ins with unions and union members, especially in my younger days in the construction industry and dealing with government employees. (Billsco and a few others may even remember a few of the very heated debates I had on this topic with union members back on FTE.) \n \n My ill will toward the \"you owe me\" attitude comes from the abuses I see in the oil business every day. People always wanting something for nothing, or worse yet feeling they are entitled to something, for nothing, just because there is money moving around. It ticks me off to say the least.\n \n Waxy", 
   {}, 
   157768, 
   null, 
   1125336240.0
  ], 
  [
   157830, 
   null, 
   "jim's trucking", 
   "First off, I don't want to offend in any way here, so let's stick to the general rather than your father specifically.\n \n Why is compensation in order in a scenario such as that above?\n \n Do you feel a worker is owed something simply on the basis of seniority or length of tenure? If so, why?\n \n If all of the laws were met by the corporation taking over, should they be forced to go above and beyond those laws?\n \n I have a real problem with the sense of entitlement that people develop in today's work force. \"I've put in 20 years of service, I deserve X and Y.\" \n \n Why? \n \n 1. Were you paid properly and received proper benefits during those 20 years? Treated right so to speak?\n \n Did you have the opportunity to go elsewhere for employment should you have chosen to do so? \n \n If the answer is #1 is no, why did you stay there?\n \n If the answers to #1 and #2 are yes, then why does that company owe you anything? IMHO, their gratitude for 20 years of a job well done is more than enough on their part. Anything else is purely of their own discretion and good will.\n \n If they decide they no longer need you, that's their choice, just as it was yours to go elsewhere.\n \n Needless to say, I've had more than my share of very negative run-ins with unions and union members, especially in my younger days in the construction industry and dealing with government employees. (Billsco and a few others may even remember a few of the very heated debates I had on this topic with union members back on FTE.) \n \n My ill will toward the \"you owe me\" attitude comes from the abuses I see in the oil business every day. People always wanting something for nothing, or worse yet feeling they are entitled to something, for nothing, just because there is money moving around. It ticks me off to say the least.\n \n Waxy\nI totally agree with the \"company doesn't owe you anything.\" ...\n \n If you work for compensation from a company for 20 years, you must have been satisfied with your compensation or you wouldn't have stayed there for twenty years. (This is not to say that some people are not \"trapped\" in a certain job with a certain company but most, if not all people have the opportunity to move on to another job.)", 
   {}, 
   157802, 
   null, 
   1125345420.0
  ], 
  [
   157846, 
   null, 
   "Eddie", 
   "If we were all in a union, what would it benefit us? \n \n Would it not lead to a straight-jacketed world of business, where few cost-saving initiatives would be tolerated? Would our wages be substantially higher, but the cost of living more higher yet? Would new jobs be rare because old jobs were protected at all costs?\n\n \n I would say that since larger unions represent a larger part of the workforce, they also need to consider what effects their wage demands have on the whole economy. A small union can always strive to maximize the benefits for its own members without being concerned with how their demands might affect unemployment, and consequently governmental finances and taxes. Larger unions need to take this into consideration however, and are more likely to make demands that will benefit the economy in the long run. Up to a certain point, larger and stronger unions with more centralised power would therefor result in higher inflation and unemployment as these unions, not yet large enough to consider the entire economic situation or being able to control what other wage-earners demand, would have better ability to force the employers into submission. However, once the unions get large enough to consider the entire economic situation, and the negotiations are central enough to empower the unions with a reasonable ability to control the wage setting process, unemployment and inflation drops.\n \n The relationship between centralisation/size of unions and unemployment/inflation is therefor shaped like a hump.\n \n While this might seem theoretic and a bit idealistic, there are empirical evidence to support this conclusion. In crosscountry comparrisons between nations with different forms of negotiation this type of relationship has been found (allthogh certain studies come to the conclusion that the relationship is straightforward rather than \"hump shaped\"). Also observations of countries that has reformed their negotiation systems support the vie that more centralisation leads to lower unemployment/inflation.\n \n As for protections against firing would lead to less jobs, there is indeed a relationship between job creation and job security. However the net-effect on unemployment is theoreticly ambigous since there is also a relationship between job termination and job security.", 
   {}, 
   157781, 
   null, 
   1125347580.0
  ], 
  [
   157888, 
   null, 
   "Alan Ryan", 
   "\n My ill will toward the \"you owe me\" attitude comes from the abuses I see in the oil business every day. People always wanting something for nothing, or worse yet feeling they are entitled to something, for nothing, just because there is money moving around. It ticks me off to say the least.\n \n Waxy\n\n \n You seem to have latched on to the idea that I'm defending a \"you owe me\" attitude or, even worse, that I'd be content to see people get \"something for nothing\". My anecdote was only meant to be an illustration of why I think it's advisable to belong to a trade union - i.e. as a means of redressing (somewhat) the imbalance of power between employers and workers. So I don't need to answer the specific questions about who deserves what and why, or worry about you being \"ticked off\". \n \n Disregarding the rather bitter tone of your reponse here and getting back to the fundamental point; I would freely acknowledge that labor unions abuse their collective power from time to time, and, in their struggles against employers, inflict \"collateral damage\" on the innocent public. This is probably inevitable if we think about it: union leaders (and their members) have the same human failings as any other special interest group pursuing its economic or political ends.\n \n But I suspect the root of North American antipathy is the perception that unionism is imbued with a tincture of socialism - even the hint of which is, to some, an anathema. \n \n This critical attitude is less evident in Europe where corporate interests are more mindful that workers are social animals and that the freedom of employers to make money is only one among a spectrum of values. I think if we dig a bit deeper and get beneath our superficial responses (whether pro or con) to the desirability of labor unions, we should soon be groping for a theory of justice.\n \n As an afterthought: I think this exchange has demonstrated the unwisdom of introducing personal anecdotes into moral, political or economic discussions.", 
   {}, 
   157802, 
   null, 
   1125356820.0
  ], 
  [
   157915, 
   null, 
   "Waxy", 
   "You seem to have latched on to the idea that I'm defending a \"you owe me\" attitude or, even worse, that I'd be content to see people get \"something for nothing\". My anecdote was only meant to be an illustration of why I think it's advisable to belong to a trade union - i.e. as a means of redressing (somewhat) the imbalance of power between employers and workers. So I don't need to answer the specific questions about who deserves what and why, or worry about you being \"ticked off\". \n \n Disregarding the rather bitter tone of your reponse here and getting back to the fundamental point; I would freely acknowledge that labor unions abuse their collective power from time to time, and, in their struggles against employers, inflict \"collateral damage\" on the innocent public. This is probably inevitable if we think about it: union leaders (and their members) have the same human failings as any other special interest group pursuing its economic or political ends.\n \n But I suspect the root of North American antipathy is the perception that unionism is imbued with a tincture of socialism - even the hint of which is, to some, an anathema. \n \n This critical attitude is less evident in Europe where corporate interests are more mindful that workers are social animals and that the freedom of employers to make money is only one among a spectrum of values. I think if we dig a bit deeper and get beneath our superficial responses (whether pro or con) to the desirability of labor unions, we should soon be groping for a theory of justice.\n \n As an afterthought: I think this exchange has demonstrated the unwisdom of introducing personal anecdotes into moral, political or economic discussions.\n\n \n I'm sorry you took the post personally, and I certainly didn't mean for it to have a bitter tone. (Though I am outwardly anti-union due to my experiences.) \n \n I'm in no way ticked off at you. (Given our history, I'm rather surprised you responded this way. However, I know people react differently when personal issues are addressed, that's why I attempted to diffuse that immediately in my post.)\n \n My closing statements were simply blanket generalizations to try and somehow express why my thoughts are what they are. I'm not big on generalizations, perhaps this was another good demonstration of why I feel that way. \n \n You latched on to one sound byte and ignored the rest of the post. I think it's unfortunate that you chose not to address the rather pointed questions in my post, choosing instead to concentrate on the purely philosophical and esoteric.\n \n Whether it was your intention or not, IMHO, your post implied that your father, or anyone in that scenario, was somehow hard done by or was owed something that a union would ensure they got. I apologize for reading what wasn't there, but I'm then puzzled as to what the point of the anecdote was.\n \n IMHO, the questions I posed go directly to the heart of the union issue. I don't see an imbalance in the situation you presented, I was curious to see where you felt the imbalance lied, and where/what the union's efforts should be in such a case. It would seem to me, and again I may be wrong, that you were at least implying that being a union member in that case would be beneficial to the employee. I want to know why you feel that way if you do, and what role you see union membership playing.\n \n I don't think those are unreasonable requests on my part, but feel free to tell me to go pound sand. :p \n \n Waxy", 
   {}, 
   157888, 
   null, 
   1125364080.0
  ], 
  [
   157997, 
   null, 
   "Eddie", 
   "@ Waxy\n \n I`m not Alan Ryan, but I think this issue is an interesting one, so I hope you don`t object to me giving my thoughts regarding your question.\n \n \n Perhaps the inballance resides in the fact that the employee and employer had an inexplicit mutual arangement, or agreement if you will, of responsibility and trust. These kind of arangements are fairly common between employers and employees, ecpecially in small bussineses. Not everything can be regulated formaly in a written contract, nor is it desireable as this would result in a very unflexible working situation. Furthermore, lifetime contracts (slave contracts) are illegal, as are contracts forbidding owners to sell their bussineses. Therefor it`s unreasonable to expect that the employee in this case could have protected himself from this ugly and unexpected turn of event. Had the employee in question been organised in a labour union, this whole thing might have been avoided.", 
   {}, 
   157915, 
   null, 
   1125406860.0
  ], 
  [
   158003, 
   null, 
   "Alan Ryan", 
   "I'm sorry you took the post personally, and I certainly didn't mean for it to have a bitter tone. (Though I am outwardly anti-union due to my experiences.) \n \n I'm in no way ticked off at you. (Given our history, I'm rather surprised you responded this way. However, I know people react differently when personal issues are addressed, that's why I attempted to diffuse that immediately in my post.)\n \n My closing statements were simply blanket generalizations to try and somehow express why my thoughts are what they are. I'm not big on generalizations, perhaps this was another good demonstration of why I feel that way. \n \n You latched on to one sound byte and ignored the rest of the post. I think it's unfortunate that you chose not to address the rather pointed questions in my post, choosing instead to concentrate on the purely philosophical and esoteric.\n \n Whether it was your intention or not, IMHO, your post implied that your father, or anyone in that scenario, was somehow hard done by or was owed something that a union would ensure they got. I apologize for reading what wasn't there, but I'm then puzzled as to what the point of the anecdote was.\n \n IMHO, the questions I posed go directly to the heart of the union issue. I don't see an imbalance in the situation you presented, I was curious to see where you felt the imbalance lied, and where/what the union's efforts should be in such a case. It would seem to me, and again I may be wrong, that you were at least implying that being a union member in that case would be beneficial to the employee. I want to know why you feel that way if you do, and what role you see union membership playing.\n \n I don't think those are unreasonable requests on my part, but feel free to tell me to go pound sand. :p \n \n Waxy\n\n \n It's OK Waxy: I stuck my head above the parapet, so I shouldn't moan if someone takes a shot at it. I suppose I was taken off guard by what seemed a vehement reaction from you and your suggestion that compensation is thoroughly undeserved in the event of getting unexpectedly fired etc. (I don't want to flatter, but your posts always strike me as reasoned and good-humoured, so this one seemed a bit \"out of character\")\n \n However, that's enough about my sensibilities and back to the essence of this topic. Before returning to my \"anecdote\" I should explain that there is now legislation in the UK which covers contracts of employment and which obliges employers to pay a lump sum of \"redundancy money\" to people who are fired through no fault of their own. This sum is calculated on the number of years of service and does not apply if the employee leaves of his own accord or is dismissed for misconduct.\n \n From an American (and Canadian ?) point of view, perhaps this entitlement to compensation is abhorrent ? Obviously, it isn't a freebie and has to be factored into business costs: consumers eventually pick up the tab through the higher prices caused by an extra corporate overhead. Maybe we should, but most people don't mind the burden being redistributed in this way: if the redundancy payment keeps recently fired people afloat until they can find another job, surely this is far better than having them dumped on a feather bed provided by the welfare state ?\n \n I should emphasise that this legislation was not an idea that came from the associations of employers: it resulted from union pressure on a sympathetic (Labour) government. Had it been in effect when my father got the sack, it would have provided a useful sum of petty cash during the couple of weeks it took him to find another job. That's the real point of my disputed reference to \"compensation\" - which now applies to everyone, with some exceptions, whether unionised or not.\n \n There's no need to spell out the other benefits of union membership, though I can't resist mentioning that a collective group of employees working for an impersonal organisation, can resist attempts by the employer to pick off the lone individual.\n \n I think this interesting thread has revealed some cultural differences in outlook between Europe and North America. It has given notice to me at least that, contrary to reports, American individualism is not dead. The larger questions of why European business models tend to respect social obligations in employment contracts more than is the case with the American business model, must be left to another time.", 
   {}, 
   157915, 
   null, 
   1125412080.0
  ], 
  [
   158208, 
   null, 
   "billsco", 
   "\n I should emphasise that this legislation [Redundancy payments] was not an idea that came from the associations of employers: it resulted from union pressure on a sympathetic (Labour) government. Had it been in effect when my father got the sack, it would have provided a useful sum of petty cash during the couple of weeks it took him to find another job. That's the real point of my disputed reference to \"compensation\" - which now applies to everyone, with some exceptions, whether unionised or not.\n \n \n\n This sounds a lot like Unemployment Compensation, a safety net we have in place in the US for people losing their jobs from layoffs or the like. It's funded through an employer tax. \n \n Unions administer their own version for striking or laid-off members, funded by a portion of union dues. \n \n But would the UK's version compensate union members as well as non- who suffer job losses? Is it fair to ask the government to pay this sum when the burden should be shouldered by the union, at least to my way of thinking?", 
   {}, 
   158003, 
   null, 
   1125497580.0
  ], 
  [
   158234, 
   null, 
   "Eddie", 
   "But would the UK's version compensate union members as well as non- who suffer job losses? Is it fair to ask the government to pay this sum when the burden should be shouldered by the union, at least to my way of thinking?\n\n \n If your question refers to wether it is fair that the state fund unemployment benefits, I would say yes. It`s a practical thing to do. If union-members only paid for their own members unemployment benefits, there would be less incentive for moderation in wage demands that could result in lay-offs. When the state pays, all workers pay for unemployment, not only those belonging to the same union. There are other aspects to it as well, like enabling workers to seek new and better jobs without having to fear starvation. Unemployment benefits also act as an automatic stabiliser during a recession, quickly increasing government expenditures during times of high unemployment to keep up the demand for goods and services. Basicly, unemployment benefits are so important for the economy that it can`t be trusted in the hands of private interests (that would have to be bailed out during an economic crisis by the government anyway) and it works more efficiently if the costs are shouldered by everyone to provide an incentive for avoiding widespread unemployment.", 
   {}, 
   158208, 
   null, 
   1125505080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Labor Unions New Direction?", 
  "url": "http://www.4forums.com/political/current-events-debates/6251-labor-unions-new-direction.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6251, 
  "discussion_files": [
   [
    "14119.html", 
    "http://www.4forums.com/political/current-events-debates/6251-labor-unions-new-direction-print.html"
   ], 
   [
    "14120.html", 
    "http://www.4forums.com/political/current-events-debates/6251-labor-unions-new-direction-4-print.html"
   ], 
   [
    "14121.html", 
    "http://www.4forums.com/political/current-events-debates/6251-labor-unions-new-direction-3-print.html"
   ], 
   [
    "14122.html", 
    "http://www.4forums.com/political/current-events-debates/6251-labor-unions-new-direction-2-print.html"
   ]
  ], 
  "identifier": 6251
 }
]