[
 [
  [
   157105, 
   null, 
   "chloe", 
   "http://media.smh.com.au/?rid=16609&sy=smh&source=smh.com.au%2F&t=5T6TK6&ie=1&player=wm7&rate=296&flash=1\n \n http://www.cincinnati.com/freetime/strange/073100_strange.html", 
   {
    "post_info": {
     "post_title": "Fetal Crying"
    }
   }, 
   null, 
   null, 
   1125015780.0
  ], 
  [
   157106, 
   null, 
   "Steeeeve", 
   "silly chloe...how can a part of the womens body other than her own mouth cry? :p", 
   {}, 
   157105, 
   null, 
   1125016140.0
  ], 
  [
   157682, 
   null, 
   "Howard Beale", 
   "Dear Chloe,\n \n Do you really want women tried for murder because they decide to take a pill that will cause an abortion? That is the only logical position a court can take once a zygote, embryo and fetus are legislated into the status of Human Beings. If one kills a human being, one is guilty of murder.", 
   {}, 
   157106, 
   null, 
   1125279540.0
  ], 
  [
   157711, 
   null, 
   "Steeeeve", 
   "Dear Chloe,\n \n Do you really want women tried for murder because they decide to take a pill that will cause an abortion? That is the only logical position a court can take once a zygote, embryo and fetus are legislated into the status of Human Beings. If one kills a human being, one is guilty of murder.\n\n \n yes, that would be correct.", 
   {}, 
   157682, 
   null, 
   1125292200.0
  ], 
  [
   157718, 
   null, 
   "Howard Beale", 
   "So Steeeeve,\n \n If a mother's life was in danger and the only way to save her life was to abort the fetus, what would you suggest the doctors do?", 
   {
    "unicode_changes_made": true
   }, 
   157711, 
   null, 
   1125293880.0
  ], 
  [
   157796, 
   null, 
   "Steeeeve", 
   "So Steeeeve,\n \n If a mother's life was in danger and the only way to save her life was to abort the fetus, what would you suggest the doctors do?\n\n \n in the insanly unlikly case this happens (as in never), I always go with save the life you can. A doctors job is not to choose one life over another.", 
   {
    "unicode_changes_made": true
   }, 
   157718, 
   null, 
   1125335340.0
  ], 
  [
   157828, 
   null, 
   "Howard Beale", 
   "Steeeve,\nin the insanly unlikly case this happens (as in never), I always go with save the life you can. A doctors job is not to choose one life over another.\nThere are about 4 million births each year in the US. Of those about 0.1% have such serious complications that the question of survivorship arises. That means about 4,000 cases per year. Your response completely avoids the reality of the issue facing the medical professional. \"Save the life you can\" is a seriously inadequate directive and whether you like it or not, every day, around the world, doctors \"choose one life over another.\" My question still remains unaddressed.", 
   {
    "unicode_changes_made": true
   }, 
   157796, 
   null, 
   1125344700.0
  ], 
  [
   157860, 
   null, 
   "Steeeeve", 
   "do you actually have those stats somewhere?\n \n And I don't see how I didn't answer your question...you save the life you can. What more is there to say?", 
   {}, 
   157828, 
   null, 
   1125350280.0
  ], 
  [
   157884, 
   null, 
   "Wez", 
   "And I don't see how I didn't answer your question...you save the life you can. What more is there to say?\n\n If there is 100% chance the woman will die and the baby will live if no abortion occurs and there is a 100% chance that if an abortion occurs that the woman will live, but the baby will die, whose life do you take? \"Saving the life you can\" doesn't answer the question, as you can save either life equally well, just not both. Who chooses who dies?\n \n Then there's silly issues such as why don't you have funerals for miscarriages, why can't a foetus be arrested and how can a foetus be a legal citizen in a country if it doesn't have a name, which all show how society is generally not geared to see a foetus as a full human being.\n \n -Wez", 
   {
    "unicode_changes_made": true
   }, 
   157860, 
   null, 
   1125355800.0
  ], 
  [
   158015, 
   null, 
   "Howard Beale", 
   "The stats are available. There are approximately 4 million births in the US every year. See the Ohio State University Medical Center Birth Statistics. Approximately 1.35 million abortions performed in the US every year. Of those 6% are caused by potential health problems. See The Center for Bio-Ethical Reform publication of 2002. In addition: of the life threatening complications of pregnancy and childbirth, many can be avoided by a caesarean birth. However according to a British study 7.5% of women will die from complications of a caesarean birth. That must be calculated in as well. It is very difficult to get exact US figures because of the liability concerns of doctors and hospitals.\n \n Even if the statistics are off, if taking a human life is murder, and if the government determines that life begins at conception, how does a doctor decide which murder to commit? He has no more right to murder a child to save a mother than to murder a mother to save a child. The only reasonable path he may be able to take is to do nothing and allow nature to take its course. See who survives. Perhaps they both will or perhaps they both will not.", 
   {}, 
   157884, 
   null, 
   1125415020.0
  ], 
  [
   158021, 
   null, 
   "FISHX", 
   "Then there's silly issues such as why don't you have funerals for miscarriages, \n \n -Wez\n\n \n Ah but i had a funeral for my son and he was miscarried so it is not such a silly issue.\n \n Would you care to elaborate why you think it is silly to hold a funeral for a miscarried pregnancy after all that was somebody,s baby/family.", 
   {}, 
   157884, 
   null, 
   1125415800.0
  ], 
  [
   158024, 
   null, 
   "Eddie", 
   "Ah but i had a funeral for my son and he was miscarried so it is not such a silly issue.\n \n Would you care to elaborate why you think it is silly to hold a funeral for a miscarried pregnancy after all that was somebody,s baby/family.\n\n \n I don`t think he meant that it was silly to hold funerals for miscarriages. Just that the questions where a bit silly. Naturally, anyone should be free to hold funerals for miscarriages or even aborted feetuses if they want. But that the state (or even the church) doesn`t automaticly pick up the tab shows that there feetuses are not viewed as full persons by society in general.", 
   {}, 
   158021, 
   null, 
   1125416280.0
  ], 
  [
   158028, 
   null, 
   "FISHX", 
   "Hmmm in the uk if any child under 16 dies whether by miscarriage or accident or disease the coop funeral directors do the burial free and the church donates a plot inside a baby garden.\n \n I do beleive that apart from life a burial is the most basic yet most important right we can have.", 
   {}, 
   158024, 
   null, 
   1125417120.0
  ], 
  [
   158043, 
   null, 
   "Eddie", 
   "Hmmm in the uk if any child under 16 dies whether by miscarriage or accident or disease the coop funeral directors do the burial free and the church donates a plot inside a baby garden.\n \n I do beleive that apart from life a burial is the most basic yet most important right we can have.\n\n \n Yeah, sure. But only if you explicitly ask for it, no? I don`t think a dead feetus found in the woods would be given a proper burial (allthough I can`t say for sure... I don`t live in the UK). Hence my emphasize on \"automaticly\"", 
   {}, 
   158028, 
   null, 
   1125420660.0
  ], 
  [
   158046, 
   null, 
   "FISHX", 
   "Here in the uk if a dead fetus was found in the woods it would be given a burial.", 
   {}, 
   158043, 
   null, 
   1125421440.0
  ], 
  [
   158047, 
   null, 
   "Eddie", 
   "Here in the uk if a dead fetus was found in the woods it would be given a burial.\n\n \n Ok, if you say so.", 
   {}, 
   158046, 
   null, 
   1125421560.0
  ], 
  [
   158073, 
   null, 
   "FISHX", 
   "Also on this theory then we are all non persons as the state /goverment do not fund funerals anyway that is down to the individuals family.", 
   {}, 
   158047, 
   null, 
   1125426960.0
  ], 
  [
   158078, 
   null, 
   "Eddie", 
   "Also on this theory then we are all non persons as the state /goverment do not fund funerals anyway that is down to the individuals family.\n\n \n That`s from a brittish point of view though ;)", 
   {}, 
   158073, 
   null, 
   1125427680.0
  ], 
  [
   158099, 
   null, 
   "Wez", 
   "Ah but i had a funeral for my son and he was miscarried so it is not such a silly issue.\n \n Would you care to elaborate why you think it is silly to hold a funeral for a miscarried pregnancy after all that was somebody,s baby/family.\n\n I don't think it's silly to hold the funeral. I meant the question was silly. However, the state doesn't afaik, provide funerals for miscarriages unless you can find evidence to the contrary? I've never heard of the state giving funerals for abortions and miscarriages, until you mentioned it now.\n \n -Wez", 
   {}, 
   158021, 
   null, 
   1125437700.0
  ], 
  [
   158146, 
   null, 
   "OccamsRazor", 
   "Also on this theory then we are all non persons as the state /goverment do not fund funerals anyway that is down to the individuals family.\n\n \n Thats not strictly correct- if there are no next of kin for the deceased then the state (read local council) insures suitable provision is made for a funeral and scattering of the persons ashes.", 
   {}, 
   158073, 
   null, 
   1125451080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Fetal Crying", 
  "url": "http://www.4forums.com/political/abortion-debates/6263-fetal-crying.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 6263, 
  "discussion_files": [
   [
    "13771.html", 
    "http://www.4forums.com/political/abortion-debates/6263-fetal-crying-print.html"
   ], 
   [
    "13772.html", 
    "http://www.4forums.com/political/abortion-debates/6263-fetal-crying-2-print.html"
   ]
  ], 
  "identifier": 6263
 }
]