[
 [
  [
   157188, 
   null, 
   "unkerpaulie", 
   "step right up!. allow me to demonstrate. ill need a volunteer from the audience please\n \n provide a definition of God and i will prove God's existence or non-existence with the wave of my hand (the definition should be conclusive, complete and precise. any modifications to the definition will require a modification to the proof, but modifications are accepted)", 
   {
    "post_info": {
     "post_title": "proof of God's existence"
    }
   }, 
   null, 
   null, 
   1125075060.0
  ], 
  [
   157193, 
   null, 
   "Alan Ryan", 
   "step right up!. allow me to demonstrate. ill need a volunteer from the audience please\n \n provide a definition of God and i will prove God's existence or non-existence with the wave of my hand (the definition should be conclusive, complete and precise. any modifications to the definition will require a modification to the proof, but modifications are accepted)\n\n OK unkerpaulie: here's an old favorite that you might recognise - it's attributed to St Anselm, Archbishop of Canterbury in the eleventh century. \n \n Briefly, we understand by God a being greater than which nothing can be thought. This idea exists clearly in our mind: it is the idea of a being possessing every perfection and every positive attribute. But if the object of this idea was to exist solely in our mind and not in reality, there would be an idea of something else superior to it - namely of a being that possessed not only all the perfections already conceived, but also the additional perfection of real existence. Which is contrary to hypothesis - hence the idea of a most perfect being must correspond to reality. Existence belongs to the nature of the most perfect being: it follows from his nature that he exists. In other words, he exists necessarily and not contingently. \n \n This is a definition and a \"proof\" of existence: now put them both to the sword if you can.", 
   {}, 
   157188, 
   null, 
   1125076500.0
  ], 
  [
   157212, 
   null, 
   "Kronus", 
   "step right up!. allow me to demonstrate. ill need a volunteer from the audience please\n \n provide a definition of God and i will prove God's existence or non-existence with the wave of my hand (the definition should be conclusive, complete and precise. any modifications to the definition will require a modification to the proof, but modifications are accepted)\n\n \n Ok, here's my definition:\n \n God is an omnipotent, omniscient being that works in mysterious ways.", 
   {}, 
   157188, 
   null, 
   1125081900.0
  ], 
  [
   157237, 
   null, 
   "unkerpaulie", 
   "very well, sir. and thank you\n \n lets deal with the definition first. the being God is described as possessing \"every perfection\" and \"every positive attribute\". \n \n perfection is subjective, and defined by the judge of the thing, based on a subjective standard. there are no objective standards by which to determine, say, the perfect nose. is it a ratio to the area of the face, a certain length in millimeters and angle in degrees? a certain texture and surface finish? is there such a thing as a nose that no modifications could be made to? perfection only exists when the subjective judgement of the viewer says so.\n \n the phrase \"every positive attribute\" implies that a being can also possess negative and neutral attributes. the \"positivity\" of an attribute is also highly subjective. something is only positive when the majority agrees that it is. and whether something is positive or not also depends on the context. is killing someone a positive thing or a negative thing? it depends, largely on the consensus and on the context. is doing things to the approval of the consensus a positive thing? by definition it is. but what the majority deems as positive may not be good, which is negative. so, besides being subjective, a positive attribute can also be ambiguously defined\n \n as for the proof, its really not a proof at all. if God is defined as a perfect being in reality, that does not mean that God exists. if i define a ufo as a flying spacecraft from another planet in reality, that does not make such things exist. its just a definition. i really dont see how that can be even considered a proof\n \n basically, the definition: \"a being possessing every perfection and every positive attribute\" is not a true definition, because both perfection and positive attributes are subjective. so theres really nothing to work with here\n \n God, by this definition, doesnt exist", 
   {}, 
   157193, 
   null, 
   1125088560.0
  ], 
  [
   157239, 
   null, 
   "unkerpaulie", 
   "God is an omnipotent, omniscient being that works in mysterious ways.\n\n nice.\n \n a few problems with the definition. what exactly is a \"mysterious way\". can we identify a mysterious way when it occurs? lets say i do something you dont understand or didnt expect. that would be me working in a mysterious way from your viewpoint, right?\n \n also, omnipotent: defined as the ability to do anything that can be possibly done. the impossible cannot be done by such a being.\n omniscient: defined as the having the knowledge of everything that can be known. the unknowable cannot be known\n \n ok, with these mini-definitions out of the way (provided we agree on them), we can identify things that are impossible (and therefore not required as an ability of God). such things include creating round squares, turning chalk into trees, and converting water into wine. if these things are possible, then God would be able to to them. however, i contend that these things are impossible, and out of the range of God's abilities\n \n as for knowledge, what is universally unknown is universally unknown, and we cannot determine if unknown knowledge exists or not. if unknown knowledge exists, it is not knowledge until it is known (it sounds kinda technical/semantical, but thats how knowledge must be treated). so all things that are known is collectively everything that is knowable.\n \n there is an entity that has the ability to do everything that is possible, possesses all knowledge, and moves in mysterious ways\n \n therefoe God, by this definition, exists", 
   {}, 
   157212, 
   null, 
   1125090180.0
  ], 
  [
   157241, 
   null, 
   "Orion", 
   "God is an adolescent who, among other such godlets, is enrolled in cosmic junior high. The universe is his science project.", 
   {}, 
   157239, 
   null, 
   1125091020.0
  ], 
  [
   157244, 
   null, 
   "Kronus", 
   "nice.\n \n a few problems with the definition. what exactly is a \"mysterious way\". can we identify a mysterious way when it occurs? lets say i do something you dont understand or didnt expect. that would be me working in a mysterious way from your viewpoint, right?\n \n also, omnipotent: defined as the ability to do anything that can be possibly done. the impossible cannot be done by such a being.\n omniscient: defined as the having the knowledge of everything that can be known. the unknowable cannot be known\n \n ok, with these mini-definitions out of the way (provided we agree on them), we can identify things that are impossible (and therefore not required as an ability of God). such things include creating round squares, turning chalk into trees, and converting water into wine. if these things are possible, then God would be able to to them. however, i contend that these things are impossible, and out of the range of God's abilities\n \n as for knowledge, what is universally unknown is universally unknown, and we cannot determine if unknown knowledge exists or not. if unknown knowledge exists, it is not knowledge until it is known (it sounds kinda technical/semantical, but thats how knowledge must be treated). so all things that are known is collectively everything that is knowable.\n \n there is an entity that has the ability to do everything that is possible, possesses all knowledge, and moves in mysterious ways\n \n therefoe God, by this definition, exists\n\n \n Leaving your defintions aside for a bit (I'm not real happy with your take on omnipotent/onmiscient) at the end there you simply state that an entity which matches the defintions exists. You forgot to add the proof. :)", 
   {}, 
   157239, 
   null, 
   1125092280.0
  ], 
  [
   157389, 
   null, 
   "Alan Ryan", 
   "very well, sir. and thank you\n lets deal with the definition first. the being God is described as possessing \"every perfection\" and \"every positive attribute\". \n perfection is subjective, and defined by the judge of the thing, based on a subjective standard. there are no objective standards by which to determine, say, the perfect nose. is it a ratio to the area of the face, a certain length in millimeters and angle in degrees? a certain texture and surface finish? is there such a thing as a nose that no modifications could be made to? perfection only exists when the subjective judgement of the viewer says so.\n\n The ontological argument - to give it its \"correct\" label - has often been attacked on the grounds you have chosen. \n \n What you say about a nose is of course an aesthetic judgment and entirely subjective. But we are not talking about noses here; it's the idea of perfection we have in focus. Ideas are internal to the thinker and it is merely our judgment that relates to the external world. So we could have a perfect idea of a perfect being but still have faults in our judgement. Having an idea of perfection does not imply that the thinker is perfect in some way. \n \n You might further propose that it is possible to have other (godless) ideas that are also themselves in some way perfect - for instance the idea of a perfect square, say 3 x 3 = 9, an idea that cannot be false as it relates to and describes an aspect of perfection: no judgment is involved here. But such an idea doesn't prove the existence of anything, it merely demonstrates that it is possible for an imperfect being to have a concept of perfection. So if it is possible for an imperfect being to have an idea of a perfect square, isn't it also possible to have an idea of a perfect being without reference to the world that is external to the mind ?\n \n Ultimately, if we pursue this line of reasoning, we shall end up with the question of whether God did or did not give you an idea: something which I suspect will be impossible to prove - either way.\n \nthe phrase \"every positive attribute\" implies that a being can also possess negative and neutral attributes. the \"positivity\" of an attribute is also highly subjective. something is only positive when the majority agrees that it is. and whether something is positive or not also depends on the context. is killing someone a positive thing or a negative thing? it depends, largely on the consensus and on the context. is doing things to the approval of the consensus a positive thing? by definition it is. but what the majority deems as positive may not be good, which is negative. so, besides being subjective, a positive attribute can also be ambiguously defined\n\n This attack mimics the one on \"perfection\" and is susceptible to the same counter argument - i.e. that ideas of positive and negative attributes can be internal to the thinker and not necessarily subjective judgments relating to the external world. Consensus doesn't apply to the interior reasonings we are talking about. \n \n \nas for the proof, its really not a proof at all. if God is defined as a perfect being in reality, that does not mean that God exists. if i define a ufo as a flying spacecraft from another planet in reality, that does not make such things exist. its just a definition. i really dont see how that can be even considered a proof\n \n basically, the definition: \"a being possessing every perfection and every positive attribute\" is not a true definition, because both perfection and positive attributes are subjective. so theres really nothing to work with here\n \n God, by this definition, doesnt exist\n\n Well, according to Descartes, if I have an idea of a most perfect being, I shall distinctly perceive that such a being must contain all perfections - including reality in every degree. So this idea also contains existence. God's essence is to exist, and of no other thing can this be said. (Existence in everything else being contingent.) \n \n To refute these arguments, and some philosophers doubt they can be refuted, I think you will need to take another tack.", 
   {}, 
   157237, 
   null, 
   1125155640.0
  ], 
  [
   157805, 
   null, 
   "unkerpaulie", 
   "What you say about a nose is of course an aesthetic judgment and entirely subjective. But we are not talking about noses here; it's the idea of perfection we have in focus. Ideas are internal to the thinker and it is merely our judgment that relates to the external world. So we could have a perfect idea of a perfect being but still have faults in our judgement. Having an idea of perfection does not imply that the thinker is perfect in some way. \n\n yes, and i suppose an idea of perfection can exist, in a thinker's mind, and subjective to the thinker's standards of perfection. i could also point out that an imperfect thinker, with no reference or standard of \"objective\" perfection, is incapable of having a perfect idea of anything. therefore the argument falls apart at the first premise, since an \"idea of perfection\" cannot exist, unless the thinker himself is perfect, which would make him God by his own definition.\n \n \nYou might further propose that it is possible to have other (godless) ideas that are also themselves in some way perfect - for instance the idea of a perfect square, say 3 x 3 = 9, an idea that cannot be false as it relates to and describes an aspect of perfection: no judgment is involved here. But such an idea doesn't prove the existence of anything, it merely demonstrates that it is possible for an imperfect being to have a concept of perfection. So if it is possible for an imperfect being to have an idea of a perfect square, isn't it also possible to have an idea of a perfect being without reference to the world that is external to the mind ?\n\n i dont think you can describe 3 x 3 = 9 as a perfect square (unless you also define an \"imperfect square\", like 0.09, or 12). but i pretty much get your idea. the adjective \"perfect\" attached to something abstract (like an idea or principle) isnt as easily translated to something physical, like a being.\n \n \nWell, according to Descartes, if I have an idea of a most perfect being, I shall distinctly perceive that such a being must contain all perfections - including reality in every degree. So this idea also contains existence. God's essence is to exist, and of no other thing can this be said. (Existence in everything else being contingent.) \n \n To refute these arguments, and some philosophers doubt they can be refuted, I think you will need to take another tack.\n\n if i say to you that i possess in my mind the idea of a unicorn that exists in reality, does that make the existence of unicorns real? percieving somefthing in the mind is still a far cry from that thing being so. to me this is not a proof at all\n \n as for God's existence being incontingent, apparently, if descartes, or somebody else so inclined, didnt at first imagine the existence os a perfect being, then project this idea into reality on the basis of it being perfect in all aspects, then God's existence itself is contingent on descartes having such an idea in the first place, not to mention descartes' perspective and standard of perfection. this makes God's existence pretty contingent\n \n finally, an idea does not require translation into reality to be perfect. i believe that this in itself is a false premise. as you earlier pointed out, there are many concepts defined as \"perfect\" that cannot be translated into reality, and doesnt require it. why should the idea of a \"perfect\" God be any different?", 
   {}, 
   157389, 
   null, 
   1125337140.0
  ], 
  [
   157806, 
   null, 
   "unkerpaulie", 
   "Leaving your defintions aside for a bit (I'm not real happy with your take on omnipotent/onmiscient) at the end there you simply state that an entity which matches the defintions exists. You forgot to add the proof. :)\n\n i'd love to hear your take on my definitions of omnipotent/omniscient, which is why i left them open\n \n as for the proof: there exists, in reality, an entity that moves in mysterious ways (as per my definition), and possesses omnipotence and omniscience (as per my definitions)\n \n this entity is also known (collectively) as mankind", 
   {}, 
   157244, 
   null, 
   1125337320.0
  ], 
  [
   157814, 
   null, 
   "Kronus", 
   "i'd love to hear your take on my definitions of omnipotent/omniscient, which is why i left them open\n \n as for the proof: there exists, in reality, an entity that moves in mysterious ways (as per my definition), and possesses omnipotence and omniscience (as per my definitions)\n \n this entity is also known (collectively) as mankind\n\n \n Mankind is not an entity, it's a collection of entities, and so doesn't qualify. And mankind doesn't even meet all your defintions. Natural echo-location is possible, but we can't do it. Living in boiling water, or ice water, is possible, but we can't do it.\n \n \n Be that as it may, let's hit the definitions. I would use the standard ones.\n \n omniscient: Knows everything that has occured and is occuring right now. (Let's assume that knowledge of the future is not required)\n \n omnipotent: able to do anything that is not logically impossible.\n \n Logically impossible? For example, make a square circle, make 1+1=3, make a boulder so large he couldn't lift it. Everything else he could do, for example raise the dead, instant teleportation, matter transmutation.\n \n mysertious ways: Simply put, his motivations need not be clear to us, or even understandable.\n \n These are, I believe, the more common useage of those terms. Care to take another shot?", 
   {}, 
   157806, 
   null, 
   1125338880.0
  ], 
  [
   157821, 
   null, 
   "unkerpaulie", 
   "Mankind is not an entity, it's a collection of entities, and so doesn't qualify. And mankind doesn't even meet all your defintions. Natural echo-location is possible, but we can't do it. Living in boiling water, or ice water, is possible, but we can't do it.\n\n mankind can achieve echo-location, and live in boiling or freezing water. of course some extra devices are usually necessary, but i dont know if youd consider it \"unnatural\"\n \n \nBe that as it may, let's hit the definitions. I would use the standard ones.\n \n omniscient: Knows everything that has occured and is occuring right now. (Let's assume that knowledge of the future is not required)\n\n mine is slightly different: possessing all knowledge that currently exists (meaning that knowledge can be newly gained, or totally lost). could there be \"no knowledge of something that happened in the past\"? if no knowledge of something exists, then not having knowledge of it still makes you omniscient, doesnt it?\n \n \nomnipotent: able to do anything that is not logically impossible.\n\n \n Logically impossible? For example, make a square circle, make 1+1=3, make a boulder so large he couldn't lift it. Everything else he could do, for example raise the dead, instant teleportation, matter transmutation.[/quote]\n raising the dead would require the reversal of irreversable chemical reactions. these chemicals react based on the laws of nature. how logical is it to override a law of nature on a substance subject to the laws of nature? the same could be said about the other feats you listed\n \n \nmysertious ways: Simply put, his motivations need not be clear to us, or even understandable.\n\n covered, and in agreement.\n \n the internal definition are what we can further fine-tune. once i get your final say on these definitions i'll recalculate God's existence", 
   {}, 
   157814, 
   null, 
   1125340860.0
  ], 
  [
   157823, 
   null, 
   "Kronus", 
   "mankind can achieve echo-location, and live in boiling or freezing water. of course some extra devices are usually necessary, but i dont know if youd consider it \"unnatural\"\n\n Until you can show me a baby who was born wearing a dry suit I will consider them unnatural, yes. :)\n \n \n\n mine is slightly different: possessing all knowledge that currently exists (meaning that knowledge can be newly gained, or totally lost). could there be \"no knowledge of something that happened in the past\"? if no knowledge of something exists, then not having knowledge of it still makes you omniscient, doesnt it?\n\n No. Omniscience doesn't mean that you know everything that everyone else knows, it mean you know everything, past and present.\n \n \n\n raising the dead would require the reversal of irreversable chemical reactions. these chemicals react based on the laws of nature. how logical is it to override a law of nature on a substance subject to the laws of nature? the same could be said about the other feats you listed\n \n\n The first steam boat to cross the Atlantic carried a book proving that it was impossible for a steam boat to cross the Atlantic. That which you are calling physically impossible could be quite possible to someone with a deeper grasp of, or the ability to manipulate, the basic laws of nature. If you could imagine it, an onmipotent being could do it.\n \n \n\n the internal definition are what we can further fine-tune. once i get your final say on these definitions i'll recalculate God's existence\n\n Seems to me that since you issued the challenge, you really should use the defintions provided to you. You asked for our defintions of God, and I've supplied that, along with definitions of the terms I used. If you need further clarification that's fine, but you shouldn't be providing alternate definitions.", 
   {}, 
   157821, 
   null, 
   1125342240.0
  ], 
  [
   157845, 
   null, 
   "unkerpaulie", 
   "those are not alternate definitions, but clarification requests\n \n for example, omniscience means possession of knowledge of all things, past and present (your definition). my question is, does the knowledge of what lies at the bottom of the deepest abyss in the ocean exist? does knowledge of what lies beyond the scope of the hubble exist? because non-existent knowledge need not apply in the definition.\n \n also, omnipotent means having the ability to do anything logically possible (your definition again). is overriding the laws of physics logically possible? is it logically possible for 2 like poles to attract? is it logically possible for 2 objects to exert different opposite forces on each other? because overriding the laws of physics is but a small step from saying 1+1=3, which you already declared as an impossibility. so, what exactly logically possible? think about it\n \n my questions to you only serve to fine tune the definitions you gave, to make sure we cover all bases and no sematic or technical problems come up later. im sure you can live with that", 
   {}, 
   157823, 
   null, 
   1125347520.0
  ], 
  [
   157853, 
   null, 
   "Kronus", 
   "those are not alternate definitions, but clarification requests\n \n for example, omniscience means possession of knowledge of all things, past and present (your definition). my question is, does the knowledge of what lies at the bottom of the deepest abyss in the ocean exist? does knowledge of what lies beyond the scope of the hubble exist? because non-existent knowledge need not apply in the definition.\n \n also, omnipotent means having the ability to do anything logically possible (your definition again). is overriding the laws of physics logically possible? is it logically possible for 2 like poles to attract? is it logically possible for 2 objects to exert different opposite forces on each other? because overriding the laws of physics is but a small step from saying 1+1=3, which you already declared as an impossibility. so, what exactly logically possible? think about it\n \n my questions to you only serve to fine tune the definitions you gave, to make sure we cover all bases and no sematic or technical problems come up later. im sure you can live with that\n\n \n I'm afraid you are giving different definitions, although unintentionally. I did not say that omniscience meant possesing all knowledge, I said it meant knowing everything. The difference, as you point out, is that knowledge is accumulated information. Omniscience is not having access to all acquired info, it's having access to all info, period.\n \n And I do believe I answered your question about omnipotence before. Is it logically possible to overcome the laws of nature? Yes, it is. We know for a fact that we don't know or fully understand all of the laws of nature, therefore logcially we cannot preclude the possiblity that they are mutable in some way. The fact that we don't know how to do it does not make it logically impossible.\n \n Everything clear?", 
   {}, 
   157845, 
   null, 
   1125349020.0
  ], 
  [
   157869, 
   null, 
   "unkerpaulie", 
   "Everything clear?\n\n i'm afraid not. it cannot be logical to break the rules of physics, yet adhere to the rule that 1+1=3. if it is logical to override the laws of physics, then it is logical to state that 1+1=3, which is illogical. if both is true for God, then God is self-contradictory and cannot exist", 
   {}, 
   157853, 
   null, 
   1125351180.0
  ], 
  [
   157878, 
   null, 
   "Kronus", 
   "i'm afraid not. it cannot be logical to break the rules of physics, yet adhere to the rule that 1+1=3. if it is logical to override the laws of physics, then it is logical to state that 1+1=3, which is illogical. if both is true for God, then God is self-contradictory and cannot exist\n\n \n Not at all true. It was a law of physics that F=ma, until Einstien came along and showed that that law doesn't work near the speed of light, and isn't even really true at mundane speeds. We have no \"root cause\" for how the laws of physics work, so there's no reason to believe that they're carved in stone. There may be ways around any or all of them, for all we know. The same cannot be said for simple arithmetic. Math is grounded in logic, so for math to fail logic must fail. Physics is grounded in observation, and it can fail if the observations missed something, which is not hard to imagine.", 
   {}, 
   157869, 
   null, 
   1125353040.0
  ], 
  [
   157927, 
   null, 
   "PoohBear", 
   "\n \n God, by this definition, doesnt exist\n\n \n \n im sorry what definition?? your sorry excuse for a belief called evolution?", 
   {}, 
   157237, 
   null, 
   1125366240.0
  ], 
  [
   158008, 
   null, 
   "unkerpaulie", 
   "Not at all true. It was a law of physics that F=ma, until Einstien came along and showed that that law doesn't work near the speed of light, and isn't even really true at mundane speeds. We have no \"root cause\" for how the laws of physics work, so there's no reason to believe that they're carved in stone. There may be ways around any or all of them, for all we know. The same cannot be said for simple arithmetic. Math is grounded in logic, so for math to fail logic must fail. Physics is grounded in observation, and it can fail if the observations missed something, which is not hard to imagine.\n\n the laws of physics do not change. an undiscovered law always exists. einstienian physics did not become true when einstien discovered it. it was always true\n \n both physics and math are grounded in logic. the laws of physics are consistent and reliable because math is consistent and reliable. physics can be and is defined into mathematical formulae. whether we know the formulae or not, the formulae always hold. manipulating the laws of physics would be the same as putting the variables 1 and 1 into the formula a+b=c, and getting a result of 3", 
   {}, 
   157878, 
   null, 
   1125414360.0
  ], 
  [
   158009, 
   null, 
   "unkerpaulie", 
   "im sorry what definition?? your sorry excuse for a belief called evolution?\n\n read the thread. evolution was never mentioned", 
   {}, 
   157927, 
   null, 
   1125414420.0
  ], 
  [
   158029, 
   null, 
   "Kronus", 
   "the laws of physics do not change. an undiscovered law always exists. einstienian physics did not become true when einstien discovered it. it was always true\n\n If there are fundamental laws then they might always be true, but we don't know that the laws we have are those laws. We thought F=ma was true, but it isn't. We think Einstien's laws are correct, but we can't be sure\n \n \n\n both physics and math are grounded in logic.\n\n This is absolutely not true, and is clearly the source of your confusion. Math is, as you say, based on logic. Physics is not. It absolutely isn't. It's based on observation and reasoning. To get F=ma we did not sit down with some axioms and manipulate them according to logical rules until we reached our conclusion (which is how we derive everything in math). We applied forces to masses and measured the acceleration. The relationship F=ma always emerged and so we figured it always would. That's good reasoning, but it isn't logic. There is no logical basis to assume that F=ma will always hold. If, for example, someone could manipulate the strings which make up the subatomic particles in our mass they could, theoretically, decouple the mass and the inertia, so that the mass would decrease while the inertia stays the same. In that case the new equation could be F=2ma. There is nothing that makes this a logical impossibility.\n \n \nwhether we know the formulae or not, the formulae always hold.\n\n Just to hammer home the point, we have no way of knowing that the formulae we use are in fact the correct formulae. F=ma has been shown to be wrong, who knows what else we believe to be correct is also wrong? We believe something to be physically impossible now, based on our current understanding of physics, but that doesn't logically mean that there's no way to do it. It just means that we don't know how. Physics is not based on logic, which we can be sure of, but on observation and reason, which always carries the possiblity of error and incompleteness.", 
   {}, 
   158008, 
   null, 
   1125417780.0
  ], 
  [
   158095, 
   null, 
   "unkerpaulie", 
   "This is absolutely not true, and is clearly the source of your confusion. Math is, as you say, based on logic. Physics is not. It absolutely isn't. It's based on observation and reasoning. To get F=ma we did not sit down with some axioms and manipulate them according to logical rules until we reached our conclusion (which is how we derive everything in math). We applied forces to masses and measured the acceleration. The relationship F=ma always emerged and so we figured it always would. That's good reasoning, but it isn't logic. There is no logical basis to assume that F=ma will always hold. If, for example, someone could manipulate the strings which make up the subatomic particles in our mass they could, theoretically, decouple the mass and the inertia, so that the mass would decrease while the inertia stays the same. In that case the new equation could be F=2ma. There is nothing that makes this a logical impossibility.\n\n kronus, apparently you think that logic and reasoning are 2 unrelated and mutually exclusive disciplines. they are not. even though the laws of physics are derived by observation and reasoning, none of them would work without the logic of math. the law that states that energy is never created or destroyed, but only transfered (for example) would only work if 1+1=2. thats where the logic comes in. at some point the variables must be substituted with values, and the values must abide by the rules of logic to produce a logical result\n \n if the God of your definition can input values into the same formula, and get results different from that of math under logic, then he is illogical\n \n \nJust to hammer home the point, we have no way of knowing that the formulae we use are in fact the correct formulae. F=ma has been shown to be wrong, who knows what else we believe to be correct is also wrong? We believe something to be physically impossible now, based on our current understanding of physics, but that doesn't logically mean that there's no way to do it. It just means that we don't know how. Physics is not based on logic, which we can be sure of, but on observation and reason, which always carries the possiblity of error and incompleteness.\n\n what does us knowing the formulae have to do with anything?\n \n if the God of your definition can, say, turn water into wine, then the process by which water is turned into wine must be a logical one, governed by the laws of physics, regardless of if these laws are known to us. whether we are aware of the law that allows water to do this is irrelevant, as long as it exists, and the variables can be reinputted to get the same results. this is the way logic works, 1+1 will always be 2.\n \n are you suggesting, implicit of your definition, that the feats which are possible by God, such as raising the dead, are bound by the the same rules of logic that govern the addition of 1 and 1?", 
   {}, 
   158029, 
   null, 
   1125435300.0
  ], 
  [
   158101, 
   null, 
   "Kronus", 
   "kronus, apparently you think that logic and reasoning are 2 unrelated and mutually exclusive disciplines. they are not. even though the laws of physics are derived by observation and reasoning, none of them would work without the logic of math. the law that states that energy is never created or destroyed, but only transfered (for example) would only work if 1+1=2. thats where the logic comes in. at some point the variables must be substituted with values, and the values must abide by the rules of logic to produce a logical result\n \n if the God of your definition can input values into the same formula, and get results different from that of math under logic, then he is illogical\n \n\n \n Logic and reasoning are related but distinct entities, the major difference being that logic is much more rigorous. Properly constructed logic must be correct, and its correctness can be demonstrated. The best one can say for a line of reasoning is that it seems correct, given what we know. It's correctness can not be demonstrated with the 100% certainty that a logical conclusion can be.\n \n As for the rest of what you say, please read my post again. I give a very clear example of how what we call a law of physics could be completely invalidated without having to violate math or logic. And allow me to expand on that example. You say that there are laws of physics, know or unknown. We don't know that. It is possible that all the things that we call physical constants are in fact malliable, if you know how to do it. All the relationships that we think are fact, like F=ma, may be adjustable. We don't know the root cause of anything in physics, and given that we can't say that the root cause is fixed. It is logically possible that the underlying nature of reality is completely malliable to one who knows how to do it, and such a person would be able to do pretty much anything that you could imagine, simply by rewriting the \"laws\" to suit themselves.", 
   {}, 
   158095, 
   null, 
   1125437880.0
  ], 
  [
   158117, 
   null, 
   "Ripskar", 
   "How do you define existance?\n God would seem to require a new definition of existance assuming he doesn't just exist between the ears of believers...\n Seems to reflect believers own views certainly amongst the more fanatical groups.", 
   {}, 
   158101, 
   null, 
   1125442260.0
  ], 
  [
   158173, 
   null, 
   "PoohBear", 
   "read the thread. evolution was never mentioned\n\n \n \n i mentioned it! i dont know where you are?", 
   {}, 
   158009, 
   null, 
   1125459600.0
  ], 
  [
   158213, 
   null, 
   "simone", 
   "Hmmm, God, if there is a God. . . .", 
   {}, 
   158173, 
   null, 
   1125498120.0
  ], 
  [
   158222, 
   null, 
   "unkerpaulie", 
   "i'm backtracking a little to remind you of a post you made earlier in the thread\n \nThat which you are calling physically impossible could be quite possible to someone with a deeper grasp of, or the ability to manipulate, the basic laws of nature. If you could imagine it, an onmipotent being could do it.\n\n now lets combine this with your more recent comments\n \nWe don't know the root cause of anything in physics, and given that we can't say that the root cause is fixed. It is logically possible that the underlying nature of reality is completely malliable to one who knows how to do it, and such a person would be able to do pretty much anything that you could imagine, simply by rewriting the \"laws\" to suit themselves.\n\n ok. let's assume that x is something we can imagine an omnipotent God doing. this would mean that our omnipotent God can actually do x in reality (from the descartes argument). God's ability to do x in reality would imply that turning water into wine is a logical process (since God cannot do the illogical). the process of x, therefore, must be governed by existing laws of physics, even if these laws dictate that constants can be possibly manipulated\n \n now substitute x for turning water into wine, raising the dead, teleporting solid objects, etc (remember, as long as you can imagine it, you can substitute for x)\n \n does that sum it up correctly?", 
   {}, 
   157823, 
   null, 
   1125501600.0
  ], 
  [
   158227, 
   null, 
   "Kronus", 
   "\n \n ok. let's assume that x is something we can imagine an omnipotent God doing. this would mean that our omnipotent God can actually do x in reality (from the descartes argument). God's ability to do x in reality would imply that turning water into wine is a logical process (since God cannot do the illogical). the process of x, therefore, must be governed by existing laws of physics, even if these laws dictate that constants can be possibly manipulated\n \n now substitute x for turning water into wine, raising the dead, teleporting solid objects, etc (remember, as long as you can imagine it, you can substitute for x)\n \n does that sum it up correctly?\n\n \n It's close. The only yellow flag I see is the use of the word law, which I have been playing a little fast and loose with. A law in physics is generally considered immutable. What I'm proposing is that it is logically possible that there are no immutable laws, although I can't think of a term to describe such a thing. It is logically possible that anything which appears to be a physical law or a constant is in fact changable. An omnipotent being would have the ability to do so at will.\n \n And just a quick nit pick. You said that God cannot do the illogical. He certainly could act illogically, that would fall under the \"acts in mysterious ways\" clause. He just can't do the logically impossible. I'm sure that's what you meant, but I wanted to make sure.", 
   {}, 
   158222, 
   null, 
   1125503280.0
  ], 
  [
   158229, 
   null, 
   "Kronus", 
   "i mentioned it! i dont know where you are?\n\n \n We're in a thread having an intelligent discussion. You're trying to hijack it, and we'd appreciate it if you didn't. If you have anything relevent to contribute then that's another matter.", 
   {}, 
   158173, 
   null, 
   1125503400.0
  ], 
  [
   158236, 
   null, 
   "Alan Ryan", 
   "I've attempted to respond to this post a couple of times, but my computer \"thinks\" this thread is cursed, and has managed to scramble my text on each occasion. So I'll have another try.\n \nyes, and i suppose an idea of perfection can exist, in a thinker's mind, and subjective to the thinker's standards of perfection. i could also point out that an imperfect thinker, with no reference or standard of \"objective\" perfection, is incapable of having a perfect idea of anything. therefore the argument falls apart at the first premise, since an \"idea of perfection\" cannot exist, unless the thinker himself is perfect, which would make him God by his own definition.\n\n It is not impossible for an imperfect thinker to have an idea of a being greater than which nothing can be thought - i.e. a \"perfect\" entity. Consider: if my introspection has convinced me that I not only exist as a thinking \"organism\", but also that I am prone to error, that my knowledge of the external world is patchy at best, and that I am limited in all my endeavours etc. - then I can conclude that my nature is finite and imperfect.\n \n But how can I think of my imperfection without the associated idea of its opposite ? How can I describe myself in these terms except by contrast with the contrary ? These skeptical reflections lead back to the assurance that I am capable of having the original idea (of perfection) and that I do not need to be the perfect God almighty in order to think about perfection.\n \n \ni dont think you can describe 3 x 3 = 9 as a perfect square (unless you also define an \"imperfect square\", like 0.09, or 12). but i pretty much get your idea. the adjective \"perfect\" attached to something abstract (like an idea or principle) isnt as easily translated to something physical, like a being.\n\n A rectangle with equilateral sides is a perfect square - so my illustration that 3 x 3 = 9 and thus a perfect square, does not need to be contrasted with an \"imperfect\" square; it is perfect by definition.\n \n \n\n if i say to you that i possess in my mind the idea of a unicorn that exists in reality, does that make the existence of unicorns real? percieving somefthing in the mind is still a far cry from that thing being so. to me this is not a proof at all\n\n The fact that a fiction can be imagined does not provide an analogy that shows how the ontological argument can be refuted. We are not discussing imaginary animals, but whether an imperfect being can have an idea of perfection.\n \n \nas for God's existence being incontingent, apparently, if descartes, or somebody else so inclined, didnt at first imagine the existence os a perfect being, then project this idea into reality on the basis of it being perfect in all aspects, then God's existence itself is contingent on descartes having such an idea in the first place, not to mention descartes' perspective and standard of perfection. this makes God's existence pretty contingent\n\n This is the best argument you've come up with: there is a problem with the subjectivity of the idea of the perfect God (indeed all abstract ideas) - unless we agree with Descartes and think that we can rely on the absolute integrity of our reasoning powers. This \"integrity\" is obviously open to doubt and can be criticised by the observation that our reason is and only can be applied from our own point of view - which is that of limited and experience-bound creatures who are part of nature.", 
   {}, 
   157805, 
   null, 
   1125505500.0
  ], 
  [
   158250, 
   null, 
   "unkerpaulie", 
   "It's close. The only yellow flag I see is the use of the word law, which I have been playing a little fast and loose with. A law in physics is generally considered immutable. What I'm proposing is that it is logically possible that there are no immutable laws, although I can't think of a term to describe such a thing. It is logically possible that anything which appears to be a physical law or a constant is in fact changable. An omnipotent being would have the ability to do so at will.\n\n if there are indeed no immutable laws in physics, then that in itself must be an immutable law of physics. physics is a logical discipline because it provides consistent and replicable results for the same input. for example, if you exert a force downward on an object, that object will exert a force of equal magnitude upward on you. if, by some means, you could exert a force downard on an object, and not experience an equal and opposite force upward on you, then this law would be an immutable law. it would mean that the forces do no balance, that the sides of the equation do not add up, that 1+1 is not 2.\n \n the laws of physics work because they adhere to the laws of logic. both are intertwined. if the application of a law of physics can produce a certain result today, and a different result tomorrow, then either a new law is in effect, or an illogical phenomenon has occured\n \n anyway, the point of my \"summation\" is that if God exists, then anything we can possibly imagine becomes a law of physics and a logical occurance. God's existence would mean that walking in thin air, breathing in lava, reanimating rocks and travelling through time are all logical. in fact, it would mean that it is impossible to imagine the illogical, and whatever can be possibly imagined is already logical and in harmony with the existing laws of physics.\n \n if God exists, nothing is illogical as long as it is conceivable\n \nAnd just a quick nit pick. You said that God cannot do the illogical. He certainly could act illogically, that would fall under the \"acts in mysterious ways\" clause. He just can't do the logically impossible. I'm sure that's what you meant, but I wanted to make sure.\n\n perhaps you mean irrational? mysterious only means unexpected or misunderstood by the observer. a \"mysterious way\" to a 5 year old may be a common feat for an adult. it doesnt make it less \"mysterious\"", 
   {}, 
   158227, 
   null, 
   1125508200.0
  ], 
  [
   158261, 
   null, 
   "unkerpaulie", 
   "It is not impossible for an imperfect thinker to have an idea of a being greater than which nothing can be thought - i.e. a \"perfect\" entity. Consider: if my introspection has convinced me that I not only exist as a thinking \"organism\", but also that I am prone to error, that my knowledge of the external world is patchy at best, and that I am limited in all my endeavours etc. - then I can conclude that my nature is finite and imperfect.\n\n yes, and so is everyone else that might be thinking up a great being. even if we combine all the best ideas and attributes that all the thinkers came up with, and made the greatest possible being imaginable, or a being greater than which no being can be conceived, would it qualify as perfect? is the limit of man's conceptuality where perfect begins? what if there's a gap between man's best possible idea, and objective perfection? i contend that imperfect and finite man cannot even have a clue as to how perfect their \"greatest being conceivable\" is. it may be that perfect and greatest concievable may not even be close.\n \n \nBut how can I think of my imperfection without the associated idea of its opposite ? How can I describe myself in these terms except by contrast with the contrary ? These skeptical reflections lead back to the assurance that I am capable of having the original idea (of perfection) and that I do not need to be the perfect God almighty in order to think about perfection.\n\n we can define infinity as a number that can never be counted to. the incapacity to attain infinity does not prevent us from recognizing what is finite. similarly, perfection, even if unattainable, is still a useful measure in that it efines what is imperfect: anything less than perfect. the largest number conceivable is not infinity.\n \n \nA rectangle with equilateral sides is a perfect square - so my illustration that 3 x 3 = 9 and thus a perfect square, does not need to be contrasted with an \"imperfect\" square; it is perfect by definition.\n\n there is no difference between a \"square\" and a \"perfect square\" then, and neither \"perfect squares\" nor \"imperfect sqaures\" are necessary. a square cannot be more or less perfect than what is defined as a square. either a figure is a aqsuare, or it is not. degrees of \"square-ness\" do not exist\n \n \nThe fact that a fiction can be imagined does not provide an analogy that shows how the ontological argument can be refuted. We are not discussing imaginary animals, but whether an imperfect being can have an idea of perfection.\n\n the \"proof\" of the ontological argument is simply: since the greatest being imaginable would be greater existing in rality than a being that only exists in the mind, then this greatest being imaginable must exist in reality\n \n this is really a very shabby \"proof\". in fact, this is no proof at all. you start off with a hypothetical situation, and end up stating that since the hypothetical situation requires the existence of something, then that thing must exist... that doesnt sound like a proof to me. in fact, its really no different from my unicorn example", 
   {}, 
   158236, 
   null, 
   1125509820.0
  ], 
  [
   158267, 
   null, 
   "Kronus", 
   "if there are indeed no immutable laws in physics, then that in itself must be an immutable law of physics. physics is a logical discipline because it provides consistent and replicable results for the same input. for example, if you exert a force downward on an object, that object will exert a force of equal magnitude upward on you. if, by some means, you could exert a force downard on an object, and not experience an equal and opposite force upward on you, then this law would be an immutable law. it would mean that the forces do no balance, that the sides of the equation do not add up, that 1+1 is not 2.\n \n\n Today F=ma. You insist on calling that logical. What if tomorrow an omnipotent being changes the law such that F=2ma? Is that illogical? No, as long as when m=1 and a=1, you get F=2. And if the day after F=10ma we're still following logic, as long as when m=1 and a=1, F=10. Everything still adds up, logic and math still work, but you're getting different answers because the law is being changed.\n \n \n \n\n the laws of physics work because they adhere to the laws of logic. both are intertwined. if the application of a law of physics can produce a certain result today, and a different result tomorrow, then either a new law is in effect, or an illogical phenomenon has occured\n \n\n Exactly! An omnipotent being could cause a new law to be in effect.\n \n \n \n\n anyway, the point of my \"summation\" is that if God exists, then anything we can possibly imagine becomes a law of physics and a logical occurance. God's existence would mean that walking in thin air, breathing in lava, reanimating rocks and travelling through time are all logical. in fact, it would mean that it is impossible to imagine the illogical, and whatever can be possibly imagined is already logical and in harmony with the existing laws of physics.\n \n\n That last bit is so clearly wrong that I have to assume I'm missing your point. We have what appear to be physical laws to us, which make certain things impossible for us. Just because an omnipotent being could change the laws that doesn't mean he has or will. Until a law gets changed we're still bound by it, and so many things are still impossible for us. The existence of an omnipotent being doesn't make everything possible for everyone, just for the omnipotent being. Put another way, just because an OB could turn off gravity doesn't mean there isn't any gravity now.", 
   {}, 
   158250, 
   null, 
   1125512280.0
  ], 
  [
   158302, 
   null, 
   "unkerpaulie", 
   "That last bit is so clearly wrong that I have to assume I'm missing your point. We have what appear to be physical laws to us, which make certain things impossible for us. Just because an omnipotent being could change the laws that doesn't mean he has or will. Until a law gets changed we're still bound by it, and so many things are still impossible for us. The existence of an omnipotent being doesn't make everything possible for everyone, just for the omnipotent being. Put another way, just because an OB could turn off gravity doesn't mean there isn't any gravity now.\n\n hold on. can God transform a bucket of sand into a bucket of water? if the answer is yes, then such a transformation must be logical. also, if this can be done by changing the laws of physics, that would mean that the laws are currently changeable.\n \n therefore either laws of nature are constant, or God exists\n \n you say that maybe they are changeable. its either they are or not. and if they are not, then God, by your definition, doesnt exist", 
   {}, 
   158267, 
   null, 
   1125520140.0
  ], 
  [
   158306, 
   null, 
   "Kronus", 
   "hold on. can God transform a bucket of sand into a bucket of water? \n\n yes\n \n \n\n if the answer is yes, then such a transformation must be logical. \n\n That's a weird use of the word logical, I'd say possible, or not logically impossible. But whatever.\n \n \n\n also, if this can be done by changing the laws of physics, that would mean that the laws are currently changeable.\n therefore either laws of nature are constant, or God exists\n \n\n Yes, for something to be omnipotent there must be some way to change what we call the laws of nature.\n \n \n\n you say that maybe they are changeable. its either they are or not. and if they are not, then God, by your definition, doesnt exist\n\n If we knew that the laws were utterly unchangeable, then we would know that an omnipotent being could not exist. We don't know that the laws are unchangable, therefore the existence of an OB is logically possible.", 
   {}, 
   158302, 
   null, 
   1125520620.0
  ], 
  [
   158484, 
   null, 
   "Alan Ryan", 
   "\n the \"proof\" of the ontological argument is simply: since the greatest being imaginable would be greater existing in rality than a being that only exists in the mind, then this greatest being imaginable must exist in reality\n \n this is really a very shabby \"proof\". in fact, this is no proof at all. you start off with a hypothetical situation, and end up stating that since the hypothetical situation requires the existence of something, then that thing must exist... that doesnt sound like a proof to me. in fact, its really no different from my unicorn example\n\n You describe the ontological argument as \"shabby\" ( by which you mean it's threadbare, I suppose ?), yet you have failed to refute it. It's curious that you have chosen to edit out my concession on your only line of attack that has anything to commend it - I'm talking here about the argument (originated by Kant) which shows that we can rely on our reasoning powers only as long as they are applied from our own point of view. If we emancipate reason from the constraints of experience, it falls into self-induced illusions: this is why a \"knowledge\" of God's existence arrived at through the introspective procedure attributed to Descartes, is not persuasive. \n \n There are three arguments for God's existence, supposedly based on pure reason, that are still \"live issues\" for modern students of philosophy: the teleological argument; the cosmological argument; and the ontological argument. We have only scratched the surface of one of them. Yet you seem to assume a certain air of almost smug satisfaction that you have succeeded in answering questions raised through the centuries by a number of profound thinkers whose ideas are still seriously discussed by professional philosophers.\n \n We should be careful not to patronise, with mere intuitions, achievements in \"applied rationality\" - among which might be counted the ontological argument for the existence of God.", 
   {}, 
   158261, 
   null, 
   1125570060.0
  ], 
  [
   158504, 
   null, 
   "unkerpaulie", 
   "You describe the ontological argument as \"shabby\" ( by which you mean it's threadbare, I suppose ?), yet you have failed to refute it.\n\n i'll try to break down the proof of the ontological argument and maybe we can see how this proof really works, and why it doesnt really seem to be any type of proof at all, to me\n \n lets define God as a being which no greater being can be imagined\n this imagined being would be even greater if it actually existed in reality\n therefore this being must exist in reality to be as great as we imagine it to be\n \n did i miss anything?\n \n ok\n \n lets define a unicorn as the greatest horse-like animal with a horn on its head than can be imagined\n this imagined being would be even greater if it actually existed in reality\n therefore this unicorn must exist in reality to be as great as i imagine it to be\n \n proof that unicorns exist\n \n sounds kinda shabby, doesnt it?", 
   {}, 
   158484, 
   null, 
   1125587340.0
  ], 
  [
   158511, 
   null, 
   "Alan Ryan", 
   "i'll try to break down the proof of the ontological argument and maybe we can see how this proof really works, and why it doesnt really seem to be any type of proof at all, to me\n \n lets define God as a being which no greater being can be imagined\n this imagined being would be even greater if it actually existed in reality\n therefore this being must exist in reality to be as great as we imagine it to be\n \n did i miss anything?\n \n ok\n \n lets define a unicorn as the greatest horse-like animal with a horn on its head than can be imagined\n this imagined being would be even greater if it actually existed in reality\n therefore this unicorn must exist in reality to be as great as i imagine it to be\n \n proof that unicorns exist\n \n sounds kinda shabby, doesnt it?\n\n \n \n If we defined a unicorn as a being greater than which nothing can be thought (not imagined) which is how Anselm defined God, then \"unicorn\" would just be another word for \"God\". \n \n The ontological argument isn't at all \"shabby\": it's ingenious, and has been examined by the philosophically inclined for centuries. It does not persuade me for the reasons which I gave in the first paragraph of my last post.\n \n I'm surprised at your glib confidence that you can refute the argument in a mere twinkling and without paying any attention to Kant's very powerful critique.", 
   {}, 
   158504, 
   null, 
   1125588360.0
  ], 
  [
   158519, 
   null, 
   "unkerpaulie", 
   "If we defined a unicorn as a being greater than which nothing can be thought (not imagined) which is how Anselm defined God, then \"unicorn\" would just be another word for \"God\". \n \n The ontological argument isn't at all \"shabby\": it's ingenious, and has been examined by the philosophically inclined for centuries. It does not persuade me for the reasons which I gave in the first paragraph of my last post.\n\n i fail to see the distinction between \"thought\" and \"imagined\"\n \n lets, then, define a unicorn as a horse-like animal with a horn on its head that exists in reality\n since this is our definition of a unicorn, a unicorn must exist\n \n the ontological argument starts off with a very arbitrary definition of God as its first premise, then, based on that definition, concludes that God must exist, since the definition requires it. how is that any different from my proof that unicorns exist?", 
   {}, 
   158511, 
   null, 
   1125589260.0
  ], 
  [
   158535, 
   null, 
   "Alan Ryan", 
   "i fail to see the distinction between \"thought\" and \"imagined\"\n \n lets, then, define a unicorn as a horse-like animal with a horn on its head that exists in reality\n since this is our definition of a unicorn, a unicorn must exist\n \n the ontological argument starts off with a very arbitrary definition of God as its first premise, then, based on that definition, concludes that God must exist, since the definition requires it. how is that any different from my proof that unicorns exist?\n\n \n You can imagine anything you like: a unicorn with two heads, another with seventeen heads etc. But the ontological argument isn't concerned with stuff you can imagine; it's concerned with a theory of existence that is arrived at by the use of \"pure reason\".\n \n You are mixing up categories, so I'll put it another way. Ontology is the theory of existence, or more cautiously, of what really exists as opposed to that which appears to exist but does not. \n \n Some aficionados of ontology claim that many things exist that are not commonly acknowledged to do so - such as abstract entities, and what Kant called \"things-in-themselves\" which are inaccessible to empirical verification. Others have argued that many things commonly thought to exist, do not - e.g. material things and the theoretical entities of natural science. (Haven't you heard about Bishop Berkeley's phenomenalism and the story of how Samuel Johnson refuted it ?)", 
   {}, 
   158519, 
   null, 
   1125591360.0
  ], 
  [
   158539, 
   null, 
   "unkerpaulie", 
   "You can imagine anything you like: a unicorn with two heads, another with seventeen heads etc. But the ontological argument isn't concerned with stuff you can imagine; it's concerned with a theory of existence that is arrived at by the use of \"pure reason\".\n \n You are mixing up categories, so I'll put it another way. Ontology is the theory of existence, or more cautiously, of what really exists as opposed to that which appears to exist but does not. \n \n Some aficionados of ontology claim that many things exist that are not commonly acknowledged to do so - such as abstract entities, and what Kant called \"things-in-themselves\" which are inaccessible to empirical verification. Others have argued that many things commonly thought to exist, do not - e.g. material things and the theoretical entities of natural science. (Haven't you heard about Bishop Berkeley's phenomenalism and the story of how Samuel Johnson refuted it ?)\n\n you are not answering the question. anslem's definition of God is what he uses to propel his argument and subsequent proof. my definition of a unicorn, or any other \"thought\" being i'd like to think up, would be just as valid in my argument and proof for the existence of that thing. how is it that a hypothetical being, defined as required to exist, can be concluded to exist in reality? there is no limit to the amount of hypothetical beings that can be thought up, and defined as required to exist. that does not make them exist in reality\n \n i have a serious problem with you discounting the validity of my perspective simply because i am not relying on kant or any other historical critic of the argument. i also deliberately omit allusions to these classical critiques because i am tackling this argument from my own perspective. its not that i think i am intellectually superior or anything, because i dont. however i would appreciate if you dont presume that i am intellectually inferior to them either. i dont mind you sharing their perspective or methods, and i dont mind you using their rebuttals to refute my arguments either, but please dont discard my arguments as invalid if you havent even addressed them </rant<", 
   {}, 
   158535, 
   null, 
   1125592560.0
  ], 
  [
   158544, 
   null, 
   "Alan Ryan", 
   "you are not answering the question. anslem's definition of God is what he uses to propel his argument and subsequent proof. my definition of a unicorn, or any other \"thought\" being i'd like to think up, would be just as valid in my argument and proof for the existence of that thing. how is it that a hypothetical being, defined as required to exist, can be concluded to exist in reality? there is no limit to the amount of hypothetical beings that can be thought up, and defined as required to exist. that does not make them exist in reality\n \n i have a serious problem with you discounting the validity of my perspective simply because i am not relying on kant or any other historical critic of the argument. i also deliberately omit allusions to these classical critiques because i am tackling this argument from my own perspective. its not that i think i am intellectually superior or anything, because i dont. however i would appreciate if you dont presume that i am intellectually inferior to them either. i dont mind you sharing their perspective or methods, and i dont mind you using their rebuttals to refute my arguments either, but please dont discard my arguments as invalid if you havent even addressed them </rant<\n\n I have explained the introspective nature of the argument several times: I have conceded that it is open to doubt because our reasoning powers are reliable only so long as they are applied from our own point of view. I could also have added (which I did not for the sake of simplicity) that the argument assumes that existence is a true predicate: in other words when listing the properties of a thing, I am entitled to list existence as one of them. I shall leave you to point out the deficiency in this proposition.\n \n I drew your attention to the input of Kant and Descartes on this matter not because I want to overpower you with sciolism, but because you insisted on describing the whole argument as \"shabby\": this struck me as rather glib and suggested a shallow perspective. The ontological argument has some deeper resonances than you appear willing to give it credit for. \n \n If you are unhappy with our exchanges because you feel that your point of view is being discounted on frivolous grounds, then I can assure you that was not my intention", 
   {}, 
   158539, 
   null, 
   1125594000.0
  ], 
  [
   159307, 
   null, 
   "Ripskar", 
   "For the imagined perfect being argument, God is merely a Meme.\n ie, it only exists in your head.\n \n Then there is God the Creator; Whilst the Universe may have causes to say that these amount to a deity effectivly creates an Universal Sun God with no real effect.\n \n If there were such a thing as God controling things behind the scenes there should be some pattern apparent in history, if we narrow our search to monotheism the only pattern we see is one of in fighting and division.\n Could this be evidence of a polytheistic truth attempting to interact with the universe?", 
   {}, 
   158544, 
   null, 
   1125847020.0
  ], 
  [
   159463, 
   null, 
   "PoohBear", 
   "let me ask you all this.. isnt it easier to believe that God created the universe then to try and remeber all the processes in evolution? i.e. triassic and jurassic and all the rest of em. tell me which is easier..", 
   {}, 
   159307, 
   null, 
   1125880320.0
  ], 
  [
   159992, 
   null, 
   "unkerpaulie", 
   "I drew your attention to the input of Kant and Descartes on this matter not because I want to overpower you with sciolism, but because you insisted on describing the whole argument as \"shabby\": this struck me as rather glib and suggested a shallow perspective. The ontological argument has some deeper resonances than you appear willing to give it credit for. \n \n If you are unhappy with our exchanges because you feel that your point of view is being discounted on frivolous grounds, then I can assure you that was not my intention\n\n have you considered the \"proof\" yourself? i mean hve you looked at it at face value and tried to make sense of it? let me see if i can show you how the proof looks from my point of view. then maybe you can see why i find it such a poor proof. then, if my perspective of the proof is wrong, you can show me where i misinterpreted the proof, and show that the proof is actually quite solid\n \n \n\"God, by definition, is that than which a greater cannot be thought. God exists in the understanding. If God exists in the understanding, we could imagine Him to be greater by existing in reality. Therefore, God must exist.\" \n\n the way i see it, the proof starts off by the prover creating in his mind a hypothetical being, and giving the being's definition. the definition he provides includes a requirement that God must exist. his conclusion, therefore, is that if his definition of God is correct (which is the definition he offered in the first place) then God must exist\n \nlets, then, define a bliggler as a cat-like animal with a bird-like head and elephant tail that exists in reality\n since this is our definition of a bliggler, a bliggler must exist\n\n i took out the unicorn reference, hopefully to make the analogy less confusing. my comparison to the ontological argument consists of me creating in my mind a hypothetical being, and giving the being's definition. the definition of the bliggler includes the requirement that the bliggler must exist in reality. my conclusion, therefore, is that a bliggler exists.\n \n my point is that you could use this argument to prove that anything imaginable exists, as long as you include in the definition a requirement that it exists\n \n \n another problem i see with this proof is the definition itself. without being specific about any aspect of God, God is defined as that which nothing greater than can be thought. this requires that there is an objective standard by which the greatness of thoughts can be measured. the term \"greater thought than\" is an oxymoron, since thoughts have no quantitative or measureable aspects. in order for this proof to work, we would need some form of scale by which the greatness of a thought can be compared\n \n \n i have offered 2 independent refutes to the argument. if you think that they are flawed, please indicate where and make corrctions/recommendations. thank you", 
   {}, 
   158544, 
   null, 
   1126020540.0
  ], 
  [
   159997, 
   null, 
   "unkerpaulie", 
   "let me ask you all this.. isnt it easier to believe that God created the universe then to try and remeber all the processes in evolution? i.e. triassic and jurassic and all the rest of em. tell me which is easier..\n\n ummm... pooh bear... two things. one, this discussion has nothing to do with evolution. if you have a problem with evolution, find a thread discussing evolution and post there. two, the truth about something has nothing to do with how easy the words are to remember. if something is true, but you cant pronounce, remember, or understand it, you dont opt for the easy-to-read solution and accept it as true. either get familiar with the terms, or drop the issue. nobody is going to accept \"goddidit\" on the grounds that it has fewer big words\n \n this is exactly why creationists are generally considered ignorant and knowledge-phobic", 
   {}, 
   159463, 
   null, 
   1126021140.0
  ], 
  [
   160001, 
   null, 
   "unkerpaulie", 
   "Yes, for something to be omnipotent there must be some way to change what we call the laws of nature.\n \n If we knew that the laws were utterly unchangeable, then we would know that an omnipotent being could not exist. We don't know that the laws are unchangable, therefore the existence of an OB is logically possible.\n\n lets look at a simple law in physics. the first law of thermodynamics: energy cannot be created or destroyed, simply transformed from one type of energy to another. an application of this law would be putting a hot iron bar in a bucket of water to cool. the heat it tranferred from the metal and into the water, air, bucket, and any other place the heat could get transfered too. and the metal bar becomes cooler than it was before.\n \n can God take a piece of steel at 50 `C, put it in a bucket of water at 10`C, and cause the steel and water temperature to raise to 90`C without adding energy from an external source?\n \n so far, your proof relies on the changability of the laws of physics in order for God by your definition to exist. you havent shown that the laws are changable, so your argument doesnt prove that God exists (i know you arent proving God's existence, the burden is not on you, just pointing something out). if the laws of physics are not changeable, then God, by your definition, does not exist. i just wanted to mention that. its why i keep asking these questions that may start to seem redundant", 
   {}, 
   158306, 
   null, 
   1126022400.0
  ], 
  [
   160031, 
   null, 
   "Kronus", 
   "lets look at a simple law in physics. the first law of thermodynamics: energy cannot be created or destroyed, simply transformed from one type of energy to another. an application of this law would be putting a hot iron bar in a bucket of water to cool. the heat it tranferred from the metal and into the water, air, bucket, and any other place the heat could get transfered too. and the metal bar becomes cooler than it was before.\n \n can God take a piece of steel at 50 `C, put it in a bucket of water at 10`C, and cause the steel and water temperature to raise to 90`C without adding energy from an external source?\n\n Sure. The law you cite could be described thusly: Ei = Ef. Initial energy = Final energy. To have the event you describe occur God would simply change that law locally to be Ei = eps Ef, where eps is the multiplier needed to get the correct change in energy. \n \n \n\n so far, your proof relies on the changability of the laws of physics in order for God by your definition to exist. you havent shown that the laws are changable, so your argument doesnt prove that God exists (i know you arent proving God's existence, the burden is not on you, just pointing something out). if the laws of physics are not changeable, then God, by your definition, does not exist. i just wanted to mention that. its why i keep asking these questions that may start to seem redundant\n\n I think we're on the same page here. For an omnipotent being to exist what we consider to be laws of physics must be mutable in some manner. If you could prove that the laws can't be changed, then that would prove that God, by my definition, doesn't exist.", 
   {}, 
   160001, 
   null, 
   1126031880.0
  ], 
  [
   166049, 
   null, 
   "unkerpaulie", 
   "i've let this thread sleep for a while, i've been think about this ever since\n \n kronus, let me ask you something, based on the definition that god is all powerful. can god put a sealed container quarter-filled with water in the freezer, and and take it out, say the next morning, 3/4 full of ice?, without adding any more water? (we assume that the container is fluid-proof, and its a frost-free freezer. also, the container was weighed as well as the level checked. the ice weighs 3 times more than original, and the level is 3 times higher)", 
   {}, 
   160031, 
   null, 
   1127750400.0
  ], 
  [
   166063, 
   null, 
   "simone", 
   "Wait! Wait! What is this about the physics of water?\n \n If you fill a container 3/4 full of water and freeze it, the water, of course, expands in freezing--one of the weird faculties of water, but its weight increases?\n \n I'm sorry it's early in the morning and I'm only half-functioning but where can I find out more about the weird and wonderful physics of water?", 
   {}, 
   166049, 
   null, 
   1127753400.0
  ], 
  [
   166069, 
   null, 
   "unkerpaulie", 
   "lol, its not about the physics of water, but about the alleged ability of god to alter the physics of water. we are working with the assumption that god is all powerful, but is limited to feats that are logical (ruling out the creation of round squares and other illogicalities). we have also established that 1+1=3 is also illogical, and therefore cannot be accomplished by god.\n \n anyway, heres the gist of the question. if god can do anything logically imaginable, can he place a 1/4-filled closed container of water in the freezer overnight, and the next morning (using his miraculous powers, of course) retrieve the same closed container with 3/4-filled with ice? in other words, can he, by sheer miraculous power, produce more water in the container than was there before? (the miracle has obviously nothing to do with the process of waer freezing lol)", 
   {}, 
   166063, 
   null, 
   1127755440.0
  ], 
  [
   166070, 
   null, 
   "Captain America banned", 
   "Reminds me of an old riddle. What weighs more? A pound of lead or a pound of feathers?", 
   {}, 
   166069, 
   null, 
   1127755860.0
  ], 
  [
   166079, 
   null, 
   "unkerpaulie", 
   "no riddle. in our hypothetical scenario, the water weighs more, proportionate to the amount it increased by. the density is no different from any other regular ice\n \n basically, its exactly as if i poured some more water in the container during the night. only in this case, god added the water by a miracle, instead of opening the container, putting under the tap, then putting it back in the freezer\n \n its not a trick question lol. its just a question about whether god can do this seemingly simple miracle", 
   {}, 
   166070, 
   null, 
   1127757060.0
  ], 
  [
   166375, 
   null, 
   "Kronus", 
   "\n kronus, let me ask you something, based on the definition that god is all powerful. can god put a sealed container quarter-filled with water in the freezer, and and take it out, say the next morning, 3/4 full of ice?, without adding any more water? (we assume that the container is fluid-proof, and its a frost-free freezer. also, the container was weighed as well as the level checked. the ice weighs 3 times more than original, and the level is 3 times higher)\n\n \n Glad you're back, I was hoping you hadn't abandoned this thread. :)\n \n What you ask for is easy. You'ld just have to do two things. First, change the coefficient of expansion for freezing water such that instead of the 2% (or so) increase we see now, you get a 300% increase. Then, change the gravitational constatant of the universe in the area of the container so that it weighed three times as much. Alternatively, you could change the rest mass of all the sub-atomic particles such that they were all three times bigger; that should have the same result. Another possibility, if this doesn't violate your closed container rule, would be to simply convert energy directly into matter, in the form of water. That wouldn't even require any changes to the laws of physics.", 
   {}, 
   166049, 
   null, 
   1127836380.0
  ], 
  [
   166383, 
   null, 
   "unkerpaulie", 
   "Glad you're back, I was hoping you hadn't abandoned this thread. :)\n \n What you ask for is easy. You'ld just have to do two things. First, change the coefficient of expansion for freezing water such that instead of the 2% (or so) increase we see now, you get a 300% increase. Then, change the gravitational constatant of the universe in the area of the container so that it weighed three times as much. Alternatively, you could change the rest mass of all the sub-atomic particles such that they were all three times bigger; that should have the same result. Another possibility, if this doesn't violate your closed container rule, would be to simply convert energy directly into matter, in the form of water. That wouldn't even require any changes to the laws of physics.\n\n putting some arbitrary numbers in, say we start off with a 1 liter container, 1/4-filled with water, and end up with the container 3/4 filled with ice, made possible through the miraculous power of God. somehow, an extra 1/2 liter water found itself in the container.\n \n expanding the existing 1/4 liter of water 3X violates the law of expansion for this substance. and creating an isolated gravitational field right where the container is is contrary to the way gravity works, since it is a force between 2 bodies of significant mass. but even if this could be done, it would not mean that there is more water in the container. i'm asking if god can retrieve the container with 3/4 liter of ice, when he put the container in the freezer with 1/4 liter water the night before\n \n the alternative method seems as though it would better achieve the results im looking for. are you saying that god has the power to find enough energy in a freezer that can be converted into enough matter to convert into that much water?", 
   {}, 
   166375, 
   null, 
   1127840580.0
  ], 
  [
   166415, 
   null, 
   "Kronus", 
   "\n expanding the existing 1/4 liter of water 3X violates the law of expansion for this substance. and creating an isolated gravitational field right where the container is is contrary to the way gravity works,\n\n Remember, we're saying that an omnipotent being can change the laws of physics at will. Inside the container we would have different laws for expansion and gravity, and the water would obey those new laws.\n \n \n\n the alternative method seems as though it would better achieve the results im looking for. are you saying that god has the power to find enough energy in a freezer that can be converted into enough matter to convert into that much water?\n\n Who says he needs to find the energy in the freezer? He could just open up a wormhole and funnel it in from wherever he likes. For that matter he could do the same thing to just add more water, but that seems to go against the spirit of what you're asking.", 
   {}, 
   166383, 
   null, 
   1127850780.0
  ], 
  [
   166431, 
   null, 
   "unkerpaulie", 
   "Who says he needs to find the energy in the freezer? He could just open up a wormhole and funnel it in from wherever he likes. For that matter he could do the same thing to just add more water, but that seems to go against the spirit of what you're asking.\n\n hmmm... yes and no. he could take water from outside the fridge, somehow transfer it through the fridge walls and into the container, and acheive the same thing. and that feat would be no less miraculous than making water appear out of the air in the container itself. however, getting water into the container would mean causing it to go through a fluid-proof freezer wall and container. i cant even imagine what kind of physical law he woul need to bend to achieve that.\n \n another (and equally miraculous) way this could be done is to rip a hole in the fridge and container, get the water in, then \"heal\" the container and fridge back so that the rupture would be perfectly fixed.\n \n regardless of how it is done, some serious laws of nature are going to be violated. you contend that in order for a god of your provided description to exist, such laws can be violated and still adhere to the laws of logic\n \n i must say this is truly the wierdest (most novel) justification for the existence of god i have ever come accross. and while i know that the laws of nature really cannot be twisted as described and still remain logical, its quite a challenge for me to get my head around it enough to express it properly. but i'm still working on this", 
   {}, 
   166415, 
   null, 
   1127853900.0
  ], 
  [
   166432, 
   null, 
   "trebor", 
   "hmmm... yes and no. he could take water from outside the fridge, somehow transfer it through the fridge walls and into the container, and acheive the same thing. and that feat would be no less miraculous than making water appear out of the air in the container itself. however, getting water into the container would mean causing it to go through a fluid-proof freezer wall and container. i cant even imagine what kind of physical law he woul need to bend to achieve that.\n \n another (and equally miraculous) way this could be done is to rip a hole in the fridge and container, get the water in, then \"heal\" the container and fridge back so that the rupture would be perfectly fixed.\n \n regardless of how it is done, some serious laws of nature are going to be violated. you contend that in order for a god of your provided description to exist, such laws can be violated and still adhere to the laws of logic\n \n i must say this is truly the wierdest (most novel) justification for the existence of god i have ever come accross. and while i know that the laws of nature really cannot be twisted as described and still remain logical, its quite a challenge for me to get my head around it enough to express it properly. but i'm still working on this\n\n \n \n The whole problem with this whole senerio is that there is a test can be devised to disprove something. You can always say 'well, god decieded not to participate'.", 
   {}, 
   166431, 
   null, 
   1127854200.0
  ], 
  [
   166436, 
   null, 
   "unkerpaulie", 
   "The whole problem with this whole senerio is that there is a test can be devised to disprove something. You can always say 'well, god decieded not to participate'.\n\n the beauty of this proof is that it doesnt depend on any particular real-life situation. even if we never get 3/4 liters of ice when we put 1/4 liter of water in the freezer, this thread discusses whether god has the ability to do something like that.\n \n in my mind, starting off with 1/4 liter, and ending up with 3/4 liter, is a case of 1+1=3. somehow, the left side of the equation does not equate to the right side. when this happens, we have an illogicality. god, dispite his amazing power, cannot acheive that which is illogical.\n \n the logical alternatives would be the water (or substance needed to produce the water) is subtracted from somewhere else, thus keeping the equation balanced. those are the possible scenarios that kronus suggested.\n \n alternately, god could simply wake up sometime at night, open the freezer, pour water into the container up to 3/4, then close it and put it back in the freezer. if this was the only way god could do this, then it wouldnt be a miracle, and it would demonstrate that god according to kronus' description doesnt exist", 
   {}, 
   166432, 
   null, 
   1127855040.0
  ], 
  [
   166465, 
   null, 
   "Kronus", 
   "\n another (and equally miraculous) way this could be done is to rip a hole in the fridge and container, get the water in, then \"heal\" the container and fridge back so that the rupture would be perfectly fixed.\n \n regardless of how it is done, some serious laws of nature are going to be violated. you contend that in order for a god of your provided description to exist, such laws can be violated and still adhere to the laws of logic\n\n Don't say violated, say changed; it'll make it easier to wrap your head around. But yes, an omnipotent being must be able to change the laws of nature.\n \n \n \n\n i must say this is truly the wierdest (most novel) justification for the existence of god i have ever come accross. and while i know that the laws of nature really cannot be twisted as described and still remain logical, its quite a challenge for me to get my head around it enough to express it properly. but i'm still working on this\n\n \n Let's be careful here. I'm not trying to justify the existence of God. You asked for a defintion of God, and I gave you \"An omnipotent, omniscient being that works in mysterious ways\". You then asked for details on how various feats of omnipotence could be carried out. Naturally anything I come up with is going to sound wierd. Miracles are, by definition, wierd. Any \"rational\" explanation for miracles is going to sound odd, it can't be helped.\n \n Edit: I felt this needed addressing. Why can't you change the laws and still be logical? I suspect this is going to be the thrust of your argument, so please be clear about this point. How is g=9.8 m/s^2 logical while g=2 m/s^2, or g=20m/s^2 not? If something violates logic, you can show that with logic. Please show how this isn't logical, if indeed that is where you're going with this. If not, then forget I asked. :)\n \n \n So, do you have \"omnipotence\" under your belt? Ready to prove or disprove the existence of God, by my defintion?", 
   {}, 
   166431, 
   null, 
   1127859180.0
  ], 
  [
   166704, 
   null, 
   "unkerpaulie", 
   "I felt this needed addressing. Why can't you change the laws and still be logical? I suspect this is going to be the thrust of your argument, so please be clear about this point. How is g=9.8 m/s^2 logical while g=2 m/s^2, or g=20m/s^2 not? If something violates logic, you can show that with logic. Please show how this isn't logical, if indeed that is where you're going with this. If not, then forget I asked. :)\n\n yes, this is the key to the entire argument. \n \n law: a body exerting a force against another body will experience a force of equal magnitude being exerted on it in the opposite direction. you cannot apply 10N of force on an object, and experience a reactive force of 11N from that object as a result. \n \n law: voltage = current x ressistance. you cannot experience a current of 12 amps by connecting a 4 ohm ressistor to a 2 volt battery\n \n law: e=mc^2. you cannot disintegrate a 3 kilogram piece of matter and get 100 joules of energy\n \n the laws of nature work because they are based on laws of logic. if you start off with 1/4 liter of water, your result will be 1/4 liter of ice. this is the equilibrium of 1+1=2, and anything deviant from that is illogical\n \n to address the question of g=9.8 m/s^2, the gravitational force applied on an object has everything to do with the object's mass. on a planet twice as massive as earth, we would expect g=20 m/s^2. it is proportional, and remains consistent. the gravitational force that earth exerts on us will not drastically change unless the mass of the planet drastically changes. as long as the mass of the earth remains constant, the force of gravity will remain constant", 
   {}, 
   166465, 
   null, 
   1127931360.0
  ], 
  [
   166720, 
   null, 
   "Kronus", 
   "yes, this is the key to the entire argument. \n \n law: voltage = current x ressistance. you cannot experience a current of 12 amps by connecting a 4 ohm ressistor to a 2 volt battery\n \n the laws of nature work because they are based on laws of logic.\n \n\n \n I picked just one of your laws, any would have done. You say V = IR, and say that this is based on logic. That's where you're wrong. Logic only comes into play when you solve the math. There is absolutely no logical reason why V = IR is true, it just happened to work out that way. It could just have easily have been V = 2IR, or V = 10000000000IR. There is absolutely no logical reason why those equations couldn't have turned out to be the ones our universe follows. In a place where V = IR holds, a 2 volt battery and a 4 ohm resistor would give you .5 amps. However, if the law is changed to 24V = IR, then the same battery and resistor would give you 12 amps. We are applying the same rules of math and logic to a different law! That's the part that you seem to be missing here. The omnipotent being changes the laws of the universe. The change can be temporary, and it can be local, but the laws themselves are being changed. \n \n And to address your water example, you're not quite correct. 1/4 liter of water will, in fact, give more than 1/4 liter of ice, without miracles, since ice is less dense than water. Let's forget macroscopic amounts and look at just one molecule of water. Given one molecule of water, what could an omnipotent being do to it? He could make it twice as large, he could make it twice as massive, he could make it move twice as fast, he could teleport in a second water molecule. What he couldn't do is have that one molecule be two molecules. He couldn't have it be one and two molecules at the same time. That would be 1=2, that would be illogical.", 
   {}, 
   166704, 
   null, 
   1127933820.0
  ], 
  [
   166923, 
   null, 
   "simone", 
   "OK, Kronus, indulge me. I confess I have an unholy fascination with the physics of water.\n \n Has anyone ever explained why water expands when it becomes a solid, rather than becoming denser, as is the normal case (or so I believe) in physics? What is it about the combo of hydrogen and oxygen in this case that yields a rather unruly entity?", 
   {}, 
   166720, 
   null, 
   1128010980.0
  ], 
  [
   166927, 
   null, 
   "Kronus", 
   "OK, Kronus, indulge me. I confess I have an unholy fascination with the physics of water.\n \n Has anyone ever explained why water expands when it becomes a solid, rather than becoming denser, as is the normal case (or so I believe) in physics? What is it about the combo of hydrogen and oxygen in this case that yields a rather unruly entity?\n\n \n This should go in the science section, but...\n \n Water is polar. It's sort of V shaped, with the hydorgen at the ends of the arms having a positive charge and the oxygen at the bottom having a negative charge. In the liquid state the molecules are moving around too quickly for this to have a big effect. As the molecules slow down with cooling the charges start interacting, and the molecules line up in a crystline manner. This causes more open space between the molecules than you would get if they were randomly distributed, so the density decreases.", 
   {}, 
   166923, 
   null, 
   1128012180.0
  ], 
  [
   166931, 
   null, 
   "simone", 
   "Kronus, thank you for your very patient explanation.\n \n Can one then infer that in all (or, at least, most cases) crystallization results in creating great spaces between molecules?\n \n Sorry to ask some really stupid questions but I am not very well educated in physics. If it happens to be true, space between molecules increases when crystallization occurs, it give me an interesting take on the way the universe is put together. I recommend boning up on string theory, too, because I'll dream up some half-a$$ed theory about crystallization playing a part in strings of molecules or atoms or whatever comprises string theory and--what about the protein spiral (I guess this applies specifically to the DNA molecule)?\n \n And, I guess I should see if there is a science section and if they answer stupid low-level questions like mine.", 
   {}, 
   166927, 
   null, 
   1128022740.0
  ], 
  [
   167203, 
   null, 
   "simone", 
   "Kronus, I've gone into Science and asked my stupid questions, but if they bash me for being stupid and are really mean, I'll be back in here to whine.", 
   {}, 
   166931, 
   null, 
   1128123540.0
  ], 
  [
   167259, 
   null, 
   "Easyrider", 
   "Polycarp\n \n Polycarp (69? to 155 A.D.) is known to us as one of the early founding fathers of the Christian church, and was an early disciple of the apostle John. During his life, he attained to the position of bishop of Smyrna (Izmir, Turkey). He was acquainted with Ignatius, and for a time he represented the churches of Asia Minor in meeting with \"Pope\" Anicetus of Rome. His acquaintance with the apostle John and other early Christian leaders, and his gift of preaching and his devout character, gave him a position of great authority in the Asian churches. During the approximate year of 155 A.D., in the reign of Antoninus Pius, persecution came to the area of Smyrna, and a number of his disciples had been martyred. Polycarp was identified as the leader of the local church and was marked for execution. When he was given the option to recant of his faith and live, he replied, \"Eighty and six years have I served Him (Jesus), and he hath done me no wrong. How can I speak evil of my King who saved me? He was subsequently burned at the stake rather than deny his faith and betray our Lord. His Epistle to the Philippians (about 110 A.D.) spoke of \"Our Lord Jesus Christ having endured to come so far as to death for our sins, whom God raised, having loosed that pains of death.\" His final prayer before execution was that he \"might take a portion in the number of martyrs in the cup of Christ, to the resurrection of eternal life both of soul and body in the incorruption of the Holy Ghost.\"", 
   {}, 
   167203, 
   null, 
   1128137640.0
  ], 
  [
   167350, 
   null, 
   "johnhanks", 
   "His final prayer before execution was that he \"might take a portion in the number of martyrs in the cup of Christ, to the resurrection of eternal life both of soul and body in the incorruption of the Holy Ghost.\"\n\n \n It is one of the tragedies of human existence that a courageous man dying for a cause does not in itself make that cause just or true or noble. For all I know, your story about Polycarp may be true; but even if it is it can be matched by any number of stories of men or women dying for causes you would regard as reprehensible. How many young Germans, in 1945, died courageously for the lost cause of Nazism? Do we regard them as having sacrificed their lives for a greater good? I imagine not.\n \n You'd think the daily news from Iraq was enough to quash the myth of holy martyrdom.", 
   {}, 
   167259, 
   null, 
   1128199860.0
  ], 
  [
   167358, 
   null, 
   "Easyrider", 
   "And what cause was Polycarp's except the cause of Christ, who's still trying to save you, John Hanks.", 
   {}, 
   167350, 
   null, 
   1128203520.0
  ], 
  [
   167361, 
   null, 
   "trebor", 
   "And what cause was Polycarp's except the cause of Christ, who's still trying to save you, John Hanks.\n\n \n How could Jesus save anyone, when he couldn't even save himself?", 
   {}, 
   167358, 
   null, 
   1128205380.0
  ], 
  [
   167362, 
   null, 
   "johnhanks", 
   "And what cause was Polycarp's except the cause of Christ, who's still trying to save you, John Hanks.\n\n \n Sorry, ez. If it were indeed true that a courageous person called Polycarp died for this cause, that fact would not make the cause one iota more worthy of respect than any other for which men or women have died. And that's an awful lot of causes.\n \n And since in this case the cause purports to be that of a self-proclaimed godling begotten specifically so that his father could sacrifice him to himself and thereby forgive a transgression he had entrapped humanity into ... I think I'll pass.", 
   {}, 
   167358, 
   null, 
   1128205560.0
  ], 
  [
   167364, 
   null, 
   "Kronus", 
   "Please everyone, don't encourage EZ. This whole Polycarp thing is a deversion from what has been an otherwise intelligent and enjoyable discussion. I ask you to please treat it as such and not bite at his bait.", 
   {}, 
   167362, 
   null, 
   1128206460.0
  ], 
  [
   167435, 
   null, 
   "Easyrider", 
   "How could Jesus save anyone, when he couldn't even save himself?\n\n \n Tsk, tsk.... Jesus wasn't even trying to save himself. He said, \"It is for this very reason I have come to this hour.\"\n \n I'm still waiting to hear where it is in your Tanakh where animal sacrifices for sin have been abolished?\n \n \nPlease everyone, don't encourage EZ. This whole Polycarp thing is a deversion from what has been an otherwise intelligent and enjoyable discussion. \n\n \n Who are you, the Moderator? \n \n Enjoyable for who? Those perishing who have yet to receive Christ? If you could get a glimpse for what's in store without salvation through Christ, your attitude would be a lot different I think.", 
   {}, 
   167364, 
   null, 
   1128225600.0
  ], 
  [
   167443, 
   null, 
   "Easyrider", 
   "UNIFICATION OF THE COVENANTS\n \n From the Garden Covenants of Adam, through the Abrahamic Covenant, the Mosaic Covenant, the Davidic Covenant, and finally the New Covenant alluded to in Jeremiah 31:31-34, God's eternal plan calls for the future convergence and fulfillment of all covenants at some point in time immediately following the rebirth of the nation of Israel, which occurred in 1948. This \"Unification of the Covenants\" scripture is found in Ezekiel chapter 37, the chapter which prophesies the future restoration of the nation of Israel. Ezekiel 37:24-27 relates:\n \n \"My servant David will be king over them and they will all have one shepherd (fulfilling the Davidic Covenant). They will follow my laws and be careful to keep my decrees (alluding to the fulfillment of the structural law of the Mosaic Covenant). They will live in the land I gave to my servant Jacob, the land where your fathers lived (a fulfillment of the Abrahamic Covenant). They and their children and their children's children will live there forever, and David my servant will be their prince forever. I will make a covenant of peace with them; it will be an everlasting covenant (alluding to the New Covenant of Jesus Christ). I will establish them and increase their numbers, and I will put my sanctuary among them forever. My dwelling place will be with them; I will be their God, and they will be my people.\"\n \n In this one scripture, God's word reveals His desire and intention to connect together, at some point in the future, the blessings and promises of each major covenant, as we see above. Certainly God promises to bring to pass the Messianic promises of the Adamic Covenant, as well as the continuation of life promised in the Noahic Covenant, so that in effect, all of the major covenants of the Bible find their fulfillment in the future unified New Covenant of Jesus Christ. Such verses as these, though sometimes hard to find, give credible and compelling evidence that God's progressive covenants did not just occur happenstance - they were carefully conceived and brought to fruition in the fullness of time to prove that God indeed keeps His promises - and that our God is a Covenant-Keeping God.", 
   {}, 
   167435, 
   null, 
   1128230220.0
  ], 
  [
   167446, 
   null, 
   "Bassman", 
   "This ties right in to my first premise in the thread,\"Eschatology.\"", 
   {}, 
   167443, 
   null, 
   1128230460.0
  ], 
  [
   167448, 
   null, 
   "Easyrider", 
   "Hi Bassman -\n \n Yes! And that's a good passage to remember. Hardly anyone teaches on the unification of the Covenants. Most people are unaware of the ramifications of that passage.", 
   {}, 
   167446, 
   null, 
   1128230760.0
  ], 
  [
   167453, 
   null, 
   "Bassman", 
   "Probably due to their hard-heartedness. It never ceases to amaze me how something as simple as faith in Christ can generate such a litany of hostility, attempts to explain away the Word, prophecy, etc. When I was first saved back in '89, the first thing I experienced was hope.", 
   {}, 
   167448, 
   null, 
   1128231780.0
  ], 
  [
   167456, 
   null, 
   "Orion", 
   "Please everyone, don't encourage EZ. This whole Polycarp thing is a deversion from what has been an otherwise intelligent and enjoyable discussion. I ask you to please treat it as such and not bite at his bait.\n\n \n EZ presents an almost irresistible target. I'm reminded of that cartoon which depicts a man with a sign on his back which reads \"Please kick me\". No malice intended, at least on my part, but his 'witness' is so completely off-the-wall that it invites critical response. I agree that his Polycarp c&p was completely irrelevant to this particular thread and was probably an attempt at diversion from the subject at hand. \n \n I suggest that you not allow yourself to be discouraged by such tactics. Consider it to be nothing more than noise. This is, indeed, an interesting thread.", 
   {}, 
   167364, 
   null, 
   1128232980.0
  ], 
  [
   167466, 
   null, 
   "Easyrider", 
   "Consider it to be nothing more than noise.\n\n \n Well it's a much better noise than that which is coming from your fantail.\n \n Your 20 years of studying comparative religion was a wasted enterprise, because you still haven't found the truth. Not even close. You are unable to document your \"divine\" beliefs with anything but wild theories and conjecture. No evidence, nothing. You say all paths lead to God (except Biblical Christianity), which is absurd. Satan worship is the way to heaven? How ludicrous. Reincarnated Temple rats are the way to heaven?? How completely absurd. You have one of the most bizarre theories on earth. Must be 1,000 different religions or more out there. Most completely contradictory to each other. Whatever divine being of yours is the author of that contradictory mess must be psychotic at best. You can't even defend that sort of thing with a straight face. It's bizarre, contradictory, unrealistic, unsupported by any sensible evidence or rationale, and a wisp of smoke in the dark.\n \n When you decide to come out of the closet and tell us who your so-called \"god\" is (you know, the one who approves of gay sex, fornication, Wiccanism, and the worship of Satan), and where it lives, etc., you will start to gain credibility around here for being knowledgeable and fair minded. It's not enough to constantly bark at other people's religions - if you want to run with the big dogs you have to be able to document your own beliefs. Which you are unable to do.", 
   {}, 
   167456, 
   null, 
   1128258300.0
  ], 
  [
   167657, 
   null, 
   "johnhanks", 
   "Satan worship is the way to heaven? How ludicrous.\n\n \n What objective evidence - you'll note this excludes his followers' testimony, or the words they attribute to him - do you have that Jesus was not Satan?\n \n If you're on the ball, you'll argue that this is a burden-of-proof error - that if I were to proclaim that Jesus is Satan, it's down to me to prove it. But that isn't my claim. I merely claim that Jesus-as-son-of-god and Jesus-as-incarnation-of-Satan are logically indistinguishable.\n \n \nMust be 1,000 different religions or more out there. Most completely contradictory to each other.\n\n \n I've said it before, ez, and I'll say it again. Your atheism and mine are only 0.1% different. We are 99.9% in agreement! Hail, brother!", 
   {}, 
   167466, 
   null, 
   1128373080.0
  ], 
  [
   167671, 
   null, 
   "jyoshu", 
   "Probably due to their hard-heartedness. It never ceases to amaze me how something as simple as faith in Christ can generate such a litany of hostility, attempts to explain away the Word, prophecy, etc. When I was first saved back in '89, the first thing I experienced was hope.\n\n \n It's called prejudice. It's the acceptable form of hate in our culture--they can say anything they want about Christianity because it's PC to do so these days. Screw the feelings of those who are Christian. emoticon_rolleyes \n \n Make no mistake--they do it because they enjoy it.", 
   {}, 
   167453, 
   null, 
   1128376320.0
  ], 
  [
   167721, 
   null, 
   "Howard Beale", 
   "Probably due to their hard-heartedness. It never ceases to amaze me how something as simple as faith in Christ can generate such a litany of hostility, attempts to explain away the Word, prophecy, etc. When I was first saved back in '89, the first thing I experienced was hope.\nI suggest you read the posts coming from so-called christians. The venomous and hateful rhetoric spewing out is appalling. That is why I continue to speak out to show these anti-christian zealots for the frauds that they are. It is embarrassing that you align yourself with their words.", 
   {}, 
   167453, 
   null, 
   1128386100.0
  ], 
  [
   167726, 
   null, 
   "Bassman", 
   "I suggest you read the posts coming from so-called christians. The venomous and hateful rhetoric spewing out is appalling. That is why I continue to speak out to show these anti-christian zealots for the frauds that they are. It is embarrassing that you align yourself with their words.\n\n Howard, Howard, Howard. EZ, Jyoshu, myself, and others who name the name of Christ have told you ad nauseum that it is not wrong to expose sin for what it is. Your position of \"tolerance\" does not line up with the Word of God, nor does it line up with Christ's teachings. Christ spoke of sin and repentance more than He did love.", 
   {}, 
   167721, 
   null, 
   1128386820.0
  ], 
  [
   167788, 
   null, 
   "Easyrider", 
   "I still wonder if Howard Beale acknowledges Jesus as his Lord and Savior for the remission of his sins? If he likes Karen Armstrong, then I really have questions. \n \n Howard? Can you enlighten us on this?", 
   {}, 
   167726, 
   null, 
   1128394260.0
  ], 
  [
   167810, 
   null, 
   "Bassman", 
   "I doubt the closed debate did any good.", 
   {}, 
   167788, 
   null, 
   1128395940.0
  ], 
  [
   167847, 
   null, 
   "Orion", 
   "I still wonder if Howard Beale acknowledges Jesus as his Lord and Savior for the remission of his sins? If he likes Karen Armstrong, then I really have questions.\n\n \n Karen Armstrong is a teacher and historian who writes about the history of religion. By your own admission, you've never read any of her books. I've previously invited you to discuss Armstrong with me on condition that you read at least one of her books. You've declined my invitations.", 
   {}, 
   167788, 
   null, 
   1128398280.0
  ], 
  [
   167851, 
   null, 
   "Easyrider", 
   "Why don't you let Howard answer the question, Orion? He's ducked a fair number of them already, just like you continually duck explaining your own liberal paganism.", 
   {}, 
   167847, 
   null, 
   1128399780.0
  ], 
  [
   167861, 
   null, 
   "Orion", 
   "Why don't you let Howard answer the question, Orion?\n\n \n I'm certain that he will. I was simply pointing out your almost complete ignorance of Karen Armstrong's scholarship regarding the history of religion. Obviously, this has not prevented you from attacking her scholarship in the past.", 
   {}, 
   167851, 
   null, 
   1128401760.0
  ], 
  [
   167963, 
   null, 
   "johnhanks", 
   "I still wonder if Howard Beale acknowledges Jesus as his Lord and Savior for the remission of his sins? If he likes Karen Armstrong, then I really have questions.\n\n \n EZ, I read a lot of Karen Armstrong over this last summer. I found her arguments persuasive, and her scholarship impressive. Tell me, what particular aspect of Armstrong's exegesis do you find suspect? Where, exactly, in her exposition of the emergence of humankind's concept of divinity, do you feel she went wrong?\n \n Detailed answers, please, in your own words, fully referenced to Armstrong's texts.", 
   {}, 
   167788, 
   null, 
   1128453480.0
  ], 
  [
   167978, 
   null, 
   "Howard Beale", 
   "Bassman:\n Howard, Howard, Howard. EZ, Jyoshu, myself, and others who name the name of Christ have told you ad nauseum that it is not wrong to expose sin for what it is. Your position of \"tolerance\" does not line up with the Word of God, nor does it line up with Christ's teachings. Christ spoke of sin and repentance more than He did love.\nMy position of \"tolerance\" is the position Jesus espoused. \"Love one another.\" 'Judge not lest you be judged.\" \"Let he who is without sin cast the first stone.\" Love thine enemies.\" \n \n To say that Jesus spoke more about sin than he did about love simply demonstrates how little you know his message. Jesus message is one of love and unity. You message is one of self-righteousness and judgment. Show me one word that Jesus said that gives you the right to judge your fellow man? I can show you ten where he exhorts his followers to love their fellow man. You have obviously not studied the words of Jesus \n \n It is obvious that though you use the term Christian to describe your beliefs, your beliefs are not Christian at all. I consistently ask for words of Jesus that support your beliefs and you consistently can't come up with any. I consistently ask you to reconcile your beliefs with words of Jesus and you can't do that either. You then demean yourselves by stooping to name calling and vitriol, very un-Christian conduct. I was hoping that you were Biblicans, but you don't even behave in a manner becoming a Biblican. It is possible that you are simply members of some hateful cult. There is some evidence to support that, not conclusive evidence. \n \n \nBassman:\n I doubt the closed debate did any good.\nYou're right about that. Your un-Christian rhetoric continues and your blasphemous description of yourselves as Christian continues.", 
   {
    "unicode_changes_made": true
   }, 
   167963, 
   null, 
   1128459300.0
  ], 
  [
   167979, 
   null, 
   "Howard Beale", 
   "EZ:\n I still wonder if Howard Beale acknowledges Jesus as his Lord and Savior for the remission of his sins? If he likes Karen Armstrong, then I really have questions. \n \n Howard? Can you enlighten us on this?\n \n Why don't you let Howard answer the question, Orion? He's ducked a fair number of them already, just like you continually duck explaining your own liberal paganism.\nYou are the one who has ducked every question put to you. Your hateful and un-Christian rhetoric exposes you for what you truly are.\n \n It may well be those of your ilk that Jesus was speaking of when he said: \"Not that which goeth into the mouth defileth a man; but that which cometh out of the mouth, this defileth a man.\" (Mt:15:11)", 
   {
    "unicode_changes_made": true
   }, 
   167978, 
   null, 
   1128459360.0
  ], 
  [
   167983, 
   null, 
   "Howard Beale", 
   "Maximus:\n \n Regarding Catholic Church teachings that I said were in not espoused by Jesus. I note first that you did not contradict my contention that the Doctrine of Papal Infallibility was not taught by Jesus. You also did not contradict my statement that Jesus did not preach about a \"triune God.\"\n \n You quote me:\n Here are only two instances: Matthew 6:5-6\n Mt 6:5: And when thou prayest, thou shalt not be as the hypocrites are: for they love to pray standing in the synagogues and in the corners of the streets, that they may be seen of men. Verily I say unto you, They have their reward. 6: But thou, when thou prayest, enter into thy closet, and when thou hast shut thy door, pray to thy Father which is in secret; and thy Father which seeth in secret shall reward thee openly.\n \n All those services in Churches and in Vatican Square are in direct opposition to this.\n \n \nMaximus:\n Jesus would be contradicting himself if one reads this verse to mean that one should pray in a closet. Your interpretations of the verse are way off. \n Please quote me Chapter and verse where you think Jesus says something that contradicts Matthew 6:5-6.\n \n \nMaximus:\n I wonder Howard, if you pray, do you pray in a closet? How literally do you take this lesson of Jesus? He was obviously attempting to make a point. \n \n There is nothing wrong with praying in public. There is nothing wrong with repitition in prayer. There is something wrong with vain repetition. There is something wrong with hypocrisy. This was what Jesus was condemning--vain, hypocritical, attention grabbing, false prayer.\nJesus is clear about how to pray. The fact that you have a problem with it is fine. Your position is simply not a Christian one, mine is. You are entitled to your non-Christian position. I am entitled to my Christian one.\n \n \nMaximus:\n Remember the verses that I previously quoted to Alan, showing Jesus did not mind religious interaction in public: He had an attraction to the temple as a child (Luke 2:46). He frequently taught and healed in the synagogues Matthew 4:23, 9:35, 13:54. Mark 1:21-23, 1:39, 3:1.\nYour position is silly at best and underhanded and conniving at worst. Are you saying that \"prayer\" and \"religious interaction\" are synonymous? \n \n I will quote every verse you refer to above. What am I to believe about you when not one verse, NOT ONE says anything about prayer or praying? Do you even have a New Testament to refer to? Have you ever read it? Read the passages. Show me where Jesus contradicts himself in advising us about how to pray.\n \n Luke 2:46: And it came to pass, that after three days they found him in the temple, sitting in the midst of the doctors, both hearing them, and asking them questions.\n \n Mt 4:23: And Jesus went about all Galilee, teaching in their synagogues, and preaching the gospel of the kingdom, and healing all manner of sickness and all manner of disease among the people.\n \n Mt 9:35: And Jesus went about all the cities and villages, teaching in their synagogues, and preaching the gospel of the kingdom, and healing every sickness and every disease among the people.\n \n Mt 13:54: And when he was come into his own country, he taught them in their synagogue, insomuch that they were astonished, and said, Whence hath this man this wisdom, and these mighty works?\n \n Mark 1:21: And they went into Capernaum; and straightway on the sabbath day he entered into the synagogue, and taught. 22: And they were astonished at his doctrine: for he taught them as one that had authority, and not as the scribes. 23: And there was in their synagogue a man with an unclean spirit; and he cried out,\n \n Mark 1:39: And he preached in their synagogues throughout all Galilee, and cast out devils.\n \n Mark 3: 1: And he entered again into the synagogue; and there was a man there which had a withered hand.\n \n \nMaximus:\n Also remember Matt. 26:44 - Jesus prayed a third time in the garden of Gethsemane--not in a closet--others were present.\nThe same issue again. Are you simply uninformed? Do you bother to read what you site to support your position, or is it something much more malicious? Here is the verse you site:\n \n Mt 26:44: And he left them, and went away again, and prayed the third time, saying the same words.\n \n Matthew 26 makes a point of saying that Jesus went off by himself to pray. Not mentioning that is the height of deviousness and hypocrisy on your part. It demonstrates that you have a greater interest in having Jesus fit your preconception than in understanding what he actually said and meant. \n \n \nMaximus:\n Lastly, I wonder if the Sermon on the Mount where thousands were present would be something similar to a Vatican Square service of our times? \n Jesus was teaching not praying and you should know that if you have read the Gospels. The Pope says, \"Let us pray\" and leads prayers in Vatican Square. There is a difference.\n \n Read the words of Jesus. They are clear and simple. \n \n You quote me again:\n Second: Matthew 19:21\n Mt 19:21: Jesus said unto him, If thou wilt be perfect, go and sell that thou hast, and give to the poor, and thou shalt have treasure in heaven: and come and follow me.\n \n \nMaximus:\n The Catholic Church has millions to give for child abuse settlements. Shouldn't the church have already given all that money to children? It is the richest corporation in the world.\n \n The Catholic Church is one of the largest charitable organizations in the world--probaby in the top 3--it was the largest not very long ago.\n \n The Catholic Church, along with the Orthodox, is the only one that I know of that requires its priests to take a vow of poverty. They must give up everything to serve the kingdom.\nEither you have no experience with Catholic clergy or you are completely deluded. Have you ever eaten in the Vatican dining room? What about a Bishop's or Cardinal's dining hall? Have you ever seen one? Have you seen the Pope's estates in Italy? In France? The Cardinal's estates in Spain and Portugal? Are you kidding? Are you aware that Catholic clergy have been excommunicated for inferring that it is immoral that the Catholic Church has such rich \"earthly possessions\" and there are people starving? \n \n \nMaximus:\n Much of the vast riches of the Church is art created in praise of God. (Remeber that even more is land and property used to serve the people). But concerning the art, it is good to remember Jesus' words in Matthew 26:8-10, \n \" While Jesus was in Bethany in the home of a man known as Simon the Leper, a woman came to him with an alabaster jar of very expensive perfume, which she poured on his head as he was reclining at the table. \n When the disciples saw this, they were indignant. \"Why this waste?\" they asked. \"This perfume could have been sold at a high price and the money given to the poor.\" \n Aware of this, Jesus said to them, \"Why are you bothering this woman? She has done a beautiful thing to me. The poor you will always have with you, but you will not always have me. When she poured this perfume on my body, she did it to prepare me for burial. I tell you the truth, wherever this gospel is preached throughout what she has done will also be told, in memory of her.\" \n \n So by the above story we know that Jesus' command was not a universal one. He was not contradicting himself. We know that he expected some things to be kept in order to praise and worship him and other things to be kept to do the work of the Church. Remember that many times he sent his disciples to people's homes to gain lodging and food--why hadn't these homes been given up??? Also, Joseph of Arimathea donated the tomb for Jesus and was not shunned as a Christian that we can tell. He was called a \"rich\" man in Matthew 27:56-58. \n Just so you know, Matthew 26 was a time when Jesus said to the disciples that his death was near. His point was that this woman was doing a charitable act. She wasn't keeping the expensive oil for herself, she used it to anoint and comfort the dying, him. To compare that to a church hoarding valuables and real estate and having its hierarchy living in luxury is inane.\n \n \"Land to serve people\", \"Art created in praise of God\" (what happened to the 2nd Commandment by the way), \"It is good to remember Jesus.\" You just spout this blither as if it has any meaning. Jesus told you how to remember him and it wasn't to own a bunch of painting painted by guys who never saw Jesus or Mary or half the stuff they painted. Jesus sat down and broke bread with his disciples. That's all.\n \n \nMaximus:\n It is not what you have but what you do with what you have and also the fact that you could give all of it up at any moment for the sake of the Kingdom. \"Seek ye first the kingdom of God and all these things will be added unto you.\" Matthew 6:33)\nAnd you think that \"all these things\" that will be added are riches? Million dollar paintings of Jesus? As usual, you take Jesus' words out of context. Read verses 31 and 32. They tell you that he is not talking about riches, he is talking about sustenance. \n \n Mt 6:31: Therefore take no thought, saying, What shall we eat? or, What shall we drink? or, Wherewithal shall we be clothed? 32: For after all these things do the Gentiles seek: for your heavenly Father knoweth that ye have need of all these things.\n \n If you are going to bother to quote Jesus, have the respect to quote him in context. \n \n You can sputter all that you want, but you cannot deny that Jesus said, \"...go and sell that thou hast, and give to the poor, and thou shalt have treasure in heaven: and come and follow me.\" \n \n \nMaximus:  \n Concerning your views on the divinity of Christ, what do you think the Transfiguration was in Chapter 17 of Matthew? \n Because I am a Christian, I look first to Jesus words. If he thought it was important that we know that he is God, he would have told us. The Apostles would have prayed to him, they did not. If Jesus thought that it was important that we know that he was God and should be worshiped, why did he tell the Apostles to pray to him? He didn't. He told them to pray to their Father who was within them?\n \n As far as the so-called \"transfiguration\", any lawyer will tell you, if three people witness the same event, you will get three different versions of what happened. People use the silly \"Jesus was god\" debate so that they don't have to live up to his teachings. After I have gotten to the place where I can live my life in accordance with the teachings of Jesus, then I'll worry about what Paul or John or Ringo has to say.\n \n \nMaximus:\n What do you think of Paul's words in Colossians 2:9, \"that in him dwells the whole fullness of the deity bodily?\"\nAgain, as a Christian, it is the words of Jesus that are of the greatest import to me. Paul never met, saw or heard Jesus. You should also note that in the epistles of Paul that are undisputedly written by him (1 Thessalonians, 1 Corinthians, 2 Corinthians, Galatians, Romans, Philippians, Philemon) on only one occasion does he appeal to the authority of Jesus to support a moral teaching which the gospels also represent Jesus as having delivered. Only once in all those words.\n \n \nMaximus:\n Do you have a translation defense for John's words proclaiming Jesus' divinity in the beginning of his gospel? (John 1:1-5)\nWhoever wrote the Gospel of John can say what he wants. It is fair to say that he never met Jesus either and was not witness to the events he writes about.\n \n Finally, I apologize for the harshness of my words, but I am exasperated by people self-righteously misquoting Jesus and quoting him out of context. I am also dismayed by the anger and ugliness of those who wrap themselves in the name of Christianity on this forum as well as other places.", 
   {
    "unicode_changes_made": true
   }, 
   167979, 
   null, 
   1128460320.0
  ], 
  [
   167985, 
   null, 
   "johnhanks", 
   "It never ceases to amaze me how something as simple as faith in Christ can generate such a litany of hostility...\n\n \n Oh, such self-pity! Bassman, if you and ez and the rest of evangelical christianity were characterised by nothing more than 'simple faith in Christ', anyone attacking you for your views would be a despicable bully.\n \n But that is not your stance. Your 'simple faith in Christ' leads you to demand that everyone else conform to your notions of what is virtuous and what is sinful; it leads you to seek constantly to interfere with science education, because some of its theories conflict with your beliefs; it leads you to seek control over other people's lives.\n \n That is what generates hostility. You want to enjoy your 'simple faith in Christ', you go right ahead; but when your simple faith tries to tell others how to live, expect hostility.", 
   {}, 
   167453, 
   null, 
   1128460800.0
  ], 
  [
   168002, 
   null, 
   "Easyrider", 
   " Your 'simple faith in Christ' leads you to demand that everyone else conform to your notions of what is virtuous and what is sinful; it leads you to seek constantly to interfere with science education, because some of its theories conflict with your beliefs; it leads you to seek control over other people's lives.\n\n \n We campaign and vote according to our wants and beliefs just like every other segment of America, John. Liberals do it too. Don't have a hairball over it, though.\n \n \n My position of \"tolerance\" is the position Jesus espoused. \"Love one another.\" 'Judge not  lest you be judged.\" \"Let he who is without sin cast the first stone.\" Love thine enemies.\"\n\n \n Have you listened to yourself lately (see next quote)? \n \n \n (To me) You are the one who has ducked every question put to you. Your hateful and un-Christian rhetoric exposes you for what you truly are. (To Bassman) Your un-Christian rhetoric continues and your blasphemous description of yourselves as Christian continues.\n \n \n Love that tolerance and \"love your enemies\" there, Howard. Looks like you have no problem judging people and then you tell others to judge not. Marvelous....\n \n I still wonder if you acknowledge Jesus as your Lord and Savior for the remission of your sins? \n \n Can you enlighten us on this or will you keep ducking it?", 
   {
    "unicode_changes_made": true
   }, 
   167978, 
   null, 
   1128466620.0
  ], 
  [
   168031, 
   null, 
   "Bassman", 
   "My position of \"tolerance\" is the position Jesus espoused. \"Love one another.\" 'Judge not lest you be judged.\" \"Let he who is without sin cast the first stone.\" Love thine enemies.\" \n \n To say that Jesus spoke more about sin than he did about love simply demonstrates how little you know his message. Jesus message is one of love and unity. You message is one of self-righteousness and judgment. Show me one word that Jesus said that gives you the right to judge your fellow man? I can show you ten where he exhorts his followers to love their fellow man. You have obviously not studied the words of Jesus \n \n It is obvious that though you use the term Christian to describe your beliefs, your beliefs are not Christian at all. I consistently ask for words of Jesus that support your beliefs and you consistently can't come up with any. I consistently ask you to reconcile your beliefs with words of Jesus and you can't do that either. You then demean yourselves by stooping to name calling and vitriol, very un-Christian conduct. I was hoping that you were Biblicans, but you don't even behave in a manner becoming a Biblican. It is possible that you are simply members of some hateful cult. There is some evidence to support that, not conclusive evidence. \n \n You're right about that. Your un-Christian rhetoric continues and your blasphemous description of yourselves as Christian continues.\n\n \n Howard, you sir are dead wrong about that. Studying the gospels in the 16 years that I have been saved, Jesus spoke more about sin, repentance and judgement than love and so-called \"tolerance!\"", 
   {
    "unicode_changes_made": true
   }, 
   167978, 
   null, 
   1128470100.0
  ], 
  [
   168084, 
   null, 
   "Howard Beale", 
   "Have you listened to yourself lately (see next quote)? \n \n \n \n Love that tolerance and \"love your enemies\" there, Howard. Looks like you have no problem judging people and then you tell others to judge not. Marvelous....\n \n I still wonder if you acknowledge Jesus as your Lord and Savior for the remission of your sins? \n \n Can you enlighten us on this or will you keep ducking it?\nMine was a simple statement of fact. Too bad you cannot see the accuracy of it.", 
   {
    "unicode_changes_made": true
   }, 
   168002, 
   null, 
   1128477600.0
  ], 
  [
   168085, 
   null, 
   "Bassman", 
   "Howard, you dance around the question like Fred Astaire! I reiterate. You,sir, are no Christian!", 
   {}, 
   168084, 
   null, 
   1128478260.0
  ], 
  [
   168106, 
   null, 
   "Easyrider", 
   "Howard, you dance around the question like Fred Astaire! I reiterate. You,sir, are no Christian!\n\n \n Until Howard tells the world in his own words who Jesus is (Jewish Messiah, Resurrected Savior, etc.), and whether Jesus is his Lord and Savior for the remission of his sins, I tend to agree with you. Real Christians don't dodge these basic questions.", 
   {}, 
   168085, 
   null, 
   1128480600.0
  ], 
  [
   168109, 
   null, 
   "trebor", 
   "Until Howard tells the world in his own words who Jesus is (Jewish Messiah, Resurrected Savior, etc.), and whether Jesus is his Lord and Savior for the remission of his sins, I tend to agree with you. Real Christians don't dodge these basic questions.\n\n \n \n I will tell you who Jesus is. If he existed at all, he is a dead man... dead for almost 2000 years.", 
   {}, 
   168106, 
   null, 
   1128480840.0
  ], 
  [
   168114, 
   null, 
   "Easyrider", 
   "Exposing Howard Beale's Karen Armstrong\n \n \nJesus himself was hardly an obedient soul. He is depicted in the Gospels as a kind of rebel.\n\n \n He was obedient to God. He was called \"Beelzebub\" by the real rebels.\n \n More Armrest Than Armstrong - Or, Another Look Into (Armstrongs') Liberalism  \n \n We have had a few requests (and one defiant challenge) to look into the work of Karen Armstrong, author of several books including one we will survey in part here titled The History of God. This has taken us a while, because it seemed clear from the way Armstrong's work was cited by others (like Jonathan Kirsch) that her work was, well, more wind than heat. And it turns out that this is the case.\n \n Do not expect any original research or argumentation from Armstrong. The findings of liberal Biblical scholarship and of the likes of the Jesus Seminar are taken as indisputable fact, and the argument progresses from there without skipping a beat. It's all in there to some degree: JEDP, the Jesus Seminar, dating Proverbs to the 3rd century BC without explanation or analysis, much less dealing with of competing views; a false interpretation of Ps. 82 (which happens to match one I refute by the Mormons in The Mormon Defenders), political correctness, and anachronism. In light of that most or all of what Armstrong assumes to be true about the Bible is refuted via links or material on this page, we merely refer readers to Encyclopedia index (see sidebar) and offer our usual Whitman's Sampler of bitter chocolates:\n \n &#61623; It is clear from her introductory words that Armstrong grew up in a religiously strict environment and desired a touchy-feely religion, but is upset because, well, she didn't experience God the way she wanted -- what she got was a holy being; what she wanted was a health tonic. What she got what was the Bible; what she wanted was a Dilbert calendar.\n \n &#61623; And by golly, she found one. Armstrong offers up a full slate of statements like these over many pages: \"These myths were not intended to be taken literally, but were metaphorical attempts to describe a reality that was too complex and elusive to express any other way.\" [5] We want to ask: How does Armstrong know this? How does she know that Exodus or Enuma Elish were \"not intended to be taken literally\"? Has she interviewed any ancient people and asked? Of course not -- it's merely assumed that there was some unknown \"too complex and elusive\" reality that these folks were trying to describe, because otherwise we'd have to deal with the idea that they believed these things were actually true, and that's what leads to political incorrectness. No genre proofs, no interviews, just assumption based on Armstrong's preconceived view of the world, and that she herself would never have written such a thing to be taken literally. At any rate, it is clear that Armstrong also assumes that if you don't agree with this, you're not grown up yet. \n \n &#61623; Recounting the salvation history of the Bible and the atonement, Armstrong complains, \"there must have been an easier and more direct way to redeem mankind.\" [309] If there was, Armstrong does not lay it out; like some recent skeptics we have dealt with, she merely looks at scenario A-1, says, \"God could have done better\" and leaves it at that. At the back of such objections lies a presumption, \"I know better than God and could have done it better\" -- as if any person has the capacity to lay out a perfect alternate history and know there was a \"better way.\" Not even Harry Turtledove claims that kind of genius. It's like the skeptics who say Abraham was a bad choice for God to make -- really? So who do they know who was a better choice? Do they have a list of names from the 18th century BC along with full resumes and character references? Such objections assume to possess omniscience in the service of declaring that omniscience bungled the job.\n \n &#61623; The Trinity is a top subject for Armstrong. Though she knows about the Wisdom literature, she doesn't see the application to the Trinity, which she assumes is the product of Nicaea, along with the divinity of Jesus. The Trinity, she says, \"only makes sense as a mystical or spiritual experience\" [117], which I suppose would be true of someone who'd rather not do the relevant homework. The Trinity makes sense to me in light of the Wisdom tradition, and I'd say if you want a mystical or spiritual experience of equal quality to what Armstrong proposes, get up and spin yourself in circles until dizzy. But if you want to understand the Trinity, read the relevant literature. \n &#61623; Political correctness extends only to certain persons: We are advised that Arius, the defender of the heretical view that Jesus was a created being and not eternal divinity, \"passionately believed\" what he taught, while Athanasius, who taught the eternal divinity of Christ, \"managed to impose his theology\" on others and was an unhappy camper. Armstrong's favoritism is about as subtle as Dan Rather's. Those who \"passionately believe\" what is wrong are just fine, because they have passion and that's what counts. Don't even think of condemning them!\n \n &#61623; We are told that it was only at the end of the 2nd century that Christianity gained any converts intelligent enough to articulate its views [91]. Apparently Armstrong has not read Wayne Meeks' The First Urban Christians showing that Paul had more than the usual expected number of converts from the wealthy/literate Roman upper and middle class. She also doesn't read about the Romans, who she says had not \"inherited the Greek hostility to Jews.\" Tell that to Tacitus, Celsus, and Lucian, and other Romans who referred to the Jews in derogatory terms. Armstrong's sociology is rather dismal for an Oxford teacher.\n \n &#61623; The ancient pagans did not worship idols; the idols were \"a focus that had helped people to concentrate on the transcendental element of human life.\" [112] Yes, I am sure that's what they had in mind when they sacrificed infants and had sex on the altars to explain to Baal that they needed some rain. Try that on your next date's father and mother, teenagers!(Armstrong is only half right anyway: the idols were intended to be focal points for the gods depicted to come down and be present.)\n \n &#61623; Prophets who condemned false religion were doing so because they were full of insecurities, secretly knowing that their own god was as made up as that of others [50]. I hear a genetic fallacy in the room...\n \n &#61623; Using JEDP parsing as a basis (a theory which Armstrong admits has been seriously disputed, but which she uses anyway, because no one has come up with anything better --- this is like saying we should use the garbage bag with only 8 gaping holes because we haven't found any with less!), Armstrong divides up the OT, then argues on the basis that those who wrote one part would not agree with the other parts written by other people (as on the subject of God's anthropomorphism -- apparently it never occurs to Armstrong that close and distant terms of relationship are not mutually exclusive over time).\n \n &#61623; As needed, things like the denunciation of the Pharisees are declared \"inauthentic\" because they are offensive. (Never mind the ancient use of riposte.)\n \n So, what more needs be said? Armstrong offers only another fortress of political correctness in the wasteland of postmodernity. I can see why certain people think her work the cat's meow, but from the looks of it, all she has is more begged questions to offer.\n \n http://www.tektonics.org/af/armstrongk01.html", 
   {}, 
   168106, 
   null, 
   1128481680.0
  ], 
  [
   168115, 
   null, 
   "Howard Beale", 
   "Howard, you sir are dead wrong about that. Studying the gospels in the 16 years that I have been saved, Jesus spoke more about sin, repentance and judgement than love and so-called \"tolerance!\"\nI don't know what cult you belong to, but Jesus message was about Love and Forgiveness. Your warping of his teachings is unconscionable. Jesus' only commandments were about loving. It is clear in every Gospel. He spoke of sin, repentance and judgment, but his commandments were about love. A few verses to refresh your memory.\n \n Mt 22:37 Jesus said unto him, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind. 38: This is the first and great commandment. 39: And the second is like unto it, Thou shalt love thy neighbour as thyself. 40: On these two commandments hang all the law and the prophets.\n \n Mk 12:28 And one of the scribes came, and having heard them reasoning together, and perceiving that he had answered them well, asked him, Which is the first commandment of all? 29: And Jesus answered him, The first of all the commandments is, Hear, O Israel; The Lord our God is one Lord: 30: And thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind, and with all thy strength: this is the first commandment. 31: And the second is like, namely this, Thou shalt love thy neighbour as thyself. There is none other commandment greater than these.\n \n \n Lk 10:25: And, behold, a certain lawyer stood up, and tempted him, saying, Master, what shall I do to inherit eternal life? 26: He said unto him, What is written in the law? how readest thou? 27: And he answering said, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy strength, and with all thy mind; and thy neighbour as thyself. 28: And he said unto him, Thou hast answered right: this do, and thou shalt live.\n \n Jn:13:34: A new commandment I give unto you, That ye love one another; as I have loved you, that ye also love one another. 35: By this shall all men know that ye are my disciples, if ye have love one to another.\n \n Jn:14:15: If ye love me, keep my commandments.\n \n Jn:15:12: This is my commandment, That ye love one another, as I have loved you.\n \n Jn:15:17: These things I command you, that ye love one another.\n \n \nBassman:\n Howard, you dance around the question like Fred Astaire! I reiterate. You,sir, are no Christian!\nNotice how I respond directly with the words of Jesus. You can hurl false allegations all you want, but I cannot allow you to continually distort Jesus' words. In the name of anything you may hold sacred, stop spreading lies about the teachings of Jesus.", 
   {
    "unicode_changes_made": true
   }, 
   168109, 
   null, 
   1128481740.0
  ], 
  [
   168116, 
   null, 
   "Howard Beale", 
   "EZ:\n Until Howard tells the world in his own words who Jesus is (Jewish Messiah, Resurrected Savior, etc.), and whether Jesus is his Lord and Savior for the remission of his sins, I tend to agree with you. Real Christians don't dodge these basic questions.\nReal Christians accept the words of Jesus Christ. I accept them and believe that he is exactly who he said he was. Since you don't, I think it is your Christianity that is doubt.\n \n Simple question to you EZ. Do you accept that Jesus is who he says he was?  Bet you will dodge it just like you and Bassman dodge all questions about what Jesus said.", 
   {
    "unicode_changes_made": true
   }, 
   168115, 
   null, 
   1128481800.0
  ], 
  [
   168119, 
   null, 
   "trebor", 
   "Exposing Howard Beale's Karen Armstrong\n \n \n \n He was obedient to God. He was called \"Beelzebub\" by the real rebels.\n \n More Armrest Than Armstrong - Or, Another Look Into (Armstrongs') Liberalism  \n fer.\n \n <snip a bunch of rhetoric<\n \n http://www.tektonics.org/af/armstrongk01.html\n\n \n Quoting from J. P. Holding, AKA Robert Turkel?? \n \n Not the best source in the world..", 
   {}, 
   168114, 
   null, 
   1128482040.0
  ], 
  [
   168120, 
   null, 
   "Howard Beale", 
   "EZ:\n \n How sad. Rather than read Karen Armstrong's book for yourself like a person who has some respect for themselves, you play sycophant to a critic who you have never met and can't even be sure read her book either.\n \n You are truly lost.", 
   {
    "unicode_changes_made": true
   }, 
   168116, 
   null, 
   1128482160.0
  ], 
  [
   168121, 
   null, 
   "Easyrider", 
   "Beale, there's a thousand different interpretations of who people claim Jesus is. We still want you to go on record instead of dancing around this all the time. \n \n \nDo you accept that Jesus is who he says he was? Bet you will dodge it just like you and Bassman dodge all questions about what Jesus said.\n\n \n NONSENSE. I already told you in a previous post who I believe Jesus is. To quote: \n \n I believe Jesus is the Christ; the long-awaited Jewish Messiah. Virgin born and Spirit-filled; the only begotten of the Holy Father. Jesus is the Great I AM, the Rose of Sharon, the Prince of Peace and the LORD OUR RIGHTEOUSNESS. HE IS the fairest of ten thousand, the First and the Last, the Alpha and Omega, the Prince of Peace and Lord of Lords. HE IS our Righteous and sinless Savior by his shed blood at Calvary. HE owns all the cattle on a thousand hills. HE IS our Judge and Advocate, and the Mediator of the New Covenant. HE IS the root of Jessee, the Branch of David, the Holy One of Israel and the Hope of mankind. HE IS the miracle-working healer of the sick, the Raiser of the Dead, the Uplifter of the Oppressed, the Great God and Savior, the Lord of All, the Mighty God, and the Lord Almighty. HE IS the Lord of Glory, the Good Shepherd, the Light of the World, and the prophesied Messenger of the Covenant. HE IS Immanuel, the Lord of the Sabbath, the Son of Man coming on the Clouds of Heaven in Great Glory. And HE IS the Creator of all things, the Sustainer of all things, and the Resurrection and the Life. HE IS the Way, and the Truth, and Life, and HE IS ALL THESE THINGS AND MUCH MORE TO ME.\n \n That's who I say Jesus is.\n \n Now are you going to dance some more for us or tell us who you believe Jesus is? Your continual evasion on this is an embarrassment to you.", 
   {}, 
   168116, 
   null, 
   1128482160.0
  ], 
  [
   168124, 
   null, 
   "Howard Beale", 
   "EZ:\n That's who I say Jesus is.\nThat's not what I asked EZ, you are dancing so hard you are running out of breath. I asked you if you believed that Jesus was who he said he was.", 
   {
    "unicode_changes_made": true
   }, 
   168121, 
   null, 
   1128482340.0
  ], 
  [
   168127, 
   null, 
   "johnson", 
   "EZ:\n \n How sad. Rather than read Karen Armstrong's book for yourself like a person who has some respect for themselves, you play sycophant to a critic who you have never met and can't even be sure read her book either.\n \n You are truly lost.\n\n \n I've read it and I found it very insightful. Not only did it include a lot history on the rise and eventual spread of the hebrew god and then christinaty, but it made some very insightful links concerning the events that are recorded in factual records and the events that lead up to the rise in popularity of this god and christ,.. Including the connection to Islam.\n \n I've read it and I recomend it. If any one here objects to this I ask only that you have ACTUALLY read it for your self. Then I'd be willing to discuss the FALLICY of it with you.", 
   {
    "unicode_changes_made": true
   }, 
   168120, 
   null, 
   1128482880.0
  ], 
  [
   168128, 
   null, 
   "Easyrider", 
   "Boys, I read the Word of God. That's the standard.\n \n Karen Armstrong doesn't even know who Jesus is.", 
   {}, 
   168127, 
   null, 
   1128483000.0
  ], 
  [
   168140, 
   null, 
   "trebor", 
   "Boys, I read the Word of God. That's the standard.\n \n Karen Armstrong doesn't even know who Jesus is.\n\n \n And you don't either.", 
   {}, 
   168128, 
   null, 
   1128484560.0
  ], 
  [
   168144, 
   null, 
   "Easyrider", 
   "\"Who is the liar? It is the person who denies that Jesus is the Christ. Such a man is an antichrist.\" - 1 John 2:22", 
   {}, 
   168140, 
   null, 
   1128484800.0
  ], 
  [
   168147, 
   null, 
   "Bassman", 
   "That's not what I asked EZ, you are dancing so hard you are running out of breath. I asked you if you believed that Jesus was who he said he was.\n\n Howard. I stated before that Jesus spoke on sin, repentence and judgement more than love and acceptance. Here are but a few verses to back that:\n Matthew 9:12, 11:21-24, 12:39-45, all of 23; Mark 9:42-48, 10:5; Luke13:1-5 &34-35, 17:1-4; John 8:11 That is but a small taste of the truth. In fact, the very first words of Christ's ministry: REPENT! For the Kingdom of God is at hand.\n EZ, care to add anything to this? emoticon_xangel", 
   {
    "post_info": {
     "post_title": "additions"
    }, 
    "unicode_changes_made": true
   }, 
   168124, 
   null, 
   1128484980.0
  ], 
  [
   168151, 
   null, 
   "Easyrider", 
   "That's not what I asked EZ, you are dancing so hard you are running out of breath. I asked you if you believed that Jesus was who he said he was.\n\n \n Get some rest, Howard. You obviously are too scared to tell people who you believe Jesus is. Danced around it for two days now. \n \n I think you're one of those revisionist liberals who deny the deity of Christ, his shed blood for the remission of sin, his physical resurrection, his virgin birth, and every other major tenet of the faith. In short, you're an imposter to the faith.", 
   {
    "unicode_changes_made": true
   }, 
   168124, 
   null, 
   1128485340.0
  ], 
  [
   168152, 
   null, 
   "Bassman", 
   "Like I said, EZ, possibly a Unitarian Universalist.", 
   {}, 
   168151, 
   null, 
   1128485460.0
  ], 
  [
   168155, 
   null, 
   "PoohBear", 
   "And you don't either.\n\n \n \n So then explain to us who you think God is.. if you are so prudent to say that we dont!", 
   {}, 
   168140, 
   null, 
   1128485580.0
  ], 
  [
   168157, 
   null, 
   "Bassman", 
   "Hello, Pooh Bear. Long time, no post. Glad to have you back!", 
   {}, 
   168155, 
   null, 
   1128485700.0
  ], 
  [
   168159, 
   null, 
   "PoohBear", 
   "lol thanks! its good to be back!", 
   {}, 
   168157, 
   null, 
   1128485760.0
  ], 
  [
   168161, 
   null, 
   "johnson", 
   "Boys, I read the Word of God. That's the standard.\n \n Karen Armstrong doesn't even know who Jesus is.\n\n \n \n And you haven't read the book!!!\n \n But because some rightwing waco christian dude writes a column on it in some fundementalist web page you will jump on the band wagon and be blindly lead by your chosen leaders.\n \n You have no real foundation to stand on in denouncing this book!!!\n \n You haven't read it ,... yet you speak as if some athourity on it!!!\n \n Your very decieving EZ. At least do what most reasonable people do and read it for yourself befor squirting your poison at it!!!!!!", 
   {}, 
   168128, 
   null, 
   1128485880.0
  ], 
  [
   168166, 
   null, 
   "Bassman", 
   "Now, now Johnson m'boy, EZ more than likely read the book and has more background on Karen Johnson than you can shake a stick at.", 
   {}, 
   168161, 
   null, 
   1128486240.0
  ], 
  [
   168167, 
   null, 
   "Bassman", 
   "lol thanks! its good to be back!\n\n Yeah, with the onslaught of drivel we've been getting, the extra help is surely needed.", 
   {}, 
   168159, 
   null, 
   1128486360.0
  ], 
  [
   168168, 
   null, 
   "johnson", 
   "Now, now Johnson m'boy, EZ more than likely read the book and has more background on Karen Johnson than you can shake a stick at.\n\n \n I'm not your boy... and I doubt that EZ has read anything he's dissed. As do I doubt you have.\n \n So I've read it ,... Wanna discuss it? Or just go cut and past a bunch of stuff you find on your computers favorite list?", 
   {}, 
   168166, 
   null, 
   1128486480.0
  ], 
  [
   168170, 
   null, 
   "Bassman", 
   "Struck a nerve, I see?", 
   {}, 
   168168, 
   null, 
   1128486780.0
  ], 
  [
   168177, 
   null, 
   "PoohBear", 
   "I'm not your boy... and I doubt that EZ has read anything he's dissed. As do I doubt you have.\n \n So I've read it ,... Wanna discuss it? Or just go cut and past a bunch of stuff you find on your computers favorite list?\n\n \n \n ok so we get youve read it.. it sound lime youre braggin about something that you cant exactly prove over the internet..", 
   {}, 
   168168, 
   null, 
   1128487500.0
  ], 
  [
   168179, 
   null, 
   "Bassman", 
   "ok so we get youve read it.. it sound lime youre braggin about something that you cant exactly prove over the internet..\n\n Johnson claims to have been raised in a \"Baptist\" home and saved since age 5 ( I'm not even going any further, there) But, his posts indicate that he's backslidden considerably.", 
   {}, 
   168177, 
   null, 
   1128487680.0
  ], 
  [
   168182, 
   null, 
   "PoohBear", 
   "Johnson claims to have been raised in a \"Baptist\" home and saved since age 5 ( I'm not even going any further, there) But, his posts indicate that he's backslidden considerably.\n\n \n i took care of it.. ;)", 
   {}, 
   168179, 
   null, 
   1128487920.0
  ], 
  [
   168189, 
   null, 
   "Bassman", 
   "It sounds like he's ashamed of the gospel.", 
   {}, 
   168182, 
   null, 
   1128488640.0
  ], 
  [
   168190, 
   null, 
   "Orion", 
   "Now, now Johnson m'boy, EZ more than likely read the book and has more background on Karen Johnson than you can shake a stick at.\n\n \n I have previously invited EZ to discuss Karen Armstrong's A History of God or The Battle For God on condition that he read either book beforehand. He has declined my invitations. What he does instead is to post cut&pastes from Christian fundamentalist websites the authors of which are in obvious opposition to Armstrong's scholarship. Did they even bother to read her books? Who knows? \n \n EZ has employed this same tactic in response to my invitations to discuss the works of John Dominic Crossan, Paul Tillich, Israel Finkelstein, and John Shelby Spong. Not a very encouraging sign, is it?", 
   {}, 
   168166, 
   null, 
   1128488700.0
  ], 
  [
   168195, 
   null, 
   "Bassman", 
   "I have previously invited EZ to discuss Karen Armstrong's A History of God or The Battle For God on condition that he read either book beforehand. He has declined my invitations. What he does instead is to post cut&pastes from Christian fundamentalist websites the authors of which are in obvious opposition to Armstrong's scholarship. Did they even bother to read her books? Who knows? \n \n EZ has employed this same tactic in response to my invitations to discuss the works of John Dominic Crossan, Paul Tillich, Israel Finkelstein, and John Shelby Spong. Not a very encouraging sign, is it?\n\n I'll say that EZ may be a bit overzealous, but he is within his right to speak from the sources that he sees fit. I've heard about The Battle for God and from what I've heard, I'm not too encouraged. I don't like pointy-headed intellectial liberal elitists claiming to know everything about religion. Even though they have an alphabet soup next to their name. It just doesn't impress me.", 
   {}, 
   168190, 
   null, 
   1128489240.0
  ], 
  [
   168198, 
   null, 
   "trebor", 
   "Now, now Johnson m'boy, EZ more than likely read the book and has more background on Karen Johnson than you can shake a stick at.\n\n \n From what I have seen of some interactions between Orion and Easyrider, EZ has not read it.", 
   {}, 
   168166, 
   null, 
   1128489360.0
  ], 
  [
   168208, 
   null, 
   "johnson", 
   "Struck a nerve, I see?\n\n \n You give me the impression this is what you live for.", 
   {}, 
   168170, 
   null, 
   1128491100.0
  ], 
  [
   168210, 
   null, 
   "johnson", 
   "ok so we get youve read it.. it sound lime youre braggin about something that you cant exactly prove over the internet..\n\n \n It shouldn't \" sound lime \" anything. There is no bragging here. And if the internet is what you rely on to uphold your religious convictions, .. you have my sincere pity.", 
   {}, 
   168177, 
   null, 
   1128491340.0
  ], 
  [
   168212, 
   null, 
   "johnson", 
   "Johnson claims to have been raised in a \"Baptist\" home and saved since age 5 ( I'm not even going any further, there) But, his posts indicate that he's backslidden considerably.\n\n \n You know ,.. You are the most insulting personality I've had the pleasure of meeting on this forum.\n \n There is no claim.. Bass playing dude,.. It's truth. ( I know you have a hard time with this )\n \n And , GEEEEEEE ... you are so smart to have figured out I gave up this nonsense long ago. Yeah it was kind of a strange thing. I asked questions... I got the runaround ( kinda like you and EZ give others ) , I gave up trying to become what others defined for me and I found the me burried benieth the huge pyle of XXXX. I can only pray someday you too can experience the true feeling of freedom!! ( cause dogma suc** )", 
   {}, 
   168179, 
   null, 
   1128491880.0
  ], 
  [
   168215, 
   null, 
   "johnson", 
   "i took care of it.. ;)\n\n \n Hey .. thanks for the spanking...\n \n You've really learned me.", 
   {}, 
   168182, 
   null, 
   1128492060.0
  ], 
  [
   168216, 
   null, 
   "johnson", 
   "It sounds like he's ashamed of the gospel.\n\n \n I'm ashamed that at one time I endorsed them and tought them to younger kids.\n \n I know what your thinking... They don't screen sunday school teachers like they used to, huh?\n \n Should probable burn the heritcs at the stake, huh?", 
   {}, 
   168189, 
   null, 
   1128492300.0
  ], 
  [
   168222, 
   null, 
   "Orion", 
   "Boys, I read the Word of God. That's the standard.\n\n \n \"What do we need books for, anyway? Everything we need to know is already in the Bible!\"\n \n :-)", 
   {}, 
   168128, 
   null, 
   1128494100.0
  ], 
  [
   168223, 
   null, 
   "johnson", 
   "\"What do we need books for, anyway? Everything we need to know is already in the Bible!\"\n \n :-)\n\n \n As I've discovered, .. it's a crazy way to live ones life,.. at least for me.", 
   {}, 
   168222, 
   null, 
   1128494520.0
  ], 
  [
   168235, 
   null, 
   "Orion", 
   "I'll say that EZ may be a bit overzealous, but he is within his right to speak from the sources that he sees fit.\n\n \n As I have my right to ridicule him for his attempts to denigrate Karen Armstrong without having read any of her books. Or, has such concept escaped your attention? \n \n \nI've heard about The Battle for God and from what I've heard, I'm not too encouraged.\n\n \n You've \"heard\"?\n \n \nI don't like pointy-headed intellectial liberal elitists claiming to know everything about religion. Even though they have an alphabet soup next to their name. It just doesn't impress me.\n\n \n OK, so, scholarship is not your thing. No problem.", 
   {}, 
   168195, 
   null, 
   1128502740.0
  ], 
  [
   168251, 
   null, 
   "trebor", 
   "You know ,.. You are the most insulting personality I've had the pleasure of meeting on this forum.\n \n There is no claim.. Bass playing dude,.. It's truth. ( I know you have a hard time with this )\n \n And , GEEEEEEE ... you are so smart to have figured out I gave up this nonsense long ago. Yeah it was kind of a strange thing. I asked questions... I got the runaround ( kinda like you and EZ give others ) , I gave up trying to become what others defined for me and I found the me burried benieth the huge pyle of XXXX. I can only pray someday you too can experience the true feeling of freedom!! ( cause dogma suc** )\n\n \n I take it you have not met Easyrider.", 
   {}, 
   168212, 
   null, 
   1128523560.0
  ], 
  [
   168270, 
   null, 
   "Howard Beale", 
   "EZ:\n Get some rest, Howard. You obviously are too scared to tell people who you believe Jesus is. Danced around it for two days now. \n \n I think you're one of those revisionist liberals who deny the deity of Christ, his shed blood for the remission of sin, his physical resurrection, his virgin birth, and every other major tenet of the faith. In short, you're an imposter to the faith.\nCall me names, scream and rant, it doesn't hide the fact that you still have not answered the question EZ. Do you believe that Jesus was who he says he was?  That is who I believe Jesus is. I have said that repeatedly, you just don't want to hear it. Jesus said what he meant and meant what he said. You won't say that either.\n \n What about it, dancing dude? Afraid to say you believe Jesus? The question still stands. It is not who you say Jesus was, EZ, the question is: Do you believe that Jesus was who he said he was?", 
   {
    "unicode_changes_made": true
   }, 
   168251, 
   null, 
   1128529080.0
  ], 
  [
   168271, 
   null, 
   "trebor", 
   "Call me names, scream and rant, it doesn't hide the fact that you still have not answered the question EZ. Do you believe that Jesus was who he says he was?  That is who I believe Jesus is. I have said that repeatedly, you just don't want to hear it. Jesus said what he meant and meant what he said. You won't say that either.\n \n What about it, dancing dude? Afraid to say you believe Jesus? The question still stands. It is not who you say Jesus was, EZ, the question is: Do you believe that Jesus was who he said he was?\n\n \n \n And who does he say he is? Really now?? Unambigously? Quote chapter and verse, and look at those quotes IN CONTEXT.", 
   {
    "unicode_changes_made": true
   }, 
   168270, 
   null, 
   1128529380.0
  ], 
  [
   168275, 
   null, 
   "Howard Beale", 
   "And who does he say he is? Really now?? Unambigously? Quote chapter and verse, and look at those quotes IN CONTEXT.\nRead the gospels. If you don't understand what he says, ask and I will give you my input on any questions you may have. To cut and paste scriptural quotes here when they are readily available for all who wish to read them seems like a disingenuous request on your part and tremendous waste of time on mine. I posed the question to people who have claimed to have studied the Gospels. I trust their word that they have and I take for granted that understand what they have read. If you have not read the Gospels, then I hope you read them because they are very enlightening, if you have read them, then why ask me what Jesus said if you have already read it?", 
   {}, 
   168271, 
   null, 
   1128531360.0
  ], 
  [
   168281, 
   null, 
   "trebor", 
   "Read the gospels. If you don't understand what he says, ask and I will give you my input on any questions you may have. To cut and paste scriptural quotes here when they are readily available for all who wish to read them seems like a disingenuous request on your part and tremendous waste of time on mine. I posed the question to people who have claimed to have studied the Gospels. I trust their word that they have and I take for granted that understand what they have read. If you have not read the Gospels, then I hope you read them because they are very enlightening, if you have read them, then why ask me what Jesus said if you have already read it?\n\n \n \n Yes, I have read the gospels. I have read several different interpreations of what the certain key phrases can be translated as. Is it disingenious ??\n \n For example, I had a discussion with Bassman about the 'Before abraham, I am' phrase. I pointed out that from the Greek, the phrase 'Before abraham (in priority) I am . (or I will be greater than abraham) is a valid translation from the Greek, and all I got from him is 'That is not how it is translated by the biblical scholars', and when I showed him it was by some people, he cried 'Heresy', and repeated his claim that is not how it is translated.\n \n He did not look at context, he did not back up his claim in any manner or form, but just whined and complained that it didn't meet his viewpoint.\n \n So, where does Jesus say who he was, and what did he say who he was. Was it unambigious? What is the context, in both scripture and from a social point of view from 1st century Juddah?\n \n Are you avoiding the question too?", 
   {}, 
   168275, 
   null, 
   1128532140.0
  ], 
  [
   168285, 
   null, 
   "unkerpaulie", 
   "damn!! what the heck happened here?? i missed this forum for 2 days and this thread becomes completely mangled\n \n easyrider, pooh bear, orion, johnson, trebor, howard, or anybody else interested in this topic: do you guys have a concise definition of God that you would like to share?", 
   {}, 
   168281, 
   null, 
   1128532380.0
  ], 
  [
   168288, 
   null, 
   "Kronus", 
   "damn!! what the heck happened here?? i missed this forum for 2 days and this thread becomes completely mangled\n \n easyrider, pooh bear, orion, johnson, trebor, howard, or anybody else interested in this topic: do you guys have a concise definition of God that you would like to share?\n\n \n Welcome back! Ready to get back on topic when you are.", 
   {}, 
   168285, 
   null, 
   1128532800.0
  ], 
  [
   168391, 
   null, 
   "Easyrider", 
   "Do you believe that Jesus was who he says he was? That is who I believe Jesus is. I have said that repeatedly, you just don't want to hear it. Jesus said what he meant and meant what he said. You won't say that either. What about it, dancing dude? Afraid to say you believe Jesus? The question still stands. It is not who you say Jesus was, EZ, the question is: Do you believe that Jesus was who he said he was?\n\n \n Already answered twice. You're doing your revisionist duckwalk again. Now go and learn what this means:\n \n Did Jesus Claim To Be God?  \n \n Among the religious leaders who have attained a large following throughout history, Jesus Christ is unique in the fact that He alone claimed to be God in human flesh. A common misconception is that some or many of the leaders of the world's religions made similar claims, but this is simply not the case. \n Buddha did not claim to be God; Moses never said that he was Yahweh; Mohammed did not identify himself to be Ahura Mazda. Yet Jesus, the carpenter from Nazareth, said that he who has seen him (Jesus) has seen the Father (John 14:9).\n \n The claims of Christ are many and varied. He said that He existed before Abraham (John 8:58), and that He was equal with the Father (John 14:9). The New Testament equated Jesus as the creator of the universe (John 1:3), and that He is the one who holds everything together (Colossians 1:17). The apostle Paul says that God was manifest in the flesh (1 Timothy 3:16, KJV), and John the evangelist says that \"the Word was God\" (John 1:1). The united testimony of Jesus and the writers of the New Testament is that He was more than mere man; He was God. \n \n Not only did His friends notice that He claimed to be God, but so did His enemies as well. There may be some doubt today among the skeptics who refuse to examine the evidence, but there was no doubt on the part of the Jewish authorities. When Jesus asked them why they wanted to stone Him, they replied, \"For a good work we do not stone You, but for blasphemy; and because You, being a man, make Yourself out to be God\" (John 10:33, NASB).  \n \n This fact separates Jesus from the other religious figures. In the major religions of the world, the teachings -- not the teacher -- are all-important. \n Confucianism is a set of teachings; Confucius is not important. Islam is the revelation of Allah, with Mohammed being the prophet, and Buddhism emphasizes the principles of the Buddha and not Buddha himself. This is especially true of Hinduism, where there is no historic founder. \n However, at the center of Christianity is the person of Jesus Christ. Jesus did not just claim to be teaching mankind the truth; He claimed that He was the truth (John 14:6). \n \n What Jesus taught is not the important aspect of Christianity, but what is important is who Jesus was. Was He the Son of God? Is He the only way a person can reach God? This was the claim He made for Himself. \n Suppose this very night the President of the United States appeared on all the major networks and proclaimed that \"I am God Almighty. I have the power to forgive sin. I have the authority to raise my life back from the dead.\"\n \n He would be quickly and quietly shut off the air, led away, and replaced by the Vice-President. Anybody who would dare make such claims would have to be either out of his mind or a liar, unless he was God.\n \n This is exactly the case with Jesus. He clearly claimed all these things and more. If He is God, as He claimed, we must believe in Him, and if He is not, then we should have nothing to do with Him. Jesus is either Lord of all or not Lord at all.\n \n Yes, Jesus claimed to be God. Why should anyone believe it? After all, merely claiming to be something does not make it true. Where's the evidence that Jesus is God? \n \n The Bible gives various reasons, including miracles and fulfilled prophecy, that are intended to convince us that Jesus is the one whom He said He was (John 20:30, 31). The main reason, or the sign which Jesus Himself said would demonstrate that He was the Son of God, was His resurrection from the dead.\n \n When asked for a sign from the religious leaders, Jesus replied, \"For as Jonah was three days and three nights in the belly of the whale, so will the Son of man be three days and three nights in the heart of the earth\" (Matthew 12:40, RSV).\n \n In another place He said, when asked for a sign, \"Destroy this temple, and in three days I will raise it up . . . but he spake of the temple of his body\" (John 2:19, 21, KJV). The ability to raise His life back from the dead was the sign that separates Him not only from all other religious leaders, but also from anyone else who has ever lived.  \n \n Anyone wishing to refute the case for Christianity must explain away the story of the resurrection. Therefore, according to the Bible, Jesus proves to be the Son of God by coming back from the dead (Romans 1:4). The evidence is overwhelming that Jesus did rise from the grave, and it is this fact that proves Jesus to be God.\n \n (This is an excerpt from the book, \"Answers to Tough Questions,\" by Josh McDowell and Don Stewart.)", 
   {
    "unicode_changes_made": true
   }, 
   168288, 
   null, 
   1128554460.0
  ], 
  [
   168409, 
   null, 
   "Howard Beale", 
   "EZ:\n \n Still afraid to answer the question, EZ? It is a simple yes or no question EZ. Do you believe that Jesus was who he said he was?", 
   {}, 
   168391, 
   null, 
   1128557820.0
  ], 
  [
   168412, 
   null, 
   "Howard Beale", 
   "trebor:\n \n \nYes, I have read the gospels. I have read several different interpreations of what the certain key phrases can be translated as. Is it disingenious ??\n \n For example, I had a discussion with Bassman about the 'Before abraham, I am' phrase. I pointed out that from the Greek, the phrase 'Before abraham (in priority) I am . (or I will be greater than abraham) is a valid translation from the Greek, and all I got from him is 'That is not how it is translated by the biblical scholars', and when I showed him it was by some people, he cried 'Heresy', and repeated his claim that is not how it is translated. \n \n He did not look at context, he did not back up his claim in any manner or form, but just whined and complained that it didn't meet his viewpoint.\nI address any question that can be dealt intelligently in this type of format. Since you bring up John 8:58: (Jesus said unto them, Verily, verily, I say unto you, Before Abraham was, I am.). I will address it. This should also help to get things back on topic. As for unkerpaulie's offer, I have already given him a concept of God. It is the God of Moses and the God of Abraham as verbalized in Exodus 3: \"hayah hayah.\" It is almost always translated as I AM THAT I AM. However, anyone familiar with ancient Hebrew knows that \"hayah\" does not translate as a specific tense (present past or future). It is used often to connote all three tenses depending on the usage. The word usage almost has to be poetic or metaphoric and a valid rendering is I AM, WAS AND SHALL BE WHAT IS, WAS AND WILL BE. I brought this understanding to the attention of this thread and was danced around. I submit it again. I AM, WAS, AND SHALL BE WHAT IS, WAS, AND WILL BE.\n \n As far as John 8:58, It is clear that the comma placed after the word \"was\" in the phrase \"Before Abraham was, I am\", was put in by the translator and it is my contention that this clouds Jesus' meaning. The Greek we have is rendered from the Aramaic and ancient Hebrew that Jesus spoke. What Jesus said (even from the Greek) is \"Before Abraham was I AM\". Sort of like \"Before Moses was Abraham.\" He was not referring to himself personally. He was referring to the name of God that was given to Moses in Exodus 3.\n \n \nSo, where does Jesus say who he was, and what did he say who he was. Was it unambigious? What is the context, in both scripture and from a social point of view from 1st century Juddah?\n \n Are you avoiding the question too?\nWhat question? To identify and expand on every verse ion the Gospels in which Jesus speaks of who he is? I believe he meant all of them. I will gladly answer any question you have about any specific verse, but for me to write a hundred page dissertation on each and every word that Jesus spoke that reflected on who he was is not a reasonable request in this forum. It is difficult enough to address a single verse. But please, ask about any verse, in as much depth as you care to. It only helps me clarify my understanding and separate the wheat (accurate understandings I have) from the shaft (the inaccurate ones).", 
   {
    "unicode_changes_made": true
   }, 
   168409, 
   null, 
   1128558300.0
  ], 
  [
   168422, 
   null, 
   "trebor", 
   "trebor:\n \n I address any question that can be dealt intelligently in this type of format. Since you bring up John 8:58: (Jesus said unto them, Verily, verily, I say unto you, Before Abraham was, I am.). I will address it. This should also help to get things back on topic. As for unkerpaulie's offer, I have already given him a concept of God. It is the God of Moses and the God of Abraham as verbalized in Exodus 3: \"hayah hayah.\" It is almost always translated as I AM THAT I AM. However, anyone familiar with ancient Hebrew knows that \"hayah\" does not translate as a specific tense (present past or future). It is used often to connote all three tenses depending on the usage. The word usage almost has to be poetic or metaphoric and a valid rendering is I AM, WAS AND SHALL BE WHAT IS, WAS AND WILL BE. I brought this understanding to the attention of this thread and was danced around. I submit it again. I AM, WAS, AND SHALL BE WHAT IS, WAS, AND WILL BE.\n \n As far as John 8:58, It is clear that the comma placed after the word \"was\" in the phrase \"Before Abraham was, I am\", was put in by the translator and it is my contention that this clouds Jesus' meaning. The Greek we have is rendered from the Aramaic and ancient Hebrew that Jesus spoke. What Jesus said (even from the Greek) is \"Before Abraham was I AM\". Sort of like \"Before Moses was Abraham.\" He was not referring to himself personally. He was referring to the name of God that was given to Moses in Exodus 3.\n \n What question? To identify and expand on every verse ion the Gospels in which Jesus speaks of who he is? I believe he meant all of them. I will gladly answer any question you have about any specific verse, but for me to write a hundred page dissertation on each and every word that Jesus spoke that reflected on who he was is not a reasonable request in this forum. It is difficult enough to address a single verse. But please, ask about any verse, in as much depth as you care to. It only helps me clarify my understanding and separate the wheat (accurate understandings I have) from the shaft (the inaccurate ones).\n\n \n \n YOu seem to be insisting that it was from Exodus 3. However, let's look it IN CONTEXT. \n \n What do we see the pattern of what attributed to Jeus\n \n Starting a John 5:18, he is saying the Father is greater than the son.\n The god is greater than the son.\n All the honor goes to the father. He is talking PRIORITY .. THe father is before the son.\n \n THen, all of a sudden, he would stitch gears and NOT talk priority? The phrase in Greek , isolated from anything else could mean either time or priority.\n \n The surrounding passages he was saying how God is greater than he was.\n Why would he switch gears, and then say he was god?", 
   {
    "unicode_changes_made": true
   }, 
   168412, 
   null, 
   1128561060.0
  ], 
  [
   168904, 
   null, 
   "Howard Beale", 
   "Trebor:\nYOu seem to be insisting that it was from Exodus 3. However, let's look it IN CONTEXT. \n \n What do we see the pattern of what attributed to Jeus\n \n Starting a John 5:18, he is saying the Father is greater than the son.\n The god is greater than the son.\n All the honor goes to the father. He is talking PRIORITY .. THe father is before the son.\n \n THen, all of a sudden, he would stitch gears and NOT talk priority? The phrase in Greek , isolated from anything else could mean either time or priority.\n \n The surrounding passages he was saying how God is greater than he was.\n Why would he switch gears, and then say he was god?\nFirst, I think it is correct that we have wandered of the context of this thread and I suggest that if you want to continue the dialogue that you open a new thread in response to this post.\n \n That said... just so you know, I was looking at \"Before Abraham was I AM\" in context: in the context of all the Gospels including John and specifically John 8 as well as the context of the times, the languages, the translations, and who said the words.\n \n You cover a lot of ground with a sweeping broad brush. This is the problem with trying to cover too much territory in a forum like this. I can't follow what you are saying. It helps me if you site the exact verses rather than paraphrase them. An example is when you say, \"then all of a sudden he would switch gears...\" I don't know exactly where you mean he \"switches gears.\" If you site the verse or verses that show the switching of gears, I can understand your point better. Same with your reference to \"The surrounding passages...\" -- exactly which ones?\n \n I know it is tedious, but if I don't really understand what you are saying then we will probably end up talking at cross purposes - we may actually agree and never know it!", 
   {
    "unicode_changes_made": true
   }, 
   168422, 
   null, 
   1128696180.0
  ], 
  [
   169463, 
   null, 
   "PoohBear", 
   "It shouldn't \" sound lime \" anything. There is no bragging here. And if the internet is what you rely on to uphold your religious convictions, .. you have my sincere pity.\n\n \n \n actyually i dont use the internet to uphole any of my religious \"convictions\" the bbible is the only placer i get my \"convictions\" because its straight from the truth. because there a pretty good chance the stuff you see on the internet is twisted by people to decieve others... oh and stop with the pity party.. its _ _", 
   {}, 
   168210, 
   null, 
   1128915180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  proof of God's existence", 
  "url": "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 6271, 
  "discussion_files": [
   [
    "8700.html", 
    "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence-print.html"
   ], 
   [
    "8701.html", 
    "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence-10-print.html"
   ], 
   [
    "8702.html", 
    "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence-8-print.html"
   ], 
   [
    "8703.html", 
    "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence-6-print.html"
   ], 
   [
    "8704.html", 
    "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence-4-print.html"
   ], 
   [
    "8705.html", 
    "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence-5-print.html"
   ], 
   [
    "8706.html", 
    "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence-7-print.html"
   ], 
   [
    "8707.html", 
    "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence-9-print.html"
   ], 
   [
    "8708.html", 
    "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence-3-print.html"
   ], 
   [
    "8709.html", 
    "http://www.4forums.com/political/religion-debates/6271-proof-gods-existence-2-print.html"
   ]
  ], 
  "identifier": 6271
 }
]