[
 [
  [
   157393, 
   null, 
   "jsaid2009", 
   "By Patrick O'Brien \n \n We were steadfast trusting in Him;\n We saw nothing equal to God in the hour of our danger.\n We have a prophet, a true helper,\n By whom we can conquer all men1.\n \n So Muhammad ibn Ishaq quoted the poetry of Dir&#257;r ibn al-Khatt&#257;b ibn Mird&#257;s in his eighth century epic Sirat Rasul Allah (Life of the Apostle of God). It is a poem about the storied \"Battle of the Trench\" (so-called because the Muslims dug a defensive trench north of Medina) in which the Muslims, led by Muhammad, roundly defeated the Meccan infidels of the Quraysh tribe (Muhammad's own tribe) led by Abu Sufyan. This battle followed the battle of Uhud, wherein the Quraysh routed the Muslims. The Battle of the Trench was the last chance, as it were, to stop the magnificent military conquest machine called Islam.\n \n Invigorated by their triumph over the Quraysh, the Muslims went on to besiege the Jewish Banu Qurayza tribe, who were rumored to be plotting against Muhammad. This conflict was a leisurely walk in the sand dunes after the Battle of the Trench. The Muslims were victorious, and upon winning, exhibited the characteristic Islamic contempt for the unbeliever that has lasted to this day through an utter lack of reform in the religion. The vanquished Jews forfeited their property and goods. After their surrender, 600-900 of their men were beheaded in the marketplace of Medina over ditches dug there. The women (who weren't taken as concubines) and children were sold into slavery. Some were sold to buy horses and weapons. The Qur'an succinctly records this horrific tale of massacre, rapine, and enslavement in two verses2:\n \n He [God -ed.] brought down from their strongholds those who had supported them [i.e., the Banu Qurayza Jews who had supported the Banu Quraysh Arabs -ed.] from among the People of the Book [Jews -ed.] and cast terror into their hearts, so that some you slew and others you took captive.\n \n He made you masters of their land, their houses, and their goods, and of yet another land [Khaybar-another conquest over a Jewish community in Arabia -ed.] on which you had never set foot before. Truly, God has power over all things.\n \n This apparently made a significant impression on the Meccan Arabs, as Muhammad then marched into Mecca and, meeting no resistance, triumphantly claimed it in God's name. The rest, of course, is history-a history that anyone with two good eyes and a modicum of common sense can see being written and rewritten in infidel blood today.\n \n This is how the great world religion of Islam was established. It was founded upon a sturdy bedrock of offensive war, unbending intolerance, disdainful devaluation of the infidel, and divine justification for these positions, reinforced by countless military victories under the black banner of jihad. The Muslims were indeed a fearsome and destructive force. The mass transnational conquests that followed the death of their warrior prophet rivaled those of the Romans and the Mongolians, the latter of whom tellingly converted to Islam in 1295. WIthin two hundred years, Muslims had conquered half of the civilized world-quite a legacy for a violent glorified highway robber with delusions of grandeur and an insatiable thirst for power. This spectacular series of Muslim military defeats was fueled by the same three potent motivators that still drive the mujahideen today:\n \n God's ordination in the Qur'an and sunnah, charging Muslims with the holy mission of making His word (i.e., shari'ah law) reign supreme in all lands, over all people, for all times-because they are superior to the enemies of God (the infidels). \n The win-win prospects of the mujahid Islamic holy warrior going to war against the infidel: If he lives, he wins glory, material gain, sensual pleasure, and supremacy. If he dies as a martyr for the faith, he wins the same in Paradise-sumptuous banquets with gold plates, wine (non-alcoholic, of course), endless sex with doe-eyed perpetual virgins on luxurious cushions, lush gardens of repose, all as the unbelievers are destined burn in hell. \n An ever-increasing (although not so much these days) number of dazzling victories over the unbelievers, confirming God's favor and the efficacy of holy war. \n Islam is impervious to reform and is still very much the bellicose, supremacist ideology that it was when its barbarian believers hurtled, sword and Qur'an in hand, out of the Arabian Peninsula toward victory and the demise of every culture and society it encountered. It's still the same, and now it's more dangerous than ever because it has been supremely humiliated by the kuffar (infidels) that Muslims have always looked down upon with disgust. The ferocity of the pride that comes with always winning, especially winning for God, should never be underestimated once it is ground in the dirt of reality. With the final dissolution of the thirteen hundred year-old Islamic Khilafah (Caliphate) in 1924-which Muslims attribute to the West's animus toward Islam-the long-smoldering fire of jihad was rekindled anew. To us, it was just business, and we now feel remorse over any suffering we may have caused. To Muslims, it was a resounding slap in the face-the kind of slap they had grown used to giving out.\n \n The undeniable success of the industrial, largely secularized, democratic West effected a painful cognitive dissonance in the Muslim psyche, as it became more and more clear that something had gone terribly awry with God's mission of conquest and subjugation. The supremacy of the infidel on such a grand scale was something that Islam's earlier indomitability had simply not prepared Muslims to face, notwithstanding the protracted death of the sick Ottoman of Europe.\n \n The decadence (suffrage, truly representative law, greater social freedoms and rights, etc.) that was brought about as a result of the West's prosperity and higher standard of living and health put the capstone on the edifice of the great Satan of the modern Islamic mythos. Again, Islam has never seen even the ghost of a true reform movement, let alone an enlightenment. It is ill-equipped to assimilate into the modern age of pluralism, tolerance, freedom, and civil rights under the rule of man-made law. In fact, democracy, along with its attendant benefits and advantages, falls under the Islamic designation of shirk. Loosely translated as \"polytheism,\" this term refers to anything that is given the respect, honor, or obeisance that is due to God alone. This is Islam's ultimate sin.\n \n What every infidel should understand is that each Muslim believes that he or she is part of a grand mission from God to spread Islam by word or sword. Islamic missionary work is called da'wah, with the ultimate goal of the entire Earth being governed by Islamic theocracy. If da'wah does not suffice to fulfill this goal, there is the recourse of jihad (holy war). This doesn't by any means make every Muslim a terrorist. It just fosters a mind-set among the believers that makes it difficult for them to countenance the superiority of the infidel way of life. It also provides religious sanction to support the violent overthrow of that way of life, wherever and whenever possible.\n \n The infidel should also be aware that there is no separation of mosque and state in Islam-every last detail of human experience and endeavor is administered under shari'ah law. This is why Muslims say that Islam is not just a religion, but a complete way of life. That's what it is. How you go to the bathroom, make love to your spouse, punish those who transgress against God's will, give to charity (Islamic charity), go to war, eat, wash, borrow money, treat infidels-in short, anything you may do in the course of being alive-is strictly regulated by the shari'ah. Life for the Muslim is a complex series of bizarre rituals and habits that are commanded by God and His apostle. Islam is the obsessive-compulsive disorder of religions.\n \n Thus, Islam is distinguished from one its parents, Christianity, which actually does allow for genuine freedom and tolerance.\n \n Render therefore unto Caesar the things which be Caesar's, and unto God the things which be God's.3.\n \n In contrast to the Qur'an, sunnah, and shari'ah, there is no inherent conflict in the Gospels between living a devout life and living in equality and harmony under the rule of law alongside others who may believe differently. It should also be noted that nowhere in the New Testament are Christians enjoined to make war against non-Christians to establish the supremacy of the Christian faith. Christians who kill in Christ's name are acting against his teachings, while Muslims who kill in their God's name are dutifully following Muhammad's teachings (and example). \n \n Whether or not a Muslim is physically fighting on one of the innumerable battlefields of jihad in the world is a somewhat academic point when considering Islam's claims of entitlement to supremacy over all other peoples and their social, political, and religious systems. To be sure, the majority of Muslims are peaceable people who contribute positively to society. What counts, though, is that all Muslims have immovable faith that the world and the future belong to them and their crazy God. They believe that achieving this object justifies the mainstream Islamic institution of violent, offensive jihad. Whether a Muslim fights with the Kalashnikov, pays the expenses for the Muslim who fights with the Kalashnikov, or simply cheers for him, the bottom line is that they are both on the same team, and we are the opposing team. And the strange and scary thing is that they genuinely believe that their violence and intolerance is holy and pleasing to God.\n \n Here's the lowdown on the Weltanschauung of the Islamic faithful, plain and simple: Islam is the one true faith, infidels are scum, and it is a religious duty incumbent on the ummah (Muslim community) to make war against them until Islam (submission to God's will) is the supreme force in the world.\n \n But is this just reflexive bigotry-a cheap and mean-spirited attempt to drag the good name of Muslims and their religion of peace through the mud of ignorant spite? What does the Qur'an say about all this? After all, the Qur'an is the first and last word in what Muslims believe, think, and do. Sura 9, Repentance, is quite instructive:\n \n Fight against such of those to whom the Scriptures were given as believe not in God nor in the Last Day, who do not forbid what God and His apostle have forbidden, and do not embrace the true Faith, until they pay tribute out of hand and are utterly subdued. \n The Jews say Ezra is the son of God, while the Christians say the Messiah is the son of God. Such are their assertions, by which they imitate the infidels of old. God confound them! How perverse they are!4\n \n \n It is He who has sent forth His apostle with guidance and the True Faith that he may exalt it above all religions, though the idolaters abhor it.5\n \n Believers, why is it that when you are told: 'March in the cause of God,' you linger slothfully in the land? ... \n If you do not go to war, He will punish you sternly, and will replace you by other men. You will in no way harm Him: for God has power over all things.6\n \n Whether unarmed or well-equipped, march on and fight for the cause of God, with your wealth and with your persons. This will be best for you, if you but knew it.7\n \n Prophet, make war on the unbelievers and the hypocrites and deal rigorously with them. Hell shall be their home: an evil fate.8\n \n God has purchased from the faithful their lives and worldly goods, and in return has promised them the Garden. They will fight for the cause of God, they will slay, and be slain. Such is the true promise which He has made them in the Torah, the Gospel and the Koran. And who is more true to his pledge than God? Rejoice then in the bargain you have made. That is the supreme triumph.9\n \n It is not right that all the faithful should go to war at once. A band from each community should stay behind to instruct themselves in religion and to admonish their men when they return, so that they may take heed. \n Believers, make war on the infidels who dwell around you. Deal firmly with them. Know that God is with the righteous.10 \n Equally clear on the matter of Islam's violent, totalitarian, expansionist agenda is the second source of Islamic law after the Qur'an: the hadith (the written collections of sunnah-the traditions and precedents of Muhammad and his companions):\n \n Allah's Apostle said, 'I have been ordered to fight the people till they say: 'None has the right to be worshipped but Allah, 'and whoever said, 'None has the right to be worshipped but Allah', Allah will save his property and his life from me, unless (he does something for which he receives legal punishment) justly, and his account will be with Allah.11\n \n A morning or an evening spent in the Path of Allah is better than the world and all it contains.12\n \n O you who believe! Take not my enemies And your enemies as friends offering them (your) love even though they have disbelieved in the Truth (i.e. Allah, Prophet Muhammad and this Quran) which has come to you ....(to the end of Verse)....(And whosoever of you does that, then indeed he has gone astray from the Straight Path.\" Qur'an 60:1)13\n \n The Prophet passed by me at a place called Al-Abwa or Waddan, and was asked whether it was permissible to attack the pagan warriors at night with the probability of exposing their women and children to danger. The Prophet replied, \"They (i.e. women and children) are from them (i.e. pagans).\"14\n \n It has been narrated on the authority of Uqba b. Amir who said: I heard the Messenger of Allah (may peace be upon him) say: Lands shall be thrown open to you and Allah will suffice you (against your enemies), but none of you should give up playing with his arrows.15\n \n The Prophet said, on the day of the Conquest of Mecca, \"There is no migration (after the Conquest), but Jihad and good intentions, and when you are called for Jihad, you should immediately respond to the call.\"16\n \n The Prophet (peace be upon him) said: The best of the actions is to love for the sake of God and to hate for the sake of God.17 \n And to bring the point home, let's return to the Qur'an:\n \n The basest creatures in the sight of God are the faithless who will not believe...18\n \n Fight against them until idolatry is no more and God's religion reigns supreme. But if they desist, fight none except the evil-doers.19\n \n You are the noblest community ever raised up for mankind. You enjoin justice and forbid evil. You believe in God.\n \n Had the People of the Book accepted the Faith, it would surely have been better for them. Some are true believers, but most are evil-doers.20\n \n Believers, take neither the Jews nor the Christians for your friends. They are friends with one another. Whoever of you seeks their friendship shall become one of their number. God does not guide the wrongdoers.21 \n It will be clear to any reasonable person, through an objective, contextual reading of the Qur'an, hadith, and shari'ah (along with the daily news), that the infidel is an inferior being to be despised, shunned, subdued, killed, or converted. The position of Islam, vis-à-vis anyone or anything non-Islamic is one of intolerant hatred (for God's sake) and violence. Such is the anti-human message of Islam's hateful deity, as manifest and promulgated in the brutal jihad lifestyle of a hateful, bloodthirsty desert sheikh, whose life is emulated by Muslims to this day. The hateful book which laid the groundwork for the fourteen centuries of violence and subjugation visited upon the infidel-and the obliteration of infidel culture-has never been revised or considered anything less than God's immutable word for all men at all times. Those who have challenged this view have paid dearly, and still do.\n \n There is no tolerance where Islam reigns. The Jews and Christians who have been unfortunate enough to live as second-class dhimmis (\"protected\" or \"guilty\" people) under the Islamic state were routinely humiliated, overtaxed, derided, dispossessed, and were helpless to defend themselves from Muslim wrath or cruelty. This is the fulfillment of sura 9:29 which we saw above, and it is a matter of historical record22, contrary to the modern multicultural facade of an Islamic tolerance that simply did not exist in Muslim occupied Spain, Egypt, the Balkans, Greece, Israel, and beyond. The People of the Book (Jews and Christians) who scraped by under their Muslim overlords weren't \"living in peace,\" as today's Western useful XXXXXX for Islam claim. They lived in fear and misery. The money extorted from them-the jizya poll tax-in exchange for being allowed to cower in their homes, practicing their faith out of sight, was used to fund the jihad war chest. When they couldn't pay the jizya, they were sometimes compelled to give up their children who were converted to Islam or enslaved. If they were found guilty of breaking their covenant of \"protection\" with the Islamic state (a guilt which was all but assured, seeing as they had no standing in a shari'ah court against a Muslim), they were executed or sold into slavery. This is all in accordance with God's writ in the Qur'an, and Muhammad's degenerate example in the sunnah, and it continues today.\n \n In the last two centuries, the world has undergone tremendous and tumultuous change, much of it for the better. Islam hasn't changed with the it. Most of us have left the Middle Ages far behind where they belong. We've learned, and are still learning, that our faiths, our laws, and our ways of thinking can be amenable to pluralism, progress, and forbearing brotherhood with our fellow human beings, irrespective of race, sex, creed, or ethnicity. Those of us who are religious have discovered such qualities to be consonant with the principles of our respective faiths, affirming them even. Those of us who are of a more secular bent find that this new and positive position of tolerance is simply noble and just. This is the wheat we have begun winnowing from the chaff of our pre-Enlightenment/pre-American democracy history. The progress is not as quick as some would like, but it is progress nevertheless.\n \n By contrast, Islam's inflexible, retrograde dogma still nurtures xenophobia, gender apartheid, hatred, and violence against the unbeliever wherever it gains a toehold in a society's consciousness. Its totalitarian program for God is totally hostile to the most fundamental principles of Western liberal democracy, which is self-evidently the fairest and most beneficial way of life yet conceived. This is not bigotry or islamophobia (especially seeing as it is a line of argument against Islam, not Muslims). It is an objective assessment of Islam's past, present, and certain future if it is not challenged from without and radically changed from within.\n \n The longer we abide Crusades guilt-stricken academics and America-hating überleftists apologizing for Islam in its current (ancient) unreformed state, the more it will threaten our hard-earned and fought for way of life. More infidels will die for being \"the basest creatures in the sight of God,\" and more Muslims will suffer and die for not being the right kind of Muslim. Now is the time for those of us who can be truthful and compassionate to confront Islamosupremacy, to repel the ideological jihad which has vitiated our media, our universities, and even our governments. It will not go away if it is ignored or placated. 20+ current jihad fronts in the world today, not to mention the Arab and Ottoman subjects of old Europe, northern Africa, and south Asia attest to that.\n \n Footnotes\n 1The Life of Muhammad, trans. A. Guillaume, 1955, Oxford University Press, Karachi\n 2Qur'an [The Koran, With Parallel Arabic Text, trans. N.J. Dawood, 2000, Penguin, London] 33:26-27\n 3Luke 20:25, KJV\n 4Qur'an 9:29-30\n 5Qur'an 9:33\n 6Qur'an 38-39\n 7Qur'an 9:41\n 8Qur'an 9:73\n 9Qur'an 9:111\n 10Qur'an 9:122-23\n 11Sahih Bukhari 9.84.59\n 12Sahih Bukhari and Muslim\n 13Sahih Bukhari 5.59.572\n 14Sahih Bukhari 4.52.256\n 15Sahih Muslim 57.20.4712\n 16Sahih Bukhari 4.52.311\n 17Sunan Abu-Dawud, 40.4582\n 18Qur'an 8:55\n 19Qur'an 2:193\n 20Qur'an 3:110\n 21Qur'an 5:51\n 22The Dhimmi: Jews and Christians Under Islam, Bat Ye'or, 1985, Fairleigh Dickinson University Press\n \n http://www.faithfreedom.org/oped/PatrickOBrien50826p3.htm\n \n \n \n See also: http://groups.yahoo.com/group/khilafism/message/1303 Multiculturalism, Tolerance and Pluralism in Islam \n \n See also: http://groups.yahoo.com/group/khilafism/message/1298 Tolerance and Pluralism: Islamic Supremacist Literature sold in OZ Islamic Bookstores \n \n See also: http://groups.yahoo.com/group/khilafism/message/1292 Islamic Separtists in Australia: That's why we don't believe in democracy \n \n See also: http://groups.yahoo.com/group/khilafism/message/1281 Tolerance and Pluralism: Islamic Supremacist Literature casually sold in Australian Mosque \n \n See also: http://groups.yahoo.com/group/khilafism/message/1261 Tolerance and Pluralism: Muslim converts to Christianity face persecution and death in Bangladesh \n \n See also:\n http://groups.yahoo.com/group/khilafism/message/1246\n Tolerance and Pluralism: Muslim Book calls Norwegians\n 'Satan's sons'\n \n See also: http://groups.yahoo.com/group/khilafism/message/1237 \n Triple-pronged Jihad -- Military, Economic and Cultural \n \n See also:\n http://groups.yahoo.com/group/khilafism/message/1216\n Al-Qaeda book on managing savagery\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/1204\n Chicago Tribune: Watchdog group assails mosque's Saudi\n books\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/1185\n Egyptian Progressive Criticizes Muslim Intellectual\n Doublespeak\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/1184\n Submission - Never-ending Islamic Conspiracies\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/1172\n Blood Libel: Muslim Conspiracy Theories\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/1113\n Comparing the Rhetoric of Jihadism and Nazism\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/1050\n Arab ethnic cleansing imperialism and colonialism:\n 1,400 Years of Islamic Aggression\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/928\n Saudi export of strict Islam raises suspicions\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/906\n The Race Against Lies\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/810\n Christians and Jews Demonized in Saudi Textbooks\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/718\n Islamic concept of Al-Taqiyah to infiltrate and\n destroy kafir countries\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/803\n The Rise of Middle Eastern Crime in Australia\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/767\n \"Intolerant Form of Islam\" Taught in German Public\n Schools\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/762\n Egyptian Textbook: Beheadings are part of Islamic\n Culture\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/713\n Exclusivism and multiculturalism in Islamic society\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/536\n Hate at the Local Mosque\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/380\n The Imperialism of Khilafists: Their grand designs to\n conquer the west\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/363\n New Book Calls Europe 'Province of Islam'\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/23\n The Agenda of Islam: A War Between Civilizations\n \n See also:\n http://groups.yahoo.com/group/khilafism/message/2\n The Clash Of Civilizations And The Great Caliphate", 
   {
    "post_info": {
     "post_title": "Islam's Supremacist Past Is Its Present"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1125156780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Islam's Supremacist Past Is Its Present", 
  "url": "http://www.4forums.com/political/current-events-debates/6280-islams-supremacist-past-its-present.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6280, 
  "discussion_files": [
   [
    "10988.html", 
    "http://www.4forums.com/political/current-events-debates/6280-islams-supremacist-past-its-present-print.html"
   ]
  ], 
  "identifier": 6280
 }
]