[
 [
  [
   158069, 
   null, 
   "Anastasia", 
   "I have not heard anything.. Or am I crazy didn't we talk about this?", 
   {
    "post_info": {
     "post_title": "So... Is Waxy a dad yet?"
    }
   }, 
   null, 
   null, 
   1125426060.0
  ], 
  [
   158076, 
   null, 
   "Waxy", 
   "I have not heard anything.. Or am I crazy didn't we talk about this?\n\n \n WWWWHHHHHHHHAAAAAAAAAAAAAA???????????????\n \n I think you're crazy. :p \n \n No plans for any little Waxys running around any time soon LOL.\n \n Waxy", 
   {}, 
   158069, 
   null, 
   1125427500.0
  ], 
  [
   158080, 
   null, 
   "Anastasia", 
   "I have to stop listening to those little voices in my head :)\n I thought I had missed something\n http://4forums.com/political/showthread.php?p=81289#post81289", 
   {}, 
   158076, 
   null, 
   1125428160.0
  ], 
  [
   158086, 
   null, 
   "Waxy", 
   "I should have known Ron was somehow behind this. :p :p \n \n Waxy", 
   {}, 
   158080, 
   null, 
   1125431220.0
  ], 
  [
   158090, 
   null, 
   "Big Orn", 
   "I should have known Ron was somehow behind this. :p :p \n \n Waxy\n\n I have seen it in an orb - the Orb Of Life, my friend. You are powerless to stop it.... emoticon_xhoho :p", 
   {}, 
   158086, 
   null, 
   1125433020.0
  ], 
  [
   158091, 
   null, 
   "Anastasia", 
   "I should have known Ron was somehow behind this. :p :p \n \n Waxy\n\n I would be very careful if I were you..\n You know what they say about the power of the mind.\n \n Ron is sending you baby thoughts...", 
   {}, 
   158086, 
   null, 
   1125433500.0
  ], 
  [
   158092, 
   null, 
   "georged", 
   "I would be very careful if I were you..\n You know what they say about the power of the mind.\n \n Ron is sending you baby thoughts...\n\n \n Ron and Waxy are an item?", 
   {}, 
   158091, 
   null, 
   1125433980.0
  ], 
  [
   158096, 
   null, 
   "Waxy", 
   "Ron and Waxy are an item?\n\n \n Ron's been trying for a long time to get some religion into me, but I'm sure he has his limits. :p \n \n Waxy", 
   {}, 
   158092, 
   null, 
   1125436140.0
  ], 
  [
   158107, 
   null, 
   "Big Orn", 
   "Ron's been trying for a long time to get some religion into me, but I'm sure he has his limits. :p \n \n Waxy\n\n My limits are my own, but I don't speak for the \"ways of lo-o-o-ve\"... :p", 
   {}, 
   158096, 
   null, 
   1125438960.0
  ], 
  [
   158108, 
   null, 
   "Big Orn", 
   "Ron and Waxy are an item?\n\n Item? Like what, George? Please explain. Do I want to see little Waxys running around sniffing up my air, drooling all over the upper reaches of America?\n \n Why, sure I do... ;)", 
   {}, 
   158092, 
   null, 
   1125439140.0
  ], 
  [
   159582, 
   null, 
   "zachvac", 
   "I should have known Ron was somehow behind this. :p :p \n \n Waxy\n\n \n \n Or maybe you are a dad and you just don't know it yet.", 
   {}, 
   158086, 
   null, 
   1125898200.0
  ], 
  [
   272915, 
   null, 
   "Waxy", 
   "YES!\n \n Matthew Alexander was born July 1. He was 7lbs 13 ozs.\n \n Mom and baby are completely health and happy. Dad is TIRED.\n \n Waxy", 
   {}, 
   159582, 
   null, 
   1184002800.0
  ], 
  [
   272946, 
   null, 
   "sinjin", 
   "YES!\n \n Matthew Alexander was born July 1. He was 7lbs 13 ozs.\n \n Mom and baby are completely health and happy. Dad is TIRED.\n \n Waxy\nCongratulations and welcome to the club. Get used to the tired part. Work is the only place I get rest anymore.", 
   {}, 
   272915, 
   null, 
   1184007840.0
  ], 
  [
   272987, 
   null, 
   "daewoo", 
   "CONGRATULATIONS....you poor, poor man!\n \n I'm with Sinjin....get used to \"tired\". It does nto ever go away. Also, do EVERYTHING (non abusive) within your power to keep them from walking or talking for as long as you can! Teaching them to walk and talks SOUNDS like a good idea, but trust me, it is NOT.", 
   {}, 
   272946, 
   null, 
   1184016300.0
  ], 
  [
   272998, 
   null, 
   "Master_Shake", 
   "CONGRATULATIONS!!!!!", 
   {}, 
   272987, 
   null, 
   1184020020.0
  ], 
  [
   273000, 
   null, 
   "Master_Shake", 
   "CONGRATULATIONS....you poor, poor man!\n \n I'm with Sinjin....get used to \"tired\". It does nto ever go away. Also, do EVERYTHING (non abusive) within your power to keep them from walking or talking for as long as you can! Teaching them to walk and talks SOUNDS like a good idea, but trust me, it is NOT.\n\n LMAO!!! .", 
   {}, 
   272987, 
   null, 
   1184020080.0
  ], 
  [
   273933, 
   null, 
   "snakespit", 
   "Congrats! Fatherhood is one of the best things you will never want to happen again, and again, and again.\n \n Tip. Learn these phrases:\n \n To the child:\n No (repeat 857 times or until you are blue in the face)\n Where is you mother? (also heard as \"ask your mother\")\n Don't touch that.\n Put that down.\n Go get something to clean that up.\n \n To mom:\n Why?\n Come take your child.\n (after handing the child off to mom) -Honey, he just loaded his diaper...I swear it wasn't 30 minutes before you got home.\n I don't smell anything (try to look sincere)\n I didn't hear him crying (again, try to appear sincere)\n \n To everyone else:\n We have a baby. (when asked what the smell in your house is)\n I can't, I have the baby.\n \n Remember:\n You once had a social life. emoticon_xhoho \n You once had a sex life emoticon_love \n You once could sleep emoticon_zzzz (also hear the TV, enjoy the peace of the bathroom, walk through the house without tripping on toys, enjoy your various electronic gadgets without having peanut butter smeared on them [personal experience with Skippy Chunky and a computer emoticon_angry ])\n They leave eventually. :) \n Eventually is a long time away.emoticon_cry \n \n \n Seriously, kids are great. Enjoy every day as much as possible, it goes by really fast.", 
   {}, 
   273000, 
   null, 
   1184656020.0
  ], 
  [
   274005, 
   null, 
   "daewoo", 
   "Remember:\n You once had a social life. \n You once had a sex life \n You once could sleep (also hear the TV, enjoy the peace of the bathroom, walk through the house without tripping on toys, enjoy your various electronic gadgets without having peanut butter smeared on them [personal experience with Skippy Chunky and a computer ])\n They leave eventually. \n Eventually is a long time away. \n\n \n ROTFLMAO. The ups side on the sex thing is that after you have a few kids, you don't really WANT to have sex anymore. About the ttime the third one starts destroying things a fundamental shift occurs...sex is no longer associated with good times and fun. It becomes associated with actually having children, and that just destroys the whole experience :) \n \n I saw something the other day at the hardware store that I had never seen before. It would have saved me THOUSANDS of dollars in remote controls, phones, tablet PCs and PDAs. It is a LOCK for the TOILET! I had never seen such a thing before! Whoever invented that is going to be richer than bill gates!\n \n I have found that if you adopt a zen outlook on life it will help a lot. Yesterday I was in the yard working with a horse with my brother. I heard a shriek, and here comes my 2 yr old, completely naked, running around the side of the house. He had a roll of toilet paper on a stick and was unrolling it behind him as he ran. At one time, that would have concerned me. Anymore, I jsut shook my head and said \"huh....thats new\" and went on with what I was doing. My wife was supposed to be inside watching the kids and she had fallen asleep on the couch. Apparently spongebob squarepants was not intellectually stimulating enough to keep her attention and she had dozed off. A 2 yr old, a 4 yr old, and a 1 yr old completely unsupervised is a recipe for disaster. \n \n Finally, waxy, there is going to be a time...probably 2 or 3 years down the line, when you spend a lot of time thinking \"Is this kid defective or something\". You will probably feel bad about thinking it, but don't, it is perfectly natural. Don't worry, though, the kid is not defective. They are ALL like that. When you see other peoples kids and it seems like they are always well behaved, it is a front. They are jsut on their best behavior. When those well behaved kids are at home without comapny, they preend like they don't know what the word \"no\" means, and they try to wheedle and negotiate, and they make messes and put things in the toilet and destroy anything wiht an LCD screen that they can get their hands on...just like yours will.", 
   {}, 
   273933, 
   null, 
   1184694300.0
  ], 
  [
   274021, 
   null, 
   "Waxy", 
   "LOL. Some great posts. :p Thanks.\n \n Two and half weeks in, and I know you're not supposed to say it, but there's been many a time that if I could have rolled the clock back ten months and gone fishing instead I would have done it in a heart beat.\n \n I sorta remember sleeping, and unfortunately, I still remember sex.\n \n I keep telling myself \"just get through the first 6 months\", but 6 months might as well be 60 years at this point. I thought I was ready, but I don't think you're ever really ready. I had a sweet life before, and I now realize that those days are COMPLETELY GONE, there's a new sheriff in town. \n \n It's not all bad though, he's a cute little guy, and I've got a lot of good times that I'm looking forward to with \"my boy\".\n \n Waxy", 
   {}, 
   274005, 
   null, 
   1184699940.0
  ], 
  [
   274031, 
   null, 
   "sinjin", 
   "LOL. Some great posts. :p Thanks.\n \n Two and half weeks in, and I know you're not supposed to say it, but there's been many a time that if I could have rolled the clock back ten months and gone fishing instead I would have done it in a heart beat.\n \n I sorta remember sleeping, and unfortunately, I still remember sex.\n \n I keep telling myself \"just get through the first 6 months\", but 6 months might as well be 60 years at this point. I thought I was ready, but I don't think you're ever really ready. I had a sweet life before, and I now realize that those days are COMPLETELY GONE, there's a new sheriff in town. \n \n It's not all bad though, he's a cute little guy, and I've got a lot of good times that I'm looking forward to with \"my boy\".\n \n Waxy\n\n \n Take lots of pictures. You will not clearly remember this period in a couple years. I think your brain blocks out the memory of the most demanding parts. Otherwise you'd never be crazy enough to consider doing it again.\n \n Other than my bluewater sailing experiences, infant maintenance was/is the most strenuous endeavor I've undertaken. You operate continually in a state similar I imagine to battle fatigue.", 
   {}, 
   274021, 
   null, 
   1184704080.0
  ], 
  [
   274058, 
   null, 
   "snakespit", 
   "Two and half weeks in, and I know you're not supposed to say it, but there's been many a time that if I could have rolled the clock back ten months and gone fishing instead I would have done it in a heart beat.\n\n I had that very same thought, about both the conception and the delivery. The delivery was like a train wreck. You don't want to look, but you just can't stop yourself from looking. Once you do look, you are sorry that you did.\n \n \nI thought I was ready, but I don't think you're ever really ready. I had a sweet life before, and I now realize that those days are COMPLETELY GONE, there's a new sheriff in town.\n\n Right. Nobody is ever ready, it's just something you have to dive into. Your life will be sweet in new ways. It won't take long before you start to forget about the old days. As soon as you start noticing your son's personality come out, you will have many other things to occupy your time.", 
   {}, 
   274021, 
   null, 
   1184712060.0
  ], 
  [
   274066, 
   null, 
   "Waxy", 
   "I had that very same thought, about both the conception and the delivery. The delivery was like a train wreck. You don't want to look, but you just can't stop yourself from looking. Once you do look, you are sorry that you did.\n\n \n AMEN! LOL. In some ways I don't regret it, it was amazing, but nothing will ever be the same. emoticon_frazzled \n \n \nRight. Nobody is ever ready, it's just something you have to dive into. Your life will be sweet in new ways. It won't take long before you start to forget about the old days. As soon as you start noticing your son's personality come out, you will have many other things to occupy your time.\n\n \n That's what everyone keeps telling me and what I keep telling myself, and I am looking forward to that.\n \n I've never been much of a \"kids\" person. In fact, young children have always kind of annoyed me. I'm impatient, rather indepedent by nature, and I like my peace and quiet. I'm really looking forward to the point where he's old enough that I can do all things I loved doing before, but we can do them together without it being a three ring circus.\n \n Waxy", 
   {}, 
   274058, 
   null, 
   1184714040.0
  ], 
  [
   274074, 
   null, 
   "sinjin", 
   "I'm impatient, rather indepedent by nature, and I like my peace and quiet. I'm really looking forward to the point where he's old enough that I can do all things I loved doing before, but we can do them together without it being a three ring circus.\n \n Waxy\nThat gives you about 5 yrs to work on the patience thing.:p", 
   {}, 
   274066, 
   null, 
   1184716020.0
  ], 
  [
   274098, 
   null, 
   "daewoo", 
   "Yea.....might want to work on that \"patience\" thing and you may as well give up on the idea of peace and quiet and doing things without them being a 3 ring circus.\n \n Right now you are being told the great lie.....6 months and then things will calm down. This is a lie of omission. Around 6 months they should be sleeping through the night and fairly sociable. they smile sweetly and babble quietly. Then they get mobile. First they crawl and can pull themselves to a standing position if they have something to hold onto. You will find yourself instituting a 3 ft rule (anything of ANY VALUE whatsoever has to be 3 ft above the floor). Then they learn to walk and it becomes a 4 ft rule. Then they get to the point they can climb, and nothing is ever safe again.\n \n Somewhere along the way they learn the cursed word....WHY???? and you hear WHYWHYWHYWHYWHYWHY constantly. What you get at 6 months is a brief break...then it REALLY get HARD. \n \n My wife has the same problem with patience. She has never had very much. I, on the other hand, have the patience of a chopping block. Trust me, start working on it NOW. You will need it. Especially in a year and a half whne you stupidly decide to have another one (it won't seem stupid at the time....only later will you sit down with your wife and say \"OH MY GOD WHAT HAVE WE DONE\"). Trust me, there is no such thing as too much patience. You will need every bit.\n \n There ARE tradeoffs, though. Every day is like a new adventure as they grow and learn and define themselves. Some days you watch them and go \"My god...the kids a genius\". Then 10 minutes later, still watching them, you catch yourself thinking \"Holy ####, the kid is a complete retard\". \n \n Overall I would generally recomend fatherhood. It is an expensive, life changing, pain in the butt. Your social life is gone, your hobbies may as well have never existed, and you should be prepared to spend the next decade answering the stupidest questions you can possibly imagine, but it is also more fun than anything else I can think of.", 
   {}, 
   274074, 
   null, 
   1184719920.0
  ], 
  [
   317943, 
   null, 
   "snakespit", 
   "Just out of curiosity, how is it going Waxy? Little over a year in...having a good time?", 
   {}, 
   274098, 
   null, 
   1217226060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  So... Is Waxy a dad yet?", 
  "url": "http://www.4forums.com/political/parenting/6299-so-waxy-dad-yet.html", 
  "breadcrumbs": [
   "Parenting"
  ], 
  "id_number": 6299, 
  "discussion_files": [
   [
    "5919.html", 
    "http://www.4forums.com/political/parenting/6299-so-waxy-dad-yet-print.html"
   ], 
   [
    "5920.html", 
    "http://www.4forums.com/political/parenting/6299-so-waxy-dad-yet-2-print.html"
   ]
  ], 
  "identifier": 6299
 }
]