[
 [
  [
   158577, 
   null, 
   "JPSartre12", 
   "After spending the past few days glued to the TV's coverage of Katrina, I began to wonder what all of the anti-Christians had to say about the fact that MOST of the help being given to Katrina victims is coming from CHRISTIAN ORGANIZATIONS. I've yet to see an atheist charity step up to the plate. What's the matter? Are only Christian organizations compassionate enough to lend a helping hand? \n I guess just as there are no atheists in a foxhole, there aren't any atheists in charitiable organizations either. emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "Why are the majority of charities Christian?"
    }
   }, 
   null, 
   null, 
   1125600420.0
  ], 
  [
   158578, 
   null, 
   "Jo Bennett", 
   "How about because while many charities have a Christian foundation, not all their contributors or workers will be Christian? Exhibit A: the American Red Cross.", 
   {}, 
   158577, 
   null, 
   1125600540.0
  ], 
  [
   158582, 
   null, 
   "JPSartre12", 
   "How about because while many charities have a Christian foundation, not all their contributors or workers will be Christian? Exhibit A: the American Red Cross.\n\n \n From another thread:\n \n\n Michael Brown, head of the Federal Emergency Management Agency, urged people to make contributions to organizations. FEMA listed the following agencies as needing cash to assist hurricane victims:\n \n \u0095 American Red Cross, 800-HELP NOW, 800-435-7669\n \n \u0095 Operation Blessing, 800-436-6348\n \n \u0095 America's Second Harvest, 800-344-8070\n \n \u0095 Adventist Community Services, 800-381-7171\n \n \u0095 Catholic Charities, 703-549-1390\n \n \u0095 Christian Reformed World Relief Committee, 800-848-5818\n \n \u0095 Church World Service, 800-297-1516\n \n \u0095 Convoy of Hope, 417-823-8998\n \n \u0095 Episcopal Relief & Development, 1-800-334-7626 or\n \n \u0095 Lutheran Disaster Response, 800-638-3522\n \n \u0095 Mennonite Disaster Service, 717-859-2210\n \n \u0095 Presbyterian Disaster Assistance, 800-872-3283\n \n \u0095 Salvation Army, 800-SAL-ARMY (725-2769)\n \n \u0095 Southern Baptist Convention Disaster Relief, 800-462-8657, ext. 6440\n \n \u0095 United Methodist Committee on Relief, 800-554-8583\n \n --Associated Press\n\n \n The head of the Federal Emergency Management Agency is directing people wanting to contribute to give to the Christian charities above. Again, where are the atheist organizations?", 
   {}, 
   158578, 
   null, 
   1125601140.0
  ], 
  [
   158585, 
   null, 
   "joebrummer", 
   "After spending the past few days glued to the TV's coverage of Katrina, I began to wonder what all of the anti-Christians had to say about the fact that MOST of the help being given to Katrina victims is coming from CHRISTIAN ORGANIZATIONS. I've yet to see an atheist charity step up to the plate. What's the matter? Are only Christian organizations compassionate enough to lend a helping hand? \n I guess just as there are no atheists in a foxhole, there aren't any atheists in charitiable organizations either. emoticon_rolleyes\n\n \n I don't think the majority of people realize the red cross is a christian organization. I also don't believe there main mission is religious.\n \n You seem to be attacking atheist, but then discount secular charity organizations like the united way. Why is that?", 
   {}, 
   158577, 
   null, 
   1125601200.0
  ], 
  [
   158590, 
   null, 
   "georged", 
   "After spending the past few days glued to the TV's coverage of Katrina, I began to wonder what all of the anti-Christians had to say about the fact that MOST of the help being given to Katrina victims is coming from CHRISTIAN ORGANIZATIONS. I've yet to see an atheist charity step up to the plate. What's the matter? Are only Christian organizations compassionate enough to lend a helping hand? \n I guess just as there are no atheists in a foxhole, there aren't any atheists in charitiable organizations either. emoticon_rolleyes\n\n \n Atheism as a organization (if there is one) would find it difficult qualifying for not-for-profit tax free status enjoyed by wealthy Christian organizations. I once did a study on non-profits and religious principal salary/benefit levels would warm the heart of any capitalist, and in many cases make them very envious. All Christian organizations have a fixed percentage of donations raised for emergencies set aside for administrative, expansion and reserve purposes, all tax free. Disasters such as Katrina actually serve to build their financial strength and subsequent political clout.", 
   {}, 
   158577, 
   null, 
   1125601980.0
  ], 
  [
   158599, 
   null, 
   "Jo Bennett", 
   "From another thread:\n \n \n The head of the Federal Emergency Management Agency is directing people wanting to contribute to give to the Christian charities above. Again, where are the atheist organizations?\n\n \n Well, who was the head of FEMA appointed by? A brief googling seems to suggest a Mr. G.W. Bush was responsible, it wouldn't be entirely out of the question for dubya to appoint another member of the Christian right to this permission, who might be keen for Christian charities to be promoted. Other possible reasons are that religion is very strong in the south, and hence religious charities are more likely to have resources in the south, were the problem is.\n \n In any case, the red cross is by far the largest organisation involved, and as has already been estalbished is secular. And as I said before just because the organisations are Christian doesn't necessarily mean that their workers or contributors are.", 
   {}, 
   158582, 
   null, 
   1125604800.0
  ], 
  [
   158603, 
   null, 
   "sanguinekane", 
   "Perhaps the \"atheist\" orginizations are already busy dealing with problems such as AIDs, poverty and other such horrible dangers in other parts of the world. \n \n Otherwise, this is really just a pathetic way to insult non-Christians.", 
   {}, 
   158599, 
   null, 
   1125605940.0
  ], 
  [
   158609, 
   null, 
   "unkerpaulie", 
   "christianity cultivates a special skill in its leaders of appealing to people emotionally. its their survival tactic, so to speak. even if you had an athiest-run charitable organization, you'd probably use these tactics to get people to support it, and you'd quite likely hire a christian to do your marketing lol", 
   {}, 
   158603, 
   null, 
   1125606600.0
  ], 
  [
   158617, 
   null, 
   "Wez", 
   "With the vast majority of the population being Christian, it seems obvious that the vast majority of charities are Christian.\n \n http://www.cia.gov/cia/publications/factbook/geos/us.html#People\n \n Then there's the fact that, in the past, just about everyone in the US was a Christian. That's round about the time many of these organisations were set up, so logically they'll be Christian.\n \n There's also the fact that non-Christian people give to Christian charities.\n \n Finally, quantity of charities doesn't actually reflect the quantity of help given. For example, the Red Cross will be giving more than the Mennonite Disaster Service.\n \n -Wez", 
   {
    "unicode_changes_made": true
   }, 
   158609, 
   null, 
   1125607920.0
  ], 
  [
   158693, 
   null, 
   "sanguinekane", 
   "There is also the fact that New Orleans is something of a primary constitunacy (did I spell that corectly?) to these Christian charaties. Next time there is a big earthquake here in San Francisco, I can gurrantee you all these charaties wont make nearly as big a deal about helping out.", 
   {}, 
   158617, 
   null, 
   1125618600.0
  ], 
  [
   158694, 
   null, 
   "Redratio1", 
   "Perhaps the \"atheist\" orginizations are already busy dealing with problems such as AIDs, poverty and other such horrible dangers in other parts of the world. \n \n Otherwise, this is really just a pathetic way to insult non-Christians.\n\n \n Exactly. More Christian conceit.\n \n UNHCR\n UNICEF\n Doctors without Borders\n The Green Crecent\n The list goes on and on.", 
   {}, 
   158603, 
   null, 
   1125618720.0
  ], 
  [
   158702, 
   null, 
   "JPSartre12", 
   "There is also the fact that New Orleans is something of a primary constitunacy (did I spell that corectly?) to these Christian charaties. Next time there is a big earthquake here in San Francisco, I can gurrantee you all these chaaties wont make nearly as big a deal about helping out.\n\n \n I'll take that bet. How about $500?", 
   {}, 
   158693, 
   null, 
   1125619320.0
  ], 
  [
   158704, 
   null, 
   "JPSartre12", 
   "I don't think the majority of people realize the red cross is a christian organization. I also don't believe there main mission is religious.\n \n You seem to be attacking atheist, but then discount secular charity organizations like the united way. Why is that?\n\n \n I'm not discounting secular organizations. I'm discounting atheists. They **** and moan about the wicked Christians trying to run their lives but don't pony up when others need help. Christians lend a hand in spite of all their supposed wickedness, but atheists are typically a bunch of cheap windbags. They speak of \"intrinsic morality\" not being religious-based, but don't display an ounce of it when push comes to shove. :xcensored", 
   {}, 
   158585, 
   null, 
   1125619620.0
  ], 
  [
   158705, 
   null, 
   "Redratio1", 
   "They speak of \"intrinsic morality\" not being religious-based, but don't display an ounce of it when push comes to shove. :xcensored\n\n \n What a load of garbage.", 
   {}, 
   158704, 
   null, 
   1125619920.0
  ], 
  [
   158706, 
   null, 
   "sanguinekane", 
   "Yes, because atheists love it when New Orleans gets drowned in water and thousands die. Hell, I know I'm throwing a party tonight, going to get my atheist friends over, and my pagan brothers to. Maybe a couple of beers, some dogs on the grill, all topped off with us ******* on a crucifex. emoticon_rolleyes \n \n Grow up.", 
   {}, 
   158704, 
   null, 
   1125619980.0
  ], 
  [
   158710, 
   null, 
   "JPSartre12", 
   "With the vast majority of the population being Christian, it seems obvious that the vast majority of charities are Christian.\n \n http://www.cia.gov/cia/publications/factbook/geos/us.html#People\n \n Then there's the fact that, in the past, just about everyone in the US was a Christian. That's round about the time many of these organisations were set up, so logically they'll be Christian.\n\n Why would they \"necessarily\" be Christian organizations? They could just as easily be secular like the Red Cross? The reason is because Christianity teaches and promotes charity towards others and Christians put their money where their mouths are. Atheists doesn't. It's a \"WIIFM\" philosophy. \n \n\n There's also the fact that non-Christian people give to Christian charities.\n\n As you stated above, the majority would be Christians. I can't think of too many philantropic atheists, can you? emoticon_rolleyes \n \n\n Finally, quantity of charities doesn't actually reflect the quantity of help given. For example, the Red Cross will be giving more than the Mennonite Disaster Service.\n \n -Wez\n\n \n \n I'm not knocking the Red Cross. It's a great organization that has had its share of problems, but has weathered them and does great good around the world. It is also a Congressionally-chartered organization, unlike all of the Christian charities.", 
   {
    "unicode_changes_made": true
   }, 
   158617, 
   null, 
   1125620400.0
  ], 
  [
   158711, 
   null, 
   "jskufan", 
   "Speaking from the Catholic standpoint, our religion is based on helping others on a day to day basis, let alone a natural disaster. We have additional collections all the time for charitable missions all over the world. We live in a wealthy country whose government apparently has hundreds of billions of dollars to better the lives of Middle Easterners in Iraq, I would expect we could take better care of our own without pandering for handouts from private charities. We need to get our priorities straight.", 
   {}, 
   158702, 
   null, 
   1125620460.0
  ], 
  [
   158715, 
   null, 
   "Big_Bear_Scot", 
   "As you stated above, the majority would be Christians. I can't think of too many philantropic atheists, can you? \n \n \n Why is it such an issue ?\n \n To me if an organisation is doing some good it doesn't matter if they are Muslim, Hindu, Christian etc.", 
   {}, 
   158711, 
   null, 
   1125621540.0
  ], 
  [
   158718, 
   null, 
   "JPSartre12", 
   "Why is it such an issue ?\n \n To me if an organisation is doing some good it doesn't matter if they are Muslim, Hindu, Christian etc.\n\n \n It's an issue because I always see negative posts about Christians and Christianity coming from the atheists on this forum but they remain damn silent when Christian organizations step up and help out everyone who needs help. \n It's real easy for them to complain about Christianity but they're not to be found when it comes to acknowledging the good that Christian organizations do. emoticon_mad", 
   {}, 
   158715, 
   null, 
   1125622080.0
  ], 
  [
   158720, 
   null, 
   "sanguinekane", 
   "No one is saying that Christian orginizations arent doing a good job. More power to them. We're taking exception to the view that atheists want to see the people of New Orleans suffer. I myself have sent off a $150 check to the Red Cross. Would I do that if I hated the people who were suffering in that area right now?", 
   {}, 
   158718, 
   null, 
   1125622260.0
  ], 
  [
   158721, 
   null, 
   "Redratio1", 
   "Its probably GAY money you sent! emoticon_wow", 
   {}, 
   158720, 
   null, 
   1125622320.0
  ], 
  [
   158722, 
   null, 
   "sanguinekane", 
   "Yeah, it passed through SF, that means it been contaminated and is therefore unsanitary for use by Christian extremists.", 
   {}, 
   158721, 
   null, 
   1125622500.0
  ], 
  [
   158730, 
   null, 
   "Mucusaur", 
   "is it because chritsians beleive in charity and help to the less fortunate? Is that the right answer?", 
   {}, 
   158706, 
   null, 
   1125624960.0
  ], 
  [
   158732, 
   null, 
   "JPSartre12", 
   "No one is saying that Christian orginizations arent doing a good job. More power to them. We're taking exception to the view that atheists want to see the people of New Orleans suffer. I myself have sent off a $150 check to the Red Cross. Would I do that if I hated the people who were suffering in that area right now?\n\n \n What I said was I don't see any atheist organizations stepping to the plate like the dozens of Christian charities are doing, nor do I see any atheists on this board acknowledging the good that the Christians are doing. All they do is bitch.\n And to say that Christians only help Christians is BS. They also sent a lot of money for Tsunami relief and a hundred other areas where help was needed, regardless of their religious affiliation. To say otherwise is disengenuous on your part.", 
   {}, 
   158720, 
   null, 
   1125625080.0
  ], 
  [
   158733, 
   null, 
   "Redratio1", 
   "What I said was I don't see any atheist organizations stepping to the plate like the dozens of Christian charities are doing, nor do I see any atheists on this board acknowledging the good that the Christians are doing. All they do is bitch.\n\n \n All you do is bitch. Soooooo.........?", 
   {}, 
   158732, 
   null, 
   1125625140.0
  ], 
  [
   158734, 
   null, 
   "JPSartre12", 
   "All you do is bitch. Soooooo.........?\n\n \n I put my money where my mouth is. How about you? emoticon_rolleyes", 
   {}, 
   158733, 
   null, 
   1125625260.0
  ], 
  [
   158756, 
   null, 
   "Waxy", 
   "JP, I'm losing an enormous amount of respect for you with every post you make in this thread.\n \n Not only are you pounding on a very shaky generalization, but you're beating your chest and strutting about for all to see in a fit of righteous indignation because you've (and Christian organizations) donated some money to the hurricane relief.\n \n It sickens me. \n \n IIRC, this type of attitude was seriously frowned upon by Jesus himself on several occasions in the Bible.\n \n The vast majority of the US population is Christian, and therefore the majority of charitable organizations are Christian. Is that so hard to figure out? People donate money, ATHEISTS TOO, THOSE BASTARDS, to whatever charity they feel is going to get the most out of their money. \n \n What do want? A roll call of everyone here posting a tax receipt for their charitable donations so we can all whip them out and compare? What is this, the second grade?\n \n Why you would feel the need to come on this board and point fingers while blowing your own horn is beyond me. \n \n Waxy", 
   {}, 
   158734, 
   null, 
   1125629460.0
  ], 
  [
   158763, 
   null, 
   "JPSartre12", 
   "JP, I'm losing an enormous amount of respect for you with every post you make in this thread.\n \n Not only are you pounding on a very shaky generalization, but you're beating your chest and strutting about for all to see in a fit of righteous indignation because you've (and Christian organizations) donated some money to the hurricane relief.\n \n It sickens me. \n \n IIRC, this type of attitude was seriously frowned upon by Jesus himself on several occasions in the Bible.\n \n The vast majority of the US population is Christian, and therefore the majority of charitable organizations are Christian. Is that so hard to figure out? People donate money, ATHEISTS TOO, THOSE BASTARDS, to whatever charity they feel is going to get the most out of their money. \n \n What do want? A roll call of everyone here posting a tax receipt for their charitable donations so we can all whip them out and compare? What is this, the second grade?\n \n Why you would feel the need to come on this board and point fingers while blowing your own horn is beyond me. \n \n Waxy\n\n \n \n I'm not trying to blow my own horn. I happened to see the thread about charities and saw that the majority were Christian organizations. They weren't secular foundations, they were Churches and other Christian organizations.\n I then began to think of all the anti-Christian propaganda that's been posted on here lately and thought that, just maybe, someone should point out to those blinded by anti-Christian hate that Christians do good things all of the time. I may have gone off a bit, but I'm better now. :)", 
   {}, 
   158756, 
   null, 
   1125630780.0
  ], 
  [
   158815, 
   null, 
   "Wez", 
   "I'm not discounting secular organizations. I'm discounting atheists. They **** and moan about the wicked Christians trying to run their lives but don't pony up when others need help. Christians lend a hand in spite of all their supposed wickedness, but atheists are typically a bunch of cheap windbags. They speak of \"intrinsic morality\" not being religious-based, but don't display an ounce of it when push comes to shove. :xcensored\n\n In another thread you said you'd try to stop with the generalisations. What happened? Can you provide a shred of evidence of how Christians give more per person?\n \n \nWhy would they \"necessarily\" be Christian organizations?\n\n Because most people are Christian.\n \n \nThe reason is because Christianity teaches and promotes charity towards others and Christians put their money where their mouths are.\n\n Why don't churches sell all their gold then? What possible benefit does it bring them? Why not sell it all? God sees no value for money in his kingdom, so why do churches insist on storing it?\n \n \nAs you stated above, the majority would be Christians. I can't think of too many philantropic atheists, can you?\n\n Red Cross?\n \n \nIt's an issue because I always see negative posts about Christians and Christianity coming from the atheists on this forum but they remain damn silent when Christian organizations step up and help out everyone who needs help.\n\n People tend to bash stupid Christians such as Chic and co, rather than Christianity as a whole. Those who bash Christianity as a whole are XXXXXX. Just like those who bash non-religious people as a whole.\n \n \nWhat I said was I don't see any atheist organizations stepping to the plate like the dozens of Christian charities are doing\n\n As I said, quantity of charities isn't directly proportional to quantity of help. The Red Cross, yet again, does more than dozens off smaller charities put together.\n \n \nIt's real easy for them to complain about Christianity but they're not to be found when it comes to acknowledging the good that Christian organizations do. \n\n People acknowledge Christian charities do good. Where is there a single post saying something to the contrary?\n \n -Wez", 
   {}, 
   158704, 
   null, 
   1125659700.0
  ], 
  [
   158820, 
   null, 
   "gnojek", 
   "It's as simple as this.\n \n Most charities need organization.\n Most religious organizations are organized.\n Most religious organizations are non-profit.\n \n SO most charities are based on or around non-profit organizations, most of which are religious organizations, most of which, in the US, are christian.\n \n But there are Jewish, Muslim, etc. charities, just fewer of them, since there are fewer Jews, Muslims, etc.\n \n It's very simple and it's nothing special to do with Christianity.\n \n Why are most charities in the Middle East Muslim?\n Because Christians aren't charitable.\n Make sense?", 
   {}, 
   158815, 
   null, 
   1125661620.0
  ], 
  [
   158908, 
   null, 
   "JPSartre12", 
   "In another thread you said you'd try to stop with the generalisations. What happened? \n\n I had an epiphany. :) \n \n\n Can you provide a shred of evidence of how Christians give more per person?\n \n\n Difficult to do, but tell me how many atheists that you know tithe? emoticon_rolleyes \n \n\n Because most people are Christian.\n\n No argumewnt there.\n \n\n Why don't churches sell all their gold then? What possible benefit does it bring them? Why not sell it all? God sees no value for money in his kingdom, so why do churches insist on storing it?\n\n I don't know of any churches that speculate in precious metals, so I can't answer that. \n \n\n Red Cross?\n\n The Red Cross is an atheist organization?! emoticon_wow I guess that I didn't get the memo. :) \n \n\n People tend to bash stupid Christians such as Chic and co, rather than Christianity as a whole. Those who bash Christianity as a whole are XXXXXX. Just like those who bash non-religious people as a whole.\n\n Might I suggest that you do a quick search of this forum. Pay particular attention to the anti-Christian Gay Forum. \n \n\n As I said, quantity of charities isn't directly proportional to quantity of help. The Red Cross, yet again, does more than dozens off smaller charities put together.\n\n You keep bringing up the Red Cross. The majority of donators to the Red Cross are most likely Christians as well, so what's your point? emoticon_confused \n \n\n People acknowledge Christian charities do good. Where is there a single post saying something to the contrary?\n \n -Wez\n\n This forum is replete with Christian bashers. You'd have to be blind to not see that and an essential part of Christian doctrine IS charity. So, when they bash Christianity, they also bash the good that Christians do.", 
   {}, 
   158815, 
   null, 
   1125687420.0
  ], 
  [
   158926, 
   null, 
   "jitobear", 
   "I had an epiphany. :) \n \n Might I suggest that you do a quick search of this forum. Pay particular attention to the anti-Christian Gay Forum. \n\n \n JP - you are big time generalizing.\n \n Just becuase one disagrees with one action of Christianity does not mean that they don't recognize the good of another action.\n \n The gay rights forum is a forum about gay rights. Christianity opposes gay rights. Of course they are gonna get reamed there.\n \n If it were a forum about the good works of the church it would be different.\n \n I recognize the charity of many Christian organizations and the committment to education. I EVEN attended a Catholic University.\n \n However, when it comes to reproductive issues and gay rights the church is gonna get it square in the teeth from me. That does not make me \"anti-Christian\", it just means I am in favor of things that the church isn't.", 
   {}, 
   158908, 
   null, 
   1125689940.0
  ], 
  [
   158954, 
   null, 
   "Wez", 
   "Difficult to do, but tell me how many atheists that you know tithe? emoticon_rolleyes \n\n None, seeing as tithing generally means giving money to the clergy/church.\n \n \nI don't know of any churches that speculate in precious metals, so I can't answer that. \n\n Making it simple: Why doesn't the RC church sell all its gold and use the money to help the poor?\n \n \nThe Red Cross is an atheist organization?! emoticon_wow I guess that I didn't get the memo. :) \n\n The [British] Red cross website has no matches for the words: \"God\", \"Christian\" or \"religion\". The American one has matches, but not in relation to the Red Cross's beliefs. Have you got evidence it's Christian?\n \n \nMight I suggest that you do a quick search of this forum. Pay particular attention to the anti-Christian Gay Forum. \n\n That's another generalisation. Why do you make them? I won't just pick on you though. This is another stupid generalisation: \nChristianity opposes gay rights\".\n\n \n \nYou keep bringing up the Red Cross. The majority of donators to the Red Cross are most likely Christians as well, so what's your point? emoticon_confused\n\n But is the Red Cross Christian? Obviously most contributors are Christian. That's obvious as most Americans are Christian. \n \n \nThis forum is replete with Christian bashers. You'd have to be blind to not see that and an essential part of Christian doctrine IS charity. So, when they bash Christianity, they also bash the good that Christians do.\n\n That makes no sense.\n \n If someone criticises, for example, the Church's stance on abortion, it doesn't mean that the person is criticising the church's charity. Someone who just insults the Church in general, or gays in general, should just be ignored.\n \n -Wez", 
   {}, 
   158908, 
   null, 
   1125695700.0
  ], 
  [
   158964, 
   null, 
   "gnojek", 
   "As you stated above, the majority would be Christians. I can't think of too many philantropic atheists, can you? emoticon_rolleyes \n\n \n Just one I can think of of the top of my head.\n \n Bill Gates Foundation\n \n Maybe Gates isn't athiest, but he's not Christian.\n \n http://www.jesus-is-savior.com/Believer's%20Corner/meet_a_few_atheists.htm", 
   {}, 
   158710, 
   null, 
   1125697200.0
  ], 
  [
   158968, 
   null, 
   "Redratio1", 
   "Atheist is a catch all phrase that Christian conservatives use for everyone not a Christian conservative.\n \n It is quite a typical generalization.\n \n Oh yeah, Doctors without Borders. I believe they won the Nobel Peace Prize.", 
   {}, 
   158964, 
   null, 
   1125698100.0
  ], 
  [
   158987, 
   null, 
   "JPSartre12", 
   "JP - you are big time generalizing.\n\n Yes I was. I was attempting to make a point. I get tired of hearing the anti-Christian generalizations and decided to use this instance to reciprocate. You've read the same generalized anti-Christian posts as I have, so you know that they don't represent all of Christianity just as my statements don't necessarily represent all atheists.\n \n\n Just becuase one disagrees with one action of Christianity does not mean that they don't recognize the good of another action.\n\n Until THIS thread, I hadn't heard one positive thing said about Christians by atheists.\n \n\n The gay rights forum is a forum about gay rights. Christianity opposes gay rights. Of course they are gonna get reamed there.\n If it were a forum about the good works of the church it would be different.\n \n\n But it's more than just disagreeing with the policy. Some want to eliminate Christianity all together.[/quote]\n \n\n I recognize the charity of many Christian organizations and the committment to education. I EVEN attended a Catholic University.\n \n However, when it comes to reproductive issues and gay rights the church is gonna get it square in the teeth from me. That does not make me \"anti-Christian\", it just means I am in favor of things that the church isn't.\n\n \n I don't necessarily agree with all Christian dogma and positions myself, but I don't attempt to crucify all Christians as I've seen in this forum because of my differences.\n Well, I think that I've beaten this dead horse to death, so I'll end my prolonged rant now.", 
   {}, 
   158926, 
   null, 
   1125703260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why are the majority of charities Christian?", 
  "url": "http://www.4forums.com/political/current-events-debates/6319-why-majority-charities-christian.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6319, 
  "discussion_files": [
   [
    "21749.html", 
    "http://www.4forums.com/political/current-events-debates/6319-why-majority-charities-christian-print.html"
   ], 
   [
    "21750.html", 
    "http://www.4forums.com/political/current-events-debates/6319-why-majority-charities-christian-3-print.html"
   ], 
   [
    "21751.html", 
    "http://www.4forums.com/political/current-events-debates/6319-why-majority-charities-christian-2-print.html"
   ]
  ], 
  "identifier": 6319
 }
]