[
 [
  [
   8552, 
   null, 
   "katie5890", 
   "Give me your thoughts on it.", 
   {
    "post_info": {
     "post_title": "child abuse"
    }
   }, 
   null, 
   null, 
   1054264680.0
  ], 
  [
   8702, 
   null, 
   "DarKnight", 
   "I think it's bad and no-one should do it.\n \n (I think you need to be a little more specific :p )\n \n In terms of law inforcement, I think we need to crack down on this BIG TIME and don't stop till they stop.\n In terms of punishment, I think we should introduce a death penalty (or at least permanent encarsiration with NO CHANCE WHATSOEVER of parole/bail). \n Death sounds a little harsh but these people are nasty, nasty people and for what they're prepared to do I really think they should be dealt with perminantly. Afterall what if it was YOUR kid? what it it was your KIDS? Would you not think that no child is safe untill something really perminant is done?", 
   {}, 
   8552, 
   null, 
   1054548420.0
  ], 
  [
   8776, 
   null, 
   "Striel", 
   "I tend to agree with Darknight. What more can you really say? It isn't like anyone is going to come on here and say \"Child abuse? Oh, it's a GREAT thing!\"", 
   {}, 
   8552, 
   null, 
   1054664760.0
  ], 
  [
   8823, 
   null, 
   "katie5890", 
   "yea sorry i should have been more specific, i ment the punishments, like sometimes if people say that it seems like the kid is theyll interview the partent, check out the kid and if the kid is gonna protect their partents then they'll say things are fine, and they leave it at that...and the abusing continues", 
   {}, 
   8552, 
   null, 
   1054679040.0
  ], 
  [
   8925, 
   null, 
   "DarKnight", 
   "Well thats COMPLETELEY a different game altogether.\n \n Parent related crimes, I think, are the nasties things out there 'cos they're stuck in a vicious loop. Kids say all kind of things and as a psychology student I can also tell you that little kids can make up all kind of false stories and belive them themselevs! Parents can lie, kids can lie, sometimes can't tell the truth and the whole messed up familiy can still sometimes function to protect the abuser.\n You can have two cases that look identical and all the statements are identical but still the actual abuser/lier could be in a completey different role in each case.\n \n I sometimes wish I had the ability to see people's crimes written across thier foreheads but I can't and nor can anyone else so this nasty piece of work, unfortunatley, will always be imposible to truly get to the bottom of.", 
   {}, 
   8552, 
   null, 
   1054738860.0
  ], 
  [
   9115, 
   null, 
   "Debate_Queen615", 
   "killing the child: life sentence\n \n repetitive broken bones from parent: around 30 years\n \n bruses showing up a lot that maybe a friend or teacher notices a lot: about 15 years", 
   {}, 
   8552, 
   null, 
   1054933740.0
  ], 
  [
   9150, 
   null, 
   "wjim1269", 
   "DarKnight, I agree with you. Unfortunately, parent crimes are the hardest to find out because the kid won't tell for two reasons:\n \n #1) If the kid is young enough, the parent can get the kid to believe that the abuse is normal. Thus, even if the kid is asked if he has been abused, the kid will respond with an honest no, because he actually does not think he has been.\n \n #2) The parent is probably the person who the child trusts the most. When he is abused, even if the kid knows it is wrong, the kid may lose that trust. When that trust is lost, there is no one who the child will feel like he can trust. Therefore, the child will choose not to tell anyone about it because there is no one who is \"trustworthy enough\" to know.\n \n \n I agree with Debate_Queen's sentence suggestions as minimum, and possibly more depending on the severity of the situation.", 
   {}, 
   8552, 
   null, 
   1054953180.0
  ], 
  [
   9588, 
   null, 
   "grayhawk", 
   "I'll give Debate Queen's post a third vote. \n Child abuse continues for exactly that resaon. Firstly if you grow up in a home where drinking goats milk is the norm, and never know most drink cow's milk, how would you know that it is not the norm? The only form of reference a child has is what they are told, what they see, what they hear around them and what they live. If a child lives, sees, and hears abuse that is the norm. \n Additionally a child is very easily persuaded by those who control them. If a parent were to tell a child daily they are bad, or deserve to be abused, they believe the parent. They believe them because their only base of knowledge is that parent. A parent must be right because they are the parent. It's a control issue. Additonally it's a fear issue. If a parent abuses a child the child is afraid of the parent. If they are abused or dong nothing, if they actually make that person mad by telling of the abuse once they realize it's wrong, imagine how mad they would be then! Children cannot wrap their minds around the consequences and results of making abuse known. The fear of the parent is the greatest motivation for the abuse to continue. Sad, but true. emoticon_mad", 
   {}, 
   8552, 
   null, 
   1055487180.0
  ], 
  [
   11981, 
   null, 
   "Morfos", 
   "killing the child: life sentence\n \n repetitive broken bones from parent: around 30 years\n \n bruses showing up a lot that maybe a friend or teacher notices a lot: about 15 years\n\n \n Ditto :), Those who abuse their children are sick ****s.", 
   {}, 
   9115, 
   null, 
   1058214120.0
  ], 
  [
   36958, 
   null, 
   "Tastyfish", 
   "Parental appitude test, they come and check your home quite often if you are going to adopt a dog yet all you need for child is two people with two functioning organs (and unfortunately the brain isn't one of them;)).\n \n ...semi serious I suppose, but the important thing is breaking the circle, similar thing wife spousal abuse, which often goes hand in hand with it, if the child grows up with this then it is quite likely that it will continue.\n \n As for non-family ones, really not sure. Seems to be pointing toward it being a serious genuine psychological condition, in which case deterrants (death penalty etc) aren't going to work (and could amlost be regarded as unjust), bur what then I have no idea, some kind of insitutionalisation attempting to cure it?", 
   {}, 
   11981, 
   null, 
   1078088820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  child abuse", 
  "url": "http://www.4forums.com/political/civil-rights-debates/633-child-abuse.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 633, 
  "discussion_files": [
   [
    "15228.html", 
    "http://www.4forums.com/political/civil-rights-debates/633-child-abuse-print.html"
   ]
  ], 
  "identifier": 633
 }
]