[
 [
  [
   159002, 
   null, 
   "Redratio1", 
   "NEW ORLEANS, Louisiana (CNN) -- Diverging views of a crumbling New Orleans emerged Thursday, with statements by some federal officials in contradiction with grittier, more desperate views from the streets. By late Friday response to those stranded in the city was more visible. \n \n But the conflicting views on Thursday came within hours, sometimes minutes of each of each other, as reflected in CNN's transcripts. The speakers include Michael Brown, chief of the Federal Emergency Management Agency, Homeland Security Director Michael Chertoff, New Orleans Mayor Ray Nagin, evacuee Raymond Cooper, CNN correspondents and others. Here's what they had to say: \n \n Conditions in the Convention Center \n \n \n FEMA chief Brown: We learned about that (Thursday), so I have directed that we have all available resources to get that convention center to make sure that they have the food and water and medical care that they need. (See video of Brown explaining how news reports alerted FEMA to convention center chaos. -- 2:11)\n \n \n Mayor Nagin: The convention center is unsanitary and unsafe, and we are running out of supplies for the 15,000 to 20,000 people. (Hear Nagin's angry demand for soldiers. 1:04)\n \n \n CNN Producer Kim Segal: It was chaos. There was nobody there, nobody in charge. And there was nobody giving even water. The children, you should see them, they're all just in tears. There are sick people. We saw... people who are dying in front of you.\n \n \n Evacuee Raymond Cooper: Sir, you've got about 3,000 people here in this -- in the Convention Center right now. They're hungry. Don't have any food. We were told two-and-a-half days ago to make our way to the Superdome or the Convention Center by our mayor. And which when we got here, was no one to tell us what to do, no one to direct us, no authority figure. \n \n <snip<\n \n http://www.cnn.com/2005/US/09/02/katrina.response/index.html", 
   {
    "post_info": {
     "post_title": "Mental disconnect at FEMA"
    }
   }, 
   null, 
   null, 
   1125708720.0
  ], 
  [
   159025, 
   null, 
   "georged", 
   "In the private sector Mikey Brown's career or that of his immediate superior would already be bad history on a resume. I wonder who his political rabbi happens to be. There's going to be a decent political sacrificial lamb or so out of this deal or we're really being scammed with invincibility of political appointments. \n \n Somethings gone seriously wrong with FEMA being managed by Homeland Security and, considering federal police control responsibilities accorded to HS, that's not a circumstance that provides an adequate comfort level down here at my citizen level. Someone in elected public service at a cabinet level needs to professionally bleed where I can see it for this mess.", 
   {}, 
   159002, 
   null, 
   1125715620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mental disconnect at FEMA", 
  "url": "http://www.4forums.com/political/current-events-debates/6333-mental-disconnect-fema.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6333, 
  "discussion_files": [
   [
    "31403.html", 
    "http://www.4forums.com/political/current-events-debates/6333-mental-disconnect-fema-print.html"
   ]
  ], 
  "identifier": 6333
 }
]