[
 [
  [
   159017, 
   null, 
   "Dzeron", 
   "What do you think of North Korea's government? Is it a legitimate, lawful entity, or merely a powerful gang of criminals? What makes it legitimate, or illegitimate?", 
   {
    "post_info": {
     "post_title": "Is North Korea's Gov't Legitimate?"
    }
   }, 
   null, 
   null, 
   1125714300.0
  ], 
  [
   159043, 
   null, 
   "emoreno2292", 
   "It is a dictatorship, and no one said that you can't have a dictatorship. So technically, I'd say, yes, they are a lawful entity. But, they are just comlpetely aggressive and do things that are unlawful.", 
   {}, 
   159017, 
   null, 
   1125720120.0
  ], 
  [
   159045, 
   null, 
   "Dzeron", 
   "It is a dictatorship, and no one said that you can't have a dictatorship. So technically, I'd say, yes, they are a lawful entity. But, they are just comlpetely aggressive and do things that are unlawful.\n\n \n Well, if they do things that are unlawful, how are they not unlawful?", 
   {}, 
   159043, 
   null, 
   1125720660.0
  ], 
  [
   159181, 
   null, 
   "Dzeron", 
   "I will state my belief - I find the North Korean government, and many other totalitarian regimes, to be little more than powerful Mafias, murderous protection rackets on a national scale. Kim Jong Il is the Godfather, and he and his gang forces all of North Korea to pay all their possessions and liberties as \"protection,\" otherwise, they pull a \"we won't protect you from us\" deal. Of course, anyone who voices dislike against this behavior is shot. I say, this behavior is of a most severe illegitimacy and criminality. Is there anyone who disagrees?", 
   {}, 
   159045, 
   null, 
   1125802200.0
  ], 
  [
   159182, 
   null, 
   "Eddie", 
   "Any government not appointed by the people is illegitamate in my eyes.", 
   {}, 
   159181, 
   null, 
   1125802500.0
  ], 
  [
   159183, 
   null, 
   "Dzeron", 
   "Any government not appointed by the people is illegitamate in my eyes.\n\n \n North Korea's government has elections.\n \n http://en.wikipedia.org/wiki/Elections_in_North_Korea", 
   {}, 
   159182, 
   null, 
   1125803400.0
  ], 
  [
   159184, 
   null, 
   "Eddie", 
   "North Korea's government has elections.\n \n http://en.wikipedia.org/wiki/Elections_in_North_Korea\n\n \n One-party state... Hardly appointed by the people. Just like the Soviet Union.", 
   {}, 
   159183, 
   null, 
   1125803640.0
  ], 
  [
   159190, 
   null, 
   "Dzeron", 
   "One-party state... Hardly appointed by the people. Just like the Soviet Union.\n\n \n The U.S. and U.K. are both arguably one-party states as well. Here in the U.S., the Democrats and Republicans are practically identical, and we have a winner-takes-all voting system and campaign finance laws that make it impossible for alternate parties to be represented. Plus, less than half of the registered voters even vote, so the people are really appointing no government at all!\n \n Things are probably different in Sweden though.", 
   {}, 
   159184, 
   null, 
   1125804540.0
  ], 
  [
   159193, 
   null, 
   "Eddie", 
   "The U.S. and U.K. are both arguably one-party states as well. Here in the U.S., the Democrats and Republicans are practically identical, and we have a winner-takes-all voting system and campaign finance laws that make it impossible for alternate parties to be represented. Plus, less than half of the registered voters even vote, so the people are really appointing no government at all!\n\n \n The UK is not as bad as the US in this regard since they have a parliament system. At least three parties are represented in the parliament and since their system is void of a strong president, their presence has a real impact on the political arena. Allthough, I agree that even the UK has a democratic deficiency in this regard.\n \n And even though your parties are similiar on many issues, they still represent a valid choice. It`s even theoreticly (and certainbly legally) possible that one of them gets replaced by a third party. The North Koreans don`t have this option at all.\n \n \nThings are probably different in Sweden though.\n\n \n Sure is. Unlike you, we actually do have a one-party state! :p \n \n Your political parties may be rather similiar. But we have a population unwilling to vote for anything that doesn`t smell social democracy. In 100 years, we`ve had social democratic rule for about 80 years... And now the liberals and conservatives are threatening the current social democratic government by emaluating the same socialistic ideals* they have previously sworn to fight! It`s quite beutiful... I wonder what Marx would have said about all of this, had he been alive ;)\n \n * And I`m not talking about socialistic ideals like Mises would have (IE; government intervention), but rather the ideological ideal of promoting the interests of the working class at the expense of capital owners and high income earners.", 
   {}, 
   159190, 
   null, 
   1125805380.0
  ], 
  [
   159486, 
   null, 
   "Dzeron", 
   "And even though your parties are similiar on many issues, they still represent a valid choice. It`s even theoreticly (and certainbly legally) possible that one of them gets replaced by a third party. The North Koreans don`t have this option at all.\n\n \n So if, all other factors kept constant, the North Korean government held competitive elections, would it be legitimate?", 
   {}, 
   159193, 
   null, 
   1125886200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is North Korea's Gov't Legitimate?", 
  "url": "http://www.4forums.com/political/government-debates/6334-north-koreas-govt-legitimate.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 6334, 
  "discussion_files": [
   [
    "24348.html", 
    "http://www.4forums.com/political/government-debates/6334-north-koreas-govt-legitimate-print.html"
   ]
  ], 
  "identifier": 6334
 }
]