[
 [
  [
   159270, 
   null, 
   "billsco", 
   "4Forums is pleased to announce a formal debate between Marc9000 and DamEtel in regard to the following:\n \n  Resolved: It takes as much blind faith to believe that the origin of humans occurred by purely naturalistic means as it does to believe that the origin of humans occurred through special creation. \n \n Marc9000 will debate the affirmative, DamEtel the negative. Both have agreed to the following rules:\n \n The use of the alternating 5/4 post structure. Marc9000 will begin and end the debate. The last post by each will be a recap of their position and why they believe they won the debate.\n \n Both contestants will have one week to post a response. The deadline for each is midnight Sunday. \n \n A limit of 1000 words or 5000 characters per post, whichever is less, will be observed. This word count will not include their opponent's quotations, URL links, tags, or other quotations used to support their argument.\n \n The judges for this debate are: Symbiote, Alan Ryan, and Lord Tammerlain. The judges' decisions are final.\n \n Please, only the above named may post to this formal debate thread. All others will be deleted.\n \n Best of luck to both Marc9000 and DamEtel. Marc9000's first post is now due by midnight, Sept. 11.", 
   {
    "post_info": {
     "post_title": "Marc9000 vs DamEtel--Blind Faith"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1125843060.0
  ], 
  [
   161081, 
   null, 
   "marc9000", 
   "Thanks to the Moderator, Judges, my Opponent, and all who read and follow this debate. :) \n \n There are some variations in the definitions of the word \"faith\". Dictionary.com shows 6 for it - I believe the first two there are the best general descriptions of it, and are most applicable to this debate;\n \n \n FAITH;\n 1) Confident belief in the truth, value, or trustworthiness of a person, idea, or thing. 2) Belief that does not rest on logical proof or material evidence.\n\n \n The creation-evolution debate seems widely thought to be about religious faith vs. scientific fact. A basic about religion is that it requires some things to be taken on faith. The difficulty with this is that different faiths can produce a variety of beliefs worldwide. Science is supposed to avoid that by an unemotional objectivity which takes nothing on faith and bases it's conclusions on repeatable observations and accurate measurements. When scientests step outside of those constraints and pronounce conclusions on issues such as the origin and development of life, it can easily become a case of manipulating the \"facts\" to fit the desired conclusion. That manipulation can be 'covering a gap' - confidently believing something (however small) that does not rest on logical proof or material evidence. The same kind of faith religion uses.\n \n Richard Lewontin, a Darwinist, makes this statement;\n \n \nOur willingness to accept scientific claims that are against common sense is the key to an understanding of the real struggle between science and the supernatural. We take the side of science in spite of the patent absurdity of some of its constructs, in spite of its failure to fulfill many of its extravagant promises of health and life, in spite of the tolerance of the scientific community for unsubstantiated just-so stories, because we have a prior commitment, a commitment to materialism. It is not that the methods and institutions of science somehow compel us to accept a material explanation of the phenomenal world, but, on the contrary, that we are forced by our a priori adherence to material causes to create an apparatus of investigation and a set of concepts that produce material explanations, no matter how counter-intuitive, no matter how mystifying to the uninitiated. Moreover, that materialism is absolute, for we cannot allow a Divine Foot in the door. \n\n \n http://www.csus.edu/indiv/m/mayesgr/Lewontin1.htm\n \n I realize Richard Lewontin may not be a spokesman for all of science. Since he declares himself an Atheist in the above link, it's certain he doesn't speak for religion. But in this short paragraph, there are many words and phrases that describe faith;\n \n against common sense\n constructs\n extravagant promises\n unsubstantiated just-so stories\n commitment to materialism\n priori adherence\n set of concepts\n materialism is absolute\n \n These things are common in science today, and there is a reason for it. Science would be too narrow without it - too narrow to be as authoritative and profitable as it desires. Therefore science defines it's SUBJECT broadly, and it's RULES narrowly. Those who argue for the naturalistic origin of humans define the rules of science so narrowly that intelligent design is ruled out in advance, leaving naturalistic origin as the only destination for the journey. Admitting the possibility of another destination (creation) is \"allowing a Divine foot in the door\". By not allowing it, they do exactly what they accuse religious people of doing - they let their ideology dictate their conclusions. \n \n Obviously, no one observed the origin of the first life. It had to be a one-time, unrepeatable event. It either happened at the hand of an intelligent designer, on a different realm that we can't fully understand, or it generated spontaneously from nonliving chemicals without intelligent intervention. The principle of uniformity holds that causes in the past were like the causes we observe today. In recorded history, science has never observed the slightest similarity to a spontaneous generation of life. So far, scientests have been unable to combine chemicals in a test tube and arrive at a DNA molecule, much less life. How can non-creationists believe that mindless processes can do what brilliant scientests cannot do? Only one way, and that's with FAITH, and plenty of it.", 
   {}, 
   159270, 
   null, 
   1126407840.0
  ], 
  [
   163172, 
   null, 
   "DamEtel", 
   "I am a man who likes to get right to the business at hand.\n \n 1) marc9000 starts off by providing us with two different definitions of the term \"faith\". \n \n \nmarc9000: FAITH;\n 1) Confident belief in the truth, value, or trustworthiness of a person, idea, or thing. 2) Belief that does not rest on logical proof or material evidence. \n\n \n Using different definitions for the two opposing positions, or switching between the two definitions at any time, simply won't do. marc9000 must use just one meaning of \"faith\" throughout the debates, and that one meaning must be used for both positions. He needs to straighten out his definitional problem in the next post, and do so in a manner consistent with the phrasing of the resolution.\n \n \n 2) In his very first post, marc9000 already wonders way, way, way off target.\n His entire last paragraph is about the origin of life: he has already left the agreed-upon bounds of the debate, which deal with the origin of humans, specifically. This too marc9000 must remedy in his next post.\n \n \n 3) marc9000's opening post is mostly about the philosophy of science in general (methodological naturalism is the best term), which is not the actual topic of discussion: the origin of humans is. \n \n \n Since marc9000 has not provided any substance to his position yet, I feel that I have, as yet, nothing to rebut. Therefore, I'll take this opportunity to set the stage for my side of the debate.\n \n What does science have that verifies its position that humans are the result of evolution? Fully supported and demonstrated underlying principles, for one! The following is the \"in a nutshell\" version. \n \n Science has shown that DNA stores genetic information in its base sequences. Science has shown that it is an organism's genotype (genetic makeup, its sequence of bases) that determines its phenotype (outward appearance and biochemical properties). Science has shown that changes made to DNA base sequences result in altered phenotypes. Science has shown that mutations - changes in the DNA base sequences (that can be inherited) - occur spontaneously, changing the information stored and therefore the phenotype of the organism. Thus, there is a fully supported scientific explanation for how organisms come to have the morphology and biochemical properties they do, as well as how their morphology/biochemical properties can change over time: completely naturally. \n \n Logic and experimentation have shown the next key factor: natural selection. Individuals in a population, though very similar to one another, differ. Because of these individual differences, some members of a population will be more fit than others. That is, in the particular environment the population finds itself in, some individuals will have a better chance of surviving and reproducing, thus having a better chance of passing on their genes to the next generation. This differential passing on of genetic information into future generations (with \"fitter genes\" being more likely to be passed on than less \"fit\" ones) leads to changes in the genetic makeup of the population over time. And as one might expect, as the genetic makeup changes so too do the morphology and/or biochemical properties of its members. Thus, there is a fully supported scientific explanation for how populations evolve. \n \n In addition to the straightforward extension of the above that indicates speciation would occur in the wild, science also has documented cases of such: both for plants (for example, by means of allopolyploidy) and for animals (for example, by allopatric speciation). Note that according to most biologists, speciation is a macroevolutionary event: thus, Creationists cannot legitimately claim that only microevolution is well supported by scientific theory and observations. So we see that science has a fully supported theoretical model for speciation, which has been confirmed by observations and lab experiments.\n \n Evolution at and below the species level stands on firm, well supported, scientific ground. The rest is often times said to be nothing more than extrapolation; because microevolution and speciation have been observed in the short amount of time that biologists have been examining organisms, there is reason to believe that additional time would allow for larger scale evolution. For the current discussion, the extrapolation past confirmed evolutionary processes would be the origin of humans from an ancestor we shared with chimps. But is this just extrapolation? No! Multiple scientific evidences support the position that humans and chimps shared a common ancestor.\n \n The evidences for the evolutionary origin of humans (from a common ancestor we share with chimps) that I plan to present (assuming I have words to spare to discuss them) are as follows:\n \n 1) The ~98.5% identity between the human and chimp genomes, which demonstrates genetic relatedness\n \n 2) Multiple, conserved non-functional DNA sequences (pseudogenes) shared by both chimps and humans, which bolsters the case of genetic relatedness by means of common descent (and crushes the \"common design\" argument)\n \n 3) The head-to-head fusion of two \"chimp\" chromosomes to form one human chromosome\n \n 4) Lack of large-scale biological novelty in either chimps or humans (no invention of the wing, or of feathers, or of the eye, or so on)\n \n 5) Nearly identical brain structure for chimps and humans, including shared asymmetries\n \n 6) Chimps \"humanlike\" mental qualities, such as high intelligence, self-recognition, and a rudimentary form of apathy\n \n Together, all of these evidences - which come from multiple, independent, objective sources, and which are verifiable, in principle, by just about anyone - form a very convincing argument in support of our evolutionary origin.", 
   {
    "unicode_changes_made": true
   }, 
   161081, 
   null, 
   1127010900.0
  ], 
  [
   163379, 
   null, 
   "billsco", 
   "DamEtel,\n \n While running your text through Copyscape, this forum website thread appeared. The poster, a \"TeleMad\", has posted very similar text dated August 8, 2004.\n \n Will you please explain ASAP. Thank you.", 
   {}, 
   163172, 
   null, 
   1127060880.0
  ], 
  [
   163561, 
   null, 
   "DamEtel", 
   "DamEtel,\n \n While running your text through Copyscape, this forum website thread appeared. The poster, a \"TeleMad\", has posted very similar text dated August 8, 2004.\n \n Will you please explain ASAP. Thank you.\n\n \n I have gone by several handles over the years: DNAunion (my main one), wwasiauc, PorkRiceSin (an anagram of my real name, Rick Pierson), TeleMad, and DamEtel are a few I can remember off hand. So I am, or rather, was, TeleMad (I used that name only at that one site). The statements about human evolution, found in my first post in this debate with marc9000, are mine, not someone elses.\n \n 1) When I was registering here, my intent was to use my previous handle of TeleMad but in reverse. While reversing the letters mentally in my head during the registration process, I got the last two consonants swapped and registered as DamEtel instead of DamElet.\n \n 2) I am also currently posting as DNAunion at one atheist site, and you will find these same statements on the evolution of humans (and more that I will be posting here) there. \n \n \nComment from: DNAunion [Member] \n \n **********************\n finch: Your evidence for how the two organisms became similar as I understand it thus far: Similar structures = common ancestor.\n \n Is this a correct view? Let me know if I'm mistaken.\n **********************\n \n DNAunion: No, it's not correct. It ignores the multiple other facets of the evidence for common descent.\n \n ***********************\n finch: Maybe your right, but you can't get around the fact that it is still an assumption. \n ***********************\n \n DNAunion: Everything can be considered an assumption. Do you actually know, or do you only assume, that gravity will work tomorrow the way it does today?\n \n Now, what does science have that verifies its position that humans are the result of evolution? Fully supported and demonstrated underlying principles, for one! The following is the \"in a nutshell\" version. \n \n Science has shown that DNA stores genetic information in its base sequences. Science has shown that it is an organism's genotype (genetic makeup ...\n\n \n That\\'s from http://www.atheists.org/nogodblog/index.php/2005/09/01/title_3#comments\n \n In fact, in that very same thread, you find me saying this.\n \n \nHeatherNZ: DNAunion, If you are willing, would you share the identity of the board hosting the formal debate you referred to? \n \n DNAunion: Sure. It's a small forum: that is, not a whole lot of people/activity in the evolution threads. The thread for the debate is in a different forum at the site, at http://www.4forums.com/political/showthread.php?t=6348\n \n So far there are no posts by either opponent in the debate, just the organizers post laying out the ground rules. My opponents first post is due by this Sunday at midnight. That will kick off the debate.\n \n Oh, and if you've read all of my posts in this thread, you already have most of the evidence and arguments I'll be using over there :-) \n \n ...\n \n DNAunion: Oh, forgot to point out in my last post that at the other site I go by the handle DamEtel. \n\n \n So I, DNAunion, said a week or so ago before my post in this debate, that I would be reusing my material that I had already posted in the thread at the atheist site.\n \n Also, in that very same thread, you can also find my (Rick Pierson's) letters to the editor of my local newspaper: I posted those letters there as DNAunion, and the very same letters here as DamEtel.\n \n Also, you see that in both places I specifically mention both my real name, Rick Pierson, and my longtime handle on the internet, DNAunion.\n \n Finally, if you check out post #194 at http://www.iidb.org/vbb/showthread.php?t=127155&page=8&pp=25\n you will see me, DNAunion, referring to my own posts, TeleMad's, at the discussion forum you found.\n \n \n Rick Pierson = DNAunion = DamEtel = TeleMad = wwasiauc = PorkRiceSin\n \n \n \n \n PS: All was going well for me at the ScienceForums site where I posted as TeleMad until it started getting overrun with religious fanatics, who were disrupting SCIENCE discussion with their nonsense. I tried telling them to take their discussions elsewhere, but they didn't. So I started confronting the religious people head on, as you can see by searching for my chronologically last posts there (use the link after this paragraph). Apparently, arguing against religion is what got me banned from a SCIENCE discussion forum. Go figure.\n \n http://www.scienceforums.com/search.php?searchid=27176\n \n But because I was banned, I decided to not use my same handle here as I did there, so I simply reversed it (except for the accidental swapping of two consonants) from TeleMad to DamEtel.\n \n \n \n \n PPS: If the tool you used to find my previous post where I used these same statements was any good, it would have found that I also made them RIGHT HERE AT WWW.4FORUMS.COM! Check out post #129, which I made back in July, at http://www.4forums.com/political/showthread.php?t=5343&page=9&pp=15&highlight=pseudogene", 
   {
    "unicode_changes_made": true
   }, 
   163379, 
   null, 
   1127090160.0
  ], 
  [
   163594, 
   null, 
   "billsco", 
   "DamEtal,\n \n I've checked through the links you provided and I'll accept your explanation. I'm confident that if the judges don't agree they will let me know, but I have not heard from them. \n \n I hope you intend to fully engage your opponent in this debate and not simply cut and paste previous works. The reason for the extra response time you've requested is with that wish in mind. \n \n This has taken the better part of a day to resolve. Therefore, if marc9000 wishes to recoup this time, I will extend his next deadline to midnight Monday, Sept. 26th. \n \n Regards,\n \n billsco", 
   {
    "unicode_changes_made": true
   }, 
   163561, 
   null, 
   1127100120.0
  ], 
  [
   163600, 
   null, 
   "DamEtel", 
   "I hope you intend to fully engage your opponent in this debate and not simply cut and paste previous works\n\n \n What I intend to do is to support my argument freely using whatever material of my own that I see fit. It IS MY thoughts and MY STATEMENTS that I included to support MY argument. There is ABSOLUTELY NOTHING wrong with me including MY OWN THOUGHTS to formulate part of MY OWN ARGUMENT.\n \n And just what are you trying to force upon me? The exclusion of my own thoughts? The exclusion of my own logic? The exclusion of evidence I've accumulated over time? That would be quite silly.\n \n I agreed to debate the origin of humans, and that's what I will do. And I will use my previous thoughts, my previous statements, and my previously accumulated evidence to do that, however I see fit.\n \n What I did NOT agree to do - at all, anywhere - was to forgoe all my previous thoughts, all my previous statements, and all my previously accumulated evidences. \n \n \n \nbillsco: This has taken the better part of a day to resolve. Therefore, if marc9000 wishes to recoup this time, I will extend his next deadline to midnight Monday, Sept. 26th. \n\n \n He should NOT be given any extra time. \n \n Even this post that I am now making is being made BEFORE my midnight deadline has arrived. None of this has intruded into marc9000's time ... NOT EVEN ONE SECOND into it. There is ABSOLUTELY NO LEGITIMATE REASON to extend his respose time.", 
   {}, 
   163594, 
   null, 
   1127101140.0
  ], 
  [
   163619, 
   null, 
   "billsco", 
   "DamEtal,\n \n I am not saying you cannot use your own works or your own thoughts. I am simply requesting you to be engaged in this debate with marc9000. What I specifically mean is for you to refute, when necessary, his points and advance your own ideas where appropriate. I am not interested in cut and paste only posts. \n \n I hope you can understand what a problem was encountered when you used previously posted material. The internet is very much an anonymous medium, rife with people pretending to be whom they are not. When your words appeared on another site, with another name attached to them, a large problem developed. \n \n As to the extra time I've alotted to marc9000, I'll get a ruling by the judges.\n \n Regards,\n \n billsco", 
   {}, 
   163600, 
   null, 
   1127137500.0
  ], 
  [
   163671, 
   null, 
   "billsco", 
   "DamEtel, Marc9000,\n \n The judges by quorum feel that granting marc9000 additional time is unnecessary. \n \n Therefore, marc9000's next post will be due by midnight Sunday, per usual. My apologies for any disarray cast in yesterday's ruling.\n \n Regards,\n \n billsco", 
   {}, 
   163619, 
   null, 
   1127152920.0
  ], 
  [
   165766, 
   null, 
   "marc9000", 
   "I am a man who likes to get right to the business at hand.\n \n 1) marc9000 starts off by providing us with two different definitions of the term \"faith\". \n \n \n \n Using different definitions for the two opposing positions, or switching between the two definitions at any time, simply won't do. marc9000 must use just one meaning of \"faith\" throughout the debates, and that one meaning must be used for both positions. He needs to straighten out his definitional problem in the next post, and do so in a manner consistent with the phrasing of the resolution. \n\n \n I don't see them as two definitions. I see them as two segments that make one definition. The first states only what the belief is in, and the second states only the basis for it. They both apply equally to scientific theories and religious beliefs concerning the origin of man. \n \n \n \n2) In his very first post, marc9000 already wonders way, way, way off target.\n His entire last paragraph is about the origin of life: he has already left the agreed-upon bounds of the debate, which deal with the origin of humans, specifically. This too marc9000 must remedy in his next post.\n\n \n That's because the evolutionary origin of humans theory presupposes simpler forms of life for humans to originate from. Lots of faith, and that is the target.\n \n \n \n3) marc9000's opening post is mostly about the philosophy of science in general (methodological naturalism is the best term), which is not the actual topic of discussion: the origin of humans is. \n\n \n The actual topic concerns how faith applies to the two different beliefs. My opening post showed how the philosophy of science involves faith. \n \n \n \nSince marc9000 has not provided any substance to his position yet, I feel that I have, as yet, nothing to rebut. Therefore, I'll take this opportunity to set the stage for my side of the debate.\n\n \n I thought you would have at least something to say about Richard Lewontin's remarks. Like if you agreed or disagreed with them, and why. I probably would have had some difficult questions for you no matter what you said about him.\n \n \nWhat does science have that verifies its position that humans are the result of evolution? Fully supported and demonstrated underlying principles, for one! The following is the \"in a nutshell\" version. \n \n Science has shown that DNA stores genetic information in its base sequences. Science has shown that it is an organism's genotype (genetic makeup, its sequence of bases) that determines its phenotype (outward appearance and biochemical properties). Science has shown that changes made to DNA base sequences result in altered phenotypes. Science has shown that mutations - changes in the DNA base sequences (that can be inherited) - occur spontaneously, changing the information stored and therefore the phenotype of the organism. Thus, there is a fully supported scientific explanation for how organisms come to have the morphology and biochemical properties they do, as well as how their morphology/biochemical properties can change over time: completely naturally. \n \n Logic and experimentation have shown the next key factor: natural selection. Individuals in a population, though very similar to one another, differ. Because of these individual differences, some members of a population will be more fit than others. That is, in the particular environment the population finds itself in, some individuals will have a better chance of surviving and reproducing, thus having a better chance of passing on their genes to the next generation. This differential passing on of genetic information into future generations (with \"fitter genes\" being more likely to be passed on than less \"fit\" ones) leads to changes in the genetic makeup of the population over time. And as one might expect, as the genetic makeup changes so too do the morphology and/or biochemical properties of its members. Thus, there is a fully supported scientific explanation for how populations evolve. \n\n \n Your nutshell version uses faith to presuppose the existance of DNA. So far you've shown nothing but microevolution. (adaption within a species) It is scientifically proven, and is accepted by Darwinists and Creationists alike. This version doesn't address the issue of origins.\n \n \nIn addition to the straightforward extension of the above that indicates speciation would occur in the wild, science also has documented cases of such: both for plants (for example, by means of allopolyploidy) and for animals (for example, by allopatric speciation). Note that according to most biologists, speciation is a macroevolutionary event: thus, Creationists cannot legitimately claim that only microevolution is well supported by scientific theory and observations. So we see that science has a fully supported theoretical model for speciation, which has been confirmed by observations and lab experiments. \n\n \n What you're doing is blending microevolution and macroevolution, making them look similar enough to prove one with the other. A basic analysis of them shows that it doesn't work - the contrasts between them are far too great. When you say \"straightfoward extension\", you're using the same faithful constructs that Richard Lewontin describes. When you say \"would occur\", do you mean you have faith that it could occur, or do you have proof that it has occured? Sorry, the faith that you have in most biologists does not prevent Creationists from legitimately claiming that only microevolution is well supported, because it's a fact that macroevolution (one organism evolving into another completely different type of organism) has never been observed, only theorized.\n \n \nEvolution at and below the species level stands on firm, well supported, scientific ground. The rest is often times said to be nothing more than extrapolation; because microevolution and speciation have been observed in the short amount of time that biologists have been examining organisms, there is reason to believe that additional time would allow for larger scale evolution. For the current discussion, the extrapolation past confirmed evolutionary processes would be the origin of humans from an ancestor we shared with chimps. But is this just extrapolation? No! Multiple scientific evidences support the position that humans and chimps shared a common ancestor. \n\n \n You're using the word \"speciation\" to again try to bridge the huge gap between microevolution and macroevolution. There is only reason to believe that additional time would allow for larger scale evolution if you have faith that it would. Basic types of life give every indication that they have genetic limits built into them. Dog breeders encounter them when they attempt to create new breeds of dogs. Dogs may range in size from the Chihuahua to the Great Dane, but despite the best attempts of intelligent dog breeders, dogs always remain dogs. The short life of fruit flies gives scientests the ability to manupulate many generations of them to test the \"long periods of time\" claims of macroevolution. About all they get is crippled fruit flies. It seems to be a pattern - intelligent scientests constantly fail to do what you claim blind, mindless processes can do. \n \n \nThe evidences for the evolutionary origin of humans (from a common ancestor we share with chimps) that I plan to present (assuming I have words to spare to discuss them) are as follows:\n \n 1) The ~98.5% identity between the human and chimp genomes, which demonstrates genetic relatedness\n \n 2) Multiple, conserved non-functional DNA sequences (pseudogenes) shared by both chimps and humans, which bolsters the case of genetic relatedness by means of common descent (and crushes the \"common design\" argument)\n \n 3) The head-to-head fusion of two \"chimp\" chromosomes to form one human chromosome\n \n 4) Lack of large-scale biological novelty in either chimps or humans (no invention of the wing, or of feathers, or of the eye, or so on)\n \n 5) Nearly identical brain structure for chimps and humans, including shared asymmetries\n \n 6) Chimps \"humanlike\" mental qualities, such as high intelligence, self-recognition, and a rudimentary form of apathy \n\n \n Even if you show these six items in detail, you're still missing the main one you really need - the fossil record. That's still another huge gap you bridge with faith. Evolutionists have been trying to show an evolutionary link between man and ape for over a hundred years. They've always known that a plentiful, foolproof fossil record is the main thing they need to discredit creation, and establish themselves as the highest form of intelligence. They can't even come close, and their extreme desperation has resulted in hoaxes.\n \n http://www.clarku.edu/~piltdown/map_gen_hist_surveys/piltman_oaklywiener.html\n \n More than one of this type of hoax has been accepted and believed for over 40 years before being scientifically disproven. The faith they've inspired for such a long period of time lingers to a certain degree even today. I'll acknowledge that these hoaxes were perpetrated by a very small scientific segment, and that small segments of the religious community can and have perpetrated hoaxes. But I know of no religious hoax that was widely accepted for 40 years, and then clearly disproven. That's probably because religion has far more whistleblowers carefully watching it than science does.\n \n \nTogether, all of these evidences - which come from multiple, independent, objective sources, and which are verifiable, in principle, by just about anyone - form a very convincing argument in support of our evolutionary origin.\n\n \n Just about anyone who refuses to \"allow a divine foot in the door\" - who bridges scientific gaps with faith. Just about anyone who stops short of realizing that these \"evidences\" are concluded by using physical laws that are unexplainable by science, in fundamental ways.", 
   {
    "unicode_changes_made": true
   }, 
   163172, 
   null, 
   1127626680.0
  ], 
  [
   167498, 
   null, 
   "DamEtel", 
   "Let met start off by pointing out that you agreed to argue the affirmative and accept the burden of proof. As such, you have to prove your case and the 'resolved'. So far, you haven't offered even one piece of evidence for special-creation of humans. If you fail to support it, I win ... no matter what! \n \n In fact, what is your position? Who is the creator of humans? When, where, and how was the creation done? You've provided no details or evidence. \n \n \n \n 1) Definition of faith.\n \n \nDamEtel: 1) marc9000 starts off by providing us with two different definitions of the term \"faith\". \n \n ***************************************\n marc9000: FAITH;\n 1) Confident belief in the truth, value, or trustworthiness of a person, idea, or thing. 2) Belief that does not rest on logical proof or material evidence.\n ***************************************\n \n Using different definitions for the two opposing positions, or switching between the two definitions at any time, simply won't do. marc9000 must use just one meaning of \"faith\" throughout the debates, and that one meaning must be used for both positions. He needs to straighten out his definitional problem in the next post, and do so in a manner consistent with the phrasing of the resolution.\n\n \n \nMarc9000: I don't see them as two definitions. I see them as two segments that make one definition. The first states only what the belief is in, and the second states only the basis for it. They both apply equally to scientific theories and religious beliefs concerning the origin of man.\n\n \n It's not my responsibility to do your work for you, but I guess someone has to do this before the debate is over! \n \n The definition of faith that will be used, consistently throughout the debate, and for both positions equally, is as follows: faith is a confident belief in the truth, value, or trustworthiness of a person, idea, or thing, with that belief not resting on logical or material evidence. \n \n \n \n \n 2) You are still not debating the actual topic: the origin of humans.\n \n \nDamEtel: 2) In his very first post, marc9000 already wonders way, way, way off target.\n \n His entire last paragraph is about the origin of life: he has already left the agreed-upon bounds of the debate, which deal with the origin of humans, specifically. This too marc9000 must remedy in his next post. \n \n\n \n \nmarc9000: That's because the evolutionary origin of humans theory presupposes simpler forms of life for humans to originate from. Lots of faith, and that is the target.\n\n \n Now that's different than the origin of life! That's at least three different topics you're trying to debate. \n \n Also, are you going to demonstrate that no simpler-than-human life existed prior to humans? When do you plan to start presenting evidence for your positions, rather then simply throwing out \"that's faith\" assertions in response to mine?\n \n \nmarc9000: Just about anyone who stops short of realizing that these \"evidences\" are concluded by using physical laws that are unexplainable by science, in fundamental ways.\n\n \n What? A FOURTH topic you're trying to drag into the debate? \n \n Let me remind you again that the topic of debate is the origin of HUMANS, not the origin of LIFE and not the origin of the PHYSICAL LAWS.\n \n \n \n \n 3) Lewontin \n \n \nmarc9000: I thought you would have at least something to say about Richard Lewontin's remarks.\n\n \n Their relevance to the debate is minimal at best. For example, nowhere in your quote does Lewontin even mention the origin of humans. \n \n \n \n \n 4) My evidences for the evolutionary origin of humans\n \n \nmarc9000: Your nutshell version [of evolution] uses faith to presuppose the existance of DNA.\n\n \n No, it's not faith, because the conclusion that DNA existed prior to humans is based on material evidence and logic!\n \n \n Other researchers have previously recovered traces of protein from dinosaur bones, and indeed just two weeks ago Schweitzer reported traces of protein in 70 million year old dinosaur eggs.\n \n \"[The T. rex paper] suggests that biological and biochemical information might be recoverable from a wide range of fossil material,\" says Angela Milner of the Natural History Museum, in London, UK, who has detected proteins in Iguanadon bone. \n (Blood vessels recovered from T. rex bone, Jeff Hecht, NewScientist.com news service, March 24 2005, http://www.newscientist.com/channel/life/dn7195) \n\n \n As we all know, proteins are coded for by genes, and genes are stretches of DNA. Thus, finding proteins in dinosaur bones demonstrates, logically through transitivity, that dinosaurs had DNA. And since the dinosaur the proteins were extracted from lived 70 million years ago, whereas humans arose only about 200 thousand years ago, we see that DNA did predate humans. \n \n \nmarc9000: So far you've shown nothing but microevolution. (adaption within a species) It is scientifically proven, and is accepted by Darwinists and Creationists alike. \n\n \n You've just conceded that the general mechanism proposed by me for the origin of humans is indeed fact: accepted, objectively, by both \"Darwinists and Creationists alike\". As we know, belief in microevolution is not based on blind faith; it is based on material evidence and solid logic. \n \n Now, where's your material evidence and solid logic that the general mechanism proposed by you for the origin of humans - a supernatural being doing magic - is indeed fact? You don't have it. Your special-creation position is based on blind faith. \n \n Even if we neglect everything else I've presented that supports the evolutionary origin of humans over the special-creation account, and also neglect who has the burden of proof, I 'win' on this one point alone: my general mechanism is objective fact and not accepted by blind faith: yours is not objective fact and is accepted on blind faith. \n \n \nmarc9000: You're using the word \"speciation\" to again try to bridge the huge gap between microevolution and macroevolution.\n\n \n Macroevolution can be as 'simple' as speciation, which has been observed in the lab, and in the wild.\n \n \nmarc9000: There is only reason to believe that additional time would allow for larger scale evolution if you have faith that it would.\n\n \n Wrong. In addition to extrapolation, there is also material evidence of \"one organism turning into another\", such as fossil evidence of the transition from reptiles to mammals, and 'living intermediates' in the origin of multicellularity seen in the Volvocaceans. We also have comparative anatomy, comparative embryology, comparative genomics, and the fossil record that all support macroevolution.\n \n \nmarc9000: The short life of fruit flies gives scientests the ability to manupulate many generations of them to test the \"long periods of time\" claims of macroevolution. About all they get is crippled fruit flies.\n \n \n And new species! \n \n \nDobzhansky and Pavlovsky (1971) reported a speciation event that occurred in a laboratory culture of Drosophila paulistorum sometime between 1958 and 1963. The culture was descended from a single inseminated female that was captured in the Llanos of Colombia. In 1958 this strain produced fertile hybrids when crossed with conspecifics of different strains from Orinocan. From 1963 onward crosses with Orinocan strains produced only sterile males. Initially no assortative mating or behavioral isolation was seen between the Llanos strain and the Orinocan strains. Later on Dobzhansky produced assortative mating (Dobzhansky 1972).\n (http://www.talkorigins.org/faqs/faq-speciation.html)\n \n\n \n \nThe article is on page 22 of the February, 1989 issue of Scientific American. It's called \"A Breed Apart.\" It tells about studies conducted on a fruit fly, Rhagoletis pomonella, that is a parasite of the hawthorn tree and its fruit, which is commonly called the thorn apple. About 150 years ago, some of these flies began infesting apple trees, as well. The flies feed and breed on either apples or thorn apples, but not both. There's enough evidence to convince the scientific investigators that they're witnessing speciation in action. Note that some of the investigators set out to prove that speciation was not happening; the evidence convinced them otherwise.\n (http://www.talkorigins.org/faqs/speciation.html)\n \n\n \n Next.\n \n \nmarc9000: [You're using the word \"speciation\" to again try to bridge the huge gap between microevolution and macroevolution. There is only reason to believe that additional time would allow for larger scale evolution if you have faith that it would.] Basic types of life give every indication that they have genetic limits built into them.\n\n \n So your argument amounts to, \"In the very limited amount of time we humans have bred animals we've managed to create up to new species - therefore, that's it: no larger-scale changes can possibly occur, no matter how much time is allowed for\". But that conclusion does not necessarily follow from the starting fact. In fact, the most straightforward conclusion is that larger scale changes could occur given larger time scales. \n \n \nDamEtel: The evidences for the evolutionary origin of humans (from a common ancestor we share with chimps) that I plan to present (assuming I have words to spare to discuss them) are as follows:\n \n 1) The ~98.5% identity between the human and chimp genomes, which demonstrates genetic relatedness\n \n 2) Multiple, conserved non-functional DNA sequences (pseudogenes) shared by both chimps and humans, which bolsters the case of genetic relatedness by means of common descent (and crushes the \"common design\" argument)\n \n 3) The head-to-head fusion of two \"chimp\" chromosomes to form one human chromosome\n \n 4) Lack of large-scale biological novelty in either chimps or humans (no invention of the wing, or of feathers, or of the eye, or so on)\n \n 5) Nearly identical brain structure for chimps and humans, including shared asymmetries\n \n 6) Chimps \"humanlike\" mental qualities, such as high intelligence, self-recognition, and a rudimentary form of apathy \n \n Together, all of these evidences - which come from multiple, independent, objective sources, and which are verifiable, in principle, by just about anyone - form a very convincing argument in support of our evolutionary origin. \n\n \n \nmarc9000: Even if you show these six items in detail, you're still missing the main one you really need - the fossil record.\n\n \n No, I have the fossil record on my side too!\n \n The scientific community has a plethora of hominid fossils. Shoot, even the anti-evolution ID Creationists acknowledge their existence:\n \n \n\"Obviously, the human species has a history. Many fossils have been found that appear to be genuine, and many of them have some features that are ape-like and some that are human-like.\" (Icons of Evolution, Jonathan Wells, Regenery Publishing, 2000, p223) \n\n \n Wells goes on to point out disagreements among scientists. Yes, real scientists do still disagree on exactly which fossils were left by hominids in our own human lineage and which ones represent side branches in hominid evolution that went extinct. But that uncertainty does not nullify the existence of the pre-human fossils: they are real. \n \n For pictures and descriptions of many of them: http://www.talkorigins.org/faqs/homs/specimen.html\n \n \nmarc9000: I'll acknowledge that these hoaxes were perpetrated by a very small scientific segment, and that small segments of the religious community can and have perpetrated hoaxes. But I know of no religious hoax that was widely accepted for 40 years, and then clearly disproven.\n\n \n Faith healing! Except that the unquestioning BLIND FAITH many religious people have prevents them from seeing that it is an outright fraud: it can't be disproven in their faith-controlled minds.\n \n \nmarc9000: That's probably because religion has far more whistleblowers carefully watching it than science does.\n\n \n No, it's because science is self-correcting. It was scientists who discovered that Piltdown Man was a fraud; and then the entire scientific community absolutely dismissed it as one. \n \n Religion is not like that. Many religious people actually believe that Benny Hinn's touch regenerated bones in a crippled woman's leg, allowing her to walk again (a claim I saw him make on TV just a few weeks ago). Religious people are so totally blinded by their unquestioning faith that rational and free thought is not open to them. \n \n So the ridiculousness of faith healing, which has been with us going back thousands of years prior to Piltdown Man, will continue to be with us into the near, if not distant, future. \n \n \n \n \n 1) 96 to 99% genetic similarity between humans and chimps indicate common ancestry.\n \n \nAt the DNA level, the human and chimpanzee genomes are almost 99% identical at the DNA bases where the two genomes align to each other. By taking into account the insertions and deletions that have occurred in each species since their divergence from a common ancestor ~5 to 6 million years ago, they still share 96% of their sequence. At the protein level, 29% of proteins have the identical sequence and the average protein has accumulated just one human-specific amino-acid change. [\"In fact, the typical human protein has accumulated just one unique change since chimpanzees and humans diverged from a common ancestor about 6 million years ago.\"] To put this into perspective, the number of genetic differences between human and chimpanzee is approximately 10 times less than the number of differences found between the previously sequenced genomes of mouse and rat. The results provide a strong support for Darwin's 1871 conclusion that humanity's closest relatives are the African apes; it is an example of a testable prediction about evolution - made even before the discovery of DNA's role in heredity - that is confirmed by experiment. \n (bold emphasis added, Backgrounder: Comparison of Human and Chimp Genomes Reveals Striking Similarities and Differences, last updated (at time of quote extraction): August 30, 2005, \n http://www.broad.mit.edu/news/links/chimp-backgrounder.html NOTE: The one inserted sentence comes from this page's \"sister page\", http://www.broad.mit.edu/cgi-bin/news/display_news.cgi?id=161) \n\n \n \n \n \n 2) Six (there could be more) non-functional pseudogenes shared by both chimps and humans crush the \"common design\" counterargument.\n \n \n\"Recently, the L-gulano-&#947;-lactone oxidase gene, the gene required for Vitamin C synthesis, was found in humans and guinea pigs (Nishikimi et al. 1992; Nishikimi et al. 1994). It exists as a pseudogene, present but incapable of functioning (see prediction 4.4 for more about pseudogenes). In fact, since this was originally written the vitamin C pseudogene has been found in other primates, exactly as predicted by evolutionary theory. We now have the DNA sequences for this broken gene in chimpanzees, orangutans, and macaques (Ohta and Nishikimi 1999). And, as predicted, the malfunctioning human and chimpanzee pseudogenes are the most similar, followed by the human and orangutan genes, followed by the human and macaque genes, precisely as predicted by evolutionary theory. Furthermore, all of these genes have accumulated mutations at the exact rate predicted (the background rate of mutation for neutral DNA regions like pseudogenes) (Ohta and Nishikimi 1999).\" (http://www.talkorigins.org/faqs/comdesc/section2.html#past_biogeography_ex3) \n\n \n \n\"We have determined and compared the promoter, coding, and intronic sequences of the urate oxidase (Uox) gene of various primate species. Although we confirm the previous observation that the inactivation of the gene in the clade of the human and the great apes results from a single CGA to TGA nonsense mutation in exon 2...\" (Loss of urate oxidase activity in hominoids and its evolutionary implications, Oda M, Satta Y, Takenaka O, Takahata N., Mol Biol Evol. 2002 May;19(5):640-53) \n\n \n \n\"The beta-globin gene cluster of human, gorilla and chimpanzee contain the same number and organization of beta-type globin genes: 5'-epsilon (embryonic)-G gamma and A gamma (fetal)-psi beta (inactive)-delta and beta (adult)-3'. We have isolated the psi beta-globin gene regions from the three species and determined their nucleotide sequences. These three pseudogenes each share the same substitutions in the initiator codon (ATG----GTA), a substitution in codon 15 which generates a termination signal TGG----TGA, nucleotide deletion in codon 20 and the resulting frame shift which yields many termination signals in exons 2 and 3.\" (Isolation and nucleotide sequence analysis of the beta-type globin pseudogene from human, gorilla and chimpanzee. Chang LY, Slightom JL., J Mol Biol., Dec 25 1984;180(4):767-84) \n\n \n \n\"We prepared a cosmid library from chimpanzee DNA ... The clones could be arranged into two overlapping clusters covering the entire C4 region of both chromosomes in this particular heterozygous chimpanzee. The region is about 100 kilobases (kb) long and contains two C4 and two CYP21 genes, the latter coding for the enzyme 21-hydroxylase. Using oligonucleotide probes we identified the genes as corresponding to human C4A, C4B, CYP21 and CYP21P genes. The last gene apparently contains an 8-base pair (bp) deletion (as does the corresponding human gene), which renders it a pseudogene.\" (Organization of the chimpanzee C4-CYP21 region: implications for the evolution of human genes, Kawaguchi H, Golubic M, Figueroa F, Klein J., Eur J Immunol. 1990 Apr;20(4):739-45) \n\n \n \n\"We have previously reported (Villa et al. (1993), Genomics 18: 223) the characterization of the human ZNF75 gene located on Xq26, which has only limited homology (less than 65%) to other ZF genes in the databases. Here, we describe three human zinc finger genes with 86 to 95% homology to ZNF75 at the nucleotide level, which represent all the members of the human ZNF75 subfamily. One of these, ZNF75B, is a pseudogene mapped to chromosome 12q13. The other two, ZNF75A and ZNF75C, maintain an ORF in the sequenced region, and at least the latter is expressed in the U937 cell line. They were mapped to chromosomes 16 and 11, respectively. All these genes are conserved in chimpanzees, gorillas, and orangutans. The ZNF75B homologue is a pseudogene in all three great apes, and in chimpanzee it is located on chromosome 10 (phylogenetic XII), at p13 (corresponding to the human 12q13). The chimpanzee homologue of ZNF75 is also located on the Xq26 chromosome, in the same region, as detected by in situ hybridization. As expected, nucleotide changes were clearly more abundant between human and orangutan than between human and chimpanzee or gorilla homologues.\" (The ZNF75 Zinc Finger Gene Subfamily: Isolation and Mapping of the Four Members in Humans and Great Apes, Villa A., Strina D., Frattini A., Faranda S., Macchi P., Finelli P., Bozzi F., Susani L., Archidiacono N., Rocchi M., Vezzoni P., Genomics, July 1996, vol. 35, no. 2, pp. 312-320(9)) \n\n \n \n\"We have isolated a chimpanzee processed pseudogene for subunit IV of cytochrome c oxidase (COX; EC 1.9.3.1) by screening a chimpanzee genomic library in lambda Charon 32 with a bovine liver cDNA encoding COX subunit IV (COX IV), and localized it to a 1.9-kb HindIII fragment. Southern-blot analysis of genomic DNA from five primates showed that DNAs from human, gorilla, and chimpanzee each contained the 1.9-kb pseudogene fragment, whereas orangutan and pigtail macaque monkey DNA did not. This result clearly indicates that the pseudogene arose before the divergence of the chimpanzee and gorilla from the primate lineage. By screening Chinese hamster x human hybrid panels with the human COX4 cDNA, we have mapped COX4 genes to two human chromosomes, 14 and 16. The 1.9-kb HindIII fragment containing the pseudogene, COX4P1, can be assigned to chromosome 14, and by means of rearranged chromosomes in somatic cell hybrids, to 14q21-qter. Similarly, the functional gene, COX4, has been mapped to 16q22-qter.\" (Novel use of a chimpanzee pseudogene for chromosomal mapping of human cytochrome c oxidase subunit IV. Lomax MI, Welch MD, Darras BT, Francke U, Grossman LI., Gene. 1990 Feb 14;86(2):209-16.) \n\n \n \n \n \n 3) The head-to-head fusion of two \"chimp\" chromosomes to form one human chromosome\n \n \n\"Humans have 46 chromosomes, whereas chimpanzee, gorilla, and orangutan have 48. This major karyotypic difference was caused by the fusion of two ancestral chromosomes to form human chromosome 2 and subsequent inactivation of one of the two original centromeres (Yunis and Prakash 1982). As a result of this fusion, sequences that once resided near the ends of the ancestral chromosomes are now located in the middle of chromosome 2, near the borders of bands 2q13 and 2q14.1. For brevity, we refer henceforth to the region surrounding the fusion as 2qFus. Two head-to-head arrays of degenerate telomere repeats are found at this site; their head-to-head orientation indicates that chromosome 2 resulted from a telomere-to-telomere fusion (Ijdo et al. 1991).\n \n ...\n \n The gross characteristics of the chromosomal fusion that gave rise to human chromosome 2 were apparent 20 years ago, when Yunis and Prakash aligned the high-resolution banding patterns of human, chimpanzee, gorilla, and orangutan chromosomes (Yunis and Prakash 1982). The identities of the fusion partners were confirmed 10 years later when human chromosome-2 specific DNA was observed to \"paint\" chimpanzee chromosomes 12 and 13 (Jauch et al. 1992; Wienberg et al. 1992). Because the fused chromosome is unique to humans and is fixed, the fusion must have occurred after the human-chimpanzee split, but before modern humans spread around the world, that is, between ~6 and ~1 million years ago (Mya; Chen and Li 2001; Yu et al. 2001) \n \n (Fig. 5). This gross karyotypic change may have helped to reinforce reproductive barriers between early Homo sapiens and other species, as the F1 offspring would have had reduced fertility because of the risk of unbalanced segregation of chromosomes during meiosis. \" (Genomic Structure and Evolution of the Ancestral Chromosome Fusion Site in 2q13-2q14.1 and Paralogous Regions on Other Human Chromosomes, Yuxin Fan, Elena Linardopoulou, Cynthia Friedman, Eleanor Williams, and Barbara J. Trask1, Genome Research, Vol. 12, Issue 11, 1651-1662, November 2002) \n", 
   {
    "unicode_changes_made": true
   }, 
   165766, 
   null, 
   1128278580.0
  ], 
  [
   169237, 
   null, 
   "marc9000", 
   "Let met start off by pointing out that you agreed to argue the affirmative and accept the burden of proof. As such, you have to prove your case and the 'resolved'. So far, you haven't offered even one piece of evidence for special-creation of humans. If you fail to support it, I win ... no matter what! \n \n In fact, what is your position? Who is the creator of humans? When, where, and how was the creation done? You've provided no details or evidence. \n\n \n My case is about faith, the word that's in the resolution. The word \"evidence\" isn't in there. My position is to take on the standard, unfair phrase \" religious faith vs. scientific fact\" by showing the faith involved in the evolutionary (\"scientific\") belief in the origin of humans. I believe I have to show comparable faiths. (faith can't be measured in units) What I've done so far is shown some motivation that much of science has for not being objective, when it comes to it's origin of humans theories if it interferes with it's faithful presupposition, that there is no God. I thought the faith in my side (special creation - there is a God) was understood. But you ask a fair question, I'll outline my personal belief. \n \n The absolute base of my personal belief is in one of the most profound statements I've ever seen in my life, and I saw it when I was in my early teens, in a public school science textbook. It read; matter cannot be created nor destroyed.  It sounded ridiculous to me at first. I thought \"if I light a piece of paper with a match, I've destroyed it.\" But it didn't take long for me to realize that I didn't destroy it at all, I just changed it into ashes & smoke. So considering all the activity in this world, what are we doing? We're rearranging. That's the realm we live in. Every single thing we do and think about that we can put a scientific finger on is rearranging, including evolution. This has subsequently led to additional thoughts of mine, along with my realization of some scientific facts.\n \n 1) The things we can't apply science to (love vs. hate / good vs. evil, etc.) influence the activity of the world more than our rearranging.\n \n 2) After Darwin's theories were established, five lines of scientific evidence prove beyond a reasonable doubt that the universe had a sudden, immediate beginning.\n \n 3) The universe is running down like a wind up clock. Stars, including our sun, are dying. \n \n 4) From the universe's declining to our own personal experiences on Earth with rust, rot and decay everywhere we look, we see nature overwhelmingly bring things from order to disorder.\n \n 5) With the variety and complexity I see in our little rearranging box called Earth, I can easily believe that another realm of creation and destruction could be just as complex. I choose not to faithfully shut it's possibility out of my mind like you seem to. \n \n These are the main reasons I believe Genesis 1:27.\n \n \n So God created man in his own image, in the image of God created he him; male and female created he them. \n\n \n To recap, my absolute starting point is a scientific statement \" matter cannot be created nor destroyed.\" [by humans] Judging from your posts, yours appears to be the following, faithful one; \"There is no God.\" If I'm wrong about yours, you have two more posts to correct me. \n \n \n \n \nNow that's different than the origin of life! That's at least three different topics you're trying to debate. \n \n Also, are you going to demonstrate that no simpler-than-human life existed prior to humans? When do you plan to start presenting evidence for your positions, rather then simply throwing out \"that's faith\" assertions in response to mine?\n \n \n \n What? A FOURTH topic you're trying to drag into the debate? \n \n Let me remind you again that the topic of debate is the origin of HUMANS, not the origin of LIFE and not the origin of the PHYSICAL LAWS.\n\n \n I'm not introducing new topics. I'm addressing the many processes you faithfully believe in that lead to the origin of humans. For you to objectively show that humans originated by purely naturalistic means with logical proof and material evidence, you have to move through all these steps. If you presuppose the building blocks, you're bridging gaps with faith. \n \n \n \n \n \n 3) Lewontin \n \n \n \n Their relevance to the debate is minimal at best. For example, nowhere in your quote does Lewontin even mention the origin of humans. \n\n \n No he doesn't, but he doesn't mention a logical, scientific dismissal of the possibility of a God, he \"doesn't allow a divine foot in the door.\" But he doesn't use the word \"faith\", he uses several other similar words to dance around it. \n \n \n \n \n \n \n \n \nNo, it's not faith, because the conclusion that DNA existed prior to humans is based on material evidence and logic!\n \n \n \n As we all know, proteins are coded for by genes, and genes are stretches of DNA. Thus, finding proteins in dinosaur bones demonstrates, logically through transitivity, that dinosaurs had DNA. And since the dinosaur the proteins were extracted from lived 70 million years ago, whereas humans arose only about 200 thousand years ago, we see that DNA did predate humans. \n\n \n So you don't address where anything that predates humans came from? God predates humans. Why do you insist that I address where God came from? Our faiths are comparable. \n \n \n \n \nYou've just conceded that the general mechanism proposed by me for the origin of humans is indeed fact: accepted, objectively, by both \"Darwinists and Creationists alike\". As we know, belief in microevolution is not based on blind faith; it is based on material evidence and solid logic. \n \n Now, where's your material evidence and solid logic that the general mechanism proposed by you for the origin of humans - a supernatural being doing magic - is indeed fact? You don't have it. Your special-creation position is based on blind faith. \n \n Even if we neglect everything else I've presented that supports the evolutionary origin of humans over the special-creation account, and also neglect who has the burden of proof, I 'win' on this one point alone: my general mechanism is objective fact and not accepted by blind faith: yours is not objective fact and is accepted on blind faith. \n\n \n My general mechanism can create matter that we all know exists. Your general mechanism doesn't address where it came from. Microevolution occurs in things you claim have already macroevolved. You're using step 2 to prove step 1. I often use the actions of man to prove scripture, so you could say I do the same. So our faiths are comparable. \n \n \n \n \nMacroevolution can be as 'simple' as speciation, which has been observed in the lab, and in the wild.\n \n \n \n Wrong. In addition to extrapolation, there is also material evidence of \"one organism turning into another\", such as fossil evidence of the transition from reptiles to mammals, and 'living intermediates' in the origin of multicellularity seen in the Volvocaceans. We also have comparative anatomy, comparative embryology, comparative genomics, and the fossil record that all support macroevolution. \n\n \n But the very little fossil record you claim to have still can't explain how the transitional forms survived. Reptiles have scales - mammels have skin. How could the creature survive that no longer had scales but didn't quite have skin yet? \n \n \n \n \nAnd new species! \n \n Quote:\n Dobzhansky and Pavlovsky (1971) reported a speciation event that occurred in a laboratory culture of Drosophila paulistorum sometime between 1958 and 1963. The culture was descended from a single inseminated female that was captured in the Llanos of Colombia. In 1958 this strain produced fertile hybrids when crossed with conspecifics of different strains from Orinocan. From 1963 onward crosses with Orinocan strains produced only sterile males. Initially no assortative mating or behavioral isolation was seen between the Llanos strain and the Orinocan strains. Later on Dobzhansky produced assortative mating (Dobzhansky 1972).\n (http://www.talkorigins.org/faqs/faq-speciation.html)\n \n \n \n \n \n Quote:\n The article is on page 22 of the February, 1989 issue of Scientific American. It's called \"A Breed Apart.\" It tells about studies conducted on a fruit fly, Rhagoletis pomonella, that is a parasite of the hawthorn tree and its fruit, which is commonly called the thorn apple. About 150 years ago, some of these flies began infesting apple trees, as well. The flies feed and breed on either apples or thorn apples, but not both. There's enough evidence to convince the scientific investigators that they're witnessing speciation in action. Note that some of the investigators set out to prove that speciation was not happening; the evidence convinced them otherwise.\n (http://www.talkorigins.org/faqs/speciation.html) \n\n \n Your copy/pastes don't make it very clear if they were still flies or not. Could you clarify it in your own words?\n \n \n \n \nSo your argument amounts to, \"In the very limited amount of time we humans have bred animals we've managed to create up to new species - therefore, that's it: no larger-scale changes can possibly occur, no matter how much time is allowed for\". \n\n \n That's it - as soon as science \"creates up to new species\" it hits the brick wall of genetic limits.\n \n \n But that conclusion does not necessarily follow from the starting fact. In fact, the most straightforward conclusion is that larger scale changes could occur given larger time scales. \n\n \n With faith, yes. \n \n \n \n \n \n \nNo, I have the fossil record on my side too!\n \n The scientific community has a plethora of hominid fossils. Shoot, even the anti-evolution ID Creationists acknowledge their existence:\n \n \n \n Wells goes on to point out disagreements among scientists. Yes, real scientists do still disagree on exactly which fossils were left by hominids in our own human lineage and which ones represent side branches in hominid evolution that went extinct. But that uncertainty does not nullify the existence of the pre-human fossils: they are real. \n \n For pictures and descriptions of many of them: http://www.talkorigins.org/faqs/homs/specimen.html\n\n \n From your link;\n \n \n.....as there are now thousands of hominid fossils. They are however mostly fragmentary, often consisting of single bones or isolated teeth. Complete skulls and skeletons are rare. \n\n \n You have faith that those presenting the fragments are telling the truth? Why are complete skulls and skeletons rare? \n \n \n \nFaith healing! Except that the unquestioning BLIND FAITH many religious people have prevents them from seeing that it is an outright fraud: it can't be disproven in their faith-controlled minds. \n\n \n No comparison. Faith healing didn't have a sudden start, a belief period, then a sudden stop like Piltdown man did. While there are a few dishonest and delusional people that take the faith healing thing too far, to a degree medical statistics prove it to be true. \n \n http://www.medicalnewstoday.com/medicalnews.php?newsid=27202&nfid=rssfeeds\n \n \nThe historical link between science and religion began to crumble centuries ago as a reluctant church held fast to positions that science could empirically refute. \"But today,\" said Anderson, \"the shoe is on the other foot. Based on over 30 years of compelling data, medicine can no longer simply dismiss the role that faith plays in both the prevention of and recovery from illness. \n\n \n \n \nNo, it's because science is self-correcting. It was scientists who discovered that Piltdown Man was a fraud; and then the entire scientific community absolutely dismissed it as one. \n\n \n It was scientests who wanted Piltdown man to be authentic, and left it locked in a vault for most of the 40 years. Considering that the jaw was chemically treated, and that the teeth had clearly visible file marks on them, it shouldn't have taken 40 years - 40 minutes may have been more like it. Time is an important factor. 40 years is a lot of time for experiments and theories to be based upon something false, and people to be mislead.\n \n \nReligion is not like that. Many religious people actually believe that Benny Hinn's touch regenerated bones in a crippled woman's leg, allowing her to walk again (a claim I saw him make on TV just a few weeks ago). Religious people are so totally blinded by their unquestioning faith that rational and free thought is not open to them. \n \n So the ridiculousness of faith healing, which has been with us going back thousands of years prior to Piltdown Man, will continue to be with us into the near, if not distant, future. \n\n \n So you don't believe it at all? And if a science lab makes a macroevolutionary \"discovery\" thousands of miles away from you, you believe it without question?\n \n \n \n \n2) Six (there could be more) non-functional pseudogenes shared by both chimps and humans crush the \"common design\" counterargument.\n\n \n How does it crush it? Your copy/pastes don't show it very clearly. Again, could you explain it in your own words?\n \n \n \n \n3) The head-to-head fusion of two \"chimp\" chromosomes to form one human chromosome\n\n \n From your copy/pastes;\n \n we have determined\n could be arranged\n apparently contains\n \n You accept these things without question - I accept Genesis 1:27 without question. Our faiths are comparable.", 
   {
    "unicode_changes_made": true
   }, 
   167498, 
   null, 
   1128827880.0
  ], 
  [
   170117, 
   null, 
   "DamEtel", 
   "DamEtel: Let met start off by pointing out that you agreed to argue the affirmative and accept the burden of proof. As such, you have to prove your case and the 'resolved'. So far, you haven't offered even one piece of evidence for special-creation of humans. If you fail to support it, I win ... no matter what! \n \n In fact, what is your position? Who is the creator of humans? When, where, and how was the creation done? You've provided no details or evidence. \n\n \n \nmarc9000: My case is about faith, the word that's in the resolution. The word \"evidence\" isn't in there.\n\n \n Let's look:\n \n \n Resolved: It takes as much blind faith to believe that the origin of humans occurred by purely naturalistic means as it does to believe that the origin of humans occurred through special creation.\n\n \n and \n \n \nfaith is a confident belief in the truth, value, or trustworthiness of a person, idea, or thing, with that belief not resting on logical or material evidence.\n\n \n Evidence is the key factor in determining whether or not a belief qualifies as faith. If you admit that your position has no evidence, then you've already lost the debate. The evolutionary explanation for the origin of humans IS based on evidence: multiple evidences. Hence, it doesn't even qualify as faith, while yours is all faith. There's no way you can meet your burden of proof. \n \n \nmarc9000: What I've done so far is shown some motivation that much of science has for not being objective, when it comes to it's origin of humans theories if it interferes with it's faithful presupposition, that there is no God.\n\n \n You're misrepresenting science and evolution: neither says there is no God. What you are claiming is that science follows ONTOLOGICAL naturalism, which is false. As I pointed out in my first post, science follows METHODOLOGICAL naturalism.\n \n \n \nmarc9000: The absolute base of my personal belief is in one of the most profound statements I've ever seen in my life, and I saw it when I was in my early teens, in a public school science textbook. It read; matter cannot be created nor destroyed.\n\n \n Actually, matter can be both created and destroyed: it is mass-energy that can't be.\n \n \nmarc9000: It sounded ridiculous to me at first. I thought \"if I light a piece of paper with a match, I've destroyed it.\" But it didn't take long for me to realize that I didn't destroy it at all, I just changed it into ashes & smoke. So considering all the activity in this world, what are we doing? We're rearranging. That's the realm we live in. Every single thing we do and think about that we can put a scientific finger on is rearranging, including evolution.\n\n \n In line with what you've just said, evolution is NOT about the creation of matter from nothing. It also is NOT about the origin of the laws of nature, NOR even about the origin of life itself. That's why your attempts to drag these extraneous matters into the debate about HUMAN ORIGINS are invalid. \n \n \nmarc9000: This has subsequently led to additional thoughts of mine, along with my realization of some scientific facts.\n \n 1) The things we can't apply science to (love vs. hate / good vs. evil, etc.) influence the activity of the world more than our rearranging.\n\n \n Uhm, that's not a scientific fact.\n \n \nmarc9000: 4) From the universe's declining to our own personal experiences on Earth with rust, rot and decay everywhere we look, we see nature overwhelmingly bring things from order to disorder.\n\n \n We also see spontaneous increases in order. A few examples include stars forming from clouds of gas, liquids freezing, mixtures of non-polar and polar liquids separating into two distinct phases, and the abiotic synthesis of sugars and amino acids. \n \n \nmarc9000: To recap, my absolute starting point is a scientific statement \" matter cannot be created nor destroyed.\" [by humans]\n\n \n Which the evolutionary origin of humans doesn't conflict with at all.\n \n \nmarc9000: Judging from your posts, yours appears to be the following, faithful one; \"There is no God.\"\n\n \n The scientific statement that humans evolved from an ancestor we shared with chimps neither confirms nor denies the existence of God. You can't seem to grasp this simple fact.\n \n Dr. Kenneth Miller just testified in court about his strong religious beliefs while also fully accepting evolution. \n \n \nQ. So you wrote a whole book exploring this intersection between science and faith?\n \n [Dr. Kenneth Miller] A. That's correct.\n \n Q. And is any of that kind of discussion found in your high school biology textbook?\n \n A. No, of course not.\n \n Q. Why?\n \n A. Because it's not scientific. And I've made the point earlier that just when you say something is not scientific doesn't mean it's not important, doesn't mean it's not true, doesn't mean it doesn't concern something that you really and deeply care about. And I deeply care about my own religious beliefs and my faith, and I also deeply care about science, and I wanted to explain to a general audience how I understand the intersection of those two beliefs, not just to reconcile them, but to confirm and enhance both beliefs. \n \n Now, I believe in that very strongly, but I certainly recognize that my views on this are not science and they are not scientific. My coauthor, Joseph Levine, who also is a religious person, I have to tell you, has different views of faith, belongs to a different faith, and follows a different religious tradition than I do. \n \n Joe and I both have enormous respect for religion. We both believe that the evolutionary theory is fully compatible with our different religious beliefs, but we also recognize that our religious beliefs are not scientific, that they are philosophical, theological, and deeply personal, and, as such, they don't belong in a science curriculum, and they certainly don't belong in a science textbook.\n \n Q. And they're not found in your high school science textbook?\n \n A. Definitely not.\n (http://www2.ncseweb.org/kvd/trans/kvd_trans_20050926_day1_am.pdf)\n \n\n \n Please stop the misrepresentations.\n \n \nDamEtel: No, it's not faith, because the conclusion that DNA existed prior to humans is based on material evidence and logic!\n \n *************************\n Other researchers have previously recovered traces of protein from dinosaur bones, and indeed just two weeks ago Schweitzer reported traces of protein in 70 million year old dinosaur eggs.\n \n \"[The T. rex paper] suggests that biological and biochemical information might be recoverable from a wide range of fossil material,\" says Angela Milner of the Natural History Museum, in London, UK, who has detected proteins in Iguanadon bone. \n (Blood vessels recovered from T. rex bone, Jeff Hecht, NewScientist.com news service, March 24 2005, http://www.newscientist.com/channel/life/dn7195)\n *************************\n \n As we all know, proteins are coded for by genes, and genes are stretches of DNA. Thus, finding proteins in dinosaur bones demonstrates, logically through transitivity, that dinosaurs had DNA. And since the dinosaur the proteins were extracted from lived 70 million years ago, whereas humans arose only about 200 thousand years ago, we see that DNA did predate humans. \n\n \n \nmarc9000: So you don't address where anything that predates humans came from?\n\n \n Despite your implication, I don't have to address where the universe, or the laws of nature, or the first life, or the dinosaurs, or their DNA, came from. I have to address the evolutionary origin of humans. And I have done so, by presenting multiple lines of evidences that all point to our sharing a common ancestor with chimps.\n \n \nDamEtel: You've just conceded that the general mechanism proposed by me for the origin of humans is indeed fact: accepted, objectively, by both \"Darwinists and Creationists alike\". As we know, belief in microevolution is not based on blind faith; it is based on material evidence and solid logic. \n \n Now, where's your material evidence and solid logic that the general mechanism proposed by you for the origin of humans - a supernatural being doing magic - is indeed fact? You don't have it. Your special-creation position is based on blind faith. \n \n Even if we neglect everything else I've presented that supports the evolutionary origin of humans over the special-creation account, and also neglect who has the burden of proof, I 'win' on this one point alone: my general mechanism is objective fact and not accepted by blind faith: yours is not objective fact and is accepted on blind faith. \n\n \n \nmarc9000: My general mechanism can create matter that we all know exists.\n\n \n Nope. You merely BELIEVE that, based entirely on BLIND FAITH! \n \n You cannot provide any empirical evidence, or provide any logic convincing to an unbiased rational person, demonstrating that to be true.\n \n \nmarc9000: Your general mechanism doesn't address where [matter] came from.\n\n \n It doesn't need to. Evolution also doesn't need to explain why helium rises, or a whole slew of other things. \n \n \nmarc9000: Our faiths are comparable.\n\n \n Grossly misleading. \n \n First, my position is NOT based on faith, but rather on multiple, objectively verifiable evidences. \n \n Second, even if we wrongly consider my position to be based on faith for the sake of argument, your saying our faiths are comparable is like saying Bill Gates' net worth is comparable to a homeless person's: sure, one can compare the two, but they are vastly different in magnitude - and that kind of 'comparable' won't work for you because the 'resolved' states:\n \n \nResolved: It takes as much blind faith to believe that the origin of humans occurred by purely naturalistic means as it does to believe that the origin of humans occurred through special creation.\n\n \n You have to first show that my evolutionary-origin-of-humans position is based on BLIND FAITH: which you simply can't do. But even if you could, then you'd still have to show that it takes AS MUCH blind faith to accept the evolutionary explanation as it does to believe your special creation account: you can't do that either.\n \n \nmarc9000: Our faiths are comparable.\n\n \n \nmarc9000: So our faiths are comparable.\n\n \n \nmarc9000: Our faiths are comparable.\n\n \n Do you think simply saying something over and over makes it true?\n \n \nDamEtel: And new species!\n \n ******************************************\n Dobzhansky and Pavlovsky (1971) reported a speciation event that occurred in a laboratory culture of Drosophila paulistorum sometime between 1958 and 1963. The culture was descended from a single inseminated female that was captured in the Llanos of Colombia. In 1958 this strain produced fertile hybrids when crossed with conspecifics of different strains from Orinocan. From 1963 onward crosses with Orinocan strains produced only sterile males. Initially no assortative mating or behavioral isolation was seen between the Llanos strain and the Orinocan strains. Later on Dobzhansky produced assortative mating (Dobzhansky 1972).\n (http://www.talkorigins.org/faqs/faq-speciation.html)\n ******************************************\n \n ******************************************\n The article is on page 22 of the February, 1989 issue of Scientific American. It's called \"A Breed Apart.\" It tells about studies conducted on a fruit fly, Rhagoletis pomonella, that is a parasite of the hawthorn tree and its fruit, which is commonly called the thorn apple. About 150 years ago, some of these flies began infesting apple trees, as well. The flies feed and breed on either apples or thorn apples, but not both. There's enough evidence to convince the scientific investigators that they're witnessing speciation in action. Note that some of the investigators set out to prove that speciation was not happening; the evidence convinced them otherwise.\n (http://www.talkorigins.org/faqs/speciation.html) \n ******************************************\n \n\n \n \nmarc9000: Your copy/pastes don't make it very clear if they were still flies or not. Could you clarify it in your own words?\n\n \n New species.\n \n \nDamEtel: Wrong. In addition to extrapolation, there is also material evidence of \"one organism turning into another\", such as fossil evidence of the transition from reptiles to mammals, and 'living intermediates' in the origin of multicellularity seen in the Volvocaceans. We also have comparative anatomy, comparative embryology, comparative genomics, and the fossil record that all support macroevolution.\n \n \n \nmarc9000: But the very little fossil record you claim to have ...\n\n \n Excuse me, but I made no claim of having VERY LITTLE fossil evidence for macroevolution. There is, in fact, a MASSIVE amount of fossil evidence that supports \"one organism turning into another\". Look over these pages for a starter.\n \n \nWe also have an exquisitely complete series of fossils for the reptile-mammal intermediates, ranging from the pelycosauria, therapsida, cynodonta, up to primitive mammalia (Carroll 1988, pp. 392-396; Futuyma 1998, pp. 146-151; Gould 1990; Kardong 2002, pp. 255-275). \n (http://www.talkorigins.org/faqs/comdesc/section1.html#morphological_intermediates_ex2) \n\n \n \nTransition from synapsid reptiles to mammals\n This is the best-documented transition between vertebrate classes. \n (http://www.talkorigins.org/faqs/faq-transitional/part1b.html#mamm) \n\n \n You really might want to consider learning a little about science, biology, and evolution before going around 'bashing' them.\n \n \nmarc9000: ... still can't explain how the transitional forms survived. Reptiles have scales - mammels have skin.\n\n \n What a silly comparison! \n \n (1) Reptiles do have skin.\n \n \n\"Characteristics Of Reptiles That Distinguishes Them From Amphibians\n \n 1. Reptiles have tough, dry, scaly skin offering protection against desiccation and physical injury.\n \n The skin consists of a thin epidermis, shed periodically, and a much thicker, well-developed dermis. ... The characteristic scales of reptiles are formed largely of keratin. They are derived mostly from the epidermis ...\" (Integrated Principles of Zoology: Tenth Edition, Cleveland P Hickman Jr., Larry S Roberts, and Allan Larson, WCB McGraw-Hill, 1996, p552) \n\n \n (2) You're comparing apples and oranges: scales and skin. \n \n The correct comparison would be between the scales of reptiles and the hair of mammals. Anyone who graduated from (a public) high school should know that.\n \n \nmarc9000: How could the creature survive that no longer had scales but didn't quite have skin yet? \n\n \n The real question is, why should anyone listen to your personal opinion about science and evolution, considering that you've shown yourself to be unknowledgeable about them? \n \n \nmarc9000: Why are complete [hominid] skulls and skeletons rare?\n\n \n Doesn't matter much: rare still means they exist.\n \n \nDamEtel: Religion is not like that. Many religious people actually believe that Benny Hinn's touch regenerated bones in a crippled woman's leg, allowing her to walk again (a claim I saw him make on TV just a few weeks ago). Religious people are so totally blinded by their unquestioning faith that rational and free thought is not open to them. \n \n So the ridiculousness of faith healing, which has been with us going back thousands of years prior to Piltdown Man, will continue to be with us into the near, if not distant, future. \n\n \n \nmarc9000: So you don't believe it at all?\n\n \n Faith healing as I described? Nope, not at all. But if you're gullible enough to believe in it, all I will do (after snickering) is (1) offer the following rational perspective:\n \n \nSome would point out that faith healing has not scientifically been proven effective, since its practitioners can only cite anecdotal evidence of cases where it has been successful. Skeptics point out that proponents of faith healing ignore the far more numerous cases where the patient dies despite the efforts of faith healing. Doctors often ascribe any success to the placebo effect or to spontaneous remission: some people will heal with or without treatment, and it is generally natural to credit the most recent treatment for the cure (this form of reasoning is called post hoc ergo propter hoc).\n \n Prominent 1980's-era faith healer and televangelist Peter Popoff was publicly exposed by noted skeptic James Randi working together with popular TV host Johnny Carson, when it was discovered that the apparent healing miracles and prophetic acts performed by Popoff were in fact part of an elaborately stage-managed setup including planting of audience members and broadcasts to an in-ear radio receiver. Other faith healers such as Benny Hinn have also been hit by reports of fraudulent activity.\n \n ...\n \n Ethical issues when conventional treatment is refused\n Faith healing can pose serious ethical problems for medical professionals when parents decline or refuse traditional medical care for their children. In some countries, parents argue that constitutional guarantees of religious freedom include the right to rely on alternative healing to the exclusion of medical care. Advocates of conventional medicine argue studies have shown faith healing no more effective than a placebo, making it unethical to rely on, though advocates of spiritual healing argue there exist methodical and bias issues. Doctors as a rule consider it their duty to do everything that they can in the interests of the patient. In consequence, where they judge medical treatment necessary to save an individual's life or health, and balancing the question with legal and privacy concerns, they may act contrary to the patient's or parental wishes. In 2000 in Britain, a government ruling allowed a child, against much protest from the parents, to be treated by doctors.\n (http://en.wikipedia.org/wiki/Faith_healing)\n \n\n \n and (2) point out that faith healing isn't part of the actual debate.\n \n \nDamEtel: 2) Six (there could be more) non-functional pseudogenes shared by both chimps and humans crush the \"common design\" counterargument. \n\n \n \nmarc9000: How does it crush it? Your copy/pastes don't show it very clearly. Again, could you explain it in your own words?\n\n \n First, I'll provide you with a layman's explanation of how shared pseudogenes strongly support the evolutionary origin of humans. \n \n \nDr. Kenneth Miller: I thought that I would start illustrating this by looking at hemoglobin. Hemoglobin is the protein that makes your blood red. It's the oxygen-carrying protein found in red blood cells. \n \n And in the upper right-hand corner of the slide, there is a molecular diagram of hemoglobin. It's made up of four parts. Those parts are called polypeptides, but we can think of them essentially as four subunits. It has two copies of a part called alpha-globin and two copies of a part called beta-globin.\n \n Now, what modern molecular biology has enabled us to do is to look at exactly where the instructions are that specify these. And you'll notice that the beta-globin -- excuse me, the alpha-globin instructions are specified on Chromosome Number 16 and the beta-globin instructions are specified on Chromosome Number 11. \n \n And as our genome does for many genes, we have multiple copies of these, so we have backups. We've got extra copies of the alpha-globin genes and extra copies of the beta-globin genes, and they have very interesting physiological functions, these multiple copies, which are not relevant right now and therefore we won't get into.\n \n But there's something very interesting about these, and it enables us to test evolution right down to the level of the molecule. And I want to point that out by looking at the beta-globin genes on Chromosome Number 11. \n \n If you could advance the slide, please. I've zeroed in on the six copies of the beta-globin gene sequence. Each of these copies is a set of instructions for how you build this polypeptide. Five of them work, but one of them doesn't. It's given the Greek letters psi, beta, and then the number one. And the psi-beta-1 sequence isn't a gene. It doesn't work. It's a pseudogene, and a pseudogene is recognized as a gene because it's so similar to the other five in its DNA sequence, but it has some mistakes. It's broken, and it has a series of molecular errors that render the gene non-functional. \n \n Now, I'd like to show you exactly what those molecular errors are in the next slide. This is a blow-up of the pseudogene. These are the portions that actually do the coding, if it was coded in red here. And you'll notice that there are six distinct mistakes in this gene. \n \n Now, I don't know if I really want to try the patience of the Court in terms of going into the details of molecular biology, but in a very simple way, the altered initiator means that the signal that exists at the front of the gene that says \"copy me\" is missing. And therefore RNA [polymerase], the molecule that copies genes, can't bind, and it never gets expressed. \n \n But even if it did get expressed, it has five other errors that would keep this, the RNA copy of this gene, from being translated. It's missing the start signal. It's got stop codons that would cause the synthetic apparatus to grind to a halt. It's just a mess.\n \n Now, the reason that this is important in evolution is actually very simple, and that is, these errors appear in a gene, they have no functional purpose. And you might ask yourself, what would I do, what would you do if we were to find another organism that didn't just have similar genes but also had a pseudogene in the same spot and had the same set of errors? \n \n There's no reason why evolution would produce a duplicate set of mistakes in two copies of things. It must mean that these two organisms are descended with modification from another organism that had the same set of mistakes.\n \n And if you go on to the next slide, what I'd like to show you are three organisms, the gorilla, the chimpanzee, and the human being that share the exact same set of molecular mistakes. \n \n Now, why is this significant? One of the core principles of evolution is common descent. One could always argue that because the three species that I've depicted on this slide are all African species, that's where they all come from, they're all primates and they all probably started out living in similar environments, that the functional parts of this gene locus, they might work the same. But you cannot argue that the mistakes should match. \n \n And the fact that all three of these species have matching mistakes leads us to just one conclusion, and that's the same conclusion that Charles Darwin predicted almost a century and a half ago, and that is that these three species share a common ancestor. Matching mistakes are evidence of common ancestry.\n \n Q. And are there other animals that share the same mistakes?\n \n Dr. Kenneth Miller: Well, we actually don't know, because there are two great apes in which we're waiting on the genome sequence. Those are the orangutan and the Bonobo, pygmy chimpanzee. And if I had to make a friendly bet, I'd bet that they do. \n \n But other primates and other mammals, cats, dogs, horses, they don't have these mistakes. These mistakes are unique to the lineage that shows common ancestry of us and these other organisms. \n (bold emphasis added, http://www2.ncseweb.org/kvd/trans/kvd_trans_20050926_day1_am.pdf)\n \n\n \n Now, as far as why at least 6 shared pseudogenes point away from common design, that should be obvious. What non-ad hoc, valid reason could one give for a supernatural, intelligent designer purposely creating, separately, multiple organisms each with the very same non-functional parts? Gross stupidity and incompetence? The best you can probably come up with is intentional deceit, which would make your Creator God a great deceiver: like Lucifer.\n \n \n Okay, now a layman's explanation of how the head-to-head fusion of chromosomes also supports the evolutionary account of our origin.\n \n \nDr. Kenneth Miller: The next slide, this is another test of the evolutionary hypothesis of common ancestry. \n \n We have, as I'm sure most people know, 46 chromosomes in our human cells. That means we have 23 pairs of chromosomes because you get 23 from mom and you get 23 from dad, so we've all got 46 total. We've got 23 pairs. \n \n Now, the curious thing about the great apes is they have more. They have, as you can see from the slide, 48 chromosomes, which means they have 24 pairs. Now, what that means, Mr. Walczak, is that you and I, in a sense, are missing a chromosome, we're missing a pair of chromosomes. And the question is, if evolution is right about this common ancestry idea, where did the chromosome go? \n \n Now, there's no possibility that that common ancestry which would have had 48 chromosomes because the other three species have 48, there's no possibility the chromosome could have just got lost or thrown away. Chromosome has so much genetic information on it that the loss of a whole chromosome would probably be fatal. So that's not a hypothesis. \n \n Therefore, evolution makes a testable prediction, and that is, somewhere in the human genome we've got to be able to find a human chromosome that actually shows the point at which two of these common ancestors were pasted together. We ought to be able to find a piece of Scotch tape holding together two chromosomes so that our 24 pairs -- one of them was pasted together to form just 23. And if we can't find that, then the hypothesis of common ancestry is wrong and evolution is mistaken.\n \n Go to the next slide. Now, the prediction is even better than that. And the reason for that is chromosomes themselves have little genetic markers in their middles and on their ends. They have DNA sequences, which I've highlighted in here, called telomeres that exist on the edges of the chromosomes. \n \n Then they have special DNA sequences at the center called centromeres, which I've highlighted in red. Centromeres are really important because that's where the chromosomes are separated when a cell divides. If you don't have a centromere, you're in really big trouble. \n \n Now, if one of our chromosomes, as evolution predicts, really was formed by the fusion of two chromosomes, what we should find is in that human chromosome, we should find those telomere sequences which belong at the ends, but we should find them in the middle. Sort of like the seam at which you've glued two things together, it should still be there. \n \n And we should also find that there are two centromeres, one of which has, perhaps, been inactivated in order to make it convenient to separate this when a cell divides. That's a prediction. And if we can't find it in our genome, then evolution is in trouble.\n \n Next slide. Well, lo and behold, the answer is in Chromosome Number 2. This is a paper that - this is a facsimile of a paper that was published in the British journal Nature in 2004. It's a multi-authored paper. The first author is Hillier, and other authors are listed as et al. And it's entitled, The Generation and Annotation of the DNA Sequences of Human Chromosomes 2 and 4.\n \n And what this paper shows very clearly is that all of the marks of the fusion of those chromosomes predicted by common descent and evolution, all those marks are present on human Chromosome Number 2.\n \n Would you advance the slide. And I put this Page 85 up to remind the Court of what that prediction is. We should find telomeres at the fusion point of one of our chromosomes, we should have an inactivated centromere and we should have another one that still works.\n \n And you'll note -- this is some scientific jargon from the paper, but I will read part of it. Quote, Chromosome 2 is unique to the human lineage of evolution having emerged as a result of head-to-head fusion of two acrocentric chromosomes that remain separate in other primates. The precise fusion site has been located, the reference then says exactly there, where our analysis confirmed the presence of multiple telomere, subtelomeric duplications. So those are right there.\n \n And then, secondly, during the formation of human chromosome 2, one of the two centromeres became inactivated, and the exact point of that inactivation is pointed out, and the chromosome that is inactivated in us -- excuse me, the centromere that is inactivated in us turns out to correspond to primate Chromosome Number 13.\n \n So the case is closed in a most beautiful way, and that is, the prediction of evolution of common ancestry is fulfilled by that led-pipe evidence that you see here in terms of tying everything together, that our chromosome formed by the fusion from our common ancestor is Chromosome Number 2. Evolution has made a testable prediction and has passed.\n (http://www2.ncseweb.org/kvd/trans/kvd_trans_20050926_day1_am.pdf)\n \n\n \n \n \n 4) The individual anatomical differences between humans and chimps are minor: mostly differences in the mere size, shape, or amount of shared structures (jaws, arms, backbone, hair, etc.). No major biological novelty separates the two.\n \n 5) And just as evolution would predict, chimps are our closest 'brain' relative too, having nearly identical brain structure, including several shared asymmetries\n \n \n a) The pictures at http://brainmuseum.org/Specimens/primates/chimp/brain/chimp6sect6.jpg show that the chimpanzee brain is a near anatomical twin of ours.\n \n b) There is an asymmetry in the planum temporale in both human and chimp brains.\n \n \n\"Researchers at Columbia, Mount Sinai School of Medicine and the National Institutes of Health have found that a region of the brain thought to control language is larger in one hemisphere in both chimpanzees and humans, disproving a theory that the brain section was asymmetrical only in humans. \n \n The discovery, reported in the Jan. 9 issue of the journal Science, throws into question the role of the planum temporale, a part of the brain's temporal cortex that is located beneath the parietal cortex. The planum temporale of the left hemisphere is normally larger than in the right hemisphere in humans, but 94 percent of the chimpanzee brains studied demonstrated the same asymmetry.\" (http://www.columbia.edu/cu/record/archives/vol23/vol23_iss12/27.html)\n \n\n \n c) A further brain asymmetry is shared between humans and chimps: that of the hippocampus. Yet the nearby amygdala is symmetrical in both.\n \n \n\"In the first study, Hani Freeman, BA, Claudio Catalupo, PhD (also with Georgia State University), and William Hopkins, PhD (also with Berry College), took magnetic resonance images of 60 chimpanzees to measure the anatomy of two key structures in their brains' limbic systems, an early-evolving central region that includes the hippocampus and amygdala. In the MRI pictures, the hippocampus (which regulates learning and consolidation of spatial memory, mood, appetite and sleep) was asymmetrical, its right half significantly larger than its left. This asymmetry was bigger in males. These findings are consistent with studies of human hippocampi, which are also asymmetrical. At the same time, just as in humans, the amygdalas of the chimps were symmetrical. \n \n Studies such as this confirm that human and chimp brains are not only asymmetrical, but asymmetrical in the same way.\" (http://www.apa.org/releases/chimpbrains.html) \n\n \n d) Because of their neuroanatomy, most chimps, like humans, are right handed.\n \n \n\"In a second study, Hopkins and Cantalupo report the first-ever evidence of an association between hand preference and asymmetries in three areas of the brain cortex in chimps. Observing 66 chimps, they correlated asymmetries in brain anatomy with three measures of handedness: Simple reaching (which hand chimps used to pick up a raisin thrown into the cage), two-handed feeding (which hand chimps used to feed themselves chunks of fruit while holding the whole piece, such as a banana, in the other hand), and a measure of coordinated bimanual actions (which hand chimps used to fish peanut butter from a plastic tube with a finger). \n \n Left-handed and right-handed chimps differed relative to the asymmetries in two primary motor areas, the planum temporale and the precentral gyrus. Say the authors, the results \"challenge the long-held belief that the neurobiological substrates for handedness are unique to humans.\" Just as in humans, neuroanatomy governs whether a chimp becomes a lefty or a righty. Hopkins points out that chimps are also strongly right-handed for manual gestures and throwing, a clue to the origins of more general right-hand dominance in both chimps and humans.\"\n (December 5, 2004, http://www.apa.org/releases/chimpbrains.html) \n \n\n \n \n 6) Chimps also have \"humanlike\" mental qualities, such as high intelligence, self-recognition, a sense of fairness - which is modulated according to social bonds - and a rudimentary form of apathy\n \n \n\"Many other animals, including a variety of primates, elephants, birds and even dolphins, have been tested for self-recognition. But only chimpanzees, orangutans and humans have consistently passed this test.\" (Can Animals Empathize?, Gordon Gallup Jr., Scientific American, 1998, p67) \n\n \n (The first study dealt with monkeys, but later research extended it to chimps also)\n \n \nATLANTA - In the first experimental demonstration of its kind, researchers led by Sarah Brosnan and Frans de Waal, PhD, at the Yerkes National Primate Research Center of Emory University, and the Living Links Center, have shown nonhuman primates respond negatively to unequal reward distribution, a reaction often seen in humans based on their universal sense of fairness. While researchers have long recognized the sense of fairness within the human species, Brosnan and de Waal are the first to confirm this trait in nonhuman primates. The findings appear in the September 18 issue of Nature.\n \n ...\n \n In this study, researchers made food-related exchanges with brown capuchin monkeys. The subjects refused previously acceptable rewards (cucumbers) if they witnessed their partners receiving higher-value rewards (grapes) for equal or less work. \n \n This is similar to the negative response humans display when they see other individuals receiving a better deal. \n \n \"People often forgo an available reward because it is not what they expect or think is fair,\" says Brosnan. \"Such irrational behavior has baffled scientists and economists, who traditionally have argued all economic decisions are rational. Our findings in nonhuman primates indicate the emotional sense of fairness plays a key role in such decision-making.\" \n \n For this study, Brosnan and de Waal conducted four tests, each including two sessions of 25 trials, on pairs of female capuchins. First, they gave study subjects lower-value rewards of cucumbers if the subjects would exchange tokens. Then, they measured the study subjects' responses when grapes, a higher-value reward, were given to their partners for exerting varying levels of work. \n \n \"We showed the subjects compared their rewards with those of their partners and refused to accept a lower-value reward if their partners received a higher-value reward,\" says Brosnan, \"This effect is amplified when the partner does not have to work for the reward.\" \n \n The researchers recorded a 95 percent completed exchange rate with the subjects during the equity test, in which both subject and partner received cucumber as the reward for the same amount of work. The completed exchange rate fell to 60 percent during the inequity test, in which subjects observed their partners receiving grapes for completing the same amount of work. A further decrease to 20 percent of completed exchanges occurred in the effort-control test, when partners received the higher-value reward for less work. Finally, a 55 percent exchange rate was recorded for the cucumbers in the food-control test. \n \n Brosnan and de Waal are conducting related studies in capuchins to further explain these responses. They also are conducting a similar study with chimpanzees. \n \n (bold emphasis added, 09/19/2003, Yerkes Researchers First To Recognize Sense Of Fairness In Nonhuman Primates, http://www.sciencedaily.com/releases/2003/09/030918092951.htm) \n\n \n \n \nThe evolution of the sense of fairness may have involved the quality of relationships, according to behavioral researchers at the Yerkes National Primate Research Center in Atlanta. \n \n By observing variability in chimpanzees' responses to inequity, Sarah Brosnan, PhD, and Frans de Waal, PhD, both researchers in Yerkes' Division of Psychobiology and the Yerkes-based Living Links Center, determined the chimpanzees' responses depended upon the strength of their social connections. This is the first demonstration that nonhuman primates' reactions to inequity parallel the variation in human responses to unfair situations based on the quality of the relationship. This novel finding appears January 26 on the Proceedings of the Royal Academy of Sciences, Series B web site, www.journals.royalsoc.ac.uk . The finding also will appear in the journal's February 7 print edition. \n \n Coupled with data from the authors' previous fairness-related research in capuchin monkeys, released in fall 2003, Brosnan and de Waal's current research provides new insight into the role social environment and relationships play in human decision-making. In their previous study, the researchers identified for the first time a sense of fairness in nonhuman primates and correlated that finding to human economic decision-making. \n \n \"Human decisions tend to be emotional and vary depending on the other people involved,\" said Brosnan. \"Our finding in chimpanzees implies this variability in response is adaptive and emphasizes there is not one best response for any given situation but rather it depends on the social environment at the time.\" \n \n In the current study, Drs. Brosnan and de Waal made food-related exchanges with chimpanzees from groups that had lived together either their entire lives or a relatively short time (less than eight years). Animals were paired to determine how they would react when their partners received a superior reward (grapes) instead of a less-valued reward (cucumbers) for the same amount of work, considered an unfair situation. The researchers observed the chimpanzees in the close, long-term social groups were less likely to react negatively to the unfair situation than were the chimpanzees in the short-term social groups, who refused to work when their partners received a superior reward. Such a reaction is seen in humans who might react negatively to unfair situations with a stranger or enemy but not with a family member or friend. \n \n \"Identifying a sense of fairness in two, closely-related nonhuman primate species implies it could have a long evolutionary history. The capuchin responses as well as those of the chimpanzees, the most closely related species to humans, could represent stages in the evolution of the complex responses to inequity exhibited by humans and may help explain why we make certain decisions,\" said Brosnan. \n \n Brosnan and de Waal currently are investigating reactions to unfairness in more detail. They hope to uncover the specific situations that lead to such reactions. \n (bold emphasis added, 01/28/2005, Chimpanzees Show Quality of Relationship Drives Sense of Fairness, http://www.whsc.emory.edu/press_releases2.cfm?announcement_id_seq=2819) \n\n \n And finally:\n \n \nCHICAGO -- A new study has shown that chimpanzees may be able to determine whether their partners know they are in danger. This suggests that these primates are able to decide how ignorant or informed their peers are about an unexpected situation. \n The finding, made by a team of researchers at Ohio State University's Comparative Cognition Project, suggests that chimps share with humans the ability to perceive the knowledge state of a peer, and perhaps the intention to protect that peer. \n \n Earlier experiments with both rhesus and Japanese macaque monkeys failed to show the same abilities in those animals. These new results strengthen the argument that in some ways, chimpanzees are closer to humans than they are to other primates. \n \n (bold emphasis added, 09/04/1997, One Chimp Can Perceive States Of Awareness In Others, Source: Ohio State University, http://www.sciencedaily.com/releases/1997/09/970904035215.htm) \n", 
   {
    "unicode_changes_made": true
   }, 
   169237, 
   null, 
   1129095900.0
  ], 
  [
   171456, 
   null, 
   "marc9000", 
   "Evidence is the key factor in determining whether or not a belief qualifies as faith. If you admit that your position has no evidence, then you've already lost the debate. The evolutionary explanation for the origin of humans IS based on evidence: multiple evidences. Hence, it doesn't even qualify as faith, while yours is all faith. There's no way you can meet your burden of proof. \n \n \n \n You're misrepresenting science and evolution: neither says there is no God. What you are claiming is that science follows ONTOLOGICAL naturalism, which is false. As I pointed out in my first post, science follows METHODOLOGICAL naturalism.\n\n \n Your position in this debate is \"purely naturalistic means\" - without God. \"Special creation\" is mine - with God. A typical \"man from chimp\" vs. \"created by God\" debate. There is no middle ground. Your \"neither says there is no God\" statement is false. \n \n An origin of humans debate is much like a court case, with the origin of the first human like a crime scene. It's impossible to go back in time and actually see what happened, so there's no 100% sure determination. Both positions start with a presupposition (naturalistic vs. creation) the same way opposing lawyers do (guilt vs. innocence) So both our positions are going to present evidence much like lawyers in a courtroom. Evidence can be good or bad, (often determined by the credibility of it's source) or evidence can be swept under the rug if it doesn't suit the side that's presenting it. You did it here;\n \n \n \nActually, matter can be both created and destroyed: it is mass-energy that can't be.\n\n \n This is the first law of thermodynamics that you just swept under the rug.\n \n In court, the source of evidence is often very important. A witness is less likely to be considered a good source if he's lazy, unreliable, selfish, or has ties with one position or the other. A source would be much more credible if he was respected in the community, and had no ties with one position. The possible goals and motivations of each would be important considerations, in determining if their evidence was good or bad. \n \n All through recorded history, mankind has individually and collectively done some very stupid things that were very detrimental to his well being. Probably the most costly and historically significant stupid things man has done involve one man or small groups of men seeking power and money. There's no indication that it's going to stop anytime soon, and 21st century science isn't immune from it. Many of your sources come from publicly funded universities, and many of my sources come from the Bible, those who wrote it, and preserved it over the centuries. Like the court case, the possible goals and motivations of each are worth considering. One stresses truth, and behavior associated with truth, much more than the other. \n \n \n \n \nIn line with what you've just said, evolution is NOT about the creation of matter from nothing. It also is NOT about the origin of the laws of nature, NOR even about the origin of life itself. That's why your attempts to drag these extraneous matters into the debate about HUMAN ORIGINS are invalid.\n\n \n These \"extraneous matters\" are foundations for your \"multiple evidences\". Your multiple evidences are much like the details of the roof of a house. You give details about the ceiling, joists, rafters, & shingles, but you presuppose the existance of the walls & foundation. Your walls & foundation consist of many things, including amoeba, DNA, and the common ancestor that you believe humans share with chimps. You can't build a roof without walls & foundation to support it. That's why your multiple evidences for the origin of humans are invalid, without your faith in the presupposed building blocks. \n \n \n \n \n \nWe also see spontaneous increases in order. A few examples include stars forming from clouds of gas, liquids freezing, mixtures of non-polar and polar liquids separating into two distinct phases, and the abiotic synthesis of sugars and amino acids.\n\n \n ??? You're equating simple rearrangements, including liquids freezing, with spontaneous generation of life - purely naturalistic beliefs concerning macroevolution??? \n \n \n \n \nYou cannot provide any empirical evidence, or provide any logic convincing to an unbiased rational person, demonstrating that to be true.\n\n \n Neither can you for your position; empirical means \"based on observation\", and you haven't observed the common ancestor that you claim man shares with chimps, any more than I've observed creation. You have many human sources with these words and phrases that you faithfully accept; \"we have determined / we confirm / could be arranged / apparently contains / must have occured / etc. You also hear things from human sources that are obviously true. I see things in the Bible that I faithfully accept; Genesis 1:27, John 3:16 for example. I also see things in the Bible that are obviously true, such as; \"it is not good for man to be alone\" and \"to everything there is a season\" and \"man is born unto trouble\". Our faiths are comparable. \n \n \n \n \n \nYou have to first show that my evolutionary-origin-of-humans position is based on BLIND FAITH: which you simply can't do. But even if you could, then you'd still have to show that it takes AS MUCH blind faith to accept the evolutionary explanation as it does to believe your special creation account: you can't do that either.\n\n \n I'm doing both. Some empirical evidence for creation is the ever increasing doubt that new evidence casts on evolution. In Darwin's day for example, dozens of organs in the human body were thought to be useless leftovers of evolution. Today, science has found functions for virtually all of them. Obviously, there has been more scientific advancement from Darwin's time to today, than there has been from Biblical times to Darwin's time concerning the complexity of life and many other things. Creationists are often critisized for stubbornly clinging to their belief in spite of modern science, while evolutionists (Darwinists) are guilty of the same thing. \n \n The only way the man-from-chimp theory works is if humans originated hundreds of thousands, if not millions of years ago. Therefore evidence for creation is empirical if it logically indicates that humans have been on earth for only 6000 to 10,000 years. Archaeological finds that conform perfectly with the Biblical record;\n \n http://www.christiananswers.net/q-aiia/aiia-arch1.html\n \n and logical world population studies\n \n http://www.ldolphin.org/popul.html\n \n provide that evidence.\n \n \n \n \nDo you think simply saying something over and over makes it true?\n\n \n Each of my 3 quotes (now 4) were applied to different areas of our faiths. The first was the way we each don't address something that predates humans. The second concerned macroevolution vs. scripture, and the third was scientific theories vs. Genesis 1:27. The fourth showed comparisons between undisputed information, and \"faith\" information that we each get from our sources. Saying something over and over doesn't make it true. Proving it over and over is what makes it true. \n \n \n \n \n \nExcuse me, but I made no claim of having VERY LITTLE fossil evidence for macroevolution. There is, in fact, a MASSIVE amount of fossil evidence that supports \"one organism turning into another\". Look over these pages for a starter.\n\n \n The fossil record is like other evidence I described above. It's not studied from a neutral position, with few exceptions it's studied to arrive at a presupposed conclusion. I looked over those pages, now you can look over these pages;\n \n http://www.answersingenesis.org/creation/v4/i4/fossils.asp\n \n \nSome of the most devastating attacks on evolution by creationists have been associated with the fossil record.\n\n \n We each have faith in our source. There is no difference. \n \n \n \n \nand (2) point out that faith healing isn't part of the actual debate.\n\n \n Then why did you bring it up?\n \n \n \nNow, as far as why at least 6 shared pseudogenes point away from common design, that should be obvious. What non-ad hoc, valid reason could one give for a supernatural, intelligent designer purposely creating, separately, multiple organisms each with the very same non-functional parts? Gross stupidity and incompetence? The best you can probably come up with is intentional deceit, which would make your Creator God a great deceiver: like Lucifer.\n\n \n The same non valid reason that you give, believing mindless, lucky processes just happened to cause striking similarities between very distant species - species that your faith claims originated millions of years and thousands of miles apart. What it actually is, is compelling evidence of a common creator. \n \n \n \n \n4) The individual anatomical differences between humans and chimps are minor: mostly differences in the mere size, shape, or amount of shared structures (jaws, arms, backbone, hair, etc.). No major biological novelty separates the two.\n \n 5) And just as evolution would predict, chimps are our closest 'brain' relative too, having nearly identical brain structure, including several shared asymmetries\n \n \n a) The pictures at http://brainmuseum.org/Specimens/primates/chimp/brain/chimp6sect6.jpg show that the chimpanzee brain is a near anatomical twin of ours.\n \n b) There is an asymmetry in the planum temporale in both human and chimp brains.\n \n \n \n c) A further brain asymmetry is shared between humans and chimps: that of the hippocampus. Yet the nearby amygdala is symmetrical in both.\n \n \n \n d) Because of their neuroanatomy, most chimps, like humans, are right handed.\n \n \n \n \n 6) Chimps also have \"humanlike\" mental qualities, such as high intelligence, self-recognition, a sense of fairness - which is modulated according to social bonds - and a rudimentary form of apathy\n\n \n My sources say differently. \n \n http://www.answersingenesis.org/creation/v24/i3/humans.asp\n \n http://www.answersingenesis.org/creation/v19/i1/bird.asp\n \n You have faith in your sources, and I have faith in mine. It's been consistant throughout the debate.", 
   {
    "unicode_changes_made": true
   }, 
   170117, 
   null, 
   1129518720.0
  ], 
  [
   172134, 
   null, 
   "DamEtel", 
   "I have a question. According to the wording of the debate-starting post in this thread, we each have one week to reply to our opponent's post.\n \n \nbillsco: Both contestants will have one week to post a response. The deadline for each is midnight Sunday. \n\n \n But that's not what was actually agreed to. Here's the original timeline that we agreed to.\n \n \nDamEtel:\n \n \n ********************************\n marc9000: How about if I break it down to two choices, and DamEtel can pick whichever one he wants;\n \n ...\n \n How about either this, or what we originally agreed to, one post per week each, with the 5/4 post structure? \n ********************************\n \n \n DamEtel: I prefer the latter. So I suggest we each get one week, with the posts being due by 11:59:59 pm on Sunday nights, according to this schedule:\n \n 9/11 - your first post\n 9/18 - my first post\n \n 9/25 - your second post\n 10/02 - my second post\n \n 10/09 - your third post\n 10/16 - my third post\n \n 10/23 - your fourth post\n 10/30 - my fourth/final post\n \n 11/06 - your fifth/final post\n (http://www.4forums.com/political/showthread.php?t=6295&page=2)\n \n\n \n \n It hadn't before, but now, the ambiguity raises a problem.\n \n marc9000 made his last post on Sunday 10/16/2005. So when is my next post due?\n \n a) one week from then (10/23/2005)\n \n or\n \n b) as originally scheduled (10/30/2005)\n \n \n Besides other reasons, here why it matters.\n \n Suppose that marc9000 made some terrible blunder in his 10/16/2005 post, like basing his entire argument on 2 + 2 = 5. Okay, I post tomorrow and destroy him because of his blunder. BUT, he turns around and points out that the originally agreed upon timeline says that his deadline doesn't expire until 10/23/2005, so he goes back and fixes his post. \n \n So without not knowing if he could do that, it is in my best interest to hold off posting as long as possible - until a point in time that he could NOT change his post regardless which method we are using. The problem is, if I do that, I risk missing the one-week-from-my-opponent's-last-post deadline! \n \n Suppose that, because of the ambiguity, I hold to make my last post until 10/24/2005, so that marc9000 can't change his post no matter which schedule we are using. Well, if it turns out we are following the schedule laid out in this thread - instead of the one we originally agreed to - then I would have missed my deadline.\n \n \n And the same things apply to marc9000's last post, if the ambiguity persists.\n \n \n \n So now that the ambiguity can actually make a different, we need clarification on this matter.", 
   {
    "unicode_changes_made": true
   }, 
   170117, 
   null, 
   1129694040.0
  ], 
  [
   172207, 
   null, 
   "billsco", 
   "It would appear from prior posting history that neither of you have any unusual internet access issues, thus it wouldn't blindside you that your opponent has responded earlier than his respective deadline. To date, both of you have been responsive to developments in the debate, so I see no reason why a less rigid time line couldn't nimbly be adopted.\n \n IMO, a proficient debater who formulates his arguments ahead of schedule shouldn't be expected to wait-for defensive reasons--until a Sunday night deadline to lay it out, and then further wait a week beyond that deadline for a response.\n \n This debate would be better served if it could be moved along faster, IMO. I am inclined to make your remaining post(s) due no later than one week from the time stamp of your opponent's last contribution. The question now arises, DamEtal, do you have enough time to prepare your final argument for posting by Sunday, Oct. 23?", 
   {
    "unicode_changes_made": true
   }, 
   172134, 
   null, 
   1129738380.0
  ], 
  [
   172250, 
   null, 
   "DamEtel", 
   "This debate would be better served if it could be moved along faster, IMO. I am inclined to make your remaining post(s) due no later than one week from the time stamp of your opponent's last contribution.\n\n \n Sounds good to me. Thanks.\n \n \nThe question now arises, DamEtal, do you have enough time to prepare your final argument for posting by Sunday, Oct. 23?\n\n \n Yes (because I and my ex swapped out a couple of weekends with our sons, I won't have them this coming weekend either, so will have the time I need to work up a final post).", 
   {
    "unicode_changes_made": true
   }, 
   172207, 
   null, 
   1129751220.0
  ], 
  [
   172283, 
   null, 
   "marc9000", 
   "It hadn't before, but now, the ambiguity raises a problem. \n\n \n The ambiguity was brought on by you. We were both posting according to the deadlines very well, untill you posted 5 days early - Tuesday the 11th instead of Sunday the 16th. I posted next on Sunday the 16th hoping we saved a week, though it didn't really matter to me. I see that's how it worked out, so that's fine. We each have one post left, I'll try to get my final one up 3 or 4 days after your final one.\n \n I would never go back and attempt to alter a previous post in a formal debate. emoticon_rolleyes I've done nothing to deserve an accusation of it.", 
   {
    "unicode_changes_made": true
   }, 
   172134, 
   null, 
   1129762800.0
  ], 
  [
   173136, 
   null, 
   "DamEtel", 
   "Why should I win the debate? For starters, because marc9000 shouldn't!\n \n \n 1) Throughout the debate marc9000 has disingenuously attempted to expand my side of the debate from the agreed upon topic - the origin of humans - to the origins of EVERYTHING! He tried to drag in the origin of matter, the origin of the laws of physics, the origin of life, the origin of amoeba, the origin of dinosaurs, and the origin of their DNA. None of these other origins appear in the 'resolved'. \n \n If marc9000 planned on debating all of these other extraneous things, he shouldn't have agreed to the 'resolved'.\n \n \n \n 2) Here marc9000 essentially stuffs words into my mouth.\n \n \nmarc9000: 4) From the universe's declining to our own personal experiences on Earth with rust, rot and decay everywhere we look, we see nature overwhelmingly bring things from order to disorder.\n \n **********************************\n DamEtel: We also see spontaneous increases in order. A few examples include stars forming from clouds of gas, liquids freezing, mixtures of non-polar and polar liquids separating into two distinct phases, and the abiotic synthesis of sugars and amino acids.\n **********************************\n \n marc9000: ??? You're equating simple rearrangements, including liquids freezing, with spontaneous generation of life - purely naturalistic beliefs concerning macroevolution???\n\n \n No I'm not. I didn't even mention the origin of life there. Further, I made it clear that I wouldn't be discussing that irrelevant topic.\n \n I merely pointed out that this tendency marc9000 mentioned has many exceptions. In fact, in most chemical reactions, it's not the change in entropy that determines whether or not the reaction is spontaneous.\n \n \n \n 3) more dishonesty by marc9000:\n \n \nmarc9000:\n \n ***********************************\n DamEtel: You're misrepresenting science and evolution: neither says there is no God.\n ***********************************\n \n marc9000: Your position in this debate is \"purely naturalistic means\" - without God. \"Special creation\" is mine - with God. A typical \"man from chimp\" vs. \"created by God\" debate. There is no middle ground. Your \"neither says there is no God\" statement is false. \n\n \n One can't go around mangling facts in order to make them conform to a debate! Facts are facts OUTSIDE of this debate, and merely bringing them into the debate does not change them.\n \n For example, the fact the carbon has 6 protons neither says God exists nor that God doesn't exist. But according to marc9000's \"logic\", merely mentioning the fact in this debate means that it MUST say EITHER God does or does not exist! How silly!\n \n The fact is, neither science nor evolution says there is no God. Don't listen to marc9000.\n \n \n \n 4) Another 'dirty little trick' marc9000 played. \n \n \nmarc9000: An origin of humans debate is much like a court case ... So both our positions are going to present evidence much like lawyers in a courtroom.\n\n \n Yes, this debate should have followed a courtroom metaphor, but it didn't. \n \n In a courtroom, all evidences presented by one side are able to be challenged by the opposing side. But marc9000 - quite disingenuously - didn't attempt to provide ANY evidence whatsoever for his position until AFTER my last chance to counter his evidences had passed!\n \n Why the sneaky move? Because marc9000 knew his bogus Creationist evidence couldn't stand up to scrutiny? Maybe, but what's really important here is his action: his less-than-honorable handling of his presentation of evidence.\n \n \n \n 5) marc9000's use of a strawman:\n \n \nmarc9000:\n \n **************************************\n DamEtel: Now, as far as why at least 6 shared pseudogenes point away from common design, that should be obvious. What non-ad hoc, valid reason could one give for a supernatural, intelligent designer purposely creating, separately, multiple organisms each with the very same non-functional parts? Gross stupidity and incompetence? The best you can probably come up with is intentional deceit, which would make your Creator God a great deceiver: like Lucifer.\n **************************************\n \n marc9000: The same non valid reason that you give, believing mindless, lucky processes just happened to cause striking similarities between very distant species - species that your faith claims originated millions of years and thousands of miles apart. (emphasis added to marc9000's statements) \n\n \n That's not at all what I've argued: in fact, it's essentially the exact opposite of my common-descent position. Hence, strawman.\n \n \n \n 6) marc9000 is arguing against science and evolution, and he clearly is ignorant about both. A few examples:\n \n a) His statement implying that reptiles don't have skin.\n \n b) His comparing reptilian scales to mammalian skin.\n \n c) His claim that science and evolution say there is no God.\n \n d) His inability to understand common descent (see just above).\n \n e) His ignorance of widely known physics...\n \n \nmarc9000: Evidence can be good or bad, (often determined by the credibility of it's source) or evidence can be swept under the rug if it doesn't suit the side that's presenting it. You did it here;\n \n ******************************\n marc9000: The absolute base of my personal belief is in one of the most profound statements I've ever seen in my life, and I saw it when I was in my early teens, in a public school science textbook. It read; matter cannot be created nor destroyed.\n \n DamEtel: Actually, matter can be both created and destroyed: it is mass-energy that can't be. \n ******************************\n \n marc9000: This is the first law of thermodynamics that you just swept under the rug.\n\n \n No, it is pair creation and mutual annihilation of matter/anti-matter that marc9000 has just swept under the rug! He's never heard of these things!?!?\n \n \n Marc9000 doesn't know squat about science or evolution; and therefore, nothing he said about them should be believed unless he fully supported it ... which he did not.\n \n \n \n 7) marc9000 provided no evidence!\n After marc9000 disingenuously waited until after my last chance to counter his evidences had passed, he finally tried to provide some evidence: but failed!\n \n \nmarc9000: Archaeological finds that conform perfectly with the Biblical record;\n \n http://www.christiananswers.net/q-aiia/aiia-arch1.html\n \n and logical world population studies\n \n http://www.ldolphin.org/popul.html\n \n provide that evidence.\n \n ...\n \n ... you can look over these pages;\n \n http://www.answersingenesis.org/cre.../i4/fossils.asp\n \n ...\n \n My sources say differently. \n \n http://www.answersingenesis.org/cre...4/i3/humans.asp\n \n \n http://www.answersingenesis.org/cre...v19/i1/bird.asp\n \n\n \n Links are not evidence! \n \n If marc9000 believes certain web pages have evidence supporting his position, it is HIS RESPONSIBILITY to spend HIS time and effort digging through 'HIS' haystacks to find HIS needles, and post them here. He didn't. So marc9000 actually provided NO evidence whatsoever for his position!\n \n In essence, all that marc9000's side of the debate amounted to was his repeated bogus claims of \"our faiths are comparable\". \n \n \n 8) Here's another reason marc9000 shouldn't win, and I should.\n \n \nmarc9000: So far you've shown nothing but microevolution. (adaption within a species) It is scientifically proven, and is accepted by Darwinists and Creationists alike.\n\n \n marc9000 conceded that the 'general mechanism' proposed by me for the origin of humans is indeed fact: accepted, objectively, by both \"Darwinists and Creationists alike\". As we know, acceptance of microevolution is not based on blind faith; it is based on material evidence and solid logic. \n \n On the other hand, marc9000 cannot show that his own 'general mechanism' - an alleged supernatural being - is indeed fact. Belief in his God is subjective and based on BLIND FAITH. \n \n \n And the closest thing to a testable prediction the Biblical account of God's creating humans makes is that we should be most closely related to ... DIRT! \n \n \n \n \n As far as why I should win based on my own arguments, because I supported my position throughout the debate with evidences ... multiple evidences, from multiple sources. \n \n 1) 96 to 99% genetic similarity between humans and chimps indicate common ancestry.\n \n 2) At least six non-functional pseudogenes shared by both chimps and humans crush the \"common design\" counterargument.\n \n 3) The head-to-head fusion of two \"chimp\" chromosomes to form one human chromosome\n \n 4) The individual anatomical differences between humans and chimps are minor: mostly differences in the mere size, shape, or amount of shared structures (jaws, arms, backbone, hair, etc.). No major biological novelty separates the two.\n \n 5) And just as evolution would predict, chimps are our closest 'brain' relative too, having nearly identical brain structure, including several shared asymmetries\n \n 6) Chimps also have \"humanlike\" mental qualities, such as high intelligence, self-recognition, a sense of fairness - which is modulated according to strength of social bonds - and a rudimentary form of apathy\n \n 7) The existence of numerous genuine hominid fossils \n \n These show that the evolutionary explanation of our origin is not merely extrapolation from microevolution.\n \n \n \n \nResolved: It takes as much blind faith to believe that the origin of humans occurred by purely naturalistic means as it does to believe that the origin of humans occurred through special creation.\n\n \n \n ... faith is a confident belief in the truth, value, or trustworthiness of a person, idea, or thing, with that belief not resting on logical or material evidence. \n\n \n According to the 'resolved', marc9000 has to first show that my evolutionary-origin-of-humans position is based on BLIND FAITH: which he simply CAN'T do. My position is based on EVIDENCE - MULTIPLE EVIDENCES - so does NOT quality as faith.\n \n But even if he somehow could show my position to be faith (he can't), then he'd still have to show that it takes AS MUCH blind faith to accept the evolutionary explanation as it does to believe in his special-creation-by-God account: he can't do that either. \n \n Marc9000 cannot possibly meet his burden of proof: I should prevail.", 
   {
    "unicode_changes_made": true
   }, 
   172134, 
   null, 
   1130021400.0
  ], 
  [
   173183, 
   null, 
   "billsco", 
   "DamEtal,\n \n According to my counts, you have exceeded your word limitation ~25 words.\n \n I will allow the post to stand, with the understanding that marc9000 may exceed his word count by like amount.\n \n Regards", 
   {}, 
   173136, 
   null, 
   1130030700.0
  ], 
  [
   173336, 
   null, 
   "DamEtel", 
   "billsco: DamEtal, According to my counts, you have exceeded your word limitation ~25 words.\n\n \n I did NOT go over the limit: my post is actually just UNDER the limit.\n \n Here's the part of the negotiations where the word-count calculations were discussed. It is from http://www.4forums.com/political/showthread.php?t=6295&page=1 and I've added emphasis to marc9000 words of acceptance.\n \n \nmarc9000: I think words would be easier to count. My questions are;\n \n Would single letters (a) and (I) be counted as words, or would words be two letters or more? Also, would words in links count as words used?\n\n \n \nDamEtel: What I did for my counts was:\n \n 1) copy the text of interest to the Windows clipboard\n 2) paste it into a blank MS Word document\n 3) highlight the entire contents of the document\n 4) select Tools/Word Count from the menu\n \n This gives a word count and a character count. ...\n \n If you have MS Word you can do this. If not, I am not sure how you would come up with your word/character counts. \n\n \n \nmarc9000: Okay, that works, I wasn't aware of that feature. Since we have that, my suggestion would be to use both 1000 words / 5000 characters,(not incl. spaces) whichever is LESSER. Example; If one of us made a post with 1000 words / 5010 characters, it would be okay. Or if the post was 1010 words with 5000 characters it would be okay as well. Agreed? Would the penalty for going over be a complete forfeit of the debate, or just a consideration for the judges?\n\n \n Now, if one follows the method outlined above - agreed to by both participants - s/he will find that the word count for my last post comes to only 994 words. That's 6 words UNDER the limit, NOT 25 words over.", 
   {
    "unicode_changes_made": true
   }, 
   173183, 
   null, 
   1130051940.0
  ], 
  [
   173356, 
   null, 
   "billsco", 
   "For word counts, I was using this site. I entered your text twice and got 1034 words, 6307 characters, then 1034 words and 6303 characters. I felt confident that the numbers were good, but they weren't. Sorry.\n \n I did a hand count and the number came in at 979, not including figures like \"1)\". \n \n Judges, please disregard my above post about word counts. I trust it's evident to marc9000 that his final submission should honor the agreed-upon word limits.\n \n Once again, my apologies to you for the snafu.", 
   {}, 
   173336, 
   null, 
   1130072220.0
  ], 
  [
   173819, 
   null, 
   "marc9000", 
   "To prove the resolution, I had to show a reasonable reversal of the common catch-phrase; \"religious faith vs. scientific fact\". I showed scientific faith in several ways - from the concise paragraph of the respected non creationist Richard Lewontin, to the motives that science can have to go beyond repeatable observations and accurate measurements. Science clearly has motives to bridge gaps with faith. My opponent had no refutations for these two major points.\n \n But my main method of proving the resolution has been to expose the gaps in the naturalistic origin of humans theory. The presuppositions / building blocks that lead up to the purely naturalistic origin of humans is relevant - they have to be there, they have to be in place for it to occur. There's no way to explain them with naturalistic laws as science currently understands them, that's the reason my opponent can't address them. To presuppose their happening by naturalistic \"chance\" suspends the laws of nature to a comparable degree that the book of Genesis suspends them. \n \n My opponent's \"multiple evidences\" were actually little more than one very narrow train of thought; the similarities of humans & chimpanzees. There are similarities between some other species as well; coyotes and wolves, moose and deer, fir and pine trees to name a few. They can be considered evidence for a common creator just as easily as they can be considered more proof of evolution by common ancestry. There are also striking similarities in distant species - distant in their characteristics as well as distances in their times and locations of existance. This suggests a common creator far more than it suggests anything else. When pointing this out in my previous post, my opponent called it a strawman argument. While it isn't directly related to the origin of humans, it's another piece of the puzzle. It's more logical to look at the entire picture - one planet / one environment with many different species occupying it at the same time, when addressing origins.\n \n \n5) And just as evolution would predict, chimps are our closest 'brain' relative too, having nearly identical brain structure, including several shared asymmetries\n \n 6) Chimps also have \"humanlike\" mental qualities, such as high intelligence, self-recognition, a sense of fairness - which is modulated according to strength of social bonds - and a rudimentary form of apathy \n\n \n This is an excellent example of how science is not the only source of truth. Clearly, man has always been masterful at finding ways for animals to do work for him. From elephants & oxen, to horses, mules & camels, to seeing eye dogs & guard dogs. It's only logical that if chimps had the brains that science can prove on paper, their capability of useful work would be obvious. With their ability to grasp objects, their use in manufacturing / assembly work would be widespread. It's not there because they're nothing more than animals - obviously comparable to other animals in countless ways. Decades of scientific desire and manupulation can't change it.\n \n My opponents evidence wasn't multiple. It was a thorough explanation of one plausible, but narrow theory, with few associated questions answered. I exposed the faith involved in the purely natural human origins theory in multiple ways, and I believe I proved the resolution.", 
   {
    "unicode_changes_made": true
   }, 
   172207, 
   null, 
   1130206440.0
  ], 
  [
   174384, 
   null, 
   "billsco", 
   "Thank you both.\n \n Now let's turn it over to the judges for their decisions.", 
   {}, 
   173819, 
   null, 
   1130331120.0
  ], 
  [
   174506, 
   null, 
   "Alan Ryan", 
   "Congratulations to both marc and DamEtel for providing a fascinating debate: it's not going to be easy to summarise their respective positions and make what I suppose must be a rather glib judgment on the merits of their intricate arguments. However, here goes:\n \n Marc has tried to argue that \"gaps\" in scientific knowledge, in general, are filled by \"faith\" and that evolution in particular requires \"blind faith\" at critical points in order to assert that human beings evolved by purely naturalistic mechanisms.\n \n But in my opinion, \"scientific beliefs\" should not be conceptualised as religious beliefs in any respect whatsoever. If there are gaps in scientific knowledge, they are not filled by faith: they remain gaps until evidences or data collected, analysed, and evaluated by scientific method are available to fill them. On the other hand, Religious Knowledge, if we can call it such, does not require verification by evidence of any kind. This is a crucial difference between scientific investigation and religious belief. \n \n Though we loosely refer to evolution as a \"theory\" - this does not mean it's only a conjecture, an educated guess, or a \"mere\" hypothesis. It is a comprehensive scientific understanding that has been achieved through the study of an immense amount of evidence with impartial rigour. Blind faith has no place in the achievement of a scientific understanding. Marc does not seem to have conceded this point.\n \n It's true that the scientific understanding miscalled \"the theory of evolution\" is not complete and flawless. There are many gaps in the fossil record for instance, and these are seized on and made much of by religious critics: but advances in molecular biology are filling those gaps by clinical endeavour and showing inexorably, in the analysis of DNA overlaps, how all living things are related and descended from a common ancestor. The time may soon be approaching when molecular biology will allow the fossil records to be declared redundant as evidences of evolution, or perhaps as Richard Dawkins surmises, fossils will be regarded as bonus data in this field of inquiry. (If I can ask a question here of any biologist who happens to read this \"critique\"; why can't we speak of the \"laws of evolution\" or perhaps refer to \"Darwin's Law\" - in the same way we do of Boyle's Law for instance) ?\n \n The question of how, under what precise physical conditions and through what chemical processes did the first self-replicating molecules begin the biological activity which has evolved the immense variety of living organisms (and the even greater number that are extinct), has not been answered by science: not yet. In principle, there is no reason why it should remain a mystery and the introduction of God (or a god) to explain what is not yet known by science always interpolates an unnecessary factor into any hypothesis about the material universe. To emphasise the point: even if it does remain uncertain how the origin of species (including human beings) resulted from a very ancient series of bio-chemical reactions, that does not oblige us to put God into the equation as the creative \"missing value\". The possibility of further evidence coming to light must always be admitted. \n \n DamEtel has provided a formidable amount of objective evidence in support of his counter argument. His mastery of the material that must be thoroughly studied in order to acquire that scientific understanding to which I've already referred, shows scholarship and the ability to communicate the essentials of the current Darwinian synthesis. I would say that by logical argument he has shown there is no scientific \"faith\" which must be invoked in order to fill a gap in scientific knowledge, to demonstrate a truth about evolutionary mechanisms or about the origin of life, or indeed about any aspect of the natural world. He has shown that no recourse to subjectivity is used as sticking plaster to cover gaps in the knowledge base that supports evolution. \n \n With an apology then for the inadequacies of this arbitration, I judge that Marc has not shown that it takes as much blind faith to believe that the origin of humans occurred by purely natural means as it does to believe that the origin of humans occurred through special creation, so I declare DamEtel the winner of this debate.", 
   {}, 
   174384, 
   null, 
   1130349600.0
  ], 
  [
   175218, 
   null, 
   "Symbiote", 
   "General comments: \n I am judging this debate on the understanding that it will not be by the usual criteria, asking the affirmative to \"prove\" or \"show\" that their argument is true, while the negative merely has to leave the answer in doubt. Instead it will by the quality of debate in general, with consideration given to the negative for the smaller number of posts they were allowed.\n \n The meta-debate going on sometimes is counterproductive, if comments about word count, allegations of opponents doing things against the rules, questions about posting deadlines etc could perhaps be kept out of the thread, placed in a separate one if neccessary, that would be good. The debate should not contain a discussion of the debate.\n \n Extensive quoting of one's opponent is also messy and disrupts the flow of an argument. A point by point rebuttal is probably inferior to a piece of writing in which you express your own views at length.\n \n Marc9000, I thought the position you opened with, about the \"methodological naturalism\" of science, was quite strong. This could have probably been pushed a lot further, arguing for example that the choice whether to except a natural or non-natural explanation for any event, like the origin of humans, is ultimately an act of faith. \n \n Unfortunately you drifted off from this onto arguing about the particular physical evidence for \"macroevolution\", the fossil record and scales to skin arguments, where you were weaker. Standard creationist arguments like \"order to disorder\", that we have all seen, and all seen refuted before, did you no favours either.\n \n DamEtel. On questions of physical evidence for evolution you were flawless, and as a result dominated the later part of the debate. You largely did not address the more philosophical issues raised in Marc9000's initial post, arguing they were outside the scope of the debate. Although I would disagree on this point, this was apparently effective in causing your opponent to avoid further argumentation on the matter.\n \n On balance I must award the debate to DamEtel, based on his strength in the scientific arguments taking place for much of the debate.", 
   {}, 
   174506, 
   null, 
   1130559600.0
  ], 
  [
   175278, 
   null, 
   "marc9000", 
   "Hmmm, wonder if I could get a dinner date with Harriet Miers - we could get drunk & talk about our FAILURES! emoticon_cry \n \n Seriously, congratulations to Dametel. Thanks to the moderator for making him sweat more than I did!\n \n Again, I hope more here will try formal debates. They are fun to participate in, and fun to watch!\n \n Marc", 
   {}, 
   172207, 
   null, 
   1130587080.0
  ], 
  [
   175293, 
   null, 
   "billsco", 
   "Marc9000, I think we all appreciate seeing graciousness in defeat. I'm reminded of a message you sent me before the debate was on (I hope you don't mind me sharing) where you said it's worth it to risk losing a formal debate just to be able to say what's on your mind. I suppose you realized the uphill battle you faced--it was a difficult resolution to affirm--but I believe you can be proud of the effort you made.\n \n I'll leave this thread open in case Lord Tammerlain wishes to weigh in. I hope he does, but if he prefers to keep his decision private, that's his perogative.\n \n Those of you who wish to comment on this debate can do so here.\n \n Thanks to all involved.", 
   {}, 
   175278, 
   null, 
   1130594640.0
  ], 
  [
   175367, 
   null, 
   "lord tammerlain", 
   "I would have to agree with the other judges in this case.\n \n marc9000 started off well, showing that science in itself is not perfect in its current explanation for the beginning of human life. As the debate moved on the focus of the debate shifted towards Dametel favor as his obviously strong background in genetics and evolution started to dominate marc9000's responses.\n \n \n Overall the marc9000 failed to provide an overall convincing arguenment that it takes as much blind faith to believe that the origin of humans occurred by purely naturalistic means as it does to believe that the origin of humans occurred through special creation. Dametel had more supporting facts about science and evolution that \"blind faith\" in human evolution was going to be hard to ignore.\n \n Moving the debate towards the existance of God was not a as Dametel mentioned a strong arguement as evolution does not discredit God, just creationism.\n \n Overall Dametel certainly is the winner in my opinion. Congrates though to marc9000 for a good fight.", 
   {}, 
   175293, 
   null, 
   1130614080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Marc9000 vs DamEtel--Blind Faith", 
  "url": "http://www.4forums.com/political/debate-tournaments/6348-marc9000-vs-dametel-blind-faith.html", 
  "breadcrumbs": [
   "Debate Tournaments"
  ], 
  "id_number": 6348, 
  "discussion_files": [
   [
    "20116.html", 
    "http://www.4forums.com/political/debate-tournaments/6348-marc9000-vs-dametel-blind-faith-print.html"
   ], 
   [
    "20117.html", 
    "http://www.4forums.com/political/debate-tournaments/6348-marc9000-vs-dametel-blind-faith-2-print.html"
   ]
  ], 
  "identifier": 6348
 }
]