[
 [
  [
   159331, 
   null, 
   "georged", 
   "While cost estimates for rebuilding, subsidization of victims, loss of revenue, inflation of national commodity prices (fuel, food and construction supplies) and other factors are still in the crystal ball stage, the question of who will pay for what comes to mind. \n \n That two of the involved states, Louisiana and Mississippi, face probable short-term insolvency is inevitable. Both receive a substantial percentage of state tax revenues from destroyed gaming and oil based industries without consideration of flow-through tax revenue from businesses servicing those industries. Both have histories of poor economic performance and deep-seated political corruption, not what it takes to enable bond issues to solve their current dilemma, though interest rates could become interesting if a federal disaster bond guarantee was enacted. \n \n Federal costs, infrastructure, is already in Halliburton hands, which suggests that expense will be abnormal to say the least. How much is the question. The US government is running at about 5% deficit based on GDP and currently flooding the market with treasury issues, debt, just to make cash flow. \n \n With the military financial drain of Afghanistan/Iraq, consequent state revenue sharing of federal revenue drying up and waning consumer confidence, how will current administration face this new, very ominous financial challenge?", 
   {
    "post_info": {
     "post_title": "Katrina"
    }
   }, 
   null, 
   null, 
   1125852660.0
  ], 
  [
   159333, 
   null, 
   "Alan Ryan", 
   "While cost estimates for rebuilding, subsidization of victims, loss of revenue, inflation of national commodity prices (fuel, food and construction supplies) and other factors are still in the crystal ball stage, the question of who will pay for what comes to mind. \n \n That two of the involved states, Louisiana and Mississippi, face probable short-term insolvency is inevitable. Both receive a substantial percentage of state tax revenues from destroyed gaming and oil based industries without consideration of flow-through tax revenue from businesses servicing those industries. Both have histories of poor economic performance and deep-seated political corruption, not what it takes to enable bond issues to solve their current dilemma, though interest rates could become interesting if a federal disaster bond guarantee was enacted. \n \n Federal costs, infrastructure, is already in Halliburton hands, which suggests that expense will be abnormal to say the least. How much is the question. The US government is running at about 5% deficit based on GDP and currently flooding the market with treasury issues, debt, just to make cash flow. \n \n With the military financial drain of Afghanistan/Iraq, consequent state revenue sharing of federal revenue drying up and waning consumer confidence, how will current administration face this new, very ominous financial challenge?\n\n \n I know this will sound like levity, but perhaps they'll just print more money and float the problem in an inflationary bubble.\n \n Recent threads have debated the very precarious condition of the US economy prior to Katrina: will the costs of reconstructing New Orleans and repairing damage in an area as big as Britain prove to be the proverbial \"last straw\" ?", 
   {}, 
   159331, 
   null, 
   1125853320.0
  ], 
  [
   159334, 
   null, 
   "lord tammerlain", 
   "Tax cuts of course, and faith based reconstrution.\n \n \n Seriously though, I doubt reconstruction will be rapid or done very well. With only 25% of the reconstruction costs estimated to be covered by private insurance, the shear amount of destruction their will be places that will not be rebuilt for years if ever.\n \n NO I bet will be 2/3 rds the size it is now population wise as many people will not be able to afford to move back", 
   {}, 
   159331, 
   null, 
   1125853440.0
  ], 
  [
   159336, 
   null, 
   "Symbiote", 
   "Ironically Katrina may at least partially stave off or smooth out the collapse of the housing market, through increased demand for housing, whether in terms of relocation or reconstruction. And there'll certainly be more people willing to borrow money to build now than there were previously. Katrina's almost as good an economic stimulus package as a war somewhere, only problem is all the stuff that got destroyed.\n \n I doubt for this reason that Katrina will precipitate an immediate collapse, the dissaving it encourages, borrowing money or bringing it out of savings to consume in the present to a degree counteracts the short-term negative effects, at the cost of longer term growth and the ability to deal with any future problems.\n \n So Katrina IMO makes the US less able to deal with solvency issues when they do arise, and may bring the day of reckoning forward, and will certainly result in a reduced standard of living for many, right now isn't the last of the straws.", 
   {}, 
   159334, 
   null, 
   1125853740.0
  ], 
  [
   159339, 
   null, 
   "lord tammerlain", 
   "A few problems though include the already high level of consumer debt, that many people will have had their jobs \"dissappear\" because of the damage, the economic disruption in the other parts of the US from the high prices for gasoline to possible short term shortages.\n \n If this occured say 20 years ago, like the massive flooding caused by the Miss. River I would not be very concerned about the US economy. In my opinion the US is starting to lack the overall reserves that are required to deal with problems such as this.", 
   {}, 
   159336, 
   null, 
   1125854340.0
  ], 
  [
   159342, 
   null, 
   "georged", 
   "Tax cuts of course, and faith based reconstrution.\n \n \n Seriously though, I doubt reconstruction will be rapid or done very well. With only 25% of the reconstruction costs estimated to be covered by private insurance, the shear amount of destruction their will be places that will not be rebuilt for years if ever.\n \n NO I bet will be 2/3 rds the size it is now population wise as many people will not be able to afford to move back\n\n \n One of my main points of interest is what conditions insurers will place on future coverage, that 25% number being primarily commerical coverage, few private parties being able to afford flood insurance. Force 5 hurricane levee \n resistance is almost a given and that'll be a federal cost. \n \n If 2/3 rds return I'll be surprised. The US public, lower and middle classes, has no savings and most are maxed out on credit. Neither state is in a financial position to offer much assistance. The burden on surrounding areas will quickly turn from compassion to resentment.", 
   {}, 
   159334, 
   null, 
   1125854760.0
  ], 
  [
   159349, 
   null, 
   "georged", 
   "\n I doubt for this reason that Katrina will precipitate an immediate collapse, the dissaving it encourages, borrowing money or bringing it out of savings to consume in the present to a degree counteracts the short-term negative effects, at the cost of longer term growth and the ability to deal with any future problems.\n \n So Katrina IMO makes the US less able to deal with solvency issues when they do arise, and may bring the day of reckoning forward, and will certainly result in a reduced standard of living for many, right now isn't the last of the straws.\n\n \n As posted, the general American public has no savings, is maxed out on credit and neither state has deep pockets. I agree all efforts in the immensity of reconstruction, private and public, will severely limit future ability to cope with similar occurances and this year's hurricane season is just half over. That has to be in the minds of planners looking at funding availability and application. \n \n The US economy is far too large to collapse with regional difficulties, but if food and construction commodity prices rise to a point of national concern due to transportation issues, as has gasoline, consumer confidence may well be endangered and that's the turning point of US economic well-being.", 
   {}, 
   159336, 
   null, 
   1125855600.0
  ], 
  [
   159352, 
   null, 
   "georged", 
   "I know this will sound like levity, but perhaps they'll just print more money and float the problem in an inflationary bubble.\n \n Recent threads have debated the very precarious condition of the US economy prior to Katrina: will the costs of reconstructing New Orleans and repairing damage in an area as big as Britain prove to be the proverbial \"last straw\" ?\n\n \n Levity regarding US fiscal health is the sole remaining emotional outlet. Printing more money will require increased interest rates, placing additional burden on our only healthy industry, housing construction. To say nothing of vehicle industry sales and our financed trade imbalance. Not many favorable options on this scenario.", 
   {}, 
   159333, 
   null, 
   1125856020.0
  ], 
  [
   159361, 
   null, 
   "gamehuis", 
   "The Fed will print more money like it always does, issue more bonds and monetize their own debt through their accounts at Caribbean Banking Centers (notice how the holdings at Caribbean banking centers suddenly jump 50% between January and March and as such conveniently boost the dollar in that period):\n \n http://www.treas.gov/tic/mfh.txt\n \n If you can't print money officially because it will need a boost in interest rates to compensate, you can always do it unofficially.\n \n Aah, the beauty of fiat money, there's always more when you need it.", 
   {}, 
   159352, 
   null, 
   1125858000.0
  ], 
  [
   159367, 
   null, 
   "georged", 
   "The Fed will print more money like it always does, issue more bonds and monetize their own debt through their accounts at Caribbean Banking Centers (notice how the holdings at Caribbean banking centers suddenly jump 50% between January and March and as such conveniently boost the dollar in that period):\n \n http://www.treas.gov/tic/mfh.txt\n \n If you can't print money officially because it will need a boost in interest rates to compensate, you can always do it unofficially.\n \n Aah, the beauty of fiat money, there's always more when you need it.\n\n \n I haven't looked at that in a long time. I wonder if UK citizens are aware of how good a friend to the US Blair's government actually is. That's 8% of their GDP, 40% of that in six months! Asia's slowdown in buying our debt had to come from somewhere.", 
   {}, 
   159361, 
   null, 
   1125859260.0
  ], 
  [
   172549, 
   null, 
   "Tastyfish", 
   "\n http://www.treas.gov/tic/mfh.txt\n \n If you can't print money officially because it will need a boost in interest rates to compensate, you can always do it unofficially.\n \n\n Whatever happened to the saying 'Money doesn't grow on treas'?", 
   {}, 
   159361, 
   null, 
   1129838640.0
  ], 
  [
   172637, 
   null, 
   "daewoo", 
   "One of my main points of interest is what conditions insurers will place on future coverage, that 25% number being primarily commerical coverage, few private parties being able to afford flood insurance. Force 5 hurricane levee \n resistance is almost a given and that'll be a federal cost. \n \n If 2/3 rds return I'll be surprised. The US public, lower and middle classes, has no savings and most are maxed out on credit. Neither state is in a financial position to offer much assistance. The burden on surrounding areas will quickly turn from compassion to resentment.\n\n \n Flood insurance in New orleans was heavily subsidized by fema. Flo9od insurace, including flooding caused by hurricanes, could be had on a $100K house for less than $100 per month. People did not buy it, though, nor were they encouraged to buy it by local public figures, becuyae they hsave alwyas been told that they did not need it, the federal government woul dpaty to rebuild regardless.\n \n So, we have passed billions to the insurance ocmpnaies over the years so these XXXXXX could have flood insurance, and since they did not take advantage of it, we are expected to spend billions more rebuilding thier homes. Something is wrong here.\n \n As far as the rest, I think that inflaitng the problem away is looking more and more likely, as sad as that is (and as much of a short term fix). Inflating the problem away will solve the problem of the housing bubble without consumers noticing a big correction as well. Granted, if we do adopt a policy of inflating away debt problems, we can kiss goodbye to foreign investment in our bond issues, but right now I think the Bush administration is primarily concered with not being rememebrted by history as the administration that crashed America. When you consider war cost, Katrina costs, energy costs, inflationary pressures depsite increased interest rates, and an apparent continuing downward swing in consumer confidence (which is the sole support on which th ehousing bubble rests), it is not inconcivable that America could see a DRASTIC downward turn, an \"end of life as we know it\" turn, before the end of the Bush administration. \n \n While this is soethign that has been decades in the making, whoever is president when it finally strikes will almost certinaly end up holding the bag. Bush certainly doe snto want this, especially after several years of rediculously loose fiscal policy.\n \n I think what the decision comes down to is how long they can hold onto the crumbling consumer confidence, and that boils down to how good a snow job they can do an the American public. 50 years ago, I don;t think there would be much hope. today, I am not sure, especially since there are many folks out there willing to do their part to keep the charade going. The problem is that since our economy is primarily service based, it is incredibly succeptible to changes in consumer confidence. That, coupled with equity markets, also primarily based on consumer confidence, and our real estate markets, not only built on consumer confidence but the backing for much of the debt in this country, and it is just an ugly situation.\n \n On the postivie side, at least for the short term, is the fact that you have a LOT of folks working very hard to maintain the illusion. Lending agencies, who are holding billions in notes which essentially become worthelss and unsecured should the housing bubble break, are more than willing to do their part. The government, which in most areas derives substantial income from personal property taxes, is more than willing to do its part. And the american public, being the imbeciles that they are, tend to put faith in people like real estate brokers and agents, people who derive their livelyhoods from a healthy real estate market, for advice regarding such things. What a bunch of XXXXXX.\n \n So, i think inflating the problem away is certainly an option if you view the situation as essentially a game of political hot potato. Nobody want to be stuck when the music stops, and tey will do whatever they have to in order to ensure that does not happen. If the bush administartion can buy a few years by inflation, they will do it. Anybody with half a brain has, or will be able to, adjust their investmetn startegy to ride it out, and most likely come out wealthier for their troubles.", 
   {}, 
   159342, 
   null, 
   1129865820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Katrina", 
  "url": "http://www.4forums.com/political/policy-ideas/6350-katrina.html", 
  "breadcrumbs": [
   "Policy Ideas"
  ], 
  "id_number": 6350, 
  "discussion_files": [
   [
    "27678.html", 
    "http://www.4forums.com/political/policy-ideas/6350-katrina-print.html"
   ]
  ], 
  "identifier": 6350
 }
]