[
 [
  [
   8564, 
   null, 
   "Stormin Norman", 
   "Genetically modifying foods and animals has been going on since the birth of civilization. Some would say that is the hallmark of an advanced society, such as the Sumarians, the Egyptians, and the Mayans. Prior to the invention of genetic engineering, we had to use selective breeding techniques to genetically modify life forms like dogs, horses, and crops. To do this one must find which breeds do well under certain conditions and then hybridize those groups, or selectively breed those groups that are successful under certain conditions. This method is often time-consuming, as it relies on the process of eliminative induction.\n \n Now that we have understanding of the gene sequence, and have techniques that will allow us to manipulate genes through gene splicing, we can bypass some of the experimental methods that have enormous research and development costs associated with them. If we know what conditions are to exist and what part of the genome will dictate a desired result, we can employ genetic engineering directly and optimize the performance of the product of interest, thereby increasing quality and quantity. Of course, the economic implications of this technology are tremendous, as we can eliminate some of the variables that result in losses.\n \n A hallmark of the scientific experiment is the ability to control the environment. This issue of genetic engineering raises the age-old question of observation vs. experimentation. The experiment is, by definition, pro-active, as it requires control over nature, whereas, the observation is done by spectators of the natural world. Selective breeding lacks the kind of control necessary for it to be dubbed a pure experimental science, whereas, genetic engineering is highly experimental as independent variables can be controlled for by creating the genetic code necessary for optimum output in the dependent variable.", 
   {
    "post_info": {
     "post_title": "Genetic Engineering - a Wonderful Tool"
    }
   }, 
   null, 
   null, 
   1054290600.0
  ], 
  [
   8618, 
   null, 
   "Pikeman85", 
   "I actually agree completely with Stormin here. Genetic enigeering can be a very useful tool, and should be used accordingly. I wrote a paper on what I called \"Facilitated evolution\" a couple years ago.", 
   {}, 
   8564, 
   null, 
   1054362300.0
  ], 
  [
   8664, 
   null, 
   "DarKnight", 
   "Again, I've got to agree as well.\n Allthe great and wonderfull things on this planet are either the result of natural genetics or technology. Technology is the result of human inovation and all that seperates humans from anything else is genetic. Okay maybe its hard to believe but genetic engineering will probably be THE greatest technology of ALL TIME. Sure it has it's fair share of bugs (understatement) but it's only a matter of time before people will get over it the same way they got over the round-earth or the no-god theories of today.\n \n On a less philisophical note, imagine a world free of disease. Imagine a world free of hunger; Or even a world free of crime and strife with and international team of crimefighting super-people. Imagine a world with near perfect order with super-politicans and law-keepers. \n \n More specifically: Long-term exposure to a zero-grav environment has significant effects on EVERY system in the human body (mostly adverse); are gene-engineered astronaughtsthe perfect solution?\n \n Gene-engineering has the potential to change EVERYTHING.", 
   {}, 
   8564, 
   null, 
   1054507920.0
  ], 
  [
   8716, 
   null, 
   "ufthak", 
   "No argument here. Genetic engineering is the only solution to numerous medical problems. Modern medicine can treat quite a few genetic diseases, but they sure as hell can't cure them yet. I think the biggest use though in the near future is in the area of xenotransplantation.", 
   {}, 
   8564, 
   null, 
   1054587960.0
  ], 
  [
   8726, 
   null, 
   "Pikeman85", 
   "I'd say nanotech is more apt to be the final \"cure-all\" as it cures property ills, and many other sorts as well.\n \n Genetic editation will allow less use of continual nanomachines however, so it is very good.", 
   {}, 
   8564, 
   null, 
   1054600440.0
  ], 
  [
   8766, 
   null, 
   "DarKnight", 
   "Why use nanomachines when you could use a geneticaly engineered viruses? or a seriously \"edited\" immune system?\n Just think, with gene-engineering we won't even need nanomachines.", 
   {}, 
   8564, 
   null, 
   1054632600.0
  ], 
  [
   9566, 
   null, 
   "Pikeman85", 
   "a genetically editted virus WOULD technically be a nanomachine.\n \n You are made of nanomachines ;)", 
   {}, 
   8564, 
   null, 
   1055473380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Genetic Engineering - a Wonderful Tool", 
  "url": "http://www.4forums.com/political/science-math-debates/636-genetic-engineering-wonderful-tool.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 636, 
  "discussion_files": [
   [
    "23505.html", 
    "http://www.4forums.com/political/science-math-debates/636-genetic-engineering-wonderful-tool-print.html"
   ]
  ], 
  "identifier": 636
 }
]