[
 [
  [
   159906, 
   null, 
   "jyoshu", 
   "\"Americans are broadly critical of government preparedness in the Hurricane Katrina disaster - but far fewer take George W. Bush personally to task for the problems, and public anger about the response is less widespread than some critics suggest.\"\n \n http://abcnews.go.com/US/HurricaneKatrina/story?id=1094262&page=1\n \n Once again, Americans show they are mostly reasonable people, who aren't going to make a witch hunt out of this. To me, that's encouraging.", 
   {
    "post_info": {
     "post_title": "Poll Results; America not blaming Bush over Katrina relief"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1125976860.0
  ], 
  [
   159959, 
   null, 
   "GreenMtnBoy", 
   "and public anger about the response is less widespread than some critics suggest.\"\n\n \n Shows the attitude that made the response slow to begin with.", 
   {}, 
   159906, 
   null, 
   1125999000.0
  ], 
  [
   159979, 
   null, 
   "daewoo", 
   "Shows the attitude that made the response slow to begin with.\n\n \n \n True enough. PErsonally, I think it is too bad it took so long. I don't really care, though. Not my problem.", 
   {}, 
   159959, 
   null, 
   1126018440.0
  ], 
  [
   159983, 
   null, 
   "georged", 
   "True enough. PErsonally, I think it is too bad it took so long. I don't really care, though. Not my problem.\n\n \n It will be. Politicians are going to play public emotion on this one to the tune of an ocean of federal money for special interests. There's already talk of fed subsidized refineries, federal funds will pay for most all infrastructure repairs, victim subsidation, housing, expanded SBA participation and every gimme in the book. They're going to use New Orleans to drive GDP through public debt, just as with Iraq.", 
   {}, 
   159979, 
   null, 
   1126019340.0
  ], 
  [
   159991, 
   null, 
   "daewoo", 
   "It will be. Politicians are going to play public emotion on this one to the tune of an ocean of federal money for special interests. There's already talk of fed subsidized refineries, federal funds will pay for most all infrastructure repairs, victim subsidation, housing, expanded SBA participation and every gimme in the book. They're going to use New Orleans to drive GDP through public debt, just as with Iraq.\n\n \n Now that I care about. How long it took the aid to arrive matters little to me. 1000 more or less dead people make little difference in the long run. \n \n Just think, since we essentially HAVE to go to war with Iran to stop their Euro based oil market, this could be the biggest paper profit year EVER for the US!!! Like last year, when you subtract debt service and deficit spending, you will end up with a negative GDP, But the American public has proven time and again that they are simply not bright enough to figure out this trick.", 
   {}, 
   159983, 
   null, 
   1126020360.0
  ], 
  [
   160000, 
   null, 
   "georged", 
   " But the American public has proven time and again that they are simply not bright enough to figure out this trick.\n\n \n Politicians have a bag so full of tricks that, like small children, refocusing the public has become a simple matter of using the right combination of soothing words. When people defend gross public mismanagement such as lack of response to the disaster in New Orleans while applauding confiscation of nail clippers at airports, it doesn't take a lot of brain cells to understand they have a desperate need to believe whatever they're told.", 
   {}, 
   159991, 
   null, 
   1126021920.0
  ], 
  [
   160010, 
   null, 
   "Wez", 
   "\"Other evaluations are divided. Forty-six percent of Americans approve of Bush's handling of the crisis, while 47 percent disapprove.\"\n \n They're certainly not happy with Bush though.\n \n -Wez", 
   {}, 
   160000, 
   null, 
   1126028340.0
  ], 
  [
   160021, 
   null, 
   "georged", 
   "\"Other evaluations are divided. Forty-six percent of Americans approve of Bush's handling of the crisis, while 47 percent disapprove.\"\n \n They're certainly not happy with Bush though.\n \n -Wez\n\n \n Two gulf failures don't make a right?", 
   {}, 
   160010, 
   null, 
   1126030200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Poll Results; America not blaming Bush over Katrina relief", 
  "url": "http://www.4forums.com/political/politics-debates/6363-poll-results-america-not-blaming-bush-over-katrina-relief.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 6363, 
  "discussion_files": [
   [
    "33043.html", 
    "http://www.4forums.com/political/politics-debates/6363-poll-results-america-not-blaming-bush-over-katrina-relief-print.html"
   ]
  ], 
  "identifier": 6363
 }
]