[
 [
  [
   160404, 
   null, 
   "jyoshu", 
   "\"Let's take a break from the joy of Bush bashing to reveal the dirty little secret of New Orleans: Its local government deserves an F for its planning and response to Katrina. And one other thing: The New Orleans police force would be a joke if it weren't a disgrace.\n Yes, I know it's impolitic to say such things while the suffering in the Big Easy is fresh and many cops risked their lives to save others. But now is the time to blow the whistle on the story line being repeated by rote across America: That the federal government ignored New Orleans because most of its residents are black and poor.\n \n That narrative has all the accuracy of a historic novel: it takes two undisputed facts - the feds were slow and New Orleans is largely black and poor - and weaves in pure fiction to make the desired link.\"\n http://www.nydailynews.com/front/v-pfriendly/story/344065p-293598c.html", 
   {
    "post_info": {
     "post_title": "Michael Goodwin: Don't Blame Only the Feds"
    }
   }, 
   null, 
   null, 
   1126118160.0
  ], 
  [
   160411, 
   null, 
   "gnojek", 
   "http://www.cnn.com/2005/POLITICS/09/07/katrina.congress/index.html\n \n House cancels hearings; joint panel to look at Katrina response\n \n \n http://www.xymphora.blogspot.com/\n \n http://matewan.squarespace.com/journal/2005/9/6/war-on-the-poor-in-new-orleans-2-the-attempt-to-declare-martial-law.html\n \n\n OK, let's get this straight: Michael Brown is most likely an incompetent stooge but the fact of the matter is that when he refused to release supplies, National Guard troops, and construction equipment, and then ordered the Superdome locked and checkpoints set up along the roads leading out of New Orleans to turn back anyone trying to escape the destruction, he was following orders. None of it was accidental, none of it was a matter of poor decision-making or the wrong priorities. It was a deliberate attempt by the Bush Administration to blackmail the state of Louisiana into handing the city over to the Federal government.\n\n \n http://www.sltrib.com/utah/ci_3004197\n \n \nFrustrated: Fire crews to hand out fliers for FEMA\n Many of the firefighters, assembled from Utah and throughout the United States by the Federal Emergency Management Agency, thought they were going to be deployed as emergency workers.\n Instead, they have learned they are going to be community-relations officers for FEMA, shuffled throughout the Gulf Coast region to disseminate fliers and a phone number: 1-800-621-FEMA.\n On Monday, some firefighters stuck in the staging area at the Sheraton peeled off their FEMA-issued shirts and stuffed them in backpacks, saying they refuse to represent the federal agency. \n\n \n http://www.nypost.com/news/nationalnews/53110.htm\n \n FEMA FOOL SAT ON HIS HANDS\n \n http://www.boingboing.net/images/bushguitGREAT.jpg\n \n http://www.washingtonpost.com/wp-dyn/content/article/2005/09/03/AR2005090301680.html\n \n \nWhite House Shifts Blame to State and Local Officials\n \n Behind the scenes, a power struggle emerged, as federal officials tried to wrest authority from Louisiana Gov. Kathleen Babineaux Blanco (D). Shortly before midnight Friday, the Bush administration sent her a proposed legal memorandum asking her to request a federal takeover of the evacuation of New Orleans, a source within the state's emergency operations center said Saturday.\n \n The administration sought unified control over all local police and state National Guard units reporting to the governor. Louisiana officials rejected the request after talks throughout the night, concerned that such a move would be comparable to a federal declaration of martial law. Some officials in the state suspected a political motive behind the request. \"Quite frankly, if they'd been able to pull off taking it away from the locals, they then could have blamed everything on the locals,\" said the source, who does not have the authority to speak publicly.\n\n \n\n A senior administration official said that Bush has clear legal authority to federalize National Guard units to quell civil disturbances under the Insurrection Act and will continue to try to unify the chains of command that are split among the president, the Louisiana governor and the New Orleans mayor.\n\n There was no INSURECTION!!!!\n \n\n As of Saturday, Blanco still had not declared a state of emergency, the senior Bush official said.\n\n It was declared 3 days before the storm hit!!!!\n \n\n Bush, who has been criticized, even by supporters, for the delayed response to the disaster, used his weekly radio address to put responsibility for the failure on lower levels of government.\n\n \n \n \n \n \n Declaring martial law would give the Federal government total control of the city: the Army would be brought in to police it and - perhaps most important to this corporate president - the Federal government would have charge of all the rebuilding contracts, giving it $$$billions$$$ to hand out to its corporate sponsors.", 
   {
    "unicode_changes_made": true
   }, 
   160404, 
   null, 
   1126119360.0
  ], 
  [
   160419, 
   null, 
   "gnojek", 
   "Just making sure that attention IS NOT diverted away from the feds who only came in to make a bad situation worse.\n \n I've said it before and said it again, New Orleans is a corrupt city with rampant crime and it's been that way for as long as I can remember.\n \n Maybe Katrina will turn it into a new city.\n \n BUT, the last thing I want to see is it turn into just another cookie cutter, white bread Amurkin town, which is what would have happened if Blanco had let the feds snatch control from her.\n \n\n By all means, let's investigate what went wrong in New Orleans. Let's start in City Hall.\n\n \n And let's not stop until the White House.", 
   {}, 
   160411, 
   null, 
   1126120320.0
  ], 
  [
   160868, 
   null, 
   "jyoshu", 
   "\"To seize control of the mission, Mr. Bush would have had to invoke the Insurrection Act, which allows the president in times of unrest to command active-duty forces into the states to perform law enforcement duties. But decision makers in Washington felt certain that Ms. Blanco would have resisted surrendering control, as Bush administration officials believe would have been required to deploy active-duty combat forces before law and order had been re-established. \n \n While combat troops can conduct relief missions without the legal authority of the Insurrection Act, Pentagon and military officials say that no active-duty forces could have been sent into the chaos of New Orleans on Wednesday or Thursday without confronting law-and-order challenges.\n \n But just as important to the administration were worries about the message that would have been sent by a president ousting a Southern governor of another party from command of her National Guard, according to administration, Pentagon and Justice Department officials. \n \n \"Can you imagine how it would have been perceived if a president of the United States of one party had pre-emptively taken from the female governor of another party the command and control of her forces, unless the security situation made it completely clear that she was unable to effectively execute her command authority and that lawlessness was the inevitable result?\"asked one senior administration official, who spoke anonymously because the talks were confidential.\n \n Officials in Louisiana agree that the governor would not have given up control over National Guard troops in her state as would have been required to send large numbers of active-duty soldiers into the area. But they also say they were desperate and would have welcomed assistance by active-duty soldiers.\"\n \n http://www.nytimes.com/2005/09/09/national/nationalspecial/09military.html?ei=5090&en=aa642b8c89c27c01&ex=1283918400&adxnnl=1&partner=rssuserland&emc=rss&adxnnlx=1126238795-dGCl9WlaN8lbkCHBy9hw2w&pagewanted=print\n \n From the NYTimes, of all places!!!\n \n This has already been said by others, but the LA authorities were trying too much to be Federalists, relying on the feds while not being willing to give up power in any public sense. I had no idea that LA had such a pro-fed govt. \n \n As has been pointed out, this whole mess really underscores the fact that people need to not rely on the govt. for everything--they need to take responsibility for themselves.", 
   {
    "post_info": {
     "post_title": "It is becoming obvious Blanco dropped the ball"
    }
   }, 
   160419, 
   null, 
   1126302180.0
  ], 
  [
   160870, 
   null, 
   "gnojek", 
   "As has been pointed out, this whole mess really underscores the fact that people need to not rely on the govt. for everything--they need to take responsibility for themselves.\n\n \n Then which is it then? \n Should Blanco have federalized control of the disaster relief or not? \n \n But when should people be self-reliant? \n When they go to a storm shelter or when they get locked in for 4 days with no food, water, or baby formula so that babies and the elderly die from dehydration and heat exhaustion?\n \n I think this XXXX is trying to divert attention from the huge cluster **** that occured when people were not allowed to leave the dome or the convention center.\n \n It's also trying to divert attention from the various ways the feds came in and prevented private citizens from rescuing others and providing disaster relief, blocked or diverted relief resources, cut power, cut communications and basically made everyone's job more difficult or impossible.\n \n So we can be self-reliant all we want, but only if the government lets us.", 
   {}, 
   160868, 
   null, 
   1126303680.0
  ], 
  [
   163442, 
   null, 
   "Howard Beale", 
   "I don't live in NO or in LA. Who they vote in or out of office is not my business.\n \n They only screw-ups I can vote out of office are the people in charge at the Federal level.\n \n I have voted for Republicans before in both regional and national elections. This incompetence demands that they be removed from power at the Federal level. As far as NO and LA, those officials are answerable to their people.", 
   {}, 
   160870, 
   null, 
   1127066580.0
  ], 
  [
   163585, 
   null, 
   "simone", 
   "But just as important to the administration were worries about the message that would have been sent by a president ousting a Southern governor of another party from command of her National Guard, according to administration, Pentagon and Justice Department officials. \n \n \"Can you imagine how it would have been perceived if a president of the United States of one party had pre-emptively taken from the female governor of another party the command and control of her forces, unless the security situation made it completely clear that she was unable to effectively execute her command authority and that lawlessness was the inevitable result?\" asked one senior administration official, who spoke anonymously because the talks were confidential.\n\n http://www.nytimes.com/2005/09/09/national/nationalspecial/09military.html?ei=5090&en=aa642b8c89c27c01&ex=1283918400&adxnnl=1&partner=rssuserland&emc=rss&adxnnlx=1126238795-dGCl9WlaN8lbkCHBy9hw2w&pagewanted=print\n \n You know, this whole thing is getting a tad fuzzy for me. First problem is that Bush has already pretty much seized control of the National Guards from ALL the states and sent them over to Iraq. Secondly, the question is, if Blanco has called in the National Guard in Louisiana, how effective would the sadly depleted forces of the Louisiana Guard be, with a goodly number of their people in Iraq?\n \n Let's keep in mind, the effects of Iraq loom very, very large in this ongoing Gulf Coast scenario. Things might have been a whole lot different if Bush hadn't stolen away funding for levee maintenance and dumped into his Iraq fiasco, if Bush hadn't depleted National Guard numbers for the very same fiasco.\n \n How much of a factor was Iraq in this whole picture?", 
   {}, 
   163442, 
   null, 
   1127095740.0
  ], 
  [
   163627, 
   null, 
   "jyoshu", 
   "Then which is it then? \n Should Blanco have federalized control of the disaster relief or not? \n \n But when should people be self-reliant? \n When they go to a storm shelter or when they get locked in for 4 days with no food, water, or baby formula so that babies and the elderly die from dehydration and heat exhaustion?\n\n \n Poor or not, I would have found SOME way to get out of that city beforehand. Especially if I had a family there with me. It's not THAT hard to travel these days to an adjacent town or something. People didn't make enough of an effort to leave when they were told and then they got mad when the authorities didn't get right in and rescue them. They were trying to rely on the govt. when an ounce of prevention would have been a pound of cure.", 
   {}, 
   160870, 
   null, 
   1127143860.0
  ], 
  [
   163682, 
   null, 
   "Howard Beale", 
   "Jyoshu:\n \n \nPoor or not, I would have found SOME way to get out of that city beforehand. Especially if I had a family there with me. It's not THAT hard to travel these days to an adjacent town or something. People didn't make enough of an effort to leave when they were told and then they got mad when the authorities didn't get right in and rescue them. They were trying to rely on the govt. when an ounce of prevention would have been a pound of cure.\nHave you any idea how many people stayed behind to care for the sick and the elderly who needed special transportation? Have you any idea how many people had nowhere else to go except the Convention Center and the Superdome? Where were they supposed to go? No one had offered them sanctuary until days after the flood had hit. I guess they should have just checked in at the Holiday Inn in Baton Rouge. They stayed in NO and from the way things went, most did take care of themselves. The death toll is much lower than anticipated by the mayor or the government in their emergency assessment papers and that was not because of any help from the Feds.", 
   {}, 
   163627, 
   null, 
   1127154000.0
  ], 
  [
   163692, 
   null, 
   "jyoshu", 
   "Jyoshu:\n \n Have you any idea how many people stayed behind to care for the sick and the elderly who needed special transportation? Have you any idea how many people had nowhere else to go except the Convention Center and the Superdome? Where were they supposed to go?\n\n \n There were tens of thousands of people still in that city. You can't tell me that many of those people had stayed when they could have found a way to get out. Did none of them have relatives outside of N.Orleans? Come on. We know from interviews that many of them chose to not evacuate. I'm sorry, but if a person puts enough effort into finding a way out, they'll do it. New Orleans wasn't a prison--they weren't locked in there prior to the hurricane.\n \n \nNo one had offered them sanctuary until days after the flood had hit. I guess they should have just checked in at the Holiday Inn in Baton Rouge. They stayed in NO and from the way things went, most did take care of themselves. The death toll is much lower than anticipated by the mayor\n\n \n Much lower that claimed by the mayor when he was trying to pin the state and local failures completely on the Feds, yes. That alone ought to be investigated as well.", 
   {}, 
   163682, 
   null, 
   1127154660.0
  ], 
  [
   163700, 
   null, 
   "Howard Beale", 
   "jyoshu:\n \n \nNew Orleans wasn't a prison--\nNo, but poverty can be.\n \n \nMuch lower that claimed by the mayor when he was trying to pin the state and local failures completely on the Feds, yes. That alone ought to be investigated as well.\nFema did their projections using a simulated Cat 3 Hurricane (Pam). Their estimates were as off as the mayors. Check your facts.\n \n Following the exercise, FEMA spokesman David Passey \"hesitated\" before answering a reporter's question about how many people could die in such a storm. \"We would see casualties not seen in the United States in the last century.\"  Times-Picayune Feb. 2004.", 
   {}, 
   163692, 
   null, 
   1127155260.0
  ], 
  [
   163741, 
   null, 
   "gnojek", 
   "There were tens of thousands of people still in that city.\n\n And they are not the ones bitching about the government.\n The only times they'll bitch I guess is when they come to force them out or take away their guns.\n \n I guess the government doesn't want them to be self-sufficient.", 
   {}, 
   163692, 
   null, 
   1127160240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Michael Goodwin: Don't Blame Only the Feds", 
  "url": "http://www.4forums.com/political/politics-debates/6372-michael-goodwin-dont-blame-only-feds.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 6372, 
  "discussion_files": [
   [
    "22793.html", 
    "http://www.4forums.com/political/politics-debates/6372-michael-goodwin-dont-blame-only-feds-print.html"
   ]
  ], 
  "identifier": 6372
 }
]