[
 [
  [
   160507, 
   null, 
   "The Skeptic", 
   "About a month ago, I left this forum because I simply did not have enough time to refute and address arguments and questions against my beliefs on Intelligent Design, evolution, and irreducible complexity. Specifically, DamEtel overwhelmed me with a swarm of objections.\n \n I have now found the time in my schedule to rebut those objections to irreducible complexity, and start a new thread on the subject. \n \n My original debate on the subject can be found at: http://4forums.com/political/showthread.php?t=6048&page=1\n \n For those that do not understand irreducible complexity, I would recommend reading at least the first post.\n \n DamEtels later objections are at:\n \n http://4forums.com/political/showthread.php?t=6001&page=4\n \n and\n \n http://4forums.com/political/showthread.php?t=6001&page=3&pp=15\n \n I feel that though the overwhelming number of objections brought up by Clive14 and the later objections by DE, I did not represent the Intelligent Design position as well as I could have, had I spent more time and thought on the debate. Therefore, I am offering in this thread a complete rebuttal of the objections to irreducible complexity that has been brought forth by DamEtel.\n \n If DamEtel wishes to do a formal debate on the subject, I am willing.\n \n So, here goes...", 
   {
    "post_info": {
     "post_title": "Irreducible Complexity VS. Evolution."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1126140240.0
  ], 
  [
   160508, 
   null, 
   "The Skeptic", 
   "Besides the fact that The Skeptic failed to meet his burden of proof - and therefore lost the debate -\n\n \n I fail to see how any evidence could better fulfill my burden of proof. \n \n I showed from my very first post that IC and Darwinism cannot mix. Clive brought up objections, and I refuted them. Exactly what is the alternative?\n \n \nHere we see The Skeptic try to claim that punctuated equilibrium is a \"totally separate issue from the resolution, which specifically says \"Neo-Darwinism\"\". Yet The Skeptic himself, in his very first post of the debate, went WAY BEYOND Clive14's \"error\" ... The Skeptic slyly made the leap all the way from \"Neo-Darwinism\" to ALL OF EVOLUTION!\n\n \n As far as most people are concerned, Neo-Darwinism is, for all practical purposes, all of evolution. Now, of course, anyone can re-define evolution to include several far out ideas, but the mainstream accepts Neo-Darwinism. \n \n In other words, the normal definition of evolution (at least the one that I was using), is the same as Neo-Darwinism.\n \n \nNow, The Skeptic is wrong for doing this; I will present a few reasons why.\n\n \n In doing so, you simply demonstrate that you haven't read Behe's book, and you don't understand evolution. Besides this, each of your reasons has been thoroughly debunked.\n \n \n1) Symbiogenesis. Lynn Margulis argues strongly against neo-Darwinian evolution being the major driving force behind biological novelty, arguing instead that it occurs primarily by a form of symbiosis...\n \n So even if The Skeptic were to sucessfully eliminate neo-Darwinian evolution, there would still be symbiogenesis left as an evolutionary means of producing biological novelty: The Skeptic still would not have proven evolution to be incorrect, despite his claim - he'd still have more work to do.\n\n \n Sorry to tell you this, but Behe already refuted the idea:\n \n \"The important question for us biochemists is, can symbiosis explain the origin of complex biochemical systems? \n \n Clearly it cannot. The essence of symbiosis is the joining of separate cells, or two separate systems, both of which are already functioning...Because symbiosis starts with complex, already functioning systems it cannot account for the fundamental biochemical systems we have discussed in this book.\" (Darwin's Black Box, page189)\n \n \nEvo-Devo. Evolutionary developmental biology (Evo-Devo) is a relatively new field that, unlike Neo-Darwinian evolution, includes/emphasizes embryology and thereby better explains the creative side of evolution. Since The Skeptic's argument is against neo-Darwinian evolution only, it does not address the wide range of findings from the field of Evo-Devo, and therefore, The Skeptic could not possibly prove evolution to be false by eliminating only neo-Darwinian evolution.\n\n \n To the contrary, Evo-Devo has been well addressed by the ID movement. Take a look, for example, at: http://www.discovery.org/scripts/viewDB/index.php?command=view&id=2757\n \n \"To sum up, developmental geneticists have found that the genes that seem to be most important in development are remarkably similar in many different types of animals, from worms to fruit flies to mammals. \n \n Initially, this was regarded as evidence for genetic programs controlling development. But biologists are now realizing that it actually constitutes a paradox: if genes control development, why do similar genes produce such different animals? Why does a caterpillar turn into a butterfly instead of a barracuda?\"\n \n \n \n \n3) Brute luck? ...We can find such an explanation wanting or unsatisfying, but being highly unlikely is not the same as proving that it could not happen. For The Skeptic to PROVE - his word - evolution false, he'd have to PROVE that brute luck couldn't somehow assemble an IC biochemical system (for example, cilium from the biomolecular parts (microtubules, dynein, etc.) already present in the cell), but he cannot do that.\n\n \n If you do believe that idea even after learning biochemistry, you need to learn basic probabilities 101. Of course you can't prove that its impossible, just incredibly unlikely. It's like believing that a hurricane going through a junk yard can produce a fully functional Boeing 747.\n \n \nEven Behe admits that multiple, simultaneous mutations producing an IC system cannot actually be ruled out, saying, \"Such an appeal to brute luck can never be refuted\" (page 40).\n\n \n That quote is out of context. Weren't you talking earlier about how creationists always take evolutionary quotes out of context? For those who want to know what Behe was saying, here is the full quote: \"In abstract, it might be tempting to imagine that irreducible complexity simply requires multiple simultaneous mutations --- that evolution might be far chancier than we thought, but still possible. Such an appeal to brute luck can never be refuted. Yet it is an empty argument. One may as well say that the world luckily popped into existence yesterday with all the features it now has. Luck is a metaphysical speculation; scientific explanations invoke causes.\"", 
   {
    "post_info": {
     "post_title": "POST 1: Rebuttal to DamEtel\u0092s first post."
    }, 
    "unicode_changes_made": true
   }, 
   160507, 
   null, 
   1126140360.0
  ], 
  [
   160509, 
   null, 
   "The Skeptic", 
   "Behe's actual position is that an IC biochemical system literally cannot arise (evolve) IN A PARTICULAR MANNER, not that it can't arise (evolve) at all.\n\n \n Here we see, yet again, that DamEtel is either being downright dishonest, or doesn't understand what he is talking about.\n \n First of all, Behe clearly defined his position many times in his book and elsewhere, including directly after the reference made by DE.\n \n Second of all, Behe did refute the circuitous route idea:\n \n \"As the complexity of an interacting system increases, though, our confidence that Darwin's criterion of failure has been met skyrockets toward the maximum that science allows. And as the number of unexplained, irreducibly complex systems increases, our confidence that Darwin's criterion of failure has been met skyrockets towards the maximum that science allows.\"\n \n After reading Darwin's Black Box and comparing it with what I have learned about biochemistry and biology, I can see that basically every significant biochemical system is irreducibly complex. Just think about it for a little bit. \n \n The chances that an indirect route would be the norm in biochemistry because of evolution are, for all practical purposes, zero. Yet that is exactly what we see.\n \n \nBut here The Skeptic has himself admitted that, according the Behe, demonstrating that an irreducibly complex system exists does NOT show that natural selection and mutations could not have built it!!!!\n \n In fact, The Skeptic's statement implies that multiple IC systems could have arisen (evolved) by mutation and natural selection!!!!!\n\n \n Your so confused that this is going to be hard to clear up. \n \n Fact: If evolution did not produce all biochemical systems, the other systems had to have come from an Intelligent Designer.\n \n Fact 2: I never said that evolution could produce anything. I said that Behe believe's that evolution could produce some systems. Obviously those systems would not be irreducibly complex.\n \n \n \n By Behe's own definition, neither The Skeptic nor Behe can meet Darwin's criterion - which specifically mentions a complex ORGAN - and thereby 'disprove evolution' by using IC, because there's no such thing as an IC ORGAN. Further, if we do examine an organ - which is necessarily a multicellular structure - one cannot say that it could not have been produced by step-by-step Darwinian fashion; so the whole exercise is futile from the start! \n\n \n Of course. Darwin could never have dreamed of the complexity of the systems that he was trying to explain, but the underlying concept (that they could not have evolved) remains the same. I think your just trying to dodge the obvious.", 
   {
    "post_info": {
     "post_title": "POST 2: Rebuttal to DamEtel\u0092s 2nd, 3rd, and 4th posts."
    }, 
    "unicode_changes_made": true
   }, 
   160508, 
   null, 
   1126140420.0
  ], 
  [
   160523, 
   null, 
   "gnojek", 
   "\n To the contrary, Evo-Devo has been well addressed by the ID movement. Take a look, for example, at: http://www.discovery.org/scripts/viewDB/index.php?command=view&id=2757\n \n \"To sum up, developmental geneticists have found that the genes that seem to be most important in development are remarkably similar in many different types of animals, from worms to fruit flies to mammals. \n \n Initially, this was regarded as evidence for genetic programs controlling development. But biologists are now realizing that it actually constitutes a paradox: if genes control development, why do similar genes produce such different animals? Why does a caterpillar turn into a butterfly instead of a barracuda?\"\n\n Derp, it depends on the regulation of gene expression.\n Derp e doo.\n \n \nIf you do believe that idea even after learning biochemistry, you need to learn basic probabilities 101. Of course you can't prove that its impossible, just incredibly unlikely. It's like believing that a hurricane going through a junk yard can produce a fully functional Boeing 747.\n\n God, these analogies are so pathetically lame.\n \n No, no it's not like a tornado or a hurricane producing a 747.\n \n Please, if you can or dare, explain how this is an apt analogy to life.\n \n \n \n And the title of the thread is \"Irreducible Complexity VS. Evolution\"\n \n But you're hero, Behe, sees IC as a counterpart to Evolution, working alongside it. To him they are not mutally exclusive but rely on each other.", 
   {
    "post_info": {
     "post_title": "Dude, this is pathetic."
    }, 
    "unicode_changes_made": true
   }, 
   160508, 
   null, 
   1126146240.0
  ], 
  [
   160641, 
   null, 
   "OccamsRazor", 
   "Okay Skeptic, here are a few more points to address if you are going to insist that ID disproves evolution correct.\n \n \nI fail to see how any evidence could better fulfill my burden of proof. \n \n I showed from my very first post that IC and Darwinism cannot mix. Clive brought up objections, and I refuted them. Exactly what is the alternative?\n\n \n Well I suppose it is a matter of having a rebuttal strong enough to assert proof.\n \n \nSorry to tell you this, but Behe already refuted the idea:\n \n \"The important question for us biochemists is, can symbiosis explain the origin of complex biochemical systems? \n \n Clearly it cannot. The essence of symbiosis is the joining of separate cells, or two separate systems, both of which are already functioning...Because symbiosis starts with complex, already functioning systems it cannot account for the fundamental biochemical systems we have discussed in this book.\" (Darwin's Black Box, page189)\n\n \n And once again, is this a strong enough rebuttal to assert proof? no, Behe assumes that a biochemical system that exists today cannot have a precursor, or less complex state of existence. Clive did a good job of demolishing this notion with the mouse trap example he lin the debate thread.\n \n \nIf you do believe that idea even after learning biochemistry, you need to learn basic probabilities 101. Of course you can't prove that its impossible, just incredibly unlikely. It's like believing that a hurricane going through a junk yard can produce a fully functional Boeing 747.\n\n \n This is absolute, utter rubbish brought about a narrow minded kind of thinking by a man [Behe] who seems unable to conceptualize outside of his experience of reality. His example is a poor one for two reasons: firstly a Jumbo Jet might seem complex to us, but set against the structures and systems of biological life it is crude and imperfect to say the least. Secondly Behe is implying evolution is a process that happens near instantly and at the whim of direct destructive forces. This again is untrue, things like hurricanes tend to kill animals not make them evolve overnight.\n \n Actually the the entire analogy is flawed as if it were to be correct (ie. asserting that evolution can occur by a \"random\" process) it should actaully read a hurricane enters the Wright Brothers workshop containig their Flyer and produces a 747 out of the components present.\n \n Also where has Behe shown that evolution over time is highly improbable? He cannot directly test this statement so it is an assumption based on his narrow point of view.\n \n \nThat quote is out of context. Weren't you talking earlier about how creationists always take evolutionary quotes out of context? For those who want to know what Behe was saying, here is the full quote: \"In abstract, it might be tempting to imagine that irreducible complexity simply requires multiple simultaneous mutations --- that evolution might be far chancier than we thought, but still possible. Such an appeal to brute luck can never be refuted. Yet it is an empty argument. One may as well say that the world luckily popped into existence yesterday with all the features it now has. Luck is a metaphysical speculation; scientific explanations invoke causes.\"\n\n \n Once again Behe exposes his narrow minded assumtion on what evolution is about. He frequently uses words such as \"luck\", \"chance\", \"improbable\" when refering to evolution.\n \n He has this entirely the wrong way round- evolution is not a short term, chance event: its a relatively long term, inevitable process that occurs in response to a variety of pressures on a population of organisms. Until Behe starts thinking outside of his own experience of time he won't start making any sense when talking about evolution.", 
   {
    "unicode_changes_made": true
   }, 
   160508, 
   null, 
   1126202820.0
  ], 
  [
   160800, 
   null, 
   "DamEtel", 
   "The Skeptic, I see gross flaws all over your \"counters\", and your lame personal attacks. Frankly, you come off as grossly ignorant and a jerk.\n \n Unfortunately, as I've already pointed out more than once at these forums, because school just started back a couple of weeks ago I'm too busy now to spend hardly any time on the Net, except for things I am already involved in (my debate with marc9000 here is one). You'll have to wait quite some time if you want to debate me. I'll be glad to, because I see you don't know what Behe says.\n \n \n PS: For years over at ARN, back when I was an IDist, I - who went by the name DNAunion (and still do at some sites) - was considered by many there to be \"the expert\" on Darwin's Black Box. I've read the book, multiple times, and have argued about Behe's statements in it for many years. I know the book. I know the material. You don't.", 
   {}, 
   160508, 
   null, 
   1126244820.0
  ], 
  [
   160817, 
   null, 
   "Clive14", 
   "...I feel that though the overwhelming number of objections brought up by Clive14 and the later objections by DE, I did not represent the Intelligent Design position as well as I could have, had I spent more time and thought on the debate. Therefore, I am offering in this thread a complete rebuttal of the objections to irreducible complexity that has been brought forth by DamEtel.\n \n If DamEtel wishes to do a formal debate on the subject, I am willing.\n \n So, here goes&#8230;\nYou lost this debate Skeptic, why drag it back up again? There are plenty of other subjects that we could debate instead. Pick one of them and let's debate again. Alternatively, how about a formal debate on ID in which you never once mention Behe? That'll be a completely different one and worth considering.", 
   {}, 
   160507, 
   null, 
   1126271220.0
  ], 
  [
   161045, 
   null, 
   "DamEtel", 
   "DamEtel: Here we see The Skeptic try to claim that punctuated equilibrium is a \"totally separate issue from the resolution, which specifically says \"Neo-Darwinism\"\". Yet The Skeptic himself, in his very first post of the debate, went WAY BEYOND Clive14's \"error\" ... The Skeptic slyly made the leap all the way from \"Neo-Darwinism\" to ALL OF EVOLUTION! \n\n \n \nThe Skeptic: As far as most people are concerned, Neo-Darwinism is, for all practical purposes, all of evolution. Now, of course, anyone can re-define evolution to include several far out ideas, but the mainstream accepts Neo-Darwinism. \n \n In other words, the normal definition of evolution (at least the one that I was using), is the same as Neo-Darwinism.\n\n \n Wrong, wrong, and wrong.\n \n Evolution means more than just neo-Darwinism. In fact, I pointed out, in the very post you are discussing, several things you'd have to disprove other than neo-Darwinism before you would have disproved evolution. A good example of evolutionary research that is mostly outside of neo-Darwinism is the heavy focus these days on embryology in an evolutionary context; embryology was largely omitted from neo-Darwinism. And you yourself claim that punctuated equilibrium, which is an evolutionary theory, is not neo-Darwinism.\n \n Your pathetic attempt here to redefine terms not only fails, but makes you look dishonest and/or stupid. \n \n You cannot claim to be addressing EVOLUTION - as you did - and yet claim that punctuated equilibrium is out of bounds. \n \n \n Sadly, judging from your past comments, I doubt you can grasp anything - even something so simple - by having it explained to you only one, or two, or three times. So I'll try to explain it a different way.\n \n \n Either:\n \n 1) Your discussion includes ALL of evolution - as your statements clearly indicated - in which case (a) punctuated equilibrium is an absoluately valid topic, and (b) you are absoultely wrong in what you said to Clive14 about it.\n \n or\n \n 2) Your discussion is limited to just Neo-Darwinism, and does NOT address a lot of evolution (such as punctuated equilibrium and most of Evo Devo), in which case (a) you CANNOT dispove evolution because there's much you aren't even addressing, and (b) your claim that \"dispoving\" just neo-Darwinism would have you disproving evolution is blatantly false.\n \n \n Either way, you lose The Skeptic. But I doubt this will stop you.", 
   {
    "unicode_changes_made": true
   }, 
   160508, 
   null, 
   1126399980.0
  ], 
  [
   161046, 
   null, 
   "DamEtel", 
   "DamEtel: 1) Symbiogenesis. Lynn Margulis argues strongly against neo-Darwinian evolution being the major driving force behind biological novelty, arguing instead that it occurs primarily by a form of symbiosis...\n \n So even if The Skeptic were to sucessfully eliminate neo-Darwinian evolution, there would still be symbiogenesis left as an evolutionary means of producing biological novelty: The Skeptic still would not have proven evolution to be incorrect, despite his claim - he'd still have more work to do. \n\n \n \nThe Skeptic: Sorry to tell you this, but Behe already refuted the idea:\n\n \n Sorry to tell you, but you're making yourself look even MORE silly!\n \n Reread what I actually said, The Skeptic. I will add emphasis this time.\n \n \nDamEtel: 1) Symbiogenesis. Lynn Margulis argues strongly against neo-Darwinian evolution being the major driving force behind biological novelty, arguing instead that it occurs primarily by a form of symbiosis...\n \n So even if The Skeptic were to sucessfully eliminate neo-Darwinian evolution, there would still be symbiogenesis left as an evolutionary means of producing biological novelty: The Skeptic still would not have proven evolution to be incorrect, despite his claim - he'd still have more work to do. \n\n \n Okay, do you see your problem yet? You should, since my statements are crystal clear. But since you've shown yourself to be so dull, let me try to explain it to you a second way.\n \n I said that, in your debate, even if YOU did manage disprove neo-Darwinism (which you clearly didn't) YOU would still have more work to do before disproving evolution, such as needing to also eliminate symbiogenesis (and several others I listed). What I actually said is 100% correct. That Behe claims to have eliminated symbiogenesis is completely irrelevant: YOU are not BEHE. Just because BEHE said something about symbiogenesis in his book does not mean that YOU eliminated symbiogenesis in the debate. In the debate, YOU would still have to eliminate it. YOU would still have more work to do. Get it?\n \n Oh, and I am quite aware of Behe's statements on symbiogenesis, having read his Darwin's Black Box a dozen or so times. This is why I made my statements very accurate, very specific, and very clear. That you are incapable of understanding English shows a mental deficiency on your part, not mine.\n \n Finally, I see you are ducking the real issue here. Symbiogenesis is ONE example of several of how you can't disprove evolution simply by disproving neo-Darwinism (which you failed to do anyway). I've demonstrated my point; all you are doing is showing that you are dull and/or disingenuous.", 
   {
    "unicode_changes_made": true
   }, 
   160508, 
   null, 
   1126401120.0
  ], 
  [
   161050, 
   null, 
   "DamEtel", 
   "DamEtel: 3) Brute luck? ...We can find such an explanation wanting or unsatisfying, but being highly unlikely is not the same as proving that it could not happen. For The Skeptic to PROVE - his word - evolution false, he'd have to PROVE that brute luck couldn't somehow assemble an IC biochemical system (for example, cilium from the biomolecular parts (microtubules, dynein, etc.) already present in the cell), but he cannot do that. \n\n \n \nThe Skeptic: If you do believe that idea even after learning biochemistry, you need to learn basic probabilities 101. Of course you can't prove that its impossible, just incredibly unlikely \n\n \n So you acknowledge that what I said is correct! Yet you pretend like I am somehow wrong?!?!?!?!?\n \n By your own words, you admit to having failed one of your stated objectives - to PROVE evolution false. You even go so far as to admit that you CANNOT do so!!! Just as I pointed out!!!\n \n \n \n Gee, maybe you shouldn't have made such a bold, over-the-top assertion. But, it's YOUR fault: YOU chose what you said, not me.", 
   {
    "unicode_changes_made": true
   }, 
   160508, 
   null, 
   1126401840.0
  ], 
  [
   161339, 
   null, 
   "The Skeptic", 
   "Derp, it depends on the regulation of gene expression.\n\n \n Since I have absolutely no idea what you are talking about, I'll let you have the argument. The obvious point remains that all alternatives to creationism either work on luck or natural selection acting on something. As I have demonstrated, neither of those can create an IC system.\n \n \nWell I suppose it is a matter of having a rebuttal strong enough to assert proof.\n\n \n Yeah... so why wasn't there even one argument that didn't meet that criteria?\n \n \n Behe assumes that a biochemical system that exists today cannot have a precursor, or less complex state of existence. Clive did a good job of demolishing this notion with the mouse trap example he lin the debate thread.\n\n \n I have no idea what you are talking about. Can you please elaborate? Can you please show why my rebuttal of Clives arguments against the mousetrap example doesn't hold water? \n \n \nBehe is implying evolution is a process that happens near instantly and at the whim of direct destructive forces. This again is untrue, things like hurricanes tend to kill animals not make them evolve overnight.\n\n \n WOW. You need to read up on IC, seriously. That was probably the most confused statement I have ever heard. OK:\n \n 1) Behe was not implying it, DamEtel was.\n \n 2) Just like hurricanes, vast amounts of mutations tend to kill animals rather than making to them evolve overnight.\n \n \nActually the the entire analogy is flawed as if it were to be correct (ie. asserting that evolution can occur by a \"random\" process) it should actaully read a hurricane enters the Wright Brothers workshop containig their Flyer and produces a 747 out of the components present.\n\n \n To the contrary, mutations are supposedly random. Apparently ,your trying to say that only beneficial mutations would happen and the problem is whether they will line up with each other. That doesn't make sense.\n \n \nThe Skeptic, I see gross flaws all over your \"counters\", and your lame personal attacks. Frankly, you come off as grossly ignorant and a jerk.\n\n \n Gee, its good to know that you are the pinnacle of kindness and knowledge.\n \n \nI've read the book, multiple times, and have argued about Behe's statements in it for many years. I know the book. I know the material. You don't.\n\n \n Then I find it strange that your posts and arguments indicate the opposite. You have quoted Behe out of context many times, and misrepresented his intent. Besides this, you have continually thrown out arguments in your usual spit-fire fashion, even if they make no logical sense. \n \n \nYou lost this debate Skeptic, why drag it back up again? There are plenty of other subjects that we could debate instead. Pick one of them and let's debate again. Alternatively, how about a formal debate on ID in which you never once mention Behe? That'll be a completely different one and worth considering.\n\n \n Lol. Perhaps, once I finish here. \n \n The main reason that I quote Behe so often is that he is the primary advocate of this argument. Its hard to find anyone else to quote.\n \n OK... DamEtel's posts are next.", 
   {
    "post_info": {
     "post_title": "Defending IC, post 1."
    }, 
    "unicode_changes_made": true
   }, 
   161050, 
   null, 
   1126474800.0
  ], 
  [
   161357, 
   null, 
   "The Skeptic", 
   "Evolution means more than just neo-Darwinism. In fact, I pointed out, in the very post you are discussing, several things you'd have to disprove other than neo-Darwinism before you would have disproved evolution. A good example of evolutionary research that is mostly outside of neo-Darwinism is the heavy focus these days on embryology in an evolutionary context; embryology was largely omitted from neo-Darwinism. And you yourself claim that punctuated equilibrium, which is an evolutionary theory, is not neo-Darwinism.\n\n \n Whatever. As far as I am aware, (generally) the only proposed mechanism for any of the alternatives to Darwin is natural selection, which is a gradual, slow process which I have demonstrated to be unable to produce the 40 interacting, well matched protein parts necessary to the flagellum. Now, if you have some kind of other mechanism besides luck, enlighten me instead of alluding to it.\n \n \nYour pathetic attempt here to redefine terms not only fails, but makes you look dishonest and/or stupid. \n \n You cannot claim to be addressing EVOLUTION - as you did - and yet claim that punctuated equilibrium is out of bounds.\n\n \n That's how I use the term, and was using the term. Perhaps I should have given a more detailed definition of terms at the beginning of the debate. Perhaps you making a big boo-boo out of nothing.\n \n \nSo you acknowledge that what I said is correct! Yet you pretend like I am somehow wrong?!?!?!?!?\n \n By your own words, you admit to having failed one of your stated objectives - to PROVE evolution false. You even go so far as to admit that you CANNOT do so!!! Just as I pointed out!!!\n\n \n You never cease to amaze me, DE. Frankly, if you are willing to believe in something as incredibly unlikely as hopeful monsters just so that you can revel in your humanist religion, you don't deserve to even use the word \"science.\"\n \n In any case, I don't like rhetoric. So please drop your smart-alecky comments, and we can actually discuss the scientific facts. :) \n \n TS", 
   {
    "unicode_changes_made": true
   }, 
   161339, 
   null, 
   1126475820.0
  ], 
  [
   161409, 
   null, 
   "DamEtel", 
   "OccamsRazor: Behe is implying evolution is a process that happens near instantly and at the whim of direct destructive forces. This again is untrue, things like hurricanes tend to kill animals not make them evolve overnight. \n\n \n \n \nThe Skeptic: WOW. You need to read up on IC, seriously. That was probably the most confused statement I have ever heard. OK:\n \n 1) Behe was not implying it, DamEtel was.\n\n \n I neither said nor implied that.\n \n If you believe otherwise, then put your money where your mouth is and show us.\n \n \nThe Skeptic: 2) Just like hurricanes, vast amounts of mutations tend to kill animals rather than making to them evolve overnight.\n\n \n A statement I am more than happy to accept, despite your implication that I would hold the opposing position.", 
   {}, 
   161339, 
   null, 
   1126483320.0
  ], 
  [
   161413, 
   null, 
   "DamEtel", 
   "The Skeptic: Whatever.\n\n \n I accept your acknowledgement of your losing that point. \n \n \n \nThe Skeptic: Frankly, if you are willing to believe in something as incredibly unlikely as hopeful monsters ...\n\n \n My argument here has absolutely nothing to do with whether or not I believe in \"hopeful monsters\". Please stop stuffing beliefs into my mouth. \n \n My argument here deals with YOUR over-the-top claim - about PROVING evolution false - and YOUR FAILURE to have done so. It deals with what YOUR burden of proof is, based on YOUR own claims, and YOUR failure to meet it.", 
   {}, 
   161357, 
   null, 
   1126484040.0
  ], 
  [
   161420, 
   null, 
   "DamEtel", 
   "DamEtel: 3) Brute luck? Even Behe admits that multiple, simultaneous mutations producing an IC system cannot actually be ruled out, saying, \"Such an appeal to brute luck can never be refuted\" (page 40). We can find such an explanation wanting or unsatisfying, but being highly unlikely is not the same as proving that it could not happen. For The Skeptic to PROVE - his word - evolution false, he'd have to PROVE that brute luck couldn't somehow assemble an IC biochemical system (for example, cilium from the biomolecular parts (microtubules, dynein, etc.) already present in the cell), but he cannot do that.\n\n \n \nThe Skeptic: That quote is out of context.\n\n \n No, it's not. \n \n Let's look at the quote you provide that allegedly shows I quoted Behe out of context.\n \n \n\"In abstract, it might be tempting to imagine that irreducible complexity simply requires multiple simultaneous mutations --- that evolution might be far chancier than we thought, but still possible. Such an appeal to brute luck can never be refuted. Yet it is an empty argument. One may as well say that the world luckily popped into existence yesterday with all the features it now has. Luck is a metaphysical speculation; scientific explanations invoke causes.\"\n\n \n So where in there does Behe say that brute luck is actually impossible? Nowhere. \n \n Where in there does Behe say that brute luck can be absolutely and definitively ruled out, 100%. Nowhere.\n \n As I originally said, \"We can find such an explanation wanting or unsatisfying, but being highly unlikely is not the same as proving it could not happen.\" This is quite in line with Behe's statements in his book. Further, PROVING it IMPOSSIBLE is what you would have had to have done to PROVE that evolution is false. Behe says it can't be proven impossible: that it can't be completely refuted.\n \n (And quite frankly, most of us would agree that claiming that an IC system - or multiple IC systems - arose by multiple simultaneous mutations is in no way comparable to claiming that \"the word luckily popped into existence yesterday with all the features it now has.\" Behe's not being fully honest here.) \n \n What I quoted Behe saying is exactly what he said and is his position on the matter. I have NOT misrepresented Behe's position on this. \n \n \n Now, a charge of wrongdoing is discarded unless the party making the accusation can fully support his charge: burden of proof falls upon the accuser, not the accused. You've failed to support your charge, so I prevail.\n \n Now, if you want to continue pushing your charge of wrongdoing on my part, you need to show where, in Behe's \"Darwin's Black Box\", he goes on to show that brute luck is actually impossible: where Behe shows that brute luck can be absolutely and definitively ruled out, 100%. Until you do, you have failed to rebut my counter to your statements, and, I am also cleared of your false charges.\n \n \n \n \n PS: The only one playing around with context here is YOU! The context of my statements was that you claimed to have PROVEN EVOLUTION false, and I pointed out that:\n \n (1) in order for you to have succeeded, one of several things you would have to do (but didn't) is to DISPROVE multiple, simultaneous mutations (brute luck)\n \n and \n \n (2) Behe himself says that multiple, simultaneous mutations CANNOT be absolutely ruled out. \n \n Try to keep the context, okay.", 
   {
    "unicode_changes_made": true
   }, 
   160508, 
   null, 
   1126485720.0
  ], 
  [
   161423, 
   null, 
   "OccamsRazor", 
   "I have no idea what you are talking about. Can you please elaborate?\n\n \n ID works on a presumption: function is only a product of conscious design.\n \n \nCan you please show why my rebuttal of Clives arguments against the mousetrap example doesn't hold water?\n\n \n Your rebuttal? As I read it you linked someone elses work to make your point. But Behe's rebuttal does not make any real advance on his basic premise:\n \n \nProfessor McDonald started with a complete mousetrap and then showed ones with fewer parts. I will reverse that order, start with his simplest trap, and show the steps that would be necessary to convert it into the next more complex trap in his series. That, after all, is the way Darwinian evolution would have to work. If we are to picture this as a Darwinian process, then each separate adjustment must count as a \"mutation.\" If several separate mutations have to occur before we go from one functional trap to the next, then a Darwinian process is effectively ruled out, because the probability of getting multiple unselected mutations that eventually lead to a specific complex structure is prohibitive.\n\n \n So despite his long article Behe is still working on the same assumption I stated above: function is only a product of conscious design: there is no other valid explaination of the structure and function of life.\n \n Now, what I'd like to hear you describe is exactly how intelligent design works in action: \n \n 1) How long does intelligent design take, x years or is it instantaneous?\n \n 2) By what mechanism does the designer interact with the natural world?\n \n 3) When and why does the designer choose to interact with the world?\n \n 4) Why has the vast majority of intelligently designed life ceased to exist? if it was designed correctly in the first place why was it necessary to discard so many forms and replace them with different ones, as evidenced by the fossil record?\n \n 5) What experiments have been conducted to verify the occurence of intelligent design?\n \n I'm most interested to hear your ideas on these points.", 
   {
    "unicode_changes_made": true
   }, 
   161339, 
   null, 
   1126485960.0
  ], 
  [
   161551, 
   null, 
   "trebor", 
   "Whatever. As far as I am aware, (generally) the only proposed mechanism for any of the alternatives to Darwin is natural selection, which is a gradual, slow process which I have demonstrated to be unable to produce the 40 interacting, well matched protein parts necessary to the flagellum. Now, if you have some kind of other mechanism besides luck, enlighten me instead of alluding to it.\n \n\n \n And there you go totally misunderstanding evolution. The mechaism is\n NOT luck. It is natural selection. You claim you don't like rhetoric, but you \n just put a nice piece of rhetoric above.\n \n Here is a response to the bacteria flagellum arguement.\n \n http://www.talkorigins.org/indexcc/CB/CB200_1.html", 
   {}, 
   161357, 
   null, 
   1126538880.0
  ], 
  [
   161613, 
   null, 
   "The Skeptic", 
   "So where in there does Behe say that brute luck is actually impossible? Nowhere. \n \n Where in there does Behe say that brute luck can be absolutely and definitively ruled out, 100%. Nowhere.\n \n As I originally said, \"We can find such an explanation wanting or unsatisfying, but being highly unlikely is not the same as proving it could not happen.\" This is quite in line with Behe's statements in his book. Further, PROVING it IMPOSSIBLE is what you would have had to have done to PROVE that evolution is false. Behe says it can't be proven impossible: that it can't be completely refuted.\n \n (And quite frankly, most of us would agree that claiming that an IC system - or multiple IC systems - arose by multiple simultaneous mutations is in no way comparable to claiming that \"the word luckily popped into existence yesterday with all the features it now has.\" Behe's not being fully honest here.) \n \n What I quoted Behe saying is exactly what he said and is his position on the matter. I have NOT misrepresented Behe's position on this.\n \n \n Now, a charge of wrongdoing is discarded unless the party making the accusation can fully support his charge: burden of proof falls upon the accuser, not the accused. You've failed to support your charge, so I prevail.\n \n Now, if you want to continue pushing your charge of wrongdoing on my part, you need to show where, in Behe's \"Darwin's Black Box\", he goes on to show that brute luck is actually impossible: where Behe shows that brute luck can be absolutely and definitively ruled out, 100%. Until you do, you have failed to rebut my counter to your statements, and, I am also cleared of your false charges.\n\n \n Honestly, DE, I am beginning to wonder if you are really thinking about what you are saying. The above was pretty much the only argument that you made, pretty much all the rest of your posts were useless rhetoric.\n \n If this is truly how you feel about out of context quoting, you need to apologize to all of the creationists that you have blasted for quoting Darwin as saying that the fossil record \"is probably the most serious objection that can be raised against my theory.\"\n \n \nNow, what I'd like to hear you describe is exactly how intelligent design works in action:\n\n \n OK. By this very statement, you have shown that you don't understand ID. \n \n Basically, ID is like an umbrella. Underneath the umbrella are many beliefs. I, however, don't just advocate the umbrella. I advocate YEC creationism, which would fit underneath the umbrella of ID.\n \nAnd there you go totally misunderstanding evolution. The mechaism is\n NOT luck. It is natural selection. You claim you don't like rhetoric, but you \n just put a nice piece of rhetoric above.\n\n \n *sigh*\n \n Please, please read the context before you post next time.\n \n DamEtel was proposing that an IC system could have been created by multiple mutations. Neither of us believe that this is the same thing as evolution. It is actually called \"hopeful monsters,\" and has been around for about 70 years.\n \n [/quote]Here is a response to the bacteria flagellum arguement.\n \n http://www.talkorigins.org/indexcc/CB/CB200_1.html[/quote]\n \n Care to bring up an argument from that response? I have yet to meet one objection to IC that I cannot refute. In case your wondering, Behe has written an article in response to your link. Guess what? Talk.Origins hasn't responded yet, even after 9 years.", 
   {
    "unicode_changes_made": true
   }, 
   161551, 
   null, 
   1126558740.0
  ], 
  [
   161622, 
   null, 
   "trebor", 
   "Honestly, DE, I am beginning to wonder if you are really thinking about what you are saying. The above was pretty much the only argument that you made, pretty much all the rest of your posts were useless rhetoric.\n \n If this is truly how you feel about out of context quoting, you need to apologize to all of the creationists that you have blasted for quoting Darwin as saying that the fossil record \"is probably the most serious objection that can be raised against my theory.\"\n \n \n \n OK. By this very statement, you have shown that you don't understand ID. \n \n Basically, ID is like an umbrella. Underneath the umbrella are many beliefs. I, however, don't just advocate the umbrella. I advocate YEC creationism, which would fit underneath the umbrella of ID.\n \n \n *sigh*\n \n Please, please read the context before you post next time.\n \n DamEtel was proposing that an IC system could have been created by multiple mutations. Neither of us believe that this is the same thing as evolution. It is actually called \"hopeful monsters,\" and has been around for about 70 years.\n \n \nHere is a response to the bacteria flagellum arguement.\n \n http://www.talkorigins.org/indexcc/CB/CB200_1.html[/quote]\n \n Care to bring up an argument from that response? I have yet to meet one objection to IC that I cannot refute. In case your wondering, Behe has written an article in response to your link. Guess what? Talk.Origins hasn't responded yet, even after 9 years.[/QUOTE]\n \n Well, can you refute the fact that the baterial flagellum is not IR? Can you refute the possible path, can you refute the fact you can remove some parts of the flagullum, and it still work?\n \n Behe has not been able to put any one of his concepts in a peer reviewed article.. .. behe's refution is not valid.. actualliy.", 
   {
    "unicode_changes_made": true
   }, 
   161613, 
   null, 
   1126564320.0
  ], 
  [
   161727, 
   null, 
   "DamEtel", 
   "The Skeptic: If this is truly how you feel about out of context quoting, you need to apologize to all of the creationists that you have blasted for quoting Darwin as saying that the fossil record \"is probably the most serious objection that can be raised against my theory.\"\n\n \n First, refresh my memory and everyone else's and show us where I said exactly that. Then also show us the context the Creationists made their comment in. Only then can we actualy judge the validity of what you claim.\n \n \n Second, what I do remember very clearly doing is posting several distortions and out of context quotes many Creationists are guilty of, and scientists pointing out how they had been misquoted by Creationists. I will in no way apologize to Creationists for pointing out the undeniable fact that many of them have grossly distorted and otherwise mangled mainstream science and scientists.\n \n \nThe Skeptic: DamEtel was proposing that an IC system could have been created by multiple mutations.\n\n \n No, no, and no.\n \n Once again it had nothing to do with what I believe, it had to do with what YOU claimed and what BEHE says that refutes YOUR claim. You know, how BEHE HIMSELF says that multiple simultaneous mutations cannot absolutely be ruled out, which is one of the things you would have to do to PROVE evolution false.\n \n You chose as your main source someone who refutes your own over-the-top claim: that you PROVED evolution false! LOL!", 
   {
    "unicode_changes_made": true
   }, 
   161613, 
   null, 
   1126592160.0
  ], 
  [
   161804, 
   null, 
   "Redratio1", 
   "Geeeeeee the universe is too complex. I guess science should stop, cuz I can't figure it out.\n \n Mommy! emoticon_xchicken \n \n Give me a break. What a joke.", 
   {}, 
   161727, 
   null, 
   1126642560.0
  ], 
  [
   161805, 
   null, 
   "Mucusaur", 
   "I'm still interested in seeing how this God chap interacts with the real world, and how he is invisible to us.Perhaps some kind of electro-magnetic gun and a ghillie suit?", 
   {}, 
   161804, 
   null, 
   1126643100.0
  ], 
  [
   161821, 
   null, 
   "Howard Beale", 
   "Have you ever bothered to notice that no proponent of ID ever claims that it is a valid scientific hypothesis let alone a scientific theory? The oft quoted Wlliam Dembski slimes his way past the issue by taking that embarrassing position of calling it a \"field of study\". Dennis Feucht doesn't even bother with a scientific approach (probably because he is an electronic engineer, not a scientist) and in a brilliant flight of silliness he calls creation an \"engineering\" issue and creates his own science: \"The Science of Design\". In fact not one of the proponents of ID claim that it is a scientific hypothesis let alone a scientific theory. \n \n I challenge you to reference any scientist claiming that ID is a legitimate scientific theory.", 
   {
    "post_info": {
     "post_title": "A challange to The Skeptic"
    }, 
    "unicode_changes_made": true
   }, 
   161420, 
   null, 
   1126651380.0
  ], 
  [
   161857, 
   null, 
   "OccamsRazor", 
   "The Skeptic:\n \n I'm still interested to hear about how intelligent design actually works..... do you have any answers to the questions I posed earlier?\n \n \n 1) How long does intelligent design take, x years or is it instantaneous?\n \n 2) By what mechanism does the designer interact with the natural world?\n \n 3) When and why does the designer choose to interact with the world?\n \n 4) Why has the vast majority of intelligently designed life ceased to exist? if it was designed correctly in the first place why was it necessary to discard so many forms and replace them with different ones, as evidenced by the fossil record?\n \n 5) What experiments have been conducted to verify the occurence of intelligent design?\n \n \n These are fundemental issues if ID is going to be taken seriously.", 
   {
    "post_info": {
     "post_title": "The functionality of intelligent design....."
    }
   }, 
   161423, 
   null, 
   1126658340.0
  ], 
  [
   161886, 
   null, 
   "trebor", 
   "The Skeptic:\n \n I'm still interested to hear about how intelligent design actually works..... do you have any answers to the questions I posed earlier?\n \n \n 1) How long does intelligent design take, x years or is it instantaneous?\n \n\n \n It took 6 days.\n \n \n\n 2) By what mechanism does the designer interact with the natural world?\n \n\n \n In the beginging there was the word, and the word was made flesh.\n \n \n\n \n 3) When and why does the designer choose to interact with the world?\n \n \n\n \n All the time, but you ahve to understand it to see it first.\n \n \n\n 4) Why has the vast majority of intelligently designed life ceased to exist? if it was designed correctly in the first place why was it necessary to discard so many forms and replace them with different ones, as evidenced by the fossil record?\n \n\n They were punished for their inequitity.\n \n\n 5) What experiments have been conducted to verify the occurence of intelligent design?\n \n\n The bible answers all.\n \n \n These are fundemental issues if ID is going to be taken seriously.[/QUOTE]", 
   {}, 
   161857, 
   null, 
   1126661160.0
  ], 
  [
   161896, 
   null, 
   "Howard Beale", 
   "trebor\n \n \nIt took 6 days.\nThat is correct. The elohim stayed out and partied -- it was Saturday night. On Sunday they were hung over but they didn't want to put that in their report so they just they said \"On the seventh day the elohim rested.\" They had no idea that there would be an investigation in 2005!", 
   {}, 
   161886, 
   null, 
   1126662000.0
  ], 
  [
   162097, 
   null, 
   "Mucusaur", 
   "Despite trebor's humourous flailing with the topic, there is an \"physics gap\" that needs to be bridged in order for the ID to be taken seriously.", 
   {}, 
   161896, 
   null, 
   1126740420.0
  ], 
  [
   162099, 
   null, 
   "Redratio1", 
   "Despite trebor's humourous flailing with the topic, there is an \"physics gap\" that needs to be bridged in order for the ID to be taken seriously.\n\n \n No, it is a credibility gap.", 
   {}, 
   162097, 
   null, 
   1126740900.0
  ], 
  [
   162100, 
   null, 
   "trebor", 
   "No, it is a credibility gap.\n\n \n \n Those two are not mutually exclusive. I see both those statemetns as being true.", 
   {}, 
   162099, 
   null, 
   1126741080.0
  ], 
  [
   162102, 
   null, 
   "Howard Beale", 
   "I challenge any advocate of ID to reference any scientist claiming that ID is a legitimate scientific theory.\n \n They won't because it is a joke. They will simply slither away and post on anther thread.", 
   {}, 
   162100, 
   null, 
   1126744560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Irreducible Complexity VS. Evolution.", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6375-irreducible-complexity-vs-evolution.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 6375, 
  "discussion_files": [
   [
    "15069.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6375-irreducible-complexity-vs-evolution-print.html"
   ], 
   [
    "15070.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6375-irreducible-complexity-vs-evolution-2-print.html"
   ]
  ], 
  "identifier": 6375
 }
]