[
 [
  [
   8653, 
   null, 
   "kelvin90701", 
   "In the UK the scum happens to be a priest:\n \n http://news.bbc.co.uk/2/hi/england/2248511.stm\n \n Father Michael Daggett did four months for a .22 pistol. Was he dangerous? Was he violent? Was he a rapist? Was he a home invader? Hmmmm No.\n \n What is important to note is that obediance to the law and the state has become more important than law abiding God fearing citizens in the UK.", 
   {
    "post_info": {
     "post_title": "Send all the scum to jail!!!"
    }
   }, 
   null, 
   null, 
   1054460820.0
  ], 
  [
   8660, 
   null, 
   "Crim", 
   "What is important to note is that obediance to the law and the state has become more important than law abiding God fearing citizens in the UK.\n \n \n \nlaw abiding\n \n \n ...he wouldn't have been arrested if he was law abiding.\n \n \nGod fearing\n \n \n What does that have to do with anything?", 
   {}, 
   8653, 
   null, 
   1054493040.0
  ], 
  [
   8670, 
   null, 
   "kelvin90701", 
   "The crime was committed when he took possesion of the firearm. Do you know of any other crimes that your are guilty of when your are innocent in the past then the law makes you guilty later for a past event?\n \n If the speed limit is 40 mph on Monday, the law makes it 30 mph on Tuesday, are you guilty of speeding when it was Monday? Well in the UK you are.\n \n Michael Daggett is a priest. The state knows he is harmelss, but obediance before the law is more important than public saftey in the UK.", 
   {}, 
   8653, 
   null, 
   1054510320.0
  ], 
  [
   8788, 
   null, 
   "Striel", 
   "It is ridiculous that anyone would be put in jail for four monthes over having a pistol.", 
   {}, 
   8653, 
   null, 
   1054666860.0
  ], 
  [
   8905, 
   null, 
   "kelvin90701", 
   "It was not just anyone. It was a priest.", 
   {}, 
   8653, 
   null, 
   1054701180.0
  ], 
  [
   8919, 
   null, 
   "voiceofreason", 
   "Four months isn't very long. The UK is passing new gun laws which will include a 5 year minimum prison sentence for people who illegally possess guns. That's minimum. The UK police are asking people to turn in air guns and replica guns as well as real guns. \n \nThe move is ahead of the introduction of new gun laws, which will include a five-year minimum sentence for illegal possession of a prohibited firearm. Members of the public who hand in firearms at police station in Greater Manchester will receive a voucher which can be exchanged for a boxing ticket. \n ....Police are appealing for all unwanted air weapons, blank firers and imitation guns to be handed in, as well as illegally held firearms. Detective Inspector Mark Roberts, of Greater Manchester Police, said: \"If we can get one gun off the streets and this stops it being used in a murder then that will make it all worthwhile\" http://news.bbc.co.uk/1/hi/england/2902099.stm\n", 
   {}, 
   8653, 
   null, 
   1054716660.0
  ], 
  [
   8928, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n Four months isn't very long. The UK is passing new gun laws which will include a 5 year minimum prison sentence for people who illegally possess guns. That's minimum. The UK police are asking people to turn in air guns and replica guns as well as real guns. \n \n \n Four months in jail and NO purpose served for the public saftey. The message was very clear from the state: DO NOT DISOBEY ME!\n \n Four months, and an innocent man was made into a criminal for an act that was not illegal when he obtained the gun.\n \n No mistake he broke the law. What purpose did it serve other than than the useless punishment of a priest. Who did the law serve? Not the public, not the priest, but it did serve the government and everyone now knows not to disobey the state.\n \n In 4 months a man can be ruined. In 4 months without work, a man can loose all his possesions. In 4 months everything a man worked an entire life to build can be gone. Not only that he lost his job for the bad publicity and is no longer a priest. He is ruined and no public good was served. Four months to a good man who serves God. Four months maybe be a short time for a rapist and murderer, but not for a good man. (You know men get raped and beaten in jail all the time by other inmates)", 
   {}, 
   8653, 
   null, 
   1054741740.0
  ], 
  [
   8976, 
   null, 
   "voiceofreason", 
   "Originally posted by kelvin90701 \n The crime was committed when he took possesion of the firearm. Do you know of any other crimes that your are guilty of when your are innocent in the past then the law makes you guilty later for a past event?\n If the speed limit is 40 mph on Monday, the law makes it 30 mph on Tuesday, are you guilty of speeding when it was Monday? Well in the UK you are.\n \n 23,000 firearms were handed in when the UK had its gun ban. According to your logic those people that handed in their firearms can still be prosecuted because they took possession of a firearm prior to the ban. I don't think so. \n \n \nOriginally posted by kelvin90701 \n Michael Daggett is a priest. The state knows he is harmelss, but obediance before the law is more important than public saftey in the UK. \n \n What does being a priest have to do with anything? It wouldn't matter if he were a Satan worshipper.", 
   {}, 
   8653, 
   null, 
   1054783860.0
  ], 
  [
   8981, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n 23,000 firearms were handed in when the UK had its gun ban. According to your logic those people that handed in their firearms can still be prosecuted because they took possession of a firearm prior to the ban. I don't think so. \n \n \n What does being a priest have to do with anything? It wouldn't matter if he were a Satan worshipper. \n \n \n A priest? The quality and goodness of the man is not in question. Yet he was jailed with rapist and murderers. \n \n To commit a crime there must be an act and intent. There was no intent to break any law since there was none. There was an act, which was legal at the time. The statue manufactured a criminal where there was none before.\n \n Four months in a long time to spend with rapist and murders in close confinment. Not unless you think Michael Daggett is scum. Which is exactly what the state thinks Michael Dagget is.\n \n Supporting gun confiscations? Sorry I did not know you support gun confiscations.", 
   {}, 
   8653, 
   null, 
   1054785000.0
  ], 
  [
   8991, 
   null, 
   "kelvin90701", 
   "1) Father Michael Daggett \n http://news.bbc.co.uk/2/hi/england/2248511.stm\n \n 2) Children arrested \n http://news.bbc.co.uk/cbbcnews/hi/u...000/2198387.stm \n \n 3) Tony Martin for shooting home invaders:\n http://www.tonymartinsupportgroup.org/pages/littlejohn.htm", 
   {
    "post_info": {
     "post_title": "List of injustice in the UK keeps growing...."
    }
   }, 
   8653, 
   null, 
   1054786800.0
  ], 
  [
   9000, 
   null, 
   "voiceofreason", 
   "Originally posted by kelvin90701 \n  There was an act, which was legal at the time.\n\n Yeah and he wasn't prosecuted for the legal act you're referring to. If so then anybody could be prosecuted for possessing a firearm prior to the ban even if they voluntarily turned in their guns already. The problem is that he didn't turn in his gun. So that analogy with changing the speed limit is a false analogy. Let's not confuse the issue.", 
   {}, 
   8653, 
   null, 
   1054790280.0
  ], 
  [
   9015, 
   null, 
   "kelvin90701", 
   "Ok. Then they manufactured a criminal where there was none before. In one sweep a good man is labeled scum and jailed. Again no doubt he broke the law. For the benefit of a single 22 pistol removed from society, a good man is ruined for life.\n \n VOR do you think 4 months is a short time to spend for a non violent man to be in close association with life long rapist and murderers? I wonder if Michael Dagget was raped in prison. I hope not.\n \n UK is not gun control it is gun confiscation.", 
   {}, 
   8653, 
   null, 
   1054825620.0
  ], 
  [
   9016, 
   null, 
   "kelvin90701", 
   "In the UK criminals go to parties and shoot in the air just for fun:\n \n http://www.telegraph.co.uk/opinion/main.jhtml?xml=/opinion/2003/01/05/do0502.xml\n \n But but but , I thought there were no guns in the UK. Lots of witnesses, but no one is \"getting involved\".", 
   {}, 
   8653, 
   null, 
   1054826400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Send all the scum to jail!!!", 
  "url": "http://www.4forums.com/political/gun-control-debates/639-send-all-scum-jail.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 639, 
  "discussion_files": [
   [
    "25877.html", 
    "http://www.4forums.com/political/gun-control-debates/639-send-all-scum-jail-print.html"
   ]
  ], 
  "identifier": 639
 }
]