[
 [
  [
   161540, 
   null, 
   "Sasha", 
   "Babies disappearing from Ukrainian maternity clinics\n \n Ukraine: PACE rapporteur investigates alleged disappearance of newborn children in Kharkov\n \n In Ukraine, expectant mothers are afraid of giving birth to their arrivals in federal maternity clinics. An investigation has been instituted in Ukraine concerning alleged disappearance of newborn babies taken away from their mothers a few hours after being born in a few clinics in Kharkov.\n According to reports, during investigation progress Ukrainian police were only able to trace a certain intermediator company Illadia headed by Karina Ibragimova, a Chechen by nation, while all other cooperators of the company were her relatives - all are currently in federal search. According to the first results of the investigation, it was found that babies and organs had been sold to the US for a good buck accompanied with falsified papers. It was said that in all over 300 babies were missing in several Ukrainian clinics. Unfortunately, their afterlife unknown.", 
   {
    "post_info": {
     "post_title": "Babies disappearing from Ukrainian maternity clinics"
    }
   }, 
   null, 
   null, 
   1126531920.0
  ], 
  [
   161541, 
   null, 
   "Anneke", 
   "One way or another, but that's only after the Orange Revolution that Ukraine grew into a marketplace of babies and blood cells extracted from human fetuses. That's revolting! We never used to have anything of the kind down here! As for Ukrainian Minister of Health, he was simply lying in teeth into cameras when saying such experiments on human bodies would never take place in Ukraine!... \n According to my own experience, I know that in some clinics here medics sort of detect \"pregnancy failures\" and under various excuses persuade prospective mothers into a free abortion... The same happened to me too. I was pregnant and they said I had some kind of \"pregnancy failure\" and even could die in childbirth but I insisted on bearing the baby and never let it be taken from me even for a short while. And now it's all OK. I'm fine and my baby, too. \n As for that so called \"charity\" program \"Healthy Childhood - Mighty Ukraine\", do you know who it is sponsored by? You'll never guess... It's president Yushchenko's wife Katherine Chumachenko who curates a chain of clinics and maternity homes in Ukraine. Then, maybe, SHE knows something about the missing babies? Why not ask HER?", 
   {
    "post_info": {
     "post_title": "One way or another, but that's only after the Orange Revolution that Ukraine"
    }
   }, 
   161540, 
   null, 
   1126532760.0
  ], 
  [
   161635, 
   null, 
   "Bassman", 
   "Anneke, you are very courageous. I wish we could say the same for the 50-million unborn babies murdered for the sake of \"choice\" emoticon_xangel", 
   {}, 
   161541, 
   null, 
   1126571160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Babies disappearing from Ukrainian maternity clinics", 
  "url": "http://www.4forums.com/political/current-events-debates/6398-babies-disappearing-ukrainian-maternity-clinics.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6398, 
  "discussion_files": [
   [
    "32900.html", 
    "http://www.4forums.com/political/current-events-debates/6398-babies-disappearing-ukrainian-maternity-clinics-print.html"
   ]
  ], 
  "identifier": 6398
 }
]