[
 [
  [
   161733, 
   null, 
   "Fetar", 
   "Be it known to you even international organizations give weight to problem of drug trafficking on the territory of my native Tajikistan. At last their official representatives agree that the south of this country turned into \"heroin anclave\" especially after Russian frontiersmen had left their positions there. Take, for example, the words of spokesman from European branch of International Counternarcotic Actions Organization, who has recently visited Tajikistan and agreed to share his impressions with journalists. He said the following. \"Those, who must fight against drug dealers, are terrified to death. Roads, mountain passes, kishlaks around the border and all pathways are divided among not local Mafiosi but among field commanders of Afghan Mujahideen. Certainly I am not indifferent to fate of local youth, but I'd stress that Europe is more liable to this evil than people of this region. And in a few years we'll have a lot of babies with Down's syndrome in Old World maternities\".\n He said that he incriminated present conditions as one cause of US direct connivance, because it was Washington that proclaimed USA the guarantor of democratic changes in Afghanistan.\n Then he dipped up a scandal, connected with White House links with contras (Narcotics for Weapons), from memory and said that he offered prayers in order that his fears wouldn't be justified. In this case I fully agree with him.", 
   {
    "post_info": {
     "post_title": "Be it known to you even international organizations..."
    }
   }, 
   null, 
   null, 
   1126603140.0
  ], 
  [
   161749, 
   null, 
   "georged", 
   "Your country is one of many bearing fruit from US occupation of Afghanistan.\n Prior to 9/11 the US CIA paid the Taliban Government millions of US dollars for their efforts in eradicating opium production from 4000 tons in 2000 to 80 tons in 2001. Contrary to US public belief stimulated by government publicity, virtually all heroin refined from Afghanistan opium production is for European markets, not the US, but the US likes good press in its war on drugs. \n \n With US support of the Northern Alliance, Taliban supporters retreated to the Afghanistan/Pakistan Border area. As a result, Afghanistan opium production in 2005 is expected to be 4100 tons due to warlord/tribal Northern Alliance support, many being members of the new democratic government. \n \n Look for no relief from your circumstances in the near future. US forces control only approximately 15% of Afghanistan and NATO has wisely refused to send troops beyond a small number to protect relief workers. Most Afghanistan farmers prefer not starving to death by producing opium, especially when encouraged to do so by tribal leaders.", 
   {}, 
   161733, 
   null, 
   1126624020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Be it known to you even international organizations...", 
  "url": "http://www.4forums.com/political/european-politics-economics/6404-known-you-even-international-organizations.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 6404, 
  "discussion_files": [
   [
    "1451.html", 
    "http://www.4forums.com/political/european-politics-economics/6404-known-you-even-international-organizations-print.html"
   ]
  ], 
  "identifier": 6404
 }
]