[
 [
  [
   161813, 
   null, 
   "Captain America banned", 
   "After years of watching our president spin, distort, manipulate, pass the buck and outright lie, he surprises us all and holds himself accountable for the major screw up's on the federal level in response to Katrina.\n \n No kidding! He finally takes responsibility for something. Read it for yourself right here! \n \n I NEVER thought I'd see the day! emoticon_wow", 
   {
    "post_info": {
     "post_title": "News Flash!  Bush takes responsibility!"
    }
   }, 
   null, 
   null, 
   1126648860.0
  ], 
  [
   161817, 
   null, 
   "georged", 
   "After years of watching our president spin, distort, manipulate, pass the buck and outright lie, he surprises us all and holds himself accountable for the major screw up's on the federal level in response to Katrina.\n \n No kidding! He finally takes responsibility for something. Read it for yourself right here! \n \n I NEVER thought I'd see the day! emoticon_wow\n\n \n Does this mean he'll fire Chertoff?", 
   {}, 
   161813, 
   null, 
   1126650720.0
  ], 
  [
   161818, 
   null, 
   "sanguinekane", 
   "Does this mean he'll fire himself?", 
   {}, 
   161817, 
   null, 
   1126651140.0
  ], 
  [
   161819, 
   null, 
   "Dono", 
   "I think it was a good move. Faced with the unspinnable, he put the Buck filter on the oval office door on \"pause\", and stepped up. \n Dono", 
   {}, 
   161817, 
   null, 
   1126651200.0
  ], 
  [
   161843, 
   null, 
   "Master_Shake", 
   "I never thought I'd see the day either. Then again, I don't expect him to do much about it. I don't think Chertoff or anyone else for that matter will be fired. I don't expect him to really do anything about it, which almost makes the fact that he is taking responsibility empty.", 
   {}, 
   161819, 
   null, 
   1126656360.0
  ], 
  [
   161849, 
   null, 
   "Bassman", 
   "So what do you want to see, President Bush bawling his eyes out? C'mon. Incidentally he is only resonsible for the federal level. He did not take responsibilty for the entire operation! The ball is now in Louisiana's court. Let's watch the locals drop it again!", 
   {}, 
   161843, 
   null, 
   1126657260.0
  ], 
  [
   161863, 
   null, 
   "gnojek", 
   "Don't you feel relieved that Bush says he \"takes responsibility\"?\n \n What does he mean by it? Will anything change?\n Hell, no.\n \n What he's going to \"take responsibility\" for is sending in his buddies' companies to \"rebuild\" New Orleans. Let's just hope it doesn't go like Iraq, where we exclude the locals from any part of the reconstruction. \n \n Here's another article from those radical left wing lunatics at The Nation.\n \n http://www.thenation.com/doc/20050926/scheer0913\n \n \n Bush Is Fooling Nobody Now\n \n Robert Scheer\n \n There's never a terrorist around when you need one. Even a couple of suspicious-looking foreigners playing soccer near the Superdome as Katrina began to make landfall might have done the trick to get this easily distracted President focused. The war on terror is, after all, George W. Bush's obsession, obliterating any other consideration of the nation's well-being.\n \n With a terrorist sighting, Bush likely would not have lingered on his Crawford ranch vacation, which he interrupted only for politicking and fundraising opportunities. Nor would Condoleezza Rice have gone shoe shopping while the world witnessed the sorry spectacle of the Gulf Coast in deadly disarray. And surely Donald Rumsfeld, who blithely attended a San Diego Padres game as New Orleans was filling with water, wouldn't have dithered for days before sending in troops to aid desperate Americans.\n \n Even if our high officials bothered to care about the poor, mostly black victims of Katrina enough to change their schedules, the Administration would probably have bungled the relief effort anyway, because the Federal Emergency Management Agency is now run by political hacks appointed by Bush who know zilch about disaster relief. \n \n \"Brownie, you're doing a heck of a job,\" the President said to Michael Brown a few days before the FEMA chief was relieved of his oversight of the relief efforts after massive public pressure over the agency's response to the hurricane. Brown, who reportedly doctored his unimpressive résumé and didn't have a background in emergency management, resigned Monday. He had secured this plum job because he was a college buddy of his predecessor, Joe Allbaugh, who managed Bush's 2000 presidential campaign.\n \n During the Clinton years, FEMA was turned into a model of efficiency, as demonstrated after the Northridge earthquake and the Oklahoma City bombing. How bizarre, then, that in the wake of 9/11, the Administration handicapped FEMA by axing its Cabinet-level status, turning it back into what some call a \"turkey farm\" for patronage jobs and slashing its budget because, as Allbaugh complained, it had become \"an oversized entitlement program.\"\n \n Then there is the fact that the first-responder corps has been vastly depleted by Bush's misadventure in Iraq. Visiting New Orleans on Monday, Bush argued that \"it is preposterous to claim that the engagement in Iraq meant there weren't enough troops\" to help with hurricane relief. Oh yeah? Tell that to the nearly 35 percent of Louisiana's Army and Air National Guard forces and 37 percent of Mississippi's National Guard troops deployed abroad, mostly in Iraq. \"Had [they] been at home and not in Iraq, their expertise and capabilities could have been brought to bear,\" said Army Lt. Gen. H. Steven Blum, the National Guard Bureau's chief, referring to the critical first hours of the disaster.\n \n Unfortunately, what the Bush White House is good at when it comes to national security is providing flash over substance, as Democratic Sen. Mary Landrieu of Louisiana found out the hard way. After riding in a helicopter with the President and seeing machinery apparently working on the breached 17th Street levee, she was shocked the next day to find the work mysteriously stopped. \"Flying over this critical spot again this morning, less than 24 hours later, it became apparent that yesterday we witnessed a hastily prepared stage set for a presidential photo opportunity; and the desperately needed resources we saw were this morning reduced to a single, lonely piece of equipment,\" said the senator in a press release.\n \n For far too long, this kind of shenanigan worked well for Bush, allowing him to narrowly win a second term. His Administration was asleep at the switch on 9/11 even though \"the system was blinking red,\" according to the then-CIA chief. Bush grabbed a bullhorn at ground zero and remade himself as a \"war president\"--and suffered no real political damage from the failure to either capture Osama bin Laden or find weapons of mass destruction in Iraq.\n \n But, as one of this nation's greatest war Presidents said, you cannot fool all of the people all of the time. With the Iraq war grinding on with no end in sight and the postmortems of the Katrina debacle showing the White House and Homeland Security Department to have been as confused and inept as FEMA itself, Bush's support in several national polls has continued a steady plunge to below 40 percent. A Newsweek poll found that, for the first time, less than a majority of Americans felt Bush possesses \"strong leadership qualities,\" his signature claim to fame. Boy, have they got that right. \n\n \n All we need now is for Bush to admit that he's \"A Disaster President.\"\n He's already proven it.\n \n\n \"[Bush] is a strong president...but he has never really focused on the importance of good execution.\" --William Kristol, editor of the Weekly Standard, in theWashington Post, Monday, September 5\n\n \n I should start a poll with these options:\n \n * - Bush fools people.\n * - Bush doesn't fool anyone.", 
   {
    "post_info": {
     "post_title": "It's still spin."
    }
   }, 
   161849, 
   null, 
   1126658640.0
  ], 
  [
   161904, 
   null, 
   "OccamsRazor", 
   "Bush has nothing to loose now with regard to this: he is in his second term and will not have to face the polls again so can take some heat, particularly when the matter has limited public visibility over time.\n \n On the other hand we won't see a similar performance with regard to Iraq where he is much more responsible for a far bigger mess. Also, the next Repblican Presidential candiate will be judged on Iraq as the US will still very heavily committed by the time the 2008 elections come up: acceptance of failure in Iraq will cannot be attached to Bush and be carried away with him- that is a responsibilty the Republican party as whole will bear.", 
   {}, 
   161813, 
   null, 
   1126662900.0
  ], 
  [
   161953, 
   null, 
   "snakespit", 
   "I think the big question should be, is anyone else going to step up and take responsibility for their roles in the poor response? It makes some people feel warm and fuzzy that they can lay the blame on the shoulders of one man, especially when it is George Satan Bush, but lets face it, he is just the top of the iceberg. It was not just the lack of decisive action on the part of the president that led to the slow response. This disaster, like any other, was years in the making and preceeded by a long chain of events. A large portion of this is the lack of a proper plan for dealing with this disaster. But then again, how does anyone prepare for a disaster of this magnitude? The events that took place in N.O. are for all intents and purposes are unprecedented in our nations history. There is a learning curve here.\n \n I think the most important thing we need to do is learn from this. People want to play the blame game and call for people to be fired and replaced, but what does this actually accomplish? Taking what we have learned, looking at what worked and what didn't, and using these facts to make a better plan for the next big disaster will accomplish far more than pointing fingers. I do this on a much smaller scale at work on a regular basis. If we have an unusually nasty incident or accident, we will sit down afterwards, talk about what worked and what didn't, and what we can do next time to make our response to a similar incident work better. We don't need to build a new mouse trap, we need to build a better mouse trap.", 
   {}, 
   161904, 
   null, 
   1126680840.0
  ], 
  [
   161958, 
   null, 
   "Jo Bennett", 
   "It's one thing to say you take responsibility, another to actually prove it with your actions, like resignation for example...", 
   {}, 
   161953, 
   null, 
   1126702020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  News Flash!  Bush takes responsibility!", 
  "url": "http://www.4forums.com/political/current-events-debates/6407-news-flash-bush-takes-responsibility.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6407, 
  "discussion_files": [
   [
    "17907.html", 
    "http://www.4forums.com/political/current-events-debates/6407-news-flash-bush-takes-responsibility-print.html"
   ]
  ], 
  "identifier": 6407
 }
]