[
 [
  [
   162129, 
   null, 
   "Matthew S", 
   "I am comming to believe that our system of winner take all is extremly unfair to the losers. What I would like to see is a sub government for the minority. With a second congress that has veto power over the majority when it comes to laws and issues that effect the minority. There must be some compromise possible. It seems that when the conservatives loose they are sore losers and attack the liberals. When the liberals loose they are sore losers and attack the conservatives. There must be some way to stop the distruction that is occurring in the USA.\n \n Any ideas?", 
   {
    "post_info": {
     "post_title": "A new government"
    }
   }, 
   null, 
   null, 
   1126754700.0
  ], 
  [
   162131, 
   null, 
   "Dzeron", 
   "I say, we should just have the government leave non-voters alone. So if liberals are afraid of being ruled by conservative moralism, or conservatives are afraid of being ruled by liberal socialism, they can have the option of governing only themselves and not governing anyone else.", 
   {}, 
   162129, 
   null, 
   1126755960.0
  ], 
  [
   162137, 
   null, 
   "Steeeeve", 
   "I suggest stop thinking that every want is a right. After this we can move on. The majority should always rule (like that quote I sent you) but the rights of the minority should not be infringed upon. I would say there aren't too many cases now where the government infringes upon others rights (although there are some). The only way to stop this is to get the people to believe this and change the law. Unless we have an all knowing ruler, this is the best way to do it.", 
   {}, 
   162131, 
   null, 
   1126758120.0
  ], 
  [
   162159, 
   null, 
   "Matthew S", 
   "I suggest stop thinking that every want is a right. After this we can move on. The majority should always rule (like that quote I sent you) but the rights of the minority should not be infringed upon. I would say there aren't too many cases now where the government infringes upon others rights (although there are some). The only way to stop this is to get the people to believe this and change the law. Unless we have an all knowing ruler, this is the best way to do it.\n\n \n \n Quite frankly majority rule sucks. You would feel the same way if you were in the minority. Hopefully one day evangelical christianity, and conservatisim will die off. IMHO that day can not come fast enough.", 
   {}, 
   162137, 
   null, 
   1126781460.0
  ], 
  [
   162162, 
   null, 
   "Big_Bear_Scot", 
   "I am comming to believe that our system of winner take all is extremly unfair to the losers. What I would like to see is a sub government for the minority. With a second congress that has veto power over the majority when it comes to laws and issues that effect the minority. There must be some compromise possible. It seems that when the conservatives loose they are sore losers and attack the liberals. When the liberals loose they are sore losers and attack the conservatives. There must be some way to stop the distruction that is occurring in the USA.\n \n Any ideas?\n\n \n Instead of that why don't you guys have Proportional Representation as your main system for elections to the Senate or Congress, or even both. That way you would have a more representative House where even smaller parties(such as the Greens and the Libertarians) might be represented there.\n \n The President would still be elected in the traditional manner.", 
   {}, 
   162129, 
   null, 
   1126785360.0
  ], 
  [
   162200, 
   null, 
   "georged", 
   "Instead of that why don't you guys have Proportional Representation as your main system for elections to the Senate or Congress, or even both. That way you would have a more representative House where even smaller parties(such as the Greens and the Libertarians) might be represented there.\n \n The President would still be elected in the traditional manner.\n\n \n Too reasonable. That would eliminate our duopoly political control.", 
   {}, 
   162162, 
   null, 
   1126802760.0
  ], 
  [
   162211, 
   null, 
   "Big_Bear_Scot", 
   "Too reasonable. That would eliminate our duopoly political control.\n\n \n Exactly the Big Two don't want to lose control they basically have a strangle hold on US politics. \n \n Could that be one of the reasons why Voter turn out is so low ? \n People realise that no matter who they vote for one of big two will hold all the power.", 
   {}, 
   162200, 
   null, 
   1126804380.0
  ], 
  [
   162251, 
   null, 
   "georged", 
   "\n Could that be one of the reasons why Voter turn out is so low ? \n People realise that no matter who they vote for one of big two will hold all the power.\n\n \n IMO low voter turn out is more a sign of apathy and laziness in the general population. As long as a majority have full bellies and mindless entertainment, political change is not a consideration. Let me put it this way; if the general population had the ability to consider what we're (US) fiscally doing to their children and grandchildren, would they not demand political reform?", 
   {}, 
   162211, 
   null, 
   1126808100.0
  ], 
  [
   162356, 
   null, 
   "Bassman", 
   "IMO low voter turn out is more a sign of apathy and laziness in the general population. As long as a majority have full bellies and mindless entertainment, political change is not a consideration. Let me put it this way; if the general population had the ability to consider what we're (US) fiscally doing to their children and grandchildren, would they not demand political reform?\n\n Agreed. We just had a primary here in Erie County and many of the same pea-brains on the County legislature are on the ballot in November. Looks like the \"taxpayer revolt\" that was supposed to bring massive change fizzled out. On the bright side, seven of the fifteen legislators are not coming back.", 
   {}, 
   162251, 
   null, 
   1126824720.0
  ], 
  [
   162358, 
   null, 
   "Bassman", 
   "Quite frankly majority rule sucks. You would feel the same way if you were in the minority. Hopefully one day evangelical christianity, and conservatisim will die off. IMHO that day can not come fast enough.\n\n Ain't gonna happen emoticon_xangel", 
   {}, 
   162159, 
   null, 
   1126824840.0
  ], 
  [
   163265, 
   null, 
   "zachvac", 
   "Ain't gonna happen emoticon_xangel\n\n \n \n Well the number of Christians in the world and the US is going down gradually and the poll numbers of our president (this doesn't exactly talk about all of Conservativism, especially since he isn't exactly conservative) are dropping. But in terms of Christianity, I think it shouldn't matter if one person or all but one person were Christian in terms of government. Religion shouldn't be recognized by government, and the rights of Christians should be protected no matter how many people they have.", 
   {}, 
   162358, 
   null, 
   1127024820.0
  ], 
  [
   163329, 
   null, 
   "georged", 
   "Quite frankly majority rule sucks. You would feel the same way if you were in the minority. Hopefully one day evangelical christianity, and conservatisim will die off. IMHO that day can not come fast enough.\n\n \n Depending on whose numbers you like, Pew or others, US followers of Christianity will drop below 50% of the US population around 2035. Fundamentalists, due to their inflexibility, will take the biggest hit due to higher education becoming more widespread at the parenting level.", 
   {}, 
   162159, 
   null, 
   1127055900.0
  ], 
  [
   163368, 
   null, 
   "Bassman", 
   "Depending on whose numbers you like, Pew or others, US followers of Christianity will drop below 50% of the US population around 2035. Fundamentalists, due to their inflexibility, will take the biggest hit due to higher education becoming more widespread at the parenting level.\n\n Oh yeah. Higher education: the last bastion of liberal indoctrination. I also dispute those numbers, because more and more teens are becoming Christians now.", 
   {}, 
   163329, 
   null, 
   1127060100.0
  ], 
  [
   163425, 
   null, 
   "georged", 
   "Oh yeah. Higher education: the last bastion of liberal indoctrination. I also dispute those numbers, because more and more teens are becoming Christians now.\n\n \n Perhaps you prefer disputing:\n \n http://www.religioustolerance.org/chr_tren.htm\n \n Or this:\n \n ~The Barna Research Group (BRG) of Ventural, CA, is the leading religious pollster in theU.S. since 1984. Recent research conducted by BRG has found that the percentage of American adults who identify themselves as Christians has dropped from 86% in 1990 to 77% in 2001. During this same period, the population of America has increased by 9%. At the present rate of change, the majority of the American population will not be Christian by the year 2035.~\n \n You do understand the statistical ramification of decreasing Christianity exceeding the birth rate? \n \n A primary purpose of higher education is expanding knowledge, which normally leads to individuals seeking additional knowledge on their own initiative without continued formal instruction. Not a good scenario for perpetuation of mythical belief systems unless one is on the control side of those circumstances. Using rhetorical labels such as liberal indoctrination to define higher education generally signifies a lack of higher education. Even conservatives such as myself are proud of our educations and the opportunities they offer for personal growth and assisting in our contributions to society.", 
   {}, 
   163368, 
   null, 
   1127064720.0
  ], 
  [
   163447, 
   null, 
   "Big_Bear_Scot", 
   "Oh yeah. Higher education: the last bastion of liberal indoctrination. \n\n \n That is scary. No wonder the US is in danger of losing its World lead in Technology and innovation if that is the attitude of some of its citizens.\n \n If you haven't noticed most of the architects of the Bush doctrine & even current memeber of the Government have went through the Higher Education system such as George Bush, Condi Rice, Paul Wolfowitz and Donald Rumsfeld.\n \n It must really fail at indoctrination if these people went through that system.", 
   {}, 
   163368, 
   null, 
   1127067060.0
  ], 
  [
   163459, 
   null, 
   "Bassman", 
   "\n A primary purpose of higher education is expanding knowledge, which normally leads to individuals seeking additional knowledge on their own initiative without continued formal instruction. Not a good scenario for perpetuation of mythical belief systems unless one is on the control side of those circumstances. Using rhetorical labels such as liberal indoctrination to define higher education generally signifies a lack of higher education. Even conservatives such as myself are proud of our educations and the opportunities they offer for personal growth and assisting in our contributions to society.\n\n Hey, I'm just a working stiff who happens to be a Christian. If you think higher education is the end-all be-all, then you're sadly mistaken.", 
   {}, 
   163425, 
   null, 
   1127067720.0
  ], 
  [
   163473, 
   null, 
   "georged", 
   "Hey, I'm just a working stiff who happens to be a Christian. If you think higher education is the end-all be-all, then you're sadly mistaken.\n\n \n Please expound on why even mediocre higher education is not the best solution for improving the ability of any country's population to better grasp reality, improve workforce quality and enhance quality of social structure. \n \n And your response to disputing my numbers on the decline of Christianity, with nationally accepted references, is?", 
   {}, 
   163459, 
   null, 
   1127070360.0
  ], 
  [
   163475, 
   null, 
   "lord tammerlain", 
   "Hey, I'm just a working stiff who happens to be a Christian. If you think higher education is the end-all be-all, then you're sadly mistaken.\n\n \n \n Higher education is one of the surest ways to financial, personal and social achievement for an individual.\n \n Higher education is fundamental to the long term success of any country.", 
   {}, 
   163459, 
   null, 
   1127070900.0
  ], 
  [
   163547, 
   null, 
   "Bassman", 
   "Higher education is one of the surest ways to financial, personal and social achievement for an individual.\n \n Higher education is fundamental to the long term success of any country.\n\n So, you're saying that a person who tried college, but was never good at it and left after two years is inferior? What about people who take up a trade? Are they inferior to your elitist attitude? For your info, I'm a professional driver, I hold a commercial drivers' licence, can drive anything from a tractor-trailer on down and am doing very well without a bachelor's or a master's degree, thank you.", 
   {}, 
   163475, 
   null, 
   1127088300.0
  ], 
  [
   163562, 
   null, 
   "georged", 
   "So, you're saying that a person who tried college, but was never good at it and left after two years is inferior? What about people who take up a trade? Are they inferior to your elitist attitude? For your info, I'm a professional driver, I hold a commercial drivers' licence, can drive anything from a tractor-trailer on down and am doing very well without a bachelor's or a master's degree, thank you.\n\n \n The elitist card? Good luck in life with that attitude. Your post defined higher education as liberal indoctrination. Some people in contemporary society aren't, for a variety of reasons, some valid, others not valid, suitable for higher education. Every person who contributes to the welfare of a society is of equal moral value. Advancement of that society is dependent on those who go beyond the norm, be it in the social or hard sciences, commerce, or other endeavors that benefit more than the individual making those advances. The more people who are capable of going beyond the norm using higher education as a platform, the larger society's base of intellectualism becomes and the faster it advances in adapting to changing conditions. \n \n Your posts suggest that your ideology is composed of a fascist base driven by a fundamentalist belief system with a stated disregard for higher education. I suggest you take a look at higher education, past and present, on a global basis, as our world has evolved. In the 2003-4 academic year, the US experienced a drop in college and university enrollments for the first time in 30-years. Look at China and India, and to a lesser extent, Europe, where primary and secondary education has been empathized to a level encouraging continuing education where by 2010 China will surpass the US in science and engineering graduates. Whether you're aware of it or not, our educational system is generally failing and that's a strong indicator of a declining nation unwilling to accept change for whatever reasoning.", 
   {}, 
   163547, 
   null, 
   1127091180.0
  ], 
  [
   163565, 
   null, 
   "Big_Bear_Scot", 
   "So, you're saying that a person who tried college, but was never good at it and left after two years is inferior? What about people who take up a trade? Are they inferior to your elitist attitude? For your info, I'm a professional driver, I hold a commercial drivers' licence, can drive anything from a tractor-trailer on down and am doing very well without a bachelor's or a master's degree, thank you.\n\n \n I don't know what it is like in the US but working class families in Scotland aspire to sending their children to University. It is seen as the best way for a person to gain skills that they would never get from working in a trade. It is also a good way for people of the working class to move away from the poverty of their birth place, in other words a great way to earn a decent living.\n \n I am surprised that an avowed conservative would be disdainful of someone working hard to better themselves, and yes it was hard work, even though my fees paid for me by the State I still had to work 6 days a week to pay for books and the like. I couldn't imagine what it would have been like if I had to pay my fees as well.\n \n \nIn the 2003-4 academic year, the US experienced a drop in college and university enrollments for the first time in 30-years. Look at China and India, and to a lesser extent, Europe, where primary and secondary education has been empathized to a level encouraging continuing education where by 2010 China will surpass the US in science and engineering graduates. Whether you're aware of it or not, our educational system is generally failing and that's a strong indicator of a declining nation unwilling to accept change for whatever reasoning.\n \n \n If the number of Graduates from the Science and Tech subjects are decreasing that will almost certainly impact on the US World lead in that area. \n This will impact the future Economy of the US, people are concerned about out-sourcing of jobs in the service and industry sector at the moment. Imagine what it will be like in a few years time when companies can not able to recruit the amount of Graduates they need. They will outsource to Europe or China/India. It would probably be the death knell for the US Economy.", 
   {}, 
   163547, 
   null, 
   1127091480.0
  ], 
  [
   163583, 
   null, 
   "georged", 
   "I don't know what it is like in the US but working class families in Scotland aspire to sending their children to University. It is seen as the best way for a person to gain skills that they would never get from working in a trade. It is also a good way for people of the working class to move away from the poverty of their birth place, in other words a great way to earn a decent living.\n \n I am surprised that an avowed conservative would be disdainful of someone working hard to better themselves, and yes it was hard work, even though my fees paid for me by the State I still had to work 6 days a week to pay for books and the like. I couldn't imagine what it would have been like if I had to pay my fees as well.\n \n \n \n If the number of Graduates from the Science and Tech subjects are decreasing that will almost certainly impact on the US World lead in that area. \n This will impact the future Economy of the US, people are concerned about out-sourcing of jobs in the service and industry sector at the moment. Imagine what it will be like in a few years time when companies can not able to recruit the amount of Graduates they need. They will outsource to Europe or China/India. It would probably be the death knell for the US Economy.\n\n \n I also bought my books, partially paid my tuition, worked at anything that paid for as many days and hours as I could get and drove vehicles that would forcibly be taken off the road as visually unsafe in contemporary society. I looked at full-time summer jobs of 8-12 hours a day between then semesters as a real break. But it was well worth it. \n \n The potential impact of declining higher education in the US resulting from both poor quality of primary and secondary education and lack of individual motivation/direction (money is not an issue for those scholastically inclined), is a very alarming statistic. When looking at abnormal amounts of public debt the US is amassing in a very short period of time, none of which is directed at future improvements to facilitate economic growth, diminished exports of technology will eventually devastate the already shrinking tax base and horrific payment imbalance. Add those factors to the migration from industrial to service economy and we're obviously being governed by lunatics living in the past. Unfortunately, many of our citizens also live in the past while relying on mythical belief systems and bent politicians for direction and the US is a democracy.", 
   {}, 
   163565, 
   null, 
   1127095560.0
  ], 
  [
   163669, 
   null, 
   "lord tammerlain", 
   "So, you're saying that a person who tried college, but was never good at it and left after two years is inferior? What about people who take up a trade? Are they inferior to your elitist attitude? For your info, I'm a professional driver, I hold a commercial drivers' licence, can drive anything from a tractor-trailer on down and am doing very well without a bachelor's or a master's degree, thank you.\n\n \n \n Nothing of the sort, but a university education, opens doors for people that would not usually be open to people. Lifetime earnings for University grad are on average significantly higher then for non univeristy grads. \n \n A univeristy education is a tool, that helps people achieve things that they generally could not otherwise. You have a special skill that can I believe pay very well but is somewhat limited in the number of career options that it opens.\n \n People without a university education can achieve great things and go very far in life, but it is generally harder and not as likely. The Preimer of Alberta, doesnt have a HS diploma, but has done well", 
   {}, 
   163547, 
   null, 
   1127152860.0
  ], 
  [
   163703, 
   null, 
   "Alan Ryan", 
   "\n A univeristy education is a tool, that helps people achieve things that they generally could not otherwise. You have a special skill that can I believe pay very well but is somewhat limited in the number of career options that it opens.\n \n\n The only \"real\" job I've ever had (apart from my time in the military) was during my vacations as a student, when I toiled as a weedkiller on the docks and railroad yards. The experience was a useful corrective to my assumptions about the reality of manual labour.\n \n Even if you never reach the \"top\" in your chosen occupation, a university education pays off in countless ways that cannot be remunerated. I'm talking here about the life of the mind.", 
   {}, 
   163669, 
   null, 
   1127155500.0
  ], 
  [
   163767, 
   null, 
   "georged", 
   " a university education pays off in countless ways that cannot be remunerated. I'm talking here about the life of the mind.\n\n \n For me, just the association with such a wide variety of people in a non-secular/non-peer group atmosphere presented viable challenges regarding preconceptions I had been raised with while opening my mind as to how complex society actually is. And, as you suggest, true mental growth started that never really slowed down. When unhindered by those preconceptions, the mind is a wondrous thing.", 
   {}, 
   163703, 
   null, 
   1127165520.0
  ], 
  [
   163771, 
   null, 
   "Eddie", 
   "Seriously though, why would anyone need education? The end times is coming, right? And on judgement day your education is pointless. After all, all the relevant truths can be found in the bible. So take your evil education somewhere else because decent god-fearing christians like me don`t want it! And unlike you heathen evolutionists, we are not going to burn in eternity for our sins. emoticon_xclown", 
   {}, 
   163767, 
   null, 
   1127166000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A new government", 
  "url": "http://www.4forums.com/political/government-debates/6412-new-government.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 6412, 
  "discussion_files": [
   [
    "12389.html", 
    "http://www.4forums.com/political/government-debates/6412-new-government-print.html"
   ], 
   [
    "12390.html", 
    "http://www.4forums.com/political/government-debates/6412-new-government-2-print.html"
   ]
  ], 
  "identifier": 6412
 }
]