[
 [
  [
   164394, 
   null, 
   "The Concerned", 
   "Apparently Hampden-Sydney, the school I attend and love is the most anti-homosexual school in the nation at the moment. Here's the list of intolerant schools.\n \n 1. Hampden-Sydney College\n 2. University of Notre Dame\n 3. Baylor University\n 4. Wheaton College (IL)\n 5. Grove City College\n 6. University of Tennessee - Knoxville\n 7. Texas A&M University-College Station\n 8. College of the Holy Cross\n 9. Samford University\n 10. Brigham Young University (UT)\n 11. Seton Hall University\n 12. Valparaiso University\n 13. Pepperdine University\n 14. Washington and Lee University\n 15. Trinity College (CT)\n 16. Vanderbilt University\n 17. Wake Forest University\n 18. University of Utah\n 19. Providence College\n 20. Southern Methodist University\n \n This is embarrassing... I am not gay, and I find it incredibly offensive that so many students of my college who consider themselves well-educated and privileged should be so ignorantly intolerant. This kind of intolerance should not be allowed for any particular group or towards any individual. I understand that everyone is entitled to their own opinion, that is well and good, but where do the bounds between word and verb blur? Must we wait until someone has been physically hurt? The threat of physical violence is not only debasing to the freedoms we hold dear as a society but is an expression of true ignorance and a lack of creativity. No one should feel threatened for what or who they are, be they gay, black, atheist or simply different. People have every right to disagree, but they have no right to threaten physical harm. It seems to me that this is where lines must be drawn. Once that becomes acceptable, or overlooked, the very basic freedoms that we all hold dear come under fire and the comfort of living within such a society becomes a burden. \n Please write to the administration of our school about how you feel and about how you feel this problem might be addressed. It seems to me that the community here is so ignorant of the issue that it will take some outside support to really make a difference.\n \n Thank you for your time and help.\n Here's the address:\n \n Hampden-Sydney College\n Hampden-Sydney, VA 23943", 
   {
    "post_info": {
     "post_title": "A Distinct Problem"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1127268660.0
  ], 
  [
   164423, 
   null, 
   "emoreno2292", 
   "What evidence do you have of such intolerance? This is making me reconsider... I am actually looking at several of the schools on this list. I guess I will be reconsidering!", 
   {}, 
   164394, 
   null, 
   1127272200.0
  ], 
  [
   164424, 
   null, 
   "emoreno2292", 
   "Have you noticed any anti-homosexual or anti-non white christian straight male type attitudes? Can you give any specifics as to how your school in particular is the most anti homosexual school?\n Thanks!", 
   {}, 
   164423, 
   null, 
   1127272260.0
  ], 
  [
   164425, 
   null, 
   "joebrummer", 
   "I am surprised a little to see Providence College on the list....they are not gay friendly but they do have a gay straigtht alliance and an office of gay studies....I am from providence so I have been there.", 
   {}, 
   164424, 
   null, 
   1127272320.0
  ], 
  [
   164430, 
   null, 
   "Steeeeve", 
   "haha I live in VA and know some people that go there. HOw is Liberty not up there? Or Virginia Tech (my school) for that matter...I guess we aren't because we have the LGBTA on the front of the paper everyday...which is annoying I might add.", 
   {}, 
   164425, 
   null, 
   1127272800.0
  ], 
  [
   164466, 
   null, 
   "The Concerned", 
   "I can't give specific examples for the sake of the privacy of certain individuals. In a general sense, though, there was a threat of physical violence if a certain individual didn't leave campus because of his personal life-style choice. Also, there are very few African-Americans at the school, as well as Asians, or other groups. It seems there are only as many as will fit the quota, but, on a side note, Hampden-Sydney isn't exactly the most famous school abroad so I'm not entirely sure what those demographic statistics are due too. This school is accepting of most white males, so that isn't an issue. The issues tend to be with blacks and gays. There was an instance where a black individual pledged a frat, and a number of fellow pledges dropped out just because the black individual was pledging. Stuff like that is entirely too common here and almost always overlooked.\n I have been part of the group who has simply overlooked these acts and accepted them as just being part of the \"Southern tradition.\" That goes to show how common it is around here, and I won't let that stand anymore. It infuriates me the more I consider it. There is no excuse for it and I should have done or said something about it sooner. No tradition, should it infringe upon the ability of someone to live at ease and in comfort and in freedom, should go unnoticed.\n For these and many other reasons I am asking people to at least write and tell the administration that they think something should be done and give ideas. Voices outside of the school are often more effective than just a few from inside the school. Incidently, I will be discussing these issues with the administration as well, so I will be doing my part, too.\n \n -The Concerned", 
   {}, 
   164430, 
   null, 
   1127277000.0
  ], 
  [
   164470, 
   null, 
   "The Concerned", 
   "What evidence do you have of such intolerance? This is making me reconsider... I am actually looking at several of the schools on this list. I guess I will be reconsidering!\n\n \n I don't want to dissuade you from applying to Hampden-Sydney, not by a long shot. It is a very good school academically, but there are a lot of students here who have been brought up in such a way that they never really had to decide on anything themselves. This has helped foster some of the ignorant views they hold.\n \n Also, remember that not all Hampden-Sydney students are prejudiced. Not by a longshot. I know many upstanding individuals who attend this school and will most likely support me in my efforts. However, there are a lot more prejudiced people here than there should be. That is why I wish to address the issue.\n \n -The Concerned", 
   {}, 
   164423, 
   null, 
   1127277120.0
  ], 
  [
   164530, 
   null, 
   "jyoshu", 
   "I don't want to dissuade you from applying to Hampden-Sydney, not by a long shot. It is a very good school academically, but there are a lot of students here who have been brought up in such a way that they never really had to decide on anything themselves.\n\n \n From what I've seen, most college age kids are that way regardless of their politics.", 
   {}, 
   164470, 
   null, 
   1127316600.0
  ], 
  [
   164531, 
   null, 
   "Jaxian", 
   "From what I've seen, most college age kids are that way regardless of their politics.\n\n \n I didn't experience even a single incident of intolerance nor meet any individual who expressed hatred toward people of different sexual orientations at my college (University of Michigan - Dearborn), and I was a rather vocal member of the LGBT rights organization there.", 
   {}, 
   164530, 
   null, 
   1127317080.0
  ], 
  [
   164548, 
   null, 
   "jyoshu", 
   "I didn't experience even a single incident of intolerance nor meet any individual who expressed hatred toward people of different sexual orientations at my college (University of Michigan - Dearborn), and I was a rather vocal member of the LGBT rights organization there.\n\n \n Well, I wasn't talking about intolerance and hatred necessarily. I was talking about his statement that \"there are a lot of students here who have been brought up in such a way that they never really had to decide on anything themselves.\" My point was that college kids' not thinking on their own probably has little to do with the school (which is a very conservative one, BTW). The phenomenon he's talking about happens with college kids of any political leaning, IMO anyway.", 
   {}, 
   164531, 
   null, 
   1127321880.0
  ], 
  [
   164567, 
   null, 
   "Jaxian", 
   "Well, I wasn't talking about intolerance and hatred necessarily. I was talking about his statement that \"there are a lot of students here who have been brought up in such a way that they never really had to decide on anything themselves.\" My point was that college kids' not thinking on their own probably has little to do with the school (which is a very conservative one, BTW). The phenomenon he's talking about happens with college kids of any political leaning, IMO anyway.\n\n \n Well, I again disagree, based solely on my own experiences. My political ideology began in college, and I consider myself to have determined my ideology by gaining knowledge of political theory in college, then applying that knowledge to our present-day government. Or perhaps you believe that I do not think for myself but instead have absorbed opinions fed to me?", 
   {}, 
   164548, 
   null, 
   1127323500.0
  ], 
  [
   164576, 
   null, 
   "jyoshu", 
   "Well, I again disagree, based solely on my own experiences. My political ideology began in college, and I consider myself to have determined my ideology by gaining knowledge of political theory in college, then applying that knowledge to our present-day government. Or perhaps you believe that I do not think for myself but instead have absorbed opinions fed to me?\n\n \n I don't know whether you do that or not. I'm just saying that failure to think for oneself knows no particular political ideology.", 
   {}, 
   164567, 
   null, 
   1127324340.0
  ], 
  [
   164590, 
   null, 
   "Jaxian", 
   "I don't know whether you do that or not. I'm just saying that failure to think for oneself knows no particular political ideology.\n\n \n Ah, well I definitely agree with that. Lots of people on any side of the political fence do not think for themselves. On the other hand, I think there are people from any political ideology who do think for themselves.", 
   {}, 
   164576, 
   null, 
   1127325960.0
  ], 
  [
   164695, 
   null, 
   "Bassman", 
   "Really? I don't think so.emoticon_rolleyes The left considers conservatives to be stupid.", 
   {}, 
   164590, 
   null, 
   1127343000.0
  ], 
  [
   164698, 
   null, 
   "Jaxian", 
   "Surely you agree that conservatives think liberals are stupid just as much as liberals think conservatives are stupid.", 
   {}, 
   164695, 
   null, 
   1127343540.0
  ], 
  [
   164700, 
   null, 
   "Bassman", 
   "No, I don't. But the feel I'm getting from the left is a condescending, elitist attitude.", 
   {}, 
   164698, 
   null, 
   1127343840.0
  ], 
  [
   164709, 
   null, 
   "Michele", 
   "Several of these schools are Catholic, including PC, correct? Brigham Young is Morman. Maybe a religious thing?", 
   {}, 
   164700, 
   null, 
   1127345040.0
  ], 
  [
   164738, 
   null, 
   "The Concerned", 
   "Several of these schools are Catholic, including PC, correct? Brigham Young is Morman. Maybe a religious thing?\n\n \n I couldn't quite say what the exact cause is, but yes, a lot of the schools do seem to have religious backgrounds.", 
   {}, 
   164709, 
   null, 
   1127354340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A Distinct Problem", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6454-distinct-problem.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6454, 
  "discussion_files": [
   [
    "25323.html", 
    "http://www.4forums.com/political/gay-rights-debates/6454-distinct-problem-print.html"
   ], 
   [
    "25324.html", 
    "http://www.4forums.com/political/gay-rights-debates/6454-distinct-problem-2-print.html"
   ]
  ], 
  "identifier": 6454
 }
]