[
 [
  [
   8812, 
   null, 
   "SparkleSocks22", 
   "What about last season's American Idol? The first one. Do y'all think that Kelly Clarkson should have won?\n ------------------------------------------------------------------------------------\n My personal opinion is that she should have came in second and Tamyra (sp?) should have won! She was wonderful! Sure Kelly is good, but she just wasn't phenominal like Tamyra! Justin and Nikki should have been out WAY before then where they placed! I mean Nikki got 3rd!emoticon_confused I just don't see HOW she did! Justin was alright but not good! But if it was between Justin, Nikki, and Kelly..I pick Kelly everytime.", 
   {
    "post_info": {
     "post_title": "American Idol Season 1"
    }
   }, 
   null, 
   null, 
   1054678440.0
  ], 
  [
   8813, 
   null, 
   "Striel", 
   "I TOTALLY thought Tamyra should have won! And I was NOT a Justin fan at all. Kelly is good, but I think she should have come in second place.", 
   {}, 
   8812, 
   null, 
   1054678440.0
  ], 
  [
   8817, 
   null, 
   "SparkleSocks22", 
   "Wow we actually agree on something. :)", 
   {}, 
   8812, 
   null, 
   1054678620.0
  ], 
  [
   8877, 
   null, 
   "Debate_Queen615", 
   "It depends I could live with Kelly as the 1st place or Tamyra\n \n but Kelly can't really perform live she squeaks but she has a GREAT recording voice\n Tamyra though has an awsome voice", 
   {}, 
   8812, 
   null, 
   1054692000.0
  ], 
  [
   8936, 
   null, 
   "SparkleSocks22", 
   "Yea Kelly has a good voice for recording but when it does come to a live show...it seems that she doesn't have it like Tamyra does. Plus on recording she can do it however many times she wants but when its live u have one shot, you blow it to bad.", 
   {}, 
   8812, 
   null, 
   1054757220.0
  ], 
  [
   8939, 
   null, 
   "Striel", 
   "What do you think of that awful looking movie that Kelly and Justin have coming out?", 
   {}, 
   8812, 
   null, 
   1054757520.0
  ], 
  [
   8941, 
   null, 
   "SparkleSocks22", 
   "Oh my gosh that movie looks SO stupid! I mean they are just making it when the hype is still up about them...They should have already made it come out because the hype is moving to Ruben...America has found their new American Idol and Kelly is getting left in the dust...", 
   {}, 
   8812, 
   null, 
   1054757700.0
  ], 
  [
   8969, 
   null, 
   "katie5890", 
   "i personally thought that last season was WAYY better i mean it was actually a good competion most of them were all good, this season well i wasnt thrilled with n e of them.", 
   {}, 
   8812, 
   null, 
   1054778400.0
  ], 
  [
   8975, 
   null, 
   "SparkleSocks22", 
   "The only 2 people who have blown me away are Tamyra and Clay. I think they were the best out of each season.", 
   {}, 
   8812, 
   null, 
   1054783860.0
  ], 
  [
   8988, 
   null, 
   "katie5890", 
   "girl ur messed up if u think clay is good...i mean WOW super gaydude no guy should flutter their eyes like that...(i dont have n e thing against gay ppl just making a point)and sure he could sing ok but not great, AND clay's gotta get some muscles! hes a friggin stick.", 
   {}, 
   8812, 
   null, 
   1054786260.0
  ], 
  [
   8992, 
   null, 
   "SparkleSocks22", 
   "Messed up? wtf I don't think this is a debate on why if I am messed up or not...\n ANYWAYS\n Clay isn't gay and I wouldn't have a problem with him if he was! SO MANY PEOPLE HAVE PROBLEMS WITH GAY PEOPLE?! They are the real messed up ones. (I'm not implying that you have anything against gay people just making my point.) Look at Elton John, he is a GREAT singer! I love Elton he is awesome! I mean just because he is gay does not and I repeat DOES NOT take away ANYTHING from his amazing talent! (listening to Elton right now)\n Clay can flutter those eyes as much as he wants! I can flutter my eyes, you can, even Ruben CAN! He can do what he wants in his performance, it's his art. Not anyone else's.\n Clay doesn't have to get muscles if he doesn't want to! To many muscles anyways is gross! Clay looks fine the way he is, it's really the person within. It takes a really shallow person to only see the outside. Clay is a beautiful person within, and that shines outwards making him wonderful all around.", 
   {}, 
   8812, 
   null, 
   1054786860.0
  ], 
  [
   9044, 
   null, 
   "katie5890", 
   "girl what u talkin bout??? how do u know hes a beautiful person inside...do u know him?? I THINK NOT! a lot of people put on acts to the public but u know some of the stars are money craving mean people who have forgotten the \"little\" people. i have a big problem with this stff i mean how much can actors possibly do?? they resite lines and look pretty...well okay lets give them a billion dollars! while people like teachers are teaching the future america, and how much do they get a year??? okay i dont no:) but its not a lot!", 
   {}, 
   8812, 
   null, 
   1054852320.0
  ], 
  [
   9133, 
   null, 
   "SparkleSocks22", 
   "I don't know honey, but I am keeping the faith. The way he always is SO nervous about everything when coming to be kicked off the show is cute because he is a person. He's just not a singer but he's a person who is very nervous on this show when it comes down to where he stands. \n DO YOU KNOW HIM? I THINK NOT, so don't go around judging him calling him an ugly person inside AND out! Clay worked for YMCA so that right there show's he cares about others! What was Ruben doing b4 the show? I dunno probably just going to school but not helping the future of America, where Clay was training and helping kid's build futures. So don't be calling Clay an ugly person because he is beautiful. Sure it might be an act but he still helping the children and that's more than Ruben can say.\n Now the money issue is an ENTIRE different debate. I agree with you here that they should be getting paid LESS and teachers should be getting paid WAY MORE!", 
   {}, 
   8812, 
   null, 
   1054946460.0
  ], 
  [
   9489, 
   null, 
   "katie5890", 
   "Okay we both dont know him so why dont we just leave it at that.", 
   {}, 
   8812, 
   null, 
   1055435700.0
  ], 
  [
   9601, 
   null, 
   "Debate_Queen615", 
   "Originally posted by katie5890 \n girl what u talkin bout??? how do u know hes a beautiful person inside...do u know him?? I THINK NOT! a lot of people put on acts to the public but u know some of the stars are money craving mean people who have forgotten the \"little\" people. i have a big problem with this stff i mean how much can actors possibly do?? they resite lines and look pretty...well okay lets give them a billion dollars! while people like teachers are teaching the future america, and how much do they get a year??? okay i dont no:) but its not a lot! \n \n \n \n I agree kinda like Corey Clark did we know he had a record OF COURSE NOT!", 
   {}, 
   8812, 
   null, 
   1055489580.0
  ], 
  [
   9602, 
   null, 
   "Debate_Queen615", 
   "Originally posted by SparkleSocks22 \n Oh my gosh that movie looks SO stupid! I mean they are just making it when the hype is still up about them...They should have already made it come out because the hype is moving to Ruben...America has found their new American Idol and Kelly is getting left in the dust... \n \n \n Just so you know it takes a while to make a movie honey \n most of the time more than a year to ooops there goes that statement! emoticon_xbye", 
   {}, 
   8812, 
   null, 
   1055489640.0
  ], 
  [
   9603, 
   null, 
   "Debate_Queen615", 
   "by the way I think it look good! emoticon_xgood", 
   {}, 
   8812, 
   null, 
   1055489700.0
  ], 
  [
   11391, 
   null, 
   "SparkleSocks22", 
   "by the way I think it look good! emoticon_xgood\n\n \n Of course you do. It is supposed to appeal to the younger viewers.\n \n Katie~\n I know it takes a while to make a movie but this one should just never have been made. It wasn't worth all the trouble.", 
   {}, 
   9603, 
   null, 
   1057261020.0
  ], 
  [
   11457, 
   null, 
   "katie5890", 
   "dude that wasnt my post", 
   {}, 
   11391, 
   null, 
   1057437540.0
  ], 
  [
   11478, 
   null, 
   "Debate_Queen615", 
   "Katie, you took the words right out of my mouth\n \n Sparkle, if you haven't even seen the movie I wouldn't be saying its bad like some guy said, \"don't judge a book by its cover\"\n \n you seem to be doing a lot of that and its getting preettttyy annoying", 
   {}, 
   11457, 
   null, 
   1057554360.0
  ], 
  [
   11479, 
   null, 
   "Debate_Queen615", 
   "[QUOTE=SparkleSocks22]Of course you do. It is supposed to appeal to the younger viewers.QUOTE]\n \n \n Kinda like Harry Potter????? Maybe I'm a little bit more mature than you are!\n \n You know how Harry Potter is PG that means little kids with adult supervision\n \n And you know how Lord of the Rings is PG-13 as is From Justin to Kelly, that means 13 and OVER with Parental Guidence \n \n \n so that means Harry is for little kids and J2K and LOTR are for older kids\n \n but you like Harry and I like LOTR does that make me SEEM little", 
   {}, 
   11391, 
   null, 
   1057554900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  American Idol Season 1", 
  "url": "http://www.4forums.com/political/entertainment-debates/646-american-idol-season-1-a.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 646, 
  "discussion_files": [
   [
    "10337.html", 
    "http://www.4forums.com/political/entertainment-debates/646-american-idol-season-1-a-print.html"
   ], 
   [
    "10338.html", 
    "http://www.4forums.com/political/entertainment-debates/646-american-idol-season-1-a-2-print.html"
   ]
  ], 
  "identifier": 646
 }
]