[
 [
  [
   165235, 
   null, 
   "billsco", 
   "With Simon Wiesenthal's passing, I became interested in learning how an emaciated death camp survivor builds a institute of world-wide renown and reach, so I've been reading his obits and biographies where I can find them this week.\n \n It almost didn't happen. With the Cold War buildup between the U.S. and Soviet Union, prosecuting Nazi war criminals became a low priority. But Wiesenthal alone methodically sifted through info and intelligence, and then the big break occurred: The capture of Adolf Eichmann. This alone created a momentum which Wiesenthal skillfully utilized and never allowed to wane, going on to successfully prosecute over 1100 Nazis, and founding the Simon Wiesenthal Institute.\n \n This easily could have become a headline-seeking, politically motivated organization, with Wiesenthal grabbing most of the photo ops, but instead he allowed others to hold the more prestigious positions while he went about doing what he did best, working behind the scenes analyzing intelligence and sorting facts from rumors. \n \n With just the sheer force of his determination and dogged persistence, that's how he did it. We owe him a debt of gratitute for bringing so many criminals to justice.", 
   {
    "post_info": {
     "post_title": "Simon Wiesenthal"
    }
   }, 
   null, 
   null, 
   1127487180.0
  ], 
  [
   165247, 
   null, 
   "Alan Ryan", 
   "With Simon Wiesenthal's passing, I became interested in learning how an emaciated death camp survivor builds a institute of world-wide renown and reach, so I've been reading his obits and biographies where I can find them this week.\n \n It almost didn't happen. With the Cold War buildup between the U.S. and Soviet Union, prosecuting Nazi war criminals became a low priority. But Wiesenthal alone methodically sifted through info and intelligence, and then the big break occurred: The capture of Adolf Eichmann. This alone created a momentum which Wiesenthal skillfully utilized and never allowed to wane, going on to successfully prosecute over 1100 Nazis, and founding the Simon Wiesenthal Institute.\n \n This easily could have become a headline-seeking, politically motivated organization, with Wiesenthal grabbing most of the photo ops, but instead he allowed others to hold the more prestigious positions while he went about doing what he did best, working behind the scenes analyzing intelligence and sorting facts from rumors. \n \n With just the sheer force of his determination and dogged persistence, that's how he did it. We owe him a debt of gratitute for bringing so many criminals to justice.\n\n \n Yes, an admirable human being - not driven by understandable motives of revenge or vindictiveness and certainly not \"authorised\" by the promptings of religious mania; he sought only justice.", 
   {}, 
   165235, 
   null, 
   1127490840.0
  ], 
  [
   165252, 
   null, 
   "Jo Bennett", 
   "There is the odd question about whether he claimed credit for things he had no part in, but apart from that I agree.", 
   {}, 
   165247, 
   null, 
   1127491740.0
  ], 
  [
   165254, 
   null, 
   "billsco", 
   "There is the odd question about whether he claimed credit for things he had no part in, but apart from that I agree.\n\n \n What is that controversy? I haven't run across that as yet. (I'm only interested in learning about him, warts and all, not necessarily erecting monuments.)", 
   {}, 
   165252, 
   null, 
   1127492100.0
  ], 
  [
   165258, 
   null, 
   "Jo Bennett", 
   "There have been suggestions that he tried to claim credit for the capture of rudolph hess (I think) when he had little or nothing to do with it. How much truth is in the allegations I don't know. With someone who works in this area there are always those with ulterior motives keen to discredit them.", 
   {}, 
   165254, 
   null, 
   1127493420.0
  ], 
  [
   165261, 
   null, 
   "Alan Ryan", 
   "Rudolf Hess wasn't \"captured\" : he flew to Scotland on a \"peace mission\" in 1941 (by his own volition) and gave himself up to the British authorities when his attempts to contact the Duke of Hamilton were frustrated. He was returned to Germany in 1945 and indicted for war crimes at Nuremburg.", 
   {}, 
   165258, 
   null, 
   1127493960.0
  ], 
  [
   165274, 
   null, 
   "Jo Bennett", 
   "My apologies, I just looked it up, the dispute was over Adolf Eichmann.", 
   {}, 
   165261, 
   null, 
   1127497560.0
  ], 
  [
   165441, 
   null, 
   "OccamsRazor", 
   "The head of Mossad who lead the operation to capture Eichmann said Wiesenthal had nothing to do with the operation and he even endangered Mossad's plan as well as compromising an attempt to capture Josef Mengle.", 
   {}, 
   165274, 
   null, 
   1127528820.0
  ], 
  [
   165621, 
   null, 
   "billsco", 
   "Those charges were contained in a report which was never published. It is disputed on various fronts. What the actual truth is remains clouded; however, I contend successful men always have their detractors. \n \n The fact remains that well over a thousand war criminals faced the bar of justice, due in large part to his organization. It is well to note too that capturing was only a part of his work. Getting convictions from the justice system was another part, one which the Institute became quite adept.", 
   {}, 
   165441, 
   null, 
   1127578260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Simon Wiesenthal", 
  "url": "http://www.4forums.com/political/european-politics-economics/6475-simon-wiesenthal.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 6475, 
  "discussion_files": [
   [
    "16667.html", 
    "http://www.4forums.com/political/european-politics-economics/6475-simon-wiesenthal-print.html"
   ]
  ], 
  "identifier": 6475
 }
]