[
 [
  [
   165457, 
   null, 
   "georged", 
   "Is Homeland Security as disorganized as it appears?\n \n http://today.reuters.com/news/newsArticle.aspx?type=politicsNews&storyID=2005-09-23T213141Z_01_DIT377486_RTRUKOC_0_US-KATRINA-CONGRESS.xml\n \n Without partisan political blames and excuses, what's wrong with the administration of such a giant bureaucracy that has virtually unlimited funding? \n \n Blank checks are being cut to agencies with what looks like zero accounting definition. Federal credit cards, mine and your money, are having charge limits\n raised to $250k in affected agencies. Four years have been spent preparing for what? When it comes to money allocation I can't see response to a natural disaster being much different than a made-made one. What's the excuse?", 
   {
    "post_info": {
     "post_title": "Disaster Accountability"
    }
   }, 
   null, 
   null, 
   1127532420.0
  ], 
  [
   166407, 
   null, 
   "Diogenes99", 
   "Is Homeland Security as disorganized as it appears?\nNo. The problem in Lousiana is that DHS is up against a situation that wasn't in the planning - the total incompetence of some local and state governments. For the Northridge quake in California, various hurricanes in Florida, and most recently Rita, DHS and FEMA have responded well as support for local and state agencies. There is a good reason for the law that keeps the federal government out until their help is requested (unless the president invokes the exception for insurrection, as Kennedy did in Alabama forty years ago), but the feds are not in a position to react as first responders to natural disasters. We could change that, of course, but I don't think we really want to.", 
   {}, 
   165457, 
   null, 
   1127847240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Disaster Accountability", 
  "url": "http://www.4forums.com/political/government-debates/6478-disaster-accountability.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 6478, 
  "discussion_files": [
   [
    "6239.html", 
    "http://www.4forums.com/political/government-debates/6478-disaster-accountability-print.html"
   ]
  ], 
  "identifier": 6478
 }
]