[
 [
  [
   166532, 
   null, 
   "OccamsRazor", 
   "There seem to be an endless series of battles in the US courts over evolution in education and the latest involves the Dover Area School District in Pennsylvania being sued by eleven parents who oppose the teaching of intelligent design in biology class alongside the undermining of evolution. This contravenes the separation of religion from state and the Board are accused off allowing their impartiality to be compromised by their religious beliefs.\n \n http://abcnews.go.com/US/wireStory?id=1164467\n \n This one is important as if the legal challenge is successful a precident will be set against \"teaching the controversy\" at schools in the USA and another inroad into teaching creationism be shut of. It would also be a snub to W. Bush who has spoken in favour of the teaching of ID as an alternative to evolution.\n \n Off course if it goes the other way American children can kiss the chance of getting a proper education in science goodbye.", 
   {
    "post_info": {
     "post_title": "Parents take Dover Area School District to court over teaching of Intelligent Design"
    }
   }, 
   null, 
   null, 
   1127871660.0
  ], 
  [
   166538, 
   null, 
   "trebor", 
   "There seem to be an endless series of battles in the US courts over evolution in education and the latest involves the Dover Area School District in Pennsylvania being sued by eleven parents who oppose the teaching of intelligent design in biology class alongside the undermining of evolution. This contravenes the separation of religion from state and the Board are accused off allowing their impartiality to be compromised by their religious beliefs.\n \n http://abcnews.go.com/US/wireStory?id=1164467\n \n This one is important as if the legal challenge is successful a precident will be set against \"teaching the controversy\" at schools in the USA and another inroad into teaching creationism be shut of. It would also be a snub to W. Bush who has spoken in favour of the teaching of ID as an alternative to evolution.\n \n Off course if it goes the other way American children can kiss the chance of getting a proper education in science goodbye.\n\n \n From http://www.cnn.com/2005/LAW/09/27/evolution.trial.ap/index.html\n \n \n\n \"This case is about free inquiry in education, not about a religious agenda,\" said Patrick Gillen of the Thomas More Law Center in his opening statement. The center, based in Ann Arbor, Michigan, lobbies for what it sees as the religious freedom of Christians and is defending the school district.\n \n\n \n So, this statement is from a 'law center' that is dedicated to defend the religious freedom for CHristians. Yet, this isn't about 'religion'. Why do I \n find that hypocritical.", 
   {}, 
   166532, 
   null, 
   1127875140.0
  ], 
  [
   166548, 
   null, 
   "elliott5002002", 
   "i think it is because you are too logical because with people things do'nt have to make sence", 
   {}, 
   166538, 
   null, 
   1127877300.0
  ], 
  [
   166561, 
   null, 
   "trebor", 
   "i think it is because you are too logical because with people things do'nt have to make sence\n\n \n \n No, but some intelligence should be exercised when going to a court of law.\n \n For example, the choice of the board on WHO to represent them.\n \n Do you think that the judge will be able to totally dismiss in his mind that this group mission is to push a religious agenda?", 
   {}, 
   166548, 
   null, 
   1127879040.0
  ], 
  [
   166574, 
   null, 
   "DamEtel", 
   "For example, the choice of the board on WHO to represent them.\n \n Do you think that the judge will be able to totally dismiss in his mind that this group mission is to push a religious agenda?\n\n \n The judge should be informed that 'the leading' IDist admits that ID is religion. (yes, I've posted this before...)\n \n \nAh, but we have experience with radio transmitters. At least with extraterrestrial intelligences we can guess what might have happened. But we don't have any experience with unembodied designers, and that's clearly what we're dealing with when it comes to design in biology. Actually, if an unembodied designer is responsible for biological complexity, then we do have quite a bit of experience with such a designer through the designed objects (not least ourselves) that confront us all the time. On the other hand, it is true that we possess very little insight at this time into how such a designer acted to bring about the complex biological systems that have emerged over the course of natural history. \n \n ...\n \n It is no objection at all that we don't at this time know how an unembodied designer produced a biological system that exhibits specified complexity. We know that specified complexity is reliably correlated with the effects of intelligence. The only reason to insist on looking for non-telic explanations to explain the complex specified structures in biology is because of prior commitment to naturalism that perforce excludes unembodied designers.\n \n (emphasis added, Is Intelligent Design Testable?, William A. Dembski, 01.24.01 http://www.arn.org/docs/dembski/wd_isidtestable.htm) \n\n \n What else could an unembodied designer, which naturalism perforce excludes, be but a deity? \n \n So Dembski's ID has one or more unspecified deities - supernatural, unembodied designers - creating biological systems, at some unknown time, at some unknown place, by some unknown series of steps. What a great scientific theory! :-)", 
   {
    "unicode_changes_made": true
   }, 
   166561, 
   null, 
   1127881020.0
  ], 
  [
   166632, 
   null, 
   "elliott5002002", 
   "well people can be preaty blind to reality", 
   {}, 
   166574, 
   null, 
   1127913720.0
  ], 
  [
   166666, 
   null, 
   "pandion", 
   "Here is an excellent article about the trial. It is a bit longer than the others but well worth the effort to read. It is slanted towards recent evidence that supports evolution and why ID is not a scientific theory.\n \n New Analyses Bolster Central Tenets of Evolution Theory\n \n \nAsked to provide examples of non-obvious, testable predictions made by the theory of Intelligent Design, John West, an associate director of the Discovery Institute, a Seattle-based ID think tank, offered one: In 1998, he said, an ID theorist, reckoning that an intelligent designer would not fill animals' genomes with DNA that had no use, predicted that much of the \"junk\" DNA in animals' genomes -- long seen as the detritus of evolutionary processes -- will someday be found to have a function.\n \n (In fact, some \"junk\" DNA has indeed been found to be functional in recent years, though more than 90 percent of human DNA still appears to be the flotsam of biological history.) In any case, West said, it is up to Darwinists to prove ID wrong.\n\n The problem is that the parts of the non-protein coding DNA that have been found to be functional were discovered by real scientists. They discovered those parts because they suspected that it was functional. There are still some parts that are assumed to have some important function, even though that function is unknown.\n \n And West is wrong. It is the XXXXXX who are making the extraordinary claims and it is up to them to support those claims with evidence. Saying, \"We can't explain how this could have evolved by natural means, therefore it must have been designed by Go....er... by some unknown, magical intelligent designer. But that's not religious.\"\n \n The CNN story posted by trebor mentions Brown University biology professor Kenneth Miller. It does not explain that he is the co-author of several high school and college text books on biology as well as an author and a devout Christian.\n \n Anyone who has any doubt about whether ID is religiously motivated should read THE WEDGE STRATEGY, an internal paper from the Center for the Renewal of Science and Culture at the Discovery Institute that was leaked to the press. Or, you might also read almost anything by Johnson, Behe, Wells, or Dembski. They openly admit that they are religiously motivated and then claim that ID is not religious. Can you say hypocrisy? I knew you could.", 
   {}, 
   166632, 
   null, 
   1127925960.0
  ], 
  [
   168539, 
   null, 
   "SkepticGunt", 
   "Well, bravo to the parents. I hope it turns out well. Some secular citizens of Australia have been following the debate over in the U.S. Most of us are still wondering how the debate could be going on in the United States, when in most other Western countries, the debate was finished 200 years ago, and seperation of church and state reigns supreme.\n \n Anyway, I really hope that the parents win out. I'm on the side of reason!", 
   {}, 
   166666, 
   null, 
   1128597780.0
  ], 
  [
   168586, 
   null, 
   "jitobear", 
   "Off course if it goes the other way American children can kiss the chance of getting a proper education in science goodbye.\n\n \n Well, there are books and scientific journals and what not. This XXXX shows up in my son's science class and he will be hearing each and every day from his mother how it is not science and I will get him access to real science information.\n \n Yikes.", 
   {}, 
   166532, 
   null, 
   1128613920.0
  ], 
  [
   168883, 
   null, 
   "SkepticGunt", 
   "Well, there are books and scientific journals and what not. This XXXX shows up in my son's science class and he will be hearing each and every day from his mother how it is not science and I will get him access to real science information.\n \n Yikes.\n\n \n Good work!", 
   {}, 
   168586, 
   null, 
   1128676200.0
  ], 
  [
   168936, 
   null, 
   "pandion", 
   "There is lots of information on line at the NCSE web site on the trial. The information includes expert witness statements, discussions about the daily proceedings, and trial transcripts.\n \n Here's the url.\n \n http://www2.ncseweb.org/wp/\n \n I read the transcripts from the first day - Dr. Kenneth Miller of Brown University. He was quite good and the lawyer did an excellent job of leading him through the testimony.", 
   {}, 
   168883, 
   null, 
   1128702960.0
  ], 
  [
   169392, 
   null, 
   "DamEtel", 
   "There is lots of information on line at the NCSE web site on the trial. The information includes expert witness statements, discussions about the daily proceedings, and trial transcripts.\n \n Here's the url.\n \n http://www2.ncseweb.org/wp/\n \n I read the transcripts from the first day - Dr. Kenneth Miller of Brown University. He was quite good and the lawyer did an excellent job of leading him through the testimony.\n\n \n I loved this part:\n \n \nKenneth Miller: These are all elements, as I understand them, of the creation science or the creationist or scientific creationism movement. Now the difference between this movement and intelligent design ironically is that\n intelligent design has withdrawn the testable scientific predictions made by scientific creationists.\n\n \n So Miller says that ID is less worthy, scientifically, than even Young Earth Creationism!!!!!!!!!!!!!!!!!!!!!!!!!!", 
   {}, 
   168936, 
   null, 
   1128891000.0
  ], 
  [
   169492, 
   null, 
   "SkepticGunt", 
   "Esentially this is correct, because Scientific Creationism at least uses science that can be tested (and hence, disproven). Intelligent Design just says that things are too complex and therefore must have been designed by a supernatural being of some description, but offers no evidence for a designer. Only \"lack of evidence\" for evolution is shown.", 
   {}, 
   169392, 
   null, 
   1128925020.0
  ], 
  [
   169685, 
   null, 
   "OccamsRazor", 
   "I loved this part:\n \n So Miller says that ID is less worthy, scientifically, than even Young Earth Creationism!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n \n As a connoisseur of fine irony, I found this pleasing indeed emoticon_xangel \n \n In a similar light hearted vein the Onion peels back the layers of confusion to get to the truth of the Dover ID trial.\n \n And:\n \n \nWell, there are books and scientific journals and what not. This XXXX shows up in my son's science class and he will be hearing each and every day from his mother how it is not science and I will get him access to real science information.\n \n Yikes.\n\n \n Thats the spirit!*\n \n \n \n *Just in case any ID proponents are reading, thats not the \"higher supernatural being type\" ;)", 
   {}, 
   169392, 
   null, 
   1128984360.0
  ], 
  [
   169699, 
   null, 
   "trebor", 
   "\n \n *Just in case any ID proponents are reading, thats not the \"higher supernatural being type\" ;)\n\n \n \n It might not be a supernatural being, but it certainly gets you higher!", 
   {}, 
   169685, 
   null, 
   1128985920.0
  ], 
  [
   169714, 
   null, 
   "Big_Bear_Scot", 
   "One of best quotes I have seen(on another forum) against Intelligent Design is\n \n Why is it called Intelligent Design if we(human beings) are the result ?", 
   {}, 
   169699, 
   null, 
   1128988380.0
  ], 
  [
   170960, 
   null, 
   "SkepticGunt", 
   "lol! That is so good. I need to remember that one.", 
   {}, 
   169714, 
   null, 
   1129375320.0
  ], 
  [
   171363, 
   null, 
   "OccamsRazor", 
   "Time for an update on the proceedings at http://www2.ncseweb.org/wp/. Seems that most of the witnesses for the prosecustion have been heard now and the defense will being calling its own soon.\n \n Off particular interest was this in one of the linked articles (my emphasis):\n \n \nThose scheduled include intelligent design scientist and Lehigh University professor Michael Behe, superintendent Richard Nilsen and assistant superintendent Michael Baksa.\n\n \n It will be interesting to what Behe has to say under cross examination- it could be quite illuminating!\n \n As a side note, here is the statement that has caused all the fracas:\n \n \n\"The Pennsylvania Academic Standards require students to learn about Darwin's Theory of Evolution and eventually to take a standardized test of which evolution is a part.\n \n \"Because Darwin's Theory is a theory, it continues to be tested as new evidence is discovered. The Theory is not a fact. Gaps in the Theory exist for which there is no evidence. A theory is defined as a well-tested explanation that unifies a broad range of observations.\n \n \"Intelligent Design is an explanation of the origin of life that differs from Darwin's view. The reference book, Of Pandas and People, is available in the library along with other resources for students who might be interested in gaining an understanding of what Intelligent Design actually involves.\n \n \"With respect to any theory, students are encouraged to keep an open mind. The school leaves the discussion of the Origins of Life to individual students and their families. As a Standards-driven district, class instruction focuses upon preparing students to achieve proficiency on Standards-based assessments.\"\n\n \n I guess the authors of Pandas and People appreciate the plug for their book.", 
   {}, 
   170960, 
   null, 
   1129495440.0
  ], 
  [
   172065, 
   null, 
   "SubtleRedFlag", 
   "Most of us are still wondering how the debate could be going on in the United States, when in most other Western countries, the debate was finished 200 years ago, and seperation of church and state reigns supreme.\n\n \n I'd venture as far to say that the average American is an idiot and is both comfortable and condescending in his/her ignorance.\n \n Tom Cruise, while certainly not the average American financially, embodies this deadly brew of ignorance and ego. \n \n I'm an American, so don't flame me with your red, white, and blue.", 
   {
    "post_info": {
     "post_title": "Silly Americans"
    }
   }, 
   168539, 
   null, 
   1129678620.0
  ], 
  [
   172067, 
   null, 
   "trebor", 
   "Time for an update on the proceedings at http://www2.ncseweb.org/wp/. Seems that most of the witnesses for the prosecustion have been heard now and the defense will being calling its own soon.\n \n Off particular interest was this in one of the linked articles (my emphasis):\n \n \n \n It will be interesting to what Behe has to say under cross examination- it could be quite illuminating!\n \n As a side note, here is the statement that has caused all the fracas:\n \n \n \n I guess the authors of Pandas and People appreciate the plug for their book.\n\n \n \n I will not that Behe has admited he thinks god is behind it. WIth all the other \n stuff that was testified about, I am pretty sure that \"Intelligent Design\" will be considered religion for the purposes of teaching it in school.", 
   {}, 
   171363, 
   null, 
   1129678980.0
  ], 
  [
   177635, 
   null, 
   "OccamsRazor", 
   "The trial has now concluded, and the judgement will be made before the end of the year:\n \n http://www.pennlive.com/newsflash/topstories/index.ssf?/base/news-32/1131121141124390.xml&storylist=\n \n Which way the decision will go?", 
   {}, 
   172067, 
   null, 
   1131345060.0
  ], 
  [
   177651, 
   null, 
   "trebor", 
   "The trial has now concluded, and the judgement will be made before the end of the year:\n \n http://www.pennlive.com/newsflash/topstories/index.ssf?/base/news-32/1131121141124390.xml&storylist=\n \n Which way the decision will go?\n\n \n Considering the Judge was very interested in the descrepancies in some of the board members testimony, I suspect it is going to be a slam dunk.", 
   {}, 
   177635, 
   null, 
   1131371820.0
  ], 
  [
   178235, 
   null, 
   "OccamsRazor", 
   "Considering the Judge was very interested in the descrepancies in some of the board members testimony, I suspect it is going to be a slam dunk.\n\n \n He can hardly be more unforgiving than the electors of the new Dover District School board!", 
   {}, 
   177651, 
   null, 
   1131588360.0
  ], 
  [
   178473, 
   null, 
   "pandion", 
   "Televangelist Robertson warns town of God's wrath\n \n Surely not all fundamentalist christians can be such puckerheads. The defendants made christians look foolish enough in their testimony in the case, but apparently Robertson wants to make them look even more foolish.", 
   {}, 
   178235, 
   null, 
   1131672900.0
  ], 
  [
   178483, 
   null, 
   "georged", 
   "Televangelist Robertson warns town of God's wrath\n \n Surely not all fundamentalist christians can be such puckerheads. The defendants made christians look foolish enough in their testimony in the case, but apparently Robertson wants to make them look even more foolish.\n\n \n That crowd certainly doesn't lack publicity-minded extremists; you will rot in hell unless..... Didn't he run for US president?", 
   {}, 
   178473, 
   null, 
   1131676860.0
  ], 
  [
   186743, 
   null, 
   "trebor", 
   "Newest information about the Dover School Area District case.\n \n The decision by Judge JOnes is in, and he ruled that not only did the Dover School board act for religious motivations (a given , considering the testemony), but he also ruled the I.D. was not science.\n \n \n From http://www2.ncseweb.org/wp/\n \n \n\n The much-awaited decision in the Kitzmiller et al. v. Dover Area School District is now available.\n \n The 139 page document finds for the plaintiffs.\n \n Judge Jones finds that \"intelligent design\" is not science. The DASD ID policy violates both purpose and effect prongs of the Lemon test, and also violates the Pennsylvania constitution.\n \n", 
   {
    "unicode_changes_made": true
   }, 
   178483, 
   null, 
   1135104060.0
  ], 
  [
   186745, 
   null, 
   "Truthsayer", 
   "Newest information about the Dover School Area District case.\n \n The decision by Judge JOnes is in, and he ruled that not only did the Dover School board act for religious motivations (a given , considering the testemony), but he also ruled the I.D. was not science.\n \n \n From http://www2.ncseweb.org/wp/\n\n \n http://www.talkorigins.org/faqs/dover/kitzmiller_v_dover.html", 
   {}, 
   186743, 
   null, 
   1135104420.0
  ], 
  [
   186754, 
   null, 
   "trebor", 
   "http://www.talkorigins.org/faqs/dover/kitzmiller_v_dover.html\n\n \n \n Good LInk.", 
   {}, 
   186745, 
   null, 
   1135106580.0
  ], 
  [
   186760, 
   null, 
   "pandion", 
   "Decision was filed today.\n \n MEMORANDUM OPINION\n \n \nNOW, THEREFORE, IT IS ORDERED THAT:\n 1. A declaratory judgment is hereby issued in favor of Plaintiffs pursuant\n to 28 U.S.C. §§ 2201, 2202, and 42 U.S.C. § 1983 such that\n Defendants' ID Policy violates the Establishment Clause of the First\n Amendment of the Constitution of the United States and Art. I, § 3 of\n the Constitution of the Commonwealth of Pennsylvania.\n\n \n The decision is 139 pages long.", 
   {
    "unicode_changes_made": true
   }, 
   186754, 
   null, 
   1135107780.0
  ], 
  [
   186769, 
   null, 
   "Truthsayer", 
   "Well, that ends this thread.", 
   {}, 
   186760, 
   null, 
   1135109700.0
  ], 
  [
   186775, 
   null, 
   "jyoshu", 
   "So the judge decided with the anti-IDs. I don't think that's much of a surprise to anyone.\n \n I also don't think too many people will disagree with the idea that evolution should be taught, or that ID shouldn't be taught as definitive science. What disturbs me about this case is that the state is regulating the classroom to the level of the subject matter and the freedom of the teacher. To me, this issue is as much about over-regulation as anything.", 
   {}, 
   186769, 
   null, 
   1135110300.0
  ], 
  [
   186782, 
   null, 
   "Kronus", 
   "\n I also don't think too many people will disagree with the idea that evolution should be taught, or that ID shouldn't be taught as definitive science. What disturbs me about this case is that the state is regulating the classroom to the level of the subject matter and the freedom of the teacher. To me, this issue is as much about over-regulation as anything.\n\n \n One part of the government was doing something unconstitutional. Another part stopped it. Checks and balances. Where's your problem with that?", 
   {}, 
   186775, 
   null, 
   1135111200.0
  ], 
  [
   186783, 
   null, 
   "Truthsayer", 
   "One part of the government was doing something unconstitutional. Another part stopped it. Checks and balances. Where's your problem with that?\n\n \n The checks are no problem. It's the balance thing that screws me up.", 
   {}, 
   186782, 
   null, 
   1135111260.0
  ], 
  [
   186791, 
   null, 
   "jitobear", 
   "So the judge decided with the anti-IDs. I don't think that's much of a surprise to anyone.\n \n I also don't think too many people will disagree with the idea that evolution should be taught, or that ID shouldn't be taught as definitive science. What disturbs me about this case is that the state is regulating the classroom to the level of the subject matter and the freedom of the teacher. To me, this issue is as much about over-regulation as anything.\n\n \n Call me whacky but I want some control in the class room thankyouverymuch. I don't want my son learning religion in science class any more than I want him learning the lyrics to Broadway show tunes during Math.", 
   {}, 
   186775, 
   null, 
   1135113180.0
  ], 
  [
   186805, 
   null, 
   "Truthsayer", 
   "And the judge says...........\n \n There are consequences for not telling the truth. The board members and administrators who testified untruthfully for the defendants are entitled to no credibility, none. In every instance where this Court is confronted with a disputed set of facts as between the plaintiffs' witnesses and defendants' witnesses that the Court deems to have been untruthful, the plaintiffs' witnesses account should be credited.\n \n And furthermore, and perhaps more importantly, this Court should infer from their false statements that defendants are trying to conceal an improper purpose for the policy they approved and implemented, namely an explicitly religious purpose.\n \n The board's behavior mimics the intelligent design movement at large. The Dover board discussed teaching creationism, switched to the term \"intelligent design\" to carry out the same objective, and then pretended they had never talked about creationism.\n As we learned from Dr. Forrest's testimony, the intelligent design movement used the same sleight of hand in creating the Pandas textbook. They wrote it as a creationist book and then, after the Edwards decision outlawed teaching creationism, simply inserted the term \"intelligent design\" where \"creationism\" had been before.\n \n <snip<\n \n http://www.talkorigins.org/faqs/dover/day21pm2.html#day21pm390", 
   {}, 
   186791, 
   null, 
   1135116960.0
  ], 
  [
   186811, 
   null, 
   "trebor", 
   "And the judge says...........\n \n There are consequences for not telling the truth. The board members and administrators who testified untruthfully for the defendants are entitled to no credibility, none. In every instance where this Court is confronted with a disputed set of facts as between the plaintiffs' witnesses and defendants' witnesses that the Court deems to have been untruthful, the plaintiffs' witnesses account should be credited.\n \n And furthermore, and perhaps more importantly, this Court should infer from their false statements that defendants are trying to conceal an improper purpose for the policy they approved and implemented, namely an explicitly religious purpose.\n \n The board's behavior mimics the intelligent design movement at large. The Dover board discussed teaching creationism, switched to the term \"intelligent design\" to carry out the same objective, and then pretended they had never talked about creationism.\n As we learned from Dr. Forrest's testimony, the intelligent design movement used the same sleight of hand in creating the Pandas textbook. They wrote it as a creationist book and then, after the Edwards decision outlawed teaching creationism, simply inserted the term \"intelligent design\" where \"creationism\" had been before.\n \n <snip<\n \n http://www.talkorigins.org/faqs/dover/day21pm2.html#day21pm390\n\n \n That key fact is goign to make this case very difficult to have this case overturned by other cases.", 
   {}, 
   186805, 
   null, 
   1135119660.0
  ], 
  [
   186817, 
   null, 
   "snakespit", 
   "So the judge decided with the anti-IDs. I don't think that's much of a surprise to anyone.\n \n I also don't think too many people will disagree with the idea that evolution should be taught, or that ID shouldn't be taught as definitive science. What disturbs me about this case is that the state is regulating the classroom to the level of the subject matter and the freedom of the teacher. To me, this issue is as much about over-regulation as anything.\n\n With an educational system so lacking in substance and direction, I for one am glad to see people get involved and take the wheel. America needs much more regulation in what is taught in the classroom. Most Americans blindly send their kids off to public schools, and blindly trust that the teachers are going to fill their heads with the neccessary information. In fact, teachers have a loose curriculum to follow, and as long as they meet a few goals, nobody cares how they get to them. How many times do you remember sitting in high school saying \"when am I ever going to use this?\". I know myself and most people I went to school with asked the question often, and in probably 50-60% of those cases, I am still waiting on the answer.", 
   {}, 
   186775, 
   null, 
   1135122120.0
  ], 
  [
   186819, 
   null, 
   "pandion", 
   "That key fact is goign to make this case very difficult to have this case overturned by other cases.\nExcept that the decision applies only to the jurisdiction of the U.S. District Court for the Middle District of Pennsylvania. The current school board has already stated that they do not intend to appeal the case. The IDers were thrown off of the board by the people, i.e., they lost the election. If this were appealed, then if the decision were upheld it would apply to the 3rd Circuit Court of Appeals (Delaware, New Jersey, Pennsylvania, and the Virgin Islands). To have an effect nationally it would then have to be appealed and upheld by the SCOTUS.\n \n The case in Cobb County GA that mandated ID stickers in biology texts and was found to be unconstitutional is on appeal to the 11th Circuit Court of Appeals (Alabama, Georgia, and Florida).\n \n There is also a \"...under God...\" case on appeal to the 9th Circuit Court of Appeals (Alaska, Arizona, California, Guam, Hawaii, Idaho, Mariana Islands, Montana, Nevada, Oregon and Washington).\n \n It could be cited as a precedent in other cases elsewhere in the country.", 
   {}, 
   186811, 
   null, 
   1135122720.0
  ], 
  [
   186822, 
   null, 
   "Strel", 
   "And the judge says...........\n \n There are consequences for not telling the truth. The board members and administrators who testified untruthfully for the defendants are entitled to no credibility, none. In every instance where this Court is confronted with a disputed set of facts as between the plaintiffs' witnesses and defendants' witnesses that the Court deems to have been untruthful, the plaintiffs' witnesses account should be credited.\n \n And furthermore, and perhaps more importantly, this Court should infer from their false statements that defendants are trying to conceal an improper purpose for the policy they approved and implemented, namely an explicitly religious purpose.\n \n The board's behavior mimics the intelligent design movement at large. The Dover board discussed teaching creationism, switched to the term \"intelligent design\" to carry out the same objective, and then pretended they had never talked about creationism.\n As we learned from Dr. Forrest's testimony, the intelligent design movement used the same sleight of hand in creating the Pandas textbook. They wrote it as a creationist book and then, after the Edwards decision outlawed teaching creationism, simply inserted the term \"intelligent design\" where \"creationism\" had been before.\n \n <snip<\n \n http://www.talkorigins.org/faqs/dover/day21pm2.html#day21pm390\n\n \n \n Give that judge a raise! FYI, if it hasn;t been mentioned already, the Pennsylvania \"activist\" judge is a Bush appointee.", 
   {}, 
   186805, 
   null, 
   1135123140.0
  ], 
  [
   186827, 
   null, 
   "pandion", 
   "Give that judge a raise! FYI, if it hasn;t been mentioned already, the Pennsylvania \"activist\" judge is a Bush appointee.\nThe judge had these remarks about being an \"activist\" judge. From page 137-38 of the decision:\n \nThose who disagree with our holding will likely mark it as the product of an activist judge. If so, they will have erred as this is manifestly not an activist Court. Rather, this case came to us as the result of the activism of an ill-informed faction on a school board, aided by a national public interest law firm eager to find a constitutional test case on ID, who in combination drove the Board to adopt an imprudent and ultimately unconstitutional policy. The breathtaking inanity of the Board's decision is evident when considered against the factual backdrop which has now been fully revealed through this trial. The students, parents, and teachers of the Dover Area School District deserved better than to be dragged into this legal maelstrom, with its resulting utter waste of monetary and personal resources.\nEmphasis mine.", 
   {
    "unicode_changes_made": true
   }, 
   186822, 
   null, 
   1135123680.0
  ], 
  [
   186828, 
   null, 
   "trebor", 
   "Except that the decision applies only to the jurisdiction of the U.S. District Court for the Middle District of Pennsylvania. The current school board has already stated that they do not intend to appeal the case. The IDers were thrown off of the board by the people, i.e., they lost the election. If this were appealed, then if the decision were upheld it would apply to the 3rd Circuit Court of Appeals (Delaware, New Jersey, Pennsylvania, and the Virgin Islands). To have an effect nationally it would then have to be appealed and upheld by the SCOTUS.\n \n The case in Cobb County GA that mandated ID stickers in biology texts and was found to be unconstitutional is on appeal to the 11th Circuit Court of Appeals (Alabama, Georgia, and Florida).\n \n There is also a \"...under God...\" case on appeal to the 9th Circuit Court of Appeals (Alaska, Arizona, California, Guam, Hawaii, Idaho, Mariana Islands, Montana, Nevada, Oregon and Washington).\n \n It could be cited as a precedent in other cases elsewhere in the country.\n\n \n \n I am sure. However, if you look at the decision, it is a very broad decision, and it will make it that much harder for I.D. proponents to win in other cases.\n The precidence has been set.", 
   {}, 
   186819, 
   null, 
   1135123860.0
  ], 
  [
   186831, 
   null, 
   "beervolcano", 
   "This is a major defeat for the Pastafarian Movement and the Church of the Flying Spaghetti Monster. If Intelligent Design Creationism can't be taught in public school science classes, then there's little hope for FSMism to be taught as an alternative. All we wanted was a little balance between science and faith and for that balance to be initially manifested from the bottom up, not from the top down, which has been the case ever since the materialists and athiests changed the definition of science a few centuries ago to exclude such scientific endeavors like astrology and FSMism. Any scientific theory must have its proper beginnings in 7th grade biology class if it ever wants to graduate into a real theory in the scientific literature. It looks like we'll be seeing more of this blatant and violent hijacking of science by the athiest materialists for some time to come.\n \n All I have left to say is that I am truly dissapointed in the parents of Dover, PA and the federal courts for denying schoolchildren a chance to hear the TruthTM. \n \n O well, there's still Kansas.", 
   {
    "post_info": {
     "post_title": "A harsh setback for all True Believers."
    }
   }, 
   186819, 
   null, 
   1135124280.0
  ], 
  [
   186839, 
   null, 
   "OccamsRazor", 
   "So the judge decided with the anti-IDs. I don't think that's much of a surprise to anyone.\n\n \n A relief and a clear statement from the judicary to those who advocate teaching ID as on the same platform as evolution (no doubt Bush is disappointed).\n \n \nI also don't think too many people will disagree with the idea that evolution should be taught, or that ID shouldn't be taught as definitive science. What disturbs me about this case is that the state is regulating the classroom to the level of the subject matter and the freedom of the teacher. To me, this issue is as much about over-regulation as anything.\n\n \n This is nothing to do with the freedom of the teacher, from the perspective you are saying at least. It was actually the Board at Dover that was forcing the science teacher to include material on ID into science class.\n \n So what we really have is a defence of the teacher in this ruling- they cannot be forced to teach unconsitutional material by their controlling school board.", 
   {}, 
   186775, 
   null, 
   1135125540.0
  ], 
  [
   186841, 
   null, 
   "jyoshu", 
   "One part of the government was doing something unconstitutional. Another part stopped it. Checks and balances. Where's your problem with that?\n\n \n As long as it doesn't become a witch hunt where it's something like teachers or schools getting sued over ther very utterance of the term \"god\" in govt. property, I'm fine with it. I just know from history that there's always a greater chance of a govt. over-regulating something than the other way around. \n \n \nCall me whacky but I want some control in the class room thankyouverymuch. I don't want my son learning religion in science class any more than I want him learning the lyrics to Broadway show tunes during Math.\n\n \n So if, in a side statement, the teacher accidently lets the word \"god\" slip from his mouth or lets it slip that he happens to be religious, you wouldn't try and sue or have him fired?\n \n \nneeds much more regulation in what is taught in the classroom. Most Americans blindly send their kids off to public schools, and blindly trust that the teachers are going to fill their heads with the neccessary information.\n\n \n There are real reasons why public schools can't get the same quality teachers that private ones can, and it ain't because private schools pay them more because they usually don't. It's because the govt. has been trying to dictate their classrooms for years now. And guess what: private schools and homeschoolers tend to test better overall (Gee, what a surprise!). Over-regulation is a bad thing.", 
   {}, 
   186831, 
   null, 
   1135125660.0
  ], 
  [
   186842, 
   null, 
   "OccamsRazor", 
   "It looks like we'll be seeing more of this blatant and violent hijacking of science by the athiest materialists for some time to come.\n\n \n Wow, nice hyperbole there beervolcano.", 
   {}, 
   186831, 
   null, 
   1135125660.0
  ], 
  [
   186913, 
   null, 
   "jitobear", 
   "\n So if, in a side statement, the teacher accidently lets the word \"god\" slip from his mouth or lets it slip that he happens to be religious, you wouldn't try and sue or have him fired?\n\n \n As long as the timing is appropriate. He may mention in chat that he is religious, but know he may not spout in the middle of a biology lesson that his religion says X instead.\n \n I would not seek to have anyone fired unless they were definately trying to push religion. I once had to let a child care provider go for that reason. I knew when she started that she was very religious. That was fine, but I also told her that I would prefer her not give my son religious instruction. A few months later she was blatantly blowing off my request and I changed from a home setting to a public daycare without religious affiliation.", 
   {}, 
   186841, 
   null, 
   1135145880.0
  ], 
  [
   187053, 
   null, 
   "simone", 
   "This is a major defeat for the Pastafarian Movement and the Church of the Flying Spaghetti Monster. If Intelligent Design Creationism can't be taught in public school science classes, then there's little hope for FSMism to be taught as an alternative. All we wanted was a little balance between science and faith and for that balance to be initially manifested from the bottom up, not from the top down, which has been the case ever since the materialists and athiests. . . .the athiest materialists for some time to come. . . .well, there's still Kansas.\nAw shucks! And I reckon in Kansas they won't ever care whether or not you learn how to spell ATHEIST.", 
   {}, 
   186831, 
   null, 
   1135190400.0
  ], 
  [
   187067, 
   null, 
   "Truthsayer", 
   "Aw shucks! And I reckon in Kansas they won't ever care whether or not you learn how to spell ATHEIST.\n\n \n What ever happened to that \"I before E except after C\" rule?", 
   {}, 
   187053, 
   null, 
   1135191540.0
  ], 
  [
   187078, 
   null, 
   "johnhanks", 
   "What ever happened to that \"I before E except after C\" rule?\n\n \n That would apply if atheist was pronounced atheest (to rhyme with priest).", 
   {}, 
   187067, 
   null, 
   1135193160.0
  ], 
  [
   187091, 
   null, 
   "DamEtel", 
   "What ever happened to that \"I before E except after C\" rule?\n\n \n Although grammar rules course through my VEINS like Santa's REINDEER course through the skies as they pull Santa's SLEIGH, I don't know the answer my good NEIGHBOR. The WEIGHT of the evidence indicates that such should be the case, but for some reason my CONSCIENCE says no. And I don't think that even SCIENTISTS have the answer: it would just be THEIR opinion. Perhaps its just SLEIGHT of hand?", 
   {}, 
   187067, 
   null, 
   1135194900.0
  ], 
  [
   187109, 
   null, 
   "electrolyte", 
   "Although grammar rules course through my VEINS like Santa's REINDEER course through the skies as they pull Santa's SLEIGH, I don't know the answer my good NEIGHBOR. The WEIGHT of the evidence indicates that such should be the case, but for some reason my CONSCIENCE says no. And I don't think that even SCIENTISTS have the answer: it would just be THEIR opinion. Perhaps its just SLEIGHT of hand?\n\n \n \"i before e except after c and when sounding like 'ay' as in 'neighbor' and 'weigh.'\"\n \n I've always looked at \"their\" as a bastardization of \"they\" where the y gets changed to an i, a common change.\n However, \"sleight\" is indeed dead to rights, since it has nothing to do with \"sleigh\".. or does it?\n \n No matter how you slice it, the English language is just plain stupid.", 
   {}, 
   187091, 
   null, 
   1135197600.0
  ], 
  [
   187114, 
   null, 
   "DamEtel", 
   "\"No matter how you slice it, the English language is just plain stupid.\n\n \n I agree, at least for a lot of it. I never noticed much until I took it upon myself a few years ago to teach my kids to read (in addition to what they were learning in school). So many exceptions to all the rules. My brother has said the same thing. We've joked about having everything spelled in a standard manner. Cough?!?!? Sleigh?!?!??! To, Too, Two?!?!?!? One, Won?!?!?! Chain compared to Chasm?!?!??! Why are there three different ways to spell an F sound? Cough, phone, and free?!?!?! and so on and so on.", 
   {}, 
   187109, 
   null, 
   1135198380.0
  ], 
  [
   187132, 
   null, 
   "pandion", 
   "I agree, at least for a lot of it. I never noticed much until I took it upon myself a few years ago to teach my kids to read (in addition to what they were learning in school). So many exceptions to all the rules. My brother has said the same thing. We've joked about having everything spelled in a standard manner. Cough?!?!? Sleigh?!?!??! To, Too, Two?!?!?!? One, Won?!?!?! Chain compared to Chasm?!?!??! Why are there three different ways to spell an F sound? Cough, phone, and free?!?!?! and so on and so on.\n\n How about \"ghoti\"? As one internet site says, \"it's\n 'fish', re-spelled by a Victorian spelling-reform advocate to\n demonstrate the inconsistency of English spelling: 'gh' as in\n 'cough', 'o' as in 'women', 'ti' as in 'nation'.\" Supposedly George Bernard Shaw.", 
   {}, 
   187114, 
   null, 
   1135204620.0
  ], 
  [
   187197, 
   null, 
   "DamEtel", 
   "How about \"ghoti\"? As one internet site says, \"it's\n 'fish', re-spelled by a Victorian spelling-reform advocate to\n demonstrate the inconsistency of English spelling: 'gh' as in\n 'cough', 'o' as in 'women', 'ti' as in 'nation'.\" Supposedly George Bernard Shaw.\n\n \n I've done similar respellings myself before, but that one beats all of mine :-)\n \n Anyway, some of us got off topic for a few posts. \n \n When I read the NT Times story \"Judge Rejects Intelligent Design\" today I felt like we had just won a war. Jubliation indeed! It's official: It's in the legal records: ID isn't science!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", 
   {}, 
   187132, 
   null, 
   1135215060.0
  ], 
  [
   187201, 
   null, 
   "beervolcano", 
   "Oh, how could I be so silly? Of course I spelled atheist wrong. It must be my Aryan heritage mixing with my Southern upbringing. Since I mispronounce it aytheeyist too. emoticon_cry \n \n Since I can't do anything right and have no brain of my own, I'll just leave you with the words of a spokesman from our flock.\n \n \nFSM spokesperson Dread Pirate Roberts vowed that the fight would go on. \"By His noodly appendages, this will not stand. This is just a minor setback. We have on record none other than the president of the United States George W. Bush, Senate Majority Leader Bill Frist, and Pennsylvania Senator Rick Santorum in support of blending faith with science, and we will prevail in the end. This is just the latest round of anti-carbohydratism from activist judges and dietitians in this country. We had hoped that with the death of Dr. Robert Atkins we might see a decrease in persecution.\"\n\n http://www.dudehisattva.com/\n \n (Oh, and in case you missed the link. This is incredibly funny.)", 
   {}, 
   187197, 
   null, 
   1135217220.0
  ], 
  [
   187208, 
   null, 
   "beervolcano", 
   "Oh yeah?\n \n I may not be an atheist, but I'm the athiest!\n \n Nah, that's weak. Forget it...emoticon_emb", 
   {
    "post_info": {
     "post_title": "Alternate comeback."
    }
   }, 
   187201, 
   null, 
   1135219020.0
  ], 
  [
   187268, 
   null, 
   "nowherenear2003", 
   "Shouldn't they be separate?", 
   {
    "post_info": {
     "post_title": "Is this a science forum or a religious forum?"
    }
   }, 
   187208, 
   null, 
   1135233360.0
  ], 
  [
   187384, 
   null, 
   "electrolyte", 
   "Not according to the IDers!", 
   {}, 
   187268, 
   null, 
   1135282980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Parents take Dover Area School District to court over teaching of Intelligent Design", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6497-parents-take-dover-area-school-district-court-over-teaching-intelligent-design.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 6497, 
  "discussion_files": [
   [
    "5518.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6497-parents-take-dover-area-school-district-court-over-teaching-intelligent-design-print.html"
   ], 
   [
    "5519.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6497-parents-take-dover-area-school-district-court-over-teaching-intelligent-design-4-print.html"
   ], 
   [
    "5520.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6497-parents-take-dover-area-school-district-court-over-teaching-intelligent-design-3-print.html"
   ], 
   [
    "5521.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6497-parents-take-dover-area-school-district-court-over-teaching-intelligent-design-2-print.html"
   ]
  ], 
  "identifier": 6497
 }
]