[
 [
  [
   166774, 
   null, 
   "Eve Harrington", 
   "Babies conceived during the disaster will be killed for free!  \n \n Arkansas Clinic Offers Free Abortions \n Wed Sep 28, 6:35 AM ET\n \n A doctor has offered to perform free abortions on hurricane evacuees, saying it may be too dangerous for them to wait until they return home.\n \n Despite protests from abortion opponents, Little Rock Family Planning clinic director Dr. Jerry Edwards said he has already performed six free abortions. The clinic usually charges between $525 and $600 for a first-trimester abortion.\n \n \"If we didn't provide it now, they would get it later - a late-term abortion that would give greater risk to the mother's health,\" Edwards told KTHV-TV in Little Rock.\n \n Edwards, who runs the only abortion clinic in central Arkansas, was unavailable for further comment Tuesday, a clinic employee told The Associated Press.\n \n Rose Mimms, executive director of Arkansas Right to Life, said Edwards is risking further traumatizing women who have already lost their material belongings. \"This just adds to the devastation these women already have in their lives,\" she said.\n \n But Marvin Schwartz, spokesman for Arkansas-Oklahoma Planned Parenthood, said Edwards is providing women with a needed service.\n \n \"The timing of the abortion procedure is, of course, extremely critical. The earlier in the pregnancy, the less critical it is,\" he said.", 
   {
    "post_info": {
     "post_title": "Free Abortions"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1127947920.0
  ], 
  [
   166779, 
   null, 
   "Bassman", 
   "Talk about exploitation! And the left accuses Haliburton of what?", 
   {}, 
   166774, 
   null, 
   1127948460.0
  ], 
  [
   166782, 
   null, 
   "Wez", 
   "Talk about exploitation! And the left accuses Haliburton of what?\n\n Exploitation? They're being offered for free.\n \n Exploitation would be doubling the price...\n \n -Wez", 
   {}, 
   166779, 
   null, 
   1127949000.0
  ], 
  [
   166784, 
   null, 
   "Bassman", 
   "Just what I expected from the pro-death people.", 
   {}, 
   166782, 
   null, 
   1127949300.0
  ], 
  [
   166786, 
   null, 
   "Wez", 
   "Just what I expected from the pro-death people.\n\n Can you explain how it's exploitation?\n \n Or are you refusing to argue?\n \n -Wez", 
   {}, 
   166784, 
   null, 
   1127949480.0
  ], 
  [
   166787, 
   null, 
   "sinjin", 
   "Talk about exploitation! And the left accuses Haliburton of what?\n\n \n You really should warm that thing up before you put it in gear.", 
   {}, 
   166779, 
   null, 
   1127949720.0
  ], 
  [
   166794, 
   null, 
   "Bassman", 
   "Exploitation in that many women, who are concerned about their circumstances, aren't thinking clearly. Now, here comes this doctor saying,\"we'll kill your baby for free!\" That's exploitation.", 
   {}, 
   166787, 
   null, 
   1127950500.0
  ], 
  [
   166797, 
   null, 
   "sinjin", 
   "Exploitation in that many women, who are concerned about their circumstances, aren't thinking clearly. Now, here comes this doctor saying,\"we'll kill your baby for free!\" That's exploitation.\n\n \n The doctor would have to gain something for it to be exploitation. What does he gain? You see when you offer someone something for free that they might really want but can't afford it's called charity. When you suggest that these women need someone else doing their thinking for them it's called misogyny. Clear?", 
   {}, 
   166794, 
   null, 
   1127950860.0
  ], 
  [
   166798, 
   null, 
   "Bassman", 
   "Charity to kill unborn babies? Yeah, sure emoticon_xgood If that's charity, then I'm Leonoid Brezhnev.", 
   {}, 
   166797, 
   null, 
   1127950920.0
  ], 
  [
   166801, 
   null, 
   "sinjin", 
   "Charity to kill unborn babies? Yeah, sure emoticon_xgood If that's charity, then I'm Leonoid Brezhnev.\n\n \n Yes, offering medical procedures without cost would be charity. Pleased to meet you Leonoid.", 
   {}, 
   166798, 
   null, 
   1127951280.0
  ], 
  [
   166817, 
   null, 
   "OccamsRazor", 
   "Exploitation\n\n \n Hyperbole.", 
   {}, 
   166794, 
   null, 
   1127957820.0
  ], 
  [
   166819, 
   null, 
   "OccamsRazor", 
   "Babies conceived during the disaster will be killed for free! \n\n \n What does the issue of paying for an abortion proceedure matter for?\n \n I'd of thought from the lofty moral viewpoint of the Pro-life camp payment for an abortion would be moot.\n \n Perhaps someone can explain otherwise.......", 
   {}, 
   166774, 
   null, 
   1127958120.0
  ], 
  [
   166827, 
   null, 
   "Bassman", 
   "What does the issue of paying for an abortion proceedure matter for?\n \n I'd of thought from the lofty moral viewpoint of the Pro-life camp payment for an abortion would be moot.\n \n Perhaps someone can explain otherwise.......\n\n When it involves the killing of unborn children, it doesn't matter whether it's free or not. Not to mention the risks the women are taking.", 
   {}, 
   166819, 
   null, 
   1127962260.0
  ], 
  [
   166850, 
   null, 
   "jitobear", 
   "Exploitation in that many women, who are concerned about their circumstances, aren't thinking clearly. Now, here comes this doctor saying,\"we'll kill your baby for free!\" That's exploitation.\n\n \n You are SO insulting. \n \n \"Oh, the poor dears have been through too much and are considering an action I disagree with so they must not be thinking clearly.\" \n \n Who are you to say they aren't thinking clearly? I'll give it to you, Bassman. You are the most polite, best veiled misogynist I have ever encountered. You nearly had me fooled.", 
   {}, 
   166794, 
   null, 
   1127966820.0
  ], 
  [
   166855, 
   null, 
   "Bassman", 
   "You are SO insulting. \n \n \"Oh, the poor dears have been through too much and are considering an action I disagree with so they must not be thinking clearly.\" \n \n Who are you to say they aren't thinking clearly? I'll give it to you, Bassman. You are the most polite, best veiled misogynist I have ever encountered. You nearly had me fooled.\n\n Try again, your arrows keep missing the target. I have repeatedly stated the reasons why abortion is wrong. Not only from a moral standpoint, but a practical one as well. And on the subject of the practical, I'll give you this little tidbit of info. We are fast becoming an aging population. Now, do the math. When you've already had 40 million unborn children aborted on the altar of \"choice.\" What does that leave is with? It leaves us with fewer younger workers to support the retirees. Now, with all due respect to you and yours, I did not mean to come across as insulting. I'm simply pointing out the connection betwwen abortion, euthanasia and eugenics.", 
   {}, 
   166850, 
   null, 
   1127967540.0
  ], 
  [
   166869, 
   null, 
   "Steeeeve", 
   "Yes, offering medical procedures without cost would be charity. Pleased to meet you Leonoid.\n\n \n Not tax deductiable charity..but i guess in the general sense of the word it is..sadly :/\n \n \nYou are SO insulting.\n \n \"Oh, the poor dears have been through too much and are considering an action I disagree with so they must not be thinking clearly.\"\n \n Who are you to say they aren't thinking clearly? I'll give it to you, Bassman. You are the most polite, best veiled misogynist I have ever encountered. You nearly had me fooled.\n I would argue that anyone who gets an abortion is not thinking clearly.\n \n as for exploitation...that would depend on the motives of the doctor.", 
   {}, 
   166801, 
   null, 
   1127974740.0
  ], 
  [
   166883, 
   null, 
   "Howard Beale", 
   "Steeeeve:\n \n \nI would argue that anyone who gets an abortion is not thinking clearly.\nAnd I would argue that anyone who believes that compulsory gestation and forced parturition should be imposed on women is one of the lesser minds of the 11th Century.", 
   {}, 
   166869, 
   null, 
   1128000960.0
  ], 
  [
   166903, 
   null, 
   "Steeeeve", 
   "Steeeeve:\n \n And I would argue that anyone who believes that compulsory gestation and forced parturition should be imposed on women is one of the lesser minds of the 11th Century.\n\n \n I guess you are free to argue whatever wrong way you choose", 
   {}, 
   166883, 
   null, 
   1128006900.0
  ], 
  [
   166908, 
   null, 
   "Howard Beale", 
   "I guess you are free to argue whatever wrong way you choose\nAh! Sweet evasion. The refuge of the righteous.", 
   {}, 
   166903, 
   null, 
   1128008100.0
  ], 
  [
   166910, 
   null, 
   "jitobear", 
   "Try again, your arrows keep missing the target. I have repeatedly stated the reasons why abortion is wrong. Not only from a moral standpoint, but a practical one as well. And on the subject of the practical, I'll give you this little tidbit of info. We are fast becoming an aging population. Now, do the math. When you've already had 40 million unborn children aborted on the altar of \"choice.\" What does that leave is with? It leaves us with fewer younger workers to support the retirees. Now, with all due respect to you and yours, I did not mean to come across as insulting. I'm simply pointing out the connection betwwen abortion, euthanasia and eugenics.\n\n \n I am not arguing with your stance on abortion. I am pointing out that your snide little comment that these women must not be thinking clearly is insulting and misogynistic. And it is.", 
   {}, 
   166855, 
   null, 
   1128008640.0
  ], 
  [
   166920, 
   null, 
   "simone", 
   "Try again, your arrows keep missing the target. I have repeatedly stated the reasons why abortion is wrong. Not only from a moral standpoint, but a practical one as well. And on the subject of the practical, I'll give you this little tidbit of info. We are fast becoming an aging population. Now, do the math. When you've already had 40 million unborn children aborted on the altar of \"choice.\" What does that leave is with? It leaves us with fewer younger workers to support the retirees. Now, with all due respect to you and yours, I did not mean to come across as insulting. I'm simply pointing out the connection betwwen abortion, euthanasia and eugenics.\nMy! My! What a materialistic way to look at fetuses, \"younger workers to support the retirees.\" It essentially reduces the human race to ant status with worker ants kept around to support the rich retiree ants. Lovely!", 
   {}, 
   166855, 
   null, 
   1128010260.0
  ], 
  [
   166929, 
   null, 
   "sinjin", 
   "When you've already had 40 million unborn children aborted on the altar of \"choice.\" What does that leave is with? It leaves us with fewer younger workers to support the retirees.\n\n \n Had it occured to you that a billion people in this world would be willing to pick up the slack if only they were allowed to immigrate to the U.S.?", 
   {}, 
   166855, 
   null, 
   1128015480.0
  ], 
  [
   166966, 
   null, 
   "Bassman", 
   "I am not arguing with your stance on abortion. I am pointing out that your snide little comment that these women must not be thinking clearly is insulting and misogynistic. And it is.\n\n My bad, I should have been more sensitive. What I should have stated is that, with any traumatic situation, people have enough on their minds without the added trauma of abortion (I know where you might go with this, so I'll save you the wear on your keyboard). The effects of abortion are a well documented fact!", 
   {}, 
   166910, 
   null, 
   1128033960.0
  ], 
  [
   166970, 
   null, 
   "Wez", 
   "My bad, I should have been more sensitive. What I should have stated is that, with any traumatic situation, people have enough on their minds without the added trauma of abortion (I know where you might go with this, so I'll save you the wear on your keyboard). The effects of abortion are a well documented fact!\n\n They will also suffer trauma for having an unwanted baby.\n \n By all means oppose abortion because you believe it kills a human. That's fine imo.\n \n But being against abortion because it, apparently, causes less trauma than an unwanted child is not a valid argument imo, unless you can prove it causes less trauma than an unwanted child.\n \n -Wez", 
   {}, 
   166966, 
   null, 
   1128034200.0
  ], 
  [
   166973, 
   null, 
   "Bassman", 
   "They will also suffer trauma for having an unwanted baby.\n \n By all means oppose abortion because you believe it kills a human. That's fine imo.\n \n But being against abortion because it, apparently, causes less trauma than an unwanted child is not a valid argument imo, unless you can prove it causes less trauma than an unwanted child.\n \n -Wez\n\n Wez, no child is unwanted. That's a fallacy of the pro-abortion crowd. Each child is a precious gift, and never to be taken for granted. Do I believe that abortion kills humans? Yes, very much so. Do I also believe that there are better alternatives to abortion? Yes, very much so. Are there documented cases of post-abortion trauma, cancer, infertility, depression, etc. all linked directly to abortion? Yes. That's why my interest is not just in the child, but also the mother.", 
   {}, 
   166970, 
   null, 
   1128034680.0
  ], 
  [
   166978, 
   null, 
   "Wez", 
   "Wez, no child is unwanted.\n\n What does \"unwanted\" mean? If it means \"no-one\" wants the child, no child is unwanted. If it means that the child is not wanted by its parents, then there are many unwanted children. If you believe God loves and wants the child, then no child is unwanted.\n \n \nAre there documented cases of post-abortion trauma, cancer, infertility, depression, etc. all linked directly to abortion? Yes.\n\n The issue isn't whether \"post-abortion trauma\" exists (it does), but whether that is greater than having an unwanted child.\n \n \n Do I also believe that there are better alternatives to abortion? Yes, very much so.\n\n I believe abortions should be a last option. I'd prefer adoption.:)\n \n -Wez", 
   {}, 
   166973, 
   null, 
   1128035220.0
  ], 
  [
   166988, 
   null, 
   "Michele", 
   "\n I believe abortions should be a last option. I'd prefer adoption.:)\n \n -Wez\n\n \n \n Yes, that would be nice. But what does the woman do for 7 or 8 months while she's waiting?\n \n What if the child is not healthy? What if the child is black? Yellow? Red?\n \n There are plenty of unwanted children. Most pro-lifers love babies until they are born. Then they are someone else's problem. Then it is \"Dont' raise the minimum raise, no welfare, no universal health care, no morning-after pill, no, no, no.\"", 
   {}, 
   166978, 
   null, 
   1128039240.0
  ], 
  [
   166993, 
   null, 
   "Bassman", 
   "Yes, that would be nice. But what does the woman do for 7 or 8 months while she's waiting?\n\n She gets on with her life and adapts to her changing body. You know. It's been going on since the dawn of creation.\n \n \nWhat if the child is not healthy?\n\n Doesn't matter. There are plenty of couples who want Down's Syndrome babies, spina bifida babies. The question is rehetorical.\n \n \n \nWhat if the child is black? Yellow? Red?\n\n So What! Are you implying that all adoptive parents are racist? The question is rhetorical.\n \n \nThere are plenty of unwanted children. Most pro-lifers love babies until they are born. Then they are someone else's problem. Then it is \"Dont' raise the minimum raise, no welfare, no universal health care, no morning-after pill, no, no, no.\"\n\n Now you're steryotyping the pro-life community. First off, I've stated before, NO CHILD IS UNWANTED! Second, Where do you get the audacity to accuse us of kicking women to the curb? Third, those issues you brought up are exactly what bankrupted our country in the first place. I do think that there is a need for a safety net, but not what you advocate. We don't need welfare for life, nor do we need socialized medicine. On the morning-after pill, I agree on that, but primarily for rape victims.", 
   {}, 
   166988, 
   null, 
   1128039960.0
  ], 
  [
   167002, 
   null, 
   "Bell", 
   "She gets on with her life and adapts to her changing body. You know. It's been going on since the dawn of creation.\n\n \n You don't just \"get on\" with your life. If you are a responsible person, your  life is over. Changes have to be made.\n \n \nDoesn't matter. There are plenty of couples who want Down's Syndrome babies, spina bifida babies. The question is rehetorical.\n \n So What! Are you implying that all adoptive parents are racist? The question is rhetorical.\n\n \n I am interested in seeing some stats on this stuff.\n \n [QUOTE]\nThird, those issues you brought up are exactly what bankrupted our country in the first place.\n\n \n Really? I feel like it's this obscene war and country rebuilding that's bankrupting us, but I would never make such a claim without backing it up somehow.\n \n \nI do think that there is a need for a safety net, but not what you advocate. We don't need welfare for life, nor do we need socialized medicine. On the morning-after pill, I agree on that, but primarily for rape victims.\n\n \n What do you think we should have as a 'safety net'? I'd like to see higher education made more accessible for single moms.", 
   {}, 
   166993, 
   null, 
   1128043200.0
  ], 
  [
   167007, 
   null, 
   "Bassman", 
   "You don't just \"get on\" with your life. If you are a responsible person, your  life is over. Changes have to be made.\n\n That's almost right. Your role changes. From just a person to a parent.\n \n \n \n \nI am interested in seeing some stats on this stuff.\n\n Let me do some digging, and I'll get back to you on that.\n \n \n \n \nReally? I feel like it's this obscene war and country rebuilding that's bankrupting us, but I would never make such a claim without backing it up somehow.\n\n Since LBJ, the US has wasted over 6 trillion dollars (yes, trillion with a \"t\") on the so-called \"war on poverty\" and what has this gotten us? Nowhere except a culture of dependence and an entitlement mentality. The idea is to make sure that people take responsibility for their own lives. Not have the government take care of you from cradle to grave.\n \n \n \n \nWhat do you think we should have as a 'safety net'? I'd like to see higher education made more accessible for single moms.\n\n The Welfare Reforms of 1996 were a good start. I'd like to see fathers step up to the plate and be real men, not boys. Take responsibility for their children and delight in them. Children are a treasure, and a real treat. :)", 
   {}, 
   167002, 
   null, 
   1128043980.0
  ], 
  [
   167011, 
   null, 
   "Michele", 
   "That's almost right. Your role changes. From just a person to a parent.\n\n \n That's the point, she doesn't want to be a parent. Not for 1 month and not for nine. She is not going to walk around pregnant for nine months.\n \n \n \nLet me do some digging, and I'll get back to you on that.\n\n \n Yeah, I'd like to see that too.\n \n \n \n \n\n Since LBJ, the US has wasted over 6 trillion dollars (yes, trillion with a \"t\") on the so-called \"war on poverty\" and what has this gotten us? Nowhere except a culture of dependence and an entitlement mentality. The idea is to make sure that people take responsibility for their own lives. Not have the government take care of you from cradle to grave.\n\n \n Not really. It was a start but there was no effort for job training, no effort to provide health care as wellness maintenence instead of treating when ill. Stuffing people into a ghetto (low income housing) does not promote anything but more of the same. These people should be living next door to everyone else. All incomes, all races.\n \n \nThe Welfare Reforms of 1996 were a good start. I'd like to see fathers step up to the plate and be real men, not boys. Take responsibility for their children and delight in them. Children are a treasure, and a real treat. :)\n\n Until the double standard is removed, this will never happen. But it's a great idea.", 
   {}, 
   167007, 
   null, 
   1128044640.0
  ], 
  [
   167017, 
   null, 
   "Bassman", 
   "That's the point, she doesn't want to be a parent. Not for 1 month and not for nine. She is not going to walk around pregnant for nine months.\n\n Sometimes we all have to do something we don't want to. It's called obligation. Too often, selfishness rears its ugly head and we get into the \"what's in it for me?\" attitude. At the risk of ruffling feathers, there is the wonderful option of adoption.", 
   {}, 
   167011, 
   null, 
   1128044940.0
  ], 
  [
   167021, 
   null, 
   "OccamsRazor", 
   "When it involves the killing of unborn children, it doesn't matter whether it's free or not.\n\n \n Right, so you agree the initial statement was basically meaningless- why bother with the \"for free\" bit at all?\n \n \nNot to mention the risks the women are taking.\n\n \n Which reminds me, you never did get back to me with any impartial figures to show what \"risks\" women who choose abortion are taking. A term pregnancy is far, far more likely to result in the death of the mother for example.", 
   {}, 
   166827, 
   null, 
   1128045960.0
  ], 
  [
   167023, 
   null, 
   "Bassman", 
   "[QUOTE=OccamsRazor]Right, so you agree the initial statement was basically meaningless- why bother with the \"for free\" bit at all?[QUOTE]\n Because it is still morally wrong\n \n \n \n \nWhich reminds me, you never did get back to me with any impartial figures to show what \"risks\" women who choose abortion are taking. A term pregnancy is far, far more likely to result in the death of the mother for example.\n\n Doubtful. Term pregnancies more often than not result in both mother and child doing well. Amazing what medical technology can do, eh? Now, For those figures, go to www.abortionfacts.com. You'll find the stats concerning both physical and psychological effects of abortion. Specifically: increased infertility. increased risk of cancer, increased risk of hemmoraging from botched abortions, depression, suicide, post-abortion trauma syndrome, need I go on?", 
   {}, 
   167021, 
   null, 
   1128046380.0
  ], 
  [
   167091, 
   null, 
   "Howard Beale", 
   "Bassman:\n \n \nSince LBJ, the US has wasted over 6 trillion dollars (yes, trillion with a \"t\") on the so-called \"war on poverty\" and what has this gotten us? Nowhere except a culture of dependence and an entitlement mentality. The idea is to make sure that people take responsibility for their own lives. Not have the government take care of you from cradle to grave.\nI am surprised by most of your recent posts of late. I site this one example above. I am bothered that you posted this rhetoric again. I gave you the statistics and the government websites that support those statistics, that show the millions of people raised from poverty since 1968. From over 22% of the US population in the early 1970's to fewer than 10% in the 1990's, and yet you continue to misinform. You claim to be a Christian and mislead just like the Scribes and Pharisees of Jesus day. To purposefully misrepresent the facts is the antithesis of Christian behavior and brings into question your very claim to Christianity as well as makes suspect your personal agenda which seems much more counterfeit than you would like people to know.", 
   {
    "unicode_changes_made": true
   }, 
   167007, 
   null, 
   1128087960.0
  ], 
  [
   167115, 
   null, 
   "jitobear", 
   "\n My bad, I should have been more sensitive. What I should have stated is that, with any traumatic situation, people have enough on their minds without the added trauma of abortion (I know where you might go with this, so I'll save you the wear on your keyboard). The effects of abortion are a well documented fact!\n\n \n You continue to insult! The implication still stands that you are better able to make choices for these women than they are for themselves. God help your daughter. Will she grow up believing she is capable of making a single decision on her own?\n \n \nThat's why my interest is not just in the child, but also the mother.\n\n \n Sure, you do - regardless of what the mother may think about the situation.", 
   {}, 
   166973, 
   null, 
   1128100140.0
  ], 
  [
   167124, 
   null, 
   "Eve Harrington", 
   "One of the best decisions I've ever made in my life was to have an abortion. Do I feel guilt? No. Not many women will admit in public that they had an abortion because of the Pro-life rhetoric that's been around since the Pro-choice issue became a reality for a woman. I say 'a woman' because it's an individual choice and not a group choice as would be had I said 'women'.\n \n ::\n ::\n ::\n ::\n \n \"I myself have never been able to find out precisely what feminism is. I only know that people call me a feminist whenever I express sentiments that differentiate me from a doormat or a prostitute.\" -- Rebecca West", 
   {}, 
   166869, 
   null, 
   1128102840.0
  ], 
  [
   167146, 
   null, 
   "jitobear", 
   "I love the quote in your signature, Eve.", 
   {}, 
   167124, 
   null, 
   1128110940.0
  ], 
  [
   167167, 
   null, 
   "Bassman", 
   "You continue to insult! The implication still stands that you are better able to make choices for these women than they are for themselves. God help your daughter. Will she grow up believing she is capable of making a single decision on her own?.\n\n Now that's a pack of lies. The thing is, abortion should never be an option. It is flat out murder. Pure and simple.", 
   {}, 
   167115, 
   null, 
   1128117300.0
  ], 
  [
   167175, 
   null, 
   "Howard Beale", 
   "Now that's a pack of lies. The thing is, abortion should never be an option. It is flat out murder. Pure and simple.\nBut government imposed compulsory gestation and forced parturition is acceptable. And taking the decision making process out of the hands of the mother, the father, her doctor, their minister and God is acceptable. All in the name of what you judge is \"right\"? All under the guise of some bastardization of the teachings of Jesus. Well this is what Jesus said:\n \n Mt:7:3: And why beholdest thou the mote that is in thy brother's eye, but considerest not the beam that is in thine own eye? 4: Or how wilt thou say to thy brother, Let me pull out the mote out of thine eye; and, behold, a beam is in thine own eye? 5: Thou hypocrite, first cast out the beam out of thine own eye; and then shalt thou see clearly to cast out the mote out of thy brother's eye.\n \n This isn't about morality or good, it is all to have things done the way you think they should be done, the most unchristian motive of all.", 
   {
    "unicode_changes_made": true
   }, 
   167167, 
   null, 
   1128119160.0
  ], 
  [
   167177, 
   null, 
   "Bassman", 
   "When God Himself calls abortion, \"the shedding of innocent blood,\" there is no so-called \"moral dillema.\" Jeremiah 1:5 states \"Before I formed you in the womb I knew you.\" God, who is omnipresent, omnipotent, and omniscient, knows each and every person He creates in the world. That's why we are in no position to shed innocent blood.", 
   {}, 
   167175, 
   null, 
   1128119580.0
  ], 
  [
   167179, 
   null, 
   "Wez", 
   "When God Himself calls abortion, \"the shedding of innocent blood,\" there is no so-called \"moral dillema.\" Jeremiah 1:5 states \"Before I formed you in the womb I knew you.\" God, who is omnipresent, omnipotent, and omniscient, knows each and every person He creates in the world. That's why we are in no position to shed innocent blood.\n\n If you don't believe in what The Bible says however?\n \n -Wez", 
   {}, 
   167177, 
   null, 
   1128119760.0
  ], 
  [
   167181, 
   null, 
   "Bassman", 
   "If you don't believe in what The Bible says however?\n \n -Wez\n\n Doesn't matter, God hard-wired a concience into all people. When a person becomes so callous that wrong becomes right, then he has killed his concience.", 
   {}, 
   167179, 
   null, 
   1128120120.0
  ], 
  [
   167183, 
   null, 
   "Howard Beale", 
   "When God Himself calls abortion, \"the shedding of innocent blood,\" there is no so-called \"moral dillema.\" Jeremiah 1:5 states \"Before I formed you in the womb I knew you.\" God, who is omnipresent, omnipotent, and omniscient, knows each and every person He creates in the world. That's why we are in no position to shed innocent blood.\nThis is the most explicit statement on abortion that a non-christian Biblican can point to:\n \n \"And if men struggle with each other and strike a woman with child so that she has a miscarriage, yet there is no further injury, he shall surely be fined as the woman's husband may demand of him; and he shall pay as the judges decide. But if there is any further injury, then you shall appoint as a penalty life for life.\" (Exodus 21:22-23)\n \n Would you be willing to accept the Biblical parameters? The husband fines the perpetrator. If the husband doesn't mind, then no fine is imposed.", 
   {
    "unicode_changes_made": true
   }, 
   167177, 
   null, 
   1128120540.0
  ], 
  [
   167188, 
   null, 
   "simone", 
   "Good Lord! Eva! I'm going to steal your signature--but I'll only use it on other websites. Thanks!", 
   {}, 
   167183, 
   null, 
   1128121980.0
  ], 
  [
   167193, 
   null, 
   "Wez", 
   "Doesn't matter, God hard-wired a concience into all people. When a person becomes so callous that wrong becomes right, then he has killed his concience.\n\n Maybe you've killed your conscience? Why do you think I've killed mine?\n \n \nGood Lord! Eva! I'm going to steal your signature--but I'll only use it on other websites. Thanks!\n\n She doesn't have a signature does she? Do you mean: \"I myself have never been able to find out precisely what feminism is. I only know that people call me a feminist whenever I express sentiments that differentiate me from a doormat or a prostitute.\" -- Rebecca West.\n \n Or am I missing something?\n \n -Wez", 
   {}, 
   167181, 
   null, 
   1128122760.0
  ], 
  [
   167212, 
   null, 
   "Eve Harrington", 
   "Ladies,\n \n Please feel free to use the quote. I have yet to designate one for this forum.", 
   {}, 
   167188, 
   null, 
   1128125700.0
  ], 
  [
   167272, 
   null, 
   "jitobear", 
   "Now that's a pack of lies. The thing is, abortion should never be an option. It is flat out murder. Pure and simple.\n\n \n And men who wish to hold our bodies hostage as you do should not have the option to touch any of us.\n \n Murder is a legal term and abortion does not fall under it.\n \n Are you saying killing is never justified? Self-defense? How about monkey head's war in Iraq? Are you saying women should even lay down their lives for a pregnancy - and even if they were raped? \n \n You coward.\n \n It is so easy for you to say what we women ought and ought not to have as an option. Really really damned easy. Not like it will ever realistically affect you.\n \n Every time you post your true colors show. You don't give a damn about women. You may care about your mom, sister, wife, daughter - but women in general? We don't even exist to you.\n \n No surprise. My family doesn't exist for you either. It amazes me that you see past your narrow vision at all to hold debate with me.", 
   {}, 
   167167, 
   null, 
   1128142620.0
  ], 
  [
   167293, 
   null, 
   "Easyrider", 
   " To Bassman: You coward. It is so easy for you to say what we women ought and ought not to have as an option. Really really damned easy. Not like it will ever realistically affect you. Every time you post your true colors show. You don't give a damn about women. You may care about your mom, sister, wife, daughter - but women in general? We don't even exist to you.\n\n \n I can just about see abortion in the case of rape or incest or the health of the mother. That's between you folks and God. But let's be clear that the vast majority of abortions are the result of poor decisions, and a great number are due to immoral fornication. If people don't want to get pregnant don't get naked and fornicate. And don't butcher an innocent child because of poor moral behavior. With freedom comes responsibility. And it's irresponsible to saddle society with the costs of federally-covered abortions to make up for illicit behavior. It's one heck of a lousy birth-control method. \n \n p.s. All pro-abortion folks have one thing in common: Their mothers all chose life.", 
   {}, 
   167272, 
   null, 
   1128174600.0
  ], 
  [
   167301, 
   null, 
   "Wez", 
   "p.s. All pro-abortion folks have one thing in common: Their mothers all chose life.\n\n You don't know that. Some may have had an abortion at some point in their life.\n \n \nand a great number are due to immoral fornication. \n\n What you see as immoral.;)\n \n -Wez", 
   {}, 
   167293, 
   null, 
   1128179280.0
  ], 
  [
   167311, 
   null, 
   "Bassman", 
   "I can just about see abortion in the case of rape or incest or the health of the mother. That's between you folks and God. But let's be clear that the vast majority of abortions are the result of poor decisions, and a great number are due to immoral fornication. If people don't want to get pregnant don't get naked and fornicate. And don't butcher an innocent child because of poor moral behavior. With freedom comes responsibility. And it's irresponsible to saddle society with the costs of federally-covered abortions to make up for illicit behavior. It's one heck of a lousy birth-control method. \n \n p.s. All pro-abortion folks have one thing in common: Their mothers all chose life.\n\n As usual EZ, your timing is impeccable.", 
   {}, 
   167293, 
   null, 
   1128182760.0
  ], 
  [
   167313, 
   null, 
   "Bassman", 
   "And men who wish to hold our bodies hostage as you do should not have the option to touch any of us.\n \n Murder is a legal term and abortion does not fall under it.\n \n Are you saying killing is never justified? Self-defense? How about monkey head's war in Iraq? Are you saying women should even lay down their lives for a pregnancy - and even if they were raped? \n \n You coward.\n \n It is so easy for you to say what we women ought and ought not to have as an option. Really really damned easy. Not like it will ever realistically affect you.\n \n Every time you post your true colors show. You don't give a damn about women. You may care about your mom, sister, wife, daughter - but women in general? We don't even exist to you.\n \n No surprise. My family doesn't exist for you either. It amazes me that you see past your narrow vision at all to hold debate with me.\n\n \n Now, now; no need to get testy, there Your problem is that you can't or won't see past your blind hostility towards those who embrace life.", 
   {}, 
   167272, 
   null, 
   1128182940.0
  ], 
  [
   167315, 
   null, 
   "Eve Harrington", 
   "EasyRider = And it's irresponsible to saddle society with the costs of federally-covered abortions to make up for illicit behavior.\n\n \n The irresponsibility then rests with the Federal government. It is the government that decided to cover abortions. I don't care to be paying for abortions with my tax dollars either, however, the government must have seen the need to implement such a program into their Medicaid benefits for the under privileged.\n \n \"Illicit behavior\" is rarely the cause of choosing abortion. It is a concept generally thrown around by people who normally don't know nor care what they are talking about.", 
   {}, 
   167301, 
   null, 
   1128183240.0
  ], 
  [
   167317, 
   null, 
   "Bell", 
   " And it's irresponsible to saddle society with the costs of federally-covered abortions to make up for illicit behavior. \n\n \n What do you think about federally funded programs to help single mothers? Is that not more expensive than covering abortions?", 
   {}, 
   167293, 
   null, 
   1128183660.0
  ], 
  [
   167318, 
   null, 
   "Eve Harrington", 
   "Now, now; no need to get testy, there Your problem is that you can't or won't see past your blind hostility towards those who embrace life.\n\n \n jitobear is expressing her truth. It's a good one. You are, in effect, patting her on the head while saying, \"Now, now. Go back to being a doormat and a prostitute, we men will do your thinking for you because you're too stupid to do it for yourself.\"", 
   {}, 
   167313, 
   null, 
   1128183720.0
  ], 
  [
   167319, 
   null, 
   "Bassman", 
   "The irresponsibility then rests with the Federal government. It is the government that decided to cover abortions. I don't care to be paying for abortions with my tax dollars either, however, the government must have seen the need to implement such a program into their Medicaid benefits for the under privileged.\n \n \"Illicit behavior\" is rarely the cause of choosing abortion. It is a concept generally thrown around by people who normally don't know nor care what they are talking about.\n\n Wrong there, Once again I quote Dr. C. Everett Koop, former surgeon general under the Reagan Administration when he said that 95% of all abortions are performed for either birth control, sex selection or convenience.", 
   {}, 
   167315, 
   null, 
   1128183840.0
  ], 
  [
   167320, 
   null, 
   "Wez", 
   "But \"convenience\" can cover anything from not wanting to ruin next year's holiday plans from not wanting a child because you may comit suicide.\n \n It's like me saying \"most criminals commit crime for fun\", which is true as they commit the crime to please themselves, even if they don't find the actual crime fun.\n \n -Wez", 
   {}, 
   167319, 
   null, 
   1128184140.0
  ], 
  [
   167321, 
   null, 
   "Eve Harrington", 
   "And how many abortions were federally funded in Koop's day? My impression of Koop was that he wasn't the sharpest pencil in the pocket therefore I rarely find his notions worthy of being credible.", 
   {}, 
   167319, 
   null, 
   1128184260.0
  ], 
  [
   167322, 
   null, 
   "Bassman", 
   "And how many abortions were federally funded in Koop's day? My impression of Koop was that he wasn't the sharpest pencil in the pocket therefore I rarely find his notions worthy of being credible.\n\n A heck of alot sharper the Joycelyn Elders, I'll tell you. I don't want my tax dollars going to fund something that is barbaric and morally reprehensible.", 
   {}, 
   167321, 
   null, 
   1128184560.0
  ], 
  [
   167326, 
   null, 
   "Easyrider", 
   "All pro-abortion folks have one thing in common: Their mothers all chose life.\n \n \n \nYou don't know that. Some may have had an abortion at some point in their life.\n\n \n I was talking about the ones who are alive who are now pro-abortion. THEIR mother's all chose life in their individual cases.", 
   {}, 
   167322, 
   null, 
   1128186540.0
  ], 
  [
   167331, 
   null, 
   "Phantos", 
   "I found this to be interesting:\n \n \nApproximately 1,370,000 abortions occur annually in the U.S. according to the Alan Guttmacher Institute.\n \n --88% of abortions occur during the first 6 to 12 weeks of pregnancy.\n --60% of abortions are performed on women who already have one or more children.\n --47% of abortions are performed on women who have already had one or more abortions.\n --43% of women will have had at least one abortion by the time they are 45 years old\n \n \n Reasons for Abortion:\n \n 25.5% of women deciding to have an abortion want to postpone childbearing.\n 21.3% of women cannot afford a baby.\n 14.1% of women have a relationship issue or their partner does not want a child.\n 12.2% of women are too young (their parents or others object to the pregnancy.)\n 10.8% of women feel a child will disrupt their education or career.\n 7.9% of women want no (more) children.\n 3.3% of women have an abortion due to a risk to fetal health.\n 2.8% of women have an abortion due to a risk to maternal health.\n\n \n This means that 349,350 abortions are due each year to women wanting to postpone childbearing.\n \n 291,810 cannot afford a baby\n \n 193,170 abortions are due to a relationship issue, or a partner doesn't want a baby.\n \n 167,140 are performed because the mother is too young (parents object)\n \n 147,960 abortions are due to the fear that it will disrupt education or a career.\n \n 108,230 don't want more children.\n \n 45,210 due to risk of fetal health.\n \n 38,360 due to risk of maternal health.\n \n It's interesting to see for what reasons women are getting abortions. The number of abortions due to health risks (fetal or maternal) doesn't even add up to the amount people who just...don't want more children. This data was also taken back in 1996, it was the only demographic data I could find...but nonetheless, it's a good demonstration of how many are occuring for what reason.\n \n Info taken from:here", 
   {}, 
   167326, 
   null, 
   1128188340.0
  ], 
  [
   167333, 
   null, 
   "Wez", 
   "I was talking about the ones who are alive who are now pro-abortion. THEIR mother's all chose life in their individual cases.\n\n I'd like to keep it that way.:)\n \n -Wez", 
   {}, 
   167326, 
   null, 
   1128190800.0
  ], 
  [
   167340, 
   null, 
   "jitobear", 
   "\n p.s. All pro-abortion folks have one thing in common: Their mothers all chose life.\n\n \n My mother also taught me to be pro-choice.\n \n Don't bring the women in my history into this. You know nothing about them.\n \n My grandmother lived in a time when she did not get a choice - no abortion, no birth control, and no saying \"no\" to your husband. She lived in a one room shack with a crazy man who abused her and wouldn't work. She raised 11 kids that way. Menopause was probably one of her life's biggest blessings.\n \n My mother gave birth to her third child, who nearly died, and decided she wanted no more children. She could not get birth control or a tubal without my father's consent (a man who would ten years later walk away from his family). My mother's doctor lied to my father for her so she could get her tubes tied.\n \n My mother and her mother did not have a choice. Their bodies were turned over to their husbands and the state and when those men didn't hold to their responsibility these women had to. \n \n They both made it clear to me that ownership of myself and my body is paramount. Even if that means some women will be irresponsible with that freedom. If I am ultimately responsible for what this body produces, I will remain ultimately in charge of it. ALWAYS. And I do not care if that makes some of you boys and your misogynistic wives squirmish. If I have to I'll break any law you throw my way. This body is MINE.\n \n I wish my mother and grandmother had more choice - even if I weren't here.\n \n Bassman - still waiting for you to tell me who this Koop a-hole is that he can deteremine what is and is not mere convenience in the life of total strangers.", 
   {}, 
   167293, 
   null, 
   1128195300.0
  ], 
  [
   167342, 
   null, 
   "Phantos", 
   "Is the fetus part of your body, and when is it truly not part of your body?\n \n I think I can speak for most if not all of us males on this forum, we are not mysogynistic. I think that hastily classifying us a mysogynistic is a stereotypical generalization of us merely because we have differing views. Tell me please, why is it hateful of women to want to see children being born instead of aborted?", 
   {}, 
   167340, 
   null, 
   1128196080.0
  ], 
  [
   167347, 
   null, 
   "georged", 
   "Is the fetus part of your body, and when is it truly not part of your body?\n \n I think I can speak for most if not all of us males on this forum, we are not mysogynistic. I think that hastily classifying us a mysogynistic is a stereotypical generalization of us merely because we have differing views. Tell me please, why is it hateful of women to want to see children being born instead of aborted?\n\n \n As a male I've observed most pro-life posts on abortion are generally belief system driven. IMO using ancient, mythological belief system standards to deny a personal liberty, a woman's choice, is retrogressive in contemporary society and could easily be construed as hatred (going against antiquated belief system dogma). There are certainly enough posts on this board regarding promises of horrendous evils for not following the direction of various sects to support that observation.", 
   {}, 
   167342, 
   null, 
   1128197700.0
  ], 
  [
   167371, 
   null, 
   "Bassman", 
   "As a male I've observed most pro-life posts on abortion are generally belief system driven. IMO using ancient, mythological belief system standards to deny a personal liberty, a woman's choice, is retrogressive in contemporary society and could easily be construed as hatred (going against antiquated belief system dogma). There are certainly enough posts on this board regarding promises of horrendous evils for not following the direction of various sects to support that observation.\n\n Phantos and Easyrider are both right on this. Most abortions occur for the most selfish reasons. This \"mythologocal belief 'system'\" you talk about is as relevant today as it was when Christ walked the earth. I know that He saw me through some very sticky issues in my life.", 
   {}, 
   167347, 
   null, 
   1128209460.0
  ], 
  [
   167412, 
   null, 
   "jitobear", 
   "Phantos and Easyrider are both right on this. Most abortions occur for the most selfish reasons. This \"mythologocal belief 'system'\" you talk about is as relevant today as it was when Christ walked the earth. I know that He saw me through some very sticky issues in my life.\n\n \n And you know this how? Have you actually bothered to speak to all these women, consider their circumstances? Or are you going off random statement by random doctors who also did not know these women?", 
   {}, 
   167371, 
   null, 
   1128215760.0
  ], 
  [
   167414, 
   null, 
   "Bassman", 
   "If you read the stats in post #61 you'll see that those circumstances are very selfish. As I have said, ad nauseum, there are always better solutions than abortion.", 
   {}, 
   167412, 
   null, 
   1128216180.0
  ], 
  [
   167437, 
   null, 
   "Bassman", 
   "My mother also taught me to be pro-choice.\n \n Don't bring the women in my history into this. You know nothing about them.\n \n My grandmother lived in a time when she did not get a choice - no abortion, no birth control, and no saying \"no\" to your husband. She lived in a one room shack with a crazy man who abused her and wouldn't work. She raised 11 kids that way. Menopause was probably one of her life's biggest blessings.\n \n My mother gave birth to her third child, who nearly died, and decided she wanted no more children. She could not get birth control or a tubal without my father's consent (a man who would ten years later walk away from his family). My mother's doctor lied to my father for her so she could get her tubes tied.\n \n My mother and her mother did not have a choice. Their bodies were turned over to their husbands and the state and when those men didn't hold to their responsibility these women had to. \n \n They both made it clear to me that ownership of myself and my body is paramount. Even if that means some women will be irresponsible with that freedom. If I am ultimately responsible for what this body produces, I will remain ultimately in charge of it. ALWAYS. And I do not care if that makes some of you boys and your misogynistic wives squirmish. If I have to I'll break any law you throw my way. This body is MINE.\n \n I wish my mother and grandmother had more choice - even if I weren't here.\n \n Bassman - still waiting for you to tell me who this Koop a-hole is that he can deteremine what is and is not mere convenience in the life of total strangers.\n\n Dr. Koop is a world-renown pediatrician and knows full well the horrors of abortion.", 
   {}, 
   167340, 
   null, 
   1128226560.0
  ], 
  [
   167438, 
   null, 
   "Eve Harrington", 
   "jitobear,\n \n Dr. C. Everett Koop was Surgeon General in the 80s under Ronald Reagan. That's not an opinion, just facts.", 
   {}, 
   167437, 
   null, 
   1128227760.0
  ], 
  [
   167439, 
   null, 
   "Bassman", 
   "Thank you.", 
   {}, 
   167438, 
   null, 
   1128227820.0
  ], 
  [
   167481, 
   null, 
   "georged", 
   "[QUOTE=Eve Harrington\n Dr. C. Everett Koop was Surgeon General in the 80s under Ronald Reagan. That's not an opinion, just facts.[/QUOTE]\n \n And the first surgeon general nominee to be challenged in 109-years. In confirmation hearings he stated he would follow the law of the land in supporting the right of women to choose to have an abortion rather than be accused of using his office as a pulpit. \n \n http://profiles.nlm.nih.gov/QQ/B/C/F/R/_/qqbcfr.pdf\n \n There are many in-depth articles discussing Dr. Koop's stand on abortion while serving as surgeon general (I discount any references from open source Wikipedia), and all point to the fact that his position was based on a moral, not medical opinion of the mother. His evasive summary on abortion to President Regan was \"scientific studies do not provide conclusive data about the health effects of abortion on women.\" \n \n http://www.abortionfacts.com/reardon/revisiting_dr_koops_report.asp\n \n Dr. Koop also supported Hillary Clinton's universal health care plan, which incidentally included subsidized abortion clinics in every locale.\n \n http://www.banneroftruth.org/pages/articles/article_detail.php?692", 
   {}, 
   167438, 
   null, 
   1128268440.0
  ], 
  [
   167487, 
   null, 
   "simone", 
   "Is the fetus part of your body, and when is it truly not part of your body?\n \n I think I can speak for most if not all of us males on this forum, we are not mysogynistic. I think that hastily classifying us a mysogynistic is a stereotypical generalization of us merely because we have differing views. Tell me please, why is it hateful of women to want to see children being born instead of aborted?\nPhantos, it's not at all hateful if these women are concerned only with their own bodies. What's your problem with that, Phantos?", 
   {}, 
   167342, 
   null, 
   1128270720.0
  ], 
  [
   167488, 
   null, 
   "Eve Harrington", 
   "Thank you georged.", 
   {}, 
   167481, 
   null, 
   1128270720.0
  ], 
  [
   167489, 
   null, 
   "simone", 
   "Phantos and Easyrider are both right on this. Most abortions occur for the most selfish reasons. This \"mythologocal belief 'system'\" you talk about is as relevant today as it was when Christ walked the earth. I know that He saw me through some very sticky issues in my life.\nBassman! Bassman! How easily you take it upon yourself to speak for others?\n \n How can you say with full assurance that \"Most abortions occur for the most selfish reasons.\"?\n \n Have you talked with every woman in the world who has had an abortion that you can make that statement? Or, have you declared yourself God Almighty because you know what is in the heart of every woman who has had an abortion?\n \n Pray tell us all about your enormous powers to read the hearts and minds of so many women, Bassman.", 
   {}, 
   167371, 
   null, 
   1128270900.0
  ], 
  [
   167490, 
   null, 
   "Bassman", 
   "Stats don't lie. Most abortions occur for birth control, sex selection or because they \"choose\" not to. For God's sake. Are you that hard-hearted?", 
   {}, 
   167489, 
   null, 
   1128271740.0
  ], 
  [
   167493, 
   null, 
   "georged", 
   "Stats don't lie. Most abortions occur for birth control, sex selection or because they \"choose\" not to. For God's sake. Are you that hard-hearted?\n\n \n That's a civil liberty in a country founded on freedom. What does personal choice regardless of reason have to do with anyone else's opinion and why would it be anyone else's business?", 
   {}, 
   167490, 
   null, 
   1128276060.0
  ], 
  [
   167494, 
   null, 
   "Bassman", 
   "That's a civil liberty in a country founded on freedom. What does personal choice regardless of reason have to do with anyone else's opinion and why would it be anyone else's business?\n\n \"Civil Libery?\" Where in the United States Constitution does it say that we have the right to kill our offspring? Is it because children are too burdensome? Is it because we want to further our own careers? Is it because we wanted a boy instead of a girl? What if you decide you don't want it after it's born? Ever take that into account??? How about a \"90-day money back guarantee!\" \"Freedom to choose\" my foot!", 
   {}, 
   167493, 
   null, 
   1128276180.0
  ], 
  [
   167496, 
   null, 
   "georged", 
   "\"Civil Libery?\" Where in the United States Constitution does it say that we have the right to kill our offspring?\n\n \n Unless you're a woman, 'our' is poor grammar when used in that context. Our constitution does not deny a woman's right to terminate a pregnancy. Efforts to deny that right, if I may quote another poster, are intellectually 11th or so century mentality. Unless, of course, you're advocating inclusion of belief system standards into a constitution that separates church and state, the very purpose of this country breaking ties with England and seeking independence.", 
   {}, 
   167494, 
   null, 
   1128276960.0
  ], 
  [
   167497, 
   null, 
   "Bassman", 
   "Using the same logic, then, you're advocating the right to rape, the right to steal, the right to arson, the right to...etc. So what is the difference here?\" Well it's my body.\" <buzz< wrong answer. In this day and age, we've lost the mere concept of duty, loyalty, responsibility, and obligation.", 
   {}, 
   167496, 
   null, 
   1128277500.0
  ], 
  [
   167506, 
   null, 
   "OccamsRazor", 
   "\n Doubtful. Term pregnancies more often than not result in both mother and child doing well. Amazing what medical technology can do, eh? Now, For those figures, go to www.abortionfacts.com. You'll find the stats concerning both physical and psychological effects of abortion. Specifically: increased infertility. increased risk of cancer, increased risk of hemmoraging from botched abortions, depression, suicide, post-abortion trauma syndrome, need I go on?\n\n \n Yes, we have already established that abortionfacts.com is a pro-life page and as such is far from impartial. You talk about \"increased risk of cancer, increased risk of hemmoraging from botched abortions, depression, suicide, post-abortion trauma syndrome\" but these are measured against women who are not pregnant. While an abortion (like any medical proceedure) carries risks, these are far smaller than those posed by a woman who sees a pregnancy to term and gives birth.\n \n In case you forgot, here are the figures I quoted you before:\n \n http://www.acog.org/from_home/publications/green_journal/2004/v103n4p729.pdf\n \n Which shows an abortion will cause 0.3 deaths per 100,000 carried out in the USA in 1995.\n \n http://www.childinfo.org/eddb/mat_mortal/\n \n Which shows a term pregnancy poses a 1 in 4085 risk of death over a womans lifetime in industrialised nations in 1995.\n \n You do the math- how many abortions does a woman need to have before she is as at much risk as that posed by taking pregnacies to term over her lifetime? Something like 80, which gives a good indication of the relative risk......", 
   {}, 
   167023, 
   null, 
   1128283140.0
  ], 
  [
   167507, 
   null, 
   "Phantos", 
   "\n Which shows an abortion will cause 0.3 deaths per 100,000 carried out in the USA in 1995.\n \n Which shows a term pregnancy poses a 1 in 4085 risk of death over a womans lifetime in industrialised nations in 1995.\n \n\n \n So, if we're talking about saving lives here, doesn't it mean that for one life lost, 4,085 lives will be gained opposed to the 100,000.3 deaths abortion causes?", 
   {}, 
   167506, 
   null, 
   1128283740.0
  ], 
  [
   167518, 
   null, 
   "georged", 
   "Using the same logic, then, you're advocating the right to rape, the right to steal, the right to arson, the right to...etc. So what is the difference here?\" Well it's my body.\" <buzz< wrong answer. In this day and age, we've lost the mere concept of duty, loyalty, responsibility, and obligation.\n\n \n Try staying focused on abortion instead of going off on moralistic tangents; the issue is civil liberty, a woman's right to abort a pregnancy. That is a woman's body and for you or a government to deny her the right to abort is infringing on her individual civil liberty, nothing else. \n \n I suggest you avoid using the word we in a patronizing manner when discussing abortion unless you can conceive, carry to term and give birth. It does create an appearance of substitution to avoid using a subjective I.", 
   {}, 
   167497, 
   null, 
   1128287760.0
  ], 
  [
   167523, 
   null, 
   "OccamsRazor", 
   "So, if we're talking about saving lives here, doesn't it mean that for one life lost, 4,085 lives will be gained opposed to the 100,000.3 deaths abortion causes?\n\n \n These statistics are not about \"saving lives\"- they illustrate that pregnancy carries a much greater risk of death for the mother than an abortion. They show the number of occurences of an event (pregnancy- 4085/abortion- 100000) to yield a certain effect (death of mother as a consequence of pregnancy- 1/abortion- 0.3).\n \n So in answer to your question, no.\n \n Bassman's assertion is abortion is bad because of the risk it poses to the mother- the data does not support that notion and thus the arguement he makes is false.", 
   {}, 
   167507, 
   null, 
   1128290220.0
  ], 
  [
   167524, 
   null, 
   "Bassman", 
   "Try staying focused on abortion instead of going off on moralistic tangents; the issue is civil liberty, a woman's right to abort a pregnancy. That is a woman's body and for you or a government to deny her the right to abort is infringing on her individual civil liberty, nothing else. \n \n I suggest you avoid using the word we in a patronizing manner when discussing abortion unless you can conceive, carry to term and give birth. It does create an appearance of substitution to avoid using a subjective I.\n\n \"Patronizing?\" I'm pointing out the flawed logic of your stance.", 
   {}, 
   167518, 
   null, 
   1128291240.0
  ], 
  [
   167526, 
   null, 
   "Phantos", 
   "These statistics are not about \"saving lives\"- they illustrate that pregnancy carries a much greater risk of death for the mother than an abortion. They show the number of occurences of an event (pregnancy- 4085/abortion- 100000) to yield a certain effect (death of mother as a consequence of pregnancy- 1/abortion- 0.3).\n \n So in answer to your question, no.\n \n Bassman's assertion is abortion is bad because of the risk it poses to the mother- the data does not support that notion and thus the arguement he makes is false.\n\n \n I see that. But if you look at the statistics as a whole, in which situation are more lives lost?", 
   {}, 
   167523, 
   null, 
   1128292200.0
  ], 
  [
   167529, 
   null, 
   "georged", 
   "\"Patronizing?\" I'm pointing out the flawed logic of your stance.\n\n \n Using the word we to associate yourself with a theoretic woman's pregnancy while trying to impose your opinion of abortion when you're incapable of pregnancy is blatant patronization.\n \n ~we've lost the mere concept of duty, loyalty, responsibility, and obligation.~ \n \n And the flaw in civil liberty recognizing a woman's right to abort is? Stay focused, don't drift off into other subjects or moral issues.", 
   {}, 
   167524, 
   null, 
   1128294960.0
  ], 
  [
   167532, 
   null, 
   "Bassman", 
   "Using the word we to associate yourself with a theoretic woman's pregnancy while trying to impose your opinion of abortion when you're incapable of pregnancy is blatant patronization.\n\n I'm referring to the nation as a whole.\n \n \n~we've lost the mere concept of duty, loyalty, responsibility, and obligation.~\n\n That's easy, we need to regain those concepts and apply them into our lives. \n \n \nAnd the flaw in civil liberty recognizing a woman's right to abort is? Stay focused, don't drift off into other subjects or moral issues.\n\n It's found nowhere in the US Constitution. And yes, it is a serious moral issue because we are talking about life. Not just lives of the unborn, but lives of the women who have been exploited by the abortion industry.", 
   {}, 
   167529, 
   null, 
   1128296640.0
  ], 
  [
   167539, 
   null, 
   "georged", 
   "I'm referring to the nation as a whole.\n \n \n That's easy, we need to regain those concepts and apply them into our lives. \n \n \n It's found nowhere in the US Constitution. And yes, it is a serious moral issue because we are talking about life. Not just lives of the unborn, but lives of the women who have been exploited by the abortion industry.\n\n \n You're evading the issue. This isn't an issue of a nation, including men, this is an individual right. Those women choose abortions and it is their right. You are not capable of conception so you use your belief system mythology to dominate their rights.\n \n Exploitation is denying them that right and forcing them to spawn children who are unwanted for what ever reason. You, as a male, are attempting to force your abortion moral standard on women. Why don't you just take away the rest of their hard-earned liberties? Voting, land ownership, divorce, freedom from servitude and on and on? Shuffle on back to some past point in history that fits your moral standards? I hear the ME World of Islam is looking for converts, just change some worship names and you'll have the moral standards you're seeking.", 
   {}, 
   167532, 
   null, 
   1128299640.0
  ], 
  [
   167541, 
   null, 
   "Bassman", 
   "What part of \"moral issues of life\" don't you get? 50+million unborn children have been legally murdered since the horrendous Roe decision came down. Now, at the risk of sounding like a broken record. We, as a nation have lost all sense of loyalty, duty, responsibility, and obligation and replaced them with so-called \"civil liberties.\" This problem goes way deeper than a woman's \"right\" to kill her offspring. It is a problem of moral absolutes, or lack thereof.", 
   {}, 
   167539, 
   null, 
   1128300000.0
  ], 
  [
   167546, 
   null, 
   "georged", 
   "What part of \"moral issues of life\" don't you get? 50+million unborn children have been legally murdered since the horrendous Roe decision came down. Now, at the risk of sounding like a broken record. We, as a nation have lost all sense of loyalty, duty, responsibility, and obligation and replaced them with so-called \"civil liberties.\" This problem goes way deeper than a woman's \"right\" to kill her offspring. It is a problem of moral absolutes, or lack thereof.\n\n \n Your moral absolutes, not those of the women who choose abortion regardless of their rationale. You're basing your morality opinions on a belief system you subscribe to without consideration for those who make the determination to not reproduce, for whatever reason. You advocate government interference with that right of choice based on your belief system doctrine penned during history when there was no comprehension of modern society, when midwifes terminated obvious physically defective births and every witch doctor had herbs to terminate a pregnancy where the woman's life was in danger. Able hands were needed to survive, none other need apply. Study some history along with your bible perusal. When you're familiar with socio-economic conditions from the eras it was penned, you'll automatically make historical comparisons of every event in your life as a second thought. \n \n Do you even understand that women were not allowed to vote in the US until the last century? Until you understand the socio-economic differences between your basis of opinion on abortion and 2,000 odd years later, we've reached an impasse.", 
   {}, 
   167541, 
   null, 
   1128306420.0
  ], 
  [
   167576, 
   null, 
   "Bassman", 
   "So, let me get this straight. You're willing to sacrifice our future generations on the altar of \"choice?\" Sad, very sad!", 
   {}, 
   167546, 
   null, 
   1128343620.0
  ], 
  [
   167605, 
   null, 
   "simone", 
   "Bassman, freedom, liberty. Those terms come to mind.\n \n Are women free or not? Do they enjoy full and complete liberty or do they?\n \n Is this a nation of freedom, liberty and equality? Or, is it an Islamic state?", 
   {}, 
   167576, 
   null, 
   1128359400.0
  ], 
  [
   167606, 
   null, 
   "simone", 
   "OK, I'm slamming Islam. But I'm not yet convinced that Islam and the concept of democracy which ncludes liberty, freedom and equality of men and women is compatible with Islam.", 
   {}, 
   167605, 
   null, 
   1128359460.0
  ], 
  [
   167611, 
   null, 
   "jitobear", 
   "So, let me get this straight. You're willing to sacrifice our future generations on the altar of \"choice?\" Sad, very sad!\n\n \n I am getting really sick and tired of this assertation from you. My grandmother, my mother and my mother's children are/were pro-choice and have given this world 18 children. When you consider all the kids and grandkids from mymother's siblings we are talking between 50 and 75. All from my (mostly) pro-choice family.\n \n People who are pro-choice don't want to abort all pregnancies, hate kids or even think abortion is a good idea. We simply don't feel we are qualified to make personal decisions for total strangers unlike some egomaniacal people.\n \n \nDr. Koop is a world-renown pediatrician and knows full well the horrors of abortion.\n\n \n But you have not answered my original question. I did not ask what his expereience with abortion was. I asked who the hell he was to know what is and is not a convenience in the life of total strangers. His position nor his medical training qualify him to make such assertations. \n \n Now for these stupid stats that are so high level that they reveal nearly nothing. Like there are only 8-10 things that ever go on in somebody's life.\n \n 25.5% of women deciding to have an abortion want to postpone childbearing.\n \n Why\n \n 21.3% of women cannot afford a baby.\n \n Yes poverty is problem. It can also affect whether you get access to medical care. I nearly was denied. Me and a clever social worker had tell a pack of lies so I could get it. \n \n Or has your wife been footing all the bills so you are blissfully unaware that pregnancy and children are expensive?\n \n 14.1% of women have a relationship issue or their partner does not want a child.\n \n This usually indicates abuse. A pregancy that resulted from violence or will result in more. But who cares if they are safe - I mean they are just women after all.\n \n 12.2% of women are too young (their parents or others object to the pregnancy.)\n \n Little girls are physically, mentally, and emotionally ill equipped to deal with pregnancy. Also health risks to underdeveloped girls who became pregnant sky rocket compared to those of adult women.\n \n 10.8% of women feel a child will disrupt their education or career.\n \n If a pregnancy were to disrupt mine I would end the pregnancy. See my job keeps me and my born child fed. But then I know - my little fatherless boy being raised by the gay man is probably expendable since he doesn't fit in your Leave it to Beaver world.\n \n 7.9% of women want no (more) children.\n \n There are a miriad of reasons to not want kids. And I am dammed tired of the position that anything a woman may want or need in this life is selfish or a mere convenience. \n \n Women aren't cattle and everything going on in their lives desrves valid consideration when she becomes pregnant. Your demonization and tell nothing stats don't change that and don't help get her issues addressed so she CAN support a pregnancy and possibly a child.", 
   {}, 
   167576, 
   null, 
   1128360360.0
  ], 
  [
   167614, 
   null, 
   "georged", 
   "So, let me get this straight. You're willing to sacrifice our future generations on the altar of \"choice?\" Sad, very sad!\n\n \n Orphanages around the world, including the US, are jammed with those future generations. Even with a population growth rate of 2% you'll have unwanted future generations running out of your ears. Do you have any adopted children living in your home to justify your opinion, or is that something where the reality of your wallet denies your unrealistic philosophy? You also condemn federal spending on aid to dependent children (welfare), does that mean you help those less fortunate in your community who have children they can't afford to feed with money to support that opinion? Or is your condemnation of a woman's free choice and individual liberty just another bag of antiquated belief system hot air with no contemporary reality?", 
   {}, 
   167576, 
   null, 
   1128361200.0
  ], 
  [
   167623, 
   null, 
   "Steeeeve", 
   "Women aren't cattle and everything going on in their lives desrves valid consideration when she becomes pregnant. Your demonization and tell nothing stats don't change that and don't help get her issues addressed so she CAN support a pregnancy and possibly a child.\n \n I think Jitobear meant some women aren't cattle. The unborn women (and men for that matter) are cattle because we just slaughter them like it is nothing.", 
   {}, 
   167614, 
   null, 
   1128362580.0
  ], 
  [
   167705, 
   null, 
   "simone", 
   "Steeeve, do you believe that only blacks can be slaves?\n \n And, what about Bennett's statement about aborting \"black babies\" to cut crime?", 
   {}, 
   167623, 
   null, 
   1128384060.0
  ], 
  [
   167707, 
   null, 
   "Bassman", 
   "Orphanages around the world, including the US, are jammed with those future generations. Even with a population growth rate of 2% you'll have unwanted future generations running out of your ears. Do you have any adopted children living in your home to justify your opinion, or is that something where the reality of your wallet denies your unrealistic philosophy? You also condemn federal spending on aid to dependent children (welfare), does that mean you help those less fortunate in your community who have children they can't afford to feed with money to support that opinion? Or is your condemnation of a woman's free choice and individual liberty just another bag of antiquated belief system hot air with no contemporary reality?\n\n What I condemn is the liberal socialist welfare state that the \"free love\" of the 60's and 70's helped create. I condemn welfare as a lifestyle into second, third and fourth generations. I condemn the culture of death that permiates society now.", 
   {}, 
   167614, 
   null, 
   1128384900.0
  ], 
  [
   167938, 
   null, 
   "OccamsRazor", 
   "I see that. But if you look at the statistics as a whole, in which situation are more lives lost?\n\n \n You'd need more figures to make that analysis, namely the number of pregnancies studied to give the maternal mordidity rate.\n \n Aside from that you then get into the sticky quagmire of determinig if an aborted foetus is a \"lost life\" or not- so your figures can be skewed according the observers opinion on the matter, depending where they place the \"this is a person at this point\" marker.", 
   {}, 
   167526, 
   null, 
   1128447960.0
  ], 
  [
   169126, 
   null, 
   "Eve Harrington", 
   "Well, at least she didn't abort the baby......\n \n \n Police Investigate Infant's Death\n College Student Discovers Blood In Bathroom ....\n \n \n UPDATED: 5:48 pm EDT October 4, 2005\n \n OWINGS MILLS, Md. -- A college student led officers Tuesday to the body of her dead newborn girl at the bottom of a storm drain, hours after a roommate reported finding blood in their dorm room and the woman missing, police said.\n \n Police were called to Villa Julie College at about 2:30 a.m. after receiving a call about a missing student, said Sgt. Vickie Warehime, a Baltimore County police spokeswoman. When officers arrived, they found blood in the dorm bathroom and a roommate who was concerned for the safety of the woman.\n \n The 20-year-old student was found at her parents' home in Clinton in Prince George's County at about 8:30 a.m. Police said they spoke to the woman at length, and then she led police to a storm drain about 50 feet from the house, Warehime said. Her parents then took her to a local hospital for a full examination.\n \n It was not clear whether the baby was born alive or stillborn. Authorities said they are still trying to determine how long the baby's body was in the storm drain.\n \n \"The investigation into the death of the child is ongoing, pending the results of the autopsy,\" Warehime said.\n \n Baltimore County police planned to work with Prince George's authorities until the autopsy indicates where the child actually died.\n \n \"We do believe that the birth of the child took place here in Baltimore County,\" Warehime said. \"As to the condition of the child at birth and where the child actually died, we have to wait for the autopsy results.\"\n \n The body was taken to the state medical examiner's office in Baltimore. Police, meanwhile, interviewed students in the dorm and spoke with the woman.\n \n \"She has been interviewed,\" Warehime said. \"She's at a local hospital, and the investigation continues.\"\n \n Baltimore County police said a roommate of the mother heard what sounded like a crying baby in the bathroom of a dorm room she shared with the mother at the college Monday morning at 6:30 a.m., about 20 hours before she discovered the blood in the same bathroom.\n \n A spokesman for the college referred questions to authorities.", 
   {}, 
   167938, 
   null, 
   1128750540.0
  ], 
  [
   169133, 
   null, 
   "Steeeeve", 
   "Well, at least she didn't abort the baby......\n \n \n Police Investigate Infant's Death\n College Student Discovers Blood In Bathroom ....\n \n \n UPDATED: 5:48 pm EDT October 4, 2005\n \n OWINGS MILLS, Md. -- A college student led officers Tuesday to the body of her dead newborn girl at the bottom of a storm drain, hours after a roommate reported finding blood in their dorm room and the woman missing, police said.\n \n Police were called to Villa Julie College at about 2:30 a.m. after receiving a call about a missing student, said Sgt. Vickie Warehime, a Baltimore County police spokeswoman. When officers arrived, they found blood in the dorm bathroom and a roommate who was concerned for the safety of the woman.\n \n The 20-year-old student was found at her parents' home in Clinton in Prince George's County at about 8:30 a.m. Police said they spoke to the woman at length, and then she led police to a storm drain about 50 feet from the house, Warehime said. Her parents then took her to a local hospital for a full examination.\n \n It was not clear whether the baby was born alive or stillborn. Authorities said they are still trying to determine how long the baby's body was in the storm drain.\n \n \"The investigation into the death of the child is ongoing, pending the results of the autopsy,\" Warehime said.\n \n Baltimore County police planned to work with Prince George's authorities until the autopsy indicates where the child actually died.\n \n \"We do believe that the birth of the child took place here in Baltimore County,\" Warehime said. \"As to the condition of the child at birth and where the child actually died, we have to wait for the autopsy results.\"\n \n The body was taken to the state medical examiner's office in Baltimore. Police, meanwhile, interviewed students in the dorm and spoke with the woman.\n \n \"She has been interviewed,\" Warehime said. \"She's at a local hospital, and the investigation continues.\"\n \n Baltimore County police said a roommate of the mother heard what sounded like a crying baby in the bathroom of a dorm room she shared with the mother at the college Monday morning at 6:30 a.m., about 20 hours before she discovered the blood in the same bathroom.\n \n A spokesman for the college referred questions to authorities.\n\n Give us a follow up if you can. I wanna know if she is gonna go to jail for this.", 
   {}, 
   169126, 
   null, 
   1128754200.0
  ], 
  [
   169136, 
   null, 
   "Eve Harrington", 
   "I will try to do that for you.\n \n This is something that rarely happens in my town anymore. It used to be a big problem but not anymore. Any small baby now can be taken to a police station or fire station to be given away there.....no questions asked and no criminal charges filed.\n \n The child is immediately taken to the hospital for a check-up then to a shelter and put up for adoption. The thing is, a majority of the time it is the policeman or fireman that ends up adopting the baby. It would seem that once that baby is laid in his arms for safe keeping, he can't let go.", 
   {}, 
   169133, 
   null, 
   1128755340.0
  ], 
  [
   169138, 
   null, 
   "Bassman", 
   "New York State has that law, also. And I think that it is a good law. The child has a chance at life.", 
   {}, 
   169136, 
   null, 
   1128756060.0
  ], 
  [
   169184, 
   null, 
   "simone", 
   "You know, Bassman, if Christians weren't so ugly to unwed mothers and condemning of them, it might be easier for them to go through with an acknowledged pregnancy and surrender that child to possible adoptive parents.\n \n But, if you can be in any way honest with yourself, you have to admit that time after time, after feminists have worked to make abortion accessible, which ironically, made it almost heroic for unwed pregnant women to choose to continue a pregnancy rather than abort, some half-a$$3d male conservative leaps into the fray to argue that illegitimate births must be railed against and condemned. I remember John Leo doing precisely that only a few years ago.", 
   {}, 
   169138, 
   null, 
   1128789540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Free Abortions", 
  "url": "http://www.4forums.com/political/abortion-debates/6502-free-abortions.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 6502, 
  "discussion_files": [
   [
    "9510.html", 
    "http://www.4forums.com/political/abortion-debates/6502-free-abortions-print.html"
   ], 
   [
    "9511.html", 
    "http://www.4forums.com/political/abortion-debates/6502-free-abortions-7-print.html"
   ], 
   [
    "9512.html", 
    "http://www.4forums.com/political/abortion-debates/6502-free-abortions-5-print.html"
   ], 
   [
    "9513.html", 
    "http://www.4forums.com/political/abortion-debates/6502-free-abortions-4-print.html"
   ], 
   [
    "9514.html", 
    "http://www.4forums.com/political/abortion-debates/6502-free-abortions-6-print.html"
   ], 
   [
    "9515.html", 
    "http://www.4forums.com/political/abortion-debates/6502-free-abortions-3-print.html"
   ], 
   [
    "9516.html", 
    "http://www.4forums.com/political/abortion-debates/6502-free-abortions-2-print.html"
   ]
  ], 
  "identifier": 6502
 }
]