[
 [
  [
   167299, 
   null, 
   "Eve Harrington", 
   "COWS\n Is it just me, or does anyone else find it amazing that our government\n can track a cow born in Canada almost three years ago, right to the\n stall where she sleeps in the state of Washington And they tracked her\n calves to their stalls. But they are unable to locate 11 million illegal\n aliens wandering around our country. Maybe we should give them all a\n cow.\n \n CONSTITUTION\n They keep talking about drafting a Constitution for Iraq. Why don't we\n just give them ours? It was written by a lot of really smart guys, it's\n worked for over 200 years and we're not using it anymore.\n \n TEN COMMANDMENTS\n The real reason that we can't have the Ten Commandments in a Courthouse!\n You cannot post \"Thou Shalt Not Steal,\" \"Thou Shalt Not Commit Adultery\"\n and \"Thou Shall Not Lie\" in a building full of lawyers, ! judges and\n politicians! It creates a hostile work environment!\n \n AND LAST BUT NOT LEAST\n George Carlin said it best about Martha Stewart . \"Boy, I feel a lot\n safer now that she's behind bars. O.J. Simpson and Kobe Bryant are\n still walking around; Osama Bin Laden too, but they take the one woman\n in America willing to cook, clean, and work in the yard, and haul her\n butt off to jail.\"", 
   {
    "post_info": {
     "post_title": "Truth"
    }
   }, 
   null, 
   null, 
   1128178560.0
  ], 
  [
   167309, 
   null, 
   "georged", 
   "All accurate and sure to bring on the self-righteous wrath of those many still living in delusion driven by ancient mythology belief systems and believing that their politicians have their constituents best interests at heart.", 
   {}, 
   167299, 
   null, 
   1128182580.0
  ], 
  [
   167343, 
   null, 
   "Jo Bennett", 
   "Haven't lots of places tried a constitution similar to the US and had serious problems. And didn't you have a civil war? And a massive uprising of people demanding civil rights?", 
   {}, 
   167309, 
   null, 
   1128196200.0
  ], 
  [
   167354, 
   null, 
   "georged", 
   "Haven't lots of places tried a constitution similar to the US and had serious problems. And didn't you have a civil war? And a massive uprising of people demanding civil rights?\n\n \n And we now support one side of a civil war in Iraq that's presenting their citizenry with a modified US Constitution using our military force.", 
   {}, 
   167343, 
   null, 
   1128201300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Truth", 
  "url": "http://www.4forums.com/political/government-debates/6517-truth.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 6517, 
  "discussion_files": [
   [
    "15841.html", 
    "http://www.4forums.com/political/government-debates/6517-truth-print.html"
   ]
  ], 
  "identifier": 6517
 }
]