[
 [
  [
   8947, 
   null, 
   "SparkleSocks22", 
   "Should the press portray people as they did 20-30 years ago, making the stars look good, or making them look as they do now? \n Think about this.\n If you saw Michael Jackson on the cover of a magazine and it said \"Michael donates a million dollars to charity\" would you buy it over\n A tabloid reading \"Michael Jackson steals 500,000 dollars from Steven Tyler\"\n Face it, bad press sells better than good press. Just leave the stars to their personal lives. We need to focus on their amazing talents...All these wonderful stars that have amazing talent are ruined by the press's lie's! Like Michael for example, his image was flawless nothing could taint his image until 1993 when that sick, sorry kid (jordy chandler) revealed that Michael did such a thing! His image was tainted FOREVER! Just for a FREAKEN ACCUSATION! He was never proved guilty and never will be because he is innocent...but his image can never be cleaned up because of this. The press is horrible. Don't trust ANYTHING you read!\n Just because you read it in a magazine or see it on a TV screen don't make it factual.", 
   {
    "post_info": {
     "post_title": "Press Lies"
    }
   }, 
   null, 
   null, 
   1054759260.0
  ], 
  [
   9490, 
   null, 
   "katie5890", 
   "that's cuz we'd rather be entertained, and i wouldnt be surprized if micheal jackson donated money to a childrens charilty....b cuz he 'cares' so much about the kids :)", 
   {}, 
   8947, 
   null, 
   1055435820.0
  ], 
  [
   9545, 
   null, 
   "gilligan8503", 
   "the press has never told the truth. in vietnam, the press would tell the troops they were winning, and, of course, they weren't.", 
   {}, 
   8947, 
   null, 
   1055464680.0
  ], 
  [
   9594, 
   null, 
   "Debate_Queen615", 
   "I actually watched a show on poperazzis today \n \n poperazzis (s.p.?) will do ANYTHING to get a good story \n \n like you said Sparkle \n I'm not sure if you made it up or this is what it actually said on a mag.\n \n \"Michael Jackson steals 500,000 dollars from Steven Tyler\"\n \n Micheal Jackson could have BORROWED the money from Steven Tyler, or Steven could have owed the money to Micheal\n \n now poperazzis seeing money being handed over or \"taken\" to or by a celebrity they could make a good story out of this,right? \n \n they take every chance they get\n \n \n about Former actress from Charmed (she played Prue)\n \n she used to blow up at poperazzis for stalking her she would throw a punch or something, that was when she was on \"Beverly Hills 90210\" now poperazzis wait or her to blow up at them hoping to make a good story out of it\n \n you know they wanted \n \n \"Shannen Doherty Strikes Back\"\n \n on the front cover of a magazine", 
   {}, 
   8947, 
   null, 
   1055488920.0
  ], 
  [
   11394, 
   null, 
   "SparkleSocks22", 
   "\"now poperazzis seeing money being handed over or \"taken\" to or by a celebrity they could make a good story out of this,right? \n \n they take every chance they get\"\n -Exactly.\n \n and I just made that up I didn't see it anywhere, just using it as an example.\n \n Debate~\n I saw that show too and I know exactly what you are talking about. The press just needs to be like it was in the old days. I mean they were there to make stars look good but now they are just out to make everyone look bad. Because bad gossip sells better than good gossip.", 
   {}, 
   9594, 
   null, 
   1057261920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Press Lies", 
  "url": "http://www.4forums.com/political/entertainment-debates/655-press-lies.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 655, 
  "discussion_files": [
   [
    "3094.html", 
    "http://www.4forums.com/political/entertainment-debates/655-press-lies-print.html"
   ]
  ], 
  "identifier": 655
 }
]