[
 [
  [
   168238, 
   null, 
   "Matthew S", 
   "Just when you thought you have heard it all the christonazis come up with something that suprises you.\n \n http://www.365gay.com/newscon05/10/100405birthBan.htm\n \n In the state of Indiana they are proposing legislation that would make it illegal for single people to have children though the use of medical technology. The bill would states that you have to married to a person of the opposite sex and beinvolved in a faith based organization.\n \n To the conservates here; Do you think that this is a good idea? Would you really support this type of government intervention into peoples lives? I can tell you that it is this type of XXXX that is giving religious people and conservates in general a bad image.", 
   {
    "post_info": {
     "post_title": "Indiana government gone too far"
    }
   }, 
   null, 
   null, 
   1128511920.0
  ], 
  [
   168239, 
   null, 
   "gamehuis", 
   "Heh, licenses to have kids, reminds me of the movie Fortress...\n \n It's a sick, sick world we live in.", 
   {}, 
   168238, 
   null, 
   1128512160.0
  ], 
  [
   168241, 
   null, 
   "Iuris", 
   "Had a similar situation round here a while ago. Got so far as a referendum, and an overwhelming majority denied acces to medical assistance to single females.\n \n Could someone explain the bit about \"Women would also have to provide proof that they have participated in faith-based or church activities.\" ?", 
   {}, 
   168239, 
   null, 
   1128512640.0
  ], 
  [
   168247, 
   null, 
   "georged", 
   "US Christianity desperately clinging to the past as the education of a global society erodes their majority. A major contribution to US decline as the rest of the world enters a new century. That's as retrogressive as a 27% tariff against China's products to protect our inefficient industry and fiscal mismanagement.", 
   {}, 
   168241, 
   null, 
   1128522840.0
  ], 
  [
   168550, 
   null, 
   "Matthew S", 
   "Update: The bill has been dropped, not because the state senator thought is was a bad idea, but because it was too controversial\n \n http://www.365gay.com/newscon05/10/100605indiana.htm", 
   {}, 
   168247, 
   null, 
   1128602760.0
  ], 
  [
   179384, 
   null, 
   "coolcodemn3", 
   "I thinks it would have been a good idea if you are looking from a moral perspective or religion. I think it should get passed, but i know it will not becuase we live in America, and im fine with it not getting passed but i would like for it to get passed.", 
   {}, 
   168550, 
   null, 
   1132021440.0
  ], 
  [
   179644, 
   null, 
   "Matthew S", 
   "I thinks it would have been a good idea if you are looking from a moral perspective or religion. I think it should get passed, but i know it will not becuase we live in America, and im fine with it not getting passed but i would like for it to get passed.\n\n \n \n So you trully believe that pastor so and so, that you don't know, down the street should have the right to tell you when to have children and have controll over your sperm/eggs?", 
   {}, 
   179384, 
   null, 
   1132148460.0
  ], 
  [
   179835, 
   null, 
   "coolcodemn3", 
   "the moral aspect of it is great(coming from a Christian), It will never happen becasue its extreme.", 
   {}, 
   179644, 
   null, 
   1132200540.0
  ], 
  [
   179853, 
   null, 
   "Matthew S", 
   "the moral aspect of it is great(coming from a Christian), It will never happen becasue its extreme.\n\n \n \n Here in lies the problem, people are to ready to impose their morals on others especially when it doesnot effect their lives.", 
   {}, 
   179835, 
   null, 
   1132204500.0
  ], 
  [
   179863, 
   null, 
   "coolcodemn3", 
   "Here in lies the problem, people are to ready to impose their morals on others especially when it doesnot effect their lives.\n\n Now you are putting words into my mouth, I said it would be a good idea morrally, but i know it will never happen and Im fine with that. But it wouldnt be a bad idea. dont you get it?!?!?!", 
   {}, 
   179853, 
   null, 
   1132213920.0
  ], 
  [
   179911, 
   null, 
   "Matthew S", 
   "Now you are putting words into my mouth, I said it would be a good idea morrally, but i know it will never happen and Im fine with that. But it wouldnt be a bad idea. dont you get it?!?!?!\n\n \n So someone else having control over when you reproduce is a good idea?\n Remember everyone has a different moral view. This type of moralistic legislation is immoral in my view and is not a good idea. By your own admission you want to impose your moral view of the world upon people who have a different and opposite moral view of the world. You say it would be a good idea for the state of Indiana to impose a reproduction ban upon single people even if those single people feel it is morally right to reproduce while being single. \n \n We have different moral views of the world and to have someone elses moral views legislated upon me is immoral. We are talking about real people with real lives not just moral opinions. Laws like these hurt  real people and effect  real lives", 
   {}, 
   179863, 
   null, 
   1132254000.0
  ], 
  [
   179986, 
   null, 
   "coolcodemn3", 
   "So someone else having control over when you reproduce is a good idea?\n Remember everyone has a different moral view. This type of moralistic legislation is immoral in my view and is not a good idea. By your own admission you want to impose your moral view of the world upon people who have a different and opposite moral view of the world. You say it would be a good idea for the state of Indiana to impose a reproduction ban upon single people even if those single people feel it is morally right to reproduce while being single. \n \n We have different moral views of the world and to have someone elses moral views legislated upon me is immoral. We are talking about real people with real lives not just moral opinions. Laws like these hurt  real people and effect  real lives\n\n finally you kinda get what im sqaying, Im my oipinion its a good idea becuase it goes with MY CHRISTIAN views, but i know it will never happen and im fine wiht that.", 
   {}, 
   179911, 
   null, 
   1132277520.0
  ], 
  [
   180052, 
   null, 
   "GreenMtnBoy", 
   "Would you be against a law that says only Jewish couples can have children?\n \n If yes, you should be against the proposed indiana law.", 
   {}, 
   179986, 
   null, 
   1132311060.0
  ], 
  [
   180060, 
   null, 
   "Matthew S", 
   "finally you kinda get what im sqaying, Im my oipinion its a good idea becuase it goes with MY CHRISTIAN views, but i know it will never happen and im fine wiht that.\n\n \n \n Point missed again. Please answer the question from a personal level and not a christian views prespective.\n \n Do you personally believe that someone else, the government, should have control over when and with whom you reproduce, is this a good idea?", 
   {}, 
   179986, 
   null, 
   1132327140.0
  ], 
  [
   180274, 
   null, 
   "coolcodemn3", 
   "No i do not think it is right for a person to tell another person who they can have sex with overall. But it can help in some situations (does that help?)", 
   {}, 
   180060, 
   null, 
   1132394220.0
  ], 
  [
   180276, 
   null, 
   "Matthew S", 
   "No i do not think it is right for a person to tell another person who they can have sex with overall. But it can help in some situations (does that help?)\n\n \n \n Well this is exactly what the Indiana state government was trying to do with this law. The law would make it illegal for single people to use artificial means to have children. This was aimed directly at lesbians who use artificial insemination to have children.", 
   {}, 
   180274, 
   null, 
   1132402980.0
  ], 
  [
   180491, 
   null, 
   "coolcodemn3", 
   "i think its sick and not moral but i dont get my way always, thats what makes the world go around", 
   {}, 
   180276, 
   null, 
   1132477260.0
  ], 
  [
   180888, 
   null, 
   "Phunting", 
   "Do we have an inherent right to reproduce then? Are there ever any circumstances when it would be justifiable for the government to deny the right to reproduce?", 
   {}, 
   180491, 
   null, 
   1132684680.0
  ], 
  [
   180934, 
   null, 
   "Matthew S", 
   "Do we have an inherent right to reproduce then? Are there ever any circumstances when it would be justifiable for the government to deny the right to reproduce?\n\n \n \n We do have an inherent right to our bodies and the right to reprodution. Government interference with reproduction is never justified.\n \n I can invision a time when two sperm will be brought together to create a child and carried by a male as an ectopic pregnacy.", 
   {}, 
   180888, 
   null, 
   1132694460.0
  ], 
  [
   181034, 
   null, 
   "Phunting", 
   "But reproduction doesn't just involve our own bodies, through creation it involves another.\n \n Hypothetically, what of someone who was currently under sentence for violent abuse of their children, should they have equal right to the same technology?", 
   {}, 
   180934, 
   null, 
   1132762860.0
  ], 
  [
   181171, 
   null, 
   "Matthew S", 
   "But reproduction doesn't just involve our own bodies, through creation it involves another.\n \n Hypothetically, what of someone who was currently under sentence for violent abuse of their children, should they have equal right to the same technology?\n\n \n \n Yes they should be allowed. You can not reduce the freedom of certain people without reducing freedom of all.", 
   {}, 
   181034, 
   null, 
   1132797060.0
  ], 
  [
   181219, 
   null, 
   "Phunting", 
   "We do reduce the freedoms already by putting such people in prison, and by taking abused children into care away from abusive parents. Surely this does not reduce the freedoms of all, why is reproduction any different?", 
   {}, 
   181171, 
   null, 
   1132834920.0
  ], 
  [
   181230, 
   null, 
   "Matthew S", 
   "We do reduce the freedoms already by putting such people in prison, and by taking abused children into care away from abusive parents. Surely this does not reduce the freedoms of all, why is reproduction any different?\n\n \n \n Insuch cases these people have commited crimes, you can not take away someones freedoms for something they might do in the future. This is why I am so against sex offender registries they reduce peoples freedoms and punshish them forever.\n \n There is never ANY justification for limiting someones freedom to reproduce. Conservates like to talk about a slipery slope well this is truely an example of a slipery slope. For today it is passing laws against single people having children tommorrow it may be only people of a certain income allowed to have children of of a certain race. Can you not see the dangers?", 
   {}, 
   181219, 
   null, 
   1132842000.0
  ], 
  [
   181242, 
   null, 
   "Phunting", 
   "Of course I do. I would never support anything such as the bill that you mentioned, it is quite simply oppressive.\n \n What I do take issue with is your statement that it is never acceptable to take away the right to reproduce. I think that in the case where the courts decide there is clear enough danger to a child then they do not have that right.", 
   {}, 
   181230, 
   null, 
   1132846920.0
  ], 
  [
   181876, 
   null, 
   "Tastyfish", 
   "There was a news story mentioned a couple of months back of the abortion forum which dealt with the case of a man who was ordered by court to have no more children, due to being unable to look after the previous ten or so and being in rehab.\n \n Also China is an example of reproductive rights being limited, though not taken away admitedly.", 
   {}, 
   181242, 
   null, 
   1133128980.0
  ], 
  [
   182126, 
   null, 
   "OccamsRazor", 
   "\n Also China is an example of reproductive rights being limited, though not taken away admitedly.\n\n \n There is some evidence that non-consensual sterilisation has taken place in China up until recently. Then again, until 35 years ago the same could be said of the USA.", 
   {}, 
   181876, 
   null, 
   1133225580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Indiana government gone too far", 
  "url": "http://www.4forums.com/political/government-debates/6556-indiana-government-gone-too-far.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 6556, 
  "discussion_files": [
   [
    "28007.html", 
    "http://www.4forums.com/political/government-debates/6556-indiana-government-gone-too-far-print.html"
   ], 
   [
    "28008.html", 
    "http://www.4forums.com/political/government-debates/6556-indiana-government-gone-too-far-2-print.html"
   ]
  ], 
  "identifier": 6556
 }
]