[
 [
  [
   168318, 
   null, 
   "Ooaman", 
   "Hey, it's currently October and I was wondering what were some of your favorite classic horror charicters. I'm refering to Dracula, The Wolf Man, Frankenstein's Creature, The Mummy, The Creature From The Black Lagoon, The Phantom Of The Opera (black and white silent or any verson made before color). I'm sure there are others. I'm not talking about Teen Horror (I Know What You Did Last Summer, Scream, ect.) I'm talking back in the early days of film where everything was in black and white and now looks mostly corny compiared to modern day special effects or even the original books. Also, where the monsters follow their rules. Vampires turn into bats, can only be out at night and taken down with a wooden steak. Werewolves only change during the full moon and taken down with a silver bullet. So I was just wondering what are everyones favorite classic horror stories.\n My favorite is the Wolf Man. I like the idea of turning into a Werewolf by the light of a full moon (only) and can only be taken down with a silver bullet. emoticon_cool", 
   {
    "post_info": {
     "post_title": "Classic Horror"
    }
   }, 
   null, 
   null, 
   1128539760.0
  ], 
  [
   169083, 
   null, 
   "Ooaman", 
   "Does no body have an opinion on this or is it just not close enough to Halloween yet? I'm trying to renew this back up so I can actually get some opinions.", 
   {}, 
   168318, 
   null, 
   1128742800.0
  ], 
  [
   169807, 
   null, 
   "Ooaman", 
   "Is it still too soon to say anything?", 
   {}, 
   169083, 
   null, 
   1129010820.0
  ], 
  [
   169812, 
   null, 
   "daewoo", 
   "Is it still too soon to say anything?\n\n \n I will toss something in here just to try to get things rolling. \n \n I thik those old horror movies all sucked. They were boring, not scary, and poorly directed. \n \n You want scary, rent the shining...the old one, not that new garbage.\n \n New horror movies have replaced good acting, directing, and story line, with gore. Gross is not the same as scary. Of course action movies have done the same. Look at the last mission impossible flick. No story line worth mentioning, terrible acting, and completely out of touch with anything even resembeling reality. Lots of special effect, though. The whole movie seemed more like a promo video for a special effects company than anything else. Newer horror movies seem the same.\n \n Still. the wolf man? Yawn", 
   {}, 
   169807, 
   null, 
   1129012560.0
  ], 
  [
   169903, 
   null, 
   "Master_Shake", 
   "Last year I bought a really cheap, big collection of old, old hooror movies and had a blast watching them. Scary or not, they are fun. In the end, that's what really matters.\n \n @daewoo- I totally agree with what you said about gore. It is lazy film-making, uninteresting, and certainly not scary, only disgusting.", 
   {}, 
   169812, 
   null, 
   1129065660.0
  ], 
  [
   170021, 
   null, 
   "OccamsRazor", 
   "\n My favorite is the Wolf Man. I like the idea of turning into a Werewolf by the light of a full moon (only) and can only be taken down with a silver bullet. emoticon_cool\n\n \n Dracula and Frankenstein's Monster are both great horror creations in their own repects, I have fond memeories of reading childrens versions of these and scaring myself silly!\n \n I also really like the Invisible Man (sci-fi/horror) and The Hound of the Baskervilles (bad dog!).", 
   {}, 
   168318, 
   null, 
   1129080480.0
  ], 
  [
   170611, 
   null, 
   "Ooaman", 
   "I also really like the Invisible Man (sci-fi/horror)\n\n Oh, yeah, I should have added that to my original post. Another example of Classic Horror where they try to redo in Hollywood but it just comes out as \"Kill everyone but the main good charicters and blugent the others to death,\" type story line. I'm thinking of that one with Kevin Bacon as the scientest who makes himself invisible (and a wack-job).\n By the way, did the slasher movies get their start with the Shower and Chocolate syrup scene from Psycho?\n If so, at least it was more original then than it is now.", 
   {}, 
   170021, 
   null, 
   1129264380.0
  ], 
  [
   171483, 
   null, 
   "Ooaman", 
   "It's getting closer to Halloween so I wanted to see if renewing this would get more people to post.", 
   {}, 
   170611, 
   null, 
   1129520580.0
  ], 
  [
   172881, 
   null, 
   "Ooaman", 
   "10 more days until Halloween, any more opinions?", 
   {}, 
   171483, 
   null, 
   1129932540.0
  ], 
  [
   175176, 
   null, 
   "Ooaman", 
   "3 Days left until Halloween Night. Anyone in a scarey mood yet to think of more classic horror movies or stories they have enjoied?", 
   {}, 
   172881, 
   null, 
   1130549640.0
  ], 
  [
   175204, 
   null, 
   "Tastyfish", 
   "Lovecraft count? None of this crappy, oddly vunerable monsters, just ancient and unstoppable evil whom to fight is to invite madness and inevitable defeat.", 
   {}, 
   175176, 
   null, 
   1130554740.0
  ], 
  [
   175685, 
   null, 
   "Ooaman", 
   "1 day left until Halloween night. Anyone in the mood for posting here?", 
   {}, 
   175204, 
   null, 
   1130715480.0
  ], 
  [
   175707, 
   null, 
   "Anastasia", 
   "Not a classic\n but I adore Pinhead\n emoticon_xlove", 
   {}, 
   175685, 
   null, 
   1130722860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Classic Horror", 
  "url": "http://www.4forums.com/political/fun-debates/6563-classic-horror.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 6563, 
  "discussion_files": [
   [
    "25325.html", 
    "http://www.4forums.com/political/fun-debates/6563-classic-horror-print.html"
   ]
  ], 
  "identifier": 6563
 }
]