[
 [
  [
   168662, 
   null, 
   "Truthsayer", 
   "An actual ad in the London Times. emoticon_rolleyes \n \n WANTED\n \n A tall well-built woman with good\n reputation, who can cook frogs\n legs, who appreciates a good fuc-\n schia garden, classic music and tal-\n king without getting too serious.\n \n But please only read lines 1,3 and 5.", 
   {
    "post_info": {
     "post_title": "I don't know if this is really true or not."
    }
   }, 
   null, 
   null, 
   1128621660.0
  ], 
  [
   168668, 
   null, 
   "Wez", 
   "True: Maybe. If the editor saw the f***ing then it wouldn't have been printed, or at least censored I expect.\n \n Meant seriously: No\n \n Private Eye, a satire magazine, contains dozens of real similar ads, just generally not as witty.\n \n -Wez", 
   {}, 
   168662, 
   null, 
   1128624060.0
  ], 
  [
   168890, 
   null, 
   "Matthew S", 
   "emoticon_xgood \n \n I guess this gives a new meaning to reading between the lines. :)", 
   {}, 
   168668, 
   null, 
   1128683760.0
  ], 
  [
   169028, 
   null, 
   "Master_Shake", 
   "I think it's just something someone wrote and it gets tossed around. I've seen it around for a while. I doubt it was published in a newspaper.", 
   {}, 
   168890, 
   null, 
   1128724020.0
  ], 
  [
   169081, 
   null, 
   "Ooaman", 
   "Are tabloids and newspapers the same in England? Because it reads something like what would be in a tabloid (only without the sleeping with an alien lover who cross-dresses with Bat-Boy who's on a date with Lindsey Lohan who was seen at a resteraunt talking with Tom Cruis and Katie Holmes who is by the way expecting the spawn of Satun sometime next June while bin Laden and Sadam Husain were seen in tutoos.) You know, with out all the other Tabloidal stuff that people such as myself don't read but poke fun at instead. Tabloids usually always have spoofs of real news papers so why wouldn't they have a spoof of the classified sections?\n Or was it all a part of \"British Comedy\"", 
   {}, 
   169028, 
   null, 
   1128742560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I don't know if this is really true or not.", 
  "url": "http://www.4forums.com/political/fun-debates/6570-i-dont-know-if-really-true-not.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 6570, 
  "discussion_files": [
   [
    "30007.html", 
    "http://www.4forums.com/political/fun-debates/6570-i-dont-know-if-really-true-not-print.html"
   ]
  ], 
  "identifier": 6570
 }
]