[
 [
  [
   168700, 
   null, 
   "jyoshu", 
   "I'm not sure who is the guilty party here is--the cleric or the school! It's pretty funny either way, though! LOL\n \n http://www.cnn.com/2005/SHOWBIZ/10/06/potter.gay.reut/index.html", 
   {
    "post_info": {
     "post_title": "Harry Potter, Gay?"
    }
   }, 
   null, 
   null, 
   1128633180.0
  ], 
  [
   168702, 
   null, 
   "Kronus", 
   "I'm not sure who is the guilty party here is--the cleric or the school! It's pretty funny either way, though! LOL\n \n http://www.cnn.com/2005/SHOWBIZ/10/06/potter.gay.reut/index.html\n\n \n Clearly the cleric. He wanted to belittle the Potter series by insulting the characters, and decided that calling the title character gay was the way to do it. A straight forward case of homophobia.", 
   {}, 
   168700, 
   null, 
   1128633420.0
  ], 
  [
   168706, 
   null, 
   "jyoshu", 
   "Clearly the cleric. He wanted to belittle the Potter series by insulting the characters, and decided that calling the title character gay was the way to do it. A straight forward case of homophobia.\n\n \n Well, on the flipside, why would the school find it \"offensive\" for such a thing to be said? Clearly they found the idea of the character being gay to be an offensive thing. Doesn't that denote homophobia on the part of the school people?", 
   {}, 
   168702, 
   null, 
   1128633960.0
  ], 
  [
   168717, 
   null, 
   "Steeeeve", 
   "Well, on the flipside, why would the school find it \"offensive\" for such a thing to be said? Clearly they found the idea of the character being gay to be an offensive thing. Doesn't that denote homophobia on the part of the school people?\n\n haha, I never would have thought of it that way. Good stuff.", 
   {}, 
   168706, 
   null, 
   1128635580.0
  ], 
  [
   168722, 
   null, 
   "Kronus", 
   "Well, on the flipside, why would the school find it \"offensive\" for such a thing to be said? Clearly they found the idea of the character being gay to be an offensive thing. Doesn't that denote homophobia on the part of the school people?\n\n \n It would if that's what happened. It isn't. They were offended by the cleric calling someone gay to be insulting. They didn't like his homophobia. To quote the article you link\n \n \"The remarks that were made were thought by the staff to be offensive and were well below the standards that we expect of responsible and thoughtful adults working in our school.\"", 
   {}, 
   168706, 
   null, 
   1128636480.0
  ], 
  [
   168736, 
   null, 
   "Eddie", 
   "I just think it was really, really funny. The whole situation is so bizarre. We have a Priest, we have a childrens book and we have small children, we have a school and we have a claim that Harry Potter is gay... I love it. :p", 
   {}, 
   168722, 
   null, 
   1128638040.0
  ], 
  [
   168803, 
   null, 
   "Matthew S", 
   "Actually I always thought of Harry as being non sexual.", 
   {}, 
   168736, 
   null, 
   1128647820.0
  ], 
  [
   168815, 
   null, 
   "jyoshu", 
   "To quote the article you link\n \n \"The remarks that were made were thought by the staff to be offensive and were well below the standards that we expect of responsible and thoughtful adults working in our school.\"\n\n \n It could go either way. Their \"responsible standards\" may have been that being gay was a taboo subject for kids to hear.\n \n I think though that your view is probably the right one--I was just throwing out another angle.", 
   {}, 
   168722, 
   null, 
   1128649440.0
  ], 
  [
   168852, 
   null, 
   "Black Phoenix", 
   "ha....i'm not to familiar with the whole scenario but I do find it humorous........I think he may have made the remark as an off hand joke....like that's gay as in stupid or immature not necessarily as harry being a homosexual..but I don't know the whole story so...", 
   {}, 
   168815, 
   null, 
   1128658140.0
  ], 
  [
   168857, 
   null, 
   "emoreno2292", 
   "I can't stand it when people say that something that's stupid or irritating as gay. Just gets my goat.\n I don't know what the priest was thinking; I thought it was laughable indeed. I mean, heck, wasn't harry necking with that chinese girl and then with some other chick? Sounds purty derned heterosexual to me.", 
   {}, 
   168852, 
   null, 
   1128662580.0
  ], 
  [
   168864, 
   null, 
   "Master_Shake", 
   "Apparently no one here actually bothered to read the intimadatingly long 300 word article we're discussing here.\n \n \"It was a joke; a joke from 'Little Britain' that the children would know\"\n \n It was a joke, albeit a stupid one, but a joke nonetheless.", 
   {}, 
   168857, 
   null, 
   1128666360.0
  ], 
  [
   169679, 
   null, 
   "Master_Shake", 
   "emoticon_confused Well, that got people to leave quick.", 
   {}, 
   168864, 
   null, 
   1128983040.0
  ], 
  [
   169705, 
   null, 
   "Kronus", 
   "emoticon_confused Well, that got people to leave quick.\n\n \n I don't think it was your comment, there just wasn't anything much left to say.\n \n As for what you said, yes we all read the article. The guy's \"joke\" comment was clearly his attempt to weasel his way out of an embarrassing situation after the fact. He obviously wasn't trying for humor, he was trying to be insulting. It backfired and he was going for damage control.", 
   {}, 
   169679, 
   null, 
   1128987120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Harry Potter, Gay?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6571-harry-potter-gay.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6571, 
  "discussion_files": [
   [
    "18628.html", 
    "http://www.4forums.com/political/gay-rights-debates/6571-harry-potter-gay-print.html"
   ]
  ], 
  "identifier": 6571
 }
]