[
 [
  [
   169002, 
   null, 
   "Wez", 
   "President George Bush has claimed he was told by God to invade Iraq and attack Osama bin Laden's stronghold of Afghanistan as part of a divine mission to bring peace to the Middle East, security for Israel, and a state for the Palestinians.\n \n The President made the assertion during his first meeting with Palestinian leaders in June 2003, according to a BBC series which will be broadcast this month.\n \n The revelation comes after Mr Bush launched an impassioned attack yesterday in Washington on Islamic militants, likening their ideology to that of Communism, and accusing them of seeking to \"enslave whole nations\" and set up a radical Islamic empire \"that spans from Spain to Indonesia\". In the programmeElusive Peace: Israel and the Arabs, which starts on Monday, the former Palestinian foreign minister Nabil Shaath says Mr Bush told him and Mahmoud Abbas, former prime minister and now Palestinian President: \"I'm driven with a mission from God. God would tell me, 'George, go and fight those terrorists in Afghanistan.' And I did, and then God would tell me, 'George go and end the tyranny in Iraq,' and I did.\"\n \n And \"now again\", Mr Bush is quoted as telling the two, \"I feel God's words coming to me: 'Go get the Palestinians their state and get the Israelis their security, and get peace in the Middle East.' And by God, I'm gonna do it.\"\n \n Mr Abbas remembers how the US President told him he had a \"moral and religious obligation\" to act. The White House has refused to comment on what it terms a private conversation. But the BBC account is anything but implausible, given how throughout his presidency Mr Bush, a born-again Christian, has never hidden the importance of his faith.\n \n From the outset he has couched the \"global war on terror\" in quasi-religious terms, as a struggle between good and evil. Al-Qa'ida terrorists are routinely described as evil-doers. For Mr Bush, the invasion of Iraq has always been part of the struggle against terrorism, and he appears to see himself as the executor of the divine will.\n \n He told Bob Woodward - whose 2004 book, Plan of Attack, is the definitive account of the administration's road to war in Iraq - that after giving the order to invade in March 2003, he walked in the White House garden, praying \"that our troops be safe, be protected by the Almighty\". As he went into this critical period, he told Mr Woodward, \"I was praying for strength to do the Lord's will.\n \n \"I'm surely not going to justify war based upon God. Understand that. Nevertheless, in my case, I pray that I will be as good a messenger of His will as possible. And then of course, I pray for forgiveness.\"\n \n Another telling sign of Mr Bush's religion was his answer to Mr Woodward's question on whether he had asked his father - the former president who refused to launch a full-scale invasion of Iraq after driving Saddam Hussein from Kuwait in 1991 - for advice on what to do.\n \n The current President replied that his earthly father was \"the wrong father to appeal to for advice ... there is a higher father that I appeal to\".\n \n The same sense of mission permeated his speech at the National Endowment of Democracy yesterday. Its main news was Mr Bush's claim that Western security services had thwarted 10 planned attacks by al-Qa'ida since 11 September 2001, three of them against mainland US.\n \n More striking though was his unrelenting portrayal of radical Islam as a global menace, which only the forces of freedom - led by the US - could repel. It was delivered at a moment when Mr Bush's domestic approval ratings are at their lowest ebb, in large part because of the war in Iraq, in which 1,950 US troops have died, with no end in sight.\n \n It came amid continuing violence on the ground, nine days before the critical referendum on the new constitution that offers perhaps the last chance of securing a unitary and democratic Iraq. \"The militants believe that controlling one country will rally the Muslim masses, enabling them to overthrow all moderate governments in the region\" and set up a radical empire stretching from Spain to Indonesia, he said.\n \n The insurgents' aim was to \"enslave whole nations and intimidate the world\". He portrayed Islamic radicals as a single global movement, from the Middle East to Chechnya and Bali and the jungles of the Philippines.\n \n He rejected claims that the US military presence in Iraq was fuelling terrorism: 11 September 2001 occurred long before American troops set foot in Iraq - and Russia's opposition to the invasion did not stop terrorists carrying out the Beslan atrocity in which 300 children died.\n \n Mr Bush also accused Syria and Iran of supporting radical groups. They \"have a long history of collaboration with terrorists and they deserve no patience\". The US, he warned, \"makes no distinction between those who commit acts of terror and those who support and harbour them because they're equally as guilty of murder\".\n \n \"Wars are not won without sacrifice and this war will require more sacrifice, more time and more resolve,\" Mr Bush declared. But progress was being made in Iraq, and, he proclaimed: \"We will keep our nerve and we will win that victory.\"\n\n \n http://news.independent.co.uk/world/americas/article317805.ece\n \n Personally, I hope the allegations aren't true. It would be worrying if they were.\n \n -Wez", 
   {
    "post_info": {
     "post_title": "God told me to do it!"
    }
   }, 
   null, 
   null, 
   1128719040.0
  ], 
  [
   169004, 
   null, 
   "georged", 
   "Considering the outright blunders, irresponsible actions and deception accomplished by current administration, would anyone actually be surprised if the allegations are true?", 
   {}, 
   169002, 
   null, 
   1128720000.0
  ], 
  [
   169426, 
   null, 
   "jsaid2009", 
   "We already have a thread for this: http://4forums.com/political/showthread.php?t=6531 Media cannot be trusted to tell the truth.\n \n This is merely one more example in the long list of Leftists media factual errors in promoting their irresponsible agenda rather than reporting their news. If they would have done the most basic of fact-checking, they would have discovered that these statements were never made. \n \n http://www.breitbart.com/news/2005/10/07/051007131357.nstalu7a.html\n \n Josef Said\n http://groups.yahoo.com/group/khilafism", 
   {}, 
   169002, 
   null, 
   1128905100.0
  ], 
  [
   169431, 
   null, 
   "Symbiote", 
   "Wow, Bush said it wasn't true, I guess it mustn't be. He is after all the world's foremost expert on what is true.\n \n I don't know if you all remember, but Bush has been reported to have said God speaks to him another time too, to some minority-brand Christian guy in America.\n \n He denied it after that too.\n \n Funny all these people keep making up the same lie about what Bush said to them.", 
   {}, 
   169426, 
   null, 
   1128907200.0
  ], 
  [
   169432, 
   null, 
   "jsaid2009", 
   "Funny all these people keep making up the same lie about what Bush said to them.\n\n \n Hmmmmmm, who to believe, who to believe? Two Holocaust deniers or the President of the United States?\n \n \n Josef Said\n http://groups.yahoo.com/group/khilafism", 
   {}, 
   169431, 
   null, 
   1128907860.0
  ], 
  [
   169438, 
   null, 
   "georged", 
   "Hmmmmmm, who to believe, who to believe? Two Holocaust deniers or the President of the United States?\n \n \n Josef Said\n http://groups.yahoo.com/group/khilafism\n\n \n The US public has proof of one acting on 'bad intelligence' resulting in a lot of deaths including Americans, a civil war and an economic quagmire. Hmmmmmmm, who to believe.", 
   {}, 
   169432, 
   null, 
   1128909660.0
  ], 
  [
   169441, 
   null, 
   "Steeeeve", 
   "I would mark all of this as \"it doesn't matter\". It doesn't matter because congress voted for it all too. If I had to guess though, it is probably somewhere in the middle of the two stories...as it is most of the time.", 
   {}, 
   169438, 
   null, 
   1128911100.0
  ], 
  [
   169692, 
   null, 
   "OccamsRazor", 
   "We already have a thread for this: http://4forums.com/political/showthread.php?t=6531 Media cannot be trusted to tell the truth.\n \n This is merely one more example in the long list of Leftists media factual errors in promoting their irresponsible agenda rather than reporting their news. If they would have done the most basic of fact-checking, they would have discovered that these statements were never made. \n \n http://www.breitbart.com/news/2005/10/07/051007131357.nstalu7a.html\n\n \n What, and you think a press release from the White House is impartial in this matter?", 
   {}, 
   169426, 
   null, 
   1128984960.0
  ], 
  [
   169735, 
   null, 
   "jsaid2009", 
   "The US public has proof of one acting on 'bad intelligence'\n\n \n And? Besides demonstrating signs of possible Bush Derangement Syndrome where everything bad is somehow, in someway Bush' fault, what is your point?\n \n \n Josef Said\n http://groups.yahoo.com/group/khilafism", 
   {}, 
   169438, 
   null, 
   1128991740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  God told me to do it!", 
  "url": "http://www.4forums.com/political/current-events-debates/6576-god-told-me-do.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6576, 
  "discussion_files": [
   [
    "9783.html", 
    "http://www.4forums.com/political/current-events-debates/6576-god-told-me-do-print.html"
   ]
  ], 
  "identifier": 6576
 }
]