[
 [
  [
   170297, 
   null, 
   "MrWriteLA", 
   "From Judy Shepard: \nOctober 12, 2005 \n \n October 12 th 2005, is the seventh anniversary of my son Matthew's murder. His murder prompted unprecedented media coverage and focused the nation's attention on anti-gay hate crimes like never before. These past few weeks I have been thinking about what has changed - and what has not changed. What has been done to make our communities safe from violence resulting from anti-gay hate? I quickly learned my son's violent death was a fairly common occurrence. This prompted our family to create the Matthew Shepard Foundation and do our part to create a more respectful and caring culture free from hate. I have spent the past seven years traveling across the nation, speaking to schools, churches, anyone who will listen, to try and stem the tide of hate that is eating away at the fabric of our culture.\n \n The number of hate crimes against gay, lesbian, bisexual and transgender people has not varied much during the last five years. They remain the third highest category after race and religion. However, it is apparent that there are certain changes in the 'environment' that do impact hate crime activity. In New York City, every July, anti-gay violence usually increases by about 8% as people respond to the outreach programs and the visibility of the Pride celebrations. After the Lawrence v. Texas decision and the premiere of additional gay identified television shows, anti-gay violence in New York City rose 52%.\n \n It's clear that in some ways, our nation has become a more accepting place. We have witnessed the progress of gay and lesbian rights with the recent Supreme Court decision, Lawrence v Texas. We have seen our neighbor to the North - Ontario, Canada - acknowledge same-sex marriages. They have recognized that same sex couples are as deserving of the same equal rights and responsibilities as heterosexual couples. We have seen gay adoptions increase. We have seen growing visibility, acceptance and understanding of lesbian, gay, bisexual and transgender people in our families, in the corporate world and in our culture.\n \n However, we must also remember that there has been scant progress in areas of legislation and securing equal rights for the gay community. We continue to fight for hate crime legislation that will include sexual orientation, gender, and disability, and for federal job protection based on sexual orientation. Yes, you can be fired for being gay, lesbian, bisexual or transgender in 36 states of this nation. It is as if we are living in two Americas - one that tunes in to \"XXXXX Eye for a Straight Guy\" but turns a blind eye to the injustices gay and lesbian people still face.\n \n It is evident that with progress comes the inevitable attack by those who are threatened by our work for justice and fairness. Visibility - whether in the media or being out of the closet if you are gay - can serve as an unfortunate catalyst. Those who are threatened by our community are threatened by these strides. In 2003, more than 30 cities and towns reported crimes against gays. The vast majority do not garner national headlines like my son's murder did. Sakia Gunn, a 15 year old lesbian was fatally stabbed in Newark, New Jersey on 5/11/03, F.C. Martinez, a Navajo, transgender 16-year old murdered in a bias motivated attack are two examples but the list goes on. We have so far to go, so much hate is out there. It must be acknowledged, addressed and erased before any of us are safe.\n \n As we approach the anniversary of Matthew's murder it is appropriate to redouble my efforts to invoke a grassroots solution to this problem. It is a solution that begins with parents, educators, clergy and our communities as a whole. We have the opportunity to help our children understand and accept diversity before their school years begin and before hate can provoke violent actions. If we do our jobs correctly, it should never cross the minds of our children to harm someone, physically or emotionally, because of their gender, race, national origin, religion, disability or gender identity and expression. \n \n Hate is a learned behavior. If a child is taught to hate and fear diversity, then the next place he or she expresses that hate is at school. Ten percent of all hate crimes occur at schools and colleges . Bullying in our nation's schools has resulted in countless acts of violence. The cycle continues until that child who is filled with hate becomes an adult citizen in your community and begins to teach others to hate.\n \n Please help your children understand diversity without fearing it. Be an example of acceptance and compassion. The consequences of hate hurt everyone. It hurts not only the victim - it hurts their family and friends. It destroys the families of the perpetrators. Lives are lost, lives are ruined and lives are changed forever. \n \n ~Judy Shepard\n http://www.matthewshepard.org/", 
   {
    "post_info": {
     "post_title": "Matt Shepard Died 7 Years Ago Today"
    }
   }, 
   null, 
   null, 
   1129154460.0
  ], 
  [
   170301, 
   null, 
   "joebrummer", 
   "Unfortunate for us all that the religious right are fighting this tooth and nail.....They see protecting gays and lesbians as a form of acceptance.....So they will never let a Federal Hate Crime bill go into law that includes GLBT people.", 
   {}, 
   170297, 
   null, 
   1129155540.0
  ], 
  [
   170313, 
   null, 
   "Bassman", 
   "does anyone recall what the disposition of the assailants was? I'm curious, because the exising murder statutes were sufficient to prosecute these individuals. \"Hate Crime\" laws are overkill, if you ask me.", 
   {}, 
   170301, 
   null, 
   1129158900.0
  ], 
  [
   170349, 
   null, 
   "joebrummer", 
   "does anyone recall what the disposition of the assailants was? I'm curious, because the exising murder statutes were sufficient to prosecute these individuals. \"Hate Crime\" laws are overkill, if you ask me.\n\n \n Hate crimes laws are similar to laws about killing a cop on duty....I am the victim of a hate crimes times 2....I understand the reason for these laws. Although I do not believe they will change hate crimes, I do believe they send a valuable message to children. That it si not ok to beat up on gays....or blacks....or people based on religion.\n \n I remind Bassman and anyone else.....these laws protect people based on perceieved sexual orientation. If they \"think\" you are gay, they could beat the *rap out of you. WOuldn't you want those people to have the toughest sentence possible?", 
   {}, 
   170313, 
   null, 
   1129171440.0
  ], 
  [
   170370, 
   null, 
   "Steeeeve", 
   "I'm against all hate crime...if you are a white male and you beat the XXXX outta anyone, lets say another white male, out of hate; then I am against it. I don't support any hate. Kinda like I don't just support stopping \"violence against women\" ...I support stopping all violence.\n \n I don't know if this helps but just my 2 cents.", 
   {}, 
   170349, 
   null, 
   1129175340.0
  ], 
  [
   170392, 
   null, 
   "Heads_On_Pikes", 
   "Hate crimes laws are similar to laws about killing a cop on duty....I am the victim of a hate crimes times 2....I understand the reason for these laws. Although I do not believe they will change hate crimes, I do believe they send a valuable message to children. That it si not ok to beat up on gays....or blacks....or people based on religion.\n \n I remind Bassman and anyone else.....these laws protect people based on perceieved sexual orientation. If they \"think\" you are gay, they could beat the *rap out of you. WOuldn't you want those people to have the toughest sentence possible?\n\n \n What a crock of shiite. \n \n Crimes against certain groups should rate higher than crimes against others?\n \n I don't friggin think so. Set the bar high for ALL criminal acts against ALL persons.", 
   {}, 
   170349, 
   null, 
   1129183320.0
  ], 
  [
   170417, 
   null, 
   "Bassman", 
   "Agreed, This is not about my stances on homosexual issues. This is a matter of law. Existing laws are sufficient enough to send a clear message that criminal action is wrong and will be dealt with, accordingly.", 
   {}, 
   170392, 
   null, 
   1129210140.0
  ], 
  [
   170420, 
   null, 
   "Eddie", 
   "Intent is a very big part of law... The intention to kill someone because of his or her lifestyle, race or religion is more dangerous than to kill for money, quarrel or jealousy. Hate-crime laws are in my oppinion an important part of national defence against forces that try to destroy society, democracy and all that is good in this world... An attack based on hate against minorites is not just an attack on an individual. But on society itself and the democratic foundation it rests upon. \n \n But then again, I assume that you dislike terrorism-legislation as well... Since that is just murder and wanton destruction.. right?... and you don`t support stopping terrorism, but stopping all criminal activity and conflicts.. right?... And you want to set the bar high for all criminals, not for terrorists in particular... right?...", 
   {}, 
   170417, 
   null, 
   1129211700.0
  ], 
  [
   170427, 
   null, 
   "Matthew S", 
   "I cried when I heard Matthews' story and cry to this day. I can even feel his pain being beaten, tied to a fence post, and left for dead for 18 hours. What really bothers me is that this would not have happened if he were straight. That is way hate crimes laws are so important. The people who see no need for hate crimes laws are usally not the targets of hate, injustice, and prejudice.", 
   {}, 
   170420, 
   null, 
   1129213440.0
  ], 
  [
   170433, 
   null, 
   "joebrummer", 
   "Agreed, This is not about my stances on homosexual issues. This is a matter of law. Existing laws are sufficient enough to send a clear message that criminal action is wrong and will be dealt with, accordingly.\n\n \n \n \n You must not understand hate crimes. Just beating someone up will get someone an assult charge. In most cases this means probation or a small amount of jail time. If it is deemed a hate crime (which is more damaging to the victim studies prove) the assailant would get a longer sentence with mandatory jail time.", 
   {}, 
   170417, 
   null, 
   1129214760.0
  ], 
  [
   170439, 
   null, 
   "joebrummer", 
   "Example from todays news:\n \n After the bar closed at 2 a.m., the two men were walking down Richmond Street toward the Bliss garage, where they had parked. As they approached Weybosset Street, Britt stopped to give money to a panhandler, and accidentally bumped into a young man standing outside a white limousine.\n \n \"I said 'Excuse me, dude. Excuse me,' just looking to disengage,\" Britt remembered.\n \n He was hit in the back of the head. Britt, who is 6 feet tall and weighs 235 pounds, thinks his assailant hit him with a bottle because, he said, \"This guy opened the back of my head with one punch.\"\n \n As Britt turned around, the white limousine's doors opened, and several other young men got out. He doesn't remember anything more.\n \n When two Providence police detectives, Bernard Gannon and Sgt. Vincent Mansolillo, arrived, they saw Britt on the ground. \"Several of the subjects were kicking [him] about the head and body,\" the police report said.\n \n Britt, of 182 Torrey Rd., South Kingstown, was taken to Rhode Island Hospital. He was released Saturday afternoon, but stayed four nights with his parents in Pawtucket because, he said, \"I didn't open my eyes until yesterday.\"\n \n Britt said a surgeon told him the broken orbital bone -- his right eye socket -- may require surgery, but broken bones in his nasal passage and next to his ear will heal on their own.\n \n Grybowski, of 112 Gano St., Providence, could not be reached last night, but the police report said he suffered \"contusions to his head.\" Jeff Neal, a spokesman for the governor's office, said Grybowski was not hospitalized and reported to work Tuesday as scheduled.\n \n The men charged were Shareef Coleman, 19, of 40 Queen Anne Drive, Weymouth; Jorge Paiz Sault, 23, and Austin Paiz Sault, 20, both of 100 Queen Anne Drive, Weymouth; and Andrew McEneaney, 20, of 644 Middle St., Weymouth.\n \n The police arrested McEneaney as he was still kicking the unconscious Britt, the report said. The other three arrested were among six men the police found in the limousine; the report said Grybowski identified them as Britt's attackers.\n \n Each of the four pleaded no contest to two counts of simple assault in District Court, Providence, Tuesday and was sentenced to a year's probation, court records show.\n \n ________________________________________\n \n Simple assault. Probation....\n \n This attack seems to be random, although I know for fact this corner has a gay bar there, but this seems like a random attack. The victim although beaten pretty badly was not attack because of personal reasons. There ins't anything personal about it. If this had been a hatecrime. the victim would have a sense of it being personal. The attack would no longer be random, he would have been targeted for \"race, creed, perceived sexual orientation, religion, etc...). Then the psychological damage to the victim is greater....\n \n Exert from a grant I wrote on hate crimes....\n \n \n \n Members of the LGBT community subject to prejudice and discrimination might feel particularly vulnerable to being a victim of violence because of their sexual minority status (Meyer, 1995). \n Many sexual minorities maintain a high degree of vigilance - expectations of prejudice, discrimination, and violence - consuming a considerable amount of emotional energy and a considerable psychological toll because individuals in such a position must constantly monitor their environment and their behavior (e.g., how one dresses, speaks, walks, and talks) to avoid being \"discovered\"(Meyer, 1995). Therefore, just the threat or perception of violence is significant. As Meyer (1995) pointed out, \"A seemingly minor event, such as a slur directed at a gay man, may evoke deep feelings of rejection and fears of violence disproportionate to the event that precipitated them.\" Often, the physical, emotional, or psychological injury resulting from being a victim of a physical offense is serious and can be life-long, since recovery from bias-based violence takes much longer than recovery from random violence (American Psychological Association, 1998). Survivors of hate crimes often view their sexuality as a source of danger, pain, and punishment, rather than the experience of love, intimacy, and community, and maintain a heightened sense of vulnerability (Herek, Gillis, & Cogan, 1999).", 
   {
    "unicode_changes_made": true
   }, 
   170433, 
   null, 
   1129215360.0
  ], 
  [
   170444, 
   null, 
   "jyoshu", 
   "The problem I have with hate crime laws is that judging a crime as a hate crime is always a very subjective thing. It's one of the few matters of law we have that doesn't rely on hard evidence, but rather what is perceived as prejudice in the attacker. And to judge any matter of law on something that's not sound physical evidence is a bad idea, IMO. I think the best tool we have to fight hate in this country is education. And it's done a very good job, though more needs to be done. \n \n Let me be one of the first to say here that Matthew Shepard's death was uncalled for and certainly WAS an act of hate. It shouldn't have happened, and it should never happen.\n \n But the one thing I have a problem with in the article by Judy Shepard linked above is that it does the same thing that many gay rights activists do: it makes no effort to properly differentiate between hate/violence against gays and matters like same sex marriage--which are a whole different matter altogether. Often the marriage issue is opposed on moral grounds, not hate. In fact, unfortunately, Mrs. Shepard and others seem to intentionally blur this line when they write things like this.\n \n I think it is safe to say that most people who oppose gay marriage would never violently attack a gay person. I can say that for myself. I'll oppose violence against gays any time and would not hesitate to intervene if I saw a gay person being attacked. But that doesn't mean I have to completely change all my OTHER views, and suddenly drop my moral beliefs about gay marriage. They are separate issues.", 
   {}, 
   170439, 
   null, 
   1129217880.0
  ], 
  [
   170448, 
   null, 
   "joebrummer", 
   "The problem I have with hate crime laws is that judging a crime as a hate crime is always a very subjective thing. It's one of the few matters of law we have that doesn't rely on hard evidence, but rather what is perceived as prejudice in the attacker. And to judge any matter of law on something that's not sound physical evidence is a bad idea, IMO. I think the best tool we have to fight hate in this country is education. And it's done a very good job, though more needs to be done. \n \n Let me be one of the first to say here that Matthew Shepard's death was uncalled for and certainly WAS an act of hate. It shouldn't have happened, and it should never happen.\n \n But the one thing I have a problem with in the article by Judy Shepard linked above is that it does the same thing that many gay rights activists do: it makes no effort to properly differentiate between hate/violence against gays and matters like same sex marriage--which are a whole different matter altogether. Often the marriage issue is opposed on moral grounds, not hate. In fact, unfortunately, Mrs. Shepard and others seem to intentionally blur this line when they write things like this.\n \n I think it is safe to say that most people who oppose gay marriage would never violently attack a gay person. I can say that for myself. I'll oppose violence against gays any time and would not hesitate to intervene if I saw a gay person being attacked. But that doesn't mean I have to completely change all my OTHER views, and suddenly drop my moral beliefs about gay marriage. They are separate issues.\n\n \n \n There are separate issues, so why are you bringing it up here? The article doesn't mention same sex marriage, so how can you make these comments about Judy bluring the lines when she didn't mention or promote same sex marriage. I think you are trying to confuse the issue.\n \n I would also add that there is a very set critera for what is or what is not a hhate crime.", 
   {}, 
   170444, 
   null, 
   1129218360.0
  ], 
  [
   170451, 
   null, 
   "Jo Bennett", 
   "I don't think you can use subjectivity as an argument against hate crime legislation, unless you think their should be no difference between manslaughter, pre-meditated murder and \"crime of passion\" type murder. Hate crime legislation is there to protect those who are victimised for something they cannot change, be it their skin colour, sexual orientation, whatever; and to say that while violence is not acceptable in any situation, there is a difference between a fight over someone's spilt pint and beating someone up because they're black or gay.", 
   {}, 
   170448, 
   null, 
   1129219260.0
  ], 
  [
   170454, 
   null, 
   "Symbiote", 
   "I don't see how beating up someone because of their skin colour or perceived sexual orientation is any worse than doing it for any other reason, such as their hair colour, their money, because they looked at you, because they insulted your race or sexual orientation, etc.\n \n You can argue this separate legal classification has utilitarian benefits because racially motivated crimes have broader societal repercussions than more randomised bashings, but this same logic would have us create seperate legal classifications for assaults on employed vs unemployed, wealthy vs poor, in the public eye vs in secret. In my experience subjecting justice to considerations of (apparent) utility has counterutilitarian consequences.", 
   {}, 
   170451, 
   null, 
   1129219980.0
  ], 
  [
   170455, 
   null, 
   "joebrummer", 
   "I don't see how beating up someone because of their skin colour or perceived sexual orientation is any worse than doing it for any other reason, such as their hair colour, their money, because they looked at you, because they insulted your race or sexual orientation, etc.\n\n \n Please read my above post to understand how hate crimes are different from non-biased crimes. There is a difference for the victim. More damage is done than with a random act.\n \n\n You can argue this separate legal classification has utilitarian benefits because racially motivated crimes have broader societal repercussions than more randomised bashings, but this same logic would have us create seperate legal classifications for assaults on employed vs unemployed, wealthy vs poor, in the public eye vs in secret. In my experience subjecting justice to considerations of (apparent) utility has counterutilitarian consequences.\n\n \n But we have done this for years, there is a larger sentence if you kill a police officer. There is a larger sentence if a certain weapon was used....justice has always been subject to considerations. Why would it be good in some cases but not others?", 
   {}, 
   170454, 
   null, 
   1129220340.0
  ], 
  [
   170465, 
   null, 
   "gamehuis", 
   "Aren't terrorist attacks basically hate crimes? If so, should terrorists be punished more severely than others? The US government seems to think so. So by that logic, punishment for hate crimes against gays etc. should also be more severe.", 
   {}, 
   170455, 
   null, 
   1129222020.0
  ], 
  [
   170466, 
   null, 
   "jyoshu", 
   "There are separate issues, so why are you bringing it up here? The article doesn't mention same sex marriage\n\n \n You're right that they're seperate issues, but the article DOES mention it, which is why I brought it up.\n \"We have seen our neighbor to the North - Ontario, Canada - acknowledge same-sex marriages. They have recognized that same sex couples are as deserving of the same equal rights and responsibilities as heterosexual couples. We have seen gay adoptions increase. We have seen growing visibility, acceptance and understanding of lesbian, gay, bisexual and transgender people in our families, in the corporate world and in our culture.\n \n However, we must also remember that there has been scant progress in areas of legislation and securing equal rights for the gay community. We continue to fight for hate crime legislation that will include sexual orientation, gender, and disability, and for federal job protection based on sexual orientation. Yes, you can be fired for being gay\"\n \n So it's not like Judy Shepard is talking about just violence against gays here--she's blurring the line between it and the gay rights issues, which as you just said yourself were seperate from the violence issue.", 
   {}, 
   170448, 
   null, 
   1129222200.0
  ], 
  [
   170467, 
   null, 
   "MrWriteLA", 
   "http://psychology.ucdavis.edu/rainbow/html/shepard.html \n \n Excerpt: \nIn the nearly two decades between the deaths of Steve Kennedy and Matthew Shepard, dozens of people have been murdered in the United States because of their sexual orientation. Thousands of gay men and lesbians have been assaulted. \n \n In a research study I conducted with 2,000 Sacramento gay men and lesbians, more than one in five said they had been criminally victimized since age 16 because of their sexual orientation. \n \n Furthermore, hate crimes have more serious psychological consequences for the victims. In my study, victims of an anti-gay assault in the previous five years showed significantly higher levels of depression and stress compared to the lesbian and gay victims of \"random\" assaults in that same period.\n", 
   {
    "post_info": {
     "post_title": "The &quot;Us&quot; and &quot;Them&quot; of Murder"
    }
   }, 
   170297, 
   null, 
   1129222560.0
  ], 
  [
   170468, 
   null, 
   "joebrummer", 
   "You're right that they're seperate issues, but the article DOES mention it, which is why I brought it up.\n \"We have seen our neighbor to the North - Ontario, Canada - acknowledge same-sex marriages. They have recognized that same sex couples are as deserving of the same equal rights and responsibilities as heterosexual couples. We have seen gay adoptions increase. We have seen growing visibility, acceptance and understanding of lesbian, gay, bisexual and transgender people in our families, in the corporate world and in our culture.\n \n However, we must also remember that there has been scant progress in areas of legislation and securing equal rights for the gay community. We continue to fight for hate crime legislation that will include sexual orientation, gender, and disability, and for federal job protection based on sexual orientation. Yes, you can be fired for being gay\"\n \n So it's not like Judy Shepard is talking about just violence against gays here--she's blurring the line between it and the gay rights issues, which as you just said yourself were seperate from the violence issue.\n\n \n I think you are making quite a strech for this point you aren't making. She is talking about how acceptance has grown but hate crimes still happen. That is it....what are you reading into here. Nothing is blurred. It is very clear what she is saying and also very simple.\n \n But since you are going to try and make this argument. I will state that hate crimes against gays and lesbians have gone up in areas where they were trying to pass ammendments. One of the major tactics used by the religious right in those states was to make gay marriage look sick and harmful to the general popualtion. It was another method of demonizing gays.\n \n The only arguments that work to promote ammendments banning gay marriage are the ones that make gay marriage and gay people evil and immoral. Ya know the same things the nazi's said about the jews. What did you think would be the effect of that for gay people. A major rise in anti-gay violence.", 
   {}, 
   170466, 
   null, 
   1129222740.0
  ], 
  [
   170470, 
   null, 
   "jyoshu", 
   "I think you are making quite a strech for this point you aren't making. She is talking about how acceptance has grown but hate crimes still happen. That is it....what are you reading into here. Nothing is blurred. It is very clear what she is saying and also very simple.\n\n \n The bottom line is that a person can oppose gay marriage and at the same time be very much against violence and attacks against gay people. In fact I would say that probably most people who oppose gay marriage fall into this catagory. That's why it's important to make the distinction.", 
   {}, 
   170468, 
   null, 
   1129223280.0
  ], 
  [
   170471, 
   null, 
   "Symbiote", 
   "\n But we have done this for years, there is a larger sentence if you kill a police officer. There is a larger sentence if a certain weapon was used....justice has always been subject to considerations. Why would it be good in some cases but not others?\n\n \n I don't believe it is just in any case, police officers getting special treatment before the law is a blatant case of injustice for the sake of perceived social utility, or more likely that used as a cover for protecting their own.\n \n \nPlease read my above post to understand how hate crimes are different from non-biased crimes. There is a difference for the victim. More damage is done than with a random act.\n\n \n More damage is not always done than with a random act, and if you want to scale punishment to damage, scale it to damage, let's not have this selectivity where \"hate crimes\" are given special treatment even when there is not exceptional damage, and \"random\" crimes not given special treatment even when there is.", 
   {}, 
   170468, 
   null, 
   1129223340.0
  ], 
  [
   170472, 
   null, 
   "jyoshu", 
   "let's not have this selectivity where \"hate crimes\" are given special treatment even when there is not exceptional damage, and \"random\" crimes not given special treatment even when there is.\n\n \n Especially since hate crimes are deemed as such subjectively, rather than by physical evidence as pretty much all other matters of criminal law is decided.", 
   {}, 
   170471, 
   null, 
   1129223820.0
  ], 
  [
   170476, 
   null, 
   "Eddie", 
   "I don't believe it is just in any case, police officers getting special treatment before the law is a blatant case of injustice for the sake of perceived social utility, or more likely that used as a cover for protecting their own.\n\n \n I believe it is about threat level. Perhaps Australia has been blessed with the absence of organised extreme right-wing movements dedicated to eradicate specific groups of people in the past decades so you don`t have the same problem . Other countries haven`t had the same luck (and no, I`m not talking about nazi-germany here, but rather Europe in the 90-ies... I don`t know wether US experienced a similiar situation though).", 
   {}, 
   170471, 
   null, 
   1129224840.0
  ], 
  [
   170482, 
   null, 
   "joebrummer", 
   "I don't believe it is just in any case, police officers getting special treatment before the law is a blatant case of injustice for the sake of perceived social utility, or more likely that used as a cover for protecting their own.\n \n\n this may be or may not be. I don't really have an opinion on it\n \n \n\n More damage is not always done than with a random act, and if you want to scale punishment to damage, scale it to damage, let's not have this selectivity where \"hate crimes\" are given special treatment even when there is not exceptional damage, and \"random\" crimes not given special treatment even when there is.\n\n \n \n Here you are just wrong. Studies show that victims of hate crimes experience more psychological damage. The community also experiences more damage. The stats are not with you on this.\n \n Go back and read my previous post. I have done a bit of homework on hate crimes for two reasons. 1) I am the victim of a pretty violent hate crime and 2) I wrote a grant awhile back to get self defense training for the victims of hate crimes against gays. So I needed to do some homework on how the victims of hate crimes are effected as compared to random acts. Those who are the victims of random acts fare far better than the victims of hate crimes. Hate crimes are no random, they become personalized to the victims identity. The psychological damage is by far more.\n \n \nEspecially since hate crimes are deemed as such subjectively, rather than by physical evidence as pretty much all other matters of criminal law is decided.\n\n This is not true. It is based on a set critera. Not all of which is subjective at all. Many crimes are based on victims account and witness testimony. Hate crimes are no exception. Different states have their own critera, but either it fits the set critera or it wasn't a hate crime. It isn't subjective at all. If your house was set on fire with gay slurs painted on it. That sounds like physical evidence to me.", 
   {}, 
   170471, 
   null, 
   1129227060.0
  ], 
  [
   170484, 
   null, 
   "daewoo", 
   "My only real problem with hate crime legislation is that it uses a very vaugue definition of what makes a \"hate crime\". The definiotion is vauge anough that it could be applied nearly anywhere.", 
   {}, 
   170482, 
   null, 
   1129228140.0
  ], 
  [
   170485, 
   null, 
   "joebrummer", 
   "My only real problem with hate crime legislation is that it uses a very vaugue definition of what makes a \"hate crime\". The definiotion is vauge anough that it could be applied nearly anywhere.\n\n \n \n It isn't vague either. The law is very specific about what is and what isn't a hatecrime.\n \n In my state it reads like this:\n (2) Hate crime - any crime motivated by bigotry and bias, including, but not limited to threatened, attempted, or completed acts that appear after investigation to have been motivated by racial, religious, ethnic, sexual orientation, gender or disability prejudice; \n \n If a crime is determined to be motivated by the above critera it is a hatecrime.", 
   {
    "unicode_changes_made": true
   }, 
   170484, 
   null, 
   1129228920.0
  ], 
  [
   170486, 
   null, 
   "joebrummer", 
   "What Is a Hate Crime?\n Hate crimes and hate incidents are major issues for all police because of their unique impact on victims as well as the community. This guidebook will explain the differences between hate crimes and hate incidents and how to respond to both.\n \n \n A hate crime is a criminal offense committed against persons, property or society that is motivated, in whole or in part, by an offender's bias against an individual's or a group's race, religion, ethnic/national origin, gender, age, disability or sexual orientation. (Definition developed at the 1998 IACP Summit on Hate Crime in America.)\n \n \n Legal definitions of hate crimes vary. The federal definition of hate crimes addresses civil rights violations under 18 U.S.C. Section 245.\n \n \n As of 1999, 41 states and the District of Columbia have hate crime statutes that provide enhanced penalties for crimes in which victims are selected because of a perpetrator's bias against a victim's perceived race, religion or ethnicity. Many states also classify as hate crimes those in which a victim is selected based on a perception of his/her sexual orientation.\n \n \n Hate crime definitions often encompass not only violence against individuals or groups but also crimes against property, such as arson or vandalism, particularly those directed against community centers or houses of worship. Check your state statutes for the definition of hate crime in your jurisdiction.\n \n Accurate and comprehensive police reporting is essential to understanding the prevalence and patterns of hate crimes both locally and nationally.\n \n The federal Hate Crimes Statistics Act of 1990 (Public Law 102-275 April 23, 1990) encourages states to report hate crime data to the Federal Bureau of Investigation (FBI). Twenty-three states and the District of Columbia require the collection of hate crime data. In 1997, 11,211 state and local law enforcement agencies voluntarily reported 9,861 hate crime offenses to the FBI.\n http://www.theiacp.org/documents/index.cfm?fuseaction=document&document_id=141", 
   {}, 
   170485, 
   null, 
   1129229280.0
  ], 
  [
   170495, 
   null, 
   "daewoo", 
   "It isn't vague either. The law is very specific about what is and what isn't a hatecrime.\n \n In my state it reads like this:\n (2) Hate crime - any crime motivated by bigotry and bias, including, but not limited to threatened, attempted, or completed acts  that appear after investigation to have been motivated by racial, religious, ethnic, sexual orientation, gender or disability prejudice; \n \n If a crime is determined to be motivated by the above critera it is a hatecrime.\n\n \n \n Maybe you could explain to me what would keep a petty thief from being charged with a hate crime under this statute? I went back and highlighted in this what tranforms it from a decent statute to an all encompassing tool of oppression that can be pulled out by porosecutors any time they wish.\n \n Everything is an \"act\", and it is essentially unlimited. In the quest to stamp out hate crimes, XXXXXX across the US have essentially given an open book to prosecutors. \n \n Don't think so? Consider this....when they passed asset forfeiture laws, they were aimed soley at drug dealing. Now they have used them for everything from seizing the cars of people who solicit protitutes to any amount of cash they find in searches over $10k, even if the individual who owns that cash is never charged with any crime.", 
   {
    "unicode_changes_made": true
   }, 
   170485, 
   null, 
   1129233300.0
  ], 
  [
   170496, 
   null, 
   "joebrummer", 
   "Maybe you could explain to me what would keep a petty thief from being charged with a hate crime under this statute? I went back and highlighted in this what tranforms it from a decent statute to an all encompassing tool of oppression that can be pulled out by porosecutors any time they wish.\n \n Everything is an \"act\", and it is essentially unlimited. In the quest to stamp out hate crimes, XXXXXX across the US have essentially given an open book to prosecutors. \n \n Don't think so? Consider this....when they passed asset forfeiture laws, they were aimed soley at drug dealing. Now they have used them for everything from seizing the cars of people who solicit protitutes to any amount of cash they find in searches over $10k, even if the individual who owns that cash is never charged with any crime.\n\n \n \n You cannot use a drug law as a comparison to a hatecrime law. \n \n It isn't unlimited. Please show us how prosecutors could misuse this law. I think you are trying to make an argument exist that doesn't. Hate Crimes are not separate crimes. It is an enhanced sentence for crimes such as assualt, vandalism, arson...etc. I don't see your point. \n \n Please give me an example of your point.\n \n \n A petty theft....is a petty theft.....how would that be considered a hate crime? It doesn't meet the critera.", 
   {}, 
   170495, 
   null, 
   1129233660.0
  ], 
  [
   170501, 
   null, 
   "daewoo", 
   "You cannot use a drug law as a comparison to a hatecrime law. \n \n It isn't unlimited. Please show us how prosecutors could misuse this law. I think you are trying to make an argument exist that doesn't. Hate Crimes are not separate crimes. It is an enhanced sentence for crimes such as assualt, vandalism, arson...etc. I don't see your point. \n \n Please give me an example of your point.\n \n \n A petty theft....is a petty theft.....how would that be considered a hate crime? It doesn't meet the critera.\n\n \n What criteria? Maybe you could lay out exactly what criteria this sets forth for consideration as a hate crime. While it lists some examples, it does nto limit the bill to that, in fact, as written, the law is completely unlimited. I, for one, amd not a big fan of completely unlimited laws.", 
   {}, 
   170496, 
   null, 
   1129235520.0
  ], 
  [
   170503, 
   null, 
   "joebrummer", 
   "What criteria? Maybe you could lay out exactly what criteria this sets forth for consideration as a hate crime. While it lists some examples, it does nto limit the bill to that, in fact, as written, the law is completely unlimited. I, for one, amd not a big fan of completely unlimited laws.\n\n \n \n Okay, go back and read the law.\n \n It must be determined that the crime had a motivation of hate toward a group listed in the critera. It is not unlimited. I can't even see where you are getting this. \n \n You would need to provide examples of how this law could be misused. I am not seeing it! The law is limited to it's critera. That I have already listed for you in a previous post.", 
   {}, 
   170501, 
   null, 
   1129235880.0
  ], 
  [
   170541, 
   null, 
   "daewoo", 
   "Okay, go back and read the law.\n \n It must be determined that the crime had a motivation of hate toward a group listed in the critera. It is not unlimited. I can't even see where you are getting this. \n \n You would need to provide examples of how this law could be misused. I am not seeing it! The law is limited to it's critera. That I have already listed for you in a previous post.\n\n \n Lets go over this again:\n \n \nIn my state it reads like this:\n (2) Hate crime - any crime motivated by bigotry and bias, including, but not limited to  threatened, attempted, or completed acts that appear after investigation to have been motivated by racial, religious, ethnic, sexual orientation, gender or disability prejudice; \n \n \n The scope of the law is wholly undefined. The only concrete limitation on the law is that the act must be based on bigotry or bias. Most people who steal things rationalize their acts away because they feel that they are stealing from those wo can afford it. That shows a pretty obvious bias against the affluent. \n \n Rediculous? Absolutly. It was rediculous at the time our asset forfeiture laws were drafted to suggest that they would ever be used to take the cars of people who solicit prostitutes, or get too many speeding tickets. It was rediculous to imagine that it would be used to seize, and keep, money from people who are never proven guilty of any crime. BUT, that is what the law had morphed itself into, and it was FAR more specific than that piece of garbage that apparently passes for legislation in your state. Laws which are unlimted in their scope is dangerous, and frankly most hate crime laws eitehr cross that line, or they go the other way and become so obscure as to be useless.\n \n The problem is that they are trying ot legislate morality, and that is a difficult thing to do. They are trying to create a new level of crime based on motivation. If I decided to beat up the guy down the road, is it really any worse for me to beat up stan becuase he is a XXXXX than it is for me to beat up larry because he is black? In both cases, the act is the same, trying to differentiate the two based soley on motivation is not only a legislative nightmare, but it affrods larry more protection under th elaw than it does stan.\n \n Of course, in your state, since my actions obviously hsow a bias against XXXXXX, I could be charged with a hate crime either way. Then again, in your state, since tax evasion obviously shows a bias aganst the state, that could be a hate crime as well.", 
   {
    "unicode_changes_made": true
   }, 
   170503, 
   null, 
   1129249980.0
  ], 
  [
   170542, 
   null, 
   "joebrummer", 
   "I think this notion is so far fetched. Stealing is not an act realted to hate crimes. It is unlikely the scenario would ever happen. You would need to prove that petty theft could be turned into a hate crime against a protected group. The affluent are not a protected group. \n \n Your scenario is too much science fiction. SO much so I do not think you really understand the law or how it is used. You cannot randomly apply charges to criminals. There needs to be evidence. Then the defense lawyer is going to scutinze this. then a jury has to agree to it and find the person guilty. There is a whole system here. \n \n Your little piece of fiction is too far fetched to buy into.", 
   {}, 
   170541, 
   null, 
   1129250400.0
  ], 
  [
   170544, 
   null, 
   "joebrummer", 
   "crimes have always been ounished by motive. That is the differences between manslaughter and murder 1. motive! You do not seem to understand the laws you are debating.....\n \n Of course laws penalize by motive. If you get into law that say \"with intent\" that is based on motive....isn't that about morialty as well\n \n I always have ahard time understanding how people could be against hate crimes laws. When you realize most hate crime offenders walk with just probation like it was simple assault, when the damage they have done is more than simple assualt. Would you want stiffer sentences for people who commit these type of crimes. White Supremist groups, anti semetic groups, who just get away with probation after brutally beating up people....and that is ok with you that they walk? With hate crime laws, they get put where they belong...in jail...for a long time....", 
   {}, 
   170542, 
   null, 
   1129250760.0
  ], 
  [
   170546, 
   null, 
   "daewoo", 
   "I think this notion is so far fetched. Stealing is not an act realted to hate crimes. It is unlikely the scenario would ever happen. You would need to prove that petty theft could be turned into a hate crime against a protected group. The affluent are not a protected group. \n\n \n Who says the affluent are not a protected group? The groups in the law above are nto the only protectected groups, the law specifically states this.\n \n \nYour scenario is too much science fiction. SO much so I do not think you really understand the law or how it is used. You cannot randomly apply charges to criminals. There needs to be evidence. Then the defense lawyer is going to scutinze this. then a jury has to agree to it and find the person guilty. There is a whole system here. \n \n Your little piece of fiction is too far fetched to buy int\n\n \n Which is EXACTLY what people said abotu the concerns surrounding the asset forfeiture laws. The problem is that precedent has to be set ONE TIME. They were wrong abotu asset forfeiture laws, and you ar wrong here. I would challenge you to show me one, single law in the US that has not been stretched to its fullest extent within 20 years of signing. It just doesn't happen.", 
   {}, 
   170542, 
   null, 
   1129251240.0
  ], 
  [
   170552, 
   null, 
   "joebrummer", 
   "Who says the affluent are not a protected group? The groups in the law above are nto the only protectected groups, the law specifically states this.\n\n \n The affluent are not protected by hate crime laws. In most states gays and lesbians are not protected by these laws either. If the group isn't listed on the legilsation, they are not protected by that law....plain and simple.\n \n \n \n\n Which is EXACTLY what people said abotu the concerns surrounding the asset forfeiture laws. The problem is that precedent has to be set ONE TIME. They were wrong abotu asset forfeiture laws, and you ar wrong here. I would challenge you to show me one, single law in the US that has not been stretched to its fullest extent within 20 years of signing. It just doesn't happen.\n\n \n I do not think these laws are in the same relm, let alone can you compare them. It tends to be that criminals are brought up on as many charges as the prosecution can come up with. Generally the hope is that they will be found guilty of one of them. Forfeiture laws are very different from hate crime laws. I just don't think the two have anything in common.\n \n You also didn't answer my comments about motice and that most laws consider motive in criminal law.", 
   {}, 
   170546, 
   null, 
   1129252500.0
  ], 
  [
   170561, 
   null, 
   "Bassman", 
   "Correct me if I'm wrong. But what \"hate crime\" laws are supposed to do is provide aggrivating circumstances to a particular crime. Be it homicide, assault, arson, and yes, even robbery. My concern, here is the so-called \"hate speech\" laws that will force evangelical pastors to shut up or else. We see it right now in Canada.", 
   {}, 
   170552, 
   null, 
   1129255440.0
  ], 
  [
   170564, 
   null, 
   "Symbiote", 
   "Here you are just wrong. Studies show that victims of hate crimes experience more psychological damage. The community also experiences more damage. The stats are not with you on this.\n\n \n Show me the stats that prove every single victim of \"hate crime\" suffers more psychological damage than the victim of every ssingle \"random\" crime.\n \n Because that's what I was pointing out to you, that they don't, even if they do on average.\n \n So explain to me why it is just that a random attacker who causes a great deal of psychological damage is punished less than a \"hate criminal\" who happens to cause relatively little.", 
   {}, 
   170561, 
   null, 
   1129258500.0
  ], 
  [
   170565, 
   null, 
   "joebrummer", 
   "Correct me if I'm wrong. But what \"hate crime\" laws are supposed to do is provide aggrivating circumstances to a particular crime. Be it homicide, assault, arson, and yes, even robbery. My concern, here is the so-called \"hate speech\" laws that will force evangelical pastors to shut up or else. We see it right now in Canada.\n\n Well bassman, I think we need those laws....have you seen the lies some churches spread about gays? If churches would just preach the bible, then it would be ok, but that isn't what many christian groups are doing. They use outdated, unaccepted research to demonize and make gays look less then human. Yes, I would like to see the government stop that.\n \n I recently went to a local sandwich shop where they have newpapers and stuff. They always have this evengelical paper called \"the good news\". It is filled with lies about gays, saying we are out for your children and that we are all diseased...etc...I asked the people who owned it why on earth they would put such a paper in their store? When they really looked at it, they threw them all out!!!! \n \n That is what I want the USA to do with the lies these groups spread....throw them out!", 
   {}, 
   170561, 
   null, 
   1129258680.0
  ], 
  [
   170566, 
   null, 
   "joebrummer", 
   "Show me the stats that prove every single victim of \"hate crime\" suffers more psychological damage than the victim of every ssingle \"random\" crime.\n \n Because that's what I was pointing out to you, that they don't, even if they do on average.\n\n \n and what would be your point in this?", 
   {}, 
   170564, 
   null, 
   1129258740.0
  ], 
  [
   170567, 
   null, 
   "Symbiote", 
   "As I already explained, you could scale punishment to psychological damage in general, but it appears you would rather have generalised punishments that sometimes heavily punish those who don't cause much damage, and sometimes don't punish much those who do cause a lot of damage.\n \n You responded that you had statistical proof that victims of hate crimes always suffered more psychological damage, and I would like to see this proof.", 
   {}, 
   170566, 
   null, 
   1129259160.0
  ], 
  [
   170568, 
   null, 
   "joebrummer", 
   "As I already explained, you could scale punishment to psychological damage in general, but it appears you would rather have generalised punishments that sometimes heavily punish those who don't cause much damage, and sometimes don't punish much those who do cause a lot of damage.\n \n You responded that you had statistical proof that victims of hate crimes always suffered more psychological damage, and I would like to see this proof.\n\n \n \n I said that the victims of hate crimes suffer more pyschological damage then those who are victims of random crimes......\n \n I didn't say always.....I didn't say everyone.....You are trying to put words in my mouth...\n \n The proof has been posted a numer of times in the thread by both me and Mr. LA, go back and read it!", 
   {}, 
   170567, 
   null, 
   1129259400.0
  ], 
  [
   170569, 
   null, 
   "Symbiote", 
   "I wrote \"More damage is not always done than with a random act\"\n \n you replied:\n \n \nHere you are just wrong. Studies show that victims of hate crimes experience more psychological damage. The community also experiences more damage. The stats are not with you on this.\n\n \n So what was I wrong about, if you now agree victims of hate crimes do not always suffer more?", 
   {}, 
   170568, 
   null, 
   1129259700.0
  ], 
  [
   170570, 
   null, 
   "Bassman", 
   "Well bassman, I think we need those laws....have you seen the lies some churches spread about gays? If churches would just preach the bible, then it would be ok, but that isn't what many christian groups are doing. They use outdated, unaccepted research to demonize and make gays look less then human. Yes, I would like to see the government stop that.\n \n I recently went to a local sandwich shop where they have newpapers and stuff. They always have this evengelical paper called \"the good news\". It is filled with lies about gays, saying we are out for your children and that we are all diseased...etc...I asked the people who owned it why on earth they would put such a paper in their store? When they really looked at it, they threw them all out!!!! \n \n That is what I want the USA to do with the lies these groups spread....throw them out!\n\n Here's where you miss the point, Joe, the Bible does have something to say about homosexuality. It is sin, and does go against the will of God. Now, when you begin to enact \"hate speech\" laws, which are a farce, then , in effect, you get what you've always wanted. Pastors who cannot preach the truth of Scripture.", 
   {}, 
   170565, 
   null, 
   1129259940.0
  ], 
  [
   170571, 
   null, 
   "joebrummer", 
   "I wrote \"More damage is not always done than with a random act\"\n \n you replied:\n \n \n \n So what was I wrong about, if you now agree victims of hate crimes do not always suffer more?\n\n \n \n \n you are talking too literal....the stats do say that victims of hate crimes suffer more psychological damage than those victims of random acts...of course there are exceptions.....but on average the science says victims of hate crimes suffer more damage....", 
   {}, 
   170569, 
   null, 
   1129260480.0
  ], 
  [
   170572, 
   null, 
   "joebrummer", 
   "Here's where you miss the point, Joe, the Bible does have something to say about homosexuality. It is sin, and does go against the will of God. Now, when you begin to enact \"hate speech\" laws, which are a farce, then , in effect, you get what you've always wanted. Pastors who cannot preach the truth of Scripture.\n\n \n \n I didn't miss anything.....typically preachers do not just preach the bible, they use stats from unaccepted research to trash gays and lesbians and make them out to be second class citizens....are you trying to deny that is true?", 
   {}, 
   170570, 
   null, 
   1129260600.0
  ], 
  [
   170574, 
   null, 
   "Bassman", 
   "I didn't miss anything.....typically preachers do not just preach the bible, they use stats from unaccepted research to trash gays and lesbians and make them out to be second class citizens....are you trying to deny that is true?\n\n Your claims are unsubstantiated. What \"stats\" are you referring to?", 
   {}, 
   170572, 
   null, 
   1129260900.0
  ], 
  [
   170576, 
   null, 
   "joebrummer", 
   "What is the emotional damage?\n Intense feelings of vulnerability, anger, and depression, physical ailments and learning problems, and difficult interpersonal relations-all symptoms of posttraumatic stress disorder-can be brought on by a hate crime.\n \n Dr. Herek and his colleagues found that some hate crime victims have needed as much as 5 years to overcome their ordeal. By contrast, victims of nonbias crimes experienced a decrease in crime-related psychological problems within 2 years of the crime. Like other victims of posttraumatic stress, hate crime victims may heal more quickly when appropriate support and resources are made available soon after the incident occurs. \n \n Lesbian and gay victims suffer more serious psychological effects from hate crimes than they do from other kinds of criminal injury. In their case, the association between vulnerability and sexual orientation is particularly harmful. This is because sexual identity is such an important part of one's self-concept.\n \n http://www.apa.org/pubinfo/hate/", 
   {}, 
   170496, 
   null, 
   1129260960.0
  ], 
  [
   170578, 
   null, 
   "joebrummer", 
   "Your claims are unsubstantiated. What \"stats\" are you referring to?\n\n \n \n Research from Paul Cameron....\n \n Religious groups such as focus on families, concerned women for america...etc....use bell and weinberg study that says gay men have hundreds of partners....even though that study has been proved false over and over.\n \n They use studies that say the average lifespan of a gay man is 30 years less than that of a straight man...that too is rubbish! The studies were flawed and unaccpeted in peer review, yet churches continue to use the studies to promote hate!\n \n please look at the following websites.....\n \n http://www.pbs.org/wgbh/pages/frontline/shows/assault/bible/\n \n http://www.lionking.org/~kovu/bible/section01.html\n \n http://www.whosoever.org/v3i2/storm.html\n \n http://rainbowallianceopenfaith.homestead.com/HowTheyOperate.html\n \n http://rainbowallianceopenfaith.homestead.com/AssaultOnMarriage.html", 
   {}, 
   170574, 
   null, 
   1129261080.0
  ], 
  [
   170579, 
   null, 
   "daewoo", 
   "The affluent are not protected by hate crime laws. In most states gays and lesbians are not protected by these laws either. If the group isn't listed on the legilsation, they are not protected by that law....plain and simple. \n\n \n Why not? Lets look at it again, for the 4th time:\n \n \nany crime motivated by bigotry and bias, including, but not limited to   threatened, attempted, or completed acts that appear after investigation to have been motivated by racial, religious, ethnic, sexual orientation, gender or disability prejudice; \n \n \n BUT NOT LIMITED TO\n \n There is NO LIMIT in this law. As long as a prosecutor can come up with ANY group that the person in question may belong to, and show that bias against that group may have been a motivator, the defendant can be charged under this statute. It is all there in black and white. Your claim above cannot possibly be true, becuase in your state at least, the law specifically states that it is NOT LIMITED TO the groups or acts named. \n \n \n \n \nI do not think these laws are in the same relm, let alone can you compare them. It tends to be that criminals are brought up on as many charges as the prosecution can come up with. Generally the hope is that they will be found guilty of one of them. Forfeiture laws are very different from hate crime laws. I just don't think the two have anything in common.\n\n \n Except that they are both so vauge that almost any meaning can be attached to them. The wording of the asset forfeiture laws are even similar. They allow for seizure in connection to, but not limited to, drug trafficking, money laundering, and racketerring. What in that list would imply that using the law to take the car of somebody soliciting a prostitute would be accceptable? Nothing, of course, but we are not limited to that list, just like the hate crime law that you are supporting here.\n \n \nYou also didn't answer my comments about motice and that most laws consider motive in criminal law.\n\n \n Give me some examples, please, because I am not seeing any, outside of murder. Laws fro theft do not take into account why you were stealing something, nor do laws for batterry, tax evasion, traffic laws. Outside fo murder, i anc not think of a single law that takes motive into account.", 
   {}, 
   170552, 
   null, 
   1129261500.0
  ], 
  [
   170580, 
   null, 
   "joebrummer", 
   "bassman\n please review this as well....\n \n http://www.splcenter.org/intel/intelreport/article.jsp?aid=522", 
   {}, 
   170578, 
   null, 
   1129261560.0
  ], 
  [
   170581, 
   null, 
   "Symbiote", 
   "So let me ask you this, do you believe hate crime that causes no psychological damage should be punished more harshly than random crime that causes much psychological damage?", 
   {}, 
   170578, 
   null, 
   1129261560.0
  ], 
  [
   170582, 
   null, 
   "joebrummer", 
   "Why not? Lets look at it again, for the 4th time:\n\n affluence is not written as protected by hate crimes laws...that is it! it just isn't, niether or gays and lesbians....what is your point...if it aint ther it aint there.\n \n \n\n \n BUT NOT LIMITED TO\n \n There is NO LIMIT in this law. As long as a prosecutor can come up with ANY group that the person in question may belong to, and show that bias against that group may have been a motivator, the defendant can be charged under this statute. It is all there in black and white. Your claim above cannot possibly be true, becuase in your state at least, the law specifically states that it is NOT LIMITED TO the groups or acts named. \n \n \n\n too far fetched!\n \n \n \n\n Except that they are both so vauge that almost any meaning can be attached to them. The wording of the asset forfeiture laws are even similar. They allow for seizure in connection to, but not limited to, drug trafficking, money laundering, and racketerring. What in that list would imply that using the law to take the car of somebody soliciting a prostitute would be accceptable? Nothing, of course, but we are not limited to that list, just like the hate crime law that you are supporting here.\n \n\n lots of laws are vagur, I see nothing about hate crimes laws as vague.....You may see it, but I do not....either it is or it isn't a hate crime....that is it!\n \n \n\n Give me some examples, please, because I am not seeing any, outside of murder. Laws fro theft do not take into account why you were stealing something, nor do laws for batterry, tax evasion, traffic laws. Outside fo murder, i anc not think of a single law that takes motive into account.\n\n you don't want ot see it so you won't!\n \n \n your arguments are bogus.....they have nothing to do with hate crimes....theft is not usually consider a hate crime...in fact I have never seen it considered.\n \n If you really want to debate this you need to come up with something better.", 
   {}, 
   170579, 
   null, 
   1129261800.0
  ], 
  [
   170584, 
   null, 
   "joebrummer", 
   "So let me ask you this, do you believe hate crime that causes no psychological damage should be punished more harshly than random crime that causes much psychological damage?\n\n \n \n There is no way to measure the damage on a case by case basis, the damage can only be measured in time. It could take years to measure, not possible.\n \n I believe if someone committs a crime where they have singled there victim our soley because of race, creed, sexual orientation, gender...etc...they should pay a higher price....", 
   {}, 
   170581, 
   null, 
   1129261920.0
  ], 
  [
   170585, 
   null, 
   "Bassman", 
   "Research from Paul Cameron....\n \n Religious groups such as focus on families, concerned women for america...etc....use bell and weinberg study that says gay men have hundreds of partners....even though that study has been proved false over and over.\n \n They use studies that say the average lifespan of a gay man is 30 years less than that of a straight man...that too is rubbish! The studies were flawed and unaccpeted in peer review, yet churches continue to use the studies to promote hate!\n \n please look at the following websites.....\n \n http://www.pbs.org/wgbh/pages/frontline/shows/assault/bible/\n \n http://www.lionking.org/~kovu/bible/section01.html\n \n http://www.whosoever.org/v3i2/storm.html\n \n http://rainbowallianceopenfaith.homestead.com/HowTheyOperate.html\n \n http://rainbowallianceopenfaith.homestead.com/AssaultOnMarriage.html\n\n Joe, all of those sites are one-sided homosexual websites. The Bell-Weinberg study, whicn spanned years, conclusively prove all of the assertions that have been made. And PBS? I wouldn't give them the time of day!", 
   {}, 
   170578, 
   null, 
   1129262100.0
  ], 
  [
   170586, 
   null, 
   "Symbiote", 
   "Suppose I found crimes committed at night caused more psychological damage on average, would you support there being guaranteed minimum sentencing for crimes committed at night?", 
   {}, 
   170584, 
   null, 
   1129262160.0
  ], 
  [
   170588, 
   null, 
   "joebrummer", 
   "Joe, all of those sites are one-sided homosexual websites. The Bell-Weinberg study, whicn spanned years, conclusively prove all of the assertions that have been made. And PBS? I wouldn,'t give them the time of day!\n\n \n \n Then live with your blinder on...I don't care...but do not expect that gays and lesbians are going to stop trying to shut up these relgious groups and their hate...you don't want to see it, so you won't", 
   {}, 
   170585, 
   null, 
   1129262160.0
  ], 
  [
   170589, 
   null, 
   "Bassman", 
   "Suppose I found crimes committed at night caused more psychological damage on average, would you support there being guaranteed minimum sentencing for crimes committed at night?\n\n Once again, it's the rabid homosexual lobby screaming for their \"special\" rights.", 
   {}, 
   170586, 
   null, 
   1129262280.0
  ], 
  [
   170590, 
   null, 
   "joebrummer", 
   "Suppose I found crimes committed at night caused more psychological damage on average, would you support there being guaranteed minimum sentencing for crimes committed at night?\n\n \n \n If you cold prove that (which I doubt) then sure why not..\n \n \n Why do you want to deny the science!", 
   {}, 
   170586, 
   null, 
   1129262280.0
  ], 
  [
   170591, 
   null, 
   "joebrummer", 
   "Once again, it's the rabid homosexual lobby screaming for their \"special\" rights.\n\n \n \n once again the hate filled relgious right spread their rubbish\n \n Making Myths\n Anti-gay religious crusaders claim homosexuals helped mastermind the Holocaust. They're not telling the truth\n \n http://www.splcenter.org/intel/intelreport/article.jsp?sid=328", 
   {}, 
   170589, 
   null, 
   1129262400.0
  ], 
  [
   170592, 
   null, 
   "Bassman", 
   "Then live with your blinder on...I don't care...but do not expect that gays and lesbians are going to stop trying to shut up these relgious groups and their hate...you don't want to see it, so you won't\n\n Not a chance! We have these groups to help us protect the proper family structure.", 
   {}, 
   170588, 
   null, 
   1129262400.0
  ], 
  [
   170594, 
   null, 
   "joebrummer", 
   "Not a chance! We have these groups to help us protect the proper family structure.\n\n \n \n great, then use real science, not fake science.....don't use claims made by ex-gay groups who have no real respect in the scienftific world.\n \n \n Have you really looked at the Website for NARTH? Focus on Families? They sopread nothing but hate...not the bible...hate! and they do it in the name of god!", 
   {}, 
   170592, 
   null, 
   1129262520.0
  ], 
  [
   170595, 
   null, 
   "joebrummer", 
   "Not a chance! We have these groups to help us protect the proper family structure.\n\n \n \n Not a chance? Isn't that what they said in Canada? England? Where these groups have been shut up!", 
   {}, 
   170592, 
   null, 
   1129262640.0
  ], 
  [
   170596, 
   null, 
   "Bassman", 
   "Why do you want to deny the science!\n\n Because science is not infallable. Because the \"science\" you claim is seriously flawed, politically motivated, and an attempt to justify immoral behavior!", 
   {}, 
   170590, 
   null, 
   1129262760.0
  ], 
  [
   170597, 
   null, 
   "joebrummer", 
   "Because science is not infallable. Because the \"science\" you claim is seriously flawed, politically motivated, and an attempt to justify immoral behavior!\n\n \n \n but when studies are found to be false, political, religious groups should stop using them as truth! And that is exactly what these groups do....\n \n Are you to have me believe there are no hate christians?? Cause I can prove that wrong real fast!", 
   {}, 
   170596, 
   null, 
   1129262880.0
  ], 
  [
   170598, 
   null, 
   "Bassman", 
   "Not a chance? Isn't that what they said in Canada? England? Where these groups have been shut up!\n\n Thus emasculating pastors from preaching the truth. That's also why your brand of \"tolerance\" is so hypocritical. You want everybody to accept your deviant lifestyle, and if we don't then it's rammed right down our throats against our will. Now, if someone dares to speak out against homosexuality, here comes the thought police!", 
   {}, 
   170595, 
   null, 
   1129262940.0
  ], 
  [
   170600, 
   null, 
   "Bassman", 
   "but when studies are found to be false, political, religious groups should stop using them as truth! And that is exactly what these groups do....\n \n Are you to have me believe there are no hate christians?? Cause I can prove that wrong real fast!\n\n But that's the point. The studies have not been discredited by anyone except the homosexual lobby. And, CWA, Focus on the Family, ACLJ, and other like-minded groups don't preach hate.", 
   {}, 
   170597, 
   null, 
   1129263120.0
  ], 
  [
   170613, 
   null, 
   "emoreno2292", 
   "No, they just preach outdated values, stereotypes, and misinformation. I looked at that focus on the family website; garbage. It's all about conforming, girls being little princesses, boys the star quarterback on the football team. What load of XXXX! And you support that? I mean, do you think that every boy should be prom king/star quarterback and the girls should all be prom queen/homemakers?", 
   {}, 
   170600, 
   null, 
   1129266180.0
  ], 
  [
   170618, 
   null, 
   "JakeCJB", 
   "Not a chance? Isn't that what they said in Canada? England? Where these groups have been shut up!\n\n \n These groups have never had any influence on the debate on gay rights in Canada. They've always been seen as loonie tunes. They are not seen as representing any religion, just as representing the nutty. I'm sure this is the situation in England as well.", 
   {}, 
   170595, 
   null, 
   1129268280.0
  ], 
  [
   170661, 
   null, 
   "joebrummer", 
   "But that's the point. The studies have not been discredited by anyone except the homosexual lobby. And, CWA, Focus on the Family, ACLJ, and other like-minded groups don't preach hate.\n\n Not true,\n Paul Cameron has been kicked out of every association including the APA. Critiques of his studies find his methodolgy to be seriously flawed. Bell and wienberg was discredited because of the sample he used was not random. It was seriously baised. \n \n These studies were discredited by medical and pychological associations. As for studies done by NARTH and other ex-gay proponets. No one takes them seriously either. No one major mental health or medcial association accepts them as science.\n \n You can chalk it up to whatever you want, but the facts remain the same. All of the groups you listed as \"not preaching hate\" are listed as hate groups by the country's leading hate wach group the Southern Poverty LAw Center.\n \n In other words Concern Women for America are in the same list as the KKK. Get it?\n \n By the way. I am not a diviant. I am a person with a life.!", 
   {}, 
   170600, 
   null, 
   1129300740.0
  ], 
  [
   170662, 
   null, 
   "joebrummer", 
   "Thus emasculating pastors from preaching the truth. That's also why your brand of \"tolerance\" is so hypocritical. You want everybody to accept your deviant lifestyle, and if we don't then it's rammed right down our throats against our will. Now, if someone dares to speak out against homosexuality, here comes the thought police!\n\n \n \n Lets re-write your post with a small change....and see how it sounds....\n \n \n Thus emasculating pastors from preaching the truth. That's also why your brand of \"tolerance\" is so hypocritical. You want everybody to accept your deviant lifestyle, and if we don't then it's rammed right down our throats against our will. Now, if someone dares to speak out against the jews, here comes the thought police!", 
   {}, 
   170598, 
   null, 
   1129300800.0
  ], 
  [
   170674, 
   null, 
   "jyoshu", 
   "Not true,\n Paul Cameron has been kicked out of every association including the APA. Critiques of his studies find his methodolgy to be seriously flawed. Bell and wienberg was discredited because of the sample he used was not random. It was seriously baised. \n\n \n OK, that's Paul Cameron. Where have the others been discredited other than the gay lobby and it's far-left cronies?\n \n \nYou can chalk it up to whatever you want, but the facts remain the same. All of the groups you listed as \"not preaching hate\" are listed as hate groups by the country's leading hate wach group the Southern Poverty LAw Center. In other words Concern Women for America are in the same list as the KKK. Get it?\n\n \n You seem to think the Southern Poverty Law center has enough credibility to be taken as a serious source for this. It doesn't. Who cares what they list--they aren't any final word on anything. If they list CWA with the KKK, then obviously they have real problems and political leanings.", 
   {}, 
   170661, 
   null, 
   1129304940.0
  ], 
  [
   170676, 
   null, 
   "jyoshu", 
   "No, they just preach outdated values, stereotypes, and misinformation. I looked at that focus on the family website; garbage. It's all about conforming, girls being little princesses, boys the star quarterback on the football team. What load of XXXX! And you support that? I mean, do you think that every boy should be prom king/star quarterback and the girls should all be prom queen/homemakers?\n\n \n Oh, horror! How dare those evil FoF people suggest boys might actually play football and girls play with dolls and enjoy cooking! Why, what is the world coming to???? I mean they HAVE to be wrong, as so few boys enjoy physical sports and all. And as we all know, most girls just love putting on football pads and ramming into each other on a muddy field. What the XXXX are those FoF people thinking???\n \n emoticon_rolleyes", 
   {}, 
   170613, 
   null, 
   1129305180.0
  ], 
  [
   170681, 
   null, 
   "emoreno2292", 
   "Notice I said ALL boys should be the quarterback, ALL girls should be the prom queen. Focus on the Family's stance makes it seem that conformity is the most desirable trait. It appears that they have little tolerance for anyone who doesn't fit in with said standards.", 
   {}, 
   170676, 
   null, 
   1129306620.0
  ], 
  [
   170685, 
   null, 
   "joebrummer", 
   "Oh, horror! How dare those evil FoF people suggest boys might actually play football and girls play with dolls and enjoy cooking! Why, what is the world coming to???? I mean they HAVE to be wrong, as so few boys enjoy physical sports and all. And as we all know, most girls just love putting on football pads and ramming into each other on a muddy field. What the XXXX are those FoF people thinking???\n \n emoticon_rolleyes\n\n \n \n I think they are suggesting that all little boys play football and all little girls wear dresses........Sort of like children of the corn!", 
   {}, 
   170676, 
   null, 
   1129307160.0
  ], 
  [
   170690, 
   null, 
   "jyoshu", 
   "Notice I said ALL boys should be the quarterback, ALL girls should be the prom queen. Focus on the Family's stance makes it seem that conformity is the most desirable trait. It appears that they have little tolerance for anyone who doesn't fit in with said standards.\n\n \n I seriously doubt FoF thinks ALL boys should be quarterbacks, or ALL girls should be prom queens. After all, there are only so many football teams, and each one only has one quarterback . . . :p", 
   {}, 
   170681, 
   null, 
   1129307880.0
  ], 
  [
   170700, 
   null, 
   "joebrummer", 
   "I seriously doubt FoF thinks ALL boys should be quarterbacks, or ALL girls should be prom queens. After all, there are only so many football teams, and each one only has one quarterback . . . :p\n\n \n \n Well actually yes, James dobsen promotes the idea that having a typical gender identity will \"prevent\" homosexuality....\n \n \n There are certain signs of prehomosexuality which are easy to recognize, and the signs come early in the child's life. Most come under the heading of \"cross-gender behavior.\" There are five markers to [diagnose] a child with \"gender-identity disorder.\" They are: \n \n \n Repeatedly stated desire to be, or insistence that he or she is, the other sex. \n \n In boys, preference for cross-dressing, or simulating female attire. In girls, insistence on wearing only stereotypical masculine clothing. \n \n Strong and persistent preference for cross-sexual roles in make-believe play, or persistent fantasies of being the other sex. \n \n Intense desire to participate in stereotypical games and pastimes of the other sex. \n \n Strong preference for playmates of the other sex.\n http://www.family.org/docstudy/newsletters/a0021043.cfm", 
   {}, 
   170690, 
   null, 
   1129308600.0
  ], 
  [
   170704, 
   null, 
   "jyoshu", 
   "Well actually yes, James dobsen promotes the idea that having a typical gender identity will \"prevent\" homosexuality....\n \n \n There are certain signs of prehomosexuality which are easy to recognize, and the signs come early in the child's life. Most come under the heading of \"cross-gender behavior.\" There are five markers to [diagnose] a child with \"gender-identity disorder.\"\n\n \n And none of that says that boys should all be football quarterbacks or that all girls should be prom queens.\n \n Frankly if I saw my children engaging in some of this behavior I'd be concerned too.", 
   {}, 
   170700, 
   null, 
   1129309320.0
  ], 
  [
   170732, 
   null, 
   "emoreno2292", 
   "Just so Jyoshu will stop making his stupid quibbles over words here, Focus on the Family encourages conformity in young children, encouraging males to do typically male things, such as playing sports, and shockingly enough (This comes from the site as well) going into the shower with his father so he can see his penis. (I know, what's THAT all about?) Boys are not supposed to cry a lot, be unathletic, play dress-up, in other words, do anything 'girly'. Girls should not be playing football. (nor do they want to, according to the eminent psychologist Jyoshu.) Girls are supposed to act within their gender roles.", 
   {}, 
   170704, 
   null, 
   1129312860.0
  ], 
  [
   170754, 
   null, 
   "jyoshu", 
   "Just so Jyoshu will stop making his stupid quibbles over words here, Focus on the Family encourages conformity in young children, encouraging males to do typically male things, such as playing sports, and shockingly enough (This comes from the site as well) going into the shower with his father so he can see his penis. (I know, what's THAT all about?) Boys are not supposed to cry a lot, be unathletic, play dress-up, in other words, do anything 'girly'. Girls should not be playing football. (nor do they want to, according to the eminent psychologist Jyoshu.) Girls are supposed to act within their gender roles.\n\n \n I agree with you about the shower thing. But I don't see what the problem is with them \"encouraging males to do typically male things, such as playing sports.\"", 
   {}, 
   170732, 
   null, 
   1129318800.0
  ], 
  [
   170755, 
   null, 
   "joebrummer", 
   "I agree with you about the shower thing. But I don't see what the problem is with them \"encouraging males to do typically male things, such as playing sports.\"\n\n \n \n a differnce between encourageing and forcing them to do it to stop them from being gay", 
   {}, 
   170754, 
   null, 
   1129319640.0
  ], 
  [
   170761, 
   null, 
   "Steeeeve", 
   "Are we talking about hate speech or hate crimes? I think I actually agree with Symbiote on the issue of hate crimes. You probably wouldn't hear many people getting all up in arms over someone killing a person on \"convicted sexual offender\" list for the only reason of they hate people that do that. It really can create a blurry line to say this is hate and this isn't. I just feel all crimes are some form of hate and should probably be punished the same.\n \n As for hate speech. I think Joe is wrong in that a majority of Christians believe that homosexuals are \"diseased\" more than any other sinner. Yeah, the Bible says it is a Sin and a preacher should be able to preach this. In fact, a preacher should be able to say anything. We allow the KKK to say lies about blacks. So two points here. One, homosexual activity is viewed as a sin in the Bible and this doesn't mean \"hate\". Thinking something is wrong and hating the person doing are TWO different things. If you can't see this then I really don't know how you can continue this converstation. The second point is that hate speech is fine. We have a right to lie about everything if we wish (outside of court). Why shouldn't one be allowed to speak their mind?", 
   {}, 
   170755, 
   null, 
   1129322220.0
  ], 
  [
   170763, 
   null, 
   "joebrummer", 
   "Are we talking about hate speech or hate crimes? I think I actually agree with Symbiote on the issue of hate crimes. You probably wouldn't hear many people getting all up in arms over someone killing a person on \"convicted sexual offender\" list for the only reason of they hate people that do that. It really can create a blurry line to say this is hate and this isn't. I just feel all crimes are some form of hate and should probably be punished the same.\n \n As for hate speech. I think Joe is wrong in that a majority of Christians believe that homosexuals are \"diseased\" more than any other sinner. Yeah, the Bible says it is a Sin and a preacher should be able to preach this. In fact, a preacher should be able to say anything. We allow the KKK to say lies about blacks. So two points here. One, homosexual activity is viewed as a sin in the Bible and this doesn't mean \"hate\". Thinking something is wrong and hating the person doing are TWO different things. If you can't see this then I really don't know how you can continue this converstation. The second point is that hate speech is fine. We have a right to lie about everything if we wish (outside of court). Why shouldn't one be allowed to speak their mind?\n\n \n \n You guys are so stuck on the bible stuff you miss what is really happening.....\n \n Jerry Falwell has millions of follwers who he has repeatedly told that the ills of the world should be blames on gays.\n \n James Dobsen (another christian) promotes some very unscientific stuff as science on his website and his radio show everyday, again telling his listeners that gays have a disorder and should be treated. That goes against every scientific organization out there that is worth their weight.\n \n Concerned Women for America continues to spread mythology about gays saying everything from gays are out to recruit (please!) to gays are all child molesters.\n \n These are the christians we are trying to shut up. If christians want to preach from the bible and say being gay is a sin. Go for it! But as long as they are going to pass lies about gays they are unfounded in accpeted mainstream science. They need to be silenced. Just like Canada, England has recognized that this groups do influece the violence against gays. Studies show it happen. The FBI sees it happens. The only reason you guys don't see it is because you are under this silly notion that christians wouldn't do that if they are real christians. WHo cares what kind of christian they are, shut them up! They are influenceing a culture of hate the is paid for with peoples lives. Even one life is too many!\n \n Take off your blinders, and see what is really happening in the world. Stop hiding behind your supposed religion. If you think it is a sin good for you then treat it like a sin like qall the others, but stop promoting gays as less then human by saying they don't live as long, they are all on drugs, they are all diseased, they are immoral, they are into witchcraft....my god the lies are endless and you refuse to see it......and jyoshu wants us to believe he is pro-gay....give me a **** break!", 
   {}, 
   170761, 
   null, 
   1129323060.0
  ], 
  [
   170764, 
   null, 
   "joebrummer", 
   "Food for thought:\n \n \n I don't think that some people who are committed to the ex-gay fraud realize how evil some dimensions of the whole movement against homosexuals really are. Dr. C. Everett Koop, MD, Surgeon General of the United States, was a strong advocate for AIDS education and effective treatment until his retirement. After he retired, Dr. Koop visited many churches and church conferences to appeal for understanding and help towards gay and lesbian people. After months of this experience, Dr. Koop was interviewed in \"Christianity Today\" and said that he did not go to church much any more. He said that we need a stronger word than \"homophobia\" to speak of the hate towards homosexuals that he had found in the churches. He concluded that he knew many preachers and church leaders who hated homosexuals so much that if they had a button that would kill all homosexuals, they would push the button.", 
   {}, 
   170763, 
   null, 
   1129323360.0
  ], 
  [
   170766, 
   null, 
   "Steeeeve", 
   "Take off your blinders, and see what is really happening in the world. Stop hiding behind your supposed religion. If you think it is a sin good for you then treat it like a sin like qall the others, but stop promoting gays as less then human by saying they don't live as long, they are all on drugs, they are all diseased, they are immoral, they are into witchcraft....my god the lies are endless and you refuse to see it......and jyoshu wants us to believe he is pro-gay....give me a **** break!\n Are you saying there should be a law prohibiting this kind of speech? If so, how would this not violate the 1st amendment? \n \n As for Jerry Falwell, You really misrepresent him. He blames people that live their lives in sin as the reason for the destruction of America. This is clearly a Bible idea. People who reject God and don't take Jesus to be their salvation are subject to God's wrath. The people that choose to live their life in vain then, according to Christian faith, could be blamed for God displacing his wrath (and love since its the same thing) on humanity. He doesn't just limit it to gays though. If you were gay and wanted to talk to Jerry Falwell, he would talk to you...not cut your head off.\n \n I don't know about the other guys...there are some that are telling some mistruths though. And yes, Jerry Falwell gets it wrong sometimes, and he will admit this.", 
   {}, 
   170763, 
   null, 
   1129323720.0
  ], 
  [
   170770, 
   null, 
   "joebrummer", 
   "Are you saying there should be a law prohibiting this kind of speech? If so, how would this not violate the 1st amendment? \n \n As for Jerry Falwell, You really misrepresent him. He blames people that live their lives in sin as the reason for the destruction of America. This is clearly a Bible idea. People who reject God and don't take Jesus to be their salvation are subject to God's wrath. The people that choose to live their life in vain then, according to Christian faith, could be blamed for God displacing his wrath (and love since its the same thing) on humanity. He doesn't just limit it to gays though. If you were gay and wanted to talk to Jerry Falwell, he would talk to you...not cut your head off.\n \n I don't know about the other guys...there are some that are telling some mistruths though. And yes, Jerry Falwell gets it wrong sometimes, and he will admit this.\n\n \n \n Well thank you for admiting this....\n \n But trust me I am not misrepresenign Falwell at all. I can give you countless websites that follow and document his follies.. The man is pure crazy.....and very, very anti-gay.", 
   {}, 
   170766, 
   null, 
   1129324140.0
  ], 
  [
   170771, 
   null, 
   "joebrummer", 
   "\n As for Jerry Falwell, You really misrepresent him. He blames people that live their lives in sin as the reason for the destruction of America. This is clearly a Bible idea. People who reject God and don't take Jesus to be their salvation are subject to God's wrath.\n\n \n Really?\n DO you want to read the mans' words. I have more....\n \n \n\n Rev. Jerry Falwell\n Founder of the Moral Majority\n \n \"Brute beasts ... part of a vile and satanic system [that] will be utterly annihilated, and there will be a celebration in heaven.\"\n - On homosexuals, as quoted in The Bible Tells Me So, 1996\n \n \n \"[O]ur poor boys on the front lines will have to face two different enemies, one from the front and one from the rear.\"\n - On President Clinton's proposal to lift the ban on gays in the military\n \n \"AIDS is not just God's punishment for homosexuals; it is God's punishment for the society that tolerates homosexuals\"\n - On AIDS\n \n\n \n \n Steve,\n Please do me a favor, go to this site and click the link on the middle to right of screen that say \"Launch Slideshow\" It will show you the Christian players and what they have done to homosexuals......it will show this goes way, way beyond saying this is a sin...\n \n http://www.splcenter.org/intel/intelreport/article.jsp?aid=522", 
   {
    "unicode_changes_made": true
   }, 
   170770, 
   null, 
   1129324740.0
  ], 
  [
   170774, 
   null, 
   "jyoshu", 
   "a differnce between encourageing and forcing them to do it to stop them from being gay\n\n \n Where has FoF said they should be \"forced?\"", 
   {}, 
   170755, 
   null, 
   1129325280.0
  ], 
  [
   170779, 
   null, 
   "jyoshu", 
   "Food for thought: I don't think that some people who are committed to the ex-gay fraud realize how evil some dimensions of the whole movement against homosexuals really are. Dr. C. Everett Koop, MD, Surgeon General of the United States, was a strong advocate for AIDS education and effective treatment until his retirement. After he retired, Dr. Koop visited many churches and church conferences to appeal for understanding and help towards gay and lesbian people. After months of this experience, Dr. Koop was interviewed in \"Christianity Today\" and said that he did not go to church much any more. He said that we need a stronger word than \"homophobia\" to speak of the hate towards homosexuals that he had found in the churches. He concluded that he knew many preachers and church leaders who hated homosexuals so much that if they had a button that would kill all homosexuals, they would push the button.\n\n \n This is probably true that there are a number of church leaders that are hostile toward gays to such an extent, but my experience is that the hostility in churches is more toward the political and cultural movement than gay people in general. Many in the gay pride movement have made it clear they are very hostile toward the Christian religion, especially evangelicals. This happens right here on this forum quite often. So it should come as no surprise that some in these churches react. (Although it's still not right--Christ did not teach revenge or holding grudges.)\n \n Also, I think anytime we make statements like this, we need to point out that most churches don't spend much time worrying about the issue of homosexuality, and many hardly ever make mention of it. It's important that we don't generalize about things like this or paint large swaths of Christianity in a bad light when it doesn't apply. The 'hate' churches are an extreme contingent of churches within Christianity often in the realm of fundamentalism. (And even some fundamentalists aren't hateful at all!) Dr. Koop and others must realize that there is no overarching authority over churches throughout Christendom that requires them to all think alike on this, and they don't. If he's not going to church much, it's probably not because of that because he could certainly have easily found a church that doesn't hate gay people if he'd tried.", 
   {}, 
   170764, 
   null, 
   1129326540.0
  ], 
  [
   170780, 
   null, 
   "joebrummer", 
   "This is probably true that there are a number of church leaders that are hostile toward gays to such an extent, but my experience is that the hostility in churches is more toward the political and cultural movement than gay people in general. Many in the gay pride movement have made it clear they are very hostile toward the Christian religion, especially evangelicals. This happens right here on this forum quite often. So it should come as no surprise that some in these churches react. (Although it's still not right--Christ did not teach revenge or holding grudges.)\n \n Also, I think anytime we make statements like this, we need to point out that most churches don't spend much time worrying about the issue of homosexuality, and many hardly ever make mention of it. It's important that we don't generalize about things like this or paint large swaths of Christianity in a bad light when it doesn't apply. The 'hate' churches are an extreme contingent of churches within Christianity often in the realm of fundamentalism. (And even some fundamentalists aren't hateful at all!) Dr. Koop and others must realize that there is no overarching authority over churches throughout Christendom that requires them to all think alike on this, and they don't. If he's not going to church much, it's probably not because of that because he could certainly have easily found a church that doesn't hate gay people if he'd tried.\n\n \n \n give me a break, I have been so careful in these posts to be sure we know WHO we are talking about......and now you are saying we are generalizing....right! The catholic church has been very vocal, the southern baptists had a convention just to speak about gay issues....so did other churches...including methodist and Church of England (Episcipol) the facts are stacked against your claim......This is a war that has gone on for 30 years of hate......and your newest claim is that they do it in self defense like they hold a grudge....who are you kidding.\n \n There are more churches speaking about homosexaulity than are not speaking about it!", 
   {}, 
   170779, 
   null, 
   1129326960.0
  ], 
  [
   170791, 
   null, 
   "jyoshu", 
   "give me a break, I have been so careful in these posts to be sure we know WHO we are talking about......and now you are saying we are generalizing....right! The catholic church has been very vocal, the southern baptists had a convention just to speak about gay issues....so did other churches...including methodist and Church of England (Episcipol) the facts are stacked against your claim......This is a war that has gone on for 30 years of hate......and your newest claim is that they do it in self defense like they hold a grudge....who are you kidding.\n\n \n Well, the article you linked to certainly didn't make the distinction.\n \n You are correct that the leadership of these denominations have been dealing with this issue in the last few years. But the churches for most part in them are not about hate. And that's a part of the perspective we have to keep when discussing gays and religion.", 
   {}, 
   170780, 
   null, 
   1129330560.0
  ], 
  [
   170805, 
   null, 
   "joebrummer", 
   "Well, the article you linked to certainly didn't make the distinction.\n \n You are correct that the leadership of these denominations have been dealing with this issue in the last few years. But the churches for most part in them are not about hate. And that's a part of the perspective we have to keep when discussing gays and religion.\n\n \n \n That is the discussion. I think these churches and the leaders are about hate. They may use god as a front, but really they have their own agenda of hate, especially Dobsen.\n \n You must not have read the whole artilce either. It even gives a time line of the last 30 years of the Traditional Values Coalition, Anitia Bryant...etc....this isn't few years old...this is a few decades old.....like I keep saying read and take your blinders off. Read the whole article, and the related articles on the SPLC site. Even if you disagree, you should at least realize this isn't a new issue. It is old. Read all of the information if for no other reason, you will be informed on both sides of the issue.\n \n \n Please read as much of this report as you can...so you can at least be informed. Don't just chalk it to rubbish. It is based on the facts. You if I am correct are not old enough to remember all of it, as I may, but you should as least read it.\n http://www.splcenter.org/intel/inte...cle.jsp?aid=522", 
   {}, 
   170791, 
   null, 
   1129334520.0
  ], 
  [
   170902, 
   null, 
   "jyoshu", 
   "That is the discussion. I think these churches and the leaders are about hate. They may use god as a front, but really they have their own agenda of hate, especially Dobsen.\n \n You must not have read the whole artilce either. It even gives a time line of the last 30 years of the Traditional Values Coalition, Anitia Bryant...etc....this isn't few years old...this is a few decades old.....like I keep saying read and take your blinders off. Read the whole article, and the related articles on the SPLC site. Even if you disagree, you should at least realize this isn't a new issue. It is old. Read all of the information if for no other reason, you will be informed on both sides of the issue.\n \n \n Please read as much of this report as you can...so you can at least be informed. Don't just chalk it to rubbish. It is based on the facts. You if I am correct are not old enough to remember all of it, as I may, but you should as least read it.\n http://www.splcenter.org/intel/inte...cle.jsp?aid=522\n\n \n Your link doesn't go anywhere.", 
   {}, 
   170805, 
   null, 
   1129351800.0
  ], 
  [
   171029, 
   null, 
   "joebrummer", 
   "Your link doesn't go anywhere.\n\n \n \n Sorry...\n \n http://www.splcenter.org/intel/intelreport/article.jsp?aid=522", 
   {}, 
   170902, 
   null, 
   1129396140.0
  ], 
  [
   171840, 
   null, 
   "Steeeeve", 
   "Really?\n DO you want to read the mans' words. I have more....\n \n \n \n \n Steve,\n Please do me a favor, go to this site and click the link on the middle to right of screen that say \"Launch Slideshow\" It will show you the Christian players and what they have done to homosexuals......it will show this goes way, way beyond saying this is a sin...\n \n http://www.splcenter.org/intel/intelreport/article.jsp?aid=522\n\n \n Yeah, it is obvious he doesn't support homosexuals. I think you misrepresent him in that you take many things he says out of the context he puts it in. I have heard the man speak many times and have often listened to his remarks that are questioned and when heard in the full context of the speech they are consistent with the Bible which is what he teaches. I also don't believe Mr. Falwell to be a hateful person or a person that thinks he is better than everyone else. If you disagree you can, but it seems we might just have to agree to disagree on this one.\n \n \n I still would like you to answer my question though...\n \" Are you saying there should be a law prohibiting this kind of speech? If so, how would this not violate the 1st amendment? \"", 
   {}, 
   170771, 
   null, 
   1129601520.0
  ], 
  [
   171878, 
   null, 
   "joebrummer", 
   "Yeah, it is obvious he doesn't support homosexuals. I think you misrepresent him in that you take many things he says out of the context he puts it in. I have heard the man speak many times and have often listened to his remarks that are questioned and when heard in the full context of the speech they are consistent with the Bible which is what he teaches. I also don't believe Mr. Falwell to be a hateful person or a person that thinks he is better than everyone else. If you disagree you can, but it seems we might just have to agree to disagree on this one.\n \n \n I still would like you to answer my question though...\n \" Are you saying there should be a law prohibiting this kind of speech? If so, how would this not violate the 1st amendment? \"\n\n \n \n \n If that helps you sleep at night great, but calling fellow humans the axis of evil is not consistant with the bible in anyway shape or form....not to mention that not that many people are with you on this one....Most think he is a hate machine......", 
   {}, 
   171840, 
   null, 
   1129606500.0
  ], 
  [
   171898, 
   null, 
   "Steeeeve", 
   "If that helps you sleep at night great, but calling fellow humans the axis of evil is not consistant with the bible in anyway shape or form....not to mention that not that many people are with you on this one....Most think he is a hate machine......\n\n \n True, many do. But many people don't hear him speak often either. ANd yes, he believes that people that live their life in sin are an \"axis of evil\". This is consistent with the teachings of the Bible in that people that don't take Jesus to be their savor are not protected by Jesus and thus are evil in Gods view. He doesn't hate these people but prays for them instead as he believes they are not saved. There is a key difference here. Like I said though, you can disagree with him.", 
   {}, 
   171878, 
   null, 
   1129608900.0
  ], 
  [
   171900, 
   null, 
   "joebrummer", 
   "True, many do. But many people don't hear him speak often either. ANd yes, he believes that people that live their life in sin are an \"axis of evil\". This is consistent with the teachings of the Bible in that people that don't take Jesus to be their savor are not protected by Jesus and thus are evil in Gods view. He doesn't hate these people but prays for them instead as he believes they are not saved. There is a key difference here. Like I said though, you can disagree with him.\n\n \n \n I would hope that you at least agree that such statements are harmful to gays and lesbians. They are demeaning to others. History has taught us that from Hitler and others.....you cannot take a segment of the population and make them the scapegoats of the evil in the world and not expect some will take violent action on that....words do make action...even if it was not intended by the speaker, they do have action.", 
   {}, 
   171898, 
   null, 
   1129609140.0
  ], 
  [
   171986, 
   null, 
   "jitobear", 
   "I agree with you about the shower thing. But I don't see what the problem is with them \"encouraging males to do typically male things, such as playing sports.\"\n\n \n How about we let kids be who they are?\n \n Call me quirky - but I support my child in any positive activity he is good at, interested in and enjoys. He likes sports, music AND cooking.", 
   {}, 
   170754, 
   null, 
   1129653120.0
  ], 
  [
   172956, 
   null, 
   "jyoshu", 
   "How about we let kids be who they are?\n\n \n I think that's pretty much what I was saying. \n \n Let males be male--encourage them to be who they are.", 
   {}, 
   171986, 
   null, 
   1129956540.0
  ], 
  [
   172961, 
   null, 
   "JPSartre12", 
   "give me a break, I have been so careful in these posts to be sure we know WHO we are talking about......and now you are saying we are generalizing....right! The catholic church has been very vocal, the southern baptists had a convention just to speak about gay issues....so did other churches...including methodist and Church of England (Episcipol) the facts are stacked against your claim......This is a war that has gone on for 30 years of hate......and your newest claim is that they do it in self defense like they hold a grudge....who are you kidding.\n \n There are more churches speaking about homosexaulity than are not speaking about it!\n\n \n I'm a Catholic and have NEVER heard a Catholic Priest give an anti-gay sermon in my 49 years of attending Church. It really isn't a hot topic in the pulpit, despite what you may think. Sorry to burst your bubble.", 
   {}, 
   170780, 
   null, 
   1129958160.0
  ], 
  [
   172973, 
   null, 
   "daewoo", 
   "I'm a Catholic and have NEVER heard a Catholic Priest give an anti-gay sermon in my 49 years of attending Church. It really isn't a hot topic in the pulpit, despite what you may think. Sorry to burst your bubble.\n\n \n I ahve to go with JP on this one. My fmaily is VERY catholic, though I am not particularly, but I have never heard any such thing discussed form the pulpit, nor has anybody I have spoken to in my family. It is a non issue.", 
   {}, 
   172961, 
   null, 
   1129960200.0
  ], 
  [
   172979, 
   null, 
   "jitobear", 
   "I think that's pretty much what I was saying. \n \n Let males be male--encourage them to be who they are.\n\n \n A boy who enjoys cooking isn't less male than one who enjoys football. Even if you dress them up in ballet slippers and give them a truck full of Barbies, they will be male. \n \n If you mean encourage them to live by stereotypical roles that pigeon hole their potential - go right ahead for your kids, my son's world will be bigger than that.", 
   {}, 
   172956, 
   null, 
   1129963020.0
  ], 
  [
   172982, 
   null, 
   "Bassman", 
   "Dr. James Dobson (yeah, I know, you hate his guts) gave some practical insight on this. Expounding on the verse in Proverbs 22:6, \"Train a child in the way he should go, and when he is old, he will not turn from it.\" Dobson concludes that this refers to a child's natural bent, or, more precisely, the traits, skills and personality of that child. If the child loves cooking? Guess what. You may have a master chef on your hands. If the child enjoys ballet? Barychnikov. You get the point.", 
   {}, 
   172979, 
   null, 
   1129963740.0
  ], 
  [
   173007, 
   null, 
   "Matthew S", 
   "Dr. James Dobson (yeah, I know, you hate his guts) gave some practical insight on this. Expounding on the verse in Proverbs 22:6, \"Train a child in the way he should go, and when he is old, he will not turn from it.\" Dobson concludes that this refers to a child's natural bent, or, more precisely, the traits, skills and personality of that child. If the child loves cooking? Guess what. You may have a master chef on your hands. If the child enjoys ballet? Barychnikov. You get the point.\n\n \n \n Believe it or not I used to have a great deal of respect for James Dobson he used to give very good sound advice. Well that was until he started attacking the GLBT community. He is in his 70's now hopefully we won't have to put up with his views for much longer and I am getting my dancing shoes ready for that day; hopefully i won't get too much dirt on them.", 
   {}, 
   172982, 
   null, 
   1129986720.0
  ], 
  [
   173078, 
   null, 
   "jyoshu", 
   "A boy who enjoys cooking isn't less male than one who enjoys football. Even if you dress them up in ballet slippers and give them a truck full of Barbies, they will be male. \n \n If you mean encourage them to live by stereotypical roles that pigeon hole their potential - go right ahead for your kids, my son's world will be bigger than that.\n\n \n Don't be ridiculous. No one is suggesting that boys can't cook if they want to--not even James Dobson. You can keep your politically correct lens to see everything through for yourself and your own family. \n \n I think that in our society's paranoia these days about gender roles, equality, and political correctness, and doing everything we can to not dare mention the differences between men and women, we've forgotten the joy and value in letting boys become men. We've become obsessed with blurring the lines because some in our society are so freaked out by their paranoia of patriarchal tendencies in culture that we no longer celebrate girls enjoying the things women often enjoy, and boys often enjoying the things men enjoy. There's nothing wrong with those differences and some matters of gender roles. Most boys WANT to do male-oriented things. Let 'em.", 
   {}, 
   172979, 
   null, 
   1130009040.0
  ], 
  [
   173079, 
   null, 
   "jyoshu", 
   "I ahve to go with JP on this one. My fmaily is VERY catholic, though I am not particularly, but I have never heard any such thing discussed form the pulpit, nor has anybody I have spoken to in my family. It is a non issue.\n\n \n It's the same in most (by far) evangelical churches too.", 
   {}, 
   172973, 
   null, 
   1130009280.0
  ], 
  [
   173089, 
   null, 
   "jitobear", 
   "Don't be ridiculous. No one is suggesting that boys can't cook if they want to--not even James Dobson. You can keep your politically correct lens to see everything through for yourself and your own family. \n \n I think that in our society's paranoia these days about gender roles, equality, and political correctness, and doing everything we can to not dare mention the differences between men and women, we've forgotten the joy and value in letting boys become men. We've become obsessed with blurring the lines because some in our society are so freaked out by their paranoia of patriarchal tendencies in culture that we no longer celebrate girls enjoying the things women often enjoy, and boys often enjoying the things men enjoy. There's nothing wrong with those differences and some matters of gender roles. Most boys WANT to do male-oriented things. Let 'em.\n\n \n Gee somewhere being too busy with football, fishing, camping, baseball, paint ball, cooking, and the arts my son and I missed that boys weren't encouraged to be men anymore.\n \n Traditionally boy activities aren't going anywhere I assure you. They take up a big hunk of my free time as a parent. Dobsonites are the ones who are paranoid with stupid ideas like \"if your little boy doesn't want to play football he must be XXXXX.\"\n \n Gender roles are bunk. Things girls \"enojoy\". To hell with my bass or fishing - I just can't wait to do the damned laundry every week.\n \n I know - I like to fish so I must be a XXXX. Pesky attraction to men I have though....", 
   {}, 
   173078, 
   null, 
   1130012520.0
  ], 
  [
   173093, 
   null, 
   "Steeeeve", 
   "I would hope that you at least agree that such statements are harmful to gays and lesbians. They are demeaning to others. History has taught us that from Hitler and others.....you cannot take a segment of the population and make them the scapegoats of the evil in the world and not expect some will take violent action on that....words do make action...even if it was not intended by the speaker, they do have action.\n\n \n That statements by Jerry Fallwell might be seen as hurtful? Yeah, I could see this. But God isn't in the business of making everyone get what they want and Jerry Fallwell presents this message. Yeah, God's law is not exactly a \"fair\" thing is some eyes but it is what it is and I don't think Jerry Fallwell is a bad guy for it. He doesn't use a 'segment of the population for scapegoats' as you claim though. It is just a belief of the Bible and so long as you follow the rest of it then there will be no \"Hitler\" type actions done. People that kill gays and things like that aren't going to do too well in Gods eyes. I believe Jerry Falwell would say that as well. On the flip side, there are some ministers and Christians that preach harm and hate...this is different and against the Bible. I guess one thing to understand is the difference between a belief and hate.", 
   {}, 
   171900, 
   null, 
   1130013720.0
  ], 
  [
   173096, 
   null, 
   "joebrummer", 
   "That statements by Jerry Fallwell might be seen as hurtful? Yeah, I could see this. But God isn't in the business of making everyone get what they want and Jerry Fallwell presents this message. Yeah, God's law is not exactly a \"fair\" thing is some eyes but it is what it is and I don't think Jerry Fallwell is a bad guy for it. He doesn't use a 'segment of the population for scapegoats' as you claim though. It is just a belief of the Bible and so long as you follow the rest of it then there will be no \"Hitler\" type actions done. People that kill gays and things like that aren't going to do too well in Gods eyes. I believe Jerry Falwell would say that as well. On the flip side, there are some ministers and Christians that preach harm and hate...this is different and against the Bible. I guess one thing to understand is the difference between a belief and hate.\n\n \n \n Falwell falls under the hate....look at the statements he has made in the past about gays....those are not statement about the bible...they are hate speech....\n \n check out www.fallwell.com There are lists of statement made by him about gays.....and when he said it....these are not \"belief\" statements by any means. They are statement s made to demoralize and demean....", 
   {}, 
   173093, 
   null, 
   1130014020.0
  ], 
  [
   173113, 
   null, 
   "JPSartre12", 
   "Gee somewhere being too busy with football, fishing, camping, baseball, paint ball, cooking, and the arts my son and I missed that boys weren't encouraged to be men anymore.\n\n Hey! Where are the cars? You haven't lived until you've pulled the front wheels off the ground after mashing the accelerator on the dragstrip. It's testosterone at its finest. :) \n \n\n Traditionally boy activities aren't going anywhere I assure you. They take up a big hunk of my free time as a parent. Dobsonites are the ones who are paranoid with stupid ideas like \"if your little boy doesn't want to play football he must be XXXXX.\"\n \n Gender roles are bunk. Things girls \"enojoy\". To hell with my bass or fishing - I just can't wait to do the damned laundry every week\n I know - I like to fish so I must be a XXXX. Pesky attraction to men I have though....\n\n \n My wife and I used to rent a boat and go flounder fishing when we were dating and living in NJ. I can't wait until we retire and move back to the coast so we can start again. I never could interest her in hunting, though.", 
   {}, 
   173089, 
   null, 
   1130018340.0
  ], 
  [
   173114, 
   null, 
   "Bassman", 
   "Believe it or not I used to have a great deal of respect for James Dobson he used to give very good sound advice. Well that was until he started attacking the GLBT community. He is in his 70's now hopefully we won't have to put up with his views for much longer and I am getting my dancing shoes ready for that day; hopefully i won't get too much dirt on them.\n\n Careful now, Matt. Never harbor ill will toward anyone, nor wish for the death of anyone.", 
   {}, 
   173007, 
   null, 
   1130018460.0
  ], 
  [
   173144, 
   null, 
   "jyoshu", 
   "check out www.fallwell.com There are lists of statement made by him about gays.....and when he said it....these are not \"belief\" statements by any means. They are statement s made to demoralize and demean....\n\n \n What concerns me more is that someone would actually buy a domain with that name and put up a website just for that purpose. \n \n Good grief, you guys have got to grow some skin and not let people like Falwell get to you. Or worse, color your view of Christians everywhere.", 
   {}, 
   173096, 
   null, 
   1130022720.0
  ], 
  [
   173148, 
   null, 
   "joebrummer", 
   "What concerns me more is that someone would actually buy a domain with that name and put up a website just for that purpose. \n \n Good grief, you guys have got to grow some skin and not let people like Falwell get to you. Or worse, color your view of Christians everywhere.\n\n \n \n yeah, your right. We should just allow injustice. We should allow people to demean and dehumanize us. It's fine, we will just get a thicker skin.....", 
   {}, 
   173144, 
   null, 
   1130023260.0
  ], 
  [
   173150, 
   null, 
   "Bassman", 
   "What's worse is that you want to force the entire society to be fair. Well, Joe, I've got a news flash for you. Life is not fair. That's been my entire contention all along. You expect that everyone accepts or \"tolerates\" your agenda, and then ram it down everyone's throats if they don't.", 
   {}, 
   173148, 
   null, 
   1130023860.0
  ], 
  [
   173152, 
   null, 
   "joebrummer", 
   "What's worse is that you want to force the entire society to be fair. Well, Joe, I've got a news flash for you. Life is not fair. That's been my entire contention all along. You expect that everyone accepts or \"tolerates\" your agenda, and then ram it down everyone's throats if they don't.\n\n Dont be a drama queen! Of course life isn't fair, but that doesn't mean we should just sit back and allow injustice to ourselves. Like the drag queens who started at stonewall, we just aren't going to take it. Yes, we will fight back with all that we got!", 
   {}, 
   173150, 
   null, 
   1130024160.0
  ], 
  [
   173155, 
   null, 
   "Bassman", 
   "Then you'll lose miserably. Because the majority of Americans have enough common sense and morals to reject your notion of \"tolerance.\"", 
   {}, 
   173152, 
   null, 
   1130026080.0
  ], 
  [
   173159, 
   null, 
   "joebrummer", 
   "Then you'll lose miserably. Because the majority of Americans have enough common sense and morals to reject your notion of \"tolerance.\"\n\n \n \n Really? SInce the stonewall riots more and more people have begun to accept homosexuals and deem them rights....look at Mass. \n \n I do not think we are losing miserably as you have said. It appears we are doing just fine....and will continue to do just fine.", 
   {}, 
   173155, 
   null, 
   1130027580.0
  ], 
  [
   173160, 
   null, 
   "Bassman", 
   "Yes, when you force your agenda down their throats.", 
   {}, 
   173159, 
   null, 
   1130027820.0
  ], 
  [
   173167, 
   null, 
   "Eddie", 
   "Face it Bassman, you are fighting a lost cause. You might as well join us ;)", 
   {}, 
   173160, 
   null, 
   1130028720.0
  ], 
  [
   173185, 
   null, 
   "joebrummer", 
   "Yes, when you force your agenda down their throats.\n\n \n \n Isn't that what the religious right is doing. Shoving their beliefs down everyone throats......\n \n As a gay man, heterosexuality is shoved down my throat everyday. In tv, advertising, magazines, I go to the mall and see couples holding hands...\n \n \n Now you show me where you have had that kind of tratment from gays.\n Please show us how it is being shoved down your throat.....'\n Be sure to give specific examples of how your throat is full of gay stuff and how we have put it there....in fact this should be interesting....please tell the readers of the board how gays have shoved their agenda down your throats....", 
   {}, 
   173160, 
   null, 
   1130030880.0
  ], 
  [
   173204, 
   null, 
   "JPSartre12", 
   "Dont be a drama queen! \n\n LOL...good one. Pot. Kettle. Black. emoticon_rolleyes \n \n\n Of course life isn't fair, but that doesn't mean we should just sit back and allow injustice to ourselves. Like the drag queens who started at stonewall, we just aren't going to take it. Yes, we will fight back with all that we got!\n\n And I'm sure that you know straights will do the same. Only we should use the balot box, not the sword.", 
   {}, 
   173152, 
   null, 
   1130035140.0
  ], 
  [
   173212, 
   null, 
   "Steeeeve", 
   "Falwell falls under the hate....look at the statements he has made in the past about gays....those are not statement about the bible...they are hate speech....\n \n check out www.fallwell.com There are lists of statement made by him about gays.....and when he said it....these are not \"belief\" statements by any means. They are statement s made to demoralize and demean....\n\n \n That website is probably the worst one I have seen to date. It is extremely hypocritical...", 
   {}, 
   173096, 
   null, 
   1130037540.0
  ], 
  [
   173213, 
   null, 
   "Bassman", 
   "Face it Bassman, you are fighting a lost cause. You might as well join us ;)\n\n I don't think so. Why should I support an immoral lifestyle?", 
   {}, 
   173167, 
   null, 
   1130037720.0
  ], 
  [
   173215, 
   null, 
   "Bassman", 
   "Now you show me where you have had that kind of tratment from gays.\n Please show us how it is being shoved down your throat.....'\n Be sure to give specific examples of how your throat is full of gay stuff and how we have put it there....in fact this should be interesting....please tell the readers of the board how gays have shoved their agenda down your throats....\n\n OK, let's start with the public screwl system. It's bad enough that they're dumbed down, but to indoctinate children into thinking the homosexual lifestyle is OK is just plain wrong. Second, your demands for special rights are just plain disingenuous.", 
   {}, 
   173185, 
   null, 
   1130037900.0
  ], 
  [
   173229, 
   null, 
   "joebrummer", 
   "OK, let's start with the public screwl system. It's bad enough that they're dumbed down, but to indoctinate children into thinking the homosexual lifestyle is OK is just plain wrong. Second, your demands for special rights are just plain disingenuous.\n\n \n \n Homosexuality is not wrong! Plain and simple. and children should be taught young there are different people in the world and they should respect all of them. Sorry you disagree. But homosexuality isn't wrong. \n \n Show me which rights I am asking for that are \"Special\"\n I do not see having a job, place to live, walking down the street without being beaten up, protections for my relationship....humm, those sound like Human rights, nt special rights.\n BUt I will let you tell me.....what right have gays asked for that is a special right.", 
   {}, 
   173215, 
   null, 
   1130040240.0
  ], 
  [
   173233, 
   null, 
   "Bassman", 
   "Differences in culture, yes. But acceptance of an immoral lifestyle? No! Absolutely not! The sexual relationship belongs in one place and one place only! The monogamous, faithful marriage between one man and one woman. Now, The ability for you to be able to take care of your basic needs (food, shelter, clothing), nobody's denying you that. But to demand legislation (so-called \"hate crimes laws,\" homosexual marriage, etc.) when the majority of Americans do not want it rammed down our throats, is just plain stupid.", 
   {}, 
   173229, 
   null, 
   1130041920.0
  ], 
  [
   173237, 
   null, 
   "joebrummer", 
   "Differences in culture, yes. But acceptance of an immoral lifestyle? No! Absolutely not! The sexual relationship belongs in one place and one place only! The monogamous, faithful marriage between one man and one woman. Now, The ability for you to be able to take care of your basic needs (food, shelter, clothing), nobody's denying you that. But to demand legislation (so-called \"hate crimes laws,\" homosexual marriage, etc.) when the majority of Americans do not want it rammed down our throats, is just plain stupid.\n\n \n \n You are just ramblimg now! The majority of Americans support non-discrimination laws for gays and lesbians. \n \n We have crime laws for gender, religion, race, but not gays...that is wrong when you realize gays have the second highest number of hate crimes committeds aginst them....\n \n Yes, people are denying gays basic needs.....welcome to the real wold. Gyas can be legally fired from the jobs just for being gay! Gays can be denied housing for being gay. There are no laws in many states to stop this....so if we ask for such laws I guess you call it a \"special right\"\n \n You need to put yourself in the shoes of your fellow man, maybe then you will begin to understand the challenges gays and lesbians face on a day to day basis. Stop living in your rose colored world and try living in my world.", 
   {}, 
   173233, 
   null, 
   1130042340.0
  ], 
  [
   173244, 
   null, 
   "Bassman", 
   "Ahh the world of gay bars and bath houses, what a life (puke)! Listen , Joe, I will not live in an immoral lifestyle. And BTW, if I owned a rental property, don't I have the right, as a property owner, to say who I can and can't rent to?", 
   {}, 
   173237, 
   null, 
   1130042820.0
  ], 
  [
   173245, 
   null, 
   "Symbiote", 
   "Do you believe property owners should also be able to evict people on the basis of their religion and/or attitude towards gays?", 
   {}, 
   173244, 
   null, 
   1130043000.0
  ], 
  [
   173248, 
   null, 
   "Bassman", 
   "Do you believe property owners should also be able to evict people on the basis of their religion and/or attitude towards gays?\n\n If they're practicing immoral acts on my property, then yes. But there is a difference between faith and sin.", 
   {}, 
   173245, 
   null, 
   1130043240.0
  ], 
  [
   173249, 
   null, 
   "JPSartre12", 
   "Homosexuality is not wrong! Plain and simple. and children should be taught young there are different people in the world and they should respect all of them. Sorry you disagree. But homosexuality isn't wrong. \n\n In your opinion. And Bassman is entitled to his as well. \n \n\n Show me which rights I am asking for that are \"Special\"\n I do not see having a job, place to live, walking down the street without being beaten up, protections for my relationship....humm, those sound like Human rights, nt special rights.\n BUt I will let you tell me.....what right have gays asked for that is a special right.\n\n \n Redefining marriage = special\n Hate Laws = special", 
   {}, 
   173229, 
   null, 
   1130043300.0
  ], 
  [
   173250, 
   null, 
   "Bassman", 
   "My point exactly! Thanx, JP", 
   {}, 
   173249, 
   null, 
   1130043360.0
  ], 
  [
   173251, 
   null, 
   "JPSartre12", 
   "Do you believe property owners should also be able to evict people on the basis of their religion and/or attitude towards gays?\n\n \n I tink a property owner should be able to do as he wishes with HIS property. emoticon_mad", 
   {}, 
   173245, 
   null, 
   1130043420.0
  ], 
  [
   173254, 
   null, 
   "joebrummer", 
   "Ahh the world of gay bars and bath houses, what a life (puke)! Listen , Joe, I will not live in an immoral lifestyle. And BTW, if I owned a rental property, don't I have the right, as a property owner, to say who I can and can't rent to?\n\n \n \n nice generalization....for your info...most gays don't hang in bars.....most gays have never been to a gay bath house....have you been to Vegas where brothels are legal? how is it different?\n \n You live your life with a generalization of what you think being gay is about. Sounds to me like you have sterotypes in your head, not reality.", 
   {}, 
   173244, 
   null, 
   1130043600.0
  ], 
  [
   173311, 
   null, 
   "zachvac", 
   " OK, let's start with the public screwl system. It's bad enough that they're dumbed down, but to indoctinate children into thinking the homosexual lifestyle is OK is just plain wrong. Second, your demands for special rights are just plain disingenuous.\n\n \n I don't think anyone should be able to tell me what to believe. A homosexual \"lifestlye\" isn't right or wrong, and neither is a heterosexual relationship. I like to deal with what is when teaching. They should teach that there are gays. Please elaborate how we are \"indoctinat[ing]\" kids. I still am not convinced that there should be hate crimes. If I did the same thing that the first post here describes to anyone, I would think I should be punished very heavily. It is the action committed that should be the crime, not the victim of the crime. Do we make the murder of blond-haired people worse than black-haired people?", 
   {}, 
   173233, 
   null, 
   1130048880.0
  ], 
  [
   173313, 
   null, 
   "zachvac", 
   "\n Redefining marriage = special\n Hate Laws = special\n\n \n \n I don't see what marriage is doing as a government institution. I think that marriage should stay as a religious institution. If you want to have a civil union with anyone I think you should be able to, be it your mother, sister, brother, cousin, friend, or anyone you feel like it. If you want to live with that person and make that person the one who owns all your stuff too plus other rights currently exercised by married couples. Then we don't have to redefine marriage and we leave it in the church where it belongs. I don't see hate laws for gays any more special than hate laws against blacks.", 
   {}, 
   173249, 
   null, 
   1130049060.0
  ], 
  [
   173315, 
   null, 
   "zachvac", 
   "If they're practicing immoral acts on my property, then yes. But there is a difference between faith and sin.\n\n \n \n\n And BTW, if I owned a rental property, don't I have the right, as a property owner, to say who I can and can't rent to?\n \n\n \n Now I support your right to rent your property to whoever you want, whether you only allow white, black, or asian people. Whether you allow only kids, or only people over 50. So I agree with the second quoted statement here, but then above you claim that you would only be able to evict someone if they were practicing immoral acts on your property. Which is it? Could someone deny you the right to rent property because you don't approve of gays? Do you think that should be legal?", 
   {}, 
   173248, 
   null, 
   1130049240.0
  ], 
  [
   173316, 
   null, 
   "Bassman", 
   "The difference here is that sexual behavior is something that can be changed. Skin color cannot.", 
   {}, 
   173313, 
   null, 
   1130049300.0
  ], 
  [
   173319, 
   null, 
   "joebrummer", 
   "The difference here is that sexual behavior is something that can be changed. Skin color cannot.\n\n sexual behavior can be changed, sexual orientation cannot....", 
   {}, 
   173316, 
   null, 
   1130050140.0
  ], 
  [
   173324, 
   null, 
   "daewoo", 
   "Now I support your right to rent your property to whoever you want, whether you only allow white, black, or asian people. Whether you allow only kids, or only people over 50. So I agree with the second quoted statement here, but then above you claim that you would only be able to evict someone if they were practicing immoral acts on your property. Which is it? Could someone deny you the right to rent property because you don't approve of gays? Do you think that should be legal?\n \n \n At one time I owneed quite a few rental properties. I discriminated against certain people. I did not rent to college kids, or illegal aliens, or anybody who looked like a scumbag. I also did not rent to people who were apparent evangelical christians or jesus freaks. Such people tend to be out of touch with reality and do not pay theri rent on time. \n \n It is probably a moot point for you, bassman, since you ratherobviously into the last group (evangelicals and jesus freaks), you will likely never own rental properties.", 
   {}, 
   173315, 
   null, 
   1130050440.0
  ], 
  [
   173351, 
   null, 
   "Matthew S", 
   " I still am not convinced that there should be hate crimes. If I did the same thing that the first post here describes to anyone, I would think I should be punished very heavily. It is the action committed that should be the crime, not the victim of the crime. Do we make the murder of blond-haired people worse than black-haired people?\n\n \n \n If a Jewish, Black, or GLBT person is targeted because they are who they are that is a hate crime. True a crime is a crime, however there is a chance that the crime would not have occured if the person had not been who they are.", 
   {}, 
   173311, 
   null, 
   1130069880.0
  ], 
  [
   173354, 
   null, 
   "Symbiote", 
   "And BTW, if I owned a rental property, don't I have the right, as a property owner, to say who I can and can't rent to?\n\n \n Standard profile of the neocon, appeal to private property when it suits your purposes (ie discriminating against gays, liberals), appeal to government control whenever it doesn't. If there's one thing that's consistent, it's the dishonesty.", 
   {}, 
   173351, 
   null, 
   1130071500.0
  ], 
  [
   173631, 
   null, 
   "jitobear", 
   "nice generalization....for your info...most gays don't hang in bars.....most gays have never been to a gay bath house....have you been to Vegas where brothels are legal? how is it different?\n \n You live your life with a generalization of what you think being gay is about. Sounds to me like you have sterotypes in your head, not reality.\n\n \n Bassman can't live without his stereotypes and rhetoric. Several people have pointed out how they are wrong, me included, and he just ignores them. His mind is made up (about something he doesn't know a damned thing about) - don't be confusing him with any reality now. \n \n It's incredible how he knows that it's a choice to be gay - when he is straight. And how he knows all about how they live and how bad they are for kids when he would quite obviously never accept one as a friend or let one near his child. \n \n Before he opens his yap about how bad gays are for kids I wonder if he might find the nuts to actually talk to the child of a gay person. Maybe before he accuses the next gay of hanging out in bathhouses maybe he could just talk to one about their life. I doubt it though. It would require a lot more courage than he has ever demonstrated in this forum.", 
   {}, 
   173254, 
   null, 
   1130173440.0
  ], 
  [
   173633, 
   null, 
   "jyoshu", 
   "Before he opens his yap about how bad gays are for kids I wonder if he might find the nuts to actually talk to the child of a gay person. Maybe before he accuses the next gay of hanging out in bathhouses maybe he could just talk to one about their life. I doubt it though. It would require a lot more courage than he has ever demonstrated in this forum.\n\n \n I agree with you that being gay may not be a choice, but I don't think that talking to children is a particuarly accurate way to get to the truth on an issue like this. \n \n I'm sure if you talked to these kids, they'd probably insist that what they've grown up with is valid as well. The point is, kids will relay what they've been taught.", 
   {}, 
   173631, 
   null, 
   1130173800.0
  ], 
  [
   173638, 
   null, 
   "jitobear", 
   "I agree with you that being gay may not be a choice, but I don't think that talking to children is a particuarly accurate way to get to the truth on an issue like this. \n \n I'm sure if you talked to these kids, they'd probably insist that what they've grown up with is valid as well. The point is, kids will relay what they've been taught.\n\n \n Talk to my kid then. He has had a straight dad and a gay one. Let him tell you which one did what and gave a damn.", 
   {}, 
   173633, 
   null, 
   1130175060.0
  ], 
  [
   173642, 
   null, 
   "jyoshu", 
   "Talk to my kid then. He has had a straight dad and a gay one. Let him tell you which one did what and gave a damn.\n\n \n But does that have anything to do with whether or not one chooses to be gay? Or whether or not many gay people do certain things? I'm not saying your kid is wrong--I would certainly respect his opinion and experiences. I'm the first one to say that testimonials are valuable. I just see, such as from the article I linked, that kids tend to relay what they've been taught by their parents.", 
   {}, 
   173638, 
   null, 
   1130175960.0
  ], 
  [
   173644, 
   null, 
   "joebrummer", 
   "But does that have anything to do with whether or not one chooses to be gay? Or whether or not many gay people do certain things? I'm not saying your kid is wrong--I would certainly respect his opinion and experiences. I'm the first one to say that testimonials are valuable. I just see, such as from the article I linked, that kids tend to relay what they've been taught by their parents.\n\n \n Well then, re-read bassman's post about his kids.....what will they relay....and how will they interpret what they have learned abut gays....no wonder the sterotypes don't die out when ya have people like bassman teaching his misinformation and sterotypes to his kids.\n \n God forbid one of his kids turns out to be gay. You will have some serious self-hatred from that child.....can you say therapy for life?", 
   {}, 
   173642, 
   null, 
   1130176320.0
  ], 
  [
   173679, 
   null, 
   "jyoshu", 
   "Well then, re-read bassman's post about his kids.....what will they relay....and how will they interpret what they have learned abut gays....no wonder the sterotypes don't die out when ya have people like bassman teaching his misinformation and sterotypes to his kids.\n\n \n I'd say that goes both ways, though. Kids who are seen as pro-gay are often just following the way they were brought up or taught, or influenced. Sometimes gay rights people think that the fact more kids are \"tolerant\" of gay people is a change of heart on their parts, but I think more than anything it's just a fad right now--kids love fads, even if the fad is political-correctness. It's the \"gays-are-cool\" fad. Think about it: in a lot of the movies now it's portrayed for the lady to have the token gay male friend, or tv shows where they're cool because they supposedly have good clothing tastes (\"XXXXX Eye for the Straight Guy\"). Kids are just following along with pop culture, in many ways.\n \n You all owe a lot to the entertainment industry for the free publicity as well as adding gay to what's vogue.", 
   {}, 
   173644, 
   null, 
   1130182740.0
  ], 
  [
   173682, 
   null, 
   "joebrummer", 
   "I'd say that goes both ways, though. Kids who are seen as pro-gay are often just following the way they were brought up or taught, or influenced. Sometimes gay rights people think that the fact more kids are \"tolerant\" of gay people is a change of heart on their parts, but I think more than anything it's just a fad right now--kids love fads, even if the fad is political-correctness. It's the \"gays-are-cool\" fad. Think about it: in a lot of the movies now it's portrayed for the lady to have the token gay male friend, or tv shows where they're cool because they supposedly have good clothing tastes (\"XXXXX Eye for the Straight Guy\"). Kids are just following along with pop culture, in many ways.\n \n You all owe a lot to the entertainment industry for the free publicity as well as adding gay to what's vogue.\n\n BUt even as these kids get older, they will still have a mroe positive view of gays with less sterotypes (except bassman's kid). This opens the door for gay youth growing up with better self-esteem, meaning they won't be hanging out at the park cruising. It means they will not be using drugs to cope with their sexulity, it means you will have healthy gay adults later....", 
   {}, 
   173679, 
   null, 
   1130183460.0
  ], 
  [
   173694, 
   null, 
   "Steeeeve", 
   "BUt even as these kids get older, they will still have a mroe positive view of gays with less sterotypes (except bassman's kid). This opens the door for gay youth growing up with better self-esteem, meaning they won't be hanging out at the park cruising. It means they will not be using drugs to cope with their sexulity, it means you will have healthy gay adults later....\n\n any stereotype is either due to TV shows such as \"XXXXX eye for the straight guy\" or because it is true.", 
   {}, 
   173682, 
   null, 
   1130185380.0
  ], 
  [
   173702, 
   null, 
   "joebrummer", 
   "any stereotype is either due to TV shows such as \"XXXXX eye for the straight guy\" or because it is true.\n\n Wow, talk about the need for diversity training. Do you say that about all sterotypes or just the ones about gays.\n \n So you believe all gays are rich and well dressed.\n You believe that all gays have a sense of decorating style.\n They are all artistic.\n All male nurses, hairdressers, and braodway dancers are gay.\n \n And the ever popular and even more stupid, all gay men like quiche.\n \n Great, any other really stupid remarks from the peanut gallery.", 
   {}, 
   173694, 
   null, 
   1130189100.0
  ], 
  [
   173709, 
   null, 
   "jitobear", 
   "But does that have anything to do with whether or not one chooses to be gay? Or whether or not many gay people do certain things? I'm not saying your kid is wrong--I would certainly respect his opinion and experiences. I'm the first one to say that testimonials are valuable. I just see, such as from the article I linked, that kids tend to relay what they've been taught by their parents.\n\n \n No it's not because he is gay and it's not because I told him to like gay people. He will defend his mentor because his mentor is loving, dedicated and committed. The stupid sperm donar straight guy I happily divorced cheap, mean, abusive and walked on his kid.\n \n I saying gay people are no better or worse for kids than straight people. There are wonderful people and ***holes everywhere.\n \n Bassman is dead wrong about this. I know he is. Gays are not bad for children. Period.", 
   {}, 
   173642, 
   null, 
   1130190960.0
  ], 
  [
   173756, 
   null, 
   "Bassman", 
   "Really? Then why has the rabid homosexual lobby been fighting tooth-and-nail against the Boy Scouts?", 
   {}, 
   173709, 
   null, 
   1130197500.0
  ], 
  [
   173765, 
   null, 
   "emoreno2292", 
   "Really? Then why has the rabid homosexual lobby been fighting tooth-and-nail against the Boy Scouts?\n\n Is this you trying to refute Jitobear's point that gays aren't bad for children?\n Ridiculous. The reason the \"rabid homosexual lobby\" as you call it, fights the boy scouts \"tooth and nail\" is because the boy scouts discriminate against homosexuals and non-christians. They unfortunately practice discrimination against applicants. It's not just the homosexual lobby that is fighting back; take a look.\n http://www.hatecrime.org/subpages/boyscouts.html\n Banks, school boards of numerous cities, Steven Spielberg (Oh, no, say it ain't so!) Novell, CVS, United Church of Christ, all have taken issue with the Scouts.", 
   {}, 
   173756, 
   null, 
   1130198520.0
  ], 
  [
   173766, 
   null, 
   "JakeCJB", 
   "Really? Then why has the rabid homosexual lobby been fighting tooth-and-nail against the Boy Scouts?\n\n \n Who are \"the rabid homosexual lobby\"? There are many who are against the American Boy Scout organization's policy of discrimination against gay men.", 
   {}, 
   173756, 
   null, 
   1130198580.0
  ], 
  [
   173827, 
   null, 
   "joebrummer", 
   "Who are \"the rabid homosexual lobby\"? There are many who are against the American Boy Scout organization's policy of discrimination against gay men.\n\n \n \n Rabid Homosexual lobby.....picture in your heads...Elton John Foaming at the mouth....Sounds silly with a picture? Sounds stupid without the visual.......Get a grip man. The homosexual lobby is no more rabid than jetty falwell or Rev Phelps. You think we are rabid....we never call our foes the axis of evil. We don't demoralize them so they are the targets of violence...\n \n Who is more \"rabid\" the christian right backed by Dr. Cameron and Dr. Dobson or a bunch of in gays who want to being treated as equal....\n \n Bassman, you have such a morbid and depressing view of the world....", 
   {}, 
   173766, 
   null, 
   1130208180.0
  ], 
  [
   173832, 
   null, 
   "Bassman", 
   "\"Morbid and depressing?\" Yes, but also, I'm filled with hope! Hope for a new world where sin and wickedness is obliterated and God Himself rules on the throne. Hopeful that when the new world comes, it will be so filled with goodness and righteousness, peace and utter joy that words alone cannot describe it!!!", 
   {}, 
   173827, 
   null, 
   1130208600.0
  ], 
  [
   173834, 
   null, 
   "joebrummer", 
   "\"Morbid and depressing?\" Yes, but also, I'm filled with hope! Hope for a new world where sin and wickedness is obliterated and God Himself rules on the throne. Hopeful that when the new world comes, it will be so filled with goodness and righteousness, peace and utter joy that words alone cannot describe it!!!\n\n \n \n Well, that place sounds just dandy, but Dr. Suess is dead.....It is a nice view, but it is not reality. You need to find your way back to reality.", 
   {}, 
   173832, 
   null, 
   1130208660.0
  ], 
  [
   173838, 
   null, 
   "Bassman", 
   "Rabbi Paul was right about you.\"The natural man receiveth not the things of God, neither can he understand them, for they are spiritually discerned.\" You cannot understand what god says because you are spiritually dead.", 
   {}, 
   173834, 
   null, 
   1130209260.0
  ], 
  [
   173843, 
   null, 
   "joebrummer", 
   "Rabbi Paul was right about you.\"The natural man receiveth not the things of God, neither can he understand them, for they are spiritually discerned.\" You cannot understand what god says because you are spiritually dead.\n\n \n \n YOu have spoken to you Rabbi about me? That's creepy.\n \n Spititual Dead? NO, I am actually a very spiritual person. I have much faith in the world....I believe the world is god. Everything is god, good or bad. I believe when you out good energy into the world it comes back to you.\n \n I once got a flat tire. No key to get the hubcap off. It was 90 degrees that day and that is rough on my asthma. This guy comes out of no where. Pulls over...fixes my tire. I offered him some money for the job and he said that the universe proboly owed me one and he was happy to be the giver of gifts......\n \n Later that same day, I kept driving along....I saw someone who had pulled over with steam ouring from the engine......I gave her a ride to the gas station to get water and drove her back to the car....She offered me some money for gas.....I repeated the words back...the universe proboly owed you one, and I am happy to deliver it!\n \n Everything is spiritual....That has never died in me, but it sounds dead in you..As one who has worked mental health for years, you sounds very depressed. I have heard a lot of people tell me their view of the world. I have heard the most mentally ill have a better outlook on life than you. If that tells you anything. Seek some professional help Bassman. It won't hurt you to talk to someone. The world is not the horrid place you think it is.", 
   {}, 
   173838, 
   null, 
   1130209680.0
  ], 
  [
   173848, 
   null, 
   "Bassman", 
   "OK you have an unscriptural, pantheistic view of God, which is contrary to the true nature of God. And no, I don't need any psychobabble to tell me otherwise.", 
   {}, 
   173843, 
   null, 
   1130210160.0
  ], 
  [
   173851, 
   null, 
   "joebrummer", 
   "OK you have an unscriptural, pantheistic view of God, which is contrary to the true nature of God. And no, I don't need any psychobabble to tell me otherwise.\n\n \n \n Whatever you say dude, All I know is that I am a very happy man. I don't really have to go far from my house and see what I have and how lucky I am. Spiritually I am very, very wealthy. Anyway, who are you to tell me my happiness isn't real.....you really do not know that. but you are so arrogant with your bible, you'll say it.....that is you biggest mistake with me.", 
   {}, 
   173848, 
   null, 
   1130210400.0
  ], 
  [
   173856, 
   null, 
   "Bassman", 
   "I'll tell you. When you stand before Him and He says to you; \"Joe, I've loved you enough that I sent My Son to die for your sins, and that you've repeatedly rejected Him for your homosexuality.\" What will you say to Him, then?", 
   {}, 
   173851, 
   null, 
   1130210640.0
  ], 
  [
   173859, 
   null, 
   "joebrummer", 
   "I'll tell you. When you stand before Him and He says to you; \"Joe, I've loved you enough that I sent My Son to die for your sins, and that you've repeatedly rejected Him for your homosexuality.\" What will you say to Him, then?\n\n \n \n I don't believe that will ever happen. I firmly believe I am just as the creator, whoever he is, made me. I have been this way all my life. I struggled in ly youth to be straight. I realized that was suicide. Now I live my life as me....no one else, no ideals or jokes...just me. Your view of gays is so wrong it is crazy talk.....no one chooses to be gay....no one chooses this life, but we make the best of it.", 
   {}, 
   173856, 
   null, 
   1130210820.0
  ], 
  [
   173867, 
   null, 
   "daewoo", 
   "I'll tell you. When you stand before Him and He says to you; \"Joe, I've loved you enough that I sent My Son to die for your sins, and that you've repeatedly rejected Him for your homosexuality.\" What will you say to Him, then?\n\n \n \n That is a much better position than you are likely to be in, Bassman. I would imagine that god takes great offense to having his name used to promote bigotry and hate. Like many who consider themselves to be good christian crusaders, I have a funny feeling that if there is indeed a god, and a heaven, and a hell, you had better pack for warm weather.", 
   {}, 
   173856, 
   null, 
   1130211240.0
  ], 
  [
   173869, 
   null, 
   "Bassman", 
   "That is a much better position than you are likely to be in, Bassman. I would imagine that god takes great offense to having his name used to promote bigotry and hate. Like many who consider themselves to be good christian crusaders, I have a funny feeling that if there is indeed a god, and a heaven, and a hell, you had better pack for warm weather.\n\n Heh,heh,heh. Impossible! My place in heaven is guaranteed. I have a mansion waiting for me.", 
   {}, 
   173867, 
   null, 
   1130211360.0
  ], 
  [
   173870, 
   null, 
   "joebrummer", 
   "Heh,heh,heh. Impossible! My place in heaven is guaranteed. I have a mansion waiting for me.\n\n \n \n ok good boy, take your pills and go back to the room. yes, yes...of course you have a mansion waiting for....good boy...take your pills......that nice, now lay down and take a nap.", 
   {}, 
   173869, 
   null, 
   1130211480.0
  ], 
  [
   173876, 
   null, 
   "daewoo", 
   "Heh,heh,heh. Impossible! My place in heaven is guaranteed. I have a mansion waiting for me.\n\n \n Yes, because there is nothing god loves more than ignorance, hate and bigotry....right? \n \n What a freaking joke. Youa re quite possibly one of the more evil people I have ever come into contact with. Your complete and utter dismissal of all things christian is incredible. Where is your unconditional brotherly love, tolerance, etc? You have none. You are a fascist, a racist, and a bigot. You are as hate filled as any individual I have ver seen. \n \n A mansion in heaven? Yea, right. You will be burning in hell with all those others who have perfomred evil in gods name.", 
   {}, 
   173869, 
   null, 
   1130211780.0
  ], 
  [
   173878, 
   null, 
   "joebrummer", 
   "Yes, because there is nothing god loves more than ignorance, hate and bigotry....right? \n \n What a freaking joke. Youa re quite possibly one of the more evil people I have ever come into contact with. Your complete and utter dismissal of all things christian is incredible. Where is your unconditional brotherly love, tolerance, etc? You have none. You are a fascist, a racist, and a bigot. You are as hate filled as any individual I have ver seen. \n \n A mansion in heaven? Yea, right. You will be burning in hell with all those others who have perfomred evil in gods name.\n\n \n \n Whew,,,wipes sweat off head....I am glad it wasn't just me thinking that!", 
   {}, 
   173876, 
   null, 
   1130211900.0
  ], 
  [
   173880, 
   null, 
   "Freedom Fighter", 
   "Honestly people, our society has a way of picking on the out casts of the society of the time. Is it wrong, yes, should we have a higher sentence on hate crimes, no. Should we have higher sentence on all crime yes. We shouldn't teach our children that hate crimes are horrible and that any other crime is right. We need to teach our children that crime is wrong as a whole and to not be discrimitive, racist, or pedjudice. That, and what the :xcensored is it with people and worring about other's sexuality. I'm straight, I'm even a conservative, but I am passed the fact that you choose your sexuallity, i've listened to the facts, all it is, is a hormone in the brain the decides the person's sexuality, not there own decision. I listen to facts, facts show that don't chose it and even if they did, I believe our constitution says ALL MEN ARE CREATED EQUAL, and should be handled as individuals. Saying discrimination on homosexuals, is the same as raceism. Where in the Bible does it say Thou Shalt Not Be Gay? It is a time to look at FREEDOM, a freedom to not worry what race, religion, or sex you prefer. But a time to look at we are all people, and we need to stop worrying about others personal lives. Get over the fact that not everyone is like you, people are born free, and as individuals, and as individuals they have the right to choose what lifestyle they want. Once again, im a straight conservative, yes there are some outhere that believe in gay rights (after all you have the right to pursue happieness.) :)", 
   {}, 
   173859, 
   null, 
   1130212080.0
  ], 
  [
   173882, 
   null, 
   "Bassman", 
   "Yes, because there is nothing god loves more than ignorance, hate and bigotry....right? \n \n What a freaking joke. Youa re quite possibly one of the more evil people I have ever come into contact with. Your complete and utter dismissal of all things christian is incredible. Where is your unconditional brotherly love, tolerance, etc? You have none. You are a fascist, a racist, and a bigot. You are as hate filled as any individual I have ver seen. \n \n A mansion in heaven? Yea, right. You will be burning in hell with all those others who have perfomred evil in gods name.\n\n First of all, sir, your distortions about \"all things christian\" is laughable, to put it mildly. \"Tolerance?\" Tolerance is the buzzword for accepting immorality of any kind. Unconditional love doesn't mean that I don't warn people when they are in danger from a totally destructive habit or lifestyle. I will do the same thing for a junkie, a wino, an adulterer, etc. \"Racist?\" I take exception to that label!", 
   {}, 
   173876, 
   null, 
   1130212260.0
  ], 
  [
   173884, 
   null, 
   "joebrummer", 
   "First of all, sir, your distortions about \"all things christian\" is laughable, to put it mildly. \"Tolerance?\" Tolerance is the buzzword for accepting immorality of any kind. Unconditional love doesn't mean that I don't warn people when they are in danger from a totally destructive habit or lifestyle. I will do the same thing for a junkie, a wino, an adulterer, etc. \"Racist?\" I take exception to that label!\n\n \n \n And we Basaman, Are doing that for you...You have an addiction to religion...you are no longer seeing reality because of your religion....WE don't mind waring you that if you continue this lifestyle choice of your, you will self destruct.", 
   {}, 
   173882, 
   null, 
   1130212380.0
  ], 
  [
   173888, 
   null, 
   "Bassman", 
   "So my question still goes unanswered. Do you want me to give up my faith for the great god of liberalism and \"tolerance?\"", 
   {}, 
   173884, 
   null, 
   1130212620.0
  ], 
  [
   173890, 
   null, 
   "joebrummer", 
   "So my question still goes unanswered. Do you want me to give up my faith for the great god of liberalism and \"tolerance?\"\n\n Religious Addiction - Compulsive religiosity sometimes accompanies sexual addiction as the sex addict is seeking religion to lessen guilt and shame. The beginnings of compulsive religiosity may signal the onset of a period of sexual anorexia. \n http://www.articlealley.com/article_7492_35.html", 
   {}, 
   173888, 
   null, 
   1130212680.0
  ], 
  [
   173892, 
   null, 
   "joebrummer", 
   "So my question still goes unanswered. Do you want me to give up my faith for the great god of liberalism and \"tolerance?\"\n\n \n \n Ask not of others that which you are not willing to do yourself....\n \n \n Are you not asking me the opposite? Are you not asking me to give up my faith and my love?", 
   {}, 
   173888, 
   null, 
   1130212800.0
  ], 
  [
   173894, 
   null, 
   "Bassman", 
   "Ehh, nice try. My intimate life with my wife is just fine, thank you.", 
   {}, 
   173890, 
   null, 
   1130212920.0
  ], 
  [
   173897, 
   null, 
   "Bassman", 
   "Ask not of others that which you are not willing to do yourself....\n\n Let me get this straight. You'd want me to become a wishy-washy, linguini-spined liberal, huh?\n \n \n \nAre you not asking me the opposite? Are you not asking me to give up my faith and my love?\n\n No. just to understand that there are moral absoutes.", 
   {}, 
   173892, 
   null, 
   1130213100.0
  ], 
  [
   173900, 
   null, 
   "joebrummer", 
   "Let me get this straight. You'd want me to become a wishy-washy, linguini-spined liberal, huh?\n \n are you not asking me to leave me \"husband\"\n \n \n\n \n \n There are no moral absolutes! There are few absolutes period.", 
   {}, 
   173897, 
   null, 
   1130213160.0
  ], 
  [
   173906, 
   null, 
   "daewoo", 
   "First of all, sir, your distortions about \"all things christian\" is laughable, to put it mildly. \"Tolerance?\" Tolerance is the buzzword for accepting immorality of any kind. Unconditional love doesn't mean that I don't warn people when they are in danger from a totally destructive habit or lifestyle. I will do the same thing for a junkie, a wino, an adulterer, etc. \"Racist?\" I take exception to that label!\n\n \n \n Tolerance is what Jesus showed by surrounding himself with prostitutes adn sinners.\n \n Either homosexuality is a natural biological condition, in which case by arguing against homosexualtiy you are arguing that god made a mistake, OR it is a mental illness. Either way, your position regardign homosexuals and homosexuality is sinnful and evil.\n \n Racist? Lets talk about arabs for a few minutes.\n \n Personally, I hope Joe is right and your condition is a mental disorder. It is likely all that could save you from a one way ticket to the firey pit.", 
   {}, 
   173882, 
   null, 
   1130213400.0
  ], 
  [
   173908, 
   null, 
   "Steeeeve", 
   "Wow, talk about the need for diversity training. Do you say that about all sterotypes or just the ones about gays.\n \n So you believe all gays are rich and well dressed.\n You believe that all gays have a sense of decorating style.\n They are all artistic.\n All male nurses, hairdressers, and braodway dancers are gay.\n \n And the ever popular and even more stupid, all gay men like quiche.\n \n Great, any other really stupid remarks from the peanut gallery.\n\n \n Perhaps you should not jump to conclusions from my statements. Did I say I follow stereotypes of gays or anyone? I just said where I believe stereotypes come from. Are you saying that \"XXXXX eye for the straight guy\" doesn't protray an inaccurate showing of gay men?", 
   {}, 
   173702, 
   null, 
   1130213460.0
  ], 
  [
   173910, 
   null, 
   "joebrummer", 
   "Perhaps you should not jump to conclusions from my statements. Did I say I follow stereotypes of gays or anyone? I just said where I believe stereotypes come from. Are you saying that \"XXXXX eye for the straight guy\" doesn't protray an inaccurate showing of gay men?\n\n \n \n I hate the show....what does that tell you.....", 
   {}, 
   173908, 
   null, 
   1130213700.0
  ], 
  [
   173912, 
   null, 
   "Bassman", 
   "Tolerance is what Jesus showed by surrounding himself with prostitutes adn sinners.\n\n However, He did not condone their sins. When He confronted the woman caught in adultery, even though He didn't condemn her, He said \"Go and sin no more.\" And what about Zaccheus? When Zaccheus had Jesus over for dinner, what did he do? He did not continue robbing and cheating people. He repented and returned all of the money he stole.\n \n \nEither homosexuality is a natural biological condition, in which case by arguing against homosexualtiy you are arguing that god made a mistake, OR it is a mental illness. Either way, your position regardign homosexuals and homosexuality is sinnful and evil.\n\n No, it isn't. God's word makes it very clear what he thinks of homosexuality.\n \n \nRacist? Lets talk about arabs for a few minutes.\n\n Wrong again. I've stated the pattern and profile of these islamofascists.\n \n \nPersonally, I hope Joe is right and your condition is a mental disorder. It is likely all that could save you from a one way ticket to the firey pit.\n\n \n What, so I could be liberal like you?", 
   {}, 
   173906, 
   null, 
   1130213880.0
  ], 
  [
   173914, 
   null, 
   "Steeeeve", 
   "I hate the show....what does that tell you.....\n\n \n all it tells me is you don't like the show. I don't like it either. I don't even watch Bravo. good ol' CSPAN and HBO for me.", 
   {}, 
   173910, 
   null, 
   1130214060.0
  ], 
  [
   173920, 
   null, 
   "joebrummer", 
   "all it tells me is you don't like the show. I don't like it either. I don't even watch Bravo. good ol' CSPAN and HBO for me.\n\n \n \n I do not like the show because it potrays gays and little fairy decorators and I for one am not much of a dresser or a decorator.....\n \n I also don't watch tv, I gave it up.....I use to watch Bravo....Liked it.\n I really miss showtime's XXXXX as folk. That was a much more accurate picture of gay life.", 
   {}, 
   173914, 
   null, 
   1130214360.0
  ], 
  [
   173927, 
   null, 
   "JakeCJB", 
   "Ah, heavenly mansions for all the backward homophobes are now being predicted. I guess the meek really will inherit the Earth.", 
   {}, 
   173920, 
   null, 
   1130214720.0
  ], 
  [
   173928, 
   null, 
   "emoreno2292", 
   "Honestly people, our society has a way of picking on the out casts of the society of the time. Is it wrong, yes, should we have a higher sentence on hate crimes, no. Should we have higher sentence on all crime yes. We shouldn't teach our children that hate crimes are horrible and that any other crime is right. We need to teach our children that crime is wrong as a whole and to not be discrimitive, racist, or pedjudice. That, and what the :xcensored is it with people and worring about other's sexuality. I'm straight, I'm even a conservative, but I am passed the fact that you choose your sexuallity, i've listened to the facts, all it is, is a hormone in the brain the decides the person's sexuality, not there own decision. I listen to facts, facts show that don't chose it and even if they did, I believe our constitution says ALL MEN ARE CREATED EQUAL, and should be handled as individuals. Saying discrimination on homosexuals, is the same as raceism. Where in the Bible does it say Thou Shalt Not Be Gay? It is a time to look at FREEDOM, a freedom to not worry what race, religion, or sex you prefer. But a time to look at we are all people, and we need to stop worrying about others personal lives. Get over the fact that not everyone is like you, people are born free, and as individuals, and as individuals they have the right to choose what lifestyle they want. Once again, im a straight conservative, yes there are some outhere that believe in gay rights (after all you have the right to pursue happieness.) :)\n\n Freedom fighter, I love you and want to have your babies.", 
   {}, 
   173880, 
   null, 
   1130214780.0
  ], 
  [
   173931, 
   null, 
   "emoreno2292", 
   "OK you have an unscriptural, pantheistic view of God, which is contrary to the true nature of God. And no, I don't need any psychobabble to tell me otherwise.\n\n Well that comes as no shock considering how closed-minded you are. You're just unwilling to take anybody else's opinion because you're too afraid to. You don't want to listen to anyone who disagrees with you, because in your own words, you say that it will corrupt your heart. Great cover, bassman. Now go hide behind your ignorance, hide behind your bible, and don't look back. We won't wait up.", 
   {}, 
   173848, 
   null, 
   1130215080.0
  ], 
  [
   173933, 
   null, 
   "jyoshu", 
   "Tolerance is what Jesus showed by surrounding himself with prostitutes adn sinners.\n\n \n What you fail to point out however, is that after He freed the adulteress (a sinner, as you say), He told her to \"go and sin no more.\" Sure, He had tolerance, but that doesn't mean He approved of the way they were living their lives. He was tolerant of them as people, but not their sin.\n \n \nEither homosexuality is a natural biological condition, in which case by arguing against homosexualtiy you are arguing that god made a mistake\n\n \n From a religious standpoint, it doesn't matter whether or not it's a natural biological condition. That has NEVER mattered from a religious standpoint, nor should it. There are many natural biological things that happen in nature that aren't appropriate behavior. It may feel perfectly natural for a married man who is tired of his loving wife to go out and cheat on her. Heck, he could even justify it by saying he's \"oriented\" toward that--an orientation. But it doesn't make it right.\n \n Regarding your \"God made a mistake\" argument: that's an issue that could be made of anything or anyone in life that's dealing with a problem or inability. Handicapped people, for example. It's a very involved theological and philosophical issue that is too off-topic for this thread.", 
   {}, 
   173906, 
   null, 
   1130215200.0
  ], 
  [
   173934, 
   null, 
   "jitobear", 
   "\n Wrong again. I've stated the pattern and profile of these islamofascists.\n \n\n \n That's right. Only American Christain heterosexuals get to be facist!", 
   {}, 
   173912, 
   null, 
   1130215200.0
  ], 
  [
   173938, 
   null, 
   "Steeeeve", 
   "What you fail to point out however, is that after He freed the adulteress (a sinner, as you say), He told her to \"go and sin no more.\" Sure, He had tolerance, but that doesn't mean He approved of the way they were living their lives. He was tolerant of them as people, but not their sin\n I don't even know if you can go that far. Jesus was not very tolerant on how things should be done. There is only ONE way according to Jesus. Thats not very tolerant of other views.", 
   {}, 
   173934, 
   null, 
   1130215980.0
  ], 
  [
   173940, 
   null, 
   "daewoo", 
   "[QUOTE=Bassman]However, He did not condone their sins. When He confronted the woman caught in adultery, even though He didn't condemn her, He said \"Go and sin no more.\" And what about Zaccheus? When Zaccheus had Jesus over for dinner, what did he do? He did not continue robbing and cheating people. He repented and returned all of the money he stole.\n \n No, it isn't. God's word makes it very clear what he thinks of homosexuality.[/qoute]\n \n And where exactly are you finding the word of god? In the bible? Are you some kind of fool? There is a great, all powerful, all seeing god, and that piece of contradictory garbage is the best he could do for carrying his word? Are you on crack?\n \n This is why I generally consider bible thumpers to be ignorant, arrogant fools. Assumign that they are correct, and there is an infinite, omnipotent god out there, to believe for even one second that creature with a finite consciousness, like mankind, is capable of even the simplest understanding of that creature or its wishes expresses extreme arrogance and ignorance. To believe that you could catch even the barest essence of such a creature on paper in a few hundred pages is lunacy.\n \n My personal observation regarding religion is this: Generally, the more affluent a person becomes, the less religious they tend to be. I think, after much study regardign the issue, that religon is still doing the same job it was designed to do, namely keeping the poor and ignorant poor and ignorant. \n \n Sure, Bassman, you may be tryign to raise a family on a truckdrivers wages, while your government is taxing the bejesus out of you. But thats ok, just keep working your little heart out for starvation wages while others get fat off your labors because after all, there is a MANSION waiting for you in heaven. I mean, how stupid does a person have to be to believe that? \n \n What it boils down to is \"You will be paid for your labor after you are dead and out of the jurisdiction of any court, until then, let people walk all over you, and blame other races and the gays for the fact you live in squalor\". \n \n I can certainly understand why christians do not like muslims. While the christian god apparently demands that you just take it up the butt (which is why I seriously doubt he has a problem with homosexualtiy), don't make waves, do what you are told, and give to caesar what is caesars, the muslim god says that if a man wrongs you, you go get that SOB. Send him upstairs for an interview. \n \n \nWhat, so I could be liberal like you?\n\n \n I would imagine that being the documented fascist that you are, I do seem pretty liberal. Thats OK by me. I am probably pretty liberal by mussolinis standards as well.", 
   {}, 
   173912, 
   null, 
   1130217360.0
  ], 
  [
   173944, 
   null, 
   "daewoo", 
   "From a religious standpoint, it doesn't matter whether or not it's a natural biological condition. That has NEVER mattered from a religious standpoint, nor should it. There are many natural biological things that happen in nature that aren't appropriate behavior. It may feel perfectly natural for a married man who is tired of his loving wife to go out and cheat on her. Heck, he could even justify it by saying he's \"oriented\" toward that--an orientation. But it doesn't make it right.\n \n Regarding your \"God made a mistake\" argument: that's an issue that could be made of anything or anyone in life that's dealing with a problem or inability. Handicapped people, for example. It's a very involved theological and philosophical issue that is too off-topic for this thread.\n\n \n I ahve never heard anybody condemn anybody who was merely hanidicapped to hell. In arguing that homosexuality is a sin, you are arguing that your god made a mistake, assumign that homosexuality has natural causes. Your parralel between a homosexual person and a cheating husband is rediculous. In one case you are talkign about an individual who is making amoral choice, in the other you are talking about an individual acting on feeling dictated by their biology. Two entirely different things. \n \n The issue is not very theological or philisophical. If god prefers that peopel not be homosexuals, yet he is creating people who are naturally homosexual, he made a mistake. \n \n This leads us to two distinct possibilities:\n \n 1. Your \"god\" is a delusion which you have embraced to help you deal with the realities of life and your personal shortcomings.\n \n 2. God has no problem with homosexuals. Obviously if he did, he would quit making them. If homosexuality is indeed a natural condition, your condemnation of homosexuals is akin to picking out a group by eye color, or hair color, and announcing that they are sinners. \n \n In either case, the ignorance being shown by christians in this is mind boggling.", 
   {}, 
   173933, 
   null, 
   1130218140.0
  ], 
  [
   173967, 
   null, 
   "Matthew S", 
   "I ahve never heard anybody condemn anybody who was merely hanidicapped to hell. In arguing that homosexuality is a sin, you are arguing that your god made a mistake, assumign that homosexuality has natural causes. Your parralel between a homosexual person and a cheating husband is rediculous. In one case you are talkign about an individual who is making amoral choice, in the other you are talking about an individual acting on feeling dictated by their biology. Two entirely different things. \n \n The issue is not very theological or philisophical. If god prefers that peopel not be homosexuals, yet he is creating people who are naturally homosexual, he made a mistake. \n \n This leads us to two distinct possibilities:\n \n 1. Your \"god\" is a delusion which you have embraced to help you deal with the realities of life and your personal shortcomings.\n \n 2. God has no problem with homosexuals. Obviously if he did, he would quit making them. If homosexuality is indeed a natural condition, your condemnation of homosexuals is akin to picking out a group by eye color, or hair color, and announcing that they are sinners. \n \n In either case, the ignorance being shown by christians in this is mind boggling.\n\n \n \n \n emoticon_xgood emoticon_xlove Very well said :)", 
   {}, 
   173944, 
   null, 
   1130242500.0
  ], 
  [
   174021, 
   null, 
   "jyoshu", 
   "This leads us to two distinct possibilities:\n \n 1. Your \"god\" is a delusion which you have embraced to help you deal with the realities of life and your personal shortcomings.\n\n \n Or maybe He is simply real and does help with the realities of life and personal shortcomings. That doesn't mean He's a delusion. \n \n \n2. God has no problem with homosexuals. Obviously if he did, he would quit making them.\n\n \n Not \"obviously\" at all. He makes some people prone to alcoholism too. Do you think He has no problem with people becoming alcoholics? He hasn't \"quit making\" them. Your black-and-white-only view of God and people with problems has the faulty premise that a.) God has to be conformed to your box you've put Him in, and b.) that God couldn't possibly have other reasons for making people with issues that make them prone to sin in certain areas. \n \n \nIf homosexuality is indeed a natural condition, your condemnation of homosexuals is akin to picking out a group by eye color, or hair color, and announcing that they are sinners. \n\n \n No, natural does not automatically equal benign. It's completely natural for some animal species to engage in cannibalism, but that doesn't make it ok. This idea that natural is always good is ridiculous.\n \n \nIn either case, the ignorance being shown by christians in this is mind boggling.\n\n \n But not as bad as the belligerence shown by some here such as yourself.", 
   {}, 
   173944, 
   null, 
   1130254320.0
  ], 
  [
   174022, 
   null, 
   "Steeeeve", 
   "How can you say God made a mistake if he makes people naturally homosexuals? God allows for free will and we are all born with sin. You can be born an alcoholic too but it doesn't mean you must be one.\n \n You just simply beg the question in your comments and assume it all to be a mistake.", 
   {}, 
   173967, 
   null, 
   1130254440.0
  ], 
  [
   174026, 
   null, 
   "jyoshu", 
   "How can you say God made a mistake if he makes people naturally homosexuals? God allows for free will and we are all born with sin. You can be born an alcoholic too but it doesn't mean you must be one.\n\n \n I didn't say He made a \"mistake.\"\n \n And sure you can be born an alcoholic and not drink, just as you could maybe be born gay and not have gay sex.", 
   {}, 
   174022, 
   null, 
   1130255220.0
  ], 
  [
   174028, 
   null, 
   "emoreno2292", 
   "I didn't say He made a \"mistake.\"\n \n And sure you can be born an alcoholic and not drink, just as you could maybe be born gay and not have gay sex.\n\n Easy for you to say.", 
   {}, 
   174026, 
   null, 
   1130255340.0
  ], 
  [
   174032, 
   null, 
   "Steeeeve", 
   "I didn't say He made a \"mistake.\"\n \n And sure you can be born an alcoholic and not drink, just as you could maybe be born gay and not have gay sex.\n\n I was referring to Daewoo you just happened to post 2min before me", 
   {}, 
   174026, 
   null, 
   1130256120.0
  ], 
  [
   174051, 
   null, 
   "jyoshu", 
   "I was referring to Daewoo you just happened to post 2min before me\n\n \n Oh, sorry. emoticon_xangel", 
   {}, 
   174032, 
   null, 
   1130259540.0
  ], 
  [
   174053, 
   null, 
   "jitobear", 
   "I didn't say He made a \"mistake.\"\n \n And sure you can be born an alcoholic and not drink, just as you could maybe be born gay and not have gay sex.\n\n \n Which means he leaves love and intimacy to a select group only - which makes him a nasty XXXXX. How could you love something that gamey? That expects an entire group of people should deny themselves the one thing humans most crave - love and intimacy.", 
   {}, 
   174026, 
   null, 
   1130259780.0
  ], 
  [
   174056, 
   null, 
   "jyoshu", 
   "Which means he leaves love and intimacy to a select group only - which makes him a nasty XXXXX. How could you love something that gamey? That expects an entire group of people should deny themselves the one thing humans most crave - love and intimacy.\n\n \n So you'd also say he's a XXXXX for not allowing polygamists to have love and intimacy their way? How about people who insist on love and intimacy with underage kids? They could make the same argument.", 
   {}, 
   174053, 
   null, 
   1130260020.0
  ], 
  [
   174057, 
   null, 
   "Eddie", 
   "So you'd also say he's a XXXXX for not allowing polygamists to have love and intimacy their way? How about people who insist on love and intimacy with underage kids? They could make the same argument.\n\n \n No, because children are not considered to be able to consent to sex. Your comparison is invalid.", 
   {}, 
   174056, 
   null, 
   1130260260.0
  ], 
  [
   174064, 
   null, 
   "jyoshu", 
   "No, because children are not considered to be able to consent to sex. Your comparison is invalid.\n\n \n I said \"underage.\" It's illegal for someone to have sex with a 17 year old, but completely legal with an 18 year old. Some 17 year olds are probably MORE mature than 18 year olds. So it's certainly not an invalid comparison.", 
   {}, 
   174057, 
   null, 
   1130261520.0
  ], 
  [
   174066, 
   null, 
   "Eddie", 
   "I said \"underage.\" It's illegal for someone to have sex with a 17 year old, but completely legal with an 18 year old. Some 17 year olds are probably MORE mature than 18 year olds. So it's certainly not an invalid comparison.\n\n \n In certain countries with crazy legislation based on archaic ideas of morality, yes... ;)", 
   {}, 
   174064, 
   null, 
   1130261700.0
  ], 
  [
   174097, 
   null, 
   "jitobear", 
   "So you'd also say he's a XXXXX for not allowing polygamists to have love and intimacy their way? How about people who insist on love and intimacy with underage kids? They could make the same argument.\n\n \n As long as everyone is a consenting adult I have no objection to polygamy. However I am sick and tired of psuedo polite posters claiming they aren't anti-gay but who can not stop comparing two consenting adults to predators! \n \n And what any of that has to do with my thinking your God is gamey I am not sure. There was plenty of poligamy in my last Bible read, not to mention incest and quite likely child brides in their culture.", 
   {}, 
   174056, 
   null, 
   1130266440.0
  ], 
  [
   174103, 
   null, 
   "jyoshu", 
   "As long as everyone is a consenting adult I have no objection to polygamy. However I am sick and tired of psuedo polite posters claiming they aren't anti-gay but who can not stop comparing two consenting adults to predators! \n \n And what any of that has to do with my thinking your God is gamey I am not sure. There was plenty of poligamy in my last Bible read, not to mention incest and quite likely child brides in their culture.\n\n \n There's a reason it's often brought up in the context of gay rights: it's a very analogous issue. Many of the same arguements that are made for gay rights could also be made for consentual polygamy.", 
   {}, 
   174097, 
   null, 
   1130267520.0
  ], 
  [
   174137, 
   null, 
   "Matthew S", 
   "There's a reason it's often brought up in the context of gay rights: it's a very analogous issue. Many of the same arguements that are made for gay rights could also be made for consentual polygamy.\n\n \n Agreed. Then again what is wrong with Polygamy? People should be able to live in any family structure they want and be legally recognized. If they want 2 husbands or 4 wives or a husband and a wife, they should be allowed. For all you evangelicals out there Polygamy is the biblical norm so if it was allright for Abraham and Jacob it should be allright today. After all I have seen were your evangelicals have written that the bible is the word of God so since Polygamy is the biblical norm, one man one woman combo is anti biblical and anti God.", 
   {}, 
   174103, 
   null, 
   1130274180.0
  ], 
  [
   174151, 
   null, 
   "tonybrown74", 
   "I said \"underage.\" It's illegal for someone to have sex with a 17 year old, but completely legal with an 18 year old. Some 17 year olds are probably MORE mature than 18 year olds. So it's certainly not an invalid comparison.\n\n \n \n Too much of a generalization. The age requirement for marriage is not universal in America.\n \n And as for polygamy, your bible is full of references to god's supposed approval of that. So being against polygamy based on biblical morality seems contradictory.", 
   {}, 
   174064, 
   null, 
   1130276040.0
  ], 
  [
   174153, 
   null, 
   "tonybrown74", 
   "There's a reason it's often brought up in the context of gay rights: it's a very analogous issue. Many of the same arguements that are made for gay rights could also be made for consentual polygamy.\n\n \n Actually, there isn't. Sex of partner does not compare to number of partners. \n \n As for age of consent issues, that has to relate to informed consent. It is believed that there is some correlation between age and knowledge, at least in a basic sense.\n \n The issue of same sex marriage is a patriarchal issue (IMO). If the sexes are equal under the law, there is no logical reason for restricting marriage based on the gender of the participants.", 
   {}, 
   174103, 
   null, 
   1130276520.0
  ], 
  [
   174169, 
   null, 
   "JakeCJB", 
   "So you'd also say he's a XXXXX for not allowing polygamists to have love and intimacy their way? How about people who insist on love and intimacy with underage kids? They could make the same argument.\n\n \n No, this is not the same argument. For a gay person, being gay is the only way he or she express sexual love and intimacy. Same-sex attraction is that person's basic sexuality. Polygamists can be sexually attracted to women, even if the women are not a group of many wives. With underage kids, the issue of consent comes up.", 
   {}, 
   174056, 
   null, 
   1130281020.0
  ], 
  [
   174172, 
   null, 
   "JakeCJB", 
   "There's a reason it's often brought up in the context of gay rights: it's a very analogous issue. Many of the same arguements that are made for gay rights could also be made for consentual polygamy.\n\n \n Those arguments are so extremely broad, they would not uniquely apply to gays, but also to straights.", 
   {}, 
   174103, 
   null, 
   1130281260.0
  ], 
  [
   174255, 
   null, 
   "Freedom Fighter", 
   "I am religious and I havent read the Bible cover to cover so I have one question to the people who are using God and the Bible. Where in it does it say being gay is a sin? Last time I checked the Bible, given I haven't read it's entirety, it lists 10 commandments, none involve it being wrong to be gay. It says though you should have tolerance for others and to love your neighbor as yourself. Personally I don't think it is wrong to be gay since I haven't found enough proof proving it to be wrong. Show me where it directly says \"Thou Shalt Not Be Gay\". I might believe you. Also we live in a free country, not everyone has the same ideals, so what is wrong with being different. In this world we live in today people hate each other and have no love towards anyone different, do you honestly think people want to put themselves at risk because they choose to be gay? No, they do so because they are happy that way, and we have the rights of life liberty and the pursuit happiness, therefore making it right for them to live a life (birth to death) liberty (the right for them to chose what they feel right on there own) and the pursuit of happiness (to be able to do whatever in their power to be happy). 90% of you will look at me as a twisted little no spined gay liberal, I am not. Im straight and conservative, but as a conservitive I feel that indivdiual rights should be granted, and our constitution and Decleration Of Independence should be interperted correctly.", 
   {}, 
   174172, 
   null, 
   1130295000.0
  ], 
  [
   174271, 
   null, 
   "joebrummer", 
   "Those arguments are so extremely broad, they would not uniquely apply to gays, but also to straights.\n\n \n \n and you are right in your guess.\n \n \n http://www.365gay.com/newscon05/10/102505texas.htm", 
   {}, 
   174172, 
   null, 
   1130296260.0
  ], 
  [
   174331, 
   null, 
   "Steeeeve", 
   "Agreed. Then again what is wrong with Polygamy? People should be able to live in any family structure they want and be legally recognized. If they want 2 husbands or 4 wives or a husband and a wife, they should be allowed. For all you evangelicals out there Polygamy is the biblical norm so if it was allright for Abraham and Jacob it should be allright today. After all I have seen were your evangelicals have written that the bible is the word of God so since Polygamy is the biblical norm, one man one woman combo is anti biblical and anti God.\n\n \n This would be great...I could see the tax returns now \n \"Married filing jointly with 65 wives\" \n \n Poor IRS.", 
   {}, 
   174137, 
   null, 
   1130302200.0
  ], 
  [
   174354, 
   null, 
   "jitobear", 
   "This would be great...I could see the tax returns now \n \"Married filing jointly with 65 wives\" \n \n Poor IRS.\n\n \n Personally I want to meet the 65 women who find any guy so great that they would all be willing to share him.", 
   {}, 
   174331, 
   null, 
   1130307240.0
  ], 
  [
   174357, 
   null, 
   "daewoo", 
   "Personally I want to meet the 65 women who find any guy so great that they would all be willing to share him.\n\n \n Personally, I would like to meet the guy. He would have to be one hell of a good guy.", 
   {}, 
   174354, 
   null, 
   1130310600.0
  ], 
  [
   174404, 
   null, 
   "Steeeeve", 
   "You would think the economics folks here would be all over pologomy. You know how much it would cost to allow this?", 
   {}, 
   174357, 
   null, 
   1130336520.0
  ], 
  [
   174407, 
   null, 
   "Eddie", 
   "You would think the economics folks here would be all over pologomy. You know how much it would cost to allow this?\n\n \n What would it cost? (Honest question since I`m not familiar with the econmic benefits of marriage in the US)", 
   {}, 
   174404, 
   null, 
   1130336700.0
  ], 
  [
   174414, 
   null, 
   "Steeeeve", 
   "What would it cost? (Honest question since I`m not familiar with the econmic benefits of marriage in the US)\n\n \n well, JUST FROM A TAX STANDPOINT (since taxes aren't everything), you would have to redefine just about every tax code in order to make it allowable to 65 people. If they all own their own business you would have schedule C's all over the place. And then probably a problem with Tax sheltering because it would be hard to track all the money flows from one to another related party. I can get into more examples but you would have to redo the tax code completely and probably take out every benefit a married couple might have....", 
   {}, 
   174407, 
   null, 
   1130337480.0
  ], 
  [
   174435, 
   null, 
   "jyoshu", 
   "well, JUST FROM A TAX STANDPOINT (since taxes aren't everything), you would have to redefine just about every tax code \n\n \n I suspect there are some tax codes that would have to be changed with same-sex marriage too. It would not surprise me if some specificed 'husband and wife' or something.", 
   {}, 
   174414, 
   null, 
   1130339340.0
  ], 
  [
   174544, 
   null, 
   "Steeeeve", 
   "I suspect there are some tax codes that would have to be changed with same-sex marriage too. It would not surprise me if some specificed 'husband and wife' or something.\n\n Well, you can only be married and filing jointly if you are of the same sex. Section 6013 is what deals with this.", 
   {}, 
   174435, 
   null, 
   1130353800.0
  ], 
  [
   174561, 
   null, 
   "jitobear", 
   "Personally, I would like to meet the guy. He would have to be one hell of a good guy.\n\n \n Maybe if he were REALLY wealthy. I may be convinced to share Bill Gates with 65 other women. :p", 
   {}, 
   174357, 
   null, 
   1130357520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Matt Shepard Died 7 Years Ago Today", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6610, 
  "discussion_files": [
   [
    "32077.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-print.html"
   ], 
   [
    "32078.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-15-print.html"
   ], 
   [
    "32079.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-13-print.html"
   ], 
   [
    "32080.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-12-print.html"
   ], 
   [
    "32081.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-10-print.html"
   ], 
   [
    "32082.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-8-print.html"
   ], 
   [
    "32083.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-6-print.html"
   ], 
   [
    "32084.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-4-print.html"
   ], 
   [
    "32085.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-7-print.html"
   ], 
   [
    "32086.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-9-print.html"
   ], 
   [
    "32087.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-5-print.html"
   ], 
   [
    "32088.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-14-print.html"
   ], 
   [
    "32089.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-11-print.html"
   ], 
   [
    "32090.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-3-print.html"
   ], 
   [
    "32091.html", 
    "http://www.4forums.com/political/gay-rights-debates/6610-matt-shepard-died-7-years-ago-today-2-print.html"
   ]
  ], 
  "identifier": 6610
 }
]