[
 [
  [
   170944, 
   null, 
   "gamehuis", 
   "http://www.guardian.co.uk/israel/Story/0,2763,1112442,00.html\n \n If this were to have happened in Germany, the cries of 'racist' and 'Nazi' would have been overwhelming, but when it comes to Israel the silence is deafening...", 
   {
    "post_info": {
     "post_title": "Keeping the Master Race pure"
    }
   }, 
   null, 
   null, 
   1129370400.0
  ], 
  [
   170966, 
   null, 
   "Wez", 
   "I can't really see anyone defending this.\n \n -Wez", 
   {}, 
   170944, 
   null, 
   1129378020.0
  ], 
  [
   171004, 
   null, 
   "daewoo", 
   "While certainly indefensible, I really don't think that anybody is likely to be surprised by this. Israels immigration, voting, marriage and even real estate policies are all openly racist. Howmany times have we heard israeli offcials claim that the biggest problem israel faces is the fact that with current trends, arabs will outnumber jews in israel within 20 years?", 
   {}, 
   170966, 
   null, 
   1129393500.0
  ], 
  [
   171018, 
   null, 
   "georged", 
   "No surprise. Another pathetic example of hiding under the US military wing and the type of selective democracy the US approves of in the ME.", 
   {}, 
   171004, 
   null, 
   1129395240.0
  ], 
  [
   171074, 
   null, 
   "Ooaman", 
   "I think I can understand the \"No-Sex\" part of it. If they are Isreali, they would more than likely prefer to keep all relations within their faith. (The way most people would usually prefer to have in a married/sexual relationship.)\n \n As for the rest, that could just be what happens when a people has been persecuted for too long. That becomes reflected onto others.\n \n But exactly what part of that report are you guys posting on?", 
   {}, 
   171018, 
   null, 
   1129399980.0
  ], 
  [
   171081, 
   null, 
   "georged", 
   "\n \n But exactly what part of that report are you guys posting on?\n\n \n For me, in a reformed orthodox US Jewish household:\n \n ~Analysts say there is much division within Israeli society over immigration and status, although the conflict with the Palestinians has given it an appearance of unity. Recent immigrants such as Russians and Ethiopians are disliked by older immigrants, and there is much resentment among secular Israelis at the privileges given to ultra-orthodox Jews. The foreign workers are at the bottom of the pile.~\n \n I view those circumstances as similar to the US direction of current administration favoring fundamentalist Christian morality and attempting to legislate same while dismantling states rights. US money goes to Israeli political control, and in my experiences most ultra-orthodox Jews are as racially prejudiced as any evangelical Christian. We (US) are providing the money for racial discrimination and ongoing military aggression by Israel.", 
   {}, 
   171074, 
   null, 
   1129401360.0
  ], 
  [
   171083, 
   null, 
   "lord tammerlain", 
   "I think I can understand the \"No-Sex\" part of it. If they are Isreali, they would more than likely prefer to keep all relations within their faith. (The way most people would usually prefer to have in a married/sexual relationship.)\n \n As for the rest, that could just be what happens when a people has been persecuted for too long. That becomes reflected onto others.\n \n But exactly what part of that report are you guys posting on?\n\n \n Imagine if a law was created in the US again forbiding Africans from having sex with white women to preserve the \"race\" and purity of white women.", 
   {}, 
   171074, 
   null, 
   1129401600.0
  ], 
  [
   171087, 
   null, 
   "georged", 
   "Imagine if a law was created in the US again forbiding Africans from having sex with white women to preserve the \"race\" and purity of white women.\n\n \n It was an unwritten US law in US Southern states until the 1950s.", 
   {}, 
   171083, 
   null, 
   1129402260.0
  ], 
  [
   171098, 
   null, 
   "daewoo", 
   "Imagine if a law was created in the US again forbiding Africans from having sex with white women to preserve the \"race\" and purity of white women.\n\n \n We used to have such laws. We have since evolved as a society. Maybe the isralis should try the same.", 
   {}, 
   171083, 
   null, 
   1129406520.0
  ], 
  [
   171717, 
   null, 
   "Tastyfish", 
   "The labourers are also forbidden from engaging in any religious or political activity. The contract states that offenders will be sent back to China at their own expense. \n Or this? Going to have to try hard to come up with some suitable explaination here, though I expect its more a way of getting rid of illegal immigrant workers without having them make a fuss rather than a general practice.", 
   {}, 
   171098, 
   null, 
   1129580880.0
  ], 
  [
   171747, 
   null, 
   "Ooaman", 
   "Imagine if a law was created in the US again forbiding Africans from having sex with white women to preserve the \"race\" and purity of white women.\n\n I think there is some of a difference. What you are refering to is a decision bassed upon race. I think what the article is based primarily on is religion. Everything else can arguably be bassed upon race but the \"No Sex\" seems to be bassed more on religion. Unless there was something between the lines that I missed.", 
   {}, 
   171083, 
   null, 
   1129584120.0
  ], 
  [
   171761, 
   null, 
   "Jo Bennett", 
   "Given that most Jews regard Jew as both a racial and religious descriptor (also the opinion of the law in this country, where Jews, but not Muslims, are covered by race crime legislation) it IS a racial issue. The nature of the Israeli state is that it is based on racial conflict, on having a Jewish state, both racially and to a lesser extent religiously, and as far as possible keeping it that way. I wouldn't go so far as to say that it is a question of racial supremacy, more a latent fear produced by the aftermath of the holocaust, with the perhaps understandable idea that Jews can only ever be safe in a state that they control. I don't agree with it but given the holocaust and the experience of Jews over the last millennia or so, it's hardly surprising.", 
   {}, 
   171747, 
   null, 
   1129585860.0
  ], 
  [
   171773, 
   null, 
   "daewoo", 
   "I think there is some of a difference. What you are refering to is a decision bassed upon race. I think what the article is based primarily on is religion. Everything else can arguably be bassed upon race but the \"No Sex\" seems to be bassed more on religion. Unless there was something between the lines that I missed.\n\n \n since prostitution is one of the largest service industries in Israel, I doubt that religous or moral implications are the issue.", 
   {}, 
   171747, 
   null, 
   1129589340.0
  ], 
  [
   172241, 
   null, 
   "Gator", 
   "http://www.guardian.co.uk/israel/Story/0,2763,1112442,00.html\n \n If this were to have happened in Germany, the cries of 'racist' and 'Nazi' would have been overwhelming, but when it comes to Israel the silence is deafening...\n\n 1) This report in the Guardian was written by Conal Urquhart back in 2003. Did you even bother to corroborate the writer's account, or do you simply accept the left-leaning press as gospel truth?\n \n 2) Your invoking the Germans for comparison does not serve you well, since the current challenge in European labor markets is no small matter. Do you imagine that no German employer ever ran afoul of labor laws, considering the masses of non-Germans who reside in that country to fill out the shrinking domestic work force? Are you aware that millions of workers in Germany are not even citizens, though many were born there and have lived there for decades? Given your outspoken feelings about a single Israeli employer--an employer the Guardian writer neglects to even name--your silence on Germany's disposition of non-German residents is, shall we say, deafening. \n \n And you say you live in the Netherlands, yet you're curiously silent on the Univ of Utrecht study released just weeks ago that shows widespread prejudice in the building industry against job applicants with Moroccan- or Arabic-sounding names. No doubt the discrimination by Dutch employers is justified by the foreigners' poor adaptation to Dutch values, customs, and employment culture. As you busy yourself criticizing an employment contract in Israel, you might also do well to consider the problem you have at home with your own guest worker program and the increased crime, social decay, and disunity that derives from your country's failure to integrate even third-generation immigrants. \n \n 3) With the Guardian as your source, no surprise you're unaware that all is not silent, that worker rights organizations like Kav LaOved are having some success in the Israeli courts redressing the exploitation of guest workers. Nor does the Guardian make clear that there are about 25 Chinese employment agencies working in Israel, and that these Chinese agencies recruit the Chinese workers and contract with them in China, after which they are brought to Israel where the Chinese agency maintains daily contact with them. Have you read the contract the workers sign before leaving China?\n \n In most cases the Israeli employer gives the workers' pay to the Chinese agency. A case study shows that the workers generally cannot withdraw their money from the bank accounts where their pay was deposited by the company, because their passports (required by the bank as ID) are held by the Chinese employment agency. The Chinese agents take the workers to the bank on payday, hand them their passports for the bank transaction, and then take back both the passports and the money. The Chinese Embassy offers no protection to the workers, but instead threatens legal prosecution in China action against workers who insist on their rights, thereby impeding China's economic growth. \n \n 4) The exploitation of immigrant workers is perhaps nearly as widespread as the immigrants themselves, from agricultural laborers in Florida or California to the garment industry sweatshops in NYC. And don't think Amsterdam is immune, as your local capitalists take advantage of immigrants from the Mediterranean, Africa, and the Caribbean, who are then concentrated in old central areas or shoddy public housing on the urban fringe.\n \n Considering the universal plight of migrant workers, including the moderate Dutch failure to assimilate permanent guests, what to speak of the dire conditions of near-slavery in Mideast states like Sudan and Saudi Arabia, one might wonder what compelled you to single out Israel for special mention, even citing a 2-year old newspaper article suffering from half-truths and omissions.", 
   {}, 
   170944, 
   null, 
   1129747800.0
  ], 
  [
   172247, 
   null, 
   "gamehuis", 
   "1) This report in the Guardian was written by Conal Urquhart back in 2003. Did you even bother to corroborate the writer's account, or do you simply accept the left-leaning press as gospel truth?\n \n 2) Your invoking the Germans for comparison does not serve you well, since the current challenge in European labor markets is no small matter. Do you imagine that no German employer ever ran afoul of labor laws, considering the masses of non-Germans who reside in that country to fill out the shrinking domestic work force? Are you aware that millions of workers in Germany are not even citizens, though many were born there and have lived there for decades? Given your outspoken feelings about a single Israeli employer--an employer the Guardian writer neglects to even name--your silence on Germany's disposition of non-German residents is, shall we say, deafening. \n\n What does the German labour market have to do with anything? The story isn't about immigrants that work, but rather about immigrants that aren't allowed to have sex with the natives.\n \n \nAnd you say you live in the Netherlands, yet you're curiously silent on the Univ of Utrecht study released just weeks ago that shows widespread prejudice in the building industry against job applicants with Moroccan- or Arabic-sounding names. No doubt the discrimination by Dutch employers is justified by the foreigners' poor adaptation to Dutch values, customs, and employment culture. As you busy yourself criticizing an employment contract in Israel, you might also do well to consider the problem you have at home with your own guest worker program and the increased crime, social decay, and disunity that derives from your country's failure to integrate even third-generation immigrants. \n\n The only large groups of third generation immigrants that we have are from Indonesia or Turkey and contrary to your claims, most of them do just fine.\n Naturally the discrimination against people on the basis of the way their name sounds is deplorable, but IMO the 'no sex' thing is a far worse case.", 
   {}, 
   172241, 
   null, 
   1129748820.0
  ], 
  [
   172273, 
   null, 
   "Gator", 
   "Israels immigration, voting, marriage and even real estate policies are all openly racist.\nWell this is an improvement from your earlier bigoted pronouncement that 'the Jews are extremely racist people.' The brush doesn't get any broader than that. So I commend you fnow for uttering a somewhat narrower prejudice. By confining your remark to Israel's policies--rather than to 'the Jews'--you have shown some progress in how to apply the 'racist' label.\n \n Of course it still remains for you to credibly substantiate your assertion. Where, for example, is the racism in Israel's voting policies? The electoral system is based on nationwide proportional representation. Any Israeli who is at least 18 years old can vote. Anyone who is at least 21 years old can be elected. Arab parliament members have been seated in every Knesset, including the First Knesset in 1948. So where exactly do you find racist voting policies?\n \n \n \nHow many times have we heard israeli offcials claim that the biggest problem israel faces is the fact that with current trends, arabs will outnumber jews in israel within 20 years?\n'We'? Uh, I never heard such thing from any official, and I doubt you did either. The demographic trend in Israel shows a Jewish majority continuing well beyond two decades. The math is not hard. According to Israeli census figures, the current population of Israel is 6.8 million, of which roughly 80% are Jewish and 20% non-Jewish (mostly Arab). What sort of Israeli-Arab birth rate or immigration scenario do you imagine? If you put on your thinking cap you might realize that if Israeli Arabs alone could achieve a majority in 20 years, then the PA wouldn't be so obsessed in demanding that refugees be given the right to return to Israel. They could simply bide their time a while longer and then eliminate the Jewish state via the electoral process. But in fact the Arab-Israelis simply don't have the numbers to achieve what you think you heard. \n \n What I suspect you meant to say is that if Israel is replaced with a single binational state between the Jordan River and Mediterranean Sea--that is, if you add the Arab population of the West Bank, Gaza Strip, and E. Jerusalem together with the Arabs citizens of Israel--then yes, you would soon have an Arab majority. But that's a big IF, since Israel has no intention of going down that binational path. Indeed, that was the point of Sharon's disengagement from Gaza.. Remember Barak's campaign slogan for separation... \"Them there, us here.\"", 
   {}, 
   171004, 
   null, 
   1129759380.0
  ], 
  [
   172304, 
   null, 
   "Gator", 
   "Imagine if a law was created in the US again forbiding Africans from having sex with white women to preserve the \"race\" and purity of white women.\nWhy imagine such a law? Perhaps it escaped you that in the context of the Guardian writer's account, the sex prohibition is not even a law. It's a provision in a private contract.\n \n Further, the article neglected to clarify whether the provision was imposed by the Israeli side or by the Chinese employment agency.\n \n The article did state, however, that an Israeli lawyer said the contract would be rejected if challenged in court, a view quite consistent with Israel being a liberal democracy.\n \n As for laws preserving the purity of women, check out Israel's neighbor Jordan where the U.S. State Dept estimates that 25% of homicides are honor killings.", 
   {}, 
   171083, 
   null, 
   1129764960.0
  ], 
  [
   172312, 
   null, 
   "Gator", 
   "The labourers are also forbidden from engaging in any religious or political activity. The contract states that offenders will be sent back to China at their own expense.\n\n \n \nGoing to have to try hard to come up with some suitable explaination here, though I expect its more a way of getting rid of illegal immigrant workers without having them make a fuss rather than a general practice.\nThe Israelis need no further excuse to deport illegals. The fact that a worker is in the country illegally is sufficient of itself.\n \n I would imagine the Chinese government feels a strong compelling interest in forbidding their overseas workers from engaging in religious or political activity. The spiritual exercise Falun Gong in banned even in the Chinese homeland, so the last thing the People's Republic needs is Chinese foreign workers being active in anything other than furthering the motherland's economic revolution.", 
   {}, 
   171717, 
   null, 
   1129766820.0
  ], 
  [
   172319, 
   null, 
   "daewoo", 
   "Well this is an improvement from your earlier bigoted pronouncement that 'the Jews are extremely racist people.' The brush doesn't get any broader than that. So I commend you fnow for uttering a somewhat narrower prejudice. By confining your remark to Israel's policies--rather than to 'the Jews'--you have shown some progress in how to apply the 'racist' label.\n\n \n Palestenians and arabs who have lived in Israel since birth, veen since before the creation of isreal as a nation, in many cases are denied citizenship. Woody Allen could move there tomorrow and have the full rights of an israeli citizen. In fact, any jew on the planet can. Examples of racism? Are you freaking kidding me? \n \n My wife could move there tomorrow and be a citizen, I could not, because I am not jewish.\n \n It is good to see you are back with your long, barely coherent posts that generally have little or no relationship to the topic at hand.", 
   {}, 
   172273, 
   null, 
   1129768680.0
  ], 
  [
   172322, 
   null, 
   "daewoo", 
   "BTW, Jews do tend to be racist. They stick to their own people, do business with other jews whenever possible, and exclude others. Not that I am complaining. I have made a ton of money off of contacts that my wife handed me. I have a brother in law who openly admits he is not qualified for his job, and there were others far more qualified, but hew knew he was in as soon as he relaized that the person making the hiring decision was another jew. \n \n This has been a lot of the cuase of jewish persecution thoguh history. Jes tend to keep a closed, somewhat secretive society. They tend to alienate themselves as a group from the population at large.", 
   {}, 
   172319, 
   null, 
   1129768920.0
  ], 
  [
   172324, 
   null, 
   "Tastyfish", 
   "The Israelis need no further excuse to deport illegals. The fact that a worker is in the country illegally is sufficient of itself.\n \n I would imagine the Chinese government feels a strong compelling interest in forbidding their overseas workers from engaging in religious or political activity. The spiritual exercise Falun Gong in banned even in the Chinese homeland, so the last thing the People's Republic needs is Chinese foreign workers being active in anything other than furthering the motherland's economic revolution.\n\n Yes, but having paid money to get there, be sold into virtual slavery the workers might get a bit ****** off if the factory owner just gets tired of them or wants to move and just let them go - hence the contract that allows him to intimidate them and make it appear to them that its a little more official that it really is.\n Or alternatively its a way of getting rid of legal temporary workers when you want to rather than having to go through any other legal processes or pay redundancy (no idea really where Israel falls politically on these kind of things)", 
   {}, 
   172312, 
   null, 
   1129769580.0
  ], 
  [
   172357, 
   null, 
   "Gator", 
   "since prostitution is one of the largest service industries in Israel, I doubt that religous or moral implications are the issue.\nYou may be right about the moral, religious implications, since an increasing number of prostitutes are smuggled into Israel illegally from the former Soviet Union, and thus are not Israeli nationals. Still, I wouldn't count prostitution one of the largest service industries. No doubt it thrives as a business, since it's not illegal in Israel, but even if one assumes it to be a $1 billion industry--double the NYT estimate a few years back--that still represents less than 1% GDP.\n \n As for morality and religiosity, the Bible didn't prohibit the activity, so naturally it followed that prostitution was considered neither illegal nor sinful, except for the cultic variety found in pagan worship, like the idolatrous temple of Venus in Corinth that employed more than a 1000 prostitutes. In the OT, Rahab the harlot was praised for her faith, Samson visited the harlot of Gaza, the prophet Hosea was commanded by God to marry a prostitute, and Judah (from whom the word 'Jew' is derived) unwittingly hired his daughter-in-law as a prostitute, not recognizing her veiled face.\n \n Even Abraham is found to be pimping his beautiful wife in Egypt, passing her off as his sister to pharoah, who richly rewarded Abraham with sheep and cattle, slaves and camels. Lucky for him that in those pre-Levitical days of yore, even a married woman like Sarah might legally consort with another man, but God later changed that part when he handed down a new Law to Moses at Sinai, making extramarital sex the sole province of men.\n \n Today's trafficking in women is of course a separate issue from prostitution per se, since the women are not only financially exploited but often physically abused.", 
   {}, 
   171773, 
   null, 
   1129774200.0
  ], 
  [
   172381, 
   null, 
   "daewoo", 
   "You may be right about the moral, religious implications, since an increasing number of prostitutes are smuggled into Israel illegally from the former Soviet Union, and thus are not Israeli nationals. Still, I wouldn't count prostitution one of the largest service industries. No doubt it thrives as a business, since it's not illegal in Israel, but even if one assumes it to be a $1 billion industry--double the NYT estimate a few years back--that still represents less than 1% GDP.\n\n \n Last time I was in israel, there were more whores than cab drivers. Smuggled in from russia? I suppose, but you have to wonder WHY. There are plenty of home grown girls who are apparently more than willing to do the job.\n \n I would not write it off as one of the biggest service industries (though I doubt the validity of your numbers) since service industries do not make up a great deal of the GDP of israel. I would imagine that in real nummers it surpasses agriculture (3% of GDP). you see more whores in israel than anywhere I have ever been. The place is swamped with them.", 
   {}, 
   172357, 
   null, 
   1129779060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Keeping the Master Race pure", 
  "url": "http://www.4forums.com/political/current-events-debates/6631-keeping-master-race-pure.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6631, 
  "discussion_files": [
   [
    "11575.html", 
    "http://www.4forums.com/political/current-events-debates/6631-keeping-master-race-pure-print.html"
   ], 
   [
    "11576.html", 
    "http://www.4forums.com/political/current-events-debates/6631-keeping-master-race-pure-2-print.html"
   ]
  ], 
  "identifier": 6631
 }
]