[
 [
  [
   171039, 
   null, 
   "billsco", 
   "When is a good age to consider taking my grandson deer hunting? He's only a year and a half old now, but I want to start planning for the future hunt.\n \n It would require a weekend trip 250 miles from home, \"roughing it\" in a pickup camper, and hunting from an semi-enclosed, heated deer stand. I really don't care if we can only hunt two hours per day, what I think is important is to get him out there as early as possible to build some lasting memories.\n \n What age do you think we could reasonably look at as the earliest possible?", 
   {
    "post_info": {
     "post_title": "When Can I Take My Grandson Hunting?"
    }
   }, 
   null, 
   null, 
   1129396860.0
  ], 
  [
   171067, 
   null, 
   "Kronus", 
   "I would recommend waiting until he's old enough to understand the moral implications of killing things for fun. But then, you probably weren't looking for a vegetarian's take on the question. :)\n \n Does it have to be hunting? What's wrong with just camping?", 
   {}, 
   171039, 
   null, 
   1129398720.0
  ], 
  [
   171073, 
   null, 
   "billsco", 
   "My mind is pre-occupied with hunting this time of year. I haven't thought of a camping outing only.\n \n Besides, something seems missing in that type of experience. Hunting is more than just a day at the beach, IMO. It's a right of passage--something American society has very few such opportunities to present to our youth. \n \n But in reality a camping trip will probably present itself first. Can we go fishing?", 
   {}, 
   171067, 
   null, 
   1129399620.0
  ], 
  [
   171086, 
   null, 
   "Ooaman", 
   "But in reality a camping trip will probably present itself first. Can we go fishing?\n\n I use to go fishing with my grandpa while I was in 2nd grade. (Or closer to the Summer after it) We didn't go too much but we went a few times through out that year and I was 8-9 years old then depending on which parts of the summer we went.\n Of course, I probibly could have gone when I was younger than that but there were not too many chances to do that.", 
   {}, 
   171073, 
   null, 
   1129402080.0
  ], 
  [
   171090, 
   null, 
   "Phantos", 
   "I think I'd wait maybe another year or so to go hunting. It may be hard for someone that age to sit still for very long out in the woods. It might be fun to start introducing him to the woods by just going for a walk and looking for animals...squirrels, turkeys, deer, etc... Fishing would be awesome too. Little kids like to see fish, and a fishing trip may produce more opportunities to see animals. \n \n You're from Minnesota? That's cool, me too...I completely understand how hunting is a part of life up here. :p Good luck hunting this year!", 
   {}, 
   171086, 
   null, 
   1129403520.0
  ], 
  [
   171091, 
   null, 
   "georged", 
   "When is a good age to consider taking my grandson deer hunting? He's only a year and a half old now, but I want to start planning for the future hunt.\n \n It would require a weekend trip 250 miles from home, \"roughing it\" in a pickup camper, and hunting from an semi-enclosed, heated deer stand. I really don't care if we can only hunt two hours per day, what I think is important is to get him out there as early as possible to build some lasting memories.\n \n What age do you think we could reasonably look at as the earliest possible?\n\n \n Many states now have a minimum age for 'big' game hunting. We were taken on hunting trips from about age six, not as participants in the actual hunts but to stay in camp, because we had at that point developed a sense of what could hurt us and the ability to follow parental direction. Small game\n hunting started at age eight (.22), with bird and big game hunting at 12. Ability to handle firearm recoil was also a consideration. \n \n I was raised in the Western US, during an era where hunting and fishing trips (often the backyard) were as common as TV is to contemporary children. I no longer hunt on public land unless it involves packing in where no motorized vehicles are allowed. There are now large armies of hunters on easily accessible public lands, small cities of camps, RVs and such with noise levels and social activities comparable to any suburban neighborhood. \n \n Semi-enclosed, heated deer stand? Room service included?", 
   {}, 
   171039, 
   null, 
   1129404180.0
  ], 
  [
   171097, 
   null, 
   "daewoo", 
   "I started tqaking my daughter small gmae hunting before she could walk. We started squirrel hunting with her in one of those baby backpacks (didn't want to hunt anything too big to be killed with a .22 short becuse I didn't want to damage her ears). \n \n This year she went deer hunting (muzzle loading season) and we had a good time, even the yucky part where we cleaned the deer/.", 
   {}, 
   171073, 
   null, 
   1129406460.0
  ], 
  [
   171232, 
   null, 
   "billsco", 
   "I think I'd wait maybe another year or so to go hunting. It may be hard for someone that age to sit still for very long out in the woods. It might be fun to start introducing him to the woods by just going for a walk and looking for animals...squirrels, turkeys, deer, etc... Fishing would be awesome too. Little kids like to see fish, and a fishing trip may produce more opportunities to see animals. \n \n You're from Minnesota? That's cool, me too...I completely understand how hunting is a part of life up here. :p Good luck hunting this year!\n\n \n Thanks. Minnesota is represented pretty well on this board. We've got jitobear, the bootfitter, prshuster, just off the top of my head. Always nice to see another one.", 
   {}, 
   171090, 
   null, 
   1129471140.0
  ], 
  [
   171235, 
   null, 
   "billsco", 
   "Many states now have a minimum age for 'big' game hunting. We were taken on hunting trips from about age six, not as participants in the actual hunts but to stay in camp, because we had at that point developed a sense of what could hurt us and the ability to follow parental direction. Small game\n hunting started at age eight (.22), with bird and big game hunting at 12. Ability to handle firearm recoil was also a consideration. \n\n \n Those sound like reasonable ages. I think I'll give him my .243 when he reaches late adolescent-early teen years. \n \n \n\n I was raised in the Western US, during an era where hunting and fishing trips (often the backyard) were as common as TV is to contemporary children. I no longer hunt on public land unless it involves packing in where no motorized vehicles are allowed. There are now large armies of hunters on easily accessible public lands, small cities of camps, RVs and such with noise levels and social activities comparable to any suburban neighborhood. \n\n \n Minnesota has an extended firearms deer season covering at least two weekends. It helps somewhat with congestion, as compared to Wisconsin, which crams it all into one weekend. I believe that played a role in the tragic shooting deaths of six hunters by one trespasser last year. \n \n I own my own land in northern Minnesota, so I'm lucky in that regard.\n \n \n\n Semi-enclosed, heated deer stand? Room service included? \n\n \n I don't think Domino's delivers yet, so there's an element of roughing it.\n \n My grandfather was a hardy Norwegian Lutheran who thought the proper state for mankind was to be as uncomfortable as possible. It brought one nearer to God, I swear was his thinking. He built tree stands with that purpose alone in mind, simply sawing off a spruce top at some unfortunate point of the tree where a limb was poking you in the rear when sitting and jamming your foot when trying to stand.\n \n I build mine now with plywood, the 4 by 8 base is a comfortable size to allow movement or have an extra person along.", 
   {}, 
   171091, 
   null, 
   1129472400.0
  ], 
  [
   171236, 
   null, 
   "billsco", 
   "I started tqaking my daughter small gmae hunting before she could walk. We started squirrel hunting with her in one of those baby backpacks (didn't want to hunt anything too big to be killed with a .22 short becuse I didn't want to damage her ears). \n \n This year she went deer hunting (muzzle loading season) and we had a good time, even the yucky part where we cleaned the deer/.\n\n \n Well congratulations to her and you. How old is she now?", 
   {}, 
   171097, 
   null, 
   1129472580.0
  ], 
  [
   171264, 
   null, 
   "georged", 
   "\n Minnesota has an extended firearms deer season covering at least two weekends. It helps somewhat with congestion, as compared to Wisconsin, which crams it all into one weekend. I believe that played a role in the tragic shooting deaths of six hunters by one trespasser last year. \n \n I own my own land in northern Minnesota, so I'm lucky in that regard.\n \n\n \n In general, we have a one-month archery/muzzleloader deer season, followed by a one-month firearms deer season. The firearms deer season is concurrent with elk firearms season, followed by a one-month elk bow/muzzleloader season. While congestion at popular public areas where deer are hunted is a problem every weekend, elk aren't all that geographically accessible (the first shot creates a mass migration of elk off public lands) and are a lot smarter. \n \n It sounds like your wife doesn't feed and name the deer on your property as mine does.", 
   {}, 
   171235, 
   null, 
   1129477140.0
  ], 
  [
   171269, 
   null, 
   "daewoo", 
   "Well congratulations to her and you. How old is she now?\n\n \n She is 3. The biggest trick is getting her to sit still and not fidget or talk at inappropriate times. The first deer we saw that we could have taken she spooked by saying \"Theres one!!\"\n \n Luckily, we are in kansas, where th deer are so thick on the ground that the running joke is \"the trick is to fire a gun and NOT hit one\". Many people have abandoned tree stands is favor of lawn chairs (personally I have never liked tree stands anyway, I much prefer moving slowly and quietly through the woods). So, it wasn't too long before we saw another one, and the second time her excitement did not get the better of her.\n \n I love to take her hunting and fishing. She is very much the little girl and mostly likes to play \"house\" and \"tea party\" and play with dolls. I am not at all interested in those things, and not a good play mate for such activities. She has reached that age where she realizes there is a difference between daddy and mommy, and she is more like mommy. The hunting and fishing trips we go on give us a good chance to spend some time together doing daddy daughter type stuff. The gift she was most excited about on her third birthday was a barbie fishing rod. She still sleeps with it by her bed and shows it to anybody new that happens by the house. \n \n In addition to the bonding time it gives you, I think that taking your kids hunting and fishing helps teach your kids some of the harsher side of life in a manner that the Lion King just fails to convey properly. She understands very well now that when we have meat at dinner, an animal died so we could eat that, and sometiems they are cute and fuzzy animals.", 
   {}, 
   171236, 
   null, 
   1129477680.0
  ], 
  [
   171423, 
   null, 
   "billsco", 
   "\n It sounds like your wife doesn't feed and name the deer on your property as mine does.\n\n \n We live about 250 miles from the property. The deer are pretty unfamiliar with humans when we get there.\n \n I never took my wife for a hunter. After I built my first semi-enclosed stand she went out on opening morning with me. Honestly, I never wanted her there; I didn't want to explain the life vs death thing. Shortly after sunrise a doe stepped out in the field, no more than 100 yards away. My wife whispered, \"Kill it\". Shocked me.", 
   {}, 
   171264, 
   null, 
   1129511820.0
  ], 
  [
   171425, 
   null, 
   "billsco", 
   "IThe gift she was most excited about on her third birthday was a barbie fishing rod. She still sleeps with it by her bed and shows it to anybody new that happens by the house. \n\n \n Well, that's it. I'm getting my grandson a fish pole this Christmas.", 
   {}, 
   171269, 
   null, 
   1129512060.0
  ], 
  [
   171521, 
   null, 
   "JPSartre12", 
   "When is a good age to consider taking my grandson deer hunting? He's only a year and a half old now, but I want to start planning for the future hunt.\n \n It would require a weekend trip 250 miles from home, \"roughing it\" in a pickup camper, and hunting from an semi-enclosed, heated deer stand. I really don't care if we can only hunt two hours per day, what I think is important is to get him out there as early as possible to build some lasting memories.\n \n What age do you think we could reasonably look at as the earliest possible?\n\n \n \n ~11 for an entire day out. I believe that was about the time that I first went deer hunting with my father. I never shot a deer, nor did he during those few times that we went, but the memories will always be there. He died when I was 13. Now, fishing is a whole different story. We started that when I was ~5. \n Enjoy the little guy. :)", 
   {}, 
   171039, 
   null, 
   1129524240.0
  ], 
  [
   171533, 
   null, 
   "daewoo", 
   "Well, that's it. I'm getting my grandson a fish pole this Christmas.\n\n \n \n Make sure you get one with a little plastic fish that you can tie to the line to practice casting. \n \n My daughter does not do any serious fishing (not that I would really want to see her hook into a serious fish with her barbie fishing rod), but we hit little farm ponds and she has caught a lot of crappie and bluegill. She does not have the patience required to fish for cats or anythign like that. Fast action is the key", 
   {}, 
   171425, 
   null, 
   1129525440.0
  ], 
  [
   171669, 
   null, 
   "Waxy", 
   "Kids are never too young to go fishing, especially with their granddad, as long as granddad is a very patient man, and doesn't plan on catching any fish himself. :p It's also a great start for the introduction of \"life and death\".\n \n Hunting is a different story. Bambi is a far cry from a flopping fish. I think it takes a more gradual approach.\n \n I think my dad did it right with my brothers and me, and I intend to do the same with my children. He started us off fairly young, maybe 8 or 9, going on short bird hunts, only a morning or afternoon, usually for ducks or upland. We carried BB guns and walked along. In hindsight, we were better than any retriever, if a little hard to train. The other added bonus, for us and him, was that he would let me drive the old Jeep Grand Wagoneer to the end of the field or windrow, a thrill for me, and learned how to drive, and it saved him a few miles of walking.\n \n We would always ring the necks, and help with the cleaning of the birds.\n \n My dad isn't a real big game hunter, so I've gone with my uncle for as long as I can remember. In Sask, you had to be 12 before you could go big game hunting. So, when I turned 12 I jumped in the truck with my uncle and his friend, a family friend that I knew well, and we headed off. To this day, it's one of my most vivid hunting memories, and it was a trip to a spot that I haven't been back to since. I was prepared for death I suppose, thankfully, but seeing the doe that I had just shot, alive and breathing when I got up to it, but unable to move, was still pretty traumatic for a young guy. Putting the final shot in the head and field dressing that doe was one of those major life moments. I'd be lying if I said I wasn't a little emotional, though I did make sure I didn't cry. :p \n \n Anyhoo, my point is, ease into, and make sure your grandson is comfortable before taking each step. \n \n Waxy", 
   {}, 
   171533, 
   null, 
   1129573860.0
  ], 
  [
   172902, 
   null, 
   "Bell", 
   "Never. Teach your grandson about animals not by ending their lives and finishing off their ability to contribute to the world, but by learning how they live. There is so much more to be discovered from a live animal than a dead one hanging on your wall, or sitting on your plate.\n \n \nIn addition to the bonding time it gives you, I think that taking your kids hunting and fishing helps teach your kids some of the harsher side of life in a manner that the Lion King just fails to convey properly. She understands very well now that when we have meat at dinner, an animal died so we could eat that, and sometiems they are cute and fuzzy animals.\n\n \n If you have to do it, I like daewoo's approach. :)", 
   {
    "post_info": {
     "post_title": "When is a good age to take him hunting or fishing?"
    }
   }, 
   171669, 
   null, 
   1129938540.0
  ], 
  [
   172957, 
   null, 
   "daewoo", 
   "Never. Teach your grandson about animals not by ending their lives and finishing off their ability to contribute to the world, but by learning how they live. There is so much more to be discovered from a live animal than a dead one hanging on your wall, or sitting on your plate.\n\n \n The two are the same./ You cannot have a sucessfull hunt unless youhave a good understanding of how the animals live, what they eat, their behavior, etc... A sucessful hunter will put a biologist to shame when it comes to knowledge of animals.", 
   {}, 
   172902, 
   null, 
   1129956720.0
  ], 
  [
   173195, 
   null, 
   "Bell", 
   "The two are the same./ You cannot have a sucessfull hunt unless you have a good understanding of how the animals live, what they eat, their behavior, etc... A sucessful hunter will put a biologist to shame when it comes to knowledge of animals.\n\n \n I disagree; to me it's obvious that every hunter has zero understanding of the animals they shoot/fish/trap. Animals to them are worthless creatures who could better serve human beings by hanging on the wall or sitting on a plate. \n I do agree that successful hunters (whatever that means) must have academic knowledge of eating patterns, behaviour, etc, but they have no knowledge of the value of an animal's life.", 
   {}, 
   172957, 
   null, 
   1130033220.0
  ], 
  [
   173198, 
   null, 
   "daewoo", 
   "I disagree; to me it's obvious that every hunter has zero understanding of the animals they shoot/fish/trap. Animals to them are worthless creatures who could better serve human beings by hanging on the wall or sitting on a plate. \n I do agree that successful hunters (whatever that means) must have academic knowledge of eating patterns, behaviour, etc, but they have no knowledge of the value of an animal's life.\n\n \n Are you a vegetarian?\n \n An animals value is based on the valkue it provides to its ecosystem. Deer eat grass, we eat deer, and in the end, we feed the grass. Circle of life, dear. We are all part of it.", 
   {}, 
   173195, 
   null, 
   1130034180.0
  ], 
  [
   173432, 
   null, 
   "Bell", 
   "\n Are you a vegetarian?\n \n An animals value is based on the valkue it provides to its ecosystem. Deer eat grass, we eat deer, and in the end, we feed the grass. Circle of life, dear. We are all part of it.\n\n \n Yes, I am a vegan. How could I spout off and not be? :)\n \n Nice pun. :)\n \n We do not need to eat deer, and we would \"feed the grass\" even if we didn't eat the deer. Humans are funny, non-natural omnivores. Why do we need to heat our raw meat up to be able to digest it? No other creature does this. \n \n I equate humans and animals. I don't think my or your life is any more \"important\" than my dog's life. I know this puts me out in left field as far as other people are concerned, but I think they are all wrong to believe humans are superior to all other creatures. In my eyes, therefore, hunting is wrong.", 
   {}, 
   173198, 
   null, 
   1130093520.0
  ], 
  [
   173444, 
   null, 
   "daewoo", 
   "Yes, I am a vegan. How could I spout off and not be? :)\n\n \n You would be shocked how many non vegetarians take a strong anti hunting stance and insist that cows and chickens (things THEY eat) are ok to eat, but things like deer and gamebirds are not.\n \n \nWe do not need to eat deer, and we would \"feed the grass\" even if we didn't eat the deer. Humans are funny, non-natural omnivores. Why do we need to heat our raw meat up to be able to digest it? No other creature does this. \n \n \n We don't need to heat our meat to be able to digest it. One of the first things they poundd into my head in survival schookl in the service was that cooked meat is a preference, not a requirement. Many cultures regular menus include uncooked meat. One of my favorite Thai dishes includes strips of raw beef.\n \n We cook our meat becasue it changes the texture, consistency and taste. Raw meat is rather bland. Cooking that meat adds flavor. Most animals prefer their meat cooked. Drop a chunk of raw beef into your dogs bowl next to a chunk of cooked beef and see which they eat first. \n \n Generally when raw meats appear on our diet in the US, they are dehydrated and heavily spiced. Dehydrating meat and spicing it makes it more difficult to digest, not easier. I have eaten more than one meal of raw meat (from necessity, not choice) and it never hurt me, nor did I ever have any trouble digesting it.\n \n Most vegetable on the other hand HAVE to be cooked in order for our bodies to utilize the fiber. We are just not set up well to eat raw veggies. The chaloric value of uncooked broccoli is pretty close to zero becuase our bodies cannot break down the fibers. We have trouble with corn even when it IS cooked. \n \n Very few mammals are truly vegetarians, even deer have been observed raiding ground nesting birds nests and eating their eggs, and all mammals with pointed incisors are omnivores. No omnivore HAS to eat meat, but it is pretty rare that you see a pack of coyotees raiding a patch of soybeans, depsite their high protein content. \n \n \nI equate humans and animals. I don't think my or your life is any more \"important\" than my dog's life. I know this puts me out in left field as far as other people are concerned, but I think they are all wrong to believe humans are superior to all other creatures. In my eyes, therefore, hunting is wrong.\n\n \n You seem to have developed a highly conceptualized moral position on this. Mine is a little less refined. Law of the jungle. If you can kill and eat it, do it. Nature is a nasty, cruel place and in my experience there is no place in it for morals. A lion does not feel bad when it eats a zebra. A hawk does not feel bad when it eats a rabbit, even if there is a nice soybean field nearby that would give it the protein it needs to survive. \n \n The only real difference between mankind and most if nature is that we generally oppose cannabalism (though I witnessed it more than once in africa where certain tribes, most notably the kagani, still practice it regularly). Beyond that, everything is fair game, and in a pinch, I think that there is a good chance that most people could obtain a taste for \"long pork\"", 
   {}, 
   173432, 
   null, 
   1130096760.0
  ], 
  [
   173477, 
   null, 
   "Bell", 
   "You would be shocked how many non vegetarians take a strong anti hunting stance and insist that cows and chickens (things THEY eat) are ok to eat, but things like deer and gamebirds are not.\n\n \n I could hypothesize that people feel this way b/c of the methods of slaughter? Although I personally don't see the difference in the way cattle are killed versus deer, maybe some people think farms \"more humanely\" kill their livestock than a hunter does with a rifle. A good hunter will bring down an animal with a bullet where it counts, and a chicken farm can be much crueler.\n \n \nWe don't need to heat our meat to be able to digest it. One of the first things they poundd into my head in survival schookl in the service was that cooked meat is a preference, not a requirement. Many cultures regular menus include uncooked meat. \n \n \n From this site:\n Eighty million species on earth (about 700,000 of which are animals) thrive on raw food. Only humans apply heat to what they eat. Humans on average as a race, die at or below half their potential life span of chronic illness that is largely diet and lifestyle related. Domesticated pets also are fed cooked, processed, packaged food that likewise is denatured by heat. As a consequence, they suffer human-like chronic ailments including cancer, arthritis and other degenerative diseases. \n \n I found this interesting, and more research should be done on this.\n \n \nMost vegetable on the other hand HAVE to be cooked in order for our bodies to utilize the fiber. We are just not set up well to eat raw veggies. The chaloric value of uncooked broccoli is pretty close to zero becuase our bodies cannot break down the fibers. We have trouble with corn even when it IS cooked.\n\n \n I disagree, especially with your broccoli example. I have read time and time again, in many sources, that raw broccoli is much, much better for you than cooked. Here is a site I use: http://www.beyondveg.com/tu-j-l/raw-cooked/raw-cooked-2f.shtml\n \n I don't think that just because we can eat meat means that we should. 'Law of the Jungle' does not apply to humans who [should] know better, and can get alternate sources of nutrition.\n \n \nThe only real difference between mankind and most if nature is that we generally oppose cannabalism (though I witnessed it more than once in africa where certain tribes, most notably the kagani, still practice it regularly). Beyond that, everything is fair game, and in a pinch, I think that there is a good chance that most people could obtain a taste for \"long pork\"\n\n \n I agree! People become accustomed to certain things (like eating meat) and if we grew up in accustomed to cannabalism, that'd be fine, too. (I wanted to put a smiley that would vomit here.)", 
   {}, 
   173444, 
   null, 
   1130107860.0
  ], 
  [
   173484, 
   null, 
   "daewoo", 
   "I could hypothesize that people feel this way b/c of the methods of slaughter? Although I personally don't see the difference in the way cattle are killed versus deer, maybe some people think farms \"more humanely\" kill their livestock than a hunter does with a rifle. A good hunter will bring down an animal with a bullet where it counts, and a chicken farm can be much crueler.\n\n \n That is generally the argument. Taking a deer in 10 seconds with a well placed rifle shot is MUCH les cruel than taking a cow, cramming it on a truck with 85 other cows, and sending them to a processimg plant where they are herded in to be killed with a bolt gun and then skinned (if they are lucky, in that order). Hitler did this with jews and is not well thought of.\n \n \n \n \nFrom this site:\n Eighty million species on earth (about 700,000 of which are animals) thrive on raw food. Only humans apply heat to what they eat. Humans on average as a race, die at or below half their potential life span of chronic illness that is largely diet and lifestyle related. Domesticated pets also are fed cooked, processed, packaged food that likewise is denatured by heat. As a consequence, they suffer human-like chronic ailments including cancer, arthritis and other degenerative diseases. \n \n \n Again, humans do not have to heat their food. We choose to. It is a cultural bias. Most animals prefer cooked food. My dogs will not eat raw meat. I ahve to grill it for them. \n \n \n \nI disagree, especially with your broccoli example. I have read time and time again, in many sources, that raw broccoli is much, much better for you than cooked. Here is a site I use: http://www.beyondveg.com/tu-j-l/raw-cooked/raw-cooked-2f.shtml\n\n \n In small quantities, yes. The number one rule in survival training was \"thy shalt not try to exist on a diet of raw plants or thou shall found thine self doubled over in pain with zero combat effectiveness\". \n \n I would imagine with the variety available at your local supermarket this is not such an issue since it is easy any time of the year to mix in things like fruits and non fiberous vegetables (which tend to be natural laxatives). My experience in such matters comes soley from training and from situations where there was not a price chopper or a krogers handy. When you are limited to natures bounty, you find that pickingas are generally slimmer than you would like.\n \n \nI don't think that just because we can eat meat means that we should. 'Law of the Jungle' does not apply to humans who [should] know better, and can get alternate sources of nutrition.\n\n \n Why? We are just animals like everything else. The cloak of \"civilization\" is a thin one at the best of times. The law of the jungle is the only law that there is. Everythign else is rules that change with the game. \n \n \nI agree! People become accustomed to certain things (like eating meat) and if we grew up in accustomed to cannabalism, that'd be fine, too. (I wanted to put a smiley that would vomit here.)\n\n \n When did humans not eat meat? As far as I know, the earliest history of humasn we have is based on cave paingings that depict hunting and artifacts made out of stone, most of which are designed either for the processing of dead animals or for killing them.", 
   {}, 
   173477, 
   null, 
   1130110560.0
  ], 
  [
   173488, 
   null, 
   "billsco", 
   "If one's objections to hunting revolves around cruelty to animals, I don't believe it's a defensible position. \n \n Our deer population in Minnesota, like many other states, is very high. One of the few safety valves in an overabundance of these animals is hunting. Another is a snowy, cold winter, where the emaciated deer, no longer fit enough to browse even on twigs, die a slow and tortuous death.", 
   {}, 
   173484, 
   null, 
   1130112300.0
  ], 
  [
   173496, 
   null, 
   "JPSartre12", 
   "If one's objections to hunting revolves around cruelty to animals, I don't believe it's a defensible position. \n \n Our deer population in Minnesota, like many other states, is very high. One of the few safety valves in an overabundance of these animals is hunting. Another is a snowy, cold winter, where the emaciated deer, no longer fit enough to browse even on twigs, die a slow and tortuous death.\n\n \n Here in Michigan, I'd venture a guess that more deer are taken with Detroit Iron than bullets and arrows. I live in the heart of a city and had to dodge a dead deer on my way to work just 3 days ago. emoticon_wow", 
   {}, 
   173488, 
   null, 
   1130115240.0
  ], 
  [
   173504, 
   null, 
   "georged", 
   "If one's objections to hunting revolves around cruelty to animals, I don't believe it's a defensible position. \n \n Our deer population in Minnesota, like many other states, is very high. One of the few safety valves in an overabundance of these animals is hunting. Another is a snowy, cold winter, where the emaciated deer, no longer fit enough to browse even on twigs, die a slow and tortuous death.\n\n \n All states are experiencing that imbalance. Remove politically incorrect natural predators that also like cattle, sheep, dogs, humans, anything else that has meat tissue and bingo, imbalance.", 
   {}, 
   173488, 
   null, 
   1130118300.0
  ], 
  [
   173508, 
   null, 
   "georged", 
   "I could hypothesize that people feel this way b/c of the methods of slaughter? Although I personally don't see the difference in the way cattle are killed versus deer, maybe some people think farms \"more humanely\" kill their livestock than a hunter does with a rifle. A good hunter will bring down an animal with a bullet where it counts, and a chicken farm can be much crueler.\n \n \n \n From this site:\n Eighty million species on earth (about 700,000 of which are animals) thrive on raw food. Only humans apply heat to what they eat. Humans on average as a race, die at or below half their potential life span of chronic illness that is largely diet and lifestyle related. Domesticated pets also are fed cooked, processed, packaged food that likewise is denatured by heat. As a consequence, they suffer human-like chronic ailments including cancer, arthritis and other degenerative diseases. \n \n I found this interesting, and more research should be done on this.\n \n \n \n I disagree, especially with your broccoli example. I have read time and time again, in many sources, that raw broccoli is much, much better for you than cooked. Here is a site I use: http://www.beyondveg.com/tu-j-l/raw-cooked/raw-cooked-2f.shtml\n \n I don't think that just because we can eat meat means that we should. 'Law of the Jungle' does not apply to humans who [should] know better, and can get alternate sources of nutrition.\n \n \n \n I agree! People become accustomed to certain things (like eating meat) and if we grew up in accustomed to cannabalism, that'd be fine, too. (I wanted to put a smiley that would vomit here.)\n\n \n Well founded argument, but not good enough to compete with backstrap pan fried over a wilderness campfire with coyotes howling as they take care of their share.", 
   {}, 
   173477, 
   null, 
   1130118540.0
  ], 
  [
   173516, 
   null, 
   "billsco", 
   "Mmmmm...meat.\n \n Homer Simpson", 
   {}, 
   173508, 
   null, 
   1130120340.0
  ], 
  [
   173567, 
   null, 
   "Adept", 
   "I equate humans and animals. I don't think my or your life is any more \"important\" than my dog's life. I know this puts me out in left field as far as other people are concerned, but I think they are all wrong to believe humans are superior to all other creatures. In my eyes, therefore, hunting is wrong.\n\n \n I feel exactly the same way, but apply it differently in that I feel perfectly at ease with the deaths of either animals or humans. If I were at ease eating humans, and there were no legal repurcussions, then I'd hunt people too.", 
   {}, 
   173432, 
   null, 
   1130149260.0
  ], 
  [
   173586, 
   null, 
   "JPSartre12", 
   "...\n \n From this site:\n Eighty million species on earth (about 700,000 of which are animals) thrive on raw food. Only humans apply heat to what they eat. Humans on average as a race, die at or below half their potential life span of chronic illness that is largely diet and lifestyle related. Domesticated pets also are fed cooked, processed, packaged food that likewise is denatured by heat. As a consequence, they suffer human-like chronic ailments including cancer, arthritis and other degenerative diseases. \n \n I found this interesting, and more research should be done on this....\n\n \n I fear that your veggie website is slightly biased. Here's a more reputable source for you:\n \n\n Better Fat Processors \n \n When humans switched to meat-eating, they triggered a genetic change that enabled better processing of fats, said Stanford, who has worked extensively with gerontologist Caleb Finch of USC. \n \n \"We have an obsession today with fat and cholesterol because we can go to the market and stuff ourselves with it,\" Stanford said. \"But as a species we are relatively immune to the harmful effects of fat and cholesterol. Compared to the great apes, we can handle a diet that's high in fat and cholesterol, and the great apes cannot. \n http://news.nationalgeographic.com/news/2005/02/0218_050218_human_diet_2.html\n \n \n\n \n \n Are you aware of the research done by scientists that demonstrates it was man's conversion from vegetarian to omnivore that allowed him to develop a more highly specialized and larger brain? The higher caloric value of meat allowed our ancestors to spend more time doing things other than eating, for example, and allowed more energy to be directed to brain function and away from digestion. A cow, for example, has several large stomachs and a small brain because the food consumed by the cow has a low caloric content. This forces the cow to expend more energy foraging for food, eating and digesting with little caloric value left over for higher brain functions.\n \n Another interesting read:\n http://www.americanscientist.org/template/AssetDetail/assetid/24543?fulltext=true", 
   {}, 
   173477, 
   null, 
   1130163840.0
  ], 
  [
   173663, 
   null, 
   "Bell", 
   "I would imagine with the variety available at your local supermarket this is not such an issue since it is easy any time of the year to mix in things like fruits and non fiberous vegetables (which tend to be natural laxatives). My experience in such matters comes soley from training and from situations where there was not a price chopper or a krogers handy. When you are limited to natures bounty, you find that pickingas are generally slimmer than you would like..\n\n \n I admit that if circumstances were different, I could fish and get over it. But circumstances are not like this (for some) so why should we hunt and kill creatures just because our taste buds like it?\n \n \nWhy? We are just animals like everything else. The cloak of \"civilization\" is a thin one at the best of times. The law of the jungle is the only law that there is. Everythign else is rules that change with the game.\n \n \n I agree; we are animals just like everything else. But we have higher thought processes and should be out to help and save the creatures of the earth, not eat them because they taste good.\n \n \nWhen did humans not eat meat? As far as I know, the earliest history of humasn we have is based on cave paingings that depict hunting and artifacts made out of stone, most of which are designed either for the processing of dead animals or for killing them.\n\n \n Did humans always have the capability to hunt animals? Were they hunters or scavengers?\n My point was that we think it is okay to eat meat b/c that is what has always been done. Just like some think that worshipping the Christian god is the only way to go b/c that's what they've always done, or eating hydrogenated oils is okay because that's what we've always done, or electo-shock treatment was okay for schizophrenics because that's what has always been done...etc.\n \n \nWell founded argument, but not good enough to compete with backstrap pan fried over a wilderness campfire with coyotes howling as they take care of their share.\n\n \n People are a slave to their senses.\n \n JPSartre12, thanks for the articles. Interesting, but difficult to prove as factual. Maybe we would live even longer with less health problems if we didn't eat meat. Even if it were proved as factual, does it mean that we should continue to eat it? Why?\n \n \nI feel exactly the same way, but apply it differently in that I feel perfectly at ease with the deaths of either animals or humans. If I were at ease eating humans, and there were no legal repurcussions, then I'd hunt people too.\n\n \n I am perfectly at ease with death, also. Death is natural. Humans hunting animals for sport, not.\n Um...why would you hunt people? Actually, I can imagine. :) The question is, would you eat them, too?", 
   {}, 
   173484, 
   null, 
   1130179740.0
  ], 
  [
   173667, 
   null, 
   "JPSartre12", 
   ".....\n JPSartre12, thanks for the articles. Interesting, but difficult to prove as factual. Maybe we would live even longer with less health problems if we didn't eat meat. Even if it were proved as factual, does it mean that we should continue to eat it? Why?.....\n\n \n I think we should continue to eat meat because it tastes good. :) \n Besides, if we're smarter because we eat meat, what'll happen if we revert back to being herbivores? \n emoticon_idea Come to think of it, I don't know any vegans whose elevators go all the way to the top floor, so maybe the effect occurs in less than a generation. :)", 
   {}, 
   173663, 
   null, 
   1130180280.0
  ], 
  [
   173678, 
   null, 
   "Bell", 
   "I think we should continue to eat meat because it tastes good. :) \n Besides, if we're smarter because we eat meat, what'll happen if we revert back to being herbivores? \n emoticon_idea Come to think of it, I don't know any vegans whose elevators go all the way to the top floor, so maybe the effect occurs in less than a generation. :)\n\n \n Ah-ha! See, we are a slave to our senses. :) \n In all seriousness, what if we never ate meat at all? Would we still be blathering primate-esque rudimentary using creatures? Or would we have evolved to an even smarter version of ourselves? \n Wait a sec, JP, aren't you a Christian or something? Doesn't that change your views on our evolution? Sorry if I'm wrong...wouldn't want to offend you by calling you a \"Christian\". :)", 
   {}, 
   173667, 
   null, 
   1130182080.0
  ], 
  [
   173687, 
   null, 
   "daewoo", 
   "I admit that if circumstances were different, I could fish and get over it. But circumstances are not like this (for some) so why should we hunt and kill creatures just because our taste buds like it?\n\n \n Because they are also a better source of proteins and calories (more compact) than veggies.\n \n \nI agree; we are animals just like everything else. But we have higher thought processes and should be out to help and save the creatures of the earth, not eat them because they taste good.\n\n \n Why? Back tot he law of the jungle. The fact we are smarter just means that we should be able to kill and eat other animals more efficiently. When you get into things like industrial pollution, etc... sure we have a responsibility to the rest of the planet. When it comes to eating, there is no such responsibility.\n \n \n It does not matter. Either they were killing and eating, or they were stealing another animals kill. Which really makes no difference since they were eitehr effectivley killin ght eanimal they were eating, or killing whatever DID kill that animal (since they stole its food) OR, whatever they stoe the food from went out and made another kill. Regardless of which way it went, nothing eats free. Something dies for every meal. You might want to take a good hard look at modern farming practices I would venture a guess that all of humanity converting to vegan would likely be a LOT harder on the animal population of this planet than eating some of them (the animals). Modern farming practices are akin to a scorched earth policy during times of war.\n \n \nMy point was that we think it is okay to eat meat b/c that is what has always been done. Just like some think that worshipping the Christian god is the only way to go b/c that's what they've always done, or eating hydrogenated oils is okay because that's what we've always done, or electo-shock treatment was okay for schizophrenics because that's what has always been done...etc.\n\n \n No, my argument is that eating meat is OK because it is the natural order of things. Birds fly, fish swim, and people eat meat. Thats just the way it is.", 
   {}, 
   173663, 
   null, 
   1130184060.0
  ], 
  [
   173737, 
   null, 
   "Ooaman", 
   "No, my argument is that eating meat is OK because it is the natural order of things. Birds fly, fish swim, and people eat meat. Thats just the way it is.\n\n The way it is is that people eat. There is no law saying that a person has to eat meat. If it weren't for chicken, I would probibly be a vegitarian. I hate most forms of beef (especially steak emoticon_ic). Humans are not Carnivores, they are Homnivores. What's wrong with someone being a vegitarian? Do know how many celebrities are vegitarians. For one, \"Weird Al\" Yankovic and then there are all the members of Boston. (I'm a music nerd, okay, deal with it.) Frankly, when it comes to hunting, I think the Native Americans had the best idea because they hunted for food, clothing, and shelter. If they killed a buffalo, they used the entire body for food, warmth (clothing) and to make tepees (shelter) with. They didn't go to the taxidermest to have it stuffed and hung on the wall to be like, \"Yup, I killed that beast.\" Bell should be a vegitarian if Bell wants to be a vegitarian. I posted here earlier about going fishing with my grandpa. All the times we went, I only caught 1 fish. We through it back anyway. It was more than just going to get fish. (I can't even comfortablly eat fish anyway.) It was about being with my grandpa. And by the way, you can not force someone to eat something that they don't want to eat. A person can be healthyer if they eat fruits and vegitables as opposed to meat because meat is loaded with cholestoral. Also, most meats like Bacon and other disgusting meat products are on the Atkin's diet. So there for: emoticon_ic emoticon_ic emoticon_ic emoticon_ic emoticon_ic\n I could go on all day about why the XXXXin's Diet is the worse thing you could ever go on, but this isn't the Health Debates Forum.\n Long story short, a person can survive if they don't eat meat at all.", 
   {}, 
   173687, 
   null, 
   1130194500.0
  ], 
  [
   173771, 
   null, 
   "JPSartre12", 
   "Ah-ha! See, we are a slave to our senses. :) \n In all seriousness, what if we never ate meat at all? Would we still be blathering primate-esque rudimentary using creatures? Or would we have evolved to an even smarter version of ourselves? \n\n We'd be big bellied beer drinkers. :) \n \n\n Wait a sec, JP, aren't you a Christian or something? Doesn't that change your views on our evolution? Sorry if I'm wrong...wouldn't want to offend you by calling you a \"Christian\". :)\n\n \n I'm not offended by being called a Christian, although I certainly wouldn't fit the bill as a \"born again\", that's for sure. As for my views on evolution, I believe that animals naturally evolve but that they didn't come into existence in the first place via chance. DNA's tougher to synthesize from primordial ooze than it is to hit the powerball lottery. :)", 
   {}, 
   173678, 
   null, 
   1130199300.0
  ], 
  [
   173812, 
   null, 
   "Bell", 
   "Ooaman, no one was telling me I shouldn't be a vegetarian. Originally, the topic was about hunting. My point was that we can learn more from a live animal than a dead one. And, as you pointed out, hunting is frequently an activity people use to socialize, or they hunt animals to hang as trophies. That's all baloney to me. Or, uh, tofurkey.\n I like your Native American comments; this I agree with. I just feel that people who have access to other sources of nutrition than animals should go that route first.\n Hey, Ooaman, music rocks. Although Weird Al might not be a \"musician\" as much as a parodist. :)\n \n \nBecause they are also a better source of proteins and calories (more compact) than veggies.\n\n \n So does that mean that eating meat is healthier for you? Or just that you have to eat more veggies than you would meat to get the same nutrition?\n \n Today, we have many alternate sources of protein that are far superior for your health than a steak, pork tenderloin, whatever. I urge you to check out your health section of your grocery and give some of them a try. \n While you're at it, you might want to see what's in that milk you drink. And the processed foods you eat. Hydrogenated oils...food colorings ...nitrates...sugars and sugar replacers. Eeek.\n \n \nModern farming practices are akin to a scorched earth policy during times of war.\n \n I really don't know anything about this at all. Sites?", 
   {}, 
   173771, 
   null, 
   1130204700.0
  ], 
  [
   173822, 
   null, 
   "daewoo", 
   "So does that mean that eating meat is healthier for you? Or just that you have to eat more veggies than you would meat to get the same nutrition?\n\n \n I think that if anything you and JP have shown in your links that the jury is still out on that one. \n \n \nToday, we have many alternate sources of protein that are far superior for your health than a steak, pork tenderloin, whatever. I urge you to check out your health section of your grocery and give some of them a try. \n While you're at it, you might want to see what's in that milk you drink. And the processed foods you eat. Hydrogenated oils...food colorings ...nitrates...sugars and sugar replacers. Eeek.\n\n \n Not worth a look. I try not to eat processed foods, which puts most of the \"health food\" in the health food section out fo the running. Tofurkey, which you referenced earlier, is a pretty good example of nasty processed food that I don't eat. Peanut butter is another. I used to eat that kind of junk, but slowly changed to a more natural diet (farm raised, non steriod meat, veggies that are NOT parrafin coated, dairy milk, fresh eggs etc...). Now I have trouble eating stuff hat is processed. Once you get used to eating natural stuff, the more heavily processed a food is, the more it tastes like you are taking a bite of a chemistry set. I am not some kind of health nazi who will go on about the danger of processed fodds....far from it. I just don't like the way they taste. You are welcome to eat whatever you want. \n \n \nI really don't know anything about this at all. Sites?\n\n \n http://www.resurgence.org/resurgence/issues/pretty205.htm\n http://www2.essex.ac.uk/ces/ResearchProgrammes/externalities/Externrealcostoffarming.htm\n \n There are a couple. It is easier to find sites defending the practices than condeming them. The simple fact of the matter is, nobody really cares. Modern farming techniques involve clearcuttign thousnads of acres. Then they plant it. Then when the harvest comes in, they disk all the stubble under. If anthign comes back up, they disk it under again. \n \n I live in rural Kansas, and right now there are thousands of square miles of the state that are bare earth and will be until next year when they re-plant. Unfortunatly, this always comes during the winter when animals need the food and cover the most. If you go out west right now, it is literally brown bare wearth as far as the eye can see in all directions. Thats just how we do things anymore.\n \n I wanted some decent land to hunt on (read that: land that has not been stripped bear) I ended up buying my own and having a local farmenr farm it for me on shares, though my share is zero because nobody was willing to do it without using scorched earth farming tactics.", 
   {}, 
   173812, 
   null, 
   1130206740.0
  ], 
  [
   174128, 
   null, 
   "Ooaman", 
   "Ooaman, no one was telling me I shouldn't be a vegetarian. Originally, the topic was about hunting. My point was that we can learn more from a live animal than a dead one. And, as you pointed out, hunting is frequently an activity people use to socialize, or they hunt animals to hang as trophies. That's all baloney to me. Or, uh, tofurkey.\n I like your Native American comments; this I agree with. I just feel that people who have access to other sources of nutrition than animals should go that route first.\n\n I was reading the last few post before my last one as though anyone who is a vegitarian was an infadel (or some other sort of insulting term.) I was saying that any person has the right to be a vegitarian. The same is true that any one has the right to be a carnivor. No one can force that on anyone. I'm aware that the thread was started on hunting. However, like a lot of other threads on 4forums.com, it seemed to skew off onto another topic probibly based upon people like me who reads something different on a prevous thread and then goes off on it. Then I posted based upon how I read it. Also, I didn't agree with JPSatre12 statement about all of us being big bellied beer drinkers if we were all vegitarians. That's probibly where I picked up the idea that it was going into how/what a person eats as apposed to when billsco can take his grandson hunting. Okay, I started to pick up on that idea earlier but that's about the time I thought of what I posted yesterday.\n \nHey, Ooaman, music rocks. Although Weird Al might not be a \"musician\" as much as a parodist. :) \n I have a habit of refering to music topics that most people are not interested in but becasue it's important to me in my point. That's why I said to deal with it. And that was to anyone who might of gotten annoied with it. And \"Weird Al\" does play the accordian and (for the most part I belive) does do his own singing.", 
   {}, 
   173812, 
   null, 
   1130272680.0
  ], 
  [
   174391, 
   null, 
   "billsco", 
   "Well, I just became a grandpa again yesterday, another grandson. You know what that means, another fish pole under the Christmas tree.", 
   {}, 
   174128, 
   null, 
   1130335320.0
  ], 
  [
   174399, 
   null, 
   "Clive14", 
   "Well, I just became a grandpa again yesterday, another grandson. You know what that means, another fish pole under the Christmas tree.\nWhat, for a 2 month old?!?? Typical grandparents: no idea about kids emoticon_xclown emoticon_xangel", 
   {}, 
   174391, 
   null, 
   1130336220.0
  ], 
  [
   174406, 
   null, 
   "JPSartre12", 
   "Well, I just became a grandpa again yesterday, another grandson. You know what that means, another fish pole under the Christmas tree.\n\n \n Congratulations Biill. Keep them coming. I need all of the SS contributors that I can get for when I retire in ~15 years. :)", 
   {}, 
   174391, 
   null, 
   1130336580.0
  ], 
  [
   174513, 
   null, 
   "daewoo", 
   "Well, I just became a grandpa again yesterday, another grandson. You know what that means, another fish pole under the Christmas tree.\n\n \n CONGRATULATIONS!", 
   {}, 
   174391, 
   null, 
   1130350080.0
  ], 
  [
   175505, 
   null, 
   "billsco", 
   "Thanks guys. Number 1 grandson is coming over today for some early trick or treating, to spend some quality time with grandpa without having to rush around. He's going to be a buffalo I hear. I'm looking forward to seeing that.", 
   {}, 
   174513, 
   null, 
   1130680260.0
  ], 
  [
   188567, 
   null, 
   "Charliegone", 
   "I wonder if people ever think that if we let the population of certain animals grow that they will eventually outlive their habitat and start actually destroying plants (the stuff we need to breath.) So, my opinion is, hunting is ok as long as it controls a certain population from outgrowing. If people want to kill something than eat it as well, hell let them.emoticon_xkill", 
   {}, 
   175505, 
   null, 
   1135849920.0
  ], 
  [
   188630, 
   null, 
   "JPSartre12", 
   "I wonder if people ever think that if we let the population of certain animals grow that they will eventually outlive their habitat and start actually destroying plants (the stuff we need to breath.) So, my opinion is, hunting is ok as long as it controls a certain population from outgrowing. If people want to kill something than eat it as well, hell let them.emoticon_xkill\n\n \n Logical. Concise. Are you sure that you're in the right forum? :)", 
   {}, 
   188567, 
   null, 
   1135878240.0
  ], 
  [
   287011, 
   null, 
   "Shooterandproud", 
   "\n No, my argument is that eating meat is OK because it is the natural order of things. Birds fly, fish swim, and people eat meat. Thats just the way it is.\n\n \n I agree with daewoo here. Screwing with the natural order of nature is never a smart thing to do.", 
   {}, 
   173687, 
   null, 
   1191813540.0
  ], 
  [
   287012, 
   null, 
   "Shooterandproud", 
   "\n Long story short, a person can survive if they don't eat meat at all.\n\n \n So can other animals, but thats not to say that its a good idea to stop that animal from eating meat. Just because something (or someone) can do somethings doesn't mean they should. I could go rob a bank, and if I planned it well, get away with it. That doesn't mean I should.", 
   {}, 
   173737, 
   null, 
   1191813780.0
  ], 
  [
   349474, 
   null, 
   "Sheryl1970", 
   "I would wait until he`s at least 13 and understands what hunting is all about.\n Who knows he may decide he`s not into hunting or killing animals,\n let him make that choice for himself.emoticon_xkill", 
   {
    "post_info": {
     "post_title": "old enough to go hunting?"
    }
   }, 
   171039, 
   null, 
   1239697500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  When Can I Take My Grandson Hunting?", 
  "url": "http://www.4forums.com/political/parenting/6633-when-can-i-take-my-grandson-hunting.html", 
  "breadcrumbs": [
   "Parenting"
  ], 
  "id_number": 6633, 
  "discussion_files": [
   [
    "13700.html", 
    "http://www.4forums.com/political/parenting/6633-when-can-i-take-my-grandson-hunting-print.html"
   ], 
   [
    "13701.html", 
    "http://www.4forums.com/political/parenting/6633-when-can-i-take-my-grandson-hunting-4-print.html"
   ], 
   [
    "13702.html", 
    "http://www.4forums.com/political/parenting/6633-when-can-i-take-my-grandson-hunting-3-print.html"
   ], 
   [
    "13703.html", 
    "http://www.4forums.com/political/parenting/6633-when-can-i-take-my-grandson-hunting-2-print.html"
   ]
  ], 
  "identifier": 6633
 }
]