[
 [
  [
   171849, 
   null, 
   "Monument44", 
   "Hello,\n \n I am new to these forums and im not sure if anyone can help me or not.\n But i am writing a speech in school and i am supporting guns.\n But im having difficulty finding strong ideas to back me up.\n \n Could people please give me ideas for my speech?", 
   {
    "post_info": {
     "post_title": "Help Me Please"
    }
   }, 
   null, 
   null, 
   1129603980.0
  ], 
  [
   171883, 
   null, 
   "joebrummer", 
   "Hello,\n \n I am new to these forums and im not sure if anyone can help me or not.\n But i am writing a speech in school and i am supporting guns.\n But im having difficulty finding strong ideas to back me up.\n \n Could people please give me ideas for my speech?\n\n \n \n \n In my humble opinion.....because there are none! You could do a much more compelling speech as to why not have guns...especially if small children are invovled...especially when guns are so incredibly easy to get.....ask your local postman!", 
   {}, 
   171849, 
   null, 
   1129606740.0
  ], 
  [
   171934, 
   null, 
   "Bryan", 
   "Hello,\n \n I am new to these forums and im not sure if anyone can help me or not.\n But i am writing a speech in school and i am supporting guns.\n But im having difficulty finding strong ideas to back me up.\n \n Could people please give me ideas for my speech?\n\n \n \n Hello and welcome, M44.\n \n I might be able to help you with arguments/quotes/etc. in support of the indiviudal RKBA. If I can ask, what is the focus of your speech? Is it on the history of the RKBA, the legal arguments for the RKBA, or public policy arguments in suport of the RKBA?", 
   {}, 
   171849, 
   null, 
   1129611660.0
  ], 
  [
   172341, 
   null, 
   "Monument44", 
   "Hello,\n Its just like on the general basics. We had to pick a persuasive topic and i chose this.\n \n Some arguments i have come up with:\n 1. Its guaranteed in the bill of rights.\n 2. Criminals are criminals they still are gonna get the weapons.\n 3. People enjoy having weaponary for leisure and for security.", 
   {}, 
   171934, 
   null, 
   1129771500.0
  ], 
  [
   172629, 
   null, 
   "Freedom Fighter", 
   "I myself have just done a report on the right to carry a concealed carry firearm, and I have stumbled on some good sights such as www.justfacts.com/gun_contol.htm , www.pulpless.com/gunclock/noframeindex.html , \n www.guncite.com \n Pulpless.com is only good for a gun defense clock that it runs but the rest of the site is biased so don't qoute that one. justfacts.com is full of real information dealing with any gun and crime of guns and guncite.com has a lot of other links for the debate.\n Well good luck on your report and support the \"Right to Bear Arms\" -United States Contstitution ©1791-", 
   {}, 
   172341, 
   null, 
   1129863720.0
  ], 
  [
   172635, 
   null, 
   "kelvin90701", 
   "Hello,\n \n I am new to these forums and im not sure if anyone can help me or not.\n But i am writing a speech in school and i am supporting guns.\n But im having difficulty finding strong ideas to back me up.\n \n Could people please give me ideas for my speech?\n\n \n \"Stupidity\" - http://abcnews.go.com/2020/story?id=124324&page=8\n \n \"No Proof Gun Laws Reduce Violence\" - http://www.cbsnews.com/stories/2003/10/03/national/main576422.shtml\n \n \n My favorite:\n http://www.michigan.gov/msp/0%2C1607%2C7-123-1591_3503_4654-77621--%2C00.html\n \n The crimes commited by people in Michigan who carry guns are so low that when they do commit a crime it is a freak event.\n \n \n Throw these at anti-gunners just for fun:\n \n http://www.stentorian.com/2ndamend/dianne_f.html\n http://www.handguncontrolinc.org/oj_sarah2.htm\n http://www.tincher.to/mmm3.htm\n http://www.outdoors.net/site/images/imageview.aspx+Forum+Firearms+Category+Firearms+ImageID+10663+AlbumID+0+UserID+0+SearchTerm++curpage+10663", 
   {}, 
   171849, 
   null, 
   1129864680.0
  ], 
  [
   172942, 
   null, 
   "Freedom Fighter", 
   "If ya want to go to a complete mock of handguncontrol.org go to www.handguncontrolinc.com it is litered with hilarious pages making fun of associations like hci, peta, etc. emoticon_smile", 
   {}, 
   172635, 
   null, 
   1129947480.0
  ], 
  [
   172943, 
   null, 
   "Freedom Fighter", 
   "In my humble opinion.....because there are none! You could do a much more compelling speech as to why not have guns...especially if small children are invovled...especially when guns are so incredibly easy to get.....ask your local postman!\n\n Well such a compelling speech ( cough cough ) but this whole small children being involed is irrellivent, since it is the parents moral responsibility to \"lock all guns and ammo in sperate safes or cabinats\" qouting the gun and hunter safety quizes. That and I would also like to make a clear statement on my childhood, I have been around guns well since I was born... Yet I don't have an extra breathing hole in my head either, so it aint the guns its the parents who don't teach there kids proper gun safety and to NEVER PLAY WITH GUNS! qouting the NRA saftey tips.", 
   {}, 
   171883, 
   null, 
   1129947780.0
  ], 
  [
   172955, 
   null, 
   "Bryan", 
   "Those are all great topics, M44. \n \n I have often found that good quotes are the perfect \"spice\" for any speech. Here are a few quotes I have found which might help you, particularly when you argue that the 2nd. Amendment does (and should) protect an individual RKBA:\n \n http://4forums.com/political/showthread.php?p=124621#post124621\n \n If you are dealing with a public policy argument against banning guns, then I suggest you attack the illogical assumption that banning guns will change criminal behavior. Some people who want to ban guns try to use simplistic arguments to suggest that murder rates are tied to the number of guns available for criminal misuse; and they suggest more guns = more crime and less guns = less crime. To counter this argument, use statistics like this:\n \n http://4forums.com/political/showthread.php?p=172278#post172278\n \n If you are not the only one giving a speech, then I also suggest you check to see if anyone will offer a speech in support of gun control. If so, then remember that to make your speech the more effective of the two you don't want to let anything said in a counter-topic speech go unanswered. There are common gun control arguments that float around and tend to be relied upon by proponents of gun control. They are like anti-matter opposites of some of our side's well worn arguments. Let us know and I'm sure someone here can find the right counter for arguments you should expect in a speech advocating gun control. \n \n In any event I hope some of what I have offered (as well as what others here have posted for you) will give you some solid ammunition for your speech (pun intended). Please fell free to post any other requests for help on these topics. I think you will find most of us on the individual right side of the debate willing to help you any way we can.\n \n Good luck!", 
   {
    "post_info": {
     "post_title": "Good luck with the speech!"
    }, 
    "unicode_changes_made": true
   }, 
   172943, 
   null, 
   1129956180.0
  ], 
  [
   173050, 
   null, 
   "pickleweaseler", 
   "In my humble opinion.....because there are none! You could do a much more compelling speech as to why not have guns...especially if small children are invovled...especially when guns are so incredibly easy to get.....ask your local postman!\n\n \n That's true. By ignoring all legitimate uses for guns, and exaggerating the bad ones, he could make it seem that firearms are inherently evil. It would be an especially compelling speech if he could somehow incorporate cute little puppies in addition to the small helpless children. emoticon_rolleyes", 
   {}, 
   171883, 
   null, 
   1130002860.0
  ], 
  [
   173186, 
   null, 
   "Freedom Fighter", 
   "That's true. By ignoring all legitimate uses for guns, and exaggerating the bad ones, he could make it seem that firearms are inherently evil. It would be an especially compelling speech if he could somehow incorporate cute little puppies in addition to the small helpless children. emoticon_rolleyes\n\n lol. emoticon_xgood emoticon_xagree great point pickle.Honestly, why not put into play the madman breaking into your house with not a care of your life or (im putting in a small child and puppy!) your small child or your little puppy. Because the time you take your sorry little emoticon_xchicken self to :telephone the cops, he will be emoticon_xkill you and your little child. emoticon_cry", 
   {}, 
   173050, 
   null, 
   1130031060.0
  ], 
  [
   176749, 
   null, 
   "emclean", 
   "especially when guns are so incredibly easy to get.....ask your local postman!\n \n whywould hey be involved with the illegal gun trade?", 
   {}, 
   173186, 
   null, 
   1131031440.0
  ], 
  [
   177037, 
   null, 
   "StarRaven", 
   "Hello,\n \n I am new to these forums and im not sure if anyone can help me or not.\n But i am writing a speech in school and i am supporting guns.\n But im having difficulty finding strong ideas to back me up.\n \n Could people please give me ideas for my speech?\n\n Try http://www.a-human-right.com. While somewhat lacking in statistics and quotes, this site makes the point that guns are important to have with an eloquence which I greatly admire. The section on \"Why people own guns\" isn't full of the statistics that anti-gunners use exclusively. Numbers are meaningless, by and large. It simply makes the point in a way which anyone can understand - and with which only the truly malicious could ever disagree with.\n \n Also, you should seek out the names and some specifics of those (numerous) court cases where it has been ruled that the police are not responsible for providing personal safety, and that they are not responsible for any harm done to an individual by any failure of the police to take some action.\n \n I have chosen to carry a gun because the police are not responsible for my safety. And even if they were, it is exceedingly unlikely that they'd be there when I needed them. I do not intend to be helpless.\n \n Edit:\n I have found a link to an article about one of those cases I mentioned, and a recent one. It even makes the argument: if the police don't have to protect you and your children, don't you have to?\n \n http://www.foxnews.com/story/0,2933,162325,00.html\n Again, my thanks to jyoshu for that one.\n /Edit\n \n Another link which comes to mind - http://www.gunowners.org/skeptic.htm\n \n It is my own view that you should not have your argument based entirely on statistics. Your speech will then be an endless laundry list of meaningless numbers, and no one will want to listen to it. I did the assault weapons ban in my high school debate class - the combination of too many statistics and an average speaking presence did not stand me in good stead. Make sure your arguments are something which people can care about.\n \n Can you tell us more about this speech? Is the topic just \"having guns?\" If not, than how is it phrased? Did your teacher express any views or recommendations? How long is it? What sort of time frame do you have in? I for one will give as much help as I can. Remember - as long as you have written it yourself, there is no rule against running it past as many people as you can. Not to sound arrogant, but I am especially good with grammar and proper phrasing. I'd be more than happy to proofread for you, if you like. I'm in my third year of college (major is Information Technology), so I have some experience in writing papers, though less so in making speeches/presentaions.\n \n \nIn my humble opinion.....because there are none! You could do a much more compelling speech as to why not have guns...especially if small children are invovled...especially when guns are so incredibly easy to get.....ask your local postman!\n\n Your opinion doesn't seem so humble to me. It's also wrong. Most especially when children are involved, it is of critical importance to possess guns. There are a lot of sickos and pedophiles out there. Would your child be better served by having a gun in the house, or by being kidnapped and murdered? Don't tell me it doesn't happen. We hear dozens of these cases on the news - and that's only a tiny fraction of them.\n \n I would present you with one young father's reason for carrying a gun.\n http://www.packing.org/community/general/listview/4320\n \n I also challenge you to refute this. That image is one of the most eloquent arguments for having a gun which I have ever seen. I don't have children, but I likely will in future. And they deserve to be protected.\n \n Some people will say that arguments about guns should not be made on emotion. I disagree totally. Humans live by emotions - not numbers. The number of children kidnapped or killed by criminals has only abstract meaning until one's own is among them. Guns are meaningless in and of themselves. Only innocent lives matter, and there comes a time when force must be used to proect those innocents.\n \n I see no reason whatsoever not to have a gun except:\n - irrational fear of weapons,\n - willful disregard for innocent life,\n - the desire to be helpless,\n - and, the fear of responsibility.", 
   {}, 
   171849, 
   null, 
   1131097620.0
  ], 
  [
   179018, 
   null, 
   "coolcodemn3", 
   "I love when people like joebrummer quote becuase it makes us anti-gun control supporters look good.", 
   {}, 
   177037, 
   null, 
   1131872640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Help Me Please", 
  "url": "http://www.4forums.com/political/gun-control-debates/6649-help-me-please.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 6649, 
  "discussion_files": [
   [
    "3090.html", 
    "http://www.4forums.com/political/gun-control-debates/6649-help-me-please-print.html"
   ]
  ], 
  "identifier": 6649
 }
]