[
 [
  [
   172131, 
   null, 
   "bmittking", 
   "The original thread was called \"Ask a Jew\", but since some posters have strayed from the original topic, I've created this new thread.\n \n For those of you who are newcomers of the thread, for background read \"Ask a Jew\" pages 1-7.\n \n \"Ask a Jew\" will now continue with it's original topic.", 
   {
    "post_info": {
     "post_title": "Continued Debate...ask a Jew"
    }
   }, 
   null, 
   null, 
   1129693680.0
  ], 
  [
   172132, 
   null, 
   "bmittking", 
   "The Dead Sea Scrolls \n \n \"The Crucified Messiah\" Scroll\n \n It is a five line scroll containing information about the death of the Messiah. It refers to \"the Prophet Isaiah\" and the Messianic prophecy in Isaiah 53 that identifies the Messiah as the one who will suffer for the sins of His people.\n \n It mentions the Messiah as the shoot of Jesse, the Branch of David, and also that He was pierced and wounded. Note the Messianic prophecy in Psalms 22:16 - \"They pierced my hands and feet.\" Also see Jeremiah 23:5 - \"I will raise unto David a righteous branch.\"\n \n The scroll identified the Messiah as \"the sceptre\" which most likely refers to the Genesis 49:10 prophecy, \"The sceptre shall not depeart from Judah, nor a lawgiver from between His feet, until Shiloh come; and unto Him shall the gathering of the people be.\" \n \n http://members.aol.com/acoxon1274/c...iah_scroll.html\n \n The Crucified Messiah Scroll\n \n In 1991 the world was astonished to hear that one of the unpublished scrolls included incredible references to a \"Messiah\" who suffered crucifixion for the sins of men. The scroll was translated by Dr. Robert Eisenman, Professor of Middle East Religions of California State University. He declared, \"The text is of the most far-reaching significance because it shows that whatever group was responsible for these writings was operating in the same general scriptural and Messianic framework of early Christianity.\" Although the original scroll team still claimed that there was no evidence about early Christianity in the unpublished scrolls, this new scroll totally contradicted their statements. This single scroll is earth-shaking in its importance. As Dr. Norman Golb, Professor of Jewish History at the University of Chicago said, \"It shows that contrary to what some of the editors said, there are lots of surprises in the scrolls, and this is one of them.\"\n \n This remarkable five-line scroll contained fascinating information about the death of the Messiah. It referred to \"the Prophet Isaiah\" and his Messianic prophecy (Chapter 53) that identified the Messiah as one who will suffer for the sins of his people. This scroll provides an amazing parallel to the New Testament revelation that the Messiah would first suffer death before He would ultimately return to rule the nations.\n \n http://members.surfeu.fi/foragnosti...sea_scrolls.htm\n \n Ask a Jew? Why did the Essenes (Jews) of the 1st century B.C. and A.D. believe in these apparent Christian beliefs?\n\n One thing I notice about this scroll is that it was probably written by Jesus's followers.", 
   {
    "unicode_changes_made": true
   }, 
   172131, 
   null, 
   1129693980.0
  ], 
  [
   172136, 
   null, 
   "Easyrider", 
   "One thing I notice about this scroll is that it was probably written by Jesus's followers.\n\n \n Nope, unless you're prepared to admit that written evidence of Jesus existed before 50 A.D. You can't have it both ways.\n \n Now, yon Trebor says that prophecy disappeared with the Old Testament. Yet we find the following:\n \n Although not widely known, many Jews believed that the more direct forms of prophecy still existed as late as the middle ages; a few medieval rabbis in this era were thought to be prophets by some, including Rabbeinu Tam. This is discussed by Rabbi Abraham Joshua Heschel in his book \"Prophetic Inspiration After the Prophets: Maimonides and Others\" (Ktav). \n \n http://www.faqs.org/faqs/judaism/FAQ/06-Jewish-Thought/section-11.html\n \n Now, is Trebor wrong or are the others wrong?", 
   {}, 
   172132, 
   null, 
   1129694220.0
  ], 
  [
   172143, 
   null, 
   "trebor", 
   "Nope, unless you're prepared to admit that written evidence of Jesus existed before 50 A.D. You can't have it both ways.\n \n Now, yon Trebor says that prophecy disappeared with the Old Testament. Yet we find the following:\n \n Although not widely known, many Jews believed that the more direct forms of prophecy still existed as late as the middle ages; a few medieval rabbis in this era were thought to be prophets by some, including Rabbeinu Tam. This is discussed by Rabbi Abraham Joshua Heschel in his book \"Prophetic Inspiration After the Prophets: Maimonides and Others\" (Ktav). \n \n http://www.faqs.org/faqs/judaism/FAQ/06-Jewish-Thought/section-11.html\n \n Now, is Trebor wrong or are the others wrong?\n\n \n \n The AGE of prophecy was over. If you notice, none of the books in the Nevi'im were written after the destruction fo the first temple.", 
   {}, 
   172136, 
   null, 
   1129695000.0
  ], 
  [
   172151, 
   null, 
   "Master_Shake", 
   "Nope, unless you're prepared to admit that written evidence of Jesus existed before 50 A.D. You can't have it both ways.\n\n I didn't hear anyone claiming that written evidence of Jesus didn't exist before 50 A.D.", 
   {}, 
   172136, 
   null, 
   1129695720.0
  ], 
  [
   172155, 
   null, 
   "bmittking", 
   "Nope, unless you're prepared to admit that written evidence of Jesus existed before 50 A.D. You can't have it both ways.\n\n When did I say it didn't???", 
   {}, 
   172136, 
   null, 
   1129696140.0
  ], 
  [
   172163, 
   null, 
   "trebor", 
   "I didn't hear anyone claiming that written evidence of Jesus didn't exist before 50 A.D.\n\n \n \n Well, IF the scroll was written before 50 A.D. It coudl have been written last late as 69 C.E.. \n \n However, , like I said.. that scroll did not mention names. It used titles, so who the 'teacher of riightousness' was is a matter of speculation. HOwever, if you read about the items in the scroll.. there are soem facts about the 'teacher of rightiousness'.\n \n The scroll starts as follows\n \n \n\n \"And in the age of wrath, three hundred and ninety years after He had given them into the hand of the King Nebuchadnezzar of Babylon, He visited them, and he caused a plant root to spring from Israel and Aaron to inherit His land and to prosper on the good things of His earth. And they perceived their iniquity and recognized that they were guilty men, yet for many years they were like blind men groping for the way.\n \n \"And God observed their deeds, that they sought Him with a whole heart, and He raised them a Teacher of Righteousness to guide them in the way of His heart.\" \n \n\n \n We know the time of King Nebuchadnezzar, so the 'Teacher of Rightousness was from between 200 B.C.E. to about 175 B.c.e. \n \n Of course, the style and theology in the scrolls point to a later date of it being written. I suspect it was near the date of the Jewish revolt. They were very much anti-temple, and did want to have a new Jewish King. I would not be surprised if they were the proto-christians.", 
   {}, 
   172151, 
   null, 
   1129697340.0
  ], 
  [
   172184, 
   null, 
   "Big_Bear_Scot", 
   "Is there any religious obligations to marry within your own faith ?\n \n Also if I(just for example) was to convert to Judaism what is the process involved ? Would I have to go through all the rituals that Jewish people had to go through in their life(i.e. Bar mitzva). ?", 
   {}, 
   172163, 
   null, 
   1129714560.0
  ], 
  [
   172190, 
   null, 
   "trebor", 
   "Is there any religious obligations to marry within your own faith ?\n \n Also if I(just for example) was to convert to Judaism what is the process involved ? Would I have to go through all the rituals that Jewish people had to go through in their life(i.e. Bar mitzva). ?\n\n \n I can't say there are religious obligations to marry within your own faith, but there are certainly FAMILY pressures amoung many of the more religious Jewish families. \n \n As for the rituals.. the only one that could be viewed with trepidation is curcumcision. This site has the process. \n \n http://www.convert.org/process.htm", 
   {}, 
   172184, 
   null, 
   1129731840.0
  ], 
  [
   172193, 
   null, 
   "Big_Bear_Scot", 
   "\n As for the rituals.. the only one that could be viewed with trepidation is curcumcision. This site has the process. \n \n \n Crosses legs emoticon_frazzled \n \n Just another quick Question, in your link it mentions the various Different froms of Judaism(reform, orthodox etc). \n \n How do Messanic Jews fit into those categories ? and what do other branches of Judaism think of Messanic Jews ?", 
   {}, 
   172190, 
   null, 
   1129734240.0
  ], 
  [
   172194, 
   null, 
   "trebor", 
   "Crosses legs emoticon_frazzled \n \n Just another quick Question, in your link it mentions the various Different froms of Judaism(reform, orthodox etc). \n \n How do Messanic Jews fit into those categories ? and what do other branches of Judaism think of Messanic Jews ?\n\n \n \n Simple, they don't fit it. They are not considered part of the Jewish religion. A large number of \"Messanic Jews\" don't even have jewish heritiage, and the \"Jews for Jesus\" are funded by the southern baptists as part of the \"Witness\" program to the Jews.", 
   {}, 
   172193, 
   null, 
   1129734840.0
  ], 
  [
   172200, 
   null, 
   "simone", 
   "Now I know that no one can claim to speak for Jews, but I wonder if there has been any commentary on the way that extremist end-time Christians have co-opted Israel and the Jews as figuring in the final days of the world as these misled folk like to dramatically visualize it?", 
   {}, 
   172194, 
   null, 
   1129737300.0
  ], 
  [
   172206, 
   null, 
   "trebor", 
   "Now I know that no one can claim to speak for Jews, but I wonder if there has been any commentary on the way that extremist end-time Christians have co-opted Israel and the Jews as figuring in the final days of the world as these misled folk like to dramatically visualize it?\n\n \n I have seen some.. mainly talking 'the uneasy alliance'.. and how many of the jews in Israel acknowledge it, but are uneasy it Evangalistic reasons for it.", 
   {}, 
   172200, 
   null, 
   1129738260.0
  ], 
  [
   172214, 
   null, 
   "bmittking", 
   "Actually, you can't actually convert to Judaism unless your parent(s) practice it. If you want to practice Judaism, that's fine, and your kids will be Jewish, but you won't.\n \n The messianic Jews and Jews for Jesus are just a ploy working for the Christians. It's basically pretending to be a Jew to convert real Jews to Christianity.", 
   {}, 
   172193, 
   null, 
   1129740540.0
  ], 
  [
   172224, 
   null, 
   "trebor", 
   "Actually, you can't actually convert to Judaism unless your parent(s) practice it. If you want to practice Judaism, that's fine, and your kids will be Jewish, but you won't.\n \n The messianic Jews and Jews for Jesus are just a ploy working for the Christians. It's basically pretending to be a Jew to convert real Jews to Christianity.\n\n \n \n The www.convert.org web site, which gives the process on how to convert to judaism, and how to consider, seems to be of the opinion you can be of the Jewish faith by conversion. \n \n I think the confusion there is being jewish Culturally, and being of the jewish faith. People confuse the two.", 
   {}, 
   172214, 
   null, 
   1129742400.0
  ], 
  [
   172237, 
   null, 
   "Big_Bear_Scot", 
   "I was just curious, I was unaware of the link between Religious-Right and Messianic Jews in the US. I think it might different in the UK, we don't have anything that compares to the Religious-Right in America. \n \n I first became aware of Messianic Jews in a documentary I had seen in Religious Education class in the 90s when I was at Secondary School. It followed a family of Messianic Jews in the UK, it seemed to me at the time they where basically Christians who followed most the customs of Judaism such as Passover, Kosher food and they carried out their Sermons in Hebrew.", 
   {}, 
   172224, 
   null, 
   1129747020.0
  ], 
  [
   172248, 
   null, 
   "trebor", 
   "I was just curious, I was unaware of the link between Religious-Right and Messianic Jews in the US. I think it might different in the UK, we don't have anything that compares to the Religious-Right in America. \n \n I first became aware of Messianic Jews in a documentary I had seen in Religious Education class in the 90s when I was at Secondary School. It followed a family of Messianic Jews in the UK, it seemed to me at the time they where basically Christians who followed most the customs of Judaism such as Passover, Kosher food and they carried out their Sermons in Hebrew.\n\n \n \n That is probably about right. I don't belive all \"messanic Jews\" are associated with the J4J, and as a matter of fact, some try to disassocate themselves from that movement. \n \n However, they are still not considered part of the Jewish faith by the mainstream Jews. \n \n I do know of a few ex-christians that went to the 'messy' temples, and then went onto giving up their belief in the divinty of Jesus, and converted to Orthodox Judaism. .. I always found that ironic, since they were drawn into the 'messanic jewish' tradition by a group trying to convert Jews to Christianity.", 
   {}, 
   172237, 
   null, 
   1129749060.0
  ], 
  [
   172255, 
   null, 
   "Clive14", 
   "Another question: eating pork.\n \n I think the OT (and thus presuambly Jewish religious texts) specifically bans the consumption of pork. Given that these days we understand why pork is \"unclean\" and know how to safely produce, store and consume pig meat without getting ill, is there any reason - beyond subservience to an old text - for modern Jews to carry on avoiding pork?", 
   {}, 
   172248, 
   null, 
   1129752900.0
  ], 
  [
   172265, 
   null, 
   "trebor", 
   "Another question: eating pork.\n \n I think the OT (and thus presuambly Jewish religious texts) specifically bans the consumption of pork. Given that these days we understand why pork is \"unclean\" and know how to safely produce, store and consume pig meat without getting ill, is there any reason - beyond subservience to an old text - for modern Jews to carry on avoiding pork?\n\n \n The kosher laws were not because of it being 'unclean' in the thought that you are thinking of. The actual word used in the torah is 'Tovah', which means rituralistically unclean. \n \n The notion that using this as a way of life shows devotion to god.. it didn't really have anything to do with health to begin with. The reason why some things are kosher and other things are not is lost. But the reason is ritualistic, rather than health.\n \n THere are some universals. Preditors and scavangers are on the ritutalistically unclean list. There are also a few other exceptions.", 
   {}, 
   172255, 
   null, 
   1129755000.0
  ], 
  [
   172473, 
   null, 
   "Clive14", 
   "Moving on from that, waht actually is kosher? I used to think it refered to animals being killed and meat prepared in the right ways (like the Islamic halal methods). But in my local supermarket, there are kosher biscuits for example. What determines if something is kosher?", 
   {}, 
   172265, 
   null, 
   1129815000.0
  ], 
  [
   172475, 
   null, 
   "trebor", 
   "Moving on from that, waht actually is kosher? I used to think it refered to animals being killed and meat prepared in the right ways (like the Islamic halal methods). But in my local supermarket, there are kosher biscuits for example. What determines if something is kosher?\n\n \n \n \"Kosher\" actually means proper or correct. For example, you can not mix milk with meat and have it be kosher. So, when there are kosher biscuits , they do not have animal lard and milk in it at the same time. Items that are processed that are kosher basically have been reviewed so that the dietary laws are followed.. \n \n Families that keep kosher actually keep two sets of dishes.. one for milk dishes, and the other for meat dishes. These are the general rules\n \n \n\n # Certain animals may not be eaten at all. This restriction includes the flesh, organs, eggs and milk of the forbidden animals.\n # Of the animals that may be eaten, the birds and mammals must be killed in accordance with Jewish law.\n # All blood must be drained from the meat or broiled out of it before it is eaten.\n # Certain parts of permitted animals may not be eaten.\n # Meat (the flesh of birds and mammals) cannot be eaten with dairy. Fish, eggs, fruits, vegetables and grains can be eaten with either meat or dairy. (According to some views, fish may not be eaten with meat).\n # Utensils that have come into contact with meat may not be used with dairy, and vice versa. Utensils that have come into contact with non-kosher food may not be used with kosher food. This applies only where the contact occurred while the food was hot.\n # Grape products made by non-Jews may not be eaten.\n \n\n \n It's not easy being Kosher. A lot more Reform and Conservative Jews do not keep kosher", 
   {}, 
   172473, 
   null, 
   1129815480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Continued Debate...ask a Jew", 
  "url": "http://www.4forums.com/political/religion-debates/6654-continued-debate-ask-jew.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 6654, 
  "discussion_files": [
   [
    "31219.html", 
    "http://www.4forums.com/political/religion-debates/6654-continued-debate-ask-jew-print.html"
   ], 
   [
    "31220.html", 
    "http://www.4forums.com/political/religion-debates/6654-continued-debate-ask-jew-2-print.html"
   ]
  ], 
  "identifier": 6654
 }
]