[
 [
  [
   172789, 
   null, 
   "Siegfriedson", 
   "In many European countries, if you cast doubt on the \"official\" version of events that occurred during World War II, you can be arrested, fined, imprisoned...\n \n Belgian Historian Arrested at Amsterdam Airport\n \n Belgian negationist and extreme-rights publicist Siegfried Verbeke has been arrested at Schiphol Airport in Amsterdam and might be extradited to Germany for trial.\n \n A German judge issued an international arrest warrant against Verbeke at the end of last year because he cast doubt over the internet whether the Nazis actually killed six million Jews in World War II.\n \n Germany asked Belgium to extradite Verbeke, of Kortrijk, last year but a Belgian judge refused the request, Belgian newspaper 'De Standaard' reported on Friday.\n \n Verbeke has already been convicted in Belgium for negationism. The appeals court in Antwerp sentenced him in April this year to a maximum one-year jail term and a EUR 2,500 fine for breaching negationist and anti-racism laws.\n \n More:\n \n http://www.nationalvanguard.org/story.php?id=5597\n \n http://www.rense.com/general60/arr.htm\n \n \n Please visit these pages if you are curious as to why some people \"deny\" the Holocaust:\n \n What is Revisionism?\n \n Introductory essays to Holocaust revisionism\n \n \n \n .", 
   {
    "post_info": {
     "post_title": "Man Arrested; He &quot;Denied the Holocaust&quot;"
    }
   }, 
   null, 
   null, 
   1129918740.0
  ], 
  [
   172794, 
   null, 
   "Eddie", 
   "Haha... You better not visit Europe anytime time soon then Siegfriedsson :p", 
   {}, 
   172789, 
   null, 
   1129919460.0
  ], 
  [
   172796, 
   null, 
   "JPSartre12", 
   "In many European countries, if you cast doubt on the \"official\" version of events that occurred during World War II, you can be arrested, fined, imprisoned...\n \n Belgian Historian Arrested at Amsterdam Airport\n \n Belgian negationist and extreme-rights publicist Siegfried Verbeke has been arrested at Schiphol Airport in Amsterdam and might be extradited to Germany for trial.\n \n A German judge issued an international arrest warrant against Verbeke at the end of last year because he cast doubt over the internet whether the Nazis actually killed six million Jews in World War II.\n \n Germany asked Belgium to extradite Verbeke, of Kortrijk, last year but a Belgian judge refused the request, Belgian newspaper 'De Standaard' reported on Friday.\n \n Verbeke has already been convicted in Belgium for negationism. The appeals court in Antwerp sentenced him in April this year to a maximum one-year jail term and a EUR 2,500 fine for breaching negationist and anti-racism laws.\n \n More:\n \n http://www.nationalvanguard.org/story.php?id=5597\n \n http://www.rense.com/general60/arr.htm\n \n \n Please visit these pages if you are curious as to why some people \"deny\" the Holocaust:\n \n What is Revisionism?\n \n Introductory essays to Holocaust revisionism\n \n .\n\n \n And many Europeans in this forum talk about US' lack of personal freedom. emoticon_rolleyes", 
   {}, 
   172789, 
   null, 
   1129919640.0
  ], 
  [
   172820, 
   null, 
   "Wez", 
   "And many Europeans in this forum talk about US' lack of personal freedom. emoticon_rolleyes\n\n You believe this?\n \n Cool.\n \n I have a magic ball which will bring you eternal happiness and if you send me a cheque for $1,000 dollars, you can have it. PM me for my address.:p\n \n -Wez", 
   {}, 
   172796, 
   null, 
   1129923960.0
  ], 
  [
   172822, 
   null, 
   "sinjin", 
   "You can visit Daddy on Saturdays.", 
   {}, 
   172820, 
   null, 
   1129924080.0
  ], 
  [
   172861, 
   null, 
   "JPSartre12", 
   "You believe this?\n \n Cool.\n \n I have a magic ball which will bring you eternal happiness and if you send me a cheque for $1,000 dollars, you can have it. PM me for my address.:p\n \n -Wez\n\n \n Are there not laws in some European countries banning the sale of Nazi memorabelia? I know Germany has such a law for a fact and I believe that France has \"hate speech laws\", so why would I find this story incredulous? emoticon_confused", 
   {}, 
   172820, 
   null, 
   1129930560.0
  ], 
  [
   172870, 
   null, 
   "Wez", 
   "Are there not laws in some European countries banning the sale of Nazi memorabelia? I know Germany has such a law for a fact and I believe that France has \"hate speech laws\", so why would I find this story incredulous? emoticon_confused\n\n Maybe if it wasn't from national vanguard I'd be more inclined to believe it's giving the whole picture.\n \n -Wez", 
   {}, 
   172861, 
   null, 
   1129931400.0
  ], 
  [
   172964, 
   null, 
   "JPSartre12", 
   "Maybe if it wasn't from national vanguard I'd be more inclined to believe it's giving the whole picture.\n \n -Wez\n\n \n I've seen references to the arrest on a variety of websites, but nothing that I'm familiar with. No Fox, CNN, BBC, etc.", 
   {}, 
   172870, 
   null, 
   1129958460.0
  ], 
  [
   173970, 
   null, 
   "Obvious Child", 
   "Wikipedia article \n \n Sadly, Siegfreidson is at least partially right on this.\n \n 'Nazi iconography remains to this day heavily restricted in Germany. As German law forbids the production of Nazi devotionalia, such items come into the country mostly (illegally) from the USA and northern European countries. Rock bands such as Landser have been outlawed in Germany, yet bootleg copies of their albums printed and pressed in the United States and other countries are still sold. Study of neo-Nazi literature and propaganda regarding these enterprises, including handbooks and flyers offering employment for such activities show that to Nazis, these actions (though strictly illegal) are viewed as being virtuous and worthy, and it is not looked upon as smuggling contraband, but instead is seen as supporting fellow resistance fighters who struggle under an oppressive regime; much the same way the European resistance viewed their own activities against the Nazis during World War II. Currently, Neo-Nazi websites mostly depend on hosting in the USA and Canada and use other terms for Nazi ideas and symbols. They also invent new symbols, or choose other pre-christian European symbolism reminiscent of the swastika and other symbols used by the Nazis, e.g. the sun disc, sun wheel, hooked cross, wolf's cross, wolf's hook, black sun, or dark star (see fascist symbolism).'\n '", 
   {}, 
   172964, 
   null, 
   1130244720.0
  ], 
  [
   173984, 
   null, 
   "Wez", 
   "This was the bit I doubted: \"A German judge issued an international arrest warrant against Verbeke at the end of last year because he cast doubt over the internet whether the Nazis actually killed six million Jews in World War II.\"\n \n -Wez", 
   {}, 
   173970, 
   null, 
   1130249160.0
  ], 
  [
   174392, 
   null, 
   "Obvious Child", 
   "Can't find reference to this outside of Neo-Nazi websites, but it's possible. One detail though: he's not a historian: he's a Nazi publicist. His work will, if presented historically at all, probably be beyond the pale of acceptable scholarship: like David Irving's holocaust denial and exagerration of the bombing of Dresden, both of which are wrongly referenced and footnoted. The 'casting doubt' may contain both outright lies and abusive language:\n \n 'As we can't be sure if these figures are precisely correct, there must be an evil Zionist conspiracy of Jews still trying to bring down Europe and infect it with their perverted beliefs'.\n \n That kinda thing.", 
   {}, 
   173984, 
   null, 
   1130335320.0
  ], 
  [
   176666, 
   null, 
   "Siegfriedson", 
   "Siegfried Verbeke Deported to Germany\n \n His Crime: He Challenged the Holocaust Story\n \n More:\n \n http://www.nationalvanguard.org/story.php?id=6661\n \n \n \n .", 
   {}, 
   174392, 
   null, 
   1130981520.0
  ], 
  [
   176907, 
   null, 
   "Wez", 
   "Good post. emoticon_rolleyes \n \n -Wez", 
   {}, 
   176666, 
   null, 
   1131060540.0
  ], 
  [
   176912, 
   null, 
   "sinjin", 
   "I can't read the link as my work computer has websense and blocks sites that contain \"Racism and Hate\". Websense designation, not mine.", 
   {}, 
   176907, 
   null, 
   1131060840.0
  ], 
  [
   177035, 
   null, 
   "Iuris", 
   "Um, Wez, this is actually true, read the Wikipedia article on the guy.\n \n So what? In the 20th century humanity showed how terrible the mixture of our dark side and modern technology can become. All humanity should learn a lesson from it, about what can happen when hatred based ideologies are left unchecked (provided the conclusion is that this was a BAD thing). So we forbid people from resurrecting that very same ideology. Sensible thinking. It's the US willingness to tolerate people like the Westborough baptist church that worries me more.", 
   {}, 
   176912, 
   null, 
   1131096120.0
  ], 
  [
   177214, 
   null, 
   "Wez", 
   "Um, Wez, this is actually true, read the Wikipedia article on the guy.\n\n I read the link given, but my point stands.\n \n \nThis was the bit I doubted: \"A German judge issued an international arrest warrant against Verbeke at the end of last year because he cast doubt over the internet whether the Nazis actually killed six million Jews in World War II.\"\n\n \n -Wez", 
   {}, 
   177035, 
   null, 
   1131148800.0
  ], 
  [
   177815, 
   null, 
   "OccamsRazor", 
   "Wikipedia article \n \n Sadly, Siegfreidson is at least partially right on this.\n\n \n Hmmmm. Siegoid got the bit right when he said Siegfried Verbeke was arrested on a German Warrant but to say it was just because he denies the holocaust is patently untrue. It is the activities he been active in to diseminate his views that have landed him in bother. If he chooses to distribute Pro-Nazi material in Germany he does so knowing there are laws in place that prohibt such actions.\n \n Returning to our good friend wikipedia, a list of Verbeke's misdemeanors over the years:\n \n http://en.wikipedia.org/wiki/Siegfried_Verbeke\n \n The only thing that is different with his arrest this time round is another country is after him to punish his odious actions.", 
   {}, 
   173970, 
   null, 
   1131417660.0
  ], 
  [
   179906, 
   null, 
   "OccamsRazor", 
   "Update- David Irving, another person wrote that the holocaust never happened has just been nicked in Austria:\n \n http://news.bbc.co.uk/1/hi/world/europe/4446646.stm\n \n Quite pleasing, IMO.", 
   {}, 
   177815, 
   null, 
   1132251600.0
  ], 
  [
   180004, 
   null, 
   "JPSartre12", 
   "Update- David Irving, another person wrote that the holocaust never happened has just been nicked in Austria:\n \n http://news.bbc.co.uk/1/hi/world/europe/4446646.stm\n \n Quite pleasing, IMO.\n\n \n I find it quite disturbing that you condone anti-free speech laws. Just because some kook says that something didn't happen, doesn't make him a criminal in my country.", 
   {}, 
   179906, 
   null, 
   1132282680.0
  ], 
  [
   180040, 
   null, 
   "Iuris", 
   "And I find it disturbing that in your country you let hate speech go rampant. Not that it stopped it from cracking down on communists, though...\n \n Public opinion is susceptible to manipulation and Europe still remembers what happened the last time things got out of control. WWII was fought on our territory, and it hurt. A lot. \n \n The US has never fully grasped how much it hurt. It hasn't fought a serious war on its heartland for a century and a half. It is all too easy to remember the devastation a war causes, and I think this is one of the reasons why the US is still so belligerent and considers the EU hesitant and irrationally pacifistic.\n \n As for Irving, I'd like to point out one thing: try the concept of \"holocaust belittling\" as the term that explains why the line between holocaust denial and holocaust revisionism leaves so many who refer to themselves as revisionists on the other side. And before assuming their honesty and probity, look at the company they keep, and the audience that listens to them.", 
   {}, 
   180004, 
   null, 
   1132304340.0
  ], 
  [
   180074, 
   null, 
   "Alan Ryan", 
   "That public opinion is susceptible to manipulation is not a good argument for the suppression of an opinion - even the lunatic opinion of someone (like David Irving) who denies the actuality of one of the most well documented events in modern history.", 
   {}, 
   180040, 
   null, 
   1132331760.0
  ], 
  [
   180092, 
   null, 
   "Obvious Child", 
   "Irving didn't 'deny the actuality', he denied\n \n 1) that it was any near as widespread\n 2) that Hitler knew about it.\n \n As far as I know, he was more of a hero-worshipper of Hitler than an anti-Semite, and isn't particularly prone to referring to 'Zionist conspiracies' etc. A holocaust belittler, no doubt, and worse still an intellectually dishonest historian. But we cannot deny the right to argue a particular case if it is done honestly and without inciting hatred. That just adds to the 'conspiracy'.", 
   {}, 
   180074, 
   null, 
   1132336260.0
  ], 
  [
   180098, 
   null, 
   "OccamsRazor", 
   "I find it quite disturbing that you condone anti-free speech laws. Just because some kook says that something didn't happen, doesn't make him a criminal in my country.\n\n \n I cannot think of an adequate example from the US to compare to the millions killed by the extermination programs of the Nazis, but I'll try. Do you think it acceptable that someone publish material saying the number of casualties from the 11th September attacks was \"inflated\" or perhaps that Pearl Harbour never happened?\n \n Your statement is big on principle but not connected to reality- as Iuris said perhaps it is because of your perspective.\n \n Anyway, more on Irving:\n \n http://news.bbc.co.uk/1/hi/world/europe/4448896.stm", 
   {}, 
   180004, 
   null, 
   1132337700.0
  ], 
  [
   180099, 
   null, 
   "Alan Ryan", 
   "I don't know whether Irving will defend himself - if the matter comes to trial - on the grounds that the charge of holocaust denial is inappropriate because his view only amounts to a \"belittlement\" of it (which is an equivocation that amounts to at least denying a fragment of the actuality). \n \n There should be a presumption, in democracies, in favour of the free expression of opinion - even inflammatory opinions that do not correspond to the most easily verifiable facts.", 
   {}, 
   180092, 
   null, 
   1132338000.0
  ], 
  [
   180101, 
   null, 
   "OccamsRazor", 
   "Irving didn't 'deny the actuality', he denied\n \n 1) that it was any near as widespread\n 2) that Hitler knew about it.\n \n As far as I know, he was more of a hero-worshipper of Hitler than an anti-Semite, and isn't particularly prone to referring to 'Zionist conspiracies' etc. A holocaust belittler, no doubt, and worse still an intellectually dishonest historian. But we cannot deny the right to argue a particular case if it is done honestly and without inciting hatred. That just adds to the 'conspiracy'.\n\n \n Denying extermination was as widespread as history recorded is denying the actuality, at least to some of the victims. As to Hitlers non-involvement that is an easy thing to promote- the vast majority of high level documents on extermination were destroyed (some things surived such as the transcripts of the Wannsee Conference) To say they simply never existed is ludicrous considering Nazi Germany's obsession with paperwork and documentation.", 
   {}, 
   180092, 
   null, 
   1132338120.0
  ], 
  [
   180105, 
   null, 
   "billsco", 
   "OR, \n \n Sorry to post off-topic, but I just wanted to give you a heads up that the debate you're judging is now on. I tried to PM you but it didn't go through.\n \n Thanks.", 
   {}, 
   180101, 
   null, 
   1132338900.0
  ], 
  [
   180108, 
   null, 
   "OccamsRazor", 
   "OR, \n \n Sorry to post off-topic, but I just wanted to give you a heads up that the debate you're judging is now on. I tried to PM you but it didn't go through.\n \n Thanks.\n\n \n Cheers billsco, I'll take a looksie now.", 
   {}, 
   180105, 
   null, 
   1132339320.0
  ], 
  [
   180109, 
   null, 
   "Alan Ryan", 
   "Denying extermination was as widespread as history recorded is denying the actuality, at least to some of the victims. As to Hitlers non-involvement that is an easy thing to promote- the vast majority (some things surived such as the transcripts of the Wannsee Conference) of high level documents on extermination were destroyed. To say they simply never existed is ludicrous considering Nazi Germany's obsession with paperwork and documentation.\n\n I would not for a second be prepared to argue that Hitler was not aware of the extermination programme. However, it is an unfortunate fact, I believe, that no documentary evidence exists - i.e. an explicit instruction signed by Hitler that authorises the destruction of the Jews - which proves beyond all doubt that he was ultimately responsible for the holocaust.\n \n The fact that the Nazi regime was obsessed with paperwork does not justify an inference that documents necessarily existed which (had they survived) would have proved Hitler's culpability. It's just as likely that Hitler made sure that his hand could not be detected at Wannsee or anywhere else.", 
   {}, 
   180101, 
   null, 
   1132339320.0
  ], 
  [
   180140, 
   null, 
   "Obvious Child", 
   "Denying extermination was as widespread as history recorded is denying the actuality, at least to some of the victims. \n\n History in the academic sense is based on debate. Why should this topic alone be off limit for such debate? If the death toll was lower than we first thought at any particular location, or time, and there is ample evidence for this, why should this research not be allowed? There is merit in trying to achieve the impossible goal of historical truth, and it does not \"deny the actuality\". Instead, open debate is necessary to foster understanding on this, and dismiss the idea there is some \"conspiracy\" or manipulation of knowledge about this. If we deliberately mislead people on any historical topic, we are no better than Irving, with his poor translations and misrepresentation of sources. The only way to defeat such XXXXXX as Irving is to allow open debate. \n \n Irving's work has little, if any, historical merit. It attracts such attention because it is extremist and he has no evidence for it. There are plenty of reasonable, non-prejudiced historians arguing for more moderate changes of statistics on this with ample evidence to back them up, who do not attract such criticism.", 
   {}, 
   180101, 
   null, 
   1132348260.0
  ], 
  [
   180189, 
   null, 
   "JPSartre12", 
   "I cannot think of an adequate example from the US to compare to the millions killed by the extermination programs of the Nazis, but I'll try. Do you think it acceptable that someone publish material saying the number of casualties from the 11th September attacks was \"inflated\" or perhaps that Pearl Harbour never happened?\n \n Your statement is big on principle but not connected to reality- as Iuris said perhaps it is because of your perspective.\n \n Anyway, more on Irving:\n \n http://news.bbc.co.uk/1/hi/world/europe/4448896.stm\n\n \n I'm sorry, but I have ZERO problem with some nutjob spouting ridiculous assertions in public. After all, I've listened to Louis Farakan say that the levy in NO was blown up by whites to flood out poor blacks, the mayor of Detroit say that Detroit's problems are due to white surburbanites, KKK members claiming white supremacy, people claim to have been abducted by aliens, etc., I don't need my government protecting me from absurd monologues, that's going too far IMO. Now, if you're telling me that Europeans are much more gullable than Americans and need that sort of censorship, well then, that's your burden to bear. emoticon_wow", 
   {}, 
   180098, 
   null, 
   1132357140.0
  ], 
  [
   180275, 
   null, 
   "Alan Ryan", 
   "I'm sorry, but I have ZERO problem with some nutjob spouting ridiculous assertions in public. After all, I've listened to Louis Farakan say that the levy in NO was blown up by whites to flood out poor blacks, the mayor of Detroit say that Detroit's problems are due to white surburbanites, KKK members claiming white supremacy, people claim to have been abducted by aliens, etc., I don't need my government protecting me from absurd monologues, that's going too far IMO. Now, if you're telling me that Europeans are much more gullable than Americans and need that sort of censorship, well then, that's your burden to bear. emoticon_wow\n\n \n If you expanded your list of \"nutjobs\" a little more, JP, you would do a lot to confirm the European prejudice that America is a \"land of the freaks and home of the bizarre\". But I agree entirely with your implied defence of free speech - even when the most absurd and poisonous opinions are expressed.", 
   {}, 
   180189, 
   null, 
   1132398960.0
  ], 
  [
   180278, 
   null, 
   "Big_Bear_Scot", 
   "If you expanded your list of \"nutjobs\" a little more, JP, you would do a lot to confirm the European prejudice that America is a \"land of the freaks and home of the bizarre\". But I agree entirely with your implied defence of free speech - even when the most absurd and poisonous opinions are expressed.\n\n \n What happens if that 'free' speech inspires an act of violence on a minority for example ?\n \n There has always been a limit on free speech you can not yell 'fire' in a packed cinema, during the cold war you could not profess Communist views and then try other throw the US Government, if you where an Irish Republican in the 70 and 80s you would not be heard on the British Air Waves and now if you support Islamic Terrorism you are in danger of being locked away. \n \n Are those any different from what David Irving espouses?", 
   {}, 
   180275, 
   null, 
   1132406340.0
  ], 
  [
   180302, 
   null, 
   "Alan Ryan", 
   "What happens if that 'free' speech inspires an act of violence on a minority for example ?\n \n There has always been a limit on free speech you can not yell 'fire' in a packed cinema, during the cold war you could not profess Communist views and then try other throw the US Government, if you where an Irish Republican in the 70 and 80s you would not be heard on the British Air Waves and now if you support Islamic Terrorism you are in danger of being locked away. \n \n Are those any different from what David Irving espouses?\n\n \n I made it clear that I know Irving is talking and writing pernicious nonsense. I am not defending his views, but only the right to air them. Should it be a criminal offence to express barmy opinions ? The facts of history are there to refute him, and the ridicule of society should be his punishment.\n \n As far as I know, he has not incited violence towards any minority (which would put a different complexion on the case), but merely put forward a crackpot theory.", 
   {}, 
   180278, 
   null, 
   1132415100.0
  ], 
  [
   180438, 
   null, 
   "OccamsRazor", 
   "I would not for a second be prepared to argue that Hitler was not aware of the extermination programme. However, it is an unfortunate fact, I believe, that no documentary evidence exists - i.e. an explicit instruction signed by Hitler that authorises the destruction of the Jews - which proves beyond all doubt that he was ultimately responsible for the holocaust.\n \n The fact that the Nazi regime was obsessed with paperwork does not justify an inference that documents necessarily existed which (had they survived) would have proved Hitler's culpability. It's just as likely that Hitler made sure that his hand could not be detected at Wannsee or anywhere else.\n\n \n Well, I'd say your latter assertion is likely to be closest to the truth- steps were taken to ensure that no paper trail existed to implicate Hitler in the order to eliminate Jewsih people within Germany controlled territory. One could debate who destroyed the written evidence of this- was it a request by Hitler or actions by his subordinates to protect him from the illegal orders he issued.", 
   {}, 
   180109, 
   null, 
   1132445880.0
  ], 
  [
   180439, 
   null, 
   "OccamsRazor", 
   "History in the academic sense is based on debate. Why should this topic alone be off limit for such debate? If the death toll was lower than we first thought at any particular location, or time, and there is ample evidence for this, why should this research not be allowed? There is merit in trying to achieve the impossible goal of historical truth, and it does not \"deny the actuality\". Instead, open debate is necessary to foster understanding on this, and dismiss the idea there is some \"conspiracy\" or manipulation of knowledge about this. If we deliberately mislead people on any historical topic, we are no better than Irving, with his poor translations and misrepresentation of sources. The only way to defeat such XXXXXX as Irving is to allow open debate.\n \n Irving's work has little, if any, historical merit. It attracts such attention because it is extremist and he has no evidence for it. There are plenty of reasonable, non-prejudiced historians arguing for more moderate changes of statistics on this with ample evidence to back them up, who do not attract such criticism.\n\n \n I agree entirely with your take on the process of history and how the conclusions of the past should be able to stand the test of re-evaluation and the emergence of new evidence(s) in the present.\n \n Where I disagree is the notion that holocaust deniers somehow count as legitimate historians. They are operating from that most intellecually dishonest of positions where they have a conclusion first (i.e. The Holocaust/Nazi extermination did not happen, or happened on a very limited scale) and find evidence to back that view and then offer their analysis.\n \n That is not to say that people like Irving have not promoted laudable efforts on the part of many to document the atrocities of the Nazi's for future generations, lest one of mankind's darkest episodes be forgotten or rewritten.", 
   {}, 
   180140, 
   null, 
   1132446480.0
  ], 
  [
   180441, 
   null, 
   "OccamsRazor", 
   "I'm sorry, but I have ZERO problem with some nutjob spouting ridiculous assertions in public. After all, I've listened to Louis Farakan say that the levy in NO was blown up by whites to flood out poor blacks, the mayor of Detroit say that Detroit's problems are due to white surburbanites, KKK members claiming white supremacy, people claim to have been abducted by aliens, etc., I don't need my government protecting me from absurd monologues, that's going too far IMO. Now, if you're telling me that Europeans are much more gullable than Americans and need that sort of censorship, well then, that's your burden to bear. emoticon_wow\n\n \n Ideas can be dangerous things- to suggest to the contary is to pretend extremists are ignored by default by the whole population, which they are not.\n \n As to how goverment should act on such matters is a difficult issue to address. I think the European countries who have laws against Holocaust denial do so for good reason, some of which I find difficult to have a perspective on (namely countries who were complicit with Nazi exterminations). In the UK now laws are being debated by Parliment that would make incitement to religious hatred illegal, and they proving to be highly controversial to say the least.\n \n You might be able to dismiss such attempts to curb the activities of people who promote the murder of others purely based on their religious belief/political persusion/ethnicity (as this is the intention) as inherently unworthy under the auspices of an affront to free speech but I cannot because the reality here is not black and white ;)", 
   {}, 
   180189, 
   null, 
   1132447440.0
  ], 
  [
   180455, 
   null, 
   "JPSartre12", 
   "Ideas can be dangerous things- to suggest to the contary is to pretend extremists are ignored by default by the whole population, which they are not.\n\n I don't believe in \"thought police\". The concept of the State telling me what I can and can't say is fundamentally against American heritage. If we believed that, we'd still be a colony of England and NOT the world's only superpower. People come to the US for its freedom not is oppression of free speech.\n \n\n As to how goverment should act on such matters is a difficult issue to address. I think the European countries who have laws against Holocaust denial do so for good reason, some of which I find difficult to have a perspective on (namely countries who were complicit with Nazi exterminations). In the UK now laws are being debated by Parliment that would make incitement to religious hatred illegal, and they proving to be highly controversial to say the least.\n \n You might be able to dismiss such attempts to curb the activities of people who promote the murder of others purely based on their religious belief/political persusion/ethnicity (as this is the intention) as inherently unworthy under the auspices of an affront to free speech but I cannot because the reality here is not black and white ;)\n\n \n You can have all of the anti-hate speech laws that you want in Europe, just don't export them over here. That's the kind of import that we don't need.", 
   {}, 
   180441, 
   null, 
   1132454340.0
  ], 
  [
   180496, 
   null, 
   "Alan Ryan", 
   "What the Irving case boils down to (I think) is the issue of criminalising thought.\n \n Suppose I claimed that slavery in America never existed - alleging perhaps that black people volunteered for servitude; or suppose I claimed that the famine in Ireland (in the 1840s) was entirely exaggerated and very few people had died as a result of English apathy and negligence etc., should I be locked up for expressing such grotesque opinions ?\n \n It should not be within the power of the state to suppress or censor opinions - no matter how offensive they appear to the \"enlightened\" liberal mind, or to the sensibilities of minorities. \n \n I would qualify this generalisation by adding that exceptions to the rule would occur in the event of provable harmful consequences.", 
   {}, 
   180455, 
   null, 
   1132486740.0
  ], 
  [
   180503, 
   null, 
   "OccamsRazor", 
   "I don't believe in \"thought police\". The concept of the State telling me what I can and can't say is fundamentally against American heritage. If we believed that, we'd still be a colony of England and NOT the world's only superpower. People come to the US for its freedom not is oppression of free speech.\n \n You can have all of the anti-hate speech laws that you want in Europe, just don't export them over here. That's the kind of import that we don't need.\n\n \n So why are you even responding to my posts as they are nothing to do with the US and I have not been suggesting that the US need adopt such laws?", 
   {}, 
   180455, 
   null, 
   1132496100.0
  ], 
  [
   180505, 
   null, 
   "OccamsRazor", 
   "What the Irving case boils down to (I think) is the issue of criminalising thought.\n \n Suppose I claimed that slavery in America never existed - alleging perhaps that black people volunteered for servitude; or suppose I claimed that the famine in Ireland (in the 1840s) was entirely exaggerated and very few people had died as a result of English apathy and negligence etc., should I be locked up for expressing such grotesque opinions ?\n\n \n At the end of your post you apply the caveat of \"provable harmful consequences\" to your opposition to censorship/criminalisation of these issues. As you state, it would be grotesque to express those thoughts you suggested but their are now quite distant history so their affect on the living are lessened. Nazism is still alive in a number of European countries as are large numbers of people who suffered at the hands of the Nazi extermination programs. This is a powder keg of hatred and injustice that still simmers beneath the suface of society and we cannot pretend it does not exist. \n \n Justice for those affected by the Nazi's was limited enough at best- should we publicly tolerate those who would undermine the guilt of those who took part in the exterminations and stand by while those who were effected become angry and resentful towards the state who allows that to happen? Should we allow blatant attempts to rewrite history (convientently leaving those involved absolved of guilt) of such a colossal crime to go unchecked? That could only serve to further legitimise the modern movements that have grown from the idelogy of Nazism.\n \n \nIt should not be within the power of the state to suppress or censor opinions - no matter how offensive they appear to the \"enlightened\" liberal mind, or to the sensibilities of minorities.\n\n \n To reiterate its not just sensibilities that are at stake here- there are potential conflicts that are lying dormant, and this is what laws against Holocaust revisionism are trying to avoid.\n \n \nI would qualify this generalisation by adding that exceptions to the rule would occur in the event of provable harmful consequences.\n\n \n I've tried to outline why I think the activities of the likes of David Irving are a precursor to harmful consequences.", 
   {}, 
   180496, 
   null, 
   1132498020.0
  ], 
  [
   180530, 
   null, 
   "JPSartre12", 
   "So why are you even responding to my posts as they are nothing to do with the US and I have not been suggesting that the US need adopt such laws?\n\n \n I'me responding to your post because I think that it's a dangerous policy to adopt anywhere in the world. While I admit that the US has no say on what Europe does, since we still have freedom of speech here, we can express our opinions about it.", 
   {}, 
   180503, 
   null, 
   1132510800.0
  ], 
  [
   180535, 
   null, 
   "Obvious Child", 
   "I agree entirely with your take on the process of history and how the conclusions of the past should be able to stand the test of re-evaluation and the emergence of new evidence(s) in the present.\n \n Where I disagree is the notion that holocaust deniers somehow count as legitimate historians. They are operating from that most intellecually dishonest of positions where they have a conclusion first (i.e. The Holocaust/Nazi extermination did not happen, or happened on a very limited scale) and find evidence to back that view and then offer their analysis.\n \n That is not to say that people like Irving have not promoted laudable efforts on the part of many to document the atrocities of the Nazi's for future generations, lest one of mankind's darkest episodes be forgotten or rewritten.\nFirst, I'll say that the post you quoted was not, in fact, by me but my girlfriend. Thus the better considered and informed points. \n \n That done, I'm confused as to how you take the post to mean that holocaust deniers are legitimate historians. The point seems to me to be\n \n 1) The scale and nature of the holocaust is a legitimate subject for debate\n 2) Some studies which revealed less deaths in certain times or places are historically strong\n \n Irving himself has 'little, if any, historical merit' and 'no evidence' and is clearly not a legitimate historian. The smaller scale studies are historically valid and not denial propaganda.\n \n Your point that the existence of Irving has led others to document the atrocities seems fair, as long as this 'documentation' involves scholarship and investigation (which has at least the possibility of some drops in death tolls), not simple anti-Nazi posturing and expressions of how evil it all was.\n \n Now, something you said to AlanRyan:\n \n \nAt the end of your post you apply the caveat of \"provable harmful consequences\" to your opposition to censorship/criminalisation of these issues. As you state, it would be grotesque to express those thoughts you suggested but their are now quite distant history so their affect on the living are lessened. Nazism is still alive in a number of European countries as are large numbers of people who suffered at the hands of the Nazi extermination programs. This is a powder keg of hatred and injustice that still simmers beneath the suface of society and we cannot pretend it does not exist. \nYou assume here that the recentness of the event is of primary importance for those still living, but then move on to say that 'Nazism is still alive', a slightly different issue. The persecution of the Jews right up to the Nazis (and beyond) was often based on religious hatred, motivated by the idea that 'the Jews killed Christ'. This was capable of causing, or contributing to, Russian pogroms as late as 1900 years after the death of Christ. As the results of slavery and racism still persist, and the role and status of blacks is now more of an issue than Jews (reperations, positive discrimination, quotas etc), then how the blacks came to America is important. Similarly, the hatred of some Irish for England is still strong, to the point where a history of Ireland is almost inevitably clear in political sympathies. I would say that both cases are more ongoing than anti-Semitism, which was mostly destroyed by the extremism of the Nazis.", 
   {}, 
   180439, 
   null, 
   1132511280.0
  ], 
  [
   180630, 
   null, 
   "OccamsRazor", 
   "First, I'll say that the post you quoted was not, in fact, by me but my girlfriend. Thus the better considered and informed points. \n \n That done, I'm confused as to how you take the post to mean that holocaust deniers are legitimate historians. The point seems to me to be\n \n 1) The scale and nature of the holocaust is a legitimate subject for debate\n 2) Some studies which revealed less deaths in certain times or places are historically strong\n \n Irving himself has 'little, if any, historical merit' and 'no evidence' and is clearly not a legitimate historian. The smaller scale studies are historically valid and not denial propaganda.\n\n \n Yes there is some confusion here- I'm in agreement with your points as stated above. Out of interest do you have any information about the studies you mention examining over estimation of the numbers killed?\n \n \nYour point that the existence of Irving has led others to document the atrocities seems fair, as long as this 'documentation' involves scholarship and investigation (which has at least the possibility of some drops in death tolls), not simple anti-Nazi posturing and expressions of how evil it all was.\n\n \n I was thinking of the project to interview as many survivors as possible as a record of some of the things that happened. Off course there is no point countering one set of lies with another ;)\n \n \nYou assume here that the recentness of the event is of primary importance for those still living,\n\n \n By default as the place in history of the Nazi exterminations is in living memory for considerable numbers of people. However, I don't believe I made any assumption that dates are of 'primary importance' to those affected.\n \n \nbut then move on to say that 'Nazism is still alive', a slightly different issue.\n\n \n Slightly different but still relevant considering the topic.\n \n \nThe persecution of the Jews right up to the Nazis (and beyond) was often based on religious hatred, motivated by the idea that 'the Jews killed Christ'. This was capable of causing, or contributing to, Russian pogroms as late as 1900 years after the death of Christ. As the results of slavery and racism still persist, and the role and status of blacks is now more of an issue than Jews (reperations, positive discrimination, quotas etc), then how the blacks came to America is important. Similarly, the hatred of some Irish for England is still strong, to the point where a history of Ireland is almost inevitably clear in political sympathies. I would say that both cases are more ongoing than anti-Semitism, which was mostly destroyed by the extremism of the Nazis.\n\n \n And that is a different debate- I'm not making equivalencies here between one set of violent prejudices and another but discussing the issue of laws in certain European countries against public holocaust denial (as a side point also remember that anti-semitism is only one of many prejudices that drove what the Nazi's did- millions of other non-Jewish peoples were also killed).\n \n Do you think there is a major issue with denial revisionism of history for the two examples you cite?", 
   {}, 
   180535, 
   null, 
   1132546080.0
  ], 
  [
   180634, 
   null, 
   "OccamsRazor", 
   "I'me responding to your post because I think that it's a dangerous policy to adopt anywhere in the world. While I admit that the US has no say on what Europe does, since we still have freedom of speech here, we can express our opinions about it.\n\n \n Different topic, but just as relevant to this debate, particularly from the US viewpoint:\n \n http://www.4forums.com/political/showthread.php?t=6865&page=2\n \n Read Joe's last post (#20). Apparently speech in the US can be just as restricted as by the laws were are discussing here from europe.", 
   {}, 
   180530, 
   null, 
   1132547340.0
  ], 
  [
   180656, 
   null, 
   "Alan Ryan", 
   "\n To reiterate its not just sensibilities that are at stake here- there are potential conflicts that are lying dormant, and this is what laws against Holocaust revisionism are trying to avoid.\n \n I've tried to outline why I think the activities of the likes of David Irving are a precursor to harmful consequences.\n\n I think you make an eloquent case, but we have to emphasise, when discussing egregious mavericks like Irving, that we are supposed to live in a free society. The circulation of opinions - some of which may be offensive, false, ridiculous, or downright dangerous - is part of the bargain in civil liberty. To have laws against the denial of an historical event is not compatible with the \"original position\" that we are at pains to defend. \n \n I would also observe that to deny the holocaust is absolutely fatuous, but not necessarily an unequivocal incitement to renewed anti-semitism. The expression of absurd opinions or indeed any opinion, I repeat, should not be criminalised: it's a small step on the road to authoritarianism when a man is indicted for asserting something so obviously crackers that only a few XXXXXX will believe it.", 
   {}, 
   180505, 
   null, 
   1132571940.0
  ], 
  [
   180698, 
   null, 
   "JPSartre12", 
   "Different topic, but just as relevant to this debate, particularly from the US viewpoint:\n \n http://www.4forums.com/political/showthread.php?t=6865&page=2\n \n Read Joe's last post (#20). Apparently speech in the US can be just as restricted as by the laws were are discussing here from europe.\n\n \n You're comparing apples and oranges. Free speech is restricted in the US only under very limited circumstances. They include slander and outright threats of violence, not someone's \"ideas\" or \"beliefs\". Those are protected forms of speech.", 
   {}, 
   180634, 
   null, 
   1132600560.0
  ], 
  [
   180701, 
   null, 
   "Eddie", 
   "You're comparing apples and oranges. Free speech is restricted in the US only under very limited circumstances. They include slander and outright threats of violence, not someone's \"ideas\" or \"beliefs\". Those are protected forms of speech.\n\n \n Free speech is restricted in Europe under very limited circumstances as well...", 
   {}, 
   180698, 
   null, 
   1132602660.0
  ], 
  [
   183644, 
   null, 
   "Wez", 
   "You're comparing apples and oranges. Free speech is restricted in the US only under very limited circumstances. They include slander and outright threats of violence, not someone's \"ideas\" or \"beliefs\". Those are protected forms of speech.\n\n I think communist viewpoints were 'banned' during the Cold War in the US?\n \n -Wez", 
   {}, 
   180698, 
   null, 
   1133905020.0
  ], 
  [
   183720, 
   null, 
   "JPSartre12", 
   "I think communist viewpoints were 'banned' during the Cold War in the US?\n \n -Wez\n\n \n I'm not aware of a single law in the US that has ever banned communism. Can you cite one for me?", 
   {}, 
   183644, 
   null, 
   1133924520.0
  ], 
  [
   183819, 
   null, 
   "Wez", 
   "I'm not aware of a single law in the US that has ever banned communism. Can you cite one for me?\n\n I'll see what I can dig up.:)\n \n -Wez", 
   {}, 
   183720, 
   null, 
   1133976780.0
  ], 
  [
   184006, 
   null, 
   "Obvious Child", 
   "NEW ORLEANS -- The American Civil Liberties Union of Louisiana today filed a federal lawsuit challenging a remnant of the McCarthy era witchhunts that makes possession of so-called \"communist propaganda\" a felony punishable with up to six years in jail and a $10,000 fine.\n \n This is pretty close, what I dug up in 5 minutes on Google\n \n http://www.aclu.org//freespeech/censorship/11004prs19991215.html\n \n Plus I think the Smith Act may have been used.", 
   {}, 
   183819, 
   null, 
   1134059460.0
  ], 
  [
   184049, 
   null, 
   "Big_Bear_Scot", 
   "You're comparing apples and oranges. Free speech is restricted in the US only under very limited circumstances. They include slander and outright threats of violence, not someone's \"ideas\" or \"beliefs\". Those are protected forms of speech.\n\n \n What about so called 'Free Speech Zones' ?", 
   {}, 
   180698, 
   null, 
   1134075300.0
  ], 
  [
   184055, 
   null, 
   "georged", 
   "What about so called 'Free Speech Zones' ?\n\n \n http://www.amconmag.com/12_15_03/feature.html\n \n It would take a real hypocrite to state US free speech and right of assembly still exist. But they're too busy supporting nation building at the point of a gun to notice their own civil liberties being dissolved.", 
   {}, 
   184049, 
   null, 
   1134076320.0
  ], 
  [
   184061, 
   null, 
   "Big_Bear_Scot", 
   "http://www.amconmag.com/12_15_03/feature.html\n \n It would take a real hypocrite to state US free speech and right of assembly still exist. But they're too busy supporting nation building at the point of a gun to notice their own civil liberties being dissolved.\n\n \n The disturbing thing is that even the Democrats are indulging in these 'free speech zones', I recently read an article about the Free speech zone at the last DNC.\n \n Even if the Republican where voted out of Office nothing would change, there would probably still be same restrictions on the right of Free speech and the right of peaceful assembly. \n \n What did they use to say ? America the land of the 'free'. It doesn't seem like it.", 
   {}, 
   184055, 
   null, 
   1134077880.0
  ], 
  [
   184077, 
   null, 
   "Wez", 
   "I'll see what I can dig up.:)\n \n -Wez\n\n The above guys did the work for me. Cheers.:)\n \n -Wez", 
   {}, 
   183819, 
   null, 
   1134083580.0
  ], 
  [
   184082, 
   null, 
   "Big_Bear_Scot", 
   "The disturbing thing is that even the Democrats are indulging in these 'free speech zones', I recently read an article about the Free speech zone at the last DNC.\n \n Even if the Republican where voted out of Office nothing would change, there would probably still be same restrictions on the right of Free speech and the right of peaceful assembly. \n \n What did they use to say ? America the land of the 'free'. It doesn't seem like it.\n\n \n \n I know it is weird to quote my own post, but I must say that the British Government is just as bad as the US equivalent. Supposedly you have to get permission to protest outside the Houses of Parliament. \n \n http://politics.guardian.co.uk/homeaffairs/story/0,11026,1508595,00.html", 
   {}, 
   184061, 
   null, 
   1134084960.0
  ], 
  [
   184085, 
   null, 
   "OccamsRazor", 
   "I know it is weird to quote my own post, but I must say that the British Government is just as bad as the US equivalent. Supposedly you have to get permission to protest outside the Houses of Parliament. \n \n http://politics.guardian.co.uk/homeaffairs/story/0,11026,1508595,00.html\n\n \n Agreed that is a shameful piece of law that almost smacks of neopotism. Still, it didn't work on Brian Haw.", 
   {}, 
   184082, 
   null, 
   1134085560.0
  ], 
  [
   184086, 
   null, 
   "georged", 
   "The disturbing thing is that even the Democrats are indulging in these 'free speech zones', I recently read an article about the Free speech zone at the last DNC.\n \n Even if the Republican where voted out of Office nothing would change, there would probably still be same restrictions on the right of Free speech and the right of peaceful assembly. \n \n What did they use to say ? America the land of the 'free'. It doesn't seem like it.\n\n \n I've felt there was one US major political party for the past 20+ years. Which of the two major factions gets to divide the loot and pardon their henchmen who get caught with both hands in the cookie jar periodically changes, but for all practical purposes, its been a scramble to get what they can before the jar goes empty. This current gang has brought a whole new meaning to secrecy, loss of civil liberties and federal control.", 
   {}, 
   184061, 
   null, 
   1134085920.0
  ], 
  [
   184127, 
   null, 
   "Big_Bear_Scot", 
   "Agreed that is a shameful piece of law that almost smacks of neopotism. Still, it didn't work on Brian Haw.\n\n \n I find it amusing that the Law was enacted to stop Brian Haw, it didn't do that but instead it bans everyone else from hold peaceful demonstrations outside of Parliament(unless the Police give permission of course).\n \n I find it disgraceful that our elected politicians trumpet Democracy when it suits them(lines their own pockets) but when another person tries to enact their Democratic rights they attempt to curtail it. No wonder only a minority vote in Elections when our politicians create that sort of Law.\n \n \n\n I've felt there was one US major political party for the past 20+ years. Which of the two major factions gets to divide the loot and pardon their henchmen who get caught with both hands in the cookie jar periodically changes, but for all practical purposes, its been a scramble to get what they can before the jar goes empty. This current gang has brought a whole new meaning to secrecy, loss of civil liberties and federal control.\n\n \n Its going the same way in the UK especially now since David Cameron has been elected leader of the Tories, he is trying to move the Conservative Party into the centre ground which New Labour have dominated for the last 3 elections. But that is for another thread, in fact I might start one in the Europe forum.", 
   {}, 
   184085, 
   null, 
   1134095880.0
  ], 
  [
   185210, 
   null, 
   "Wez", 
   "Any responce JPSartre12?\n \n -Wez", 
   {}, 
   184127, 
   null, 
   1134591180.0
  ], 
  [
   185308, 
   null, 
   "JPSartre12", 
   "Any responce JPSartre12?\n \n -Wez\n\n \n Sorry for the delayed response. I'm sitting in a hotel in Wisconsin as I write this, just having drove ~7 hours from Detroit to visit this snow-laden cold-as-Hell place. :) \n \n Personally, I don't like the idea of free speech zones, but they don't stifle free speech, they just move it away from potential harm to the president. Since 9-11, I've seen all sorts of paranoid moves taken by the gov't. This is just one more temporary over-reaction, IMO. It doesn't change a thing in the grand scheme of life.", 
   {}, 
   185210, 
   null, 
   1134618180.0
  ], 
  [
   185429, 
   null, 
   "georged", 
   "Sorry for the delayed response. I'm sitting in a hotel in Wisconsin as I write this, just having drove ~7 hours from Detroit to visit this snow-laden cold-as-Hell place. :) \n \n Personally, I don't like the idea of free speech zones, but they don't stifle free speech, they just move it away from potential harm to the president. Since 9-11, I've seen all sorts of paranoid moves taken by the gov't. This is just one more temporary over-reaction, IMO. It doesn't change a thing in the grand scheme of life.\n\n \n Not just the president, all cabinet members. I'm not aware of a public appearance by any administration member since election time. They're all broadcast from military facilities or private fundraisers. I guess if 60% of the public was in disagreement with my policies I'd also stick to well secured holes. Being arrested for unlawful assembly when trying to protest elected leadership policy reeks of fascism.", 
   {}, 
   185308, 
   null, 
   1134667920.0
  ], 
  [
   185483, 
   null, 
   "Wez", 
   "I'm not aware of a single law in the US that has ever banned communism. Can you cite one for me?\n\n http://en.wikipedia.org/wiki/American_Communist_Party#The_Onset_of_the_Cold_War\n \n Go to the \"Criminal prosecutions\" section. You can google the names and claims if you don't trust wikipedia.\n \n \nPersonally, I don't like the idea of free speech zones, but they don't stifle free speech, they just move it away from potential harm to the president.\n\n It's banning free speech in certain areas. Glad to hear you don't agree with it though.:)\n \n -Wez", 
   {}, 
   183720, 
   null, 
   1134677580.0
  ], 
  [
   185625, 
   null, 
   "JPSartre12", 
   "Not just the president, all cabinet members. I'm not aware of a public appearance by any administration member since election time. They're all broadcast from military facilities or private fundraisers. I guess if 60% of the public was in disagreement with my policies I'd also stick to well secured holes. Being arrested for unlawful assembly when trying to protest elected leadership policy reeks of fascism.\n\n \n No argument from me. I'm probably one of the minority that thinks yelling \"Fire!\" in a crowded theater should also be protected speech as well.", 
   {}, 
   185429, 
   null, 
   1134716340.0
  ], 
  [
   185753, 
   null, 
   "Wez", 
   "I think we're nearly all in agreement here then.\n \n -Wez", 
   {}, 
   185625, 
   null, 
   1134765180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Man Arrested; He \"Denied the Holocaust\"", 
  "url": "http://www.4forums.com/political/history-debates/6678-man-arrested-he-denied-holocaust.html", 
  "breadcrumbs": [
   "History"
  ], 
  "id_number": 6678, 
  "discussion_files": [
   [
    "32461.html", 
    "http://www.4forums.com/political/history-debates/6678-man-arrested-he-denied-holocaust-print.html"
   ], 
   [
    "32462.html", 
    "http://www.4forums.com/political/history-debates/6678-man-arrested-he-denied-holocaust-5-print.html"
   ], 
   [
    "32463.html", 
    "http://www.4forums.com/political/history-debates/6678-man-arrested-he-denied-holocaust-4-print.html"
   ], 
   [
    "32464.html", 
    "http://www.4forums.com/political/history-debates/6678-man-arrested-he-denied-holocaust-3-print.html"
   ], 
   [
    "32465.html", 
    "http://www.4forums.com/political/history-debates/6678-man-arrested-he-denied-holocaust-2-print.html"
   ]
  ], 
  "identifier": 6678
 }
]