[
 [
  [
   173971, 
   null, 
   "Iuris", 
   "The little contact I have had with creationist science so far has been rather limited to the arguments regarding what evidence supports creation theories and what evidence supports evolution theories. However, crationist scientists have surely formed explanations of their own, and I'd like to hear some.\n \n For example, if Noah's flood is the cause of the sedimantary layers, surely someone has analyzed these and discovered what strenght currents were present, where they started, which way they went and so on. So how did it go? If Earth's magnetic field can be traced to determine the age of the Earth, what do we get if we turn the equation around and extrapolate the time to Earth's end?\n \n Come on, I'd like to know the world as creaitonism describes it.", 
   {
    "post_info": {
     "post_title": "OK, so what exactly has creationist science found out o far?"
    }
   }, 
   null, 
   null, 
   1130245380.0
  ], 
  [
   175272, 
   null, 
   "SkepticGunt", 
   "Hey, let me jump in on this one.\n \n Creation science has found nothing. There are no ifs, buts or maybes, on this one. Creation science is wrong and has been proven so by the scientific community time and time again. Look at pretty much any post on this forum and you will see this. Every time a Creat brings up an argument, the secular residents of this site beat them down with logic and reason.\n \n No Creat argument has stood up to the test of science. Pure and simple.", 
   {}, 
   173971, 
   null, 
   1130575620.0
  ], 
  [
   175275, 
   null, 
   "snakespit", 
   "I don't know if I can accept \"creationist science\" as a true form of science. True science involves developing explanations for phenomena based on ALL available evidence gathered. Creationists pick and choose little bits of science that supports their claims, all the while ignoring the evidence that discredits them.", 
   {}, 
   175272, 
   null, 
   1130581440.0
  ], 
  [
   175276, 
   null, 
   "prschuster", 
   "I don't know if I can accept \"creationist science\" as a true form of science. True science involves developing explanations for phenomena based on ALL available evidence gathered. Creationists pick and choose little bits of science that supports their claims, all the while ignoring the evidence that discredits them.\n\n \n \n \n Walking-fish:\n A great example of this is the way Young Earthers try to discount radiometric dating. They will choose a couple hundred inconsistent radiometric dates out of the thousands that have been recorded and argue that they are unreliable. Then they will choose a couple lame pieces of evidence for a young earth, such as Robt Gentry's Polonium halos, rate of decay in the earth's magnetic field, rates of sediment/salt deposition in the ocean or rate of population growth. This is supposed to outweigh the evidence from thousands of good radiometric dates. Creationists are not very good at doing science but they are good at picking cherries. So if you own an orchard and need a few good field hands, hire a young earth creationist.", 
   {}, 
   175275, 
   null, 
   1130583360.0
  ], 
  [
   175413, 
   null, 
   "Howard Beale", 
   "The term \"creation science\" is an oxymoron.", 
   {
    "unicode_changes_made": true
   }, 
   175276, 
   null, 
   1130638140.0
  ], 
  [
   176452, 
   null, 
   "Iuris", 
   "Are you guys trying to tell me that the crationist scientists just \"refute\", without doing any science of their own? \n \n That they just say that the grand canyon was formed by the great flood, without trying to trace the water flows, where the first rains began, where the water went, whatr it carried along the way, what the world looked like before the flood and all? \n \n That they never bothered to analyze the fossil data so as to determine whether during the coexistence times lions hunted velociraptors or vice versa?\n \n Come on, someone must have asked SOME questions in the process? It's the natural response to \"refutals\": OK, hotshot, you explain it better!", 
   {}, 
   175413, 
   null, 
   1130928660.0
  ], 
  [
   176459, 
   null, 
   "trebor", 
   "Are you guys trying to tell me that the crationist scientists just \"refute\", without doing any science of their own? \n \n That they just say that the grand canyon was formed by the great flood, without trying to trace the water flows, where the first rains began, where the water went, whatr it carried along the way, what the world looked like before the flood and all? \n \n That they never bothered to analyze the fossil data so as to determine whether during the coexistence times lions hunted velociraptors or vice versa?\n \n Come on, someone must have asked SOME questions in the process? It's the natural response to \"refutals\": OK, hotshot, you explain it better!\n\n \n \n That is exactly what we are saying. They also use incorrect assumptions that were disguarded, like the rate that dust will accumulate on the moon, and use it 50 years after it was shown to be incorrect.", 
   {}, 
   176452, 
   null, 
   1130939160.0
  ], 
  [
   176478, 
   null, 
   "Howard Beale", 
   "Iuris\n \n You will also not find one scientist who has used the scientific method to show that ID is a valid scientific theory. In addition, you will be hard pressed to find any scientist who claims that ID is a valid scientific theory and backs that up with a scientific process by which he came to that conclusion.", 
   {}, 
   176459, 
   null, 
   1130947800.0
  ], 
  [
   176508, 
   null, 
   "Iuris", 
   "Well, yeah, but I assumed they at least put up something?\n \n This would imply that they really don't ever put up anything of their own, it would make them intellectual guerillas, hitting targets and never ever actually staying in place for long enough to actually engage the opponents.\n \n Come on, they must have SOMETHING?!?", 
   {}, 
   176478, 
   null, 
   1130953500.0
  ], 
  [
   176509, 
   null, 
   "Rygar", 
   "Science in my opinion is based on \"Observable evidence and things that can be proven scientifically\" seeing that Creationism is neither of these and we have to base it on a book that could contain bias, false evidence, and other things...I rule that it is NOT scientific although it may be a theory.", 
   {}, 
   176478, 
   null, 
   1130953560.0
  ], 
  [
   176740, 
   null, 
   "SkepticGunt", 
   "Come on, they must have SOMETHING?!?\n\n \n Nope. Every claim that a Creat has put forward has been subsequently debunked by science, logic, and reason. Creats have nothing on science, except perhaps other peoples ignorance.\n \n Speaking of ignorance, I have, of late, been talking to alot of people, who actually told me to my face that beleiving in \"GodDidIt\" is \"easier.\" Some people just can't be botherd learning about it. I have experienced it many a time.\n \n --------------\n \n Person 1: I mean, a plane? It's thousands of tonnes of steel and whatever being held up by nothing! It defies all logic!\n \n SG: (pause) Except physics... right?\n \n Person 1: (pause) Well, defies all logic of the mind without bringing science, or any of that, into it!\n \n SG: Surely you must know how a wing works!?\n \n Person: I don't want to know!!\n \n ---------------\n \n Person 2: (after me and a freind had mentioned how cool it was that we were all once part of a star, cool huh!) What? That's the stupidest thing I ever heard!\n \n SG: Oh Charles [yes, I actually do say that], you're one of them!\n \n Person 2: How were we once a star?!\n \n [At this moment I knew that Was royally screwed. Now I had to explain to her relativity, e=mc^2, atomic physics, and then move onto how a star works. I had no chance in the limited time I had.]\n \n My Freind: Well, we are made of atoms. Were did the atoms come from?\n \n Person 2: God!\n \n SG: Oh charles, you are one of them!\n \n Person 2: Stop saying that!\n \n [Some time later she then had the audacity to tell me...]\n \n Person 2: And evolution doesn't work! I mean, if we evolved from apes, why are there still apes? \n \n [my efforts to explain to her that this was a common misconception about the evolution of Humans were all in vain, and she didn't understand.]\n \n My Freind: Why do you immediately say god did it?\n \n Person 2: It's easier...\n \n ---------------\n \n Those actually happenned to me. I was struck dumb! I had no idea that people could be that un-inquisitive, and actually have a desire not to learn about the things that I learned really early on, like how a plane stays airborne (four years old), the basic structure of an atom (10 years old), understanding of evolution (14 years old).\n \n It just appears to me to be a recuring theme, that people take the easiest explanation, in this case the \"Goddidit\", rather than actually trying to find out like I did.", 
   {}, 
   176508, 
   null, 
   1131013680.0
  ], 
  [
   177306, 
   null, 
   "GreenMtnBoy", 
   "I think he's asking for examples of what they claim as fact/proof via their \"scientific\" findings.\n \n If there are any truely scientific creationists, they are either in denial or are no longer creationists.", 
   {}, 
   176740, 
   null, 
   1131179400.0
  ], 
  [
   177315, 
   null, 
   "SkepticGunt", 
   "No, to me it sounds more like he is asking wether the creats have anything that science can't explain that creation science can't.", 
   {}, 
   177306, 
   null, 
   1131185280.0
  ], 
  [
   177644, 
   null, 
   "Iuris", 
   "Neither, actually.\n \n Non-creationist science has formed explanations for what the world is like and why. These explanations are then attacked by creationist scientists, who look for every crack and unexplained point.\n \n However, they must have offered some alternative explanations of the available evidence. For example, geological sediment columns of the grand canyon indicate milions of years of accumulation, so they had to explain things, and IIRC they declared it's a relic of the great flood.\n \n Now, science could get back at them on the same level: let's take a look at the world picture that those explanations offer, and, fair is fair, poke a bit at the cracks that we spot. If the grand canyon was created during the flood, OK, let's take a look at the rest of the world and, from the geological columns around the wold, get an image of the great flood. Where would it have started, where would the waters flow, what got swept up where and got deposited where, etc. And I expect these explanations are probably rather, er, leaky.", 
   {}, 
   177315, 
   null, 
   1131360480.0
  ], 
  [
   177667, 
   null, 
   "Howard Beale", 
   "Neither, actually.\n \n Non-creationist science has formed explanations for what the world is like and why. These explanations are then attacked by creationist scientists, who look for every crack and unexplained point.\n \n However, they must have offered some alternative explanations of the available evidence. For example, geological sediment columns of the grand canyon indicate milions of years of accumulation, so they had to explain things, and IIRC they declared it's a relic of the great flood.\n \n Now, science could get back at them on the same level: let's take a look at the world picture that those explanations offer, and, fair is fair, poke a bit at the cracks that we spot. If the grand canyon was created during the flood, OK, let's take a look at the rest of the world and, from the geological columns around the wold, get an image of the great flood. Where would it have started, where would the waters flow, what got swept up where and got deposited where, etc. And I expect these explanations are probably rather, er, leaky.\nI miunderstood. Here are a couple of websites about \"scientific proof\" of creation science:\n \n http://www.creationists.org/Robert_Gentry.html\n \n http://www.csama.org/199907NL.HTM\n \n You can go from there if you want...", 
   {}, 
   177644, 
   null, 
   1131378060.0
  ], 
  [
   177668, 
   null, 
   "doG", 
   "Hopefully, if they've learned anything, it's that creation science is not science, just more of the same old faith.", 
   {}, 
   177667, 
   null, 
   1131378360.0
  ], 
  [
   177812, 
   null, 
   "Coleman", 
   "Hi,\n \n I am new to these boards and couldn't help but notice the discussion going on here. Iuris, I saw that no one seemed to be giving you any answers, so I felt the need to give you another view.\n \n I probably won't be able to carry on a discussion because I've got a lot of things to do in school, but you never know. I'm just posting an answer to your question and I'm not trying to refute Darwinism or Neo-Darwinism. All I'm going to do is state the Creationist (or Intelligent Design or Christian) worldview on the universe's structure and origin. I'm not going to attempt to post the evidence, I'm merely stating the claims of Creationism as best I know them and if you want to check them out for yourself, feel free to do so. Please don't look at me for authoritative scientific answers because I'm just a kid in high school.\n \n I believe that the world (planet Earth, the solar system, the Milky Way galaxy, and the entire universe) were created \"ex nihilo\" (out of nothing) by an intelligent, personal, supernatural being. I will refer to Him as God throughout.\n \n God is eternal: He always has been, he always will be. He does not age or change.\n \n God is omnipresent: He is everywhere. (This does not mean that you are stepping on Him right now. He transcends our universe. His essence is not from the stuff of earth. Does this make sense to you? I can try to explain it again if you need me to.)\n \n God is omniscient: God knows everything about everything. He knows what has happened in the past, what is happening in the present, and what will happen in the future. He is not bound by time, and sees all time from its beginning to its end.\n \n God is omnipotent: He has the power to direct everything from the course of the stars right down to the smallest subatomic particle.\n \n Now then, I believe that God created the heavens (the atmosphere, the stars, outer space, etc.) and the earth. He spoke, and it happened. I believe that there were specific animals created in the first week of time, including man, who was set apart to have dominion over nature. I believe that God created the laws of physics by which our universe is governed, but I do believe that He has the power to suspend these laws as He wills. I also believe that He generally chooses to work *within* the framework of these laws, but again He is not *bound* by them.\n \n Okay, on to specifics. I do believe that at one point the entire earth was flooded with water to the point that there was absolutely no visible terra firma. I believe that most of the sedimentary layers are a result of this catastrophe, and were formed much more quickly than evolutionary scientists would say. One piece of evidence I would like to cite for this is the finding of individual fossils that span multiple sedimentary layers. For example, a tree trunk found vertically in the earth spanning two or three distinct layers of sediment.\n \n I believe that *micro*evolution is a perfectly logical, OBSERVABLE law of nature and that there could be many variations within a population. I do not believe in the concept of *macro* evolution because I have seen no undisputable evidence of one organism changing into another.\n \n I would like to say that I am unconvinced by citations of two groups within a species of animals which have been isolated for a prolonged period of time (two groups of catfish in two separate estuaries, for example) and no longer being able to interbreed. For me, that is not macroevolution or even speciation. Why? Because our classification system is defined by man, and is imperfect. (A St. Bernard and a Chihuahua are both animals in the species \"Canis familiaris,\" yet they cannot interbreed. Conversely, coyotes, who are part of a *different* species, can interbreed with some dogs. Even though we have a theory (or theories) for the origin of species, they cannot be proven to every degree of accuracy: some may be more probable than others. That's the way inductive reasoning works. However, I digress.\n \n In short, the creationist (or ID) view is that the world is created by an intelligent being. I can't tell you everything that creationists believe about the direction of currents, the decay of the magnetic field, or the prediction of the end of the earth. We do believe that the earth is less than 20,000 years old.\n \n I think we forget that a Creationist (ID theorist, Christian, etc.) is no different than a Darwinian scientist when it comes to observing present-day information. Please don't try to discredit the findings of a scientist just because he disagrees with you about how the world began. It is fallacious to suggest:\n \n 1) that all creation-believing (or Darwinian) scientists are ignorant of everything in the realm of science. (Hasty generalization)\n \n 2) that the evidence is wrong if backed by a Creationist (or Evolutionist). (Ad Hominem)\n \n Remember that the essence of science is that it doesn't matter who brings the evidence. It's objective as long as it is data, it only becomes subjective when hypotheses and theories are formulated.\n \n I could go on talking for a little while longer, but I have homework to do. If this sincerely interests you, feel free to post again, and I'll try to get you more information, or refer you to study material.\n \n CG\n \n P.S. My name isn't Charles, but I am one of \"them.\" Have a nice day.", 
   {
    "post_info": {
     "post_title": "Hello, I'll give it a try (long post)"
    }
   }, 
   177667, 
   null, 
   1131417060.0
  ], 
  [
   177818, 
   null, 
   "Howard Beale", 
   "Coleman:\n \n Then why is it that I have not been able to find one scientist who has shown Intelligent Design to be a valid scientific theory?", 
   {}, 
   177812, 
   null, 
   1131418620.0
  ], 
  [
   177821, 
   null, 
   "trebor", 
   "Hi,\n I believe that the world (planet Earth, the solar system, the Milky Way galaxy, and the entire universe) were created \"ex nihilo\" (out of nothing) by an intelligent, personal, supernatural being. I will refer to Him as God throughout.\n \n\n \n \n And the evidence for this is???", 
   {}, 
   177812, 
   null, 
   1131421320.0
  ], 
  [
   177828, 
   null, 
   "OccamsRazor", 
   "Hi,\n\n \n Hello Coleman.\n \n I note the frequent use of the phrase \"I believe\" in your post. Do you think that belief should stand before reason in science?\n \n You see the position you advocate, that of young earth creationism, does just this. It works from a conclusion backwards to its its data and analysis so is completely unscientific on the most fundemental levels- science deals with data, analysis and finally conclusion. The 'real scientific' approach seems to be quite acceptable to creationists in every other area of science so why not for the description and understanding of life?\n \n which brings me to your closing remark:\n \n \nRemember that the essence of science is that it doesn't matter who brings the evidence. It's objective as long as it is data, it only becomes subjective when hypotheses and theories are formulated.\n\n \n No, it does not matter who brings the evidence- the important issue is that the scientific method is observed- if not you may as well bin all the evidence because you will never learn or understand anything, but fit that which you make to your pre-determined conclusion.\n \n N.B. Its important not to intergrate the position of intelligent design and creationism (especially the young earth kind) as they are not compatable. The man behind ID has stated he accepts the world is very old (ie. billions of years) and that life has changed from one form to another through time.", 
   {}, 
   177812, 
   null, 
   1131426300.0
  ], 
  [
   177919, 
   null, 
   "Coleman", 
   "Folks, remember I told you that I wouldn't be able to bring enough evidence to the table to persuade you because I'm not an expert in the field. I am not attempting to give a scientific dissertation on Creationism. I'm not trying to \"convert\" you, and I'm not even trying to tell you you're wrong. All I'm trying to do is answer Iuris's question. Please don't ask me for all the scientific evidence. If you really want to know, check it out for yourself. Just because Creationists who post on these boards (like myself) don't know everything about everything, don't assume that there are no Creationist scientists who don't have evidence for their position.\n \n I also would like to point out that if you think that ID is a theory formulated by one man, you are sorely mistaken. Neither is it a new theory. You might be interested in knowing that before Charles Darwin formulated the theory of evolution, he was an intelligent design theorist. (In that day, ID was not compatible with Christianity, just as it is not today. Thank you for noting that. It IS comparable, however.) Of course, we all know that later on, he did formulate the theory of natural selection.\n \n To answer the question: does belief stand in the place of science?\n \n First off, when I say, \"I believe...\" you correctly assume that there is an element of faith involved. I respectfully suggest that there is some faith involved with your belief in Darwin's theory of evolution. Remember that science is *inductive reasoning.* We take specific instances and attempt to formulate theories about how the world works, but we *cannot* prove anything beyond the shadow of a doubt with science alone. Therefore, whether you realize it or not, your convictions about the world around you DO influence your interpretation of data. Don't think that someone could be perfectly objective. That's impossible.\n \n CG\n \n P.S. My class is having a mock debate over creation vs. evolution. I've been assigned the Darwinist side, and I'm looking for scientific evidence of macroevolution, particularly in the fossil record. Does anyone have any confirmed images of transitional fossils?", 
   {
    "post_info": {
     "post_title": "Okay, let's try this again"
    }
   }, 
   177828, 
   null, 
   1131479100.0
  ], 
  [
   177951, 
   null, 
   "Howard Beale", 
   "Coleman:\n \n \nP.S. My class is having a mock debate over creation vs. evolution. I've been assigned the Darwinist side, and I'm looking for scientific evidence of macroevolution, particularly in the fossil record. Does anyone have any confirmed images of transitional fossils?\n \nDon't get caught in the trap of arguing science. To win the debate the only position you can take is that creationism is not science. Challenge them to come up with one scientist (and his corroborative work using the scientific method) who has shown intelligent design to be a valid scientific theory. They can't because there aren't any. Scientific theory is demonstrated by application of the Scientific Method. Creationism was shown to be an invalid scientific theory by applying the scientific method. Intelligent design cannot withstand analysis using the Scientific Method and therefore cannot be a scientific theory. Once you enter into a discussion of intelligent design as if it is a valid scientific theory, you have lost the debate.", 
   {
    "unicode_changes_made": true
   }, 
   177919, 
   null, 
   1131486120.0
  ], 
  [
   177977, 
   null, 
   "OccamsRazor", 
   "Folks, remember I told you that I wouldn't be able to bring enough evidence to the table to persuade you because I'm not an expert in the field. I am not attempting to give a scientific dissertation on Creationism. I'm not trying to \"convert\" you, and I'm not even trying to tell you you're wrong. All I'm trying to do is answer Iuris's question. Please don't ask me for all the scientific evidence. If you really want to know, check it out for yourself. Just because Creationists who post on these boards (like myself) don't know everything about everything, don't assume that there are no Creationist scientists who don't have evidence for their position.\n\n \n We all have limitations in our knowledge, but it is essential we challenge one another to produce evidence that supports our positions- if we don't know we go look and learn. If we found no answer, we have had an education of a different kind.\n \n \nI also would like to point out that if you think that ID is a theory formulated by one man, you are sorely mistaken.\n\n \n That is true, kudos to you for pointing out so.\n \n \nNeither is it a new theory. You might be interested in knowing that before Charles Darwin formulated the theory of evolution, he was an intelligent design theorist.\n\n \n Which goes to show great minds can admit they got it wrong to begin with.\n \n \n(In that day, ID was not compatible with Christianity, just as it is not today. Thank you for noting that. It IS comparable, however.) Of course, we all know that later on, he did formulate the theory of natural selection.\n \n To answer the question: does belief stand in the place of science?\n \n First off, when I say, \"I believe...\" you correctly assume that there is an element of faith involved. I respectfully suggest that there is some faith involved with your belief in Darwin's theory of evolution. Remember that science is *inductive reasoning.* We take specific instances and attempt to formulate theories about how the world works, but we *cannot* prove anything beyond the shadow of a doubt with science alone. Therefore, whether you realize it or not, your convictions about the world around you DO influence your interpretation of data. Don't think that someone could be perfectly objective. That's impossible.\n \n CG\n\n \n Your observation is correct that many things we think we know are based on that we have not directly experienced. However, we can also see how likely such notions are: what supports a particular view? what evidence is there of it? is it supported in other ways? As such this is a great strength of evolution- there are myriad lines of evidence that support the concept from a variety of different, unrelated, disiplines.\n \n \nP.S. My class is having a mock debate over creation vs. evolution. I've been assigned the Darwinist side, and I'm looking for scientific evidence of macroevolution, particularly in the fossil record. Does anyone have any confirmed images of transitional fossils?\n\n \n Well, as all life is transitional in nature you have a huge choice iin your subject matter. If you are wanting to illusrate a transitional sequence  between two major groups (as no single animal will represent the change from a fish to an amphibian, for example) then this link has a number of good examples. Good luck playing devils advocate in your debate.", 
   {}, 
   177919, 
   null, 
   1131493260.0
  ], 
  [
   178044, 
   null, 
   "prschuster", 
   "Coleman wrote:\n First off, when I say, \"I believe...\" you correctly assume that there is an element of faith involved. I respectfully suggest that there is some faith involved with your belief in Darwin's theory of evolution. Remember that science is *inductive reasoning.* We take specific instances and attempt to formulate theories about how the world works, but we *cannot* prove anything beyond the shadow of a doubt with science alone. Therefore, whether you realize it or not, your convictions about the world around you DO influence your interpretation of data. Don't think that someone could be perfectly objective. That's impossible.\n \n \n \n Walking-fish:\n First of all, a theory in science is not the conviction of a single person. That is your first oversight. The 2nd oversight is the tacit assumption that a theory is formulated by subjective interpretation. Let's start with the first assumption.\n \n The theory of evolution by natural selection is the result of the collective work of thousands of biologists & geologists over the course of a century & a half. The amount of data collected over this period is staggering, and no one scientist could ever absorb it all in a single lifetime. So if there is subjective bias on behalf of one expert, it is balanced out by the views of many thousands of others who view the same data. Also, every experiment or observation made by one individual must be duplicated by others.\n \n This brings us to the 2nd assumption. There is more to gathering evidence than interpreting data. The evidence must also have predictive value and be capable of explaining all known phenomena. This cuts down on the subjective bias, considerably. For example, it can be predicted that all living mammal species will have 3 middle ear bones in each ear, rather than one, since the fossil record clearly shows the exaptation of the bones of the reptilian jaw joint to form these ear bones. Finding these 3 bones in the ear of a bird or amphibian would greatly challenge the theory of common descent. This is a very objective check upon interpretation of data that is hard to fudge with bias.", 
   {}, 
   177668, 
   null, 
   1131510300.0
  ], 
  [
   178050, 
   null, 
   "prschuster", 
   "Quote by Coleman:\n P.S. My class is having a mock debate over creation vs. evolution. I've been assigned the Darwinist side, and I'm looking for scientific evidence of macroevolution, particularly in the fossil record. Does anyone have any confirmed images of transitional fossils? \n \n \n \n Walking-fish:\n You were just given a link to a website entitled: \"Transitional Vertebrate Fossils\", by Kathleen Hunt. As excellent as her site is, it can always be countered by creationists who point at the many gaps found in the lineages. Of course, they are picking at straws, because you'll never be able to fill in the gaps between two species, unless you find a rare layer that has all the intermediate steps in chronological order (she does give a few good examples of this though). The main lesson to be learned here is that the theory of evolution by natural selection and the evidence for common descent do NOT rest exclusively on the fossil record. In fact, most of the hard evidence is found elsewhere. \n \n A good site to get the real info on Macroevolution is: \"29+ Evidences for Macroevolution\" at this URL:\n www.talkorigins.org/faqs/comdesc \n This site examines evidence from embryology, molecular/DNA analyses, instances of vestigial structures, suboptimal structures and nested groupings of taxa. It is the sum total of all this evidence which points to the unmistakable conclusion that there are common ancestors to living organisms. When you add the data from the fossil record and look at the radiometric dates, you would need to have considerable subjective bias to disbelieve the evidence.", 
   {
    "post_info": {
     "post_title": "Evidence for Macroevolution"
    }
   }, 
   178044, 
   null, 
   1131511920.0
  ], 
  [
   178282, 
   null, 
   "PoohBear", 
   "Hey, let me jump in on this one.\n \n Creation science has found nothing. There are no ifs, buts or maybes, on this one. Creation science is wrong and has been proven so by the scientific community time and time again. Look at pretty much any post on this forum and you will see this. Every time a Creat brings up an argument, the secular residents of this site beat them down with logic and reason.\n \n No Creat argument has stood up to the test of science. Pure and simple.\n\n \n \n point me toward the right way then? if creationists are wrong then why is evolution right? this is a biased answer based on your beliefs. please tell us how creationists were wrong. i would gladly like to see you try!", 
   {}, 
   175272, 
   null, 
   1131600600.0
  ], 
  [
   178288, 
   null, 
   "Adept", 
   "please tell us how creationists were wrong. i would gladly like to see you try!\n\n \n Simply put, there is zero evidence to support the theories of divine creation or intelligent design. One might as well believe that invisible flying space monkeys built the earth.", 
   {}, 
   178282, 
   null, 
   1131602460.0
  ], 
  [
   178290, 
   null, 
   "Howard Beale", 
   "point me toward the right way then? if creationists are wrong then why is evolution right? this is a biased answer based on your beliefs. please tell us how creationists were wrong. i would gladly like to see you try!\nIt is very simple. Creationism is not a valid scientific theory. It cannot be, and has never been, demonstrated that Creationism or ID are valid scientific theories. Therefore Creationism and ID should not be taught in science class. Evolution has been shown to be a valid scientific theory through research and experimentation over a century. It should be taught in science classes. That is the only issue. Should any idea, whether or not it is a valid scientific theory, be taught in a science class.", 
   {}, 
   178282, 
   null, 
   1131603960.0
  ], 
  [
   178465, 
   null, 
   "stormboy", 
   "[QUOTE=Rygar][quote]Science in my opinion is based on \"Observable evidence and things that can be proven scientifically\"[quote] seeing that Creationism is neither of these and we have to base it on a book that could contain bias, false evidence, and other things...I rule that it is NOT scientific although it may be a theory.\n When was the last time anyone observed a fish change into a lizard before their eyes. Without the time required it is impossible, all one can do is to translate the evidance in the direction their world view steers them.", 
   {}, 
   176509, 
   null, 
   1131672420.0
  ], 
  [
   178471, 
   null, 
   "Demon38", 
   "When was the last time anyone observed an fish change into a lizard before their eyes. \n\n \n And if this was observed, evolution would be disproven. But we can observe the anatomy of a fish and and amphibian, the genetic structure of a fish and an amphibian and the only explaination that fits the evidence provided by these observations is the theory of evolution.", 
   {}, 
   178465, 
   null, 
   1131672840.0
  ], 
  [
   178846, 
   null, 
   "prschuster", 
   "[QUOTE=stormboy][QUOTE=Rygar][quote]Science in my opinion is based on \"Observable evidence and things that can be proven scientifically\"\n seeing that Creationism is neither of these and we have to base it on a book that could contain bias, false evidence, and other things...I rule that it is NOT scientific although it may be a theory.\n When was the last time anyone observed a fish change into a lizard before their eyes. Without the time required it is impossible, all one can do is to translate the evidance in the direction their world view steers them.\n\n \n \n \n Walking-fish:\n By the same token, no one has ever seen two Hydrogen atoms combine with an Oxygen atom to form a Water molecule by covalently sharing a pair of electrons. No one has ever observed the Earth actually revolve around the Sun. No one has ever taken a tape measure and actually manually measured the distance between stars & planets. No one has actually sat around for thousands of years and watched stalagmites & stalagtites form from dissolved minerals dripping from cave ceilings. Nearly all theories in science, from atomic theory to astrophysics, involve inferences about things we cannot actually see, but we still have plenty of evidence the same way forensic specialists find evidence for a crime which no one has observed. The evidence for evolution comes from several disciplines including Genetics, geochronology, biogeography, paleontology, taxonomy, comparative anatomy, embryology etc... I can give you plenty of examples upon request, showing the concilience between these disciplines.", 
   {}, 
   178465, 
   null, 
   1131782820.0
  ], 
  [
   179192, 
   null, 
   "stormboy", 
   "[QUOTE=prschuster][QUOTE=stormboy][QUOTE=Rygar][quote]Science in my opinion is based on \"Observable evidence and things that can be proven scientifically\"\n \n \n \n Walking-fish:\n By the same token, no one has ever seen two Hydrogen atoms combine with an Oxygen atom to form a Water molecule by covalently sharing a pair of electrons. No one has ever observed the Earth actually revolve around the Sun. No one has ever taken a tape measure and actually manually measured the distance between stars & planets. No one has actually sat around for thousands of years and watched stalagmites & stalagtites form from dissolved minerals dripping from cave ceilings. Nearly all theories in science, from atomic theory to astrophysics, involve inferences about things we cannot actually see, but we still have plenty of evidence the same way forensic specialists find evidence for a crime which no one has observed.\n The evidence for evolution comes from several disciplines including Genetics, geochronology, biogeography, paleontology, taxonomy, comparative anatomy, embryology etc... I can give you plenty of examples upon request, showing the concilience between these disciplines.\n\n Again we will always translate evidence towards our worldview, i believe you could also give me plenty more examples, how ever you would also be giving me the evidence for creation as well..\n www.halos.com/videos/streaming-video.htm. (I would like your thoughts on the fingerprints video)", 
   {}, 
   178846, 
   null, 
   1131965460.0
  ], 
  [
   179607, 
   null, 
   "prschuster", 
   "Walking-fish:\n By the same token, no one has ever seen two Hydrogen atoms combine with an Oxygen atom to form a Water molecule by covalently sharing a pair of electrons. No one has ever observed the Earth actually revolve around the Sun. No one has ever taken a tape measure and actually manually measured the distance between stars & planets. No one has actually sat around for thousands of years and watched stalagmites & stalagtites form from dissolved minerals dripping from cave ceilings. Nearly all theories in science, from atomic theory to astrophysics, involve inferences about things we cannot actually see, but we still have plenty of evidence the same way forensic specialists find evidence for a crime which no one has observed.\n \n \n \n Storm Boy:\n Again we will always translate evidence towards our worldview, i believe you could also give me plenty more examples, how ever you would also be giving me the evidence for creation as well..\n www.halos.com/videos/streaming-video.htm. (I would like your thoughts on the fingerprints video)[/QUOTE]\n \n \n \n Walking-fish:\n Let me start out by saying that you are confusing evidence with data. These Polonium Halos constitute raw data, not evidence. It is data that is interpreted, and it becomes evidence only after this interpretation has been confirmed by empirical methods. With Gentry's Polonium Halos we first have to establish that the granite is only from primordial rock and that there is no recent contamination from Uranium in surrounding rock. It is the opinion of the geological establishment that these two conditions have not been met. Thomas Baillieul, a professional geologist, discounts these halos as evidence for a young Earth on these counts:\n 1) The granite samples with halos contain myrmekite - an indication that the samples were not from primordial rock.\n 2) Halos are found in areas where Uranium is rich, but not where it is scarce.\n 3) Halos line up along visible fractures in mica (a mineral found in granite).\n 4) This points to another possibility: Rn-222 from U-238 decay migrated along cracks in mica then decayed into Po-218 / Po-214 / Po-210 respectively thereby giving the halos.\n \n However, this issue of the halos is a diversion, because creationists also have to dismiss untold thousands of radiometric dates from U-238, K-40 & Rb-87 decay which concur with eachother at least 95% of the time. The samples with incongruent dates have been shown to have been contaminated or analyzed with faulty technique. When creationists (esp YECs) can come up with explanations for why the congruent dates are wrong, they can then claim to have evidence for a young Earth, instead of data that they arbitrarily interpret. \n \n Now it's up to you to tell me why the empirical evidence as used by scientists is unreliable. And if it's not reliable, why would you accept the empirical evidence for the atomic theory? Also explain to me why the concilience of so many disciplines in biology & geology can be dismissed in respect to evolution. Be specific - not vague.", 
   {
    "post_info": {
     "post_title": "Data is not Evidence"
    }
   }, 
   179192, 
   null, 
   1132111260.0
  ], 
  [
   179622, 
   null, 
   "electrolyte", 
   "Okay, someone help me out here.\n \n I have a degree in chemistry, so I'm not totally ignorant of radioactive decay. However, I don't quite understand how migratory radon-222 could cause circular (spherical) halos.\n \n If I understand the hypothesis correctly, the halos are caused by the action of the particles that result from decay (nevermind which kind of decay; it is irrelevant to my question).\n \n A halo would be the result of a cross-section of the rock through the center of the concentric spheres of damage. Assuming that the particles are ejected at statistically random directions from the nuclei of the pocket of radioactive atoms, wouldn't there have to be a large number of non-mobile unstable atoms originally located in that pocket? That is, if there was only a single atom of Rn-222, we could expect to see only one speck of \"damage\" to the crystalline structure of the surrounding rock that corresponds to the 5.486MeV of the alpha particle ejected by Rn-222 decay, then a single speck corresponding to the 6.111MeV of the particle ejected from Po-218 decay, etc.\n \n Perhaps I am missing something, but the above makes me think that the radon-222 possibility is a bit lacking. Anyone have an explanation?", 
   {}, 
   179607, 
   null, 
   1132115400.0
  ], 
  [
   179627, 
   null, 
   "prschuster", 
   "Electrolyte wrote:\n A halo would be the result of a cross-section of the rock through the center of the concentric spheres of damage. Assuming that the particles are ejected at statistically random directions from the nuclei of the pocket of radioactive atoms, wouldn't there have to be a large number of non-mobile unstable atoms originally located in that pocket? That is, if there was only a single atom of Rn-222, we could expect to see only one speck of \"damage\" to the crystalline structure of the surrounding rock that corresponds to the 5.486MeV of the alpha particle ejected by Rn-222 decay, then a single speck corresponding to the 6.111MeV of the particle ejected from Po-218 decay, etc\n \n \n \n Walking-fish:\n I was a biology major in college, so I know less about chemistry than you do. But here is what I understand... With a half life of 3.8 days, the inert Rn-222 would have enough time to migrate along the fissures to tiny structural traps where they'd meet a dead end. This would happen in the same spot repeatedly over many millenia, so the concentric rings emanating from these spots would accumulate. It is also important to note that the rings correspond to Po-218, Po-214 & Po-210 - just what you'd expect from Rn-222 decay. It is also consistent with U-238 decay in surrounding rocks.\n \n Rn-219 & Rn-220 from U-235 & Th-232 decay would give different Polonium halos due to different Po isotopes. Also, these isotopes of Rn have a half life of less than a minute and would not be likely to migrate to these little cul de sacs in the fissures in time. Does this seem more plausible to you?", 
   {
    "post_info": {
     "post_title": "Polonium Halos"
    }
   }, 
   179622, 
   null, 
   1132119060.0
  ], 
  [
   179777, 
   null, 
   "electrolyte", 
   "Does this seem more plausible to you?\n\n Yes, Walking-fish, it does. The statements of the halos being found \"along fractures in the biotite mica\" (or whatever the exact wording is) leaves a bit to be desired if there are dead ends. However, your comments sparked two thoughts...\n \n Radon is a pretty big atom. I have no idea how it compares in size to the cracks, but maybe the atoms were bigger than narrow spaces of the crack, even if the crack is continuous.\n \n I wasn't considering a replenishing supply of Rn-222. If the gas migrates up and gets trapped, there's no need for all the gas being at the same place at the same time.\n \n ... Now I feel dumb for not thinking of this earlier..\n Regardless, thanks W-f.", 
   {}, 
   179627, 
   null, 
   1132186020.0
  ], 
  [
   179792, 
   null, 
   "prschuster", 
   "Actually, your question helped me, Electrolyte. I never considerd the problem of concentric halos from migrating atoms 'til you brought the issue up.", 
   {
    "post_info": {
     "post_title": "To Electrolyte"
    }
   }, 
   179777, 
   null, 
   1132192140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  OK, so what exactly has creationist science found out o far?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6702-ok-so-what-exactly-has-creationist-science-found-out-o-far.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 6702, 
  "discussion_files": [
   [
    "10887.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6702-ok-so-what-exactly-has-creationist-science-found-out-o-far-print.html"
   ], 
   [
    "10888.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6702-ok-so-what-exactly-has-creationist-science-found-out-o-far-3-print.html"
   ], 
   [
    "10889.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6702-ok-so-what-exactly-has-creationist-science-found-out-o-far-2-print.html"
   ]
  ], 
  "identifier": 6702
 }
]