[
 [
  [
   174514, 
   null, 
   "Ooaman", 
   "I was wondering what everyone thought was the best video game system out of the list above...\n Nintendo (that's mine)\n Sega\n Sony\n X-Box\n Or another system not mentioned here?\n This includes maybe even if they don't exist anymore.", 
   {
    "post_info": {
     "post_title": "Best Video Game System"
    }
   }, 
   null, 
   null, 
   1130350140.0
  ], 
  [
   174535, 
   null, 
   "Big_Bear_Scot", 
   "I'm in love with my Sony PSP and Nintendo DS. \n \n If I was to pick one of the other options I would say Playstation 2. Sony got it right it is not the Speed(or power) of the machine it is the quality of the games released.", 
   {}, 
   174514, 
   null, 
   1130352300.0
  ], 
  [
   174538, 
   null, 
   "Master_Shake", 
   "I love nintendo and super nintendo, but I also love my X-Box.\n \n \nSony got it right it is not the Speed(or power) of the machine it is the quality of the games released.\n\n But the quality of your games can go up when there is better hardware to work with. I can't wait for the X-Box 360, although I won't be able to get on right away. Poor college student here :)", 
   {}, 
   174535, 
   null, 
   1130352600.0
  ], 
  [
   174553, 
   null, 
   "sanguinekane", 
   "PC gaming rigs are at the top. They far surpass anything a console can put out. \n \n Otherwise, I say it goes:\n Sony\n Nintendo\n X-box\n Sega\n \n Based on number of good games, ease of use, and price.", 
   {}, 
   174538, 
   null, 
   1130355180.0
  ], 
  [
   174559, 
   null, 
   "Steeeeve", 
   "The gaming system of all time was the Nintendo hands down. The best games came for the Super Nintendo (as they had a chance to improve on the games created by Nintendo). I still have a Nintendo that works :)", 
   {}, 
   174553, 
   null, 
   1130356980.0
  ], 
  [
   174718, 
   null, 
   "Quetzalcoatl", 
   "I'm a fan of the Playstation systems. I don't game very much, but I really enjoy playing the Tekken series.", 
   {}, 
   174538, 
   null, 
   1130393280.0
  ], 
  [
   174731, 
   null, 
   "Matthew S", 
   "The problem I have with these vidoe games systems, and the same one I am having with winXP, is the lack of backward compatibility. You spend hundreds of dollars on the system and the games only to have to respend hundreds of dollars on the next version of the game system along with all new games. WinXp will not allow me to play my dos and 16bit games.", 
   {}, 
   174718, 
   null, 
   1130416740.0
  ], 
  [
   175007, 
   null, 
   "zachvac", 
   "The gaming system of all time was the Nintendo hands down. The best games came for the Super Nintendo (as they had a chance to improve on the games created by Nintendo). I still have a Nintendo that works :)\n\n \n I had my Nintendo break a couple months ago, and I've still got a Super Nintendo, but I've also got a PS2 :)", 
   {}, 
   174559, 
   null, 
   1130476260.0
  ], 
  [
   175008, 
   null, 
   "zachvac", 
   "The problem I have with these vidoe games systems, and the same one I am having with winXP, is the lack of backward compatibility. You spend hundreds of dollars on the system and the games only to have to respend hundreds of dollars on the next version of the game system along with all new games. WinXp will not allow me to play my dos and 16bit games.\n\n \n But most games you can play even if they're not sold anymore. I enjoy sports games mostly and that means outdated games have outdated names, but if I can play the same game for years afterwards it's worth $50 just to have different names. I still play NBA Live 1997 for Super Nintendo. Not nearly as realistic as some of the games today, but it's still fun and a lot cheaper.", 
   {}, 
   174731, 
   null, 
   1130476380.0
  ], 
  [
   179182, 
   null, 
   "Poligeek", 
   "Well nowadays I consider myself a fan of Playstation's stuff, but for sheer gaming value, nothing was better than Sega Genesis. I have fond memories of playing it, and they were the first system to make really awesome sports games.", 
   {}, 
   175008, 
   null, 
   1131950700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Best Video Game System", 
  "url": "http://www.4forums.com/political/entertainment-debates/6708-best-video-game-system.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 6708, 
  "discussion_files": [
   [
    "12519.html", 
    "http://www.4forums.com/political/entertainment-debates/6708-best-video-game-system-print.html"
   ]
  ], 
  "identifier": 6708
 }
]