[
 [
  [
   174697, 
   null, 
   "joebrummer", 
   "I have recently been accused of being intolerant of opposing views to homosexuality. The reality is these views are not opposing they are oppresing. They are based on lies, misinformation, and bad studies that claim to be science. The majority of anti-gay propaganda out there comes from right wing christian groups. \n \n The question to debate ???\n \n Where do you draw the line between opposing views? and just plain ole hate.", 
   {
    "post_info": {
     "post_title": "Intolerant"
    }
   }, 
   null, 
   null, 
   1130389680.0
  ], 
  [
   174704, 
   null, 
   "Bassman", 
   "OK, Hypothetically. Say you have new neighbors move in. And they were the most caring, considerate, willing to help you out type of neighbors. You'd have a very favorable view of them, wouldn't you? And what if these same neighbors helped you out tremendously during a crisis in your life. You'd think very highly of them, wouldn't you? Now, what if you discovered that these neighbors were Bible beleiving, Bible living people? What would you think of them? They exhibited Christ's love towards you.", 
   {}, 
   174697, 
   null, 
   1130391240.0
  ], 
  [
   174710, 
   null, 
   "joebrummer", 
   "OK, Hypothetically. Say you have new neighbors move in. And they were the most caring, considerate, willing to help you out type of neighbors. You'd have a very favorable view of them, wouldn't you? And what if these same neighbors helped you out tremendously during a crisis in your life. You'd think very highly of them, wouldn't you? Now, what if you discovered that these neighbors were Bible beleiving, Bible living people? What would you think of them? They exhibited Christ's love towards you.\n\n \n \n I have neighbors like that now, two ex-nuns who are very catholic....we do dinner about once a monthy. They came to our wedding under the understanding that they didn't approve but wished us to be happy......they have stated the bible and made their thought known, but attended the wedding anyway. took tons of picture and sent us the pictures......", 
   {}, 
   174704, 
   null, 
   1130391840.0
  ], 
  [
   174712, 
   null, 
   "Bassman", 
   "OK, back to my example. What if the family was (gasp) Evangelical?", 
   {}, 
   174710, 
   null, 
   1130392140.0
  ], 
  [
   174720, 
   null, 
   "Master_Shake", 
   "Because Catholics aren't Christians, right Bassman?", 
   {}, 
   174712, 
   null, 
   1130395500.0
  ], 
  [
   174726, 
   null, 
   "Matthew S", 
   "\n \n Where do you draw the line between opposing views? and just plain ole hate.\n\n \n \n I draw the line at full acceptance the same as hetero acceptance. Anything less then full acceptance; any opposing view is a stance of hate. To qualify the previous statement they are different levels of hate. The neighbors in bassmans argument may be kind and loving in a sense but if they have a belief that gayness is a sin while hetero is not then it is a form of hate. After all one of their favorite sayings is \"love the sinner hate the sin.\" So if they don't understand that the gayness and the person can not be seperated then they hate us.", 
   {}, 
   174697, 
   null, 
   1130413020.0
  ], 
  [
   174729, 
   null, 
   "Symbiote", 
   "You probably are intolerant of anti-gay views. So what? I'm intolerant of XXXXXX. It's not something to be afraid of. The problem is not with intolerance itself, but in violent action, whether legally through the government, or illegally through more personal violence.", 
   {}, 
   174726, 
   null, 
   1130415360.0
  ], 
  [
   174745, 
   null, 
   "joebrummer", 
   "OK, back to my example. What if the family was (gasp) Evangelical?\n\n What if they were? I don't see what difference it would make as long as they are not causing a problem for me and my partner. I see no reason having religious neighbors would be a bid deal. I am not against religion. My own sister is a born again, evangelical. SHe is just not a fundementalist. She has raised her kids to be be born again. I think it is great. She has also taught them that gay people are just part of life. \n \n Being religious can be a good thing, it is when you loose your common sense I think it starts to cross the line.", 
   {}, 
   174712, 
   null, 
   1130426100.0
  ], 
  [
   174746, 
   null, 
   "Kronus", 
   "\n Where do you draw the line between opposing views? and just plain ole hate.\n\n \n This seems fairly straight forward to me. You tolerate that which is different, not that which is harmful. No one has ever shown that being gay is harmful, just that it's different. And so it should be tolerated. Homophobia and gay-bashing does do harm, and so should not be tolerated. If you simply don't like gays than that's your opinion, and opinions in and of themselves do no harm. If you feel compelled by your opinion to try to deprive gays of their basic rights, then you're doing harm and should no longer be tolerated.", 
   {}, 
   174697, 
   null, 
   1130426100.0
  ], 
  [
   174747, 
   null, 
   "joebrummer", 
   "Now, reverse the situation.....what if you new neighbors were gay and you were an evangelical chrisitan......then what? Do you move, do you try to convert them? Do you hide you children from them?\n \n Reverse the story. Tell us what you would do.", 
   {}, 
   174745, 
   null, 
   1130426160.0
  ], 
  [
   174748, 
   null, 
   "jyoshu", 
   "I have recently been accused of being intolerant of opposing views to homosexuality. The reality is these views are not opposing they are oppresing. \n\n \n An idea can't oppress you. You are talking about opinions, not people with bats or guns. If you can't tell the difference, I don't know what else to say.\n \n \n \nWhere do you draw the line between opposing views? and just plain ole hate.\n\n \n I'd say the line lies with the person. If the person acts hateful or does something hateful, then it's not just an opinion but it's hate. If a person does what most people here do and simply give their view, it should be assumed it's not hate unless acted on in some way.\n \n Whoever told you that was absolutely right--the very fact that you apparently have no room to even consider that the other view is anything but hate only shows your intolerence.", 
   {}, 
   174697, 
   null, 
   1130426220.0
  ], 
  [
   174753, 
   null, 
   "jyoshu", 
   "The thing is, the idea that gay pride activists will give you is that people who are opposed to homosexual marriage are always full of hate and prejudice. They often paint a monstrous picture, even though it's usually not the case. A lot of people will care very much about you and give their shirt for you, but they may still disagree with you on this issue. The people I know would open their home to anyone, gay or straight. I'd do it too, for that matter. I would think that probably rocks your world-view a bit, but it's true. Most people who's opinion is that gay marriage is not acceptable are anything but the monsters they're portrayed as being. Most are very good people. We've got to get past this idea that just because someone disagrees with us on something that it's hate. It's a recent problem I think, because I believe there was a time when people were more tolerant of hearing things that disagreed with them without taking it so personally.\n \n In a way, the gay movement is a lot like religious fundamentalists in this way. Any disagreement toward them is chalked up to some generalization (in this case, hate) and they are intolerent of that disagreement even though it might not be rooted in hate at all.", 
   {}, 
   174748, 
   null, 
   1130426640.0
  ], 
  [
   174756, 
   null, 
   "joebrummer", 
   "An idea can't oppress you. You are talking about opinions, not people with bats or guns. If you can't tell the difference, I don't know what else to say.\n\n \n I think you are not realy considering what is being said. Please re-read the first post. If you do not understand it, then ask for clarification, but judging by your response. YOu dodn't understand it.\n \n We are not talking about ideas we are talking about actions. Easyrider here spreading unscientific facts and promoting sterotypes is oppression. EAsyrider just saying that homosexuality is a sin in his faith is just an opposing view. Where is the line drawn, or crossed from one of those to the next. Is that a clearer statement for you?\n \n \n\n I'd say the line lies with the person. If the person acts hateful or does something hateful, then it's not just an opinion but it's hate. If a person does what most people here do and simply give their view, it should be assumed it's not hate unless acted on in some way.\n\n \n Love it when you make a fool of yourself....your first part of this reply, you say that ideas cannot not be oppressive, then here you explain how they are. Do like eating foot? \n \n\n Whoever told you that was absolutely right--the very fact that you apparently have no room to even consider that the other view is anything but hate only shows your intolerence.\n\n \n Give me an opposing view that isn't hate? I would be happy to show you how it is.", 
   {}, 
   174748, 
   null, 
   1130426940.0
  ], 
  [
   174788, 
   null, 
   "jyoshu", 
   "We are not talking about ideas we are talking about actions. Easyrider here spreading unscientific facts and promoting sterotypes is oppression. EAsyrider just saying that homosexuality is a sin in his faith is just an opposing view. Where is the line drawn, or crossed from one of those to the next. Is that a clearer statement for you?\n\n \n And Easyrider is right on this that his is simply an opposing view. Nothing that Easyrider has said means it's hate. He may or may not be \"spreading unscientific facts\" (if it's unscientific, how can it be a fact anyway?) but it's still his view. It's not hate just because of that. You are on very shaky ground ANYTIME you accuse someone of hate just for giving a different view--hate is not something you can measure. It's often not something for which there is quantifiable evidence. Yet you throw the word around like a rhetorical football anytime you get the opportunity.\n \n \nLove it when you make a fool of yourself....your first part of this reply, you say that ideas cannot not be oppressive, then here you explain how they are. \n\n \n No, I am making it clear that it's the actions that are oppresive (not their ideas/opinions) that's why I said it's when a person takes action that should be the line for when it's hate.", 
   {}, 
   174756, 
   null, 
   1130432340.0
  ], 
  [
   174793, 
   null, 
   "joebrummer", 
   "[QUOTE=jyoshu]And Easyrider is right on this that his is simply an opposing view. Nothing that Easyrider has said means it's hate. He may or may not be \"spreading unscientific facts\" (if it's unscientific, how can it be a fact anyway?) but it's still his view. It's not hate just because of that. You are on very shaky ground ANYTIME you accuse someone of hate just for giving a different view--hate is not something you can measure. It's often not something for which there is quantifiable evidence. Yet you throw the word around like a rhetorical football anytime you get the opportunity.\n [quote]\n Your reaing skills are weak today! I gave an example of what I find \"opposing\" and I gave an example of I consider to be oppressive. I used EX for both examples. The reality is, you just want to comment and rip on my posts, but you are not reading what is really written. Wutsup with that?\n \n \n\n No, I am making it clear that it's the actions that are oppresive (not their ideas/opinions) that's why I said it's when a person takes action that should be the line for when it's hate.\n\n \n expressing an opinoin is an action. Expressing is a verb!", 
   {}, 
   174788, 
   null, 
   1130433120.0
  ], 
  [
   174797, 
   null, 
   "unkerpaulie", 
   "I have recently been accused of being intolerant of opposing views to homosexuality. The reality is these views are not opposing they are oppresing. They are based on lies, misinformation, and bad studies that claim to be science. The majority of anti-gay propaganda out there comes from right wing christian groups. \n \n The question to debate ???\n \n Where do you draw the line between opposing views? and just plain ole hate.\n\n hmmm... between violent hate for gays and lifelong compassion for gays there is a vast spectrum of degrees opposition or acceptance. and there's also indifference. i would say hate is just around the point of name calling and closed-mindedness. unacceptance and even intolerance doesnt necessarily equate to hate, but they closer than neutral", 
   {}, 
   174697, 
   null, 
   1130433480.0
  ], 
  [
   174798, 
   null, 
   "jyoshu", 
   "expressing an opinoin is an action. Expressing is a verb!\n\n \n Good grief, come on. You're being intentionally silly now. You know what I mean. \n \n Tell you what--go ahead and show one, just one person who's ever been truly harmed at the hearing of an idea or viewpoint. \n \n \"Sticks and stones may break my bones, but words . . .\"", 
   {}, 
   174793, 
   null, 
   1130433780.0
  ], 
  [
   174800, 
   null, 
   "unkerpaulie", 
   "Give me an opposing view that isn't hate? I would be happy to show you how it is.\n\n opposing views that are not hate:\n \"homosexuality is against my beliefs\"\n \"i would be very disappointed if one of my friends or family were gay\"\n \"i dont believe gays should be allowed to marry\"\n \"i dont see why gays need a designated parade\"\n \"there is no such thing as a gay gene\"\n \"gays choose to be gay\"\n \"i dont want to be gay\"\n \n all these statements clearly show opposition towards gays. none of them can be accurately construed as hate towards gays", 
   {}, 
   174756, 
   null, 
   1130433840.0
  ], 
  [
   174801, 
   null, 
   "Phunting", 
   "I agree with what Jyoshu has said on this one, and I am totally in support of homosexual equality and marriage.\n \n Belief that homosexuality is a sin is just an opposing view. I don't think you can blame the guy for following his scripture. Edit: I realise Joe that I slightly misinterpreted what you were saying about Easy here, sorry!\n \n It becomes oppression, however, when that view is forced on others through, as Jyoshu says, actions. Such as attempting to modify the constitution.", 
   {}, 
   174788, 
   null, 
   1130433840.0
  ], 
  [
   174803, 
   null, 
   "jyoshu", 
   "hmmm... between violent hate for gays and lifelong compassion for gays there is a vast spectrum of degrees opposition or acceptance. and there's also indifference. i would say hate is just around the point of name calling and closed-mindedness. unacceptance and even intolerance doesnt necessarily equate to hate, but they closer than neutral\n\n \n As I'm saying to Joe, I think the best place to draw the line is where hate is acted out. That's the only condition where one can truly know that hate is present. For instance, a person can hang a confederate flag and it appear to be an act of hate. But that doesn't necessarily mean it is. He may just like it for the historical value or it's identity with southern culture. But if it leads him to act out his hate, then there's the line.", 
   {}, 
   174797, 
   null, 
   1130434020.0
  ], 
  [
   174807, 
   null, 
   "MrWriteLA", 
   "It becomes oppression, however, when that view is forced on others through, as Jyoshu says, actions. Such as attempting to modify the constitution.\n Or by disseminating slanderous lies and stereotypes about people in public fora.", 
   {}, 
   174801, 
   null, 
   1130434140.0
  ], 
  [
   174809, 
   null, 
   "unkerpaulie", 
   "As I'm saying to Joe, I think the best place to draw the line is where hate is acted out. That's the only condition where one can truly know that hate is present. For instance, a person can hang a confederate flag and it appear to be an act of hate. But that doesn't necessarily mean it is. He may just like it for the historical value or it's identity with southern culture. But if it leads him to act out his hate, then there's the line.\n\n i would say that there are degrees of opposition BEFORE acting out that can be construed as hate. name calling, or creating insulting or degrading images, are acts of hate that goes beyond moderate opposition. violence is defeinitely across that line, but hate that is only expressed is still hate", 
   {}, 
   174803, 
   null, 
   1130434260.0
  ], 
  [
   174812, 
   null, 
   "Phunting", 
   "Or by disseminating slanderous lies and stereotypes about people in public fora.\nI don't know. I too despair at the amount of stereotyping that he and others tend to use, along with the rather dubious 'facts' supporting their claims. Yet everyone is entitled to their opinion, and to label it oppression is a bit much.\n \n And of course, such fora would be much less interesting, if at times also less frustrating, without it.", 
   {}, 
   174807, 
   null, 
   1130434620.0
  ], 
  [
   174815, 
   null, 
   "joebrummer", 
   "Good grief, come on. You're being intentionally silly now. You know what I mean. \n \n Tell you what--go ahead and show one, just one person who's ever been truly harmed at the hearing of an idea or viewpoint. \n \n \"Sticks and stones may break my bones, but words . . .\"\n\n Sure, I'd be happy to.\n \n Imagine the kids with gay parents, goes to school and hears the teacher talk about how gays are going to hell....kids home crying....mommy are you going to hell?\n \n \n This is a kid that was hurt by hearing a view point.\n or\n \n When was bashed back ten years ago, the police officer said to me, that I am sick and got what I deserved......he was only expressing his view, right?\n \n \n Jyoshu, you cannot justufy hate speech by saying it is less than violence, We all know words can hurt others. We all know that views can be hurtful. Unless you are blind and deaf.\n \n If someones expresses the view that black people ar savages....that is hate speech and hurtful. WOuld you disagree or just say it's fine because they are expressing their view......", 
   {}, 
   174798, 
   null, 
   1130435580.0
  ], 
  [
   174816, 
   null, 
   "MrWriteLA", 
   "I don't know. I too despair at the amount of stereotyping that he and others tend to use, along with the rather dubious 'facts' supporting their claims. Yet everyone is entitled to their opinion, and to label it oppression is a bit much.\n \n And of course, such fora would be much less interesting, if at times also less frustrating, without it.\n It is only the anonymity of this forum that protects some of the posters here from being sued for slander. To publically and repeatedly make claims that the gay posters here are inherent disease-spreaders, bad parents, child corrupters, supporters of pedophilia, immoral, liars, etc. is defamatory and potentially injurious to our characters and welfare, should some gullible websurfer believe their bilge and decide to take action against us as a result--whether at the ballot box or with a baseball bat.", 
   {}, 
   174812, 
   null, 
   1130435760.0
  ], 
  [
   174818, 
   null, 
   "jyoshu", 
   "i would say that there are degrees of opposition BEFORE acting out that can be construed as hate. name calling, or creating insulting or degrading images, are acts of hate that goes beyond moderate opposition. violence is defeinitely across that line, but hate that is only expressed is still hate\n\n \n I can see what you mean in that some who persist in name-calling would be taking part in hate. But let's be realistic--how many people really come to these forums and do that? It's not like it's common for anyone to name call or say truly hateful things here. The real issue is that some in the gay pride movement would like to portray ANY opposing opinion as hate. And that's really the crux here. And I can never agree with that.\n \n You do have a point though, as in the case of Fred Phelps who who's website certainly expresses his opinion, and it's definitely indicative of hate. Nevertheless I wouldn't say anyone is truly oppressed by reading it.", 
   {}, 
   174809, 
   null, 
   1130435880.0
  ], 
  [
   174819, 
   null, 
   "joebrummer", 
   "Something I believe to be true would be\n \n If your view against homosexuality is based on something true.....then you are opposed.\n \n \n If your views are based in lies, bad science and sterotypes, then it is plain, good ole fashion HATE and oppression.", 
   {}, 
   174816, 
   null, 
   1130435940.0
  ], 
  [
   174820, 
   null, 
   "jyoshu", 
   "It is only the anonymity of this forum that protects some of the posters here from being sued for slander. To publically and repeatedly make claims that the gay posters here are inherent disease-spreaders, bad parents, child corrupters, supporters of pedophilia, immoral, liars, etc. \n\n \n Of course, that's rarely the claim made. There's a big difference in saying \"You are a bad parent\" or \"you are a disease-spreader\" than saying \"gay people have a higher rate of HIV infection,\" or even \"gay people should not be raising kids.\" And \"immoral?\" Please. This is a classic case of arguements made about actions being misrepresented to be about individual people.\n \n Besides, with that standard, both sides would be guilty of slander at times. Anonymity or not, no attorney is going to seriously consider the arguments about homosexuality to be examples of legal slander against individuals. Well, unless they're the ambulance-chaser sort, maybe.", 
   {}, 
   174816, 
   null, 
   1130436300.0
  ], 
  [
   174822, 
   null, 
   "jyoshu", 
   "If your views are based in lies, bad science and sterotypes, then it is plain, good ole fashion HATE and oppression.\n\n \n What if it's based solely on religion?", 
   {}, 
   174819, 
   null, 
   1130436360.0
  ], 
  [
   174824, 
   null, 
   "jyoshu", 
   "Sure, I'd be happy to.\n \n Imagine the kids with gay parents, goes to school and hears the teacher talk about how gays are going to hell....kids home crying....mommy are you going to hell?This is a kid that was hurt by hearing a view point.\n\n \n How is that a measurable form of hurt? You don't know if it \"hurt\" them at all.\n \n \nWhen was bashed back ten years ago, the police officer said to me, that I am sick and got what I deserved......he was only expressing his view, right?\n\n \n No, in this case his comment was directed at you. It wasn't a comment about homosexuality but a personal one. So I'd agree with you on this one. But we're talking about arguments and opinions about homosexuality. Let's not mddy the waters by throwing in the issue of intentional personal insults thrown at people. \n \n \nIf someones expresses the view that black people ar savages....that is hate speech and hurtful. WOuld you disagree or just say it's fine because they are expressing their view......\n\n \n There probably is hate behind it, but I don't think that anyone is truly oppresed by hearing that.", 
   {}, 
   174815, 
   null, 
   1130436600.0
  ], 
  [
   174832, 
   null, 
   "joebrummer", 
   "[QUOTE=jyoshu]How is that a measurable form of hurt? You don't know if it \"hurt\" them at all.\n [quote]\n Yeah, your right, kids always cry when they are happy.\n \n \n\n No, in this case his comment was directed at you. It wasn't a comment about homosexuality but a personal one. So I'd agree with you on this one. But we're talking about arguments and opinions about homosexuality. Let's not mddy the waters by throwing in the issue of intentional personal insults thrown at people. \n \n\n No, it wasn't directed at me. It was a comment made soley because I am gay. His comment meant that if I wasn't gay, I wouldn't have been beaten up. It was a hurtful comment based on his view of homosexuals, which he was expressing. You are losing this one.\n \n\n \n There probably is hate behind it, but I don't think that anyone is truly oppresed by hearing that.\n\n \n That because you enjoy being blind. hate does oppress people. So do negative views. Like ex-gays who only potray gays in a negative light is not oppressive to gays? Bull. It is very oppressive.", 
   {}, 
   174824, 
   null, 
   1130437080.0
  ], 
  [
   174834, 
   null, 
   "Phunting", 
   "Imagine the kids with gay parents, goes to school and hears the teacher talk about how gays are going to hell....kids home crying....mommy are you going to hell?\n \n \n This is a kid that was hurt by hearing a view point.\n or\n \n When was bashed back ten years ago, the police officer said to me, that I am sick and got what I deserved......he was only expressing his view, right?\n \nYour examples are of people in positions of authority acting in a way that abuses said authority by pushing their own personal agenda. Of course that is wrong.", 
   {}, 
   174815, 
   null, 
   1130437260.0
  ], 
  [
   174836, 
   null, 
   "unkerpaulie", 
   "Something I believe to be true would be\n \n If your view against homosexuality is based on something true.....then you are opposed.\n \n \n If your views are based in lies, bad science and sterotypes, then it is plain, good ole fashion HATE and oppression.\n\n i disagree with your charges of hate and oppression, but i understand where you are coming from. the first step is to determine whether the statements made are based on truth or lies. until you can clearly determine that, then you cannot distinguish what is \"hate\" from what is opposition\n \n i still believe that somebody can be opposed to homosexuality on a false basis and not hate homosexuals. if i say i dont feel that gays should get married because i dreamed that a hamster told me they shouldnt get married, then i oppose homosexual marriage on a false basis, not because i have hate towards homosexuals\n \n to me, the easiest way to detect hate is in name-calling, insults, closedminded defensiveness and deliberately hurtful remarks. mind you, none of these things can \"oppress\" you (as jyoshu pointed out), but they are signs that the person making the statement is a hater", 
   {}, 
   174819, 
   null, 
   1130437500.0
  ], 
  [
   174838, 
   null, 
   "Phunting", 
   "It is only the anonymity of this forum that protects some of the posters here from being sued for slander. To publically and repeatedly make claims that the gay posters here are inherent disease-spreaders, bad parents, child corrupters, supporters of pedophilia, immoral, liars, etc. is defamatory and potentially injurious to our characters and welfare, should some gullible websurfer believe their bilge and decide to take action against us as a result--whether at the ballot box or with a baseball bat.\nI have seen just as negative comments made about Christians/ Republicans/ whatever. These views are just as offensive, stereotypical and wrong. I equally don't believe they should not have the right to be said.\n \n If we limit our free speech through fear of what the stupid will do we may as well not say anything.", 
   {}, 
   174816, 
   null, 
   1130437620.0
  ], 
  [
   174844, 
   null, 
   "joebrummer", 
   "I have seen just as negative comments made about Christians/ Republicans/ whatever. These views are just as offensive, stereotypical and wrong. I equally don't believe they should not have the right to be said.\n \n If we limit our free speech through fear of what the stupid will do we may as well not say anything.\n\n no one is saying you shouldn't have the right, but you should have the decency not to say it in the forst place.\n \n \n Also, yes, negative comments to lead to oppression..\n \n When Jerry Falwell (as an example) claims that gays are the scapegoat for hurricanes, and disasters....that adds to the oppression of gays. What people really hear isn't what he said.\n \n They hear.....those gay people are the reason for these bad things, therfore gays are bad....an untrue statement that leads to oppression, how?\n \n When you consider a group of people bad, because people keep expressing that view, you won't want to give them protections, rights, freedoms. It becomes oppression.", 
   {}, 
   174838, 
   null, 
   1130438100.0
  ], 
  [
   174846, 
   null, 
   "MrWriteLA", 
   "I have seen just as negative comments made about Christians/ Republicans/ whatever. These views are just as offensive, stereotypical and wrong. I equally don't believe they should not have the right to be said.\n \n If we limit our free speech through fear of what the stupid will do we may as well not say anything.\n Religion and political affiliation are inherently debatable belief systems. One's inherent sexual orientation is not, any more than is one's race. There you're talking about who someone is, about his personal makeup. If you tell people that I'm more likely to have HIV/AIDS, or that I'm promiscuous, or a bad father, all by dint of my homosexuality) then you have publically slandered me, no less than if I was African-American and you posted that all blacks are genetically inferior and lay around eating watermelon all day. There's a difference between disagreement and slander.", 
   {}, 
   174838, 
   null, 
   1130438820.0
  ], 
  [
   174853, 
   null, 
   "BobNelson2", 
   "Tell you what--go ahead and show one, just one person who's ever been truly harmed at the hearing of an idea or viewpoint. \n \n \"Sticks and stones may break my bones, but words . . .\n\n \n . . . repeated often enough and consistently enough can drive me to suicide\"", 
   {}, 
   174798, 
   null, 
   1130440260.0
  ], 
  [
   174854, 
   null, 
   "BobNelson2", 
   "\n You do have a point though, as in the case of Fred Phelps who who's website certainly expresses his opinion, and it's definitely indicative of hate. Nevertheless I wouldn't say anyone is truly oppressed by reading it.\n\n \n Oh, I don't know. The Phelps klan is large enough that, statistically, somewhere in there is some poor gay grandkid whose mental health is being demolished on a daily basis.", 
   {}, 
   174818, 
   null, 
   1130440380.0
  ], 
  [
   174857, 
   null, 
   "joebrummer", 
   "Oh, I don't know. The Phelps klan is large enough that, statistically, somewhere in there is some poor gay grandkid whose mental health is being demolished on a daily basis.\n\n \n \n What about the psychological impact of the \"concerned\" chrstian groups such as Concerned Women for America, Traditional Values Coalition, etc....\n \n Would you not agree that those messages are oppresive when repeated over time. Why would there be a ban on gay adoption? Isn't it oppression when you ban a group from doing something they should be able to do?\n \n At one point it was illegal to serve gays alcohol in NY? Why? What was said about gays and alcohol that lead to such a law? Is that not an example of words oppressing.\n \n Gays can't have decent relationships.....(oppresive)\n Gays are all diseased (oppresive and a lie)\n We can't let gays adopt (oppressive and a lie)\n \n I could write a dozen more but I am sure you have all heard them or said them", 
   {}, 
   174854, 
   null, 
   1130441040.0
  ], 
  [
   174859, 
   null, 
   "tonybrown74", 
   "What about the psychological impact of the \"concerned\" chrstian groups such as Concerned Women for America, Traditional Values Coalition, etc....\n \n Would you not agree that those messages are oppresive when repeated over time. Why would there be a ban on gay adoption? Isn't it oppression when you ban a group from doing something they should be able to do?\n \n At one point it was illegal to serve gays alcohol in NY? Why? What was said about gays and alcohol that lead to such a law? Is that not an example of words oppressing.\n \n Gays can't have decent relationships.....(oppresive)\n Gays are all diseased (oppresive and a lie)\n We can't let gays adopt (oppressive and a lie)\n \n I could write a dozen more but I am sure you have all heard them or said them\n\n \n Of course, these groups seem to have some political clout in the current adminstration and congress, as well as some state and local goverments, which then pass (or threaten to pass) legislation that would indeed be injurious to glbt people, and, at the very least, affects said individuals physically and psychologically.\n \n But, hey, what do I know?", 
   {}, 
   174857, 
   null, 
   1130441580.0
  ], 
  [
   174861, 
   null, 
   "jitobear", 
   "This seems fairly straight forward to me. You tolerate that which is different, not that which is harmful. No one has ever shown that being gay is harmful, just that it's different. And so it should be tolerated. Homophobia and gay-bashing does do harm, and so should not be tolerated. If you simply don't like gays than that's your opinion, and opinions in and of themselves do no harm. If you feel compelled by your opinion to try to deprive gays of their basic rights, then you're doing harm and should no longer be tolerated.\n\n \n I think Kronus said it quite welll. I agree.", 
   {}, 
   174746, 
   null, 
   1130441760.0
  ], 
  [
   174865, 
   null, 
   "jyoshu", 
   "You know, this idea that the issue of gay rights is 'off-limits' to critique simply because it could be construed as \"slander\", or because some gay people take it so personally, or because a limited group of extreme detractors within the broader body of people opposed to gay marriage make personal attacks from time to time is sorta silly.\n \n One would think that if gay pride folks were so concerned with being slandered or with hate being spread in forums like this, they would actually try to lobby the creators of these fora to take down such places where the supposed hate is supposedly spread. It's pretty obvious that any form of debate on this by detractors is going to be misrepresented as hate speech simply on the basis that it's a disagreement. But it seems that those who feel so slandered by this would rather focus their efforts on complaining about it IN the very forum that serves as a vehicle FOR that \"slander\" rather than trying to do anything substantive to take such hate-speech away. Why bitch about a form of free speech on one hand when on the other you seem uninclined to really try to change things? It seems that in general, people know that gay rights is indeed a legitimate debateable topic and that debating it doesn't constitute \"hate\" or \"oppression.\" If they didn't, we wouldn't have places like this to debate it. The only reason that debate would be a personal attack is if gay people take it that way. I think anyone doing an honest assessment of the threads here will see that it's quite rare for anyone to come in and and make personal direct statements like \"you are going to hell 'cause you're gay\" or \"you are immoral\" or \"you are like pedophiles.\" That doesn't happen much. When they do come up, it's usually over the behavioral aspect or the sake of limited analogy. \n \n Another point . . .\n \n There's no way to substantively argue things like \"psychological damage\" by CWA or other groups--this is something that, if the damage exists, it's not measureable. At this point we're in the realm of speculation. One can give opinions all day about whether or not statements can \"lead\" to oppression, but these are all non-concrete issues. They are ultimately unprovable because it involves matters of perception and assumptions without solid evidence. It's ultimately going to be your unproven opinion to say that groups like CWA are causing harm by their statements.", 
   {}, 
   174861, 
   null, 
   1130443860.0
  ], 
  [
   174867, 
   null, 
   "Kronus", 
   "You know, this idea that the issue of gay rights is 'off-limits' to critique simply because it could be construed as \"slander\", or because some gay people take it so personally, or because a limited group of extreme detractors within the broader body of people opposed to gay marriage make personal attacks from time to time is sorta silly.\n\n \n \"construed as \"slander\"\": Not construed. Is slander. Slander, lies, deliberate attempt to misinform, call it what you will.\n \n \"because some gay people take it so personally\": If you lost your job, your home, or your life, you'ld take it personally too.\n \n \"or because a limited group\": This is one of those \"lies\" I mentioned. Homophobia is widespread, the damage being done is real and extensive, this has been demonstrated repeatedly.\n \n Now can you explain why you are so pro-free-speach for people who don't like gays, but so anti-free-speech for people who don't like people who don't like gays? Pick a side and stick with it. Either no one gets to say anything bad, or everyone does. If people get to say how horrible gays are, then gays get to say how horrible they are for saying it. Don't like it? Don't like being offended? Then take all the advice you just gave gays and apply it to yourself.", 
   {}, 
   174865, 
   null, 
   1130444820.0
  ], 
  [
   174871, 
   null, 
   "jyoshu", 
   "\"construed as \"slander\"\": Not construed. Is slander. Slander, lies, deliberate attempt to misinform, call it what you will.\n\n \n It's only slander if you're slandered. If I were native American, and someone said \"native Americans have a weakness with alcohol\", that's not slander. If they say \"John Doe has a weakness for alcohol,\" then that could be slander. When someone says gay males have the highest rates of HIV infection, it's the truth. I can show you the official stats on it. It's not slander. If someone compares gay marriage to people marrying underage kids, it's called analogy. It's not slander. If someone said \"Kronos is likely to marry an underage kid,\" then that could be slander. But as you know that's not what's said. Just be honest, rather than always trying to protray your opponents as doing something they aren't really doing, or blowing it out of proportion. Is that really too much to ask?\n \n \n\"because some gay people take it so personally\": If you lost your job, your home, or your life, you'ld take it personally too.\n\n \n We're not talking about such cases, we're talking about debating this issue. and whether or not that's hate. Of course losing your job for being gay is bad--I'm the first to agree with you on that. But that's a different issue than debating the morality of homosexuality. I can be morally against homosexuality and still hire gays all day long if they do a good job. I'm not going to hire based on that moral issue. The same principle applies to discrimination in the other matters you mention too.\n \n \n\"or because a limited group\": This is one of those \"lies\" I mentioned. Homophobia is widespread, the damage being done is real and extensive, this has been demonstrated repeatedly.\n\n \n But only a limited group make personal attacks.\n \n \nNow can you explain why you are so pro-free-speach for people who don't like gays, but so anti-free-speech for people who don't like people who don't like gays? \n\n \n Nice try for an aversion. I'm in favor of you being able to say all the hateful things you want in the name of gay rights. So continue knocking yourself out. [shrug] Just don't expect not to be called on it and have it noted for what it is even when you misrepresent the other side's arguments as hate when it's not.", 
   {}, 
   174867, 
   null, 
   1130445420.0
  ], 
  [
   174872, 
   null, 
   "unkerpaulie", 
   "\"construed as \"slander\"\": Not construed. Is slander. Slander, lies, deliberate attempt to misinform, call it what you will.\n\n jyoshu said that critiquing gay right may be construed as slander. you respond by saying it is slander. are you listening to yourself? \n \n \n\"because some gay people take it so personally\": If you lost your job, your home, or your life, you'ld take it personally too.\n\n critquing gay rights has caused people to lose their jobs, homes and lives?\n \n \n\"or because a limited group\": This is one of those \"lies\" I mentioned. Homophobia is widespread, the damage being done is real and extensive, this has been demonstrated repeatedly.\n\n widespread damage done by critiquing gay rights?\n \n \nNow can you explain why you are so pro-free-speach for people who don't like gays, but so anti-free-speech for people who don't like people who don't like gays? Pick a side and stick with it. Either no one gets to say anything bad, or everyone does. If people get to say how horrible gays are, then gays get to say how horrible they are for saying it. Don't like it? Don't like being offended? Then take all the advice you just gave gays and apply it to yourself.\n\n do you have a problem with people who dont like gays having freedom of speech?\n \n this is a very different kronus from the one that used to post here. not a single coherent point...", 
   {}, 
   174867, 
   null, 
   1130445660.0
  ], 
  [
   174874, 
   null, 
   "jyoshu", 
   "critquing gay rights has caused people to lose their jobs, homes and lives?\n\n \n That's the thing. If one of them, just one of them, could prove this cause-and-effect relationship where reading the debating of this issue caused someone to lose their house or their job, or whatever, they'd have some ground to stand on. As it is, there's no line to draw. No dots to connect. Not one of them has ever proven this.", 
   {}, 
   174872, 
   null, 
   1130445840.0
  ], 
  [
   174876, 
   null, 
   "Kronus", 
   "\n But only a limited group make personal attacks.\n \n\n Wrong. Dead wrong, and this has been shown to you time and time again. That's why I called it a \"lie\". That's when you say something you know isn't true.\n \n \n\n Nice try for an aversion. I'm in favor of you being able to say all the hateful things you want in the name of gay rights. So continue knocking yourself out. [shrug] Just don't expect not to be called on it and have it noted for what it is.\n\n \n You must have a fascinating defintion of hate, if the things I say qualify but the attacks leveled against gays doesn't. I'm trying to stop the persecution of an oppressed group, and I'll gladly have that noted. You only seem to be interested in opposing any such help. This also has been noted.", 
   {}, 
   174871, 
   null, 
   1130446080.0
  ], 
  [
   174878, 
   null, 
   "unkerpaulie", 
   "we are talking about critiquing gay rights here. were are not talking about stereotyping gay people or gay activities. when any law is being considered for passing, there is always a process of deliberation and voting. some people involved may vote for the bill to be passed, some may vote against. gay rights being passed or rejected has absolutely nothing to do with people being slandered, losing property, getting killed, or any of the charges kronus mentioned\n \n even in a non-judicial setting, where gay rights are being informally discussed, such as on this forum, there are people on both sides of the debate. there are people that oppose gay rights, and there are those that critique the idea of gay rights. there is absolutely no way that such critiques or opposition can be construed as slander, hate, or the cause of attrocities towards gays or any group of people\n \n come on", 
   {}, 
   174874, 
   null, 
   1130446260.0
  ], 
  [
   174879, 
   null, 
   "jyoshu", 
   "Wrong. Dead wrong, and this has been shown to you time and time again. That's why I called it a \"lie\". That's when you say something you know isn't true.\n\n \n You've shown nothing. Again, most people who believe that gay relationships are immoral do NOT make personal attacks. Do you not see that you are engaging in pure generalization? It's completely irrational on your part.", 
   {}, 
   174876, 
   null, 
   1130446320.0
  ], 
  [
   174880, 
   null, 
   "unkerpaulie", 
   "Wrong. Dead wrong, and this has been shown to you time and time again. That's why I called it a \"lie\". That's when you say something you know isn't true.\n\n i assume you can demonstrate that everyone that opposes or critiques gay rights are personally attacking an individual or group? please, be my guest", 
   {}, 
   174876, 
   null, 
   1130446380.0
  ], 
  [
   174881, 
   null, 
   "jyoshu", 
   "we are talking about critiquing gay rights here. were are not talking about stereotyping gay people or gay activities. when any law is being considered for passing, there is always a process of deliberation and voting. some people involved may vote for the bill to be passed, some may vote against. gay rights being passed or rejected has absolutely nothing to do with people being slandered, losing property, getting killed, or any of the charges kronus mentioned\n\n \n Well said. I don't see why Kronos doesn't get this, unless he just doesn't want to. The issues of losing property, violence, etc. is a separate matter from whether or not the debate about homosexual issues should take place.", 
   {}, 
   174878, 
   null, 
   1130446440.0
  ], 
  [
   174882, 
   null, 
   "Kronus", 
   "jyoshu said that critiquing gay right may be construed as slander. you respond by saying it is slander. are you listening to yourself? \n \n\n \n Jyoshu was trying to minimize the attacks leveled against gays as \"critiques\". If he was actually discussing civil debate, then he would have been correct. But he wasn't. He was taking the larger field of gay rights, where slander is rampant, and trying to represent it solely as the sort of discourse that occurs on forums. That's ludicrious, and such a feeble debate technique that I didn't feel it was even worth pointing out, on the assumption that no one would fall for it. Guess I was wrong.", 
   {}, 
   174872, 
   null, 
   1130446440.0
  ], 
  [
   174883, 
   null, 
   "Matthew S", 
   " hate is not something you can measure. It's often not something for which there is quantifiable evidence. Yet you throw the word around like a rhetorical football anytime you get the opportunity.\n \n\n \n \n I have given you a very measurable scale\n \n NON Acceptance = hate; that is definable criteria which can be measured.\n \n So any statement that does not accept GLBT fully is equal to hate.\n \n \n Now there are different shades of hate but it is all hate as far as I am concerned.", 
   {}, 
   174788, 
   null, 
   1130446560.0
  ], 
  [
   174884, 
   null, 
   "jyoshu", 
   "Jyoshu was trying to minimize the attacks leveled against gays as \"critiques\".\n\n \n No, I'm talking about the debate, not the attacks. You're the one muddying the two when they are not the same thing.", 
   {}, 
   174882, 
   null, 
   1130446680.0
  ], 
  [
   174890, 
   null, 
   "unkerpaulie", 
   "there ya go, jyoshu\n \n NON Acceptance = hate; that is definable criteria which can be measured\n \n see how this works? any university that doesnt accept a candidate is hating. any employer that doesnt accept an applicant is hating. any country that doesnt accept an immigrant is hating\n \n and obviously, these slandering universities, employers, countries, etc, are responsible for loss of jobs, homes and lives.\n \n so much hate, so much widespread damage... what to do?", 
   {}, 
   174883, 
   null, 
   1130447700.0
  ], 
  [
   174892, 
   null, 
   "Kronus", 
   "No, I'm talking about the debate, not the attacks. You're the one muddying the two when they are not the same thing.\n\n \n Should I take you at your word here? Were you honestly only talking about debate, and not trying to group all anti-gay speech together as critiques? That's the impression I got from your post #42, and that's what my responses were addressing.", 
   {}, 
   174884, 
   null, 
   1130447760.0
  ], 
  [
   174901, 
   null, 
   "joebrummer", 
   "You guys have gone so far off the topic and the reason for that after re-reading the thread is that jysohu has changed and muddied the topic a dozen times and accused others of the same.\n \n I asked in the beginning where the line in drawn between opposition and oppression.\n \n To make the topic clear I will present an example.\n \n You can tell me if this is opposition or oppression and hate....\n \n http://www.familyresearchinst.org/FRI_EduPamphlet4.html\n \n Is this article just opposition or is it oppression and hate?\n \n \n how about this?\n \n http://www.sbministries.org/hope2.html", 
   {}, 
   174892, 
   null, 
   1130449740.0
  ], 
  [
   174905, 
   null, 
   "jyoshu", 
   "Should I take you at your word here? Were you honestly only talking about debate\n\n \n Frankly, it makes no difference whether or not you \"take me at my word.\" Obviously that's what I've been talking about. This whole thread has been, for some time, whether or not debate and talking about this issue is in and of itself an example of hate. That's why Matt tried to tie the KKK to people who debate--damaga by association. \n \n \nI asked in the beginning where the line in drawn between opposition and oppression.\n\n \n And we've responded to you already. When you draw the line between opposition and oppression so close to opposition as you do that you don't even note the difference, then you are able to try and portray disagreement itself as hate. Which is, of course, your goal. :)", 
   {}, 
   174892, 
   null, 
   1130451060.0
  ], 
  [
   174907, 
   null, 
   "Kronus", 
   "\n I asked in the beginning where the line in drawn between opposition and oppression.\n \n\n I'd say the line is between saying \"I don't like it because...\" and saying \"You shouldn't like it because...\", between saying \"My views make me act in such and such a way...\" and \"My views should make you act in such and such a way...\"\n \n \n \n\n You can tell me if this is opposition or oppression and hate....\n \n http://www.familyresearchinst.org/FRI_EduPamphlet4.html\n \n Is this article just opposition or is it oppression and hate?\n \n\n Clearly hate. Trying to equate being gay with being a cannibal or mass murderer is ludicrous slander, the sole purpose of which is to demonize gays.\n \n \n\n how about this?\n \n http://www.sbministries.org/hope2.html\n\n The people who wrote this probably don't think they hate, and I'll conceed that it's possible that they don't. They do, however, oppress. They are trying, in gentle emotive terms, to turn people against their gay family members. I'd be afraid to find out how many families these people have destroyed because they think everyone should believe what they believe.", 
   {}, 
   174901, 
   null, 
   1130451840.0
  ], 
  [
   174912, 
   null, 
   "jyoshu", 
   "The people who wrote this probably don't think they hate, and I'll conceed that it's possible that they don't.\n\n \n This brings up an interesting point and question.\n \n If one's intention is not to hate, then is it really hate that's going on when he says something that's interpreted as hate?\n \n I'd say that hate has to have intent behind it. Or it's not hate.", 
   {}, 
   174907, 
   null, 
   1130453280.0
  ], 
  [
   174914, 
   null, 
   "Matthew S", 
   "You guys have gone so far off the topic and the reason for that after re-reading the thread is that jysohu has changed and muddied the topic a dozen times and accused others of the same.\n \n I asked in the beginning where the line in drawn between opposition and oppression.\n \n To make the topic clear I will present an example.\n \n You can tell me if this is opposition or oppression and hate....\n \n http://www.familyresearchinst.org/FRI_EduPamphlet4.html\n \n Is this article just opposition or is it oppression and hate?\n \n \n how about this?\n \n http://www.sbministries.org/hope2.html\n\n \n You know my views on this issue. :xcensored \n \n I would say that the first is a statement of fact, which I don't dispute. The implication is that it is all gay men are like this and just waiting to pounce on the unspecting hetero. The first is a statement of fact wrapped in hate.\n \n The second is hate pure and simple if someone tries and teach others not to accept glbt people they are guilty of hate.", 
   {}, 
   174901, 
   null, 
   1130453880.0
  ], 
  [
   174915, 
   null, 
   "Matthew S", 
   "This brings up an interesting point and question.\n \n If one's intention is not to hate, then is it really hate that's going on when he says something that's interpreted as hate?\n \n I'd say that hate has to have intent behind it. Or it's not hate.\n\n \n I am saying that if you do not look upon and accept a gay person the same as you do a hetero person you are guilty of hate.\n \n The intention is clear non acceptance hence the hate. You would understand this if you viewed the world as a GLBT person.", 
   {}, 
   174912, 
   null, 
   1130454120.0
  ], 
  [
   174917, 
   null, 
   "Bassman", 
   "Matthew, you're way off base. How the heck do you equate hate with disapproval of behavior?", 
   {}, 
   174915, 
   null, 
   1130454360.0
  ], 
  [
   174918, 
   null, 
   "Matthew S", 
   "Matthew, you're way off base. How the heck do you equate hate with disapproval of behavior?\n\n \n \n Easy I have drawn a line in the sand. You would understand this if you were gay.\n \n Once again I post this.\n I am saying that if you do not look upon and accept a gay person the same as you do a hetero person you are guilty of hate.\n \n The intention is clear non acceptance hence the hate. You would understand this if you viewed the world as a GLBT person.", 
   {}, 
   174917, 
   null, 
   1130454720.0
  ], 
  [
   174920, 
   null, 
   "Bassman", 
   "There's no need to generalize. Matt, I've got a black mark on an otherwise spotless record. So, in a way, I do understand. But that does not mean that I can push for removing all penal laws and the rights of all felons, now. Does it?", 
   {}, 
   174918, 
   null, 
   1130455380.0
  ], 
  [
   174924, 
   null, 
   "joebrummer", 
   "Matthew, you're way off base. How the heck do you equate hate with disapproval of behavior?\n\n \n \n well, that is the debate, where is the line between hate and disapproval?\n \n Having a website with Paul Cameron Statistics and false science about gays picturing them as pedophiles and monsters? Hate or disapproval? That is the reason I started this thread. What is the line and when is it cross. Joyshu decided for himself to say that the debate is something else, but it isn't.\n \n WHere do you stand on this issue, Bassman?", 
   {}, 
   174917, 
   null, 
   1130457780.0
  ], 
  [
   174927, 
   null, 
   "Matthew S", 
   "There's no need to generalize. Matt, I've got a black mark on an otherwise spotless record. So, in a way, I do understand. But that does not mean that I can push for removing all penal laws and the rights of all felons, now. Does it?\n\n \n \n This has nothing to do with being gay or acceptance of gay people. You have no idea what it is like to be gay. Knowing that in the eyes of the law the person you love the most in the world will be nothing more then a stranger. Knowing that there are people out there who will never accept you and hate you for who you are. Don't compare your little brush with the law my lot in life.", 
   {}, 
   174920, 
   null, 
   1130457900.0
  ], 
  [
   174928, 
   null, 
   "Kronus", 
   "This brings up an interesting point and question.\n \n If one's intention is not to hate, then is it really hate that's going on when he says something that's interpreted as hate?\n \n I'd say that hate has to have intent behind it. Or it's not hate.\n\n \n Obviously hate has to originate with the generator of a message. However, I wouldn't say it requires conscious intent, with the emphasis on conscious. The human mind is complicated, and people's capacity for self-deceit is quite large. People often don't understand or acknowledge their own motives, so I see no reason to doubt that some people act out of hatred that they won't admit to themselves that they feel.", 
   {}, 
   174912, 
   null, 
   1130457960.0
  ], 
  [
   174930, 
   null, 
   "Matthew S", 
   "Obviously hate has to originate with the generator of a message. However, I wouldn't say it requires conscious intent, with the emphasis on conscious. The human mind is complicated, and people's capacity for self-deceit is quite large. People often don't understand or acknowledge their own motives, so I see no reason to doubt that some people act out of hatred that they won't admit to themselves that they feel.\n\n \n I would go one step further and say that sometimes the person viewing the statement precieves the message as one of hate.", 
   {}, 
   174928, 
   null, 
   1130458380.0
  ], 
  [
   174931, 
   null, 
   "Bassman", 
   "Well, since you asked, Where I stand is this: Each person is created in the image of God and therefore possesses an eternal soul. This makes each person unique and important to God. Do I endorse the violent attack of anyone, regardless of their lot in life? Absolutely not. And I will come to the defense of anyone who is attacked. But I do think that \"hate crimes\" laws are overkill. And it's not a matter of \"imposing my faith,\" it's just a matter of law. What about housing and employment? First, let me ask you. Does a private property owner have a right to rent to whomever he chooses? As far as dismissing people based on being homosexual is just plain wrong. Why should that matter on the job?", 
   {}, 
   174924, 
   null, 
   1130458500.0
  ], 
  [
   174937, 
   null, 
   "joebrummer", 
   "Well, since you asked, Where I stand is this: Each person is created in the image of God and therefore possesses an eternal soul. This makes each person unique and important to God. Do I endorse the violent attack of anyone, regardless of their lot in life? Absolutely not. And I will come to the defense of anyone who is attacked. But I do think that \"hate crimes\" laws are overkill. And it's not a matter of \"imposing my faith,\" it's just a matter of law. What about housing and employment? First, let me ask you. Does a private property owner have a right to rent to whomever he chooses? As far as dismissing people based on being homosexual is just plain wrong. Why should that matter on the job?\n\n \n \n Lovely speech, now where do you stand on the debate at hand? YOu could be a politician with your first try at this question?\n \n Where is the line? When is it crossed?", 
   {}, 
   174931, 
   null, 
   1130460480.0
  ], 
  [
   174950, 
   null, 
   "Bassman", 
   "\n \n The question to debate ???\n \n Where do you draw the line between opposing views? and just plain ole hate.\n\n I draw the line when it gets to personal attacks. Just because a person has a legitimate argument opposing homosexual rights, doesn't mean that he's attacking you, and that's what gets me. The double-standard. People in your camp preach tolerance only when it pertains to \"the cause.\" But when a person has a legitimate disagreement, like myself and other conservative thinkers, then we are accused of bigotry and hatred.", 
   {}, 
   174697, 
   null, 
   1130462520.0
  ], 
  [
   174953, 
   null, 
   "joebrummer", 
   "I draw the line when it gets to personal attacks. Just because a person has a legitimate argument opposing homosexual rights, doesn't mean that he's attacking you, and that's what gets me. The double-standard. People in your camp preach tolerance only when it pertains to \"the cause.\" But when a person has a legitimate disagreement, like myself and other conservative thinkers, then we are accused of bigotry and hatred.\n\n \n \n Please fefine for me, what is a legitimate argument, there are not many. But please gives us your definition.\n \n You can leave out the bible, because I will give you that one as a legit argument in this thread, otherwise I would debate that too, but in this argument for others to use that is legit. \n \n \n But also tell us what isn't legit. And keep it more general. In other words. Not this board. This debate goes further than this board. Very few argument against gays are personal. Most are in general statements. When are those legit and when are they not. Take the links I provided for exmaples? are those legit arguments or just hate speech.", 
   {}, 
   174950, 
   null, 
   1130463360.0
  ], 
  [
   174967, 
   null, 
   "Bassman", 
   "OK, One of the legitimate arguments is the physiological aspect of sexuality. In other words, how we're assembled. Another is the societal impact of laws granting same-sex marriage, and other pro-homosexual legislation. Those being the two biggest points of contention.", 
   {}, 
   174953, 
   null, 
   1130465400.0
  ], 
  [
   174989, 
   null, 
   "emoreno2292", 
   "I am saying that if you do not look upon and accept a gay person the same as you do a hetero person you are guilty of hate.\n \n The intention is clear non acceptance hence the hate. You would understand this if you viewed the world as a GLBT person.\n\n I'm sorry, Matthew, I am tired of this.\n I'm gay, and even yet I know that it's not hate when people don't support me. I mean, you're really blowing this out of proportion-- I am tired of reading this if you're not with us you're against us bs. You are off-putting to jyoshu, who is supportive of gay civil unions, and yet call him hateful? No, I'm sorry, that's just him making a stance. Their disapproval isn't hate; you're making it more than it is, I'm afraid. Please, tone it down and people might take you seriously.", 
   {}, 
   174915, 
   null, 
   1130470620.0
  ], 
  [
   174994, 
   null, 
   "JakeCJB", 
   "OK, One of the legitimate arguments is the physiological aspect of sexuality. In other words, how we're assembled.\n\n \n Most of us do a wide variety of things, sexually, involving our bodies and sex organs, and gay sex is one of those things. This is different from questions of ethics, or religion. \n \n \nAnother is the societal impact of laws granting same-sex marriage, and other pro-homosexual legislation. Those being the two biggest points of contention.\n\n \n What do you believe the impact would be, and why do you oppose? I see a positive impact with same-sex couples being granted all the rights and support and security that heterosexual couples take for granted.", 
   {}, 
   174967, 
   null, 
   1130471520.0
  ], 
  [
   174999, 
   null, 
   "joebrummer", 
   "I find it rather interesting that neither bassman or jyshu will comment on the two websites I posted and answer to whether they are opposition ao hate.\n \n \n Why is that?\n \n Have you been backed into a wall?", 
   {}, 
   174994, 
   null, 
   1130472960.0
  ], 
  [
   175000, 
   null, 
   "joebrummer", 
   "how about this?\n \n \n hate ot does she just object and oppose homosexuality?\n \n http://www.365gay.com/newscon05/10/102705massAG.htm", 
   {}, 
   174999, 
   null, 
   1130473140.0
  ], 
  [
   175002, 
   null, 
   "JakeCJB", 
   "I'm sorry, Matthew, I am tired of this.\n I'm gay, and even yet I know that it's not hate when people don't support me. I mean, you're really blowing this out of proportion-- I am tired of reading this if you're not with us you're against us bs. You are off-putting to jyoshu, who is supportive of gay civil unions, and yet call him hateful? No, I'm sorry, that's just him making a stance. Their disapproval isn't hate; you're making it more than it is, I'm afraid. Please, tone it down and people might take you seriously.\n\n \n Yes, it's hate. We don't have to debate much to see what their disapproval is based on, and that is hate, ignorance and fear and diversions. Surely you can see that based on the debates here coming from the anti-gay rights side. Do they, including jyoshu, bring up the issue of AIDS for example, to show unconditional support and compassion to gay sufferers of that disease? Of course they would never dream of that. They demonize the gay sufferers for bringing it on U.S. society and on themselves. What does that have to do with rights, anyway? \n \n There are many more examples where gay people are said to be \"anti-society\", a threat to civilization, and they attempt to scare and promote ignorance by falsely associating gay rights, with polygamy and incest or anything else they can think of that will scare many people more than gay rights. The impression is left in some people's mind that gay rights are associated with these things, with the total destruction of all society as we know it. Who wouldn't be suspicious of such a group, if they believed that was the group's goal, and they had that power? One may even be resentful or hateful to such a group.\n \n To say the way gay people express their love is less than or is immoral than the way straight people do, without a good reason, is wrong, because it is based on ignorance, or fear or hate, blindly following tradition, or any combination of those things.", 
   {}, 
   174989, 
   null, 
   1130473560.0
  ], 
  [
   175004, 
   null, 
   "joebrummer", 
   "I wish there was really a way to open their eyes to what you have said. I wish very much that would happen, but after a year or more of this board. I have yet to ever see that happen. Even jyoshu, who I have long considered a hypocrite, hasn't budged an inch in his view of this issue. \n \n No matter what you say, or how you point it out, no matter how much evidence you give them. They refuse to see their words are oppression.\n \n I myself, give up.....here at least.\n \n I do alot of fighting in my community for civil rights. Right now I am working hard to get a concert by Buju Banton Cancelled. I am also working on cancelling a concert from good Ole Beenie man. Two artists whose music call for the killing and execution of gays and lesbians. Songs that talk about hanging lesbians from a big rope, or shooting gays with a boozaka. \n \n Really, I am starting to see that if change will ever come. You have to point this stuff out in a bigger arena than this board. I will have the shows cancelled! They should be, those types of words add to the oppression of gays. BAssman and Jyoshu can't see because they don't want to!", 
   {}, 
   175002, 
   null, 
   1130474280.0
  ], 
  [
   175005, 
   null, 
   "doG", 
   "Really, I am starting to see that if change will ever come. You have to point this stuff out in a bigger arena than this board. I will have the shows cancelled! They should be, those types of words add to the oppression of gays.\n\n \n I think the most important point your community should work on is convincing people that your feelings are not by choice, that your physical attractions are just the way you were born. I encounter many that insist that gays are that way because they chose to be like they are. I think that is the single biggest obstacle you need to overcome to convince the intolerant to consider your point of view.", 
   {}, 
   175004, 
   null, 
   1130475300.0
  ], 
  [
   175006, 
   null, 
   "joebrummer", 
   "I think that is the single biggest obstacle you need to overcome to convince the intolerant to consider your point of view.\n\n \n \n Ihave been here a year doing just that and I see nothing.....bigots will always be bigots, the best we can hope for is that the youth of this country learn less prejudice than their fore fathers.....same with Racism, anti-semitism, and those that think women should be barefoot in the kitchen.....", 
   {}, 
   175005, 
   null, 
   1130475780.0
  ], 
  [
   175010, 
   null, 
   "doG", 
   "Ihave been here a year doing just that and I see nothing.....bigots will always be bigots, \n\n Not always, I was one of them until a lesbian I met forced me to actually examine my own feelings. I realized that I had never actually chosen to like women, it just happened. She said the same thing happened to her, all of the sudden she didn't see girls the same way any more. They caused her to have the same attractive desires men have. Being attracted to girls myself I could understand how she felt. It was easy for her to convince me to believe that some men were born with the similar circumstance, an attraction to men that they couldn't explain. As repulsive as the thought seemed to me I could still understand how it could happen. I've been tolerant ever since. I do believe there are some that do make a choice, but I feel they are not the majority. I could never choose to like men and I don't think other men with the same natural tendecies I have could either. That just serves to convince me even more though that gay men and women are born that way.", 
   {}, 
   175006, 
   null, 
   1130476680.0
  ], 
  [
   175011, 
   null, 
   "jyoshu", 
   "so I see no reason to doubt that some people act out of hatred that they won't admit to themselves that they feel.\n\n \n Yeah but that's still intentional.\n \n If a person acts with no intent of hate, it's not hate.\n \n \nTo say the way gay people express their love is less than or is immoral than the way straight people do, without a good reason, is wrong, because it is based on ignorance, or fear or hate, blindly following tradition, or any combination of those things.\n\n \n Well, your phrase \"without a good reason is the key, now isn't it? Because you don't get to determine what those good reasons are. That varies from person to person. Look, if you want to take such an all-or nothing approach and call everyone who isn't on your close-minded page hateful, it's your prerogative. But understand that you are basically condemning most of the world's population as being haters. Condemning people who support your rights to a large extent but stop short of giving you the kitchen sink cause we think it crosses the like is like accusing the French of hating americans in the Revolutionary War because they didn't send 100% of their military forces to help. Personally, I think you and Matt are taking this stance simply because it's the easy, cheap way out. You think you don't have to deal with the debate if you define everyone in the worst possible terms early on. It's the height of arrogance on your part to refuse, at all costs, to give credit where credit is due and call your partial allies your worst enemies. Unlucky for you though, most of the public just aren't that stupid. I don't think you realize that if the gay rights movement were controlled by people like Matt, Joe, and yourself, who refer to any help and support as hate if it's not on your terms, you'd still be back in the pre-stonewall era of gay rights.", 
   {}, 
   174928, 
   null, 
   1130477520.0
  ], 
  [
   175012, 
   null, 
   "jyoshu", 
   "I wish there was really a way to open their eyes to what you have said. I wish very much that would happen, but after a year or more of this board. I have yet to ever see that happen. Even jyoshu, who I have long considered a hypocrite, hasn't budged an inch in his view of this issue.\n\n \n What issue? The one that of which I support you having couple's benefits? Or is it the one where I am fully against discrimination toward you in the workplace, adoption issues, home ownership, etc.? Or is it the one where I've stood up for you and said gays can make as good of parents as anyone?\n \n No, I never budged an inch, huh? emoticon_rolleyes \n \n Screw you. You don't give a d*** about whether anyone supports you. You only want opportunities to use this pet issue of yours to say hateful and mean-spirited things about people. That's it. As far as I'm concerned you're a fraud, pure and simple, with no credibility any more. And no, most gay people aren't like you, Joe, thank god. I know enough not to generalize and assume all gay people are bad because of what I see in you.\n \n \nTwo artists whose music call for the killing and execution of gays and lesbians. Songs that talk about hanging lesbians from a big rope, or shooting gays with a boozaka. \n \n BAssman and Jyoshu can't see because they don't want to!\n\n \n Um, yeah!!! Of course those things are hateful. You're comparing apples and oranges by comparing our words with that stuff. But then that's all you ever do.", 
   {}, 
   175004, 
   null, 
   1130478180.0
  ], 
  [
   175020, 
   null, 
   "JakeCJB", 
   "Well, your phrase \"without a good reason is the key, now isn't it? Because you don't get to determine what those good reasons are. That varies from person to person.\n\n \n Sure it varies. I have yet to hear any argument from the anti-gay side that isn't a logical fallacy. I'm glad people have the ability to change and to reason. This is what will doom the arguments of the anti-gay side. \n \n \nLook, if you want to take such an all-or nothing approach and call everyone who isn't on your close-minded page hateful, it's your prerogative. But understand that you are basically condemning most of the world's population as being haters.\n\n \n That is recycled logical fallacy number 5, the majority can never be wrong.\n \n \nCondemning people who support your rights to a large extent but stop short of giving you the kitchen sink cause we think it crosses the like is like accusing the French of hating americans in the Revolutionary War because they didn't send 100% of their military forces to help.\n\n \n We just want to share in what you have. We're not asking you to die for us. \n \n \nPersonally, I think you and Matt are taking this stance simply because it's the easy, cheap way out. You think you don't have to deal with the debate if you define everyone in the worst possible terms early on.\n\n \n You've done that yourself.\n \n \nIt's the height of arrogance on your part to refuse, at all costs, to give credit where credit is due and call your partial allies your worst enemies.\n\n \n I wouldn't say you are the worst. I don't owe you anything for a half-XXX effort that still excludes and segregates gay people without any rational reason, but basically to say the sky will fall and all hell will break loose, the institution will be destroyed, if we do not keep gay people out. These arguments are peppered with ridiculuos negative generalizations, meant to cause fear and to show gay people in the worst possible light, to try to leave the impression that lowly gay people, well, just don't deserve what you have. You believe gay people owe you some kind of credit for scraps from the big table. This way gays are kept in their oppressed place as less than and grateful to you. \n \n \nUnlucky for you though, most of the public just aren't that stupid.\n\n \n Americans are smart, that's what I'm counting on.", 
   {}, 
   175011, 
   null, 
   1130485260.0
  ], 
  [
   175045, 
   null, 
   "Matthew S", 
   "I'm sorry, Matthew, I am tired of this.\n I'm gay, and even yet I know that it's not hate when people don't support me. I mean, you're really blowing this out of proportion-- I am tired of reading this if you're not with us you're against us bs. You are off-putting to jyoshu, who is supportive of gay civil unions, and yet call him hateful? No, I'm sorry, that's just him making a stance. Their disapproval isn't hate; you're making it more than it is, I'm afraid. Please, tone it down and people might take you seriously.\n\n \n \n Did you read all my posts? I have drawn a line in the sand I will accept nothing less then the total acceptance that heteros get everyday for just breathing. If you fully accept me you love me if you don't fully accept me you hate me.", 
   {}, 
   174989, 
   null, 
   1130509020.0
  ], 
  [
   175046, 
   null, 
   "Kronus", 
   "I would go one step further and say that sometimes the person viewing the statement precieves the message as one of hate.\n\n \n Yeah, but they would be wrong to do so. Calling a tail a leg doesn't make it one. If you perceive something that isn't there then no blame can fall on the originator of the message.", 
   {}, 
   174930, 
   null, 
   1130509380.0
  ], 
  [
   175047, 
   null, 
   "Kronus", 
   "Yeah but that's still intentional.\n \n If a person acts with no intent of hate, it's not hate.\n \n \n\n \n Nope. Your subconscious affects your actions without your always being aware of it, and certainly without asking your consicious permission. If you hate something, than it doesn't matter how many times you chant to yourself \"I won't let hate influence me\", your hate will still be there, and it can still have an influence; and unless you're very self aware you could easily not notice.", 
   {}, 
   175011, 
   null, 
   1130509860.0
  ], 
  [
   175048, 
   null, 
   "Matthew S", 
   "If a person acts with no intent of hate, it's not hate.\n\n \n Not to the viewer of the hatefilled message or stance.\n \n \n \n \n\n Personally, I think you and Matt are taking this stance simply because it's the easy, cheap way out. You think you don't have to deal with the debate if you define everyone in the worst possible terms early on. It's the height of arrogance on your part to refuse, at all costs, to give credit where credit is due and call your partial allies your worst enemies. \n\n \n Thankyou for letting us use the same bathrooms and water fountains as you. But if we want to sit at the same lunch counter as you that would distroy the institution of segragation.\n \n \n \n\n Unlucky for you though, most of the public just aren't that stupid. I don't think you realize that if the gay rights movement were controlled by people like Matt, Joe, and yourself, who refer to any help and support as hate if it's not on your terms, you'd still be back in the pre-stonewall era of gay rights.\n\n \n What do you know about stonewall? I guess we in the GLBT should use stonewall as an example. Roiting in several major cities I think that might just be what has to happen to make the people realize they can't mess with us.", 
   {}, 
   175046, 
   null, 
   1130510460.0
  ], 
  [
   175049, 
   null, 
   "unkerpaulie", 
   "I would go one step further and say that sometimes the person viewing the statement precieves the message as one of hate.\n\n this is so very wrong. if i make a statement, i have no control over how you percieve it. your perception of my statement changes nothing about the intentions of my statement. you have absolutely no power whatsoever to judge my statements as hateful if my intentions were not hateful", 
   {}, 
   174930, 
   null, 
   1130511060.0
  ], 
  [
   175050, 
   null, 
   "unkerpaulie", 
   "I think the most important point your community should work on is convincing people that your feelings are not by choice, that your physical attractions are just the way you were born. I encounter many that insist that gays are that way because they chose to be like they are. I think that is the single biggest obstacle you need to overcome to convince the intolerant to consider your point of view.\n\n why would this be important? why would this even be relevant? feelings are one's choice. a feeling is a response to a situation.\n \n in order for gay rights to be advanced, gays must target the law-making council of the state. the community is already at a point where the gay lifestyle is generally tolerated, and recognized as something that doesnt really harm anybody or infringe on anybody's rights. this is all that is necessary as far as the community is concerned. convincing people that feelings are not one's choice consists of spreading lies, and we've already covered that.", 
   {}, 
   175005, 
   null, 
   1130511360.0
  ], 
  [
   175051, 
   null, 
   "Phunting", 
   "Not to the viewer of the hate filled message or stance.\nIf there is no hate, then it is not hate. Despite what the recipient thinks of it.", 
   {}, 
   175048, 
   null, 
   1130511360.0
  ], 
  [
   175053, 
   null, 
   "unkerpaulie", 
   "Did you read all my posts? I have drawn a line in the sand I will accept nothing less then the total acceptance that heteros get everyday for just breathing. If you fully accept me you love me if you don't fully accept me you hate me.\n\n matthew, i have already shown that your criteria for detecting hate is totally bogus. non-acceptance does not equal hate. never has, never will", 
   {}, 
   175045, 
   null, 
   1130511480.0
  ], 
  [
   175059, 
   null, 
   "Phunting", 
   "Religion and political affiliation are inherently debatable belief systems. One's inherent sexual orientation is not, any more than is one's race.\nIn your opinion. I would say that due to the fact it is often debated, that would make it debatable.\n \n \n \nThere you're talking about who someone is, about his personal makeup. If you tell people that I'm more likely to have HIV/AIDS, or that I'm promiscuous, or a bad father, all by dint of my homosexuality) then you have publically slandered me, no less than if I was African-American and you posted that all blacks are genetically inferior and lay around eating watermelon all day. There's a difference between disagreement and slander.\nI'm not sure I (hypothetically of course) would have. To say you are more likely to do a certain thing is not slander, only an accusation that you do it is.", 
   {}, 
   174846, 
   null, 
   1130512380.0
  ], 
  [
   175065, 
   null, 
   "jyoshu", 
   "Nope. Your subconscious affects your actions without your always being aware of it, and certainly without asking your consicious permission. \n\n \n I didn't say that didn't happen. But if one is not aware of it, then he does not intend hate. It's only hate if there is intention behind it.", 
   {}, 
   175047, 
   null, 
   1130513040.0
  ], 
  [
   175070, 
   null, 
   "unkerpaulie", 
   "In your opinion. I would say that due to the fact it is often debated, that would make it debatable.\n\n phunting, by many people's standards in this thread, considering that sexual orientation is inherent as debatable would mean that youre a gay hater. you must accept anything that gays say as true, otherwise youre homophobic. this is where political correctness is shifting towards", 
   {}, 
   175059, 
   null, 
   1130514180.0
  ], 
  [
   175073, 
   null, 
   "Kronus", 
   "I didn't say that didn't happen. But if one is not aware of it, then he does not intend hate. It's only hate if there is intention behind it.\n\n \n What an absurd argument. Obviously you must be aware of hatred to intend hatred, but that by no means implies that actions can't have hate behind them subconsiously. If I hate someone, and subconsiously stick my foot out and trip them, completely unaware of my actions, you're telling me there was no hate behind it? If I hate Pat Robertson, and subconsiously assume that everything he says is probably a lie, without being aware of it or deciding to do so, then you're saying that my perceptions aren't tinged by hate?\n \n Look, it's obvious what you're trying to do here. You want to elevate the motivations of people who are against gays, and have no legitimate way of doing so. Thus, you're trying to warp the definitions of hate and intent such that, unless someone is actually screaming \"I hate gays\", you can't accuse them of hatred. Sorry, but it doesn't work. There are people out there who hate gays, and they act on that hatred, either consciously or subconsciously. Deal with it.", 
   {}, 
   175065, 
   null, 
   1130515860.0
  ], 
  [
   175087, 
   null, 
   "jyoshu", 
   "If I hate Pat Robertson, and subconsiously assume that everything he says is probably a lie, without being aware of it or deciding to do so, then you're saying that my perceptions aren't tinged by hate?\n\n \n Ok, I'll give you that one can subconsiously hate. But I would also say that intent could be subconsious too, and so my point that intent is necessary for hate still stands.\n \n \nLook, it's obvious what you're trying to do here. You want to elevate the motivations of people who are against gays, and have no legitimate way of doing so. Thus, you're trying to warp the definitions of hate and intent such that, unless someone is actually screaming \"I hate gays\", you can't accuse them of hatred. Sorry, but it doesn't work. There are people out there who hate gays, and they act on that hatred, either consciously or subconsciously. Deal with it.\n\n \n Of course there are people out there who hate gays. The difference between you and I (and Matt and I) is that you seem to think anyone who has any opinion on this issue other than yours hates gays. That it's the only possible motivation. I say people are much more varied than that, and there are certainly people out there who disagree with gay rights but who don't hate gays. You're the one who's coming across as having no room in your thinking for that. I don't have elevate anyone's motivations--people are motivated in many different ways. I can think of several right off the bat. These are my observations, anyway:\n Some are motivated to oppose gay marriage strictly on religion--no hate involved.Others are motivated due to their fears.Others are motivated because they rationally and genuinely feel it is best for society to not have gay marriage (in other words they've simply weighed the issues.)Yet others (the ones you're entirely focused on and generalize toward all others) oppose gay marriage out of hatred toward gays.\n There can also sometimes be combinations involved--someone may, for example have both religion AND hate as a motivation. But certainly not always.", 
   {}, 
   175073, 
   null, 
   1130521440.0
  ], 
  [
   175089, 
   null, 
   "jyoshu", 
   "phunting, by many people's standards in this thread, considering that sexual orientation is inherent as debatable would mean that youre a gay hater. you must accept anything that gays say as true, otherwise youre homophobic. \n\n \n Amen to that! Glad I'm not the only one who's noticed.", 
   {}, 
   175070, 
   null, 
   1130521680.0
  ], 
  [
   175112, 
   null, 
   "Steeeeve", 
   "I have recently been accused of being intolerant of opposing views to homosexuality. The reality is these views are not opposing they are oppresing. They are based on lies, misinformation, and bad studies that claim to be science. The majority of anti-gay propaganda out there comes from right wing christian groups. \n \n The question to debate ???\n \n Where do you draw the line between opposing views? and just plain ole hate.\n\n \n where is the line? Well lets look at the view of a Christian and the view of a Homosexual. \n \n A Christian would be hating once he/she crosses the line by doing things that are pretty much hypocritical. If a christian feels they are better than the homosexual then they have gone against their own views and gone into the hate category. Saying that a homosexual lives their life in sin and hoping they will choose the path of Jesus is not hate but love (in accordance to the Bible which they follow). \n \n A homosexual wuld be hating once he/she goes against their own views just to try and put down or damage another. It seems rather hypocritical if a homosexual says that they want not be oppresed but at the same time say they don't want Christians to have a view against them; this is because this is oppression as well. A homosexual would not hating if he/she just argued that they want 'x' thing to be a law or they want to be free to do 'x' thing. This is fine to argue but do it the proper way...get the people to agree and pass it via the legislative branch. \n \n I guess in simple terms; hate trying to push the other down while just opposing views would be accepting each as equal and understanding that people think differently. \n \n A hard line to follow but there are many examples of \"hate\" and \"opposing views\" on these forums. Sigma and I have opposing views on abortion but (and I hope she says the same) we seem to see each other as equal with different ways of thinking.\n \n Side note: I would like to say that their are many Christians that hate and this is wrong and I don't support them. I will also say there are many homosexuals that hate and I don't support them either. \"Hate\" doesn't seem to discriminate at all.", 
   {}, 
   174697, 
   null, 
   1130529960.0
  ], 
  [
   175114, 
   null, 
   "Steeeeve", 
   "...I will accept nothing less then the total acceptance that heteros get everyday for just breathing. If you fully accept me you love me if you don't fully accept me you hate me.\n\n \n a black and white view like this just creates hate.\n I don't fully accept what some of my friends are but thats ok, I live with them being different and having different views. If I didn't accept everyone that disagress with who I am then I wouldn't have many people that like me.", 
   {}, 
   175112, 
   null, 
   1130530140.0
  ], 
  [
   175144, 
   null, 
   "Michele", 
   "I draw the line when it gets to personal attacks. Just because a person has a legitimate argument opposing homosexual rights, doesn't mean that he's attacking you, and that's what gets me. The double-standard. People in your camp preach tolerance only when it pertains to \"the cause.\" But when a person has a legitimate disagreement, like myself and other conservative thinkers, then we are accused of bigotry and hatred.\n\n \n Let me put it this way: Anything or anyone that relegates people to the back of the bus, so to speak, is hateful. Even if their intentions are good or they are just plain ignorant.\n \n What gays need now is a Rosa Parks and a Martin Luther King, Jr. Martin was for gay rights BTW. His right hand man was gay. Just ask Coretta.", 
   {}, 
   174950, 
   null, 
   1130537400.0
  ], 
  [
   175148, 
   null, 
   "joebrummer", 
   "where is the line? Well lets look at the view of a Christian and the view of a Homosexual. \n \n A Christian would be hating once he/she crosses the line by doing things that are pretty much hypocritical. If a christian feels they are better than the homosexual then they have gone against their own views and gone into the hate category. Saying that a homosexual lives their life in sin and hoping they will choose the path of Jesus is not hate but love (in accordance to the Bible which they follow). \n \n A homosexual wuld be hating once he/she goes against their own views just to try and put down or damage another. It seems rather hypocritical if a homosexual says that they want not be oppresed but at the same time say they don't want Christians to have a view against them; this is because this is oppression as well. A homosexual would not hating if he/she just argued that they want 'x' thing to be a law or they want to be free to do 'x' thing. This is fine to argue but do it the proper way...get the people to agree and pass it via the legislative branch. \n \n I guess in simple terms; hate trying to push the other down while just opposing views would be accepting each as equal and understanding that people think differently. \n \n A hard line to follow but there are many examples of \"hate\" and \"opposing views\" on these forums. Sigma and I have opposing views on abortion but (and I hope she says the same) we seem to see each other as equal with different ways of thinking.\n \n Side note: I would like to say that their are many Christians that hate and this is wrong and I don't support them. I will also say there are many homosexuals that hate and I don't support them either. \"Hate\" doesn't seem to discriminate at all.\n\n \n Thanks you steve.\n \n After pages of posts, you are the only one who really addressed the topic I posted. Thanks!", 
   {}, 
   175112, 
   null, 
   1130538600.0
  ], 
  [
   175150, 
   null, 
   "Bassman", 
   "I have to agree with you on this. This was exactly the point I was trying to convey without putting my foot in my mouth, again.", 
   {}, 
   175148, 
   null, 
   1130540820.0
  ], 
  [
   175155, 
   null, 
   "Kronus", 
   "\n Of course there are people out there who hate gays. The difference between you and I (and Matt and I) is that you seem to think anyone who has any opinion on this issue other than yours hates gays. \n\n Wrong again. You really should avoid the mindset that everyone who thinks differently than you must think the same as each other. I do not share Matt's opinions. I know that not everyone who is anti-gay hates them. I also know that the ones motivated by hate are the ones who do the most damage, and so the ones I'm most concerned about. I don't bother talking about people who feel a vague distaste for gays but don't do anything about it, because they're not causing any harm. It's the people who hate that need to be stopped, and the first step in doing that is to acknowledge that they really exist, and really do damage.", 
   {}, 
   175087, 
   null, 
   1130542260.0
  ], 
  [
   175159, 
   null, 
   "jyoshu", 
   "I know that not everyone who is anti-gay hates them. I also know that the ones motivated by hate are the ones who do the most damage, and so the ones I'm most concerned about. I don't bother talking about people who feel a vague distaste for gays but don't do anything about it, because they're not causing any harm. It's the people who hate that need to be stopped, and the first step in doing that is to acknowledge that they really exist, and really do damage.\n\n \n Then you've wasted a ton of typing here. You've been preaching to the choir and you didn't even know it.", 
   {}, 
   175155, 
   null, 
   1130543340.0
  ], 
  [
   175161, 
   null, 
   "joebrummer", 
   "Wrong again. You really should avoid the mindset that everyone who thinks differently than you must think the same as each other. I do not share Matt's opinions. I know that not everyone who is anti-gay hates them. I also know that the ones motivated by hate are the ones who do the most damage, and so the ones I'm most concerned about. I don't bother talking about people who feel a vague distaste for gays but don't do anything about it, because they're not causing any harm. It's the people who hate that need to be stopped, and the first step in doing that is to acknowledge that they really exist, and really do damage.\n\n \n \n Ok then for the record who are the ones speaking out of hate doing the damage....\n \n Paul Cameron? He does a lot of damage to gays and Religious Ring Wing groups use his studies to do even more damage. Those same groups know fully that his is a discredited researcher, yet they continue to use that reseach and flawed findings...do those groups fall into the \"hate\" catagory?\n \n Concern Women for America, Traditional Values Coalition are groups who hide behind values and chrsitianity all the while using lies and flawed studies.\n \n Do they fall into the opposition or into the hate?", 
   {}, 
   175155, 
   null, 
   1130543940.0
  ], 
  [
   175177, 
   null, 
   "Steeeeve", 
   "Just saw this thing on Matthew Shepard on HBO. If you want to know what hate is, that is hate. There was some guy out protesting too, and that was hate. There were also gays protesting in New York and they showed hate. It showed how 2 people hating led to millions of people with hate in their hearts...on both sides of the issue. They also showed the doctor, who treated both Matthew and the person that beat matthew to death. Now he may have disagreed with each of them but he showed compassion and love, not hate.", 
   {}, 
   175161, 
   null, 
   1130549640.0
  ], 
  [
   175179, 
   null, 
   "Kronus", 
   "Then you've wasted a ton of typing here. You've been preaching to the choir and you didn't even know it.\n\n \n If you think that no one on these forums hates gays then you're wearing blinders. Even you, who claim to not care about gays per se, seem to go out of your way to belittle the cause of gay rights. No, there's plenty of homophobia here, and whenever I see homophobia I'll oppose it. I'll just be more vigorous about it when it's motivated by hate.", 
   {}, 
   175159, 
   null, 
   1130550000.0
  ], 
  [
   175181, 
   null, 
   "Kronus", 
   "Ok then for the record who are the ones speaking out of hate doing the damage....\n\n It's hard to judge motivations based solely on the public face that someone presents. However, as a general rule, anyone who's saying harmful things based on obvious lies is most likely motivated by hate. So I would say that the groups you cite are, most likely, acting on hate to one degree or another.", 
   {}, 
   175161, 
   null, 
   1130550180.0
  ], 
  [
   175197, 
   null, 
   "jyoshu", 
   "If you think that no one on these forums hates gays then you're wearing blinders. \n\n \n Again, preaching to the choir. No one has claimed that \"no one on these forums hates gays.\" You're starting to desperately throw up strawmen here. \n \n \nEven you, who claim to not care about gays per se, seem to go out of your way to belittle the cause of gay rights.\n\n \n Oh make no mistake, I believe homosexual living is immoral. Unapologetically. So you've probably seen my indignation no doubt. But it's not hate. Anymore than it would be hate to have indignation over any other immoral thing one sees in society. (If it IS hate, it's the good kind--in the sense one would \"hate\" alcoholism or other problems in society.) And the fact that you imply that it is by using it as an example here only shows me you still don't have a good grasp of this issue and the views involved. And regarding the gay rights movement: how one views the gay rights movement doesn't count in the issue of hate--it has it's own set of issues completely apart from the issue of homosexuality. The gay rights movement is a political machine. In fact, one could not like the gay rights movement and still be pro-gay.\n \n \nNo, there's plenty of homophobia here,\n\n \n Of course. You've played the old switch and bait game and you've gone from the issue of hate to homophobia, because that's easier to defend. (Of course no one even claimed homophobia wasn't present.)", 
   {}, 
   175179, 
   null, 
   1130553060.0
  ], 
  [
   175206, 
   null, 
   "Matthew S", 
   "this is so very wrong. if i make a statement, i have no control over how you percieve it. your perception of my statement changes nothing about the intentions of my statement. you have absolutely no power whatsoever to judge my statements as hateful if my intentions were not hateful\n\n \n \n Yet it is still my preception and that makes it valid for me. Regardless of your motivations I will still consider anything less then full acceptance as an act, statement, or display of hate.", 
   {}, 
   175049, 
   null, 
   1130555580.0
  ], 
  [
   175207, 
   null, 
   "joebrummer", 
   "The gay rights movement is a political machine. In fact, one could not like the gay rights movement and still be pro-gay.\n\n \n If this is what you tell yourself so you can sleep at night, good. It doesn't make it true. Kronus said the perfect words when he said that you belittle the gay rights movement. You call it a machine, which is also true of the christian fundementalist movement against gays. They are a machine.\n \n Without a gay rights movement, there would be no gay rights. You cannot love the end and and yet hate the means....that would be immoral.", 
   {}, 
   175197, 
   null, 
   1130555580.0
  ], 
  [
   175209, 
   null, 
   "Matthew S", 
   "\n \n What gays need now is a Rosa Parks and a Martin Luther King, Jr. Martin was for gay rights BTW. His right hand man was gay. Just ask Coretta.\n\n \n \n We do his name is Mel White\n http://www.soulforce.org/\n http://www.melwhite.org/\n \n I met him several years ago. His movement just isn't big enough to be a force yet", 
   {}, 
   175144, 
   null, 
   1130555880.0
  ], 
  [
   175216, 
   null, 
   "Bassman", 
   "Yet it is still my preception and that makes it valid for me. Regardless of your motivations I will still consider anything less then full acceptance as an act, statement, or display of hate.\n\n Hey Matthew. Now who is that has the double-standard? You want to force everyone to accept homosexuals. That's just wrong.", 
   {}, 
   175206, 
   null, 
   1130558820.0
  ], 
  [
   175219, 
   null, 
   "Matthew S", 
   "Hey Matthew. Now who is that has the double-standard? You want to force everyone to accept homosexuals. That's just wrong.\n\n \n \n Not what I am saying at all. You don't have to accept me but if you don't in my eyes you are guilty of hate. The choice is still yours I am not forcing anything on you.", 
   {}, 
   175216, 
   null, 
   1130559900.0
  ], 
  [
   175221, 
   null, 
   "jyoshu", 
   "Yet it is still my preception and that makes it valid for me. Regardless of your motivations I will still consider anything less then full acceptance as an act, statement, or display of hate.\n\n \n You can consider it it that way all you want, but understand that just because you consider it that way, it does not necessarily make it so from the standpoint of reality. Perception is not the determinant for hate.", 
   {}, 
   175206, 
   null, 
   1130560980.0
  ], 
  [
   175225, 
   null, 
   "joebrummer", 
   "Not what I am saying at all. You don't have to accept me but if you don't in my eyes you are guilty of hate. The choice is still yours I am not forcing anything on you.\n\n \n \n Matthew, You realize I am on your side, but when you say things like this. You said like Easyrider.\n \n Lets take your words and alter them slightly to show you....\n \n Not what I am saying at all, you don't have to accpet chrsit, but if you don't you will go to the pit. The choice is still yours, I am not forcing it on you.\n \n It isn't right when Easyrider says it, and it isn't right when you say it.\n \n As a movement we need to have understanding, be firm, never stand down, but understand some people will never accept us. They have the right to not accept us, they do not have the right to psread lies, misconceptions or misinformation.", 
   {}, 
   175219, 
   null, 
   1130563560.0
  ], 
  [
   175226, 
   null, 
   "Bassman", 
   "Agreed. Although Joe and I sharply disagree on this issue, I've had to learn tact. Because when you come across hard like that, don't be surprised if you royally turn people off. Again, I've had to learn that, the hard way.", 
   {}, 
   175225, 
   null, 
   1130564040.0
  ], 
  [
   175227, 
   null, 
   "Kronus", 
   "Again, preaching to the choir. ... You're starting to desperately throw up strawmen here. \n \n\n \n Just a technical point here. \"Preaching to the choir\" means that you're saying something that your audience already believes. To \"throw up a strawman\" means to present someone else's position poorly, so that you can knock it down right away. You can't really be doing both at the same time. Just thought you might like to know.", 
   {}, 
   175197, 
   null, 
   1130564100.0
  ], 
  [
   175230, 
   null, 
   "Kronus", 
   "\n As a movement we need to have understanding, be firm, never stand down, but understand some people will never accept us. They have the right to not accept us, they do not have the right to psread lies, misconceptions or misinformation.\n\n \n Jumping on Joe's bandwagon here. Gay rights is a politcal movement, which means it about changing people's minds. Some people simply hate gays, and we won't change their minds. Alot more people are on the fence, or just dislike gays out of habit rather than any real conviction against gays. These people can be brought around, but it won't be done through name calling, intolerance, or abuse. Leave the intolerance and hate to the religious right, it's what they're good at. As much as it may gall you, you gotta show some patience with people or they will never change their minds. The gay rights movement will eventually win, because it has right on it's side. But you've got to give people time to change, it won't happen overnight. If you try to insist that it does you'll only frustrate yourself and alienate people who might otherwise have eventually agreed with you. Like Joe said, you sound alot like EZ, and how many people has he won over to his take on religion?", 
   {}, 
   175225, 
   null, 
   1130564520.0
  ], 
  [
   175231, 
   null, 
   "jyoshu", 
   " [To Matthew] and it isn't right when you say it.\n\n \n Wow! Good for you. I don't know what to make of you sometimes, Joe.", 
   {}, 
   175225, 
   null, 
   1130564580.0
  ], 
  [
   175233, 
   null, 
   "Bassman", 
   "Hey Kronus, please don't lump everyone who has serious moral convictions about homosexuality as the \"religious right.\" Because, quite frankly,people of faith who are conservative don't appreciate it. As for EZ, let's try to work with him as far as tact is concerned. I'll PM him shortly.", 
   {}, 
   175230, 
   null, 
   1130564820.0
  ], 
  [
   175238, 
   null, 
   "joebrummer", 
   "Hey Kronus, please don't lump everyone who has serious moral convictions about homosexuality as the \"religious right.\" Because, quite frankly,people of faith who are conservative don't appreciate it. As for EZ, let's try to work with him as far as tact is concerned. I'll PM him shortly.\n\n \n \n Sorry bassman, the majority of those with serious conviction about homosexuality are the religious right. Think about it slowly before jumping all over me. \n \n If homosexuality is no more grave sin then any other sin, they should have no more serious moral convictions about that anymore than they should adultry.or stealing...pride....greed....but you don't see anybody passing ammendments any of those things! No one is out collecting signatures to stop divorce? No one is out preaching in the churches about defending marriage from divorce, they are defending from gays.......do you see the point?\n \n I will make it simple for you. If the have such a moral conviction, it is because they have fear or hate for homosexuals, not because they are trying to save us from sin. There are far bigger sins in the bible, but more energy is put into fighting gay people than the other big sins.\n \n \n Kronus' point is valid. You may not appreciate it, but the truth hurts don't it!", 
   {}, 
   175233, 
   null, 
   1130565960.0
  ], 
  [
   175240, 
   null, 
   "jyoshu", 
   "Sorry bassman, the majority of those with serious conviction about homosexuality are the religious right.\n\n \n So now you to are doing the very same sort of thing you just disagreed with Matthew for doing.", 
   {}, 
   175238, 
   null, 
   1130566320.0
  ], 
  [
   175243, 
   null, 
   "Bassman", 
   "Sorry bassman, the majority of those with serious conviction about homosexuality are the religious right. Think about it slowly before jumping all over me. \n \n If homosexuality is no more grave sin then any other sin, they should have no more serious moral convictions about that anymore than they should adultry.or stealing...pride....greed....but you don't see anybody passing ammendments any of those things! No one is out collecting signatures to stop divorce? No one is out preaching in the churches about defending marriage from divorce, they are defending from gays.......do you see the point?\n \n I will make it simple for you. If the have such a moral conviction, it is because they have fear or hate for homosexuals, not because they are trying to save us from sin. There are far bigger sins in the bible, but more energy is put into fighting gay people than the other big sins.\n \n \n Kronus' point is valid. You may not appreciate it, but the truth hurts don't it!\n\n \n OK you do bring up some very valid points about what the church is failing to preach against. Especially against divorce! But to generalize that we hate or are afraid of homosexuals, I just cannot accept that because it doesn't reflect on the true nature of our Savior. The other day, you told me about two Catholic nuns who attended your commitment ceremony. I think that they had the proper perspective on the issue. And that's how I learned to swallow my pride.", 
   {}, 
   175238, 
   null, 
   1130566500.0
  ], 
  [
   175245, 
   null, 
   "joebrummer", 
   "OK you do bring up some very valid points about what the church is failing to preach against. Especially against divorce! But to generalize that we hate or are afraid of homosexuals, I just cannot accept that because it doesn't reflect on the true nature of our Savior. The other day, you told me about two Catholic nuns who attended your commitment ceremony. I think that they had the proper perspective on the issue. And that's how I learned to swallow my pride.\n\n \n I didn't genralizr at all. I said the majority! The means there must be a minority. If you are part of the minority then it doesn't apply to you...why do you always make this so person when I say these thing. DO you have a guilty conscience?", 
   {}, 
   175243, 
   null, 
   1130566620.0
  ], 
  [
   175251, 
   null, 
   "Bassman", 
   "Nahh. :) :)", 
   {}, 
   175245, 
   null, 
   1130567040.0
  ], 
  [
   175254, 
   null, 
   "joebrummer", 
   "Nahh. :) :)\n\n \n So he admits.....guilty as charged!", 
   {}, 
   175251, 
   null, 
   1130567220.0
  ], 
  [
   175257, 
   null, 
   "Bassman", 
   "<Razzberry :p < Admit to what, that I'm an Evangelical Christian who's had to learn that hotheadedness got me nowhere? I throw myself at the mercy of the court, then.", 
   {}, 
   175254, 
   null, 
   1130567460.0
  ], 
  [
   175259, 
   null, 
   "joebrummer", 
   "<Razzberry :p < Admit to what, that I'm an Evangelical Christian who's had to learn that hotheadedness got me nowhere? I throw myself at the mercy of the court, then.\n\n \n \n Okay, then I will dare to ask.....do you find yourself being more vocal about the \"sin\" of homosexuality than you do other sins there are considered equally as sinful?\n \n \n edit it add: If yes, why is that.....\n \n If no, well then you are off the hook (but be honest)", 
   {}, 
   175257, 
   null, 
   1130567760.0
  ], 
  [
   175261, 
   null, 
   "Bassman", 
   "No, I'm not more vocal about homosexuality than any other sin. As a matter of fact, anything from abortion to theivery, to hypocrisy (yes,even my own) I will treat the same way. But I also know that there's forgiveness and cleansing.", 
   {}, 
   175259, 
   null, 
   1130568240.0
  ], 
  [
   175262, 
   null, 
   "joebrummer", 
   "No, I'm not more vocal about homosexuality than any other sin. As a matter of fact, anything from abortion to theivery, to hypocrisy (yes,even my own) I will treat the same way. But I also know that there's forgiveness and cleansing.\n I like to believe you, but I don't.", 
   {}, 
   175261, 
   null, 
   1130568780.0
  ], 
  [
   175265, 
   null, 
   "Bassman", 
   "The problem I have is the double standard. While the homosexual community preaches tolerance, they refusae to practice the same. That's what kills me every time. But trust me on this. I find any sin to be just as offensive, and I will call anyone on it, even myself.", 
   {}, 
   175262, 
   null, 
   1130569860.0
  ], 
  [
   175267, 
   null, 
   "joebrummer", 
   "The problem I have is the double standard. While the homosexual community preaches tolerance, they refusae to practice the same. That's what kills me every time. But trust me on this. I find any sin to be just as offensive, and I will call anyone on it, even myself.\n\n \n \n and some levels, you are correct, but the playing field is not level. NOt everyone thinks like matthew S and expects you to change your moral view. \n \n The gay community does teach tolerance, but they also preach against what they see as hate...when the gay lobby goes against the religious people they are going after a certain group of christians, but then you have people like jyoshu or EZ or take it personal and EZ should, but jyoshu shouldn't......yet he does...it comes down to the old saying of...if the show fits! If it doesn't apply to you then stop defending it. It is silly. I can produce for you ten times more anti-gay religious sites than I can pro-gay sites on the web....do a google search and see what you get....look at the sites and what it is they really say about gays? How much of it is really true and how much is just rubbish.\n \n When gays go after religious groups, that is what we mean. SOmetimes we take it for granted (me included) that people will get that, but then people like jyoshu come along and defend those same groups or say we are generalizing we are not, we are refering to certain groups of religious people known as the religious right. If you don't fall into the religous right then we aren't talking about you, stop taking it personal.......and see what it is we are really saying.\n \n Sometimes listening and hearing are not the same thing. Sure you can hear it, but are you really listening to what is being said? Are you taking in who it is really being said to?\n \n It may bot be you....jyoshu has failed to see that for years...you have too! but I think you are starting to see the bigger picture.\n \n My advice is...google a bit, read up on gay rights and understand where gays are coming from. this will tell you about understanding what they say and more improtantly what they mean. Not everyone is MLK, and we cannpt out our words into perfect sentences....but our intentions are just as good as your, but maybe in a different direction.", 
   {}, 
   175265, 
   null, 
   1130571780.0
  ], 
  [
   175269, 
   null, 
   "Bassman", 
   "OK, in a way I do understand because of this: \"But for the grace of God go I.\" Everyone is capable of doing the most heinous and offensive things. That's what I'm referring to as the sin nature. And since I'm capable of doing the same, it's only by God's grace and His power that I don't.", 
   {}, 
   175267, 
   null, 
   1130572740.0
  ], 
  [
   175277, 
   null, 
   "Matthew S", 
   "Matthew, You realize I am on your side, but when you say things like this. You said like Easyrider.\n \n Lets take your words and alter them slightly to show you....\n \n Not what I am saying at all, you don't have to accpet chrsit, but if you don't you will go to the pit. The choice is still yours, I am not forcing it on you.\n \n It isn't right when Easyrider says it, and it isn't right when you say it.\n \n As a movement we need to have understanding, be firm, never stand down, but understand some people will never accept us. They have the right to not accept us, they do not have the right to psread lies, misconceptions or misinformation.\n\n \n \n \n I quite understand what you are saying. I really don't care if they accept us or not. I am a firm believer in personal choice. I am just saying that it is my personal choice to look upon their personal choice as a stance of hate. I do understand that that some people will never accept us and I am fine with that that is their personal choice.", 
   {}, 
   175225, 
   null, 
   1130584140.0
  ], 
  [
   175289, 
   null, 
   "Kronus", 
   "Hey Kronus, please don't lump everyone who has serious moral convictions about homosexuality as the \"religious right.\" Because, quite frankly,people of faith who are conservative don't appreciate it. As for EZ, let's try to work with him as far as tact is concerned. I'll PM him shortly.\n\n \n The religious right is a subset of conservative, religious people who don't like gays, it's not the totality of it. Which is to say, I'm not lumping. :)\n \n As for teaching EZ tact, knock yourself out, but you'll have to forgive me if I don't hold out alot of hope.", 
   {}, 
   175233, 
   null, 
   1130593380.0
  ], 
  [
   175305, 
   null, 
   "doG", 
   "No, I'm not more vocal about homosexuality than any other sin. \n\n This is effectively a claim that homosexuality is a choice and nothing else. Have you conclusive proof of that?", 
   {}, 
   175261, 
   null, 
   1130598360.0
  ], 
  [
   175317, 
   null, 
   "joebrummer", 
   "OK, in a way I do understand because of this: \"But for the grace of God go I.\" Everyone is capable of doing the most heinous and offensive things. That's what I'm referring to as the sin nature. And since I'm capable of doing the same, it's only by God's grace and His power that I don't.\n\n \n \n and would be honest enough with yourself to admit if you did? Do you think other religious people are honest enough to admit it?", 
   {}, 
   175269, 
   null, 
   1130602920.0
  ], 
  [
   175369, 
   null, 
   "Steeeeve", 
   "This is effectively a claim that homosexuality is a choice and nothing else. Have you conclusive proof of that?\n\n \n How is it not a choice?", 
   {}, 
   175305, 
   null, 
   1130614920.0
  ], 
  [
   175370, 
   null, 
   "joebrummer", 
   "How is it not a choice?\n\n \n \n Was your sexuality a choice, did you ever need to choose who you were attracted to? I have never met anyone who choose to be gay. (except unkerpaulie) Everyone I know who is gay spent some amount of time trying to fight off the feelings of being gay. No one made a choice to have an attraction to the same sex anymore than people made a choice to be attracted to the opposite sex.", 
   {}, 
   175369, 
   null, 
   1130615880.0
  ], 
  [
   175382, 
   null, 
   "doG", 
   "How is it not a choice?\n\n I didn't say that it isn't. I do know that as a young man there came a time when I suddenly began to see girls differently. All of the sudden they didn't have cooties anymore. There was a desire I couldn't understand. I became attracted to them. This was not an active choice I made, it was a natural occurence. How about you? Did you actively choose to like girls, assuming you're male, or did nature do that for you?\n \n Is it a possibility that nature makes this choice differently for some? I'm not saying that this is absolutely the case, just asking if you conceed that it's possible for some. No one has proven that it's not the case. In the event that it's not though, is it fair to hold a choice by nature against the individual that has to live with it? IMO, everyone at least deserves the benefit of a doubt until someone can conclusively prove that all sexual orientation is by choice and none of it is biological. If nature had made you green would it be fair for people to hold that against you or would you deserve to live your life as happily as the rest of us regardless of your natural development?", 
   {}, 
   175369, 
   null, 
   1130621400.0
  ], 
  [
   175403, 
   null, 
   "JakeCJB", 
   "Does anyone ask if you can change, unless they think you should? It's very rare that heterosexuals are presented with the idea that they could change and become gay.", 
   {}, 
   175382, 
   null, 
   1130634540.0
  ], 
  [
   175416, 
   null, 
   "Steeeeve", 
   "Was your sexuality a choice, did you ever need to choose who you were attracted to? I have never met anyone who choose to be gay. (except unkerpaulie) Everyone I know who is gay spent some amount of time trying to fight off the feelings of being gay. No one made a choice to have an attraction to the same sex anymore than people made a choice to be attracted to the opposite sex.\n\n \n maybe its better said that you have a choice one what to do about it. Just like an alcoholic can choose not to be a true alcoholic eventhough he/she will probably always have the \"genes\" for it.", 
   {}, 
   175370, 
   null, 
   1130638380.0
  ], 
  [
   175418, 
   null, 
   "joebrummer", 
   "maybe its better said that you have a choice one what to do about it. Just like an alcoholic can choose not to be a true alcoholic eventhough he/she will probably always have the \"genes\" for it.\n\n \n \n True, but lets look at these choices shall we?\n \n Choice A: Stay in closet, struggle, be lonely, pretend you are straight when everyone can see right through that anyway so you will be discriminated against anyway, see thera[ist for depression.....\n \n Choice B: Come out, meet nice partner, settle down, buy house and have a nice life with two dogs.\n \n \n Okay Steeve What would you choose.......", 
   {}, 
   175416, 
   null, 
   1130638560.0
  ], 
  [
   175422, 
   null, 
   "doG", 
   "maybe its better said that you have a choice one what to do about it. Just like an alcoholic can choose not to be a true alcoholic eventhough he/she will probably always have the \"genes\" for it.\n\n That's a dodge. The question asked was if your own sexual preference was a choice you made or not.", 
   {}, 
   175416, 
   null, 
   1130640600.0
  ], 
  [
   175432, 
   null, 
   "Bassman", 
   "and would be honest enough with yourself to admit if you did? Do you think other religious people are honest enough to admit it?\n\n Yes I would, and yes most people of faith would because to do otherwise is bearing false witness and is sin.", 
   {}, 
   175317, 
   null, 
   1130646780.0
  ], 
  [
   175434, 
   null, 
   "Bassman", 
   "The religious right is a subset of conservative, religious people who don't like gays, it's not the totality of it. Which is to say, I'm not lumping. :)\n\n Wanna bet?\n \n \nAs for teaching EZ tact, knock yourself out, but you'll have to forgive me if I don't hold out alot of hope.\n\n As I've posted earlier, you can teach an old dog new tricks. :)", 
   {}, 
   175289, 
   null, 
   1130646900.0
  ], 
  [
   175441, 
   null, 
   "joebrummer", 
   "Yes I would, and yes most people of faith would because to do otherwise is bearing false witness and is sin.\n\n \n \n \n wow, you are really gulliable if you think this way.....mosy people of faith wouldn't for what reason? oh please.....you can't be that gulliable......\n \n Maybe some people of faith, but not most...Most people of faith don't even go to church let alone worry about bearing false witness.....", 
   {}, 
   175432, 
   null, 
   1130648880.0
  ], 
  [
   175449, 
   null, 
   "Bassman", 
   "I'm specifically focusing in on those that do. Those who have been labelled as the \"religious right.\"", 
   {}, 
   175441, 
   null, 
   1130650320.0
  ], 
  [
   175453, 
   null, 
   "joebrummer", 
   "I'm specifically focusing in on those that do. Those who have been labelled as the \"religious right.\"\n\n \n \n That is the point the religious right are known for bearing false witness.....that why they come under fire all the time....they lie like hell", 
   {}, 
   175449, 
   null, 
   1130651100.0
  ], 
  [
   175457, 
   null, 
   "Bassman", 
   "Hmmm. So, let me ask this. Do people with serious moral convictions have a first amendment right to speak freely?", 
   {}, 
   175453, 
   null, 
   1130651880.0
  ], 
  [
   175463, 
   null, 
   "Steeeeve", 
   "That's a dodge. The question asked was if your own sexual preference was a choice you made or not.\n\n \n I didn't dodge anything....I answered JoeBrummer and just completly ignored your post.", 
   {}, 
   175422, 
   null, 
   1130652900.0
  ], 
  [
   175464, 
   null, 
   "Steeeeve", 
   "True, but lets look at these choices shall we?\n \n Choice A: Stay in closet, struggle, be lonely, pretend you are straight when everyone can see right through that anyway so you will be discriminated against anyway, see thera[ist for depression.....\n \n Choice B: Come out, meet nice partner, settle down, buy house and have a nice life with two dogs.\n \n \n Okay Steeve What would you choose.......\n\n \n I'm not sure Choice A is always the case. The alcoholic doesn't stay in the closest (although they do struggle). \n \n Someone of religion would feel that alcohlism, homosexuality, and other genetic things are just struggles that EVERYONE has.", 
   {}, 
   175418, 
   null, 
   1130653140.0
  ], 
  [
   175466, 
   null, 
   "doG", 
   "I didn't dodge anything....I answered JoeBrummer and just completly ignored your post.\n\n Oh, I see. You were just asking a question to begin with that you won't answer yourself...\n \nHow is it not a choice?\n", 
   {}, 
   175463, 
   null, 
   1130653680.0
  ], 
  [
   175545, 
   null, 
   "joebrummer", 
   "Hmmm. So, let me ask this. Do people with serious moral convictions have a first amendment right to speak freely?\n\n \n \n Well in some cases, but not all. The first ammendment doesn't protect all speech. SOme speech is not protected. When the speech is based on lies, incites others to commit crimes, or cases public harm.....no it isn't free speech.\n \n \n Just like you can't yell fire in a crowded public place, not all speech is free.", 
   {}, 
   175457, 
   null, 
   1130689320.0
  ], 
  [
   175551, 
   null, 
   "Bassman", 
   "So, in other words, you're willing to shut down evangelical pastors.", 
   {}, 
   175545, 
   null, 
   1130689680.0
  ], 
  [
   175570, 
   null, 
   "Matthew S", 
   "So, in other words, you're willing to shut down evangelical pastors.\n\n \n If they do anything with their peaching to hurt GLBT persons then yes they need to be locked up; the same as we lock up those who shout fire in a crowed movie theatre", 
   {}, 
   175551, 
   null, 
   1130692260.0
  ], 
  [
   175571, 
   null, 
   "Steeeeve", 
   "Oh, I see. You were just asking a question to begin with that you won't answer yourself...\n\n \n That is the exact conclusion you should have come up with because of my last post emoticon_rolleyes .", 
   {}, 
   175466, 
   null, 
   1130692500.0
  ], 
  [
   175584, 
   null, 
   "doG", 
   "That is the exact conclusion you should have come up with because of my last post emoticon_rolleyes .\n\n The conclusion is that you seem to think it's a choice and we should just take your word for it instead of asking you to support that argument. I choose to conclude that your unsupported position is meaningless.", 
   {}, 
   175571, 
   null, 
   1130693940.0
  ], 
  [
   175587, 
   null, 
   "Steeeeve", 
   "Not very easy to prove something is a choice. However, the alcoholic is the only example I can provide. The alcoholic will always be one just as a homosexual will always be that. They both and choose not to live that way though even if their passion and desires are for their respective activity. I guess I could choose to be gay if I wanted to eventhough my desires are for the opposite sex.", 
   {}, 
   175584, 
   null, 
   1130694120.0
  ], 
  [
   175589, 
   null, 
   "doG", 
   "So, in other words, you're willing to shut down evangelical pastors.\n\n In the PC environment that is spreading it will be inevitable that some of them will be censored. It is just a matter of time before some of them will be charged with spreading hate. I certainly wouldn't classify the sermons of some of them as spreading tolerance or forgiveness. The faithful would be doing a lot for their own image to exile these extremists.", 
   {}, 
   175551, 
   null, 
   1130694180.0
  ], 
  [
   175591, 
   null, 
   "Steeeeve", 
   "If they do anything with their peaching to hurt GLBT persons then yes they need to be locked up; the same as we lock up those who shout fire in a crowed movie theatre\n\n \n can we apply the same standard to you? Whenever a GLBT preaches about gay rights it hurts a Christian and thus they need to be locked up. What if I walk down the street and call someone \"fat\". That hurts them. I guess that person should go to jail too. In fact, lets just forget the 1st amendment.\n \n how ironic that this thread is about \"intolerance\". You seem to be intolerant of the intolerant..which makes you against yourself.", 
   {}, 
   175570, 
   null, 
   1130695020.0
  ], 
  [
   175592, 
   null, 
   "joebrummer", 
   "So, in other words, you're willing to shut down evangelical pastors.\n\n \n \n not at all, If they want to preach theior version of the bible, good for them. BUT when they cross the line and start saying gays don't live as long, or that we are all diseased, or that we are evil, then I think they should be censored. \n \n I am all for frrdom of speech, but the speech needs to be in context. If a pastor wants to speak of god. then do so, but don't start peaching false science and many do.", 
   {}, 
   175551, 
   null, 
   1130695200.0
  ], 
  [
   175604, 
   null, 
   "Steeeeve", 
   "not at all, If they want to preach theior version of the bible, good for them. BUT when they cross the line and start saying gays don't live as long, or that we are all diseased, or that we are evil, then I think they should be censored. \n \n I am all for frrdom of speech, but the speech needs to be in context. If a pastor wants to speak of god. then do so, but don't start peaching false science and many do.\n\n \n Why can't people speak lies? It isn't freedom of speech if you limit what you can say to what a few people believe.", 
   {}, 
   175592, 
   null, 
   1130699940.0
  ], 
  [
   175606, 
   null, 
   "joebrummer", 
   "Why can't people speak lies? It isn't freedom of speech if you limit what you can say to what a few people believe.\n\n \n Just remember that not all speech is covered under the first ammendment.\n \n Lies are slander!", 
   {}, 
   175604, 
   null, 
   1130700060.0
  ], 
  [
   175608, 
   null, 
   "doG", 
   "Why can't people speak lies? It isn't freedom of speech if you limit what you can say to what a few people believe.\n\n They can as long as they don't damage a person's reputation, i.e. slander. Many people, like car salesmen and politicians, make a living telling lies.", 
   {}, 
   175604, 
   null, 
   1130700780.0
  ], 
  [
   175610, 
   null, 
   "Steeeeve", 
   "They can as long as they don't damage a person's reputation, i.e. slander. Many people, like car salesmen and politicians, make a living telling lies.\n\n \n slander or libel to be exact...and preaching that gays are evil is not slander (in the legal sense)", 
   {}, 
   175608, 
   null, 
   1130701080.0
  ], 
  [
   175612, 
   null, 
   "Steeeeve", 
   "Just remember that not all speech is covered under the first ammendment.\n \n Lies are slander!\n\n \n no they aren't either. You can lie all day long. For slander to be illegal you have to spread lies about someone that a reasonable person would think might be true and that was intended to directly hurt a specific person.", 
   {}, 
   175606, 
   null, 
   1130701200.0
  ], 
  [
   175641, 
   null, 
   "JakeCJB", 
   "can we apply the same standard to you? Whenever a GLBT preaches about gay rights it hurts a Christian and thus they need to be locked up.\n\n \n It doesn't hurt a Christian. It hurts someone who wants to discriminate.", 
   {}, 
   175591, 
   null, 
   1130709360.0
  ], 
  [
   175646, 
   null, 
   "jyoshu", 
   "Just remember that not all speech is covered under the first ammendment.\n \n Lies are slander!\n\n \n Then a lot of the propaganda by your movement against religious people and evangelicals ought to be censored, since by your definition, it's not covered by the 1st Amendment.", 
   {}, 
   175606, 
   null, 
   1130709720.0
  ], 
  [
   175647, 
   null, 
   "Steeeeve", 
   "It doesn't hurt a Christian. It hurts someone who wants to discriminate.\n\n and? So what...if it hurts someone then it should be illegal I thought? Sounds like an intolerant standard ;)", 
   {}, 
   175641, 
   null, 
   1130709780.0
  ], 
  [
   175857, 
   null, 
   "unkerpaulie", 
   "Not what I am saying at all. You don't have to accept me but if you don't in my eyes you are guilty of hate. The choice is still yours I am not forcing anything on you.\n\n your perception of hate is not hate. it is your choice to perceive something anyway you want to. but accusing someone of hating you when they are not is wrong", 
   {}, 
   175219, 
   null, 
   1130775960.0
  ], 
  [
   175865, 
   null, 
   "jyoshu", 
   "your perception of hate is not hate. it is your choice to perceive something anyway you want to. but accusing someone of hating you when they are not is wrong\n\n \n It's interesting how this mentality of Matt's and others like him is very much like religious fundamentalism (my-way-or-the-highway mentality, unwilling to waver from his all-or-nothing view of the world, etc., a mentality that even people in his own movement have disagreed with him on, etc.) I've come to realize from his posts that there is such a thing as gay pride fundamentalism.\n \n A gay pride fundie!", 
   {}, 
   175857, 
   null, 
   1130777040.0
  ], 
  [
   175868, 
   null, 
   "unkerpaulie", 
   "Jumping on Joe's bandwagon here. Gay rights is a politcal movement, which means it about changing people's minds. Some people simply hate gays, and we won't change their minds. Alot more people are on the fence, or just dislike gays out of habit rather than any real conviction against gays. These people can be brought around, but it won't be done through name calling, intolerance, or abuse. Leave the intolerance and hate to the religious right, it's what they're good at. As much as it may gall you, you gotta show some patience with people or they will never change their minds. The gay rights movement will eventually win, because it has right on it's side. But you've got to give people time to change, it won't happen overnight. If you try to insist that it does you'll only frustrate yourself and alienate people who might otherwise have eventually agreed with you. Like Joe said, you sound alot like EZ, and how many people has he won over to his take on religion?\n\n what do you think a change of people's minds will consist of? i mean i do agree that the public perception needs to be more open if gay marriage and other gay rights are to be introduced smoothly. but what exactly are the perceptions we want to promote in the advancement of gay rights?\n \n i think there are 2 ways to go about getting public acceptance\n \n 1. gay couples are 2 people that love each other and desire to be intimate, and they both consent to the other party's intamacy. the taboo against gay relationships should be removed since it is largely fueled by bible-based religions. the bible is actually a 6000 year-old man-made attempt to regulate his own morality, and 2000 years ago the same people that came up with the bible realized that their morality code wasnt working, so they dumped it. today, the 2000 year-old morality code isnt working, so its time to dump it. in our new newly updated moral code, homosexual relationships is no longer a taboo\n \n 2. sexual orientation is caused and controlled by an unknown and yet undiscovered biological mechanism. gays have no power over who they are sexually attracted to, so they must have been born that way. also, where the bible refers to homosexuality as a sin is vague and we can retranslate it to mean something else, so the bible really doesnt say homosexuality is a sin. so dont be homophobic. homosexual relationships should not be a taboo\n \n while option 1 is based on truth, it scares politicians sh*tless to even think about trying that method. option 2, while based on lies, is easier to swallow", 
   {}, 
   175230, 
   null, 
   1130777160.0
  ], 
  [
   175871, 
   null, 
   "unkerpaulie", 
   "I didn't say that it isn't. I do know that as a young man there came a time when I suddenly began to see girls differently. All of the sudden they didn't have cooties anymore. There was a desire I couldn't understand. I became attracted to them. This was not an active choice I made, it was a natural occurence. How about you? Did you actively choose to like girls, assuming you're male, or did nature do that for you?\n \n Is it a possibility that nature makes this choice differently for some? I'm not saying that this is absolutely the case, just asking if you conceed that it's possible for some. No one has proven that it's not the case. In the event that it's not though, is it fair to hold a choice by nature against the individual that has to live with it? IMO, everyone at least deserves the benefit of a doubt until someone can conclusively prove that all sexual orientation is by choice and none of it is biological. If nature had made you green would it be fair for people to hold that against you or would you deserve to live your life as happily as the rest of us regardless of your natural development?\n\n would you believe it i tell you there are still people that abstain from sex to the point where they can suppress the desire? i actually happen to know a 45-year-old virgin, very religious, a school principal, and not a single accusation could be made against him except specultaions about his lack of women. i know many youths brought up in a church environment that were conditioned (mainly through fear of going to hell/disappointing their parents) that remained virgins well into their 20's and even up until marriage. in fact, 50 years ago this was the norm.\n \n how would you account for the fact that sexual attraction can be suppressed after puberty?", 
   {}, 
   175382, 
   null, 
   1130777880.0
  ], 
  [
   175874, 
   null, 
   "unkerpaulie", 
   "wow, you are really gulliable if you think this way.....mosy people of faith wouldn't for what reason? oh please.....you can't be that gulliable......\n \n Maybe some people of faith, but not most...Most people of faith don't even go to church let alone worry about bearing false witness.....\n\n joe, dont make the mistake of confusing \"people of faith\" with \"churchgoers\" or \"proclaimed christians\". a person of faith is one that actually lives according to the pattern jesus lived. this is a true christian, a disciple of christ, and while they may be the minority, they take being pure very seriously, and self examination and confession of their sins is a common practice.", 
   {}, 
   175441, 
   null, 
   1130778180.0
  ], 
  [
   175875, 
   null, 
   "unkerpaulie", 
   "Not very easy to prove something is a choice. However, the alcoholic is the only example I can provide. The alcoholic will always be one just as a homosexual will always be that. They both and choose not to live that way though even if their passion and desires are for their respective activity. I guess I could choose to be gay if I wanted to eventhough my desires are for the opposite sex.\n\n the problem with homosexuality is that no gene that accounts for a sexual attraction towards any gender has ever been found. this is unlike the genes that control the body's chemical dependence on alcohol (and many alcoholics do not have any genes that would predispose them to alcohol dependency). there are genes that have been detected to control the level of testosterone or estrogen present, and genes that dictate any of the thousands (perhaps millions) of bodily features and functions. however, habits, behaviors and identity has never been linked to any gene. neither has preference and taste. theoretically, these things are genetic, but no actaul evidence exists to suport this", 
   {}, 
   175587, 
   null, 
   1130778600.0
  ], 
  [
   175877, 
   null, 
   "unkerpaulie", 
   "In the PC environment that is spreading it will be inevitable that some of them will be censored. It is just a matter of time before some of them will be charged with spreading hate. I certainly wouldn't classify the sermons of some of them as spreading tolerance or forgiveness. The faithful would be doing a lot for their own image to exile these extremists.\n\n of course, this would apply if the congregation were more concerned with their \"image\" than with being hearing what the bible has to say about the issue. while in some churches this is the case, in a lot of churches, image is nothing", 
   {}, 
   175589, 
   null, 
   1130778780.0
  ], 
  [
   175879, 
   null, 
   "unkerpaulie", 
   "It doesn't hurt a Christian. It hurts someone who wants to discriminate.\n\n lol. christianity stands for spiritual purity and obedience to biblical law, including the law to not have sex with people of your gender. this goes against what gays believe (although it shouldnt), so gays often preach against christianity for this reason.\n \n would you call a christian discriminating because he believes in the bible? or would you call a gay discriminating because he doesnt accept what a christian believes?", 
   {}, 
   175641, 
   null, 
   1130779140.0
  ], 
  [
   175880, 
   null, 
   "doG", 
   "how would you account for the fact that sexual attraction can be suppressed after puberty?\n\n Is the fact that it can be suppressed a valid reasons for others to expect it? Should I expect you to suppress yours just because your friend can? Is that treating others they way you'd like to be treated?", 
   {}, 
   175871, 
   null, 
   1130779200.0
  ], 
  [
   176092, 
   null, 
   "Steeeeve", 
   "the problem with homosexuality is that no gene that accounts for a sexual attraction towards any gender has ever been found. this is unlike the genes that control the body's chemical dependence on alcohol (and many alcoholics do not have any genes that would predispose them to alcohol dependency). there are genes that have been detected to control the level of testosterone or estrogen present, and genes that dictate any of the thousands (perhaps millions) of bodily features and functions. however, habits, behaviors and identity has never been linked to any gene. neither has preference and taste. theoretically, these things are genetic, but no actaul evidence exists to suport this\n\n \n ok. So you are saying being gay is not genetic?", 
   {}, 
   175875, 
   null, 
   1130809680.0
  ], 
  [
   176132, 
   null, 
   "joebrummer", 
   "Unkerpaulie doesn't think it is genetic, he actually believes people choose this, a position I do not agree with for the most part. I think a small number of people \"may\" choose to be gay or bisexual. I highly doubt any real number do.", 
   {}, 
   176092, 
   null, 
   1130813040.0
  ], 
  [
   176144, 
   null, 
   "doG", 
   "the problem with homosexuality is that no gene that accounts for a sexual attraction towards any gender has ever been found. this is unlike the genes that control the body's chemical dependence on alcohol (and many alcoholics do not have any genes that would predispose them to alcohol dependency). there are genes that have been detected to control the level of testosterone or estrogen present, and genes that dictate any of the thousands (perhaps millions) of bodily features and functions. however, habits, behaviors and identity has never been linked to any gene. neither has preference and taste. theoretically, these things are genetic, but no actaul evidence exists to suport this\n\n So. Just because we have found no such gene does not mean that it does not or could not exist. Many new genes are found all the time. Just days ago a single gene was found to be a key factor in dyslexia. Should it have been a correct assumption that dyslexia was not a genetic condition prior to finding this gene? I don't think any real scientist at this point would conclude that any cause could be ruled out or confirmed for sexual orientation based on the observable evidence. Should it just be assumed that there could not be a genetic cause even if it is a possibility? Should we just assume that no aspect of anyone's personality could possibly be genetic until we have conclusive proof that it is?", 
   {}, 
   175875, 
   null, 
   1130814960.0
  ], 
  [
   176158, 
   null, 
   "Steeeeve", 
   "Unkerpaulie doesn't think it is genetic, he actually believes people choose this, a position I do not agree with for the most part. I think a small number of people \"may\" choose to be gay or bisexual. I highly doubt any real number do.\n\n \n I honestly don't know the answer. I am not a scientist in the field of genetics and so I am actually asking which is it?", 
   {}, 
   176132, 
   null, 
   1130818860.0
  ], 
  [
   176163, 
   null, 
   "JakeCJB", 
   "lol. christianity stands for spiritual purity and obedience to biblical law, including the law to not have sex with people of your gender. this goes against what gays believe (although it shouldnt), so gays often preach against christianity for this reason.\n \n would you call a christian discriminating because he believes in the bible? or would you call a gay discriminating because he doesnt accept what a christian believes?\n\n \n The gay person would have to tolerate discrimination against being gay. The Christian would only be discriminated against by one aspect of belief and activity, related to discrimination towards gays, which is not unique to Christianity, and is not encapsulating everything actively being a Christian is about.", 
   {}, 
   175879, 
   null, 
   1130819520.0
  ], 
  [
   176207, 
   null, 
   "Matthew S", 
   "lol. christianity stands for spiritual purity and obedience to biblical law, including the law to not have sex with people of your gender. this goes against what gays believe (although it shouldnt), so gays often preach against christianity for this reason.\n \n would you call a christian discriminating because he believes in the bible? or would you call a gay discriminating because he doesnt accept what a christian believes?\n\n \n \n The difference is that evangelical christians and catholics are fighting against Glbt acceptance in society where as the Glbt people are fighting for acceptance in society. What Evangelical Christians and Catholics do not understand that we live in a secular society and that all religious beliefs as well as non religious beliefs are equal under the law. There are several sects of Christianity as well as several non christian religions that welcome, fully accept, and bless Glbt people and their relationships. Evangelicals and Catholics are not just targeting Glbt people they are trying to force the whole secular nation to adopt their beliefs as law. Glbt people as well as anyone else in the US have the right to to be bothered with religion if they don't want religion in their lives, a concept that the evangelical and catholic can not understand. \n \n The question then becomes are Glbt people trying to force their beliefs on Evangelicals and Catholics? The answer is no any more then the Wiccan is trying to force the evangelicals to worship a tree spirit. The Evangelical accepts that Wiccans exist, they may not like the fact but they accept their existance. It is this type of acceptance that GLBT people are looking for. You may not like us but we have the same right to exist and be happy as anyone else.", 
   {}, 
   175879, 
   null, 
   1130851380.0
  ], 
  [
   176218, 
   null, 
   "jyoshu", 
   "I honestly don't know the answer. I am not a scientist in the field of genetics and so I am actually asking which is it?\n\n \n I'm no scientist either, but based on what I've read, no one really knows for sure. It's probably has some genetic basis, since so many thing pertaining to human behavior is at least influenced by our genes.", 
   {}, 
   176158, 
   null, 
   1130862120.0
  ], 
  [
   176220, 
   null, 
   "jyoshu", 
   "The question then becomes are Glbt people trying to force their beliefs on Evangelicals and Catholics? The answer is no\n\n \n I disagree with this. Since most of the country is religious in some way, by expecting the public to change their views on marriage and redefine it to include gay unions, they ARE trying to force their beliefs on religious people.", 
   {}, 
   176207, 
   null, 
   1130862240.0
  ], 
  [
   176224, 
   null, 
   "Matthew S", 
   "I disagree with this. Since most of the country is religious in some way, by expecting the public to change their views on marriage and redefine it to include gay unions, they ARE trying to force their beliefs on religious people.\n\n \n Was the rest of my answer ignored?\n \n \nThe question then becomes are Glbt people trying to force their beliefs on Evangelicals and Catholics? The answer is no any more then the Wiccan is trying to force the evangelicals to worship a tree spirit. The Evangelical accepts that Wiccans exist, they may not like the fact but they accept their existance. It is this type of acceptance that GLBT people are looking for. You may not like us but we have the same right to exist and be happy as anyone else.\n \n \n No where did I state that anyone if forcing their beliefs on evangelicals. What I am argueing is that they will be and should be forced to accept Glgt people the same way they are forced to accept non christians and other religions.", 
   {}, 
   176220, 
   null, 
   1130862600.0
  ], 
  [
   176229, 
   null, 
   "unkerpaulie", 
   "ok. So you are saying being gay is not genetic?\n\n what makes you think being gay is genetic?", 
   {}, 
   176092, 
   null, 
   1130863620.0
  ], 
  [
   176230, 
   null, 
   "unkerpaulie", 
   "So. Just because we have found no such gene does not mean that it does not or could not exist. Many new genes are found all the time. Just days ago a single gene was found to be a key factor in dyslexia. Should it have been a correct assumption that dyslexia was not a genetic condition prior to finding this gene? I don't think any real scientist at this point would conclude that any cause could be ruled out or confirmed for sexual orientation based on the observable evidence. Should it just be assumed that there could not be a genetic cause even if it is a possibility? Should we just assume that no aspect of anyone's personality could possibly be genetic until we have conclusive proof that it is?\n\n there is a difference between assumption and fact. up to this point, it is perfectly acceptable to assume that homosexuality is caused by genetics. until evidence is found, please treat it as an assumption and not a fact.", 
   {}, 
   176144, 
   null, 
   1130863740.0
  ], 
  [
   176231, 
   null, 
   "joebrummer", 
   "what makes you think being gay is genetic?\n\n It does appear to run in families......I have a gay counsin, a gay niece, a gay uncle.......I also have lots of friends who have the same experience.", 
   {}, 
   176229, 
   null, 
   1130863740.0
  ], 
  [
   176233, 
   null, 
   "unkerpaulie", 
   "The question then becomes are Glbt people trying to force their beliefs on Evangelicals and Catholics? The answer is no any more then the Wiccan is trying to force the evangelicals to worship a tree spirit. The Evangelical accepts that Wiccans exist, they may not like the fact but they accept their existance. It is this type of acceptance that GLBT people are looking for. You may not like us but we have the same right to exist and be happy as anyone else.\n\n you tell me. the gay activists are opposing bible-based sermons about homosexuality to the point that they want to tell pastors what and what not to preach. if a christian believes that homosexuality is a sin, and you believe it isnt, you have no more right to force your belief on a christian as christians have to force his beliefs on you. if you dont accept the christian doctrine, then thats all well and good. just leave them to live. the christian doctrine is not infringing on your rights. similarly, if christians dont accept your lifestyle, then then still have the right to let you live your life, since your life does not infringe on their rights\n \n like i said before, the religious right has no right to tell gays how to love, just as gays have no right to tell the religious what to preach. if you have a problem with that, then you are the bigot and hypocrite", 
   {}, 
   176207, 
   null, 
   1130864160.0
  ], 
  [
   176234, 
   null, 
   "Kronus", 
   "It does appear to run in families......I have a gay counsin, a gay niece, a gay uncle.......I also have lots of friends who have the same experience.\n\n \n Of course, it could also be that open mindedness runs in families, in a non-genetic sense. Your relatives may just be more comfortable being out than, say, EZ's relatives would be.\n \n No one seems to be mentioning the Italian study that links male homosexulaity with the fertility of the mother. Were there counter-studies that I haven't heard about, or are people here just not familiar with it?", 
   {}, 
   176231, 
   null, 
   1130864220.0
  ], 
  [
   176235, 
   null, 
   "unkerpaulie", 
   "It does appear to run in families......I have a gay counsin, a gay niece, a gay uncle.......I also have lots of friends who have the same experience.\n\n interesting. i come from a family of carpenters. my grandfather, dad and uncles are skilled carpenters, and my brother and i are good with wordwork as well. i suppose this means the carpentry gene runs in our family", 
   {}, 
   176231, 
   null, 
   1130864280.0
  ], 
  [
   176236, 
   null, 
   "jyoshu", 
   "What I am argueing is that they will be and should be forced to accept Glgt people the same way they are forced to accept non christians and other religions.\n\n \n But \"non-Christians\" and \"other religions\" aren't trying to redefine marriage. I assure you that if they were, they'd be meeting the same sort of protest.", 
   {}, 
   176224, 
   null, 
   1130864340.0
  ], 
  [
   176243, 
   null, 
   "unkerpaulie", 
   "No where did I state that anyone if forcing their beliefs on evangelicals. What I am argueing is that they will be and should be forced to accept Glgt people the same way they are forced to accept non christians and other religions.\n\n do you understand what freedom of religion means? it means you can believe and accept whatever religious belief you want to, and nobody can force you to accept or reject ANY religious belief unless you want to. if your religious belief is that skinny dipping in the hudson river will make you holy, then that is your right. (of course if practicing your faith involves the endangerment of your life or that of others, then its a different matter). a belief cannot affect anybody's rights, and as such the government can make no law governing what people believe", 
   {}, 
   176224, 
   null, 
   1130864940.0
  ], 
  [
   176245, 
   null, 
   "Matthew S", 
   "you tell me. the gay activists are opposing bible-based sermons about homosexuality to the point that they want to tell pastors what and what not to preach. if a christian believes that homosexuality is a sin, and you believe it isnt, you have no more right to force your belief on a christian as christians have to force his beliefs on you. if you dont accept the christian doctrine, then thats all well and good. just leave them to live. the christian doctrine is not infringing on your rights. similarly, if christians dont accept your lifestyle, then then still have the right to let you live your life, since your life does not infringe on their rights\n \n like i said before, the religious right has no right to tell gays how to love, just as gays have no right to tell the religious what to preach. if you have a problem with that, then you are the bigot and hypocrite\n\n \n \n I don't care if they preach it to the mountain tops. I don't care if they claim what ever they want claim. It is when they try and legislate their morals that I have a problem. If they try and make or support laws that out law gay sex and marriage then they cross the line and need to be stopped. I do believe in live and let live if it dosn't effect my life then it is none of my business and I expect the same respect from others. My problem is that People like Marlene Elwell http://www.protectmarriageyes.org/About.aspx is not willing to live and let live she is out there attacking my family because of her religious convictions.", 
   {}, 
   176233, 
   null, 
   1130865360.0
  ], 
  [
   176249, 
   null, 
   "Matthew S", 
   "do you understand what freedom of religion means? it means you can believe and accept whatever religious belief you want to, and nobody can force you to accept or reject ANY religious belief unless you want to. if your religious belief is that skinny dipping in the hudson river will make you holy, then that is your right. (of course if practicing your faith involves the endangerment of your life or that of others, then its a different matter). a belief cannot affect anybody's rights, and as such the government can make no law governing what people believe\n\n \n \n Yet they are forced to accept other religions and people of non religion which goes against their religious beliefs. Are you advocating that christians should not be forced to accept the existance of non christians?", 
   {}, 
   176243, 
   null, 
   1130865540.0
  ], 
  [
   176251, 
   null, 
   "jyoshu", 
   "do you understand what freedom of religion means? it means you can believe and accept whatever religious belief you want to, and nobody can force you to accept or reject ANY religious belief unless you want to. if your religious belief is that skinny dipping in the hudson river will make you holy, then that is your right. (of course if practicing your faith involves the endangerment of your life or that of others, then its a different matter). a belief cannot affect anybody's rights, and as such the government can make no law governing what people believe\n\n \n Yep. Gay relationships do NOT trump my religious beliefs.", 
   {}, 
   176243, 
   null, 
   1130865720.0
  ], 
  [
   176254, 
   null, 
   "unkerpaulie", 
   "I don't care if they preach it to the mountain tops. I don't care if they claim what ever they want claim. It is when they try and legislate their morals that I have a problem. If they try and make or support laws that out law gay sex and marriage then they cross the line and need to be stopped. I do believe in live and let live if it dosn't effect my life then it is none of my business and I expect the same respect from others. My problem is that People like Marlene Elwell http://www.protectmarriageyes.org/About.aspx is not willing to live and let live she is out there attacking my family because of her religious convictions.\n\n the only way the religious can influence the legal system is by the religious group lobbying to the legal institutions. the only way gays can influence the legal system is by lobbying to the legal system. a lot of time and enrgy is being wasted by disputes between the gay loobyists and the religious lobbyists.\n \n legislature that was influenced by religious lobbying, as with any legislature, can be challenged and revised. and there is an effective way to do so. a religious belief cannot attack you", 
   {}, 
   176245, 
   null, 
   1130866200.0
  ], 
  [
   176257, 
   null, 
   "unkerpaulie", 
   "Yet they are forced to accept other religions and people of non religion which goes against their religious beliefs. Are you advocating that christians should not be forced to accept the existance of non christians?\n\n nobody is forced to accept or reject any religious belief whatsoever. you dont get it, do you?\n \n the existence of a person or group is not a religious belief. apparently you dont know the difference. christians exist. non-christians exist. you exist. i exist. thats not a religious belief, thats a fact.", 
   {}, 
   176249, 
   null, 
   1130866440.0
  ], 
  [
   176262, 
   null, 
   "Phunting", 
   "Further to what Unker says, I think non-Christians are a comparable group. Christians 'accept' they exist, in that they are aware of the fact. Just as people 'accept' homosexuals exist. That does not equate approval, or even 'acceptance' in one term of the word.\n \n People can think that non-Christians are amoral, sinful or even evil if they like. They are of course wrong, but that's just my opinion as their opinion is theirs. They can even hate us if it makes them happy. I don't approve, but what the hell. The difference is when they resort to physical or political oppression to inflict their views on others.\n \n I am totally behind the push to have full and equal marriage. I do that because it is what I believe is right. I don't agree with people who think it is wrong, but I don't think it is hate that necessarily drives them to this. It is a bit much to accuse people of hate just because they think homosexuality is sinful. Argue with them as much as you like, but to descend to this level is to see the world only from your own viewpoint. And that is the problem in the first place.", 
   {}, 
   176257, 
   null, 
   1130867640.0
  ], 
  [
   176270, 
   null, 
   "Matthew S", 
   "nobody is forced to accept or reject any religious belief whatsoever. you dont get it, do you?\n \n the existence of a person or group is not a religious belief. apparently you dont know the difference. christians exist. non-christians exist. you exist. i exist. thats not a religious belief, thats a fact.\n\n \n \n Ahhh but they aren't out there puting thier religous beliefs against Wiccans into law are they? They have chosen to wage war against GLBT people. They have put thier religious beliefs into laws that effect my life. I do get it they hide behind their constitutional protection of religion to attack GLBT people. Glbt people can not respond in kind to outlaw their religion because they are constitutioally protected.", 
   {}, 
   176257, 
   null, 
   1130869020.0
  ], 
  [
   176295, 
   null, 
   "unkerpaulie", 
   "Ahhh but they aren't out there puting thier religous beliefs against Wiccans into law are they? They have chosen to wage war against GLBT people. They have put thier religious beliefs into laws that effect my life. I do get it they hide behind their constitutional protection of religion to attack GLBT people. Glbt people can not respond in kind to outlaw their religion because they are constitutioally protected.\n\n listen. no religion is constitutionally protected. the government can neither protect or prohibiit anybody from believing any religious ideal, myth, or code of conduct. practicing what they believe will see the government's intervention if that practice is illegal or infringes on somebody else's freedom\n \n the church is not outlawing homosexuality. homosexuality is legal. however, homosexuality is against the belief of the church. it doesnt make it more or less legal, it has no effect on the law concerning homosexuals\n \n there never existed a law that allowed homosexuals to marry, so no rights have been taken away from the gay community by the church. the gay community is trying to set a NEW law in place, and the church is doing whatever it can to prevent this. this is the due process, and there is nothing wrong with that. anybody or group has the right to have a say in the passing of a new law. thats how the democratic process works.", 
   {}, 
   176270, 
   null, 
   1130873220.0
  ], 
  [
   176390, 
   null, 
   "MrWriteLA", 
   "The man should be sued.\n \n http://traditionalvalues.org/homosexual_movement_and_pedophilia/", 
   {
    "post_info": {
     "post_title": "The worst kind of hateful slander"
    }
   }, 
   174697, 
   null, 
   1130899560.0
  ], 
  [
   176420, 
   null, 
   "joebrummer", 
   "The man should be sued.\n \n http://traditionalvalues.org/homosexual_movement_and_pedophilia/\n\n \n utter garbage....complete hate filled rubbish......do we have a trash can big enough for this.....Did you click through all of it...OMG, garbage...hate speech at it best.....every Medical, Pyschological, and social organization has position statements that go against everything these freaks have said....\n \n Do they not care that they bear flase witness on their neighbors?", 
   {}, 
   176390, 
   null, 
   1130907960.0
  ], 
  [
   176427, 
   null, 
   "Steeeeve", 
   "You got to admit though...those books seem like XXXX.\n \n Whatever happened to Green Eggs and Ham or other classics...Berstein(sp) Bears!", 
   {}, 
   176420, 
   null, 
   1130910480.0
  ], 
  [
   176429, 
   null, 
   "Steeeeve", 
   "The man should be sued.\n \n http://traditionalvalues.org/homosexual_movement_and_pedophilia/\n\n \n I am looking into the claim made on that website...which is that Homosexuals are more likely to be child molesters...or rather more child molesters are homosexuals rather then not. I'll let you know what I find.", 
   {}, 
   176390, 
   null, 
   1130911440.0
  ], 
  [
   176455, 
   null, 
   "Phunting", 
   "The man should be sued.\n \n http://traditionalvalues.org/homosexual_movement_and_pedophilia/\nVery insecure, ignorant people. They are far beneath any of us.", 
   {}, 
   176390, 
   null, 
   1130932200.0
  ], 
  [
   176474, 
   null, 
   "Steeeeve", 
   "Very insecure, ignorant people. They are far beneath any of us.\n\n \n wait...hopefully you are being sarcastic. Saying you are above them is, in fact, doing the same thing they are doing but in reverse.", 
   {}, 
   176455, 
   null, 
   1130945820.0
  ], 
  [
   176482, 
   null, 
   "jyoshu", 
   "utter garbage....complete hate filled rubbish......do we have a trash can big enough for this.....Did you click through all of it...OMG, garbage...hate speech at it best.....every Medical, Pyschological, and social organization has position statements that go against everything these freaks have said....\n \n Do they not care that they bear flase witness on their neighbors?\n\n \n You know what? I wholeheartedly agree with you in this case. There is no call for what that website claimed. I'd much rather see those opposed to gay marriage argue for it over honest grounds than to stir up irrational fear or flat out lie like that site does. Yes, that website is indeed an example of hate.", 
   {}, 
   176420, 
   null, 
   1130948580.0
  ], 
  [
   176503, 
   null, 
   "Kronus", 
   " I'd much rather see those opposed to gay marriage argue for it over honest grounds than to stir up irrational fear or flat out lie like that site does. Yes, that website is indeed an example of hate.\n\n \n So I guess this you your new schtick, but I'm not sure where you're going with it yet. That site isn't about opposing gay marriage per se, it's anti-gay in every respect. Naturally they don't want gays to marry. They also don't want gays to exist. What's your goal with saying that people who are anti-gay are just anti-gay marriage? You've done it several times recently.", 
   {}, 
   176482, 
   null, 
   1130952840.0
  ], 
  [
   176504, 
   null, 
   "joebrummer", 
   "I am looking into the claim made on that website...which is that Homosexuals are more likely to be child molesters...or rather more child molesters are homosexuals rather then not. I'll let you know what I find.\n\n \n YOu will find a mix of studies, questions who did the study.....who funded the study and the methodology used to get the data. WHen all that is said and done..\n \n Check out the American Pediatric Association. There studies are pretty good!", 
   {}, 
   176429, 
   null, 
   1130953200.0
  ], 
  [
   176521, 
   null, 
   "Phunting", 
   "wait...hopefully you are being sarcastic. Saying you are above them is, in fact, doing the same thing they are doing but in reverse.\nI meant that to pay any heed to such blatant lies and misinformation is beneath me and from what I've seen, anyone who posts here.\n \n That is not the same as what they are doing. If I were to say that people who believe homosexuality is sinful have a direct agenda to kill all those who believe otherwise then I would be doing the same as them.", 
   {}, 
   176474, 
   null, 
   1130955180.0
  ], 
  [
   176527, 
   null, 
   "jyoshu", 
   "So I guess this you your new schtick, but I'm not sure where you're going with it yet. That site isn't about opposing gay marriage per se, it's anti-gay in every respect. Naturally they don't want gays to marry. They also don't want gays to exist. What's your goal with saying that people who are anti-gay are just anti-gay marriage? You've done it several times recently.\n\n \n I'm agreeing with Joe that the site is hateful. It's uncalled for. That's all I'm saying. If you don't agree, take it up with everyone else.", 
   {}, 
   176503, 
   null, 
   1130955540.0
  ], 
  [
   176536, 
   null, 
   "Matthew S", 
   "listen. no religion is constitutionally protected. the government can neither protect or prohibiit anybody from believing any religious ideal, myth, or code of conduct. practicing what they believe will see the government's intervention if that practice is illegal or infringes on somebody else's freedom\n\n \n \n I can not fire someone from my company because they are a christian. I can be fired from a company becaue I am gay. The constitution protects people from being discriminated against because of their religion. There are no constitutional protection for sexual orientation. I want to be able to discriminate against christians if they can discriminate against me. \n http://www.legislature.mi.gov/mileg.asp?page=getObject&objName=mcl-Article-I-2&highlight=\n \n \n\n the church is not outlawing homosexuality. homosexuality is legal. however, homosexuality is against the belief of the church. it doesnt make it more or less legal, it has no effect on the law concerning homosexuals\n\n \n Untill 2003 there were laws in Texas against \"homosexuality\"\n http://www.sodomy.org/laws/texas/sodomy.html\n \n It was titled \"The Homosexual Conduct act\"\n \n\n there never existed a law that allowed homosexuals to marry, so no rights have been taken away from the gay community by the church. the gay community is trying to set a NEW law in place, and the church is doing whatever it can to prevent this. this is the due process, and there is nothing wrong with that. anybody or group has the right to have a say in the passing of a new law. thats how the democratic process works.\n\n \n There was never any laws that forbid gay marriage untill 1996 most states marriage laws were gender nutral. The ones tring to define marriage are the religious right. They some how think that my personal life is their business. You are right about the democratic prosess. I guess it is time to target evangelical christains. One of my first targets will be to outlaw home schooling. I don't believe in home schooling so I am going to turn my beliefs into laws; after all I have that right. While I am at it I think I will try and be evangelical christianity outlawed too. I think as the number of christians diminish it should be an easy ballot iniatiative. See the genie is out of the bottle nothing is now off limits and everything can go on the ballot from religious freedom to freedom of speach and assembly. \n \n If evangelicals and catholics can use the democratic process to wage war against GLBT people we are just as capable of using the democratic process to wage war against evangelical christians. A good place to start is home schooling since many evangelical christians practice this.", 
   {}, 
   176295, 
   null, 
   1130956200.0
  ], 
  [
   176547, 
   null, 
   "Kronus", 
   "I'm agreeing with Joe that the site is hateful. It's uncalled for. That's all I'm saying. If you don't agree, take it up with everyone else.\n\n \n That's not all you're saying. You're emphasizing gay marriage, when the site is about gay hate. I'm asking you why.", 
   {}, 
   176527, 
   null, 
   1130956860.0
  ], 
  [
   176583, 
   null, 
   "Steeeeve", 
   "I can not fire someone from my company because they are a christian. I can be fired from a company becaue I am gay. The constitution protects people from being discriminated against because of their religion. There are no constitutional protection for sexual orientation. I want to be able to discriminate against christians if they can discriminate against me. \n http://www.legislature.mi.gov/mileg...-I-2&highlight=\n\n Please tell me you don't think that link provided is a link the US constitution. The constitution is not what protects you from being fired for being of a religion...it is equal employement acts passed by congress (mainly the Civil Rights Act of '64 ..Title 7). However, many states have added to the list by stating that sexual orientation can't be a reason either. \n \n \nUntill 2003 there were laws in Texas against \"homosexuality\"\n http://www.sodomy.org/laws/texas/sodomy.html\n \n It was titled \"The Homosexual Conduct act\"\n Did the church pass this law? No, texas did. I assume you chose Texas because of the court case that legalized homosexual sodemy...However bad of a law that might have been the court had no power to say you can't make laws about that. The justification for that case was insanly dumb.\n \n \nThere was never any laws that forbid gay marriage untill 1996 most states marriage laws were gender nutral\n This is wrong\n \n \n \nYou are right about the democratic prosess. I guess it is time to target evangelical christains. One of my first targets will be to outlaw home schooling. I don't believe in home schooling so I am going to turn my beliefs into laws; after all I have that right. While I am at it I think I will try and be evangelical christianity outlawed too. I think as the number of christians diminish it should be an easy ballot iniatiative. See the genie is out of the bottle nothing is now off limits and everything can go on the ballot from religious freedom to freedom of speach and assembly.\n You could do the first one (home schooling) with a simple majority vote in your state. The second one (banning christians) would take a constitutional amendment..but still could be done.\n \n \n \nIf evangelicals and catholics can use the democratic process to wage war against GLBT people we are just as capable of using the democratic process to wage war against evangelical christians. A good place to start is home schooling since many evangelical christians practice this.\n Have at it...you will get about 5% of the vote.", 
   {}, 
   176547, 
   null, 
   1130960040.0
  ], 
  [
   176592, 
   null, 
   "tonybrown74", 
   "the only way the religious can influence the legal system is by the religious group lobbying to the legal institutions. the only way gays can influence the legal system is by lobbying to the legal system. a lot of time and enrgy is being wasted by disputes between the gay loobyists and the religious lobbyists.\n \n legislature that was influenced by religious lobbying, as with any legislature, can be challenged and revised. and there is an effective way to do so. a religious belief cannot attack you\n\n \n Are you kidding????\n \n Have you lived in America in the last 5 years????", 
   {}, 
   176254, 
   null, 
   1130965320.0
  ], 
  [
   176594, 
   null, 
   "jyoshu", 
   "That's not all you're saying. You're emphasizing gay marriage, when the site is about gay hate. I'm asking you why.\n\n \n I had no intention of emphasizing marriage over anything else. I think you're being pretty nitpicky, myself. Gay marriage is the hot topic in this forum--more time is spent on it that any other gay-related issue. So I don't see what the problem is.", 
   {}, 
   176547, 
   null, 
   1130966220.0
  ], 
  [
   176804, 
   null, 
   "unkerpaulie", 
   "Are you kidding????\n \n Have you lived in America in the last 5 years????\n\n ummm... yes i have, and no im not kidding. do you have a point?", 
   {}, 
   176592, 
   null, 
   1131040380.0
  ], 
  [
   176832, 
   null, 
   "tonybrown74", 
   "ummm... yes i have, and no im not kidding. do you have a point?\n\n \n Yes I do. \n \n In this country we seemed obsessed with the religious convictions of our leaders, even though there supposed to be no religious litmus on people running for office. That silly debacle on the Capital, where our Senators recited the Pledge of Allegiance emphasizing, \"under God,\" said more about how religion injects itself in government than anything I've seen in a long time.\n \n Bishops refusing to give communion to a candidate due to his stance on abortion ...\n \n Fundamentalists proding out president to push for an amendment to the US constitution based on the moral beliefs of religious conservatives.\n \n In God We Trust on our currency ...\n \n It seems, to me, that it would be difficult, to say the least, to challenge and/or revise any laws passed by the majority with religious intent.", 
   {}, 
   176804, 
   null, 
   1131048540.0
  ], 
  [
   176857, 
   null, 
   "unkerpaulie", 
   "It seems, to me, that it would be difficult, to say the least, to challenge and/or revise any laws passed by the majority with religious intent.\n\n difficult yes. impossible no. like any arcane or bulky system, there is endless buracracy and it would take a long time. but it could be done. and if enough people worked together, it would be easier to do. laws based on religious influence can change, its just not easy", 
   {}, 
   176832, 
   null, 
   1131052080.0
  ], 
  [
   176880, 
   null, 
   "tonybrown74", 
   "difficult yes. impossible no. like any arcane or bulky system, there is endless buracracy and it would take a long time. but it could be done. and if enough people worked together, it would be easier to do. laws based on religious influence can change, its just not easy\n\n \n Indeed.\n \n But here's the problem. Religious fundamentalists, as well as reactionaries, now want to change the rules of engagement. Right now, if a group finds the laws unjust, they can at least appeal to the judiciary. These people now want to fill up the judiciary with reactionaries, as well as change the rules by instituting constitutional amendments.", 
   {}, 
   176857, 
   null, 
   1131057420.0
  ], 
  [
   176899, 
   null, 
   "Steeeeve", 
   "Indeed.\n \n But here's the problem. Religious fundamentalists, as well as reactionaries, now want to change the rules of engagement. Right now, if a group finds the laws unjust, they can at least appeal to the judiciary. These people now want to fill up the judiciary with reactionaries, as well as change the rules by instituting constitutional amendments.\n\n \n its because if you want to change law you shouldn't be able to exploit the judiciary..you need to do it like everyone else has (up until 50yrs ago) which is go convince the people and run it like a DEMOCRACY.", 
   {}, 
   176880, 
   null, 
   1131060000.0
  ], 
  [
   176904, 
   null, 
   "Kronus", 
   "its because if you want to change law you shouldn't be able to exploit the judiciary..you need to do it like everyone else has (up until 50yrs ago) which is go convince the people and run it like a DEMOCRACY.\n\n \n What country are you from? In America the people have never had the ability to decided law. The legislature writes it, the executive approves it, and the judiciary interprets it. The people have no direct say what so ever.", 
   {}, 
   176899, 
   null, 
   1131060180.0
  ], 
  [
   176908, 
   null, 
   "Steeeeve", 
   "What country are you from? In America the people have never had the ability to decided law. The legislature writes it, the executive approves it, and the judiciary interprets it. The people have no direct say what so ever.\n\n who elects the legistlature? Oh yeah, the people. Convince the people and you can be represented in the legislature. However, the courts don't represent anyone. They, like you said, interpret the law...not decide which laws are good or bad. Now tell me which of the three branchs is the least powerful?", 
   {}, 
   176904, 
   null, 
   1131060540.0
  ], 
  [
   176911, 
   null, 
   "Bassman", 
   "Liberals have lost each and every time at the ballot box. So now, the only way they can impose liberalism is through judicial fiat in the Federal courts. Once Alito is confirmed, and GW nominates another strict originalist to the bench, then the game's over. Liberals will have lost their only ally in the government.", 
   {}, 
   176908, 
   null, 
   1131060840.0
  ], 
  [
   176922, 
   null, 
   "Steeeeve", 
   "Liberals have lost each and every time at the ballot box. So now, the only way they can impose liberalism is through judicial fiat in the Federal courts. Once Alito is confirmed, and GW nominates another strict originalist to the bench, then the game's over. Liberals will have lost their only ally in the government.\n\n \n I wouldn't complain about the process used if the libs did it via congress. In fact, because the libs try and do everything via the Supreme Court it seems the Congess can just avoid all moral questions which means the people have no say in a democracy...that makes no sense. If people want 5 people to decide all issues for congress then why have a congress?", 
   {}, 
   176911, 
   null, 
   1131061440.0
  ], 
  [
   176927, 
   null, 
   "jyoshu", 
   "who elects the legistlature? Oh yeah, the people. Convince the people and you can be represented in the legislature. However, the courts don't represent anyone. They, like you said, interpret the law...not decide which laws are good or bad. Now tell me which of the three branchs is the least powerful?\n\n \n That's correct. People vote based on what laws they want to see or what issues they consider important. So for all practical purposes, the people do make law.", 
   {}, 
   176908, 
   null, 
   1131061680.0
  ], 
  [
   176938, 
   null, 
   "Michele", 
   "I disagree with this. Since most of the country is religious in some way, by expecting the public to change their views on marriage and redefine it to include gay unions, they ARE trying to force their beliefs on religious people.\n\n \n They are asking for a secular marriage, a civil marriage, not a religious one. Why should religious people care as long as their church is not forced to marry them?\n \n There are people being married in courthouses and city halls all over the place every day. I don't hear the religious people complain about that.", 
   {}, 
   176220, 
   null, 
   1131063840.0
  ], 
  [
   177033, 
   null, 
   "jitobear", 
   "Liberals have lost each and every time at the ballot box.\n\n \n Scratching my head here.\n \n True, conservatives won the last two presidential elections, but liberals won the the two prior to that. Also roughly half of congress - give or take a senater or rep or two is liberal, I have a liberal mayor.....\n \n I just don't see this.\n \n There will ALWAYS be a variety of view points. People are like that. Different, with different ideas, backgrounds, up-bringing, life-experiences etc. Neither liberalism or conservatism (or the in-betweens) are going anywhere. Personally this very fact gives me a great deal of peace. I would hate for the world to be filled up with, to quote Spoc, \"one dimensional thinkers\".", 
   {}, 
   176911, 
   null, 
   1131091740.0
  ], 
  [
   177040, 
   null, 
   "Bassman", 
   "Since 1994, when Republicans took control of the House for the first time in 40 years, the majority of governorships, state legislatures, House and Senate elections have been won by Republicans.", 
   {}, 
   177033, 
   null, 
   1131111540.0
  ], 
  [
   177049, 
   null, 
   "Matthew S", 
   "Since 1994, when Republicans took control of the House for the first time in 40 years, the majority of governorships, state legislatures, House and Senate elections have been won by Republicans.\n\n \n \n There are 23 democratic governors and 27 republican governors. Hardly an overwheming majority.\n \n http://usconservatives.about.com/library/blstategovs.htm", 
   {}, 
   177040, 
   null, 
   1131116400.0
  ], 
  [
   177050, 
   null, 
   "unkerpaulie", 
   "who elects the legistlature? Oh yeah, the people. Convince the people and you can be represented in the legislature. However, the courts don't represent anyone. They, like you said, interpret the law...not decide which laws are good or bad. Now tell me which of the three branchs is the least powerful?\n\n electing the judicial board and then leaving the actual process of making the laws up to them is hardly a democratic process. look at the electoral campains. these candidates dont have the people's interest at heart, they are usually much more interested in smearing their opponent than in promising to inplement laws that the people will be happy with. when you look at it, under this system the people really have no say", 
   {}, 
   176908, 
   null, 
   1131118560.0
  ], 
  [
   177065, 
   null, 
   "Sigma", 
   "who elects the legistlature? Oh yeah, the people. Convince the people and you can be represented in the legislature. However, the courts don't represent anyone. They, like you said, interpret the law...not decide which laws are good or bad. Now tell me which of the three branchs is the least powerful?\n\n \n Given the extremely dishonest redrawing of district lines by politicians, it ensures that nearly no matter what, incumbents will remain in office. That is not what I call representative.", 
   {}, 
   176908, 
   null, 
   1131122400.0
  ], 
  [
   177083, 
   null, 
   "Steeeeve", 
   "electing the judicial board and then leaving the actual process of making the laws up to them is hardly a democratic process. look at the electoral campains. these candidates dont have the people's interest at heart, they are usually much more interested in smearing their opponent than in promising to inplement laws that the people will be happy with. when you look at it, under this system the people really have no say\n\n emoticon_rolleyes Your 'view' on what happens is noted but the point remains that people are supposed to represented in government and not have the judicial branch decide what laws are good or bad. You never answered my question in my last post by the way.", 
   {}, 
   177050, 
   null, 
   1131127080.0
  ], 
  [
   177085, 
   null, 
   "Steeeeve", 
   "Given the extremely dishonest redrawing of district lines by politicians, it ensures that nearly no matter what, incumbents will remain in office. That is not what I call representative.\n\n \n they keep getting elected don't they? You are being represented aren't you? If you can think of a better way to be represented I am all ears....but doing it via the judicial branch is not really democracy, it is a monarchy. I honestly don't want 5 unelected people running the country.", 
   {}, 
   177065, 
   null, 
   1131127200.0
  ], 
  [
   177092, 
   null, 
   "unkerpaulie", 
   "emoticon_rolleyes Your 'view' on what happens is noted but the point remains that people are supposed to represented in government and not have the judicial branch decide what laws are good or bad. You never answered my question in my last post by the way.\n\n your question: who elects the legislature\n my answer: the people\n my comment: the legislature isnt elected based on their ability to make laws that the people want, but because they can dig up the most dirt on their opponent. this is how its been for the longest while, and it seems to be the only thing people are interested in: voting for the guy that got smeared less.\n \n the system is flawed, and the people are doing nothing about it. judiciary isnt voted in because of favorable law-making policies. they get votes because they can play the tabloid game. the people end up having the least power in the law-making process, since they are clueless about the law-making policies of the guy they are voting in, yet they vote him in anyway", 
   {}, 
   177083, 
   null, 
   1131129120.0
  ], 
  [
   177096, 
   null, 
   "Steeeeve", 
   "your question: who elects the legislature\n my answer: the people\n my comment: the legislature isnt elected based on their ability to make laws that the people want, but because they can dig up the most dirt on their opponent. this is how its been for the longest while, and it seems to be the only thing people are interested in: voting for the guy that got smeared less.\n \n the system is flawed, and the people are doing nothing about it. judiciary isnt voted in because of favorable law-making policies. they get votes because they can play the tabloid game. the people end up having the least power in the law-making process, since they are clueless about the law-making policies of the guy they are voting in, yet they vote him in anyway\n\n \n I think the question was who is supposed to be more powerful, the legislative, excutive, or judicial or are they all supposed to have equal power? The system may be flawed but this doesn't create a reason to use the judicial branch to make laws because this just flaws the system more.", 
   {}, 
   177092, 
   null, 
   1131130560.0
  ], 
  [
   177188, 
   null, 
   "Michele", 
   "I think the question was who is supposed to be more powerful, the legislative, excutive, or judicial or are they all supposed to have equal power? The system may be flawed but this doesn't create a reason to use the judicial branch to make laws because this just flaws the system more.\n\n \n They don't make laws, they decide if they are Constitutional or not. That is their job. What don't you get about this?", 
   {}, 
   177096, 
   null, 
   1131144000.0
  ], 
  [
   177191, 
   null, 
   "Sigma", 
   "they keep getting elected don't they? You are being represented aren't you? If you can think of a better way to be represented I am all ears....but doing it via the judicial branch is not really democracy, it is a monarchy. I honestly don't want 5 unelected people running the country.\n\n \n They keep getting re-elected because of the extremely dishonest redistricting they do to protect incumbants. You don't honestly believe you are being represented, do you?\n \n There is a better way. Have impartial judges do redistricting.", 
   {}, 
   177085, 
   null, 
   1131144120.0
  ], 
  [
   177213, 
   null, 
   "Steeeeve", 
   "They keep getting re-elected because of the extremely dishonest redistricting they do to protect incumbants. You don't honestly believe you are being represented, do you?\n \n There is a better way. Have impartial judges do redistricting.\n\n \n I think you should have a computer program do it but thats just me.\n \n yeah, i feel I am represented well. My congressman and state rep tend to keep me up to date.", 
   {}, 
   177191, 
   null, 
   1131148440.0
  ], 
  [
   177229, 
   null, 
   "Bassman", 
   "They don't make laws, they decide if they are Constitutional or not. That is their job. What don't you get about this?\n\n The proper function of the courts is to strictly interpret the laws, not create social policy as they have done in the past.", 
   {}, 
   177188, 
   null, 
   1131151380.0
  ], 
  [
   177230, 
   null, 
   "Bassman", 
   "Given the extremely dishonest redrawing of district lines by politicians, it ensures that nearly no matter what, incumbents will remain in office. That is not what I call representative.\n\n Democrats have done it, too.", 
   {}, 
   177065, 
   null, 
   1131151440.0
  ], 
  [
   177233, 
   null, 
   "Sigma", 
   "Democrats have done it, too.\n\n \n Yes, they have. No politician is honest, no politician represents anyone but their own interest. Including this president, including John Kerry, including every person the uninformed think \"represents\" them. They don't care about us. Yes, I am bitter :)", 
   {}, 
   177230, 
   null, 
   1131151800.0
  ], 
  [
   177234, 
   null, 
   "Sigma", 
   "\n yeah, i feel I am represented well. My congressman and state rep tend to keep me up to date.\n\n \n Then you are a fool. They will appease you as long as it is politically expedient to do so.\n \n As for the computer program idea, there were too many \"voter irregularities\" for me to trust politicians to honestly have that happen.", 
   {}, 
   177213, 
   null, 
   1131151860.0
  ], 
  [
   177241, 
   null, 
   "Bassman", 
   "Yes, they have. No politician is honest, no politician represents anyone but their own interest. Including this president, including John Kerry, including every XXXXXX person the uninformed think \"represents\" them. They don't care about us. Yes, I am bitter :)\n\n Ohh, you ain't kidding about that! I'll give you an example from my area. We have a RINO in County hall named Joel Giambra and ten clowns on a fifteen person county legislature. Now, when Giambra took office in 1999, he cut the property tax by 30% without corresponding cuts to offset the loss of revenue. Result? The county's fiscal house is a mess! There is a state fiscal advisory board in place that's on the verge of becoming a full-blown control board (hopefully). Now, with that in mind, does the government of Erie County, NY represent the people? Absolutly not!!", 
   {}, 
   177233, 
   null, 
   1131153660.0
  ], 
  [
   177246, 
   null, 
   "Sigma", 
   "I can give you an example in California (I've been following Arnold as governor so I know a bit of the situation). \n \n Not one of the over 150 members of the gov't up for re-election were replaced. That's just not possible with a fair election, especially the huge deficit CA is running, the spendthrift attitude of the legislature and the polls that show the majority do not like the way that State is going. Arnold is trying to rein in the spending (I have to amend my statement before. Some politicians do care about changing things for the better, but very few), but is having huge amounts of money (I mean HUGE) thrown in opposition. The teacher's union alone is in debt for 3 or so years of union dues because of the amount they are spending in opposition.", 
   {}, 
   177241, 
   null, 
   1131154680.0
  ], 
  [
   177247, 
   null, 
   "Michele", 
   "While Arnie's corporate friends have very deep pockets.\n \n Arnie will go down to defeat. The sooner the better.", 
   {}, 
   177246, 
   null, 
   1131155100.0
  ], 
  [
   177248, 
   null, 
   "Michele", 
   "The proper function of the courts is to strictly interpret the laws, not create social policy as they have done in the past.\n\n \n Please give me an example of creating social policy.", 
   {}, 
   177229, 
   null, 
   1131155160.0
  ], 
  [
   177251, 
   null, 
   "Sigma", 
   "While Arnie's corporate friends have very deep pockets.\n Arnie will go down to defeat. The sooner the better.\n\n \n So, apparently, do teachers unions. Scratch that, they have long hands to reach into teacher's pockets, whether or not those teachers agree with how the unions spend it.\n \n Please, let me know how what Arnold is proposing is detrimental.", 
   {}, 
   177247, 
   null, 
   1131156600.0
  ], 
  [
   177280, 
   null, 
   "Steeeeve", 
   "Then you are a fool. They will appease you as long as it is politically expedient to do so.\n \n As for the computer program idea, there were too many \"voter irregularities\" for me to trust politicians to honestly have that happen.\n\n \n Considering I talk to my congressman and state rep...we seem to be on the same wave length. In fact a good friend of my congressman is marrying my dad...so yeah, I trust him.", 
   {}, 
   177234, 
   null, 
   1131164820.0
  ], 
  [
   177307, 
   null, 
   "Bassman", 
   "Please give me an example of creating social policy.\n\n vol. 1 or vol. 2?\n \n Let's see: Roe v. Wade (a supposed constitutional \"right\" to abortion)\n anything from the 9th circus-can you say Michael Newdow?\n forced busing?\n \n Need I go further?", 
   {}, 
   177248, 
   null, 
   1131179520.0
  ], 
  [
   177320, 
   null, 
   "Matthew S", 
   "So, apparently, do teachers unions. Scratch that, they have long hands to reach into teacher's pockets, whether or not those teachers agree with how the unions spend it.\n \n Please, let me know how what Arnold is proposing is detrimental.\n\n \n Unions are good for this country; in fact anything that keeps business in check and from exploiting workers is good for this country.\n \n BTW he vetoed same sex marriage legislation passed by the legislature. I guess now conservates will be thinking that there is such a thing as activist legislators. Whats next if the people don't vote for an issue that conservates agree will the voters become activist people?", 
   {}, 
   177251, 
   null, 
   1131189360.0
  ], 
  [
   177357, 
   null, 
   "Bassman", 
   "Unions are good for this country; in fact anything that keeps business in check and from exploiting workers is good for this country.\n\n NOT!!! At one time they were necessary, but they've gotten too powerful too quickly. Not to mention the fact that they oppose any type of reform that is beneficial to the community, or in private sector (Delphi being an example) companies. Two examples I can cite right here in New York State. SEIU 1199, based in New York City, is opposed to any kind of Medicaid reform that would reap substantial savings for New York. Why? Because they don't want to lose their power. Second case: The Buffalo Teacher's Federation has been screaming bloody murder over charter schools (see my thread in the Education Forum: \"Charter Schools Success...\"). Why? Because they don't want to lose their monopoly. Not to mention the fact that they've hauled the school district into court over plans to get the entire district to one health insurance provider. So don't tell me unions are good, because they're not!", 
   {}, 
   177320, 
   null, 
   1131204900.0
  ], 
  [
   177434, 
   null, 
   "Obvious Child", 
   "Considering I talk to my congressman and state rep...we seem to be on the same wave length.\nHe needs your vote. He's not going to tell you you're talking ########.\n \nIn fact a good friend of my congressman is marrying my dad...so yeah, I trust him.\nAnd this is grounds for trust because?", 
   {}, 
   177280, 
   null, 
   1131222900.0
  ], 
  [
   177485, 
   null, 
   "Matthew S", 
   "NOT!!! At one time they were necessary, but they've gotten too powerful too quickly. Not to mention the fact that they oppose any type of reform that is beneficial to the community, or in private sector (Delphi being an example) companies. Two examples I can cite right here in New York State. SEIU 1199, based in New York City, is opposed to any kind of Medicaid reform that would reap substantial savings for New York. Why? Because they don't want to lose their power. Second case: The Buffalo Teacher's Federation has been screaming bloody murder over charter schools (see my thread in the Education Forum: \"Charter Schools Success...\"). Why? Because they don't want to lose their monopoly. Not to mention the fact that they've hauled the school district into court over plans to get the entire district to one health insurance provider. So don't tell me unions are good, because they're not!\n\n \n \n \n So you are willing to go back to the days when busisness could freely expliot workers? The two sited examples that might be bad but that does not make unions bad in general. We need more unions in this country and re need many more regulations on business. I do not wish to return to the 1880's when business had free reign to do what they want.", 
   {}, 
   177357, 
   null, 
   1131282180.0
  ], 
  [
   177491, 
   null, 
   "Bassman", 
   "So you are willing to go back to the days when busisness could freely expliot workers? The two sited examples that might be bad but that does not make unions bad in general. We need more unions in this country and re need many more regulations on business. I do not wish to return to the 1880's when business had free reign to do what they want.\n\n Hey Matt, ever hear of profit and loss? Businesses don't exist to be social welfare agencies. Businesses exist to make a profit.", 
   {}, 
   177485, 
   null, 
   1131290400.0
  ], 
  [
   177500, 
   null, 
   "jitobear", 
   "Hey Matt, ever hear of profit and loss? Businesses don't exist to be social welfare agencies. Businesses exist to make a profit.\n\n \n I agree with both of you. Business will go back to expoliting people for pennies if they could. If it weren't true you would not see them opening up shop in third world countries where they are not held to paying people a decent wage, or keeping the work place safe and child labor laws don't exist.\n \n However, I don't know that unions are critical or particularly valuable in the US anymore as we have labor laws that protect us now. My only concern is that if unions go away will big business have the political cloit to repeal current labor laws?\n \n And Bassman, wanting to protect the American worker from exploitation, being compensated fairly for a hard day's work, expecting a safe work environment, and being allowed a reasonable work-life balance aren't \"social welfare\".", 
   {}, 
   177491, 
   null, 
   1131293820.0
  ], 
  [
   177502, 
   null, 
   "Eddie", 
   "However, I don't know that unions are critical or particularly valuable in the US anymore as we have labor laws that protect us now. My only concern is that if unions go away will big business have the political cloit to repeal current labor laws?\n \n\n \n I think this is very important to consider when talking about labour unions. Laws can always be overturned. Do you really want to be at the mercy of corruptabel legislators and flimsy public oppinions? Labour unions should be constructed to protect the workers, by the workers for the workers. Now, granted labour leadership is not always what it should be either.. but you need to make them accountable to their members.", 
   {}, 
   177500, 
   null, 
   1131295920.0
  ], 
  [
   177521, 
   null, 
   "Sigma", 
   "Considering I talk to my congressman and state rep...we seem to be on the same wave length. In fact a good friend of my congressman is marrying my dad...so yeah, I trust him.\n\n \n Ah, ok. Unless you are a personal friend or donate lots of money to him, he cares nothing for you. Amended :)", 
   {}, 
   177280, 
   null, 
   1131302880.0
  ], 
  [
   177522, 
   null, 
   "Sigma", 
   "Unions are good for this country; in fact anything that keeps business in check and from exploiting workers is good for this country.\n\n \n I do agree that they help balance the power corporations have with their donations. However, they have become as... soul-less as the corporations they fight. They don't really care about their members, only maintaining the power they have.", 
   {}, 
   177320, 
   null, 
   1131303120.0
  ], 
  [
   177588, 
   null, 
   "Steeeeve", 
   "He needs your vote. He's not going to tell you you're talking ########.\n \n HAHA, actually I talked to Jerry Kilgore one time and he didn't really try to talk to me or anything...this was 4 years ago...I hope my one vote against him makes him not win on Tuesday.\n \n \n\n And this is grounds for trust because?\n Because I trust my dads wife.", 
   {}, 
   177434, 
   null, 
   1131326280.0
  ], 
  [
   177590, 
   null, 
   "Steeeeve", 
   "Ah, ok. Unless you are a personal friend or donate lots of money to him, he cares nothing for you. Amended :)\n\n \n I dunno, I'm not a personal friend. \n \n You know there is this book out there (the name escapes me) about how everyone doesn't trust any person in politics. Its talks about how a few bad apples seems to destroy the rest (mostly in the House of Reps). I kinda believed the book as it talked about the irrational thoughts of people when it comes to politicians.", 
   {}, 
   177521, 
   null, 
   1131326400.0
  ], 
  [
   177816, 
   null, 
   "Michele", 
   "So, apparently, do teachers unions. Scratch that, they have long hands to reach into teacher's pockets, whether or not those teachers agree with how the unions spend it.\n \n Please, let me know how what Arnold is proposing is detrimental.\n\n \n These union members already have an option to opt out of the political contributions. This legislation would require the union to get permission every year from every union member. They woul spend all their time and money trying to accomplish this.\n \n The unions have said they would go along with this if they passed another measure requiring corporations to get permission from every shareholder to spend money on polititics as well.\n \n That'll never fly.\n \n Arnie only wants this to shut up the public unions. You know the teachers, the firefighters, the cops, nurses, etc.", 
   {}, 
   177251, 
   null, 
   1131418140.0
  ], 
  [
   177817, 
   null, 
   "Michele", 
   "vol. 1 or vol. 2?\n \n Let's see: Roe v. Wade (a supposed constitutional \"right\" to abortion)\n anything from the 9th circus-can you say Michael Newdow?\n forced busing?\n \n Need I go further?\n\n \n Roe v. Wade rests on a right to privacy. Privacy between a woman and her doctor, her husband or whatever. Government has no business in reproductive decisions.\n \n Forced busing, maybe. Probably didn't solve much. But people were trying to end discrimination. Like a sociology professor I once had said: How are you going to get inner city schools fixed unless some little white kid comes home to his father and complains about conditions. Black kids had been complaining to their parents for years and nothing was done.", 
   {}, 
   177307, 
   null, 
   1131418440.0
  ], 
  [
   177824, 
   null, 
   "Sigma", 
   "These union members already have an option to opt out of the political contributions. This legislation would require the union to get permission every year from every union member. They woul spend all their time and money trying to accomplish this.\n\n \n Yes, union members can already opt out. This legislation would require members to opt-in, and require the union to tell each member where the money will go to. Are you trying to tell me that there exists no way for the union to tell each member where their money is going? Total nonsense. My sister is a teacher (so is my mother and grandmother) and let me tell you she gets tons of mail from the union. \n \n It is also true that it will limit the union's power vs. corporations. I would very much like legislation that limits contributions from corporations as well, but this will not limit how much money the union can contribute or what they can contribute to, it will simply allow members more control over whether they allow their dues to go to a certain issue. There will most likely be less money because some members will probably not want any money taken out, but you know what it's their money to do with what they wish. The unions know that they misuse money, and they don't want their members to know that.", 
   {}, 
   177816, 
   null, 
   1131423480.0
  ], 
  [
   177834, 
   null, 
   "Bassman", 
   "Roe v. Wade rests on a right to privacy. Privacy between a woman and her doctor, her husband or whatever. Government has no business in reproductive decisions.\n\n No \"right to privacy\" exists in the constitution. Any literal interpretation can tell you that.\n \nForced busing, maybe. Probably didn't solve much. But people were trying to end discrimination. Like a sociology professor I once had said: How are you going to get inner city schools fixed unless some little white kid comes home to his father and complains about conditions. Black kids had been complaining to their parents for years and nothing was done.\n\n Still, however, school districts have to waste millions in transportation expenditures while they scream for more money.", 
   {}, 
   177817, 
   null, 
   1131427560.0
  ], 
  [
   177840, 
   null, 
   "Sigma", 
   "No \"right to privacy\" exists in the constitution. Any literal interpretation can tell you that.\n\n \n No \"right to life\" exists in the Constitution. Any literal interpretation can tell you that. :)", 
   {}, 
   177834, 
   null, 
   1131430320.0
  ], 
  [
   177849, 
   null, 
   "Steeeeve", 
   "No \"right to life\" exists in the Constitution. Any literal interpretation can tell you that. :)\n\n you have a right to life, liberty, and property...all of which can be taken away", 
   {}, 
   177840, 
   null, 
   1131434280.0
  ], 
  [
   177858, 
   null, 
   "Matthew S", 
   "No \"right to privacy\" exists in the constitution. Any literal interpretation can tell you that.\n \n \n\n \n \n Which is is exactly why we need a privacy amendment so this arguement can no longer be made.", 
   {}, 
   177834, 
   null, 
   1131450120.0
  ], 
  [
   177972, 
   null, 
   "Sigma", 
   "you have a right to life, liberty, and property...all of which can be taken away\n\n \n This is an interpretation of the 14th, but not a literal interpretation. That the gov't cannot take away your life unless they make a law saying they can does not mean you have a right to life.", 
   {}, 
   177849, 
   null, 
   1131490860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Intolerant", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6710-intolerant.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6710, 
  "discussion_files": [
   [
    "28106.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-print.html"
   ], 
   [
    "28107.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-19-print.html"
   ], 
   [
    "28108.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-17-print.html"
   ], 
   [
    "28109.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-15-print.html"
   ], 
   [
    "28110.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-13-print.html"
   ], 
   [
    "28111.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-12-print.html"
   ], 
   [
    "28112.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-10-print.html"
   ], 
   [
    "28113.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-8-print.html"
   ], 
   [
    "28114.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-6-print.html"
   ], 
   [
    "28115.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-4-print.html"
   ], 
   [
    "28116.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-5-print.html"
   ], 
   [
    "28117.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-14-print.html"
   ], 
   [
    "28118.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-7-print.html"
   ], 
   [
    "28119.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-16-print.html"
   ], 
   [
    "28120.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-9-print.html"
   ], 
   [
    "28121.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-18-print.html"
   ], 
   [
    "28122.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-11-print.html"
   ], 
   [
    "28123.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-3-print.html"
   ], 
   [
    "28124.html", 
    "http://www.4forums.com/political/gay-rights-debates/6710-intolerant-2-print.html"
   ]
  ], 
  "identifier": 6710
 }
]