[
 [
  [
   175027, 
   null, 
   "Howard Beale", 
   "Sometimes we can clarify our understanding of something by attempting to define what the opposite of it is. So, I pose the question, \"What is the opposite of God?\"", 
   {
    "post_info": {
     "post_title": "What is the opposite if God?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1130501160.0
  ], 
  [
   175031, 
   null, 
   "Obvious Child", 
   "One answer would be that God cannot have an opposite because everything with actual existence is based in Him.\n \n However, we call cold the opposite of hot where it is merely a privation. On this more colloquial basis, we might say utter nothingness was the opposite of God.", 
   {}, 
   175027, 
   null, 
   1130503320.0
  ], 
  [
   175055, 
   null, 
   "unkerpaulie", 
   "the opposite of god would depend on the definition of god, if god is god, the god's opposite is evil. if god is love, the god's opposite is hate. if god is all-powerful and all wise, then god's opposite is a lack of power and ignorance. \n \n of course, there is no single concise definition of god, so an opposite can never be clearly defined", 
   {}, 
   175031, 
   null, 
   1130511900.0
  ], 
  [
   175060, 
   null, 
   "trebor", 
   "Sometimes we can clarify our understanding of something by attempting to define what the opposite of it is. So, I pose the question, \"What is the opposite of God?\"\n\n \n \n The opposite of 'GOD' is 'DOG'.", 
   {
    "unicode_changes_made": true
   }, 
   175027, 
   null, 
   1130512680.0
  ], 
  [
   175084, 
   null, 
   "simone", 
   "Voila! Now the truth of the teachings of Buddhism hit me squarely in the face!\n \n If the concept of God is totality, everything, etc., the opposite of God must be total nothingness, which a lot of Buddhists are urged to contemplate.\n \n And, when I contemplate the state of nothingness, there is something within me that urges me that here is a space in which my thoughts could create a somethingness, which also is a prompting to Buddhists to contemplate their inner Buddha nature, to confront this state of nothingness that one strives to achieve in order to conduct oneself as a responsible god to create only goodness within that nothingness.\n \n But then one is also confronted with one's human nature which is clouded by illusion and an inability to discern goodness in many cases so that one must be very careful about what one creates in that achieved nothingness.", 
   {}, 
   175060, 
   null, 
   1130520780.0
  ], 
  [
   175125, 
   null, 
   "Howard Beale", 
   "The opposite of 'GOD' is 'DOG'.\nThat may be true for trebor, not God.", 
   {}, 
   175060, 
   null, 
   1130533920.0
  ], 
  [
   175127, 
   null, 
   "Howard Beale", 
   "the opposite of god would depend on the definition of god, if god is god, the god's opposite is evil. if god is love, the god's opposite is hate. if god is all-powerful and all wise, then god's opposite is a lack of power and ignorance. \n \n of course, there is no single concise definition of god, so an opposite can never be clearly defined\nI did not request a concise definition of God; I simply asked what the opposite of God was as a tool to clarify understanding. What you are saying is obvious: If God is white than the opposite of God is black. If God is fat the opposite of God is thin. \n \n Take a stab at what the opposite is and we may get a better picture of your understanding of God.", 
   {}, 
   175055, 
   null, 
   1130534160.0
  ], 
  [
   175135, 
   null, 
   "unkerpaulie", 
   "Take a stab at what the opposite is and we may get a better picture of your understanding of God.\n\n whats the definition of god? the question can not be answered unless god is defined", 
   {}, 
   175127, 
   null, 
   1130534940.0
  ], 
  [
   175138, 
   null, 
   "Howard Beale", 
   "whats the definition of god? the question can not be answered unless god is defined\nI repeat I am talking about an \"understanding of God\", not a \"definition of God\". Saying that you have no understanding of God and therefore no idea of the opposite of God is a valid position. Is that what you are saying?", 
   {
    "unicode_changes_made": true
   }, 
   175135, 
   null, 
   1130535240.0
  ], 
  [
   175139, 
   null, 
   "Tastyfish", 
   "What is the opposite of birds? \n Unless God is paired with something, why would it have an opposite? Generally most things don't have them.", 
   {}, 
   175138, 
   null, 
   1130535360.0
  ], 
  [
   175140, 
   null, 
   "trebor", 
   "That may be true for trebor, not God.\n\n \n No, DOG has not relationship to TREBOR at all.", 
   {}, 
   175125, 
   null, 
   1130535420.0
  ], 
  [
   175183, 
   null, 
   "Howard Beale", 
   "What is the opposite of birds? \n Unless God is paired with something, why would it have an opposite? Generally most things don't have them.\nIs your thought then that God has no opposite?", 
   {}, 
   175139, 
   null, 
   1130550360.0
  ], 
  [
   175184, 
   null, 
   "Howard Beale", 
   "No, DOG has not relationship to TREBOR at all.\nIf the opposite of God is doG, then the opposite of trebor is robert -- that was my play on your thought.", 
   {}, 
   175140, 
   null, 
   1130550480.0
  ], 
  [
   175186, 
   null, 
   "Tastyfish", 
   "Is your thought then that God has no opposite?\n\n Opposite isn't really any fundamental concept of the universe, its just a human concept and a fairly vague one at that. What do you even mean by opposite? Two things of a set that are different in some way, or in every way? Do they even have to be the same thing - light and dark are completely different things yet still considered opposite, blue and red are merely opposiets out of some quirk of biology - how can two different bands of light along an infinite scale be opposite to one another?\n \n Its a completely meaningless question. Why is wednesday both?", 
   {}, 
   175183, 
   null, 
   1130551500.0
  ], 
  [
   175195, 
   null, 
   "Howard Beale", 
   "Tastyfish:\n \n \nOpposite isn't really any fundamental concept of the universe, its just a human concept and a fairly vague one at that. \n Then it seems that we cannot converse about anything \"fundamental\" because words are human conceptualizations and we can only communicate in human concepts.\n \n \nWhat do you even mean by opposite? \n Use a dictionary and chose the meaning that you infer from the question if you are interested in addressing it. If not, don't.\n \n \nTwo things of a set that are different in some way, or in every way? Do they even have to be the same thing - light and dark are completely different things yet still considered opposite, blue and red are merely opposiets out of some quirk of biology - how can two different bands of light along an infinite scale be opposite to one another?\n \n Its a completely meaningless question. Why is wednesday both?\nBecause one cannot grasp or does not care to wrestle with a question does not render the query meaningless. If you bothered to read what I posted, you would see that I said that in trying to envision the opposite of a concept, we often can get a clearer understanding of the concept. \n \n Feel free to say you don't want to or whatever. That's fine.", 
   {
    "unicode_changes_made": true
   }, 
   175186, 
   null, 
   1130552640.0
  ], 
  [
   175200, 
   null, 
   "Tastyfish", 
   "\n \n Then it seems that we cannot converse about anything \"fundamental\" because words are human conceptualizations and we can only communicate in human concepts.\n There are levels of concepts, opposite is a really vague one when just applied generally to whole thing. Nothing in the universe has a complete opposite in such a way that it is different in every single way - an 'opposite' is referring to it having a property that is opposite. I'm not getting at you in a abstract philosophical way where we end up with nothing being anything, but asking you have you really thought about what you are asking and how can you see something like this applying?\n \n \n\n Use a dictionary and chose the meaning that you infer from the question if you are interested in addressing it. If not, don't.\n It could be interesting - but if you aren't going to explain what you are refering to, then how can anyone debate it? If we are all talking about different ideas about a concept we have different ideas about then this could be anything. \n \n\n Because one cannot grasp or does not care to wrestle with a question does not render the query meaningless. If you bothered to read what I posted, you would see that I said that in trying to envision the opposite of a concept, we often can get a clearer understanding of the concept.\n Please give me an example here, I can understand the concept of opposite when applied to a specific property of something - but to a concept or a whole thing makes little sense\n \n Feel free to say you don't want to or whatever. That's fine.[/QUOTE]", 
   {
    "unicode_changes_made": true
   }, 
   175195, 
   null, 
   1130553480.0
  ], 
  [
   175214, 
   null, 
   "Symbiote", 
   "The opposite of a god is man, in the way that a unicorn is the opposite of a horse and a dragon the opposite of a dinosaur.\n \n Understanding what property god does not have (existence), may lead us to a better understanding of what property god does have (fictionality).", 
   {}, 
   175200, 
   null, 
   1130557620.0
  ], 
  [
   175281, 
   null, 
   "Howard Beale", 
   "Tastyfish:\n \n \nThere are levels of concepts, \n Use what ever \"level\" you chose if you care to respond.\n \n \nopposite is a really vague one [concept] when just applied generally to whole thing. \n Reply within the vagueness. \n \n \nNothing in the universe has a complete opposite in such a way that it is different in every single way - an 'opposite' is referring to it having a property that is opposite. \n Elucidate on this using your understanding of God if you care to.\n \n \nI'm not getting at you in a abstract philosophical way where we end up with nothing being anything, but asking you have you really thought about what you are asking and how can you see something like this applying?\nIt is an exercise that sometimes can help clarify our thinking. It is not a \"trick question\".\n \n \nIt could be interesting - but if you aren't going to explain what you are refering to, then how can anyone debate it? \n I asked a simple question, I did not pose a topic for debate. The question is open to your personal interpretation. If you care to address it, address it as you understand it.\n \n \nIf we are all talking about different ideas about a concept we have different ideas about then this could be anything.\nYou are saying that the exercise is a waste of time. I understand your point. I will wait until I mull over the responses to see if it was a waste of time. So many of times people try to express their concept of God, I thought it would help me understand their concept better if they tried to express the opposite of that concept if they could conceive of one - and if they could not, then simply say they could not, or God has no opposite to them, or whatever.\n \n \nPlease give me an example here, \n I don't quite understand what you are requesting an \"example\" of.\n \n \nI can understand the concept of opposite when applied to a specific property of something - but to a concept or a whole thing makes little sense\nAnswer within your understanding.\n \n At least I have come to understand that for you, \"God\" is a \"whole thing\" that you cannot conceive of an opposite for. Can you understand that some people have a different understanding of God (not better, just different) and they can conceive an opposite for that? The question may be a waste of time for you because your concept of God exists outside the realm of opposite and analogous. To a degree, that clarifies for me your understanding of God.", 
   {
    "unicode_changes_made": true
   }, 
   175214, 
   null, 
   1130589780.0
  ], 
  [
   175282, 
   null, 
   "Howard Beale", 
   "The opposite of a god is man, in the way that a unicorn is the opposite of a horse and a dragon the opposite of a dinosaur.\n \n Understanding what property god does not have (existence), may lead us to a better understanding of what property god does have (fictionality).\nYou are clear as a bell. Thanks.", 
   {}, 
   175214, 
   null, 
   1130589840.0
  ], 
  [
   175283, 
   null, 
   "Howard Beale", 
   "whats the definition of god? the question can not be answered unless god is defined\nThe question asks for the opposite of your concept of God, not mine. I am not asking you to prove anything or to \"define\" your concept of God, I am asking for your thoughts on the opposite of your concept of God. In expressing the opposite, sometimes the concept takes on a clarity.", 
   {
    "unicode_changes_made": true
   }, 
   175135, 
   null, 
   1130590080.0
  ], 
  [
   175285, 
   null, 
   "Tastyfish", 
   "I was after an example of a concept that is understood better by understanding its opposite, or similar that you state in the first post.", 
   {}, 
   175283, 
   null, 
   1130590620.0
  ], 
  [
   175286, 
   null, 
   "Howard Beale", 
   "I was after an example of a concept that is understood better by understanding its opposite, or similar that you state in the first post.\nYou miss the point. I might understand your concept better by hearing from you what your idea of the opposite of your concept is. It is as much about your interpretation of the question as anything else, and it is obvious that you are struggling with that.\n \n I do find it interesting that you did not address my responses to the rest of your post.", 
   {}, 
   175285, 
   null, 
   1130591340.0
  ], 
  [
   175296, 
   null, 
   "Tastyfish", 
   "If you want...\n \n\n Use what ever \"level\" you chose if you care to respond.\n\n This isn't talking about a concept of God, its about concepts in general. Opposite is a vague almost undefinable thing when applied to a whole object, however size is not.\n \n\n Reply within the vagueness.\n\n That would end up with just giving a huge list of things that God is not.\n \n\n Elucidate on this using your understanding of God if you care to.\n\n One property of God could be that he is good all the time, therefore the opposite of this would be one that is evil all the time. Its a fairly traditional view that crosses quite a few religions and beleifs. These two dieties may be opposite in their moral beliefs - but if both are also all powerful, mystical beings they have similiarities and are not therefore completely opposite. Surely this all evil thing is just another than that isn't god rather than telling us anything interesting?\n \n\n It is an exercise that sometimes can help clarify our thinking. It is not a \"trick question\".\n Its a meaningless question, asmost every post apart from two has pointed out or made fun of. You arn't going to clarify anything if you refuse to rephrase your question in such a way it makes sense. \n \n\n I asked a simple question, I did not pose a topic for debate. The question is open to your personal interpretation. If you care to address it, address it as you understand it.\n Looks like a post on a debate forum to me...for any meaningful interpretation you need some common ground. If not just do us the courtsy of helping us understand what you mean. Why is asking for an 'opposite' better than asking what is your concept of God? If its that you are trying to get to grips with ask it, if you are trying to explore the nature of those concepts then phrase your question in such a way that it makes sense. At the moment it just seems a poor attempt to go 'I am more philosophical than thou'.\n \n \n\n You are saying that the exercise is a waste of time. I understand your point. I will wait until I mull over the responses to see if it was a waste of time. So many of times people try to express their concept of God, I thought it would help me understand their concept better if they tried to express the opposite of that concept if they could conceive of one - and if they could not, then simply say they could not, or God has no opposite to them, or whatever.\n Its a waste of time because you will not get the replies you want, you have two posts that talk about one aspect that does fit within the question due to a fairly precise meaning of God whilst everything else is critism or 'god = dog' type stuff. If you explain what type of thing you want people to post then you might get their opinions, other than that its probably going to be just me...\n \n \n\n Answer within your understanding.\n \n At least I have come to understand that for you, \"God\" is a \"whole thing\" that you cannot conceive of an opposite for. Can you understand that some people have a different understanding of God (not better, just different) and they can conceive an opposite for that? The question may be a waste of time for you because your concept of God exists outside the realm of opposite and analogous. To a degree, that clarifies for me your understanding of God.\n Doesn't help that to me the concept of 'God' is just one specific example of 'gods'. Is Thor's opposite the same as Yahweh's? Is it the same opposite of 'real' gods like the Pharoahs and later Roman Emperor's.\n If we use only the one defining feature they have then the opposite of gods is things that are not worshipped. Though this is right back at 'things that are not god' again rather than being a concrete thing and I think things which are different is slightly different thing than opposite which is a specific kind of difference.\n Give me some assumptions for the sake of the argument and you might get something better.", 
   {
    "unicode_changes_made": true
   }, 
   175281, 
   null, 
   1130595900.0
  ], 
  [
   175304, 
   null, 
   "Alan Ryan", 
   "Sometimes we can clarify our understanding of something by attempting to define what the opposite of it is. So, I pose the question, \"What is the opposite of God?\"\n\n \n This is a very curious challenge: can you give, by analogy, a case in which a concept is clarified by definition of its opposite ?", 
   {
    "unicode_changes_made": true
   }, 
   175027, 
   null, 
   1130598300.0
  ], 
  [
   175837, 
   null, 
   "unkerpaulie", 
   "I repeat I am talking about an \"understanding of God\", not a \"definition of God\". Saying that you have no understanding of God and therefore no idea of the opposite of God is a valid position. Is that what you are saying?\n\n i understand the question now. its more from a personal perspective\n \n the opposite of god is reality. the opposite of god is challenging questions and open-minded investigation. the opposite of god is the search for truth\n \n maybe youll have a better understanding of my concept of god now", 
   {
    "unicode_changes_made": true
   }, 
   175138, 
   null, 
   1130773320.0
  ], 
  [
   175840, 
   null, 
   "Howard Beale", 
   "This is a very curious challenge: can you give, by analogy, a case in which a concept is clarified by definition of its opposite ?\nWhat I said (perhaps not as clearly as I could have) was: Sometimes we can clarify our understanding of something by attempting to define what the opposite of it is. If I ask \"What is the opposite of the sun?\" At minimum you have to question whether in your opinion there is an opposite of the sun. One person may say that the sun has no opposite. Someone else may say, \"the moon - the largest orb in the sky at night vs. the largest orb in the sky during the day.\" Another might say \"that which bestows darkness\". They have different concepts of the sun and I understand how they understand the sun and how they perceive things.\n \n It is not a big deal. Just an interesting exercise.", 
   {
    "unicode_changes_made": true
   }, 
   175304, 
   null, 
   1130774400.0
  ], 
  [
   175842, 
   null, 
   "Howard Beale", 
   "i understand the question now. its more from a personal perspective\n \n the opposite of god is reality. the opposite of god is challenging questions and open-minded investigation. the opposite of god is the search for truth\n \n maybe youll have a better understanding of my concept of god now\nThanks Unkerpaulie. Did you mean \"search for truth\" or \"truth\"?", 
   {}, 
   175837, 
   null, 
   1130774520.0
  ], 
  [
   175847, 
   null, 
   "doG", 
   "The opposite of 'GOD' is 'DOG'.\n\n How nice of you to notice :)\n \n Wouldn't the opposite of 'god' simply be 'no god'?", 
   {}, 
   175060, 
   null, 
   1130775240.0
  ], 
  [
   175860, 
   null, 
   "trebor", 
   "How nice of you to notice :)\n \n Wouldn't the opposite of 'god' simply be 'no god'?\n\n \n Well, to \"no god\" is to be an atheist.. and atheists are not the opposite of god.", 
   {}, 
   175847, 
   null, 
   1130776320.0
  ], 
  [
   175872, 
   null, 
   "doG", 
   "Well, to \"no god\" is to be an atheist.. and atheists are not the opposite of god.\n\n What I was trying to say though is that there is a god or there isn't, i.e. God vs No God...", 
   {}, 
   175860, 
   null, 
   1130777940.0
  ], 
  [
   175881, 
   null, 
   "unkerpaulie", 
   "Thanks Unkerpaulie. Did you mean \"search for truth\" or \"truth\"?\n\n i meant the \"search for truth\". in my opinion, god is where the quest for answers stop. after youve searched, the answers are usually accompanied by more questions, and the search recycles. at some point, a question comes along where searching for the answer is either too difficult or will raise questions you dont want to address. thats where god comes in", 
   {}, 
   175842, 
   null, 
   1130779380.0
  ], 
  [
   175887, 
   null, 
   "Howard Beale", 
   "unkerpaulie:\n \n I understand what you are saying -- it is clearer to me, anyway. God is an idea or concept that is used by people (no matter what the specifics of that concept may be -- Jesus, YHWH, Allah, The One -- whatever) to hide themselves from \"living the questions\". In other words, God is the blanket answer to what we don't know and what we fear to see.\n \n I agree with that for the most part but I guess I would differentiate between God and how people use the concept of God, but to some degree that is me picking around the edges of the accuracy (in my opinion) of you contention.", 
   {}, 
   175881, 
   null, 
   1130780640.0
  ], 
  [
   175889, 
   null, 
   "Howard Beale", 
   "What I was trying to say though is that there is a god or there isn't, i.e. God vs No God...\nI think that something that does not exist either does not have an opposite or the opposite of it must have the quality of existing...", 
   {}, 
   175872, 
   null, 
   1130780760.0
  ], 
  [
   175900, 
   null, 
   "unkerpaulie", 
   "Well, to \"no god\" is to be an atheist.. and atheists are not the opposite of god.\n\n to \"no god\" is to be an atheist? very bad construct\n \nI think that something that does not exist either does not have an opposite or the opposite of it must have the quality of existing...\n\n i think this is what dog is saying. there are an infinite number of non-existent things, and if any of these things existed, then the would not be non-existent, which is the opposite of what they would be if they were non-existent emoticon_wow lol", 
   {}, 
   175860, 
   null, 
   1130781780.0
  ], 
  [
   175909, 
   null, 
   "doG", 
   "i think this is what dog is saying. \n\n Yeah, I was really just having fun with words. In a similar context I often tell people that there's a 50% chance of rain everyday, either it will or it won't....", 
   {}, 
   175900, 
   null, 
   1130782860.0
  ], 
  [
   175911, 
   null, 
   "trebor", 
   "to \"no god\" is to be an atheist? very bad construct\n \n i think this is what dog is saying. there are an infinite number of non-existent things, and if any of these things existed, then the would not be non-existent, which is the opposite of what they would be if they were non-existent emoticon_wow lol\n\n \n \n It is a pun on that people use about 'KNOW GOD'. \n \n you know 'NO GOD, KNOW PEACE'", 
   {}, 
   175900, 
   null, 
   1130782980.0
  ], 
  [
   175919, 
   null, 
   "Alan Ryan", 
   "Thw wits in this thread seem to be getting the upper hand.", 
   {}, 
   175911, 
   null, 
   1130783580.0
  ], 
  [
   175927, 
   null, 
   "Howard Beale", 
   "I'm going out to buy another bottle of aspirin...", 
   {}, 
   175919, 
   null, 
   1130784240.0
  ], 
  [
   177309, 
   null, 
   "Monster", 
   "Chaos\n \n (Did anyone say that yet?)", 
   {}, 
   175927, 
   null, 
   1131180720.0
  ], 
  [
   177361, 
   null, 
   "Howard Beale", 
   "Chaos\n \n (Did anyone say that yet?)\nI like \"nothing\", but \"chaos\" is real a good one too.", 
   {}, 
   177309, 
   null, 
   1131205560.0
  ], 
  [
   177413, 
   null, 
   "simone", 
   "No! No! No! If when you say \"nothing\" you mean \"nothingness.\"\n \n Chaos is a great swirling mass of somethings that do not make sense--yet.", 
   {}, 
   177361, 
   null, 
   1131218580.0
  ], 
  [
   177427, 
   null, 
   "Howard Beale", 
   "No! No! No! If when you say \"nothing\" you mean \"nothingness.\"\n \n Chaos is a great swirling mass of somethings that do not make sense--yet.\nYes, you are correct, I meant \"nothingness\".", 
   {}, 
   177413, 
   null, 
   1131220980.0
  ], 
  [
   177439, 
   null, 
   "Monster", 
   "Is nothingness organized or unorganized?\n \n Seriously.", 
   {}, 
   177427, 
   null, 
   1131228300.0
  ], 
  [
   177440, 
   null, 
   "Howard Beale", 
   "Is nothingness organized or unorganized?\n \n Seriously.\nI'm looking for the notes on that on my desk, but I can't find them... in fact I can't find my desk... or room... or my house... or my... or... byyyyyyyyyyyeeeeee", 
   {}, 
   177439, 
   null, 
   1131228840.0
  ], 
  [
   177444, 
   null, 
   "Eddie", 
   "Is nothingness organized or unorganized?\n \n Seriously.\n\n \n How can you organise nothing?\n \n Is something unorganised in the absence of \"order\"?", 
   {}, 
   177439, 
   null, 
   1131232140.0
  ], 
  [
   177453, 
   null, 
   "simone", 
   "Is nothingness organized or unorganized?\n \n Seriously.\nMonster! Slap! Slap! You know you are being a bit of a smartA** quite on purpose.\n \n If there is nothing there to organize or to be unorganized, how can nothingness have the quality of being either \"organized\" or \"unorganized\"?", 
   {}, 
   177439, 
   null, 
   1131241680.0
  ], 
  [
   177670, 
   null, 
   "unkerpaulie", 
   "How can you organise nothing?\n \n Is something unorganised in the absence of \"order\"?\n\n so nothing is neither orderly nor chaotic. its just absent", 
   {}, 
   177444, 
   null, 
   1131379680.0
  ], 
  [
   177686, 
   null, 
   "simone", 
   "Nothingness can have no qualities.", 
   {}, 
   177670, 
   null, 
   1131386760.0
  ], 
  [
   179187, 
   null, 
   "Monster", 
   "A still pool of water with out ripples.\n \n You toss a stone in to the pool of water and the surface becomes rippled. \n \n Increasingly complex patters form as the ripples reflect back in from the edges of the pool and cross over themselves. \n \n Which is most chaotic?", 
   {}, 
   177686, 
   null, 
   1131958440.0
  ], 
  [
   179188, 
   null, 
   "Monster", 
   "Monster! Slap! Slap!\n\n I&#8217;m sorry, I think may have enjoyed that a little to much! \n May I have another? \n This time on my bottom please, I&#8217;ve been a very very naughty boy!", 
   {}, 
   177453, 
   null, 
   1131959820.0
  ], 
  [
   179206, 
   null, 
   "simone", 
   "My dear lad, your emotions are too, too chaotic. Still them!", 
   {}, 
   179188, 
   null, 
   1131981180.0
  ], 
  [
   179370, 
   null, 
   "Monster", 
   "Dear Lass, complexity oft presumed chaos order oft assumed simplicity, but I won't fuss.\n Is leor nod don eolach!", 
   {
    "unicode_changes_made": true
   }, 
   179206, 
   null, 
   1132018140.0
  ], 
  [
   180393, 
   null, 
   "simone", 
   "Oh dear, you're back again! Obviously I have not beaten you enough!!! Where did I hang my whip and chains?????", 
   {}, 
   179370, 
   null, 
   1132434600.0
  ], 
  [
   183868, 
   null, 
   "John_Chas_Webb", 
   "Sometimes we can clarify our understanding of something by attempting to define what the opposite of it is. So, I pose the question, &#8220;What is the opposite of God?&#8221;\n\n \n The Christian cosmology invented the devil as God's arch-enemy. This was very stupid. The Old Testament reveals that Good and Evil are the two faces of God. Which face God shows to you depends on what face YOU reveal to God.\n \n In metaphysics, the opposite of God is 'self'. Get free of 'self' and all of its ridiculous preferences and machinations (Zen Master) and what you are left with is God as a creative energy that flows through you without interference from that miserable little 'self' ! \n \n Christ advocates love as the tool to erase the little self. Christianity provides only one of many methods to accomplish 'liberation' from 'the beast'.", 
   {}, 
   175027, 
   null, 
   1133994300.0
  ], 
  [
   183909, 
   null, 
   "Easyrider", 
   " The Christian cosmology invented the devil as God's arch-enemy. This was very stupid.\n\n \n Ever read Job chapter 1 (etc.) in the Tanakh? Your boy Satan is right there and that's over 1,000 years before Christianity.\n \n \n \n Christ advocates love as the tool to erase the little self. Christianity provides only one of many methods to accomplish 'liberation' from 'the beast'.\n\n \n Christ is the only way to salvation (John 14:6, Acts 4:12, etc.).", 
   {}, 
   183868, 
   null, 
   1134001740.0
  ], 
  [
   183915, 
   null, 
   "trebor", 
   "Ever read Job chapter 1 (etc.) in the Tanakh? Your boy Satan is right there and that's over 1,000 years before Christianity.\n \n\n \n The concept of Satan in the Tanakh is quite different than the concept of Satan in the Christian religion. This has been pointed out to you before. I guess you are a slow learner.", 
   {}, 
   183909, 
   null, 
   1134004200.0
  ], 
  [
   183931, 
   null, 
   "Howard Beale", 
   "The Christian cosmology invented the devil as God's arch-enemy. This was very stupid. The Old Testament reveals that Good and Evil are the two faces of God. Which face God shows to you depends on what face YOU reveal to God.\nHi John Chas Webb!\n \n Welcome!\n \n My first question to you: Do you mind being addressed as JCW? If so let me know.\n \n \nThe Christian cosmology invented the devil as God's arch-enemy. This was very stupid. The Old Testament reveals that Good and Evil are the two faces of God. Which face God shows to you depends on what face YOU reveal to God.\nIn Genesis, God finishes his creation, looks at it and says, \"It is good.\" Nowhere is there an account of the creation of Satan or an evil force. \n \n \nIn metaphysics, the opposite of God is 'self'. Get free of 'self' and all of its ridiculous preferences and machinations (Zen Master) and what you are left with is God as a creative energy that flows through you without interference from that miserable little 'self' ! \nThank you for that thought. There is a lot of truth in it. \n \n Christ advocates love as the tool to erase the little self. Christianity provides only one of many methods to accomplish 'liberation' from 'the beast'.\n \n Thy will, not my will.", 
   {
    "unicode_changes_made": true
   }, 
   183868, 
   null, 
   1134007860.0
  ], 
  [
   183985, 
   null, 
   "Easyrider", 
   "The concept of Satan in the Tanakh is quite different than the concept of Satan in the Christian religion. This has been pointed out to you before. I guess you are a slow learner.\n\n \n This is a howl coming from the one who doesn't even have a clue that Jesus is the Jewish Messiah. You might go visit a Messianic synagogue and try your revisionist folly on them. They'll eat you alive.", 
   {}, 
   183915, 
   null, 
   1134049740.0
  ], 
  [
   183988, 
   null, 
   "trebor", 
   "This is a howl coming from the one who doesn't even have a clue that Jesus is the Jewish Messiah. You might go visit a Messianic synagogue and try your revisionist folly on them. They'll eat you alive.\n\n \n \n Tisk tisk tisk. You know, I have seen more CHristians that have gone to Messanic synagugues and then rejected the 'messiahship' of Jesus than vise versa.\n \n Let's face it, you don't understand Judiasm.. and you don't understand the concept of the Messiah from the Jewish point of view.", 
   {}, 
   183985, 
   null, 
   1134051600.0
  ], 
  [
   183997, 
   null, 
   "Obvious Child", 
   "The Christian cosmology invented the devil as God's arch-enemy. This was very stupid. The Old Testament reveals that Good and Evil are the two faces of God. Which face God shows to you depends on what face YOU reveal to God.\nThe idea of dualism of good and evil as two seperate forces preceded Christianity in other mystery religions\n \n But you may have a point: Satan was the servant of the LORD in at least most of the OT (particularly Job, despite EZ), and there is at least one major scriptural base for your point:\n 'I make peace, and create evil: I the LORD do all these things.' Isaiah 45:7", 
   {}, 
   183868, 
   null, 
   1134054240.0
  ], 
  [
   184106, 
   null, 
   "Easyrider", 
   "The idea of dualism of good and evil as two seperate forces preceded Christianity in other mystery religions\n \n But you may have a point: Satan was the servant of the LORD in at least most of the OT (particularly Job, despite EZ), and there is at least one major scriptural base for your point:'I make peace, and create evil: I the LORD do all these things.' Isaiah 45:7\n\n \n When was Satan a POSITIVE (good) servant of the Lord? \n \n p.s. A proper understanding of Isaiah 45:7 (\"...create evil..\") is to bring calamity (according to the guidelines of Deuteronomy chapter 28). If people are going to sow evil / calamity, then that's what they are going to reap.", 
   {}, 
   183997, 
   null, 
   1134089700.0
  ], 
  [
   184112, 
   null, 
   "trebor", 
   "When was Satan a POSITIVE (good) servant of the Lord? \n \n p.s. A proper understanding of Isaiah 45:7 (\"...create evil..\") is to bring calamity (according to the guidelines of Deuteronomy chapter 28). If people are going to sow evil / calamity, then that's what they are going to reap.\n\n \n \n The word used of 'Evil' is the exact same word that is in Genesis to describe the tree of Knowledge of Good and Evil. This is not by chance IMO. \n \n However, I am sure you will deny the truth.", 
   {}, 
   184106, 
   null, 
   1134091440.0
  ], 
  [
   184128, 
   null, 
   "Howard Beale", 
   "The idea of dualism of good and evil as two seperate forces preceded Christianity in other mystery religions\n \n But you may have a point: Satan was the servant of the LORD in at least most of the OT (particularly Job, despite EZ), and there is at least one major scriptural base for your point:\n 'I make peace, and create evil: I the LORD do all these things.' Isaiah 45:7\nThe brilliance of Moses is that the account of the creation attempts to dispel this notion of duality. When God had finished his creation on the sixth day, God looked at all he created and said it is good. He looked at all he created and said it is good.\n \n Man was expelled from the Garden of Eden when he ate from The Tree of Knowledge of Good and Evil. Man separates himself from paradise and from God when he comes to believe that there is another power in the universe: evil. There is no other power in the universe because all God created is good. It is a stunning metaphysical statement and one that is still not accepted today.", 
   {}, 
   183997, 
   null, 
   1134096000.0
  ], 
  [
   184150, 
   null, 
   "Easyrider", 
   "The word used of 'Evil' is the exact same word that is in Genesis to describe the tree of Knowledge of Good and Evil. This is not by chance IMO. However, I am sure you will deny the truth.\n\n \n Why should I deny the truth? It is the same word. But any evil / calamities that came upon the Old Testament Jews as a group was because they violated God's commandments for obedience in Deuteronomy Chapter 28. \n \n So unless you want to say your own God is an evil God then go take a nap.", 
   {}, 
   184112, 
   null, 
   1134101220.0
  ], 
  [
   184154, 
   null, 
   "Easyrider", 
   "And by the way, Trebor, Satan is doing the exact same thing in Job chapter 1 (trying to get Job to curse [turn against] God) that Satan tries in the New Testament. So your sophomoric argument that \"The concept of Satan in the Tanakh is quite different than the concept of Satan in the Christian religion,\" already has a major chink in its armor.\n \n Jesus is Lord!", 
   {}, 
   184150, 
   null, 
   1134101460.0
  ], 
  [
   184192, 
   null, 
   "trebor", 
   "And by the way, Trebor, Satan is doing the exact same thing in Job chapter 1 (trying to get Job to curse [turn against] God) that Satan tries in the New Testament. So your sophomoric argument that \"The concept of Satan in the Tanakh is quite different than the concept of Satan in the Christian religion,\" already has a major chink in its armor.\n \n Jesus is Lord!\n\n \n \n Tisk tisk tisk.. reading Job through Christian assumptions.\n \n I have mentioned the difference before. All I got from you was snotty remarks. I gave some rabbitical sources. You gave platatudes, and out of context remarks.", 
   {}, 
   184154, 
   null, 
   1134108300.0
  ], 
  [
   184226, 
   null, 
   "Obvious Child", 
   "When was Satan a POSITIVE (good) servant of the Lord? \nNot positive from our POV: he was the accuser of mankind. But the accuser has a place in every courtroom.\n \n \np.s. A proper understanding of Isaiah 45:7 (\"...create evil..\") is to bring calamity (according to the guidelines of Deuteronomy chapter 28). If people are going to sow evil / calamity, then that's what they are going to reap.\nTrebor has pointed out this is an entirely selective translation. Do you talk of the Tree of Knowledge of Good and Calamity?\n \n Also, it says God 'creates' evil, not that he allows the evil people sow to flourish. Don't try and shift the emphasis and make God passive: the whole point of this passage is stressing God's might, not his passivity.", 
   {}, 
   184106, 
   null, 
   1134129180.0
  ], 
  [
   184442, 
   null, 
   "Easyrider", 
   "Tisk tisk tisk.. reading Job through Christian assumptions.\n \n I have mentioned the difference before. All I got from you was snotty remarks. I gave some rabbitical sources. You gave platatudes, and out of context remarks.\n\n \n Once again, Satan is the accuser of man in Zechariah 3:1-2, and the Lord rebukes him, and instead of listening to your soul-brother Satan, he grants salvation. Just like in the New Testament.\n \n Once again, you lose. Go print that in one of your rabbinic rags.", 
   {}, 
   184192, 
   null, 
   1134240180.0
  ], 
  [
   184445, 
   null, 
   "Howard Beale", 
   "Once again, Satan is the accuser of man in Zechariah 3:1-2, and the Lord rebukes him, and instead of listening to your soul-brother Satan, he grants salvation. Just like in the New Testament.\n \n Once again, you lose. Go print that in one of your rabbinic rags.\nIf after he created the universe, \"God looked at all he created and said it is good.\" Who created Satan?", 
   {}, 
   184442, 
   null, 
   1134240780.0
  ], 
  [
   184449, 
   null, 
   "Easyrider", 
   "If after he created the universe, \"God looked at all he created and said it is good.\" Who created Satan?\n\n \n God did, but he didn't create him to sow evil or rebel against him. That was Satan's idea.\n \n You need to understand God creates beings with free will and the right to do good or evil.", 
   {}, 
   184445, 
   null, 
   1134241080.0
  ], 
  [
   184450, 
   null, 
   "Howard Beale", 
   "God did, but he didn't create him to sow evil or rebel against him. That was Satan's idea.\n \n You need to understand God creates beings with free will and the right to do good or evil.\nI can't find the part where God creates Satan in my Bible. What verses are you referring to?", 
   {}, 
   184449, 
   null, 
   1134241200.0
  ], 
  [
   184535, 
   null, 
   "Orion", 
   "On the subject of Satan, Elaine Pagels, in The Origin of Satan, Random House Pub. treats in considerable detail the evolution of Satan within Judeo/Christian literature. For example, she notes that the Hebrew root stn translates to \"one who opposes, obstructs, or acts as adversary\", not necessarily a bad thing. Satan, then, was any one of the angels sent by God for the specific purpose of blocking or obstructing human activity. Thus, they were considered to be God's obedient servants. The book of Numbers, chap. 22, illustrates this: Balaam sets out on a journey and is confronted by an angel who proceeds to block Balaam's path...\n \n Nu 22:22 And God's anger was kindled because he went: and the angel of the LORD stood in the way for an adversary against him.\n \n Or consider the book of Job. The following is taken from the KJV. In the Jewish version, substitute \"Adversary\" for \"Satan\", who has now become a single individual...\n \n Job 1:6-8 Now there was a day when the sons of God came to present themselves before the LORD, and Satan came also among them. And the LORD said unto Satan, Whence comest thou? Then Satan answered the LORD, and said, From going to and fro in the earth, and from walking up and down in it. And the LORD said unto Satan, Hast thou considered my servant Job, that there is none like him in the earth, a perfect and an upright man, one that feareth God, and escheweth evil?\n \n Satan responds that Job has resaon to praise God given that God has been good to Job with regard to material blessings. God then allows Satan to test Job's faith by visiting misery upon him. Thus, God and Satan enter into a gentlemen's bet concerning Job. Satan is not yet a bad guy. That transformation comes about in later Jewish writings and, of course, in Christian writings.", 
   {}, 
   184450, 
   null, 
   1134271860.0
  ], 
  [
   184675, 
   null, 
   "John_Chas_Webb", 
   "Hi John Chas Webb!\n \n Welcome!\n \n My first question to you: Do you mind being addressed as JCW? If so let me know.\n \n In Genesis, God finishes his creation, looks at it and says, &#8220;It is good.&#8221; Nowhere is there an account of the creation of Satan or an evil force. \n \n Thank you for that thought. There is a lot of truth in it. \n \n Christ advocates love as the tool to erase the little self. Christianity provides only one of many methods to accomplish 'liberation' from 'the beast'.\n \n Thy will, not my will.\n\n \n Hello Howard!\n \n \"JCW\" (my initials) is fine for a by-line. Thank you. \n \n Genesis, in a way, does speak to (in symbol) the emergence of an \"evil\" cosmology. As you mentioned, God created everything (every thing) and 'saw that it (they) was 'good'. \n God then admonished Adam and Eve to not taste of the knowledge of 'good AND EVIL' because the knowledge of both halves of the complete cosmology would introduce death (and death producing machinations) into the exclusively good context. \n So, death was first introduced by Adam and Eve's disregard (disobedience) of God's counsel. \n It is my understanding that much of the Old Testament states (interpreted) that Good and Evil are the two faces of God. Kind of like a parent telling a child, \"Don't make me have to kick your behind\". \n \n JCW", 
   {}, 
   183931, 
   null, 
   1134385080.0
  ], 
  [
   184702, 
   null, 
   "Howard Beale", 
   "It is my understanding that much of the Old Testament states (interpreted) that Good and Evil are the two faces of God. Kind of like a parent telling a child, \"Don't make me have to kick your behind\".\nYes, I am aware of that interpretation, however there are others and since that one has to stick something in (the two faces of God) to explain the creation of evil, I am not really satisfied with it. Another interpretation explains it this way (simplistically, granted):\n All God created is good.\n Man cannot understand creation as God does.\n Man ate from the Tree of Knowledge of Good and Evil and \"his eyes were opened\". He saw and divided creation (in his own mind) into two powers: the power of good and the power of evil - when there is only power: the power of good. Man took onto himself the mantle of a judge and judgment is God's alone. Man cannot understand the trajectory of creation but deludes himself into thinking he can. A consequence of believing in two powers is being thrown out of the Garden of Eden. This interpretation connects much more clearly with the later teachings of Jesus: \"Judge not lest you be judged.\" \"Unless you be like a child you cannot enter the Kingdom of Heaven.\" And most clearly, \"Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you;\" Then he tells us why: \"That ye may be the children of your Father which is in heaven: for he maketh his sun to rise on the evil and on the good, and sendeth rain on the just and on the unjust.\" God does not divide his creation into two camps; he sends the rain and sun onto all his creation which is good. He is encouraging us to \"Be perfect like your Father in Heaven.\"\n \n To me it is a most fascinating and uplifting inderstanding.", 
   {
    "unicode_changes_made": true
   }, 
   184675, 
   null, 
   1134403140.0
  ], 
  [
   184773, 
   null, 
   "nocturnal09", 
   "this may seem funny to a lot of you, but technically i'm catholic, but i seriously and strongly disagree with many of the church's laws/rules/opinions. So i independently decided to become an atheist and i don't accept communion or accept the Church's rights in any way. Yeah, its kinda ironic. \n \n God has an opposite, and that opposite is Satan. Even though God created the devil he still knew that he would choose to ignore the rights of God and to not worship him. God understood that by creating Satan he was not only creating a rebellion but he was creating his own enemy. Someone that he understood would try to \"over-throw\" him. No matter who you are, you will always have an enemy or someone who dislikes you or the choices you make. \n \n Thats something you can't avoid. People, not matter what kind of thing you do, no matter how many opinions you try to please or to oblige to...u can't.", 
   {
    "post_info": {
     "post_title": "catholic here"
    }
   }, 
   175195, 
   null, 
   1134420540.0
  ], 
  [
   184810, 
   null, 
   "Easyrider", 
   "this may seem funny to a lot of you, but technically i'm catholic, but i seriously and strongly disagree with many of the church's laws/rules/opinions. So i independently decided to become an atheist and i don't accept communion or accept the Church's rights in any way.\n\n \n Why didn't you try to become a Biblical Christian instead if you found some of the Catholic doctrines contrary to Scripture? That's what a lot of Catholics have done.", 
   {}, 
   184773, 
   null, 
   1134431340.0
  ], 
  [
   184845, 
   null, 
   "AnneleizeWho?", 
   "Why didn't you try to become a Biblical Christian instead if you found some of the Catholic doctrines contrary to Scripture? That's what a lot of Catholics have done.\n\n \n emoticon_xhoho !\n \n :)", 
   {}, 
   184810, 
   null, 
   1134440700.0
  ], 
  [
   184855, 
   null, 
   "Easyrider", 
   "Hi, Sunshine! Hope you're doing good. Merry Christmas and Happy New Year!!", 
   {}, 
   184845, 
   null, 
   1134445740.0
  ], 
  [
   184873, 
   null, 
   "AnneleizeWho?", 
   "Hi, Sunshine! Hope you're doing good. Merry Christmas and Happy New Year!!\n\n \n Pete!\n \n I have been well for the most part . . .\n \n My grandbaby is well on the way. Rachel is a beautiful mommy. I'm so excited about having a little on on the way :nod \n \n Merry Christmas and Happy New year to you and yours too!\n \n I remain confident of this, that he who began a good work in me will carry it on to completion until the day of Christ Jesus. (Philippians 1:6)\n \n \n :)", 
   {}, 
   184855, 
   null, 
   1134447900.0
  ], 
  [
   184890, 
   null, 
   "Easyrider", 
   "Pete!\n \n I have been well for the most part . . .\n \n My grandbaby is well on the way. Rachel is a beautiful mommy. I'm so excited about having a little on on the way :nod \n \n Merry Christmas and Happy New year to you and yours too!\n \n I remain confident of this, that he who began a good work in me will carry it on to completion until the day of Christ Jesus. (Philippians 1:6)\n \n \n :)\n\n \n Amen to all that! You and yours have a great resurrection day coming!! :)", 
   {}, 
   184873, 
   null, 
   1134451020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is the opposite if God?", 
  "url": "http://www.4forums.com/political/religion-debates/6715-what-opposite-if-god.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 6715, 
  "discussion_files": [
   [
    "24748.html", 
    "http://www.4forums.com/political/religion-debates/6715-what-opposite-if-god-print.html"
   ], 
   [
    "24749.html", 
    "http://www.4forums.com/political/religion-debates/6715-what-opposite-if-god-6-print.html"
   ], 
   [
    "24750.html", 
    "http://www.4forums.com/political/religion-debates/6715-what-opposite-if-god-4-print.html"
   ], 
   [
    "24751.html", 
    "http://www.4forums.com/political/religion-debates/6715-what-opposite-if-god-5-print.html"
   ], 
   [
    "24752.html", 
    "http://www.4forums.com/political/religion-debates/6715-what-opposite-if-god-3-print.html"
   ], 
   [
    "24753.html", 
    "http://www.4forums.com/political/religion-debates/6715-what-opposite-if-god-2-print.html"
   ]
  ], 
  "identifier": 6715
 }
]