[
 [
  [
   175578, 
   null, 
   "billsco", 
   "Prince Charles is set to visit the U.S. this week. Purportedly, he will discuss with President Bush more favorable aspects of Islam.\n \n This is a good time to inquire about Monarchies. What is it about them that you like or dislike? Are you in favor of eliminating the tradition?\n \n In theory, I thought the Crown seldom \"lowered\" itself by getting involved in politics. Yet, the topic of Islam, which Prince Charles has thought important enough to discuss, is fraught with political shoals to run aground on. Will the British Monarchy become more politically active?", 
   {
    "post_info": {
     "post_title": "Royalty"
    }
   }, 
   null, 
   null, 
   1130693460.0
  ], 
  [
   175621, 
   null, 
   "Matthew S", 
   "Prince Charles is set to visit the U.S. this week. Purportedly, he will discuss with President Bush more favorable aspects of Islam.\n \n This is a good time to inquire about Monarchies. What is it about them that you like or dislike? Are you in favor of eliminating the tradition?\n \n In theory, I thought the Crown seldom \"lowered\" itself by getting involved in politics. Yet, the topic of Islam, which Prince Charles has thought important enough to discuss, is fraught with political shoals to run aground on. Will the British Monarchy become more politically active?\n\n \n \n I wouldn't consider the \"favorable aspects of Islam\" a political postition. As King he will have to look out for the welfare of his people and if Muslims are becoming a larger segment of Brittish society then I think it is justified.", 
   {}, 
   175578, 
   null, 
   1130702760.0
  ], 
  [
   175682, 
   null, 
   "Master_Shake", 
   "As far as I can see, maybe you Brits out there might think differently and explain, the monarchy is absurd and pointless.", 
   {}, 
   175621, 
   null, 
   1130715000.0
  ], 
  [
   175692, 
   null, 
   "Jo Bennett", 
   "The monarchy is archaic and unjust, but it is not pointless. It provides us with a group of useful XXXXXX who can go around shaking hands and waving whilst the PM gets on with running the country. They cost relatively little (as I recall the transport budget for the entire Royal family is less than the cost of running airforce 1 alone), and they provide some continuity in times of political turmoil. Their role does need tidying up a little, the separation of crown from government needs to be put in writing.", 
   {}, 
   175682, 
   null, 
   1130717580.0
  ], 
  [
   175695, 
   null, 
   "Big_Bear_Scot", 
   "I would rather have an elected President like they have over in the Republic of Ireland, from what I gather the President of Ireland has a largely ceremonial role and does not have much actual political power. \n \n I would guess a President and immediate Family would cost less than the Royals with their extended family. \n \n Also I may add if we are going to keep the Royals we should stop paying for the minor Royals such as Princess Michael of Kent, these people are just a drain of Tax payers money and they don't do anything to promote the Image of the UK abroad.", 
   {}, 
   175692, 
   null, 
   1130719020.0
  ], 
  [
   175728, 
   null, 
   "georged", 
   "The monarchy is archaic and unjust, but it is not pointless. It provides us with a group of useful XXXXXX who can go around shaking hands and waving whilst the PM gets on with running the country. They cost relatively little (as I recall the transport budget for the entire Royal family is less than the cost of running airforce 1 alone), and they provide some continuity in times of political turmoil. Their role does need tidying up a little, the separation of crown from government needs to be put in writing.\n\n \n As with most nations having a successful heritage of monarchy, I feel the cultural aspect is a binding quality not easily replaced by self-government. Respect is difficult if not impossible for generally self-serving politicians to maintain in all forms of democracy.", 
   {}, 
   175692, 
   null, 
   1130731560.0
  ], 
  [
   175821, 
   null, 
   "Alan Ryan", 
   "That the monarchy provides some sort of \"continuity\" is a pretext for resisting change. Continuity of what ? Continuity of inherited privilege and patronage ? \n \n Royal expenditure (accounted for in the Civil List) is not negligible: the figure for 2003/2004 was £36.8 million. \n \n Charles is making his trip to America, we are told, to \"represent British interests there\" - the inference being that his visit will somehow encourage Americans to be better disposed towards Britain etc. That's the official PR line. But privately, I suspect, Charles is using this visit to introduce his new wife, Camilla, to her \"royal role\" on the international scene. He wants to win approval and esteem for a woman who might one day be queen of England.\n \n It has been reported that Charles intends giving some advice to Mr Bush on the nuances of handling Muslim truculence: why this or any other President would listen to the preaching of someone who can hardly put his trousers on without help from a flunkey, I'm at a loss to explain. \n \n I should confess here, as if it isn't already obvious, that my political sentiments are profoundly republican. I do not care for the \"mystique\" of royalty. Elected politicians may be venal, self serving, mendacious, and even stupid - but at least in a democracy we can dump them from time to time.", 
   {}, 
   175728, 
   null, 
   1130758680.0
  ], 
  [
   175830, 
   null, 
   "Eddie", 
   "I agree with Mr Ryan on this one. I`d rather have an elected head of state wasting my money than someone who inherited his/her postition. The royals in Sweden are every bit as daft and inbred as the Brittish.", 
   {}, 
   175821, 
   null, 
   1130770380.0
  ], 
  [
   175839, 
   null, 
   "billsco", 
   "I'm surprised by the responses. Not at the present occupants so much, but at the institution itself. Americans like to grumble about our presidents, but defend the office vigorously.\n \n But obviously, we don't have representative posters here. I assume royalty enjoys widespread support domestically. The question becomes, are there any demographic studies that explore the popularity of the monarchy with the amount of education one has?", 
   {}, 
   175830, 
   null, 
   1130774100.0
  ], 
  [
   175876, 
   null, 
   "Tastyfish", 
   "If we are going to have a useless head of state fullfilling purely ceremonial roles then I'd choose a monarch over a President. It would be interesting to see how the 37 million maintainance compares with the money brought in from Tourism...\n \n But anyway, the monarchy has been fairly politically active - particularly Charles though he tends more toward environment things. Be hard to imagine him as King out of his wellies.", 
   {}, 
   175839, 
   null, 
   1130778720.0
  ], 
  [
   175884, 
   null, 
   "Alan Ryan", 
   "If we are going to have a useless head of state fullfilling purely ceremonial roles then I'd choose a monarch over a President. It would be interesting to see how the 37 million maintainance compares with the money brought in from Tourism...\n \n But anyway, the monarchy has been fairly politically active - particularly Charles though he tends more toward environment things. Be hard to imagine him as King out of his wellies.\n\n \n A useless President eventually gets voted out: the monarch inherits his/her \"job\" and no matter how lazy or incompetent, cannot be removed from office - at least not without a political revolution. \n \n You also have to remember that the institution of the British monarchy has a huge baggage of social patronage attached: I'm talking here about the \"honours\" system and all the silly medals given to people who are admitted to orders of an empire that no longer exists etc.", 
   {}, 
   175876, 
   null, 
   1130780400.0
  ], 
  [
   175888, 
   null, 
   "Tastyfish", 
   "You have to try hard to be uesless at purely ceremonial roles, even then it still may be the case that its still worth having the position filled in the traditional way due to the effect it has on tourism. Far as tourism is concerned our main export his history (particularly for international tourists), removing such an large part of that may not be worth the minor inconvience of someone like Prince Phillip", 
   {}, 
   175884, 
   null, 
   1130780700.0
  ], 
  [
   175891, 
   null, 
   "Alan Ryan", 
   "You have to try hard to be uesless at purely ceremonial roles, even then it still may be the case that its still worth having the position filled in the traditional way due to the effect it has on tourism. Far as tourism is concerned our main export his history (particularly for international tourists), removing such an large part of that may not be worth the minor inconvience of someone like Prince Phillip\n\n But the role isn't purely ceremonial: as I explained, it involves patronage.\n \n I don't know whether the much touted \"tourism effect\" really does pay off; but other countries that are more dependent on tourism than we are, seem to manage without a monarchy. For example, Greece, Italy, Switzerland, come to mind.", 
   {}, 
   175888, 
   null, 
   1130781120.0
  ], 
  [
   175897, 
   null, 
   "Tastyfish", 
   "Sorry was going to add that I don't think that it needs to be maintained at the level it is now, though the honors system is really not that different from other medals given out. Pretty sure the US has badges for people that the president gets to pin on them.\n \n As for Tourism, without seeing the figures I wouldn't really know - but Greece has nice whether and Italy and Switzerland have both skiing and for the later a lot of famous history seperate from the monarchy. You could argue that the Vatican performs a very similar role as well.", 
   {}, 
   175891, 
   null, 
   1130781720.0
  ], 
  [
   175908, 
   null, 
   "Alan Ryan", 
   "I think differences in attitudes to the British monarchy ultimately boil down to political preferences. I've already made it clear that I'd prefer a constitution derived from republican principles. I don't want to be \"represented\" by a dilettante \"prince\" who I'd never vote for even if he abdicated and stood for election as Mr Charlie Windsor-Wales.", 
   {}, 
   175897, 
   null, 
   1130782860.0
  ], 
  [
   176007, 
   null, 
   "Obvious Child", 
   "That the monarchy provides some sort of \"continuity\" is a pretext for resisting change. Continuity of what ? Continuity of inherited privilege and patronage ? \n \n Royal expenditure (accounted for in the Civil List) is not negligible: the figure for 2003/2004 was £36.8 million. \n \n Charles is making his trip to America, we are told, to \"represent British interests there\" - the inference being that his visit will somehow encourage Americans to be better disposed towards Britain etc. That's the official PR line. But privately, I suspect, Charles is using this visit to introduce his new wife, Camilla, to her \"royal role\" on the international scene. He wants to win approval and esteem for a woman who might one day be queen of England.\n \n It has been reported that Charles intends giving some advice to Mr Bush on the nuances of handling Muslim truculence: why this or any other President would listen to the preaching of someone who can hardly put his trousers on without help from a flunkey, I'm at a loss to explain. \n \n I should confess here, as if it isn't already obvious, that my political sentiments are profoundly republican. I do not care for the \"mystique\" of royalty. Elected politicians may be venal, self serving, mendacious, and even stupid - but at least in a democracy we can dump them from time to time.\nI am a moderate republican and certainky have no respect for Prince Charles. But the Civil List may include money that would be spent on entertaining foreign dignitaries anyway.\n \n As for the patronage: the recipients are decided by various groups, including political parties, and some kinda commitee.", 
   {}, 
   175821, 
   null, 
   1130795100.0
  ], 
  [
   176030, 
   null, 
   "Jo Bennett", 
   "I work on the basis that if we have an elected president then we are responsible for what he does, even if we voted for someone else. With a monarchy at least we can blame the inbreeding, rather than the stupidity of our countrymen, when they do something stupid *cough*princephilip*cough*.", 
   {}, 
   176007, 
   null, 
   1130800260.0
  ], 
  [
   176032, 
   null, 
   "Tastyfish", 
   "Also from looking at the US, I think its good we seperate the Head of State and the Prime Minister. I really wouldn't want to see the fanatical support that presidents and kings seem to get applied to a politician. Least our equivalent of the die-hard, he can do no wrong Bush supporters are distracted from real politics by commemorative plates.\n \n How much more/less does it cost to maintain the US president over the prime minister and the Queen out of curiousity? I have less problems with supporting a historic head of state than a random one seeing as they don't actually do anything. If it were done by lottery it could be interesting though.", 
   {}, 
   176030, 
   null, 
   1130800860.0
  ], 
  [
   176062, 
   null, 
   "billsco", 
   "We had \"\"Queen For a Day\" on early 60's television. She got to wear a tiara and usually won a washing machine or something. What does a queen need a washing machine for?", 
   {}, 
   176032, 
   null, 
   1130805360.0
  ], 
  [
   176065, 
   null, 
   "Tastyfish", 
   "We had \"\"Queen For a Day\" on early 60's television. She got to wear a tiara and usually won a washing machine or something. What does a queen need a washing machine for?\n\n Weetabix are by royal appointment, so who knows, she may do her own socks when the servants have the day off.", 
   {}, 
   176062, 
   null, 
   1130805720.0
  ], 
  [
   176147, 
   null, 
   "sanguinekane", 
   "I'll probabaly get yelled at for this, but I support the institution and continuation of a monarchy. It seves to create a unique heritage and culture, and CAN provide strong figures in times of crisis. The revenue lost from abolishing the tourism aspect of royalty would also significantly damage the English, or any other economy that does so in my opinion. I'm not saying they should have full political power, but they should exist.", 
   {}, 
   176065, 
   null, 
   1130814960.0
  ], 
  [
   176199, 
   null, 
   "Alan Ryan", 
   "Weetabix are by royal appointment. \n\n Years ago, I used to live in Windsor. The town then had a number of shops that displayed the royal coat of arms in their windows with \"By Appointment to Her Majesty the Queen\". (One shop had be appointed as the royal wigmaker). These shops, including a grocery store, sold expensive stuff and had a certain snob appeal.\n \n There are fewer shops there now that boast this \"by appointment\" nonsense: the Queen, like everybody else these days, shops at Tesco.", 
   {}, 
   176065, 
   null, 
   1130840700.0
  ], 
  [
   176211, 
   null, 
   "Obvious Child", 
   "Also from looking at the US, I think its good we seperate the Head of State and the Prime Minister. I really wouldn't want to see the fanatical support that presidents and kings seem to get applied to a politician. Least our equivalent of the die-hard, he can do no wrong Bush supporters are distracted from real politics by commemorative plates.\n+1\n \n The 'we have to support him, he leads our country' is only really an issue for the PM in times of national crisis: i.e. the July 7th attacks. Americans seem to have more of a feeling that their President directly reflects on them and therefore are less likely to think badly of him.\n \n \n As for the idea of choosing by lottery: you're more likely to get some complete nutjob who tries to actually use their powers. At least the Royal Family have a consciousness of their role, and an understanding that if they tried to use powers they would probably lose the priveliges for their whole family, or at least themselves.", 
   {}, 
   176032, 
   null, 
   1130853300.0
  ], 
  [
   176421, 
   null, 
   "billsco", 
   "What role did the royal family play after the July 7th bombings? Did you ever think of the Queen Mum when reflecting on the events?\n \n Whenever disaster strikes, I look forward to hearing from our president.", 
   {}, 
   176211, 
   null, 
   1130908140.0
  ], 
  [
   176453, 
   null, 
   "Alan Ryan", 
   "What role did the royal family play after the July 7th bombings? Did you ever think of the Queen Mum when reflecting on the events?\n \n Whenever disaster strikes, I look forward to hearing from our president.\n\n \n They played a sympathetic role - visiting the injured in hospital, expressing their revulsion etc. Personally, although I recognised that the 7/7 bombings were an attack on the nation, I did not associate the event with the fate of the monarchy or expect the Queen to console the national grief.\n \n When disaster strikes, it is the prime minister who addresses the nation. The Queen is not a political figure; her role is symbolic. She speaks to the nation, as a rule, only twice a year. At the opening of parliament she reads the Queen's Speech - a statement of the government's policies which has been written for her by someone in the cabinet. She appears on television to give her \"Christmas message\"; this is usually a non-political survey of the year that is passing and a reaffirmation of her confidence in the future of Britain etc.", 
   {}, 
   176421, 
   null, 
   1130928720.0
  ], 
  [
   176458, 
   null, 
   "billsco", 
   "Well, here's today's lead from the Washington Times on the visit:\n \n \"They arrive in Washington today loaded down with a wardrobe of 50 dresses (for her) and double-breasted tweeds, ties and tux (for him); 20 servants; makeup artists; and an entourage of 50 members of the British press at an estimated cost of close to a half-million dollars.\"  \n \n Nothing about how to have happy Islam thoughts yet.", 
   {}, 
   176453, 
   null, 
   1130939040.0
  ], 
  [
   176466, 
   null, 
   "Phunting", 
   "I for one am strongly pro-monarchy. They act as a figurehead for the country, a national symbol that is not only concerned with votes, party backstabbing and other political farces. They bring in far more revenue than they cost us, they act as a living link to the past, a source of stability and unification. So yes, I am in favour!\n \n I didn't think of the Queen Mother after July 7th, why would I? She was long dead. The Queen herself however played an appropriate part in the aftermath.", 
   {}, 
   176458, 
   null, 
   1130942520.0
  ], 
  [
   176494, 
   null, 
   "Obvious Child", 
   "Whenever disaster strikes, I look forward to hearing from our president.\nThe problem with this is that looking to the president for solace and solution means that disaster gives the President too much power: Bush could have achieved little he did without the emotional impact of September the Eleventh. Such events obviously have an impact in all countries, but this emphasises it. I have never heard someone accuse someone else of being 'unpatriotic' for attacking Blair. I have seen that accusation for those who attack Bush.", 
   {}, 
   176421, 
   null, 
   1130951460.0
  ], 
  [
   176497, 
   null, 
   "billsco", 
   "I meant to impart that I look to the presidency in those special times, not specifically to our current President.", 
   {}, 
   176494, 
   null, 
   1130951760.0
  ], 
  [
   176500, 
   null, 
   "Obvious Child", 
   "Yes, but how can you seperate the two? At times of crisis, people tend to be more patriotic: this causes a reasonable sized popularity spurt for any leader who does his job and expresses the public's feelings, like Blair did with the 7/7 attacks. But when they are the figurehead as well, it seems to be risky.", 
   {}, 
   176497, 
   null, 
   1130952000.0
  ], 
  [
   176510, 
   null, 
   "georged", 
   "I meant to impart that I look to the presidency in those special times, not specifically to our current President.\n\n \n You had me worried before that clarification.", 
   {}, 
   176497, 
   null, 
   1130953680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Royalty", 
  "url": "http://www.4forums.com/political/european-politics-economics/6726-royalty.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 6726, 
  "discussion_files": [
   [
    "21115.html", 
    "http://www.4forums.com/political/european-politics-economics/6726-royalty-print.html"
   ], 
   [
    "21116.html", 
    "http://www.4forums.com/political/european-politics-economics/6726-royalty-3-print.html"
   ], 
   [
    "21117.html", 
    "http://www.4forums.com/political/european-politics-economics/6726-royalty-2-print.html"
   ]
  ], 
  "identifier": 6726
 }
]