[
 [
  [
   175617, 
   null, 
   "Matthew S", 
   "My husband and I will be married in windsor this comming June. It will be good that there will be one place in this world that our family will be considered a family. There is nothing the conservatives, republicans, or chistonazis can do to stop or take this license from us. I might just do a twist and sue in Canadian courts to have all marriages preformed in the United States not be recognized. So all those heteros passing into Canada will not be considered married unless married in Canada. Wounldn't that be a hoot.", 
   {
    "post_info": {
     "post_title": "Nothing they can do"
    }
   }, 
   null, 
   null, 
   1130702220.0
  ], 
  [
   175651, 
   null, 
   "jyoshu", 
   "My husband and I will be married in windsor this comming June. It will be good that there will be one place in this world that our family will be considered a family. There is nothing the conservatives, republicans, or chistonazis can do to stop or take this license from us. I might just do a twist and sue in Canadian courts to have all marriages preformed in the United States not be recognized. So all those heteros passing into Canada will not be considered married unless married in Canada. Wounldn't that be a hoot.\n\n \n No one wants to take your \"marriage\" away Matt. It's a free country--no one's going to block your way to any chapel that will marry you. Do your gay thing. But let marriage be marriage--it's a different matter. People just want to keep you from tampering with the institution of marriage.", 
   {}, 
   175617, 
   null, 
   1130709960.0
  ], 
  [
   175661, 
   null, 
   "Kronus", 
   "No one wants to take your \"marriage\" away Matt. It's a free country--no one's going to block your way to any chapel that will marry you. Do your gay thing. But let marriage be marriage--it's a different matter. People just want to keep you from tampering with the institution of marriage.\n\n \n No, just closed minded homophobes. If people were really concerned about marriage, they'd boycott Fox for making it a prize in a reality show. They'd campaign against Vegas for making marriage licenses so trivial to obtain. They'd try to pass laws making divorce illegal. But they don't do that, they've allowed those things to happen for years. It's only when gays want to get married that they get all up in arms about the \"sanctity\" of marriage. Hypocrites.", 
   {}, 
   175651, 
   null, 
   1130710620.0
  ], 
  [
   175667, 
   null, 
   "Steeeeve", 
   "No, just closed minded homophobes. If people were really concerned about marriage, they'd boycott Fox for making it a prize in a reality show. They'd campaign against Vegas for making marriage licenses so trivial to obtain. They'd try to pass laws making divorce illegal. But they don't do that, they've allowed those things to happen for years. It's only when gays want to get married that they get all up in arms about the \"sanctity\" of marriage. Hypocrites.\n\n \n Who's says we aren't against those things you mentioned?", 
   {}, 
   175661, 
   null, 
   1130711340.0
  ], 
  [
   175668, 
   null, 
   "joebrummer", 
   "Who's says we aren't against those things you mentioned?\n\n \n \n Even if you are against those things, you are only talking a clear, expensive and national stance against gays. NO one is starting petitions to stop those things, but they are doing that against gays.", 
   {}, 
   175667, 
   null, 
   1130711580.0
  ], 
  [
   175672, 
   null, 
   "Kronus", 
   "Who's says we aren't against those things you mentioned?\n\n \n Have you done anything about them? Gay marriage has only been an issue for a couple of years, most of the other things I mentioned have been around for decades. Which have you actually done more about, or spoken out against more? I say you've done more in one year to fight gay marriage than you've done to \"save\" marriage from everything else that's assailling it since you were born. Can you truthfully say I'm wrong? If you can't, then you care more about opposing gays then you do about saving marriage, and any claim to the contrary is hypocracy.", 
   {}, 
   175667, 
   null, 
   1130712060.0
  ], 
  [
   175673, 
   null, 
   "Steeeeve", 
   "Even if you are against those things, you are only talking a clear, expensive and national stance against gays. NO one is starting petitions to stop those things, but they are doing that against gays.\n\n \n perhaps you are confusing me and jyoshu with everyone else. I'm not starting petitions to do anything.", 
   {}, 
   175668, 
   null, 
   1130712120.0
  ], 
  [
   175674, 
   null, 
   "Steeeeve", 
   "Have you done anything about them? Gay marriage has only been an issue for a couple of years, most of the other things I mentioned have been around for decades. Which have you actually done more about, or spoken out against more? I say you've done more in one year to fight gay marriage than you've done to \"save\" marriage from everything else that's assailling it since you were born. Can you truthfully say I'm wrong? If you can't, then you care more about opposing gays then you do about saving marriage, and any claim to the contrary is hypocracy.\n\n \n Yeah, I'd say you are wrong. It isn't easy to tell on these forums because we don't have many topics about marriage in vegas.", 
   {}, 
   175672, 
   null, 
   1130712180.0
  ], 
  [
   175687, 
   null, 
   "jyoshu", 
   "Who's says we aren't against those things you mentioned?\n\n \n It's hard to imagine how they can't see that these issues ARE of great concern to many of the same people who oppose gay marriage. Many of us have been opposed to divorce and trivializing marriage for a long time.", 
   {}, 
   175667, 
   null, 
   1130717100.0
  ], 
  [
   175689, 
   null, 
   "Master_Shake", 
   "It isn't easy to tell on these forums because we don't have many topics about marriage in vegas.\n\n Which is exactly the point.", 
   {}, 
   175674, 
   null, 
   1130717340.0
  ], 
  [
   175702, 
   null, 
   "Kronus", 
   "Yeah, I'd say you are wrong. It isn't easy to tell on these forums because we don't have many topics about marriage in vegas.\n\n \n You. Have you done a single thing about any of those things I mentioned? Or anything along that vein? And more importantly, have you done or said as much in all the years of your life about those things as you've done or said about gays getting married in just the last year?", 
   {}, 
   175674, 
   null, 
   1130720880.0
  ], 
  [
   175705, 
   null, 
   "Big_Bear_Scot", 
   "First of all Congrats to Matthew S for taking the plunge may you have many years of happiness together.\n \n I would have to say isn't an indication of how far the Gay Right's movement has got that Gay marriage is now an active issue in many Countries through out the World ?\n \n I think we will probably look back on these days and wonder what all the fuss was about.", 
   {}, 
   175702, 
   null, 
   1130722440.0
  ], 
  [
   175712, 
   null, 
   "Steeeeve", 
   "You. Have you done a single thing about any of those things I mentioned? Or anything along that vein? And more importantly, have you done or said as much in all the years of your life about those things as you've done or said about gays getting married in just the last year?\n\n \n Didn't I answer this already? I have done nothing with regards to petitions or protests or anything on any topic but abortion. I have talked about marriage pretty much equally on all issues depending on whats being talked about at the time. To say \"equally\" is not really a fair statement anyway. I don't record what I do with all my time...but in general I am concerned about marriage overall and I talk about it overall.\n \n \nWhich is exactly the point.\n WEll, I can't really help some things :/ if you wish to talk about marriage in vegas then start a thread and I'll see if I have any comments.", 
   {}, 
   175702, 
   null, 
   1130723580.0
  ], 
  [
   175717, 
   null, 
   "jyoshu", 
   "You. Have you done a single thing about any of those things I mentioned? Or anything along that vein? And more importantly, have you done or said as much in all the years of your life about those things as you've done or said about gays getting married in just the last year?\n\n \n I doubt he's \"done\" anything about gay rights, either. I've never done anything about gay rights myself. What sort of things are you talking about anyway?", 
   {}, 
   175702, 
   null, 
   1130726400.0
  ], 
  [
   175735, 
   null, 
   "Kronus", 
   "I doubt he's \"done\" anything about gay rights, either. I've never done anything about gay rights myself. \n\n Ha!\n \n \nWhat sort of things are you talking about anyway?\n\n \n Things like the dozens, scores (hundreds?) of posts you personally have made here condemning gay marriage. Have you signed any anti-gay marriage petitions? Voted against it? Forwarded e-mails urging people to oppose it? Written your representitives urging them to oppose it?\n \n Have you done any of those to support any other aspect of \"traditional marriage\"?", 
   {}, 
   175717, 
   null, 
   1130732400.0
  ], 
  [
   175775, 
   null, 
   "Steeeeve", 
   "Ha!\n \n \n \n Things like the dozens, scores (hundreds?) of posts you personally have made here condemning gay marriage. Have you signed any anti-gay marriage petitions? Voted against it? Forwarded e-mails urging people to oppose it? Written your representitives urging them to oppose it?\n \n Have you done any of those to support any other aspect of \"traditional marriage\"?\n\n \n No to all of the above. I am not even sure I have made a post condeming gay marriage. Although, my view has always been to get marriage out of government and back into religion where it is sacred.", 
   {}, 
   175735, 
   null, 
   1130737680.0
  ], 
  [
   175814, 
   null, 
   "Master_Shake", 
   " WEll, I can't really help some things :/ if you wish to talk about marriage in vegas then start a thread and I'll see if I have any comments.\n\n The point is, it isn't about someone who doesn't care if people get married in Vegas starting a thread. Why would they? They don't care right? It's about people who are against gay marriage and say they're against all these other things that are real threats to the institution of marriage, but not really caring enough to even start a thread about them, let alon attempt to do anything about them.", 
   {}, 
   175712, 
   null, 
   1130750160.0
  ], 
  [
   175819, 
   null, 
   "Matthew S", 
   "No one wants to take your \"marriage\" away Matt. It's a free country--no one's going to block your way to any chapel that will marry you. Do your gay thing. But let marriage be marriage--it's a different matter. People just want to keep you from tampering with the institution of marriage.\n\n \n \n Oh really the people who where behind the petition drive here in michigan want to deny me marriage, Here I will let the head of the organization that spearheaded the drive explain it in her own words.\n http://www.bpnews.net/bpnews.asp?ID=19408", 
   {}, 
   175651, 
   null, 
   1130753640.0
  ], 
  [
   175843, 
   null, 
   "Steeeeve", 
   "The point is, it isn't about someone who doesn't care if people get married in Vegas starting a thread. Why would they? They don't care right? It's about people who are against gay marriage and say they're against all these other things that are real threats to the institution of marriage, but not really caring enough to even start a thread about them, let alon attempt to do anything about them.\n\n \n well, I can't speak for others, but perhaps I find something else more important then marriage in general.", 
   {}, 
   175814, 
   null, 
   1130774640.0
  ], 
  [
   175851, 
   null, 
   "jyoshu", 
   "Things like the dozens, scores (hundreds?) of posts you personally have made here condemning gay marriage.\n\n \n Like Steeeve said, it's not like they have a forum here for \"divorce\" or \"adultery.\" If you think pro-marriage people are too lopsided in their efforts on these fora toward opposing gay marriage, then appeal to the admin for more marriage-related forums. I can guarantee you that if they had, say, a \"marriage\" forum, there would be plenty, including myself, that would comment regularly on all these issues, not just gay marriage.\n \n I think you're stretching it quite a bit anyway to call posting here (sharing opinions) as a form of \"doing\" something against gay marriage. This is a debate forum--it's expected to have debate on this subject here, and therefore various views.\n \n \nHave you signed any anti-gay marriage petitions? Voted against it? \n\n \n Nope.\n \n \nForwarded e-mails urging people to oppose it? Written your representitives urging them to oppose it?\n\n \n Nope.\n \n \nHave you done any of those to support any other aspect of \"traditional marriage\"?\n\n \n Nope.", 
   {}, 
   175735, 
   null, 
   1130775540.0
  ], 
  [
   175878, 
   null, 
   "emoreno2292", 
   "Please, give me a break.\n \"We didn't say anything because we didn't have any forums to do so in.\"\n Did you notice the general forum? Where you can discuss generally everything?\n And did you also notice a button that allows you to start a new thread?\n So quit moaning here if you're so concerned about the ills marriage has these days and take it over to the general forum.", 
   {}, 
   175851, 
   null, 
   1130779140.0
  ], 
  [
   175894, 
   null, 
   "jyoshu", 
   "Please, give me a break.\n \"We didn't say anything because we didn't have any forums to do so in.\"\n Did you notice the general forum? Where you can discuss generally everything?\n And did you also notice a button that allows you to start a new thread?\n So quit moaning here if you're so concerned about the ills marriage has these days and take it over to the general forum.\n\n \n I'd say the one's \"moaning\" are you guys who are whining about having people post about gay marriage. If you really want other marriage issues discussed, start it up. I know I'll give you my opinions.", 
   {}, 
   175878, 
   null, 
   1130781660.0
  ], 
  [
   175920, 
   null, 
   "Kronus", 
   "I'd say the one's \"moaning\" are you guys who are whining about having people post about gay marriage. If you really want other marriage issues discussed, start it up. I know I'll give you my opinions.\n\n \n The point, which you are pretending to not get, is that you keep whining about how you don't want gays \"spoiling marriage\". You keep bringing it up, but you've never brought up any other issue that actually does spoil marriage. Obvious conclusion: you don't actually care all that much about marriage per se, you just don't like gays. Your pretence that you want to \"protect marriage\" is a lie, an excuse so that you can do a bit more gay bashing while pretending that you aren't actually opposed to gay rights.", 
   {}, 
   175894, 
   null, 
   1130783580.0
  ], 
  [
   175924, 
   null, 
   "jyoshu", 
   "Your pretence that you want to \"protect marriage\" is a lie, an excuse so that you can do a bit more gay bashing while pretending that you aren't actually opposed to gay rights.\n\n \n Funny thing is, for all the accusations of all this \"gay bashing\" that is supposedly going on in these threads, nothing substantive has ever been given to back it up. \"Gay Bashing\"? Ha! If you think discussing the issues here by sharing opinions is gay bashing, then you guys owe Matt Shepard (who really HAS experienced gay bashing) a big apology.\n \n \nbut you've never brought up any other issue that actually does spoil marriage.\n\n \n Hello!!!! Because it's a gay rights forum. The pertinent issue here are GAY-related issues.", 
   {}, 
   175920, 
   null, 
   1130783880.0
  ], 
  [
   175929, 
   null, 
   "Kronus", 
   "Funny thing is, for all the accusations of all this \"gay bashing\" that is supposedly going on in these threads, nothing substantive has ever been given to back it up. \"Gay Bashing\"? Ha! If you think discussing the issues here by sharing opinions is gay bashing, then you guys owe Matt Shepard (who really HAS experienced gay bashing) a big apology.\n\n \n Gay bashing doesn't have to involve base ball bats. Anything that hurts gays counts, and should be opposed. You're not \"expressing an opinion\" or \"discussing the issue\", that lie won't fly anymore. You're campaigning against gay rights; you're pushing to have gays relegated to second class citizens. It's obvious to everyone here; do you feel the need to pretend otherwise just so you can live with yourself? Why the lie?", 
   {}, 
   175924, 
   null, 
   1130784360.0
  ], 
  [
   175930, 
   null, 
   "jyoshu", 
   "Gay bashing doesn't have to involve base ball bats. \n\n \n Yes but what we do here isn't gay bashing, and you know that. Don't you realize that it's obvious what you're trying to do here? Portray even debate and discussion about the issue as \"bashing\" so you won't have to deal with it, and so it will look bad when it's really not. It's a tactic, and a very transparent one too. I'm sure you'd love for this issue to be a non-debated topic. But I'd suggest rather than using \"kill-the-messenger\" tactics that you talk to the admins about the fact they have a debate forum for this issue if you don't want it debated.", 
   {}, 
   175929, 
   null, 
   1130784600.0
  ], 
  [
   175944, 
   null, 
   "Steeeeve", 
   "Please, give me a break.\n \"We didn't say anything because we didn't have any forums to do so in.\"\n Did you notice the general forum? Where you can discuss generally everything?\n And did you also notice a button that allows you to start a new thread?\n So quit moaning here if you're so concerned about the ills marriage has these days and take it over to the general forum.\n\n \n Fine, sine we are going to be black and white thinkers, where is the thread supporting all marriage on your part?\n \n Are you just trying to be selfish and get only what you want?\n \n Why not help the people who want 20 wives?\n \n Where is the petition signing for someone that wants to marry a cow?\n \n Where is the protest for 14yr olds marrying?\n \n \n I can play extremist too.", 
   {}, 
   175878, 
   null, 
   1130786160.0
  ], 
  [
   175961, 
   null, 
   "Kronus", 
   "Yes but what we do here isn't gay bashing, and you know that. Don't you realize that it's obvious what you're trying to do here? Portray even debate and discussion about the issue as \"bashing\" so you won't have to deal with it, and so it will look bad when it's really not. It's a tactic, and a very transparent one too. I'm sure you'd love for this issue to be a non-debated topic. But I'd suggest rather than using \"kill-the-messenger\" tactics that you talk to the admins about the fact they have a debate forum for this issue if you don't want it debated.\n\n \n If you posted that you thought slavery was a great idea and should be brought back, I'd call you a racist and say you were wrong to think that way. If you said that Hitler had the right idea and we should force Jews to wear yellow stars, I'd call you an anti-Semite and say you were wrong to think that way. What do you do? You post that it's ok to relegate gays to second class citizenship. And so I call you a homophobe and tell you it's wrong to think that way. As long as the message is homophobia I'll go after the message and the messenger. I know that you'ld like to do all the gay bashing you want without anyone pointing out to you how horrible it is. Tough luck. As long as you \"discuss\" how horrible gays are, I and others like me will be there to \"discuss\" how horrible you are for thinking that way.", 
   {}, 
   175930, 
   null, 
   1130788200.0
  ], 
  [
   175965, 
   null, 
   "jyoshu", 
   "If you posted that you thought slavery was a great idea and should be brought back, I'd call you a racist and say you were wrong to think that way. If you said that Hitler had the right idea and we should force Jews to wear yellow stars, I'd call you an anti-Semite and say you were wrong to think that way. What do you do? You post that it's ok to relegate gays to second class citizenship.\n\n \n No, see, that's where you're logic breaks down. \n \n a.) I haven't said gays should be 2nd class citizens. In fact, I've said time and time again here that I'm against discrimination against gays, and that I'd prefer they be given couples' benefits. I just don't think marriage should be redefined.\n \n b.) Even comparing or using in the same sentence Nazis, slavery, etc. with gay people and what they deal with is terribly, terribly disingenuous and offensive IMO. This has been gone over and over, but I'll say it again because it hasn't sunk in with you: \n gays are not enslavedgays aren't sold on auction blocksgays don't have to use \"gay-only\" restrooms and water fountains,gays aren't being rounded up in concentration campsgays aren't systematically put to deathEtc, etc, etc.\n These comparisons of yours are so over-the-top and wild that they aren't even legitimate. You are simply a group of people who want to have sex with people of the same gender, even though society frowns upon that. Other than having to deal with that frowning, you can do pretty much anything anyone else in this country can do. Heck, you can even get married as a gay person of you want--NO one is going to bar the door to the chapel. The police won't stop you. You just won't get benefits for it. So make no mistake: because of the big gulf between the severity of the issues with slavery/genocide and that of gay rights, one certainly can disagree with you without being hateful or prejudiced. If I insisted that polygamists shouldn't have legal marriage, would you call me a bigot and hateful? Because THAT'S much closer to the issue of what we're talking about than your ridiculous over-the-top analogies. And that doesn't even cover the fact that the homosexuality issue has moral implications whereas the other examples you gave do not.\n \n The bottom line is that no matter how much you say over, and over, like a child with his finger in his ears \"it's hate, it's hate, it's hate, it's hate . . .\", it won't make it so. No doubt you'd love to be able to level such an accusation accurately. But you have yet to do it accurately.", 
   {}, 
   175961, 
   null, 
   1130789100.0
  ], 
  [
   175970, 
   null, 
   "Kronus", 
   "No, see, that's where you're logic breaks down. \n \n a.) I haven't said gays should be 2nd class citizens. In fact, I've said time and time again here that I'm against discrimination against gays, and that I'd prefer they be given couples' benefits. I just don't think marriage should be redefined.\n\n And that's where your lies show through. You claim to be against discrimination, and yet you do nothing but belittle those whose strive to end that discrimination. It's not that you don't want marriage redefined, that's just a smokescreen you keep throwing up because you think it's safe ground. You don't want it recognized that gays face hardships solely because they're gay, you don't want anything done about these hardships, you want groups that try to stop discrimination to be thought of as whiners. This is why, when you say you are against gay discrimination, I think you're lying. That's why I think you're homophobic. Because you act and talk like a homophobe.", 
   {}, 
   175965, 
   null, 
   1130790000.0
  ], 
  [
   175971, 
   null, 
   "Steeeeve", 
   "If you posted that you thought slavery was a great idea and should be brought back, I'd call you a racist and say you were wrong to think that way. If you said that Hitler had the right idea and we should force Jews to wear yellow stars, I'd call you an anti-Semite and say you were wrong to think that way. What do you do? You post that it's ok to relegate gays to second class citizenship. And so I call you a homophobe and tell you it's wrong to think that way. As long as the message is homophobia I'll go after the message and the messenger. I know that you'ld like to do all the gay bashing you want without anyone pointing out to you how horrible it is. Tough luck. As long as you \"discuss\" how horrible gays are, I and others like me will be there to \"discuss\" how horrible you are for thinking that way.\n\n \n Would you say that George Washington was a racist?", 
   {}, 
   175961, 
   null, 
   1130790000.0
  ], 
  [
   175989, 
   null, 
   "jyoshu", 
   " This is why, when you say you are against gay discrimination, I think you're lying. That's why I think you're homophobic. Because you act and talk like a homophobe.\n\n \n Well, there's no since arguing with a brick wall, so I see no point in arguing about this any longer. No one is saying gays donn't face hardships. It's your loss though, because you're so determined to see lies where none exist. I feel sorry for anyone who sums up people based on one issue, judging them bigots in an all-or-nothing mentality. Gay pride fundamentalism. Feel free to get one of your last digs in though; I'm done with this discussion.", 
   {}, 
   175970, 
   null, 
   1130793300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Nothing they can do", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6729-nothing-they-can-do.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6729, 
  "discussion_files": [
   [
    "17495.html", 
    "http://www.4forums.com/political/gay-rights-debates/6729-nothing-they-can-do-print.html"
   ], 
   [
    "17496.html", 
    "http://www.4forums.com/political/gay-rights-debates/6729-nothing-they-can-do-3-print.html"
   ], 
   [
    "17497.html", 
    "http://www.4forums.com/political/gay-rights-debates/6729-nothing-they-can-do-2-print.html"
   ]
  ], 
  "identifier": 6729
 }
]