[
 [
  [
   9289, 
   null, 
   "Aryana", 
   "The major races of Human (black, white and yellow) are akin to the inter-breeding races of Canine known as the wolf, dog and coyote. \n \n DISCUSS", 
   {
    "post_info": {
     "post_title": "The Race Thread"
    }
   }, 
   null, 
   null, 
   1055064600.0
  ], 
  [
   9293, 
   null, 
   "DarKnight", 
   "Research a little bit deeper and you'll find that they aren't exactly the major groups. Of the top of my head I can name east asian, central asain, middle eastern, polynesian, australian natives, north american natives. White and black are actually sweeping statements. There are multiple whites (germanic, scandinavian, mediteranian, etc.) as well as multiple blacks (can't remember any of the top of my head).\n \n And besides this is \"youdebate\" not \"youdiscuss\" so how is this a debate?", 
   {}, 
   9289, 
   null, 
   1055090640.0
  ], 
  [
   9297, 
   null, 
   "Broker", 
   "This should be interesting...", 
   {}, 
   9289, 
   null, 
   1055099400.0
  ], 
  [
   9342, 
   null, 
   "Aryana", 
   "Originally posted by DarKnightResearch a little bit deeper and you'll find that they aren't exactly the major groups.\n\n \n Have a look at one of the race maps published by Dr. Cavaali-Sforza of the Human Genome Diversity Project. There are basically three main clusters. \"Yellows\" actually consist of two quite different clusters (North Asian & South Asian).\n \n Some people prefer saying there are 4 main races. Depending on how many you want to include, there could be 7 or larger (Cavalli-Sforza used about 50 populations (races) for his study). But i'm just talking about very broad trends, the most ancient lineages.\n \n Polynesians are a race of South Asian, North Americans (and amerindians in general) cluster with the North Asians. \n \n The black race is very diverse (far more so than whites) but when compared to races outside the African cluster, it is a separate group. (This is all evident by looking at the gene maps). Bantu and bushman, pygmy and nilotic blacks are all quite different. \n \n \n There are indeed multiple white races, if one feels so inclined in dividing them. Cavalli-Sforza used about 7 populations. One of the most interesting findings about whites was that indigenous iranians are more closely related to anglo-europeans than the basques (who represent the most homogenous mediterranean population). Overall however, the whites are obviously a separate and homogenous group (the unique recessive traits shared by many whites indicates long-term geographical isolation). Noone agrees on racial boundaries, however. Scientists even argue over what constitutes a \"species\". \n \n I use Steve Sailer's definition of 'race'.\n \n \"An extended family that inbreeds to some extent\"\n \n By the way, Middle Easterners are a mixture of caucasian, mongoloid and negro ancestry. So are most asian indians. \n \n \n \nAnd besides this is \"youdebate\" not \"youdiscuss\" so how is this a debate?\n\n \n ok then DEBATE.", 
   {}, 
   9289, 
   null, 
   1055117100.0
  ], 
  [
   9735, 
   null, 
   "Aryana", 
   "Hate, fear & disgust: Evolutionary emotions for tribal survival \n \n \n Judaism as a group evolutionary strategy \n \n Culture of Critique by Professor Kevin McDonald (preface) \n \n \n Antiracism and moralizing gods", 
   {}, 
   9289, 
   null, 
   1055576460.0
  ], 
  [
   9860, 
   null, 
   "Aryana", 
   "[QUOTE]I don't understand the point that it would make if this was true or not. Can anyone help me understand? QUOTE] \n \n \n It indicates several things.\n \n 1. Races have an urge to reproduce and preserve their gene pool.\n 2. To minimise conflict based on these urges, it is best if differing races and peoples have as much autonomy as possible.\n 3. In the case of caucasians, it means that white people need an independent white territory in order to be free from oppression and extinction.", 
   {}, 
   9289, 
   null, 
   1055720040.0
  ], 
  [
   9871, 
   null, 
   "Broker", 
   "Since when are white people oppressed and in danger of extinction?", 
   {}, 
   9289, 
   null, 
   1055724060.0
  ], 
  [
   10059, 
   null, 
   "Aryana", 
   "Originally posted by Broker \n Since when are white people oppressed and in danger of extinction? \n \n \n We have a comparatively low and dwindling birthrate.\n \n There are lots of nonwhite (higher birthrate) immigrants coming to the west.\n \n do the math.", 
   {}, 
   9289, 
   null, 
   1055825160.0
  ], 
  [
   10064, 
   null, 
   "Broker", 
   "That's because of our culture... people don't have a lot of children.", 
   {}, 
   9289, 
   null, 
   1055826300.0
  ], 
  [
   10145, 
   null, 
   "Aryana", 
   "Originally posted by Broker \n That's because of our culture... people don't have a lot of children. \n \n \n Yes. In order to avoid whites becoming minorities in the west, we'll need to stop or reduce nonwhite immigration.", 
   {}, 
   9289, 
   null, 
   1055897520.0
  ], 
  [
   14467, 
   null, 
   "&#8206;", 
   "If anyone wants to debate this I'll take over where Aryana left off. If not, that's okay.", 
   {}, 
   10145, 
   null, 
   1062808680.0
  ], 
  [
   14634, 
   null, 
   "God Fearing Ath", 
   "Real quickly:\n \n Kevin McDonald is the paragon of intellectual obsolescence. \"Group strategy\"? Didn't Williams destroy that sort of garbage way back in 1966?\n \n There is a reason why people dont take him seriously. Well, theres two. The first I just mentioned. The second is his anti-semitism.\n \n -GFA", 
   {}, 
   14467, 
   null, 
   1063006500.0
  ], 
  [
   14897, 
   null, 
   "Aryana", 
   "Real quickly:\n \n Kevin McDonald is the paragon of intellectual obsolescence. \"Group strategy\"? Didn't Williams destroy that sort of garbage way back in 1966?\n\n \n What sort of garbage? Humans divide themselves into groups, and adopt evolutionary strategies. This is fairly obvious. Have you even read any of McDonald's books?\n \n \n \nThere is a reason why people dont take him seriously. Well, theres two. The first I just mentioned. The second is his anti-semitism.\n \n -GFA\n\n \n Please explain how Kevin McDonald is 'anti-semitic' using examples. \n \n And what makes you think people don't take him seriously?", 
   {}, 
   14634, 
   null, 
   1063323720.0
  ], 
  [
   14928, 
   null, 
   "God Fearing Ath", 
   "And what makes you think people don't take him seriously?\n\n \n According to ISI, which keeps track of the literature, MacDonald's trilogy has been cited a total of....twice....since their publication (once by another antiquated group-selection advocate, Wilson). \n \n So he's got Wilson and Hartung; quite a concesus. ;)\n \n I'll deal with the rest when i have time.", 
   {}, 
   14897, 
   null, 
   1063331160.0
  ], 
  [
   14938, 
   null, 
   "Aryana", 
   "According to ISI, which keeps track of the literature, MacDonald's trilogy has been cited a total of....twice....since their publication (once by another antiquated group-selection advocate, Wilson).\n\n \n \n That's probably because these days academia is infested with Marxists and egalitarians, who utterly refuse to believe that there any biological differences between groups of people. \n \n What's more, analysing the \"Jewish Question\" is one of the heaviest taboos in western society. Yet McDonald has ploughed ahead and done so, which marks him out as a thought criminal.", 
   {}, 
   14928, 
   null, 
   1063333920.0
  ], 
  [
   15284, 
   null, 
   "mizmaxx", 
   "Blah, blah, blah, aryana strikes again...\n \n I can't believe I'm not the only one who's bothering to reply to so obvious a troll. Maybe there are a lot of bored people about.\n \n Naturally, groups that have been isolated for extended periods of time will have different genetic similarities. These do not, however, break down according to traditional racist categories.\n \n Thus, a person from present-day South Africa (\"Black\") will have as much in common genetically with someone from Algeria (\"Arab\") as they will with someone from Nigeria (\"Black\"). A person from France (\"white\") will have as much in common with someone from India (\"Asian\") as they will with someone from Finland (\"white\").\n \n Fortunately, with the exception of some peoples who settled on islands on mountaintops, most of us are already very mixed, and have been for thousands of years. Besides which, genetics or genealogy don't necessarily translate visually into how we perceive \"races\". Thus, a person we might read as \"black\" may have just as much South Asian heritage (for example, Trinidadians) or First Nations heritage (Choctaw Freedmen) as they do African.\n \n About dogs\n \n \nMost striking about the chart is that the different species of coyotes, wolves, and dogs are more closely related than is generally thought. Since these \"species\" are all interfertile, we are not really surprised at the results. Dr. Robert Wayne and his students at the University of california at Los Angeles have shown similar results with red and grey wolves sharing maternal ancestors with the coyote in the not too distant past. Paul says in his thesis that man's best friend is a wolf - but it looks to me like a wolf is just another breed of dog. It seems there is less difference between wolves and dogs, than dogs from each other. So far, says Vrana, there is less difference between dogs and wolves than between frogs in a single pond.\n\n \n \nIn nature, species consist of populations of individuals that usually occur over an extensive geographic range. For this reason one modern view considers a species to be a genetically distinctive group of natural populations that share a common gene pool and are reproductively isolated from all other such groups. The species is the largest unit of population within which effective gene flow occurs or can occur. Higher taxonomic categories, from the genus up, are biologists' inventions that exist only in the human mind. Animals in the same category have anatomical similarities showing clear relationships. Their grouping, however, is a decision based on a mix of objective and subjective evaluations. One taxonomist's family can easily be another's order.\n\n \n The bold section in the latter quote infers (correctly), that one of the major ways of determining seperation of species is by reproductive possibility. Since humans are capable of reproduction with fertile offspring regardless of what \"racial\" category they are from, there are no \"species\" differenciations between humans. Since taxonomic differenciations in any higher level are arbitrary, so are \"racial\" differenciations.\n \n Further, certainly it would be possible if a group of humans were isolated enough for long enough, they would evolve differently. This would require a great deal of time (millions of years), and would still not break down according to \"racial\" differences.", 
   {}, 
   14938, 
   null, 
   1063589880.0
  ], 
  [
   15579, 
   null, 
   "Aryana", 
   "Naturally, groups that have been isolated for extended periods of time will have different genetic similarities.\n\n \n These groups are often referred to as races. \n \n \nThus, a person from present-day South Africa (\"Black\") will have as much in common genetically with someone from Algeria (\"Arab\") as they will with someone from Nigeria (\"Black\"). A person from France (\"white\") will have as much in common with someone from India (\"Asian\") as they will with someone from Finland (\"white\").\n\n \n Depends what type of genes you're talking about. It still doesn't change certain facts like: Bantus tend to be taller than Pygmies. Race is a (very) extended family. \n \n \nFortunately, with the exception of some peoples who settled on islands on mountaintops, most of us are already very mixed, and have been for thousands of years.\n\n \n I am a white mixture but have no significant other ancestry. \n \n \n \nBesides which, genetics or genealogy don't necessarily translate visually into how we perceive \"races\". Thus, a person we might read as \"black\" may have just as much South Asian heritage (for example, Trinidadians) or First Nations heritage (Choctaw Freedmen) as they do African.\n\n \n Sometimes it's hard to tell breeds of dog apart as well.\n \n \n \n \nThe bold section in the latter quote infers (correctly), that one of the major ways of determining seperation of species is by reproductive possibility. Since humans are capable of reproduction with fertile offspring regardless of what \"racial\" category they are from, there are no \"species\" differenciations between humans.\n\n \n According to that definition of species, no there are not. Sub-species are a different matter, however. \n \n \nSince taxonomic differenciations in any higher level are arbitrary, so are \"racial\" differenciations.\n\n \n And so are species differences. What's your point?\n \n \nFurther, certainly it would be possible if a group of humans were isolated enough for long enough, they would evolve differently. This would require a great deal of time (millions of years), and would still not break down according to \"racial\" differences.\n\n \n Actually, that is exactly what causes racial differences in most cases. This is basic biology stuff.", 
   {}, 
   15284, 
   null, 
   1063715820.0
  ], 
  [
   15581, 
   null, 
   "Aryana", 
   "Most striking about the chart is that the different species of coyotes, wolves, and dogs are more closely related than is generally thought. Since these \"species\" are all interfertile, we are not really surprised at the results. Dr. Robert Wayne and his students at the University of california at Los Angeles have shown similar results with red and grey wolves sharing maternal ancestors with the coyote in the not too distant past. Paul says in his thesis that man's best friend is a wolf - but it looks to me like a wolf is just another breed of dog. It seems there is less difference between wolves and dogs, than dogs from each other. So far, says Vrana, there is less difference between dogs and wolves than between frogs in a single pond.\n\n \n \n If we apply the same definition of 'species' to both canines and humans, that means wolves, coyotes and dogs are different races of the same species. Which helps to prove my point.", 
   {}, 
   15579, 
   null, 
   1063716120.0
  ], 
  [
   15695, 
   null, 
   "mizmaxx", 
   "Quote:\n --------------------------------------------------------------------------------\n Since taxonomic differenciations in any higher level are arbitrary, so are \"racial\" differenciations.\n --------------------------------------------------------------------------------\n \n And so are species differences. What's your point?\n\n \n The fact that they are arbitrary means that there is not standard that can be used to seperate categories based on scientifically understood differences. That is to say, there are no scientific differences between any category of sub-species, the taxonomy is just a random way of classifying the species into smaller groups. As long as you are not mislead into believing that these groups exist anywhere else but in the mind, they can be useful.\n \n \nDepends what type of genes you're talking about. It still doesn't change certain facts like: Bantus tend to be taller than Pygmies.\n\n \n \nThese groups are often referred to as races. \n\n \n No they are not. The groups I am speaking of are peoples such as the Aborigines of Australia, who were isolated for a long time. They will share genetic similarities with each other more than with any other people, whether those people are categorized racially as \"black\" or \"native\" or \"white\". The racial categories have no scientific basis.\n \n \"There are no genetic characteristics possessed by all Blacks but not by non- Blacks; similarly, there is no gene or cluster of genes common to all Whites but not to non-Whites.One's race is not determined by a single gene or gene cluster, as is, for example, sickle cell anemia. Nor are races marked by important differences in gene frequencies, the rates of appearance of certain gene types. The data compiled by various scientists demonstrates, contrary to popular opinion, that intra-group differences exceed inter-group differences. That is, greater genetic variation exists within the populations typically labeled Black and White than between these populations. This finding refutes the supposition that racial divisions reflect fundamental genetic differences.\n \n Notice this does not mean that individuals are genetically indistinguishable from each other, or even that small population groups cannot be genetically differentiated. Small populations, for example the Xhosa or the Basques, share similar gene frequencies. However, differentiation is a function of separation, usually geographic, and occurs in gradations rather than across fractures.. .. . . The notion that humankind can be divided along White, Black, and Yellow lines reveals the social rather than the scientific origin of race.\" \n Ian F. Haney Lopez\n \n \nI am a white mixture but have no significant other ancestry. \n\n How would you know?\n \n \nActually, that is exactly what causes racial differences in most cases. This is basic biology stuff.\n\n \n Again, since you didn't read it the first time I guess-\n it still does not break down according to \"races\".\n \n \nSometimes it's hard to tell breeds of dog apart as well.\n\n \n Dog \"breeds\", as the name implies, have been in-bred and isolated in order for specific characteristics to surface. Unlike humans, or other animals, or even other dogs. \"Breeds\" are not found in \"nature\" the way humans have created them, and do not correspond to any equivalent, human or otherwise. Except maybe if you count European royalty until recently, who suffered much because of it.\n \n *edited for clarity*", 
   {}, 
   15581, 
   null, 
   1063779780.0
  ], 
  [
   15704, 
   null, 
   "God Fearing Ath", 
   "Sadly, I must take issue with you here miz.\n \n \nFortunately, with the exception of some peoples who settled on islands on mountaintops, most of us are already very mixed, and have been for thousands of years. Besides which, genetics or genealogy don't necessarily translate visually into how we perceive \"races\". Thus, a person we might read as \"black\" may have just as much South Asian heritage (for example, Trinidadians) or First Nations heritage (Choctaw Freedmen) as they do African.\n\n \n Two points. First, while some populations have a very large degree of racial admixture (African-Americans are, on average, about 25% Caucasian, although that varies geographically to some degree; see Parra et al, 1994; Chakraborty, 1992; etc) others, like Caucasians, do not. Admixture does not invalidate race as a biological concept -- no one is claiming (I hope) that races are immutable Platonic types. Rather, it simply stands to blur the edges of what are already fuzzy, statistical groups.\n \n Your second point is right on: skin color is a poor phenotypic marker of geographic ancestry (Shriver et al, 2003). But \"race as skin color\" is simply old-hat -- a long discredited folk theory that has absolutely no bearing on what race means to anthropologists, population genticists, or psychologists.\n \n I wonder, miz, if forensic anthropologists who, on the basis of skull morphology, can determine the race of an individual, find race \"arbitrary\". I wonder why, as Aryana factually noted (im as surprised as you), the distance matrices Cavalli-Sforza et al (1994) constructed from all those alleles at all those loci, turned into correlation coefficents and PCed, resulted in a very standard racial taxonomy.\n \n Race is real, miz. But that doesnt mean Ayrana's crackpot theories are any more valid.\n \n -GFA", 
   {}, 
   15284, 
   null, 
   1063781400.0
  ], 
  [
   15725, 
   null, 
   "montalban", 
   "Yes. In order to avoid whites becoming minorities in the west, we'll need to stop or reduce nonwhite immigration.\n\n \n Alternatively we could lock up white people in special 'preserves' or nature reserves to allow them to mate amongst themselves.\n \n Aryana, to talk about 'people' in such cold sterile terms speaks volumes.\n \n Races wish to preseve themselves? Really? Did you take a poll?\n \n Where do Australian Aborigines fit into your scheme? I have an encyclopedia from the 1950s which puts them as a separate race, but one from the 1970s puts them as a sub-group of Caucasians, so do you separate them or not?\n \n Race is such a strange construct for you to be working with.", 
   {}, 
   10145, 
   null, 
   1063792560.0
  ], 
  [
   15868, 
   null, 
   "mizmaxx", 
   "\n Two points. First, while some populations have a very large degree of racial admixture (African-Americans are, on average, about 25% Caucasian, although that varies geographically to some degree; see Parra et al, 1994; Chakraborty, 1992; etc) others, like Caucasians, do not. Admixture does not invalidate race as a biological concept -- no one is claiming (I hope) that races are immutable Platonic types. Rather, it simply stands to blur the edges of what are already fuzzy, statistical groups.\n\n \n The grouping \"Caucasian\" has no scientific basis. The people who are called \"Caucasian\" were already \"mixed\" when people began to designate themselves that way.\n \n \nI wonder, miz, if forensic anthropologists who, on the basis of skull morphology, can determine the race of an individual, find race \"arbitrary\".\n\n \n Skull morphology determines the general geographical background of the person. That does not at all mean that humans can be categorized according to these general skull characteristics in any way except geographically- ie, not \"racially\".\n \n \nI wonder why, as Aryana factually noted (im as surprised as you), the distance matrices Cavalli-Sforza et al (1994) constructed from all those alleles at all those loci, turned into correlation coefficents and PCed, resulted in a very standard racial taxonomy.\n\n \n \"The PC maps result in a reflection of the populations as they exist geographically, rather than as a representation of genetic distance... The names used for areas in the map are thus geographic in nature.  \n \n The Tables 2.3.1A and 2.3.1B (in the same section, on \n pages 75 and 76) are much more revealing than the map.\n They list all of the 42 populations and the genetic distance\n between each one of them and the other 41. Some very interesting\n data is shown here:\n \n - There is greater genetic disparity between the San (Khosian) and\n the Mbuti, both subSaharan African, than exists between the San and\n the following populations:\n - English, Danish, Iranian, Near Eastern, Mongol, Malaysian, \n Basque, Greek, Italian and Chukchi (Asian)\n \n \n - The Nilo-Saharan have more in common with the Mongols and the Basque than with the Berbers.\n \n \n - The Lapp, English, Danish, Greek and Italians all have more in common\n with East Africans than they do with the Thai.\n \n \n Also, ...the DNA mapping ... clearly shows\n African presence (genetically) throughout the human race.\"\n \n Lane Singer, scientific anthropologist  \n \n \nRace is real, miz. But that doesnt mean Ayrana's crackpot theories are any more valid.\n \n\n \n No, genetic differences are real. But they do not follow a pattern consistent with \"racial\" categories.", 
   {}, 
   15704, 
   null, 
   1063864980.0
  ], 
  [
   15875, 
   null, 
   "montalban", 
   "Ultimately, what mizmaxx says is right, there are no races.\n \n It was an historical absurdity for the Germans to believe in 'racial purity' of Germans.\n \n Considering that at no time was ther German population in isolation; everyone visited them from the Romans on the periphery (bringing legions from all over the mediterranean) to other non-European invaders, such as the Huns, and later Magyars who reached the North Sea before settling in the Huns old stomping-ground, 'Hungary'.", 
   {}, 
   15868, 
   null, 
   1063866780.0
  ], 
  [
   16070, 
   null, 
   "God Fearing Ath", 
   "miz, \n \n I'll be quick.\n \n You claim skull morphology can determine geographic ancestry, but not race. What then, might race be? I was under the impression that races were geographic breeding populations who differed in the frequency of alleles? To me, this sounds like a tacit concession.\n \n Your claim about Caucasians is curious. Are you suggesting that degrees of admixture cannot be determined? How about using population specific autosomal DNA markers, ala Perra at al?\n \n You then copy and paste a message by Singer, but fail to mention that the quote you bolded is derived from a methodological point he made above (which you did *not* bother to paste). As I noted, the correlation coefficents PCed were made from their *distances matrices*, and thus it is only *purely* geographic (which it is obviously going to be, to some degree) if you accept his argument.\n \n -GFA", 
   {}, 
   15875, 
   null, 
   1063948140.0
  ], 
  [
   16077, 
   null, 
   "God Fearing Ath", 
   "Two things that just came to mind that are worth noting:\n \n Cavalli-Sforza et al are not the only ones to apply PCA to genetic distances. Jensen, using data compiled by Nei and Roychoudhury, conducted a similar run with similar results. This is all reported in his fantastic opus, The g Factor (1998).\n \n Howell (1993) presents an almost identical group of clusters based on his craniometric data. Coincidence?\n \n -GFA", 
   {}, 
   16070, 
   null, 
   1063949160.0
  ], 
  [
   16086, 
   null, 
   "mizmaxx", 
   "You then copy and paste a message by Singer, but fail to mention that the quote you bolded is derived from a methodological point he made above (which you did *not* bother to paste). \n\n \n Do you mean this point- \n \n \nThe focal point for each of the 42 populations was geographical.\n You didn't answer my question: are you saying that each of these\n 42 populations is a race?\n \n Again, what =is= your definition of \"Race\", and how do you divide \n people up into discrete races?\n\n \n I didn't feel that portion was necessary to clarify what the author meant, he was clearly reponding to another person. I don't think I misrepresented what he was saying in any way.\n \n \nWhat then, might race be? I was under the impression that races were geographic breeding populations who differed in the frequency of alleles? To me, this sounds like a tacit concession.\n\n \n There is no consistent research evidence to show that humans fit into the \"racial\" categories of Leibniz and Wolff. The word \"race\" is loaded with falsehoods, such as the idea that geographic populations that share certain phenotypes will also share behavioural and qualitative differences, and therefore ties into the historically inseperable idea of \"racial superiority\".\n \n I don't see why a scientific concept like frequency of similar alleles should have an archaic master-race fantasy attached to it. It simply is unnecessary and misleading. If you want proof, look at Aryana and other equally confused ideologues.", 
   {}, 
   16077, 
   null, 
   1063953180.0
  ], 
  [
   16093, 
   null, 
   "God Fearing Ath", 
   "Yes, racial \"superiority\" is a myth. No, I dont see why population genetics should have a master-race fantasy attached to it either.\n \n Are physical traits the only phenotypes that differ statistically from group to group, due to allele frequencies? Perhaps, but perhaps not. Consider the very real racial differences in g, and the inability of a *solely* environmental theory of between-group differences to account for it. \n \n We know that, for instance, men of African ancestry have higher androgen levels than Caucasians (Ellis & Nyborg, 1992; Ross et al, 1986), and its clear that they (particularly testosterone) are a proximate cause of dominance behavior and aggression generally (for a review, see Mazur & Booth, 1998; note crime rates here).\n \n -GFA", 
   {}, 
   16086, 
   null, 
   1063954860.0
  ], 
  [
   16295, 
   null, 
   "mizmaxx", 
   "We know that, for instance, men of African ancestry have higher androgen levels than Caucasians (Ellis & Nyborg, 1992; Ross et al, 1986), \n\n \n No, \"we\" don't \"know\" that at all. Try to find a study NOT funded by a nazi PR group such as the \"Pioneer Fund\" that in any way demonstrates this hypothesis.\n \n You should inform yourself on the source of any research that claims to make sweeping generalizations. The Pioneer fund is a notorious for flawed research, not to mention their links to hate groups such as neo-nazis. Hardly what anyone could call \"unbiased\".", 
   {}, 
   16093, 
   null, 
   1064038620.0
  ], 
  [
   16315, 
   null, 
   "God Fearing Ath", 
   "No, \"we\" don't \"know\" that at all. Try to find a study NOT funded by a nazi PR group such as the \"Pioneer Fund\" that in any way demonstrates this hypothesis.\n \n You should inform yourself on the source of any research that claims to make sweeping generalizations. The Pioneer fund is a notorious for flawed research, not to mention their links to hate groups such as neo-nazis. Hardly what anyone could call \"unbiased\".\n\n \n This is really terrible argumention miz. Not only is it one big ad hominem, but its factually inaccurate.\n \n Lee Ellis is a Professor of Sociology at Minot State, in no way connected with the Pioneer Fund.\n \n Nyborg is a very distinguished Professor of Psychology at Aarhus University in Germany. His connection to the Pioneer Fund? None.\n \n Ron Koss is Professor, and Department chair, of epidemiology at USC's Keck school of medicine. Hardly a \"neo-nazi\", and in no way connected to the Pioneer Fund.\n \n Leslie Bernstein is Senior Associate Dean and Faculty Affairs Professor at USC Keck. She has never recevied a dime from the Pioneer Fund.\n \n I'd go on, but im sure you get the picture.\n \n As for the Pioneer Fund's \"flawed research\" and \"links to hate groups\", i'd be interested in seeing it: and i dont mean accusations about the Fund's founders, which is completely and totally irrelevant.\n \n Next time, try to address my points, not attack the character of scientists and research grant organizations.\n \n -GFA", 
   {}, 
   16295, 
   null, 
   1064042820.0
  ], 
  [
   16450, 
   null, 
   "mizmaxx", 
   "Not only is it one big ad hominem, but its factually inaccurate.\n\n \n It is neither.\n \n You quoted in the previous posts Jensen's \"The G Factor\". \n \n In September 1975 Jensen was interviewed by the German monthly magazine Nation Europa (pp.19-28), under the heading of Rasse und Begabung ('Race and Achievement'). Nation Europa has been one of the most substantial German fascist publications for a number of years. \n \n \nA few examples of the contents of Nation Europa for 1975 will be sufficient to show its fascist complexion. The May issue published a poem entitled 'For the soldiers of the Waffen-SS'. \n \n As well as the Jensen interview, the September issue also contains a very favourable review of the pamphlet Did six million really die? by Richard Harwood; this pamphlet, originally published in English, but translated into several European languages, is on most Nazi booklists and denies that the Nazi murder of Jews ever took place. \n\n Psychology, Racism & Fascism:\n An On-line Edition \n Andrew S. Winston\n \n In this review of g-factor in the APA(American Psychological Association) supported site Psycoloquy, C. Loring Brace says-\n \n \nJensen's outlook is a classic example of 'racialism' in Todorov's\n sense of the word (Todorov, 1993:91). As a racialist, he takes it for\n granted (a) that entities called 'races' exist, (b) that there is a\n continuity between physical 'type' and behavioural capabilities, and\n (c) that those capabilities can be ranked in hierarchical fashion among\n groups. He is less explicit in reiterating those elements of his belief\n in his recent writings, including \"The g Factor,\" but it is quite clear\n that nothing has shaken his initial faith in their reality. Other reviewers are dealing at great length with the thicket of details contained in his latest book, including the realisation that his 'g' is\n simply an artifact produced by the nature of factor analysis. The basic\n flaw is not in Jensen's technical treatment, but in his unexamined\n underlying assumptions. (...)\n \n What Jensen has done, then, is to proceed with his programme of\n assuming the innate intellectual inferiority of people of African\n origin without making even the beginnings of an effort to set up a\n scientifically credible test situation.\n\n \n From the same site, the abstract of a review by Paul J. M. Jorion: \n \n \nIn \"The g Factor,\" Jensen (1998, 1999) fails to establish his claim of the existence of an 18 point lag between the average IQ score for American blacks compared to American whites. The populations upon which he tested his hypothesis are constructed in a faulty manner, leading to an invalid treatment of data. The gap he discovers may therefore be a statistical artifact. He emphasises that no cultural bias is present in IQ testing, but the criterion through which his test groups are defined is supported only by cultural usage and falls within his own classification under the category \"Wrong Conceptions of Race\".\n", 
   {}, 
   16315, 
   null, 
   1064118120.0
  ], 
  [
   16475, 
   null, 
   "mizmaxx", 
   "Nyborg is connected to the Pioneer fund via his buddy Seymour Itzkoff, a racist promoter of eugenics, who also wrote the introduction to Nyborg's book. Itzkoff has received over $100 000 from the Pioneer fund over several years to publish pseudo-scientific \"studies\" of his own.\n \n Nyborg publicly supported racist Edward Miller(even wrote letters to the editor on his behalf), critiqued in several New Orleans papers in the late 1990's for his racist declarations and flawed studies.\n \n Ron Koss (or Ross as you first called him) does not seem to work for the Keck school anymore, as no reference to him can be found on their website- neither does there seem to be a Department of Epidemiology. Either way, epidemiology being the study of disease in populations, I don't understand why he should jump so far as to be studying endocrinology. Neither could I find any reference anywhere to the said study, was it published in any journals at all?\n \n Bernstein I don't know where you quoted, I can't find the post.\n \n At any rate, are you able to come up with any non-tainted study which shows higher testosterone levels in men of African descent? \n \n Even if you were to find such a study, it is not evidence on the existence of biological races. Science does not show any evidence of that, as stated by everyone from the American Anthropological Society to the researchers of the Human Genome Project.", 
   {}, 
   16450, 
   null, 
   1064126280.0
  ], 
  [
   16476, 
   null, 
   "mizmaxx", 
   "About Pioneer-\n \nIn the New York Review of Books Charles Lane referred to The Bell Curve's \"tainted sources,\" noting that seventeen researchers cited in the book's bibliography had contributed articles to, and ten of these seventeen had also been editors of, the Mankind Quarterly, \"a notorious journal of 'racial history' founded, and funded, by men who believe in the genetic superiority of the white race.\" Lane went on to identify the Quarterly's financial benefactor as the Pioneer Fund, a New York foundation established in 1937 by textile multimillionaire Wickliffe Preston Draper, who had \"advocated the 'repatriation' of blacks to Africa.\" Now headed by New York attorney Harry F. Weyher, who, according to Lane, had proposed that integration be abandoned, the fund also provided millions of dollars in research grants for the Quarterly's contributors, a number of whom \"were alleged to have pro-Nazi affiliations,\" as well as for the journal itself. In a later exchange with Murray himself, Lane called the Pioneer Fund and Mankind Quarterly \"scientific racism's keepers of the flame.\" 4 \n \n Other comments on Pioneer shared Lane's harsh judgment. An article in Rolling Stone titled \"Professors of Hate\" called the fund \"an organization with a terrible past\" and described in detail the alleged Nazi sympathies of Pioneer's secretary, John B. Trevor Jr., as well as some of its grantees. Leon Kamin, professor of psychology at Northeastern University and a well-known critic of hereditarian studies, observed that Herrnstein and Murray, in their discussion of race and IQ, had turned for assistance to Richard Lynn, whom they described as \"a leading scholar of racial and ethnic differences.\" 5 \"I will not mince words,\" wrote Kamin, calling it a \"shame and disgrace that two eminent social scientists ... take as their scientific tutor Richard Lynn ... an associate editor of the vulgarly racist journal Mankind Quarterly ... [and] a major recipient of support from the nativist and eugenically oriented Pioneer Fund.\"\n\n \nIf the fund has done no more than provide resources to universities for scientific research of high quality, then Pioneer may have been victimized by an intellectually stultifying pressure to conform to political orthodoxy. On the other hand, if the many grants made by Pioneer-not only to a number of well-known scientists but also to a host of obscure academics who similarly maintain that blacks are intellectually inferior to whites-mask other, less laudable goals, then the fund may be hiding an oppressive political agenda behind the protection of academic freedom. \n \n Even before looking at the evidence, however, it is clear that Pioneer is not a typical foundation. Its original certificate of incorporation, drafted in 1937, listed two \"charitable purposes\" on which resources were to be expended. First, the fund was to provide financial aid \"for the education of children of parents ... of unusual value,\" and in deciding who should benefit from such assistance, \"consideration shall be especially given to children who are deemed to be descended predominantly from white persons who settled in the original thirteen states prior to the adoption of the Constitution ... and/or from related stocks.\" That is, not only was it assumed that certain \"stocks\" were ipso facto more likely to be of value than others, but the actual selection of children meriting assistance was to be made by scrutinizing their parents. The intent, the charter noted, was to encourage such parents to have more children, \"and in so far as the qualities and traits of such parents are inherited, to aid in improving the character of people in the United States.\" 22 \n \n The fund's second purpose was to support \"study and research into the problems of heredity and eugenics\" and \"into the problems of race betterment\" in the United States, the latter phrase clearly referring to race in the generic sense: the \"human race.\" Also as part of the second purpose, the fund was to aid in the \"dissemination of information ... in general with respect to heredity and eugenics.\" 23 It was apparently under this provision that Pioneer has frequently subsidized not only research but also the distribution of many books, pamphlets, and reprints in what is essentially a lobbying effort for its grantees' conclusions about race-an activity not mentioned by Weyher in his description of Pioneer's achievements. \n \n Pioneer's administrative procedures are as unusual as its charter. Although the fund typically gives away more than half a million dollars per year, there is no application form or set of guidelines. Instead, according to Weyher, an applicant merely submits \"a letter containing a brief description of the nature of the research and the amount of the grant requested.\" 25 There is no requirement for peer review of any kind; Pioneer's board of directors-two attorneys, two engineers, and an investment broker-decides, sometimes within a day, whether a particular research proposal merits funding. Once the grant has been made, there is no requirement for an interim or final report or even for an acknowledgment by a grantee that Pioneer has been the source of support, all atypical practices in comparison to other organizations that support scientific research. In the competitive academic environment, where external support for research is both a source of professional pride and sometimes even a reason to expect an increase in salary, it is particularly unusual that a number of recipients have chosen not to acknowledge grants from Pioneer. \n\n \n \n\n Because there is no scientific basis for the claims they make in The\n Bell Curve, HM rely primarily on some highly \"tainted\" sources for\n most of their arguments. In \"The Tainted Sources of The Bell Curve,\"\n an article in the New York Review of Books, (12/1/94), Charles Lane\n painstakingly analyzes the sources of HM's claims of inherited racial\n and class differences in intelligence. Lane demonstrates that the\n authors of The Bell Curve are closely tied to a group of writers who\n have edited and contributed to a journal called The Mankind Quarterly\n and received research money from the Pioneer Fund. What are The\n Mankind Quarterly and the Pioneer Fund?\n \n The Mankind Quarterly is a journal founded in the late 1950's by\n opponents of the U.S. Civil Rights Movement to publish articles\n asserting the inferiority of Blacks. Its authors defended the racial\n policies of Nazi Germany and Fascist Italy, championed apartheid in\n South Africa and opposed independence for African countries. Since\n 1978 the editor of the journal has been Roger Pearson, an organizer of\n neo-Nazi groups both in Europe and the U.S. In 1982 President Reagan\n wrote a letter to Pearson to thank him for publishing the works of\n \"scholars\" who uphold the \"ideals and principles that we value at home\n and abroad.\" (The letter is reproduced in Old Nazis, the New Right,\n and the Republican Party, by Russ Bellant.\n \n \"HE WHO PAYS THE PIPER CALLS THE TUNE\"\n \n The Pioneer Fund, as Lane points out in \"The Tainted Sources of The\n Bell Curve,\" is a New York foundation established in 1937 with the\n money of Wycliffe Draper, a textile magnate who admired Nazi Germany\n and favored sending U.S. Blacks back to Africa. The Pioneer Fund is\n committed to eugenics, that is, policies of selective breeding for\n purposes of \"race betterment.\" In the late 1930's the Pioneer Fund\n gave financial support to both U.S. and German \"scientists\" who\n advocated and carried out forced sterilization and later outright\n genocide against populations deemed to be genetically inferior.\n \n The Pioneer Fund bankrolls the journal The Mankind Quarterly. Even\n more importantly, it has provided millions of dollars in research\n grants to all the \"scholars\" in the U.S. since the 1930's who have\n asserted that there are inherited racial differences in intelligence\n and who have called for \"eugenics\" policies to decrease the numbers of\n \"inferior\" groups and increase the numbers of \"superior\" groups.\n Recent and current recipients of Pioneer Fund grants include Arthur\n Jensen and William Shockley who a quarter century ago revived racist\n arguments against Black intelligence; Philippe Rushton, South African\n born Canadian racist who claims that Blacks have smaller brains and\n larger penises than whites in order to breed larger numbers of\n inferior children; Thomas Bouchard, U. of Minnesota professor who\n studies twins in order to claim that IQ is mainly inherited; Richard\n Lynn, from Northern Ireland, who asserts that Africans have lower\n intelligence than African Americans; Robert Gordon, Johns Hopkins\n sociologist who blames low IQ Blacks for crime; and Linda Gottfredson,\n U. of Delaware professor who opposes affirmative action for low IQ\n Blacks. (For further information on the Pioneer Fund, see Adolph\n Reed's column in the Progressive (December, 1994), and Stefan Kuhl's\n The Nazi Connection.\n", 
   {
    "post_info": {
     "post_title": "Pioneer"
    }, 
    "unicode_changes_made": true
   }, 
   16475, 
   null, 
   1064126460.0
  ], 
  [
   16479, 
   null, 
   "God Fearing Ath", 
   "Nyborg is connected to the Pioneer fund via his buddy Seymour Itzkoff, a racist promoter of eugenics, who also wrote the introduction to Nyborg's book. Itzkoff has received over $100 000 from the Pioneer fund over several years to publish pseudo-scientific \"studies\" of his own.\n \n Nyborg publicly supported racist Edward Miller(even wrote letters to the editor on his behalf), critiqued in several New Orleans papers in the late 1990's for his racist declarations and flawed studies.\n\n \n So you agree that Nyborg is not actually connected with the Pioneer Fund, but rather, Itzkoff is, correct?\n \n \nRon Koss (or Ross as you first called him)\n\n \n It's called a spelling error, miz. It's Ronald Ross.\n \n \ndoes not seem to work for the Keck school anymore, as no reference to him can be found on their website- neither does there seem to be a Department of Epidemiology. Either way, epidemiology being the study of disease in populations, I don't understand why he should jump so far as to be studying endocrinology. Neither could I find any reference anywhere to the said study, was it published in any journals at all?\n\n \n It took me two seconds to find his professional homepage.\n \n And the full citation is Ross, R. et al. 1986. Serum testosterone levels in healthy young black and white men. Journal of the National Cancer Institute, 76: 45-48.\n \n \nBernstein I don't know where you quoted, I can't find the post.\n\n \n Part of the \"et al\" in Ross et al.\n \n \nAt any rate, are you able to come up with any non-tainted study which shows higher testosterone levels in men of African descent? \n \n Even if you were to find such a study, it is not evidence on the existence of biological races. Science does not show any evidence of that, as stated by everyone from the American Anthropological Society to the researchers of the Human Genome Project.\n\n \n Again miz, ad hominem arguments are fallacious. Even if these researchers *were* financed by Pioneer, it doesnt absolutely *nothing* to invalidate their research.\n \n As for your last comment, i'll simply ad that arguments from authority are fallacious as well.\n \n Tomorrow, i'll deal with the copy-and-paste diatribes.\n \n -GFA", 
   {}, 
   16475, 
   null, 
   1064129940.0
  ], 
  [
   16485, 
   null, 
   "God Fearing Ath", 
   "A thought:\n \n Noam Chomsky wrote a preface to Robert Faurisson's screed \"Memoire en defense contre ceux qui m'accusent de falsifier l'hisoire\".\n \n Does this make Dr. Chomsky a holocaust denier? Does this, along with his cordial relationship with Faurisson, make Chomsky a resident scholar at the Institute for Historical Review?\n \n -GFA", 
   {}, 
   16479, 
   null, 
   1064131860.0
  ], 
  [
   16492, 
   null, 
   "mizmaxx", 
   "If Chomsky were doing \"research\" which sought to prove that Jewish people were genetically predisposed to be trying to take over the world, it might be similar.\n \n But it's not.\n \n In passing, having given permission for the essay to be printed by anyone for any reason, and thus having it be printed for the book, he later requested that it no longer be included as an introduction. His request was denied.", 
   {}, 
   16485, 
   null, 
   1064136360.0
  ], 
  [
   16637, 
   null, 
   "mizmaxx", 
   "Again miz, ad hominem arguments are fallacious. Even if these researchers *were* financed by Pioneer, it doesnt absolutely *nothing* to invalidate their research.\n\n \n Actually, it does. You obviously need educating about assessing the validity of scientific studies- a known bias on the part of a funding body or researcher is enough for a study to be considered fallacious\n \n Besides which, an ad hominem argument would be my saying that Jensen is ugly, or cheats on his wife. What I am saying is that his \"study\" has no validity, because he is overtly racist, therefore the \"study\" is biased.\n \n I don't believe \"studies\" paid for by pharmaceutical companies that say their products are safe or useful either. \n \n \nAs for your last comment, i'll simply ad that arguments from authority are fallacious as well.\n\n \n Sure, unless they're \"authorities\" on eugenics, I suppose. emoticon_rolleyes \n \n The Human Genome Project is the largest most comprehensive study of human genes, involving people from all over the world and hundreds of researchers. If they haven't found any evidence of the existence of \"races\", no one will.\n \n But feel free to keep on believing. And say hi to Aryana at the next Hitler Jugund meeting.", 
   {}, 
   16492, 
   null, 
   1064215080.0
  ], 
  [
   16657, 
   null, 
   "montalban", 
   "These groups are often referred to as races. blah blah blah\n\n \n South Africa's fallen dictatorship had a legal definition for race.\n I saw the doco about two women, both sisters from a mixed marriage. One was darker than the other, and was legally 'black' but her sister was legally 'white'\n \n They had a whole set of rules to measure... depth of nose, width of nose, skin tone etc.\n \n The darker skinned sister had herself re-classified as 'white' by showing that her nose was within the definition of being white.\n \n \n \n \n Sometimes it's hard to tell breeds of dog apart as well. \n\n \n And some people act like they have no brains at all.\n \n There are just two types of people in the world. Those that categorise people, and those who don't.", 
   {}, 
   15579, 
   null, 
   1064223660.0
  ], 
  [
   16658, 
   null, 
   "God Fearing Ath", 
   "Actually, it does. You obviously need educating about assessing the validity of scientific studies- a known bias on the part of a funding body or researcher is enough for a study to be considered fallacious\n \n Besides which, an ad hominem argument would be my saying that Jensen is ugly, or cheats on his wife. What I am saying is that his \"study\" has no validity, because he is overtly racist, therefore the \"study\" is biased.\n \n I don't believe \"studies\" paid for by pharmaceutical companies that say their products are safe or useful either. \n\n \n An ad hominem, miz, is saying attributes of a person, including the source of his/her funding, invalidate the conclusions. This is a fallacy.\n \n If you have something to say about Dr. Jensen's research, please do so. However, if you continue to slander scientists instead of addressing the emperical data at hand, i'll take it as a concession and discontinue my discussion with you.\n \n \nSure, unless they're \"authorities\" on eugenics, I suppose. emoticon_rolleyes \n \n The Human Genome Project is the largest most comprehensive study of human genes, involving people from all over the world and hundreds of researchers. If they haven't found any evidence of the existence of \"races\", no one will.\n\n \n Please see my previous posts on this matter which you have failed to refute.\n \n \nBut feel free to keep on believing. And say hi to Aryana at the next Hitler Jugund meeting.\n\n \n Additional attacks on my character with similarly be treated as a concession. In fact, i demand an immediate retraction.\n \n For a refutation of accusations made against Pioneer, please see here and their webpage, located here. But since the former was written by Rushton, a PF grantee, i guess that means his conclusions are, ipso facto, just a bunch of lies. emoticon_rolleyes\n \n -GFA", 
   {}, 
   16637, 
   null, 
   1064224740.0
  ], 
  [
   17215, 
   null, 
   "mizmaxx", 
   "An ad hominem, miz, is saying attributes of a person, including the source of his/her funding, invalidate the conclusions. This is a fallacy.\n\n \n Actually, it's an analysis of the research. If the researcher is biased, because of prejudice or interest, the study will not be taken seriously by scientific communities. As with Jensen's \"G Factor\".\n \n \nHowever, if you continue to slander scientists instead of addressing the emperical data at hand \n\n \n The \"studies\" you quote are neither \"emperical\" nor empirical. The definition of empirical is as follows-\n \n \n Definition: [adj] derived from experiment and observation rather than theory; \"an empirical basis for an ethical theory\"; \"empirical laws\"; \"empirical data\"; \"an empirical treatment of a disease about which little is known\" \n \n Synonyms: a posteriori, confirmable, data-based, existential, experiential, experimental, falsifiable, model(a), observational, pilot(a), semiempirical, test(a), trial(a), trial-and-error, verifiable \n \n Antonyms: theoretic, theoretical \n\n \n \nPlease see my previous posts on this matter which you have failed to refute.\n\n \n \nAlan R. Templeton, Ph.D., professor of biology in Arts and Sciences, has analyzed DNA from global human populations that reveal the patterns of human evolution over the past one million years. He shows that while there is plenty of genetic variation in humans, most of the variation is individual variation. While between-population variation exists, it is either too small, which is a quantitative variation, or it is not the right type of qualitative variation -- it does not mark historical sublineages of humanity.\n \n Using the latest molecular biology techniques, Templeton has analyzed millions of genetic sequences found in three distinct types of human DNA and concludes that, in the scientific sense, there is no such thing as race.\n \n \"Race is a real cultural, political and economic concept in society, but it is not a biological concept, and that unfortunately is what many people wrongfully consider to be the essence of race in humans -- genetic differences,\" Templeton said. \"Evolutionary history is the key to understanding race, and new molecular biology techniques offer so much on recent evolutionary history. I wanted to bring some objectivity to the topic. This very objective analysis shows the outcome is not even a close call: There's nothing even like a really distinct subdivision of humanity.\"\n \n Templeton used the same strategy to try to identify race in human populations that evolutionary and population biologists use for non-human species, from salamanders to chimpanzees. He treated human populations as if they were non-human populations. \n \n \"I'm not saying these results don't recognize genetic differences among human populations,\" he cautioned. \"There are differences, but they don't define historical lineages that have persisted for a long time.\"\n\n \n \nStephen Jay Gould's The Mismeasure Of Man (1981) or Lewontin, Rose and Kamin's book Not In Our Genes (1984) both point out that there is ample biological evidence to show that breeding within a certain population will, over time, replicate certain features but will not alter the fundamental genetic makeup of a human.\n\n \n \nThe Emperor's\n New Clothes: Biological Theories of Race at the\n Millennium\n \n In this groundbreaking book, Joseph Graves traces the development of thought about human genetic diversity. He argues that racism has persisted in our society because adequate scientific reasoning has not entered into the equation. Graves champions the scientific method, and explains how we may properly ask questions about the nature of population differentiation and how (if at all) we may correlate that diversity to differences in human capacity and behavior.\n He also cautions us to think critically about scientific findings that have historically been misused in controversies over racial differences in intelligence heritability, criminal behavior, disease predisposition, and other traits. Greek philosophy,social Darwinism, New World colonialism, the eugenics movement, intelligence testing biases, and racial health fallacies are just a few of the topics he addresses.\n \n According to Graves, this country cannot truly address its racial problems\n until people understand that separate human races do not\n exist empirically. With the biological basis for race removed, racism becomes an ideology, one that can and must be expunged.\n\n \n There are more studies that disprove the \"race\" theory, but I haven't the time to educate you. Believers in and apologists for bad science won't be swayed by evidence. Clearly if you continue to defend \"studies\" done by racists, you have no interest in the truth.\n \n \nAdditional attacks on my character with similarly be treated as a concession. In fact, i demand an immediate retraction\n\n \n Demand denied. It is not an attack on someone's character to identify a belief system which they obviously subscribe to. For example, if someone continually quotes humanists and makes arguments that clearly qualify as ideologically humanist, calling them \"a humanist\" is not \"an attack\", it is simply an acknowledgement of the belief system behind their argument. If your belief system happens to be heinous, that is no fault of mine.\n \n \n As a racialist, he takes it for granted \n (a) that entities called 'races' exist, \n (b) that there is a continuity between physical 'type' and behavioural capabilities, and\n (c) that those capabilities can be ranked in hierarchical fashion among groups.\n(Todorov, 1993:91).", 
   {
    "unicode_changes_made": true
   }, 
   16658, 
   null, 
   1064477460.0
  ], 
  [
   17223, 
   null, 
   "God Fearing Ath", 
   "Your militant refusal to address the data is, as per my last post, taken as a concession. Further posts will be disregarded until such time as you feel inclined to stop the fallacies and quote-mining, and start taking on the topics.\n \n Thanks.\n \n -GFA", 
   {}, 
   17215, 
   null, 
   1064485200.0
  ], 
  [
   17730, 
   null, 
   "mizmaxx", 
   "The \"data\" has been addressed- it does not stand up to any scrutiny.\n \n I'm not to blame for your inability to back up your points, or for your lack of arguments.", 
   {}, 
   17223, 
   null, 
   1064817720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Race Thread", 
  "url": "http://www.4forums.com/political/current-events-debates/675-race-thread.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 675, 
  "discussion_files": [
   [
    "16244.html", 
    "http://www.4forums.com/political/current-events-debates/675-race-thread-print.html"
   ], 
   [
    "16245.html", 
    "http://www.4forums.com/political/current-events-debates/675-race-thread-3-print.html"
   ], 
   [
    "16246.html", 
    "http://www.4forums.com/political/current-events-debates/675-race-thread-2-print.html"
   ]
  ], 
  "identifier": 675
 }
]