[
 [
  [
   176610, 
   null, 
   "Bud Light Man", 
   "The thread topic says it all pretty much. I was just bored and wondering if anyone knew what are the earliest documents we posses of mankind. Thanks ahead of time.", 
   {
    "post_info": {
     "post_title": "What's the earliest known forms of written history?"
    }
   }, 
   null, 
   null, 
   1130972460.0
  ], 
  [
   176650, 
   null, 
   "sinjin", 
   "Try google and report back what you find. There's a cure for your boredom. Fascinating that one can be both bored and lazy simultaneously, isn't it?", 
   {}, 
   176610, 
   null, 
   1130978640.0
  ], 
  [
   176836, 
   null, 
   "Bud Light Man", 
   "Thanks for the idea, I was bored and I am a scatter brain and it just jumped to that topic randomly. \n \n Anyways here's a site for anyone interested:\n \n http://news.bbc.co.uk/1/hi/sci/tech/334517.stm\n \n It just sums up the fact they unearthed some old relics that could date back up to 5,500 years ago. Pretty interesting. It was found in Pakistan. Anyways I guess that sums up this thread. emoticon_xbye", 
   {}, 
   176650, 
   null, 
   1131049800.0
  ], 
  [
   325984, 
   null, 
   "isly ilwott", 
   "Thanks for the idea, I was bored and I am a scatter brain and it just jumped to that topic randomly. \n \n Anyways here's a site for anyone interested:\n \n http://news.bbc.co.uk/1/hi/sci/tech/334517.stm\n \n It just sums up the fact they unearthed some old relics that could date back up to 5,500 years ago. Pretty interesting. It was found in Pakistan. Anyways I guess that sums up this thread. emoticon_xbye\nHow about 32000 years ago?\n \n http://en.wikipedia.org/wiki/Cave_paintings#Age\n \n \n Do I win a prize?", 
   {}, 
   176836, 
   null, 
   1222967340.0
  ], 
  [
   326052, 
   null, 
   "Penfold", 
   "Close, but no cigar. Art is not writing.", 
   {}, 
   325984, 
   null, 
   1222991100.0
  ], 
  [
   326063, 
   null, 
   "Archangel", 
   "I believe it was Hebrew, and here's an opinion which explains why that belief is rational and most probable.\n The Oldest Language? (A Biblical Perspective)\n \n (greeklatinaudio.com Austin TX March 2003)\n \n As a casual perusal of multiple reference works on this subject will reveal, the question, \"Which is the oldest language?\" quite easily generates several suggestions which almost always include one or more of the following venerable candidates: (in no particular order) SUMERIAN, AKKADIAN, CHINESE, EGYPTIAN, PHRYGIAN, SANSKRIT, PHOENICIAN, etc., etc. And, such a list, of course, obliges the quester to make his own limited choice...\n \n THUS, a clear-cut answer to the question is not forthcoming, the experts aren't committing, and the end result (if the quester does indeed MAKE a choice) is arrived at kind of like pinning the tail on the donkey.\n \n A fundamental factor which lends to the above-cited indecisiveness in this field of study is the universally held notion (seemingly unassailable) that, historically, language should somehow show a developmental progression ranging from primitive rudiment to modern refinement. However, as the above list indicates, such is not the case! On the contrary, ancient languages are every bit as linguistically refined as the most trafficked languages of today! Furthermore, there is no historical evidence of earlier more rudimentary intermediate languages which provide a bridge between our supposed first grunts and snorts, and the sophisticated cadence of languages such as the above. So until such evidence is definitively in place, the experts remain in a holding pattern and continue to shove palliative lists at us from which we may make our personal choices.\n \n Thus, in dealing with the question, \"Which is the oldest language?,\" we continue to work with a theoretical linguistic model which suggests a developmental pattern which is not consequent with reality. (Kind of like using a roadmap of Ankara to find our way around in Boston. (Kind of like pinning the tail on the donkey...) )\n \n SO...\n To bypass this unpleasant and unproductive circumstance, may we temporarily chuck the currently preferred model and revisit the most revered and credible historical document in our possession, the Bible, to consider the question at hand ...\n \n [Note that it is not within the scope of this narrative to confirm (or reconfirm) the astounding credibility of the Bible as an unparalleled historical reference document. This is a task for the reader to undertake for himself. The Bible, however, will be used here as the historical reference-of-choice for establishing the conclusions arrived at.]\n \n \n PROCEEDING...\n Using the Bible as our historical reference-of-choice will require ONE necessary, yet reasonable, adjustment in logic. (Have no fear! This logical adjustment is only temporary, for the sake of this discussion. It may freely be abandoned when we're done - or, you may \"disconnect\" whenever you wish!)\n \n This adjustment in logic follows:\n The Bible claims to be a divinely inspired account of creation, and the relevant history of mankind's dealings with God. (2nd Timothy 3:16, Romans 15:4) RULE: Let's magnanimously assume, within the context of this discussion, that this might be true.\n \n \n With the above rule in place, then the following would also apply: Historically, God was there. He saw it all. He did it all. Therefore, what his professed record says is reasonably worthy of (at the very least!) polite analysis. Interestingly, following through in this tolerant(!) frame of mind brings us to some very intriguing conclusions which apply directly to our \"oldest language\" question, AND which fit far more harmoniously with what reality suggests...\n \n FOR EXAMPLE...\n - If God, the creator of the universe (a universe whose size, balanced complexity and beauty eloquently attest to its creator's consummate power and artistry) made Adam from the dust of the ground, and in his image and likeness (which obviously isn't shabby!) then this guy (Adam) was quite likely NOT some knuckle-dragging, low-brow, worm-grubbing, prognathic klutz who could only grunt in monosyllables, and poke crude marks in the sand with his gnarled and filthy opposable thumb.\n \n - In fact, the Genesis account confirms that an infinitely more refined Adam started out speaking a real language, in a very dignified context, even conversing with God and composing poetry on-the-fly! (Genesis 2:16 ,17, 23; 3:10-context)\n \n - Furthermore, this refined creature had so robust a physiology that he could live for nearly a thousand years(!) (Genesis 5:5) This being the case, then his accompanying neurology must have been phenomenal as well! For this reason alone, we might be justified in ascribing a level of genius to him and his contemporaries that would topple our meager conceptual notions of what genius is...\n \n - It easily follows then that Adam could certainly read and write [a] language. After all, if God created him with all of this implied refinement (including speech - from the git-go!) it takes only a small leap of logic to imagine that he also gifted Adam with normally accompanying language capabilities.\n \n - And, given mankind's unquestioned propensity for keeping written records, we might even conclude that Adam and his refined contemporaries did just that! Like we do today! Amazingly enough, the Bible suggests that this might even be the case!\n \n \n \n The Documentary Nature of the Genesis Account\n Moses is regarded, without any serious argument to the contrary, as the writer and compiler of the earliest portions of the Bible. However, Moses does not appear on the Biblical scene until the Exodus account. Obviously then, all of the material comprising the earlier Biblical record (i.e., Genesis) had to be provided for Moses through some exterior means. (e.g., oral tradition, divine revelation, prior written records, all of the above, other(?)...)\n \n If, from this short list of source possibilities, we concentrate only on the avenue of prior written records which Moses likely had in his possession, then the documentary nature of the Genesis account takes on substantial significance as it relates to our question: \"Which is the oldest language?\".\n \n For example, many Biblical scholars are of the opinion that the occasional colophons found in the Genesis account are indications of narrative references or inclusions from prior records or documents. The precise nature of colophonic protocol, as it was understood and used by ancient chroniclers, is not clearly understood today, however, the presence of these colophons in the Genesis account strongly supports the theory that Moses did indeed have access to documents harking from the most ancient periods of mankind's Biblical history. In any case, can one imagine a credible historian NOT having access to such sources, or using them!\n \n [The reader may pursue a study of documentary \"colophons\" and their historic usage on his own. (see also, Hebrew: &#1514;&#1493;&#1500;&#1491;&#1493;&#1514; \"Toledoth\")] \n \n Assuming then, that Moses had access to such documents and included them (or referred to them) in his Genesis account, we may build upon some of their historical (and implied eye-witness) commentary as it pertains to early language:\n \n \n Tower of Babel: A Critical Focal Point in the [Biblical] History of Language...\n Regarding events at Babel, (Genesis chapter 11) we are told that, just prior to the time of the attempted construction of the tower, (c. 2300 B.C.E. (c. 100 years after the Deluge) ) all the earth was still speaking one language. (Genesis 11:1) This is, obviously, a very important and helpful statement because it allows us to make some founding assumptions: (Please excuse the obviousness of these assumptions, but listing them here helps congeal their significance in the mind of the reader.)\n \n 1.) Up until the incident at Babel, mankind spoke a single language. (i.e., the language in question.)\n \n 2.) This means that any supposed historical documents which originated from the time prior to Babel were recorded in the language in question.\n \n 3.) Thus, the possible historical chroniclers who could have written such documents, e.g., Adam,(?) Methuselah,(?) Enoch,(?) Noah,(?) Noah's sons,(?) etc., all spoke the language in question. \n \n 4.) Furthermore, it is reasonable to conclude that, because the action of God to multiply the language of mankind at Babel was a PUNITIVE action, those of mankind who were still regarded with favor by God, (and who were, therefore, NOT the object of this punitive action) would have continued to speak the language in question AFTER the incident at Babel.\n \n (Bear in mind here that Methuselah lived right up to the time of the Deluge and was, therefore, a contemporary of Noah and his sons, who survived the Deluge and were around during the time of the incident at Babel. (We may blithely assume that Noah and his sons were regarded with favor by God(!) and, therefore, did NOT have their language affected.) ) \n \n 5.) Notably, at this approximate critical juncture in history, (c. 300 years after the incident at Babel) we find Abram, (Abraham) a contemporary of Noah's son Shem, appearing on Biblical radar. The Bible calls him \"a Hebrew,\" and \"God's friend.\" (Genesis 14:13, James 2:23) It is therefore reasonable to conclude that Abraham spoke the language in question.\n \n 6.) The language in question was Hebrew.\n \n AGAIN: The substantive CONNECTING assumption here, which ties the language of Abraham to the \"one language\" spoken by mankind prior to the incident at Babel is, that the action of God to multiply mankind's language was PUNITIVE. Therefore, the few of mankind who were still in God's favor at that time, would NOT likely have been affected.\n \n \n Cave Canem...\n It would be good to remind the reader that the conclusion arrived at here (i.e., that Hebrew is the oldest language) is based upon perfectly reasonable assumptions - which in turn, are based upon the RULE stated above and reiterated here: \"Let's magnanimously assume, within the context of this discussion, that [the Bible record] might be true.\"\n \n For those readers with a bent for historical linguistics, who may at this point be in the painful throes of conflicting theoretical apoplexy, please be reminded: The logical adjustment underlying the rule (and allowing for the stated assumptions) is only temporary, for the sake of this discussion. It may freely be abandoned when we're done - or, you may \"disconnect\" whenever you wish!\n \n However, as in any objective attempt at inquery into controversy, it is always worth considering (very carefully) the invasive impact that ones bias has on the process - particularly as it applies to this subject. Admittedly, the roads of bias can go off in countless directions, but the bias being challenged here is the big one, mentioned at the outset of this discussion, i.e., that it is almost universally and unassailably presumed that mankind (cf, 'new man' and neander (as in Neanderthal, fr. Greek: neoV anhr \"New Man\" and German: Thal \"Valley\") ) started out as some \"knuckle-dragging, low-brow, worm-grubbing, prognathic [\"valley-boy\"] klutz who could only grunt in monosyllables and poke crude marks in the sand with his gnarled and filthy opposable thumb,\" etc.\n \n If the quester is convinced that this is the case, then of course, his investigative modality will likely comply with the underlying notion. AND because this \"Neanderthal notion\" is almost universally assumed to BE the case, it appears that the bias in question applies. It is, therefore, not surprising that NEARLY ALL explanations of language origin paint this unholy picture of a bunch of bungling uncomposed simians grubbing for worms and stumbling upon linguistic cognizance - by pure accident! AND that, therefore, historical language development should present itself as proceeding from crude rudiment to modern refinement.\n \n It is merely being suggested here, that this prosaic, over-used and bias-induced model MAY NOT apply at all! AND, as has been demonstrated here, our historical reference-of-choice (the Bible) presents a diametrically opposed and far more dignified picture.\n \n \n A Related and Interesting Speculative Exercise:\n Proceeding on the basis of the foregoing assumptions, (i.e., that Hebrew is the oldest language, and that Moses had access to extremely ancient source documents in Hebrew when compiling and writing Genesis) we might give our attention to an intriguing segment of the Genesis account which has been cited by Biblical scholars as possibly representing one such document. It is comprised of the text of Genesis 1:1 through Genesis 2:4.\n \n If this segment of text does indeed represent the content of a single ancient source document which Moses had in his possession, it would be interesting to speculate a bit on its nature...\n \n To this end...\n We know with reasonable certainty, based upon paleographical evidence, that Hebrew script style has presented itself over historical millenia in two broad alphabetic formats. Each format, of course, has its own set of innumerable possibilities for stylistic and [writer-]idiosyncratic variation, but in general, these script styles are:\n \n 1. Modern. (variously called \"square,\" \"Aramaic,\" \"Babylonian,\" \"Assyrian,\" inter alia(!?) ) Traditionally, and in the opinion of most gurus, this style hails from around the time of the Jewish exile in Babylon, c. 600 B.C.E. Remarkably, it is therefore, about 2600 years old!\n \n 2. Ancient. (variously called \"Phoenician,\" \"Canaanite,\" \"paleo-Hebrew,\" \"pre-exilic Hebrew,\" \"old Hebrew,\" inter alia(!?) ) This script style antedates the former, and is, therefore, (and remarkably!) FAR OLDER than 2600 years!\n \n \n Regarding these two script styles, the following chart is presented which equates them letter-for-letter alphabetically. At the top is a common variation of the modern Hebrew script style. Below it, is an acceptable variation of the ancient Hebrew script style.\n \n http://www.greeklatinaudio.com/images/hebchars.jpg\n \n Using the ancient script style presented in this chart, the document in question, comprised of the text of Genesis 1:1 through Genesis 2:4, (as represented in the Masoretic text) is speculatively reviewed in the following links: The first link displays the text in question as it may well have appeared while in Moses' possession c. 3500 years ago. The second link displays exactly the same text, line-for-line, as it appears in modern Hebrew. The third link displays the same text in line-for-line English translation, and the fourth link provides access to a downloadable MP3 audio reading of the text in Hebrew.http://www.greeklatinaudio.com/oldlang.htm", 
   {}, 
   326052, 
   null, 
   1222993140.0
  ], 
  [
   326138, 
   null, 
   "Penfold", 
   "Errrrrrrrrrr........ No. Next?", 
   {}, 
   326063, 
   null, 
   1223048880.0
  ], 
  [
   326251, 
   null, 
   "sinjin", 
   "http://news.bbc.co.uk/1/hi/sci/tech/334517.stm\n \n or possibly this:\n \n http://worldshistory.informbank.com/articles/culture/oldest-writings-bulgaria.htm", 
   {}, 
   326138, 
   null, 
   1223078580.0
  ], 
  [
   326271, 
   null, 
   "Archangel", 
   "http://news.bbc.co.uk/1/hi/sci/tech/334517.stm\n \n or possibly this:\n \n http://worldshistory.informbank.com/articles/culture/oldest-writings-bulgaria.htm\n\n \n Your links are very interesting. Let's look at them side by side.\n \n http://www.greeklatinaudio.com/images/tu1.ancheb.jpg\n \n http://news.bbc.co.uk/olmedia/330000/images/_334517_write300.jpg\n \n http://www.informbank.com/allgallery/w-0-a-0-i-9.jpeg\n \n Notice the similarities in the characters. Especially between the known ancient Hebrew and your first example. But even the second example seems similar in its geometric construction.\n \n And just out of curiosity, if homo sapien sapiens date back more than 100,000 years as hunter gatherers with socialized communities, why don't we have any written languages going back further back than 5,000 years or so? Or at least further back than evidence suggests that man had a written language? \n \n http://www.msu.edu/~robin400/sapiensmodern.html", 
   {}, 
   326251, 
   null, 
   1223103900.0
  ], 
  [
   326274, 
   null, 
   "T.Q", 
   "And just out of curiosity, if homo sapien sapiens date back more than 100,000 years as hunter gatherers with socialized communities, why don't we have any written languages going back further back than 5,000 years or so? Or at least further back than evidence suggests that man had a written language?\n\n Because once again you're wrong. H. Sapiens dates back roughly 100K years. \"Socialized communities\" date back about 5K years or so. Question answered.", 
   {}, 
   326271, 
   null, 
   1223113380.0
  ], 
  [
   326287, 
   null, 
   "Archangel", 
   "Because once again you're wrong. H. Sapiens dates back roughly 100K years. \"Socialized communities\" date back about 5K years or so. Question answered.\n\n \n Interesting, so you're saying that prior to 5,000 years ago human beings were solitary creatures rather than socialized? I have never heard that before. And evidently neither have any of the sources on-line. Like this one. \n Hunter-gatherers\n Noble or savage?\n Dec 19th 2007\n From The Economist print edition\n \n The era of the hunter-gatherer was not the social and environmental Eden that some suggest\n \n HUMAN beings have spent most of their time on the planet as hunter-gatherers. From at least 85,000 years ago to the birth of agriculture around 73,000 years later, they combined hunted meat with gathered veg. Some people, such as those on North Sentinel Island in the Andaman Sea, still do. The Sentinelese are the only hunter-gatherers who still resist contact with the outside world. Fine-looking specimens-strong, slim, fit, black and stark naked except for a small plant-fibre belt round the waist-they are the very model of the noble savage. Genetics suggests that indigenous Andaman islanders have been isolated since the very first expansion out of Africa more than 60,000 years ago.\n \n About 12,000 years ago people embarked on an experiment called agriculture and some say that they, and their planet, have never recovered. Farming brought a population explosion, protein and vitamin deficiency, new diseases and deforestation. Human height actually shrank by nearly six inches after the first adoption of crops in the Near East. So was agriculture \"the worst mistake in the history of the human race\", as Jared Diamond, evolutionary biologist and professor of geography at the University of California, Los Angeles, once called it?\n \n \n Take a snapshot of the old world 15,000 years ago. Except for bits of Siberia, it was full of a new and clever kind of people who had originated in Africa and had colonised first their own continent, then Asia, Australia and Europe, and were on the brink of populating the Americas. They had spear throwers, boats, needles, adzes, nets. They painted pictures, decorated their bodies and believed in spirits. They traded foods, shells, raw materials and ideas. They sang songs, told stories and prepared herbal medicines.\n According to the bolded above, you are way off in your understanding of the perceived history. So I repeat my question; since humans have lived in shared communal societies for at least 75,000 years, and were advanced enough to cave paint which was one form of communicating events such as hunts, why is it that no known written languages appeared until such time which correlates with the biblical account of Mans creation? Could it be even remotely possible that secular science has misinterpreted the so called evidence which they base so many assumptions upon?", 
   {
    "unicode_changes_made": true
   }, 
   326274, 
   null, 
   1223137680.0
  ], 
  [
   326297, 
   null, 
   "Jo Bennett", 
   "The simpler answer is that written records are not a necessary pre-requisite for a society. Many native american cultures had no written records, but did have a rich and complex oral tradition, for example. Prior to the development of writing, it's likely that most, if not all, cultures relied on the oral tradition. There is certainly evidence that Jewish culture featured both an oral and a written Torah.", 
   {}, 
   326287, 
   null, 
   1223143740.0
  ], 
  [
   326299, 
   null, 
   "Archangel", 
   "The simpler answer is that written records are not a necessary pre-requisite for a society. Many native american cultures had no written records, but did have a rich and complex oral tradition, for example. Prior to the development of writing, it's likely that most, if not all, cultures relied on the oral tradition. There is certainly evidence that Jewish culture featured both an oral and a written Torah.\n\n \n That's all well and good Jo, for another debate that is. Because this debate is titled \"What's the earliest known forms of written history?\" And that question naturally begs the other question regarding the inconsistency of evolutionists claims of homo sapien having been around for so long, yet never learning to create a written language, when according to Creationism, we had a written language almost since the moment of creation. \n \n My link explains in practical terms a rational and reasonable history of written language, yet it is dismissed out of hand. HERE it is again for consideration.", 
   {}, 
   326297, 
   null, 
   1223144700.0
  ], 
  [
   326306, 
   null, 
   "T.Q", 
   "Interesting, so you're saying that prior to 5,000 years ago human beings were solitary creatures rather than socialized?\n\n Sorry, I thought you might actually have a clue there for a second. No, what I'm saying is prior to 5K years ago, \"civilization\" as we understand it-stable communities with division of labour-didn't exist.\n \n \nAccording to the bolded above, you are way off in your understanding of the perceived history.\n\n Actually, that would be you.\n \n \nSo I repeat my question; since humans have lived in shared communal societies for at least 75,000 years, and were advanced enough to cave paint which was one form of communicating events such as hunts, why is it that no known written languages appeared until such time which correlates with the biblical account of Mans creation? Could it be even remotely possible that secular science has misinterpreted the so called evidence which they base so many assumptions upon?\n\n Already answered. And when will you actually list some of these \"assumptions\", since there are so many of them?", 
   {}, 
   326287, 
   null, 
   1223147940.0
  ], 
  [
   326307, 
   null, 
   "T.Q", 
   "That's all well and good Jo, for another debate that is. Because this debate is titled \"What's the earliest known forms of written history?\" And that question naturally begs the other question regarding the inconsistency of evolutionists claims of homo sapien having been around for so long, yet never learning to create a written language, when according to Creationism, we had a written language almost since the moment of creation. \n\n As Jo already explained, writing is not a prerequisite for civilization, as is demonstrated by the Native Americans. \n \n \nMy link explains in practical terms a rational and reasonable history of written language, yet it is dismissed out of hand. HERE it is again for consideration.\n\n \n If all else fails, repeat ad nauseam...", 
   {}, 
   326299, 
   null, 
   1223148060.0
  ], 
  [
   326317, 
   null, 
   "Archangel", 
   "As Jo already explained, writing is not a prerequisite for civilization, as is demonstrated by the Native Americans. \n\n \n Just because a written language isn't necessarily a prerequisite for a civilization, and I never implied that it is, It has proven to be the norm rather than the exception throughout the history of mankind. Even the primitive cave drawings were intended to send a message, tell a story and keep a record of an event or events to the contemporaries and future generations who viewed them. \n \n It was both proven to be and accepted as a more reliable way of sending historical facts and the cultural beliefs of a people into the future.\n \n \nSorry, I thought you might actually have a clue there for a second. No, what I'm saying is prior to 5K years ago, \"civilization\" as we understand it-stable communities with division of labour-didn't exist.\n \n\n \n Really? Prove it. Every thing I've come to understand about hunter gatherer societies was that they were very successful social communities which cooperated with their neighboring communities based on each villages particular strengths. Some hunted, some fished, others grew corn and still others grew wheat for bread. And they all traded amongst each other for a larger very egalitarian society that blossomed in peace and harmony. It was these very types of cooperatives that led to the need for written languages and record keeping. It's called social evolution tq. ;)", 
   {}, 
   326307, 
   null, 
   1223156100.0
  ], 
  [
   326322, 
   null, 
   "Jo Bennett", 
   "Maintaining written records requires both the means and the necessity. The means to create paper, parchment or papyrus requires a certain level of civilisation, and a civilisation is unlikely to invent the requisite objects without need, which again implies a sophisticated and widespread social structure so as to require the written record. I wonder whether in 10,000 years the lack of electronic data from before 1950 will be considered evidence by followers of a new fundamentalism of the world not existing much before that. The principle is largely the same.", 
   {}, 
   326317, 
   null, 
   1223157780.0
  ], 
  [
   326344, 
   null, 
   "Archangel", 
   "Maintaining written records requires both the means and the necessity. The means to create paper, parchment or papyrus requires a certain level of civilisation, and a civilisation is unlikely to invent the requisite objects without need, which again implies a sophisticated and widespread social structure so as to require the written record. I wonder whether in 10,000 years the lack of electronic data from before 1950 will be considered evidence by followers of a new fundamentalism of the world not existing much before that. The principle is largely the same.\n\n \n You're just making excuses now, and not very good ones at that. We know that the earliest forms of record keeping were also the longest lasting as they were carved into stone as the very examples we have posted above prove. Look at the Egyptian hieroglyphics and the Aztec and Mayan Glyphs which have survived the centuries and millennia? The very rosetta stone that allowed us to finally translate hieroglyphics was written in stone.\n \n http://www.britishmuseum.org/images/an16456b_l.jpg\n \n So let's not forget how creative and imaginative our ancient ancestors were.", 
   {}, 
   326322, 
   null, 
   1223165700.0
  ], 
  [
   326370, 
   null, 
   "Brigid", 
   "You're just making excuses now, and not very good ones at that. We know that the earliest forms of record keeping were also the longest lasting as they were carved into stone as the very examples we have posted above prove. Look at the Egyptian hieroglyphics and the Aztec and Mayan Glyphs which have survived the centuries and millennia? The very rosetta stone that allowed us to finally translate hieroglyphics was written in stone.\n \n http://www.britishmuseum.org/images/an16456b_l.jpg\n \n So let's not forget how creative and imaginative our ancient ancestors were.\n\n \n Which existed before Hebrews.............................", 
   {}, 
   326344, 
   null, 
   1223183520.0
  ], 
  [
   326373, 
   null, 
   "T.Q", 
   "JReally? Prove it.\n\n Wait, you want me to prove that civilization didn't exist prior to about 5K years ago? Tell you what champ, you prove it did, as it's tough to prove the non existence of something.\n \n \nEvery thing I've come to understand about hunter gatherer societies was that they were very successful social communities which cooperated with their neighboring communities based on each villages particular strengths. Some hunted, some fished, others grew corn and still others grew wheat for bread. And they all traded amongst each other for a larger very egalitarian society that blossomed in peace and harmony. It was these very types of cooperatives that led to the need for written languages and record keeping. It's called social evolution tq. ;)\n\n Someone's been watching Disney movies again, haven't they?", 
   {}, 
   326317, 
   null, 
   1223187060.0
  ], 
  [
   326377, 
   null, 
   "Archangel", 
   "Wait, you want me to prove that civilization didn't exist prior to about 5K years ago? Tell you what champ, you prove it did, as it's tough to prove the non existence of something.\n\n \n Here you go, educate yourself. It's a sin not to know what your own religion of evo say's about your origins. \n Some texts will explain that the Old Stone Age (the Paleolithic Age (50000 to 12000 BC) ) is the Age of food-gatherers, while the New Stone Age (the New Stone Age or the Neolithic Age (12000 to 4000 BC)) is referred to as the Age of food producers. This puts the Bronze age onwards as the Age of civilization, starting towards the end of the Neolithic Age. In the below discussion, I will look at three major lifestyle groupings:\n \n Hunter gatherer,\n Agriculture and\n Technological civilisation.\n The third is a complex grouping. Civilization requires, or may be defined by, settlement in definite territories, the building of towns and cities, the evolution of defined systems of government and the development of trade and commerce. This social system has and does exist together with the first two.http://www.ecotao.com/holism/hu_mod.htm\n \n Notice that the period in question goes back to 12,000 BC, not the 5,000 years you have asserted which would have been only at 3000 BC.", 
   {}, 
   326373, 
   null, 
   1223190540.0
  ], 
  [
   326384, 
   null, 
   "T.Q", 
   "Here you go, educate yourself. It's a sin not to know what your own religion of evo say's about your origins. \n [INDENT][I][SIZE=&quot;3&quot;][COLOR=&quot;Navy&quot;]Some texts will explain that the Old Stone Age (the Paleolithic Age (50000 to 12000 BC) ) is the Age of food-gatherers, while the New Stone Age (the New Stone Age or the Neolithic Age (12000 to 4000 BC)) is referred to as the Age of food producers. This puts the Bronze age onwards as the Age of civilization, starting towards the end of the Neolithic Age. \n \n Notice that the period in question goes back to 12,000 BC, not the 5,000 years you have asserted which would have been only at 3000 BC.\n\n \n Notice that it states it is towards the end of the Neolithic, which would put it at 4000 BC, which is pretty close to \"about 5K years ago\" like I said, and nowhere near 12 000 BC, or 14K years ago like you state it says.\n \n Stop embarassing yourself already.", 
   {}, 
   326377, 
   null, 
   1223206140.0
  ], 
  [
   326388, 
   null, 
   "Archangel", 
   "The only thing I'm embarrassed about is attempting to reason with you. Even posting and highlighting the evidence isn't enough to convince you of your error.", 
   {}, 
   326384, 
   null, 
   1223215020.0
  ], 
  [
   326404, 
   null, 
   "T.Q", 
   "The only thing I'm embarrassed about is attempting to reason with you. Even posting and highlighting the evidence isn't enough to convince you of your error.\n\n \n That would be because I didn't make an error. I said \"about 5 000 years ago\". Your link says \"4 000 BC\", which is about 6 000 years ago-which is pretty close to what I said.\n \n It does not say 14 000 years ago like you claim it does, and it definitely does not say 100 000 years ago like you claimed earlier.\n \n In other words, your inability to read and do math have caused you embarassment once again.", 
   {}, 
   326388, 
   null, 
   1223227860.0
  ], 
  [
   326691, 
   null, 
   "isly ilwott", 
   "Close, but no cigar. Art is not writing.\nHowever, the cave drawings record for us the historical fact that the depicted animals existed then. Why does this not qualify as history?", 
   {}, 
   326052, 
   null, 
   1223415480.0
  ], 
  [
   331065, 
   null, 
   "Winston Smith", 
   "How about 32000 years ago?\n \n Cave painting - Wikipedia, the free encyclopedia\n \n \n Do I win a prize?\n\n \n drawings are not words", 
   {}, 
   325984, 
   null, 
   1225793940.0
  ], 
  [
   331066, 
   null, 
   "Winston Smith", 
   "However, the cave drawings record for us the historical fact that the depicted animals existed then. Why does this not qualify as history?\n\n \n \n It is not a record of events", 
   {}, 
   326691, 
   null, 
   1225794120.0
  ], 
  [
   331166, 
   null, 
   "Baron", 
   "Look what the cat dragged in. The expert on all subjects known to man.", 
   {
    "post_info": {
     "post_title": "Holy ####!"
    }
   }, 
   331066, 
   null, 
   1225869720.0
  ], 
  [
   331179, 
   null, 
   "Winston Smith", 
   "oh! dumb is here, so where is dumber ?\n \n still spewing poison at DS I presume? emoticon_xbye", 
   {}, 
   331166, 
   null, 
   1225881060.0
  ], 
  [
   333068, 
   null, 
   "mae", 
   "Look what the cat dragged in. The expert on all subjects known to man.\n\n \n LOL!\n \n I guess Mongoose didn't have the audience he craved.\n \n Anyway, can't wait for Winnie's dramatic farewells if people don't fawn over every word he writes.", 
   {}, 
   331166, 
   null, 
   1226886060.0
  ], 
  [
   333112, 
   null, 
   "peteratwar", 
   "If you haven't got words pictures will do to provide a record of what went on.", 
   {}, 
   333068, 
   null, 
   1226926920.0
  ], 
  [
   333387, 
   null, 
   "mae", 
   "If you haven't got words pictures will do to provide a record of what went on.\n\n \n Long time no see Peter.\n \n I guess you are referring to Baron's and my comments about good ole winston?", 
   {}, 
   333112, 
   null, 
   1227064740.0
  ], 
  [
   334023, 
   null, 
   "peteratwar", 
   "Yep!\n \n Still around, still visit & log in when I want to say something.\n \n Seems strange but I can log in a year later and still the same old battles are being fought!", 
   {}, 
   333387, 
   null, 
   1227540660.0
  ], 
  [
   334180, 
   null, 
   "Joel_Henderson", 
   "The thread topic says it all pretty much. I was just bored and wondering if anyone knew what are the earliest documents we posses of mankind. Thanks ahead of time.\n\n \n Cave-drawings, DUH!", 
   {}, 
   176610, 
   null, 
   1227616140.0
  ], 
  [
   334188, 
   null, 
   "Archangel", 
   "Here's an example of a cave drawing which has rocked the scientific world. And it shows that Cave Paintings definitely tell a story, but not an easy story to interpret. \n \n My interpretation of it is different than both given in the link. I can't explain the hunters state of arousal, but it might reflect his love for the hunt. Or it might represent what the first critique suggests. But if the horse knows the man, why is he hiding in the shadows and why does he need the club rather than rope to restrain him if sex is his goal?\n \n But I interpret the shadows that show him in the dark, and the front half of the horse in the dark with the horses rear in the light, and the corresponding light matching up on the cave wall as him lying in wait for the horse as it passes him when he then clubs it. Either to catch it as transportation or to kill it for food.\n UnNews:Cave painting rocks scientific world - Uncyclopedia, the content-free encyclopedia\n \n And here are stock photos of numerous other cave paintings which have been discovered.\n \n Cave painting Stock Photo Images. 342 Cave painting royalty free images and photography available to buy from over 100 stock photo companies.", 
   {}, 
   334180, 
   null, 
   1227632160.0
  ], 
  [
   334206, 
   null, 
   "T.Q", 
   "We really need a \"face/palm\" emoticon on this board for when Archie posts...\n \n Archie, google \"uncyclopedia\".\n \n How many times have you been told to fact check?\n \n Did you even read the article?", 
   {}, 
   334188, 
   null, 
   1227642300.0
  ], 
  [
   334216, 
   null, 
   "Archangel", 
   "We really need a \"face/palm\" emoticon on this board for when Archie posts...\n \n Archie, google \"uncyclopedia\".\n \n How many times have you been told to fact check?\n \n Did you even read the article?\n\n emoticon_frazzled emoticon_emb I read the explanations and disagreed with them so I gave my own interpretation of the paintings meaning. But I did take it at face value that it was a serious article. After looking more closely, I'm embarrassed that I didn't see that it's not based in fact. Thanks for pointing it out. I'll know better regarding that site in the future. emoticon_xgood", 
   {}, 
   334206, 
   null, 
   1227643260.0
  ], 
  [
   334238, 
   null, 
   "T.Q", 
   "emoticon_frazzled emoticon_emb I read the explanations and disagreed with them so I gave my own interpretation of the paintings meaning. But I did take it at face value that it was a serious article. After looking more closely, I'm embarrassed that I didn't see that it's not based in fact. Thanks for pointing it out. I'll know better regarding that site in the future. emoticon_xgood\n\n \n You're welcome.", 
   {}, 
   334216, 
   null, 
   1227646260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What's the earliest known forms of written history?", 
  "url": "http://www.4forums.com/political/history-debates/6750-whats-earliest-known-forms-written-history.html", 
  "breadcrumbs": [
   "History"
  ], 
  "id_number": 6750, 
  "discussion_files": [
   [
    "11457.html", 
    "http://www.4forums.com/political/history-debates/6750-whats-earliest-known-forms-written-history-print.html"
   ], 
   [
    "11458.html", 
    "http://www.4forums.com/political/history-debates/6750-whats-earliest-known-forms-written-history-3-print.html"
   ], 
   [
    "11459.html", 
    "http://www.4forums.com/political/history-debates/6750-whats-earliest-known-forms-written-history-2-print.html"
   ]
  ], 
  "identifier": 6750
 }
]