[
 [
  [
   176612, 
   null, 
   "Bassman", 
   "After going through some of these threads, I've found an inherent bias against people without a college degree. As far as I'm concerned, higher education is not for everybody because the following questions keep coming up. What about the person who would rather focus on the skilled trades. And what about the person who just does not have the desire for college? Your thoughts?", 
   {
    "post_info": {
     "post_title": "Book Smart versus Street Smart"
    }
   }, 
   null, 
   null, 
   1130972640.0
  ], 
  [
   176623, 
   null, 
   "lord tammerlain", 
   "The skilled trades are in hot demand, with many offering wages/salaries higher then all but the most in demand University degree's. As some people do prefer to create with their physical labor instead of sitting behind a desk I say more power to them.\n \n In the booming Fort Mac area of Alberta skilled tradesmen from millwright (sp), welders, Instrumentation Tech etc, can command wages of $100 000 plus. If what I was told once, Fort Mac has the most HD motorcycles per capita in North America. Overall not a bad choice to have made when exiting from High School. Better then getting a Poly Sci degree that generally qualifies one as a dishwasher at a hotel.", 
   {}, 
   176612, 
   null, 
   1130974080.0
  ], 
  [
   176628, 
   null, 
   "Bassman", 
   "I think that life experience is far more invaluable than any degree can offer. Now, don't get me wrong, I'm not knocking college altogether. I'm concerned about the mentality that a college degree is the only way to succeed in life.", 
   {}, 
   176623, 
   null, 
   1130975760.0
  ], 
  [
   176641, 
   null, 
   "Waxy", 
   "I think that life experience is far more invaluable than any degree can offer. Now, don't get me wrong, I'm not knocking college altogether. I'm concerned about the mentality that a college degree is the only way to succeed in life.\n\n \n Not necessarily a college degree, but some form of post secondary education is required IMHO.\n \n Trying to get by in this world with only a high school education is something only the very few can manage, and even fewer successfully.\n \n I encourage people all the time who don't want to go to university to go to a technical school or pick up a trade and become a journeyman. In Alberta right now, as Lord Tammerlain has already noted, most journey are capable of making FAR more money than I do, straight out of school, and I have a MSc.\n \n I certainly don't look down my nose at skilled workers and tradesmen, they make things happen in my world, and I was, I guess still am, one of them.\n \n Waxy\n \n P.S. I haven't noticed any negativity towards those without college degrees on this site, though discussions often do beocme quite involved and techincal, so a greater knowlegde base is often an asset.", 
   {}, 
   176628, 
   null, 
   1130977860.0
  ], 
  [
   176647, 
   null, 
   "Bassman", 
   "I'm not so sure that I can agree that some type of post secondary education is necessarily \"required,\" IMHO. What about the person who just has no interest in college, but has been out in the world? That's my concern. BTW, if this qualifies as \"post secondary education,\" I have a Class-A Commercial Driver's Licence, which means I can drive anything from a tractor-trailer on down.", 
   {}, 
   176641, 
   null, 
   1130978160.0
  ], 
  [
   176656, 
   null, 
   "sinjin", 
   "I'm not so sure that I can agree that some type of post secondary education is necessarily \"required,\" IMHO. What about the person who just has no interest in college, but has been out in the world? That's my concern. BTW, if this qualifies as \"post secondary education,\" I have a Class-A Commercial Driver's Licence, which means I can drive anything from a tractor-trailer on down.\n\n \n Out in what world? Working class America is not the world. No interest in college = no intellectual drive. Haven't gone to college? Fine. Ever read anything besides pulp and/or the Bible? \n \n If everyone went to college who'd watch wrestling or Nascar?", 
   {}, 
   176647, 
   null, 
   1130979300.0
  ], 
  [
   176662, 
   null, 
   "georged", 
   "I don't consider a degree in itself a magic bean, but anyone who stays on track for the necessary period of time to achieve a secondary education presents two important facets about that person's abilities; follow-through and a open mind seeking intellectual satisfaction. Both are developed by that individual and serve anyone well throughout life. \n \n It was either Dono or Waxy who quoted that familiar saying many of us have heard 'A degree is a ticket to a dance, how one dances is what's important'.\n Many dances are closed to those without degrees and in most cases the proper degree will offer far greater lifetime earnings than being without. \n \n As society continues to expand technical industrialization, skilled and unskilled labor without secondary education will in general become less and less valuable. For a future picture of labor in a global society, look at developing nations such as India and China. While their labor costs will rise with time, competing nations will have to reduce their labor costs across the board or face mass, unaffordable social consequences.", 
   {}, 
   176656, 
   null, 
   1130981100.0
  ], 
  [
   176676, 
   null, 
   "Dono", 
   "Out in what world? Working class America is not the world. No interest in college = no intellectual drive. Haven't gone to college? Fine. Ever read anything besides pulp and/or the Bible? \n \n If everyone went to college who'd watch wrestling or Nascar?\n\n I have to disagree somewhat. I have known people who did not finish high school who held patients, could discuss Shakespeare, Kepler or Chaucer and accumulated great wealth. I have known many with letters that I considered XXXXXX. The key is the \"intellectual drive\" you mention, and while college is the best path, it is not the only path.\n I passed Texas Speedway yesterday.Two large parking lots were filled with RV's ranging from campers to half million $$ motor homes, all enjoying a big BBQ party while waiting for Sunday's NASCAR race. I'd wager that you could find many degreed fans on those lots, but probably not a single elitist in the bunch.\n Dono", 
   {}, 
   176656, 
   null, 
   1130982540.0
  ], 
  [
   176680, 
   null, 
   "Diogenes99", 
   "I have to agree that education is not the same thing as schooling, and education is far more important. Successful college dropouts who come to mind are Bill Gates and Michael Dell, and Richard Branson didn't even finish high school.\n \n That said, our secondary schools could spend a lot more time teaching more useful subjects than putting a condom on a bannana and by adopting higher standards so a prospective employer could be sure from the high school diploma that the applicant actually knew how to read.", 
   {}, 
   176676, 
   null, 
   1130983140.0
  ], 
  [
   176715, 
   null, 
   "daewoo", 
   "I personally put a lot more faith in a persons track record than their educational pedigree. At the same time, for many positions, a degree is required. If you want to be a tradesman, thats fine. I have known some damn fine machinists who made ridiculously large amounts of money. At the same time, those guys all seemed to like to complain about their supervisor, no matter who it was, and the fact that he had his job because he had a degree. \n \n Moral of the story, if you want to make a decent living, it probably does not matter whether you have a degree or not. If you want to make a fortune and have power, you probably should have one. \n \n In the end, I think the smart choice anymore is to get a degree if you can. You will never be limited by the fact that you have one, but you will find you are limited if you do not. \n \n Personally, I have never found my degrees to be especially useful. I would not be where I am without them, though. They provide a basic reference regarding your skill set and potential.", 
   {}, 
   176680, 
   null, 
   1130995560.0
  ], 
  [
   176717, 
   null, 
   "Bassman", 
   "I have to agree that education is not the same thing as schooling, and education is far more important. Successful college dropouts who come to mind are Bill Gates and Michael Dell, and Richard Branson didn't even finish high school.\n\n Rush Limbaugh never got a degree and is very successful.\n \nThat said, our secondary schools could spend a lot more time teaching more useful subjects than putting a condom on a bannana and by adopting higher standards so a prospective employer could be sure from the high school diploma that the applicant actually knew how to read.\n\n Agreed. BTW, I have a thread in this forum that addresses the very issue of academic standards in this forum:\"Success of Charter Schools; Traditional public schools have lost their monopoly\" Check it out. (shameless plug)", 
   {}, 
   176680, 
   null, 
   1130996220.0
  ], 
  [
   176725, 
   null, 
   "Dono", 
   "Rush Limbaugh never got a degree and is very successful.\n \n\n True, but being a successful windbag is much different from Dell, Branson and Gates building successful businesses that employ thousands.\n Dono", 
   {}, 
   176717, 
   null, 
   1131000000.0
  ], 
  [
   176730, 
   null, 
   "Bassman", 
   "But a very entertaining windbag. I'll give you that.", 
   {}, 
   176725, 
   null, 
   1131000960.0
  ], 
  [
   176827, 
   null, 
   "Diogenes99", 
   "True, but being a successful windbag is much different from Dell, Branson and Gates building successful businesses that employ thousands.\nA free market rewards contribution, and the income of any individual is a consequence of that individual's contribution to society. I can understand your feelings about Rush - I feel the same way about Al Franken, Wacko Jacko, Madonna, and most of the rap industry - but it's a collective market decision, and not up to any individual or group.", 
   {}, 
   176725, 
   null, 
   1131044220.0
  ], 
  [
   181203, 
   null, 
   "Bassman", 
   "Before this thread gets so stale that... well you know.\n \n Some people are still under the impression that a college education is the end-all, be-all. I still don't buy into that because not everyone has the interest in college. Many people, such as myself, prefer to work with their hands.", 
   {}, 
   176827, 
   null, 
   1132813320.0
  ], 
  [
   181218, 
   null, 
   "Iuris", 
   "Ignorance is nothing to be proud of. One should never accept his own ignorance, even though it is impossible to know everything. While colleges don't remove it entirely and are not the only way to remove it, they go a long way.\n \n The fact that many who go to college fail to use the chances offered to them fully and that some of them are not serious or ambitious does not counter the above. Adress these issues directly, not by attacking colleges as a whole.\n \n P.S. One advantage of going to college that a good college should offer is teaching students how to learn.", 
   {}, 
   181203, 
   null, 
   1132833660.0
  ], 
  [
   181255, 
   null, 
   "Alan Ryan", 
   "\n Some people are still under the impression that a college education is the end-all, be-all. I still don't buy into that because not everyone has the interest in college. Many people, such as myself, prefer to work with their hands.\n\n \n I don't think people who prefer to work with their hands should be defensive about it.\n \n I have heard it claimed that a university education (regardless of the utility of the degree) develops \"transferable abilities\" that can be applied in almost any job etc. This might be true. I'm less skeptical about the great advantage of studying with some of the first class intellects one encounters at university - this can help realise your potential and reveal your limitations with equal benefit.\n \n One positive of a college education I would accentuate, is the intellectual self-confidence it can inspire - including the confidence to say \"I was wrong\".", 
   {}, 
   181203, 
   null, 
   1132852800.0
  ], 
  [
   181276, 
   null, 
   "Bassman", 
   "That's all well and good, but my original contention still remains: College is not for everyone.", 
   {}, 
   181255, 
   null, 
   1132857480.0
  ], 
  [
   181279, 
   null, 
   "Diogenes99", 
   "Agreed that book-learning is only a means to an end. Some folks have to read a lot of books before they can start making a contribution to society, other folks write the books.", 
   {}, 
   181203, 
   null, 
   1132857960.0
  ], 
  [
   181282, 
   null, 
   "Alan Ryan", 
   "That's all well and good, but my original contention still remains: College is not for everyone.\n\n \n That's a pretty commonplace assertion - which seems to close out the supposition that you were interested in discussing the pros and cons.", 
   {}, 
   181276, 
   null, 
   1132858320.0
  ], 
  [
   181395, 
   null, 
   "Iuris", 
   "I must say this thread was like an epiphany for me. I'm finally beginning to \"get\" Bassman.", 
   {}, 
   181282, 
   null, 
   1132911060.0
  ], 
  [
   181409, 
   null, 
   "Bassman", 
   "Oh, how do you figure? That you think that I'm just some uneducated bloak? Nice try.", 
   {}, 
   181395, 
   null, 
   1132927080.0
  ], 
  [
   181415, 
   null, 
   "Iuris", 
   "No, it refers to this bit:\n \n \nSome people are still under the impression that a college education is the end-all, be-all. I still don't buy into that because not everyone has the interest in college. Many people, such as myself, prefer to work with their hands.\n\n \n It explains your dismissive attitude to academic approaches in other threads, which always struck me as weird.", 
   {}, 
   181409, 
   null, 
   1132930380.0
  ], 
  [
   181426, 
   null, 
   "billsco", 
   "Yes, it's the snobbery encountered by those who choose not to pursue further education that is difficult to swallow. It is open contempt for the people who have, and for the institutions. The tirades against higher education usually end with statements by the bloviator how intellectually superior he is over the \"book smart\" people.", 
   {}, 
   181415, 
   null, 
   1132935000.0
  ], 
  [
   181428, 
   null, 
   "georged", 
   "\n One positive of a college education I would accentuate, is the intellectual self-confidence it can inspire - including the confidence to say \"I was wrong\".\n\n \n That's one of the major values, opening the mind and beginning a never-ending search for knowledge. I look back and still find myself amazed at some of the preconceived baggage I was carrying before achieving a intellectual level of self-confidence to question and evaluate all facets of my life. Sleep deprivation for extended years while immersed in academic pursuits, including very important social exposure and exchanges will open a mind.", 
   {}, 
   181255, 
   null, 
   1132935900.0
  ], 
  [
   181431, 
   null, 
   "Alan Ryan", 
   "That's one of the major values, opening the mind and beginning a never-ending search for knowledge. \n\n \n If the cultivation of the higher cognitive abilities could be condensed into just one thing more than any other, it is surely learning the grounds of one's own opinions. But this intellectual development doesn't stop at graduation; as you observe, it continues for a lifetime.\n \n On the other hand, there is no joy more profound or enduring than that of being a complete numbskull.", 
   {}, 
   181428, 
   null, 
   1132939200.0
  ], 
  [
   181440, 
   null, 
   "Diogenes99", 
   "Yes, it's the snobbery encountered by those who choose not to pursue further education that is difficult to swallow. It is open contempt for the people who have, and for the institutions. The tirades against higher education usually end with statements by the bloviator how intellectually superior he is over the \"book smart\" people.\nThere is a lot of truth in that. I once encountered an old high school classmate who had just received his PhD in sociology. I remembered him as a pleasant enough guy, not the sharpest knife in the drawer, but he seemed quite full of himself with his recent academic achievement and was a bit condescending toward me with my little old BS in math. After we had chatted for a while, I got the distinct impression that he had mastered the art of book learning: if you gave him a book on identifying birds, he would disappear for six months and emerge able to identify any silhouette in the book and give you the name of the bird, Latin name, mating habits, nesting habits, range, number and color of eggs, etc. But if you took him outside, he would be hard pressed to distinguish between a duck and a sparrow.\n \n As he was unable to do anything useful with his book knowledge, he is comfortably settled in academia teaching advanced sociology courses.", 
   {}, 
   181426, 
   null, 
   1132946580.0
  ], 
  [
   181444, 
   null, 
   "georged", 
   "\n As he was unable to do anything useful with his book knowledge, he is comfortably settled in academia teaching advanced sociology courses.\n\n \n I consider that a very important contribution to society. Some people are doers, others teach their knowledge. Without teachers within academic structures, the pool of doers contributing to advancements in society would quickly vanish.", 
   {}, 
   181440, 
   null, 
   1132947720.0
  ], 
  [
   181459, 
   null, 
   "Dono", 
   "Perhaps I am not as astute as Bassman because I have failed to pick up on \"an inherent bias against people without a college degree\". I believe most here judge based on the content of the posts rather than the school time of the poster. Since our signatures do not reflect any letters we may or may not have earned, we each paint a self portrait of how educated we are by the words we place before others to consider. The \"inherent bias against people without a college degree\" may just reflect the picture that was painted. \n Dono", 
   {}, 
   181203, 
   null, 
   1132951620.0
  ], 
  [
   181518, 
   null, 
   "Bassman", 
   "Dono, altough we don't see eye-to-eye on most subjects, here I agree with you. :)", 
   {}, 
   181459, 
   null, 
   1132982460.0
  ], 
  [
   181570, 
   null, 
   "zachvac", 
   "There is a lot of truth in that. I once encountered an old high school classmate who had just received his PhD in sociology. I remembered him as a pleasant enough guy, not the sharpest knife in the drawer, but he seemed quite full of himself with his recent academic achievement and was a bit condescending toward me with my little old BS in math. After we had chatted for a while, I got the distinct impression that he had mastered the art of book learning: if you gave him a book on identifying birds, he would disappear for six months and emerge able to identify any silhouette in the book and give you the name of the bird, Latin name, mating habits, nesting habits, range, number and color of eggs, etc. But if you took him outside, he would be hard pressed to distinguish between a duck and a sparrow.\n \n As he was unable to do anything useful with his book knowledge, he is comfortably settled in academia teaching advanced sociology courses.\n\n \n I don't think that's what Bilsco was saying, but I'll address your statement here.\n \n I completely agree. These are the kinds of people who can conjugate any verb in a foreign language by the book yet are unable to actually speak that language. Our education is focused on passing tests that really have nothing to do with the skill taught.\n \n Our high school French oral exams were given to us (not the question, the answer) by our teacher to copy down the night before. We could either memorize it and recite it from memory, or we could wait until we actually got the question and practice our actual language skills. Guess what most people did?\n \n Now I don't know what college education is like or what it takes to get a pHD, but high school \"success\" (grades) isn't based on whether you actually know anything. I hoped college would be better, hopefully you actually learn something on the topic rather than how to pass a test on it? One would hope.", 
   {}, 
   181440, 
   null, 
   1132991580.0
  ], 
  [
   181600, 
   null, 
   "Alan Ryan", 
   "\n Now I don't know what college education is like or what it takes to get a pHD, but high school \"success\" (grades) isn't based on whether you actually know anything. I hoped college would be better, hopefully you actually learn something on the topic rather than how to pass a test on it? One would hope.\n\n \n How much learning you do \"on topic\" at university, is up to you. Whether you chose to attend lectures and tutorials or spend time carousing with your student friends, is up to you. Whether you keep up with the required reading is up to you. In theory, if the faculty is up to scratch, the quality of education you get at college is under your control.\n \n At least this laissez-faire approach to an arts degree applied \"in my day\" at a British university - where the emphasis was on private study. Obviously, science students have less flexibility; they have to put in lots of time in the laboratory or in the field etc. They have fewer opportunities to be lazy.\n \n If you are a diligent student, you will of course learn a great deal from your professors and from personal tutorials; but you will also profit, I guess, from interacting with smart students who might know a lot more than you do.", 
   {}, 
   181570, 
   null, 
   1133004420.0
  ], 
  [
   181622, 
   null, 
   "georged", 
   "\n If you are a diligent student, you will of course learn a great deal from your professors and from personal tutorials; but you will also profit, I guess, from interacting with smart students who might know a lot more than you do.\n\n \n For me that interaction was one of the more important factors in being able to open my mind and accept intellectual exposure as personal growth rather than remaining somewhat shielded from reality by my limited experience within society. Most of us are pretty much a sum of our education and experience at any stage of life and there are always some truly bright people out there to learn from. If we're smart enough to listen.", 
   {}, 
   181600, 
   null, 
   1133023500.0
  ], 
  [
   181629, 
   null, 
   "Jo Bennett", 
   "It's very difficult to get a PhD without understanding what you're doing. Sure, what you're doing might not have any applicability, but that's very different from just learning what someone else has written. In this country the award of a PhD requires an \"original contribution to knowledge\".", 
   {}, 
   181622, 
   null, 
   1133026800.0
  ], 
  [
   181657, 
   null, 
   "Obvious Child", 
   "I don't know who does or doesn't have a degree here apart from Bassman, and that's only because of this thread and the occasional attacks on the 'eggheads' or 'narrowheads' or whatever derogortary term he uses for academics.\n \n One of the benefits (and dangers) of these forums is that you mix with different ages and backgrounds and cannot quickly put people into boxes. People often DO, but they may well get it wrong (I have seen age, sex, education level and religious stance all completely misread here and elsewhere).", 
   {}, 
   181629, 
   null, 
   1133035860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Book Smart versus Street Smart", 
  "url": "http://www.4forums.com/political/education-debates/6751-book-smart-versus-street-smart.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 6751, 
  "discussion_files": [
   [
    "7809.html", 
    "http://www.4forums.com/political/education-debates/6751-book-smart-versus-street-smart-print.html"
   ], 
   [
    "7810.html", 
    "http://www.4forums.com/political/education-debates/6751-book-smart-versus-street-smart-3-print.html"
   ], 
   [
    "7811.html", 
    "http://www.4forums.com/political/education-debates/6751-book-smart-versus-street-smart-2-print.html"
   ]
  ], 
  "identifier": 6751
 }
]