[
 [
  [
   176839, 
   null, 
   "Bud Light Man", 
   "I'm not trying to be critical of anyone's knowledge here but it seems from what I've seen in these forums and specifically in the religious ones people all seem to have a vast knowledge of greek, hebrew, and biblical doctrine in general. I was just wondering where everyone knew all the greek and hebrew meanings. \n \n I find it humorous to see the one's who bash the God theory the most know their Bible fairly well. \n \n Anyways, I'm no doctor or professor, that's obvious from my name I think, but I guess I have some knowlegde just nothing equivalent to most of you.", 
   {
    "post_info": {
     "post_title": "Credentials???"
    }
   }, 
   null, 
   null, 
   1131050220.0
  ], 
  [
   176841, 
   null, 
   "Kronus", 
   "I'm not trying to be critical of anyone's knowledge here but it seems from what I've seen in these forums and specifically in the religious ones people all seem to have a vast knowledge of greek, hebrew, and biblical doctrine in general. I was just wondering where everyone knew all the greek and hebrew meanings. \n \n I find it humorous to see the one's who bash the God theory the most know their Bible fairly well. \n \n Anyways, I'm no doctor or professor, that's obvious from my name I think, but I guess I have some knowlegde just nothing equivalent to most of you.\n\n \n Very few people here actually know any Greek or Hebrew. Most of the erudition you're seeing is cut and paste jobs from other web sites.", 
   {}, 
   176839, 
   null, 
   1131050400.0
  ], 
  [
   176906, 
   null, 
   "Howard Beale", 
   "I'm not trying to be critical of anyone's knowledge here but it seems from what I've seen in these forums and specifically in the religious ones people all seem to have a vast knowledge of greek, hebrew, and biblical doctrine in general. I was just wondering where everyone knew all the greek and hebrew meanings. \n \n I find it humorous to see the one's who bash the God theory the most know their Bible fairly well. \n \n Anyways, I'm no doctor or professor, that's obvious from my name I think, but I guess I have some knowlegde just nothing equivalent to most of you.\nGood point. I have come across several people here who, when asked have given very helpful support for their positions and sent me to research things I had not researched in depth. I don't know what their credentials are, but I don't think credentials matter as much as being able to support statements we make. Everyone has the right to express their opinion, the question is do we have the courage to admit when our position is not valid. That to me is a bigger issue.", 
   {}, 
   176839, 
   null, 
   1131060480.0
  ], 
  [
   177020, 
   null, 
   "Bud Light Man", 
   "Well put my good man and to that I will drink a beer, well maybe a glass of water since I'm feeling kind of under the weather.", 
   {}, 
   176906, 
   null, 
   1131081420.0
  ], 
  [
   177054, 
   null, 
   "Alan Ryan", 
   " Everyone has the right to express their opinion, the question is do we have the courage to admit when our position is not valid. That to me is a bigger issue.\n\n \n That certainly is a crucial question: a lot depends on the emotional investment people have in their opinions. Not many of us achieve that degree of self knowledge by the light of which we can examine our own assumptions with critical detachment.\n \n The \"right\" to express your opinion entails a duty or an obligation on others to \"respect\" that right. But what if your opinion is wrong, erroneous, etc. ? We have no duty to let others keep their opinions; but we may have duty to try to change them.", 
   {}, 
   176906, 
   null, 
   1131119700.0
  ], 
  [
   177058, 
   null, 
   "Obvious Child", 
   "I will freely admit that my knowledge of Greek is only that of being 5 weeks into a moderately intensive NT Greek course and I have no Hebrew. In fact, when HB put forward arguments based on the Greek (and the literary history of the Bible) I went to a Bible scholar friend of mine. What I do have is the ability to recognise cut-and-paste from a rabidly biased site from personal interpretations or scholarly positions. \n \n I find the appeal to internet authority curious: for example the recent 'disproof' of Q which, unless EZ has a deep knowledge of Greek and Biblical criticism which he's been hiding, seems to rest on the basis of 'this website disagrees with the vast majority of scholarly opinion, therefore scholarly opinion is wrong'.\n \n \n And I agree the right to express an opinion doesn't mean the right for everyone to keep their own opinions unchallenged: the purpose of expression is dialogue not division.", 
   {}, 
   177054, 
   null, 
   1131120480.0
  ], 
  [
   177312, 
   null, 
   "Monster", 
   "I am very proud to be able to say that he happens to be a fully self certified anti intellectual temporal dialect myth interrupter of the up most correctness at all times.", 
   {}, 
   177058, 
   null, 
   1131183000.0
  ], 
  [
   177336, 
   null, 
   "Easyrider", 
   "I will freely admit that my knowledge of Greek is only that of being 5 weeks into a moderately intensive NT Greek course and I have no Hebrew. In fact, when HB put forward arguments based on the Greek (and the literary history of the Bible) I went to a Bible scholar friend of mine. What I do have is the ability to recognise cut-and-paste from a rabidly biased site from personal interpretations or scholarly positions. \n \n I find the appeal to internet authority curious: for example the recent 'disproof' of Q which, unless EZ has a deep knowledge of Greek and Biblical criticism which he's been hiding, seems to rest on the basis of 'this website disagrees with the vast majority of scholarly opinion, therefore scholarly opinion is wrong'.\n \n \n And I agree the right to express an opinion doesn't mean the right for everyone to keep their own opinions unchallenged: the purpose of expression is dialogue not division.\n\n \n Two things then you can counter with besides sophomoric rhetoric. (1) Find some historical documents (of Q); (2) Explain why Gospel simularities can't be the result of (a) The early disciples sharing common information between themselves when they would meet after Jesus' death and resurrection; (b) one reason the Holy Spirit couldn't have brought these things to their remembrance like the Gospel of John says.", 
   {}, 
   177058, 
   null, 
   1131200520.0
  ], 
  [
   177352, 
   null, 
   "Obvious Child", 
   "I myself am not a Bible scholar. Neither are you. We are frankly unqualified to discuss in any great depth the background of the Bible. But if I must:\n \n 1) is pointless. Q is Q because it is a lost source. Otherwise it would have a proper name and be a Gospel itself\n \n 2a) Again, the vast weight of scholarship puts the writing of the Gospels after the death of the early disciples\n b) Firstly, if we put God's control into the equation we have to wonder why the Gospels have a fragmented and partially contradictory form, and why the 'Q' sections are in a slightly different style and narrative order from that which is shared with Mark\n Secondly, Luke 1-4\n Inasmuch as many have undertaken to compile a narrative of the things which have been accomplished among us, just as they were delivered to us by those who from the beginning were eyewitnesses and ministers of the word, it seemed good to me also, having followed all things closely for some time past, to write an orderly account for you, most excellent The-oph'ilus, that you may know the truth concerning the things of which you have been informed.'\n \n Luke clearly has compiled an 'orderly account' from various 'eyewitnesses'. He does not write 'God told me this was exactly what happened' 'this was written under the power of the Holy Spirit' or even 'I was there, I saw it'. It's clearly a compiled version by an early Christian who wanted to put various accounts in order.", 
   {}, 
   177336, 
   null, 
   1131203940.0
  ], 
  [
   177366, 
   null, 
   "Howard Beale", 
   "Actually, OC, EZ supports the Q document. This is what EZ said (bold italics are put in by me):\n \n \nTwo things then you can counter with besides sophomoric rhetoric. (1) Find some historical documents (of Q); (2) Explain why Gospel simularities can't be the result of (a) The early disciples sharing common information  between themselves when they would meet after Jesus' death and resurrection; (b) one reason the Holy Spirit couldn't have brought these things to their remembrance like the Gospel of John says. \n \n That is an acceptable definition of Q: A shared information source for the teachings of Jesus that existed prior to the gospels being written and was used by the gospel writers in their writings of the gospels.", 
   {}, 
   177352, 
   null, 
   1131206400.0
  ], 
  [
   177367, 
   null, 
   "Obvious Child", 
   "True, I read that as the old 'Matthew, Mark, Luke and John were Jesus' homeboys' theory.\n \n Obviously EZ isn't as close minded as I thought.\n \n EDIT: and BTW, I'm British and therefore not a sophomore. Thus 'sophomoric rhetoric' is beyond me.", 
   {}, 
   177366, 
   null, 
   1131206700.0
  ], 
  [
   177482, 
   null, 
   "Orion", 
   "Two things then you can counter with besides sophomoric rhetoric. (1) Find some historical documents (of Q); (2) Explain why Gospel simularities can't be the result of (a) The early disciples sharing common information between themselves when they would meet after Jesus' death and resurrection; (b) one reason the Holy Spirit couldn't have brought these things to their remembrance like the Gospel of John says.\n\n \n EZ, attempting to discuss a subject with someone who apparently knows next to nothing about that subject is not an appealing proposition. We've had this go-around with the Documentary Hypothesis of the Torah, the historicity of the Exodus story, as well as Darwin's ToE. I suggest that you quit demanding evidence which you know cannot be produced and concentrate, instead, on evidence which has already been accumulated. There exists a wealth of information concerning the synoptic problem of Mark, Matthew, and Luke, in exhaustive detail, in both electronic and printed form, from any number of authoritative sources.", 
   {}, 
   177336, 
   null, 
   1131277500.0
  ], 
  [
   177557, 
   null, 
   "Easyrider", 
   "EZ, attempting to discuss a subject with someone who apparently knows next to nothing about that subject is not an appealing proposition. We've had this go-around with the Documentary Hypothesis of the Torah, the historicity of the Exodus story, as well as Darwin's ToE. I suggest that you quit demanding evidence which you know cannot be produced and concentrate, instead, on evidence which has already been accumulated. There exists a wealth of information concerning the synoptic problem of Mark, Matthew, and Luke, in exhaustive detail, in both electronic and printed form, from any number of authoritative sources.\n\n \n Well, it's the \"Scholar\" Orion, hee hee. Orion has admitted he got his \"ministry\" credentials from a website. \n \n Orion, you know what you and a lot of your politically correct friends are afraid of? You're afraid the Bible might be real, and if it is you'd either have to turn from your carnal lifestyles or wind up in the Pit.", 
   {}, 
   177482, 
   null, 
   1131310800.0
  ], 
  [
   177575, 
   null, 
   "Howard Beale", 
   "Well, it's the \"Scholar\" Orion, hee hee. Orion has admitted he got his \"ministry\" credentials from a website. \n \n Orion, you know what you and a lot of your politically correct friends are afraid of? You're afraid the Bible might be real, and if it is you'd either have to turn from your carnal lifestyles or wind up in the Pit.\nEZ, you agree that the Q Document exists. You say that the gospel writers referred to other writings of Jesus teachings -- scholars have simply named that undiscovered document \"Q\". Why the big problem?", 
   {}, 
   177557, 
   null, 
   1131323880.0
  ], 
  [
   177586, 
   null, 
   "jyoshu", 
   "1) is pointless. Q is Q because it is a lost source. Otherwise it would have a proper name and be a Gospel itself\n\n \n Agreed. If Q is for real, it's lost, period.\n \n \n2a) Again, the vast weight of scholarship puts the writing of the Gospels after the death of the early disciples\n\n \n Not necessarily true--some think it is, particularly liberal sources do. \n \n \nb) Firstly, if we put God's control into the equation we have to wonder why the Gospels have a fragmented and partially contradictory form, and why the 'Q' sections are in a slightly different style and narrative order from that which is shared with Mark\n\n \n Well first, we don't really know what's Q sections and what's not, or if they really even are \"Q\" sections. These are only hypotheses. So it's not like the whole Q theory is a given. As far as fragmentation, I don't see them as that fgragmented myself. In fact I think it's more telling how consistent they are, all in all. Those who try to discredit the gospels on the basis of inconsistency are like people trying to say an african elephant and an Asian elephant aren't really elephants because of their inconsistencies--they aren't exactly alike. But it's ignoring the forests for the trees. The real story is how much alike they are.\n \n \nLuke clearly has compiled an 'orderly account' from various 'eyewitnesses'. He does not write 'God told me this was exactly what happened' 'this was written under the power of the Holy Spirit' or even 'I was there, I saw it'. It's clearly a compiled version by an early Christian who wanted to put various accounts in order.\n\n \n So what? What's to say he wasn't doing that under the direction of God?", 
   {}, 
   177352, 
   null, 
   1131325800.0
  ], 
  [
   177594, 
   null, 
   "Howard Beale", 
   "OC:\n \n Your statement that \"the vast weight of scholarship puts the writing of the Gospels after the death of the early disciples\" is accurate. There are some scholars who disagree, but they are in the minority and many come from a specific school of thought. However, jyoshu is correct that the existence of \"Q\" is a theory. For over a century many scholars have agreed that Matthew, Mark and Luke seem to have a similar basis for their writings and that basis is different than that of John's, but there is no concrete proof.", 
   {
    "unicode_changes_made": true
   }, 
   177586, 
   null, 
   1131327120.0
  ], 
  [
   177614, 
   null, 
   "Easyrider", 
   "OC:Your statement that \"the vast weight of scholarship puts the writing of the Gospels after the death of the early disciples\" is accurate. \n\n \n Nonsense. The earliest church fathers confirmed the Gospel writers authorship.\n \n In addition, there's nothing in any of the three synoptics which indicate they were written after 70 A.D. Certainly no mention of the destruction of Jerusalem, which would have been an excellent chance for them to confirm Jesus' prophecy about it.", 
   {
    "unicode_changes_made": true
   }, 
   177594, 
   null, 
   1131335100.0
  ], 
  [
   177616, 
   null, 
   "Howard Beale", 
   "Nonsense. The earliest church fathers confirmed the Gospel writers authorship.\nThe statement which I identified as accurate was: \"the vast weight of scholarship puts the writing of the Gospels after the death of the early disciples\". That has nothing to do with the pronouncements of the earliest church fathers.\n \n \nIn addition, there's nothing in any of the three synoptics which indicate they were written after 70 A.D. Certainly no mention of the destruction of Jerusalem, which would have been an excellent chance for them to confirm Jesus' prophecy about it.\nI have given you the names and writings, many on the web, that contradict you statement, EZ. Have you read them?", 
   {
    "unicode_changes_made": true
   }, 
   177614, 
   null, 
   1131335280.0
  ], 
  [
   177628, 
   null, 
   "Orion", 
   "EZ, attempting to discuss a subject with someone who apparently knows next to nothing about that subject is not an appealing proposition. We've had this go-around with the Documentary Hypothesis of the Torah, the historicity of the Exodus story, as well as Darwin's ToE. I suggest that you quit demanding evidence which you know cannot be produced and concentrate, instead, on evidence which has already been accumulated. There exists a wealth of information concerning the synoptic problem of Mark, Matthew, and Luke, in exhaustive detail, in both electronic and printed form, from any number of authoritative sources.\n\n \n \nWell, it's the \"Scholar\" Orion, hee hee.\n\n \n I don't claim to be a scholar, EZ. Instead, I consider myself to be a student of religion. \n \n \nOrion has admitted he got his \"ministry\" credentials from a website.\n\n \n I \"admitted\" to no such thing, for there was nothing for me to \"admit\". Instead, I remarked that I once visited a website, spent twenty seconds filling out a form, and suddenly discovered that I was an ordained minister. I thought that was pretty amusing. Do I take my \"ordination\" seriously? Of course not. Apparently, however, my \"ordination\" infuriated you. \n \n \nOrion, you know what you and a lot of your politically correct friends are afraid of?\n \n \n I'm afraid of being hit by an inattentive driver talking on a cell phone. \n \n \nYou're afraid the Bible might be real, and if it is you'd either have to turn from your carnal lifestyles or wind up in the Pit.\n \n \n All of this makes for a great diversionary tactic on your part, EZ, but it has nothing to do with the subject of the Synoptic Gospels.", 
   {}, 
   177482, 
   null, 
   1131341640.0
  ], 
  [
   177658, 
   null, 
   "Obvious Child", 
   "Not necessarily true--some think it is, particularly liberal sources do.\nMaybe its an American thing or maybe its the more everyday level of debate, but 'liberal' theology is something quite specific. Are people using it here to simply mean 'not accepting all Biblical claims at face value'? Because that's the starting point of scholarship.\n \nSo what? What's to say he wasn't doing that under the direction of God?\nMy point is that he presents his writing as a compilation. It could be guided by God, but he never suggests that he has inserted things into his narrative that he hasn't got from other sources.\n \n He is essentially a 'secondary' source on Christ's life and teachings.", 
   {}, 
   177586, 
   null, 
   1131374820.0
  ], 
  [
   177685, 
   null, 
   "simone", 
   "It appears that \"liberal theology\" has a plethora of definitions. It is also to be noted that the word \"liberal\" has been slimed by extremists. Note how it is tossed out to discredit a particular stance.", 
   {}, 
   177658, 
   null, 
   1131386700.0
  ], 
  [
   177693, 
   null, 
   "trebor", 
   "It appears that \"liberal theology\" has a plethora of definitions. It is also to be noted that the word \"liberal\" has been slimed by extremists. Note how it is tossed out to discredit a particular stance.\n\n \n \n Yes, I noticed that the term 'Liberal' was used to desribe and discredit a statement without actually analysing and discussing the information.\n \n The other technique was to declare the other point of view a 'hearsay', again, without discussing the matter, or looking at the evidence.\n \n And yet a third technique is to threaten with eternal damnation unless you 'accept Jesus as your lord and savior' etc etc etc, again, without addressing the points being discussed.", 
   {}, 
   177685, 
   null, 
   1131389160.0
  ], 
  [
   177695, 
   null, 
   "Howard Beale", 
   "It appears that \"liberal theology\" has a plethora of definitions. It is also to be noted that the word \"liberal\" has been slimed by extremists. Note how it is tossed out to discredit a particular stance.\nYes. There is sound scholarship and unsound scholarship. There is theology based honest study and theology based on faulty study.", 
   {}, 
   177685, 
   null, 
   1131389280.0
  ], 
  [
   177703, 
   null, 
   "jyoshu", 
   "It appears that \"liberal theology\" has a plethora of definitions. It is also to be noted that the word \"liberal\" has been slimed by extremists. Note how it is tossed out to discredit a particular stance.\n\n \n There indeed was a time when liberalism in Biblical scholarship did not mean what it does today. But the change in the word's use here came about because liberalism moved into the realm of complete skepticism rather than any redefinition by \"extremists\" as you seem to be indicating. When liberalism began viewing scripture only through a de-spiritualized and \"anything-but-orthodox\" lens, they changed the definition of that term themselves. I wish liberalism in Biblical scholarship were what it was a century or two ago.", 
   {}, 
   177685, 
   null, 
   1131392820.0
  ], 
  [
   177704, 
   null, 
   "georged", 
   "It is also to be noted that the word \"liberal\" has been slimed by extremists. Note how it is tossed out to discredit a particular stance.\n\n \n Any subject, any thread. And the primary reason my posting on this forum will diminish. Attempts to clarify erroneous labels, dogmatic and rhetorical statements are a complete waste of time with the locked mind crowd.", 
   {}, 
   177685, 
   null, 
   1131393240.0
  ], 
  [
   177706, 
   null, 
   "trebor", 
   "There indeed was a time when liberalism in Biblical scholarship did not mean what it does today. But the change in the word's use here came about because liberalism moved into the realm of complete skepticism rather than any redefinition by \"extremists\" as you seem to be indicating. When liberalism began viewing scripture only through a de-spiritualized and \"anything-but-orthodox\" lens, they changed the definition of that term themselves. I wish liberalism in Biblical scholarship were what it was a century or two ago.\n\n \n It sounds you want to reset the clock to a couple of centuries ago on a lot of levels.\n \n However, I prefer modern scholarship in all things.", 
   {}, 
   177703, 
   null, 
   1131393780.0
  ], 
  [
   177711, 
   null, 
   "Howard Beale", 
   "jyoshu:\n \n \nThere indeed was a time when liberalism in Biblical scholarship did not mean what it does today. But the change in the word's use here came about because liberalism moved into the realm of complete skepticism rather than any redefinition by \"extremists\" as you seem to be indicating. \n \nThat is not accurate. Extremists, cloaking themselves in the term \"conservative\" defined skepticism as a \"liberal\" position, lumped it in with a certain theology they did not agree with, and called it all \"liberal\". \n \n Skepticism is actually baed on a conservative way of viewing scripture that the status quo - which was all the while becoming more and more extreme -- wanted demonized. \n \n \nWhen liberalism began viewing scripture only through a de-spiritualized and \"anything-but-orthodox\" lens, they changed the definition of that term themselves.\n \nLiberalism can't view anything; it is an \"ism\". Extremists marginalized anything they did not like through name calling. It is a tool of the modern extremist. Rather than address the ideas, they call names. Now they have taken the word liberal and defined it as \"extreme evil\" when it is only a word that describes whether someone adheres to a strict reading of words (conservative, hence the term 'strict construction') or a flexible one (liberal). \n \n \nI wish liberalism in Biblical scholarship were what it was a century or two ago.\nAnd many wish that conservatism was what it was two centuries ago.\n \n These terms are used as political terms to consolidate power by marginalizing other people's views. This has no place in theological discourse. Something is either founded on good scholarship or not.", 
   {
    "unicode_changes_made": true
   }, 
   177703, 
   null, 
   1131394260.0
  ], 
  [
   177712, 
   null, 
   "jyoshu", 
   "It sounds you want to reset the clock to a couple of centuries ago on a lot of levels.\n \n However, I prefer modern scholarship in all things.\n\n \n Newer or more recent is not always better. The so-called 'age of reason', particularly the 20th century, brought more war and bloodshed than any other time in the history of the world. That even includes those horrible dark ages of Christian church rule.\n \n This idea that scholarship (particular non-science issues such as this) is better now is not always the case. It's true we have more access to older manuscripts, but that's not a reflection of scholarship methods as much as the fact we happen to have found more manuscripts. The problem I have with modern liberal scholarship is it's complete disdain for orthodoxy and it's tendency to despiritualize everthing--on a topic that is very spiritual to many people.", 
   {}, 
   177706, 
   null, 
   1131394380.0
  ], 
  [
   177721, 
   null, 
   "jyoshu", 
   "That is not accurate. Extremists, cloaking themselves in the term \"conservative\" defined skepticism as a \"liberal\" position, lumped it in with a certain theology they did not agree with, and called it all \"liberal\".\n\n \n Even if that were the case, what else would you call a scholarship method which completely despiritualizes it's target material and completely rejects orthodoxy? I don't see how any other term than \"liberal\" would suffice, even if we consider that term benign. The very fact it's opposite of conservative makes it an appropriate term for hyper-skepticism. I disagree with your idea that conservative extremists are solely to blame for skepticism taking on the term \"liberal.\"\n \n \nSkepticism is actually baed on a conservative way of viewing scripture that the status quo - which was all the while becoming more and more extreme -- wanted demonized.\n\n \n No--for all of Christian history, orthodoxy would be better termed as \"conservative\" than anything else. And orthodoxy would never take a skeptical view of scripture.\n \n \nLiberalism can't view anything; it is an \"ism\".\n\n \n I'm not sure what you mean here. Liberalism today certainly does take a skeptical view. \n \n \nThese terms are used as political terms to consolidate power by marginalizing other people's views. This has no place in theological discourse. Something is either founded on good scholarship or not.\n\n \n Sure it does. We have to have some way to refer to scholars' leanings on Biblical issues. Its common in scholarly circles to use terminology like conservative theology, or liberal theology. We aren't talking about politics here. These terms mean something completely different in this context than they do in politics.", 
   {
    "unicode_changes_made": true
   }, 
   177711, 
   null, 
   1131395640.0
  ], 
  [
   177729, 
   null, 
   "Tastyfish", 
   "Surely the 'complete skepticism' is the best position to look from, especially if you have no evidence that a particular piece of the Bible (or any other text) is untrue. Surely its just applying Occam's Razor to it and asking, 'could this not be explained by any other way'.\n \n If you want to convert someone who does not already believe surely the best way to do this is to show it makes sense from their current position.\n \n Even on matters of doctrine again it seems a good position to go from - being able to look and see if there is a perfectly acceptable non-supernatural reason for a law (such as the jewish food laws) and realise that perhaps God is trying to protect his people from parasites rather than Pigs and Cheeseburgers being innately evil.", 
   {}, 
   177721, 
   null, 
   1131397440.0
  ], 
  [
   177731, 
   null, 
   "trebor", 
   "Newer or more recent is not always better. The age of reason, particularly the 20th century, brought more war and bloodshed than any other time in the history of the world. That even includes those horrible dark ages of Christian church rule.\n \n This idea that scholarship (particular non-science issues such as this) is better now is not always the case. It's true we have more access to older manuscripts, but that's not a reflection of scholarship methods as much as the fact we happen to have found more manuscripts. The problem I have with modern liberal scholarship is it's complete disdain for orthodoxy and it's tendency to despiritualize everthing--on a topic that is very spiritual to many people.\n\n \n \n That sounds to me like a rational, because it is discovering things that you disagree with.", 
   {}, 
   177712, 
   null, 
   1131397620.0
  ], 
  [
   177745, 
   null, 
   "Howard Beale", 
   "jyoshu:\n \n \nNo--for all of Christian history, orthodoxy would be better termed as \"conservative\" than anything else. And orthodoxy would never take a skeptical view of scripture.\n\n \n Again, you are using the words in terms of political outcomes and agendas, not scholarship or approach. Orthodox positions are not necessarily reached through a \"conservative\" scriptural approach. Orthodox simply means accepted or traditional. For instance, the ban on not eating meat of Fridays was a traditional or orthodox position. It came, however, from a liberal (or loose) interpretation of scripture - or in this case an extremely liberal reading of Genesis 2:16-17. This liberal reading of scripture was the basis of Cannon Law and became the accepted (or orthodox) Church position.\n \n \nSure it does. We have to have some way to refer to scholars' leanings on Biblical issues. Its common in scholarly circles to use terminology like conservative theology, or liberal theology. \nThey are descriptions of approaches, not outcomes, as I have said.\n \n \nWe aren't talking about politics here. These terms mean something completely different in this context than they do in politics.\n \nIf the words are used to describe outcomes then they are being used politically. If they are used to describe an approach to scripture then they are being used theologically. It is a simple and clear distinction.", 
   {
    "unicode_changes_made": true
   }, 
   177729, 
   null, 
   1131399420.0
  ], 
  [
   177746, 
   null, 
   "Howard Beale", 
   "Surely the 'complete skepticism' is the best position to look from, especially if you have no evidence that a particular piece of the Bible (or any other text) is untrue. Surely its just applying Occam's Razor to it and asking, 'could this not be explained by any other way'.\n \n If you want to convert someone who does not already believe surely the best way to do this is to show it makes sense from their current position.\n \n Even on matters of doctrine again it seems a good position to go from - being able to look and see if there is a perfectly acceptable non-supernatural reason for a law (such as the jewish food laws) and realise that perhaps God is trying to protect his people from parasites rather than Pigs and Cheeseburgers being innately evil.\nI agree, if you are going to build your case on the shoulders of someone else's scholarship, you had best examine that scholarship with a skeptical eye before building on it. It is the approach of most good scholars that I know.", 
   {}, 
   177729, 
   null, 
   1131399600.0
  ], 
  [
   177752, 
   null, 
   "jyoshu", 
   "Surely the 'complete skepticism' is the best position to look from\n\n \n Perhaps for a non-believer. Some of want to study the scriptures and believe them.\n \n \nAgain, you are using the words in terms of political outcomes and agendas, not scholarship or approach.\n\n \n Funny, because that's exactly what I see you doing here which is why I mentioned the disctinction in my last reply. When you talk in terms of extremists taking over a term--those extremists being conservative, you effectively use a political view of those terms. \n \n \nOrthodox positions are not necessarily reached through a &#8220;conservative&#8221; scriptural approach. Orthodox simply means accepted or traditional.\n\n \n Yes, but in this case they ARE the same. Simply put, the liberal perspective is the skeptical one, and the conservative is the non-skeptic (which is the accepted and traditional). \n \n \nFor instance, the ban on not eating meat of Fridays was a traditional or orthodox position. It came, however, from a liberal (or loose) interpretation of scripture\n\n \n No, the interpretation was overly literal--it would take the skeptical position to note that it's ok to eat meat on Fridays. This is a case where liberalism was right. But I'm really talking about cases where scripture is discounted as historical event. That's skepticism gone too far, because it refuses to accept the possibility of the orthodox view. I would have less a problem with liberal Biblical scholarship today if it weren't so de-spiritualized and reactionary against orthodoxy.\n \n \nyou had best examine that scholarship with a skeptical eye before building on it. It is the approach of most good scholars that I know.\n\n \n So think one who has no belief in the scriptures and what they say is in a better position to understand them? I find that pretty odd.", 
   {}, 
   177746, 
   null, 
   1131400260.0
  ], 
  [
   177757, 
   null, 
   "trebor", 
   "Perhaps for a non-believer. Some of want to study the scriptures and believe them.\n \n\n \n That, however, it not scholarship. Deciding the outcome before the study based on what you want the outcome to be might be satifying for you, but it is not scholarship.\n \n \n\n \n So think one who has no belief in the scriptures and what they say is in a better position to understand them? I find that pretty odd.\n \n \n\n \n Depends on what you are looking for. If you are looking to reaffirm what you already believe, that is one thing. If you are looking at the bible from a historical point of view, trying to figure out what was written when, and what the writers might actually have meant that is something else. \n \n If you want self justification for faith issues, then scholarship is not for you.", 
   {}, 
   177752, 
   null, 
   1131400860.0
  ], 
  [
   177759, 
   null, 
   "Tastyfish", 
   "Perhaps for a non-believer. Some of want to study the scriptures and believe them.\n \n That's fine, and there isn't really any problem - however there is as soon as you start deciding that this document now overides any others. Surely it makes sense to look at the scriptures in historical context? \n Its no problem for me to look at something from the perspective of 'assuming there is a god and he has these qualities - does this then make sense', have I suddenly and temporialiy converted to Christianity because of this? Why is this different from looking at things from a skeptical viewpoint and asking 'woud this still make sense from an aethistic point of view'.\n \n The only problem you will have with a skeptical viewpoint is if you take it as the complete and inerrant word of God, if you are willing to entertain that some of the Bible is also the views of the early priests rather than being solely dictated by God what's the problem? If anything it helps iron out apparent contradictions and the various difficult questions that arise as you can weed out probable or possable human influences leaving you with the hard core of God's message and principles.", 
   {}, 
   177752, 
   null, 
   1131400980.0
  ], 
  [
   177770, 
   null, 
   "jyoshu", 
   "That, however, it not scholarship. Deciding the outcome before the study based on what you want the outcome to be might be satifying for you, but it is not scholarship.\n\n \n This is a very troubling position you have. Essentially you are saying that no one who actually believes what the Bible says is qualified to study it or engage in scholarship on it. Or stated differently, if someone believes it and engages in scholarship, it's not really scholarship. If I happen to believe that, say, there was a regional king in britain 1500 or so years ago named Arthur, it doesn't mean that I can't engage in scholarship regarding that subject. \n \n Furthermore, it bothers me that the Bible is about the only source from ancient history that I know of that some think should NOT be used as a source simply on the basis of it's religious content. What I mean is, the Bible itself should, to at least some degree, be a source for the events it describes. Despite the fact that so many of its details are obviously rooted in history: cities, places, leaders, events, etc.--somehow we're expected to throw all that out just because it's a religious work? I wonder if archaologists, upon finding some hieroglyphs in Egypt, would turn around and ignore them simply on the basis that they had some religious content, and assume that any mentioned pharoahs in the writing (who were, after all, considered gods as well) didn't even exist? I doubt it.", 
   {}, 
   177757, 
   null, 
   1131401940.0
  ], 
  [
   177775, 
   null, 
   "Tastyfish", 
   "I don't think his point was that you can't beleive in the bible if you study it, just that you can't study it from a beleiving point of view. Much like in any other study, you may well know pretty much what is going to be the result but you have to show how you get there from a position of ignorance.\n \n Assuming the bible is true and then using it to prove itself is not studying it, it would be like in you King Arthur example, to assume that sources that mention King Arthur must be true, making Disney's Sword in the Stone a historical record", 
   {}, 
   177770, 
   null, 
   1131403140.0
  ], 
  [
   177777, 
   null, 
   "jyoshu", 
   "just that you can't study it from a beleiving point of view.\n\n \n Why not? Why is disbelief a criteria for real study? Heck, science itself doesn't even hold to that standard. Do you think scientists only study atomic theory if they don't believe atoms exist?\n \n I think it's crazy to think that someone who believes can't engage in real study on what they believe in.", 
   {}, 
   177775, 
   null, 
   1131403440.0
  ], 
  [
   177778, 
   null, 
   "Tastyfish", 
   "Yes, they can't assume the end result and have to show it is true to others who had to assume its not true until proven otherwise (or at least shown to be likely true).\n \n They themselves may have beleived in atoms and thought its a very plausable explaination, but you have to approach it from the point of view of not knowing.", 
   {}, 
   177777, 
   null, 
   1131403500.0
  ], 
  [
   177781, 
   null, 
   "trebor", 
   "This is a very troubling position you have. Essentially you are saying that no one who actually believes what the Bible says is qualified to study it or engage in scholarship on it. Or stated differently, if someone believes it and engages in scholarship, it's not really scholarship. If I happen to believe that, say, there was a regional king in britain 1500 or so years ago named Arthur, it doesn't mean that I can't engage in scholarship regarding that subject. \n \n \n\n \n For someone who takes the bible as innerrant, that woudl be troubling. I would say that someone who takes it as 100% literal, and believes in it and studies it, it is not scholarship. There are many devote Christians that do use\n good scholarship methods. They, however, do not agree with your particular brand of christianity. \n \n Most of the scholars that use the modern scholarship methods to study the origins of the bible are Christians. They, however, aren't using their studies to justify their beliefs, and to try to reinforce what they already believe.\n \n \n \n\n \n Furthermore, it bothers me that the Bible is about the only source from ancient history that I know of that some think should NOT be used as a source simply on the basis of it's religious content. What I mean is, the Bible itself should, to at least some degree, be a source for the events it describes. Despite the fact that so many of its details are obviously rooted in history: cities, places, leaders, events, etc.--somehow we're expected to throw all that out just because it's a religious work? I wonder if archaologists, upon finding some hieroglyphs in Egypt, would turn around and ignore them simply on the basis that they had some religious content, and assume that any mentioned pharoahs in the writing (who were, after all, considered gods as well) didn't even exist? I doubt it.\n\n \n Which, of course, totally false. All claims should be looked at with objective evidence. For example.. when it comes to Joesphus's claim about Masada,\n and the zealots suicide there.. it is coming under scruntiy, and a greater deal of skeptism. That is because although some details of the story have been verified (the drawing of lots for something), there is there strong lack of bodies on the site. Therefore, many modern scholars say that Josephus is mistaken. \n \n Another example is the claim by Suetonius that Vespian, one of the caesar, cured a blind person, and a crippled person with the touch of his hand. When you have a document that makes a supernatural claim, you will find skepicism about that statement.\n \n One point I will make is that skepism about much of the stories in the bible came because people went looking for the evidence to prove the bible, and that evidence was not to be found. Things that SHOULD have been there if the bible story was true was missing. Some stories have been found to have an element of truth, and even other stories that were found to be false.\n \n I am sure that some people will fume about 'antisupernatial bias' about that. However, they show equal bias when it comes to the supernatral claims from other sources besides the bible, so I don't take that fuming too seriously.", 
   {}, 
   177770, 
   null, 
   1131404400.0
  ], 
  [
   177782, 
   null, 
   "jyoshu", 
   "Yes, they can't assume the end result and have to show it is true to others who had to assume its not true until proven otherwise (or at least shown to be likely true).\n \n They themselves may have beleived in atoms and thought its a very plausable explaination, but you have to approach it from the point of view of not knowing.\n\n \n But approaching it \"from the point of view of not knowing\" and genuinely beleiving or disbelieving are two different things. A Biblical scholar who believes what the Bible says can certainly approach and use the same methods in studying that anyone else can. I get the impression that you two think that belief negates scholarship simply on the basis that it's belief.", 
   {}, 
   177778, 
   null, 
   1131404880.0
  ], 
  [
   177783, 
   null, 
   "jyoshu", 
   "I would say that someone who takes it as 100% literal, and believes in it and studies it, it is not scholarship. \n\n \n Then you are changing your stance.\n \n \nThere are many devote Christians that do use\n good scholarship methods. They, however, do not agree with your particular brand of christianity.\n\n \n You have no idea what my \"brand\" of Christianity is.\n \n \nMost of the scholars that use the modern scholarship methods to study the origins of the bible are Christians. They, however, aren't using their studies to justify their beliefs, and to try to reinforce what they already believe.\n\n \n Then you are contradicting yourself. Clearly you stated ealier that studying scriptures and at the same time believing them was not scholarship. I would certainly AGREE that most scholars who use modern scholarship methods are Christian--that's the point you haven't seemed to have gotten (until now I suppose). No one is talking about trying to reinforce or justifying--that's your injection into this discussion. I simply said 'believe' in what the scriptures say. For a person to be a Christian, they have to have some level of belief in what the Bible says. There's no way around it. I'm glad you are starting to see that one can have some belief in the Bible and still engage in sound Biblical scholarship.\n \n \nWhich, of course, totally false. All claims should be looked at with objective evidence.\n\n \n So if hieroglyphs were discovered telling about a previously unknown pharoah, and those hieroglyphs happen to have some religious content, you'd assume the part about the pharoah was not true simply because it was the only source???", 
   {}, 
   177781, 
   null, 
   1131405360.0
  ], 
  [
   177785, 
   null, 
   "Tastyfish", 
   "But approaching it \"from the point of view of not knowing\" and genuinely beleiving or disbelieving are two different things. A Biblical scholar who believes what the Bible says can certainly approach and use the same methods in studying that anyone else can. I get the impression that you two think that belief negates scholarship simply on the basis that it's belief.\n\n Beleif without proof is not scholarship - but you can beleive whatever you want, however if you want to do a paper on something you have to prove everything you are talking about, or direct the reader to people who have done it previously.\n \n No one is saying you can't be religious and study the bible - what you can't do is take the bible as automatically true and take it at its word over other accounts of the same event. If you were wondering what really happened you would have to compare the two equally, not just dismiss everything one says because its not the Bible.", 
   {}, 
   177782, 
   null, 
   1131405600.0
  ], 
  [
   177798, 
   null, 
   "Howard Beale", 
   "jyoshu:\n \n Quote:\n \nOriginally Posted by Howard Beale\n Again, you are using the words in terms of political outcomes and agendas, not scholarship or approach.\n\n \n Funny, because that's exactly what I see you doing here which is why I mentioned the disctinction in my last reply. When you talk in terms of extremists taking over a term--those extremists being conservative, you effectively use a political view of those terms.\nYou misread what I wrote. I never equated extremists with conservatives. In fact I indicated that extremist deceived people by calling themselves conservatives. I did not use the word extremist in reference to liberal or conservatives. Extremist are intractable. Scholars, liberal or conservative, try to be open because they kow they always have something to learn.\n \n Quote:\n \nOriginally Posted by Howard Beale\n Orthodox positions are not necessarily reached through a \"conservative\" scriptural approach. Orthodox simply means accepted or traditional. \n\n \n Yes, but in this case they ARE the same. Simply put, the liberal perspective is the skeptical one, and the conservative is the non-skeptic (which is the accepted and traditional).\nYou are just throwing words and labels around without any substantiation. How is a \"liberal\" perspective skeptical and a \"conservative\" one non-skeptical. You misunderstand the entire concept of theological conservatism and liberalism. I repeat, it has to do with approach, not conclusions.\n \n Quote:\n \nOriginally Posted by Howard Beale\n For instance, the ban on not eating meat of Fridays was a traditional or orthodox position. It came, however, from a liberal (or loose) interpretation of scripture. \n\n \n No, the interpretation was overly literal- it would take the skeptical position to note that it's ok to eat meat on Fridays. This is a case where liberalism was right. \nYou completely contradict yourself here. \"overly literal\" interpretations of scripture are very conservative interpretations, not liberal interpretations. You are still hung up on labeling things by their conclusions. That is a political thing. Theological scholarship defines things by approach, not conclusion. Is that distinction clear?\n \n \nBut I'm really talking about cases where scripture is discounted as historical event. That's skepticism gone too far, because it refuses to accept the possibility of the orthodox view. I would have less a problem with liberal Biblical scholarship today if it weren't so de-spiritualized and reactionary against orthodoxy.\n\n Again, you are so hung up on labeling conclusions that you can't even hear what I am saying. Skepticism exists in the theological scholarly processes whether you approach it with a conservative or liberal approach. It is a useful tool. Do you understand that the doctrine of the triune God, for instance, was the outcome of a liberal approach to scripture? It requires a loose interpretation of the scriptures.\n \n Quote:\n \nOriginally Posted by Howard Beale\n you had best examine that scholarship with a skeptical eye before building on it. It is the approach of most good scholars that I know.\n\n \n So think one who has no belief in the scriptures and what they say is in a better position to understand them? I find that pretty odd.\nI have no idea how this comment even relates to what you quoted me as saying. I am simply saying if you take a position based on something another scholar has concluded, it pays to (and most reputable scholars do) research the validity of the other scholar's conclusions. That is simply sound research whether theological or scientific.", 
   {
    "unicode_changes_made": true
   }, 
   177785, 
   null, 
   1131409920.0
  ], 
  [
   177843, 
   null, 
   "Orion", 
   "Essentially you are saying that no one who actually believes what the Bible says is qualified to study it or engage in scholarship on it. Or stated differently, if someone believes it and engages in scholarship, it's not really scholarship.\n\n \n One of the hallmarks of scholarship is objectivity, which necessitates a certain degree of emotional detachment from the subject under study. You have to be willing to go wherever the evidence takes you. For example, I can't think of a single, reputable, authoritative Bible scholar who today believes that the Torah was written by a single individual (Moses) and who can back up such claim. There is simply too much evidence pointing to multiple authorship, and such evidence has been accumulated at least since the time of Spinoza. Today, the evidence is overwhelming. Would it shatter your faith if Moses didn't write the Torah, or if the Exodus story was shown to be little more than legend/folklore? Or if the books of Daniel or Isaiah had multiple authors? Or if Ezekiel's prophecy against Tyre was a bust? If so, it suggests to me that your faith is in serious trouble. \n \n Every so-called sacred text that I've ever encountered distills down to an attempt by man to identify the divine as well as to establish a relationship with the divine. You can glean a lot from those texts, but you must continually remind yourself that you're dealing with human endeavour.", 
   {}, 
   177770, 
   null, 
   1131431400.0
  ], 
  [
   177863, 
   null, 
   "Obvious Child", 
   "So if hieroglyphs were discovered telling about a previously unknown pharoah, and those hieroglyphs happen to have some religious content, you'd assume the part about the pharoah was not true simply because it was the only source???\nIf the hieroglyphics made claims that seemed not to fit with other things of the time, and if there was a distinct possibilty that this was essentially propagandist 'official view' of history, then you'd be mad to take it at face value. Recent archaeological evidence suggests the Egyptians were often under the thumb of a southern African kingdom, but because we have the Egyptian patriotic version of events we have always assumed they won. Another example is the long period when classicists accepted the writings of classical Greek historians who were\n 1) biased\n 2) living long after the events they describe\n \n We even believe the reports Caesar sent home of how many enemies he fought against, despite the clear motivation for exaggeration.\n \n Incidentally, studying British history with the belief that Arthur existed as a starting assumption would be bad history.", 
   {}, 
   177783, 
   null, 
   1131460020.0
  ], 
  [
   177875, 
   null, 
   "ArchaicGuy", 
   "Orion: Rav Adin Steinsaltz is a single, reputable, authoritative Torah Scholar who believes Moses wrote the Torah. You have heard of the Steinsaltz edition of the Talmund?", 
   {}, 
   177863, 
   null, 
   1131466920.0
  ], 
  [
   177876, 
   null, 
   "jyoshu", 
   "\"overly literal\" interpretations of scripture are very conservative interpretations, not liberal interpretations.\n\n \n Right! And very liberal interpretations would be overly loose. But you stated that \"the ban on not eating meat of Fridays . . . came, however, from a liberal (or loose) interpretation of scripture.\" But I'd say the view that meat CAN be consumed on Fridays after all is more liberal than conservative. I'd say that the \"looser\" view would be the one that says, for whatever reason, the Bible doesn't mean we can't eat meat on Fridays even though that's what it said at the time. If we took a literal reading we'd have to still not be eating meat on Fridays. So on this, the liberal view has won out, and rightly so IMO.\n \n \nAgain, you are so hung up on labeling conclusions that you can't even hear what I am saying. Skepticism exists in the theological scholarly processes whether you approach it with a conservative or liberal approach. It is a useful tool. Do you understand that the doctrine of the triune God, for instance, was the outcome of a liberal approach to scripture? It requires a loose interpretation of the scriptures.\n\n \n First . . . Sorry, but this idea that labels such as 'conservative' and 'liberal' aren't valid in scholarship is simply ludicrous. It's simply a way to refer to one end of the spectrum or the other. It doesn't necessarily mean anything malevolent as you seem to think it does. Again, we aren't using these in the political sense here. There's nothing wrong with using these terms in this context.\n \n Second, yes skepticism is a useful tool, but it's not a conservative way to view the scriptures. NO one is saying it's bad though. But skepticism with complete disregard (and even disdain) for the POV that views the Bible itself as a source is not healthy skepticism. A true skeptic would be skeptical of ALL views until one was shown to be correct, not just skeptical of the literalist view. And you are wrong about trinitarian theology coming out of a \"loose\" interpretation--the Father, Son, and Holy Spirit are ALL explicitly stated in the scriptures and therefore it is a more literal interpretation. If they were not mentioned, and therefore an extranneous view of God than what the Bible explicitly says, then it would be loose (or liberal).\n \n \nIf the hieroglyphics made claims that seemed not to fit with other things of the time, and if there was a distinct possibilty that this was essentially propagandist 'official view' of history, then you'd be mad to take it at face value. \n\n \n Welcome to ancient history.\n \n Do you think many of the things we take at face value about the Roman empire are not 'propagandist' and even alone in their views?\n \n Besides, it's not like the gospels don't fit with other things of their time. They fit quite well into the culture they were written.\n \n \nWe even believe the reports Caesar sent home of how many enemies he fought against, despite the clear motivation for exaggeration.\n\n \n Yet we don't throw the figures out on that basis, like you want to do with the gospels. \n \n \nOne of the hallmarks of scholarship is objectivity, which necessitates a certain degree of emotional detachment from the subject under study.\n\n \n So someone who's passionate about astronomy can't engage in good astronomy? Sure, that makes perfect sense . . .", 
   {
    "unicode_changes_made": true
   }, 
   177863, 
   null, 
   1131466980.0
  ], 
  [
   177880, 
   null, 
   "trebor", 
   "\n So someone who's passionate about astronomy can't engage in good astronomy? Sure, that makes perfect sense . . .\n\n \n \n No. Someone who is PASSONATE about astrology can't engage in good astronomy is a better anaology.", 
   {}, 
   177876, 
   null, 
   1131468120.0
  ], 
  [
   177881, 
   null, 
   "jyoshu", 
   "No. Someone who is PASSONATE about astrology can't engage in good astronomy is a better anaology.\n\n \n Oh please. Those are 2 different things. We aren't even necessarily talking about belief in supernatural miracles here. But even if we were, those who do believe in the things the Bible say in that regard can still use scientific methods to study it. I don't think you all have any idea how prejudicial you sound on this subject. \n \n You are, as you've stated, Jewish. So you have to have some affection for the Hebrew scriptures as they are the very basis for your religion. By your view you can't study them objectively.", 
   {}, 
   177880, 
   null, 
   1131468660.0
  ], 
  [
   177882, 
   null, 
   "Obvious Child", 
   "Welcome to ancient history.\n \n Do you think many of the things we take at face value about the Roman empire are not 'propagandist' and even alone in their views?\nThen we shouldn't take them at face value.\n \n \nBesides, it's not like the gospels don't fit with other things of their time. They fit quite well into the culture they were written.\nIt depends what you mean by 'fit in'. There are specific cases where the Bible claims one thing (a tax of all the world, a certain Roman governer at a certain time, a heretical group at the time of Paul) which other evidence suggests does not exist.\n \n \nYet we don't throw the figures out on that basis, like you want to do with the gospels.\nI don't want to throw the figures out, or throw the gospels out. My point is that the figures and the gospels tell you as much about the people writing them as anything else.\n \n Jesus' reported arguments often seem to be more appropriate to the opponents of early Christianity than the opponents Jesus would have faced, and at times he seems to have arguments based on the Septuguniat: presumably Jesus himself would have known the Hebrew Torah, not the poor Greek translation \n \n \nSo someone who's passionate about astronomy can't engage in good astronomy? Sure, that makes perfect sense . . .\nNo, someone who has already decided what the explantion of the data is can't look at the data objectively. Astrology is a fairer comparison, as trebor points out.\n \n The problem with biblical scholarship by literalists is like the problem of 'Marxist history': it attempts to force evidence into a mold. The only difference is that the literalists have much more room for ineffability and so cannot be substantially falsified. Also, there have actually been a large number of otherwise fairly scholarly and reputable Marxist historians, which cannot be said of literalist Bible scholars.", 
   {}, 
   177876, 
   null, 
   1131468960.0
  ], 
  [
   177883, 
   null, 
   "Obvious Child", 
   "You are, as you've stated, Jewish. So you have to have some affection for the Hebrew scriptures as they are the very basis for your religion. By your view you can't study them objectively.\nYou may be misunderstanding the point. Having an affection for the Bible, being a devout believer, is not a problem. The problem is taking your subjective beliefs as the basis for scholarly exercise: if you can suspend them it's OK.\n \n I am more than capable of writing highly critical essays on thinkers I feel a great affection and regard for. It is understandable if your regard for the Bible is greater than this, but you have to ask yourself if you're not giving too much devotion to the pointing finger and not that at which it points (to steal a metaphor from HB)", 
   {}, 
   177881, 
   null, 
   1131469140.0
  ], 
  [
   177887, 
   null, 
   "jyoshu", 
   "Jesus' reported arguments often seem to be more appropriate to the opponents of early Christianity than the opponents Jesus would have faced, and at times he seems to have arguments based on the Septuguniat: presumably Jesus himself would have known the Hebrew Torah, not the poor Greek translation \n\n \n It's certainly just as conceivable that the masses of people (not the Rabbis and scribes) would be as familiar or more so with The LXX than with the Hebrew Torah. We know they spoke greek--it was the accepted common language around the whole Mediterranean (sort of like English is around the world today). And Jesus would have known they had Roman soldiers in the crowd and so forth. It's the same reason that preachers today don't read their text before they preach from a greek New Testament . . . they always use the translation people in the congregation are most familiar with. To me, the fact he quoted the Septuagint is a pretty weak argument.\n \n And I'm not at all uncomfortable with the idea that whoever wrote down his words simply used the LXX version for the parts of the old testament that Christ quoted (even if He did verbally quote them in Hebrew). It would make perfect sense for the writers to do that, because they'd want it to be readable to anyone who came along and read the document. I think both of these point are pretty logical . . . certainly not inobjectivity rooted in stubborn belief in the the subject matter.\n \n \nNo, someone who has already decided what the explantion of the data is can't look at the data objectively. Astrology is a fairer comparison, as trebor points out.\n\n \n I think part of the problem is that several of you are talking about something different here than I am, and vice versa. I'm not talking about someone who's already decided what the explanation of the data is. I'm talking about someone who believes Christ existed and believes the Bible. There's no way science can truly ever prove or disprove the existence of Christ. It's sort of like someone who believes that Alexander the Great existed and so is spurred on to study his historicity. The idea that one can't engage in good scholarship because he believes in his existence is, frankly, ludicrous. I'm not talking about fundamentalism here, which seems to be what you all think is the issue. I'm talking about belief that something is there, and there setting out to prove it. That's been the basis for many scientific discoveries even.", 
   {}, 
   177882, 
   null, 
   1131470100.0
  ], 
  [
   177888, 
   null, 
   "jyoshu", 
   "You may be misunderstanding the point. Having an affection for the Bible, being a devout believer, is not a problem. The problem is taking your subjective beliefs as the basis for scholarly exercise: if you can suspend them it's OK.\n\n \n That IS what I'm talking about. I think you've misunderstood. I'm arguing against the idea that people who are devout believers can't do that.", 
   {}, 
   177883, 
   null, 
   1131470220.0
  ], 
  [
   177889, 
   null, 
   "Tastyfish", 
   "That IS what I'm talking about. I think you've misunderstood. I'm arguing against the idea that people who are devout believers can't do that.\n\n Your original point was complaining about the view that you have to study this from a skeptical point of view though - that is why there is the debate. You have to take a skeptical point of view when you write the study, what you yourself beleive is irrelevant. All that matters is that you are not baselessly assuming something before you start investigating that you are basing the study on.\n \n Essentially the 'skeptical point of view' is your control experiment. I may beleive that covering myself in beans will ward of Dragons (whom are notoriously intollerant of soya) - if I cover myself in beans and don't get eaten by a Dragon I have not proved my point. However if I go from the skeptical point of view and say I probably wouldn't have been eaten anyway and set up a non bean-covered dummy in Dragon territory which then to the amazement of everyone does get eaten - I have proved my point.", 
   {}, 
   177888, 
   null, 
   1131470400.0
  ], 
  [
   177895, 
   null, 
   "Howard Beale", 
   "Jyoshu:\n \n \nBut I'd say the view that meat CAN be consumed on Fridays after all is more liberal than conservative. I'd say that the \"looser\" view would be the one that says, for whatever reason, the Bible doesn't mean we can't eat meat on Fridays even though that's what it said at the time. If we took a literal reading we'd have to still not be eating meat on Fridays. So on this, the liberal view has won out, and rightly so IMO. \n\n \n The Bible says nothing at all about eating meat on Fridays or Wednesdays or any days. That is why the scholarship that supports the doctrine is extremely liberal. It is based on the story of the Garden of Eden and God's command not to eat from the Tree of Knowledge of Good and Evil. How that becomes \"don't eat meat on Friday\" is not through a literal or conservative reading of the words, it is through an extremely liberal (looses) reading. \n \n As far as the rest of your post, you are unable to see that the terms \"liberal\" and \"conservative\" have to do with approaches not outcomes. That's fine.", 
   {
    "unicode_changes_made": true
   }, 
   177889, 
   null, 
   1131472620.0
  ], 
  [
   177896, 
   null, 
   "Howard Beale", 
   "jyoshu:\n \n \nI think part of the problem is that several of you are talking about something different here than I am, and vice versa. I'm not talking about someone who's already decided what the explanation of the data is. I'm talking about someone who believes Christ existed and believes the Bible. There's no way science can truly ever prove or disprove the existence of Christ. It's sort of like someone who believes that Alexander the Great existed and so is spurred on to study his historicity. The idea that one can't engage in good scholarship because he believes in his existence is, frankly, ludicrous. I'm not talking about fundamentalism here, which seems to be what you all think is the issue. I'm talking about belief that something is there, and there setting out to prove it. That's been the basis for many scientific discoveries even.\n \nIf someone does a scholarly examination of scripture and other pertinent evidence \"knowing\" that Jesus always spoke Hebrew, their scholarship would have to be faulty. If someone does a scholarly examination of scripture and other pertinent evidence \"knowing\" that Jesus never spoke Hebrew, their scholarship would have to be faulty. Good scholarship starts without preconception. Good scholarship is going wherever the truth of your study takes you.", 
   {
    "unicode_changes_made": true
   }, 
   177895, 
   null, 
   1131473280.0
  ], 
  [
   177899, 
   null, 
   "jyoshu", 
   "Your original point was complaining about the view that you have to study this from a skeptical point of view though\n\n \n No, I was talking about a  \"complete skepticism\" stance that despiritualizes everything, even to the point of disdain, of which you claimed it was \"the best position to look from\". I take issue with that because I don't think total skepticism is any stronger of a position than someone who takes a skeptical method even though he really believes what he's looking at. It's downright insulting to religious scientists to claim or imply they are unable to objectively view something that they happen to believe or are passionate about. Not to mention ludicrous. Scientists do this all the time. I dare say many of the discoveries that have been made in history have been because a scientist started with the belief that it's there to begin with.", 
   {}, 
   177889, 
   null, 
   1131474600.0
  ], 
  [
   177900, 
   null, 
   "jyoshu", 
   "jyoshu:\n \n Good scholarship starts without preconception.\n\n \n I guess we shouldn't look for any other Kuiper Belt objects beyond Pluto, if we believe they are there. According to you, the very fact that we believe they are there means we can't have \"good scholarship\" on the matter. I can't believe you don't see how ridiculous your stance is on this.", 
   {}, 
   177896, 
   null, 
   1131474840.0
  ], 
  [
   177901, 
   null, 
   "Tastyfish", 
   "You said just 'complete skepticism' and I did say it was a stronger position to take - not that you had to beleive it just that you had to study from that position. You can beleive in God and study, but you should look to see if there is a non-supernatural explaination first before deciding that God was involved. To do otherwise is ludicrus and insulting to anyone who doesn't share you beleif. Why is it reasonable to look at the Bible during egyption times and assume that everything God was doing was real, but that the actions of the Egyption gods were not.\n \n If you can show why this may be the case thats fine, but to do this you need to start from a skeptical position and try to show how neither were possible. If you fail to show any other way how it could have happened then you can accept that God was involved here and your beleif is justified.\n \n Nowhere is anyone forcing you to change your beleifs, just look at it from a neutral position.", 
   {}, 
   177899, 
   null, 
   1131475020.0
  ], 
  [
   177903, 
   null, 
   "jyoshu", 
   "Nowhere is anyone forcing you to change your beleifs, just look at it from a neutral position.\n\n \n LOL. I guess we've been arguing the same point from two different angles.", 
   {}, 
   177901, 
   null, 
   1131475080.0
  ], 
  [
   177906, 
   null, 
   "Tastyfish", 
   "Science works by disproving things most of the time - even if you are trying to prove something it is done by showing it is not like a case where the thing you are investigating doesn't happen.\n \n This is what people are talking about, if the issue in this particular study is whether it is likely a supernatural event happened - you would show this by trying to show whether it would be possible without a supernatural event. If this seems impossible you can accept the hypothesis that the supernatural event happened.\n \n Accepting supernatural events over normal ones is completly ludicrous and means that the entirity of human knowledge is useless as everything could be a special case, just like the one you are investigating. Not to mention that there is plenty of precedent for less advanced societies mistaking natural events for supernatural ones. In this case, the supernaturally skeptical point of view is the objective one until further evidence can be presented. \n \n Lacking a test for the supernatural, we are left with trying to show that something couldn't happen naturally. Of course then there is the next step of seeing whether this supernatural event also fits with other sources or whether the chance of it actually happening is so low it can be discounted or if it did occur it did so in quite a different way than discribed (creations myths, noahs ark etc..)", 
   {}, 
   177903, 
   null, 
   1131475620.0
  ], 
  [
   177909, 
   null, 
   "jyoshu", 
   "Science works by disproving things most of the time - even if you are trying to prove something it is done by showing it is not like a case where the thing you are investigating doesn't happen.\n \n\n \n As long as you agree that a Christian scientist can take an objective method in studying the Bible, I have no problem with what you are saying. I'm not arguing one can scietifically accept supernatural events over \"real\" ones, but that people who believe the Bible can take an objective approach to it. For instance, I believe the Bible in many ways. But it's not a science book for me. I don't think it means the universe was created in a literal 6 days. I'd like to think I have a pretty objective view there, since days couldn't even be a concept without a sun and earth in place. But I certainly believe the Bible. I just interpret it differently.", 
   {}, 
   177906, 
   null, 
   1131476100.0
  ], 
  [
   177914, 
   null, 
   "trebor", 
   "Oh please. Those are 2 different things. We aren't even necessarily talking about belief in supernatural miracles here. But even if we were, those who do believe in the things the Bible say in that regard can still use scientific methods to study it. I don't think you all have any idea how prejudicial you sound on this subject. \n \n You are, as you've stated, Jewish. So you have to have some affection for the Hebrew scriptures as they are the very basis for your religion. By your view you can't study them objectively.\n\n \n I can't study them assuming they are 100% inerrent, and 100% literal, that is true. \n \n But, you basically are building strawmen. The point is that you can not start studying somethign with a preconceived notion on what you will find, and reject any information that contradicts your preconceptions.\n \n That is what Orion was talking about. It was about having the abilty to seperate your 'theology' from your ability to analyse the facts.", 
   {}, 
   177881, 
   null, 
   1131477900.0
  ], 
  [
   177918, 
   null, 
   "Obvious Child", 
   "I guess we shouldn't look for any other Kuiper Belt objects beyond Pluto, if we believe they are there. According to you, the very fact that we believe they are there means we can't have \"good scholarship\" on the matter. I can't believe you don't see how ridiculous your stance is on this.\nI'll get back to your post to me in a sec, but this is a total misrepresentation. You can put forward the infallibility of the Bible as a hypothesis because you believe it. Just like someone can with Kuiper Belt objects. But it can't be a premise", 
   {}, 
   177900, 
   null, 
   1131479040.0
  ], 
  [
   177921, 
   null, 
   "jyoshu", 
   "That is what Orion was talking about. It was about having the abilty to seperate your 'theology' from your ability to analyse the facts.\n\n \n That's not a point of disagreement here. In fact I'd argue that point against you all, because I feel that you are the ones saying that someone believing in the Bible can't do that. My original point was that skepticism gone too far is not good, IMO. Some skepticism seems to be rooted in prejudice from what I've seen especially if it doesn't at least take the orthodox view as one possibility among others. (For instance, orthodoxy would say that the gospel of Luke was written by Luke. Hyper-skepticism might say that someone else wrote Luke and penned his name, and that it was all a fabrication.) I'm not saying that possibilty shouldn't be considered, I'm saying that the orthodox position should be considered as well as that one.", 
   {}, 
   177914, 
   null, 
   1131479340.0
  ], 
  [
   177925, 
   null, 
   "Obvious Child", 
   "That's not a point of disagreement here. In fact I'd argue that point against you all, because I feel that you are the ones saying that someone believing in the Bible can't do that. My original point was that skepticism gone too far is not good, IMO. Some skepticism seems to be rooted in prejudice from what I've seen especially if it doesn't at least take the orthodox view as one possibility among others. (For instance, orthodoxy would say that the gospel of Luke was written by Luke. Hyper-skepticism might say that someone else wrote Luke and penned his name, and that it was all a fabrication.) I'm not saying that possibilty shouldn't be considered, I'm saying that the orthodox position should be considered as well as that one.\nWhat's between orthodoxy and hyper-skepticism here?\n \n And I seriously know of no Bible scholar who takes the 'orthodox' position. Even my study Bible states pretty much as definite that Luke wasn't written by Luke the apostle.", 
   {}, 
   177921, 
   null, 
   1131479520.0
  ], 
  [
   177928, 
   null, 
   "jyoshu", 
   "What's between orthodoxy and hyper-skepticism here?\n \n And I seriously know of no Bible scholar who takes the 'orthodox' position. Even my study Bible states pretty much as definite that Luke wasn't written by Luke the apostle.\n\n \n What about orthodox Bible scholars? And I'm not so much calling for someone to take the orthodox position as I am to at least give it consideration. It's not like there's very strong evidence for Luke to have been written by someone else. \n \n I understand that there are some cases that the orthodox position simply can't be given weight from a scientific standpoint, e.g. a 6 day creation event, or the sun stopping in the middle of the sky. But in cases such as book authorship, it certainly can be at least considered as a posibility.", 
   {}, 
   177925, 
   null, 
   1131479820.0
  ], 
  [
   177929, 
   null, 
   "Obvious Child", 
   "Sorry, I was getting mixed up with the view that the Gospels were written by actual disciples. \n \n I can't really comment on the idea of someone called Luke (do you see this as the companion of Paul in the Epistle to Philemon?", 
   {}, 
   177928, 
   null, 
   1131480300.0
  ], 
  [
   177932, 
   null, 
   "jyoshu", 
   "Sorry, I was getting mixed up with the view that the Gospels were written by actual disciples. \n \n I can't really comment on the idea of someone called Luke (do you see this as the companion of Paul in the Epistle to Philemon?\n\n \n Well, Luke clearly states that his work is not a first hand account. But I have no problem with the idea that the author or Matthew (Levi) was really the disciple Matthew. Or at the very least was writing of an oral account from him.", 
   {}, 
   177929, 
   null, 
   1131481020.0
  ], 
  [
   177935, 
   null, 
   "Obvious Child", 
   "Now, the authorship of Matthew by Matthew Levi is a case where I can confidently say that this not being the case is almost universally accepted scholarly.\n \n Obviously the position has to be considered, but the evidence piles up against it.", 
   {}, 
   177932, 
   null, 
   1131482640.0
  ], 
  [
   177936, 
   null, 
   "Howard Beale", 
   "Jyoshu:\n \n \nI guess we shouldn't look for any other Kuiper Belt objects beyond Pluto, if we believe they are there. According to you, the very fact that we believe they are there means we can't have \"good scholarship\" on the matter. I can't believe you don't see how ridiculous your stance is on this. \n \nMy statement was that \"Good scholarship starts without preconception.\" A preconception is a bias or prejudice. It is elevating belief to the level of fact, a fixed idea. I do not believe that good scholarship can come from someone who has elevated \"belief\" to the level of fact. Do you believe that?", 
   {
    "unicode_changes_made": true
   }, 
   177900, 
   null, 
   1131482760.0
  ], 
  [
   177937, 
   null, 
   "Howard Beale", 
   "What about orthodox Bible scholars? And I'm not so much calling for someone to take the orthodox position as I am to at least give it consideration. It's not like there's very strong evidence for Luke to have been written by someone else. \n \n I understand that there are some cases that the orthodox position simply can't be given weight from a scientific standpoint, e.g. a 6 day creation event, or the sun stopping in the middle of the sky. But in cases such as book authorship, it certainly can be at least considered as a posibility.\n\n You toss words around like, \"conservative\", \"liberal\", \"orthodox\", \"skeptical\" in a way that is difficult to follow. Who are these \"orthodox Bible scholars\" that you speak of? Are they the same as the \"conservative\" scholars? Do you have any names?", 
   {
    "unicode_changes_made": true
   }, 
   177928, 
   null, 
   1131483060.0
  ], 
  [
   178077, 
   null, 
   "Orion", 
   "One of the hallmarks of scholarship is objectivity, which necessitates a certain degree of emotional detachment from the subject under study. You have to be willing to go wherever the evidence takes you.\n \n \n \nSo someone who's passionate about astronomy can't engage in good astronomy? Sure, that makes perfect sense . . .\n\n \n I neither said that nor implied anything of the kind. I'll be gentle with you and assume that you simply misinterpreted my statement.\n \n I have about eight years experience dealing with people who go to extremes in an attempt to defend the truth of the Bible, in all its aspects. The thinking goes something like this: if even one aspect of the Bible is in question, then the entire Bible becomes suspect. I can't begin to tell you how many hours of entertainment such conviction has brought me, whilst watching biblical literalists jump through hoops in an attempt to defend such biblical concepts as the creation of Adam & Eve, Noah's flood, Joshua's account of the sun and moon standing still, and of course, their characterization of Darwin's ToE as Satan's Lie, and that science as well as authoritative biblical scholarship are dominated by Bible-haters and Christ-bashers who are involved in a global, Satanic conspiracy to lead people away from the Bible. To which I say, render unto me a break!\n \n BTW, I'm an amateur astronomer and astro-photographer :-)", 
   {}, 
   177843, 
   null, 
   1131531240.0
  ], 
  [
   178104, 
   null, 
   "jyoshu", 
   "I neither said that nor implied anything of the kind. I'll be gentle with you and assume that you simply misinterpreted my statement.\n\n \n Oh . . . please be gentle with me. Whew! :p \n \n \nI have about eight years experience dealing with people who go to extremes in an attempt to defend the truth of the Bible, in all its aspects. The thinking goes something like this: if even one aspect of the Bible is in question, then the entire Bible becomes suspect. I can't begin to tell you how many hours of entertainment such conviction has brought me, whilst watching biblical literalists jump through hoops in an attempt to defend such biblical concepts as the creation of Adam & Eve, Noah's flood, Joshua's account of the sun and moon standing still, and of course, their characterization of Darwin's ToE as Satan's Lie, and that science as well as authoritative biblical scholarship are dominated by Bible-haters and Christ-bashers who are involved in a global, Satanic conspiracy to lead people away from the Bible. To which I say, render unto me a break!\n\n \n And that's not at all what we're talking about here. That's fundamentalism. I'm talking about the fact that people can believe the Bible and be passionate about it, and can still take an objective method in studying it.\n \n \nBTW, I'm an amateur astronomer and astro-photographer :-)\n\n \n Then you of all people should be able to understand my analogy! :)", 
   {}, 
   178077, 
   null, 
   1131554100.0
  ], 
  [
   178127, 
   null, 
   "Howard Beale", 
   "\n \n And that's not at all what we're talking about here. That's fundamentalism. I'm talking about the fact that people can believe the Bible and be passionate about it, and can still take an objective method in studying it.\n \nI understand what people \"can\" do. The question is do you believe that it is most often the case? Do you believe that people do do it?", 
   {}, 
   178104, 
   null, 
   1131559800.0
  ], 
  [
   178172, 
   null, 
   "jyoshu", 
   "I understand what people \"can\" do. The question is do you believe that it is most often the case? Do you believe that people do do it?\n\n \n In the scholarly community, most definitely. I'd say most Christian scholars DO fall into that catagory. But if you're talking about the typical fundie pastor, then no, of course not.", 
   {}, 
   178127, 
   null, 
   1131572580.0
  ], 
  [
   178191, 
   null, 
   "Bud Light Man", 
   "I didn't realize what a huge response I was going to get, but thanks. Although it has more than slightly veered off track. emoticon_wow \n As for all the replies I think I have the basic understanding down.emoticon_ic It just sucks researching everything when you have a poor internet connection. It's hard enough just to make replies and threads with out the research.", 
   {}, 
   178172, 
   null, 
   1131576180.0
  ], 
  [
   178200, 
   null, 
   "Howard Beale", 
   "In the scholarly community, most definitely. I'd say most Christian scholars DO fall into that catagory. But if you're talking about the typical fundie pastor, then no, of course not.\nMy thought is that you can only tell by the honesty of their scholarship -- determined by reading their writings.", 
   {}, 
   178172, 
   null, 
   1131577800.0
  ], 
  [
   178201, 
   null, 
   "Howard Beale", 
   "I didn't realize what a huge response I was going to get, but thanks. Although it has more than slightly veered off track. emoticon_wow \n As for all the replies I think I have the basic understanding down.emoticon_ic It just sucks researching everything when you have a poor internet connection. It's hard enough just to make replies and threads with out the research.\nWhen I can't support my view with other sources, I try to approach the subject from the place of asking others to give me their thoughts. If I take a position I cannot support I try to see clearly enough and humbly admit that my position is not well thought out. At least I try to do those things - sometimes you get caught up in the argument and just joust for the sake of jousting. It is a complete waste of time, but I must admit, there are times I engage in it.", 
   {
    "unicode_changes_made": true
   }, 
   178191, 
   null, 
   1131578040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Credentials???", 
  "url": "http://www.4forums.com/political/religion-debates/6755-credentials.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 6755, 
  "discussion_files": [
   [
    "14239.html", 
    "http://www.4forums.com/political/religion-debates/6755-credentials-print.html"
   ], 
   [
    "14240.html", 
    "http://www.4forums.com/political/religion-debates/6755-credentials-6-print.html"
   ], 
   [
    "14241.html", 
    "http://www.4forums.com/political/religion-debates/6755-credentials-4-print.html"
   ], 
   [
    "14242.html", 
    "http://www.4forums.com/political/religion-debates/6755-credentials-5-print.html"
   ], 
   [
    "14243.html", 
    "http://www.4forums.com/political/religion-debates/6755-credentials-3-print.html"
   ], 
   [
    "14244.html", 
    "http://www.4forums.com/political/religion-debates/6755-credentials-2-print.html"
   ]
  ], 
  "identifier": 6755
 }
]