[
 [
  [
   177153, 
   null, 
   "simone", 
   "I should like to examine this question within the capitalist system. I think that it may be also necessary to define what sort of capitalism is under discussion.\n \n Initally, I shall start the discussion by postulating that the components of capitalism are:\n \n Investment\n \n Labour\n \n Management\n \n I may be incorrect in this postulation, or there may those who disagree with me on this.\n \n My question is:\n \n Which component of capitalism as I see it--investment, labour, management--creates capital or wealth?", 
   {
    "post_info": {
     "post_title": "What Creates Capital, Wealth?"
    }
   }, 
   null, 
   null, 
   1131139440.0
  ], 
  [
   177169, 
   null, 
   "Steeeeve", 
   "creates capital for what? Capital for company, person, or country?", 
   {}, 
   177153, 
   null, 
   1131140520.0
  ], 
  [
   177175, 
   null, 
   "unkerpaulie", 
   "i assume she means for a country. that would be macroeconomics\n \n i think all those things mentioned contribute to capital. some countries can utilize one method better than another. a country with more natural resources, for instance, might become wealth by exporting the raw materials, or by creating more jobs, refining the raw material, and exporting the finished product. or it may not have natural resources, but an advantageous workforce (like china) so that raw materials can be shipped in, and the finished products shipped out. the added value of the labor creates the wealth\n \n i think most countries gain wealth by mixing a number of methods", 
   {}, 
   177169, 
   null, 
   1131141540.0
  ], 
  [
   177176, 
   null, 
   "Steeeeve", 
   "I figured he meant that but wanted to ask anyone...since its macroecon, I'm not going to comment. Accountants don't like economists emoticon_mad", 
   {}, 
   177175, 
   null, 
   1131141600.0
  ], 
  [
   177179, 
   null, 
   "simone", 
   "And, what about Adam Smith? Am I correct in believing that Smith had some rather liberal ideas about the role of labor?", 
   {}, 
   177176, 
   null, 
   1131142320.0
  ], 
  [
   177189, 
   null, 
   "Eddie", 
   "Which component of capitalism as I see it--investment, labour, management--creates capital or wealth?\n\n \n I have to say that I don`t really agree with your postulation. I would probably go for the more traditional production factors, that is; capital and labour (and sometimes land). \n \n But if we go by your postulation, I would say investment and labour creates wealth. And that management is a part of labour. Labour without investment (capital) would probably only create subsistance (sp) production at best. Investment without labour is pointless.\n \n Edit: \"...at best\" added", 
   {}, 
   177153, 
   null, 
   1131144060.0
  ], 
  [
   177296, 
   null, 
   "simone", 
   "Thanks, Eddie, for catching that.\n \n Also, in another discussion someone observed that \"management\" could be considered \"intellectual labor,\" investment is seen as a profit (surplus value) created by labour.\n \n Back to the drawing board:\n \n Investment\n \n Materials (which could include land, resources, etc.)\n \n Labor, which also comprises management\n \n Now, if I could just work in some Adam Smith pronouncements.", 
   {}, 
   177189, 
   null, 
   1131175620.0
  ], 
  [
   177319, 
   null, 
   "Alan Ryan", 
   "\n \n Now, if I could just work in some Adam Smith pronouncements.\n\n \n \"The natural effort of every individual to better his own condition ... is so powerful, that it is alone, and without any assistance, is not only capable of carrying on the society to wealth and prosperity, but of surmounting a hundred impertinent obstructions with which the folly of human laws too often encumbers its operations\". (The Wealth of Nations Book IV: Chapter V: Section IV)\n \n Isn't capitalism founded on natural self-interest and the science of economics just a sort of decoration on the basic cake ?", 
   {}, 
   177296, 
   null, 
   1131188400.0
  ], 
  [
   177326, 
   null, 
   "Eddie", 
   "@ Simone\n \n Here is Wealth of Nations by Adam Smith. I think you`ll find what you are looking for there.\n \n But I must say that while Adam Smith has left an impressing legacy, some of his ideas are a bit archaic and others are not as refined as one would whish. But it`s a good place to start I guess.\n \n As you will see, Smith talks a great deal about labour division and argues that this is the root-cause for economic development. And from a historic view, I agree, but in that case I think one need to look for the cause of labour division, namely surplus of agricultural produce. But then it becomes a question of what \"comes first\" rather than what actually creates wealth today. In order to achieve labour division, a society needed surplus of agricultural produce. And the cause for a surplus of agricultural produce have differed in in various civilizations throughout history. But most commonly, it was a combination of benevolent enviromental conditions and capital accumulation through experience and tool-making. As you can see, it is hard to establish the root cause since capital accumulation (investment), resources and land (materials) give rise to labour division (labour) that can give rise to additional capital accumulation and more efficient usage of materials. But this is from an historic perspective and refers to the early civilisations rather than how wealth is created today.\n \n Personally, I would say that it`s a combination between the abundance of the production factors (Labour, Capital) and how efficently they are employed. In the long term, the investment rate (and in a closed economy, =the savings rate) will determine the output (production) per capita (assuming away the possibility of improving efficiency). But granted, this is a rather simplified view and doesn`t consider access and ownership of natural resources (which obviously affect the wealth of a nation). \n \n Oh, and I think Adam smith was considered a liberal. But that would be a classic liberal. Not socio-liberal ala Rawls or Keynes(?).\n \n @ Alan\n \n Capitalism is based on natural self-interest as in individual profit maximation. But I would argue that so did manorial (feudalistic) and hunter-gatherer economies. Man is inherantly self-interested, and no economic system, religion or political ideology can change that. But the nature of self-interest do change depending on the economic, religous and cultural circumstances.", 
   {}, 
   177319, 
   null, 
   1131195900.0
  ], 
  [
   177329, 
   null, 
   "Alan Ryan", 
   "@ simone and eddie.\n \n Is this discussion specifically about the origins of capitalism, or is it intended to be a general inquiry about the \"theory and practice\" of capitalism ? Or is it meant to focus just on Adam Smith's analysis of the major elements of political economy ?", 
   {}, 
   177326, 
   null, 
   1131198780.0
  ], 
  [
   177330, 
   null, 
   "Eddie", 
   "@ simone and eddie.\n \n Is this discussion specifically about the origins of capitalism, or is it intended to be a general inquiry about the \"theory and practice\" of capitalism ? Or is it meant to focus just on Adam Smith's analysis of the major elements of political economy ?\n\n \n Hehe... I honestly don`t know. I`ve tried to cover all the bases though ;)", 
   {}, 
   177329, 
   null, 
   1131199080.0
  ], 
  [
   177331, 
   null, 
   "Alan Ryan", 
   "Hehe... I honestly don`t know. I`ve tried to cover all the bases though ;)\n\n OK eddie: \n \n I notice that you mention the division of labour (as Smith's root cause) for economic development and associate that with a surplus of agricultural produce. Do you mean, to put it crudely, that an agricultural crisis intensified the historic drift of labour to towns, and the development of town life is a vital factor in the rise of capitalism ?", 
   {}, 
   177330, 
   null, 
   1131199740.0
  ], 
  [
   177342, 
   null, 
   "Eddie", 
   "OK eddie: \n \n I notice that you mention the division of labour (as Smith's root cause) for economic development and associate that with a surplus of agricultural produce. Do you mean, to put it crudely, that an agricultural crisis intensified the historic drift of labour to towns, and the development of town life is a vital factor in the rise of capitalism ?\n\n \n My argument is not so much that agricultural surplus was the root cause for capitalism, but rather the root cause for the emergence of human civilisations. Without agricultural produce, no division of labour. And with no division of labour, no civilisation. But sure, urbanisation was a very important factor in explaining the emergence of capitalism. Especially if one believes that capitalism existed on small scale during the middle ages throughout europe", 
   {}, 
   177331, 
   null, 
   1131201360.0
  ], 
  [
   177358, 
   null, 
   "Alan Ryan", 
   "My argument is not so much that agricultural surplus was the root cause for capitalism, but rather the root cause for the emergence of human civilisations. Without agricultural produce, no division of labour. And with no division of labour, no civilisation. But sure, urbanisation was a very important factor in explaining the emergence of capitalism. Especially if one believes that capitalism existed on small scale during the middle ages throughout europe\n\n I think we should distinguish between the \"social division of labour\"- which is fundamental to the institutions of a stable state and one of the bonds of mutual dependence which finds expression in a system of law - and the detailed division of labour which exists in a factory etc. It's the social division of labour that is essential for the development of a \"civil society\".\n \n Agricultural surpluses presumably produced unemployment in the countryside and encouraged the drift of agricultural labourers to towns. So food surpluses (if they existed) were only indirect causes of the growth of capitalism.\n \n (If we examine each piece, bit by bit, we might put together the jigsaw of capitalism ?)", 
   {}, 
   177342, 
   null, 
   1131205080.0
  ], 
  [
   177364, 
   null, 
   "Eddie", 
   "I think we should distinguish between the \"social division of labour\"- which is fundamental to the institutions of a stable state and one of the bonds of mutual dependence which finds expression in a system of law - and the detailed division of labour which exists in a factory etc. It's the social division of labour that is essential for the development of a \"civil society\".\n \n\n \n True, there is a distinction between \"social division\" of labour and division of labour in a factory, even though I would probably say that they are of the same nature and caused by the same force (individual profit maximation through specialisation). \n \n \nAgricultural surpluses presumably produced unemployment in the countryside and encouraged the drift of agricultural labourers to towns. So food surpluses (if they existed) were only indirect causes of the growth of capitalism.\n\n \n But agricultural surplusses also fed the emerging cities and factory workers. It lowered the price for food, making it possible to employ labour at lower costs. Furthermore it made it more attractive for the individual to enter the labour force by lowering the relative gains from subsistance activities.\n \n As such, it was responsible for creating a large portion of the labour supply. Now, granted, energy production was probably more important for the emergance of industrial capitalism. But if we are talking about more general capitalism that could be found in cities during the middle ages, I would say that agricultural surpluses where the most important factor in explaining the emergance of capitalism.", 
   {}, 
   177358, 
   null, 
   1131205860.0
  ], 
  [
   177370, 
   null, 
   "Eddie", 
   "(If we examine each piece, bit by bit, we might put together the jigsaw of capitalism ?)\n\n \n \n Why not. It seems alot more funny than writing an exam on gender-roles during the middle ages that I`m currently engaged in :p", 
   {}, 
   177358, 
   null, 
   1131207360.0
  ], 
  [
   177371, 
   null, 
   "Alan Ryan", 
   "@ Eddie:\n \n So far we have nothing to argue about. I think we have agreed on three basic nutrients for the growth of capitalism (in the Middle Ages):\n \n a). human acquisitiveness. (this applies at all times to all human activities).\n \n b). an improvement in farming techniques that generated food surpluses.\n \n c). a \"proto-proletariat\" emerging in towns and cities as they absorbed labourers migrating from the land. As we might say, the cheap labour which was \"exploited\" by the founding fathers of capitalism. \n \n What hasn't been mentioned yet - perhaps because it's a little ahead in an historical view - is the influence of religion on the rise of capitalism. In particular the justifications that entrepreneurs found in the protestant faith.\n \n However, these are academic considerations: I suppose the arguments about capitalism that interest people most, are arguments about its \"fairness\", or its \"evils\", or its inevitability or otherwise, etc.", 
   {}, 
   177364, 
   null, 
   1131207960.0
  ], 
  [
   177377, 
   null, 
   "Eddie", 
   "@ Alan\n \n I agree with all your points.\n \n The protestant work-ethic? Yes, that one is certainly interesting and probably played an important role. And if we are talking about industrial capitalism I would also like to point towards the accesabillity to cheap and manageable energy (such as water power and coal). If we are talking about early capitalism, I would also like to stress the importance of trade and access to important trade routes such as the silk-road, baltic sea, atlantic and meditereanian (sp?).\n \n And yes... I guess this is a bit academic :p And isn`t what the original thread starter was looking for. But it`s interesting anyway. Besides, all the yanks are asleep at the moment so we can take care of the thread until they wake up again ;)", 
   {}, 
   177371, 
   null, 
   1131210540.0
  ], 
  [
   177391, 
   null, 
   "simone", 
   "Before I scream arrhhhhh! because I am now confronted with the complexity of a discussion of capitalism and ecnomics, not to mention confounded, let me lay out my particular agenda:\n \n I am of the liberal persuasion and very pro-labor, pro-worker and a tad bit incensed at what's happening in the US, where CEOs are paid some 400 times what the general laborer is paid within a company. I am looking for some good arguments to defend my position, hopefully incorporating a bit of Adam Smith here and here, but.....\n \n As you can see I am woefully ignorant of economics in general and hoped that I could find a \"quick and dirty\" economics for XXXXXX solution to my ignorance. Alas, I find that that may very well not be possible.\n \n I think my best course is to watch a debate between you, Alan, and you, Eddie, about what aspects of economics to consider and, if you would be so kind, allowing a bit of freeway for me to make sarcastic off-the-wall comments ever so often. I got away with that in a discussion of physics for a while and, unfortunately, I find it to be a great deal of fun--for me. I'm sure it's very annoying for other participants.\n \n I am looking for a magical formula that proclaims the superiority of the worker in the capitalistic machine, which justifies a \"living wage,\" and lots of holidays and joyous expectations of the working class as was experienced in Germany until very recently.\n \n What about worker-ownership of companies, participating in economic planning for a company if one knows enough?", 
   {}, 
   177377, 
   null, 
   1131215580.0
  ], 
  [
   177392, 
   null, 
   "simone", 
   "And, I have dipped a bit into Adam Smith, but not profoundly so, and I have read snatches of Weber's theories on protestantism and capitalism. I'm sure my views are very dated as a result.\n \n Although I am an American born and bred, I also have a Continental view of the labour market in consideration of the old guild system, trade unions and so forth. Vive la France and the ongoing revolution there!", 
   {}, 
   177391, 
   null, 
   1131215820.0
  ], 
  [
   177393, 
   null, 
   "simone", 
   "Can you guys compress this huge vastness into three simple sentences or so comprising all the wisdom of this huge mass? A miracle or two?", 
   {}, 
   177392, 
   null, 
   1131215940.0
  ], 
  [
   177397, 
   null, 
   "Eddie", 
   "@ Simone\n \n Hehe... I kind of suspected that you where looking for some arguments for state intervention on markets. And I don`t think Adam Smith is the right place to look. As I said before, Adam Smith was considered Liberal during his time, but in those times (and often still in Europe) liberal is not the same as the american contemporary version. Liberals over here are Laize-faire right-wingers that preach the gospel of free markets and tries to scare us with tales of the evil bogey-man of socialism and collectivism. \n \n My main objection to capitalism as a method of distributing resources is that capitalism is based on capital accumulation. And capital accumulation begets capital accumulation which leads to wealth concetration if left un-checked. And wealth concentration is not a good thing.\n \n America is currently way on it`s path to a two-tier economy. Where the haves are highly productive with great wages and opportunities and where the have-nots are down-trodden, poor and powerless. Apart from the obvious injustice, it also carries significant costs with high levels of unemployment, crime rates and social and political inballance. More progressive taxation is not the way to go as it will only lead to greater wage differences when the market adjusts (and the wage difference post taxation will remain). However raising overall productivity and establishing a strong and powerful labour movement could perhaps be a way.", 
   {}, 
   177391, 
   null, 
   1131216780.0
  ], 
  [
   177398, 
   null, 
   "Eddie", 
   "Hmm.. you wanted three sentances? :p \n \n How about taking a look at the nordic model and how it both differs from the european continental model and the US model. For me at least, it offers an alternative to the neo-liberal (read laize faire) dominance of late. But perhaps that`s just my surpressed patriotism shining through ;).", 
   {}, 
   177397, 
   null, 
   1131216960.0
  ], 
  [
   177399, 
   null, 
   "simone", 
   "Thanks, Eddie, some nice points. An attempt was made to limit capital accumulation via inheritance in America through the use of the inheritance tax for the extremely wealthy. I think that this tax has been eliminated by Bush and a fellow named Grover Norquist, but not permanently.", 
   {}, 
   177397, 
   null, 
   1131217020.0
  ], 
  [
   177400, 
   null, 
   "simone", 
   "Being of Nordic descent, I love the Nordic model. But that model is not true capitalism, is it?", 
   {}, 
   177399, 
   null, 
   1131217080.0
  ], 
  [
   177404, 
   null, 
   "Eddie", 
   "I guess it depends on what you mean by \"true capitalism\". I mean, it is certainly a market economy where private ownership of production factors (capital, land etc) are allowed. It is based on a higher tax rate, a large publicly sector, strong labour unions and governmental intervention on certain key markets. It has been described as a middle way between US-style market economy and Soviet-style planned economy, but I don`t think this is true anymore. Traditional marxist politics like wage earners funds (labour unions where to own a significant portion of the capital stock in order to place the ownership of the production factors in the hands of the workers) was probably the last attempt to tread the path towards a classless society (in Sweden). Today, the politicians are more pragmatic (possibly because we don`t have the same margins to play around with anymore). \n \n In essence; I would claim that the traditional nordic model (pre 1990) should be considered partially capitalistic. A third way if you will. While the current model should be considered entirely capitalistic.\n \n But if talk about capitalistic like me and Alan has been talking, the nordic model is, and has always been capitalistic.", 
   {}, 
   177400, 
   null, 
   1131217740.0
  ], 
  [
   177415, 
   null, 
   "Alan Ryan", 
   "If I can chip in here, simone, I agree with Eddie, you won't find support in Adam Smith for interventionist arguments. If I can recommend a book that does examine the American economy from a left of centre European point of view (and without being \"anti-American\" on principle), it's \"The World We're In\" by Will Hutton. It's an easy read and has a great deal to say about the shortcomings of the American business model and the deal that working people get in the US. \n \n Hutton, by the way, is an admirer of the Scandinavian economies and the social contracts adopted there.", 
   {}, 
   177404, 
   null, 
   1131218760.0
  ], 
  [
   177419, 
   null, 
   "Mach", 
   "\n Investment\n Labour\n Management\n \n I may be incorrect in this postulation, or there may those who disagree with me on this.\n My question is:\n Which component of capitalism as I see it--investment, labour, management--creates capital or wealth?\n\n \n We have some economic heavy-hitters around on the forums who will hopefully correct us all, here are some ideas.\n \n The components are simple, all around us.\n \n Wealth is not generated by a particular \"model\" or \"ideal\", it's generated by a combination of reality and human desire. For instance, realistically if we're trapped on an island, if we value our survival, food, and drinkable water, for instance, would necessarily have \"high value\". That is, in our hierarchy of want's/needs, survival is high on the list (often the highest). So, food and water have no inherent \"value\" per se, they are not \"wealth\", they are just elements after all, organzied in some way. But given a definition with respect to what humans want/need, food and water, in a scarce system, may indeed be \"wealth\". Once you've taken care of those needs, humans seem to move up a hierarchy of wants. After that, they want shelter. Shelter has value because of it's function with respect to humans (who desire it). Shelter may be found (caves), or built (human energy/time). But why would someone build a shelter if for instance, they already had one? Perhaps if someone else wanted a shelter, and had food/water, and the other person had the know-how and tools to construct shelthers, but no food and water, they would trade, and both satisfy their needs through the exchange of \"property\", and \"labor\" (slaves/automated intelligence, can be both).\n \n So, wealth is generated by the universe and it's relationship to human deisres. In capitalism you can defined them as property and labor. Natural resources can be \"owned\" i.e. property. Human labor is not \"owned\" but negotiated for. Money provides a \"universal\" medium for transferring property and labor, and ends up being a good measure of \"wealth\".\n \n Note that \"the potential for increasing profit\", since humans can think ahead, can then also have value (or not). For instance, if you dream up a new way to produce furniture that takes less captial investment than the status quo, that \"idea\" may hold value. Now, it's really \"potential\" wealth, in that if it's not actually transferred into real wealth, then it's not wealth. But the reality is that either it will, or will not, result in an increase in wealth, and betting on it, then becomes a function of a generic capitalist system. Investing. Persumably using wealth to drive a particular business, where you hope/predict to be rewarded through increased profits.\n \n All are just logical extensions of the way humans function, and where humans find themselves (the earth). So, to answer your question, the conjunction of labor, resources, and human desire for those things, creates wealth.\n \n -Mach", 
   {}, 
   177153, 
   null, 
   1131218880.0
  ], 
  [
   177425, 
   null, 
   "Mach", 
   "\n I am of the liberal persuasion and very pro-labor, pro-worker and a tad bit incensed at what's happening in the US, where CEOs are paid some 400 times what the general laborer is paid within a company. I am looking for some good arguments to defend my position, hopefully incorporating a bit of Adam Smith here and here, but.....\n \n\n \n I didn't realize this was your angle. It's a hard road simone, it's great that you're looking for more info on it.\n \n Now, do some corporate executives, once in power, milk a profitable business while providing no real direction/ideas/increase in profit to the company? Yes. Do some actually make a fortune while literally running the company into bankruptcy? Sure. But these are the high profile cases you see on the news. These people should not be condemned for making so much money, it's more an issue of an abuse of power. The owners (shareholders), don't necessarily have the transparency or power they need to correct such issues. If they did, they often would (but not always!).\n \n So, some CEOs certainly abuse their power and do things that, if the shareholders had complete and simple to understand access to, would probably attempt to correct. Likewise, a board may also not have the information it needs, or again, may actually condone or cooperate with the abuse of power. But abuse of power is a human trait (a relative one at that), not a function of an economy, or wealth, necessarily.\n \n However, an enormous number of CEOs and executives do their jobs, made enormous sacrifices to get there, save companies, create entire markets, and frankly have chosen to do, and have succeded to do, what most anyone can choose to do themselves. And afterall, the achievements of others should MOTIVATE you, not anger you, unless you're given to jealousy/envy. \n \n What you are angered by, ultimately, is freedom, and human nature. But honestly, many great thinkers and achievers struggle with identifying how to better the system. It's hard, to have both freedom, and strict rules, one always stifiles the other. So naturally it's a compromise. And while you shouldn't roll over at scandal like Enron, you should also get a bigger perspective on:\n \n 1. Is this the norm or are most businesses providing for the market in a fair way?\n 2. The CEO's, if they aren't breaking laws, are pursuing their dreams (wealth/power), and just because they actually achieved their dream, do we then step in and shatter it? (of course not, in a free society).\n 3. Do CEOs that really do abuse their power, not bring it to our attention, so that we can perhaps find way to better direct people's dreams to productive ways of achieving them rather than less productive ways (like siphoning profit until the business dies).?\n 4. Who get's to decide what's allowed? You? Who has no stake or invetsment in the company, or the board, who was chosen for their experience and leadership, along with shareholders, who also put their money on the line? It's hard to divest power, but by in large power is in the right places. If it's not, then eventually, with a mixture of liberal/conservative politics, we may correct it.\n \n -Mach", 
   {}, 
   177391, 
   null, 
   1131220680.0
  ], 
  [
   177426, 
   null, 
   "simone", 
   "If I can chip in here, simone, I agree with Eddie, you won't find support in Adam Smith for interventionist arguments. If I can recommend a book that does examine the American economy from a left of centre European point of view (and without being \"anti-American\" on principle), it's \"The World We're In\" by Will Hutton. It's an easy read and has a great deal to say about the shortcomings of the American business model and the deal that working people get in the US. \n \n Hutton, by the way, is an admirer of the Scandinavian economies and the social contracts adopted there.\nAlan, excellent sales pitch there. I'll have a look at it. :)", 
   {}, 
   177415, 
   null, 
   1131220800.0
  ], 
  [
   177428, 
   null, 
   "simone", 
   "Mach, thanks for your input.\n \n I will master economics. I will. I will. Even if I have to study some.\n \n Sorry, I am so lazy. I used to sleep through university classes and absorb info by sleeping with my head on the book and I managed to get good grades even. Those were the good old days when life was easy.", 
   {}, 
   177426, 
   null, 
   1131221040.0
  ], 
  [
   177481, 
   null, 
   "Alan Ryan", 
   "@ simone:\n \n The economic arrangement defined as \"capitalism\" can, of course, be studied in a number of ways. For examples: We could stick to the historical approach and try to explain the rise of capitalism by reference to social and economic phenomena of the 16th century - elaborating as necessary as we approach modern times. We could discuss a large number of economic concepts as they apply to the \"theory and practice\" of capitalism. We could talk about the insights of Karl Marx. We could distinguish varieties of capitalism, commercial, industrial, state, welfare, etc. and examine them thoroughly. In the ultimate case, we could go back (as I think Mach has suggested) to a philosophical discourse about the nature of man, the rational self interest at the heart of human conduct - and theorise about how a \"germ of selfishness\" that can grow into capitalism exists, perhaps, at a very deep level in the human psyche.\n \n But I don't think I'm telling you anything you don't know already: I'm just thinking aloud about how a discussion like this could take off in any number of directions, and still maintain its interest.", 
   {}, 
   177428, 
   null, 
   1131276900.0
  ], 
  [
   177504, 
   null, 
   "simone", 
   "Agreed, Alan. I'm more interested in what's happening now. I think historical events should be briefly discussed in cases where they have affected current events under discussion if ignorance is displayed (in most cases, mine).\n \n Another problem is the various viewpoints and locations of participants. Eddie is in the UK and I'm not very well informed about what the labour movement is like over there. I'm slightly better informed about the labour situation in the U.S.\n \n We might also toss out what it is that we want to know, to see if that seeking of knowledge is addressed.\n \n I would like to know a bit more about what's happening in the UK and on the continent and in Nordic nations (I hadn't realized before that Scandinavia is not quite like Continental Europe). And, I have my idiotic fascination with Adam Smith. Actually, I even have a congressman named Adam Smith (I'm from Washington State), and with a name like that the guy doesn't even have to campaign. He happens to be a Democrat who lost some standing with me because he supported John Kerry over Howard Dean (my fav), and he stands a wee bit too much with the DLC over progressive Democrats.\n \n So, toss out your questions and concerns and if we don't have the answers, we might be able to research them out. I'm getting a copy of the book you recommended, by the way.", 
   {}, 
   177481, 
   null, 
   1131296100.0
  ], 
  [
   177505, 
   null, 
   "Eddie", 
   "Another problem is the various viewpoints and locations of participants. Eddie is in the UK and I'm not very well informed about what the labour movement is like over there. I'm slightly better informed about the labour situation in the U.S.\n\n \n Actually I`m from Sweden. But I`m flattered that you didn`t immediatly spot that english wasn`t my first language :)\n \n And the labour union situation in Sweden is pretty cool :) The unified manual labour movement (LO) is probably the single most powerful political and economic institution in the whole country.", 
   {}, 
   177504, 
   null, 
   1131296460.0
  ], 
  [
   177507, 
   null, 
   "simone", 
   "Will Hutton's book.\n \n Also, in order to clarify my understanding, could you all (I ain't from the American South, by the way) toss out a few concrete examples of \"interventionism\" as opposed to the \"invisible hand\" of Adam Smith?\n \n Also, I will, for your edification and great amusement, detail my struggle and search for knowledge. You are welcome to make sarcastic remarks.\n \n I do not have Hutton's book in my hands yet. However, yesterday, I went to my local bookstore and looked at the Economics for XXXXXX and Dummies. I very quickly determined that I was more of an Idiot than a Dummy, so I got that book (slightly cheaper, smaller and, I think, better organized). And, I detected an incriminating ideological slant in the Dummy book. It sounded like a Republican talking point advisory and the Idiot's guide discussed Wal-mart in unflattering terms and had kind things to say about Roosevelt's policies after the Great Depression of the U.S.--well, at least, relatively unbiased things to say.\n \n So, Franklin Delano Roosevelt is one of my heroes, flawed as he may have been. And, the Great Depression was often discussed in my family as an incredibly evil time. Historically, also, there is the factor of WWII, if not WWI. The UK was vastly more affected by these wars than the U.S. and the histories of the U.S. and the UK are quite different because of those wars.", 
   {}, 
   177504, 
   null, 
   1131296940.0
  ], 
  [
   177531, 
   null, 
   "Symbiote", 
   "The most important thing to recognise in the discussion of this topic is that \"wealth\" ie \"valuable things\", is not a physical object, but an object subjectively evaluated. What is wealth to one may be trash to another, the untouched wilderness of earth may appear more valuable than the 21st century civilisation that has been built. There is no social entity which exist which can evaluate a change particular change as wealth destroying or wealth creating.\n \n Matter/energy is never created or destroyed, it is simply rearranged.\n \n Nevertheless whenever man acts he does so to create a state of affairs he perceives as more valuable than the alternatives.\n \n The satisfaction created by this rearrangement can either be immediate or delayed, and what we normally perceive as wealth are existing products which provide future satisfaction. For example if a man builds a car which he will enjoy for many years, we consider he has increased his wealth (and it is always his or [/i]her[/i] wealth, since value is subjective). If a man creates a hamburger, which he does enjoy, but no longer exists following its enjoyment, he has increased his satisfaction, but not his wealth, since no product exists to provide future satisfaction.\n \n Thus there are 3 components to wealth creation\n 1) The \"land\" - the matter to be rearranged.\n 2) The \"labour\" - the effort to be expended in the rearrangement\n 3) The \"entrepeneurial function\" - the direction of the effort of rearrangement in such a way that it actually increases the value of the rearranged land.\n \n Of course if the wealth created is immediately consumed there is no wealth created in the long term. And so if we speak of long term wealth creation, there must exist also a low degree of time preference the willingness to delay consumption to a later date, since if wealth is created but immediately consumed, in the long run the amount of wealth will remain approximately the same.\n \n Wealth creation in the long term then relies upon the psychological phenomena of time preference. Since even if land, labour, and direction of efforts are of poor quality, if time preference is very low, in the long run wealth will increase - and even if land, labour and the entrepeneurial function are sufficiently high in quality, if time preference is high enough, all available wealth will be consumed, the determining factor of long-run wealth increase or decrease is that of time-preference.\n \n Or to put it more simply - wealth will increase in the long run if people save more than they spend.", 
   {}, 
   177507, 
   null, 
   1131304260.0
  ], 
  [
   177537, 
   null, 
   "Eddie", 
   "@ Symbiote\n \n I think you raise a couple of very good points. Wealth is certainly subjective and establishing some form of objective measurment of \"wealth\" is therefor impossible (even though we may certainly try). Your take on the production factors are interesting as well, even though I would say that they closely resemble the generally accepted factors of labour, capital (and efficiency).\n \n I also agree that wealth is dependant on savings. I would however not dismiss immediate consumption. I don`t think you should equate wealth with savings in this fashion as a consumed good also had value. I don`t really know how to settle this though, but perhaps production and savings should be used as a measurment of wealth, as production is future consumption and savings, and savings are past production. (hmm I don`t really know how that came out.. I`m a bit tired at the moment)\n \n as for your conclusion, I must say that I disagree. Wealth do not necessarily increase as long as you save more than you consume or spend. Investments (capital) depreciate and in the long run, the investment rate is equal to the depreciation rate (steady state). In this case, production, and wealth doesn`t increase. Only external factors (like population growth, increases in technological or organisational efficiency, etc, etc) may increase production and wealth.", 
   {}, 
   177531, 
   null, 
   1131305940.0
  ], 
  [
   177538, 
   null, 
   "simone", 
   "Thanks, Symbiote, and I see that your FDR credentials are awesome!!! :) \n \n The thing that won me over to The Complete Idiot's Guide to Economics by Tom Gorman was this bit in the section on depression:\n \n \nThe Real World\n In March 1933, Franklin D. Roosevelt succeeded Herbert Hoover as president of the United States. Roosevelt immediately began efforts to reform the banking and securities industries, provide relief for farmers and the unemployed, and stimulate the economy. By June 30, the Emergency Banking Relief Act (providing for federal bank inspections), Agricultural Adjustment Act and Farm Credit Act (subsidizing farmers), Reforestation Relief Act (putting people to work on conservation projects), and the Federal Securities Act and Glass-Steagal Act (reforming the securities industry) were all passed. The FDIC and the Tennessee Valley Authority were both created in that period as well.\n \n These measures initiatived the New Deal, which expanded the role of the government in the economy as both regulator and participant. This made Roosevelt a hero to many and a demon to others, depending on their politics and economic situation.\n", 
   {}, 
   177531, 
   null, 
   1131306120.0
  ], 
  [
   177539, 
   null, 
   "simone", 
   "Symbiote, pray break out your pompoms and don your cheerleading outfit and we'll do a rousing series of cheers for the great FDR.", 
   {}, 
   177538, 
   null, 
   1131306240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What Creates Capital, Wealth?", 
  "url": "http://www.4forums.com/political/economics-debates/6774-what-creates-capital-wealth.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 6774, 
  "discussion_files": [
   [
    "1712.html", 
    "http://www.4forums.com/political/economics-debates/6774-what-creates-capital-wealth-print.html"
   ], 
   [
    "1713.html", 
    "http://www.4forums.com/political/economics-debates/6774-what-creates-capital-wealth-3-print.html"
   ], 
   [
    "1714.html", 
    "http://www.4forums.com/political/economics-debates/6774-what-creates-capital-wealth-2-print.html"
   ]
  ], 
  "identifier": 6774
 }
]