[
 [
  [
   178049, 
   null, 
   "SubtleRedFlag", 
   "http://news.yahoo.com/s/ap/20051109/ap_on_re_us/evolution_debate\n \n Alright so its sounds like maybe good news if you haven't followed very closely but these new \"science standards\" actually undercut Darwinism and introduce the need for further explanation (creationism).\n \n I find one comment extremely absurd, by a board member who voted for the new standards: \"It gets rid of a lot of dogma that's being taught in the classroom today,\" said board member John Bacon.\n \n Dear Mr. Bacon, here is the definition of dogma:\n \n A doctrine or a corpus of doctrines relating to matters such as morality and faith, set forth in an authoritative manner by a church.\n \n America is slowly going down the drain", 
   {
    "post_info": {
     "post_title": "Kansas School Board OKs Evolution Language"
    }
   }, 
   null, 
   null, 
   1131511860.0
  ], 
  [
   178071, 
   null, 
   "Master_Shake", 
   ":xcensored :xcensored :xcensored :xcensored emoticon_xkill :xcensored :xcensored \n FLIPPIN' AYY!!\n I live in Kansas, so I have to say that, while I am not surprised, this still blows. I wholeheartedly agree with one of the board members who said \"This is a sad day. We're becoming a laughingstock of not only the nation, but of the world, and I hate that.\" As if people didn't already have a poor enough view of Kansas.:xcensored", 
   {}, 
   178049, 
   null, 
   1131521220.0
  ], 
  [
   178073, 
   null, 
   "pandion", 
   "And yet, just days after the Dover, PA trial about the introduction of ID into public schools as science has concluded, every single one of the incumbents on the Dover school board has been defeated in today's election. As chance would have it, all of them voted in favor of replacing science with the fable of IDcreationism in public schools.\n \n Kansas did it before, and now Dover, PA has done it. But still, the US District Court will give a decision that can be used as a precedent by the people of Kansas as they undergo their second attack by creationists against science.", 
   {}, 
   178071, 
   null, 
   1131523740.0
  ], 
  [
   178085, 
   null, 
   "trebor", 
   "And yet, just days after the Dover, PA trial about the introduction of ID into public schools as science has concluded, every single one of the incumbents on the Dover school board has been defeated in today's election. As chance would have it, all of them voted in favor of replacing science with the fable of IDcreationism in public schools.\n \n Kansas did it before, and now Dover, PA has done it. But still, the US District Court will give a decision that can be used as a precedent by the people of Kansas as they undergo their second attack by creationists against science.\n\n \n \n I am sure the publiicity of the trial and the exposed motivations of the board members who voted to teach ID was an important part of the process. Even if they agree with ID, I am sure they thought that the board members did the Dover School District no favor in trying to push it.", 
   {}, 
   178073, 
   null, 
   1131546300.0
  ], 
  [
   178100, 
   null, 
   "georged", 
   ":xcensored :xcensored :xcensored :xcensored emoticon_xkill :xcensored :xcensored \n FLIPPIN' AYY!!\n I live in Kansas, so I have to say that, while I am not surprised, this still blows. I wholeheartedly agree with one of the board members who said \"This is a sad day. We're becoming a laughingstock of not only the nation, but of the world, and I hate that.\" As if people didn't already have a poor enough view of Kansas.:xcensored\n\n \n Makes George Carlin's plan to use the state of Kansas as a prison even more appealing. \n \n I especially liked the board member dogma statement.", 
   {}, 
   178071, 
   null, 
   1131553380.0
  ], 
  [
   178130, 
   null, 
   "sinjin", 
   "One small step for man. One giant leap for fundamentalism.", 
   {}, 
   178100, 
   null, 
   1131561120.0
  ], 
  [
   178131, 
   null, 
   "Howard Beale", 
   "Makes George Carlin's plan to use the state of Kansas as a prison even more appealing. \n \n I especially liked the board member dogma statement.\nYes, kind of reminds me of Abraham Lincoln's thought: \"Better to remain silent and be thought a fool than to speak out and remove all doubt.\"", 
   {}, 
   178100, 
   null, 
   1131561180.0
  ], 
  [
   178132, 
   null, 
   "prschuster", 
   "Here's an excerpt from the article:\n The new standards say high school students must understand major evolutionary concepts. But they also declare that the basic Darwinian theory that all life had a common origin and that natural chemical processes created the building blocks of life have been challenged in recent years by fossil evidence and molecular biology.\n \n \n \n \n Walking-fish:\n The falsity of this statement about the challenge to Darwinism is subtle, and might go under some people's radar. It is true that there is scant evidence for a single common ancestor for all living organisms, but there are many well documented instances of common ancestry for certain taxons (cynodonts for mammals / theropod dinosaurs for birds / Choanoflagellates for sponges). However, the fossil evidence does not challenge common ancestry in any way; it is merely incomplete - an important distinction. Also, molecular biology, by the same token does not challenge abiogenesis; it only brings to light some unsolved problems. The big obfuscation here is to misrepresent the incompleteness of data in the fields of paleontology & molecular biology, by characterizing this as a \"challenge\" to the theory. That's like saying the controversy over whether Crispus Attucks was really the first person to die in the Boston Massacre poses a \"challenge\" to the existence this historical event.", 
   {}, 
   178100, 
   null, 
   1131561240.0
  ], 
  [
   178180, 
   null, 
   "daewoo", 
   "You guys are going WAY overboard on this. The changes to the board of education standards will NOT materially change the way evolution is taught in Kansas, nor does it allow the teaching of creationism or intelligent design in our classrooms.\n \n Our districts scientific advisory board says the changes to the curriculum make it \"more factually accurate\", and even the folks who drafted the original curriculum could find no factual fault with the new draft. \n \n The chicken littles out there need to get a grip.", 
   {}, 
   178132, 
   null, 
   1131573840.0
  ], 
  [
   178184, 
   null, 
   "trebor", 
   "You guys are going WAY overboard on this. The changes to the board of education standards will NOT materially change the way evolution is taught in Kansas, nor does it allow the teaching of creationism or intelligent design in our classrooms.\n \n Our districts scientific advisory board says the changes to the curriculum make it \"more factually accurate\", and even the folks who drafted the original curriculum could find no factual fault with the new draft. \n \n The chicken littles out there need to get a grip.\n\n \n Right.. uh huh. That is why the changed the definition of what science is.\n \n From the article\n \n\n In addition, the board rewrote the definition of science, so that it is no longer limited to the search for natural explanations of phenomena.\n \n", 
   {}, 
   178180, 
   null, 
   1131574320.0
  ], 
  [
   178202, 
   null, 
   "Howard Beale", 
   "You guys are going WAY overboard on this. The changes to the board of education standards will NOT materially change the way evolution is taught in Kansas, nor does it allow the teaching of creationism or intelligent design in our classrooms.\n \n Our districts scientific advisory board says the changes to the curriculum make it \"more factually accurate\", and even the folks who drafted the original curriculum could find no factual fault with the new draft. \n \n The chicken littles out there need to get a grip.\nI can't tell the future. I can tell what is accurate and what is inaccurate. I think we should do our best to have schools teach our kids what is accurate science in science class.", 
   {}, 
   178180, 
   null, 
   1131578220.0
  ], 
  [
   178214, 
   null, 
   "OccamsRazor", 
   "\n I find one comment extremely absurd, by a board member who voted for the new standards: \"It gets rid of a lot of dogma that's being taught in the classroom today,\" said board member John Bacon.\n \n Dear Mr. Bacon, here is the definition of dogma:\n \n A doctrine or a corpus of doctrines relating to matters such as morality and faith, set forth in an authoritative manner by a church.\n \n America is slowly going down the drain\n\n \n Yes, Creationist doublespeak at its \"best\".\n \n Once again creeping Creationism seeks to undermine science in little steps. If this latest inroad is not stopped more will follow, rest assured.", 
   {}, 
   178049, 
   null, 
   1131582240.0
  ], 
  [
   178233, 
   null, 
   "marc9000", 
   "I can't tell the future. I can tell what is accurate and what is inaccurate. I think we should do our best to have schools teach our kids what is accurate science in science class.\n\n \n So you think the wrong process was used to determine what should be taught in schools?", 
   {}, 
   178202, 
   null, 
   1131588000.0
  ], 
  [
   178249, 
   null, 
   "Howard Beale", 
   "So you think the wrong process was used to determine what should be taught in schools?\nI didn't use the words \"wrong process\". I am not sure what you mean.", 
   {}, 
   178233, 
   null, 
   1131591420.0
  ], 
  [
   178251, 
   null, 
   "marc9000", 
   "I didn't use the words \"wrong process\". I am not sure what you mean.\n\n \n You said this;\n \n \nI can't tell the future. I can tell what is accurate and what is inaccurate. I think we should do our best to have schools teach our kids what is accurate science in science class.\n\n \n Do you think \"what is accurate\" is so cut and dried that school boards and voters shouldn't determine it?", 
   {}, 
   178249, 
   null, 
   1131592020.0
  ], 
  [
   178256, 
   null, 
   "daewoo", 
   "I can't tell the future. I can tell what is accurate and what is inaccurate. I think we should do our best to have schools teach our kids what is accurate science in science class.\n\n \n \n Have you read the changes? I was a little surprised when I first read them. They are a non issue. Our science advisory board LAUGHED when they read them over the fact that they were causing such controversey. They are a non issue. There are going to be NO material changes regarding how evolution will be taught. \n \n In reality, the argument for the change was won not by the creationists, but by a bunch of palentologists from Kstate who pointed out that the definiton that the school board was currently using essentailly ruled out Punctuated Equilibria (evolutionary leaps), despite the fact that the theory is better supported by the fossil record than the traditional evolutionary theory (slow changes over a long period of time).", 
   {}, 
   178202, 
   null, 
   1131593880.0
  ], 
  [
   178265, 
   null, 
   "Howard Beale", 
   "You said this;\n \n \n \n Do you think \"what is accurate\" is so cut and dried that school boards and voters shouldn't determine it?\n When it comes to science, no they shouldn't, without question. I would not want a school board to determine a medical procedure to be performed on me, either like they tried in the Terry Schivo case.", 
   {}, 
   178251, 
   null, 
   1131596340.0
  ], 
  [
   178272, 
   null, 
   "marc9000", 
   "When it comes to science, no they shouldn't, without question. I would not want a school board to determine a medical procedure to be performed on me, either like they tried in the Terry Schivo case.\n\n \n Then you don't believe in the U.S. political system - that's the point I'm trying to make. (US taxpayer funded school decisions isn't comparable to personal medical cases)\n \n A school board didn't attempt to make a decision in the Schivo case.", 
   {}, 
   178265, 
   null, 
   1131597840.0
  ], 
  [
   178276, 
   null, 
   "Howard Beale", 
   "Then you don't believe in the U.S. political system - that's the point I'm trying to make. (US taxpayer funded school decisions isn't comparable to personal medical cases)\n \n A school board didn't attempt to make a decision in the Schivo case.\n\n \n Medicine is a science. I do not want non-scientific theories or erroneous information taught to people who may end up being my children's doctor. You see, doctors study science. ID is not a valid scientific theory. I want the doctor's who will care for my kids and grandkids to get proper scientific educations, not flawed ones.\n \n How can I say that? Because no proponent of ID can name one scientist who has demonstrated that ID is a valid scientific theory. That's how.", 
   {
    "unicode_changes_made": true
   }, 
   178272, 
   null, 
   1131598380.0
  ], 
  [
   178521, 
   null, 
   "marc9000", 
   "Medicine is a science. I do not want non-scientific theories or erroneous information taught to people who may end up being my children's doctor. You see, doctors study science. ID is not a valid scientific theory. I want the doctor's who will care for my kids and grandkids to get proper scientific educations, not flawed ones.\n \n How can I say that? Because no proponent of ID can name one scientist who has demonstrated that ID is a valid scientific theory. That's how.\n\n \n You want doctors for your kids who believe that life has no meaning - if it feels good, do it? Or a doctor with Christian values?", 
   {
    "unicode_changes_made": true
   }, 
   178276, 
   null, 
   1131683700.0
  ], 
  [
   178523, 
   null, 
   "Howard Beale", 
   "You want doctors for your kids who believe that life has no meaning - if it feels good, do it? Or a doctor with Christian values?\nI want a doctor who will make them better. That's why I take them to a doctor instead of a rabbi, minister, priest or shaman. Why do you go to a doctor?", 
   {}, 
   178521, 
   null, 
   1131683940.0
  ], 
  [
   178558, 
   null, 
   "pandion", 
   "You want doctors for your kids who believe that life has no meaning - if it feels good, do it? Or a doctor with Christian values?\nThat doesn't even make sense. Why would someone become a doctor if he/she thought that life had no meaning? And what do christian values have to do with it?", 
   {}, 
   178521, 
   null, 
   1131690720.0
  ], 
  [
   178591, 
   null, 
   "trebor", 
   "You want doctors for your kids who believe that life has no meaning - if it feels good, do it? Or a doctor with Christian values?\n\n \n \n Now, that is just plain stupid. Just because someone is not CHristian doesn't meant hey don't have values. \n \n For the most part, \"CHristian\" values suck.\n \n I want someone who is ethical, and looks after MY interests as part of their oath, not one that bows down to scriptures I don't believe in.", 
   {}, 
   178521, 
   null, 
   1131718980.0
  ], 
  [
   178659, 
   null, 
   "Howard Beale", 
   "Have you read the changes? I was a little surprised when I first read them. They are a non issue. Our science advisory board LAUGHED when they read them over the fact that they were causing such controversey. They are a non issue. There are going to be NO material changes regarding how evolution will be taught. \n \n In reality, the argument for the change was won not by the creationists, but by a bunch of palentologists from Kstate who pointed out that the definiton that the school board was currently using essentailly ruled out Punctuated Equilibria (evolutionary leaps), despite the fact that the theory is better supported by the fossil record than the traditional evolutionary theory (slow changes over a long period of time).\nAccording to most news reports, the board rewrote the definition of science, so that it is no longer limited to the search for natural explanations of phenomena.\n \n I have read the Findings of the Kansas State Department OF Education. In my cursory reading I found the following additions to the earlier versions.\n \n Science studies natural phenomena by formulating explanations that can be tested against the natural world. Some scientific concepts and theories (e.g., blood transfusion, human sexuality, nervous system role in consciousness, cosmological and biological evolution, etc.) may differ from the teachings of a student's religious community or their cultural beliefs. Compelling student belief is inconsistent with the goal of education.\n \n There is then a statement that is not made about any other established scientific theory. \"The view that living things in all the major kingdoms are modified descendants of a common ancestor (described in the pattern of a branching tree) has been challenged in recent years...\"\n \n If your \"board\" laughed, they should revisit the story of the Jews in Germany in the early 1930's, or France's Maginot line.", 
   {
    "unicode_changes_made": true
   }, 
   178256, 
   null, 
   1131732780.0
  ], 
  [
   178690, 
   null, 
   "daewoo", 
   "According to most news reports, the board rewrote the definition of science, so that it is no longer limited to the search for natural explanations of phenomena.\n \n I have read the Findings of the Kansas State Department OF Education. In my cursory reading I found the following additions to the earlier versions.\n \n Science studies natural phenomena by formulating explanations that can be tested against the natural world. Some scientific concepts and theories (e.g., blood transfusion, human sexuality, nervous system role in consciousness, cosmological and biological evolution, etc.) may differ from the teachings of a student's religious community or their cultural beliefs. Compelling student belief is inconsistent with the goal of education.\n \n There is then a statement that is not made about any other established scientific theory. \"The view that living things in all the major kingdoms are modified descendants of a common ancestor (described in the pattern of a branching tree) has been challenged in recent years...\"\n \n If your \"board\" laughed, they should revisit the story of the Jews in Germany in the early 1930's, or France's Maginot line.\n\n \n They laughed at that specifically ebcuase that wording was not chosen by the ID crowd, but by the dinosaur hunters. That is apparently a debate between some of the dino boys and the biologists. Apparently (and it was news to me), many dino hunters feel that the fossil record does not support the \"common anscestor\" thoery as well as it supports a multiple ancestor theory, more akin to a forest than a single branching tree.\n \n As it was explained to me, there are some who believe that instead of life evolving from a single life form, multiple life forms actually came into being, and not all of them evolved at the same rate or in the same direction. Hawking actually supports this theory based on the fact that life showed up on earth realtively early in the planets history. He theorizes that the beginnings of life are not as complex as many tend to believe, based on the fact that life showed up relatively early in teh history of the planet. Essentially, the planet became able to support life, and BOOM, there was life. Since the odds of a given event occuring generally increase as you increase the time span, it is reasonable to assume that if the generation of life was actually as complex as thought, it is unlikely that it would have occured so early. \n \n This is the same argument he makes for the possible existance of life on other planets. We know mathematically that there MUST be other planets capableof supporting life. HE argues that in absence of real evidence as to how life began, we must go with the most mathematically probable conclusion, and based on the short time span that it took for life to evolve on earth, and the resiliancy that life has shown, it is most probably that at least some of these other planets contain life.", 
   {
    "unicode_changes_made": true
   }, 
   178659, 
   null, 
   1131736860.0
  ], 
  [
   178692, 
   null, 
   "Howard Beale", 
   "Daewoo:\n \n There are disagreements and questions about a lot of scientific theories. Why is this clause about disagreements only in reference to evolution and no other theory? That is not the norm in scientific circles OR in teaching circles - especially when teaching grade schoolers.", 
   {
    "unicode_changes_made": true
   }, 
   178690, 
   null, 
   1131737220.0
  ], 
  [
   178709, 
   null, 
   "daewoo", 
   "Daewoo:\n \n There are disagreements and questions about a lot of scientific theories. Why is this clause about disagreements only in reference to evolution and no other theory? That is not the norm in scientific circles OR in teaching circles - especially when teaching grade schoolers.\n\n \n \n With most of the other stuff, teaching the controversey is part of the overall subject matter. With evolution, it was not, and the prior language of some of the curriculem essentially prohibited the teaching of other theories. \n \n The problem is that you have inflexible nutters on both sides. On the ID side, they will not be happy unless you teach the \"jesus made it happen\" approach. Many on the other side will not be happy unless you teach a strict, straight line evolutionary theory. \n \n We had a biology teacher in Salina who was teaching the theory of punctuated equlibrium and some hard liner didn't like it (biology side). There was a hissy fit.\n \n My personal view on this is to teach what we KNOW, make sure the kids know what we are POSTULATING, and leave the ego out of it.\n \n Relistically, I don't believe the ID folks are right, and I don't think that the hard line evolutionists are right. I think there are some pieces missing that they are glossing over. I think that as we come to understand genetics better, and make more fossile discoveries, and come up with a better understanding of the mechanism that creates life, we will find that both sides are wrong. While we certainly have enough evidence to form several theories, we do not have nearly enough to draw a concrete conslusion, or to fully support the theory.", 
   {
    "unicode_changes_made": true
   }, 
   178692, 
   null, 
   1131739260.0
  ], 
  [
   178716, 
   null, 
   "trebor", 
   "With most of the other stuff, teaching the controversey is part of the overall subject matter. With evolution, it was not, and the prior language of some of the curriculem essentially prohibited the teaching of other theories. \n \n The problem is that you have inflexible nutters on both sides. On the ID side, they will not be happy unless you teach the \"jesus made it happen\" approach. Many on the other side will not be happy unless you teach a strict, straight line evolutionary theory. \n \n We had a biology teacher in Salina who was teaching the theory of punctuated equlibrium and some hard liner didn't like it (biology side). There was a hissy fit.\n \n My personal view on this is to teach what we KNOW, make sure the kids know what we are POSTULATING, and leave the ego out of it.\n \n Relistically, I don't believe the ID folks are right, and I don't think that the hard line evolutionists are right. I think there are some pieces missing that they are glossing over. I think that as we come to understand genetics better, and make more fossile discoveries, and come up with a better understanding of the mechanism that creates life, we will find that both sides are wrong. While we certainly have enough evidence to form several theories, we do not have nearly enough to draw a concrete conslusion, or to fully support the theory.\n\n \n \n And, where is the science in I.D. at all ?? What does it do except to try to critisie evolution, or make the declaration 'We don't know, therefore it must be an intelligent designer'?? The fact of the matter is that there is not even a way to test even the SLIGHTEST thing about I.D. \n \n That is because it isn't science.", 
   {}, 
   178709, 
   null, 
   1131741360.0
  ], 
  [
   178718, 
   null, 
   "Howard Beale", 
   "Daewoo:\n \n I got to tell you, your last post was a bit strange. I can only assume from it that you are comfortable with teaching that evolution is not the only valid scientific theory concerning the origin of species. Would that be good science?", 
   {}, 
   178709, 
   null, 
   1131741600.0
  ], 
  [
   178752, 
   null, 
   "Poligeek", 
   "Is evolution the only VALID scientific theory about the origin of species? That depends on the meaning of the word valid. I have no problem exploring other scientific theories, but the key word there is SCIENTIFIC. We study evolution because right now it is the only theory with not just some, but AMPLE evidence supporing it. ID is not a scientific theory, it is a religious theory that people are trying to use science to justify.\n \n I'm open to exploring many different scientific theories about the origin of species and I think we should give serious examination of intelligent design theories...just not in science class.", 
   {}, 
   178718, 
   null, 
   1131751560.0
  ], 
  [
   178754, 
   null, 
   "daewoo", 
   "And, where is the science in I.D. at all ?? What does it do except to try to critisie evolution, or make the declaration 'We don't know, therefore it must be an intelligent designer'?? The fact of the matter is that there is not even a way to test even the SLIGHTEST thing about I.D. \n \n That is because it isn't science.\n\n \n There isn't any. As I said, I don't believe in Intelligent Design.\n \n Intelligent desing is not AT ALL mentioned in the new standards, and intelligent design cannot be taught in Kansas in any event because it is a terminable offence for a teacher in kansas to discuss religon or their religous beliefs in tha classroom outside of a purely academic discussion (we can still have comparative religon classes and such).", 
   {}, 
   178716, 
   null, 
   1131751740.0
  ], 
  [
   178756, 
   null, 
   "trebor", 
   "There isn't any. As I said, I don't believe in Intelligent Design.\n \n Intelligent desing is not AT ALL mentioned in the new standards, and intelligent design cannot be taught in Kansas in any event because it is a terminable offence for a teacher in kansas to discuss religon or their religous beliefs in tha classroom outside of a purely academic discussion (we can still have comparative religon classes and such).\n\n \n The fact of the matter is that the new standards have changed the definition of what science is. I.D. would fall under than standard. Of course, so would astrology.", 
   {}, 
   178754, 
   null, 
   1131751980.0
  ], 
  [
   178757, 
   null, 
   "Howard Beale", 
   "Is evolution the only VALID scientific theory about the origin of species? That depends on the meaning of the word valid. I have no problem exploring other scientific theories, but the key word there is SCIENTIFIC. We study evolution because right now it is the only theory with not just some, but AMPLE evidence supporing it. ID is not a scientific theory, it is a religious theory that people are trying to use science to justify.\n \n I'm open to exploring many different scientific theories about the origin of species and I think we should give serious examination of intelligent design theories...just not in science class.\nThe Theory of Evolution is the only concept on the origin of species that has been elevated from a hypothesis to a theory through testing and experimentation. Other hypotheses have not stood the test - and one must always add \"so far\". New research can always alter things.", 
   {
    "unicode_changes_made": true
   }, 
   178752, 
   null, 
   1131752100.0
  ], 
  [
   178760, 
   null, 
   "Howard Beale", 
   "The fact of the matter is that the new standards have changed the definition of what science is. I.D. would fall under than standard. Of course, so would astrology.\nNew standards have not, however, changed the definition of what a valid scientific theory is. And ID is not one.", 
   {}, 
   178756, 
   null, 
   1131752220.0
  ], 
  [
   178765, 
   null, 
   "daewoo", 
   "New standards have not, however, changed the definition of what a valid scientific theory is. And ID is not one.\n\n \n That is EXACTLY my point. Kansas is now using the same definition of \"science\" as 36 other states. That is another one that was NOT penned by the ID folks, it is widely used. The way that evolution has been taught in kansas has not materially changed, or if it has, it has changed for the better bceuase our teacghers are now allowed to teach things like the possibility of puncuated equilibrium or multiple origins of life (i.e life not all originating from 1 single strain). Both of these theories have as strong or stronger evidence than the \"little change over long time\" theory in many regards because we actually have concrete physical evidence for it. \n \n Also, under the old definition, \"psychology\" could not be considered science.\n \n I'm telling you guys, this is just a case of a bunch of chicken littles running around yelling \"the sky is falling...they are teaching creationism in schools!!!\". That simply is not correct. It is not even CLOSE to correct. Too many people forming opinions without consideration of the facts, and too much media looking for a sensational story where there is none.", 
   {}, 
   178760, 
   null, 
   1131753960.0
  ], 
  [
   178768, 
   null, 
   "Howard Beale", 
   "That is EXACTLY my point. Kansas is now using the same definition of \"science\" as 36 other states. That is another one that was NOT penned by the ID folks, it is widely used. The way that evolution has been taught in kansas has not materially changed, or if it has, it has changed for the better bceuase our teacghers are now allowed to teach things like the possibility of puncuated equilibrium or multiple origins of life (i.e life not all originating from 1 single strain). Both of these theories have as strong or stronger evidence than the \"little change over long time\" theory in many regards because we actually have concrete physical evidence for it. \n \n Also, under the old definition, \"psychology\" could not be considered science.\n \n I'm telling you guys, this is just a case of a bunch of chicken littles running around yelling \"the sky is falling...they are teaching creationism in schools!!!\". That simply is not correct. It is not even CLOSE to correct. Too many people forming opinions without consideration of the facts, and too much media looking for a sensational story where there is none.\nNobody said they were teaching creationism in schools &#8211; and, you totally avoided my question. Why is the &#8220;teach aspects of a theory that are under attack&#8221; clause limited to the Theory of Evolution? Why not germ theory &#8211; which also has issues with some scientists? Why not the Wave theory of sound? Why limit it to evolution?\n \n I add one other question: What is your source for the definition of &#8220;Science&#8221; used by the Kansas Board of Ed?\n \n And, by the way, the two things you are calling \"theories' are actually hypotheses. Should we teach every hypothesis that might challenge a valid theory should that hypothesis meet the criteria of a valid scientific theory &#8211; in grade school? No, you are obviously a proponent of ID who has no understanding of the scientific issues at stake.", 
   {}, 
   178765, 
   null, 
   1131754980.0
  ], 
  [
   178786, 
   null, 
   "OccamsRazor", 
   "Nobody said they were teaching creationism in schools - and, you totally avoided my question. Why is the \"teach aspects of a theory that are under attack\" clause limited to the Theory of Evolution? Why not germ theory - which also has issues with some scientists? Why not the Wave theory of sound? Why limit it to evolution?\n\n \n Well, its the subject matter isn't it? The religous conservatives want to be the ones calling the shots on the nature of our origins, scientific objectivity be damned.\n \n They care nothing for the actual controversies that exist in science (and are probalby quite ignorant of most of them!) but instead with evolution have created one where there was none.\n \n Self serving? entirely.\n \n Interested in objectivity, balance and appropriate representation? not one bit.", 
   {
    "unicode_changes_made": true
   }, 
   178768, 
   null, 
   1131758700.0
  ], 
  [
   178792, 
   null, 
   "Howard Beale", 
   "Well, its the subject matter isn't it? The religous conservatives want to be the ones calling the shots on the nature of our origins, scientific objectivity be damned.\n \n They care nothing for the actual controversies that exist in science (and are probalby quite ignorant of most of them!) but instead with evolution have created one where there was none.\n \n Self serving? entirely.\n \n Interested in objectivity, balance and appropriate representation? not one bit.\nBut they have lost their case. Pat Robertson has proven that the Intelligent Designer may not be as intelligent as they think...", 
   {}, 
   178786, 
   null, 
   1131759720.0
  ], 
  [
   178830, 
   null, 
   "marc9000", 
   "I want a doctor who will make them better. That's why I take them to a doctor instead of a rabbi, minister, priest or shaman. Why do you go to a doctor?\n\n \n \nThat doesn't even make sense. Why would someone become a doctor if he/she thought that life had no meaning? And what do christian values have to do with it?\n\n \n \n]Now, that is just plain stupid. Just because someone is not CHristian doesn't meant hey don't have values. \n \n For the most part, \"CHristian\" values suck.\n \n I want someone who is ethical, and looks after MY interests as part of their oath, not one that bows down to scriptures I don't believe in.\n\n \n Knowledge is a small part of who a person is, and what kind of a job he'll do. The job he does will also be determined by his motivations and goals. If he feels accountable only to man, he knows he can do things that can go undetected by man. If he feels acountable to God, he believes nothing he does goes undetected by God. \n \n Suppose your six year old is in the hospital needing serious, but not life threatening foot surgury. Down the hall is another six year old who needs a heart transplant, and has very rich parents. Word is discreetly getting around that the first doctor that comes up with a healthy 6 year old heart will never have to work again. Do you want a doctor who is only worried about accountability to man eyeing your childs chest? \"We're sorry, but your child DIED during surgury, and I have malpractice insurance.\"\n \n Now I know it's not really that way, doctors C A R E about their patients. Yeah right, just like the auto parts man cares about the fenders and doors on all his cars. \n \n The doctor who believes everything happens by chance, is going to be more ethical than a doctor who believes in the Christian belief of purpose?", 
   {}, 
   178523, 
   null, 
   1131769200.0
  ], 
  [
   178833, 
   null, 
   "Terran", 
   "That is just sickening. You disgust me", 
   {}, 
   178830, 
   null, 
   1131770700.0
  ], 
  [
   178836, 
   null, 
   "sinjin", 
   "I really pity you Marc. Your life has been in the hands of atheists and agnostics and non-Christians many times without your knowing and here you are. Show a little class.", 
   {}, 
   178833, 
   null, 
   1131772200.0
  ], 
  [
   178840, 
   null, 
   "daewoo", 
   "Nobody said they were teaching creationism in schools - and, you totally avoided my question. Why is the \"teach aspects of a theory that are under attack\" clause limited to the Theory of Evolution? Why not germ theory - which also has issues with some scientists? Why not the Wave theory of sound? Why limit it to evolution?\n\n \n I did not avoid it at all. As I said before, teaching different theories that meet the evidence at hand is inherent in the other subjects. In fact, in most cases, multiple theories are outlined in the subject matter. The previous guidlines involving the teaching of evolution essentially prohibited teaching any other theory or form of the theory. I even gave an example (teacher in Salina including punctuated equalibrium in his coursework).\n \n \nI add one other question: What is your source for the definition of \"Science\" used by the Kansas Board of Ed?\n\n \n I am on the local schoolboard. I have the official copy sitting on the corner of my desk. I got twice daily updates, including trascripts, of the entire mess. I have probably fielded 200 phone calls on this, and spent upwards of 50 hours in meetings with the state board of education, various science advisory boards, and representative groups from all sides of the issue. I have been up to my eyeballs in this mess since the very start. I will admit that I am a little hostile towards this entire argument because frankly it is just plain stupid. Even those opposing the changes, when asked, were unable to point out any part of the changes that were factually inaccurate or that gave the impression that there was any kind of intelligent design at play. \n \n We consulted with some of the best biologists on the planet on this, and not a single one of them was able to point to any factual errors. In fact, when asked \"As a percentage, how certain are you that the facts as they are outlined in the current curriculum are correct\". The higest number any of them gave was 70%. Most answered 50-60% (oddly enough, most of the high school teachers we asked said they were 99% certain that the current mainstream theory was correct).\n \n What this tells me is that:\n \n A. The theory we were mandating being taught has some holes in it\n B. There must be some evidence to the contrary, or at least evidence that cannot be explained using the current models\n c. The better versed you are in biology, the better chance you have of understanding the problems\n D. High school biology teachers are pretty poor judges of such things (which is important when you look around at the folks who are offering the most resistnace to this, you see a LOT of high school biology teachers)\n \n \nAnd, by the way, the two things you are calling \"theories' are actually hypotheses. Should we teach every hypothesis that might challenge a valid theory should that hypothesis meet the criteria of a valid scientific theory - in grade school? No, you are obviously a proponent of ID who has no understanding of the scientific issues at stake.\n\n \n \n No, neither of those is a hypothesis, both are valid theories supported by physical evidence. Both are exceptionally well documented.\n \n I am not an ID nutter, I am just a school board member who has exhaustively researched this issue, been up to my eyeballs in it from day one, and am tired of jackasses making mountains out of molehills. I fully understand the scientific issues at stake, they have been explained to me by some of the best scientific minds on the planet, and they are negligible. The changes are NOTHING. They absolutly DO NOT allow or promote the teaching of ID. That is NOT allowed, nor will it ever be, and any teacher who tries it WILL be fired, first offence no warning. Those are our guidlines as far as religon in the classroom.", 
   {
    "unicode_changes_made": true
   }, 
   178768, 
   null, 
   1131778080.0
  ], 
  [
   178842, 
   null, 
   "pandion", 
   "I even gave an example (teacher in Salina including punctuated equalibrium in his coursework).\nPlease explain what you think punctuated equilibrium is. Please explain what the teacher was presenting as punctuated equilibrium.\n \n I suspect that it was not actually the theory of punctuated equilibrium but some form of saltationism that he called punctuated equilibrium. I also suspect that you don't know what it is either.", 
   {}, 
   178840, 
   null, 
   1131780180.0
  ], 
  [
   178860, 
   null, 
   "Howard Beale", 
   "Daewoo:\n \n I asked you for the source the definition of science used by the Kansas School Board. You said you have it on your Desk. Please be so kind as to post what the Kansas School Board definition of science is and reference the Kansas School Board Document and page number for my edification.\n \n Thanks.", 
   {}, 
   178842, 
   null, 
   1131796980.0
  ], 
  [
   178862, 
   null, 
   "Howard Beale", 
   "In addition, I reread your post regarding the theories of punctuated equilibrium and multiple origins of life. Your post lead me to believe that you were claiming that these theories refuted the theory of evolution so I objected saying that they were just hypotheses. I was wrong. You were at minimum misleading. Both of those theories are simply variations of the basic theory of evolution. If you are a member of a school board, you should know that for future use. There are no valid scientific theories that refute the basics of evolutionary theory. If you read the Kansas School Board Conclusions, you would have seen the following: &#8220;The view that living things in all the major kingdoms are modified descendants of a common ancestor (described in the pattern of a branching tree) has been challenged in recent years&#8230;&#8221; There has been no valid scientific theory that has withstood peer review and challenged the evolutionary theory of common ancestry: not the theory of punctuated equilibrium or the theory of multiple origins of life. The only challenge has been from the proponents of ID. Why is that clause in there and only in there in reference to evolution?", 
   {}, 
   178752, 
   null, 
   1131798600.0
  ], 
  [
   178883, 
   null, 
   "pandion", 
   "There has been no valid scientific theory that has withstood peer review and challenged the evolutionary theory of common ancestry: not the theory of punctuated equilibrium or the theory of multiple origins of life.\nAnd that is the basis of my question of Daewoo above. He claims that a teacher was censured for teaching the theory of punctuated equilibria. I strongly suspect that Daewoo actually doesn't know what the theory of punk eek is, and I further suspect that the teacher was teaching some form of a discredited theory of saltationism. Such remarks are typical of Daewoo, where he claims knowledge and then demonstrates ignorance.", 
   {}, 
   178862, 
   null, 
   1131813300.0
  ], 
  [
   178917, 
   null, 
   "DamEtel", 
   "daewoo: I am on the local schoolboard.\n\n \n Too bad so many schoolboard officials are influenced by religion and anti-science. I hope all communities vote for schoolboard representatives the way Dover PA did. But the citiziens in more religious regions of the US - like just about anywhere in Kansas - are dumber, and not as likely to do so. It's a shame.", 
   {}, 
   178840, 
   null, 
   1131827820.0
  ], 
  [
   178940, 
   null, 
   "daewoo", 
   "Please explain what you think punctuated equilibrium is. Please explain what the teacher was presenting as punctuated equilibrium.\n \n I suspect that it was not actually the theory of punctuated equilibrium but some form of saltationism that he called punctuated equilibrium. I also suspect that you don't know what it is either.\n\n \n As it was explained to me (and remember I am not a biologist, nor do I have any particular interest in the subject), the theory essentially holds that, instead of the long, slow changes that darwinism proposes, Evolution instead happens as a series of \"jumps\". YOu have a long period of little or no evolutionary activity, followed by a virtual explosion of evolutionary change in a species (or multiple species), where new species crop up and old ones die out in a realtiviely short period of time (a few hundred thousand or a few million years). \n \n Saltationism holds that changes occur as a single step. That is just silly.", 
   {}, 
   178842, 
   null, 
   1131840600.0
  ], 
  [
   178945, 
   null, 
   "Howard Beale", 
   "Daewoo:\n \n I'd appreciate it if you would respond to my questions in post #44. You made statements claiming to have sources. I am rquesting the sources so I can read them for myself. \n \n I posted a second questio (post #45) which I also request that you address.", 
   {}, 
   178862, 
   null, 
   1131842100.0
  ], 
  [
   178946, 
   null, 
   "daewoo", 
   "In addition, I reread your post regarding the theories of punctuated equilibrium and multiple origins of life. Your post lead me to believe that you were claiming that these theories refuted the theory of evolution so I objected saying that they were just hypotheses. I was wrong. You were at minimum misleading. Both of those theories are simply variations of the basic theory of evolution. If you are a member of a school board, you should know that for future use. There are no valid scientific theories that refute the basics of evolutionary theory. If you read the Kansas School Board Conclusions, you would have seen the following: \"The view that living things in all the major kingdoms are modified descendants of a common ancestor (described in the pattern of a branching tree) has been challenged in recent years...\" There has been no valid scientific theory that has withstood peer review and challenged the evolutionary theory of common ancestry: not the theory of punctuated equilibrium or the theory of multiple origins of life. The only challenge has been from the proponents of ID. Why is that clause in there and only in there in reference to evolution?\n\n \n \n That is what YOU are missing. Our prvious standards were so stringent that the teaching of punctuated equilibrium or multiple origins were taboo. The previous standards were written by folks whose primary goal was to wipe out the possibililty of intelligent design. In doing so, they wiped out the possibilities inherint in many theories that are quite compatible with darwinism.\n \n The problem with wiping out the possibility of intelligent design is that in order to do so, you have to be able to say \"we know EXACTLY what happened, how it happened, when it happened, and where it happened\". We are far from being able to do that, but that is essentially the way we had things laid out in the past. We had, bar none, the most restrictive curriculum anywhere in the country when it comes to evolution. Now we have loosened it up a little. Our curriculum is STILL more restrictive than most states. We are now using the EXACT same definiton of \"science\" as MOST other states. \n \n What many here don't seem to grasp, is that I could care less what our kids think about evolution. It really does not matter to me. All I care about is how they test against other kids in other schools. That is where our ranking comes from, and that is what parents look at. The state school board cares about the same thing. Under the old guidelines, Kansas kids fell from 4th in the nation in biology to 12th, and in reviewing the subject matter it was clear that our curriculum was too strict, and our kids were not learning enough to test well.\n \n I could absolutly care less what any teacher, or individual parent, has to say about all this. What I care about is that our kids will graduate understanding concepts like puncuated equilibrium, multiple origins of life, etc... as opposed to learning the single theory previously taught which is that at one point proteins came together in a single place, life started, and every bit of life on this earth evolved from those proteins in a slow, predictable manner for the next several millenia. \n \n I do not know what the future holds for the state school board. Unfortunatly, they do not have the advantage of local school boards, which is the ability to call a big meeting and explain what is going on, so a lot of folks in kansas are in the same position as a lot of folks on this board....thowing their hands in the air yelling \"the sky is falling\" when in reality, the changes are minimal, probably for the better, and in NO WAY allow for the teaching of intelligent design or even the MENTION of intelligent design in our classrooms. \n \n It is funny, usually I class the ID nutters as the ignorant fools in debates like this. I am finding, now that I am in the middle of such a debate on a daily basis, that the real ignorant fools are the commentators. Most of the people I have seen comment on this, and not just here, have absolutly NO IDEA what the changes were, have absolutly NO IDEA how our standards compare to those of other states, and have absolutly NO IDEA that ID is still ataboo concept in our classrooms. I actually saw some idiot the other day arguing that kansas is now requiring teachers to teach Intelligent Design. I suppose a teacher could try it, but since at the end of their first day they would be fired, they had better figure out a way to come up with an incredibly fast, hard hitting lesson.\n \n BTW, my definiiton of science is coming directly from my copy of the standards that came from the state. It is entitled \"academic standards of excellence, 2006\" and is on pg 641 (there are 1100 pages). The version I have is distributed to school boards and school administrators. They have a different version available for the public for a modest fee ($4). I would suggest that those of you who are up in arms order it.", 
   {
    "unicode_changes_made": true
   }, 
   178862, 
   null, 
   1131842340.0
  ], 
  [
   178948, 
   null, 
   "daewoo", 
   "Daewoo:\n \n I'd appreciate it if you would respond to my questions in post #44. You made statements claiming to have sources. I am rquesting the sources so I can read them for myself. \n \n I posted a second questio (post #45) which I also request that you address.\n\n \n \n Done, though I did forget to include the current definition of \"science\":\n \n \nScience is a human activity of systematically seeking natural explanations for\n what we observe in the world around us. Throughout history people from many cultures have used the methods of science to contribute to scientific knowledge and technological innovations, making science a worldwide enterprise. Scientists test explanations against the natural world, logically integrating observations and tested hypotheses with accepted explanations to gradually build more reliable and accurate understandings of nature. Scientific explanations must be testable and repeatable, and findings must be confirmed through additional observation and experimentation. As it is practiced in the late 20th and early 21st century, science is restricted to explaining only the natural world, using only natural cause. This is because science currently has no tools to test explanations using non-natural (such as supernatural) causes.\n\n \n Many people point at the part I have highlighted above and say HA..there...see! That section was there before. It is not new and is a restriction against using the curriculum to intorduce anything supernatural into our science classrooms.\n \n The other section that people point ant and go THERE IT IS is this one:\n \n \n Hypothesis, law, and theory are frequently misunderstood terms used in science. A hypothesis is a testable statement about the natural world that can be used to design experiments and to build more complex inferences and explanations. A law is a descriptive generalization based on repeated observations. A theory is a well-substantiated explanation of the natural world that incorporates observations, inferences, laws, well-tested hypotheses and experimental findings to explain a specific aspect of the natural world. Theories drive research because they draw attention to areas where data or understandings are incomplete, suggesting additional directions for research.\n\n \n Again, no dice. That paragraph was there before and is entirely unchanged.", 
   {}, 
   178945, 
   null, 
   1131843840.0
  ], 
  [
   178949, 
   null, 
   "Howard Beale", 
   "Daewoo:\n \n I too have a copy of the current Kansas Curricular Standards for Science Education. The definition of science you claim is in that report is not in that report. There is a different definition. I refer you to page ix. That is one of the major issues scientists have with these KC Standards.\n \n The second paragraph you reference is also not in that report.\n \n Before going further, I will give you the opportunity to give me the page numbers I requested that verify that the two paragraphs that you say are in that publication are actually in it.", 
   {}, 
   178948, 
   null, 
   1131844860.0
  ], 
  [
   178951, 
   null, 
   "pandion", 
   "As it was explained to me (and remember I am not a biologist, nor do I have any particular interest in the subject), the theory essentially holds that, instead of the long, slow changes that darwinism proposes, Evolution instead happens as a series of \"jumps\". YOu have a long period of little or no evolutionary activity, followed by a virtual explosion of evolutionary change in a species (or multiple species), where new species crop up and old ones die out in a realtiviely short period of time (a few hundred thousand or a few million years).\nActually, just another form of saltationism. Try Punctuated Equilibria Now the question is, what was this mythical teacher you are talking about teaching, and was it really creationists, rather than scientists, who gave him grief?", 
   {}, 
   178940, 
   null, 
   1131844920.0
  ], 
  [
   178952, 
   null, 
   "daewoo", 
   "Daewoo:\n \n I too have a copy of the current Kansas Curricular Standards for Science Education. The definition of science you claim is in that report is not in that report. There is a different definition. I refer you to page ix. That is one of the major issues scientists have with these KC Standards.\n \n The second paragraph you reference is also not in that report.\n \n Before going further, I will give you the opportunity to give me the page numbers I requested that verify that the two paragraphs that you say are in that publication are actually in it.\n\n \n As I said before, it is on page 641. Exactly what are you looking at? My copy is part of the whole curriculum outline (not just science) and is titled \"academic standards of excellence, 2006\". It is draft 2 (there is no final yet). There is no page \"ix\" in my copy at all.", 
   {}, 
   178949, 
   null, 
   1131845400.0
  ], 
  [
   178957, 
   null, 
   "daewoo", 
   "Actually, just another form of saltationism. Try Punctuated Equilibria Now the question is, what was this mythical teacher you are talking about teaching, and was it really creationists, rather than scientists, who gave him grief?\n\n \n Neither, and I really don't care enough about the issue to slog through your link, sorry. The school administrator essentially charged him with teaching outside the curriculum. The Salina school district (foolishly) simply adopts whatever the state curriculum standards are. On peer review, it was found that he was teaching outside the curriculum, and his peers noted that the curriculum was prohibitively narrow. \n \n Was it a form of saltationism he was teaching? I don't know, nor do I care. he didn't think so, the peer panel that reviewed it did not think so, but if pandion thinks so, I guess there is controversy, depsite the fact that pandion was not there, and pandions only informaiton comes from my admittedly poor knowledge of the subject matter.\n \n This is what you are missing. I could care less about your passions, or the IUD folks passions. To me, this is a purely administrative issue. I bring in experts, ask them \"is this right or not and will it help our kids test better\". If they say \"yes\", I look at adopting the standrards for our district (every school district in kansas sets its own curriculum, VERY few adopt the state curriculum). If they say \"no\", I do not consider any further, I am opposed to it.\n \n At the end fo the day, the kansas state school board has no power to set the curriculum in our schools. We will probably waste millions of dollars the next time a school board is elected, though, to change it back tot he way it was, despite the fact that only 4 districts in the entire state were using it as it was. I really do not care about the ####### match between creationists and evolutionists. I do not care about the teachers. I don't even care about the damn kids. There are 2 things in this that make any difference to me at all:\n \n 1. Will it cost us any money\n 2. Will our kids test well\n \n Beyond that, I could care less. You guys are fighting over obscure biological points when high school seniors who CANNOT READ are graduating. Do you really think that it matters in the end what they learn as far as the origins of life? I have been to several international meetings related to my duties on the school board, and they are downright embarrassing. The Japanese, whose 8th graders make our college freshmen look like special ed cases, teach that the Japanese are the only \"true\" people, and the rest of mankind is just talking monkeys. How important do you really think this is?\n \n I am just trying to give you an administrative viewpoint to this mess. In reality, biology in high school is, in most cases, a class fo minimal importance. Ou rnumbers tell us that it will only be ultimately useful to students who go into certain fields, and only about 18% of our students will enter fields where a strong foundation in biology matters at all. Mathematics, on the other hand, will be used by 94% of our students in some capacity. Debate/Forensics/Public speaking is another one that will be used by upwards of 90% of our students, or that they will find useful at some point in their lives. \n \n This whole debate is a case of two fringe groups arguing over semantics. On the one side, you have the ID nutters. On the other side, you have a group composed primarily of high school biology teachers, who are as passionate as the ID nutters, not necessarily about providing the best education for the kids, but about keeping the ID nutters at bay, even if it costs down th eline.\n \n A big mess", 
   {}, 
   178951, 
   null, 
   1131847500.0
  ], 
  [
   178960, 
   null, 
   "prschuster", 
   "Howard Beale wrote:\n I have read the Findings of the Kansas State Department OF Education. In my cursory reading I found the following additions to the earlier versions:\n \n \"Science studies natural phenomena by formulating explanations that can be tested against the natural world. Some scientific concepts and theories (e.g., blood transfusion, human sexuality, nervous system role in consciousness, cosmological and biological evolution, etc.) may differ from the teachings of a student's religious community or their cultural beliefs. Compelling student belief is inconsistent with the goal of education.\"\n \n \n \n \n Walking-fish:\n It is way out of line to even mention the caveat about \"compelling student belief\" in relation to evolution. Do they mention such a note of caution about compelling student belief in regard to teaching how relativity theory dispensed with the \"Ether theory\" of space, or how the periodic table may contradict the alchemical theory of \"Four Elements\" for Wiccans etc... Modern biology & geology completely dismiss the YEC belief in a 6,000 year old Earth. There is no way you can teach the facts of science without completely debunking some (but not all) religious & philosophical beliefs. That caveat is there only to cast doubt on the validity of well substantiated facts in biology, in general, and evolution in particular.", 
   {
    "post_info": {
     "post_title": "Compelling Student Beliefs?"
    }, 
    "unicode_changes_made": true
   }, 
   178752, 
   null, 
   1131849720.0
  ], 
  [
   178961, 
   null, 
   "Howard Beale", 
   "As I said before, it is on page 641. Exactly what are you looking at? My copy is part of the whole curriculum outline (not just science) and is titled \"academic standards of excellence, 2006\". It is draft 2 (there is no final yet). There is no page \"ix\" in my copy at all.\nReally? Well I suggest that you get the current Kansas Curricular Standards for Science Education, look at page ix and then post back here. You do not have a copy of the current standards passed this year, so you? The ones you have were not published in 2005, were they? If you have any at all.", 
   {}, 
   178952, 
   null, 
   1131849900.0
  ], 
  [
   178963, 
   null, 
   "daewoo", 
   "Really? Well I suggest that you get the current Kansas Curricular Standards for Science Education, look at page ix and then post back here. You do not have a copy of the current standards passed this year, so you? The ones you have were not published in 2005, were they? If you have any at all.\n\n \n \n The ones I have were published oct 27, 2005. Where did you get yours? We are obviosly not looking at the same book. I did not even know that they published a version that was ONLY for science. \n \n Exactly what definition of \"science\" does your copy have? Is it hard copy, or electronic? Finally, what is the revision number on it? If it is newer, and different, from mine, I would like to dig up a copy of it for review.", 
   {}, 
   178957, 
   null, 
   1131850800.0
  ], 
  [
   178964, 
   null, 
   "daewoo", 
   "[QUOTE=prschuster]Howard Beale wrote:\n I have read the Findings of the Kansas State Department OF Education. In my cursory reading I found the following additions to the earlier versions:\n \n \"Science studies natural phenomena by formulating explanations that can be tested against the natural world. Some scientific concepts and theories (e.g., blood transfusion, human sexuality, nervous system role in consciousness, cosmological and biological evolution, etc.) may differ from the teachings of a student's religious community or their cultural beliefs. Compelling student belief is inconsistent with the goal of education.\"\n \n \n That is from an earlier draft. The thing still has not been finalized. As far as I know, the definition I gave was the latest one that actually made it through comitee, though there may be another one out there that I am unaware of. What the school board has approved thus far are NOT changes that will go out to the schools/teachers. Those changes are still in the works. What has been changed thus far is essentially the basic outline, the underlying materials are still in the works.", 
   {
    "unicode_changes_made": true
   }, 
   178960, 
   null, 
   1131851160.0
  ], 
  [
   178966, 
   null, 
   "Howard Beale", 
   "The ones I have were published oct 27, 2005. Where did you get yours? We are obviosly not looking at the same book. I did not even know that they published a version that was ONLY for science. \n \n Exactly what definition of \"science\" does your copy have? Is it hard copy, or electronic? Finally, what is the revision number on it? If it is newer, and different, from mine, I would like to dig up a copy of it for review.\n\n The controversial Kansas Science Education Standards were approved by the Kansas State Board of Education on November 8, 2005. The copy I have is from attorneys studying the legal ramifications. I suggest that you get a copy before posting further. On page ix, in the section titled \"Nature of Science\", it defines science as follows: \"Science is a systematic method of continuing investigation that uses observation, hypothesis testing, measurement, experimentation, logical argument and theory building to lead to more adequate explanations of natural phenomena.\" Compare that with the accepted definition of science which you posted and erroneously stated was the definition used by the Kansas State board of Education. It reads: \"Science is a human activity of systematically seeking natural explanations for what we observe in the world around us.\"\n \n As has been accurately reported, the School Board rewrote the definition of science so that it is no longer limited to the search for natural explanations of phenomena.\n \n If you don't see that as a major problem, and if you really do sit on a school board, you should resign your position.", 
   {
    "unicode_changes_made": true
   }, 
   178963, 
   null, 
   1131853260.0
  ], 
  [
   178970, 
   null, 
   "daewoo", 
   "The controversial Kansas Science Education Standards were approved by the Kansas State Board of Education on November 8, 2005. The copy I have is from attorneys studying the legal ramifications. I suggest that you get a copy before posting further. On page ix, in the section titled \"Nature of Science\", it defines science as follows: \"Science is a systematic method of continuing investigation that uses observation, hypothesis testing, measurement, experimentation, logical argument and theory building to lead to more adequate explanations of natural phenomena.\" Compare that with the accepted definition of science which you posted and erroneously stated was the definition used by the Kansas State board of Education. It reads: \"Science is a human activity of systematically seeking natural explanations for what we observe in the world around us.\"\n \n As has been accurately reported, the School Board rewrote the definition of science so that it is no longer limited to the search for natural explanations of phenomena.\n \n If you don't see that as a major problem, and if you really do sit on a school board, you should resign your position.\n\n \n \n Your version is, indeed, newer than mine. I will probably get the update in mondays mail.\n \n Lets look at how some other states define \"science\" before we decide how important the \"natural\" is:\n \n \nArizona: \"Science is a process of gathering and evaluating information, looking\n for patterns, and then devising and testing possible explanations.\"\n\n \n \nArkansas: \"Science is a way of knowing that is characterized by empirical criteria, logical argument, and skeptical review.\"\n\n \n \nConnecticut: \"Scientific inquiry is a thoughtful and coordinated attempt to search out, describe, explain and predict natural phenomena.\"\n\n \nIdaho: \"Science is a human endeavor that seeks to understand the universe by observation, experimentation, and rational interpretation of observations.\"\n\n \nLouisiana: \"Science is a way of thinking and a system of knowledge that uses reason, observation, experimentation, and imagination.\"\n\n \nMontana: \"Science is an inquiry process used to investigate natural phenomena, resulting in the formation of theories verified by direct observations.\"\n\n \nNevada: \"Scientific inquiry is the process by which humans systematically examine the natural world.\"\n\n \nNew Hampshire: \"Science is, above all, a problem-solving activity that seeks answers to questions by collecting and analyzing data in an attempt to offer a rational explanation of naturally-occurring events.\"\n\n \nOhio: \"Science is a systematic method of continuing investigation, based on\n observation, hypothesis testing, measurement, experimentation, and theory\n building, which leads to more adequate explanations of natural phenomena.\"\n\n \nSouth Dakota: \"Science is a process of gathering and evaluating information,\n looking for patterns, and then devising and testing possible explanations.\"\n\n \n In fact, the only state that has a definition that contains wording even similar to the wording of the prior definiton that kansas used was Mass:\n \n \n\"Science may be described as attempts to give good accounts of the patterns in nature. The result of scientific investigation is an understanding of natural processes. Scientific explanations are always subject to change in the face of new evidence. Ideas with the most durable explanatory power become established theories or are codified as laws of nature. Overall, the key criterion of science is that it provides a clear, rational, and succinct account of a pattern in nature. This account must be based on data gathering and analysis and other evidence obtained through direct observations or experiments, reflect inferences that are broadly shared and communicated, and be accompanied by a model that offers a naturalistic explanation expressed in conceptual, mathematical, and/or mechanistic terms.\"\n\n \n Nine states offer no explanation or definition of science. Which state do you live in? Odds are, you REALLY need to start working on your own state school board before you start worrying about ours here in Kansas. Our schools are rated in the top 10 in the coutnry in all categories. They will continue to do so. \n \n I am sorry about citing an old work, and thank you fro the correction. I admit I was a little confused, because the definition in my copy was MUCH longer than definition I had for other states, yet just last week I was assured that the definition we were using was compatible or nearly identical to definitions used in 37 other states, and VERY similar to definitions used in 3 more. That put on par with 40 states. Good enough for me. It was not until just now that I happened to look at the handout from that meeting that I noticed that of the 10 states that we did not closely mirror in our definition, 9 of them HAVE no definition to offer.\n \n I stand by my position. I have yet to see anybody offer any substantial reason or evidence that the changes are factually inaccurate or improper in any way. \n \n Reall,y Howard, what state are you in? What about you, Pandion? Lets see how your states stack up.", 
   {
    "unicode_changes_made": true
   }, 
   178966, 
   null, 
   1131855300.0
  ], 
  [
   178972, 
   null, 
   "daewoo", 
   "I see pandion is in texas.\n \n \n\"Science is a way of learning about the natural world. Students should know how science has built a vast body of changing and increasing knowledge described by physical, mathematical, and conceptual models, and also should know that science may not answer all questions.\"\n\n \n And you take exception to OUR definition of science?????", 
   {}, 
   178970, 
   null, 
   1131855420.0
  ], 
  [
   178974, 
   null, 
   "Howard Beale", 
   "Your version is, indeed, newer than mine. I will probably get the update in mondays mail.\n \n Lets look at how some other states define \"science\" before we decide how important the \"natural\" is:\n \n In fact, the only state that has a definition that contains wording even similar to the wording of the prior definiton that kansas used was Mass:\n \n Nine states offer no explanation or definition of science. Which state do you live in? Odds are, you REALLY need to start working on your own state school board before you start worrying about ours here in Kansas. Our schools are rated in the top 10 in the coutnry in all categories. They will continue to do so. \n \n I am sorry about citing an old work, and thank you fro the correction. I admit I was a little confused, because the definition in my copy was MUCH longer than definition I had for other states, yet just last week I was assured that the definition we were using was compatible or nearly identical to definitions used in 37 other states, and VERY similar to definitions used in 3 more. That put on par with 40 states. Good enough for me. It was not until just now that I happened to look at the handout from that meeting that I noticed that of the 10 states that we did not closely mirror in our definition, 9 of them HAVE no definition to offer.\n \n I stand by my position. I have yet to see anybody offer any substantial reason or evidence that the changes are factually inaccurate or improper in any way. \n \n Reall,y Howard, what state are you in? What about you, Pandion? Lets see how your states stack up.\nFirst, if you think I am going to accept your word as to what other states standards are, you are mistaken. Second, I have read the entire Kansas standards. There are many other subtle clauses that infer inaccurate science. I am also familiar with the National Academy of Science standards. And finally, as I said, if you really are on a school board and you don't see the issue, you should resign your position - especially given your diligence in keeping abreast of the facts of an issue.", 
   {
    "unicode_changes_made": true
   }, 
   178970, 
   null, 
   1131855720.0
  ], 
  [
   178983, 
   null, 
   "marc9000", 
   "Those state's definitions of science can be scary when compared to standards of less than 100 years ago. In 1925, the ACLU advertised for a teacher who would be willing to challange the state of Tennessee's Butler Act, which prohibited teaching the theory of evolution in state public schools and UNIVERSITIES.\n \n Times do change.", 
   {}, 
   178970, 
   null, 
   1131857400.0
  ], 
  [
   178988, 
   null, 
   "daewoo", 
   "First, if you think I am going to accept your word as to what other states standards are, you are mistaken. Second, I have read the entire Kansas standards. There are many other subtle clauses that infer inaccurate science. I am also familiar with the National Academy of Science standards. And finally, as I said, if you really are on a school board and you don't see the issue, you should resign your position - especially given your diligence in keeping abreast of the facts of an issue.\n\n \n I have just been informed that the handout we got is available online at http://www.ksde.org/outcomes/scepttestimonywells1.pdf\n \n It includes links to every states definition of science (I wish I had known this before, it would have saved me a lot of trouble). Again, What state are you in? Lets see what your states definition of \"science\" is. \n \n You REALLY need to take a look at some of the other states standards and you will understand why we are in the top 10 nationwide for our schools. \n \n Resign? Why? So I can be replaced by some reactionary idiot? People elected me because they were tired of reactionary XXXXXX. I admit I have not stayed as up to date as I should have for the last few months. Why? Because in Kansas, local school board decide curriculum, not the state board of education. Our curriculum will not be changing at all. As far as I know, there are only a handful (less than 20) school districts in the entire state that adopt the state boards curriculum verbatim. I would be surprised if the changes make ANY difference at all. The biggest component of the controversy seems to be out of state XXXXXX with no idea what they are talking about, and no idea how things work here, making ridiculous accusations as far as the states board of education curriculum goes.\n \n You said that you were studying the legal ramifications of the changes. What could those ramifications possibly be, since the odds of them actually making any material difference in the classroom at all are almost zero, and no material changes to how evolution is taught were made?\n \n Again, I stand by my original position. The changes are non issues. The curriculum is less limiting, but still does not allow for the teaching of ID. \n \n Again, exactly which portions of the changes do you find offensive or feel are outside of the norm? Which are factually inaccurate? I ahve made this challenge here at elast a half dozen times in different threads, and have yet to have anybody really respond. The closest anybody has come are the same lame objections you have made to the changing of the definition of science.", 
   {
    "unicode_changes_made": true
   }, 
   178974, 
   null, 
   1131858420.0
  ], 
  [
   178989, 
   null, 
   "daewoo", 
   "Those state's definitions of science can be scary when compared to standards of less than 100 years ago. In 1925, the ACLU advertised for a teacher who would be willing to challange the state of Tennessee's Butler Act, which prohibited teaching the theory of evolution in state public schools and UNIVERSITIES.\n \n Times do change.\n\n \n Why scary? The world has moved on. I simply don't understand why we are taking all this XXXX in kansas when what we have effectively done is joined the rest of the country in our definition of \"science\", and we operate some of the best schools in the country. If they want to pick at someboyd, maybe they should try alabama, texas, or california, which all graduate retarded monkeys compared to kansas.", 
   {}, 
   178983, 
   null, 
   1131858660.0
  ], 
  [
   178992, 
   null, 
   "marc9000", 
   "Why scary? The world has moved on. I simply don't understand why we are taking all this XXXX in kansas when what we have effectively done is joined the rest of the country in our definition of \"science\", and we operate some of the best schools in the country. If they want to pick at someboyd, maybe they should try alabama, texas, or california, which all graduate retarded monkeys compared to kansas.\n\n \n Well the world needed to move on from that one I'll admit. But it's moved on too far IMO. Somewhere in the middle of then and now would be nice.", 
   {}, 
   178989, 
   null, 
   1131859500.0
  ], 
  [
   178995, 
   null, 
   "Howard Beale", 
   "Resign? Why?\nBecause you can't even acknowledge the difference between two different definitions of science, that is why. Your claim that it is no big deal is disingenuous at best. \n \n Please explain to me what the purpose is in redefining science so that it is no longer limited to the search for natural explanations of phenomena? Don't you think that you have a responsibility to answer that question?", 
   {
    "unicode_changes_made": true
   }, 
   178966, 
   null, 
   1131860640.0
  ], 
  [
   178996, 
   null, 
   "daewoo", 
   "Well the world needed to move on from that one I'll admit. But it's moved on too far IMO. Somewhere in the middle of then and now would be nice.\n\n \n Why? We are talking about teaching FACTS. You cannot teach ID without asking people to make huge leaps of faith. Faith belongs in church, not in school. In school, we pass on facts.", 
   {}, 
   178992, 
   null, 
   1131860880.0
  ], 
  [
   178999, 
   null, 
   "daewoo", 
   "Because you can't even acknowledge the difference between two different definitions of science, that is why. Your claim that it is no big deal is disingenuous at best. \n\n \n That is because in reality, there is none. Could supernatural explanations be included under the current definition? Of course, as long as they include \"observation, hypothesis testing, measurement, experimentation, logical argument and theory building to lead to more adequate explanations of natural phenomena\".\n \n I don't think that we are any real danger there. Then again, that is what science does, it turns the supernatural to the mundane. At one time, people were mystified by the miracle of spontaneous generation. People have marveled at the obviously supernatural force of photosynthesis. \n \n \nPlease explain to me what the purpose is in redefining science so that it is no longer limited to the search for natural explanations of phenomena? Don't you think that you have a responsibility to answer that question?\n\n \n Purely political. Again, who cares? We are now marching in lockstep with 40 other states. We still have some of the best schools in the country, and our kids will ocntinue to excell in science, including biology. If anything, our new standards, while still the strictest in the nation, open the door for more aspects of evolutionary theory to be taught. \n \n That is something else that people here seem to fail to grasp. SOmetimes, you make political decisions. If you can get a noisy group by the fundies off your back wihtout doing any damage anywhere else, you do it. The state school board threw them a bone. Now they will go back to their corner. I don't know if you have caught this or not, but as Americans become more fearful about the world we live in (terrorism, economy, etc...) religous lunacy is sweeping the country.\n \n In truth, the State board of education did what good politicians should do. They had a group of constituents who wanted a change. They analyzed the change and recognized that the change would not cost anything. It would not hurt any other group. It would not damage the education of the states children (which is theoretically the responsibility of that group of politicians), and it does nto infringe on anybodies rights. So, they made the change. \n \n There were absolutly no negatives, no down side, to the changes. The up side, however, is that while no ID is still a taboo topic, the funides are back in their corner, and the curriculum involving evolution actually has more depth than it previously did. \n \n Unfortunatly, the whole thing has become a circus. The media, looking for a juicy story, has proclaimed such idiotic things as \"Kansas has cleared the way for the teaching of intelligent design\". People are wandering around mortified at the fact that they removed the word \"natural\" from the definition of science, when what they have done puts in the same category as the definition of \"science\" in 40 other states.", 
   {
    "unicode_changes_made": true
   }, 
   178995, 
   null, 
   1131863460.0
  ], 
  [
   179000, 
   null, 
   "pandion", 
   "I see pandion is in texas.\n \n And you take exception to OUR definition of science?????\nNo, I didn't. I took exception to your definition and to your knowledge of science. But as you have admitted, you really don't care about science, what it is or how it works. You are more interested in acting as a dupe for creationists.", 
   {}, 
   178972, 
   null, 
   1131864780.0
  ], 
  [
   179001, 
   null, 
   "Howard Beale", 
   "Daewoo:\n \n Your academic principles and your educational values are very disappointing. Your defense of your state board of education - right or wrong - is troubling to witness. As a member of a school board, I would think that your position would be that you would want a definition of science (or any academic discipline) that you are going to teach your students to be of the highest standard. This settling for the mediocre (in my opinion inferior) does not set a good example for any one last of all the students whose interest should be the primary concern.\n \n A state board of education settling on something for political reasons and not because it is in the best interests of the students is a most egregious act of duplicity. Sanctioning that act is aiding and abetting that act. It is extremely distressing. In my opinion, it is grounds enough to vote a school board member out of office if they do not have the moral fiber to resign.\n \n It appears that in Kansas neither the state board of ed nor the local school boards are willing to stand up for the best interests of the students. That is why there is this \"circus\" you lament. Someone has to stand up for the best interests of the students and the sounder the definition of science is and the school curriculum is, the better for the students.\n \n It is a shame that you cannot see that the Kansas Board of Education took a step backwards on November 8, 2005. It is pathetically obvious.", 
   {
    "unicode_changes_made": true
   }, 
   179000, 
   null, 
   1131865080.0
  ], 
  [
   179005, 
   null, 
   "daewoo", 
   "Daewoo:\n \n Your academic principles and your educational values are very disappointing. Your defense of your state board of education - right or wrong - is troubling to witness. As a member of a school board, I would think that your position would be that you would want a definition of science (or any academic discipline) that you are going to teach your students to be of the highest standard. This settling for the mediocre (in my opinion inferior) does not set a good example for any one last of all the students whose interest should be the primary concern.\n\n \n How is it inferior? AS I said above:\n \n \nCould supernatural explanations be included under the current definition? Of course, as long as they include \"observation, hypothesis testing, measurement, experimentation, logical argument and theory building to lead to more adequate explanations of natural phenomena\".\n\n \n If supernatural explanations can meet that criteria, then so be it. Maybe the day will come that we discover that our planet was seeded by aliens, or that we are all descended from bacteria left behind when an alien stoppoed off to take a dump. Who knows? Until we have all th answers, ruling things out completely is foolish. Maybe, though some bizarre twist in spacetime, we are all descended from other humans or animals that dropped through a wormhole from an alternate earth. Who knows? Maybe the ID folks are right. Maybe the entire universe is nothing bu an experiment in a petri dish in the lab of some enormous creature (probably more likely than the \"invisible man in the sky\" theory that most ID types hold). Who knows? \n \n As I said before, science turns the supernatural into the mundane. That is more or less its job. The monk who discredited spontaneous generation was trying to prove creationism. He did not suceed, but his line of study led to several breakthroughs in biology. \n \n The new definition is only \"inferior\" if you are not a creationist, and not an evolutionist, but that twisted third option....and anti creationist. Anti creationists tend to be more interested in stamping out the theory of creation or intelligent design than they are in passing on valid scientific fact. The SOLE purpose of the \"natural\" that was to take a jab ot the creationist/ID crowd and tick them off. Including it in no way strengthens the definition. It ever should have been in there. I was talking about the politics of the thing before. In that case, you ahd one crowd pushing for the inclusion of something that ticked off the rest of the folks, and for no good reason. There was no reason to include it. It was a bad decision. Theose who made it are no longer on the school board. \n \n \n \nA state board of education settling on something for political reasons and not because it is in the best interests of the students is a most egregious act of duplicity. Sanctioning that act is aiding and abetting that act. It is extremely distressing. In my opinion, it is grounds enough to vote a school board member out of office if they do not have the moral fiber to resign.\n\n \n Welcome to the real world. Our board of education is elected. When you take an elected post, you play politics,m or you do not stay in that post for very long. Our current board has gotten increased funding for our schools, instituted more stringent guidelines regarding literacy and literacy testing, and has done a GREAT job of getting state assistance for poor school districts to help get their programs up to speed with the rest fo the state. The primary accomplishment of the last bunch was to tick off a bunch of religous fundies. They did nothing positive their entire time in office becuase they spent all their time fighting off attacks due to their stupidity in handling the matter. \n \n \nIt appears that in Kansas neither the state board of ed nor the local school boards are willing to stand up for the best interests of the students. That is why there is this \"circus\" you lament. Someone has to stand up for the best interests of the students and the sounder the definition of science is and the school curriculum is, the better for the students.\n \n It is a shame that you cannot see that the Kansas Board of Education took a step backwards on November 8, 2005. It is pathetically obvious.\n\n \n You still have not managed to expalin to me HOW. HOW does the removal of the word \"natural\" have any material effect on the definition, especially since the requirements laid out in the rest of the definition absolutly deny any supernatural rediculousness? ONE other state contained anything approaching similar language, and theirs comes after a small novel explaining science. \n \n Anything that will meet the requirements of the rest of the defintion MUST be natural, even if it is somthing that is currently considered supernatural. There is NO possibility that all of the other requirements could be met, and you come to a supernatural conclusion, becuase the other requirements specifically bars the supernatural.\n \n What supernatural phenomenon can you measure?\n \n What supernatural phenomenon can you accurately test a hypothesis on?\n \n What supernatural hypothesis allows you to build a solid theory?\n \n What supernatural phenomenon allows you to take th above and build a logical argument around it?\n \n NONE,.\n \n All that has been odne is redundancy is removed. \n \n You have yet to show how this is really a step backward or show any way that this is going to hurt our children, or their educations. Go ahead, make your case, make me a believer. Take me down that slippery slope that starts with removing the word \"natural\" from our definition of science and ends in a replay of the dark ages. \n \n It seems like folks actually have an emotional investment in this rediculous argument. Personally, I learned a long time ago that the best decisions are made when you put emotion on a shelf ad judge based purely on logic and the facts at hand. While it can be fun to light the fuse on sombody who is emotionally involved in their cause (and frnakly, getting the anti creationists worked up can be an interesting time), anybody who actually runs around making decisions based on those emotions is a fool.\n \n All I ask is that you show me a logic based argument as to why this change is negative in respect to our kids education. I am simply not seeing it.", 
   {
    "unicode_changes_made": true
   }, 
   179001, 
   null, 
   1131867720.0
  ], 
  [
   179013, 
   null, 
   "Howard Beale", 
   "How is it inferior?\nHow is it inferior?\n \n In your opinion both definitions are the same because you think that you can prophesy how they will be implemented in the future. You think that you can foresee all the unintended consequences. Well, the fact is: you can&#8217;t. That is why we should do what is right, not what is politically expedient. One definition allows for the possibility of theories other than those based on nature and the other specifically says scientific theories are based in nature. The fact that you cannot see that is stunning.\n \n \nWelcome to the real world. Our board of education is elected. When you take an elected post, you play politics,m or you do not stay in that post for very long. Our current board has gotten increased funding for our schools, instituted more stringent guidelines regarding literacy and literacy testing, and has done a GREAT job of getting state assistance for poor school districts to help get their programs up to speed with the rest fo the state. The primary accomplishment of the last bunch was to tick off a bunch of religous fundies. They did nothing positive their entire time in office becuase they spent all their time fighting off attacks due to their stupidity in handling the matter. Welcome to the real world. Our board of education is elected. When you take an elected post, you play politics,m or you do not stay in that post for very long. Our current board has gotten increased funding for our schools, instituted more stringent guidelines regarding literacy and literacy testing, and has done a GREAT job of getting state assistance for poor school districts to help get their programs up to speed with the rest fo the state. The primary accomplishment of the last bunch was to tick off a bunch of religous fundies. They did nothing positive their entire time in office becuase they spent all their time fighting off attacks due to their stupidity in handling the matter.\nIn the first place, the condescension is not necessary or appropriate.\n \n Just because an erroneous decision is arrived at for political reasons does not mean that everyone should just accept it. People need to speak up. Declaring a slave to be sixth tenths of a human being in our Constitution was also a political compromise, using your way of thinking, it was no big deal and nobody should have made a ruckus about it.\n \n The rest of your post is just a pathetic defense of mediocrity -- especially since you have not even read the standards in question that were passed on November 8. You&#8217;d think that you would have the self-respect to wait until you had read the standards in question before voicing an opinion, especially since the definition does not limit the criteria for establishing acceptable subject matter to be taught in a science class the way you claim it does (without having read it).\n \n Once you remove the phrase &#8220;seeking natural explanations&#8221;, then observation is not limited to observation of natural phenomena, logical argument does not have to postulate natural phenomena, hypotheses do not have to be based on natural phenomena, and theories do not have to be built on natural phenomena. Don&#8217;t you get it?", 
   {}, 
   179005, 
   null, 
   1131870540.0
  ], 
  [
   179045, 
   null, 
   "daewoo", 
   "How is it inferior?\n \n In your opinion both definitions are the same because you think that you can prophesy how they will be implemented in the future. You think that you can foresee all the unintended consequences. Well, the fact is: you can't. That is why we should do what is right, not what is politically expedient. One definition allows for the possibility of theories other than those based on nature and the other specifically says scientific theories are based in nature. The fact that you cannot see that is stunning.\n\n \n This is essentially an unfounded, unsupported, slippery slope argument. This is essentially the same definition being used by FORTY states. If you look at the time frames on the links to the definitions used by individual states, and many cases, the defintion has remained unchanged for FORTY or more years. In all that time, in all those cases, surely you can produce a few cases where lack of the word \"natural\" in relation to the explanaiton caused some grievous harm. \n \n You cannot even produce for my a HYPOTHETICAL situation where the difference in wording will cause problems. \n \n \nJust because an erroneous decision is arrived at for political reasons does not mean that everyone should just accept it. People need to speak up. Declaring a slave to be sixth tenths of a human being in our Constitution was also a political compromise, using your way of thinking, it was no big deal and nobody should have made a ruckus about it.\n\n \n WRONG. Apparently you missed the part where I said it was the right thing to do because:\n \n A. People wanted it\n B. Nobodies rights were infringed by granting it\n C. No reasonable justification could be given for withholding the changed\n D. the changes do not in any way harm or hamper the education of the kids, which is the primary responsibility of that board.\n \n Declarin a slave to be 6/10 of a person does not meet the above criteria.\n \n \nThe rest of your post is just a pathetic defense of mediocrity -- especially since you have not even read the standards in question that were passed on November 8. You'd think that you would have the self-respect to wait until you had read the standards in question before voicing an opinion, especially since the definition does not limit the criteria for establishing acceptable subject matter to be taught in a science class the way you claim it does (without having read it).\n\n \n I have now read it. It came in Thursdays amil and I just hadn't bpothered to open it yet. Lets look at the WHOLE paragraph you cite from, not just the first sentence:\n \n \nScience is a systematic method of continuing investigation that uses observations, hypothesis testing, measurement, experimentation, logical argument and theory building to lead to more adequate explanations of natural phenomena. Science does so while maintaining strict empirical standards and healthy skepticism. Scientific explanations are built on observations, hypotheses, and theories. A hypothesis is a testable statement about the natural world that can be used to build more complex inferences and explanations. A theory is a well-substantiated explanation of some aspect of the natural world that can incorporate observations, inferences, and tested hypotheses.\n\n \n \nOnce you remove the phrase \"seeking natural explanations\", then observation is not limited to observation of natural phenomena, logical argument does not have to postulate natural phenomena, hypotheses do not have to be based on natural phenomena, and theories do not have to be built on natural phenomena. Don't you get it?\n\n \n I do get it. this is a bunch of idealogical garbage. Unless you can come up with an example of a time when standards from those other 39 states have led to a problem, or even a realistic hypothetical situtation where the omission could lead to an actual problem, I think I am done here. You are simply making yourself look like a fanatic and a fool. The criteria set forth in the definiiton of science clearly excludes any type fo supernatural mumbo jumbo. If they conditions set forth do NOT exclude supernatural mumbo jumbo, then it cannot be supernatural mumbo jumbo, it MUST be natural, and just not well understood.\n \n Lets look at the ENTIRE section under \"Nature of Science\" (gotta love OCR) instead of just the first sentence.\n \n \nScience is a systematic method of continuing investigation that uses observations, hypothesis testing, measurement, experimentation, logical argument and theory building to lead to more adequate explanations of natural phenomena. Science does so while maintaining strict empirical standards and healthy skepticism. Scientific explanations are built on observations, hypotheses, and theories. A hypothesis is a testable statement about the natural world that can be used to build more complex inferences and explanations. A theory is a well-substantiated explanation of some aspect of the natural world that can incorporate observations, inferences, and tested hypotheses. \n \n Scientific explanations must meet certain criteria. Scientific explanations are consistent with experimental and/or observational data and testable by scientists through additional experimentation and/or observation. Scientific explanation must meet criteria that govern the repeatability of observations and experiments. The effect of these criteria is to insure that scientific explanations about the world are open to criticism and that they will be modified or abandoned in favor of new explanations if empirical evidence so warrants. Because all scientific explanations depend on observational and experimental confirmation, all scientific knowledge is, in principle, subject to change as new evidence becomes available. The core theories of science have been subjected to a wide variety of confirmations and have a high degree of reliability within the limits to which they have been tested. In areas where data or understanding is incomplete, new data may lead to changes in current theories or resolve current conflicts. In situations where information is still fragmentary, it is normal for scientific ideas to be incomplete, but this is also where the opportunity for making advances may be greatest. Science has flourished in different regions during different time periods, and in history, diverse cultures have contributed scientific knowledge and technological inventions. Changes in scientific knowledge usually occur as gradual modifications, but the scientific enterprise also experiences periods of rapid advancement. The daily work of science and technology results in incremental advances in understanding the world. \n\n \n Those who have advised us on this are some of the best scientists on the planet. They assure me that anythign that fits into the criteria above will fall under the category of \"natural\" regardless of how supernatural it may seem at the time. I admit, as I have before, that my own background in biology is slim. It is not something I have ever been interested in, nor is it anything that I have ever found useful in the real world. Pandion has used this to great advantage, trying to make me look like a fool who does not know what they are talking about. Bad news....I don't have to understand it. I don't have to know a damn thing about biology. That is what expert advisory boards are for. Do you think that Michael Dell actually knows as much about designing computers as this engineers? Of course not. He does not need to. \n \n At the end of the day, that is the only question that matters. You can run in loops all you want about the semantics of the thing, but when this hits the streets, the practical aspects are the only consideration.\n \n If you can come up with a realistic situation where all those conditions are met, and still a supernatural explanation survives, I might be convinced that your argument has some merit. Otherwise, we are both wasting our time becuase all we are arguing is your emotional state, which is a worthless argument at the best of times.\n \n As I said in my last post:\n \n \nAll I ask is that you show me a logic based argument as to why this change is negative in respect to our kids education. I am simply not seeing it.\n\n \n You have again made the argument that the changes are negative, and that it should be self evident. If it is self evident, you should have no trouble explaining it precisely.", 
   {
    "unicode_changes_made": true
   }, 
   179013, 
   null, 
   1131901560.0
  ], 
  [
   179058, 
   null, 
   "Howard Beale", 
   "Daewoo:\n \n Your verbose diatribe said little other than \"show me the how this is a step backwards.\" I have shown you what happens if you remove the phrase \"seeking natural explanations\" from the definition of science. You are so blinded that you will not acknowledge that it changes the definition in any way. I have shown you how it does. You believe that no longer limiting science to seeking natural explanations is no big deal. Anyone who understands language, especially governmental and legal word usage knows differently. I suggest you take the old Kansas Board of Ed definition of science and the new one to a contracts attorney and ask his opinion as to whether taking the phrase \"seeking natural explanations\" out of the definition affect the definition. I think it is your responsibility.", 
   {
    "unicode_changes_made": true
   }, 
   179045, 
   null, 
   1131906420.0
  ], 
  [
   179064, 
   null, 
   "daewoo", 
   "Daewoo:\n \n Your verbose diatribe said little other than \"show me the how this is a step backwards.\" I have shown you what happens if you remove the phrase \"seeking natural explanations\" from the definition of science. You are so blinded that you will not acknowledge that it changes the definition in any way. I have shown you how it does. You believe that no longer limiting science to seeking natural explanations is no big deal. Anyone who understands language, especially governmental and legal word usage knows differently. I suggest you take the old Kansas Board of Ed definition of science and the new one to a contracts attorney and ask his opinion as to whether taking the phrase \"seeking natural explanations\" out of the definition affect the definition. I think it is your responsibility.\n\n \n No, you need to show that it does. I have laid out my argument as to why it does not, namely because the rest of the definition is so stringent that removal of the word \"natural\" in no way changes the basic scope of the definition. \n \n Why would I take it to a contract attorney? It is not a legal document.\n \n I will take this as your concession. Obviously, despite your blustering, you are unable to find a single case to cite where a definiton of \"science\" not worded to specifically include \"natural\" as the former Kansas defintion did caused a leap to the realm of the supernatural, depsite the fact that 39 other states use similar defintions and in most cases have for years. You are not even able to formulate a hypothetical case.", 
   {
    "unicode_changes_made": true
   }, 
   179058, 
   null, 
   1131907380.0
  ], 
  [
   179065, 
   null, 
   "pandion", 
   "Creationists like Daewoo need to remove references to science seeking \"naturalistic explanations\" from the definition so that they can introduce spiritualism as part of science. This opens the door, and no matter how much they claim otherwise, this definition allows them to pretend that supernatural claims are legitimate science. Since \"creation science\" didn't work and got thrown out by the courts, the new attack is to try to create gaps in real science where they can cram their god.", 
   {}, 
   179064, 
   null, 
   1131907680.0
  ], 
  [
   179076, 
   null, 
   "Howard Beale", 
   "No, you need to show that it does. I have laid out my argument as to why it does not, namely because the rest of the definition is so stringent that removal of the word \"natural\" in no way changes the basic scope of the definition. \nThe fact that you believe that one definition limits exploration to \"natural explanations\" and the other does not and thereby opens the door to explanations other than natural ones, says it all. I cannot make someone open their mind, I can only request that. You decline the request. That is your prerogative.\n \n \nWhy would I take it to a contract attorney? It is not a legal document.\nWhy? Because you might learn something. But that is another thing you have declined to de. Obviously, you believe that you have little to learn. It is your right to believe whatever you chose to and to decline the opportunity to learn more than you already know.\n \n \nI will take this as your concession. \nYou can take it as whatever you chose. You seem to have a unique understanding of words.\n \n \nObviously, despite your blustering, you are unable to find a single case to cite where a definiton of \"science\" not worded to specifically include \"natural\" as the former Kansas defintion did caused a leap to the realm of the supernatural, depsite the fact that 39 other states use similar defintions and in most cases have for years. You are not even able to formulate a hypothetical case.\nI have shown you that deleting the phrase \"seeking natural explanations\" opens the door for explanations other than natural. There is also no specific reference to the scientific method. \n \n Let us try to take it step by step..\n \n The definition of science approved by the Kansas Board of Ed is: \"Science is a systematic method of continuing investigation that uses observation, hypothesis testing, measurement, experimentation, logical argument and theory building to lead to more adequate explanations of natural phenomena.\"  \n \n My position is that: There is no requirement that the \"observation, hypothesis testing, measurement, experimentation, logical argument and theory building\" mentioned in the definition be based on nature or natural law.  \n \n Do you agree that the statement is bold is an accurate finding based on the definition of science of the KBoE (Kansas Board of Education) with regards to the characterization of the explanations that are permitted under that definition?", 
   {
    "unicode_changes_made": true
   }, 
   179065, 
   null, 
   1131913140.0
  ], 
  [
   179105, 
   null, 
   "daewoo", 
   "\n My position is that: There is no requirement that the \"observation, hypothesis testing, measurement, experimentation, logical argument and theory building\" mentioned in the definition be based on nature or natural law.  \n \n Do you agree that the statement is bold is an accurate finding based on the definition of science of the KBoE (Kansas Board of Education) with regards to the characterization of the explanations that are permitted under that definition?\n\n \n \n No, I do not. The rest of the statement, \"observation, hypothesis testing, measurement, experimentation, logical argument and theory building\" disqualifies the supernatural. Go back, read it again, and then read the REST of the section, which FURTHER disqualifies the supernatural. \n \n I again ask you, for the 5th time, for a single hypothetical example that would follow the criteria in the rest fo the document, but still net you a supernatural answer. \n \n Why? Because the rest of those criteria, the criteria that must be met, are geared soley towards the natural world. There is no consideration for faith. If it can be tested, measures, repeated, etc.... then it MUST be a natural phenomenon. There is no other option.\n \n This is the final time I will ask for an example, then I will consider the topic closed. You have had plenty of time to come up with one. Surely there must be one out there, especially since, as was pointed out before, 39 states use similar wording. This means that tens, if not hundreds, of millions of children have been taught using a very similar defintion of science. \n \n Th simple fact of the matter is that you are focusing on two words while ignoring the rest of the statement, and the implications of that statement, and you are dead wrong in your conclusion.\n \n On your advise, I emailed a copy of this to my attorney. He is a former senator and one of the top business lawyers in the country (never pays to skimp on your attorney). He says you are nuts and that the removal of the word \"natural\" does nto significantly change the context of the statement. He may weigh in here in a bit. He is interested not in tthe thread, but in rumors that the changes are to be challenged in court. His primary interest is how an effective case could possibly be built around the miniscule changes, especially when nobody is willing to go on record thus far to challenge their factual accuracy. He was also interested in how a potential plantiff would manage to make a case given the fact that the kansas language is now CLOSER to the language used in the rest of the country.\n \n If you could dip into that briefly, it may be an interesting conversation. I, too am a little interested in this, as a school board member, since there is absolutly no mention of religon, or anything that would steer any potential student towards a religous conclusion. On what grounds do you feel a court might feel compelled to strike these changes, overruling the decisions of elected officials, and by proxy, the citizens they represent, when there is no factual basis for an argiument and the standards are, if anything, MORE strict than those found elsewhere in the country?", 
   {
    "unicode_changes_made": true
   }, 
   179076, 
   null, 
   1131918840.0
  ], 
  [
   179125, 
   null, 
   "Howard Beale", 
   "Daewoo:\n \n You disagreed with my statement: There is no requirement that the &#8220;observation, hypothesis testing, measurement, experimentation, logical argument and theory building&#8221; mentioned in the definition be based on nature or natural law.\n \n \nNo, I do not. The rest of the statement, &#8220;observation, hypothesis testing, measurement, experimentation, logical argument and theory building&#8221; disqualifies the supernatural.\nNo it does not. \n \n Do you deny that theRe are spiritual hypotheses?\n \n Do you deny that there are ongoing paranormal studies and observations?\n \n Do you deny that there is supernatural theory building?\n \n Do you deny that logical arguemnent is a basic tool of theological discourse?\n \n \nGo back, read it again, and then read the REST of the section, which FURTHER disqualifies the supernatural.\nI have. It does not.\n \n \nWhy? Because the rest of those criteria, the criteria that must be met, are geared soley towards the natural world. There is no consideration for faith. If it can be tested, measures, repeated, etc.... then it MUST be a natural phenomenon. There is no other option.\nProve it. Show me where the KBoE standards eliminate the possibilities of the above. Heading and page number of you please.", 
   {}, 
   179105, 
   null, 
   1131927600.0
  ], 
  [
   179140, 
   null, 
   "daewoo", 
   "Daewoo:\n \n You disagreed with my statement: There is no requirement that the &#8220;observation, hypothesis testing, measurement, experimentation, logical argument and theory building&#8221; mentioned in the definition be based on nature or natural law.\n \n Do you deny that theRe are spiritual hypotheses?\n\n \n I said I was done, unless you could provide an example, which you have not. Just to clear this up for you.\n \n Is there such a thing as a spiritual hypothesis? Of course there is. Now, you explain to me what kind of observations you would include in order to validate that hypothesis. What kind of testing? Measurement? \n \n whoops, does not fit the criteria.\n \n \nDo you deny that there are ongoing paranormal studies and observations?\n\n \n Of course there are, and what those people are doing is trying to bring paranormal investigation into the realm of \"science\". As far as I know, none have yet suceeded, becasue they lack the other components, including repeatable tests. \n \n \nProve it. Show me where the KBoE standards eliminate the possibilities of the above. Heading and page number of you please.\n\n \n ix\n \n \nScience is a systematic method of continuing investigation that uses observations, hypothesis testing, measurement, experimentation, logical argument and theory building to lead to more adequate explanations of natural phenomena.\n \n \n Noter it does not give the opition of picking and choosing which components you wish to use, as you have tried to do in your juvenile outburst above.\n \n \nScience does so while maintaining strict empirical standards and healthy skepticism. Scientific explanations are built on observations, hypotheses, and theories. A hypothesis is a testable statement about the natural world that can be used to build more complex inferences and explanations. A theory is a well-substantiated explanation of some aspect of the natural world that can incorporate observations, inferences, and tested hypotheses. \n\n \n Strict empirical standards\n \n \nScientific explanations must meet certain criteria. Scientific explanations are consistent with experimental and/or observational data and testable by scientists through additional experimentation and/or observation. \n\n \n MUST MEET CETAIN CRITERIA. There are a few of them. Here is another one:\n \n \nScientific explanation must meet criteria that govern the repeatability of observations and experiments.\n \n \n Wow. Must meet criteria that govern repeatablitly of observations and experiments. \n \n why?\n \n \nThe effect of these criteria is to insure that scientific explanations about the world are open to criticism and that they will be modified or abandoned in favor of new explanations if empirical evidence so warrants.\n \n \n \n \n Is that enough? Again, until you come back with an example, I am done here. It is abundantly clear that your argument is flawed, incorrect, and has essentially become little more than a hissy fit lacking any logical foundation.\n \n Give it up.", 
   {}, 
   179125, 
   null, 
   1131932760.0
  ], 
  [
   179146, 
   null, 
   "pandion", 
   "Is there such a thing as a spiritual hypothesis? Of course there is. Now, you explain to me what kind of observations you would include in order to validate that hypothesis. What kind of testing? Measurement? \n \n whoops, does not fit the criteria.\nBut that is the point. The IDers and the folks from the Discovery Institute claim that they are doing exactly that. The point is that they are claiming that ID should be presented as an alternative scientific theory. They have several bogus hypotheses and have developed algorythms by which they claim that they can detect design. Of course, all of this is about 10 years old and we have seen nothing new in several years, and no real scientific research at all. Nevertheless, IDers claim that supernatural explanations should be taught because they claim that they can detect the intervention of a supernatural being in biology.\n \n But you knew that, didn't you? You're just pretending not to see the problem.", 
   {}, 
   179140, 
   null, 
   1131934620.0
  ], 
  [
   179148, 
   null, 
   "Howard Beale", 
   "I said I was done, unless you could provide an example, which you have not. Just to clear this up for you.\nYou were the one who started this by posting inaccurate information. Now, when asked to address a specific aspect of the KBoE science standards, you avoided. In this post you make claims that are again inaccurate. I will step through it.\n \n I asked if you agreed with the statement: There is no requirement that the \"observation, hypothesis testing, measurement, experimentation, logical argument and theory building\" mentioned in the definition be based on nature or natural law.\n \n You said you did not agree because there were sections of the KBoE science standards that did require that the \"observation, hypothesis testing, measurement, experimentation, logical argument and theory building\" be based on nature, but you did not offer any evidence. I asked that you give me the evidence with page numbers. This is what you came up with.\n \n The first paragraph you site is from page ix. It is:\n \n\n Science is a systematic method of continuing investigation that uses observations, hypothesis testing, measurement, experimentation, logical argument and theory building to lead to more adequate explanations of natural phenomena. \nIn this paragraph, please show me the word, words, phrase or phrases that require \"natural explanations and only natural explanations be sought\". Point out the exact word, words phrase or phrases that require that these \"observations, hypothesis testing, measurement, experimentation, logical argument and theory building\" be limited solely to natural phenomena.\n \n The next paragraph you site is:\n \n\n Science does so while maintaining strict empirical standards and healthy skepticism. Scientific explanations are built on observations, hypotheses, and theories. A hypothesis is a testable statement about the natural world that can be used to build more complex inferences and explanations. A theory is a well-substantiated explanation of some aspect of the natural world that can incorporate observations, inferences, and tested hypotheses.\nI make the same request with regard to this paragraph: Please show me the word, words, phrase or phrases that require \"natural explanations and only natural explanations be sought\". Point out the exact word, words phrase or phrases that require that these \"observations, hypothesis testing, measurement, experimentation, logical argument and theory building\" be limited solely to natural phenomena.\n \n The next paragraph you site is:\n \n\n Scientific explanations must meet certain criteria. Scientific explanations are consistent with experimental and/or observational data and testable by scientists through additional experimentation and/or observation.\nI make the same request with regard to this paragraph: Please show me the word, words, phrase or phrases that require the so-called \"certain criteria\" include that \"natural explanations and only natural explanations be sought\". Point out the exact word, words phrase or phrases that require that these \"observations, hypothesis testing, measurement, experimentation, logical argument and theory building\" be limited solely to natural phenomena.\n \n The next paragraph you site is:\n \n\n Scientific explanation must meet criteria that govern the repeatability of observations and experiments.\nI make the same request with regard to this paragraph: Please show me the word, words, phrase or phrases that require the so-called \"certain criteria\" include that \"natural explanations and only natural explanations be sought\". Point out the exact word, words phrase or phrases that require that these \"observations, hypothesis testing, measurement, experimentation, logical argument and theory building\" be limited solely to natural phenomena.\n \n Your desire to run from the questioning of your inaccuracies is a strong indication of your agenda.", 
   {
    "unicode_changes_made": true
   }, 
   179146, 
   null, 
   1131937080.0
  ], 
  [
   179151, 
   null, 
   "daewoo", 
   "But that is the point. The IDers and the folks from the Discovery Institute claim that they are doing exactly that. The point is that they are claiming that ID should be presented as an alternative scientific theory. They have several bogus hypotheses and have developed algorythms by which they claim that they can detect design. Of course, all of this is about 10 years old and we have seen nothing new in several years, and no real scientific research at all. Nevertheless, IDers claim that supernatural explanations should be taught because they claim that they can detect the intervention of a supernatural being in biology.\n \n But you knew that, didn't you? You're just pretending not to see the problem.\n\n \n \n Ahhh, but you have led to an entirely different problem. IF they can come up with \"proof\" that actually meets that criteria, whether the worn \"natural\" is there or not will make no difference, because obviously if they can come up with an explanation that fits within that framework, it is obviously natural, even if it does involve god, aliens, or flying spaghetti monsters. That is because \"natural\" is a term that can be bent to suit almost any purpose. Gunpowder is \"natural\", it is sulphur, carbon, and saltpeter. All natural substances. Plastic is \"natural\" it is made out of oil, which comes right out of mother earth. What could possibly be more natural than that?\n \n If they want to try to \"prove\" intelligent design, let them try. The guy who disproved spontaneous generation was trying to prove that god was implanting the creatures there. Where would we be if he had not? The fricitonless air bearings we have today are bsed on the design of a guy who was trying to sell a perpetual motion machine. \n \n Whether the word \"natural\" is included or not is irrelevant to the argument.\n \n Besides, pandion, it seems liek you shoud REALLY be working to change the defintion of \"science\" in your home state bfore you declare that kansas is full of XXXXXX for lightening up ours.", 
   {}, 
   179146, 
   null, 
   1131937980.0
  ], 
  [
   179152, 
   null, 
   "daewoo", 
   "You were the one who started this by posting inaccurate information. Now, when asked to address a specific aspect of the KBoE science standards, you avoided. In this post you make claims that are again inaccurate. I will step through it.\n \n \n\n \n Like I said, no example, no debate. Your concession is noted.", 
   {}, 
   179148, 
   null, 
   1131938040.0
  ], 
  [
   179154, 
   null, 
   "Howard Beale", 
   "Like I said, no example, no debate. Your concession is noted.\nI understand that you do not want to respond to my last post. It would undermine your entire position. You start with inaccurate information bordering on lies, then claim that paragraphs you site support your position (which they don't) and when questioned about it, you raise distractions and cry \"No debate!\" and take your ball and go home.", 
   {
    "unicode_changes_made": true
   }, 
   179152, 
   null, 
   1131938700.0
  ], 
  [
   179157, 
   null, 
   "Howard Beale", 
   "Ahhh, but you have led to an entirely different problem. IF they can come up with \"proof\" that actually meets that criteria, whether the worn \"natural\" is there or not will make no difference, \nSorry, Daewoo, for a subject to be discussed in Kansas science classroom, there is no requirement of \"proof\" of any kind in the KBoE science standards. If I am wrong, site the paragraph and page number where \"proof\" is required.\n \n \nbecause obviously if they can come up with an explanation that fits within that framework, it is obviously natural, even if it does involve god, aliens, or flying spaghetti monsters. That is because \"natural\" is a term that can be bent to suit almost any purpose. Gunpowder is \"natural\", it is sulphur, carbon, and saltpeter. All natural substances. Plastic is \"natural\" it is made out of oil, which comes right out of mother earth. What could possibly be more natural than that?\nHowever the KBoE science standards does not state that science seeks natural explanations and there is no place in the publication that supports what you say.\n \n \nIf they want to try to \"prove\" intelligent design, let them try.\nThe same can be said if aspects of evolution. Some cannot be proven either. That is why it is a scientific theory, not a scientific fact. When you expand the definition of science beyond the seeking of natural explanations, then theories that seek other explanations can be introduced.\n \n \nThe guy who disproved spontaneous generation was trying to prove that god was implanting the creatures there. Where would we be if he had not? The fricitonless air bearings we have today are bsed on the design of a guy who was trying to sell a perpetual motion machine. \n \n Whether the word \"natural\" is included or not is irrelevant to the argument.\nIf science does not seek \"natural explanations\", it leaves open the possibility of explanations that are not natural, beyond natural, supernatural, etc.\n \n \nBesides, pandion, it seems liek you shoud REALLY be working to change the defintion of \"science\" in your home state bfore you declare that kansas is full of XXXXXX for lightening up ours.\nPerhaps he is. Perhaps he is not on a school board as you claim to be.", 
   {
    "unicode_changes_made": true
   }, 
   179154, 
   null, 
   1131939300.0
  ], 
  [
   179163, 
   null, 
   "Howard Beale", 
   "Woudl you like to take this over tot he formal debate forum? \nSure: \n \n Resolved:\n \n In the definition of Science on page ix of the Science Standards adopted by the Kansas Board of Education on November 8, 2005, there is no requirement that science seek &#8220;natural solutions&#8221; or that the &#8220;observation, hypothesis testing, measurement, experimentation, logical argument and theory building&#8221; be based on nature, natural phenomena or natural law.\n \n Or you could simply reply to my previous post and answer my questions and show me wrong.", 
   {}, 
   179154, 
   null, 
   1131941280.0
  ], 
  [
   180169, 
   null, 
   "beervolcano", 
   "Hi there! Upon reading this thread I decided to sign in an post some information. There's a slim chance I might return to this site, but probably not. I think it's a good idea to post some things that might clear things up on this thread or it might make it even more confusing. The new Kansas School Board standards does exclude the term \"natural explanations\" as seen on page 10. A newsletter sent out by state School Board member, Connie Morris, seems to indicate that the new standards are in response to the teaching of evolution and would also lead one to believe that the motivations behind the change are religious. \n \n William Demski calls the recent ruling in Kansas The evolution ruling and also says that there is progress in Kansas for ID since evolution had a \"setback.\"\n \n Daewoo's argument on this issue seems to mirror that of the Discovery Institute. \n \n This is a very interesting case for me. So far, I can't decide if it really is just media sensationalism or since the changes in the Kansas standards are indeed religioulsy motivated, that there is more to it than that.", 
   {}, 
   179163, 
   null, 
   1132353180.0
  ], 
  [
   180199, 
   null, 
   "Howard Beale", 
   "beervolcano:\n \n First, love your handle.\n \n Second, thanks for the info. Hope you find time.", 
   {}, 
   180169, 
   null, 
   1132358580.0
  ], 
  [
   180964, 
   null, 
   "pandion", 
   "ID will be taught at KU, but IDers aren't happy about it.\n \n KU class angers 'design' advocates", 
   {
    "post_info": {
     "post_title": "Kansas IDers are very upset"
    }, 
    "unicode_changes_made": true
   }, 
   180199, 
   null, 
   1132706940.0
  ], 
  [
   180966, 
   null, 
   "trebor", 
   "ID will be taught at KU, but IDers aren't happy about it.\n \n KU class angers 'design' advocates\n\n \n Yes, I saw that on CNN. I was quite amused", 
   {
    "unicode_changes_made": true
   }, 
   180964, 
   null, 
   1132708860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Kansas School Board OKs Evolution Language", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6804-kansas-school-board-oks-evolution-language.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 6804, 
  "discussion_files": [
   [
    "8496.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6804-kansas-school-board-oks-evolution-language-print.html"
   ], 
   [
    "8497.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6804-kansas-school-board-oks-evolution-language-7-print.html"
   ], 
   [
    "8498.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6804-kansas-school-board-oks-evolution-language-5-print.html"
   ], 
   [
    "8499.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6804-kansas-school-board-oks-evolution-language-4-print.html"
   ], 
   [
    "8500.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6804-kansas-school-board-oks-evolution-language-6-print.html"
   ], 
   [
    "8501.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6804-kansas-school-board-oks-evolution-language-3-print.html"
   ], 
   [
    "8502.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6804-kansas-school-board-oks-evolution-language-2-print.html"
   ]
  ], 
  "identifier": 6804
 }
]